{
  "title": "The Last Life",
  "description": "Claire Messud's piercing second novel asks questions most are too fearful to face. Moving between the South of France, the East Coast of the U.S., and Algeria, The Last Life explores the weight of isolation and exile in one French family. Of course, the adjective French is already inadequate, as at least some of the LaBasses still long for the paradise lost of Algeria. And Alex LaBasse's wife, Carol, try as she might with her Continental impersonations, will always be an American sporting a metaphorical twin set. The narrator, Sagesse, too, soon finds herself equally stranded. Only her autocratic grandfather, Jacques, is ostensibly comfortable with the identity he has wrought: successful owner of the Bellevue Hotel and head of his dynasty. It is thanks to this man that 14-year-old Sagesse comes to crave invisibility. Having lost all of her friends, she sees herself as \"a member of the Witness Protection Program, surrounded by an odd human assortment chosen only for the efficiency of disguise; but somehow, nevertheless, inescapable.\"The cause of this loss? Jacques, fed up with Sagesse and her pals' late-night noise at the hotel pool--or perhaps with their failure to take him seriously--shoots at one girl. This incident ruptures life for each LaBasse, the Bellevue no longer \"their bulwark against absurdity.\" Looking back on the crucial two years following the patriarch's \"target practice,\" Sagesse possesses both a teenager's slant self-interest and an older, acute eye for the mechanisms of shame. The Last Life is that rare thing, a fast-moving philosophical novel masquerading as a bildungsroman. In her efforts at identity and affection, its heroine is increasingly alive to the subterfuges of narrative, forcing herself to sort through versions of reality. Her grandmother, for instance, relates one myth about her husband, only to have Carol undercut it entirely. And Sagesse herself can't figure out whether Jacques is \"sentimental or heartless.\" What if both, she realizes, are possible?As Messud's narrator navigates her way through the past--and the Algerian sections are among the book's most extraordinary--there is everything to savor in her wavelike sentences, many of which possess a dangerously witty undertow. And the scenes of familial tedium are the opposite of tedious. The dialogue snaps with subverted emotion, anxiety, and irony. At one of the LaBasses' bleaker fests, much is made of the mouna, a special (if dry) Algerian cake. Nonetheless, the grandmother does her best to fob it off at evening's end. \"I've never cared for it myself, although it's a lovely memory.\" Retrospect, as Sagesse realizes, is \"a light in which we may not see more clearly, but at least have the illusion of doing so.\"",
  "genres": [
    "Fiction",
    "France",
    "Contemporary",
    "Coming Of Age",
    "Literary Fiction",
    "Novels",
    "Algeria"
  ],
  "author": "Claire Messud",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/3649.The_Last_Life"
}