{
  "title": "Othello",
  "description": "Othello, by William Shakespeare, is part of the Barnes & Noble Shakespeare series.  This unique series features newly edited texts prepared by leading scholars from America and Great Britain, in collaboration with one of the world’s foremost Shakespeare authorities, David Scott Kastan of Columbia University. Together they have produced texts as faithful as possible to those that Shakespeare wrote. Each volume in the Barnes & Noble Shakespeare includes:New Scholarship – Premiere scholars introduce each play with contemporary scholarship. An essay on editing the text provides an in-depth look at the quartos and folios used in the edition.Contextualizing Essays – Essays on Shakespeare’s England, language, and life, along with essays on performing Shakespeare and significant performances frame the play in both historical and theatrical context for readers. A look at the lasting influence of the play on music, art, film, and dance creates an interdisciplinary framework with which to approach the play.Better Notes – Through one-word margin definitions, facing-page glosses, and longer end notes after the play, our innovative approach to notes pulls readers away from the text fewer times while providing them with more information and comprehensive analysis.Further Reading – An annotated bibliography of titles, hand-selected by the introduction author, takes readers beyond the edition for further reading. One of Shakespeare’s greatest tragedies, Othello’s portrayal of jealousy and deception remains as shocking today as when it was first written. The editor, Daniel Vitkus, provides an illuminating context for the play, meticulously reconstructing how Shakespeare’s audience might have perceived a tragedy with a black protagonist.",
  "genres": [
    "Classics",
    "Plays",
    "Fiction",
    "School",
    "Literature",
    "Theatre",
    "Read For School"
  ],
  "author": "William Shakespeare",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1219908.Othello"
}