{
  "title": "Love's Thankful Heart",
  "description": "Gingerbread Wishes  As Thanksgiving approaches, Becca Troyer finds herself overwhelmed with an abundance of winter squash and pumpkins that she isn’t a bit thankful for. Desperately trying to sell them at a farmer’s market so she won’t have mountains to can, she’s surprised when a mime drops to his knee in front of her and proposes marriage.  Yost Miller is helping the volunteer firefighter raise funds at the city park when he notices his long-time crush Becca selling vegetables. Drawn across the grass, he spontaneously proposes marriage. But afterward, Yost isn’t sure how to proceed to show her that his feelings are real.  Just as he begins to find solid footing, confidence is yanked away, leaving him floundering. Will he lose Becca to another man? Or will this Thanksgiving be a season of blessings and wishes come true?  Thanksgiving Strangers   Faithe Beiler believes God wants her to feed the poor at her family’s restaurant, but when she mistakes Crist Petersheim for a homeless man and gives him a free breakfast, he’s offended. Yet he can’t help being intrigued by this pretty waitress with a giving heart.  Crist blames God for the tragedies in his life, so the last thing he wants is to get involved with an Amish girl, who trusts God in all circumstances. He fears for Faithe’s safety, though, when she invites every homeless person in the neighborhood, including drug dealers and criminals, to a free Thanksgiving dinner. Street savvy, Crist risks his life to protect her from danger.  As Crist’s heart softens toward God, Faithe finds herself falling him. Then she discovers his deception, and her world is shattered. Can she ever trust him again?  The Thanksgiving Frolic  Monroe has the prettiest girl and the fastest horse— but pride goes before a fall.  Monroe’s girlfriend, Rosemary, and her family organize the Thanksgiving Frolic, a service project to help Amish folks who have fallen on hard times. Monroe wants to go along but his dad won’t let him. Furthermore, Monroe’s dad thinks Rosemary’s family should clean up their own messy farm before they try to help others. Will the contrast between Monroe’s and Rosemary’s families end their relationship for good? Rosemary’s grandpa tries to offer words of wisdom, but people don’t take him seriously. The Thanksgiving Frolic heats up to a fever pitch, before a moment of silence changes everything.",
  "genres": [
    "Amish",
    "Romance",
    "Anthologies",
    "Novella"
  ],
  "author": "Laura V. Hilton",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/36489665-love-s-thankful-heart"
}