{
  "title": "Io, Lauro e le rose",
  "description": "Tre amici e le loro bravate, l’ingenuità, il sogno, l’incoscienza, la malattia, l’omosessualità, gli abusi e “la morte che pone fine a una vita, non a una relazione”. Due registri diametralmente opposti, il giorno e la notte, la gioia e il dolore, scandiscono il ritmo e le sensazioni. Il primo all’insegna dell’adolescenza, dei giochi, la spensieratezza, o presunta tale, e un viaggio che segna la fine di un’epoca. Il viaggio più strampalato e impraticabile cui si possa ardire. L’altro registro assume toni e circostanze drammatiche e anche l’inesorabile e lento spegnersi del protagonista finisce in secondo piano spodestato dai racconti della sua adolescenza. Il progressivo disvelarsi dell’omosessualità di Raffaele si impossessa della scena ma le scoperte circa la sua malattia e la sua convivenza con don Peppino, benefattore incontrato all’oratorio del Santuario della Madonna di Pompei, rubano la scena e infittiscono la trama. L’ordine cronologico non viene rispettato. Raffaele racconta, e chiede di raccontare, avvenimenti assolutamente disparati nei toni, nei tempi e nelle ambientazioni. Il suo umore e le sue condizioni fisiche la fanno da padrone. Il tempo stringe e non intende terminare il suo viaggio terreno tormentato da rimorsi e rimpianti. Nulla vorrebbe fosse indiviso, incompiuto. Dove può, mette rimedio, ma alcuni avvenimenti non dipendono dalla sua sola volontà e così la madre, sorda e tracotante, incapace di accettare la sua natura, nulla compie nonostante il richiamo disperato del figlio morente la vorrebbe al suo capezzale. Un romanzo d’Amore. E non si intenda quello che alberga tra uomo e donna o tra persone dello stesso sesso. Si narra anche dell’amore che lega indissolubilmente le vite di tre amici, amici da bambini e fin all’ultimo respiro, dell’amore incredibilmente incompiuto, non corrisposto, tra una madre e un figlio, dell’amore per un fratello e per una sorella. Dell’amore per “l’uomo dei due sogni” e l’escamotage che finge utilizzare il protagonista attuando una fuga al fine di raggiungere il più grande calciatore di tutti i tempi all’alba della finale dei mondiali di “Mexico ‘86”, dell’amore per padri assenti e silenti, dell’amore che resta comunque e sempre più forte della morte.",
  "genres": [],
  "author": "Mario Artiaco",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/36496812-io-lauro-e-le-rose"
}