{
  "title": "God's Jury: The Inquisition and the Making of the Modern World",
  "description": "“The Inquisition is a dark mark in the history of the Catholic Church. But it was not the first inquisition nor the last, as Cullen Murphy shows in this far-ranging, informed, and (dare one say?) witty account of its reach down to our own time, in worldly affairs more than ecclesiastical ones.” — Margaret O’Brien Steinfels, former editor, CommonwealThe Inquisition conducted its last execution in 1826 — the victim was a Spanish schoolmaster convicted of heresy. But as Cullen Murphy shows in this provocative new work, not only did its offices survive into the twentieth century, in the modern world its spirit is more influential than ever.God’s Jury encompasses the diverse stories of the Knights Templar, Torquemada, Galileo, and Graham Greene. Established by the Catholic Church in 1231, the Inquisition continued in one form or another for almost seven hundred years. Though associated with the persecution of heretics and Jews — and with burning at the stake — its targets were more numerous and its techniques more ambitious. The Inquisition pioneered surveillance and censorship and “scientific” interrogation. As time went on, its methods and mindset spread far beyond the Church to become tools of secular persecution. Traveling from freshly opened Vatican archives to the detention camps of Guantánamo to the filing cabinets of the Third Reich, Murphy traces the Inquisition and its legacy.With the combination of vivid immediacy and learned analysis that characterized his acclaimed Are We Rome? , Murphy puts a human face on a familiar but little-known piece of our past, and argues that only by understanding the Inquisition can we hope to explain the making of the present.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Politics",
    "Christianity",
    "European History",
    "Historical"
  ],
  "author": "Cullen Murphy",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/12198515-god-s-jury"
}