{
  "title": "The Mountain Throne",
  "description": "The Mountain Throne is the first book of the Sindathi Twilight trilogy, set in the fantasy world of Urrael. Two decades in the making, this world is well-developed and realistic, with histories, languages, calendars, professions, and cultures that bring it to life. The Plot: Aged Emperor Thelden III Arrigar's last days are approaching and the Empire's leaders are taking sides in a struggle for power between rival heirs. Blood runs in the streets and the nights are thick with intrigue. Drake Arrigar, bastard prince and half-blooded sorcerer. Darius of Lorradon, foreign-born Initiate of a holy order of warriors sworn to the Empire. Leasha, senior maiden and chief spy for the Emperor's daughter. These three unlikely friends must navigate the coming storms as plots, violence, and unholy barbarians tear their lives apart. Their trials, failures, and triumphs will have far-reaching consequences, for their people and for their own futures. Characters and Theme: As rich as the world is, the story is ultimately about its characters and their choices. The book follows three protagonists, each with distinct themes. Drake's story is one of self-mastery and discovery, of unlocking the arcane secrets that only one of his kind can understand and struggling to come to terms with an unrealizable birthright.  Darius's is one of internal conflict, investigation, and corruption. As a Champion of Ryack, patron deity of the Empire and defender of the weak, what sacrifices is he willing to make to support and protect his Emperor? What deaths are acceptable? What crimes? And at what cost to his own immortal soul?Leasha's is a tale of treachery: secrets, lies, and espionage. A young woman trapped as a pawn of courtly intrigues, she must use her wits, beauty, and ruthless political mind to extract herself and wreak vengeance upon those who wrong her.  The World of Urrael: It is a world where sorcerers obtain their powers by stealing it from the divine realm and channeling it through their own souls. They pay for this by suffering persecution by priestly powers for their blasphemous theft and by hearing strange disembodied voices in their minds, spoken by demons of the other world through their tainted souls.  The continent upon which the story focuses, Terryth, is dominated by a great empire that arose by conquest, but is now weakened by decadence, mismanagement, and corruption. Barbarians, rebels, and enemy nations test its defenses, waiting for the Imperial dynasty to stumble. Its defenders must decide what crimes they are willing to commit to save it, or abandon it to the chaos of revolution or civil war. The uncertainty in the Empire feeds intrigues as powerbrokers and political rivals fight for the greatest shares of power. Falsehoods, betrayals, and poisonous plots abound and even maidens of the court cannot escape.",
  "genres": [],
  "author": "A.M.  Sterling",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/36504212-the-mountain-throne"
}