{
  "title": "Limitless Torment",
  "description": "Trigger Thinking I’d eventually have it all, f*cked me more than accepting I’d be no more than the ridiculous biker whose only gift was causing havoc on my brothers. I’ve had my eyes set on Sadie since I realized a boner wasn’t a medical condition, but one hell of a good time. She was it for me. After nine years of chasing and three years of being her buddy behind closed doors, she gave me the proverbial boot. I suppose I shouldn’t have taken life with a grain of salt and realized we’d have nothing more than a good time in the bedroom and a few laughs with friends. She was it for me…or so I thought. Razz Thinking I’d have the life I always dreamed of by the time I turned twenty-five and having the exact opposite could discourage a weaker woman, but not me. I don’t have the dream job, the house with the picket fence or the kids to fill the backyard with laughs, but I do have two steady incomes, an apartment I share with my best friend and a healthy sex life. What more could I ask for? I wanted him. After watching the boy I grew up with gradually turn into a man, my crush knew no bounds. He never really saw me. I was just the girl who he picked on and took up for when anyone but him picked on me. I was the girl on the sidelines watching him fall madly in love with a woman who never returned the gesture. Now she’s devastated his life and made him second guess himself. Now I’m the one he wants to fall back on but I’ve been there done that and got the scars on my heart to prove it. He was blind but now he sees, but that’s not enough for me to let him heal the wounds that he’s inflicted. This book ends in a cliffhanger, but you don't have to wait for the conclusion of Razz and Trigger's story as Sublime Vanity is available, but to better understand some of the situations you should read Minor Glitches, Major Conflict and Immense Tension. This book is meant for an audience 18 and older. There are some scenes that may not be suitable for some readers. ***Re-edited 06/2018***",
  "genres": [],
  "author": "Dana Arden",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/36507701-limitless-torment"
}