{
  "title": "Soul Guide On Planet Earth",
  "description": "Librarian's note: See alternate cover edition of ISBN 1978043945 here.A completely new review of the soul is now derived from a common inheritance of the ancient heritage and mysticism, as well as the personal experiences of the author, the practice of hypnotic regression and discoveries of quantum physics that only in the presence of a conscious observer - the soul - the matter takes a form of a physical reality as it is known to us. All the activities of the soul that have an impact on man's life, from life-saving interventions of the soul events in everyday life, inspiration to the spiritual work and creativity that is the basis of human civilization. Souls as the carriers of intelligent design in nature. Communication between the mind and the soul. A detailed description of the reasons for obsession as a \"loss of soul\". The evil in the world and the goodness of the soul. Self-realization, resurrection or enlightenment as the knowledge of the divine nature of the soul while still in the body. The discipline of meditation as a practice of self-realization of the soul. CONTENTS - Introduction - The origin, or where we come from - The manifestation of everything through seven phases or proportions - Manifestation of everything through five dimensions - Human body as the outcome of the manifestation of all the dimensions and proportions - The dual nature of the emanation of God: the oblivion and the awakening - Organic life as the foundation of the human body - Human body as the foundation of personality - The complete personality as the foundation of the soul - The organic world as the stage for the drama of the personality - Personality as the personification of the Divine - Divine as the foundation of the soul - The presence of the Divine as a testimony- The mechanical manifestation of the organic world - The manifestation of the organic world as the basis for consciousness - The circle of creation: inorganic world, organic world and man - On the incarnation of souls before the organic life on Earth - The division of souls: the young, developed and highly developed - Souls get ready for a human life shaping all other forms - Soul being born in a body - The beginning of oblivion - Communication between mind and soul - Why the soul is always good - Why some people are not good - The decline of soul - the opposite point on the circle of Divine manifestation - Some of the characteristics and problems of young souls - Some of the characteristics and problems of medium developed souls - Some of the characteristics and problems of the highly developed souls - Some of the observations of the young, medium and the highly developed souls - Everyday life of Bringers of the dawn - Planets condition the organic world - Soul and karma - Soul and science - Soul and religion - Three kinds of work: physical, intellectual and intending - Work on oneself - Man's testimony of the presence of the Divine",
  "genres": [],
  "author": "Ivan Antic",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/36509670-soul-guide-on-planet-earth"
}