{
  "title": "Blade & Rose",
  "description": "She trusted him once.He betrayed her twice.A third time could bring an entire kingdom to its knees…Stuck in a betrothal to a cruel werewolf fiancé, Rielle works for the Divinity of Magic, the one thing keeping her from his claws. And the head of the Divinity knows it, giving her every mission no one else wants and few can handle. When an enemy of the Divinity invades their walls, someone needs to frogmarch him home, with no detours. No mage would ever want to handle a magic-nullifying knight… So, of course Rielle is assigned to do it.The way to their destination is rife with danger—a civil war is brewing, and tangled somewhere in it is Rielle’s best friend, Olivia. When whispers reveal mercenaries have killed the king, taken the capital, and that no one is coming to help, Rielle can’t leave Olivia in peril. But as infamous mages and deadly assassins hunt her holy knight charge, she can’t leave him unprotected either—especially as she finds herself falling for his strength, his passion, and his uncompromising goodness...Her past returns to haunt them, her werewolf fiancé stalks their steps, and an ancient evil is gathering, yet the restraints forbidding their love strain and snap one by one. Can they overcome the war in their way, or will trusting a two-faced ally tear them apart, and leave Olivia and an entire besieged kingdom to fray at the ends...?Readers who loved A Court of Thorns and Roses and From Blood and Ash will cheer on this heroine who never gives up, in the first book of a heart-wrenching romantic epic fantasy series.Welcome to a medieval world sensual and dark, full of magic and greed, love and blades, where factions vie for influence and there are no easy choices...",
  "genres": [
    "Fantasy",
    "Romance",
    "Fantasy Romance",
    "Magic",
    "High Fantasy",
    "New Adult",
    "Young Adult"
  ],
  "author": "Miranda Honfleur",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/36505619-blade-rose"
}