{
  "title": "Over My Wed Body",
  "description": "Bride, Texas Series (Book 5): When Bailey learns that her longtime crush botched the annulment from their drunken night in Vegas, can she make him see that she and their marriage are worth fighting for?  NOTE FROM THE PUBLISHER: this is a sweet romance but does contain mild cursing.  Growing up, Bailey idolized her brother’s best friend, Hunter. Against her better judgment, she lost her heart to the wild cowboy anyway. But he’d kicked off the dust of their small Texas hometown for big city life, leaving her behind. When they end up in an alcohol-induced Vegas marriage—that Hunter quickly annuls—Bailey returns home crushed and humiliated.  Now Hunter is back, and Bailey is forced to accept his help to save her family’s ranch. Worse, a paperwork error means they’re still married. Fueled by the desire to be free of him so she can heal, she’s completely unwilling to have anything to do with him. But how can she get over him when he’s working so hard to win back her friendship?  Hunter has to undo the unfortunate marriage before his best friend learns what he did with Bailey. More importantly, he must make things right with Bailey—who isn’t cooperating at all. Hunter can’t risk losing the two most important people in his life, Bailey and her brother. But because of Hunter’s growing attraction to her, he’s more confused than ever. And now he’s in danger of losing his heart too.   EXCERPT:   Bailey sat on a stool at the kitchen’s island counter in front of a platter of fried chicken, scrolling through her phone. Good chance she was shopping for supplies. I’d rarely seen her not working since I’d arrived in Bride.  “You’ll ruin your appetite for dinner.”  Bailey jolted, dropping a leg of chicken and spinning on the stool. “You scared me. Too hungry to wait another hour.”  “Same here.” I intercepted the chicken leg as she raised it toward her lips and then I sunk my teeth into it.  Bailey’s eye twitched. “Nice manners. I was eating that.” She reached for the plate of chicken and chose a wing. I snagged that too, wrestling it from her hand. She slipped off the stool and threw a punch at my bicep. She used to always playfully beat on me.  “You want it?” I smashed the chicken leg on her face, smearing chicken fat around her mouth and coercing her lips apart.  She belly-laughed, throwing punches faster than I could dodge them. “Such a jerk.”  Jerk, yes. But she was laughing again. With me. I reached for a fresh drumstick and jammed that at her face too, swiping it across her cheek.  She crammed a wing into my nose, mainlining the spices and grease directly into my nostril. Her eyes lit with a familiar mischief before she squished the chicken into my hair.  This was war. And, what the hell, I needed a shower anyway.  I shoved her against the counter, about to stuff the chicken leg down the front of her shirt and froze, my gaze locking onto the creamy swells at her neckline. Her chest rose and fell with each pant and my gaze met hers. She licked her lips, then focused on my mouth.  Not one to let a perfect opportunity pass, I seized the moment and leaned in.    Grab this sweet romance set in the heart of Bride, Texas and fall for the town and its residents with every page.",
  "genres": [],
  "author": "Veronica Blade",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/36507168-over-my-wed-body"
}