{
  "title": "Boy's Life",
  "description": "An Alabama boy’s innocence is shaken by murder and madness in the 1960s South in this novel by the New York Times–bestselling author of Swan Song. It’s 1964 in idyllic Zephyr, Alabama. People either work for the paper mill up the Tecumseh River, or for the local dairy. It’s a simple life, but it stirs the impressionable imagination of twelve-year-old aspiring writer Cory Mackenson. He’s certain he’s sensed spirits whispering in the churchyard. He’s heard of the weird bootleggers who lurk in the dark outside of town. He’s seen a flood leave Main Street crawling with snakes. Cory thrills to all of it as only a young boy can.   Then one morning, while accompanying his father on his milk route, he sees a car careen off the road and slowly sink into fathomless Saxon’s Lake. His father dives into the icy water to rescue the driver, and finds a beaten corpse, naked and handcuffed to the steering wheel—a copper wire tightened around the stranger’s neck. In time, the townsfolk seem to forget all about the unsolved murder. But Cory and his father can’t.   Their search for the truth is a journey into a world where innocence and evil collide. What lies before them is the stuff of fear and awe, magic and madness, fantasy and reality. As Cory wades into the deep end of Zephyr and all its mysteries, he’ll discover that while the pleasures of childish things fade away, growing up can be a strange and beautiful ride.   “Strongly echoing the childhood-elegies of King and Bradbury, and every bit their equal,” Boy’s Life, a winner of both the Bram Stoker and World Fantasy Awards, represents a brilliant blend of mystery and rich atmosphere, the finest work of one of today’s most accomplished writers (Kirkus Reviews).",
  "genres": [
    "Horror",
    "Fiction",
    "Fantasy",
    "Mystery",
    "Coming Of Age",
    "Historical Fiction",
    "Magical Realism"
  ],
  "author": "Robert McCammon",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/36505403-boy-s-life"
}