{
  "title": "Planet of Sex",
  "description": "Rachel Brighton isn't your average civil servant. She's a sexual ambassador for the human race. It's not a bad job, if you don't mind prudes calling you a \"star slut.\" The year is 2030 and the aliens have landed, but they don't want to rule the planet. They want to woo it. An insidious plague has rendered human women the last fertile females in the galaxy, and transformed Earth into its number one mating destination. After rounding up the male population, the aliens make a deal with the new female-led Teach us how to make love to human women and we'll return your men.Rachel used to think nothing on Earth could satisfy her weird desires. But Earth, and her libido, are no longer alone in the universe. To save the human race, to save the aliens, she'll embark on a journey of erotic discovery. This tale of interstellar sex is 20,000 words and for readers 18 and up.~~~~~ Excerpt ~~~~~He made a sound in the front of his mouth that I realized was a chuckle. \"Are you considered attractive among your people?\" he asked.\"I wouldn't be here if I wasn't.\"His ears twitched. He leaned lower to gaze into my eyes. \"I cannot say that I find you attractive in the manner of my people,\" he said, \"but I understand why you were chosen for this position. How do I describe this feeling? I find you...is the word 'cute' appropriate?\"I nodded. \"There's a few ways I can take that, most of them complimentary.\"Cautiously, Aurelias raised his upper left hand and swept his large fingers through my hair. \"And you smell pleasant,\" he said. \"Our females did not apply artificial scents.\"\"But you have your pheromones.\"\"Yes,\" he said, \"and they are effective. Still, I enjoy the smell of jasmine as much as the next creature.\" His eyes moved over my body, curiosity tugging at the corners of his lips. \"And this is part of human flirtation? The looks you were giving me in the meeting, the gentle pressure of your hand on my knee?\"\"What do you think?\"All four of his wrists turned up, his palms to the sky. \"I have another question. Was your job always as complicated as this?\"\"Actually...\" I reached for his chin and gently pulled it down to my eyes. \"I was a teacher.\"\"How strange, and how fitting. A position that requires patience and a desire to impart knowledge. A nurturing instinct. The ability to work within an established system. Such traits are perfectly suited to a human emissary, but--\"\"But it's not the whole story,\" I said. I slid my palms up his long jaw, enjoying the sleekness of his sea foam skin. I pulled him lower, down to me, and planted a soft kiss on his lips.Aurelias reared back, astonished. \"Was that a kiss?\" he asked.\"A very chaste one,\" I said.The Hisanian licked his lips. \"I confess that I find myself more attracted to you the more you speak, or perhaps I am simply eager to begin this strange act.\" He seemed puzzled by his own impatience. \"Forgive me,\" he said, after a moment. \"I have not copulated since my wife was taken by the plague. I had thought my will more than adequate to restrain me but...you are extremely fertile.\"\"Your wife, how long ago did it happen?\"\"The same time it struck all our females. They went quickly, which is our only solace.\"\"I'm sorry,\" I said.He cocked his head. \"Why?\"I shrugged. \"It's what we say. It's a brief way of showing respect for your loss.\"\"That is kind,\" he said. \"I do not know what she would think of this state of affairs. We are a proud race and do not easily change. She was...traditional.\"\"I'm not,\" I said.Aurelias smiled and, slowly, gracefully, returned to his full height. He gazed down at me and ruffled his mane. \"Much of the League was surprised by the adaptability of your species. Not the men, of course. They behaved as expected. You, however, are an exemplar of your gender.\"\"Would you like me to show you how much?\" I asked.",
  "genres": [],
  "author": "Veronica Sloan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/36511663-planet-of-sex"
}