{
  "title": "Remember Me Like This",
  "description": "Incisive, haunting, and beautifully written, Bret Anthony Johnston’s debut novel lays bare a family’s hope and heartbreak in the aftermath of a devastating crime. Remember Me Like This explores the nature of love and forgiveness when a kidnapped son is returned home.  Advance praise for Remember Me Like This\n \n “It is as a writer that I admire the architecture of Remember Me Like This, the novel’s flawless storytelling. It is as the father of three sons that I vouch for the psychological authenticity of this depiction of any parent’s worst fears. Emotionally, I am with this family as they try to move ahead—embracing ‘the half-known and desperate history’ that they share. I love this novel.”—John Irving   “In this deeply nuanced portrait of an American family, Bret Anthony Johnston fearlessly explores the truth behind a mythic happy ending. He presents an incisive dismantling of an all-too-comforting fallacy: that in being found we are no longer lost.”—Alice Sebold   “You could say that this book is ripped from the headlines, but that wouldn’t be fair. Bret Anthony Johnston’s riveting novel picks up where the tabloids leave off, and takes us places even the best journalism can’t go. Remember Me Like This is a wise, moving, and troubling novel about family and identity, and a clear-eyed inventory of loss and redemption.”—Tom Perrotta   “In Remember Me Like This, Bret Anthony Johnston paints a brilliantly rendered portrait of a family in the aftermath of trauma. Beautifully crafted and so suspenseful you cannot look away, this is a novel as much about what is hidden as what is revealed; the balancing act is nothing short of masterly.”—Jill McCorkle   “Both devastating and transporting, this is the rare novel a reader lives in, so persuasive is the impact, the insight, the heat of south Texas.”—Amy Hempel   “This mesmerizing story of loss and redemption on Texas’s Gulf Coast will take you in and hold you and not let go until it’s done with you, leaving you wiping at your eyes with the kind of soul-gratitude that comes only after experiencing true art.”—Andre Dubus III",
  "genres": [
    "Fiction",
    "Mystery",
    "Book Club",
    "Thriller",
    "Suspense",
    "Family",
    "Contemporary"
  ],
  "author": "Bret Anthony Johnston",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/36513687-remember-me-like-this"
}