{
  "title": "Rumor Has It",
  "description": "This is one bad boy who’s fit to print. A notorious jock tackles life—and love—after football with a type-A journalist in this sexy standalone from the author of Eye Candy.   \nBarrett:\n As a former pro football star, I’m used to playing the field. After injuries cut my NFL career short, my second act as a broadcaster ended on live television when a hot mic picked up a little verbal . . . indiscretion. But this latest publicity stunt might just land me back on top—much to the chagrin of Catarina Everhart, the prissy, beautiful journalist who’s been assigned to date a bad boy (i.e., me) and write about it. Catarina swears I’ll never touch her, let alone kiss those full lips of hers. Based on our chemistry, I’m not buying it. . . .   Catarina: Barrett Fox seems to be doing everything in his power to make me hate him. The cocky egomaniac is infamous for his bad behavior, and now, thanks to my boss’s harebrained schemes, he’s apparently my problem. As one fake date leads to another, I start to see a different side of Barrett. He’s close with his family. He does volunteer work. And, okay, he kisses like a dream. Am I really dating Barrett Fox? Or is he playing me? Because suddenly I’m risking my reputation—and my heart.   Look for Jessica Lemmon’s standalone romances with heartfelt HEAs: FIGHTING FOR DEVLIN | FORGOTTEN PROMISES | SHUT UP AND KISS ME | EYE CANDY | ARM CANDY | MAN CANDY | RUMOR HAS IT   “The banter made me grin, the sexual tension had me breathless, and the perfect happy ending left me smiling long after the book was done.”—New York Times bestselling author Lauren Layne, on Eye Candy   “This book had a very Christina Lauren feel to it. Very witty, sexy, and kept me wanting more with every page. I absolutely loved it.”—USA Today bestselling author Sidney Halston, on Eye Candy   This standalone novel includes an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Audiobook",
    "Sports",
    "Adult",
    "Sports Romance"
  ],
  "author": "Jessica Lemmon",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/36519058-rumor-has-it"
}