{
  "title": "The Alien's Touch",
  "description": "Welcome to Luxiria, where the twin suns are hot and the alien warriors are hotter…  Cecelia has always rolled with life’s punches. Growing up in a broken home? Check. Cancer? Check. Getting rescued from a human trafficking ring by massive, horned alien warriors and getting transported to their planet? Triple check. But when her cancer returns, light years away from Earth, Cecelia knows that she needs her rescuers’ help—except that help comes in the form a sexy, pierced, ruthless warrior who thinks she’s his…  Ambassador Rixavox, one of the fiercest war generals on Luxiria, is no stranger to the carnal delights of females. Many, many females. Never in his wildest dreams did he think he could settle for just one…but that’s before his animalistic Instinct awakens for Cecelia, recognizing her for who she truly is: his fated mate.  As they journey to his territory in the harsh northern lands of Luxiria, his female tempts him to madness, fueling his own wicked desires, even when it is forbidden to touch her or claim her the way he craves. In his care, they must resist the mating call that runs between them…or risk everything.  Features a strong, determined human female and a seven-foot tall mouthwatering alien with a huge, massive…heart (-wink wink-). Full-length 60,000+ word novel!  Note: The Warriors of Luxiria series makes more sense read in order, but each book *can* be read separately since the main focus is on the romantic relationship of each couple.  Warriors of Luxiria series:  The Alien's Prize: Vaxa'an and Kate The Alien's Mate: Vaxa'an and Kate The Alien's Lover: Lihvan and Beks The Alien’s Touch: Rixavox and CeceliaThe Alien's Dream: Vikan and Taylor Glass",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction",
    "Science Fiction Romance",
    "Fantasy",
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "Zoey Draven",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/36510359-the-alien-s-touch"
}