{
  "title": "Océano Mar",
  "description": "Hace muchos años, en medio de algún océano, una fragata de la marina francesa naufragó. 147 hombres intentaron salvarse subiendo a una enorme balsa y confiándose al mar. Un horror que duró días y días. Un formidable escenario en el que se mostraron la peor de las crueldades y la más dulce de las piedades.Hace muchos años, a orillas de algún océano, llegó un hombre. Lo había llevado hasta allí una promesa. La posada donde se paró se llamaba Almayer. Siete habitaciones. Extraños niños, un pintor, una mujer bellísima, un profesor con un extraño nombre, un hombre misterioso, una muchacha que no quería morir, un cura cómico. Todos estaban allí buscando algo, en equilibrio sobre el océano.Hace muchos años, estos y otros destinos encontraron el mar y volvieron marcados. Este libro explica el porqué, y escuchándoles se oye la voz del mar. Se puede leer como una historia de suspense, como un poema en prosa, un conte philosophique, una novela de aventuras. En cualquier caso, domina la alegría furiosa de contar historias a través de una escritura y una técnica narrativa sin modelos ni antecedentes ni maestros.El tono de Océano mar no tiene comparación posible en la narrativa italiana, por la ascensión fantástica que no conoce pausas, por la gama emotiva que proyecta. En efecto, se pasa de la ironía más descarada a la melancolía más profunda, de la comicidad más sanguinolenta al pathos más comprometedor y menos patético. Esta novela, en la que proliferan ecos y alusiones -Conrad y Melville, Joyce y Beckett, Valery Larbaud y Perec, el Schumann de las variaciones y La balsa de la Medusa de Géricault- es la indiscutible confirmación de un talento original, capaz de insólitas sabidurías literarias y de inéditos abandonos. Mientras que Seda estaba construida siguiendo un único registro estilístico, en Océano mar se utilizan una gran variedad de técnicas: «a cada historia debe corresponder una música particular», en palabras del narrador y musicólogo Baricco.",
  "genres": [
    "Fiction",
    "Italian Literature",
    "Italy",
    "Contemporary",
    "Magical Realism",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Alessandro Baricco",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/36514667-oc-ano-mar"
}