{
  "title": "The Sheep Look Up",
  "description": "The Sheep Look Up is a sf novel by British author John Brunner, 1st published in '72. The novel's setting is decidedly dystopian, the book dealing with the deterioration of the environment in the USA. It was nominated for the Nebula Award for Best Novel in '72. The title of the novel is a quotation from the poem Lycidas by John Milton.With the rise of a corporation-sponsored government, pollution levels in cities have reached extreme levels & public health has deteriorated. Continuing the style used in Stand on Zanzibar, there's a multi-strand narrative & many characters in never meet each other; some characters appear in one vignette only. Similarly, instead of chapters, the book is broken up into sections which range from 30 words to several pages. The character of Austin Train in The Sheep Look Up serves a similar purpose to Xavier Conroy in The Jagged Orbit or to Chad Mulligan in Stand on Zanzibar: He's an academic who, despite predicting & interpreting social change, has become disillusioned by society's failure to listen. This character is used both to drive the plot & to explain back-story.Despite being nominated for a Nebula Award, the book fell out of print in the 90s, only later being republished. The new edition contains a foreword by David Brin & an afterword by environmentalist & social change theorist James John Bell. Brin places the book in the context of Brunner's time & other writings. In the afterword, Bell treats the book almost as prophecy, drawing parallels between events in the book & subsequent real world developments: \"His words have a kind of Gnostic power embedded in them that gives his characters passage into our world\". A couple specific examples are that \"Brunner's puppet of a president, affectionately called Prexy, is a dead ringer for our Dubya & that sabotage done by the Earth Liberation Front is pulled directly from the pages of the novel. Writer Wm Gibson made a similar remark in a '07 interview: \"No one except possibly the late John Brunner, in his brilliant novel The Sheep Look Up, has ever described anything in science fiction that is remotely like the reality of 2007 as we know it.\"",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Post Apocalyptic",
    "Horror",
    "Apocalyptic",
    "Speculative Fiction"
  ],
  "author": "John Brunner",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/36510228-the-sheep-look-up"
}