{
  "title": "Christmas Voices",
  "description": "John Daily’s hard-sighted focus on his success has blinded him to the bigger picture. In spite of all the successful things he has done in business, in spite of all the wealth and prestige he has accumulated for himself, there is a gaping void at the center of his existence.John Daily knows the proverbial price of everything and the value of nothing. He buys the package because of the way it looks, not because of what’s inside. He has a loving wife and picture-book kids, but he’s incapable of reading between the lines and giving them something of himself.Tragedy strikes sending his entire family into the hospital with little chance of recovering. As Christmas approaches, John Daily realizes in a life-transforming epiphany that he has the power to set wrongs to rights. It’s a small beginning to the realization that he can change his own life. He can learn to see the world through a new set of eyes, which would give him the power to create a more harmonious and loving world.With his life unraveling, John Daily seeks solace in the last remaining outlet for his tormented soul. Since childhood, he has constructed a Christmas Village with his mother and father. It is a Christmas Village complete with a train, ski lift, farm, lake, figurines, and a bustling town. This was his fantasy world made real in childhood.As he sits alone contemplating his misery, he is brought up short by the sound of a tiny voice. As a child, John Daily imagined lives for the little people of the Christmas Village. Now he wonders if he is finally losing his mind as the prayer of a child reaches his ears. It is a heart-felt prayer and demands to be answered.But there’s a bigger picture out there, and when John Daily realizes that he is actually in his own childhood village and not on the outside looking in, he is in for the awakening of a lifetime. When he was a kid, he once asked his dad, “Do you think God hears our prayers?” He is not only about to learn the true answer to that question; he is about to experience it firsthand.",
  "genres": [],
  "author": "John Callas",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/36517533-christmas-voices"
}