{
  "title": "Dreamtime Dragons",
  "description": "Stories, drabbles and sample chapters; the Dreamtime dragon authors are a collective of storytellers brought together by their love of Fantasy in all it's guises.  Travel the Wyrde Wood with a giant wyrm or defend a pod of humpback whales with a dragon, explore the deepest goblin caverns, search for a dragon egg in the midst of a Viking raid or in a post-apocalyptic city where five gold coins is the price for the prize you seek!  Explore imaginary worlds with creatures of Fantasy and dragons... lots of dragons! Noble dragons, funny dragons, cloud dragons, spirit dragons and even a revenge dragon!  Humour, drama, mythology and more await in 12 stories and drabbles, plus 8 novel excerpts that will lead you to your next great Fantasy read! Find the Dreamtime Dragon authors on Facebook in the group, Dreamtime Tale Fantasy! ALL proceeds have been pledged to the Abington Ferret Refuge in Northamptonshire.  Included in this volume you'll find:  101 Ways to Use a Dragon ( A work in progress by Nav Logan): A young Irish student goes on a quest to find his own dragon, much to the chargrin of his mother, his neighbours, and most of all his landlady, Mrs. O.  Shandikaar by Guy Donovan: An excerpt from Of Dragons and Men  Hauling Fire by A.J. Noon: Running a haulage firm can be difficult at the best of times, but when you are tasked with hauling something for a wizard you may not want to see what's in the crate.  Cloud Dragons by Jaq D Hawkins: Airship pirates flee from enemies both real and imagined... or is the monster in the clouds real?  Modern Dragon and The View from the Other Side by Assaph Mehr: Two pieces of flash fiction, that will challenge your view of dragons.  The Wyrm in the Tarn by Nils (Nisse) Visser: An excerpt from Escape from Neverland (Book One of the Lord of the Wyrde Woods series)  A Soft Spot for Dragons by Marc Vun Kannon: An excerpt from Tales of Uncle, book three of the Flame in the Bowl series  Cold and With Dragons by Jonathan Royan: A dragon drabble  At the Red Boar by Rick Haynes: An excerpt from Heroes Never Fade  Red Fire Dragon by Benjamin Towe: An excerpt from Death of Magick  Arthur and the Egg by Leslie Conzatti: What would you do if you woke up one day to a dragon standing at the edge of your city?  Ana's Dream of Flying by Mary Woldering: A young black girl in 1961 in Memphis discovers the truth about her art, its connection to other realms, and a long lost dragon spirit who has been looking for her.  The Offering by Jonathan Royan: A short tale of love, honour and revenge, with a malevolent dragon thrown in for good measure.  Gold is Everything by Rick Haynes: Olav is consumed by his one true love, and he’ll do anything, even kill, to satisfy his desires.  Free Will by Nav Logan: An excerpt from The Black Knights of Crom Cruach (The Stormbringer Saga Book Two)  Fear and Heat by Jaq D Hawkins An excerpt from Demoniac Dance, book two of The Goblin Trilogy  Biters by Guy Donovan: An excerpt from Songs of Autumn  The Dragon Raid by Nav Logan: A drabble  Freósan Draka Treów by Nils Nisse Visser: Lewinna Wulfgardohter has yearned to follow in her father’s footsteps all her life, but she can’t because she is a girl. When events conspire to make her wish come true, she is struck by doubts in the face of immediate and present danger.",
  "genres": [
    "Fantasy"
  ],
  "author": "Nils Nisse Visser",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/36522905-dreamtime-dragons"
}