{
  "title": "The Caretakers",
  "description": "(Please read author's note, below) Early 1972, the Roe v. Wade decision is seven months away and an upper middle-class family is about to be slammed into varying degrees of lunacy. Mabel Jamieson, the youngest of four siblings, has an illegal abortion leaving her maimed and unconscious. Though unknown to her at the time, Mabel's older brother, Jasper, followed her the night she went to see a man masquerading as a doctor, and was able to deliver her cataleptic body safely home--only after witnessing the ordeal through a hidden window. Filled with rage and misinterpreted information, Jasper swears to avenge his sister's wrongdoing and spends years sifting his way through seemingly impossible implications until he finds the man responsible. Flash forward to summer 1989, Jasper's eleven-year-old daughter Caroline and her cousin Mitch find a small cross near the home where their fathers, and their Aunt Mabel, grew up; a cross bearing the date March 24, 1972. The children trade theories about its origin and let their discovery saturate their imaginations until a tragic accident devastates Caroline and rips all the joy from her heart.One year later, still devastated and seemingly inconsolable, Caroline begins to come to terms with the loss she endured while her father tries to make peace with the horrors that still haunt his mind, even after all this time. So one evening, while celebrating the Fourth of July holiday, Jasper consumed with his own agenda and little regard for his sister's, is determined to confront her and tell her he knows about the abortion, tell her he knows who the father is, tell her he knows the man who maimed her.A heartwarming story, The Caretakers will tug at your very soul and petition your own beliefs. The narration takes the reader down a nonlinear path with character revelations at every turn. When we first meet Mabel she's a confused and doubtful teenage girl, but before long becomes a young woman who learns to cherish her own worth. Throughout the story, Caroline is a young teen herself, but like Mabel, is forced to face tragedy square in the face at far too young of an age all while her father comes face-to-face with a truth that has haunted him for nearly fifteen years.AUTHOR’S NOTEI first published The Caretakers in May, 2011. And though I was pleased with the overall theme and content, I realized (albeit years later) that the manuscript needed polishing. Admittedly, I rushed to publish—like many first-time authors do—but now, I’ve gone back, had it edited and hopefully it is free from errors.As for the story line itself … it’s difficult, I think, for a writer to go back and reexamine their work. It can be a daunting task. Because we all evolve. We change from experiences here and there, and when we look at back at older writing, sometimes we wonder why we didn’t say something differently … end a scene, begin a scene differently. But that doesn’t mean we should discard what we created in the past. And so, for the most part, The Caretakers remains as it always has been … a first novel, with a few revisions for both clarity and flow.I cannot promise that it is a perfect work, nonetheless, it was imperative to have a clean copy available to readers so I hope you’ll consider reading the fourth, revised edition.",
  "genres": [
    "Fiction"
  ],
  "author": "Shauna L. Nosler",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/12202139-the-caretakers"
}