{
  "title": "Florida Keys: Romance in Paradies Beach Romance Collection",
  "description": "Beach Romance Collection Tomorrow Series - A stressed-out writer - A rugged, sexy workaholic - Maybe a little distraction is exactly what they both need!With a deadline looming and writer's block hampering her efforts, Maggie McCoy, best-selling romance author, finds the No Name Key the perfect hide-a-way. Except plans to be alone die the moment she meets Jake Hatfield. She needs to clear her head and get her book written so her fans don't abandon her, but he soon proves too much of a distraction for serious-minded Maggie.Jake Hatfield, rugged, sexy workaholic, has no plans for a woman in his life. When his manager rents out the bungalow on his property to a famous writer who wants to be incognito, sparks fly while the forces of romance and love knock him for a loop. Jake thought he was immune to love. Was he wrong all along?Forever Series - What happens when you mix a hot doctor, romance and a woman dressed up as Pippi Longstocking?Abby Worthington is just about to make her dream come true with a trip across the states when an incident with a hot doctor leads her on a search within herself. Does she stay for more of the good doctor or run like the wind?Doctor Jon Hatfield likes his life in the Keys fine. But when Abby comes along and shakes things up, he realizes he wants to get to know her better. Except she isn't sticking around much longer. When he falls for her, will he tell her how he feels or lose the one person who makes him feel like no one ever has before?Escape Series -A desperate woman seeking asylum - A tired undercover agent wanting out - A plot full of romance, mystery and mayhem!Sara needs to forget about her past so she winds up in Key West to start over. But she can't seem to stay out of trouble and when her brother goes missing, she needs expert advice and help.Josh has no plans to get involved with a stranger that makes herself right at home in his life, but his undercover skills and instincts come in handy when Sara cries out to him for helpThe three series above are part of The Florida Keys Romance in Paradise collection. Other titles Island KeeperNo Name InnBoot Key HarborMake sure to stop by www.cyndiraye.com",
  "genres": [],
  "author": "Cyndi Raye",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/36524732-florida-keys"
}