{
  "title": "Our Lady of Kibeho: Mary Speaks to the World from the Heart of Africa",
  "description": "Thirteen years before the bloody 1994 genocide that swept across Rwanda and left more than a million people dead, the Virgin Mary and Jesus Christ appeared to eight young people in the remote village of Kibeho. Through these visionaries, Mary and Jesus warned of the looming holocaust, which (they assured) could be averted if Rwandans opened their hearts to God and embraced His love.Mary also sent messages to government and church leaders to instruct them how to end the ethnic hatred simmering in their country. She warned them that Rwanda would become \"a river of blood\"-a land of unspeakable carnage-if the hatred of the people was not quickly quelled by love. Some leaders listened, but very few believed. The prophetic and apocalyptic warnings tragically came true during 100 horrifying days of savage bloodletting and mass murder.Much like what happened at similar sites such as Fátima and Lourdes, the messengers of Kibeho were at first mocked and disbelieved. But as miracle after miracle occurred in the tiny village, tens of thousands of Rwandans journeyed to Kibeho to behold the apparitions. After the genocide, and two decades of rigorous investigation, Our Lady of Kibeho became the first and only Vatican-approved Marian (related to the Virgin Mary) site in all of Africa. But the story still remained largely unknown.Now, however, Immaculée Ilibagiza has changed all that. She has made many pilgrimages to Kibeho, both before and after the holocaust, has personally witnessed true miracles, and has spoken with a number of the visionaries themselves. What she has discovered will deeply touch your heart!",
  "genres": [
    "Catholic",
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Christian",
    "History",
    "Faith"
  ],
  "author": "Immaculée Ilibagiza",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/3652425-our-lady-of-kibeho"
}