{
  "title": "Book of Colours",
  "description": "From Robyn Cadwallader, author of the internationally acclaimed novel The Anchoress, comes a deeply profound and moving novel of the importance of creativity and the power of connection, told through the story of the commissioning of a gorgeously decorated medieval manuscript, a Book of Hours.London, 1321: In a small stationer's shop in Paternoster Row, three people are drawn together around the creation of a magnificent book, an illuminated manuscript of prayers, a Book of Hours. Even though the commission seems to answer the aspirations of each one of them, their own desires and ambitions threaten its completion. As each struggles to see the book come into being, it will change everything they have understood about their place in the world. In many ways, this is a story about power - it is also a novel about the place of women in the roiling and turbulent world of the early fourteenth century; what power they have, how they wield it, and just how temporary and conditional it is.Rich, deep, sensuous and full of life, Book of Colours is also, most movingly, a profoundly beautiful story about creativity and connection, and our instinctive need to understand our world and communicate with others through the pages of a book.Praise for The Anchoress:'So beautiful, so rich, so strange, unexpected and thoughtful - also suspenseful. I loved this book.' Elizabeth Gilbert, author of Eat, Pray, Love'Affecting ... finely drawn ... a considerable achievement.' Sarah Dunant, New York Times'Elegant and eloquent' Irish Mail'Cadwallader's writing evokes a heightened attention to the senses: you might never read a novel so sensuous yet unconcerned with romantic love. For this alone it is worth seeking out. But also because The Anchoress achieves what every historical novel attempts: reimagining the past while opening a new window - like a squint, perhaps - to our present lives.' Sydney Morning Herald'A novel of page-turning grace' Newtown Review of Books",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Medieval",
    "Books About Books",
    "Audiobook",
    "British Literature"
  ],
  "author": "Robyn Cadwallader",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/36524801-book-of-colours"
}