{
  "title": "The End of the Affair",
  "description": "Alternate cover edition of B0081293SO.Graham Greene's evocative analysis of the love of self, the love of another, and the love of God is an English classic that has been translated for the stage, the screen, and even the opera house. Academy Award-winning actor Colin Firth (The King's Speech, A Single Man) turns in an authentic and stirring performance for this distinguished audio release.The End of the Affair, set in London during and just after World War II, is the story of a flourishing love affair between Maurice Bendrix and Sarah Miles. After a violent episode at Maurice's apartment, Sarah suddenly and without explanation breaks off the affair. This very intimate story about what actually constitutes love is enhanced by Mr. Firth's narration, who said \"this book struck me very, very particularly at the time when I read it and I thought my familiarity with it would give the journey a personal slant.\"\"I'm grateful for this honor,\" Firth said when this production was recognized by the Audie Awards as Audiobook of the Year for 2013, \"and grateful for the opportunity to narrate one of my favorite stories. A great novel told in the first person makes for the best script an actor could imagine. None better than The End of the Affair.... Theater and film each offer their own challenges and rewards, but narration is a new practice for me and the audiobook performance provides exhilarating possibilities for both actors and listeners. I'm thrilled to be involved in bringing this remarkable work of fiction to a wider audience, and thankful to Audible for offering me the opportunity to perform it and to engage with so many who share my passion for storytelling.\"",
  "genres": [
    "Fiction",
    "Classics",
    "Romance",
    "Audiobook",
    "Literature",
    "Novels",
    "British Literature"
  ],
  "author": "Graham Greene",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/36525460-the-end-of-the-affair"
}