{
  "title": "Dragons of the Dawn Bringer",
  "description": "An Exiled King. A Broken Dream. A Sword Forged for Forever.\nIssa can trust no one. Her closest allies betray her and nobody is as they seem. When a Dromoorai captures her and a black vortex to another dimension rips into her room, she realises the attacks will never stop and there is far worse than Baelthrom reaching for her out of the Dark Rift.The Great Sword of Binding has been stolen and it calls to Asaph in a vision like no other. Alone he must find it and awaken the dragons before they fall asleep forever. But the quest will bring him face to face with the enemy, and to the very brink of his life. Can he find the sword and reach Issa’s army in time to join the fight against Baelthrom?The Dragon Dream has fallen and now the Elven Land of Mists is attacked. Soon there will be nothing left to defend. Issa must take the offensive and strike into the heart of enemy lands. War now becomes the Raven Queen’s domain.The world hangs between the darkness and the light but only the hidden powers of a young woman can save it.\nDragons of the Dawn Bringer is the fifth novel in an epic fantasy adventure series readers are comparing to Raymond E. Feist’s Riftwar Saga, Terry Goodkind’s The Sword of Truth, Patrick Rothfuss' Kingkiller Chronicles, and David Edding’s The Mallorean.\n\nThe Goddess Prophecies sword and sorcery fantasy epic is being hailed as one of the best high fantasy series in years, drawing on all the appeal of Tolkien’s deep and soulful characters, Robert Jordan’s sweeping worlds, and Marion Bradley's unyielding heroines. This is a saga full of spirit, determination and resilience.\n  Join tens of thousands of readers already loving this epic fantasy adventure. Click or tap 'BUY NOW' to start today.  “The world of Maioria is richly textured and imagined, in the vein of Robert Jordan's very successful Wheel of Time series. A nice difference is that your Chosen One is female rather than male.” - Mollie M., Reviewer, Writer, Editor \"A beautifully wrought fantasy with every element you could ever crave in the genre. Heroines, Heroes, A dark lord, dragons, elves, magic aplenty. A wonderful introduction to a promising new series.\" - Heather G, Amazon Top 1000 Reviewer \"Like the fulfilling high fantasy stories of old, this book is filled with the best the genre has to offer; swords, dragons, witches and wizards, shapeshifters, and epic battles – with a touch of romance...” - Jon M., Reader \"Your books are better than David Eddings\" - John F., Reader",
  "genres": [],
  "author": "Araya Evermore",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/36539480-dragons-of-the-dawn-bringer"
}