{
  "title": "Flagstaff: An Extraterrestrial Biography",
  "description": "What is the nature of evil in America? Why do seemingly good people, lifetime neighbors in a lovely Arizona town, turn viciously on some of their most innocent and beloved friends? How can one small spot on the edge of the greatest Grand Canyon on Earth, and the magnificent Colorado River, foster so many unkind deeds in its people? Flagstaff was a sacred grove in a cool Mountain climate, surrounded on all 4 sides by vast deserts. It was a holy pinnacle to the very ancient Beings who came there in the truest legends of many peoples, home of the Gods who loved its cosmic powers. Flagstaff, in fact was the Egyptian hieroglyphic for the gods and goddesses. But then Christians invaded from the east, bringing their opportunistic, anti-Nature greed for logging, railroads, cattle ranching, and tourists who only wanted to play and ski in the great sacred alpine heavens. They brought their hatred of non-christians, \"pagans\", Natives and Natural Peoples and animals and water-streams, wooded groves, clean air and the dark quiet peace of the stars. Ancestors of author David Seals arrived 150 years ago on the sublime Colorado Plateau, as Les Voyageurs, French fur trappers from Quebec and Europe and Africa. His grandfather's grandfather David Daze {pronounced d'Ausay} followed his oldest sons on the adventure and arrived on the A& P railroad in the 1880s, and homesteaded near Mt. Sitgreaves and the town of Williams just west of the small railroad and logging town of Antelope Springs, later named Flagstaff. They were drawn to the freedom and beauty near the vast Grand Canyon, where mysteries in the skies also drew Percival Lowell to set up his studies of Mars and Martians in the 1890s. Lowell believed in divine, extraterrestrial Beings, and saw them many times from his Observatory on Mars Hill, and there re-began the modern lore of the heavenly Astronauts, so thoroughly explained from sunken caelestial civilizations like Mu and Atlantis, all the way back to Egypt and Greece. The grandson of David Daze, David O'Brien, arrived in Flagstaff from Canada as a boy in the 1890s, and was a close friend and neighbor of Lowell. Dave O'Brien's only daughter Kathleen was born in Flagstaff in 1924, and her oldest son David Seals was conceived at Roswell, New Mexico in 1946-47 after she'd married an AAF pilot during the terrible World War II. Family traditions often spoke of the heavenly Beings from Mars Hill that traveled to Roswell, and were seen and heard by young Davey at Air Force Bases around the world, where his father was stationed. In Japan in 1955-56 he heard Martians in their house - and it is chronicled in this book 'Flagstaff'. He heard the Martians abduct his sister Kathy and kill her. In Libya in 1962-65 the family was exposed to a lot of the sacred, true mythology in North Africa, and which is also chronicled here in the Author's own experiences. It was there, on Mt. Nysa at Tripoli, Leptis Magna, and the Temple of Liber Pater at Sabratha that he learned about the birth and origins of gods Dionysos/Osiris-Isis and Athene. Back in the States, he chronicles profound revelations about the family's horrible confrontations with the evils of people that went back to Flagstaff, and which is related to the ultraterrestrial visitations many people mistake for abductions, cosmic kidnappings, and the devils of false religions. Dave O'Brien was given a lobotomy, back in Flagstaff in the 1940s? Why? When he died in 1950 he was buried next to Kathleen's mother Bessie O'Brien - and both their tombstones were bulldozed by a crazed Catholic priest in the late 1950s, completely destroyed! Why? When Kathleen's stepmother Mollie O'Brien died in 1965, the family home of 35 years, at 515 N. Leroux in downtown Flagstaff, was taken by the neighbors, named Rayma Babbitt and Mollie Pertuit, for a mere pittance of $10. Kathleen was outraged, horrified. It was her home. She and her 7 children were in Libya, serving their Country. Her home was gone.",
  "genres": [],
  "author": "David O'Brien Seals",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/12203833-flagstaff"
}