{
  "title": "Journeys: An American Story",
  "description": "Every family has a story of how they arrived in America, whether it was a few months, years, decades, or centuries ago. An American Story celebrates the vastness and variety of immigration tales in America, featuring seventy-two essays about the different ways we got here. This is a collection of family lore, some that has been passed down through generations, and some that is being created right now.Journeys captures the quintessential idea of the American dream. The individuals in this book are only a part of the brilliant mosaic of people who came to this country and made it what it is today. Read about the governor’s grandfathers who dug ditches and cleaned sewers, laying the groundwork for a budding nation; how a future cabinet secretary crossed the ocean at age eleven on a cargo ship; about a young boy who fled violence in Budapest to become one of the most celebrated American football players; the girl who escaped persecution to become the first Vietnamese American woman ever elected to the US congress; or the limo driver whose family took a seventy-year detour before finally arriving at their original destination, along with many other fascinating tales of extraordinary and everyday Americans.In association with the New-York Historical Society, Andrew Tisch and Mary Skafidas have reached out to a variety of notable figures to contribute an enlightening and unique account of their family’s immigration story. All profits will be donated to the New-York Historical Society and the Statue of Liberty Ellis Island Foundation.Featuring Essays Alan AldaArlene AldaTony BennettCory BookerMichael BloombergBarbara BoxerElaine ChaoAndrew CuomoRay HalbritterJon HuntsmanWes MooreStephanie MurphyDeborah NorvilleDr. Mehmet OzNancy PelosiGina RaimondoTim ScottJane SwiftMarlo ThomasAnd many more!",
  "genres": [
    "Nonfiction",
    "Essays",
    "Travel",
    "Memoir",
    "American",
    "Short Stories"
  ],
  "author": "Andrew Tisch",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/36538790-journeys"
}