{
  "title": "Plum Rains",
  "description": "2029: In Japan, a historically mono-cultural nation, childbirth rates are at a critical low and the elderly are living increasingly long lives. This population crisis has precipitated a mass immigration of foreign medical workers from all over Asia—as well as the development of refined artificial intelligence to step in where humans fall short.In Tokyo, Angelica Navarro, a Filipina nurse who has been working in Japan for the last five years, is the caretaker for Sayoko Itou, an intensely private woman about to turn 100 years old. Angelica is a dedicated nurse, working night and day to keep her paperwork in order, obey the strict labor laws for foreign nationals, study for her ongoing proficiency exams, and most of all keep her demanding client happy. But one day Sayoko receives a present from her son: a cutting-edge robot caretaker that will educate itself to anticipate Sayoko’s every need. Angelica wonders if she is about to be forced out of her much-needed job by an inanimate object—one with a preternatural ability to uncover the most deeply buried secrets of the humans around it. While Angelica is fighting back against the AI with all of her resources, Sayoko is becoming more and more attached to the machine. The old woman is hiding many secrets of her own—and maybe now she’s too old to want to keep them anymore.In a tour de force tapestry of science fiction and historical fiction, Andromeda Romano-Lax presents a story set in Japan and Taiwan that spans a century of empire, conquest, progress, and destruction. Plum Rains elegantly broaches such important contemporary conversations as immigration, the intersection of labor and technology, the ecological fate of our planet and the future of its children.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Dystopia",
    "Japan",
    "Asia"
  ],
  "author": "Andromeda Romano-Lax",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/36548685-plum-rains"
}