{
  "title": "The Gift",
  "description": "“The Gift” will change Christmas forever.The breakout thriller novel of Canadian author Stephanie M. Matthews, “The Gift” will leave you breathless in this story about a darkness that haunts a little Belgium village, and the lengths it will take to save a young woman from being lost to it forever. “The Gift” is a vividly haunting Christmas story that will not be easily forgotten. The darkness begins here. Fae Peeters is an exchange student in Belgium pursuing her Master’s Degree in architecture. As Christmas approaches, she receives a letter from her beloved grandmother inviting her to visit her own childhood village in southern Belgium, and there find her Christmas gift. The letter is unusually vague and bewildering but Fae follows it, the mystery of the gift leading her on. Arriving in the village, Fae is greeted by a picturesque holiday villagescape. . . and an unshakable feeling that the quaint village is hiding something. Almost immediately upon arriving she begins hearing a voice that isn’t really there and imagining dark things she’d never seen or dreamed before. Her mind starts to unravel and she wonders if she’s starting to go insane—but is she? Or is something much darker going on? The longer Fae stays in the village the more disconcerted she becomes as she begins to uncover more mysteries and fewer answers. Desperate to keep a hold on her fleeting sanity, and determined not to disappoint her Grandmother by quitting the village before Christmas morning, Fae befriends the only person who seems to want to help her, but even he might not be what he appears. . . Fae’s fight for her life and her soul, and the realization of what living through this Christmas Eve will cost not only her, but others around her, is a heart-pounding, page-turning experience. Edited by New York Times Best Seller editor Steve Parolini, “The Gift” is a supernatural thriller that will carry you away to the wintery streets of Europe and insert you into the struggle against a darkness that haunts an innocent village. A mind-bending struggle of hidden truths against the darkest of evils, “The Gift” is a story of survival that will challenge your perception of the world around you in a narrative to satisfy thrill seekers and holiday lovers alike.",
  "genres": [
    "Thriller",
    "Horror"
  ],
  "author": "Stephanie M. Matthews",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/36553268-the-gift"
}