{
  "title": "Becoming Dallas Willard: The Formation of a Philosopher, Teacher, and Christ Follower",
  "description": "ECPA 2019 Christian Book Award Finalist2018 Foreword INDIES Book of the Year Award FinalistsDallas Willard was a personal mentor and inspiration to hundreds of pastors, philosophers, and average churchgoers. His presence and ideas rippled through the lives of many prominent leaders and authors, such as John Ortberg, Richard Foster, James Bryan Smith, Paula Huston, and J. P. Moreland. As a result of these relationships and the books he wrote, he fundamentally altered the way tens of thousands of Christians have understood and experienced the spiritual life. Whether great or small, everyone who met Dallas was impressed by his personal attention, his calm confidence, his wisdom, and his profound sense of the spiritual. But he was not always the man who lived on a different plane of reality than so many of the rest of us. He was someone who had to learn to be a husband, a parent, a teacher, a Christ follower. The journey was not an easy one. He absorbed some of the harshest and most unfair blows life can land. His mother died when he was two, and after his father remarried he was exiled from his stepmother's home. Growing up in Depression-era, rural Missouri and educated in a one-room schoolhouse, he knew poverty, deprivation, anxiety, self-doubt, and depression. Though the pews he sat in during his early years were not offering much by way of love and mercy, Dallas, instead of turning away, kept looking for the company of a living, present, and personal God. In Gary W. Moon's candid and inspiring biography, we read how Willard became the person who mentored and partnered with his young pastor, Richard Foster, to inspire some of the most influential books on spirituality of the last generation. We see how his love of learning took him on to Baylor, the University of Wisconsin, and the University of Southern California, where he became a beloved professor and one of the most versatile members of the philosophy department. The life of Dallas Willard deserves attention because he became a person who himself experienced authentic transformation of life and character. Dallas Willard not only taught about spiritual disciplines, he became a different person because of them. He became a grounded person, a spiritually alive person as he put them into practice, finding God, as he often said, \"at the end of his rope.\" Here is a life that gives us all hope.",
  "genres": [
    "Biography",
    "Christian",
    "Nonfiction",
    "Christianity",
    "Spirituality",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Gary W. Moon",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/36554758-becoming-dallas-willard"
}