{
  "title": "Fifty Ways I Screwed Up My Life and How You Can Avoid This",
  "description": "How many lives have you got?Stop messing up your life! Stop being your own worst enemy!Always complaining, touchy, cantankerous, endlessly brooding, eternally dissatisfied, saying yes but meaning no, thinking constantly that he was hard done by and blaming everybody else François de Waal was an irritating bastard who castigated everything and everybody.He made every mistake in the book when it came to love, relationships, money, sex and work. Littered with egotism, self-sabotage and silent despair, he muddled along for years without any light at the end of the tunnel. Being gay didn't make things easier. Until, at the age of forty, he realized that he was an obstacle to himself, his own worst enemy. After years of falling into every trap in his path, it took blood, sweat, and tears to gain insight into his behaviour and actually make changes.˃˃˃ In this self-help book, François de Waal dissects with great precision the ways you can best sabotage things for yourself.But even more important is the message that there is a solution for every problem. He shows how you can successfully confront yourself and lead a happier life. It is never too late to be really happy.\"A fun and honest life guide that gets to the basics of personal development and how to be a happier, more productive person. Readers will identify with the author’s setbacks and be heartened by his useful tips for success.\" - Tom Butler-Bowdon, author of \"50 Self Help Classics\".\"In his excellent book François de Waal talks about everyday kinds of problems and depressing thoughts and worries that just about everyone has but that nobody talks about. It is refreshing to read someone writing so candidly about it. The writing is personable and engaging. It is disarmingly charming to read someone so honestly not perfect but who has sincerely tried to come up with good solutions to common problems and found some good ones! De Waal admits so many foibles and character flaws that I have but that I have never admitted. I think most people would have a similar experience reading this book. The openness of it is freeing. It is a relief to have it all out in the open, and to admit, at least to myself, my own selfishness and arrogance and pettiness. I feel I am a better person from reading the book.\"Fifty Ways I Ruined My Life. And How You Can Avoid This\" is excellent. Well written. It is compelling reading from start to finish. And the author gives good, practical suggestions which are refreshingly brief and to the point. Well done.\" - Adam Khan, author of \"Self Help Stuff That Really Works\".",
  "genres": [],
  "author": "François de Waal",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/36545460-fifty-ways-i-screwed-up-my-life-and-how-you-can-avoid-this"
}