{
  "title": "The Oxford Dictionary of Quotations",
  "description": "The Oxford Dictionary of Quotations has been long hailed as the most literary quotation book available, and the newest edition is the largest and most comprehensive of its kind. Over 20,000 quotations from every era and every location bring you the wisdom of ages and the sound bites of today.The text is a browser's paradise that allows the reader to identify who said what, and when, and where.Here readers will find in one volume the wit and wisdom of humanity--the finest lines to be found from Shakespeare, the Bible, Mark Twain, Alan Greenspan, and hundreds of other writers, philosophers, political figures, and entertainers. This new edition contains over 200 new entries includingsixty-one quotable Americans. This updated sixth edition encompasses current trends in politics and culture with quotations such as \"States like these constitute an axis of evil, arming to threaten the peace of the world\" (George Bush), and \"It's a good thing\" (Martha Stewart). Many other newadditions are older in origin, yet enlighten events of the twenty-first century.Each illuminating entry contains in-depth details of the earliest traceable source, biographical cross-references, birth and death dates, and a career brief. With both a thematic and keyword index, scholars and readers thumbing through the book will easily be able to find quotations for alloccasions. Ranging from the profound, to cogent, to witty, these quotations will add spice to your writing and conversation. An ideal reference for any home or office library, The Oxford Dictionary of Quotations is a perennial source of entertainment and inspiration for public speakers, writers, oranyone else who enjoys a sparkling line or spirited reply.",
  "genres": [
    "Reference",
    "Nonfiction",
    "Dictionaries",
    "Writing",
    "Language",
    "Literature",
    "Poetry"
  ],
  "author": "Oxford University Press",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/365553.The_Oxford_Dictionary_of_Quotations"
}