{
  "title": "Thirteen",
  "description": "THE SERIAL KILLER ISN'T ON TRIAL.HE'S ON THE JURY ...****************\n'To your knowledge, is there anything that would preclude you from serving on this jury?'\nMurder wasn't the hard part. It was just the start of the game.Joshua Kane has been preparing for this moment his whole life. He's done it before. But this is the big one.This is the murder trial of the century. And Kane has killed to get the best seat in the house.But there's someone on his tail. Someone who suspects that the killer isn't the man on trial.Kane knows time is running out - he just needs to get to the conviction without being discovered.****************THIRTEEN REASONS WHY ... YOU MUST READ THIS BOOK:'An oh so clever hook for an oh so clever, gripping book. THIRTEEN is courtroom drama at its finest, blended with page-turning twists and characters you can't get enough of. Steve Cavanagh is the John Grisham for a new generation. Slick, thrilling and unique, THIRTEEN is my favourite read of the year.' Sarah Pinborough'Outstanding - an intriguing premise, a tense, gripping build-up, and a spectacular climax. This guy is the real deal. Trust me.' Lee Child'Smart and original. This is a belter of a book.' Clare Mackintosh'Great hook. Great plot. Great book. Thirteen is a real page turner and one you won't want to put down.' Simon Kernick'A brilliant, twisty, ingeniously constructed puzzle of a book. Steve Cavanagh pulls off an enviable premise with panache.' Ruth Ware'I've been tracking Steve Cavanagh for a few years now and Thirteen is his best, a dead bang beast of a book that expertly combining his authority on the law with an absolutely great thrill ride. Books this ingenious don't come along very often.' Michael Connelly'Quite simply deserves to be HUGE. If you read a thriller as good this year, it's only because you've read this one twice.' Mark Billingham'Tore through this between dusk and dawn. Absolute 5-star cracker from Steve Cavanagh, who's gotta be among top legal thriller writers out there nowadays. A powerhouse of a book that's much more than its high-concept hook.' Craig Sisterson'Wow! This book is friggin' awesome! Utterly immersive.' Emma Kavanagh'Fantastically gripping? Guilty as charged!' Angela Clarke'An absolute cracker.' Susi Holliday'Guilty of thrills, twists, and expertly manipulating the reader.' Mason Cross'An absolute rollercoaster of a read. Thrilling.' Cass Green",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Book Club"
  ],
  "author": "Steve Cavanagh",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/36543419-thirteen"
}