{
  "title": "Soul Full of Coal Dust: A Fight for Breath and Justice in Appalachia",
  "description": "In a devastating and urgent work of investigative journalism, Pulitzer Prize-winner, Chris Hamby, uncovers the tragic resurgence of black lung disease in Appalachia, its Big Coal cover-up, and the resilient mining communities who refuse to back down.Decades have passed since black lung disease was recognized as a national disgrace and Congress was pushed to take legislative action. Since then, however, not much has changed. Big coal companies-along with their allies in the legal and medical professions-have continually flouted the law and exposed miners to deadly amounts of coal dust, while also systematically denying benefits to miners who suffer and die because of their jobs. Indeed, these men and their families, with little access to education, legal resources, and other employment options, have long been fighting to wrench even modest compensation and medical costs from our nation's biggest mining interests-all to combat a disease that could have been eradicated years ago.Tracing their heroic stories back to the very beginning, Chris Hamby, who won a Pulitzer Prize for his reporting on this issue, gives us a deeply troubling yet ultimately triumphant work that promises to do for Black Lung what Beth Macy did for the opioid epidemic. From corporate offices and mine shafts, to hospital beds and rural clinics, Soul Full of Coal Dust becomes a legal and medical thriller that brilliantly traces how a powerless band of laborers-alongside a small group of lawyers and doctors, often working out of their homes or in rural clinics and tiny offices-challenged one of the world's most powerful forces, Big Coal, and won.Full of the rich and complex atmosphere of Appalachia and packed with tales of those who have toiled in the mines of West Virginia, Soul Full of Coal Dust is a necessary and timely book about injustice and resistance.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Labor",
    "Journalism",
    "Social Justice",
    "Environment"
  ],
  "author": "Chris Hamby",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/36546595-soul-full-of-coal-dust"
}