{
  "title": "El secreto del orfebre",
  "description": "«El secreto del orfebre es la más conmovedora, extraordinaria y hermosa novela corta de amor que he leído en mi vida.» Fernando Marías\nEn esta reedición de El secreto del orfebre se añaden unas páginas inéditas del cuaderno de su protagonista, Celia Sanjuán; un texto adicional que convierte a esta novela de Elia Barceló en una nueva obra, reconfigurando su significado y ofreciendo con maestría otro giro final.En esta bellísima pieza literaria su autora nos recuerda que somos palabras, que somos seres que nos narramos a nosotros mismos, creando así nuestra propia historia. En la búsqueda nostálgica de algo que puede estar o no estar allí, esta novela corta tan breve como intensa presenta una historia de amor e identidad que desafía los hilos del tiempo, de la soledad y de la memoria, en aquel espacio en el que el deseo tiene su propia dimensión y la pasión sus propias leyes.Una novela llena de lírica y sentimientos, una historia de amor imposible. Una pieza de orfebrería, una joya literaria que nos lleva a sumergirnos en lo más recóndito de nosotros mismos. Porque también estamos hechos de la materia con la que se construyen los recuerdos.«El título alude a la pericia de fabricar con cosas pequeñas objetos preciosos. Eso es lo que Elia Barceló ha conseguido: crear una pequeña joya.» José Luis Charcán, La Razón«Una pequeña novela, mezcla de cuento y fábula, absolutamente maravillosa, empapada de dulzura y ternura, con un lado fantástico que le aporta una dimensión suplementaria, donde todos los sueños son posibles.» Le club des rats de Biblionet, Francia«Un extraordinario placer de lectura.» Gregor Schuhen, Frankfurter Allgemeine Zeitung«Una incomparable joya literaria. Un libro de una intensidad sin parangón sobre el amor y la eterna rueda del destino.» Westdeutsche Zeitung«Fascinante y evocadora como un álbum de fotografías antiguas.» DN Kultur, Suecia",
  "genres": [
    "Romance",
    "Fantasy",
    "Audiobook",
    "Spanish Literature",
    "Fiction",
    "Time Travel",
    "Science Fiction"
  ],
  "author": "Elia Barceló",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/36547194-el-secreto-del-orfebre"
}