{
  "title": "Beast",
  "description": "Abducted by alien slavers and taken to a lawless desert world, the last thing starship pilot Mia expects is to find herself in the protective, brawny arms of a wild, blue-skinned alien.  Rescued by gladiators on the alien world of Carthago, Mia is working to find other abducted humans who are still lost. But someone else also needs her help—the untamed alien who’s saved her twice. Rescued from vicious fight rings he’s fought in since he was a child, Vek is prone to losing control in aggressive fits of rage…and Mia discovers that she is the only who can calm him. As she finds herself drawn to the man beneath the beast, she knows that with his enhanced senses, Vek can help her find her friends.  For years, all Vek’ker has known is death, darkness, and killing. Despite his newfound freedom, he is struggling to control his rages and withdrawal from the drugs his captors used on him. Only one scent soothes him, one voice calms him, and one woman is his light in the dark. Vek will do anything to protect Mia and make her happy…including vowing to find her friends.  With the gladiators from the House of Galen, Vek and Mia follow mysterious clues into a dangerous part of the desert on the trail of the missing humans. They are drawn closer together but as they enter the deadly Illusion Mountains, they have no idea of the dangers lying in wait for them, or how far they will both be pushed to their limits in order to survive.  Note to This sci fi romance contains a lot of action (think wild gladiatorial fights and daring rescues), tough gladiators (the warriors of the House of Galen) and a steamy romance (between a a wild blue alien and a small, tough woman from Earth). So if you like it fast, and gritty, and sexy, this is for you!  Includes a preview of Marcus, Book 1 of Hell Squad. ___________________________________________________  Q & A with the Author  Q - How would you describe the Galactic Gladiators series? A – Gladiators in space! The desert planet of Carthago is home to the Kor Magna it’s a mix of low and high tech. Think the Colosseum of Ancient Rome with a touch of professional sports and a side of Las Vegas glitz and temptation. You’ll see a lot of action-packed romance as women abducted from Earth clash with tough, gritty gladiators fighting for love, honor, and freedom.  Q - Why did you want to write the series? A – It’s no secret that I love action, adventure and romance. And I love science fiction romance and all the endless possibilities. Raiden, the gladiator hero of Gladiator, stormed into my head and wanted his story told. I saw this big, tough man covered in tattoos facing off with an equally tough female space marine from Earth. That’s where it all began, and since then the planet of Carthago, the intrigues of the Kor Magna Arena, and an amazing band of gladiators came to life.  Q - What order should I read the books in? A - All the Galactic Gladiator books will be stand-alone romances centered on the Kor Magna Arena, rescuing abducted humans, and making a life far from home. Here's the order I  - Gladiator - Warrior - Hero - Protector - Champion - Barbarian - Beast - Rogue (coming soon)  About I'm passionate about all things action romance. I love stories that combine the thrill of falling in love with the excitement of action, danger and adventure. I write about people overcoming unbeatable odds and achieving seemingly impossible goals. I like to believe it's possible for all of us to do the same.",
  "genres": [
    "Romance",
    "Aliens",
    "Science Fiction",
    "Science Fiction Romance",
    "Paranormal Romance",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Anna Hackett",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/36552751-beast"
}