{
  "title": "The Last Whalers: Three Years in the Far Pacific with a Courageous Tribe and a Vanishing Way of Life",
  "description": "A \"magnificent book\" (Sebastian Junger) and \"monumental achievement\" (Mitchell Zuckoff) that tells the epic story of the world's last subsistence whalers and the threats posed to a tribe on the brink\n\n\"An extraordinary feat of reportage and illumination.\" --Leslie Jamison, The Empathy Exams. \"From the very first lines, I was riveted.\" --Robert Moor, On Trails. \"A true work of art . . . Lyrically written and richly observed.\" --Michael Finkel, The Stranger in the Woods. \"Intimate and moving.\" --Francisco Cantú, The Line Becomes a River. \"Remarkable, gorgeously written.\" --Bronwen Dickey, Pit Bull.\n\nOn a volcanic island in the Savu Sea so remote that other Indonesians call it \"The Land Left Behind\" live the Lamalerans: a tribe of 1,500 hunter-gatherers who are the world's last subsistence whalers. They have survived for half a millennium by hunting whales with bamboo harpoons and handmade wooden boats powered by sails of woven palm fronds. But now, under assault from the rapacious fores of the modern era and a global economy, their way of life teeters on the brink of collapse.Award-winning journalist Doug Bock Clark, one of a handful of Westerners who speak the Lamaleran language, lived with the tribe across three years, and he brings their world and their people to vivid life in this gripping story of a vanishing culture. Jon, an orphaned apprentice whaler, toils to earn his harpoon and provide for his ailing grandparents, while Ika, his indomitable younger sister, is eager to forge a life unconstrained by tradition, and to realize a star-crossed love. Frans, an aging shaman, tries to unite the tribe in order to undo a deadly curse. And Ignatius, a legendary harpooner entering retirement, labors to hand down the Ways of the Ancestors to his son, Ben, who would secretly rather become a DJ in the distant tourist mecca of Bali.Deeply empathetic and richly reported, The Last Whalers is a riveting, powerful chronicle of the collision between one of the planet's dwindling indigenous peoples and the irresistible enticements and upheavals of a rapidly transforming world.",
  "genres": [
    "Nonfiction",
    "History",
    "Anthropology",
    "Nature",
    "Travel",
    "Audiobook",
    "Asia"
  ],
  "author": "Doug Bock Clark",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/36546612-the-last-whalers"
}