{
  "title": "Warren Mundine in Black + White: Race, Politics and Changing Australia",
  "description": "\"One of this country's most important writers on the vexed and sensitive issues of black and white Australia, politics and race\" – Caroline Overington.\"Warren's a fighter… He looked at Lionel Rose – our greatest champion – through the eyes of a boy and learnt the greatest lesson of our stay on your feet.\" – Stan Grant.One of eleven children in a poor Catholic family, Nyunggai Warren Mundine AO has been on a remarkable journey that could have taken a very different turn for a young boy growing up as second-class citizen in the segregated Australia of the 1950s. From his early life in country NSW, with only one pair of shoes and a single bed shared with three of his brothers, to today where he frequents the highest echelons of power and business, In Black+White is a stirring story of an Indigenous life woven into the very fabric of Australia and its politics.In this honest and unflinching memoir, Mundine talks about his personal hardships from growing up in poverty and facing racism, to his personal battle with depression and suicide. One of the most controversial personalities in today's political spectrum, Mundine also includes surprising insights into key political leaders he has worked with including Malcolm Turnbull, John Howard, Kevin Rudd, Julia Gillard, Tony Abbott, Peta Credlin, Mark Latham, Jenny Macklin, and Sam Dastyari.Included in this updated edition are two new chapters in which Mundine shares his passion for work and empowering those trapped in the welfare cycle. Drawing from personal experience, Mundine believes poverty is not just about money but about deprivation of basic needs like employment, lack of purpose and aspiration, and lack of autonomy and independence.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Warren Mundine",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/36550574-warren-mundine-in-black-white"
}