{
  "title": "#TrueMessiahs",
  "description": "Fleeing the collapsing South immediately after the American Civil War, two sailors from the Confederate Navy believe they have avoided a hangman’s noose by sailing to Alexandria, Egypt — where, to escape the blistering summer heat, they hole up in the warren of catacombs beneath the city, eventually to discover the bricked-up grave of the infamous 1st Century historian Titus Flavius Josephus. What they discover in that tomb sets into motion a train of events and intrigue spanning a timeline from the 1st Century AD to the 21st Century.This is not time travel or fantasy. Josephus was an actual historian, a stubborn survivor, a tangible actor in the imperial machinations of the time and a very complex individual who suffered horrible experiences but lived to a ripe old age and survived all of his tormentors (with conjecture that he cut some of their throats). The book strictly follows the historical documentation and fictionalizes when the historical record is silent. In this regard it might be compared to the devices utilized by the author Dan Brown where there is an antagonist from the current century tracking the life of the main protagonist writing in the 1st Century. The main difference is my greater fidelity to the primary historical references left by Josephus himself.The exact plot lines are really too complex to encapsulate within a single page. Let me tell you instead who will enjoy this fiction. Before proceeding, however, let me assure you again that this is not a religious book. It does touch religious subjects but only within the larger framework of 1st Century socio-political events.  •\tChristians who believe in Armageddon and are interested in the destruction/resurrection of the Second Temple will want to read this. It is estimated that at least 41% of the population of the United States belongs to this group.•\tJewish people who would like to gain a more ground-level appreciation of the Diaspora. •\tAnyone who enjoys Roman history and/or conjectural history. •\tPeople who like action-packed war and political stories. •\tAnyone who likes a good Hollywood insider story with a sleazy but charming male protagonist. •\tAnyone who likes a good (but slightly different kind of) love story with a very strong female protagonist. •\tPeople who want to read a ripping good Civil War yarn. •\tReaders who like surprise endings, ones that actually occur at the end and neatly tie up multiple plot lines. (And only at the very last paragraph of the last chapter do you find out why the hashtag title.)",
  "genres": [],
  "author": "J.L. Gates",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/36560770-truemessiahs"
}