{
  "title": "Strictly Business",
  "description": "This book and the rest of THE LOFT series are no longer available. A substantially rewritten/re-edited version of this story will be published as TWINED, the 2nd book in the UNRAVEL ME series, in November 2021.After agonizing months of suppressing her true feelings, it took one passion-filled night for Teresa Bodnar to realize that she was in love with her friend, the deliciously dominant Eric Yun, a revelation that had her running scared. Months later, the two are closer than ever… and yet they couldn’t be further apart. Feeling that keeping both Eric and herself in the dreaded “friend-zone” is the only way to save the man she loves from worse pain, Tera throws herself into her work, determined to turn The Loft into the paradise and safe-haven she envisioned it as.Ever since they met, Eric has only had eyes for Tera. Too stubborn to move on despite his better judgment, he'll take what he can get from the woman he's fallen in love with. But he's determined to be part of the happy ending he knows she deserves, even if she doesn't believe it herself. Two things he didn’t count on? Some billionaire bastard way too interested in both Tera and The Loft, and the demons Eric thought he’d conquered years ago coming back to haunt him…When a wealthy and mysterious patron turns up at The Loft with a tempting offer and eerie reminders of her past, Tera must confront her deepest fears. But it's not just her heart that's at stake. Friendships will be tested, limits will be pushed, and Tera will have to decide between taking a chance on love, and letting go of Eric forever...**This is book two of The Loft series and should be read following Whip Smart. No cheating, no cliffhangers****Content Warning: This book deals with issues of anxiety, depression, and past relationship abuse. It contains mentions of emotional abuse, sexual assault, and suicide.**",
  "genres": [],
  "author": "Siena Noble",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/36560943-strictly-business"
}