{
  "title": "Be Happy! Be Very Happy!: Embrace a new insight into human reality, love, social evolution, science and free education. Explore novel ideas on chaos and creation. Begin a life of joy and purpose.",
  "description": "What our modern world needs most are deeply motivated people who are sophisticated, open-minded global thinkers overflowing with new ideas. Reading this book will surely help you to become one of them, especially when you do so in an unbiased fashion, with willingness to accept new ideas and novel thoughts on many different subjects and topics.\n\n\n\n\n This is a book for truth seekers. And it is - for the most part - aimed at people who possess a broad-spectrum academic knowledge. In essence, it is an intellectually engaging textbook, which offers a novel approach to Scientific Naturalism. And so, it is not intended for people with limiting religious views or for those who are harbouring various modern-day dogmatic beliefs. \n\n It is a comprehensive and well-researched book, which contains many new theses. That's why you do not need to just read this book. You need to put the book down for a time and then come back to it again, instead of reading it at once from the beginning to the end. In other words, you need to take your time and digest it slowly...\n\n\n\n  There are many profound insights covered in its chapters that will make you think. It explores in depth the nature of our existence and investigates the scientific basis of happiness. “Be happy! Be very happy!” contains many self-explanatory truths, which on the whole supplement the general framework of the new-fangled worldview presented on its pages. Therefore, many references, which support the observations presented in this book, are deliberately omitted - as they are clearly not needed for people with adequate general knowledge. \n\n Reading this book will help you take a step back and look at the big picture. Your life picture. \n\n \n   \n     Are you truly happy? Is there something important missing in your life? \n   \n   \n     Do you often ponder what the meaning of your life actually is? \n   \n   \n     Do you often query whether there is a God? \n   \n   \n     Do you sincerely think that you have a really good education? In any case, do you know beyond any doubt what a truly good education is? \nDo you relate to any of these questions?  If yes, then you must read this book.\n\n\n\n\n  \"Be happy! Be very happy!\" consists of six separate parts which deal with the complexity of these intertwined issues.\nPart one is titled: “Myths, happiness and the sense of life”. It deals with the general theory of happiness. It makes blatantly obvious that being happy is the combined summation of all reasons why we exist.\nPart two deals with various subjects like: genesis of all existence, chaos, good and evil, natural ethical principles, science and laws of nature.\nPart three is about important characteristics of natural and man-made laws and cognitive optimism.\nPart four talks about natural personal identity, various social aspects of our happiness, gender balance, metaphysics of culture and disintegration of the spirit.",
  "genres": [],
  "author": "Greg  Oliver",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/36560935-be-happy-be-very-happy"
}