{
  "title": "Billy Boy: A Novel",
  "description": "Not since Larry McMurtry's The Last Picture Show has a novelist captured the poignant contradictions of young manhood in the American West the way Bud Shrake does in Billy Boy. And no novel has ever combined history, spirituality and golf into so potent a triumph of the human spirit.  There are tough times ahead for sixteen-year-old Billy. He's just come to Fort Worth with his father, Troy, after the death of his mother back in Albuquerque. Troy's drinking and gambling will leave them all but penniless, and he'll soon move on and abandon Billy in this strange town to fend for himself. With only a vague idea of how he's going to live, Billy heads over to Colonial Country Club, where he hopes he can get work as a caddie and where he just might see his hero, Ben Hogan. What he finds there, under the watchful eye of his guardian spirit, teaches him unforgettable lessons about golf, life, love and honor.  In Billy Boy, longtime novelist and screenwriter Bud Shrake takes us back to the early 1950s, in a story thick with the Texas dust. Hardscrabble Billy, tough as he thinks he is and smarter than he knows, makes a place for himself behind the walls of privilege at Colonial. He first draws the approval, then the ire, of the club's most eccentric millionaire member, while his looks and manner draw the attention of the millionaire's beautiful granddaughter -- to the displeasure of her boyfriend, the club champion. Billy survives a fierce initiation and a dreadful scene with his drunken father -- but most important, he comes in contact with two of the greatest figures in the history of golf in Texas, Ben Hogan and John Bredemus, each of whom takes Billy under his wing for different reasons and with different results.  Shrake skillfully weaves these historical figures and his richly drawn characters into the fabric of the town and the tenor of the time. Billy must face down his fears and doubts, and he does so in a climactic confrontation that combines the yearnings of youth with the redemption of the spirit. Billy Boy is an unforgettable novel of coming of age in a time and a place filled with mythic echoes and frontier dreams.",
  "genres": [
    "Sports",
    "Novels",
    "Fiction"
  ],
  "author": "Bud Shrake",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/365646.Billy_Boy"
}