{
  "title": "Baby Boomer Army Brat: A Memoir",
  "description": "Baby Boomer Army Brat is the penetrating story of a boy's coming-of-age within the unique subculture of an Army family. With warmth and energy, Wagner shows a vivid slice of Americana foreshadowing the dramatic changes about to hit the baby-boomers and all of American society: the new civil rights laws, the psychedelic era, and above all the searing division of the Vietnam War.  Wagner details many of the cruel, yet often hilarious, struggles of adolescence, from which he emerges with a core inner strength, although also full of doubts. John must try to forge his own values and beliefs in the midst of a constant inability to do anything right and ongoing criticism from his no-nonsense Army father. Baby Boomer Army Brat shows John trying to survive within the military culture, including sexual abuse from a predatory soldier. John must find his way through a minefield of: an ever-changing identity, overwhelming anxieties, seeking a spiritual path, and above all struggling to become authentic.  John was born shortly after World War II, when his dad was an officer in the Army Military Police. As an infant, his parents moved to many military bases across the US. The family then moved to bombed-out postwar Germany, where his dad was in charge of three Displaced Persons camps. His dad saw inhumane treatment of some DPs and had the courage to report it. In typical army fashion however, reminiscent of Abu Ghraib, the Army disciplined his father for communicating about the abuse, rather than the soldiers who were the abusers.  After the family returned from Germany, they lived for several years in Johnstown, Pennsylvania, the family hometown, while John’s dad served as an MP unit commander in Korea during that conflict. Then the family moved to army bases across the US: Fort Knox, Kentucky, Camp Chaffee, Arkansas (where Elvis Presley was inducted), and Fitzsimons Army Hospital, Colorado, until his dad retired. After retirement, they moved for the promised better life all retirees thought would exist in Florida but it didn’t work out that way. They returned to Aurora, Colorado, home of Fitzsimons Hospital, where the family would live for over 30 years.  Shortly after the war began, John’s mother became the first woman federal parole officer in the US. After the war, typical of many American women who had established careers on their own during the war, she gave up her independence to become a full-time mother. In this case, she became an “Army Wife,” raising six children, John being the eldest. Baby Boomer Army Brat not only is the story of John and his family but through his eyes we see the changes in society, including this change in the role of women.  With breathtaking immediacy, Baby Boomer Army Brat brings us right into the times of the Baby Boomers through family stories and vignettes. We see and feel, little by little, the times were indeed about to be a’ changin’.  Written with a confident hand, not only does Baby Boomer Army Brat foreshadow major societal changes, but Wagner writes with courage and thoughtfulness about himself and his struggles without a touch of self-pity. He digs deep to reveal his own part in creating his own problems and shows he is not the “good kid” everyone imagines him to be. This is the story of innocence and dreams, and of how that innocence and those dreams get changed or put away, little by little. This story is for anyone, whether or not from a military family, who dreamt big dreams. It is the story of all of us, the story of what happened to us as a society in the 50s-early 60s. We see the threads of what would become the narratives of our lives. Wagner's voice is strong, clear, introspective, and passionate without ever being dogmatic. He definitely “has a take,” but he is the first to admit how off-base he might be.",
  "genres": [],
  "author": "John   Wagner",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/36560559-baby-boomer-army-brat"
}