{
  "title": "Gone Before Spring",
  "description": "Dippity-Do, garter belts, \"Bucket of Blood\", and ? and the Mysterians are so 1967. This is the year Ruth Ann Bloomfield is in the eighth grade at St. Bonaventure’s (better known as St. Boner’s Adventure). She’s excited to find herself in a popular group of girls, The Tandem Riders, and has caught the eye of the cutest boy in school. Her usual problems of staying away from her mean and much older sister, trying to ditch the pesky girl next door, and convincing her friends that her divorced Catholic/Jewish family is cool, not crazy become insignificant when her body betrays her. Ruth Ann learns that growing up is more than sneaking Winstons and shopping at Mitchell’s Young at Heart. Coming of age against the backdrop of the Civil Rights Movement, the Vietnam War, and a rising counter culture, Ruth Ann discovers, through friendship, what truly matters.This book is filled with iconic music references and great attention to vintage era-specific detail. This will appeal to young adult readers as well as adults who grew up in this era. With gentle humor, the story of Ruth Ann tackles difficult subjects such as body image, self-esteem, and sexual pressure. Most importantly, this is the story of a girl with Psoriasis. This disease causes not just skin sores, itching, and irritation. Psoriasis also leads to depression, shame, anxiety, and can even result in suicide. While there are better options today for treatment, in 1967, the treatments were primitive and ineffective. Most people had to wait it out and many got no relief at all.Ruth Ann learns that being a good friend is more important than how she looks or even how she feels. She searches for companionship and belonging to compensate for the lack of nurturing she gets from her divorced family. The added pressure of hiding her skin causes enormous tension in her relationships and life.Ruth Ann is a believable and relatable character for young and not-so-young readers alike. This book is filled with quirky, funny people offsetting a very serious topic. It is a touching and enjoyable read.",
  "genres": [],
  "author": "Sheila Solomon Shotwell",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/36560230-gone-before-spring"
}