{
  "title": "The Renaissance Club",
  "description": "A great artist of the 17th century meets his superfan from another century in a tale of passion transforming into true love and sacrifice ...  If young, ambitious art historian May Gold could talk to one person about her life, she’d ask her idol, Italian sculptor Gianlorenzo Bernini. The question she’d put to him: If I were trapped in stone, how would you chisel me free?” Because at just twenty-six, May is already trapped in a dead-end college teaching job and a slowly failing love affair. She yearns to fly free of both job and boyfriend, though he’s the one who has brought her to Italy with their teaching colleagues. May longs to soar with creative wings, like one of Bernini’s marble angels. Secretly, she also longs to be in his arms, the wildly adored partner of the man who created the world’s most beautiful art.  When the floor under the gilded dome of St Peter's basilica rocks under her feet, May finds herself in the year 1624, staring straight into Gianlorenzo's eyes. Their immediate attraction grows each time she meets him during her tour, but her academic future begins to look brighter too. Passion for her artist shakes her to the core, but history says they have no future. Would she give up everything, even the time in which she lives, to be with her soul mate?  A CAPTIVATING LOVE STORY illuminating love’s enduring truth and the timeless power of beauty to uplift us. Perfect for lovers of art, Italy, and time travel romance.  Praise for The Renaissance Club  “Enchanting, rich and romantic…a poetic journey through the folds of time.” – Amazon Charts, Wall Street Journal, and #1 Amazon Kindle bestselling author Kerry Lonsdale  “Highly recommended for lovers of time travel fiction or anyone looking for a compelling story about a woman trying to find happiness.” – Annabelle Costa, Author of The Time Traveler’s Boyfriend.",
  "genres": [
    "Time Travel",
    "Romance",
    "Fantasy",
    "Historical Fiction",
    "Historical Romance",
    "Italy",
    "Historical"
  ],
  "author": "Rachel Dacus",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/36570817-the-renaissance-club"
}