{
  "title": "The Solstice Prince",
  "description": "Rescued from slavers, healer novice Jaime Buchanan finds himself alone and free in Pyrderi, a kingdom of magic, mythical creatures, and a culture as open and kind as his homeland was cruel and close-minded. Despite his rescue, Jaime is not left without scars, both mental and physical. Traumatized by his experience and hiding his gift, Jaime struggles to earn his place in the kitchens of Angharad Palace, the heart of Taliesin City. His former life as a student of the healing arts leaves him at a disadvantage in the kitchens, and his damaged state is becoming more apparent by the day. One day, when necessity and fate intervene, Jaime meets someone unexpected—Prince Maxim, youngest son of the Pyrderian king, a sword master and a devastatingly kind man. Unaccustomed to powerful people with compassion and heart, Jaime flees. A cascade of events reveals Jaime’s hidden talents of healing, and he finds himself not in chains, but at the beginning of a new life.This swift change of fortune opens Jaime up to new possibilities, including a smitten prince who cautiously courts Jaime, easing him away from his fears and reminding him that compassion and love can make him strong. The winter solstice is quickly approaching, and Prince Maxim shows Jaime the enjoyment and excitement to be found in a land that embraces the ice and cold, and the mysteries of all things magical. He learns to see the man under the royal mantle, and Maxim is more than even Jaime suspected. The winter solstice is nigh when tragedy strikes, and Jaime learns that his past of grief and sorrow can be a pillar of strength for his solstice prince. If there is one thing that Jaime believes above all else, it is in the healing power of love.",
  "genres": [
    "Fantasy",
    "Romance",
    "M M Romance",
    "Magic",
    "LGBT",
    "Audiobook",
    "Historical"
  ],
  "author": "S.J. Himes",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/36566371-the-solstice-prince"
}