{
  "title": "Inspired: Slaying Giants, Walking on Water, and Loving the Bible Again",
  "description": "If the Bible isn't a science book or an instruction manual, what is it? What do people mean when they say the Bible is inspired? When New York Times bestselling author Rachel Held Evans found herself asking these questions, she embarked on a journey to better understand what the Bible is and how it's meant to be read. What she discovered changed her--and it can change you, too.Evans knows firsthand how a relationship with the Bible can be as real and as complicated as a relationship with a family member or close friend. In Inspired, Evans explores contradictions and questions from her own experiences with the Bible, If the Bible was supposed to explain the mysteries of life, why does it leave the reader with so many questions?What does it mean to be chosen by God?To what degree did the Holy Spirit guide the preservation of these narratives, and is there something sacred to be uncovered beneath all these human fingerprints?If the Bible has given voice to the oppressed, why is it also used as justification by their oppressors?Drawing on the best in biblical scholarship and using her well-honed literary expertise, Evans examines some of our favorite Bible stories and possible interpretations, retelling them through memoir, original poetry, short stories, and even a short screenplay.Undaunted by the Bible's most difficult passages and unafraid to ask the hard questions, Evans wrestles through the process of doubting, imagining, and debating the mysteries surrounding Scripture. Discover alongside Evans that the Bible is not a static text, but a living, breathing, captivating, and confounding book that can equip us and inspire us to join God's loving and redemptive work in the world.",
  "genres": [
    "Nonfiction",
    "Religion",
    "Christian",
    "Faith",
    "Theology",
    "Christianity",
    "Spirituality"
  ],
  "author": "Rachel Held Evans",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/36576151-inspired"
}