{
  "title": "Divided: Why We're Living in an Age of Walls",
  "description": "New from the No.1 Sunday Times bestselling author of Prisoners of GeographyWe feel more divided than ever.This riveting analysis tells you why.Walls are going up. Nationalism and identity politics are on the rise once more. Thousands of miles of fences and barriers have been erected in the past ten years, and they are redefining our political landscape. There are many reasons why we erect walls, because we are divided in many ways: wealth, race, religion, politics. In Europe the ruptures of the past decade threaten not only European unity, but in some countries liberal democracy itself. In China, the Party’s need to contain the divisions wrought by capitalism will define the nation’s future. In the USA the rationale for the Mexican border wall taps into the fear that the USA will no longer be a white majority country in the course of this century.Understanding what has divided us, past and present, is essential to understanding much of what’s going on in the world today. Covering China; the USA; Israel and Palestine; the Middle East; the Indian Subcontinent; Africa; Europe and the UK, bestselling author Tim Marshall presents a gripping and unflinching analysis of the fault lines that will shape our world for years to come.‘A timely and exhilarating clamber over the walls of history’ – Peter Frankopan, author of The Silk Roads“Striking words … Tim Marshall performs the daunting, yet highly pertinent, task of trying to make sense of one of the biggest issues of our times: in a world that is increasingly globalised, a backlash apparently grows ever stronger. By taking a global view, Divided successfully brings some much-needed perspective” – Northern Slant",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Geography",
    "Audiobook",
    "Society",
    "Economics"
  ],
  "author": "Tim  Marshall",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/36570350-divided"
}