{
  "title": "Outworld",
  "description": "In the future, Climate Change is no longer a theory.It has been a thousand years since the climate of the Earth changed. Now the average high temperature is 120 degrees Fahrenheit with some days reaching 130 or more. Rain rarely reaches the parched ground, evaporating instead in the thermal barriers encasing much of the land and returning to the clouds.On the wind-swept tall grass prairie of what was once known as the Great Plains, two communities, the descendants of survivors from the time before the change, live in relative isolation from one another with only sporadic, but often violent, contact over the centuries.The Dome, a protective, insulating bubble perched upon the prairie, holds the last of the society of the “Before Time.\" A corporate culture, the Dome is governed by a Board of Directors who directs the work of associates who perform the day-to-day tasks of maintaining the structure against the heat, wind and drought of the “Outworld.\" Chief among these associates are Security, enforcers charged by the Board to maintain order within the Dome and who patrol the Outworld for any possible threat.But, the Outworld is also home to the Nomads, naked sub-human mutes who wander the land, seemingly adapted to the extreme heat and lack of water. To the Dome Dwellers the Nomads are nothing more than a shadow of what was once been known as mankind. The centuries and the climate devolved the Nomads into sub-human creatures who somehow scratched out a survival in the desolate land.But, the Nomads are good hunting.“The Hunt” is a favored recreation for the bored Security officers on patrol. Using their hovercraft, monitors and weapons, Security hunts the isolated Nomads across the tall grass, rock and dust of the Outworld with escape or death as the only options for the Nomad.Into this time comes Daniel, a young, newly appointed Captain of Dome Security. Tasked with capturing a live Nomad for research, the Captain and his teams bring a female Nomad back to the Dome for vivisection and analysis.The unexpected escape of the Nomad, something that had never happened before, sets into motion an arduous journey in which Daniel discovers not only the secrets of the Nomads but also of the Dome and even the long ago Before Time.",
  "genres": [],
  "author": "N. Harold Donley",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/12207352-outworld"
}