{
  "title": "Auschwitz Lullaby",
  "description": "Based on the true story of a brave German nurse tasked with caring for Auschwitz’s youngest prisoners.Auschwitz Lullaby brings to life the story of Helene Hannemann—a woman who sacrificed everything for family and fought furiously for the children she hoped to save.On an otherwise ordinary morning in 1943, Helene Hannemann is preparing her five children for the day when the German police arrive at her home. Helene’s worst fears come true when the police, under strict orders from the SS, demand that her children and husband, all of Romani heritage, be taken into custody. Though Helene is German and safe from the forces invading her home, she refuses to leave her family—sealing her fate in a way she never could have imagined.After a terrifying trek across the continent, Helene and her family arrive at Auschwitz and are thrown into the chaos of the camp. Her husband, Johann, is separated from them, but Helene remains fiercely protective of her children and those around her. When the powers-that-be discover that Helene is not only a German but also a trained nurse, she is forced into service at the camp hospital, which is overseen by the notorious Dr. Mengele himself.Helene is under no illusions in terms of Dr. Mengele’s intentions, but she agrees to cooperate when he asks her to organize a day care and school for the Romani children in the camp. Though physically and emotionally brutalized by the conditions at Auschwitz, Helene musters the strength to protect the children in her care at any cost. Through sheer force of will, Helene provides a haven for the children of Auschwitz—an act of kindness and selflessness so great that it illuminates the darkest night of human history.Based on a true story, Mario Escobar’s Auschwitz Lullaby demonstrates the power of sacrifice and the strength of human dignity—even when all hope seems lost.",
  "genres": [
    "Historical Fiction",
    "Holocaust",
    "Fiction",
    "World War II",
    "Historical",
    "War",
    "Audiobook"
  ],
  "author": "Mario Escobar",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/36576005-auschwitz-lullaby"
}