{
  "title": "It's Not Always Depression: Working the Change Triangle to Listen to the Body, Discover Core Emotions, and Connect to Your Authentic Self",
  "description": "Fascinating patient stories and dynamic exercises help you connect to healing emotions, ease anxiety and depression, and discover your authentic self.   Sara suffered a debilitating fear of asserting herself. Spencer experienced crippling social anxiety. Bonnie was shut down, disconnected from her feelings. These patients all came to psychotherapist Hilary Jacobs Hendel seeking treatment for depression, but in fact none of them were chemically depressed. Rather, Jacobs Hendel found that they’d all experienced traumas in their youth that caused them to put up emotional defenses that masqueraded as symptoms of depression. Jacobs Hendel led these patients and others toward lives newly capable of joy and fulfillment through an empathic and effective therapeutic approach that draws on the latest science about the healing power of our emotions.   Whereas conventional therapy encourages patients to talk through past events that may trigger anxiety and depression, accelerated experiential dynamic psychotherapy (AEDP), the method practiced by Jacobs Hendel and pioneered by Diana Fosha, PhD, teaches us to identify the defenses and inhibitory emotions (shame, guilt, and anxiety) that block core emotions (anger, sadness, fear, disgust, joy, excitement, and sexual excitement). Fully experiencing core emotions allows us to enter an openhearted state where we are calm, curious, connected, compassionate, confident, courageous, and clear.   In It’s Not Always Depression, Jacobs Hendel shares a unique and pragmatic tool called the Change Triangle—a guide to carry you from a place of disconnection back to your true self. In these pages, she teaches lay readers and helping professionals alike   • why all emotions—even the most painful—have value. • how to identify emotions and the defenses we put up against them. • how to get to the root of anxiety—the most common mental illness of our time. • how to have compassion for the child you were and the adult you are.   Jacobs Hendel provides navigational tools, body and thought exercises, candid personal anecdotes, and profound insights gleaned from her patients’ remarkable breakthroughs. She shows us how to work the Change Triangle in our everyday lives and chart a deeply personal, powerful, and hopeful course to psychological well-being and emotional engagement.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Mental Health",
    "Health",
    "Personal Development",
    "Audiobook"
  ],
  "author": "Hilary Jacobs Hendel",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/36585127-it-s-not-always-depression"
}