{
  "title": "Art of War",
  "description": "How do you get forty fantasy authors to contribute short stories for a war-themed anthology without paying them? It sounds as if there should be a good punchline to that, but all Petros Triantafyllou did was twist the moral thumbscrews and tell them all the profits would go to Doctors Without Borders, a charity that works tirelessly across the world to alleviate the effects of conflict, sickness and poverty.So, with clear consciences, several busloads of excellent and acclaimed fantasy authors have applied themselves to the task of penning a veritable mountain of words on the subject of The Art of War, expect bloodshed, gore, pathos, insight, passion, and laughs. Maybe even a wombat. Who knows. Anyway, as the original blurb said: \"It's good. Buy it.\"-Mark LawrencePrint version includes forty black & white interior art pieces.contents:The Breaking of the Sky by Ed McDonald, prequel for the Raven's Mark seriesThe Last Arrow by Mitchell Hogan, short story from the Sorcery Ascendant SequenceDear Menelaus by Laura M. HughesWarborn by C.T. PhippsThe Greatest Battle by John Gwynne, short story from The Faithful and the Fallen seriesThis War of Ours by Timandra WhitecastleShadows in the Mist by Sue TingeyThe Art: Post War by RJ BarkerThe Fox and the Bowman by Sebastien de CastellArrow’s Wrath by Charles F. BondHard Lessons by Michael R. Miller, short story from The Dragon's Blade seriesA Battle for Elucame: Leah by R.B. WatkinsonThe Revolution Changed Everyone by D. Thourson PalmerMisplaced Heroism by Andrew RoweViolet by Mazarkis WilliamsThe Two Faces of War by Rob J. HayesGrannit by J.P. AshmanAsalantir Forever by Steven PooreTower of the Last by Steven KelliherThe Waving of the Flag by Thomas R. GaskinThe Art of War by Brian StaveleyHero of the Day by Nathan T. BoyceSacred Semantics by Nicholas EamesThe War God's Axe by Anne Nicholls, short story from Empires of DustThe Feather and the Paw by Benedict Patrick, short story from YarnsworldUntil the Light had Faded by Graham Austin-KingUnder the Queen’s Throne by Ed GreenwoodGood Steel by Zachary BarnesThe Cost of Power by Ulff LehmannThe Undying Lands by Michael R. FletcherThe Fall of Tereen by Anna Smith SparkValkyrie Rain by Dyrk Ashton, short story from the Paternus seriesChattels by Stan NichollsThe Storm by Miles CameronShortblade by Brandon DragaRendered Chaos by D.M. MurrayThe Best and Bravest by M.L. SpencerExibition (sic) by Ben GalleyFlesh and Coin by Anna StephensThe Hero of Aral Pass by Mark Lawrence, short story from The Red Queen's War",
  "genres": [
    "Fantasy",
    "Anthologies",
    "Short Stories",
    "Epic Fantasy",
    "Fiction",
    "High Fantasy",
    "Dark"
  ],
  "author": "Petros Triantafyllou",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/36580177-art-of-war"
}