{
  "title": "The Yoga of Leadership: A Practical Guide to Health, Happiness, And Inspiring Total Team Engagement",
  "description": "National Indie Excellence Award Winner!Big, bold success in the world begins in the private calm of a serene consciousness. Speaking and acting with control and clarity, the best leaders inspire their organizations to thrive. They establish cultures of wellbeing and purpose. This comprehensive guide to health, wellbeing and principled leadership shows you how to clear your mind, engage your team, and find greater satisfaction in your work and life. Tarra Mitchell shares exercises to help individuals and groups create an organizational culture that works for everyone – especially Millennials. With a combination of actionable information and personal stories, Tarra demystifies time-honored, ancient teachings and shares them in a light and accessible way. Formative moments in her youth, education, and motherhood bring abstract wisdom down to earth. Her keen and touching reflections remind us of our common humanity and fundamentally similar needs. This book's approach has the power to build a generation of great, inspiring leaders, transforming lives, organizational cultures, and even societies. Deep roots in the business and yoga worlds support Tarra's unconventional but pragmatic look at what it means to be a leader, which ultimately reveals how success is intertwined with personal wellbeing. Drawing on the Upanishads, one of the world's oldest written spiritual texts, and her own rich life experience, she takes you through an examination of yourself as you create a plan that will enhance your health, happiness, and capacity to lead through principle. This focus on the whole person yields unprecedented levels of success and vitality. The Yoga of Leadership offers specific tools, techniques, and practices for:•Managing stress and improving concentration.•Refining communication and culture.•Identifying your purpose.With Tarra's guidance, you will customize personal practices that work for you. Your practices will help you strengthen your relationships and improve your health and wellbeing. You will return to her words throughout your life as you take on new roles, embrace new challenges, and inspire new constituencies. Current and future leaders, business school students, and anyone seeking inner calm and purpose cannot afford to miss this book.",
  "genres": [
    "Leadership",
    "Nonfiction",
    "Self Help",
    "Spirituality",
    "Health",
    "Business"
  ],
  "author": "Tarra Mitchell",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/36584297-the-yoga-of-leadership"
}