{
  "title": "Lucian Sword- Casey Blane Series",
  "description": "Casey Blane returns to the old coven's grounds to take her place as the high priestess to the Letorian Coven and in search for the lost talismans. What she discovers is far more than she ever could have envisioned. Brought to a world of faeries and the magic of the Druids, Casey must learn to come to terms with herself and her gifts quickly to survive and change the prophecy. Her first battle is finding the Lucian Sword. Casey Blane Over 400 years ago, King Davalian, The Letorian King, protected the covens from the Pandions and townspeople during the medieval times of the black plague and the witch hunts. Two very gifted sorcerers were part of his army and fought alongside him. One was a woman named Lily who not only helped him to victory but won his heart. Lily was not at all interested in King Davalian. Her love was Connell, the other gifted sorcerer. During King Davalian’s reign, Lily discovered the secret to eternal life through a series of talismans, a reborn vampire, which she tried on herself. Connell was to be next, and they were to live out their lives, each generation, with each other. Except, that night, things went horribly wrong and even though both had been blessed with eternal life their bond was never completed. Instead, in a jealous rage, King Davalian cursed Connell and forced him to an entity of being controlled by the moon and to never forget. Connell was forced into a wolf, and after King Davalian’s death, Lily became their queen. That was when a devastating prophecy of her great-granddaughter was told. Her great-granddaughter would be slaughtered by the King to the Pandions, the talismans were to be found, and it would be the demise of the Letorian Coven. The Pandions were destined to be the new ruling coven and destroy everything on its way to get there. The series begins with Lily’s great-granddaughter, Casey Blane, who has been kept hidden her entire young human life for them to try to change the prophecy until one day when she’s discovered by the Pandions. What happens next will change her life forever.",
  "genres": [],
  "author": "Jodi Ann Fahey",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/36584637-lucian-sword--casey-blane-series"
}