{
  "title": "The Charm of Revenge",
  "description": "WANT TO READ the Prologue and first 15 (of 80) chapters FREE? Go to www.TomSecretAuthor.comWHAT HAPPENS WHEN AN IRS DEPARTMENT TURNS ROGUE?Six years ago, Brad and Lola Fairweather ran through the hospital corridors searching for a doctor to save their baby, Daisy, but they ran into cops. They gunned Brad, dragged him away like a slab of meat, and left Daisy to die in her mother’s arms.Now they have another daughter, Lilly. She’s four and their son, Jack, is eleven. They’re the reason Brad and Lola keep going. But when a bogus tax demand arrives, it triggers a chain of events that forces the Fairweather family to take the law into their own hands, with devastating consequences. As events unfold, they discover their names are on a sinister government list, and their enemy wants to finish what he started, all those years ago.With the dead bodies piling up, Detective LT. Donatello hunts for the vigilante killer the press are calling \"a hero,\" but finds himself caught in a complex web of organized crime, kidnapping and murder, with the evidence pointing to just one person, and that's bad news, for him!Goodreads & Amazon Reader Reviews“A thrilling ride, with three-dimensional characters and a story that will have you racing to the end, where everyone has a secret to tell, including the dead.\" — Michael Carr – Editor of a dozen New York Times best sellers and another dozen Wall Street Journal, Los Angeles Times International, and Amazon best sellers.“This is a fantastic fast paced story. Tom Secret has woven ‘real-life’ villainous gut wrenching subjects, into a brilliant intricate web. The characters are layered, complex and gritty and Lieutenant Donatello is straight off a movie set. I found him so engaging I can't wait to journey with him again.Excellent twists and turns right to the very end.” P. Mia“Wow, what a ride!!!!I had not read such an action-packed book in months.The book has so many twists and mysteries that sometimes it seems that even the skeletons in the closet have their own skeletons in the closetOf course, there is gore, violence and abominable crimes, so make sure you're not faint-hearted before reading itI'm not a bad guy who likes to give spoilers, and I don't want to ruin your right to discover all the crazy secrets of this book by yourselves, so I'll describe the story in general termsCliffhangers - Every 1-2 chaptersFamily secrets - One, two three.... manyHeart rate while reading is too highDangerous sicko crooks are around every cornerSo, Ladies and Gentlemen, I proudly declare this book a page-turner.” S. Lenkevich“I give This Book a 4.5 rating as this has been a great book compared to the standards of new and rising talents!! The story was beautifully told and kept us in the grips till the very last. I was blown away by the final twist in the very last goddamn line!” Kaushik N.P“Really good thriller: An excellent police psychological thriller. I can recommend it to anyone. I want to read more by this author. Excellent twists.” K. Bracy“I found this book very enjoyable from start to finish. It has everything and keeps you locked in to the story line the whole time…” Heather GR reviewerOne of the best books I have read this year!!This book was excellent....First time I have read this author and am looking forward to his next book. Could not sleep one nite so thought I would read for a bit.....ha ....could not put it down....just kept going totally hooked.” June“Very clever plotting. Very fast moving and good character development. I will recommend to my friends. I am glad I found the book. Bookbub. Thank you.” Amazon.com reviewer",
  "genres": [
    "Thriller",
    "Fiction",
    "Crime"
  ],
  "author": "Tom Secret",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/36581594-the-charm-of-revenge"
}