{
  "title": "The Mutinous Contemplations of Gemma Groot",
  "description": "Venetia Warboys, by most accounts, a mild-mannered, generous, church-going woman, had reached her thirty-fifth year with little out of the ordinary happening in her life. Until she decided, one evening, to rise from her neatly-laid dinner table, fetch an axe from the woodshed, chop her husband into pieces and bake his gristle into some pies. \"That's the last time he'll criticize my pastry,\" she said calmly when apprehended in the act of selling her grisly wares.Although her husband had been an infamous philanderer— or as much of one as an oily, simpering blob of a man could be in a small, rural market town—nobody knew what had really happened, on that last day, to cause a deadly fissure in his wife's sanity. I was the only soul to whom she gave any clue, but the six words she once whispered into my ear left me, a girl of twelve at the time, with more questions than answers. Suffice to say, after Venetia's axe swinging rampage in the autumn of 1882, the men of Withering Gibbet took greater care of what they said and did to their wives. We had all learned some important lessons: everybody harbors dark truths; there is no such thing as \"ordinary\", and never buy a savory pie at the county fair, especially when the contents are described as \"revelation meat\".For many years Venetia was our town's sole claim to infamy. And then there was me.* * * *So begins a story of silence and noise, secrets and lies, sisters and lovers, murder and redemption. Gemma Groot grows up in the long shadow cast by an old sin, but she is about to step out of the dark and shine the light on a few startling truths about her family. With the help of a man who falls out of the sky, she will finally discover the strength she needs to revisit the past and unleash the spirit of a wronged woman. But will she find that some skeletons are better off left buried?",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical"
  ],
  "author": "Jayne Fresina",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/36592991-the-mutinous-contemplations-of-gemma-groot"
}