{
  "title": "Day of Judgment",
  "description": "Is there justice in America? Lives and cultures collide in this action-packed adventure! The author uses characters he has actually encountered but in fictional contexts. Locations are actual places where the author has lived or spent considerable time visiting. Characters represent a broad cross-section of U.S. society: first-generation Americans struggling to adapt, gay men living in a society in which their identity cannot be exposed, recent immigrants as well as minorities. The story is designed to entertain as well as inform and foster acceptance, understanding, tolerance, and respect.The Hammoud family has worked and lived comfortably in the semi-rural, semi-isolated Appalachian area of southwest Virginia for years until a violent attack against Arabs disrupts their American-dream life. Frank and Brad each live and work in a \"don't ask, don't tell\" environment until violence by disaffected Arabs sends them seeking answers. Arab-Muslim professionals, Joe and Omar, are committed to seeking justice! Joe, a brilliant young Arab-American attorney, seeks justice in the courtroom and starts the process of becoming one of the country's experts on hate crimes. At the same time, his very good friend Omar, an equally brilliant Islamic theologian, originally from Yemen but now on a path to U.S. citizenship, seeks justice within the spiritual realms of Allah. Their activities represent the double entendre in the title, Day of Judgment, a judgement in the US legal system and judgment before Allah. Filled with international terrorism at the hands of those whose Muslim and Islamic fronts hide their true desires to gain wealth and power, Day of Judgement reveals the harsh reality of what it means to live as an Arab in America when the scales of justice are so often stacked against you!",
  "genres": [
    "Fiction",
    "Dark"
  ],
  "author": "Heath Daniels",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/36601391-day-of-judgment"
}