{
  "title": "Gun Kiss",
  "description": "A stolen piece of history, an abducted actress and international intrigue…When the Deringer pistol that shot Abraham Lincoln is stolen and ends up in the hands of a Russian military general, covert agent Blake Deco is tasked by the FBI to head to the Balkans to recover the historical weapon. Meanwhile, the United States media is abuzz with news of the mysterious disappearance of Hollywood movie star, Goldie St. Helen.After Blake’s return from overseas, he receives a tip from a Mexican friend that a drug lord, obsessed with the beautiful actress, is holding her captive in Tijuana. With the help of a reluctant army friend, Blake mounts a daring rescue. What he doesn’t expect is to have feelings for Goldie—or that a killer is hunting them.Editorial “From Washington, D.C. to Hollywood and Veracruz, Gun Kiss by Khaled Talib is a terrific adventure involving the FBI, drug lords, movie stars, and Russian generals. Grab your copy, drop into your favorite reading chair, and prepare yourself for breathless suspense.” —Gayle Lynds, New York Times bestselling author of The Assassins“ Gun Kiss is a whip-smart thriller that brings to mind Don Winslow's masterful work that includes, most recently, The Force . Khaled Talib rockets to the top of the pop culture pack with a tale in which every page is chock full of angst-riddled action and searing suspense. Gun Kiss manages to be hot and cool at the same time, a genre bender that breaks a host of rules while crafting new ones in their place. Featuring both a classic man-of-mystery hero and an equally classic femme fatale, this is reading entertainment of the highest order.” —Jon Land, USA Today bestselling author of The Rising“Take a deep breath, because Gun Kiss 's special brand of high-octane action is on its way to market, and it's a hell of a ride especially recommended for thriller readers who like their action not only nonstop, but tempered with a bit of romance and a lot of world-hopping political confrontations…with a range of subplots designed to keep Gun Kiss unpredictable, unexpected, and sometimes unsettling as events keep on creating new connections and surprises…Readers experience a supercharged plot that grabs interest tightly and does not let go. The mark of a superior thriller lies in its ability to seamlessly transcend borders, boundaries, and special interests to provide a series of interwoven subplots that all come together in a satisfying crescendo of intrigue designed to keep readers on edge right up to the end. Take a deep breath before reading Gun Kiss . Its special brand of activity and complex personal and criminal interactions makes it hard to put down, and highly recommended for thriller and crime readers alike.” —Diane Donovan, Senior Reviewer, Midwest Book Review“Talib’s wisecracking hero in Gun Kiss propels readers on an unforgettable ride across several continents. This blockbuster thriller offers the perfect mix of elements to satisfy any reader, including the quest for historic artifacts, a fierce battle against drug lords, and a memorable romance with a Hollywood starlet. Add it to your must-read list.” —K.J. Howe, author of The Freedom Broker",
  "genres": [
    "Crime",
    "Thriller"
  ],
  "author": "Khaled Talib",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/36603092-gun-kiss"
}