{
  "title": "Sky in the Deep",
  "description": "AN INSTANT NEW YORK TIMES BESTSELLER! A 2018 Most Anticipated Young Adult book from debut author Adrienne Young, Sky in the Deep is part Wonder Woman, part Vikings—and all heart.OND ELDR. BREATHE FIRE.Raised to be a warrior, seventeen-year-old Eelyn fights alongside her Aska clansmen in an ancient, rivalry against the Riki clan. Her life is brutal but fight and survive. Until the day she sees the impossible on the battlefield—her brother, fighting with the enemy—the brother she watched die five years ago.Faced with her brother's betrayal, she must survive the winter in the mountains with the Riki, in a village where every neighbor is an enemy, every battle scar possibly one she delivered. But when the Riki village is raided by a ruthless clan thought to be a legend, Eelyn is even more desperate to get back to her beloved family.She is given no choice but to trust Fiske, her brother’s friend, who sees her as a threat. They must do the unite the clans to fight together, or risk being slaughtered one by one. Driven by a love for her clan and her growing love for Fiske, Eelyn must confront her own definition of loyalty and family while daring to put her faith in the people she’s spent her life hating.“THIS IS A GRIPPING STORY, RICHLY TOLD.” —Renée Ahdieh, New York Times bestselling author of Flame in the Mist\"FIERCE, VIVID, AND VIOLENTLY BEAUTIFUL.” —Stephanie Garber, New York Times bestselling author of Caraval“A STUNNING DEBUT” —Roshani Chokshi, New York Times bestselling author of The Star-Touched Queen“BLEAK BEAUTIFUL AND DEADLY” —Traci Chee, New York Times bestselling author of The Reader“WHOLLY UNIQUE AND INSTANTLY ADDICTIVE” —Kerri Maniscalco, New York Times bestselling author of Hunting Prince Dracula “HEARTRENDING, HEART-MENDING” —Kayla Olson, bestselling author of Sandcastle Empire",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Historical Fiction",
    "Romance",
    "Young Adult Fantasy",
    "Enemies To Lovers",
    "Historical"
  ],
  "author": "Adrienne Young",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/36597702-sky-in-the-deep"
}