{
  "title": "Rogue: Information Rogue / Desert Rogue",
  "description": "Abducted by alien slavers and taken to a lawless desert world, the last thing she expects is to be claimed by a handsome alien rogue...\n\n\n\nRogue contains two action-packed novellas in the Galactic Gladiators series.\n\n\nNovella #1: Information Rogue\n\n\n\nArrogant information merchant Zhim doesn't know what hits him when he collides with feisty human hacker Ryan...\n\n\nRescued by the humans and gladiators from the House of Galen, Ryan Nagano is working hard to piece her life back together. Her priorities are conquering her anxiety, recovering from her captivity, and using her exceptional computer skills to help the House of Galen decrypt alien data that could reveal the location of other abducted humans. That's all she's focused on. But when she needs help, she finds herself having to work with arrogant genius Zhim... and discovers that the two of them redefine the word explosive!\nZhim thrives on the need to uncover information and ensure his wealthy, carefully constructed life is exactly as he wants it. Then one infuriating menace of a woman blasts into his life. Ryan matches him skill for skill, drives him crazy, and worms her way under his skin. But forced to take her deep into Kor Magma's shadowy hacker underworld, Zhim soon learns exactly what he's willing to risk to keep Ryan safe!\n\n\nNovella #2: Desert Rogue\n\n\n\nPrickly, independent human Neve doesn't want or need any help…But a certain cocky desert rogue isn't taking no for an answer!\n\n\nNeve Haynes survived her abduction through grit and determination. She's always made her own way through life, depends on no one, and is determined to achieve her own personal mission. So, as she sneaks out of the House of Galen, the last thing she needs is help in the form of a tawny-haired, lean-hipped caravan master with more confidence and swagger than any man she's met before!\nCorsair is a man of the desert and leader of the Corsair Caravan. He listens to his gut and something about Neve draws him in. He can't let her go off and get herself killed, but she's the most skittish, strongest woman he's ever met. As they trek deep into the desert on a dangerous mission to find a map to an infamous desert arena, they will fight side by side and be forced to depend only on each other to survive. And in Carthago's desert sands, they will uncover a desire that burns hotter than the desert sun!",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Science Fiction Romance",
    "Fantasy",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "Anna Hackett",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/36593716-rogue"
}