{
  "title": "The White Queen: The Complete Series",
  "description": "A scientist searches for a cure that will save her people… while being courted by the five enormous dragon shifters who are her fated mates!\nJoon is a genetic biologist working to discover a cure for the plague that has all but destroyed the birthrate for her species. But now that her twenty-first birthday has arrived, other duties demand her attention...\nShe’s now the reluctant queen... and has not one, but five, fated mates. Worse, they’re all in thrall, and will die if they can’t claim her in time!\nJoon must find a way to balance her vital quest to save her race with the equally urgent need to submit to her mates. The more time she spends with them, the more she discovers all that she’s been missing...\nWill her sensual awakening be the answer Draxos needs? Or will she fail both her mates and her planet?\n\nThis six-part serial should be read in order:\n\n\nPart 1\n\nOn Joon’s twenty-first birthday, Draxos has a tournament to find her fated mate!\n\nPart 2\n\nJoon, now the queen, is spending late nights at the lab doing research… but must find time for the five males waiting to claim her!\n\nPart 3\n\nJoon discovers a vital clue about the ancient connection between humans and dragons… and learns an unforgettable lesson from her mate Donte...\n\nPart 4\n\nJoon’s brother, Admiral Sysko, is excited by her discovery, while her mates are eager to take things to the next level...\n\nPart 5\n\nJoon and her science team make a breakthrough… but the mating thrall can’t wait any longer. Is she ready to be claimed by five hungry dragon shifters at once?\n\nPart 6\n\nJoon is certain she’s found the cure for the plague - but she’s alienated everyone she cares about. Can she find a way to rescue her relationship with her mates?",
  "genres": [
    "Reverse Harem",
    "Aliens",
    "Paranormal",
    "Romance",
    "Dragons",
    "Shapeshifters"
  ],
  "author": "Scarlett Grove",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/36596253-the-white-queen"
}