{
  "title": "The Honest Drug Book: A Chemical & Botanical Journey Through The Legal High Years",
  "description": "The Honest Drug Book presents the hidden truth about a topic which touches the lives of almost everyone. It cuts through the blustering rhetoric of the war on drugs, and documents the facts about the subject in general, and about the individual drugs specifically.This is a journey through 140 psychoactives, both chemical and botanical, each of which was personally tested and used by the author. For every drug, it lists the fundamental and sometimes life-critical information, including the anticipated onset, the common threshold doses, and the expected period of efficacy.It also describes the subjective experience: what the drug was actually like at each stage of the duration. These ‘trip reports’ are vital, as they help to identify pitfalls and specific risks for each substance. Often, this is achieved in a humorous and anecdotal manner, which is occasionally accentuated by the fact that the author had to travel the world to undertake the experiments lawfully.In addition to these often rich and lengthy reports, the book is crammed with data and general information, inclusive of legal briefings, relative harm tables, addiction and overdose advice, detailed reference material, and even a drug dictionary.Of critical importance is the first section, as it introduces the basics of harm reduction, in the form of a 10 step procedure to help mitigate risk. The same section explains core safety issues, such as how to test and identify a drug, and how to properly establish a dose.The book itself is lavishly illustrated with hundreds of photographs, including of the drugs themselves. The images in the botanical section also encompass some of the indigenous settings encountered on the journey.The full gamut of psychoactive chemicals and botanicals is covered. The well known include: LSD, heroin, cannabis, mephedrone, kratom, cocaine, 2C-B, DMT, yopo, methamphetamine, salvia divinorum, ketamine, ayahuasca and MDMA. The lesser known include: betel nut, 4-ho-met, changa, TPA, 4F-MPH, ephenidine, ololiuqui, cebil seeds, mapacho, MNA, celastrus paniculatus, yohimbe, and MEAI.The scope also extends beyond the most common categories of hallucinogens, stimulants, depressants, cannabinoids and opioids. Included, for example, are nootropics (smart drugs) and oneirogenics (lucid and vivid dream herbs).Another dimension, which is covered largely in the final section, is that of politics and the war on drugs. This is confronted head-on, with a statement of intent which is crystal clear:“People are dying because of ignorance. They are dying because unremitting propaganda is denying them essential safety information. They are dying because legislators and the media are censoring the science, and are ruthlessly pushing an ideological agenda instead. They are dying because the first casualty of war is truth, and the war on drugs is no different. This book is a step to counter this harrowing and destructive situation.”Emphasised and underpinned throughout is personal safety and risk mitigation. This is the first and last message, and guides the entire narrative.This is a book that won’t only fascinate and inform: it will save lives.",
  "genres": [
    "Science"
  ],
  "author": "Dominic Milton Trott",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/36593306-the-honest-drug-book"
}