{
  "title": "Songbird",
  "description": "“You’re the big boss.” She looked up at me and smiled. She was dressed in a cheap cotton shirt and jeans that should be on the burn pile, but that smile was pure gold. This girl had guts.“I told José he was a fool to try and cheat you,” she said. “I wasn’t part of it, and I don’t work for you. I was just in the wrong place at the wrong time.”She’d heard about our policy protecting bystanders. Of course it doesn’t apply to anyone whose eyewitness testimony can put me in a courtroom. Well, try to put me in a courtroom. In Mexico nobody would dare accuse me, and I’ve enough resources in England to guarantee a police investigation would come to nothing, but it’s not my style to take chances. Solitaire would be going into the ground along with Escamilla.“Mr Vazquez,” Solitaire gave me her best smile. “I don’t expect something for nothing.” She dropped her voice. “You’d like me,” she whispered. “I’ve heard about you. We’re the same.”“Are we?”“Yes, I can make you very happy.” She brushed my hand over her cheek and then kissed my palm. “I’m a very good girl,” she said quietly. “Unless you prefer a naughty one?”She sucked my thumb, and I was instantly rock hard.----------------------------When cartel boss Arturo Vazquez discovers his girlfriend Gina is a DEA rat and his deputy Escamilla is staging a take-over, Arturo fixes his problems by killing everyone - except for Solitaire, Escamilla’s unwilling mistress. Solitaire is intelligent, tough, and shares Arturo’s interest in BDSM. Arturo falls head over heels but someone is leaking information - and the evidence point at Solitaire.Songbird is a complete and self standing novel. Warning: This book contains explicit scenes of dubious consent, graphic violence and sex.",
  "genres": [
    "BDSM",
    "Dark",
    "Romance",
    "Dark Romance",
    "Erotica",
    "Contemporary",
    "Mafia Romance"
  ],
  "author": "A.J. Adams",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/36604064-songbird"
}