{
  "title": "Don't Tempt Fate",
  "description": "Don't Tempt Fate  Book 11 of the Cloverleah Pack series.  Pack enforcer, Marius Reef has a lot on his mind. Life in Cloverleah has been quiet for months; giving him too much time to think. He still suffers nightmares from his father's abuse decades ago and now his brothers are mated, he is struggling to find and keep his place in the pack. Determined to be useful, his waking hours are spent patrolling the pack's territory but at night his dreams are haunted by a hunky blond, so perfect he couldn't exist in real life.  As the Battle Lord for his people, Cathair is used to being sent from the elven realm to dispel injustices found on many realms including earth. Guided by the Seers, he's never questioned his assignments before. But when his father, the High Elder insists he must take a message to a tiny pack in the middle of nowhere, and actually stay with them, he puts up a token protest. His place was on the elven realm, wasn't it?  Prophecies and kidnappings, the evil that stalks Cloverleah is getting closer and all will be affected. Plagued with troubles and misunderstandings on both realms, Marius and Cathair must forge a bond or the whole pack could be lost. But when trouble comes from one of their own, the two men reach a crossroads. Will they choose the right path or will the fate of the Cloverleah pack be doomed?  This is an M/M story that includes some violence, references to past abuse and a scene of attempted rape (not between MCs). Like all of my books, it has an HEA, no cheating and no cliffhanger. However, the epilogue sets the scene for the next book in the series.  This book is part of a series and while this story is based on one couple and is complete in itself; to appreciate the over-arching story line and the stories behind the secondary characters, reading the previous books in order is advised.",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Shapeshifters",
    "Fantasy",
    "Romance",
    "Magic",
    "Gay"
  ],
  "author": "Lisa Oliver",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/36599696-don-t-tempt-fate"
}