{
  "title": "Longsword: Edward and the Assassin",
  "description": "If you like Bernard Cornwell, Ken Follett, David Gemmell, John Gwynne and Conn Iggulden, you will love this medieval adventure packed with battles, betrayals and swords.The debut novel Edward and the Assassin by Award Winning author Dimitar Gyopsaliev marks the start of the gripping historical fiction series Return of the Son.★★★★★“The plot is incredibly well-written and the characters are engaging. I was captivated by the story till the very end because of the challenges that Peter faced and how he overcame them. I applaud Gyopsaliev for the quality of his work since it captures the world of sword brothers’ bravery and the strength of camaraderie engagingly. I’d recommend this novel to anyone who enjoys historical fiction and action stories..” —Trevor Otieno for Readers’ Favorite\"The War must be for the sake of Peace\" —AristotleCity of Acre, Holy Land, Friday, 17th of June, in the year 1272 of the incarnation of Christ, on the eve of Edward's birthday. The Crusaders and Mamluks have recently signed a peace treaty when Peter Longsword, an orphan raised in a monastery, is caught in the storm of an assassination attempt on the royal Crusader. When he saves the life of the crown prince of England on his first day as a guard in the royal household, Peter is drawn irreversibly into a deep plot to discover who ordered the assassination and why. Peter encounters knights, mercenaries, infidels, and nobility and he learns about treachery, love, and loyalty in his journey toward the truth of his own origins as well as the truth of the murder attempt. With the help of his new friends, Peter will ride to the edge of the realm to prove the strength of his bloodline. Enemies will unite and new alliances will be forged in the struggle for power and peace. Longsword shows you the world of sword brothers' bravery and the power of friendship.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Dimitar Gyopsaliev",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/36614733-longsword"
}