{
  "title": "Explosive Growth: A Few Things I Learned While Growing To 100 Million Users - And Losing $78 Million",
  "description": "*Ranked 'BEST STARTUP BOOKS OF ALL TIME'' by Benzinga*Ranked' BEST GROWTH-HACKING BUSINESS BOOKS' by Entrepreneur.com#1 BEST-SELLER in 5 Startup & Entrepreneurship CategoriesThis compelling and inspiring narrative gives entrepreneurs a rare behind-the-scenes look inside a fast-growing startup that created the first online dating app and grew to 100 million users. Explosive Growth combines lively and often hilarious storytelling, revealing genius growth tactics, numerous case-studies, and its step-by-step playbook to help your startup grow massively.Due to its raw storytelling style, practical lessons, compelling content, and fast-paced read, Explosive Growth is a one-of-a-kind business book that transcends the narrow entrepreneurial audience to also appeal to readers and business students looking to learn about startup life and entrepreneurship. It holds nothing back while detailing the highest highs and lowest lows of what it's really like to run a startup.  Cliff Lerner's online dating startup, Snap Interactive, was running out of money when he bet the company's fortunes on a then-unknown platform called Facebook. The app suddenly began to acquire 100,000 new users daily for free, and soon after the stock price skyrocketed 2,000 percent, setting off an extraordinary chain of events filled with sudden success and painful lessons.You will learn how to:    * IGNITE EXPLOSIVE GROWTH by creating a remarkable product    * Identify the ONLY 3 METRICS THAT MATTER    * Explore valuable VIRAL GROWTH strategies to grow rapidly    * Execute the GENIUS MEDIA HACKS that helped us acquire 100 million users    * Create a thriving culture of PASSIONATE EMPLOYEES and CONSTANT INNOVATIONPRAISE:\"A must read for founders and CEOs who want to achieve rapid growth while also building a great product and company.\" -Payal Kadakia, Founder & Executive Chairman of ClassPass\"Explosive Growth is without question one of the most useful and entertaining business books I have ever read. Cliff gives you a roadmap to massively grow your startup with specific tactical lessons made memorable through engaging stories. This book is a must-read.\" -David Perry, Digital Sales & Business Development Expert at Google, Adobe, Amazon, Startup Advisor\"Want to know how to grow your startup to 100 million users? Then this is the book for you. Explosive Growth gives step-by-step instructions, case studies and proven tactics on how to explode your growth.\" -Entrepreneur Magazine by Syed Balkhi\"Lessons for startups and CEOs on growth hacking, marketing, and innovation from one of the smartest founders I know.\" -Andrew Weinreich, Inventor of Social Networking",
  "genres": [
    "Business",
    "Entrepreneurship",
    "Leadership",
    "Management",
    "Nonfiction",
    "Audiobook",
    "Biography"
  ],
  "author": "Cliff Lerner",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/36607149-explosive-growth"
}