{
  "title": "Wicked Captive",
  "description": "Wicked Captive is the 5th book in USA Today Bestseller and Amazon #1 Author, Carole Mortimer’s, Regency Sinners series.Author’s All the books in the very hot Regency Sinners series are complete and HEA stories. Books in the series are connected by the friendship of the heroes.Lord Jericho Black, the Marquis of Wessex, is not looking forward to the visit of his ward, Lady Jocelyn Forbes, to his Devonshire home.Jocey is not actually Jericho’s ward but his father’s. But as his father lives permanently in Scotland, and is considered to be eccentric by polite members of Society and more than a little strange by the majority, Jericho has taken it upon himself to act as Jocey’s guardian in his father’s stead these past three years.A bachelor of five and thirty, Jericho finds the role of guardian to a young lady difficult enough at the best of times, but finding himself charged with the unpleasant duty of proving or disproving whether Jocey is guilty of treason, is going to make this visit even more taxing than usual.Jocey is looking forward to seeing and being with Lord Jericho Black again, the man she has secretly been in love with since he became her guardian when she reached the age of eighteen. She is no longer that gauche and awkward young girl, and she is determined Jericho will now see her as a desirable woman, and worthy of his attention.From the moment Jocey arrives in Devon, even more beautiful than Jericho remembers her to be, and possessed of the sophistication and confidence of a woman who knows her own mind, Jericho quickly realizes it is not irritation he now feels toward Jocey but desire. A desire he is finding it more and more difficult to resist.When Jericho receives the shocking news of one close friend’s unexpected death, and the serious injury of another, it becomes imperative he learn the truth as quickly as possible, so as to avoid more blood being shed.Even if it requires Jericho make Jocey his prisoner and seduce the truth from her.",
  "genres": [
    "Historical",
    "Romance",
    "Regency Romance",
    "Historical Romance",
    "Regency"
  ],
  "author": "Carole Mortimer",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/36615490-wicked-captive"
}