{
  "title": "The Green Amendment: Securing Our Right To A Healthy Environement",
  "description": "The Constitutional Change We Need to Protect Our Priceless Natural Resources  For decades, activists have relied on federal and state legislation to fight for a cleaner environment. And for decades, they’ve been fighting a losing battle. The sad truth is, our laws are designed to accommodate pollution rather than prevent it. It’s no wonder people feel powerless when it comes to preserving the quality of their water, air, public parks, and special natural spaces.  But there is a solution, argues veteran environmentalist Maya K. van Rossum: bypass the laws and turn to the ultimate authority—our state and federal constitutions.  In 2013, van Rossum and her team won a watershed legal victory that not only protected Pennsylvania communities from ruthless frackers but affirmed the constitutional right of people in the state to a clean and healthy environment. Following this victory, van Rossum inaugurated the Green Amendment movement, dedicated to empowering every American community to mobilize for constitutional change.  Now, with The Green Amendment, van Rossum lays out an inspiring new agenda for environmental advocacy, one that will finally empower people, level the playing field, and provide real hope for communities everywhere. Readers will discover • how legislative environmentalism has failed communities across America, • the transformational difference environmental constitutionalism can make, • the economic imperative of environmental constitutionalism, and • how to take action in their communities.  We all have the right to pure water, clean air, and a healthy environment. It’s time to claim that right—for our own sake and that of future generations.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Politics",
    "Science",
    "Nature"
  ],
  "author": "Maya K. van Rossum",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/36626545-the-green-amendment"
}