{
  "title": "Sisterchicks Down Under",
  "description": "Kathleen joins her husband for a three-month trip to New Zealand when he’s hired by a film studio in Wellington. Leaving behind all that is familiar in her comfortable corner in Southern California, she realizes that the past twenty years have been so tightly woven into the life of her only daughter that she’s not sure who she is on her own or with her husband. In her isolation, Kathleen begins to contemplate reinventing herself, but before her crazy schemes take flight, she meets Jill at the Chocolate Fish café. Even though the two women are very different at first glance, they find they share a common Sisterchick heart and instantly forge a friendship that takes them on a journey where both Kathleen and Jill find that God has returned to them the truest part of themselves that was set aside so many years ago.Topsy-Turvy Down UnderSISTERCHICK TM n. : a friend who shares the deepest wonders of your heart, loves you like a sister, and provides a reality check when you’re being a brat.When Kathleen and her husband, Tony, pack up and fly off to New Zealand for Tony’s three-month film job, Kathleen discovers more than her geography has flip-flopped. In the land down under, comfort food comes in a jar labeled “Vegemite,” gardens sprout hobbit statues, and, if you’re not careful, you just might venture into the Chocolate Fish café with feathers in your hair.Of course, the feathers could open up a conversation with fellow diner Jill, also a California girl and an instant SISTERCHICK. Together they take in a performance at the Sydney Opera House; hold “hands” with a mama kangaroo and greet her in-pocket joey; watch dolphins surf the New Zealand waves; and discover that, in a topsy-turvy land where “Bob’s your uncle” is a statement that actually makes sense, one’s heart is likely to fall head over heels into a deeper sense of God’s love.Story Behind the Book“My motivation for the Sisterchicks™ books came from being involved with so many women who get halfway through life and shipwreck their faith or their families in search of themselves. I wanted to write a book that extols faithfulness and shines the light on God’s plan for a woman’s life, which is always more gigantic and more mysterious than she ever first believed. On the edge of my heart sits a constant prayer for the reader who lifts the covers of these books and snuggles in for a cozy read. My prayer is that she will be filled with hope and will come closer than ever to the One who loves to sprinkle His wonders over our days.”",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Christian",
    "Chick Lit",
    "Travel",
    "Contemporary",
    "Adult Fiction"
  ],
  "author": "Robin Jones Gunn",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/366210.Sisterchicks_Down_Under"
}