{
  "title": "Sisterchicks in Gondolas",
  "description": "Ciao bella!SISTERCHICK n. : a friend who shares the deepest wonders of your heart, loves you like a sister, and provides a reality check when you’re being a brat.When Jenna is invited to Venice for a week of cooking for a small retreat group, she knows just who to take her sister-in-law Sue. With her Dallas drawl and wild tangle of red hair, Sue desperately needs her own retreat from the pressures of the past two years…and blessedly for their guests, Sue actually knows how to cook (unlike Jenna)!With about six words of Italian between them, a map, and a keen appetite for gelato, they puzzle out the lovely city together. During their stay, Jenna and Sue become victims of grace in ways they never expected—starting with their a restored fifteenth-century palace on a quiet canal complete with a stairwell perfect for mattress sledding!Coming out of a time of dark shadows in their lives, these two friends dive into a new season of refreshing and realize that sometimes when serving God, the most important thing to do is just show up…and watch for goodness and mercy to follow close behind. Come join Jenna and Sue over boiling pots of pasta in this lilting gondola-paced adventure!Discussion guide includedStory Behind the BookSisterchicks in Gondolas was birthed after Robin experienced Italy for herself. “In the summer of 2004, I went to Venice with my lifetime fellow Sisterchick from Ireland , Ruby,” she says. “We explored the city with our daughters and discovered the joys of Italian living.” With a splash of humor, grace, and a few zany antics, this latest Sisterchicks release continues to celebrate the unique and timeless bond between women friends. Entertaining and delightful, the story also challenges readers to examine their relationships with one another and with God.",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Chick Lit",
    "Christian",
    "Travel",
    "Inspirational",
    "Contemporary"
  ],
  "author": "Robin Jones Gunn",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/366212.Sisterchicks_in_Gondolas"
}