{
  "title": "Sisterchicks in Sombreros",
  "description": "Two Canadian sisters inherit beachfront property in Mexico and take off on an adventure to claim their inheritance. They travel opulently by cruise ship to Ensenada and survive a rocky trip through Baja California, only to be shocked when they arrive in San Felipe. Their beachfront property is, indeed, on the beach, but the “structure” is a cement slab and the Airstream trailer their uncle parked on the property in the early 1960s! With the help of a few locals, the Canadian cuties figure out what to do with their less-than-desirable legacy. The true gift, they find, is that they are reconnected as sisters and discover that everything that happened along the way was part of God’s plan.Say Olé the Sisterchick Way !SISTERCHICK TM n. : a friend who shares the deepest wonders of your heart, loves you like a sister, and provides a reality check when you’re being a brat.Canadian sisters Melanie and Joanne are stunned to hear they’ve inherited their uncle’s beachfront summerhouse in Mexico. With a snap, a trip is They’ll travel opulently by cruise ship to Ensenada, zip over to San Felipe, sign a few papers at the bank, and the tropical hideaway will be theirs.What they don’t expect is a spa treatment gone loco, snails and cactus on their dinner plates, risky ocean dips, a cross-country desert drive, a dishy doctor, or a Federale who doesn’t speak English! Fortunately, some problems really can be solved with coconut cake and, if necessary, a water fight. The beachfront property—and what it takes to get them there—becomes a gift beyond their wildest wishes as these Sisterchicks relinquish themselves to the dreams God has for them...all under the sombrero of His grace.Story Behind the BookA year ago in July, an associate from my publishing house walked up to my friend and I and said, “You need to go on a cruise.” She grinned and told us that she had a cruise package she couldn’t use and it would be her delight to see my editor and me go to Mexico on a Sisterchick adventure. After we got over the shock, we gratefully made arrangements to go cruisin’ in December. What a time we had! Was it research or was it recharging of our creative efforts? Both! The result is the third Sisterchicks novel, Sisterchicks in Sombreros ! I love it when God does His God things. His eye is on the sparrow, or in this case, Robin and her Sisterchick friend!",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Chick Lit",
    "Christian",
    "Contemporary",
    "Adult",
    "Inspirational"
  ],
  "author": "Robin Jones Gunn",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/366209.Sisterchicks_in_Sombreros"
}