{
  "title": "Eye of the Moon",
  "description": "\"Eye of the Moon by Ivan Obolensky is a classic Victorian mystery, set in modern times. It's an absorbing, multilayered tale of family secrets, intrigue, ghosts, rivalries, and mysterious treasure. Through letters, diaries and narratives, Eye of the Moon weaves a richly layered, spellbinding story.”-Jefferson Hawkins, author of Counterfeit Dreams“Eye of the Moon throws you into the middle of the story, in a perfect way. It’s gripping, intense, thorough. Everything I wanted in a thriller, and then some. For a first novel, Obolensky’s work is brilliant, and I’m on the edge of my seat awaiting his next!”-Nick Thacker, USA Today bestselling authorThis is Book 1 of the Eye of the Moon series, a fascinating blend of American gothic mystery, psychological thriller, and family drama. The story continues in Book 2 (Shadow of the Son) and Book 3 (Dark of the Earth). Was Alice cursed, or murdered?Two childhood friends, Percy and Johnny, became estranged as adults after a business deal mysteriously went sour. Johnny shows up at Percy’s door years later in 1977 with an unusual plea for help, bringing Percy back into the opulent and treacherous world of Rhinebeck, the New York upstate family home. While navigating the Egyptian occult and the many sit-down dinners, necessary social interactions, and polite society that the elite demand, Percy and Johnny look into what really happened twenty years ago when Johnny’s aunt Alice died reading an Egyptian Book of the Dead. Chasing clues among hidden artifacts, letters, and journals Alice left behind, Percy and Johnny determine they can only know the truth if they make a deal with the last person to see her alive, the enigmatic butler of Rhinebeck, Stanley. They discover that the truth is very different from what they were led to believe and nothing is what it seems. Guests and staff alike have a secret, and unearthing them comes at an unexpected price.You will love this deftly crafted gothic mystery because of its intricate plot, fascinating characters, and unexpected twists and turns. Be prepared to keep reading late into the night.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Gothic",
    "Horror",
    "Audiobook"
  ],
  "author": "Ivan Obolensky",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/36632089-eye-of-the-moon"
}