{
  "title": "The Romanov Empress: A Novel of Tsarina Maria Feodorovna",
  "description": "For readers of Philippa Gregory and Alison Weir comes a dramatic novel of the beloved Empress Maria, the Danish girl who became the mother of the last Russian tsar.Even from behind the throne, a woman can rule.Narrated by the mother of Russia's last tsar, this vivid, historically authentic novel brings to life the courageous story of Maria Feodorovna, one of Imperial Russia's most compelling women who witnessed the splendor and tragic downfall of the Romanovs as she fought to save her dynasty in the final years of its long reign.Barely nineteen, Minnie knows that her station in life as a Danish princess is to leave her family and enter into a royal marriage--as her older sister Alix has done, moving to England to wed Queen Victoria's eldest son. The winds of fortune bring Minnie to Russia, where she marries the Romanov heir and becomes empress once he ascends the throne. When resistance to his reign strikes at the heart of her family and the tsar sets out to crush all who oppose him, Minnie--now called Maria--must tread a perilous path of compromise in a country she has come to love.Her husband's death leaves their son Nicholas as the inexperienced ruler of a deeply divided and crumbling empire. Determined to guide him to reforms that will bring Russia into the modern age, Maria faces implacable opposition from Nicholas's strong-willed wife, Alexandra, whose fervor has lead her into a disturbing relationship with a mystic named Rasputin. As the unstoppable wave of revolution rises anew to engulf Russia, Maria will face her most dangerous challenge and her greatest heartache.From the opulent palaces of St. Petersburg and the intrigue-laced salons of the aristocracy to the World War I battlefields and the bloodied countryside occupied by the Bolsheviks, C. W. Gortner sweeps us into the anarchic fall of an empire and the complex, bold heart of the woman who tried to save it.",
  "genres": [
    "Historical Fiction",
    "Russia",
    "Historical",
    "Fiction",
    "Audiobook",
    "Adult",
    "Adult Fiction"
  ],
  "author": "C.W. Gortner",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/36631227-the-romanov-empress"
}