{
  "title": "The Revelation",
  "description": "Chaos has never been so tempting...  To punish humanity for Prometheus's act of stealing sacred fire, Zeus ordered the gods and goddesses of Olympus to create woman. From the earth's clay, they molded Pandora. Zeus gifted her with a jar of evils. Pandora unleashed them. Now in present time, she's determined to atone for that sin. But she can't do it alone, so three sinfully sexy Spartans answer her call.  THE REVELATION is the first installment in National Bestselling Author Angelique Armae's new reverse harem series.  Being naughty never felt this good...  I always knew there was a little something off about myself, but learning on the eve of my twenty-first birthday that I was the personification of Pandora--yes, that Pandora--was more than a bit unsettling. Though it did explain a lot, like the fact I've always felt a lot older than my age and not in a physical sort of way, but in that soul wrenching, deep down in your gut, way.  The revelation also explained why I have an unnatural attachment to boxes and jars, including the disposable ones sold in grocery stores. Hell, I can't even go down that aisle without having an orgasm or balling my eyes out. If it has a lid and can hold things, I'm drooling over it.  On the plus side, there are five sinfully sexy immortal warriors ready to kiss the ground I walk on. Of course, having protectors means I also have enemies, namely Moros, a daimon of Death that not even Zeus can control. Moros wants me dead as only he or I can control the infamous Pandora's Box and inside it remains Hope. But my box has been lost for ages. Now Moros is on the hunt for it and if he finds it before I do, not only will Hope be doomed, but so too will be my one chance at redemption. Without the box, the evils I've unleashed will never be reined in.  *This is a reverse harem romance with one heroine and three male lovers. Scenes, language, and situations are steamier and a bit darker than in my other books and may not be to the taste of all readers. 18+ only.",
  "genres": [
    "Reverse Harem",
    "Mythology"
  ],
  "author": "Angelique Armae",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/36633808-the-revelation"
}