{
  "title": "THE KOREAN CRISIS: One People, Two Nations, A World On The Brink",
  "description": "After nearly 70 years of division between North and South Korea, the two nations have not yet achieved a peaceful settlement. Professor Emeritus Jack Van Der Slik’s new book provides a first person account of the incredible differences between the nations.  The Korean One People, Two Nations, an Uncertain Future follows the fate of the two Koreas. The first is a story of hard-earned success by the South Korean people. Although democracy did not come easily, it did accompany flourishing through market capitalism. The second, the fall of the Democratic People’s Republic of Korea, began with early economic success then sank into a socialist dictatorship, stratifying the country’s people into a small privileged elite supported by a poor and cheerless mass of disadvantaged workers. Despite the poverty and food insecurity suffered by the North Korean underclass, the ruling elite has formidably armed itself with nuclear weapons and a massive standing army.  The Korean Crisis draws upon deep studies of democratization in South Korea and Van Der Slik’s own travels throughout the Republic of Korea and Panmunjom—the heavily armed 38th parallel and the site of peace negotiations. Intensely researched, highly informative, and poignantly told, The Korean Crisis will educate the public about Korea and the dangers that exist there while shedding light on a possible catastrophic nuclear conflict between the two rival countries whose combatants are, in fact, one people.  About the  Jack Van Der Slik is a professor emeritus of political studies and public affairs at the University of Illinois Springfield. His essays, articles and reviews appear in a variety of journals, magazines and newspapers and he is the author of numerous books on international policy, public affairs, and domestic and foreign politics.",
  "genres": [
    "History"
  ],
  "author": "Jack Van Der\tSlik",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/36630135-the-korean-crisis"
}