{
  "title": "Storm Glass",
  "description": "From the Wall Street Journal bestselling author of the Kingfountain Series comes the first novel in a bold and richly imagined world.Theirs is a world of opposites. The privileged live in sky manors held aloft by a secretive magic known only as the Mysteries. Below, the earthbound poor are forced into factory work to maintain the engine of commerce. Only the wealthy can afford to learn the Mysteries, and they use their knowledge to further lock their hold on society.Cettie Pratt is a waif doomed to the world below, until an admiral attempts to adopt her. But in her new home in the clouds, not everyone treats her as one of the family.Sera Fitzempress is a princess born into power. She yearns to meet the orphan girl she has heard so much about, but her father deems the girl unworthy of his daughter’s curiosity.Neither girl feels that she belongs. Each seeks to break free of imposed rules. Now, as Cettie dreams of living above and as Sera is drawn to the world below, they will follow the paths of their own choosing.But both girls will be needed for the coming storm that threatens to overturn both their worlds.French Version:Dans cette aventure entre ciel et terre, où les manoirs flottent au milieu des nuages grâce à une magie énigmatique, faites la connaissance de Cettie et Séra, deux jeunes filles aussi courageuses qu’ingénieuses aux destinées hors du commun.Il existe deux mondes.L’un a conquis les nuages.L’autre a sombré dans le brouillard.Abandonnée alors qu’elle était enfant, Cettie vit le ventre creux, dans la peur des fantômes qu’elle semble être la seule à voir. Elle réside dans le monde d’en bas, jusqu’à ce qu’un vice-amiral fortuné l’en délivre, lui offrant la vie dont elle a toujours rêvé, tout là-haut dans les nuages. Là où les manoirs flottent dans le ciel grâce à une magie énigmatique et où les privilégiés mènent des vies de rois.Séra est la petite-fille de l’Empereur. Toutes envient sa place. Pourtant, seule avec sa gouvernante et ses parents, la jeune princesse n’a qu’un désir : explorer le monde qu’elle aperçoit tout juste depuis sa fenêtre.La vie des deux jeunes filles est sur le point de changer à jamais.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Audiobook",
    "Steampunk",
    "Magic",
    "High Fantasy"
  ],
  "author": "Jeff Wheeler",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/36634904-storm-glass"
}