{
  "title": "99 Creative WOWs Words of Wisdom for Business",
  "description": "99 Creative Wows–Words of Wisdom for Business is a motivational quick-read business book. 99 Creative WOWs–Words of Wisdom for Business helps recent graduates, young professionals, newly minted entrepreneurs, business owners and creative thinkers succeed faster–NOW. Quickly apply these 99 sound bites of business, personal and creative wisdom from this successful, proven creative entrepreneur. This easy-to-digest creative business book provides 99 words of wisdom quotes for business, money, motivation and success–plus powerful advice from the author's own experiences. Turn the power of creativity into business success with these 99 quick, colorfully designed motivating business and life quotes sure to inspire you in your business, personal, and creative endeavors. All businesses benefit from creative expertise. Start now. • 99 Creative Wows–Words of Wisdom for Business provides quick, colorful sound bites for new and seasoned business professionals. • 99 Creative Wows–Words of Wisdom for Business delivers 99 jump starts to develop, enhance and confirm creative business savvy–FAST. • 99 Creative Wows–Words of Wisdom for Business fall into three primary BUSINESS, CREATIVE AND PERSONAL. • BUSINESS WOWS inspire, intrigue and illuminate ideas for professionals, ready-to-apply wisdom for diverse business situations. • CREATIVE WOWs spark ingenuity and motivate business professionals to use creative problem-solving approaches to add valuable results. • PERSONAL WOWs offer thoughtful perspectives when life's challenges tax even resilient individuals, helping to define next steps. • Many WOWs relate to all three benefit from WOWs in business, creative and personal endeavors–all together. • 99 Creative Wows–Words of Wisdom for Business offers insights, brings clarity, challenges thinking and fuels creative business expertise. It's easy to enjoy and benefit from 99 Creative Wows–Words of Wisdom for Business.",
  "genres": [
    "Business"
  ],
  "author": "Randi Brill",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/36642741-99-creative-wows-words-of-wisdom-for-business"
}