{
  "title": "Whitetail Rock",
  "description": "Official Description: Nikhil “Nik” Larson is a snarky, dark-skinned adoptee from India who grew up in the Whitest Town in America. Back to visit his parents Nik meets Trooper Jurgen Dammerung, a blond, butch motorcycle cop who’s so hot he leaves a con trail wherever he goes.Jurgen is the epitome of everything Nik hated about growing up the lone Indian boy among a town of white people. But Jurgen surprises him rather (ahem) pleasantly, in spite of — or because of — Nik’s attempts to needle him. By the end of his visit, Nik realizes he likes Jurgen. But Jurgen’s so not the relationship type.Right?Original Prompt:Dear Author,Those boots are hot, right? The veiny arms too. I bet he gets really sweaty riding that bike all day. mmmmhmmmm You can't see it in the pic, but I bet his hairy chest just glistens with it.I would love a story about this cop. I think he's a bit demanding, some might call him an asshole. You can give me an HEA, but don't make my cop too nice.Photo Description: From the toe of his polished boot to the dark glasses hiding his eyes, we are looking up at one very hot cop. He straddles his motorcycle, wearing snug blue uniform pants, a gun holster on his belt and black leather gloves. He's shirtless, and the cut of his muscles makes this a very good thing.This story was written as a part of the M/M Romance Group's \"Hot Summer Days\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story from the Author's website, read it online or find it in Don't Read in the Closet, Volume 4.__________Genre: contemporaryTags: gay m/m, cops; inter-racial; HFN; dirty talk; collegeWord Count: 26,429",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Short Stories",
    "LGBT",
    "Novella",
    "BDSM"
  ],
  "author": "Anne Tenino",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/12215609-whitetail-rock"
}