{
  "title": "People's Republic",
  "description": "America’s growing political and cultural divisions have finally split the United States apart. Now, as the former blue states begin to collapse under the dead weight of their politically correct tyranny, a lethal operative haunted by his violent past undertakes one last mission to infiltrate and take out his target in the nightmarish city of Los Angeles, deep in the heart of the People’s Republic of North America. National Review’s Jim Geraghty calls Kurt Schlichter’s “People’s Republic” “a surreal, fast-paced journey through a dramatically different America but less than a generation away. … Violent, imaginative, full of mordant humor and dark, gritty details, you won’t want to live in this People’s Republic…but you’ll feel a chill as you wonder how different our real future will be.” Author and television host Cam Edwards says “Kurt Schlichter's ‘People's Republic’ is a roller coaster ride through a post-election Hellscape that will leave you wanting more.” Radio host Hugh Hewitt say “Schlichter puts a whole flight of Black Swans in the air --each of them plausible-- and the result is a riveting, page-turner, and a demand from Schlichter for...more.” “People’s Republic” is the first novel by Kurt Schlichter, a retired Army infantry colonel, a conservative radio and television commentator on the Fox networks and elsewhere, a Senior Columnist at Townhall,com, and a popular and hilarious Twitter raconteur. He's also a trial lawyer, so he has an intimate understanding of evil and deception. Radio host and commentator Ben Shapiro calls “People’s Republic “chilling,” and author and columnist David Limbaugh calls it “a thought-provoking action thriller set against the backdrop of a shattered America.” Fox News contributor and author Katie Pavlich says, “They say conservatives are terrible story tellers, but Kurt Schlichter destroys that stereotype in his new novel People's Republic and issues a dire warning about the future of America.” As with his prior book “Conservative The Struggle to Take America Back 2013-2041,” “People’s Republic” takes today’s news and projects the trends out into the future. Funny, frightening and action-packed, “People’s Republic” is a thriller that will make you think as well as keep you turning the pages.",
  "genres": [
    "Fiction",
    "Politics",
    "Thriller",
    "Dystopia",
    "Contemporary",
    "Military Fiction",
    "Adventure"
  ],
  "author": "Kurt Schlichter",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/36657254-people-s-republic"
}