{
  "title": "The Lucid Series: Android Uprising",
  "description": "Awarded Badge for Redemptive Fiction by Reality Calling.Suitable for Young Adult.. . . In a dystopian cyberpunk 2215, the former US was fragmented into multiple small countries.. . . People in the UN proxy state of Homeland are controlled by psychotropic drugs, corrupted education, propaganda and oppressive laws.In this story . . .. . . Computer hacking clones are trying to get rich no matter what they have to do.. . . A garbage collector hates everything about his life and goes rogue.. . . An entire strain of genetically-engineered children is to be culled because of an imperfection.. . . A tyrannical government robot unit is led by a ruthless being hiding behind a synthetic presence.. . . A clone couple is living off of the grid and expecting an illegal child.. . . A series of androids vow to fight for the truth even to the point of war.. . . And a boy asks, “Is God real?”The Lucid series is a unique clean-language novel that has heavy hitting, brutally honest edgy Christian themes and some graphic action.Cyberpunk is the science fiction world of androids, clones, cyborgs, synthetic presences, nanites, virtual reality simulations, or any other such high tech thing that affects Man's reality.I contend that cyberpunk is the perfect vehicle to proclaim the Gospel of Jesus Christ in our world where the populace spends its time consuming the far-out products of pop culture.Why?1. Cyberpunk is the most relatable speculative fiction sub-genre. It is more relatable and realistic than space travel or any fantasy. Unlike Amish romances, It is something men may read.2. It is easy to believe that a cyberpunk setting, in its high tech attempts to make a perfect world, will have severe problems resulting in dystopia. We know from our current situation (sexual identity, same-sex marriage, abortion, etc.) that Man typically messes things up.I have spent a lifetime reading Christian Apologetics, and I believe that I have written a compelling case for the Gospel in my The Lucid Android Uprising. My goal is to win souls with it.So I prayerfully request the help of Christians 1. Please pray for my work like you would any other missionary.2. Please get my book and do a review on it. Reviews are what keeps the book in the front of the lists. My book is competing against many books in the \"Christian Fiction\" category that never even mention Jesus. My e-book is priced as low as is allowable on Kindle. But to show you my sincerity, I will gift you a copy if you will review it.3. Consider giving paperback copies as gifts, especially to young adult readers.4. Consider writing your own Christian cyberpunk novel. Please give me lots of \"competition\" for winning souls.5. Join the Goodreads Christian Cyberpunk Books Club in Goodreads for information on more titles in this sub-genre.",
  "genres": [],
  "author": "Den Warren",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/36665589-the-lucid-series"
}