{
  "title": "Unexpected",
  "description": "I finally had the chance at a perfect life when I met the man I was supposed to be with. But he’s gone and chances like that don’t come along twice in one lifetime. Right? Former president Everett Shaw had his whole life laid out for him from the time he was a child and he lived out every expectation to complete and utter perfection… until he met the one man who changed everything. With plans to leave public life behind after finishing his term in office, Everett was looking forward to a quiet life with the man of his dreams at his side. But one brutal act of violence stole that bright future away, leaving Everett struggling just to get through each day.  A decade later finds Everett nearing the age of sixty and living a shell of a life. Haunted by his loss, he finds solace in his roses and evenings sitting in front of the television. But when his estranged son is horribly injured while saving the life of another, Everett leaves everything behind in the hopes of mending the broken relationship and helping his son heal in more ways than one.  My job is to protect and there are rules that have to be followed. Even if there weren’t, I wouldn’t risk letting anyone close… not again. Special Agent Jonathan Nash’s job is to keep the former president safe, not be his friend. Even if something about the lonely older man draws him in, he’s not about to risk what’s left of his career for anything. And it’s not like a guy like Everett Shaw would really see him anyway. Nor would he want him to, considering the ugly past Nash left behind to pursue his dream. No, he’s better off following protocol and doing his job. Let someone else deal with the broken man. It’s not his problem… it can’t be.  I learned a long time ago to live life on my terms and that sometimes you have to take that leap of faith to get what you want. But wanting two men at the same time? That’s new, even for me. At forty-five years old, former Navy SEAL Gage Fortier has experienced success and loss in equal measure, and while his life has taken a direction he never planned, he wouldn’t have it any other way. When Reese, the young man he’s partnered with in the underground vigilante group they both work for, is injured on the job, he sees an opportunity to build on the friendship with the bitter former soldier while giving him a place to recover. But when he discovers that the young man is actually the estranged son of a former U.S. president, Gage realizes he has the chance to give both father and son so much more. There’s only one problem with his plan… how to ignore his growing attraction for the devishly handsome Everett Shaw.  And Everett’s perpetual shadow, Agent Nash.  Three men on very separate courses. Until something unexpected happens and three become one…  *TRIGGER WARNING: This book as a couple of triggers. You can check out what they are by downloading the sample or using the \"Look Inside\" feature and scrolling to the appropriate page. Note that reading the trigger warnings could cause spoilers.  Can be read as a standalone novel.  The Protectors series crosses over with some of my other series, so for the most enjoyment, they should be read in order, but it is not required. You can find the correct reading order at the beginning of each book. I've also bundled all my series in the correct reading order under the title of A Family Chosen: The Protectors and Barrettis.",
  "genres": [
    "M M Romance",
    "M M M",
    "Romance",
    "Menage",
    "Contemporary",
    "Military Fiction",
    "Gay"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/36657015-unexpected"
}