{
  "title": "Storm from the Shadows",
  "description": "Perfidious Plots,Courageous Resolve—and,of course,Starships Blown to Smithereens!The Solarian League Navy has been the premier navy of the galaxy for centuries. Indeed, no one can remember a time when it hasn't been acknowledged as the most powerful fleet in existence.Until now, that is.A conference to end the terrible war between the Peeps of Haven and the Manticorean Star Kingdom is slated. Peace is finally within reach.Yeah, right.Not with the slaver conspiracy that calls itself Manpower, Inc. pulling intergalactic strings. The plan To plunge the Star Kingdom into a two-front war with Peeps and Sollies—a process calculated to blast Honor Harrington's home system to smoking ruin!Assassination's afoot. And out on the galactic frontier known as the Verge, big trouble boils over as Solarian League arrogance butts up against the steely resolve of Harrington protégé Michelle Henke, aka Admiral Gold Peak.Too bad for the Sollies. For Harrington's officers have a habit of coming through in the clutch and finding a way to snatch victory from the jaws of defeat. But most of all—whatever the odds—they never, ever give up the fight!At the publisher's request, this title is sold without DRM (Digital Rights Management).\nShadow of Saganami\n sequel—and the latest entry in David Weber's astoundingly adventurous, phenomenally popular, and multiply USA Today and New York Times best-selling \"Honor Harrington\" saga!\"Following in the best tradition of C.S. Forester, Patrick O'Brian and Robert A Heinlein! These hugely entertaining and clever adventures are the very epitome of space opera.\" —Publishers Weekly\"Weber's descriptions of space combat remain magnificent.\" —Science Fiction WeeklyA lifetime military history buff, David Weber has carried his interest in history into his fiction.  In the New York Times best selling Honor Harrington series, the spirit of both C.S. Forester's Horatio Hornblower and history's Admiral Nelson are evident.  With over five million copies of his books in print, David Weber is the fastest rising star in the Science Fiction universe.  His Honor Harrington series boasts over 3 million copies in print, and Weber has had over thirteen of his titles on The New York Times Best Seller List.  War of Honor, book 10 in the series appeared on over twelve Best Seller lists, including The Wall Street Journal, The New York Times, and USA TODAY.While he is best known for his spirited, modern-minded space operas, he has also developed a fantasy series, of which two books have been published:  Oath of Swords and The War God's Own.  David's solo work also includes three novels of the \"Dahak\" series, and the stand alone novels:  Path of the Fury and The Excalibur Alternative.Weber's first published novels grew out of his work as a war game designer for the Task Force game Starfire.  With collaborator Steve White, Weber has written four novels set in that universe: Insurrection, Crusade, In Death Ground, and The Shiva Option.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Military Fiction",
    "Military Science Fiction",
    "Space",
    "Science Fiction Fantasy"
  ],
  "author": "David Weber",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/3667676-storm-from-the-shadows"
}