{
  "title": "Vaccines on Trial: Truths and Consequences of Mandatory Shots",
  "description": "Are you required to get your children vaccinated?Before the 1970’s, American children were fully vaccinated with 2 shots. By 1986, it was 10 shots.Today, mothers have to give 24 shots to their kids before the age of two.This is unprecedented in human history.It’s equal to one shot/month of foreign DNA injected into an infant's tiny developing body.Science Facts: the Good, the Bad, the Ugly.1. The MMR vaccine contains DNA material from chicken and cow embryos.2. MMR also contains human DNA from aborted fetuses, listed as WI-38 by the CDC.3. After examining many scientific studies, the U.S. Supreme Court ruled in Bruesewitz v. Wyeth 2011 that:“Vaccines are unavoidably unsafe and there shall be no more lawsuits against any vaccine company.”Pediatricians assure the public that childhood vaccines are safe.Parents accept this assurance from healthcare providers who incorrectly state that adverse side-effects are rare.4. The Association of American Physicians and Surgeons (AAPS) disputes this claim in their “Fact Sheet on Mandatory Vaccinations” April 9, 2009: “The CDC admits that the reported number of adverse effects of vaccines is probably only 10% of actual adverse effects.”5. AAPS also states in the same Fact Sheet that they have, “attempted to halt government or school districts from blanket vaccine mandates that violate parental informed consent…”Vaccines on Trial documents vaccine studies by leading healthcare scientists.6. Scientific studies comparing vaccinated and unvaccinated children in Germany, Sweden, New Zealand, and the U.S. show unvaccinated children to be healthier than their vaccinated peers.7. Charts and graphs on the effects of increased vaccinations rank the U.S. 34th for infant mortality among first world nations.8. The book, Critical Vaccine Studies, documents 400 case studies showing that vaccinated people have more health problems later in life.20th century parents were pro-vaccine.Today, you can chat online with parents of vaccine-injured kids, read books about toddlers harmed by vaccines, and watch films documenting how autism manifests after vaccination, not before.Pro-vax parents became anti-vax because their children suffered adverse side-effects.The modern anti-vax movement was started by outraged mothers who became warriors to protect children harmed by adverse vaccine reactions.Vaccines on Trial examines the issue of mandatory vaccination.Whether it’s more noble to suffer our fate,allow our children to be forcibly vaccinated,and accept that they may have an adverse reaction.Or, to stand strong, demand informed consent,and oppose mandatory vaccinationin defense of our lawful right as conscientious objectorsto stop the denial of parental rights.The latest scientific studies show vaccine benefits and risks.This book documents vaccine risks, because benefits never harmed anyone.Mandatory vaccines or freedom to choose?Where there is risk, there must be a choice to avoid that risk.Vaccination is far more complicated than simple pro-vax or anti-vax labels portrayed with stereotyped, black-and-white rhetoric.Knowledgeable people don't frame the vaccine issue with polarizing terms that cause strife between families with opposite views.This book examines vaccines from the medical perspective, the scientific perspective, legal perspective, ethical perspective, historical perspective, parent’s perspective, children’s perspective, and the business perspective.You have the right to choose childhood vaccination or not.Read the scientific studies and make your own decision on childhood medical intervention.Avoid years of heartbreak, and thousands of dollars on medical bills.",
  "genres": [],
  "author": "Pierre St. Clair",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/36675099-vaccines-on-trial"
}