{
  "title": "All the Women in My Family Sing: Women Write the World: Essays on Equality, Justice, and Freedom",
  "description": "All the Women in My Family Sing is an anthology documenting the experiences of women of color at the dawn of the twenty-first century. It is a vital collection of prose and poetry whose topics range from the pressures of being the vice-president of a Fortune 500 Company, to escaping the killing fields of Cambodia, to the struggles inside immigration, identity, romance, and self-worth. These brief, trenchant essays capture the aspirations and wisdom of women of color as they exercise autonomy, creativity, and dignity and build bridges to heal the brokenness in today’s turbulent world.Sixty-nine authors — African American, Asian American, Chicana, Native American, Cameroonian, South African, Korean, LGBTQI — lend their voices to broaden cross-cultural understanding and to build bridges to each other’s histories and daily experiences of life. America Ferrera’s essay is from her powerful speech at the Women’s March in Washington D.C.; Natalie Baszile writes about her travels to Louisiana to research Queen Sugar and finding the “painful truths” her father experienced in the “belly of segregation;” Porochista Khakpour tells us what it is like to fly across America under the Muslim travel ban; Lalita Tademy writes about her transition from top executive at Sun Microsystems to NY Times bestselling author.This anthology is monumental and timely as human rights and justice are being challenged around the world. It is a watershed title, not only written, but produced entirely by women of color, including the publishing, editing, process management, book cover design, and promotions. Our vision is to empower underrepresented voices and to impact the world of publishing in America — particularly important in a time when 80% of people who work in publishing self-identify as white (as found recently in a study by Lee & Low Books, and reported on NPR).",
  "genres": [
    "Nonfiction",
    "Essays",
    "Feminism",
    "Race",
    "Short Stories",
    "Anthologies",
    "Gender"
  ],
  "author": "Deborah Santana",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/36672590-all-the-women-in-my-family-sing"
}