{
  "title": "The Mammoth Book of Halloween Stories: Terrifying Tales Set on the Scariest Night of the Year!",
  "description": "Twenty-six terrifying tales set on the scariest night of the year by Ramsey Campbell, Neil Gaiman, Joe R. Lansdale, Helen Marshall, Richard Christian Matheson, Robert Shearman, Robert Silverberg, Angela Slatter, Steve Rasnic Tem, and many more. Along with a very special contribution by award-winning poet Jane Yolen.Treat yourself to some very tricky stories! Halloween . . . All Hallows’ Eve . . . Samhain . . . Día de los Muertos . . . the Day the Dead Come Back . . . When the barriers between the worlds are at their weakest—when ghosts, goblins, and grisly things can cross over into our dimension—then for a single night each year the natural becomes the supernatural, the normal becomes the paranormal, and nobody is safe from their most intimate and terrifying fears.The Mammoth Book of Halloween Stories brings you a dark feast of frightening fiction by some of the most successful and respected horror writers working IN THE CHAIR Neil GaimanREFLECTIONS IN BLACK Steve Rasnic TemTHE HALLOWEEN MONSTER Alison LittlewoodTHE PHÉNAKISTICOPE OF DECAY James EbersoleMEMORIES OF DÍA DE LOS MUERTOS Nancy KilpatrickFRAGILE MASKS Richard GavinBONE FIRE Storm ConstantineQUEEN OF THE HUNT Adrian ColeTHE OCTOBER WIDOW Angela SlatterBEFORE THE PARADE PASSES BY Marie O’ReganHER FACE Ramsey CampbellA MAN TOTALLY ALONE Robert HoodBLEED Richard Christian MathesonTHE ULTIMATE HALLOWEEN PARTY APP Lisa MortonTHE FOLDING MAN Joe R. LansdaleI WAIT FOR YOU Eygló KarlsdóttirDUST UPON A PAPER EYE Cate GardnerNOT OUR BROTHER Robert SilverbergTHE SCARIEST THING IN THE WORLD Michael Marshall SmithTHE NATURE OF THE BEAST Sharon GoslingTHE BEAUTIFUL FEAST OF THE VALLEY Stephen GallagherIN THE YEAR OF OMENS Helen MarshallTHE MILLENNIAL’S GUIDE TO DEATH Scott BradfieldWHITE MARE Thana NiveauPUMPKIN KIDS Robert ShearmanLANTERN JACK Christopher FowlerHALLOWEEN TREATS Jane YolenHere you will encounter witches, ghosts, monsters, psychos, demonic nuns, and even Death himself in this spooky selection of stories set on the night when evil walks the earth . . .",
  "genres": [
    "Horror",
    "Halloween",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Paranormal",
    "Adult"
  ],
  "author": "Stephen              Jones",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/36676116-the-mammoth-book-of-halloween-stories"
}