{
  "title": "The Reckless Rescue",
  "description": "More mystery, more bravery, more danger, and one amazingly reckless rescue await in the second book in the Explorers series! The perfect read for fans of The Name of This Book Is a Secret and The Mysterious Benedict Society!\nReader! Your attention is greatly needed. We have left things unresolved! What began as your average story of a boy stumbling upon a pig in a teeny hat and a secret international explorers society has turned into an adventure of epic proportions.  *  The bad news: The boy (Sebastian) has been kidnapped by a trio of troublesome thugs.  *  The good news: His new friend Evie has promised to rescue him!  *  The bad news: Sebastian has been taken halfway around the world.  *  The good news: Evie has famous explorer and former Filipendulous Five member Catherine Lind at her side!  *  The bad news: There's still the whole matter of Evie's grandfather (and the leader of the Filipendulous Five) somewhere out there in grave danger.  *  The good news: Pursuing Sebastian will lead Evie and Catherine to another member of the Filipendulous Five, who might be able to help!This missive is a call to action and an invitation to join in mystery, bravery, and danger. There will be new people to meet, new places to see, and some dancing along the way. And one amazingly reckless rescue.\nPRAISE FOR THE FIRST BOOK IN THE SERIES: \n\n\nTHE EXPLORERS: THE DOOR IN THE ALLEY\n\n\n:\n\"[A] wildly funny adventure. . . . Animals in teeny hats, Wonderland-style logic, and loads of wordplay and sarcasm will keep readers giggling all the way through.\"-Kirkus Reviews\"Exhilarating. . . . Fans of a Series of Unfortunate Events will be drawn to this.\"-Booklist\"A rollicking read, full of derring-do and old-fashioned villainy.\"-School Library Journal\"Funny, offbeat, and subversive . . . occasional footnotes and other humorous asides from the omniscient narrator break the fourth wall and ramp up the playfulness.\"-The Horn Book\"Narrated with a smart, brisk tone and plenty of snark. . . . The Explorers: The Door in the Alleypacks plenty of twists, turns and danger.\"-Shelf Awareness",
  "genres": [
    "Middle Grade",
    "Adventure",
    "Mystery",
    "Fiction",
    "Humor",
    "Childrens",
    "Audiobook"
  ],
  "author": "Adrienne Kress",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/36673265-the-reckless-rescue"
}