{
  "title": "Where the Heart Leads",
  "description": "Penelope Ashford, Portia Cynster's younger sister, has grown up with every advantage - wealth, position, and beauty. Yet Penelope is anything but a typical ton miss - forceful, willful and blunt to a fault, she has for years devoted her considerable energy and intelligence to directing an institution caring for the forgotten orphans of London's streets.But now her charges are mysteriously disappearing. Desperate, Penelope turns to the one man she knows who might help her - Barnaby Adair.Handsome scion of a noble house, Adair has made a name for himself in political and judicial circles. His powers of deduction and observation combined with his pedigree has seen him solve several serious crimes within the ton. Although he makes her irritatingly uncomfortable, Penelope throws caution to the wind and appears on his bachelor doorstep late one night, determined to recruit him to her cause.Barnaby is intrigued-both by her story, and her. Her bold beauty and undeniable brains make a striking contrast to the usual insipid ton misses. And as he's in dire need of an excuse to avoid said insipid misses, he accepts her challenge, never dreaming she and it will consume his every waking hour.Enlisting the aid of Inspector Basil Stokes of the fledgling Scotland Yard, they infiltrate the streets of London's notorious East End. But as they unravel the mystery of the missing boys, they uncover the trail of a criminal embedded in the very organization recently created to protect all Londoners. And that criminal knows of them and their efforts, and is only too ready to threaten all they hold dear, including their new-found knowledge of the intrigues of the human heart.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Mystery",
    "Regency",
    "Fiction"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/1221703.Where_the_Heart_Leads"
}