{
  "title": "Taking the Fall: The Full Complete Series",
  "description": "We’ve come a long way since Taking the Fall Volume 1 released in 2015. Since then we’ve added pieces to the puzzle as our readers demanded more! Finally, every story has been combined into one bundle.   This complete series includes:   Taking the Fall with bonus letters from Carter Falling In - Saint and Jeanette Fall Into Place - Mary and Anthony, with Samuel and Nika The Final Fall - Viktor and London  Taking the Fall  Layla O’Leary has had enough. For years she has been haunted by the night she can’t remember. When she learns the only man she's ever loved has betrayed her, she escapes and crafts a new identity. She's finally free...  Carter has waited eight years to claim his woman. Locking him up only fueled his obsession. The day he gets out he's coming for her. Carter and Layla were just the start. Now he'll stop at nothing to possess what's his.  Warning: This book contains a hero who grunts and growls his way through life, a heroine nicknamed Cherry looking to lose it, and instalove so fast and hard your panties might disintegrate. Note: Not responsible for exploding panties.  Falling In   They met by chance. Or so she thought...  Losing her wasn't something he was willing to do. Sometimes life takes you to the edge, but Jeanette had a Saint to catch her.  This is the short story of how they met, how they fell in love, and how much Saint loves going down on her.  Fall Into Place  One night in Vegas. Two weddings. Four virgins.  Mary & Anthony   Mary has belonged to Anthony since the day she was born. They’ve known each other their whole lives, but he won’t touch her until she says, \"I do.\"  Their parents' story should have been a cautionary tale, but when Mary finally agrees to Anthony’s proposal, they run away to Vegas to tie the knot.  But what do they do when things don’t go according to plan and they find themselves caught between a Russian sniper and his runaway daughter?  Easy! Lock themselves in a hotel room and pop some cherries!  Samuel & Nika  Samuel’s twin sister, Mary, is off to Vegas to marry his best friend, Anthony. Samuel’s heading to Sin City with them to give her away, but trouble in the form of a sneaky brunette stops him dead in his tracks.  Nika’s on the run, and she’s found herself backed into a corner. But she’s been trained on how to defend herself, especially against a big beast like Samuel.  From the first look he was finished and had no intention of ever letting her go.  You begged for the story of Mary and Anthony, and here it is! The final chapter in the Taking the Fall series closes with two short stories on the children of Carter, Layla, Saint, and Jeanette.  Warning: These stories are just as fierce, just as strong, and just as steamy as the rest of the series. These novellas can be read as standalones but will be enjoyed even more after reading the Taking the Fall series.  The Final Fall  After years of begging, we’ve finally given you Viktor’s story. Find out who brings the man they call The Fixer to his knees. And meet the woman who's wrapped herself around his cold heart.  Warning: This novella is the final chapter in the Taking the Fall Series. Seriously, guys, we mean it. Enjoy!",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Dark Romance",
    "Chick Lit",
    "Short Stories",
    "Erotic Romance"
  ],
  "author": "Alexa Riley",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/36694321-taking-the-fall"
}