{
  "title": "The Body Is Not an Apology: The Power of Radical Self-Love",
  "description": "“To build a world that works for everyone, we must first make the radical decision to love every facet of ourselves…‘The body is not an apology' is the mantra we should all embrace.” —Kimberlé Crenshaw, legal scholar and founder and Executive Director, African American Policy Forum “Taylor invites us to break up with shame, to deepen our literacy, and to liberate our practice of celebrating every body and never apologizing for this body that is mine and takes care of me so well.”—Alicia Garza, cocreator of the Black Lives Matter Global Network and Strategy + Partnerships Director, National Domestic Workers Alliance “Her manifesto on radical self-love is life altering—required reading for anyone who struggles with body image.”—Claire Foster, Foreword ReviewHumans are a varied and divergent bunch with all manner of beliefs, morals, and bodies. Systems of oppression thrive off our inability to make peace with difference and injure the relationship we have with our own bodies.The Body Is Not an Apology offers radical self-love as the balm to heal the wounds inflicted by these violent systems. World-renowned activist and poet Sonya Renee Taylor invites us to reconnect with the radical origins of our minds and bodies and celebrate our collective, enduring strength. As we awaken to our own indoctrinated body shame, we feel inspired to awaken others and to interrupt the systems that perpetuate body shame and oppression against all bodies. When we act from this truth on a global scale, we usher in the transformative opportunity of radical self-love, which is the opportunity for a more just, equitable, and compassionate world—for us all.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Feminism",
    "Audiobook",
    "Mental Health",
    "Psychology",
    "Social Justice"
  ],
  "author": "Sonya Renee Taylor",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/36693950-the-body-is-not-an-apology"
}