{
  "title": "Jared's Fulfillment",
  "description": "Kieran  My relationship with Jared has lasted too long. He’s mesmerizing, beautiful in his devotion, pure in his need. He reaches parts of me I thought no longer existed, places I’d never known were there. His submission is a gift. His cries of pleasure and pain call to the most primal parts of me. I want to inhale him, own him, mark him as mine. He’s my boy and I need to be his Daddy, but my fear holds me back. I’ll fail him like I’ve failed everyone else I’ve loved. Before that happens, I’ll walk away.  Jared  I’ve never known security, love, or true pleasure before Kieran. With every touch, every command, every second of blissful, torturous pain, my heart grows and my soul is at peace. He protects me, spoils me, gives me what I need. Still, in some ways, he’s closed off and won’t let me in. But Kieran’s given me strength. I’ve evolved, and won’t accept less than I deserve…and I won’t let Daddy accept less than he deserves, either.  It’s a delicate balance: give and take, pleasure and pain. Together we can break each other down to our purest forms and build each other up again. Kieran always says I’m stronger than I think, but I know that together we’re invincible…if only he’d believe me.  We have two choices: say goodbye or fight for what’s always been out of both our reaches…fulfillment.  Warning: Jared’s Fulfillment contains BDSM elements, domestic discipline, spanking, and daddy kink—without age play—between consenting adults. If any of those things offend you, reading this book might not be a good idea.  Jared's Evolution and Jared's Fulfillment must be read in order.  Jared’s Fulfillment is part of the Desires Unleashed collection. Some books in this collection will have darker themes. Please be aware Desires Unleashed are er*tic and not your typical Riley Hart romance. You can expect the mental and emotional journey to be led by the physical/s*xual moments—which will be intense, frequent and kinky.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "Erotica",
    "LGBT",
    "Erotic Romance"
  ],
  "author": "Riley Hart",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/36689570-jared-s-fulfillment"
}