{
  "title": "The Understudy",
  "description": "Recently divorced actor Stephen C. McQueen (no relation, unfortunately) seems to have a knack for bad luck. But a failed marriage, a stalled career, a judgmental ex-wife, a distant daughter, a horrid little studio apartment in the far reaches of the London suburbs–all these pathetic elements seem to pale in the chiseled face of his newest tormentor: the Twelfth Sexiest Man in the World, Josh Harper.Josh is the star of Mad, Bad, and Dangerous to Know, a biographical play about Lord Byron–and Stephen is his understudy. Not only is Josh fantastically, infuriatingly good-looking, internationally renowned, and remarkably talented, he’s also frustratingly healthy. No matter how many all-night booze-and-coke benders Josh goes on, he always shows up at the stage door for his call like clockwork. Stephen doubts he’ll ever get his chance to slip on the puffy shirt and tight breeches of Byron and tread the boards in the role that would certainly be the break he’s always waited for.And just when Stephen’s sure he couldn’t resent Josh more, he meets Josh’s witty, restless American wife, Nora... and discovers he likes her a little too much. Another man might curse his luck at finding that his potential dream woman is a rival’s wife, but at this point, Stephen would expect nothing else. Caught between his stirring feelings for Nora, the demands of an insistent and secretive Josh, and his lifelong desire for a real career in show business, Stephen must make a terrible decision: Will it be the girl or the fame?A hapless, bumbling bloke in love, an arrogant megastar with a potpourri of addictions, a sexy married woman out of her element in the fast lane–David Nicholls brings them all together in this knockout romantic comedy.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Romance",
    "Humor",
    "Comedy",
    "Chick Lit",
    "Audiobook"
  ],
  "author": "David Nicholls",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/366842.The_Understudy"
}