{
  "title": "We All Die Alone",
  "description": "Acclaimed cartoonist Mark Newgarden debuted in the first issue of RAW magazine in 1980 and his work subsequently found its way into a variety of high and low profile media. He co-created the '80s pop culture fad \"Garbage Pail Kids,\" wrote, drew, and syndicated a weekly humor feature in the '90s, and created a \"Web Premiere Toon\" for The Cartoon Network called \"B. Happy.\" Newgarden is currently developing an unconventional Christmas special for The Cartoon Network. Newgarden's comics are hilarious, alarming, and masterful uses of the medium, alternating between old-time gags and avant-garde storytelling, often on the same page without missing a comedic beat. His syndicated strip in such publications as L.A. Weekly and The New York Press encouraged a fervent following and exerted a fresh influence on the medium. Today they remain as vital and entertaining as when they first appeared. Those syndicated comics will make up the bulk of this book, the balance drawing on Newgarden's long form stories from various anthologies, including the much-lauded \"Love's Savage Fury.\" In addition to compiling his comics, this book will be a full picture of the artist, his influences, and his many other careers. An avid collector and historian of 20th century ephemera, Newgarden has achieved the rare distinction of both contributing to and furthering the mediums he collects: novelties, comics, and cartoons. Newgarden remains a great link to the past while moving ever further into the future. We All Die Alone is edited by Dan Nadel, founder and editor of The Ganzfeld , and a regular contributor to The New York Times, Print, Metropolis , and more. It is designed by Helene Silverman, who has designed books for Abrams, Random House, Penguin, Chronicle and many other publishing companies. She has been the Design Director for the Red Hot Organization since 1990 and is a former Design Director of Metropolis. We All Die Alone will be an uproariously funny and fascinating book that will appeal to comics readers, pop culture buffs, and any appreciator of the graphic arts.",
  "genres": [
    "Comics",
    "Humor",
    "Art",
    "Graphic Novels"
  ],
  "author": "Mark Newgarden",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/366828.We_All_Die_Alone"
}