{
  "title": "A Course in Chinese Astrology: Reveal Your Destiny, Harness Your Luck with Four Pillars",
  "description": "Award-Winner Finalist in the Eastern Philosophy category of the 2017 Soul-Bridge Body-Mind-Spirit Book Awards of Europe!(January 29, 2018)Book Description\nWhen you’re tired of waiting for destiny to show you the way and you’re ready to take hold of your personal success in love, health, wealth, and life, reveal your true self and better understand others with this in-depth look at Chinese Astrology! \n  A Course in Chinese Astrology  is a rare look into Ba Zi, the Four Pillars that make up the Chinese divination system based on date and time of birth.  Written by renowned consultant, teacher, and author  Althea S.T., this unique guide provides those who want to know more about their own lives, luck, happenings, and long-term perspectives in a very candid and open format. More importantly, it will help you create a powerful life experience that helps you find fulfillment.  This is your opportunity to learn why destiny and luck play a major part in your life and how you can influence those changes and make better decisions to take hold of your future. In it you’ll learn:  \n\n   The Meaning Behind All Four Pillars  \n  \n   Relationships Between Pillars (Combinations, Harms, Clashes, Punishments, and Destructions  \n  \n   Specifics of Your Own Destiny  \n  \n   The Five Elements, Stems and Branches (Zodiac Signs)  \n  \n   The 10 Selves Characteristics, Health, and Keys to Success  \n  \n   How to Anticipate and Change Your Future  \n  \n Backed by comprehensive case studies, charts, and tables you won’t find anywhere else, this book will unravel the secrets behind the very hour and time of your birth. With each turn of the page you’ll learn something new about yourself and those around you; and you’ll be given the tools to create the kind of happiness, success, and wealth you truly desire.",
  "genres": [
    "Astrology"
  ],
  "author": "Althea S.T.",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/36683481-a-course-in-chinese-astrology"
}