{
  "title": "The Long and Winding Way to the Top: Fifty (or so) Songs That Made Australia",
  "description": "'Andrew tells us things about the songs that we might not know and things about the songs that no one should ever know. He does it with intelligence and humour, not to mention an acid wit.' - Jimmy BarnesWhich band is Australia's premier act for drunk men to hug to? Which dance floor smash owes its existence to an elderly Canadian stand-up team? How does housing affordability threaten Australian rock? Which surprising artist is technically Australia's arguably-more-successful Beatles? Which of our alternative national anthems were written by Americans? What ultra-Australian song cut 'Vegemite' from its lyrics for being too on the nose? And most importantly, what's with all the bagpipes?Andrew P Street-writer, critic and obsessive Australian music weirdo-tries to answer these and many, many, many other questions you never thought to waste time asking in this history of Australia in 50 songs (or so). Deeply cheeky, unashamedly nostalgic and endlessly enthusiastic, this is a dive into our national playlist from the birth of rock'n'roll to the reign of Australian hip hop and just about everything in between. 'Andrew P Street book is a pithy, funny and accurate look at 50 famous Australian songs and quite frankly any lover of Aussie music would be sorely amiss if he did not take a good squiz at this book with Street's interesting and often irreverent stories of how each of these songs came to be.' - Steve Kilbey, The Church'Andrew P Street is a ridiculously infectious writer. His tone can be sharp and impertinent and he can be quirky but in the end he is authentic, original and writes his astute observations with beautiful clarity.' - Lindy Morrison, the Go-Betweens'Humour, candour and big heartedness in music writing? Blow me down. You've always been a good 'un Street. Walk on.' - Tim Rogers, You Am I",
  "genres": [
    "Music",
    "Nonfiction",
    "Australia"
  ],
  "author": "Andrew P. Street",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/36684017-the-long-and-winding-way-to-the-top"
}