{
  "title": "A Course in Real Feng Shui: Make Your Property Work for You at All Times",
  "description": "Award-Winner in the Eastern Philosophy category of the 2017 Soul-Bridge Body-Mind-Spirit Book Awards of Europe!(January 29, 2018)Book Description:\nProper balance in life and in business can leave people inspired, engaged, and ready to take action. And for real estate professionals, home buyers, designers, or just personal home life, the way you stage and design a home or your business can keep you or your clients energized, focused, and in-tune with goals both today and in the future. \n A Course in Real Feng Shui  is a book focused on the holistic nature of how Feng Shui impacts our lives and the spaces surrounding them. A wonderful look into an artform employed for thousands of years, the hidden secrets within these pages will help fortify your personal accomplishments and overall business success!  Written by renowned consultant, teacher, and author  Althea S.T., you’ll learn all about the influence of Feng Shui as it pertains to landscape, surroundings, and properties. From finding out why some locations stay inactive or become negative spaces, to choosing locations and layouts that empower and guide you along, you’ll gradually learn how to evaluate, design, redesign and improve any property.  This comprehensive Feng Shui book will also teach you:  \n\n   What Comes with a Property and Why Its Shape and Direction Matter  \n  \n   Real, Applicable Practices Behind Feng Shui  \n  \n   How to Employ Maps, a Compass, Layouts, Locations, and Directions  \n  \n   Advanced Teachings to Change Energy and Perspective  \n  \n   And so much more!  \n  \n Inside A Course in Real Feng Shui , you’ll also find jam-packed appendices and more than 200 illustrations and tables for you to study and compare; along with a 2017-2030 DS calendar, complete chapter on Annual Assessment, and the difference between good and bad locations in detail.  Get this book today and rejuvenate your current living or work spaces, homes or properties, and other locales where you need to set the right tone, comfort, and style.",
  "genres": [
    "Self Help",
    "Nonfiction"
  ],
  "author": "Althea S.T.",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/36683459-a-course-in-real-feng-shui"
}