{
  "title": "Country Music USA: 50th Anniversary Edition",
  "description": "“Fifty years after its first publication, Country Music USA still stands as the most authoritative history of this uniquely American art form. Here are the stories of the people who made country music into such an integral part of our nation’s culture. We feel lucky to have had Bill Malone as an indispensable guide in making our PBS documentary; you should, too.”—Ken Burns and Dayton Duncan, Country An American Family Story From reviews of previous “Considered the definitive history of American country music.”— Los Angeles Times “If anyone knows more about the subject than [Malone] does, God help them.”—Larry McMurtry, from In a Narrow Grave “With Country Music USA , Bill Malone wrote the Bible for country music history and scholarship. This groundbreaking work, now updated, is the definitive chronicle of the sweeping drama of the country music experience.”—Chet Flippo, former editorial director, Country Music Television and CMT.com “ Country Music USA is the definitive history of country music and of the artists who shaped its fascinating worlds.”—William Ferris, University of North Carolina at Chapel Hill, former chairman of the National Endowment for the Humanities and coeditor of the Encyclopedia of Southern Culture Since its first publication in 1968, Bill C. Malone’s Country Music USA has won universal acclaim as the definitive history of American country music. Starting with the music’s folk roots in the rural South, it traces country music from the early days of radio into the twenty-first century. In this fiftieth-anniversary edition, Malone, the featured historian in Ken Burns’s 2019 documentary on country music, has revised every chapter to offer new information and fresh insights. Coauthor Tracey Laird tracks developments in country music in the new millennium, exploring the relationship between the current music scene and the traditions from which it emerged.",
  "genres": [
    "Music"
  ],
  "author": "Bill C Malone",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/36708215-country-music-usa"
}