{
  "title": "Becoming the Dragon",
  "description": "Stuck in a scientific experiment against his will, Andy gets teleported to a faraway planet Ilanta that is inhabited both by humans and supernatural beings. Andy gets no warm welcome… fatally wounded, he decides to proceed with an ancient ritual and be reborn as a dragon, a.k.a. a Master of Heaven. In his new form, he will have to take part in all kinds of exciting adventures and gloomy challenges, mastering new magic skills, befriending orcs, elves and dragons, fighting a good fight, and, eventually, continuing on his quest for justice while reincarnated as a dragon. He has a long way to go before getting used to his body and mastering his newly obtained powers. To defend the weak and to restore justice, he will go through fire and water, suffer from intrigues, conspiracy, betrayal, and even an interplanetary war started by the royals — after all, sudden appearance of a representative of the extinct dragon race was decided not a part their plans. Little does he know that he is destined to play an integral part in an epic conflict that is to break out soon, when the future of the two planets will be decided… *** The Dragon Inside by Alex Sapegin is a bestselling heroic fantasy series. At last, the books written by the winner of Russian fantasy contests and one of the top modern writers in this genre are ready to face a worldwide audience and share their story. The book is filled with dynamic action, swordfighting, and magic. It is an epic fantasy saga of portal traveling, bodily transformations, regeneration, reincarnation, and epic combat, but first and foremost, a story of discovering and reclaiming one’s true self.  From now on, he’s got two hearts beating in his scale-clad chest and mighty wings behind his back. In the faraway planet of two moons he was born again as a dragon…  Enjoy a portal traveling saga inspired by Tolkien and George R. R. Martin!",
  "genres": [
    "Fantasy",
    "Dragons",
    "Young Adult",
    "Fiction",
    "Paranormal",
    "Science Fiction",
    "Adventure"
  ],
  "author": "Alex Sapegin",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/36697312-becoming-the-dragon"
}