{
  "title": "The High Season",
  "description": "“A mesmerizing, head-spinning—and sometimes madcap-hilarious—take of have and have-nots.”— People  (Book of the Week)NAMED ONE OF THE BEST BOOKS OF THE YEAR BY  REAL SIMPLE AND KIRKUS REVIEWS  •  “In the smart, breezy, sweet spot between Meg Wolitzer and Elin Hilderbrand.”— Entertainment WeeklyNo matter what the world throws her way, at least Ruthie Beamish has  the house . Located by the sea in a quiet Long Island village, the house is her nest egg—the retirement account shared with her ex-husband, Mike, and the college fund for their teenage daughter, Jem. The catch? To afford the house, Ruthie must let it go during the best part of the year.It’s Memorial Day weekend and the start of what Jem calls “the summer bummer”: the family’s annual exodus to make way for renters. This year, the Hamptons set has arrived. Adeline Clay is elegant and connected—and will never need to worry about money. Before long, she demonstrates an uncanny ability to help herself to Ruthie’s life. Is Adeline just being her fabulous self, or is she out to take what she wants?When an eccentric billionaire, his wayward daughter, a coterie of social climbers, and Ruthie’s old flame are thrown into the mix, the entire town finds itself on the verge of tumultuous change. But as Ruthie loses her grasp on her job, her home, and her family, she discovers a new talent for pushing back. By the end of one unhinged, unforgettable summer, nothing will be the same—least of all Ruthie.Praise for The High Season“Blundell knows the territory. . . . Her account of Ruthie’s coming to grips with a career, a daughter and a community in flux is as touching as it is convincing.” — The Wall Street Journal“A huge page-turner . . . so compelling . . . a classic beach read, but very smart, very intelligently written.” — Us Weekly , Emily Giffin’s Summer Reading Recommendations“An acid-laced domestic drama set during one golden summer on the moneyed, beachy North Fork of Long Island.” — The New York Times“Judy Blundell wields words like an oyster knife in this shimmering story of art, money, and celebrity.” —Helen Simonson,  New York Times bestselling author of  The Summer Before the War“A wry, often hilarious story of a woman trying to keep it together when everything is going so, so wrong.” — Real Simple",
  "genres": [
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Chick Lit",
    "Adult",
    "Adult Fiction",
    "Book Club"
  ],
  "author": "Judy Blundell",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/36723241-the-high-season"
}