{
  "title": "House of Nutter: The Rebel Tailor of Savile Row",
  "description": "The strange, illuminative true story of Tommy Nutter, the Savile Row tailor who changed the silhouette of men’s fashion—and his rock photographer brother, David, who captured it all on film.  From an early age, there was something different about Tommy and David Nutter. Growing up in an austere apartment above a café catering to truck drivers, both boys seemed destined to lead rather humble lives in post-war London—Tommy as a civil servant, David as a darkroom technician. Yet the strength of their imagination (plus a little help from their friends) transformed them instead into unlikely protagonists of a swinging cultural revolution.   In 1969, at the age of twenty-six, Tommy opened an unusual new boutique on the “golden mile” of bespoke tailoring, Savile Row. While shocking a haughty establishment resistant to change, “Nutters of Savile Row” became an immediate sensation among the young, rich, and beautiful, beguiling everyone from Bianca Jagger to the Beatles—who immortalized Tommy’s designs on the album cover of Abbey Road. Meanwhile, David’s innate talent with a camera vaulted him across the Atlantic to New York City, where he found himself in a parallel constellation of stars (Yoko Ono, Elton John) who enjoyed his dry wit almost as much as his photography.   House of Nutter tells the stunning true story of two gay men who influenced some of the most iconic styles and pop images of the twentieth century. Drawing on interviews with more than seventy people—and taking advantage of unparalleled access to never-before-seen pictures, letters, sketches, and diaries—journalist Lance Richardson presents a dual portrait of brothers improvising their way through five decades of extraordinary events, their personal struggles playing out against vivid backdrops of the Blitz, an obscenity trial, the birth of disco, and the devastation of the AIDS crisis.    A propulsive, deftly plotted narrative filled with surprising details and near-operatic twists, House of Nutter takes readers on a wild ride into the minds and times of two brilliant dreamers.",
  "genres": [
    "Nonfiction",
    "Fashion",
    "Biography",
    "Biography Memoir",
    "History",
    "Historical",
    "Book Club"
  ],
  "author": "Lance  Richardson",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/36718507-house-of-nutter"
}