{
  "title": "Mistress Mine",
  "description": "Librarian Note: This is the latest edition with updated cover from ISBN  1530834325 (ISBN13: 9781530834327)  \nIn 1876, Louise St Quentin is sixteen. She is an orphan and the rich owner of a huge estate. Her future seems all mapped out; a marriage of convenience which would help her manage her estate. But Louise listens to her heart rather than her reason.The end of the 19th century is terribly exciting, and Louise wants to discover everything – the adventure lying at the end of the railway track, romantic music, the modern cuisine in the new Parisian restaurants, and impressionist painting. Will her artistic, cultural and sensual upbringing going to lead the young girl to her ruin or to love? Will Louise, the young French girl find the grass greener on the other side of the world?Gabrielle Dubois, the author, obviously studied the fashion of the 19th century in detail – the very sophisticated, elaborate clothes, especially in the upper-class circles which Louise moves around in, and in fact the whole novel is extremely well documented.The reader can’t help getting attached to the heroine and the men and women who cross her path during her travels. Louise Saint Quentin might become one of them much desired “Mistress Mine” but she is above all her own “Mistress Mine” as she has to learn all about life and how to fend for herself from a very early age, something unusual for a girl at the time.The numerous, often pithy, dialogues throughout the novel show her personality and how it evolves. They bring both Louise and the other characters to life and together with all the little, well-observed details, create “a reality effect”. In a word, we are drawn into Mistress Mine from the start and we find hard to put it down. Although we are rather sad to get to the end, we know there is another volume of the saga \"Where are you roaming?\" which will be available in June 2018 and we can’t wait to read it.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical Romance",
    "Historical",
    "France",
    "Fiction",
    "Adventure"
  ],
  "author": "Gabrielle Dubois",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/36722938-mistress-mine"
}