{
  "title": "The Lost Indictment of Robert E. Lee: The Forgotten Case against an American Icon",
  "description": "History has been kind to Robert E. Lee. Woodrow Wilson believed General Lee was a “model to men who would be morally great.” Douglas Southall Freeman, who won a Pulitzer Prize for his four-volume biography of Lee, described his subject as “one of a small company of great men in whom there is no inconsistency to be explained, no enigma to be solved.” Winston Churchill called him “one of the noblest Americans who ever lived.” Until recently, there was even a stained glass window devoted to Lee's life at the National Cathedral in Washington, D.C.Immediately after the Civil War, however, many northerners believed Lee should be hanged for treason and war crimes. Americans will be surprised to learn that in June of 1865 Robert E. Lee was indicted for treason by a Norfolk, Virginia grand jury. In his instructions to the grand jury, Judge John C. Underwood described treason as “wholesale murder,” and declared that the instigators of the rebellion had “hands dripping with the blood of slaughtered innocents.” In early 1866, Lee decided against visiting friends while in Washington, D.C. for a congressional hearing, because he was conscious of being perceived as a “monster” by citizens of the nation’s capital. Yet somehow, roughly fifty years after his trip to Washington, Lee had been transformed into a venerable American hero, who was highly regarded by southerners and northerners alike. Almost a century after Appomattox, Dwight D. Eisenhower had Lee’s portrait on the wall of his White House office.The Lost Indictment of Robert E. Lee tells the story of the forgotten legal and moral case that was made against the Confederate general after the Civil War. The actual indictment went missing for 72 years. Over the past 150 years, the indictment against Lee after the war has both literally and figuratively disappeared from our national consciousness. In this book, Civil War historian John Reeves illuminates the incredible turnaround in attitudes towards the defeated general by examining the evolving case against him from 1865 to 1870 and beyond.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American Civil War",
    "American History",
    "Biography",
    "19th Century"
  ],
  "author": "John    Reeves",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/36710264-the-lost-indictment-of-robert-e-lee"
}