{
  "title": "Dead on the Water",
  "description": "Don’t miss the thrilling suspense novel from bestselling author RWK Clark. What happens when a dream vacation becomes a fight for survival?A cruise ship carrying a terrible, zombie-making virus returns to the vast ocean.This post-apocalyptic science fiction novel pulsates with horror and evil that will have you on the edge of your seat.Author CommentaryThis is another zombie contribution that I put a bit of a spin on. ‘Dead on the Water’ chronicles the story of a Fantasy Lines cruise ship carrying a terrible, zombie-making virus that returns to the vast ocean.This is a fast-paced book; once the action starts, it is pretty much non-stop. Being on a cruise ship, those who are still normal have minimal resources or means of escape.While it is about zombies, and there are several very graphic scenes, I do not believe it is necessarily a scary book. I tried to use dialogue in a surreal manner, especially coming from the monsters, to show the craziness and terrifying truth about the situation. Still, I didn’t want it to be too heavy. My vision was simply to relate the hopelessness of the situation without making the book burdensome to read; I wanted it to be on the ‘lighter’ side, if possible.I find it challenging to imagine happy endings when it comes to the genres I write in, and I find it much easier to be horribly realistic. But let’s face it, I write about completely unrealistic stuff. What I’m trying to say is, the glory of fiction is in its falseness, but the impact of fiction is found in its painful reality. If a zombie apocalypse really happened, would the ending be a good one? If the zombies reach land, there will be a pandemic zombie outbreak. Someone on that damn boat has to be smart enough to get help. A pretty daunting task, don’t you think? Well, all I have to say is, you’ll just have to see.",
  "genres": [
    "Zombies",
    "Horror"
  ],
  "author": "R.W.K. Clark",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/36748757-dead-on-the-water"
}