{
  "title": "First Ladies of the Republic: Martha Washington, Abigail Adams, Dolley Madison, and the Creation of an Iconic American Role",
  "description": "How the three inaugural First Ladies defined the role for future generations, and carved a space for women in AmericaAmerica's first First Ladies--Martha Washington, Abigail Adams, and Dolley Madison--had the challenging task of playing a pivotal role in defining the nature of the American presidency to a fledgling nation and to the world. In First Ladies of the Republic, Jeanne Abrams breaks new ground by examining their lives as a group. From their visions for the future of the burgeoning new nation and its political structure, to ideas about family life and matrimony, these three women had a profound influence on one another's views as they created the new role of presidential spouse.Martha, Abigail and Dolley walked the fine line between bringing dignity to their lives as presidential wives, and supporting their husbands' presidential agendas, while at the same time, distancing themselves from the behavior, customs and ceremonies that reflected the courtly styles of European royalty that were inimical to the values of the new republic. In the face of personal challenges, public scrutiny, and sometimes vocal criticism, they worked to project a persona that inspired approval and confidence, and helped burnish their husbands' presidential reputations.The position of First Lady was not officially authorized or defined, and the place of women in society was more restricted than it is today. These capable and path-breaking women not only shaped their own roles as prominent Americans and \"First Ladies,\" but also defined a role for women in public and private life in America.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Biography",
    "Biography Memoir",
    "American Revolutionary War"
  ],
  "author": "Jeanne E. Abrams",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/36747918-first-ladies-of-the-republic"
}