{
  "title": "The Iceman",
  "description": "The Iceman is an action-packed World War II military thriller featuring a daring United States Navy submarine commander during the Pacific war in 1942-43.In 1942, off the port city of St. Nazaire in occupied France, a United States Navy S-class submarine assigned to the Royal Navy lurks just outside the borders of the minefield protecting a German U-boat base. Lieutenant Commander Malachi Stormes, the boat’s skipper, patrols dangerously close to the minefield entrance and manages to trap and sink three outbound U-boats in one spectacular attack. Britain decorates him, the U.S. Navy promotes him and then gives him command of a brand new class of submarine, a fleet boat called Firefish. Based in Perth, Australia, having been driven out of the Philippines by the Japanese juggernaut, the Perth boats are the only American forces capable of hitting the Japanese in the western Pacific.Stormes, with his cold, steely-eyed focus on killing Japanese ships, is an enigma to his officers and crew, especially when it becomes clear that he is willing to take huge chances to achieve results. Firefish sinks more ships than any Perth boat on her first war patrol, but Stormes’ unconventional tactics literally frighten his crew. Driven by a past steeped in the whiskey-haunted violence of the Kentucky coal fields, whose psychological scars torment his sleep and close him off from personal relationships, Stormes is nicknamed The Iceman. His crew is proud of their boat’s accomplishments, but wonder if their iron-willed skipper will bring them home alive.With intense action and featuring authentic submarine tactics in the early years of the Pacific war, The Iceman continues P. T. Deutermann's masterful, award-winning cycle of thrillers set during World War II.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Military Fiction",
    "Audiobook",
    "War",
    "Suspense"
  ],
  "author": "P.T. Deutermann",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/36743039-the-iceman"
}