{
  "title": "Lady Be Good",
  "description": "Set in the 1950s, Lady Be Good is Amber Brock's mesmerizing return, sweeping readers into the world of the mischievous, status-obsessed daughter of a hotel magnate and the electric nightlife of three iconic cities: New York, Miami, and Havana.\nKitty Tessler is the winsome and clever only child of self-made hotel and nightclub tycoon Nicolas Tessler. Kitty may not have the same pedigree as the tennis club set she admires, but she still sees herself as every inch the socialite--spending her days perfecting her \"look\" and her nights charming all the blue-blooded boys who frequent her father's clubs. It seems like the fun will never end until Kitty's father issues a terrible ultimatum: she may no longer date the idle rich. Instead, Kitty must marry Andre, her father's second-in-command, and take her place as the First Lady of his hotel empire. Kitty is forced to come up with a wily and elaborate plan to protect her own lofty ideas for the future, as well as to save her best friend, Henrietta Bancroft, from a doomed engagement: Kitty will steal Henrietta's fiance, a fabulously wealthy but terribly unkind man from a powerful family--thereby delivering the one-two punch of securing her now-fragile place on the social ladder and keeping her friend from a miserable marriage.Then Kitty meets Max, a member of a band visiting New York from her father's Miami club, and her plans take a turn. Smitten, but still eager to convince her father of her commitment to Andre, Kitty and Hen follow Max, Andre, and the rest of the band back down to Miami--and later to Cuba. As Kitty spends more time with Max, she begins waking up to the beauty--and the injustice--of the world beyond her small, privileged corner of Manhattan. And when her well-intended yet manipulative efforts backfire, Kitty is forced to reconsider her choices and her future before she loses everyone she loves.“Kitty Tessler, a headstrong glamour girl determined to move up in the world, steals the spotlight in Amber Brock’s latest, a tour-de-force filled with intrigue and surprises.” --\nFiona Davis, nationally bestselling author of The Address and The Dollhouse",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Romance",
    "New York",
    "Womens Fiction"
  ],
  "author": "Amber Brock",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/36750088-lady-be-good"
}