{
  "title": "Secret Heir",
  "description": "Since the beginning of time, tales have been told about Eden. But all the stories are wrong.Running parallel alongside Earth, but never touching, there exists not just a garden, but an entire world of vivid colours and breathtaking beauty where the Seraph reside.Jazmine has lived in ten different foster homes, in ten different towns and all her life she has felt like she doesn’t belong – not in the trailer park which happens to be foster home number ten, not anywhere on Earth. After a universe shattering revelation, she discovers why. Far from being the nothing and no one, with no past and no future, that Jazmine had always believed herself to be, she discovers that she is in fact an heir to one of the seven remaining Seraph Dynasties. She is Jazmine Evenstar, the last heir to the sovereign Evenstar Dynasty.Thrust into the world of wealth and privilege in which the impossibly beautiful and equally cruel Dynasty heirs reside, Jazmine is forced to manoeuvre the tangled web that holds the Dynasties together.Against the backdrop of breathtaking star filled nights, sweeping coastlines, grand marble halls and decadent palaces, Jazmine tries to find her place in this beautiful new world whilst fighting not to lose herself in the process.But the fairy tale quickly unravels. Half human and the illegitimate daughter of the late suicide King of Eden, the other Dynasty heirs make it clear that Jazmine does not belong in their world. Raphael St. Tristan, heir to the rival sovereign St. Tristan Dynasty and next in line to the throne of Eden, the guy with the face of an angel but who is as wicked as the devil himself, promises to break her. Jazmine quickly learns that the beauty of Eden is nothing but a deception as she uncovers the secrets festering at the heart of it. But can she disentangle herself from the web of deception and intrigue that the Dynasty heirs have spun? Can she stop herself from falling into Raphael St. Tristan’s trap before he can fulfil his promise to shatter her completely? Or are those stories about Eden true after all and will she be foolish enough to taste the forbidden fruit that is Eden itself?",
  "genres": [
    "Fantasy",
    "New Adult",
    "Romance",
    "Young Adult",
    "Paranormal",
    "Magic",
    "Enemies To Lovers"
  ],
  "author": "M.J. Prince",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/36754125-secret-heir"
}