{
  "title": "The Ghastling: Book Six",
  "description": "Book Six explores the uncanny, the surreal, the dark reaches of the imagination and the space between the ordinary world and the folklore and superstition that hangs around in the peripheries of daily life. In the case of some of these tales, there is almost no difference, both worlds are one and the same.In Carly Holmes' 'Heartwood', a mother with branches for arms and bark for skin struggles to retain this strange affliction and is betrayed by her son in this dark story. Phil Jones' 'An Eclipse of Moths', a furniture maker discovers some peculiar fungi grown overnight on a cabinet he's been making, perhaps it's the stifling summer heat that causes their appearance? But then other things arrive... On a family visit to the Philippines, Jill, a young expectant mother, becomes convinced she is being pursued by an Aswang - a witch whose long thin tongue will suck out her fetus in 'Tik-Tik', Neil Gravino's contemporary portrayal of this terrifying Philippine folktale. A family bring their mother home to die in Laura Maria Grierson's story 'At the Stroke'. The grandfather clock, stopped for a long time, suddenly begins to tick, but why? In Gary McCrossan's 'The last Laugh', enter the seedy world of The Golden Nugget, an amusement arcade at the end of Yorkshire's Bridley Pier, where an automated laughing clown is linked to Louis the change operator's disappearance... Bernadette, minding some eerily quiet children, decides to liven things up with a game of hide and seek but in this small terraced house they are nowhere to be found. When eventually they do appear, exactly in the room the game started, everything is altered and she begins to question what she had seen before - and how many children were there, really? In Reggie Chamberlain-King's uncanny story, 'Five or Six Children'. Louise Lloyd's 'The Dark Circle', a young anxious widow steps out to attend a sEance in the hopes of reaching her beloved husband but 'the circle' is less welcoming than she hoped... Robert Davies' story 'The Caller' tells the tale of Marlin James who lives alone on the top of Y Drws. A freezing cold night brings a needy traveller to his door, but should he let her in? Old Sir Edward Culverin lives alone in a run-down stately home, woken by a large cracking noise, driven to find out what could have made such a ghastly sound he finds himself following an old passageway in a mausoleum which leads him down into the hot depths of the earth in Chip Limeburner's tale, 'The Folly'.",
  "genres": [],
  "author": "Carly Holmes",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/36740685-the-ghastling"
}