{
  "title": "Lincoln's Last Trial: The Murder Case That Propelled Him to the Presidency",
  "description": "The true story of Abraham Lincoln's last murder trial, a strange case in which he had a deep personal involvement--and which was played out in the nation's newspapers as he began his presidential campaign.At the end of the summer of 1859, twenty-two-year-old Peachy Quinn Harrison went on trial for murder in Springfield, Illinois. Abraham Lincoln, who had been involved in more than three thousand cases--including more than twenty-five murder trials--during his two-decades-long career, was hired to defend him. This was to be his last great case as a lawyer.What normally would have been a local case took on momentous meaning. Lincoln's debates with Senator Stephen Douglas the previous fall had gained him a national following, transforming the little-known, self-taught lawyer into a respected politician. He was being urged to make a dark-horse run for the presidency in 1860. Taking this case involved great risk. His reputation was untarnished, but should he lose this trial, should Harrison be convicted of murder, the spotlight now focused so brightly on him might be dimmed. He had won his most recent murder trial with a daring and dramatic maneuver that had become a local legend, but another had ended with his client dangling from the end of a rope.The case posed painful personal challenges for Lincoln. The murder victim had trained for the law in his office, and Lincoln had been his friend and his mentor. His accused killer, the young man Lincoln would defend, was the son of a close friend and loyal supporter. And to win this trial he would have to form an unholy allegiance with a longtime enemy, a revivalist preacher he had twice run against for political office--and who had bitterly slandered Lincoln as an \"infidel...too lacking in faith\" to be elected.Lincoln's Last Trial captures the presidential hopeful's dramatic courtroom confrontations in vivid detail as he fights for his client--but also for his own blossoming political future. It is a moment in history that shines a light on our legal system, as in this case Lincoln fought a legal battle that remains incredibly relevant today.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "True Crime",
    "Audiobook",
    "Presidents"
  ],
  "author": "Dan Abrams",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/36743867-lincoln-s-last-trial"
}