{
  "title": "Crux: A Cross-Border Memoir",
  "description": "A daughter's quest to understand her charismatic and troubled father, an immigrant who crosses borders both real and illusory--between sanity and madness, science and spirituality, life and death PEN America Literary Award Winner - \"The kind of memoir that seems to redefine the genre.\"--Los Angeles Review of Books  Throughout Jean Guerrero's childhood, her father, Marco Antonio, was an erratic and elusive presence. A self-taught genius at fixing, creating, and conjuring things--and capable of transforming himself into a shaman, dreamcaster, or animal whisperer in his enchanted daughter's eyes--he gradually began to lose himself in his peculiar obsessions, careening wildly between reality and hallucination. In time, he fled his family and responsibilities--to Asia, Europe, and eventually back to Mexico. He succumbed to drug- and alcohol-fueled manias, while suffering the effects of what he said were CIA mind-control experiments. As soon as she was old enough, Jean set out after him. Now a journalist, she used the tools of her trade, hoping to find answers to the questions he left behind.In this lyrical, haunting memoir,  Jean Guerrero tries to locate the border between truth and fantasy as she searches for explanations for her father's behavior. Refusing to accept an alleged schizophrenia diagnosis at face value, she takes Marco Antonio's dark paranoia seriously and investigates all his wildest claims. She crisscrosses the Mexican-American border to unearth the stories of cousins and grandparents and discovers a chain of fabulists and mystics in her lineage, going back to her great-great-grandmother, a clairvoyant curandera who was paid to summon spirits from the afterlife. As she delves deeper and deeper into her family's shadowy past, Jean begins mirroring her father's self-destructive behavior. She risks death on her adventures, imperiling everything in her journey to redeem her father from the underworld of his delusions.In the tradition of engrossing family memoirs like The Liar's Club and The Glass Castle, Crux is both a riveting adventure story and a profoundly original exploration of the human psyche, the mysteries of our most intimate relationships--and ourselves.\"[Guerrero] writes poetically about borders as a metaphor for the boundary of identity between father and daughter and the porous connective tissues that bind them.\"--The National Book Review",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "Audiobook",
    "Psychology",
    "Autobiography"
  ],
  "author": "Jean Guerrero",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/36794530-crux"
}