{
  "title": "The Lost Quilter",
  "description": "Master Quilter Sylvia Bergstrom Compson treasures an antique quilt called by three names -- Birds in the Air, after its pattern; the Runaway Quilt, after the woman who sewed it; and the Elm Creek Quilt, after the place to which its maker longed to return. That quilter was Joanna, a fugitive slave who traveled by the Underground Railroad to reach safe haven in 1859 at Elm Creek Farm. Though Joanna's freedom proved short-lived -- she was forcibly returned by slave catchers to Josiah Chester's plantation in Virginia -- she left the Bergstrom family a most precious gift, her son. Hans and Anneke Bergstrom, along with maiden aunt Gerda, raised the boy as their own, and the secret of his identity died with their generation. Now it falls to Sylvia -- drawing upon Gerda's diary and Joanna's quilt -- to connect Joanna's past to present-day Elm Creek Manor. Just as Joanna could not have foreseen that, generations later, her quilt would become the subject of so much speculation and wonder, Sylvia and her friends never could have imagined the events Joanna witnessed in her lifetime. Punished for her escape by being sold off to her master's brother in Edisto Island, South Carolina, Joanna grieves over the loss of her son and resolves to run again, to reunite with him someday in the free North. Farther south than she has ever been, she nevertheless finds allies, friends, and even love in the slave quarter of Oak Grove, a cotton plantation where her skill with needle and thread soon becomes highly prized. Through hardship and deprivation, Joanna dreams of freedom and returning to Elm Creek Farm. Determined to remember each landmark on the route north, Joanna pieces a quilt of scraps left over from the household sewing, concealing clues within the meticulous stitches. Later, in service as a seamstress to the new bride of a Confederate officer, Joanna moves on to Charleston, where secrets she keeps will affect the fate of a nation, and her abilities and courage enable her to aid the country and the people she loves most. The knowledge that scraps can be pieced and sewn into simple lines -- beautiful both in and of themselves and also for what they represent and what they can accomplish -- carries Joanna through dark days. Sustaining herself and her family through ingenuity and art during the Civil War and into Reconstruction, Joanna leaves behind a remarkable artistic legacy that, at last, allows Sylvia to discover the fate of the long-lost quilter.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Quilting",
    "Historical",
    "Civil War",
    "Chick Lit",
    "Audiobook"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/3678952-the-lost-quilter"
}