{
  "title": "The Triumph of Rosemary",
  "description": "Baby Rosemary - born to an Italian teen and a married black man in Detroit in 1946 - is adopted from an agency by a black couple in Saginaw, Michigan. The adoptive mother's abuse instills in the girl, whom they name Marylin Elnora, ambition to achieve great things on her own. At age 19, Marylin sparks a racial and religious scandal by marrying former Roman Catholic priest Thomas Lee Atkins, who is white and 25 years older. Poor in finances but rich in love, they have two biracial daughters, Elizabeth Ann Atkins and Catherine Marie Atkins Greenspan, who look white. Team work makes the family's dream work as Marylin attends the University of Detroit School of Law at night while she and Tom work full time; he becomes \"Mr. Mom\" - taking the high-achieving girls to lessons for swim, piano, and skiing. He journals nightly, inspiring the girls' passion for reading and writing.All the while, family rifts in the wake of their interracial union begin to heal, fostering harmony and healing. The family's lifestyle includes friendships and associations with people of a cornucopia of race, religion, and culture, as Tom even serves as president of an American Indian association.Marylin becomes an attorney, putting the girls through the University of Michigan. Sadly, Tom dies before seeing the girls earn graduate degrees in writing from Columbia University and University of San Francisco. And he never saw Marylin's illustrious and highly respected career as a judge, which included 12 years as chief judge of Detroit's 36th District Court.\nThe Triumph of Rosemary's \nvivid dialogue, raw revelations, and heartwarming messages will make you laugh, cry, and appreciate the power of one woman to pioneer a place for herself and her family in a sometimes unwelcoming world that ultimately embraced and celebrated her family's legacy of colorblind love.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Adoption"
  ],
  "author": "Marylin E. Atkins",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/36791683-the-triumph-of-rosemary"
}