{
  "title": "The Children of Green Knowe",
  "description": "There are three children: Toby, who rides the majestic horse Feste; his mischievous little sister, Linnet; and their brother, Alexander, who plays the flute. The children warmly welcome Tolly to Green Knowe...even though they've been dead for centuries. But that's how everything is at Green Knowe. The ancient manor hides as many stories as it does dusty old rooms. And the master of the house is great-grandmother Oldknow, whose storytelling mixes present and past with the oldest magic in the world.L.M. Boston's thrilling and chilling tales of Green Knowe, a haunted manor deep in an overgrown garden in the English countryside, have been entertaining readers for half a century.‘Notable for its illustrations and literary quality.’ — Schoolmaster ‘A most attractive story of a little boy who is lucky enough to see and hear something of his family who lived three hundred years ago. This is beautifully written.’ — Country Life ‘It is rare indeed to find a book that stands comparison with The Secret Garden but Green Knowe has that quality of elusive yet powerful magic bound to a reality as solid as bread and butter. The illustrations by Peter Boston enhance this atmosphere.’ — Time and Tide‘The adventures that make up the body of the story are ... something quite individual in children’s writing ... Altogether, it is a most unusual story, with magic in the telling as much as in the content. Children as young as eight years old would enjoy having it read to them and it is impossible to set an upper limit for its appeal.’  — The Times Literary Supplement‘The book is one that will particularly delight the child who reads, not so much to share vicariously in violent events, but rather as an escape into some frail, private world.’ — The Spectator ‘... its real-unreal enchantment akin to Mr de la Mare’s work - its freshness of phrase - it’s happy lingering on the edge of time with Toby and his horse Feste, as we listen to Alexander’s flute and Linnet’s laughter.’ — John o’ London’s Weekly",
  "genres": [
    "Fantasy",
    "Childrens",
    "Fiction",
    "Middle Grade",
    "Classics",
    "Ghosts",
    "Young Adult"
  ],
  "author": "Lucy M. Boston",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/12220708-the-children-of-green-knowe"
}