{
  "title": "An Academic Life: A Memoir",
  "description": "A compelling memoir by the first woman president of a major American university.Hanna Holborn Gray has lived her entire life in the world of higher education. The daughter of academics, she fled Hitler's Germany with her parents in the 1930s, emigrating to New Haven, where her father was a professor at Yale University. She has studied and taught at some of the world's most prestigious universities. She was the first woman to serve as provost of Yale. In 1978, she became the first woman president of a major research university when she was appointed to lead the University of Chicago, a position she held for fifteen years. In 1991, Gray was awarded the Presidential Medal of Freedom, the nation's highest civilian honor, in recognition of her extraordinary contributions to education.An Academic Life is a candid self-portrait by one of academia's most respected trailblazers. Gray describes what it was like to grow up as a child of refugee parents, and reflects on the changing status of women in the academic world. She discusses the migration of intellectuals from Nazi-held Europe and the transformative role these exiles played in American higher education--and how the emigre experience in America transformed their own lives and work. She sheds light on the character of university communities, how they are structured and administered, and the balance they seek between tradition and innovation, teaching and research, and undergraduate and professional learning.An Academic Life speaks to the fundamental issues of purpose, academic freedom, and governance that arise time and again in higher education, and that pose sharp challenges to the independence and scholarly integrity of each new generation.",
  "genres": [
    "Memoir",
    "Biography",
    "Education",
    "Biography Memoir",
    "Womens"
  ],
  "author": "Hanna Holborn Gray",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/36854840-an-academic-life"
}