{
  "title": "Nietzsche: An Introduction to the Understanding of His Philosophical Activity",
  "description": "Jaspers find Nietzsche's philosophy to be extraordinary not only because he foresaw all the monstrosities of the twentieth century, but also because he saw through them. Nietzsche claimed to be a philosopher of the future, but he was appropriated as a philosopher of Nazism. His work inspired a long study by Martin Heidegger and essays by a host of lesser disciples attached to the Third Reich. In 1935, however, Karl Jaspers set out to \"marshall against the National Socialists the world of thought of the man they had proclaimed as their own philosopher.\" The year after publishing Nietzsche , Jaspers was discharged from his professorship at Heidelberg University by order of the Nazi leadership. Jaspers does not fall into the same trap as idealogues do, citing bits and pieces from Nietzsche's work to reinforce already held opinions. Instead, he openly shows the wide range of Nietzsche's views, including his endorsement of wars and warriors, his prophecies of world struggle and \"new masters,\" and the cruel arrogance of the supermen. Yet Jaspers finds Nietzsche's philosophy to be extraordinary not only because he foresaw all the monstrosities of the twentieth century, but also because he saw through them. \"The appearance which Nietzsche's work presents can be expressed it is as though a mountain wall had been dynamited; the rock, already more or less shaped, conveys the idea of a whole. But the building for the sake of which the dynamiting seems to have been done has not been erected. However, the fact that the work lies about like a heap of ruins does not appear to conceal its spirit from the one who happens to have found the key to the possibilities of construction; for him, many fragments fit together. But not unambiguously; many functionally suitable pieces are present in numerous, only slightly varied repetitions, others reveal themselves as precious and unique forms, as though each were meant to furnish a cornerstone somewhere or a keystone for an arch.\"―Karl Jaspers, from the introduction",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "20th Century",
    "German Literature"
  ],
  "author": "Karl Jaspers",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/368123.Nietzsche"
}