{
  "title": "The Left Behind: Decline and Rage in Rural America",
  "description": "How a fraying social fabric is fueling the outrage of rural AmericansWhat is fueling rural America's outrage toward the federal government? Why did rural Americans vote overwhelmingly for Donald Trump? And, beyond economic and demographic decline, is there a more nuanced explanation for the growing rural-urban divide? Drawing on more than a decade of research and hundreds of interviews, Robert Wuthnow brings us into America's small towns, farms, and rural communities to paint a rich portrait of the moral order--the interactions, loyalties, obligations, and identities--underpinning this critical segment of the nation. Wuthnow demonstrates that to truly understand rural Americans' anger, their culture must be explored more fully.We hear from farmers who want government out of their business, factory workers who believe in working hard to support their families, town managers who find the federal government unresponsive to their communities' needs, and clergy who say the moral climate is being undermined. Wuthnow argues that rural America's fury stems less from specific economic concerns than from the perception that Washington is distant from and yet threatening to the social fabric of small towns. Rural dwellers are especially troubled by Washington's seeming lack of empathy for such small-town norms as personal responsibility, frugality, cooperation, and common sense. Wuthnow also shows that while these communities may not be as discriminatory as critics claim, racism and misogyny remain embedded in rural patterns of life.Moving beyond simplistic depictions of the residents of America's heartland, The Left Behind offers a clearer picture of how this important population will influence the nation's political future.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Sociology",
    "Audiobook",
    "Cultural",
    "History",
    "Economics"
  ],
  "author": "Robert Wuthnow",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/36854825-the-left-behind"
}