{
  "title": "عقل غير هادئ: سيرة ذاتية عن الهوس والاكتئاب والجنون",
  "description": "تنتشر الأمراض النفسية في عصرنا الحالي وتستشري في بنية المجتمعات البشرية بأسرها، فالزمن هو زمن اللهاث والجري والتنافس الشرس الذي يورث القلق والإخباط، وهو الزمن الذي تحول فيه الإنسان إلى ترس في آلة التصنيع والإنتاج، بينما تتوارى حاجاته النفسية ومتطلباته الروحية وراء ستائر احتياجاته المادية وكماليات الحياة الكثيرة والمتشابكة. ورغم انتشار الأمراض النفسية وكثرة المصابين بها، إلا أن القليل جداً هو المعروف عن طبيعة وتفاصيل وأعراض هذه الأمراض. فالخطاب الاجتماعي يجبر الناس على التكتم والتعتيم على هذه المعاناة، وإحاطة أنفسهم بالسرية الشديدة، حتى لا يتهموا في عقولهم، فيؤثر المريض ابتلاع معاناته، وازدراد آلامه وحده دون مساعدة طبية، وغالباً ما يلجأ في مجتمعاتنا العربية للمشعوذين والدجالين أملاً في التخلص من شباك عذاباته!كتاب \"عقل غير هادئ\" يقاربهذه الإشكالية بقوة وعمق، فيلامس عن قرب مشاعر من يراقب ذاته تتملص منبين قبضته، وتخرج من حدود سيطرته، فلا يعود يتعرف على معالمها، ولا يميز قسماتها، ولا يحدد ردود أفعالها.كتاب \"عقل غير هادئ\" للدكتورة والأكاديمية المتخصصة في علم النفس \"كاي ردفيلد جاميسون\" يأخذ القارئ في رحلة استثنائية مثيرة داخل مسارب نفس ثرية الوجدان شاعرية الملامح، ويمرق به إلى متاهات ذات مرهفة الحس، رقيقة الحاشية، أرهقها طول العذاب، وناءت بما تحمله من آلام، في سيرة ذاتية شجاعة ومدهشة ومفعمة بالصدق والبوح الشفيف والتصوير المذهل لتفاصيل آلام وعذابات يعاني منها ملايين البشر في شتى بقاع الأرض، ثم يغلقون صدورهم على مجرياتها وأحداثها، ويحكمون الأقفال والمتاريس على منافذ تلك المعاناة حتى لا تظهر خارجاً جالبة لأصحابها العار والسمعة السيئة والطعن في أُمن ما يمتلكه الإنسان وما يتنمايز به عن باقي الأحياء: العقل.كيف يمكن أن تكون تفاصيل وملامح هذه الرحلة المثيرة إلى عالم سحر النشوة والتحليق في آفاق الفن والأدب والشعر والإبداع، ثم الارتحال ارتجاعياً للكآبة والسوداوية وأرتال من الظلمات بعضها فوق بعض إذا أخرج المرء يده لم يكد يراها؟ رحلة ملغم دربها باحتمالات الموت، والرغبة في التخلص من حياة الألم والعذاب هي أبرز عنوانيها. ومن ذلك الكرء الذي يخوض تلك التجربة؟ وما ملامحه النفسية وقسماته الشعرية؟ وكيف يمكن أن يتأرجح شخص على قدر كبير من الحساسية والشفافية والذكاء والتميز بين قمم العقل والخيال والإنجازات ثم يترنج ويسقط في مهاوي اليأس والجنون والإحباط؟والقارئ وهو يلهث متنقلاً بين صفحات الكتاب، لا يملك إلا أن يعجب بالكتورة جاميسون، التي قررت، في لحظة صادقة، أن تخلع الأقنعة، وتمزق الأحجبة، وتخرج على الملأ لتحكي تجربتها الرهيبة مع مرض قاس يطلق عليه \"ذهان الهوس الاكتئابي\"، أو \"الاضطراب الوجداني ثنائي القطبين\"، غير مبالية بما قد يجره عليها ذلك البوح من سمعة سيئة قد تكلفها، ليس فقط عملها الأكاديمي والعلاجي، ولكن احترام الناس لها، خاصة أن عملها مرتبط بمعالجة الأرواح القلقة والنفوس المعذبة، ويغور بعيداً في مجاهل النفس البشرية محاولاً الحصول على مفاتيحها وشفراتها.والكتاب صرخة صادقة ودعوة للبوح والمكاشفة تخترق مناطق وعرة اعتاد معظم من يكتب سيرته الذاتية على تجنبها وتفاديها، ومكاشفة من هذا النوع تعتبر قليلة جداً إن لم تكن نادرة، فهي تتجاوز الأسوار إلى مناطق بكر لم يسبق أن فضتها الأقلام أو اجترحتها الرؤى، وهي رحلة شائكة في مجاهل النفس البشرية وداخل وعورة دروبها، لتصف أدق المشاعر التي مرت بها الدكتور جاميسون خلال طريقها المزروع بالجراح والآلام في رحلتها التي تصل في قممها إلى النشوة الساحرة المسافرة على أجنحة آلهة الحب والشعر والجمال، ثم تنحدر في سفحها إلى عتمة وظلمة أنفاق الكآلة حتى الوصول إلى حواف الجنون.وتأتي أهمية هذا الكتاب، من محاولته صنع فوق وتغيير في نظرة الناس للأمراض النفسية، وفي تعاطيهم معها، كونه يشعل الضوء، وينير العتمة المحيطة بذهان الهوس الاكتئابي خاصة وبالأمراض النفسية الأخرى عامة.والكتاب أيضاً يقشع الضلالات المرتبطة بالعلاج بالعقاقير الطبية، ويؤكد أن هناك من يحتاجها، حتى لا يسقط فريسة لآلامه ومعاناته، وكي لا تقوده قسوة تلك الآلام للتخلص من حياته. كما يؤكد الكتاب بشدة على ممارسة نفتقدها في العالم العربي، وهي أهمية دور جلسات المعالجة النفسية (السيكوثرابي) ودور المعالج الهام في الأخذ بيد مريضة، وتفهم معاناته، وإنارة بقع ضوء في طريقه المعتم ليفهم ذاته، ويدرك تفاصيل معاناته. ومن أهم ما يقوله الكتاب ويوضحه أن المرض الذي يصيب النفس لا يختلف عن ذلك الذي يصيب الجسد وإن كان يفوقه ألماً وقسوة، وأنه نتيجة لعوامل وراثية جينية تتضافر مع ظروف الحياة لتحول حياة المريض إلى كابوس طويل ممض ليس له نهاية، فيشفى المريض أمام نفسه أولاً لأن جزءاً كبيراً من معاناة المريض النفسي يتجلى في محاكمته القاسية لنفسه على إصابته بالمرض.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Memoir",
    "Mental Health",
    "Biography",
    "Mental Illness",
    "Biography Memoir"
  ],
  "author": "Kay Redfield Jamison",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/3683592"
}