{
  "title": "A Noise Downstairs",
  "description": "The internationally bestselling author of No Time for Goodbye returns with a haunting psychological thriller that blends the twists and chills of Stephen King and Edgar Allan Poe with the driving suspense of Dennis Lehane and Harlan Coben, in which a man hears sounds that quite possibly emanate from the dead.Paul Davis is hearing some very strange noises in the night. He hears the clickety-click of a manual typewriter--as if someone is vigorously tapping the keys. The eerie sounds began soon after his wife, Charlotte, bought him a classic antique Underwood. But only Paul can hear the noise coming from downstairs; Charlotte doesn't hear anything unusual.Is Paul losing his mind? Maybe. Or is something really there? Eight months ago, he stumbled upon Connecticut's infamous \"Apology Killer\"--a psychopath who forced his victims to typewrite personal apologies to him before he cut their throats--disposing of two mutilated bodies on Milford's Post Road. Most shocking of all, the killer was his colleague, someone he thought he knew. Paul's been seeing a therapist for months to recover from the nearly fatal encounter, but his nerves and short-term memory have suffered since the traumatic event.There's only one way to learn if the noises are real or a figment of his hyper-imagination. One night, Paul rolls a sheet of paper into the machine. The next morning, when he checks the page, there is a chilling message:\"We typed our apologies like he asked but he killed us anyway.\"As he desperately searches to find a rational explanation for the note and the noises, Paul slowly begins to consider the unthinkable: The message is authentic, and the women butchered by his colleague are reaching out to him from beyond the grave.",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Audiobook",
    "Psychological Thriller"
  ],
  "author": "Linwood Barclay",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/36808039-a-noise-downstairs"
}