{
  "title": "NORTH KOREA BEHIND THE VEIL. Inside stories and private, uncensored images.",
  "description": "NORTH KOREA BEHIND THE VEIL is a collection of an insider’s short stories, articles and uncensored images, providing a unique insight and a different perspective on the world's most isolated, under-reported and misrepresented country. It is also the inside story of a different, changing country, challenging stereotypes, partisan and sensational reporting. And this is what motivated the author, who lived and worked for seven years in North Korea, to publish it: “North Korea has been portrayed for decades as a monolithic gulag network filled with slaves and a hellhole by the mass media. The socio-economic changes North Korea has undergone over the last decade or more have been almost entirely unreported. Indeed, by the beginning of 2017, mass starvation had long ceased, while more and better-assorted markets emerged throughout the country (and yet you’re still reading that ‘North Korea’s regime is starving its population’). Fewer people are punished for political crimes than in the past (but you still read that three generations of a family are sent to the gulag for the slightest political crime). The rising middle class has been transforming the rigid old political class system since marketization has enabled people from lower classes to build their own business, with some becoming rich and even more influential than many party and government officials from the privileged ‘core class,’ something prohibited two decades ago. Yet, you’re still told by the media that a North Korean’s fate is solely defined by the social ‘caste’ he belongs to and so on. Business people around the world have had no access to any news of positive progress, while any stories of ‘normal’ development are generally considered not to be newsworthy by the media. Alas, the strangulating economic embargo which was imposed later in 2017, a de facto collective punishment, is bound to reverse this progress, causing enormous and unnecessary suffering to the North Korean people.”Author Felix Abt is a politically neutral businessman and, therefore, does not share partisan views about North Korea. He is, however, critical of unfair North Korea reporting and does what he can to contribute to a more objective view of a country he knows much better than the journalists and bloggers writing about it. Abt is a former investor at several legitimate Joint Venture companies in North Korea which are now being driven into bankruptcy by U.N. \"sanctions.\"FREE BOOK DOWNLOAD HERE: PDF: https://www.academia.edu/35269779/e-b...orhttps://archive.org/details/EBookNORT...EPUB: https://www.academia.edu/35207216/E-b...",
  "genres": [],
  "author": "Felix Abt",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/36849873-north-korea-behind-the-veil-inside-stories-and-private-uncensored-imag"
}