{
  "title": "The Alchemists: A Paranormal Steampunk Thriller",
  "description": "Everything you know about the Sorcerer’s Stone is wrong!Are you ready to learn the truth?Yes, the fabled artifact known as the Emerald Tablet exists.Yes, it is the ancient source of knowledge for the powerful Alchemist Guild.What the Guild doesn’t know is the stone holds a terrible secret that goes beyond time and space, and there is more than one group willing do anything to get the Emerald Tablet.Rose, Violet, and little Rosie have settled into fancy new digs in upscale Paddington. Things get weird when the recluse Preston Gilchrist shows up on the doorstep, after three years living as a shut-in. Preston needs Rose’s help finding his long-lost love, Lorelei Traube, the alchemist responsible for inventing the crucible process. To find Lorelei Preston and Rose must travel the globe in an old airship piloted by the famous Vanderbilt Valkyrie, Reidun Falk. The crew stops in Berlin, Constantinople, and Königsberg looking for more clues.  Along the way, their paths cross with actual historical characters - Sir James Maxwell and Thomas Edison, as well as mythological creatures and characters.Preston and his dark passenger Azul work to solve the trail of puzzles left behind by Lorelei while Rose battles Prussian commandos, and an ancient order of wizards, all trying to get their hands-on Lorelei.When the truth comes out Rose’s collection of gadgets and supernatural powers may not be enough to deal with what the stone’s secret. It may require the ancient wisdom of Preston’s alter ego Azul to save humanity.Sit back and enjoy a supernatural thriller set in a believable, yet fantastic alternative steampunk history.“The Alchemists” is a steampunk book like no other.  JM Bannon has taken alternative history and mixed it with fantasy, then thrown in the plot twists of the best archeological and psychological thrillers. Think “Around the World in Eighty Days” meets “The Da Vinci Code”.This is book one in the Guild Chronicles Series.Get the book and learn what awaits the White Witch of London when she encounters the legendary Emerald Tablet.",
  "genres": [
    "Steampunk",
    "Fantasy"
  ],
  "author": "J.M. Bannon",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/36868368-the-alchemists"
}