{
  "title": "Standing In Two Circles: The Collected Works Of Boyd Rice",
  "description": "STANDING IN TWO CIRCLES is the first definitive and comprehensive compendium of the works of BOYD RICE, one of the most provocative and controversial underground figures of the post-punk era. A pioneering noise musician and countercultural maven, from the late 1970s to the present Rice has worked in an array of capacities, playing the roles of: musician, performer, artist, photographer, essayist, interviewer, editor, occult researcher, filmmaker, actor, orator, deejay, gallery curator and tiki bar designer, among others. First coming to prominence as an avant-garde audio experimentalist (recording under the moniker NON), Rice was a seminal founder of the first wave of industrial music in the late 1970s. In the 1980s, through collaborations with Re/Search Publications, Rice further established his position in underground with recountings of his uproarious pranks and the promotion of \"incredibly strange\" cult films and \"industrial\" culture. Rice's influence on subculture was further exerted through his vanguard exhibition of found photographs and readymade thrift store art, as well as his adamant endorsements of outsider music, tiki culture and bygone pop culture in general. Rice is also notorious for his public associations with nefarious figures both infamous and obscure, including friendships and ideological collusions with the likes of cult leader Charles Manson and Church Of Satan founder Anton LaVey, among others. His work continues to profoundly affect the countercultural underground at large, inspiring and enraging in equal measure. STANDING IN TWO CIRCLES contains: Essays 1986-2007 / Lyrics 1988-2007 / Art & Photography (38 plates) STANDING IN TWO CIRCLES also includes an extensive biography of Boyd Rice from the 1970s to the present, by the book's editor, Brian M Clark.",
  "genres": [
    "Music",
    "Nonfiction",
    "Art"
  ],
  "author": "Boyd Rice",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/3688051-standing-in-two-circles"
}