{
  "title": "Age of the Five Trilogy",
  "description": "Kapłanka w bieliKiedy Auraya została wybrana na kapłankę, nie wierzyła, że po zaledwie dziesięciu latach stanie się jedną z Białych, najpotężniejszych sług bogów. Niestety, miała niewiele czasu, by przyzwyczaić się do niezwykłej mocy, jaką bogowie jej ofiarowali. Krainę nękają nieznani czarownicy z południa odziani w czarne szaty, a do Białych docierają pogłoski o gromadzącej się armii. Auraya i pozostali Wybrani pracują niestrudzenie, by przypieczętować przymierza i zjednoczyć pod swoim sztandarem cały północny kontynent. Czas jednak ucieka. Wojna przybywa do krain Białych i jeśli Auraya nie nauczy się wykorzystywać swoich nowych umiejętności, nawet łaska bogów może nie wystarczyć, by uratować sprzymierzone krainy.Ostatnia z dzikichChoć była architektem zwycięstwa Białych, pierwsze spotkanie z wojną wypełniło sny Aurayi koszmarami. Spaceruje w nich po polach krwi, a polegli wstają, by rzucić jej w twarz oskarżenie: Ty nas zabiłaś. Ty. Wydaje się, że Auraya nie zazna spokoju, dopóki koszmary te nie odejdą, ale jedyny człowiek, któremu ufa i którego mogłaby prosić o pomoc, zniknął. Tkacz Snów Leiard, wciąż usiłując jakoś uporządkować coraz wyraźniejsze wspomnienia dawno zmarłego Mirara, ucieka w góry w towarzystwie Emerahl, być może ostaniej z Dzikich. Choć sama nie jest Tkaczem Snów, Emerahl dysponuje wielką mocą i pomaga Leiardowi w zrozumieniu tej niezwykłej plątaniny pamięci. To, co odkryją, zmieni jego życie na zawsze. A daleko na południu Pentadrianie liżą rany i próbują wybrać nowego przywódcę. Wydaje się, że pokój musi jeszcze zaczekać.Głos bogówAuraya, jako opiekunka Siyee, musi sprawdzić, kim jest obcy przybysz, który pojawił się w ich krainie. Spotyka tajemniczą kobietę, która twierdzi, że jest przyjaciółką Mirara, i składa kapłance pewną propozycję. Auraya nie potrafi odmówić, jednak musi to ukrywać albo narazić się na gniew bogów. Na południu Mirar cieszy się szacunkiem i akceptacją, odzyskując dawną pozycję wśród swego ludu, jednak ta wolność ma swoją cenę. Tymczasem Emerahl może wreszcie przyłączyć się do Myślicieli w poszukiwaniach Zwoju Bogów, prawda jednak może przybrać inną formę, niż tego oczekiwała. Pentadrianie, rozczarowani przegraną z Cyrklianami, knują i układają plany pokonania wrogów sposobami innymi niż bezpośrednia walka. Kiedy umiera nadzieja na pokój, a wojna między zwaśnionymi ludami wydaje się nieunikniona, Auraya wbrew swej woli zostaje wciągnięta w konflikt. Rozwiązanie może jednak kryć się wśród Dzikich, którzy wyruszają na poszukiwanie pogrzebanych dawno temu sekretów. Sekretów, które mogą zmienić świat...",
  "genres": [
    "Fantasy",
    "Fiction",
    "Romance",
    "Science Fiction Fantasy"
  ],
  "author": "Trudi Canavan",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/12223482-age-of-the-five-trilogy"
}