{
  "title": "Learning by Accident",
  "description": "On a sunny spring day, in an ordinary kitchen, Rosemary answers an unexpected phone call. A car has hit her husband, Hugh. Rosemary arrives at the hospital just in time to see him before he's rushed into surgery. Thinking of their twin daughters, Rosemary pleads with her unconscious husband as he lies on a gurney. \"Don't you leave me Hugh Rawlins. Anna and Mary need you. I love you.\" Overwhelmed, but determined to bring Hugh back home, Rosemary leans on family and friends as Hugh endures two emergency brain surgeries, a coma, and a confused awakening. When he finally opens his eyes, his vacant stare, the absence of his soul, hits her like a jab in the chest. She moves alongside his bed as he travels from the ICU to the medical surgical floor, and then to the acute brain rehab center, shepherding her two girls while trying to suppress the implosion of her own heart. Everything Rosemary learns about brain injury shocks her system anew. A large chunk of Hugh's skull has been removed and put on ice in the hospital freezer. Hugh, once an athletic business executive, needs to relearn the most basic activities like brushing his teeth and putting on his clothes in the right order. He has no short-term memory, and a myriad of symptoms she has never heard before: pocketing, left neglect, and loss of executive function. With his strong character, management salary, and athletic resilience, Hugh once supported the family in nearly every way. Rosemary's task of holding their lives together while helping him heal feels daunting enough, but she cannot counsel or lean on the one person she needs most-her husband. Through a series of episodes, from heart-rending to ridiculous, Rosemary and her teenage daughters play out their lives in a cyclone of uncertainty. Hugh is a different man, yet oddly the same stubborn husband she remembers. Rosemary tells a friend she's having an affair without cheating on her husband. Slowly, Hugh's athletic tenacity resurfaces as he achieves a remarkable recovery, but Rosemary unravels from constant stress, somehow sure that disaster lurks around every corner. Hugh is getting better. Why is Rosemary falling apart? Learning by Accident is a heartwarming story of family love and commitment, and the secondary trauma that remains with caregivers after all the hard work is done. Touching and triumphant, Learning by Accident celebrates how shedding fear and starting over can lead to peace, and in that place of peace, possibilities appear, and lives flourish.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Neuroscience"
  ],
  "author": "Rosemary Rawlins",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/12224097-learning-by-accident"
}