{
  "title": "Tribute",
  "description": "Virginia’s Shenandoah Valley, in the shadow of the Blue Ridge Mountains, is a long way from Hollywood. And that’s exactly how Cilla McGowan likes it.Cilla, a former child star, has found a more satisfying life working with her hands to restore homes from floor to ceiling – and has come here to her grandmother’s farmhouse, tools at her side, to rescue it from ruin. Sadly, no one had been able to save her grandmother, the legendary Janet Hardy. An actress with a golden voice and a tumultuous life, Janet entertained glamorous guests and engaged in decadent affairs – but died of an overdose in this very house more than thirty years ago. To this day, Janet haunts Cilla’s dreams. And during her waking hours, Cilla is haunted by her melodramatic, five-times-married mother, who carried on in the public spotlight and never gave her a chance at a normal childhood. By coming to the East Coast, rolling up her sleeves, and rehabbing this wreck of a house, Cilla intends to take a shot at finding some kind of normalcy for herself.Cilla has her work cut out for her – the house, once a place of comfort and simple rural beauty, is long neglected, crumbling, the grounds choked by weeds. Plunging into the project with gusto, she’s almost too busy and exhausted to notice her neighbor, graphic novelist Ford Sawyer – but his lanky form, green eyes, and easy, unflappable humor (not to mention his delightfully ugly dog, Spock) are hard to ignore. Determined not to carry on the family tradition of ill-fated romances, Cilla steels herself against Ford’s quirky charm, but she can’t help indulging in a little fantasy.But love and a peaceful life may not be in the cards for Cilla. In the house’s cluttered attic, she has found a cache of unsigned letters, tied with a faded red ribbon, suggesting that Janet Hardy was pregnant when she died – and that the father of her child was a local married man. Cilla can’t help but wonder what really happened all those years ago. The mystery only deepens with a series of cruel and intimidating acts and a frightening, violent assault. And if Cilla and Ford are unable to sort out who is targeting her and why, she may, like her world-famous grandmother, be cut down in the prime of her life.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Mystery",
    "Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Suspense"
  ],
  "author": "Nora Roberts",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/3686666-tribute"
}