{
  "title": "Effendi",
  "description": "Masterfully blending speculative fiction and hard-boiled mystery, Jon Courtenay Grimwood’s acclaimed Arabesk series plunges readers into a world eerily familiar and shockingly unpredictable. Here a troubled detective follows a trail of clues through a city where innocence itself may be a thing of the past. . . .It’s the twenty-first century and El Iskandryia—an alluring metropolis built on seduction, corruption, and lies—is the double-dealing heart of an Ottoman Empire that still rules the world. But these days a sense of dread hangs over El Isk—and over Ashraf Bey, the city’s new Chief of Detectives. A trial is set to take place, and it’s up to Raf to decide the case. There’s only one the suspect is the billionaire father of the woman Raf should have married.Industrialist Hamzah Effendi is accused of crimes so horrible that even El Iskandryia wants him eliminated. But Raf finds that protecting the sensual and impetuous Zara Quitrimala from the secrets of her father’s past may be even more dangerous. For Raf must now solve a series of brutal murders that are somehow connected to the case—and to Zara. And the closer Raf gets to the truth, the more elusive the answers become—and the closer he comes to his own demise.…Praise for the Arabesk series and  Effendi“ Raymond Chandler for the 21st century.” —Esquire“All brilliant light and scorching heat . . . Grimwood has successfully mingled fantasy with reality to make an unusual, believable, and absorbing mystery.\" — Sunday Telegraph (London)“If you’re not reading Jon Courtenay Grimwood, then you don’t know how subtle and daring fiction can be.” —Michael Marshall Smith, author of Spares and One of Us“Fast, furious, fun and elegant, the Arabesk trilogy is one of the best things to hit the bookstores in a while.” — SFRevu",
  "genres": [
    "Science Fiction",
    "Alternate History",
    "Fiction",
    "Fantasy",
    "Mystery",
    "Cyberpunk",
    "Crime"
  ],
  "author": "Jon Courtenay Grimwood",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/368858.Effendi"
}