{
  "title": "Been So Long: My Life and Music",
  "description": "\"A modern parable.\" ―from the foreword by Grace Slick“Jorma Kaukonen is a force in American music, equally adept at fingerpicked acoustic folk and blues as he is at wailing on an electric.” – Acoustic Guitar“Jorma Kaukonen lit a fuse and transformed his electric guitar into a firework.” – Live For Live MusicIncludes a CD of live music as a companion to the book!From the man who made a name for himself as a founding member and lead guitarist of Jefferson Airplane comes a memoir that offers a rare glimpse into the heart and soul of a musical genius―and a vivid journey through the psychedelic era in America.“Music is the reward for being alive,” writes Jorma Kaukonen in this candid and emotional account of his life and work. “It stirs memory in a singular way that is unmatched.” In a career that has already spanned a half century―one that has earned him induction into the Rock & Roll Hall of Fame and a Grammy Lifetime Achievement Award, among other honors―Jorma is best known for his legendary bands Jefferson Airplane and the still-touring Hot Tuna. But before he won worldwide recognition he was just a young man with a passion and a dream.Been So Long is the story of how Jorma found his place in the world of music and beyond. The grandson of Finnish and Russian-Jewish immigrants whose formative years were spent abroad with his American-born diplomat father, Jorma channeled his life experiences―from his coming-of-age in Pakistan and the Philippines to his early gigs with Jack Casady in D.C. to his jam sessions in San Francisco with Jerry Garcia, Janis Joplin, Bob Dylan, and other contemporaries―into his art in unique and revelatory ways. Been So Long charts not only Jorma’s association with the bands that made him famous but goes into never-before-told details about his addiction and recovery, his troubled first marriage and still-thriving second, and more. Interspersed with diary entries, personal correspondence, and song lyrics, this memoir is as unforgettable and inspiring as Jorma’s music itself.",
  "genres": [
    "Music",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Biography Memoir",
    "Rock N Roll"
  ],
  "author": "Jorma Kaukonen",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/36900363-been-so-long"
}