{
  "title": "Sherlock Holmes and the Vampire Invasion",
  "description": "A Vampire Army of Vengeance  “No blood, no teeth, and now no scullery maid. What else shall go missing? I hope we may all leave this house with our limbs.” – Mycroft Holmes  To kill for the sake of killing—to target those unknown to oneself—is the most demonic act of all. Is it a Satanic cult or a witches’ coven behind the murders? Or is the legend of “Varney the Vampire” true? Are these killings an act of greed or vengeance? Or both?  Mycroft’s exclusive Diogenes Club is targeted, with its members being found drained of all blood, their necks punctured with wolf-like teeth marks.  The vampire murderer is combing the workhouses for the most desperate and misplaced, forming a vampire army in Victorian London. Wiggins is on the case. Would a murderer who kills indiscriminately stop at children? Sherlock is aghast to learn that Mirabella has disappeared, secretly checking into a workhouse in an effort to find the vampire murderer—and the reason for these killings.  It’s the dawn of medicine when knowledge of human anatomy is almost non-existent, without which understanding there can be no surgery, no blood transfusions, and no advancement. Dead bodies are in high demand to further the needs of science. If a body were helped along to its final resting place and thereafter removed from the coffin, who was going to be the wiser?  Victorian romantic mystery featuring Sherlock Holmes, his wicked wit and cutting tongue, along with Mycroft Holmes, Dr. James Watson, Wiggins, and their female operative Mirabella Hudson.  The Great Detective In Love series on AUDIBLE. FINALIST Chanticleer Mystery & Mayhem awards, Goethe Awards for Historical Fiction, International Book Awards, Readers’ Choice Awards.",
  "genres": [
    "Historical Mystery",
    "Mystery"
  ],
  "author": "Suzette Hollingsworth",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/36901708-sherlock-holmes-and-the-vampire-invasion"
}