{
  "title": "Alien Alphas",
  "description": "Fierce Warriors...Savage Barbarians...Powerful Warlords...All Ready To Claim Their Mates!\n\n\nAlien Alphas is a collection of panty-melting sci-fi romances featuring dominant alien heroes, penned by New York Times, USA Today, and international bestselling authors. This decadently naughty box set includes twenty-three stand-alone novellas, full of hot alien alpha males, breathless passion, and reluctant surrender. Take an exhilarating trip beyond the stars, that’s sure to leave you turning the pages late into the night.\n\nFeatured authors:\n\nSue Lyndon - Promised To The Alien\n\nTarrz is the biggest, sexiest, and sternest Tar-quan male Lana has ever met - and he happens to be the very stranger to whom she’s been betrothed!\nHe leaned down, until his face was level with hers. “I suggest you keep your opinion on the Earth-Tar-qua trade agreement to yourself, little human, unless you want to endure the strap on your wedding night. If I heard my mate speaking as you just did, I would punish her severely for disrespect. If not for the Tar-quans’ assistance, your dome cities on Earth would have perished long ago.”Taken aback by his great size, she studied him for a moment. God, he was huge and muscular - intimidatingly so. Having glimpsed plenty of Tar-quans before, when they came to visit her dome city, she had not expected to see an alien this large here in the city, and she felt a stab of pity for whichever human woman found herself mated to this male. He was easily more than too heads taller than her, and aside from his size, this particular Tar-quan seemed overly stern.An involuntary tingle raced across her bottom at the thought of enduring a punishment from the no-nonsense male who was glaring down at her. Despite her fear, her face heated and a sudden ache throbbed between her thighs. She quickly lowered her head, hoping he did not notice her blushing.\nSara Fields - Sold To The Enemy\nCaptured by enemy forces, Commander Aubrie Kent is imprisoned, sold at auction, and purchased as a slave by the leader of the very planet she was sent to attack. He vows to break her and claim her as his own, but can he command her heart? Will she let him?\nRenee Rose - Their Zandian Mate (Zandian Masters #9)/(Zandian Brides #1)\nThree Zandian warriors..One female assigned for reconditioning...They'll punish...Demand...Claim...Teach...\nCari Silverwood - Fated Possession (The Machinery Of Desire #3.5)\n\n\nWhile on a chaste pilgrimage to the Chasm, Sassik buys Blue to save her from violation!\n\nYes, he will train the stubborn human and punish her when needed, but when Blue willingly opens her legs for him, he understands the depths of his twisted desires.\n\nSelling her can be his only option...\n\nThe gritty, violent world of Aerthe will crush the life and spirit of anyone not able to fight for their existence with weapons, teeth, and claws.\n\nBut Blue is from Earth!\n\nHaving recently escaped from being kept as a blood-slave, being owned is way down at the bottom of Blue’s bucket list. If she can’t escape, maybe she’ll do the next-best thing and take down Sassik while trying.\nThis is a dark romance with rough sexual scenes and kink. \nThis book can also be found as a bonus story in Branded Possession, Book 3 in The Machinery of Desire series, and is a spin-off story based in the same world of Aerthe.\n\nGrace Goodwin - Claiming His Virgin (Interstellar Brides: The Virgins #0.5)\nElite Hunter Zee is scarred from his time in the Hive war leaving him too much of a monster to seduce a beautiful, innocent virgin. Even if his Mark calls to hers, connecting them body and soul, he knows that after just one look at him and she will never surrender the three sacred virginities. Never accept him as a mate...Blindfolded and seduced, Helen has never seen the Hunter whose voice makes her tremble. She knows something isn't right, but she can't say no to the mysterious and demanding Hunter whose kiss makes her burn - and whose touch makes her beg in the darkness of night...Zee has everything he thinks he needs, until another takes advantage of his new mate's innocence... and tries to claim Zee's Interstellar Bride for his own!\nCynthia Sax - Dark Warlord (Refuge #2.5)\n\n\nBattling the Barbarian...\n\nAll Chamele Warlords have a destined mate, a gerel they are fated to spend their lifespans with. Batu, being genetically enhanced, believes he's the sole exception. He devotes himself to battle, is resigned to living a solitary life, dying with swords in both of his hands...\n\nThen he sees her!\n\nGenine is a warrior female intent on protecting her loved ones. To keep them safe, she must face Fighter Batu in the ring. If she loses to the barbarian, she becomes his to do with as he wishes. And he wishes her to submit to his deep voice, rough touch, passionate kisses. If she defeats Batu, she will have to kill the one male she was destined to love!\nDark Warlord is a short companion story in the Refuge series and is meant to be read after Dark Flight. It is a SciFi Romance set in a gritty, dark world. This story was previously part of a box set.\n\nLee Savino & Lili Zander - Draekon Rescue (Dragons In Exile #5.6)\nDorothy Pitts is having the Worst. Day. Ever. Her boss is creepy, her customers are jerks and she was passed over for a badly needed scholarship. But nothing beats getting sucked up into an alien spaceship, transported across the galaxy and waking up as a lab rat in an illegal breeding program. It's up to 2 hunkie dragon shifters to save the day...\nAddison Cain - Strangeways\nTheir invasion of our world was nonviolent, seamless. But they have come to conquer and take who they will. We don’t have a choice. They can make us like it. They can make us desire them. They can make us do anything they want!\nKallista Dane - Her Savage Mate\n\n\nCrash landed on an alien world...\n\n\n\nLost in a jungle...\n\n\n\nCaptured by a savage!\n\n\n\nNow I have a choice!\n\n\n\nMate with their prince - or die!It’s been a rough day!\n\nExcept I don’t have a choice. Not really. The High Priest threatens to put my entire crew to death unless I agree. So I make him a deal. I’ll mate with the future king and give him an heir - in exchange for their freedom...Turns out my new mate is a mouth-watering, seven foot tall bronze hunk. He’s so hot he could be the star of one of the tacky romance novels I’m secretly addicted to!Unfortunately this planet requires females to obey their mates or be disciplined. I’m not the submissive type, so I get punished by my new mate. A lot! But I’m determined this alien alpha will never break me. Night after night, I defy him!As time goes on, his stern discipline and passionate lovemaking are awakening dark desires in me. Wicked desires I’ve never felt before...\n\nI don’t know how much longer I can hold out!\n\n\nMaren Smith - Her Consort\nShe was a salvage operator, patrolling the depths of deep space. He was a professional consort to royalty, built like a Neanderthal. Twice her width and twice her weight. His six-pack abs had six-pack abs. She knew, because she’d seen them. The only two people on a ship the size of a city… it really was kind of too bad they didn’t get along....\nAva Sinclair - Vanquished Mate\nAs an investigative journalist, I intended to expose the Ythilian mating ritual. I never intended to end up captured by a dominant warrior determined to make me his!My plan was to disguise myself as a Ythilian female, sneak into the field, and document the rush of warriors taking to the mating grounds to capture and claim their mates. I play the role well. Too well, in fact. When the warrior chieftain, Khon, mistakes me for a native Ythilian, he captures me!Now, Khon has declared me his mate for life, and nothing I say can dissuade him. On this planet, the warriors rule over and thoroughly spank disobedient female mates. This culture represents everything I oppose! And yet, I find myself shamefully responding both to the humiliating correction and unexpected pleasure of being taken again and again by this strong, primal male...My own government, fearing a political incident, refuses to save me. They say I must live with my mistake. But how can I? When it means completely submitting to a fearsome warrior whose threatens to vanquish me, body and soul!\nEmily Tilton - The Warrior’s Pleasure-Girl\nThe He’Ban long ago gave up bodily reproduction between their very-differently-evolved sexes. But, He’Ban warriors have a weakness for the human girls who seem designed by DNA to excite their lust! Can human Tera find love with the captain of the deadliest ship in the He’Ban fleet before another, crueler He’Ban warrior claims her as his prize?\nAshe Barker - The Enforcer\n\n\nHe is hers!\n\n\n\nHer prisoner, her responsibility!\n\nConvicted felon Xyker Ramone is not absconding, not on her watch! Erin Stein pursues her quarry with single-minded intent, but Xyker has no intention of returning to the penal colony. Erin is stunned to find herself his captive and law enforcement takes on a whole new dimension!\nKorey Mae Johnson - Conquering Kayla\nAs the twelfth child of a royal household, Kayla is used to being overlooked, but that changes when her planet is conquered by aliens. Claimed by two stern, handsome brothers, she is soon getting plenty of attention, as she is shared, enjoyed, and thoroughly mastered by her new mates!\nIvy Barrett - Becoming A Private Pet\nKidnapped from Earth, Kate Deacon is now the property of Exotic Pets, Inc. Jexton Farr’s job is to train the beautiful little human, rewarding her when she is obedient and punishing her sternly when she is not! But when the time comes for her to be sold, will he be able to give her up?\nJane Henry - Finding Sitra\nWhen Sargothian native Cy Brak returns to his home planet seeking solace in a brothel, he is furious to find himself paired with his best friend’s sister! She begs to be tied up and dominated, but her fantasies may not align with the punishment he has in mind. A surprise alien attack - leaving them alone and stranded - ups the stakes!\nJaye Peaches - Under Contract\nBrax’s contract is simple! Find, extract, and rehabilitate an absconded human female!Kleo’s attempt at escaping an arranged mating has failed and she is now under the firm control of Brax, an enhanced alien from Helle, who must return her home to await her fate. But will Brax stick to the contract?\nKatie Douglas - Her Biker From Mars\nHot Martian biker, Sy, just wants a snow cone. Instead, he has twenty-four hours to save a slave girl in a life-or-death situation, and the trade-off, is that Sy has to assassinate the president of Earth. Can he do it?\nLoki Renard - Doubly Dominant\nTrissa Teovy is a college dropout hitching her way across the galaxy when she’s caught by a seven-foot-tall Kilvoy lawman named Kero. He sets out to teach her a lesson that’s long overdue, but taming Trissa won’t be easy. The feisty little human is too much for any one man to handle, but fortunately for Kero, there’s two of him!\nMaria Monroe - His Human Bride\nIn a war-torn galaxy, arrogant Prince Zor Maxis’ marriage to a princess from Ostara will create an essential alliance between the two planets. But what happens when he chooses the only human around?\nMegan Michaels - Dravven’s Submissive\nShe committed a crime. She has a six-month sentence - marry the Prince and become a submissive on the Dominant, alpha male ruled planet. Seems simple. But is it?\nMyra Danvers - Swallowed Darkness\n\n\nImprisoned...\n\n\n\nStarved...\n\n\n\nWeak...\n\nHe’s a warrior caged in the armpit of the universe, a man of worth who owns nothing but his pride and a thirst for vengeance. So why had they sent her? A human. A pathetic, fragile creature full of madness and lies, burdened with an impossible ultimatum - contend with a monster, or die!\nSophie Kisker - The Ghost In The Stars\n\n\nSiridin is on the run, after killing his brother’s murderer!\n\n\nKeelie was kidnapped to satisfy an addiction Anterins have for human women!\n\nEach sees the other as the source of their troubles! And the dominant ship captain refuses to believe the nectar slave’s stories of whispers in the night...Publisher’s Note: The stories featured in this collection involve MF and MFM pairings. They include spankings and sexual scenes. If such material offends you, please don’t buy this box set.",
  "genres": [],
  "author": "Cari Silverwood",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/36899732-alien-alphas"
}