{
  "title": "My Home is Far Away",
  "description": "My Home is Far Away is the most precisely autobiographical of Powell’s fifteen novels. In this family chronicle set in early twentieth century Ohio, young Marcia Willard’ s family struggles to keep up with the rapidly changing times, and Marcia endures disillusionment, cruelty, and betrayal to forge a survivor’s sense of independence. John Updike has compared Powell with Theodore Dreiser, Willa Cather, Sherwood Anderson, “and those other Midwestern writers who felt something epic in the national shift from rural to urban, from provincial sequestration to metropolitan liberation.” By 1941, when Powell set to work on My Home Is Far Away, she was better known for the smart, boozy, bawdy, hilarious send-ups of Manhattan high and low life. She had begun to attain a reputation for high sophistication and nothing could be less “sophisticated” – in the glittering, all-knowing, furiously present-tense, big-city manner Powell had perfected – than My Home Is Far Away .This was the month of cherries and peaches, of green apples beyond the grape arbor, of little dandelion ghosts in the grass, of sour grass and four-leaf clovers, of still dry heat holding the smell of nasturtiums and dying lilacs. This was the best month of all and the best day. It was not birthday, Easter, Christmas, or picnic, but all these things and something else, something wonderful, something utterly unknown. The two little girls in embroidered white Sunday dresses knew no way to express their secret joy but by whirling each other dizzily over the lawn crying, “We’re moving, we’re moving! We’re moving to London Junction!”My Home Is Far Away is one of the very few examples of a book written for adults, with an adult command of the language, that maintains the vantage point of a hungry, serious child throughout. It might be likened to a memoir that has been penned not with the usual tranquility of distance but rather with the sense that everything happening to the characters is happening right now, without any promise of eventual escape, without any assurance that childhood, too, shall pass away.My Home is Far Away had been out of print for sixty years when Steerforth reissued it in 1995. It received immediate widespread acclaim, and was featured on the cover of the New York Times Book Review .",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Classics",
    "Novels",
    "The United States Of America",
    "American",
    "Literature"
  ],
  "author": "Dawn Powell",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/369037.My_Home_is_Far_Away"
}