{
  "title": "Lust on Trial: Censorship and the Rise of American Obscenity in the Age of Anthony Comstock",
  "description": "Anthony Comstock was America’s first professional censor. From 1873 to 1915, as Secretary of the New York Society for the Suppression of Vice, Comstock led a spirited crusade against lasciviousness, salaciousness, and obscenity that resulted in the confiscation and incineration of more than three million pictures, postcards, and books he personally judged to be obscene. But as Amy Werbel shows in this rich cultural and social history, Comstock’s campaign to rid America of vice in fact led to greater acceptance of the materials he deemed objectionable, offering a cautionary tale about the unintended consequences of censorship.In Lust on Trial, Werbel provides a detailed and colorful journey through Comstock’s career that doubles as a new history of post-Civil War America’s risqué visual and sexual culture. Born into a puritanical New England community, Anthony Comstock moved to New York in 1868 armed with his Christian faith and a burning desire to rid the city of vice. Werbel describes how Comstock’s raids shaped New York City and American culture through his obsession with the prevention of lust by means of censorship, and how his restrictions provided an impetus for the increased circulation and explicitness of “obscene” materials. By opposing women who preached sexual liberation and empowerment, suppressing contraceptives, and restricting artistic expression, Comstock drew the ire of civil liberties advocates, inspiring more open attitudes toward sexual and creative freedom and more sophisticated legal defenses. Drawing on material culture high and low, courtroom transcripts, and numerous examples of the “obscenities” Comstock seized, Lust on Trial provides fresh insights into Comstock’s actions and motivations, the sexual habits of Americans during his era, and the complicated relationship between law and cultural change.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography",
    "Sexuality",
    "Politics",
    "Pornography"
  ],
  "author": "Amy Werbel",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/36906212-lust-on-trial"
}