{
  "title": "An Environmental History of Northeast Florida",
  "description": "\"Without a doubt a significant contribution to an overall understanding of northeast Florida. . . . Reveals much about land use in the state of Florida and the larger southeast U.S. . . . Frees the reader to consider the human impact [in environmental history] and our relationship to the land. This book makes you think.\"--Robert L. Thunen, University of North Florida Early European descriptions of North America tell about a landscape and a variety of cultures in northeast Florida--a region that had been occupied by native people for more than 10,000 years--that were unlike anything the explorers and settlers had ever encountered. This story of the land and people in that region of the St. Johns River and the Atlantic coast covers 18,000 years--from the Ice Age to the first half of the 20th century. James Miller describes how natural features transformed and how cultural traditions of native people, as well as Spanish, English, and American colonists, developed in response to opportunities and constraints of the environment. With an unusually broad scope in time, space, and subject matter, he uses the example of northeast Florida to explore the notion of environmental equilibrium, to illustrate the fallacy of a pristine environment, and to show how essential environmental history is to modern ecological planning. Fully illustrated with 25 photographs and 40 maps and written in an accessible style that synthesizes material usually accessible only to specialists, the book will appeal to general readers and policy planners as well as experts. No comparable environmental history of any Florida region exists.  James J. Miller, state archaeologist of Florida and chief of the Bureau of Archaeological Research, is the coauthor of An Atlas of Maritime Florida and has published widely in the fields of cultural resource management and Florida archaeology.",
  "genres": [
    "History",
    "Science",
    "Nature"
  ],
  "author": "James J. Miller",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/3693183-an-environmental-history-of-northeast-florida"
}