{
  "title": "The Rise and Decline of Nations: Economic Growth, Stagflation, and Social Rigidities",
  "description": "“A convincing book that could make a big difference in the way we think about modern economic problems.”—Peter Passell, New York Times Book Review “Clearly, this is no ordinary theory. Equally clearly, it sprang from the mind of no ordinary economist.”—James Lardner, Washington Post The years since World War II have seen rapid shifts in the relative positions of different countries and regions. Leading political economist Mancur Olson offers a new and compelling theory to explain these shifts in fortune and then tests his theory against evidence from many periods of history and many parts of the world. “Schumpeter and Keynes would have hailed the insights Olson gives into the sicknesses of the modern mixed economy.”—Paul A. Samuelson, Massachusetts Institute of Technology “One of the really important books in social science of the past half-century.”—Scott Gordon, Canadian Journal of Economics “The thesis of this brilliant book is that the longer a society enjoys political stability, the more likely it is to develop powerful special-interest lobbies that in turn make it less efficient economically.”—Charles Peters, Washington Monthly “Remarkable. The fundamental ideas are simple, yet they provide insight into a wide array of social and historical issues. . . . The Rise and Decline of Nations promises to be a subject of productive interdisciplinary argument for years to come.”—Robert O. Keohane, Journal of Economic Literature “I urgently recommend it to all economists and to a great many non-economists.”—Gordon Tullock, Public Choice “Olson’s theory is illuminating and there is no doubt that The Rise and Decline of Nations will exert much influence on ideas and politics for many decades to come.”—Pierre Lemieux, Reason Co-winner of the 1983 American Political Science Association’s Gladys M. Kammerer Award for the best book on U.S. national policy",
  "genres": [
    "Economics",
    "Politics",
    "History",
    "Nonfiction",
    "Political Science",
    "Sociology",
    "Business"
  ],
  "author": "Mancur Olson",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/369410.The_Rise_and_Decline_of_Nations"
}