{
  "title": "Gib jedem seinen eigenen Tod",
  "description": "Ein unverbrauchter, hochinteressanter Schauplatz des Geschehens, ein spannender Plot mit aktuellem Bezug, Figuren, die ein Eigenleben führen und nicht glatt und perfekt daherkommen. Das sind die viel versprechenden Zutaten, aus denen Veit Heinichen seinen ersten Kriminalroman gewoben hat. Beste Voraussetzungen allein garantieren aber noch kein gutes Gelingen und mancher Debütant hat dennoch nichts Genießbares zustande gebracht. Heinichen und seinem sympathischen Commissario Proteo Laurenti allerdings ist mit einem intelligenten Krimi um organisiertes Verbrechen in Triest ein feiner und sehr beachtenswerter Start gelungen. Die Yacht des ortsansässigen Geschäftsmannes Bruno de Kopfersberg ist offenbar unbemannt und mit eingeschaltetem Autopilot gestrandet. Von de Kopfersberg fehlt jede Spur. Proteo Laurenti erinnert sich an einen seiner ersten Fälle, als er nach seiner Versetzung aus Süditalien nach Triest das Verschwinden von Elisa, der Frau des Geschäftsmannes, zu untersuchen hatte. Er war gescheitert, obwohl er de Kopfersberg in Verdacht hatte, seine Frau beseitigt zu haben. Laurenti und seine Mitarbeiter ermitteln in der Villa des Verschwundenen und stoßen auf eine äußerst freizügige und wenig mitteilsame Lebensgefährtin de Kopfersbergs. Zu trauern scheint Tatjana Drakic jedenfalls nicht, ebensowenig Spartaco, der Sohn. Das Ergebnis der schwierigen Nachforschungen ist alarmierend: in der Villa de Kopfersbergs soll offensichtlich ein strategisches Treffen einer mafiösen Organisation stattfinden. Die Themen: kriminelle Nutzung der Erdbebenhilfe für die Türkei und der organisierte Frauenhandel. Einheiten von Carabinieri, Guardia di Finanza, Guardia Costiera und Laurentis Polizia Statale sollen zugreifen. Zu allem Überfluss hängt bei Laurenti auch noch der Haussegen schief. Seine Tochter Livia möchte bei einer Miss-Wahl teilnehmen und Laurenti befürchtet, zum Gespött der ganzen Stadt zu werden. Veit Heinichen ist ein spannender, humorvoller und überaus unterhaltsamer Krimi gelungen. Ganz nebenbei erfährt der Leser einiges über Triest und eine Region am Schnittpunkt unterschiedlicher Kulturen. Der Autor hat Lust auf mehr geweckt und man darf hoffen. Schließlich konnte ein wichtiger Drahtzieher des aktuellen Falls entkommen. --Ulrich Deurer",
  "genres": [
    "Crime",
    "Mystery",
    "Fiction",
    "Germany",
    "Italy",
    "Novels"
  ],
  "author": "Veit Heinichen",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/3696547-gib-jedem-seinen-eigenen-tod"
}