{
  "title": "The One Memory of Flora Banks",
  "description": "It's not a lie if you can't remember the truth.\"Mesmerizing, electric, and achingly lovely, The One Memory of Flora Banks is unforgettable. One of the best YA novels I've read in a very long time.\" --Jennifer Niven, New York Times bestselling author of All the Bright PlacesSeventeen-year-old Flora Banks has no short-term memory. Her mind resets itself several times a day, and has since the age of ten, when the tumor that was removed from Flora's brain took with it her ability to make new memories. That is, until she kisses Drake, her best friend's boyfriend, the night before he leaves town. Miraculously, this one memory breaks through Flora's fractured mind, and sticks. Flora is convinced that Drake is responsible for restoring her memory and making her whole again. So, when an encouraging email from Drake suggests she meet him on the other side of the world--in Svalbard, Norway--Flora knows with certainty that this is the first step toward reclaiming her life.But will following Drake be the key to unlocking Flora's memory? Or will the journey reveal that nothing is quite as it seems?Already a bestselling debut in the UK, this unforgettable novel is Memento meets We Were Liars and will have you racing through the pages to unravel the truth.Praise for The One Memory of Flora Banks An EW Most Anticipated YA Novel of 2017★ [A] remarkable odyssey...an enthralling story...a deftly, compassionately written mystery.\" --Booklist, starred review★ Barr's tale mingles Oliver Sacks-like scientific curiosity with Arctic adventure and YA novel in a way that's equally unsettling, winsome, and terrifying. --Horn Book, starred reviewPerfect for fans of both young adult romance and psychological thrillers, The One Memory of Flora Banks is destined to become one of your favorite beach reads of 2017. Promise. --Bustle Mesmerizing, electric, and achingly lovely, The One Memory of Flora Banks is unforgettable. One of the best YA novels I've read in a very long time. --Jennifer Niven, New York Times bestselling author of \nAll the Bright Places\nUltimately, this title will leave readers with a sense of hope and faith in the human spirit....A strong choice for YA shelves. --School Library JournalFlora's situation may be singular, but her desire for autonomy should speak loudly to teens in the midst of their own journeys into adulthood. --Publishers WeeklyAn affecting portrayal of living with amnesia and discovering one's own agency. --Kirkus[T]his is [Barr's] first YA novel and it is a good one. It will not be forgotten by readers. --VOYAAn extraordinarily moving and original novel, a story of secrecy and lie, love and loss that manages to be both heart-breaking and life-affirming...Barr's first novel for teenagers...is as brave as Flora herself. --Daily MailAn icily atmospheric story...captivating...[a] pacy page-turner that packs a significant emotional punch. --The Guardian",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Romance",
    "Mystery",
    "Mental Health",
    "Realistic Fiction"
  ],
  "author": "Emily Barr",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/36950065-the-one-memory-of-flora-banks"
}