{
  "title": "Osage Women and Empire: Gender and Power",
  "description": "The Osage empire, as most histories claim, was built by Osage men’s prowess at hunting and war. But, as Tai S. Edwards observes in Osage Women and Empire , Osage cosmology defined men and women as necessary pairs; in their society, hunting and war, like everything else, involved both men and women. Only by studying the gender roles of both can we hope to understand the rise and fall of the Osage empire. In Osage Women and Empire , Edwards brings gender construction to the fore in the context of Osage history through the nineteenth century.Edwards’s examination of the Osage gender construction reveals that the rise of their empire did not result in an elevation of men’s status and a corresponding reduction in women’s. Consulting a wealth of sources, both Osage and otherwise—ethnographies, government documents, missionary records, traveler narratives—Edwards considers how the first century and a half of colonization affected Osage gender construction. She shows how women and men built the Osage empire together. Once confronted with US settler colonialism, Osage men and women increasingly focused on hunting and trade to protect their culture, and their traditional social structures—including their system of gender complementarity—endured. Gender in fact functioned to maintain societal order and served as a central site for experiencing, adapting to, and resisting the monumental change brought on by colonization.Through the lens of gender, and by drawing on the insights of archaeology, ethnography, linguistics, and oral history, Osage Women and Empire presents a new, more nuanced picture of the critical role of men and women in the period when the Osage rose to power in the western Mississippi Valley and when that power later declined on their Kansas reservation.",
  "genres": [
    "History"
  ],
  "author": "Tai Edwards",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/36950843-osage-women-and-empire"
}