{
  "title": "Searching",
  "description": "There is no surrendering your will without giving up your heart.\nLong before she took up the title of Starry Knight, Raiya Cole knew she was different. Ever since she survived the car crash that killed her parents, the truth about her supernatural powers—and her destiny as a fallen Star—shaped her life, preparing her for a battle she knew would come one day. With the help of Grandpa Odd, her beloved mentor, Raiya works to maintain control over her power and train as a Starlight Warrior.But the battle she prepared for is not the first one she must face.As her seventh grade year begins, Raiya’s resolve is put to the test when her power unexpectedly—and exponentially—grows, threatening the fragile life she has managed to build over the last six years. Can Raiya embrace a duty that demands not only her life, but her heart as well? Can she survive paying the price that comes with her power?Searching is the prequel to The Starlight Chronicles, an epic fantasy adventure series from C. S. Johnson.\n\nFROM THE BOOK: \n\n\n\nI was very young when I first learned the power of a broken heart.\n\nFortunately, or maybe unfortunately, it was not my own heart that taught me this truth. My heart, after all, was already broken.\n\nAnd that’s why I’m here, I thought wryly, glancing up from the all- too-familiar patient room floor at Apollo City Hospital.\n\nBetween the tarnished sense of sterility, its ash-colored tiles, and the dulled-white walls, I almost felt at home. In the last six years, I’d come here at least once every couple of months. Between all my visits, I had counted the cabinets along the wall countless times, even if I always forgot how many there actually were in the end.\n\nThat wasn’t the only thing I’d forgotten, either. I frowned at the sudden, overwhelming scent of iodine.\n\nHow long have I been sitting here, to have forgotten that?\n\nI hated that smell. It wasn’t just unpleasant in itself; it also brought up a wide array of unpleasant memories.\n\n“What is it, Raiya?”\n\nDespite my discomfort, a small, reassuring smile was already on my lips as I looked over at my grandfather. Through the loose tresses of my coppery hair, I saw him watching me with a concerned look on his face.\n\nMy grandpa was a thin man, with a bushy, white beard and kind, ageless eyes. Every day since I’d finished elementary school, it seemed as though he was getting shorter as I was getting taller. As I gazed at him, taking in his plain clothes and his oversized coat, I thought how easy it would be for the average person to dismiss him, to see him as harmless and old, barely indistinguishable from any man walking in the street.\n\nGrandpa would never be that to me. No—to me, he was my hero.\n\n\n\n\nFROM THE AUTHOR: \n\nWelcome to the Starlight Chronicles, an epic fantasy adventure about fallen stars! This is the prequel, Searching, featuing Starry Knight and her with her powers as she enters seventh grade. \n\n\nWHAT REVIEWERS ARE SAYING: \nIt was nice the read through the mind of the other protagonist. It was great to actually read more than snippets of her life. ~ Natasha, Goodreads ReviewerWow. Utterly fantastic. ~ Jackie, Goodreads Reviewer",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult"
  ],
  "author": "C.S.  Johnson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/36949926-searching"
}