{
  "title": "The Five Rules for Successful Stock Investing: Morningstar's Guide to Building Wealth and Winning in the Market",
  "description": "The Five Rules for Successful Stock Investing\"By resisting both the popular tendency to use gimmicks that oversimplify securities analysis and the academic tendency to use jargon that obfuscates common sense, Pat Dorsey has written a substantial and useful book. His methodology is sound, his examples clear, and his approach timeless.\"--Christopher C. Davis Portfolio Manager and Chairman, Davis AdvisorsOver the years, people from around the world have turned to Morningstar for strong, independent, and reliable advice. The Five Rules for Successful Stock Investing provides the kind of savvy financial guidance only a company like Morningstar could offer. Based on the philosophy that \"investing should be fun, but not a game,\" this comprehensive guide will put even the most cautious investors back on the right track by helping them pick the right stocks, find great companies, and understand the driving forces behind different industries--without paying too much for their investments.Written by Morningstar's Director of Stock Analysis, Pat Dorsey, The Five Rules for Successful Stock Investing includes unparalleled stock research and investment strategies covering a wide range of stock-related topics. Investors will profit from such tips as:* How to dig into a financial statement and find hidden gold . . . and deception* How to find great companies that will create shareholder wealth* How to analyze every corner of the market, from banks to health careInformative and highly accessible, The Five Rules for Successful Stock Investing should be required reading for anyone looking for the right investment opportunities in today's ever-changing market.",
  "genres": [
    "Finance",
    "Business",
    "Nonfiction",
    "Money",
    "Economics",
    "Personal Finance",
    "Collections"
  ],
  "author": "Pat Dorsey",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/369751.The_Five_Rules_for_Successful_Stock_Investing"
}