{
  "title": "The Children of Ra: Artistic, Historical, and Genetic Evidence for Ancient White Egypt",
  "description": "Second Edition includes 2017 DNA report which conclusively proved that the original Egyptians were white-and that the present-day Egyptian population is of mixed racial origins. A comprehensive overview of the long-debated question of what race were the Ancient Egyptians-finally answered through a thorough study of the historical record, Egyptian art, images of mummies, and new dramatic DNA evidence. Ra was the sun god of ancient Egypt, and part of the religion of that culture was a belief that the pharaohs were descended from him. The sun god was depicted with an eagle's head and a human body, with the sun sitting on its head-thus the association of red and blond hair with royalty among the ancient Egyptians. Lavishly illustrated with over 106 full color pictures, DNA evidence and a complete historical overview, this book proves that white people created the initial Egyptian civilization-and that ancient Egypt culture came to an end once those people had been bred out of existence. Contains the dramatic DNA evidence which shows that Tutankhamun was of the same racial stock as present-day western Europeans, and the astonishing results of the largest-ever DNA testing of Egyptian mummies by scientists at the University of Tuebingen-which revealed that the Ancient Egyptians were closely related to present-day Europeans. A vital work for all those fascinated by Ancient Egypt and the origins of that civilization. Also contains a detailed Egyptian history timeline to explain how this white-founded society was overrun, and how this process led to the extinction of this greatest of the ancient civilisations-a somber warning to today's West.",
  "genres": [
    "History",
    "Nonfiction",
    "Anthropology",
    "Ancient History"
  ],
  "author": "Arthur Kemp",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/36953655-the-children-of-ra"
}