{
  "title": "Reiki Hold my beer, I've got this!",
  "description": "Warning!This book is 100% Reiki, stripped back and unplugged from mainstream preconceived and conditioned ideas of what it is, and how it’s supposed to be taught and used!It was written for those bold and courageous spirits who are trying to get to the bottom of all things. If you expect to hear the same old clichéd story that has been done to death about Reiki, you’ll most certainly be disappointed. But if you want to explore the true depths of Reiki, gaining a broader understanding on how it can be taught in a contemporary way that is relevant to the needs of the 21st century, you’ve come to the right place.“Reiki Hold my beer, I’ve got this!” shares 51 authentically written chapters presenting a closer insight on the main Reiki topics, all coming from an experienced teacher trainer with twenty years experience working with Reiki and trained in the traditional Usui way. Whether you are a Reiki student or a Reiki Master, you can easily fasten up your journey of discovery and Reiki practice. Most of us have questions we never dare to ask, questions which actually cannot be answered by traditional old-fashioned way Reiki teachers. This is an opportunity for those rebellious genius people who dare to question the order of things and wish to update their Reiki perspective and level of awareness towards life in general.You know one traditional version of the Reiki story. Now we’re offering you the second, uncensored, true nature and expression of Reiki! Beyond “Love and Light, Namaste or Peace and Blessings” lies the true work we need to focus on because, as you probably know, spiritual catchphrases and practices don’t automatically create spiritual people. As you may discover in chapter 5, you may be spiritual but are you for real?! Time to find out!The way of Reiki is a journey we all can take; a journey during which we are both student and teacher, a seeker of truth and the giver of wisdom, each step gifts us the opportunity to find the knowledge and understanding we all search for.",
  "genres": [],
  "author": "Phillip Hawkins",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/36985834-reiki-hold-my-beer-i-ve-got-this"
}