{
  "title": "The Divided Welfare State: The Battle over Public and Private Social Benefits in the United States",
  "description": "The Divided Welfare State is the first comprehensive political analysis of America's distinctive system of public and private social benefits. Everyone knows that the American welfare state is unusual--less expensive and extensive, later to develop and slower to grow, than comparable programs abroad. Yet, U.S. social policy does not stand out solely for its limits. American social spending is actually as high as spending is in many European nations. What is truly distinctive is that so many social welfare duties are handled not by the state, but by the private sector with government support. With sweeping historical reach and a wealth of statistical and cross-national evidence, The Divided Welfare State demonstrates that private social benefits have not merely been shaped by public policy, but have deeply influenced the politics of public social programs--to produce a social policy framework whose political and social effects are strikingly different than often assumed. At a time of fierce new debates about social policy, this book is essential to understanding the roots of America's distinctive model and its future possibilities. Jacob S. Hacker is the Peter Strauss Family Assistant Profesor of Political Science at Yale University. Previously, he was a Junior Fellow of the Harvard Society of Fellows and Fellow at the New America Foundation as well as a Guest Scholar and Research Fellow at the Brookings Institution. He is the author of The Road to Nowhere: The Genesis of President Clinton's Plan for Health Security (Princeton, 1997), which was co-winner of the 1997 Louis Brownlow Book Award of the National Academy of Public Administration. His articles and opinion pieces have appeared in The New Republic, The Nation, the Los Angeles Times, Boston Globe, and Washington Post. A regular media commentator, he has discussed his work widely on C-Span, national public radio and in papers nationwide.",
  "genres": [
    "Politics",
    "Health Care",
    "Government",
    "Nonfiction",
    "Economics"
  ],
  "author": "Jacob S. Hacker",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/369870.The_Divided_Welfare_State"
}