{
  "title": "Empty-Handed Heart",
  "description": "(Suncoast Society series book #66)[Siren Menage Erotic Contemporary Consensual BDSM Menage a Trois Romance, M/M/F with M/M elements, HEA] Aden aged out of Florida's foster care system. He built a life, bought a house...and fell in love with Niall, a blue-eyed Irish Dom who owned his heart. When Niall got a job in California, he took Aden's heart with him. Niall regretted his move, but thought Aden would follow. Five years later, Niall's back and wants to reclaim what's his--Aden. He doesn't expect to run into Aden while teaching erotic hypnosis at a fetish convention. He wasn't expecting Aden to have gorgeous Etsu on his arm. He damn sure wasn't expecting to save Etsu's life in a malfunctioning elevator. Etsu grew up smothered by a crazy-overprotective family and her asthma. With Aden, she can finally be herself. She can't help fantasizing about Niall and Aden together, or how sexy it'd be writhing in pleasure between them. The question is can they make this work, or will her family succeed yet again in driving away her chance at happiness? This book contains double penetration and some exhibitionism. ** A Siren Erotic RomanceThe other books in the Suncoast Series are standalone works, but are best read in the following order to reduce   Safe Harbor  Domme by Default  Cardinal's Rule  The Reluctant Dom  The Denim Dom  Pinch Me  Broken Toy  A Clean Sweep  A Roll of the Dice  His Canvas  A Lovely Shade of Ouch  Crafty Bastards  A Merry Little Kinkmas  Sapiosexual  A Very Kinky Valentine's Day  Things Made Right  Click  Spank or Treat   A Turn of the Screwed  Chains  Kinko de Mayo  Broken Arrow  Out of the Spotlight  Friends Like These   Vicious Carousel   Hot Sauce  Open Doors  One Ring   Vulnerable  The Strength of the Pack  Initiative  Impact  Liability  Switchy  Rhymes With Orange  Beware Falling Ice  Beware Falling Rocks  Dangerous Curves Ahead  Two Against Nature  Home at Last  A Kinkmas Carol  Ask DNA  Time Out of Mind  Happy Valenkink's Day  Splendid Isolation  Similar to Rain  Happy Spank Patrick's Day   Fire in the Hole  Pretzel Logic   This Moody Bastard  Walk Between the Raindrops  Rub Me Raw   Any World That I'm Welcome To   Heartache Spoken Here  Roll With the Punches  See You Sometime  Borderline  A Case of You  Reconsider Me  Never Too Late for Love  Blues Beach   Happy Spanksgiving   Our Gravity  Friends in Common  Almost Gothic &lt",
  "genres": [
    "BDSM",
    "Menage",
    "M M F",
    "M M Romance",
    "Romance",
    "Novella",
    "Contemporary"
  ],
  "author": "Tymber Dalton",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/37042349-empty-handed-heart"
}