{
  "title": "The Twist",
  "description": "THE TWIST [Romantic Suspense, High Tech Metamorphosis] Zane Tollisons wife is running through their cash faster than he can make it. A Hail Mary contract with Clearwater Tobacco arrives in the nick of time to keep his fledgling consulting firm afloat, and to unchain him once and for all from his narcissistic wife. Beautiful, brilliant, and estranged Kathy Davis is desperate for a new beginning. The feisty post doc bio-geneticist jumps at an offer from Clearwater, pouring her soul into a development that will revolutionize the tobacco industry. The two are unwittingly reeled into a convoluted plan to steal $12 million. Zane is changing into a carbon copy of Kathy, a pawn in a bizarre genetic metamorphosis, entangling Kathy in a sinewy web of seduction and deceit. Forging a bond that will set the course of their destiny, they fight to overpower the diabolic hold that has taken over their lives. *** 5 Stars: A recommended read! The Twist by Lee Silver is one of the most fascinating books that I've read in a long time. The story which takes place in the world of big business and high tech genetic research, is filled with interesting and very likable characters, humor, and above all a completely unique story. This is one book that is definitely a keeper! So if you're a fan of witty clever stories with a touch of science fiction thrown in, then you are going to love The Twist. --Kasey's View *** 4.5 Hearts: Well, I can honestly say this is a unique story. When I first took this one I thought to myself, this is going to be a confusing read. But I was quick to realize the author was able to draw me into the story and keep me there without losing me in the bio-genetic and DNA swapping terms.She created a world that seemed so real and devastating that it seems almost possible. Zane and Kathy are strong characters that are pushed to their emotional, physical, and mental limits and manage to hold on to not only their sanity (most of the time) but to the love they feel for one another. I would highly recommend this one to anyone looking for a suspenseful ride that will keep them anxiously turning the pages and will possibly turn them against cigarette smoking forever. --Sandra, The Romance Studio *** 4 Stars: Humorous...Every man should have to spend at least a month as a woman. Cramps, high/low emotion, pregnancy, and menopause would help a male understand a female. Lee Silver writes with a great deal of humor and imagination. Her characters are well-developed. Her plot is interesting and creative. Fans of fantasy romance will enjoy The Twist. --Debra Gaynor, Review Your Book",
  "genres": [],
  "author": "Lee Silver",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/3706086-the-twist"
}