{
  "title": "Storming the Reality Studio: A Casebook of Cyberpunk & Postmodern Science Fiction",
  "description": "The term “cyberpunk” entered the literary landscape in 1984 to describe William Gibson’s pathbreaking novel Neuromancer. Cyberpunks are now among the shock troops of postmodernism, Larry McCaffery argues in Storming the Reality Studio, marshalling the resources of a fragmentary culture to create a startling new form. Artificial intelligence, genetic engineering, multinational machinations, frenetic bursts of prose, collisions of style, celebrations of texture: although emerging largely from science fiction, these features of cyberpunk writing are, as this volume makes clear, integrally related to the aims and innovations of the literary avant-garde.By bringing together original fiction by well-known contemporary writers (William Burroughs, Thomas Pynchon, Don DeLillo, Kathy Acker, J. G. Ballard, Samuel R. Delany), critical commentary by some of the major theorists of postmodern art and culture (Jacques Derrida, Fredric Jameson, Timothy Leary, Jean-François Lyotard), and work by major practitioners of cyberpunk (William Gibson, Rudy Rucker, John Shirley, Pat Cadigan, Bruce Sterling), Storming the Reality Studio reveals a fascinating ongoing dialog in contemporary culture.What emerges most strikingly from the colloquy is a shared preoccupation with the force of technology in shaping modern life. It is precisely this concern, according to McCaffery, that has put science fiction, typically the province of technological art, at the forefront of creative explorations of our unique age. A rich opporunity for reading across genres, this anthology offers a new perspective on the evolution of postmodern culture and ultimately shows how deeply technological developments have influenced our vision and our art. CONTENTSIntroduction: The Desert of the Real · Larry McCaffery Cyberpunk 101: A Schematic Guide to Storming the Reality Studio · Richard Kadrey & Larry McCafferyBeyond the Extinction of Human Life [from Empire of the Senseless] · Kathy Acker ·from Crash · J. G. Ballard ·Mother and I Would Like to Know [from The Wild Boys] · William S. Burroughs · Rock On · Pat Cadigan · Among the Blobs · Samuel R. Delany · from White Noise · Don DeLillo ·from Neuromancer · William Gibson · Fistic Hermaphrodites · Rob Hardin ·Microbes · Rob HardinPenetrabit: Slime Temples · Rob Hardin ·nerve terminals · Rob Hardin ·Max Headroom · Harold Jaffe ·from Straight Fiction · Thom Jurek ·The Toilet Was Full of Nietzsche [from Metrophage] · Richard Kadrey · Office of the Future [from Dad’s Nuke] · Marc Laidlaw · I Was an Infinitely Hot and Dense Dot [from My Cousin, My Gastroenterologist] · Mark Leyner · from Plus · Joseph McElroy ·Wire Movement #9 · Misha · Wire for Two Tims · Misha · from Easy Travel to Other Planets · Ted Mooney · Frame 137 · Jim O’Barr · from The Crying of Lot 49 · Thomas Pynchon ·from Software · Rudy Ruckerfrom Life During Wartime · Lucius Shepard · Stoked · Lewis Shiner ·Wolves of the Plateau · John Shirley ·Twenty Evocations [“Life in the Mechanist/Shaper Era: 20 Evocations”; Mechanist-Shapers] · Bruce Sterling ·Mare Tranquillitatis People’s Circumlunal Zaibatsu: 2-1-’16 [from Schismatrix] · Bruce Sterling The Indigo Engineeers · William T. Vollmann · Before the Lights Came On: Observations of a Synergy · Steve Brown The Automation of the Robot [from Simulations] · Jean BaudrillardCyberpunk and Neuromanticism · Istvan Csicsery-Ronay, Jr. ·from Of Grammatology · Jacques Derrida ·Yin and Yang Duke It Out · Joan Gordon ·Cybernetic Deconstructions: Cyberpunk and Postmodernism · Veronica Hollinger from Postmodernism, or The Cultural Logic of Late Capitalism · Fredric Jameson Television and the Triumph of Culture [from The Postmodern Scene] · Arthur Kroker & David Cook ·Bet On It: Cyber/video/punk/performance · Brooks Landon · The Cyberpunk: The Individual as Reality Pilot · Timothy Leary The Postmodern [from The Postmodern Condition] · Jean-François Lyotard · An Interview with William Gibson · Larry McCaffery ·Cutting Up: Cyberpunk, Punk Music, and Urban Decontextualizations · Larry McCaffery ·POSTcyberMODERNpunkISM · Brian McHale · The Wars of the Coin’s Two Halves: Bruce Sterling’s Mechanist/Shaper Narratives · Tom Maddox · Frothing the Synaptic Bath · David Porush · Literary MTV · George Slusser ·Preface from Mirrorshades · Bruce Sterling ·On Gibson and Cyberpunk SF · Darko Suvin · The Japanese Reflection of Mirrorshades · Takayuki Tatsumi",
  "genres": [
    "Cyberpunk",
    "Science Fiction",
    "Fiction",
    "Essays",
    "Philosophy",
    "Anthologies",
    "Theory"
  ],
  "author": "Larry McCaffery",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/370160.Storming_the_Reality_Studio"
}