{
  "title": "Cuisine a Latina: Fresh Tastes and a World of Flavors from Michy's Miami Kitchen",
  "description": "At Michy’s, acclaimed as Miami’s best restaurant, Michelle Bernstein is building a national following for her fresh new take on Latin cuisine. Born and raised by a food-loving Argentinean mother in Miami, Michelle grew up fluent in Spanish and steeped in the city’s cosmopolitan, Latin-influenced culture. She explored South America, the Caribbean, and Mexico. Using the freshest ingredients and the French training she went on to acquire, she has blended all these traditions into a cuisine that is uniquely hers.Cuisine à Latina introduces us to Michelle’s world. Her Latin food is unlike any that you’ve probably tasted. Full of flavor, it is familiar but exciting — vividly seasoned but not fiery hot, with touches that reflect the casual vivacity of Miami. You’ll find many appetizers to light up a gathering: Fried Calamari with Chile-Coconut Sauce, irresistibly flaky Ground Beef and Tomato Empanadas, and bright Peruvian Mixed Seafood Ceviche. Or start off with Michelle’s cool riff on a Spanish classic, White Gazpacho with Almonds, Grapes, and Cucumber.Michelle gives you plenty of great party dishes with Latin flair, like Beef Tenderloin with Creamy Horseradish, or the colorful Fideua, bursting with seafood and herbs, which is similar to paella but much easier, and made with spaghetti instead of rice. You’ll also want to try her sensationally simple grilled steak with chimichurri sauce, the Argentinean version of salsa. Her Cornish game hens, marinated in garlic-lime mojo, with chorizo sausage-bread stuffing, are perfect for Thanksgiving — or a summer evening — and she shows you how to make the same recipe with turkey.Michelle’s uncomplicated “Mama cooking” will spice up your everyday repertoire: Mom’s Arroz con Pollo (chicken with yellow rice), Tuna Schnitzel with Cucumber Slaw, Pork with Prunes and Apricots. Her side dishes and salads beg to be at the center of the plate: Chili-Fried Onion Rings, Mexican-Style Corn on the Cob, and Bibb Lettuce with Avocado, Shredded Jack Cheese, and Buttermilk–Charred Jalapeno Dressing. Cuisine à Latina may change your view of Latin food — and it will revitalize your cooking.A three-time James Beard Award nominee, Michelle Bernstein is chef-owner of the Michy’s in Miami, Michelle’s at Carysfort in Key Largo, Florida, and MB in Cancun. A former professional ballerina, she trained at Johnson & Wales and under the renowned chef Jean-Louis Palladin.Andrew Friedman has coauthored cookbooks with Alfred Portale, Tom Valenti, the former White House chef Walter Scheib, and many others. He also coedited the popular anthology Don’t Try This at Home and collaborated on the New York Times best-selling memoir Breaking Back.",
  "genres": [
    "Cookbooks",
    "Food"
  ],
  "author": "Michelle Bernstein",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/3701301-cuisine-a-latina"
}