{
  "title": "Summer's Complaint: My family's courageous, century-long struggle with a rare genetic cancer syndrome",
  "description": "“I thought there might be something wrong with your mother’s family.”  Those words, spoken by a grandmother to her eleven-year-old granddaughter, sparked a search for answers to a mystery spanning five generations.  Familial adenomatous polyposis is a rare, genetic cancer predisposition syndrome caused by a deletion mutation in the APC gene on chromosome 5. By the age of fifty, nearly 99 percent of untreated patients will have developed cancer.  This is the dark shadow that has lingered over one Midwestern family since at least 1911, when Mary Regan Baker was seen at Mayo Clinic in Rochester, Minnesota for symptoms of a disorder that would become commonplace in her descendants.  Through deeply touching personal stories of love, heartbreak, and hope, Summer’s Complaint explores the meaning of family and how tragic loss leads to the remaking of life in the face of a rare genetic mutation.   \"I spent 30 years working in Pharmaceutical R&D. As a drug development professional turned patient advocate educator trying to understand the various journeys that patients, caregivers, and family members take when disease enters their lives, I found author Laura Kieger’s story and storytelling compelling. Summer's Complaint is part medical memoir, part case study, about multiple generations of one family struggling with a rare genetic predisposition to cancer. Those of us in healthcare, clinical research, and patient advocacy can learn much by reading Summer’s Complaint. -Kevin Freiert MBA, Principal & Founder, Salem Oaks Consulting  \"Kudos, Laura Kieger, on an excellent book!\" -Mary Dunkle, Vice President of Educational Initiatives, National Organization for Rare Disorders (NORD)",
  "genres": [
    "Nonfiction"
  ],
  "author": "Laura Kieger",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/37118752-summer-s-complaint"
}