{
  "title": "هوس",
  "description": "بلغة روائية سلسلة، تسمي الأشياء بأسمائها، وبخطاب روائي جريء، تنشغل الروائية الكويتية \"رانيا السعد\" بالتعبير عن الواقع الحياتي لشخصيات تتفاوت في طريقة رؤيتها لذاتها وللحياة بكل شعابها وتعقيداتها الأيديولوجية والثقافية، حيث يطغى الاغتراب الداخلي لشخوص الرواية، الذين ساقتهم الروائية لتؤشر على البعد العام لشرائح ونماذج تتصادم طبقياً واجتماعياً في موقعها وواقعها، وتعاني جميعها من عاطفة مثبطة، وانكسارات، نتيجة الفوضى والاضطراب التي تسود علاقات الأفراد فيما بينهم أو في علاقتهم مع محيطهم الاجتماعي. تحكي الرواية قصة فتاة تعيش في أسرة مترفة، ومنفتحة بلا ضوابط تتألف من أب مشغول بجمع أموال يقال إنها غير نظيفة. وأم منهمكة في اقتناء الثياب الفاخرة والمجوهرات الثمينة، وأختان متزوجتان وغير راضيتان بعيشهما. وعلى يد \"سلوى\" الفتاة الصغرى في العائلة تحيك الروائية أحداث روايتها بأسلوب سردي ذاتي يطغى عليه التحليل النفسي والاجتماعي في جميع مراحل العمل الأدبي حيث ترتكز أحداث الرواية على عقدة الشعور بالنقص التي تعيشها سلوى نتيجة بشاعتها \"فأنا طويلة ونحيلة ويبدو جسمي كجسم صبي على وشك البلوغ تمددت عظامه بطريقة غير متناسقة...\". هذا الوضع جعل الفتاة مثار سخرية العائلة والأصدقاء في النادي والجامعة، الأمر الذي دفعها إلى الانتماء إلى جماعة الدعوة أو \"حركة الائتلاف\" فأحاطت نفسها بجمع من الصديقات والأنشطة الاجتماعية والدروس الدينية، مما بدد شعورها بالوحدة وجعلها تشعر لأول مرة بالانتماء الحقيقي لمجموعة \"... يبدو أن الدين هو الحل الأسهل لكل شيء، هل هو كذلك؟\" عندئذ شعرت أن حجابها تذكرة مرور إلى جميع الطبقات الاجتماعية الأعلى والأقل شأناً أو نسباً. تتوالى الأحداث في الرواية حتى تُدبر لها فتيات الدعوة زوجاً من الإخوان المسلمين \"... نحن دوماً نزوج شبابنا من بناتنا، فالطيبون للطيبات حتى يعين أحدهما الآخر على طاعة الله ويدعم بعضهما البعض في شؤون الدعوة...\" ولكن لم تجر الرياح بما تشتهي السفن حيث تفاجأ بزواجه مرة ثانية بعد أن كانت قد أنجبت منه طفلتين. عندئذ أدركت سلوى أن حياتها أصبحت بلا معنى \"... جلست على أرض المكتب ووضعت رأسي بين ركبتي وبكيت كما لم أبك طوال سنواتي الخمسة والثلاثين، بكيت كل شيء، بكيت بيت أهلي الذي لم أشعر فيه يوماً بالراحة، بكيت فقدان الحنان، بكيت جسدي غير المؤنث بالدرجة الكافية، بكيت الشعر اللعين الذي يغطيني ويعيبني، بكيت ضعفي، بكيت كل الرجال الذين أساؤوا إلي، بكيت عقاب، بكيت فارس الضيف الذي مرّ فقط ليشعرني بالنقص أكثر. مسحت دموعي وقررت أن أطلب الطلاق...\". وتنتهي الرواية بوقوع سلوى فريسة مرض نفسي لاإرادي هو obsessional stalking ويعني (هوس لاإرادي) يجعل من ملاحقة شخص معين دون التحدث إليه همه في الحياة. وهذا الشخص الذي تعنيه الكاتبة \"زوجة طليقها\" حيث تكون الشغل الشاغل لسلوى في الحياة، الأمر الذي أفسد عليها حياتها، وعملها، وتواصلها مع الآخرين. تقول الطبيبة المعالجة: \"... أبرز ملامح المصابين بالهوس أو من نسميهم stalkers هو تخليهم عن كرامتهم وإذلالهم لأنفسهم من أجل الحصول على معلومات عن الشخص محل هوسهم...\". \"هوس\" رواية عميقة ذات خطاب روائي جديد استطاعت من خلاله \"رانيا السعد\" أن تصنع من ركام أحداث متخيلة وربما حقيقية رواية هي خطوة جديدة في مسيرتها الروائية.(نبذة النيل والفرات)نسخة إلكترونية :",
  "genres": [
    "Novels"
  ],
  "author": "رانيا السعد",
  "average_rating": "2.30",
  "url": "https://www.goodreads.com/book/show/12228625"
}