{
  "title": "Open to Desire: Embracing a Lust for Life - Insights from Buddhism and Psychotherapy",
  "description": "Bringing wisdom to a fresh and compelling topic, Mark Epstein shows how desire can be a teacher in its own right, helping us to reconcile our conflicting thoughts about it from both a Buddhist and a psychological point of view. It is common in both Buddhism and Freudian psychoanalysis to treat desire as the root of all suffering and problems, but psychiatrist Mark Epstein believes this to be a grave misunderstanding. In his defense of desire, he makes clear that it is the key to deepening intimacy with ourselves, one another, and our world. An enlightening tapestry of psychotherapeutic practice, contemporary case studies, Buddhist insight, and narratives as diverse as the Ramayana and Sufi parables, \"Open to Desire\" brings a refreshing new perspective to humanityas most paradoxical emotion.Proposing that spiritual attainment does not have to be detached from intimacy or eroticism, \"Open to Desire\" begins with an exploration of the dissatisfaction that causes us to both cling to, and fear, desire. Offering a new path for traversing this ambivalence, Dr. Epstein shows us how we can overcome these obstacles, not by indulgence or suppression, but by learning a new way to be with desire. Full of practical advice, this is a lasting guide for finding peace both in ourselves and in our most highly charged interactions.BACKCOVER: Advance Praise for OPEN TO DESIRE  \"Mark Epstein's \"Open to Desire\" is a masterpiece in his unique genre of combined Buddhist, psychological, and poetical insight. It teaches us how not just to fear and repress, but to re-channel and harness the most powerful energies of life toward freedom and bliss. I heartily recommend this work.\"--Robert Thurman, Jey Tsong Khapa Professor of Buddhist studies, Columbia University; President, Tibet House, US; author of \"Infinite Life\"  a\"Open to Desire\" shines a bright beam of wisdom into an ever-confusing, ever- seductive realm. Mark Epstein, using his rare gifts of insight, brilliantly shows us a way through the confusion of craving to the treasures of intimacy and clarity hidden within our yearnings. The Buddha and Freud meet the Kama Sutra in this essential guidebook for anyone with a healthy lust for life.\"-- Daniel Goleman, author, \"Destructive Emotions: A Scientific Dialogue with the Dalai Lama\"  aMark Epstein writes with the keen insight of a skilled psychotherapist, the compassion of a long-term meditator, and the gift of a compelling storyteller. He courageously explores the true nature and potential of desire, which we depend on for our very connection to life. This book is an outstanding new view of an emotion at the core of our being..a--Sharon Salzberg, author of \"Faith: Trusting Your Own Deepest Experience\"  aAt last a book that doesnat shy away from the troubled topic of desire. Mark Epstein has written a beautifully crafted, intimate account of the struggle to come to terms with the contradictory yearnings within us. An illuminating, original and provocative work.a -- Stephen Batchelor, author of \"Living with the Devil\"  \"A beautiful book. Heals the split between psychotherapy and spirituality by showing positive aspects of desire common to both. Mark Epstein's portrayals of the goodness of desire and its gaps move us in ways that heal and enlighten, always sensitive to who we are and who we can be.\"--Michael Eigen, author of \"The Sensitive Self\" and \"EmotionalStorm\"",
  "genres": [
    "Buddhism",
    "Psychology",
    "Spirituality",
    "Nonfiction",
    "Philosophy",
    "Self Help",
    "Religion"
  ],
  "author": "Mark Epstein",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/37081.Open_to_Desire"
}