{
  "title": "On Doctoring: Stories, Poems, Essays",
  "description": "Few subjects hold more universal appeal than that of medicine, and surely few books have evoked medicine's drama and magic more powerfully than On Doctoring. In its many forms, from age-old ritual to the cutting edge of modern science, medicine concerns us all. It is a human profession, practiced by people who have dedicated their lives not only to science but also to humanity. In the words of the great physician-writer Sir William Osler, \"The physician needs a clear head and a kind heart; his work is arduous and complex, requiring the exercise of the very highest faculties of the mind, while constantly appealing to the emotions and higher feelings.\" It is the humanity in medicine that has inspired the pens of countless writers, and that has now been captured in this remarkable anthology of medical literature. This newly expanded edition of On Doctoring is an extraordinary collection of stories, poems, and essays written by physicians and non-physicians alike -- works that eloquently record what it is like to be sick, to be cured, to lose, or to triumph. Drawing on the full spectrum of human emotions, the editors have included selections from such important and diverse writers as Anton Chekhov, W. H. Auden, William Carlos Williams, John Keats, John Donne, Robert Coles, Pablo Neruda, Ernest Hemingway, Raymond Carver, Alice Walker, Kurt Vonnegut, and Abraham Verghese. Among the new authors included in this edition are Rainer Maria Rilke, Lisel Mueller, and May Sarton. In this era of managed healthcare, when medicine is becoming more institutionalized and impersonal, this book recaptures the breadth and the wonder of the medical profession. Presenting the issues, concerns, and challenges facing doctors and patients alike, On Doctoring is at once illuminating and provocative, a compelling record of the human spirit.",
  "genres": [
    "Medicine",
    "Medical",
    "Poetry",
    "Nonfiction",
    "Essays",
    "Short Stories",
    "Literature"
  ],
  "author": "Richard Reynolds",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/37114.On_Doctoring"
}