{
  "title": "Understanding Islam through Hadis: Religious Faith or Fanaticism?",
  "description": "Noted Indian writer and polymath Ram Swarup explores the meaning of Islam through the words of the Sahih Muslim, considered by Muslims to be one of the most authoritative of the collections of \"traditions\" (Arabic Hadith) about the life of the Prophet Muhammad. Like the Koran, these traditions are believed to be divinely revealed by Allah and they complement the verses of the Koran, in many cases expanding upon them and explaining the context of their revelation. As Swarup notes in his introduction, to Muslims the Hadith literature represents the Koran in action, stories of \"revelation made concrete in the life of the Prophet.\" Among the orthodox they are considered as sacred as the Koran itself.Swarup is plainly skeptical of the claim that the Hadith literature is divinely inspired. In the introduction he says, \"The Prophet is caught as it were in the ordinary acts of his life - sleeping, eating, mating, praying, hating, dispensing justice, planning expeditions and revenge against his enemies. The picture that emerges is hardly flattering. . . . One is . . . left to wonder how the believers, generation after generation, could have found this story so inspiring. The answer is that the believers are conditioned to look at the whole thing through the eyes of faith. To them morality derives from the Prophet's actions. . . .his actions determine and define morality.\"The Sahih Muslim, a massive work consisting of 7,190 traditions divided into 1,243 chapters, is hardly accessible to the average reader; so Swarup quotes representative selections that touch upon the main tenets of faith, purification, prayer, fasting, pilgrimage, marriage and divorce, crime and punishment, religious wars (jihad), paradise, hell, repentance, and many other features of the religion.To non-Muslims this work provides many insights into the mindset of the average Muslim who is raised on these traditions about Muhammad. It also underscores the gulf that exists between the sanctum of orthodox Islam and an increasingly secularized Westernized world.",
  "genres": [
    "Islam",
    "History",
    "Religion",
    "Nonfiction",
    "Banned Books",
    "India",
    "Theology"
  ],
  "author": "Ram Swarup",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/3712484-understanding-islam-through-hadis"
}