{
  "title": "Anne of Green Gables",
  "description": "Anne of Green Gables is the classic children's book by L M Montgomery, the inspiration for the Netflix Original series Anne with an E. Watch it now!Marilla and Matthew Cuthbert are in for a big surprise. They are waiting for an orphan boy to help with the work at Green Gables - but a skinny, red-haired girl turns up instead. Feisty and full of spirit, Anne Shirley charms her way into the Cuthberts' affection with her vivid imagination and constant chatter. It's not long before Anne finds herself in trouble, but soon it becomes impossible for the Cuthberts to imagine life without 'their' Anne - and for the people of Avonlea to recall what it was like before this wildly creative little girl whirled into town.The Puffin Classics relaunch includes:A Little PrincessAlice's Adventures in WonderlandAlice's Adventures Through the Looking GlassAnne of Green GablesBlack BeautyHans Andersen's Fairy TalesHeidiJourney to the Centre of the EarthLittle WomenPeter PanTales of the Greek HeroesThe Adventures of Huckleberry FinnThe Adventures of King ArthurThe Adventures of Tom SawyerThe Call of the WildThe Jungle BookThe OdysseyThe Secret GardenThe Wind in the WillowsThe Wizard of OzTreasure IslandL. M. Montgomery was born in Clifton, Prince Edward Island, in 1874. A prolific writer, she published many short stories, poems and novels but she is best known for Anne of Green Gables and its sequels, inspired by the years she spent on the beautiful Prince Edward Island. Montgomery died in Toronto in 1942 and was buried in Cavendish on her beloved island.Other books by L. M. Montgomery:Anne of Green Gables; Anne of Avonlea; Anne of the Island; Anne of Windy Poplars; Anne's House of Dreams; Anne of Ingleside; Rainbow Valley; Rilla of Ingleside; Emily of New Moon; Emily Climbs; Emily's Quest; Pat of Silver Bush; Mistress Pat; The Story Girl; The GOlden Road; Kilmeny of the Orchard; The Blue Castle; Magic for Marigold; A Tangled Web; Jane of Lantern Hill",
  "genres": [
    "Classics",
    "Fiction",
    "Young Adult",
    "Historical Fiction",
    "Childrens",
    "Middle Grade",
    "Audiobook"
  ],
  "author": "L.M. Montgomery",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/3709710-anne-of-green-gables"
}