{
  "title": "Ender of Worlds",
  "description": "A Devastating Plan. The Undead Rising. Worlds Ending.  I’d barely had time to recover from Elsbeth Wyght’s vicious game when the call from Detective Haskins came. This time a bank robbery with a difference... and of course nothing as it seemed. With this turn of events I found myself thrust onto a shadowy trail that would lead me back to the asylum of my deepest nightmares and a desperate hunt for the truth amid a growing, cataclysmic danger.  Add to the mix an engineered virus threatening to turn half the city to zombies, a trip into a world straight out of a Grimm's fairy tale, and a vicious, demonic conspiracy that would make the Silver Spiral’s plans seem like a cakewalk. And always, just below the surface, my dark other. Stirring, plotting, waiting. But for what?  Now, as the dead of winter looms, the vampires and demons of the Dark City are growing more restless than ever as they wait for the Shade to return. The evil force that brought hell to my city. The Shadow in the mirror. The Ender of Worlds.  Ender of Worlds is the fourth Morgan Rook novel in the Urban Fantasy Thriller ‘The Order of Shadows’ series. If you love supernatural thrillers, high paced action and otherworldly adventure, then you’ll love this new book from Kit Hallows, author of Urban Fantasy books with teeth!    The Order of Shadows Series Titles Include:  Dark City The Order of Shadows Book 1 Midnight Falls The Order of Shadows Book 2 A Game of Witches The Order of Shadows Book 3 Ender of Worlds The Order of Shadows Book 4 Book 5 Coming Soon!  Categories for A Game of Witches  - Urban Fantasy - Paranormal Suspense - Vampire - Werewolves & Shifters - Witches & Wizards - Occult Horror - Urban Fantasy Thriller - Dark Fantasy - Supernatural Thriller - Supernatural Mystery and Suspense",
  "genres": [
    "Urban Fantasy",
    "Fantasy"
  ],
  "author": "Kit Hallows",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/37118697-ender-of-worlds"
}