{
  "title": "De vita Constantini FC Bd.83",
  "description": "Die Vita Constantini des Eusebius von Caesarea (ca. 260–339 n. Chr.), des Vaters der Kirchengeschichtsschreibung, gehört zu den wichtigsten zeitgenössischen Quellen zu Konstantin dem Großen, zumal sie in engem zeitlichen Abstand zu Konstantins Tod im Jahre 337 n. Chr., in Teilen wohl noch zu dessen Lebzeiten verfaßt wurde. Euseb feiert in dieser vier Bücher umfenden Schrift den ersten christlichen Kaiser in der Geschichte Roms nach den Regeln des antiken Herrscherlobs und erweitert dieses außerdem noch durch die Zugabe authentischer Urkunden aus der kaiserlichen Kanzlei sowie eigenhändig abgefaßter Schreiben des Kaisers. Konstantin ist in der Darstellung Eusebs ein Diener Gottes wie Mose und zeichnet sich durch seine Frömmigkeit und seinen Glauben an den einen Gott aus, den er nicht müde wird zu verkünden, während die polytheistische Religion der paganen Dämonenverehrer von ihm bekämpft wird. Obwohl Euseb den Kaiser persönlich nur wenige Male treffen konnte, zeichnet er dessen berühmte Vision des Labarums, das heißt des christlichen Feldzeichens, nach dessen Bericht auf. Desweiteren berichtet er von der Schlacht an der Milvischen Brücke, beschreibt die kaiserlichen Baumaßnahmen, wie zum Beispiel den Bau der Grabeskirche in Jerusalem oder die Apostelkirche in Konstantinopel, und schildert den Tod von Konstantins Vater Constantius Chlorus ebenso wie den seiner Mutter Helena. Erst auf dem Totenbett läßt sich Konstantin nach Euseb taufen und erweist sich in seinem Tod als glücklich zu preisender Mensch, der mit Söhnen, die seine Nachfolge antreten können, gesegnet ist, der sich der Verehrung seiner Untertanen gewiß sein kann und durch viele militärische Erfolge ebenso wie durch kluge politische Maßnahmen sein Konzept der Einheit in Staat und Kirche erfolgreich verwirklicht hat.",
  "genres": [],
  "author": "Unknown",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3710921-de-vita-constantini-fc-bd-83"
}