{
  "title": "The Survival of Marvin Baines",
  "description": "Oh no! A decade birthday is approaching, one with a big \"0\" in it, and he's losing it. Marvin Baines seemingly has it all: a loving family and a great job. He is about to turn forty, and just like that, the realization hits him--his own mortality is straight up the road. That's not his only problem. Suddenly he is unable to distinguish fantasy from reality, and his often quirky decision-making causes his whole life to begin to unravel. All he wants is an escape from his humdrum life. What he gets is something quite unexpected.\"The humour is well-judged and never forced, and overall The Survival of Marvin Baines is a highly recommended tale of mid-life dysfunction.\" - Indie Book Spot\"This book will stick with you like a healthy meal leaving you feeling pleased with yourself for eating, savoring, and thinking...\" - Karen Luellen. authorFrom the author of the rollicking romp THE FAMOUS UNION.EXCERPTMarvin Baines was not one to be easily fooled. He was reckless, but in a cautious way. He determined to hold his silence on the talking for the time being. He would have to be absolutely certain this time before he went about telling his story.He took his yellow Mazda wagon out for an early afternoon spin. His windows unrolled all the way; his left elbow leaning out the door; his frame resting luxuriously against his vinyl seat cover; the wind whipping his hair about his head; his eyes focused through his not-so-dark sun-glasses, on the road ahead; his radio turned up loud to the station that played only country classics from the fifties and sixties, blaring out the tunes he loved so; his car churning along at thirty miles an hour in the fifty-five mile an hour zone--Marvin Baines was king. King of himself. Of his feelings. He was happier than can be.And the sky overhead kind of blue, the breeze rather cool, the music good. Everything was perfect. The way Baines liked it. A relaxing drive in the country was real life. It was living, the way living should be. For Baines. Just Baines, his car, and his music--and of course the breeze, and the lovely landscape. That's all he needed to be really content in the moment.The singer on the radio was telling Baines about how he, a lonely man, had stepped into a bar and had met a delectable little woman, whom he had shared a drink and a dance with; but then, just as he and the woman were about to leave the bar together, the man had suddenly looked down at his hand and he had seen the wedding band on his finger.",
  "genres": [],
  "author": "Mike  Meyer",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/12228180-the-survival-of-marvin-baines"
}