{
  "title": "12 Simple Steps to Succeeding and Thriving in Spite of a Bullying Boss",
  "description": "Have you ever tried to “deal with” your bullying manager only to fail? Have you ever tried to figure out how to please your abusive boss only to have the rules change every day? Have you ever gone above and beyond to try to impress your bullying boss only to be criticized for whatever you do? Have you ever tried to make yourself an invaluable asset to your toxic supervisor’s team only to have your cruel supervisor dismiss you as worthless? Have you ever tried to calm your angry boss only to have their fury escalate? Have you ever felt that your workplace success was hampered by how much you hate your boss? And have you ever gotten frustrated or discouraged by your lack of success in improving your employer-employee relationship?I have. And I’ve learned that, unfortunately, more often than not, trying to please, calm, or “deal with” a bullying boss is a pointless waste of time. Simply put, these types of mean managers are jerks who enjoy making you feel worthless and miserable and enjoy destroying your self-esteem, so nothing you do is going to impress or change them. And even though they’re wrong about you, nothing you do will ever convince them otherwise.However, you can still win this game! Even though your boss is a jerk, you don’t have to let your bad boss destroy you. In fact, if you know what to do, you can even use your current awful situation to improve your career success! Your terrible boss thinks they have the upper hand, but they really don’t. If you use the right techniques, you can succeed in your career despite a bullying supervisor! And this book will teach you how.Instead of trying to teach you how to “deal with” or please your abusive manager, this book will focus on your personal employment success. This book is geared toward teaching you how to use your current terrible situation to your advantage so that you can ultimately succeed and thrive professionally, despite your bullying boss trying to tear you down and make you fail.You’ll * How to manage the stress of working under an abusive supervisor.* How to gain the emotional strength to use your current horrible workplace situation to advance your career.* Why working for a mean supervisor who you justifiably hate can actually be an incredibly valuable experience.* How to use your current unbearable workplace to develop your employability skills.* How to use your awful workplace to learn about yourself, gain personal strength, and improve self-confidence.* How to not only survive in difficult workplace conditions, but also thrive.And, as someone who has worked for more than my share of cruel managers, I don’t blame you one bit if you hate your boss!You can triumph over your bullying boss! You can succeed and build a great career for yourself despite your terrible boss wanting to destroy you. What are you waiting for? Get started today!And visit me online at www.paulinewadley.com!",
  "genres": [],
  "author": "Pauline Wadley",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/37134962-12-simple-steps-to-succeeding-and-thriving-in-spite-of-a-bullying-boss"
}