{
  "title": "BakeWise: The Hows and Whys of Successful Baking with Over 200 Magnificent Recipes",
  "description": "The James Beard Award–winning, bestselling author of CookWise and KitchenWise delivers a lively and fascinating guide to better baking through food science.Follow kitchen sleuth Shirley Corriher as she solves everything about why the cookie crumbles. With her years of experience from big-pot cooking at a boarding school and her classic French culinary training to her work as a research biochemist at Vanderbilt University School of Medicine, Shirley looks at all aspects of baking in a unique and exciting way. She describes useful techniques, such as brushing your puff pastry with ice water—not just brushing off the flour—to make the pastry higher, lighter, and flakier. She can help you make moist cakes; shrink-proof perfect meringues; big, crisp cream puffs; amazing pastries; and crusty, incredibly flavorful, open-textured French breads, such as baguettes.Restaurant chefs and culinary students know Shirley from their grease-splattered copies of CookWise , an encyclopedic work that has saved them from many a cooking disaster. With numerous “At-a-Glance” charts, BakeWise gives busy people information for quick problem solving. BakeWise also includes Shirley's signature “What This Recipe Shows” in every recipe. This scientific and culinary information can apply to hundreds of recipes, not just the one in which it appears.BakeWise does not have just a single source of knowledge; Shirley loves reading the works of chefs and other good cooks and shares their tips with you, too. She applies not only her expertise but that of the many artisans she admires, such as famous French pastry chefs Gaston Lenôtre and Chef Roland Mesnier, the White House pastry chef for twenty-five years; and Bruce Healy, author of Mastering the Art of French Pastry . Shirley also retrieves \"lost arts\" from experts of the past such as Monroe Boston Strause, the pie master of 1930s America. For one dish, she may give you techniques from three or four different chefs plus her own touch of science—“better baking through chemistry.” She adds facts such as the right temperature, the right mixing speed, and the right mixing time for the absolutely most stable egg foam, so you can create a light-as-air génoise every time.Beginners can cook from BakeWise to learn exactly what they are doing and why. Experienced bakers find out why the techniques they use work and also uncover amazing pastries from the past, such as Pont Neuf (a creation of puff pastry, pâte à choux, and pastry cream) and Religieuses, adorable “little nuns” made of puff pastry filled with a satiny chocolate pastry cream and drizzled with mocha icing.Some will want it simply for the recipes—incredibly moist whipped cream pound cake made with heavy cream; flourless fruit soufflés; chocolate crinkle cookies with gooey, fudgy centers; huge popovers; famed biscuits. But this book belongs on every baker's shelf.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Culinary",
    "Science"
  ],
  "author": "Shirley O. Corriher",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/3717673-bakewise"
}