{
  "title": "Queen of the Amazons",
  "description": "Judith Tarr returns to the always fascinating character of Alexander the Great in this fantasy novel that springs from the legend that the Queen of the Amazons came to meet him in Persia, and became his friend.Hippolyta was Penthesilea, or Queen of the Amazons. She ruled as war leader and high priestess of a scattered tribe of women warriors who had dwelt on the high plains to the north and east of Persia for time out of mind. They were not isolated---travelers came and went through their territory, bringing news from the west, and carrying tales of the warrior women back home with them.But the Queen had a great grief in her life: her daughter and heir was a strange child. The girl had been born, so the Priestesses said, without a soul. And it was true that she was like no other child alive. She did not speak, and often seemed not to even see the people around her. She could not dress or feed herself, but she could ride and hunt like no other woman of the tribe. Many of the Amazons believed that the child must never be Queen, but that was a problem for a later time--Hippolyta was young and strong.Selene, the niece of the tribe's Seer, was put in charge of the child, to be her nursemaid and guardian. And it was a good, though sometimes difficult, life for many turns of the years. But then one day news came from the West of a new Conqueror, a young man who came out of Macedon with a spirit like flame, intending to rule the whole world. The Queen's daughter responded to the tale as a woman in the desert would to the sound of falling water. That very night she stole out of the camp and rode west. Selene could not stop her, and so she must follow, praying that the Queen would understand. Hippolyta herself followed the next day, and so they rode together, controlled by the child's compulsion, until they had crossed the mountains and entered into Alexander's Empire, and under the sway of Alexander's powerful personality.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Fantasy",
    "Adult",
    "Romance"
  ],
  "author": "Judith Tarr",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/371510.Queen_of_the_Amazons"
}