{
  "title": "Battleground Berlin: CIA vs. KGB in the Cold War",
  "description": "Battleground Berlin is the definitive, insider’s account of the espionage warfare in Berlin between CIA and KGB from 1945 to the construction of the Berlin Wall in 1961. Two intelligence veterans―major players on opposite sides of the Cold War―have joined in an unprecedented collaboration to tell the story. Basing their narrative on personal recollections, interviews with other CIA and KGB officers, and documents never before made public, the authors provide a vast number of new details of CIA’s infiltration of the new East German intelligence service; the construction, operation, and uncovering of the Berlin tunnel; and many other initiatives and countermoves dealing with the series of crises that racked Berlin and jeopardized an uneasy world peace during this period.Battleground Berlin illuminates some of the most compelling mysteries of the Cold War, · what really happened the night the Soviets \"discovered\" the Berlin Tunnel;· who ordered the building of the Berlin Wall―and why did the West seem so ill prepared;· how did infighting among Soviet leaders affect decisionmaking during the most critical moments of the Berlin crisis;· how did power struggles between KGB and its protégé, the dreaded East German security service, shape the political landscape of East Germany and heighten tension in West Berlin;· how much did the famous defector Otto John reveal to KGB―and why is he still unable to clear his name;· and much more.The book, an operational and organizational history of the world’s two most important secret service organizations during a critical time, unveils the vital connection between intelligence gathering and political decisionmaking at the highest levels. Full of intrigue and suspense, it is a story not to be forgotten.",
  "genres": [
    "History",
    "Espionage",
    "Nonfiction",
    "Germany",
    "European History",
    "War",
    "World History"
  ],
  "author": "David E. Murphy",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/372192.Battleground_Berlin"
}