{
  "title": "Jahrestage",
  "description": "Die Johnson-Forschung befindet sich seit jeher in einem Kaum ein Schriftsteller muss so hart darum kämpfen, dass seine fiktionale Prosa nicht gleichsam durch die ihr immanente Faktizität erdrückt wird. Eifrige Indiziensucher spüren Orte und Namen in Mecklenburg auf, wandeln auf den Spuren der Protagonistin Gesine Cresspahl durch New York, recherchieren in den Archiven alte Ausgaben der New York Times -- alles vor dem Hintergrund, Nachweisbares darzulegen. Hinzu kommt, dass dieser Ansatz von Johnson selbst in seinen Poetik-Vorlesungen thematisiert wird, habe er doch aus seinem Studium der deutschen Literatur \"eine Vorliebe für das Konkrete, eine geradezu parteiische Aufmerksamkeit für das, was man vorzeigen, nachweisen, erzählen kann\", mitgenommen. Vor diesem Hintergrund mag es kaum verwundern, dass sich die gebundene Ausgabe von 1983 eines Adressbuches erfreut und der jüngst erschienene Kommentar von Holger Helbig über 1.100 Seiten umfasst, die alles zu dokumentieren suchen. So wichtig diese Ansätze auch sein mögen, hier entsteht eine Gefahr, Johnson als Regionalschriftsteller (mit Augenmerk auf interkontinentale Beziehungen) zu missbrauchen. Kaum gerecht wird man damit jedoch diesem Werk, das 365 Tage aus dem Leben der Gesine Cresspahl und ihrer Tochter Marie erzählt. Doch diese Aufzeichnungen vom 21. August 1967 bis zum 20. August 1968 brauchen mehr an Raum und Es geht hier um deutsche Geschichte, um nazideutsche, westdeutsche, ostdeutsche und amerikanische Geschichte. Um zeitgeschichtliche Ereignisse, die ihrerseits in der New York Times berichtet werden -- also ohnehin schon vorgegeben sind. Doch hinter diesem Lauf der deutschen und der amerikanischen, der Weltgeschichte, verbergen sich Einzelschicksale, die das Personal des Romans darstellen. Es geht um die Interaktion dieser Subjekte mit dem Verlauf der Zeitgeschichte, deren Determiniertheit durch den sozialen Kontext, in dem sie sich befinden, dargelegt wird. Diese äußere Determination freilich kann nicht ohne Auswirkungen auf formale und strukturelle Merkmale dieses Romans So liest man eine Art Berichterstattung, gleichsam eine Geschichtsschreibung, die sich der Auswertung von Dokumenten, von Quellen verpflichtet hat. Diese auktoriale Erzählsituation steht antithetisch zu der subjektorientierten, die die Romanpersonen kennzeichnet. Hieraus ergibt sich etwas Genau wie die fiktiven Romanfiguren an die realen Gegebenheiten der Zeitgeschichte unausweichlich gebunden sind, ist auch der Erzähler dieser Situation (formal) ausgeliefert, er befindet sich in einer analogen Situation. Das verschafft der Lektüre einen doppelten Boden, der sich erhebt über eine Ebene der Prüfbarkeit von Faktizität. --Kristina Nenninger",
  "genres": [
    "Fiction",
    "German Literature",
    "Germany",
    "Classics",
    "Novels",
    "Literature",
    "Historical Fiction"
  ],
  "author": "Uwe Johnson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/372373.Jahrestage"
}