{
  "title": "Who's Who in Hell",
  "description": "Who's Who in Hell is a compelling, uproarious, and achingly moving story about what happens when our plans for life meet its plans for us. Written with a keen eye and enormous heart that call to mind David Schickler, Nick Hornby, and early Roddy Doyle, Who's Who in Hell is a novel with a voice all its own. Daniel Linnell is a charming, rather hapless young man until he meets Laura -- an unsettlingly feisty American who likes to parachute out of planes on weekends. Recently fired from a job as a relatively unskilled counselor for London's desperate, he meets Laura one night in a bar and quickly finds himself falling for her. At the same time, he finds a new job as an obituarist and is caught up in the day-to-day life of the oddballs who produce a major London daily newspaper. His editor, Whittington, a dyed-in-the-wool English eccentric, initiates him into the pecking order of obituarists vs. news reporters vs. the sports desk; the annual ritual of the drunken Obituaries Outing with all of the octogenarian history buffs who provide their research; and the secret cache of unexpurgated obits of the less-than-angelic, obits that will never see print -- which Whittington keeps in a hollowed-out book in his office. With Whittington's encouragement, Daniel begins to write a Who's Who in Hell -- a mammoth compendium of the evil and damned. Begun for his own amusement, the book takes on a momentum of its own and garners him a publisher's advance. He goes to Kansas to meet Laura's parents. Things are all going beautifully. But it's always then that things have a way of changing. Who's Who in Hell is a delightfully antic, deeply moving novel that captures the joys and agonies of love and the perverse deceptions and unanticipated highs and lows of life. It is sure to establish Robert Chalmers as one of the brightest young writers out of Britain.",
  "genres": [
    "Fiction",
    "Humor"
  ],
  "author": "Robert Chalmers",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/372112.Who_s_Who_in_Hell"
}