{
  "title": "Who the Hell's in It: Conversations With Hollywood's Legendary Actors",
  "description": "Peter Bogdanovich, known primarily as a director, film historian and critic, has been working with professional actors all his life. He started out as an actor (he debuted on the stage in his sixth-grade production of Finian’s Rainbow ); he watched actors work (he went to the theater every week from the age of thirteen and saw every important show on, or off, Broadway for the next decade); he studied acting, starting at sixteen, with Stella Adler (his work with her became the foundation for all he would ever do as an actor and a director).Now, in his new book, Who the Hell’s in It, Bogdanovich draws upon a lifetime of experience, observation and understanding of the art to write about the actors he came to know along the way; actors he admired from afar; actors he worked with, directed, befriended. Among Lauren Bacall, Humphrey Bogart, James Cagney, John Cassavetes, Charlie Chaplin, Montgomery Clift, Marlene Dietrich, Henry Fonda, Ben Gazzara, Audrey Hepburn, Boris Karloff, Dean Martin, Marilyn Monroe, River Phoenix, Sidney Poitier, Frank Sinatra, and James Stewart.Bogdanovich captures—in their words and his—their work, their individual styles, what made them who they were, what gave them their appeal and why they’ve continued to be America’s iconic actors.On Lillian “the first virgin hearth goddess of the screen . . . a valiant and courageous symbol of fortitude and love through all distress.”On Marlon “He challenged himself never to be the same from picture to picture, refusing to become the kind of film star the studio system had invented and thrived upon—the recognizable human commodity each new film was built around . . . The funny thing is that Brando’s charismatic screen persona was vividly apparent despite the multiplicity of his guises . . . Brando always remains recognizable, a star-actor in spite of himself. ”Jerry Lewis to Bogdanovich on the first laugh Lewis ever got “I was five years old. My mom and dad had a tux made—I worked in the borscht circuit with them—and I came out and I sang, ‘Brother, Can You Spare a Dime?’ the big hit at the time . . . It was 1931, and I stopped the show—naturally—a five-year-old in a tuxedo is not going to stop the show? And I took a bow and my foot slipped and hit one of the floodlights and it exploded and the smoke and the sound scared me so I started to cry. The audience laughed—they were hysterical . . . So I knew I had to get the rest of my laughs the rest of my life, breaking, sitting, falling, spinning.”John Wayne to Bogdanovich, on the early years of Wayne’s career when he was working as a prop “Well, I’ve naturally studied John Ford professionally as well as loving the man. Ever since the first time I walked down his set as a goose-herder in 1927. They needed somebody from the prop department to keep the geese from getting under a fake hill they had for Mother Machree at Fox. I’d been hired because Tom Mix wanted a box seat for the USC football games, and so they promised jobs to Don Williams and myself and a couple of the players. They buried us over in the properties department, and Mr. Ford’s need for a goose-herder just seemed to fit my pistol.”These twenty-six portraits and conversations are unsurpassed in their evocation of a certain kind of great movie star that has vanished. Bogdanovich’s book is a celebration and a farewell.",
  "genres": [
    "Film",
    "Nonfiction",
    "Media Tie In",
    "Biography",
    "History",
    "Memoir",
    "Americana"
  ],
  "author": "Peter Bogdanovich",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/372111.Who_the_Hell_s_in_It"
}