{
  "title": "When We Were Outlaws: A Memoir of Love and Revolution",
  "description": "A sweeping memoir, a raw and intimate chronicle of a young activist torn between conflicting personal longings and political goals. When We Were Outlaws offers a rare view of the life of a radical lesbian during the early cultural struggle for gay rights, Women’s Liberation, and the New Left of the 1970s. Brash and ambitious, activist Jeanne Córdova is living with one woman and falling in love with another, but her passionate beliefs tell her that her first duty is \"to the revolution”---to change the world and end discrimination against gays and lesbians. Trying to compartmentalize her sexual life, she becomes an investigative reporter for the famous, underground L.A. Free Press and finds herself involved with covering the Weather Underground and Angela Davis, exposing neo-Nazi bomber Captain Joe Tomassi, and befriending Emily Harris of the Symbionese Liberation Army. At the same time she is creating what will be the center of her revolutionary lesbian world: her own newsmagazine, The Lesbian Tide, destined to become the voice of the national lesbian feminist movement.By turns provocative and daringly honest, Cordova renders emblematic scenes of the era---ranging from strike protests to utopian music festivals, to underground meetings with radical fugitives---with period detail and evocative characters. For those who came of age in the 70s, and for those who weren’t around but still ask, \"What was it like?\", Outlaws takes you back to re-live it. It also offers insights about ethics, decision making and strategy, still relevant today.With an introduction by renowned lesbian historian Lillian Faderman, When We Were Outlaws paints a vivid portrait of activism and the search for self-identity, set against the turbulent landscape of multiple struggles for social change that swept hundreds of thousands of Americans into the streets.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Queer",
    "LGBT",
    "Feminism",
    "History",
    "Lesbian"
  ],
  "author": "Jeanne Cordova",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/12230940-when-we-were-outlaws"
}