{
  "title": "Moonlight Becomes You",
  "description": "In her thirteenth full-length novel -- her most chillingly suspenseful yet -- Mary Higgins Clark, \"America's Queen of Suspense,\" delivers a tale of brilliantly sustained terror. Set in Newport, Rhode Island, in a world of old money and proud names, \"Moonlight Becomes You\" has at its center Maggie Holloway, an independent young woman who has put personal tragedy behind her and become one of the fashion world's most successful photographers. Accompanying her date to a party in Manhattan -- a kind of family reunion for the Moore clan of Newport -- Maggie is reunited with a woman who had once been her stepmother and who remains one of her fondest childhood memories. Nuala Moore is equally thrilled to see Maggie, and the two quickly get beyond old pains and resume their friendship. Nuala, now widowed, invites Maggie to visit her in Newport, and when Maggie readily accepts, Nuala plans a dinner for a group of friends so they can meet her long-lost stepdaughter. But when Maggie arrives, she finds Nuala dead, the victim of an apparently random break-in and robbery. Maggie is heartbroken at the loss and further stunned when she learns that, only days before her death, Nuala had changed her will and left her charming Victorian house to her stepdaughter, the only proviso being that Maggie occasionally visit an old friend, Greta Shipley, who lives in Latham Manor, an elegant retirement home in Newport. It is when she accompanies Mrs. Shipley to the cemetery to visit Nuala's grave, as well as those of other friends Mrs. Shipley has recently lost, that Maggie discovers that something is wrong. Using her skills as a photographer to aid her in uncovering the secrets hidden on the gravesites, she soon realizes that Nuala's death may not have been a random killing at all but rather part of a diabolical plot conceived by a twisted and unfeeling mind. Suddenly it becomes all too apparent to Maggie that Nuala's killer must have been someone she trusted completely. Then, when Greta Shipley dies virtually without warning of supposedly natural causes, Maggie becomes convinced that there is a connection between these two and other recent deaths among the older women of Newport. What Maggie doesn't realize is that she has become a target for the killer as well and that each clue she uncovers brings her closer and closer to a shocking and unimaginable fate. With a sense of swiftly mounting danger, and with the skill and insight into human nature that have made all Mary Higgins Clark's books major bestsellers, \"Moonlight Becomes You\" is enthralling suspense.",
  "genres": [
    "Mystery",
    "Fiction",
    "Suspense",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Adult"
  ],
  "author": "Mary Higgins Clark",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/372106.Moonlight_Becomes_You"
}