{
  "title": "New Spring",
  "description": "The Wheel of Time is now an original series on Prime Video, starring Rosamund Pike as Moiraine!Since its debut in 1990, The Wheel of Time(R) by Robert Jordan has captivated millions of readers around the globe with its scope, originality, and compelling characters.The Wheel of Time turns and Ages come and go, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth returns again. In the Third Age, an Age of Prophecy, the World and Time themselves hang in the balance. What was, what will be, and what is, may yet fall under the Shadow.For three days battle has raged in the snow around the great city of Tar Valon. In the city, a Foretelling of the future is uttered. On the slopes of Dragonmount, the immense mountain that looms over the city, is born an infant prophesied to change the world. That child must be found before the forces of the Shadow have an opportunity to kill him.Moiraine Damodred, a young Accepted soon to be raised to Aes Sedai, and Lan Mandragoran, a soldier fighting in the battle, are set on paths that will bind their lives together. But those paths are filled with complications and dangers, for Moiraine, of the Royal House of Cairhien, whose king has just died, and Lan, considered the uncrowned king of a nation long dead, find their lives threatened by the plots of those seeking power.New Spring begins Moiraine and Lan's quest to find the Dragon Reborn that will lead to the events of The Eye of the World...and their fateful meeting with Rand al'Thor. New Spring is a perfect jumping-on point for fantasy readers wanting to know more about The Wheel of Time.The Wheel of Time(R)New Spring: The Novel#1 The Eye of the World#2 The Great Hunt#3 The Dragon Reborn#4 The Shadow Rising#5 The Fires of Heaven#6 Lord of Chaos#7 A Crown of Swords#8 The Path of Daggers#9 Winter's Heart#10 Crossroads of Twilight#11 Knife of DreamsBy Robert Jordan and Brandon Sanderson#12 The Gathering Storm#13 Towers of Midnight#14 A Memory of LightBy Robert Jordan and Teresa PattersonThe World of Robert Jordan's The Wheel of TimeBy Robert Jordan, Harriet McDougal, Alan Romanczuk, and Maria SimonsThe Wheel of Time CompanionBy Robert Jordan and Amy RomanczukPatterns of the Wheel: Coloring Art Based on Robert Jordan's The Wheel of Time",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Audiobook",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Adventure"
  ],
  "author": "Robert Jordan",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/372306.New_Spring"
}