{
  "title": "Perfect Just as You Are: Buddhist Practices on the Four Limitless Ones--Loving-Kindness, Compassion, Joy, and Equanimity",
  "description": "Spiritual practice, Pema Chödrön teaches, has nothing to do with self-improvement, since, as the course’s title claims, you’re already perfect right now. The limitless qualities of loving-kindness, compassion, joy, and equanimity are your deep-down, ultimate reality, and those are qualities that can’t be improved upon. If you’re not feeling particularly kind, compassionate, joyful, or equanimous at the moment, take heart: the Four Limitless Ones are there like seeds, waiting to be cultivated through practice—and, being limitless, they’re rich enough to be worked with for a lifetime.  This intensive program of study and practice provides the tools you need to access these radiant states and to nurture their growth for sake of all beings, including yourself.  Here’s some of what you’ll learn:    •  How cultivating the Four Limitless Ones is the antidote to depression, irritation, and isolation    •  Basic meditation instructions to get you started in the foundational practice    •  A wealth of guided meditations for generating these radiant qualities to yourself, others, and the world    •  Writing and reflection exercises to bring the Four Limitless Ones powerfully  into real life    •  A simple chant you can use to create love and good will around yourself    •  Powerful on-the-spot practices you can use throughout the day, even when there’s “no time to practice” Do the program at your own pace. It fits perfectly with any other kind of meditation you’re doing. And since no previous knowledge of Buddhism is required, it’s also ideal for those new to spiritual practice.  After you’ve completed the material in Perfect Just as You Are, you’ll want to listen to it again periodically–any time you need a refresher course in compassion, loving-kindness, equanimity, and joy.   8 CDs, 8 hours.",
  "genres": [
    "Buddhism",
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Audiobook"
  ],
  "author": "Pema Chödrön",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/3729171-perfect-just-as-you-are"
}