{
  "title": "Conquest and Empire: The Reign of Alexander the Great",
  "description": "The reign of Alexander the Great of Macedon (336-323 B.C.) witnessed the military conquest of the Persian Empire by the Macedonian army, the physical transit of the known world from the Danube to the Indus and the beginnings of the mass migration which was to expand the horizons of hellenism far into the Near East. In this book, Professor Bosworth attempts an up-to-date survey of the period in all its respects.This title reflects two main focuses: the process by which empire was acquired and the means by which the conquered territory was controlled, exploited and administered. The campaigns of Alexander in Europe and Asia are chronicled in detail in Part One. Although much of the emphasis of the book, thanks to Alexander-rented writers of antiquity, is on episodes where the king is protagonist, the discussion attempts to widen the perspective and examine the impact of the reign at all levels. There is a detailed account of the Greek mainland, explaining what Macedonian suzerainty implied and how the various city-states adapted to it, and a survey of the individual components of empire and the largely haphazard system of administration that evolved after conquest. The Macedonian army is examined in its role as the instrument of conquest, and its evolution during the reign is analyzed. Finally, there is an essay on the origins of the ruler cult. These more detailed thematic studies complement and enlarge upon the running narrative of campaigns and events, to present full coverage in breadth and depth.This is an unromanticised account of the reign of Alexander the Great, based firmly on the ancient sources. As such it will be particularly welcome yo students and teachers of ancient history. The careful account of the battles and campaigns will be of interest to military historians, and the whole book is written to be accessible to the general reader as well.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Greece",
    "Ancient History",
    "Ancient",
    "Academic"
  ],
  "author": "Albert Brian Bosworth",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/372995.Conquest_and_Empire"
}