{
  "title": "Munson: The Life and Death of a Yankee Captain",
  "description": "Our captain and leader has not left us, today, tomorrow, this year, next … Our endeavors will reflect our love and admiration for him.”—Honorary plaque to Munson in Yankee StadiumThurman Munson is remembered by fans as the fiercely competitive, tough, and—most of all—inspiring Yankee captain and champion from the wild Bronx Zoo years. He is also remembered for his tragic death, at age thirty-two, when the private plane he was piloting crashed in Canton, Ohio, on August 2, 1979.Munson is the intimate biography of a complex and larger-than-life legend. Written by former Yankees public relations director Marty Appel, who worked closely with Thurman throughout his career, Munson captures the little-known details of the young man from Canton and his meteoric rise to stardom in baseball’s most storied franchise. Appel examines the tumultuous childhood that led Thurman to work feverishly to escape Canton—and also the marriage and cultural roots that continually drew him back.Appel also opens a fascinating door on the famed Yankees of the 1970s, recounting moments and stories that have never been told before. From the clubhouse and the dugout to the front office and the owner’s box, this thoughtful baseball biography delves into the affectionately gruff captain’s relationships with friends, fans, and teammates such as Lou Piniella, Bobby Murcer, Graig Nettles, and Reggie Jackson, as well as his colorful dealings with manager Billy Martin and his surprisingly close bond with owner George Steinbrenner. Munson paints a revealing portrait of a private Yankee superstar, as well as a nostalgic and revelatory look at the culture—and amazing highs and lows—of the 1970s New York Yankees teams. More than a biography, Munson is the definitive account of a champion who has not been forgotten and of the era he helped define—written with the intimate detail available only to a true insider.www.doubleday.com",
  "genres": [
    "Baseball",
    "Sports",
    "Biography",
    "Nonfiction",
    "Biography Memoir"
  ],
  "author": "Marty Appel",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/3734055-munson"
}