{
  "title": "The Geometry of Sisters",
  "description": "What is one sister without the other? Is it even possible to imagine?New York Times bestselling author Luanne Rice explores the complex emotional equations of love and loyalty that hold together three pairs of remarkable sisters. Here in the halls of Newport Academy, a unique private school that has attracted generations of rebels, outcasts, and visionaries, an unforgettable lesson in the eternal truths of sisterhood is about to begin….After years away, Maura Shaw has returned to Newport, Rhode Island, to teach English at the academy. Behind her lies her life as the perfect Midwestern wife and mother, a life that seemed on the surface to be all she had ever wished for. That illusion vanished in a storm off Mackinac Island in the wake of an accident that engulfed Maura’s husband and her older daughter, Carrie. Now, with her son and younger daughter, she hopes to find a new beginning.Newport has never failed to infuse Maura with a sense of mystery and hope. But for fourteen-year-old Beck, the move is a painful upheaval from everything she has ever loved—especially her sister, Carrie. Ever since her sister disappeared, Beck has retreated into the world of mathematics, where principles are permanent, unlike so many other things in life. Without Carrie, Beck has lost half of herself—the half that would have fit in at the elite private school she and her brother, Travis, will now attend. The half that made things right. Still, Beck clings to the hope that her sister will return to them.Beck isn’t alone in her struggle to adjust. At sixteen, Travis is juggling a long-distance first love and an attraction to an expensive-looking girl with a wicked sparkle in her eye. And for Maura, ghosts linger here—an unresolved breach with her own beloved sister and a long-ago secret that may now have the power to set her free….Set against the breathtaking beauty of the New England coast at its most dramatic, populated by a cast of indelible characters, The Geometry of Sisters is Luanne Rice at her most compelling, a dazzling world to which readers will want to return again and again.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Family",
    "Contemporary",
    "Womens Fiction",
    "Audiobook"
  ],
  "author": "Luanne Rice",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/3733297-the-geometry-of-sisters"
}