{
  "title": "Chopping Spree",
  "description": "For Colorado caterer Goldy Schulz, business isn't just booming--it's skyrocketing. But as her friend Marla is constantly warning her, \"Success can kill you.\" Goldy knows she needs to slow down before she breaks down, and she vows she'll do it--right after her next booking: a cocktail party for the Westside Mall's Elite Shoppers Club.It's the event of the shopping season: the Princess Without a Pricetag party for the wealthy shopaholics who drop at least a thousand dollars a week at the mall. Goldy has been hired by charming mall manager Barry Dean to cater the jewel-encrusted affair. But she has hardly begun setting up when she finds herself in the path of a truck that has no intention of stopping until both she and Barry are crushed beneath it. Muddied, bruised, embarrassed, but determined to do her job, Goldy manages to get the party started on time with the help of her trusted assistants Julian Teller and Liz Fury.But with the outbreak of an ugly marital spat among the guests, the behavior of Barry's flighty young girlfriend, and Barry's own strange actions after the truck incident, the event is--by Goldy's standards--a catastrophe. And it's about to get worse. When she goes to pick up her check, she finds an old friend lying dead in a pile of sale shoes--stabbed with one of Goldy'snew knives. Hours later, Julian is the prime suspect in the murder.To prove Julian's innocence, Goldy must catch the real killer. But to do that, she will have to figure out why the victim was carrying a powerful narcotic. And why was a private investigator called in shortly before the murder? Was the killer connected to a mall renovation project--or the eviction of a disgruntled tenant? Or was the villain the odd lover out in a violent love triangle?Between whipping up Sweethearts' Swedish Meatballs, Quiche Me Quick, and Diamond Lovers' Hot Crab Dip, and digging up clues, Goldy knows this is going to be one tough case to crack. And her gourmet sleuth's instinct tells her that the final course will be a real killer.",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Cozy",
    "Mystery Thriller",
    "Food",
    "Audiobook"
  ],
  "author": "Diane Mott Davidson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/374166.Chopping_Spree"
}