{
  "title": "Destiny of Fire",
  "description": "It's easy to forget horror & reject its presence. There have been many attempts throughout history by one group to exterminate another but few have been so successful as that of the Catholic Church against Catharism. In Destiny of Fire, Zoe Oldenbourg recreates the era that saw the height & also the end of this thriving culture that had attained social dominance in what we think of as SW France by the early 13th-century.  The Cathars were a Christian sect that believed in an ongoing cosmic struggle between the realm of spirit, which was pure, & the realm of matter, which was corrupt. They rejected many worldly things, lived celibate non-materialistic lives of simplicity & had but one prayer: The Our Father. In their devotion to attaining communion with otherworldliness, Cathars defied the riches & regimentation of the Catholic Church.  In the Crusade declared against this religion, which at its height numbered into the hundreds of thousands & was spreading to all corners of Christendom, the Church promised riches & forgiveness of sins for any who rose up & slaughtered Cathars wherever they were to be found: men, women, children. The ensuing violence directed against these people makes for a tragic tale. Oldenbourg spares us no detail of the cruel savagery of the holocaust. Scarcely any of her many characters, Cathars of all ages & walks of life, escape tragic ends. She also does a superlative job of detailing exactly what they believed & how they exercised those beliefs in day-to-day existence. Her novel is a plausible & interesting picture of a time & locale in the Medieval world. If after reading Destiny of Fire, you find yourself wondering why it is this genocide of perhaps a million is so little known today, consider the explanation in the opening of this review, but also know that for centuries the Catholic Church imposed a gag order, that mandating that any mention of the Cathars must condemn them as heretical practitioners of anti-Christian evil, & any reference to the \"Holy War\" against them must be made in the form of praise at the righteousness of the Church's actions. Oldenbourg does history a fine service in writing this well-researched novel.--Ellie Reasoner (edited)",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "France"
  ],
  "author": "Zoé Oldenbourg",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/3735708-destiny-of-fire"
}