{
  "title": "Sticks and Scones",
  "description": "When the sound of broken glass shatters her sleep, Colorado caterer and meddling sleuth Goldy Schulz doesn't know what to think. Is it a gunshot? A bomb? An earthquake? And where the heck is her husband, Tom, when she needs him most? But Tom is away for the night, working a case for the Colorado police department. So Goldy's on her own and the timing couldn't be worse, with her first big gig in five weeks only a few hours away. The job is a huge Elizabethan banquet, a luncheon at a Gothic chapel on a grand old English estate owned by nouveau millionaires Eliot and Sukie Hyde. And in spite of the late-night scare at Goldy's home, it looks like she just might pull the lavish event off without a hitch-until she discovers a disfigured body floating face down in the creek that winds past the chapel. To make matters worse, the body belongs to Andy Balachek, an on-the-lam suspect who Tom's been looking for in connection to a stolen stamp ring. When Tom arrives on the scene and gets shot by a sniper, Goldy can't help but wonder: What else could possibly go wrong? She shouldn't have asked. Because with an angry ex-husband out of jail and out for revenge a ghost haunting Hyde Castle and stirring up one disaster after another at the worst possible moments two dissatisfied former clients determined to ruin her career and Tom keeping secrets about a beautiful mystery woman from his past, Goldy's got more on her plate than any caterer can handle-even an invincible caterer like Goldy! Bestselling author Diane Mott Davidson's got all the ingredients for a five-star mystery-including mouthwatering recipes for Castle Scones, Queen of Scots Shortbread, Damson-in-Distress Plum Tart, Shuttlecock Shrimp Curry and Shakespeare's Steak Pie-in this culinary whodunit, sure to satisfy her most discriminating fans.",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Cozy",
    "Mystery Thriller",
    "Cooking",
    "Food"
  ],
  "author": "Diane Mott Davidson",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/374162.Sticks_and_Scones"
}