{
  "title": "Emily Hobhouse and the British Concentration Camp Scandal: an Illustrated Exposé of the Treatment of Boer Women and Children During the South African War by One of its Most Vociferous Opponents",
  "description": "A fearless female champion for justice and humanityToday, the term ‘concentration camp’ is synonymous with the horrors perpetrated by Nazi Germany during the Second World War. Nevertheless, concentration camps were not a Nazi innovation, for the British created them during the Boer War in South Africa at the turn of the 19th and 20th centuries. In an attempt to apply pressure on men serving with Boer forces to capitulate, the British extensively burned Boer homesteads and farms, slaughtered their livestock, dispossessed families of their property and forcibly incarcerated women and children in concentration camps. Emily Hobhouse, a British woman born before her time, was a welfare campaigner, feminist and an activist for women’s suffrage. She was aware of the social injustice of the camps, and of the terrible conditions in them which resulted in widespread deprivation, hunger and death from disease among the inmates. Hobhouse made it her mission to bring these outrages to public awareness and worked tirelessly for improved conditions in the camps and, ultimately, for their abolition. She was the bane of the British authorities and an abiding heroine to the South African people. In this, her own book on the subject, she exposes a little known imperial scandal. It was originally published at the time of the war, under the title ‘The Brunt of the War and Where it Fell’. This Leonaur edition has been enhanced by the inclusion of many illustrations and photographs which were not included when the book was first published.Leonaur editions are newly typeset and are not facsimiles; each title is available in softcover and hardback with dustjacket; our hardbacks are cloth bound and feature gold foil lettering on their spines and fabric head and tail bands.",
  "genres": [],
  "author": "Emily Hobhouse",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/37358043-emily-hobhouse-and-the-british-concentration-camp-scandal"
}