{
  "title": "Tough Cookie",
  "description": "Fans of Diane Mott Davidson's Goldy Schulz, the gourmet gumshoe of Aspen Meadow, Colorado, love her modus operandi: \"Treat every puzzle with questions and chocolate.\" In Tough Cookie, Davidson's ninth culinary mystery, Goldy is waiting to reopen her catering business, which has been shut down by the health department for lack of adequate drains. She's got a PBS cooking gig for a few weeks, and is trying to build a reputation as a personal chef, but she's desperate for a little extra Christmas cash, so she agrees to sell a pair of vintage skis to Doug Portman, a local art critic and former sort-of-romantic interest.  When Portman's killed in a skiing accident at Killdeer Resort with Goldy nearby, the police treat her with suspicion. It turns out that Portman was the easily persuaded head of the Parole Board, and Goldy's ex-husband (a.k.a. The Jerk, who was imprisoned for domestic violence) is coming up for parole. But when Goldy herself narrowly escapes a chilly death after her van is forced off a snowy highway, she starts looking for connections and steps into a minefield of unsolved murders, including the three-year-old avalanche death of her friend Nate Bullock. There're a multitude of suspicious characters lurking around Killdeer: Barton Reed, a crazy ex-con who sent Portman a letter loaded with poison; Arthur Wakefield, whose wealthy mother was also killed in a skiing accident at Killdeer; Jack Gilkey, a handsome young chef who was convicted of manslaughter in the death of Wakefield's mother (and released by Portman); Boots Faraday, a local artist; and even Rorry Bullock, Nate's angry widow. As usual, Goldy manages to solve the murders (with the help of Chocolate Coma Cookies), save her own skin (just!), skewer a few local snobs in passing, and revive her catering business. Lots of fun, and recipes too. --Barrie Trinkle",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Cozy",
    "Mystery Thriller",
    "Food",
    "Culinary"
  ],
  "author": "Diane Mott Davidson",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/374148.Tough_Cookie"
}