{
  "title": "Die Fakultät",
  "description": "Ein Mann betritt ein verfallenes Gebäude, schleicht sich in den vierten Stock, stellt seine Schreibmaschine auf einen verstaubten Tisch und bringt eine Geschichte zu Papier. Er hatte nach mehreren Anläufen herausgefunden, \"dass ich nur hier anfangen konnte, die Wahrheit aufzuschreiben\". Und er weiß auch, \"Nicht die Mörder, die Überlebenden sind es, die an den Ort des Verbrechens zurückkehren.\" Als Esteban Miró dieses Gebäude zum ersten Mal betritt, hat das einen ausgesprochen unspektakulären Grund -- er muss Geld verdienen. Seine Mutter hat ihm eine untergeordnete Stelle am Institut für Nationale Literatur vermittelt, wo er einen Professor Emiliano Conde bei der Arbeit unterstützen soll. Conde entpuppt sich als manischer Anhänger von Homero Brocca. Von diesem Schriftsteller existiert nur eine Erzählung, diese allerdings in zahllosen Fassungen unterschiedlichsten Inhalts. Darüber hinaus behauptet Conde, von Brocca zwei Romane gelesen zu haben, die inzwischen verschollen seien. Bald wird Miró auch mit zwei weiteren Brocca-Forschern konfrontiert, die ihn bestürmen, ihnen dabei zu helfen, Broccas Werk vor dem böswilligen Zugriff von Conde zu schützen. Höhepunkt dieser Verschwörung, der sich Miró nur widerwillig anschließt, ist eine Expedition in den vierten Stock des Fakultätsgebäudes. Dort lagern unsortierte Massen schimmeliger Manuskripte und Bücher, und dort kommt es auch zur ersten einer ganzen Serie von Bluttaten. Verzweifelt versucht Miró, dieser Welt intellektueller Wahnvorstellungen zu entfliehen. Noch deutlicher als in seinem Roman Die Übersetzung verwischt Pablo De Santis im vorliegenden Buch die Grenzen zwischen Fantasie und Wirklichkeit. Er treibt ein meisterhaftes Verwirrspiel mit den Erwartungen der Leser, das einerseits der Tradition des klassischen englischen Kriminalromans, andererseits dem Magischen Realismus Südamerikas verpflichtet ist -- mit einem ordentlichen Schuss US-amerikanischer Agatha Christie reicht Borges die Hände, während Philip K. Dick ängstlich lächelnd zusieht -- ein kurzes, brillantes Romanfeuerwerk! --Hannes Riffel",
  "genres": [
    "Fiction",
    "Mystery",
    "Crime",
    "Books About Books",
    "Novels"
  ],
  "author": "Pablo De Santis",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/3744502-die-fakult-t"
}