{
  "title": "The World Rushed in: The California Gold Rush Experience",
  "description": "Holliday, J.S. The World Rushed In. The California Gold Rush Experience. An Eyewitness Account of a Nation Heading West. New York, A Touchstone Book, 1981. 23 cm x 15 cm. 559 pages. With several black-and-white pictures and illustrations. Original Softcover. Good condition. Front bottom cover has slight folded corner. Exlibris of owner on front pastedown as well as written name. Includes for example the following Opening page of Swain's Diary, April 11 / Steamer Arrow / Chimney Rock / Rabbbit Hole Wells etc etc. Jaquelin Smith Holliday II (Indianapolis, Indiana, 10 June 1924 — Carmel, California, 31 August 2006) was an American historian. Holliday wrote a masterly history of the California Gold Rush that capped three decades of painstaking research on the era. Holliday's The World Rushed The California Gold Rush Experience, first published in 1981, is noteworthy for its innovative narrative style that blends scholarly commentary and analysis with words of the miners themselves and their families. Kevin Starr, a California historian and former state librarian, describes Holliday as a pioneer of the docudrama narrative. Documentarian Ken Burns featured Holliday in his PBS series The West, and once said no one writes better about California's irresistible past. Holliday's narrative drew heavily from the diaries and correspondence of William Swain, a farmer in Youngstown, New York who made a seven-month trek to California in 1849. Swain penned detailed accounts of his transcontinental journey. Holliday was introduced to Swain's writings during his final year at Yale University. Ed Eberstadt, a dealer in rare books, showed Holliday Swain's diary, which was part of the Yale collection. Eberstadt emphasized that it was the most important diary of the Gold Rush, but Holliday initially wasn't impressed with Swain's journals. After reading diaries left by other 49'ers, Holliday realized the ..",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Westerns",
    "Research"
  ],
  "author": "J.S. Holliday",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/3742583-the-world-rushed-in"
}