{
  "title": "GURL Please: A reformed people pleasers guide to finding your voice",
  "description": "You Are Enough Has anyone every told you that you are enough? That the person you are today, including your flaws and weaknesses is enough? That if you never changed anything about yourself, you would be enough? Ya, me neither. There are so many voices out there telling us we should be better, different, fix our flaws. But no one is telling us that we are great. We are not being shown that our inherent strengths ARE our glory. Instead we are taught to adhere to a set of values and women... be thinner, prettier, always happy, easy going... and for gods sake, don't make waves! We are subtly and overtly shamed for not fitting a mold; societies mold, our familial mold or even our gender mold. And so we fight. We fight against ourselves. We hate the mold, and try to not feel bad that we don't fit... but we still feel bad. We try to make ourselves more amenable somehow to our mold makers. And yet inside we are mad that we have to do this at all. We really just want someone to tell us that we are okay just as we are. That who we are, when you strip us down to our unique core, is awesome, loveable, awesome. We want to stop feeling bad about the ways in which we don't measure up. We want to feel PEACE. Feel at ease in our own skin, with nothing to prove and no one to please. Just complete and total peace. This book GURL Please, is a set of tools on how to find that peace. How to embrace the glory of who you already are. How to shed the mold others have placed upon you. How to embrace and build the life that you truly want. Not by buying into more false bullshit, but rather by letting your true self shine. Letting YOU be YOU. Giving yourself permission to be all that you are.. good, bad and everyting in-between. Giving yourself permission to love your strengths. Giving yourself permission to no longer judge your flaws. (thats a big one... but it's doable...i promise) This book is a guide on how to actually give yourself that permission. It will give specific tools on how embrace the glory of who you are versus who you have been told to be. It will help you easily identify and let go the fears that are currently holding you back. And most importantly, it will give you full permission to stop judging yourself! I believe whole heartedly that YOUR life gets to be what you want. There is a foundational truth to be Your life is YOURS. No one elses to experience, just yours and yours alone. No one else is walking in your shoes. No one else will ever be inside your head or you heart. You are the only one truly experiencing YOUR life. So what do YOU want it to be? What do YOU want it to look and feel like? Imagine what it would feel like to be at peace with yourself, or to take it even further, to actually LIKE yourself? How would it feel to enjoy your life all of the time? To genuinely like the people in your life, get fulfillment from your work, be in love with your family? Can you imagine it, awesome right? you have the power to GIFT yourself the life that you want. You have the power to change direction at any time. GURL Please is a practical guide on how to actually do all of that and a little bit more. You can allow the glory of who you already are to shine, you only have to choose it. Your joy, peace and power are on the other side of that choice, So what are you waiting for?",
  "genres": [
    "Self Help"
  ],
  "author": "Katie Hulbert",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/37458440-gurl-please"
}