{
  "title": "The Dance of Change: The challenges to sustaining momentum in a learning organization",
  "description": "Since Peter Senge published his groundbreaking book The Fifth Discipline , he and his associates have frequently been asked by the business \"How do we go beyond the first steps of corporate change? How do we sustain momentum?\" They know that companies and organizations cannot thrive today without learning to adapt their attitudes and practices. But companies that establish change initiatives discover, after initial success, that even the most promising efforts to transform or revitalize organizations—despite interest, resources, and compelling business results—can fail to sustain themselves over time. That's because organizations have complex, well-developed immune systems, aimed at preserving the status quo.Now, drawing upon new theories about leadership and the long-term success of change initiatives, and based upon twenty-five yearsof experience building learning organizations, the authors of The Fifth Discipline Fieldbook show how to accelerate success and avoid the obstacles that can stall momentum. The Dance of Change , written for managers and executives at every level of an organization, reveals how business leaders can work together to anticipate the challenges that profound change will ultimately force the organization to face. Then, in a down-to-earth and compellingly clear format, readers will learn how to build the personal and organizational capabilities needed to meet those challenges.These challenges are not imposed from the outside; they are the product of assumptions and practices that people take for granted—an inherent, natural part of the processes of change. And they can stop innovation cold, unless managers at all levels learn to anticipate them and recognize the hidden rewards in each challenge, and the potential to spur further growth. Within the frequently encountered challenge of \"Not Enough Time,\" for example—the lack of control over time available for innovation and learning initiatives—lies a valuable opportunity to reframe the way people organize their workplaces.This book identifies universal challenges that organizations ultimately find themselves confronting, including the challenge of \"Fear and Anxiety\"; the need to diffuse learning across organizational boundaries; the ways in which assumptions built in to corporate measurement systems can handcuff learning initiatives; and the almost unavoidable misunderstandings between \"true believers\" and nonbelievers in a company.Filled with individual and team exercises, in-depth accounts of sustaining learning initiatives by managers and leaders in the field, and well-tested practical advice, The Dance of Change provides an insider's perspective on implementing learning and change initiatives at such corporations as British Petroleum, Chrysler, Dupont, Ford, General Electric, Harley-Davidson, Hewlett-Packard, Mitsubishi Electric, Royal DutchShell, Shell Oil Company, Toyota, the United States Army, and Xerox. It offers crucial advice for line-level managers, executive leaders, internal networkers, educators, and others who are struggling to put change initiatives into practice.",
  "genres": [
    "Business",
    "Management",
    "Leadership",
    "Nonfiction",
    "Education",
    "Historical Romance",
    "Cultural"
  ],
  "author": "Peter M. Senge",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/37496.The_Dance_of_Change"
}