{
  "title": "When the Center Held: Gerald Ford and the Rescue of the American Presidency",
  "description": "“A personal look behind the scenes” (Publishers Weekly) of the presidency of Gerald Ford as seen through the eyes of Donald Rumsfeld—New York Times bestselling author and Ford’s former Secretary of Defense, Chief of Staff, and longtime personal confidant.In the wake of Richard Nixon’s Watergate scandal, it seemed the United States was coming apart. America had experienced a decade of horrifying assassinations; the unprecedented resignation of first a vice president and then a president of the United States; intense cultural and social change; and a new mood of cynicism sweeping the country—a mood that, in some ways, lingers today. Into that divided atmosphere stepped an unexpected, unelected, and largely unknown American—Gerald R. Ford. In contrast to every other individual who had ever occupied the Oval Office, he had never appeared on any ballot either for the presidency or the vice presidency. Ford simply and humbly performed his duty to the best of his considerable ability. By the end of his 895 days as president, he would in fact have restored balance to our country, steadied the ship of state, and led his fellow Americans out of the national trauma of Watergate. And yet, Gerald Ford remains one of the least studied and least understood individuals to have held the office of the President of the United States. In turn, his legacy also remains severely underappreciated. In When the Center Held, Ford’s Secretary of Defense Donald Rumsfeld candidly shares his personal observations of the man himself, providing a sweeping examination of his crucial years in office. It is a rare and fascinating look behind the closed doors of the Oval Office, including never-before-seen photos, memos, and anecdotes, from a unique insider’s perspective—“engrossing and informative” (Kirkus Reviews) reading for any fan of presidential history.",
  "genres": [
    "History",
    "Politics",
    "Biography",
    "Presidents",
    "Nonfiction",
    "American History",
    "Us Presidents"
  ],
  "author": "Donald Rumsfeld",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/37490872-when-the-center-held"
}