{
  "title": "Get Up and Walk!",
  "description": "I know what it's like to be so broken that getting out of bed is a chore. I know what it's like to be so sick that you don't know if you are going to live and you're scared. I know what it's like to just about lose all hope, when suddenly, something happens. Something so amazing, that it takes a moment to realize you just experienced a genuine miracle.My name is Jewels, and I want to share my story with you. I want to tell you how Jesus made it possible for me to Get up and Walk when I didn't think I could go on anymore. When I was overwhelmed with life, and thought I would drown, He took my hand in His, and enabled me to Get up and Walk!Are you Tired? Are you Broken? Are you Sick? Is your life like a roller coaster that you just want off of? It's time to Get Up and Walk! Praise for Get Up and Walk!\"When Julie recently shared her story at a church All-Daughter Dinner, hardly an eye was dry as the heart-wrenching events of the past several years were told in song and word. It was one of the most meaningful programs I've witnessed in many years.\" -Rose, Musician/Author \"Jewels' ministry is to hurting people, bringing hope to them. She has a strong testimony about God's ability to bring people through difficult times. Julie is also a wonderful singer, and her presentation features the style alternating songs and testimonies, make an interesting approach to sharing her message. One cannot help but be encouraged by Julie's ministry.\" -Pat Gerig, First Lady, Bolivar Wesleyan Church, OH \"[Jewels] is a woman with a mission, to share what God has put upon her heart.\" -Randy and Judy Rucker \"Jewels' testimony is very refreshing. Her strength and her love for God, her husband and children have kept her going even when the going was life threatening. Julie's message is very powerful and should be heard by all!\" -Gail Woodard, Wesleyan Pastor/Chaplain's Wife \"After meeting Julie through an online triplet group I was so excited to hear her speak to my MOPS group. Even though I'd heard most or all of what she had to say before she still had me laughing and crying right along with her. God has brought this family through many trials but they are still singing His glory. Julie's testimony is awesome and the way she shares what God puts on her heart is truly anointed.\" -Heather Fraley \"[Jewels]... has felt the call to share her testimony with as many people as possible for some time now. Only recently has God given her the 'go ahead'. As she shares her amazing testimony, she also sings songs relevant to the topics she is talking about!\" -Lynn Minner",
  "genres": [],
  "author": "Jewels Staiger",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/10227157-get-up-and-walk"
}