{
  "title": "The Uprooted: A Hitler Legacy",
  "description": "While much information exists on the dramatic fate of concentration camp victims, little is available about the Jewish men, women, and children who managed to escape before Hitler implemented mass executions and the death camps. The Uprooted: A Hitler Legacy is an extraordinary work featuring the stories of 190 escapees, lived through their own eyes and compellingly recollected in their own words. Dorit Bader Whiteman, a clinical psychologist and a refugee herself, depicts the experiences of these escapees: the persecution by citizens and officials; the abrupt confiscation of personal possessions; the raids and arrests; the quest to save the children; the dangers and fortuities in escape and resettlement; and the lasting emotional consequences of these experiences. By the end of the 1930s, European Jews fled to countries worldwide in search of a haven, among them England, Sweden, Turkey, South Africa, Argentina, Australia, Canada, and the United States. One of the most moving accounts is that of the Kindertransport of 10,000 Jewish children in 1939 from Nazi-occupied countries to Great Britain in trains so crowded that the smaller children had to be placed in luggage racks above the seats. Dr. Whiteman illustrates the spectrum of foster homes, ranging from the compassionate to the injurious, in which the Kinder, separated from their parents, were placed. It is equally poignant to read of the adult refugees who struggled to resettle in a new land unable to speak the language, without appropriate skills or education, without money or contacts, and filled with uncertainty over the fate of family and friends. The author provides important psychological insights into how these experiences have left the escapees to this very day with strength and with pain. The Uprooted, a landmark testament to the courage and resilience of this unstudied population, will be compelling reading for the lay person, as well as social scientists and historians, and for the survivors and",
  "genres": [
    "History",
    "Holocaust",
    "Nonfiction"
  ],
  "author": "Dorit Bader Whiteman",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/3747893-the-uprooted"
}