{
  "title": "Nana",
  "description": "Nana, by Emile Zola, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. One of the founders of literary naturalism, Émile Zola thought of his novels as a form of scientific research into the effects of heredity and environment. He created characters, gave them richly detailed histories, and placed them in carefully observed, precisely described environments, and his readers watch as they wriggle and thrash toward their inevitable destinies. In Nana, the characters are a prostitute, who rises from the streets to become what Zola calls a “high-class cocotte,” and the men—and women—whom she loves, betrays, and destroys. Among the novel’s many ironies is the mutual envy felt by Nana and those around her. She yearns for their material possessions, while they admire her apparent independence and sexual self-confidence. And despite the chaos Nana causes, Zola imagines her as being essentially “good-natured,” a stupid, vain but beautiful creature who can’t help drawing people into her web. Not surprisingly, Nana’s portrait of a decadent world in which a prostitute amasses great wealth and power provoked protests from “polite society,” and it became one of Zola’s most controversial works. Today it is regarded as his masterpiece. Luc Sante is the author of Low Life, Evidence, and The Factory of Facts and coeditor, with Melissa Holbrook Pierson, of O.K. You Mugs: Writers on Movie Actors.",
  "genres": [
    "Classics",
    "Fiction",
    "France",
    "French Literature",
    "19th Century",
    "Literature",
    "Historical Fiction"
  ],
  "author": "Émile Zola",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/374784.Nana"
}