{
  "title": "Blast from the Past",
  "description": "Now, in Blast from the Past, nationally bestselling author Kinky Friedman has searched his failing memory and has come up with a novel about his early days in New York City and how Kinky Friedman, the down-and-out star-crossed country music performer, became Kinky Friedman, the down-and-out star-crossed ace detective. In this prequel to his earlier novels, one which gives new meaning to the term retro, Kinkster fans are given the definitive answer to two of literature's great burning questions: Where the hell did those weird characters come from anyway? And what about that puppet head? Of course, it's not just Kinky himself who gets retroed, but all the Village Irregulars as well -- Ratso, Rambam, and McGovern -- who are glimpsed in the nascent stage, as is the ever-luscious Stephanie DuPont, who blasts upon the scene as a five-year-old nymphet in patent-leather spikes. Imagine it's the '70s. Imagine the Lone Star Cafe is still alive and well. Imagine that it's still okay to do drugs, still okay to have unprotected sex, still okay to paddle a brat and spank a monkey. And imagine you are there, in the '70s, at the Lone Star, sipping a brew with the Kinkster, a much younger, even kinkier Kinky -- uncouth, unshaped, unrepentant, and frequently unconscious. But lest you think that Blast from the Past is all nostalgia, be assured that Kinky has supplied a bang-up plot as well, much of which revolves around the mystery of who this guy Tim is who Judy exclaims about while being hosed by Kinky, and the question of whether or not the Feds have found Abbie Hoffman, who has been playing hide-and-seek in Ratso's apartment. Or something like that. As always, it's great, unpredictable fun from a true original, whose Irreverent, bawdy and often outrageous adventures are like no others, as says The San Diego Union-Tribune.",
  "genres": [
    "Fiction",
    "Mystery",
    "Humor",
    "Noir",
    "Crime",
    "Collections",
    "Mystery Thriller"
  ],
  "author": "Kinky Friedman",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/374647.Blast_from_the_Past"
}