{
  "title": "Acorn Foraging: Everything You Need to Know to Harvest One of Autumn's Best Wild Edible Foods, with Recipes, Photographs and Step-by-Step Instructions",
  "description": "Acorns are one of the healthiest, tastiest and most versatile foods you can eat, and were once a mainstay of diets throughout the world. These nutritious nuts can be used as a fabulous gluten-free flour in breads and baked goods of all types, a fantastic base for sweet dishes or non-dairy milks, a grain-free hot cereal, a delicious coffee substitute or a protein in main dishes—in addition to hundreds of other delicious uses. You can't get much more paleo than acorns. People were eating acorns long before they began cultivating grains. They make a delicious grain-free flour but are also great for vegans and vegetarians, since acorns provide a complete protein and make truly delectable \"meatballs\" and other savory dishes. You can even soak and blend dried acorns and make a rich, nutty non-dairy milk or cream from them. Roasted acorns create robust flavored dishes, while dried acorn flour has a more buttery, almost caramel-like flavor. When dried acorns are ground into a coarse meal, they cook up similar to corn meal. When ground fine, they work as a great gluten-free flour. When they're not roasted or dried, the chopped or whole acorns are similar in texture to garbanzo beans with a nutty flavor. Roasted nuts can be stored whole and then ground as flour when needed, or soaked and used the way you would dried beans. So why doesn't everybody still eat acorns? Like so much else, the knowledge has been lost to many over time. Acorns contain bitter tannins that must be leached out before you can cook with them. The good news is that it's easy to do and there are several great ways to do this that produce acorns and acorn flour with different flavors and uses (all covered in the book with details and pictures). In this comprehensive book, you'll learn the history and nutritional benefits of acorns, plus how to: • Find acorns; • Easily sort out the good from the bad; • Process your acorns in a variety of ways; • Make acorn flour and meal; • Store acorns and acorn flour so they stay fresh; • Cook over 70 delicious sweet and savory recipes for acorn pancakes, donuts, drinks, soup, meatballs, fritters, stuffing, ice cream, cookies and much more. Acorns are a sustainable, healthy, delicious food source right under our feet. Now you can learn how to easily forage your own acorns and use them in all kinds of wonderful ways.",
  "genres": [
    "Nonfiction",
    "Cookbooks"
  ],
  "author": "Alicia Bayer",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/37482333-acorn-foraging"
}