{
  "title": "Exit Lines",
  "description": "The Idyll Inn, the setting for Joan Barfoot’s brilliant eleventh novel, Exit Lines , is a pastel-hued care facility designed for seniors “with healthy incomes but varying hopes, despairs, abilities and deformities.” In scathing detail, Barfoot describes the Idyll Inn’s plastic plants, inoffensive art and pallid recreational activities, all familiar to any reader who has had occasion to visit such a place — or to live in one. Running the show (or so she thinks) is priggish administrator Annabelle Walker, charged with keeping the residents happy, or at least as happy as is required to keep a tidy profit flowing to far-away investors.But not all residents of the Idyll Inn choose to acquiesce. Sylvia Lodge, one of the Idyll Inn’s first residents, prides herself on her steely backbone, despite crippling arthritis. Affluently widowed, she has selected the Idyll Inn as a less objectionable alternative to a perilous dwindling at home. She coolly refuses to be bossed, certainly not by Annabelle Walker (about whose family Sylvia keeps a dark secret), or by her estranged daughter, Nancy, from whom she keeps yet another, even more explosive, secret. Sylvia is determined to unapologetically lay claim to her lifetime of choices, responsibilities and blame, not yet aware that her icy solitude will shortly be broken by the company of three soon-to-be-intimate friends.Given the facility’s small population, the Idyll Inn’s new inhabitants are bound to have crossed paths. And indeed many have. Wheelchair-confined George Hammond, once a handsome shoe store—owner with a stay-at-home wife and adored daughter, long ago cupped Sylvia’s feet in his hands and admired her well-formed calves. He has done far more with Greta Bauer, his former clerk, whose loneliness as a young immigrant widow with children rendered her available for a comfortable and seemingly uncomplicated affair. Now deposited under the same roof by absent children, the former lovers are in a position to reflect on the consequences of their choices.Completing the newly formed coterie of friends is tiny Ruth Friedman, a retired Children’s Aid worker who keeps many of the city’s darkest secrets, and whose passionate late-in-life marriage to fellow social worker Bernard did not include children of their own. Now also widowed, her grief unfathomably deep, she has taken to cheerfully reading horrifying news stories aloud to her new friends, who are soon to discover that these daily doses of gloom are less for their edification than they are in service of a desperate project for which Ruth needs their complicity.In the wryly funny and wholly compassionate Exit Lines , acclaimed author Joan Barfoot once again treats her readers to an intimate encounter with some fascinating characters engaged in the fight of their lives. Sylvia, George, Greta and Ruth are at times tender, angry, hilarious and deeply flawed, but always utterly and captivatingly human. How do we treat the elderly in our lives? How do we intend to grow old ourselves? Will we ever come to the end of longing? Exit Lines brings to the surface these and other fundamental questions about the nature of life, and its closing.",
  "genres": [
    "Canada",
    "Fiction",
    "Book Club",
    "Humor",
    "Contemporary",
    "Friendship"
  ],
  "author": "Joan Barfoot",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/3747242-exit-lines"
}