{
  "title": "Sanctuary: A Tale of Life in the Woods",
  "description": "\"It may not have been - how could it have been - the very last forest. But to all the creatures who lived there....\" Like a shaman, Monette, the novelist, poet, essayist, AIDS activist and National Book Award winner (Becoming a Man) who died of AIDS in 1995, creates a magic space within this animal fable, which resonates with wisdom and grace. This posthumous offering is an amazingly tender parable of same-sex love full of political overtones sounding Monette's lifelong themes of social justice, the need for tolerance of diversity and the fluid nature of sexual selves. The romantic love that blossoms between Renarda the Fox and Lapine the Rabbit is doubly wrong in the eyes of the dictatorial Great Horned Owl who presides over their forest realm - wrong because it's interspecies and because it's between two females. The Owl (not a wise bird here) commands all the forest creatures to spy on one another and to report any \"differentness.\" By splitting up the forest's denizens into two races, First Ones and second-class \"refugees\" the Owl sows antagonism and fear, fostering a network of spies and snitches. The lovers, once discovered, are charged with \"crimes against nature,\" arrested and banished to separate rehabilitation camps, until a bumbling apprentice wizard, Albertus the Lesser, exposes the Owl as an impostor and transforms the forest into a haven of tolerance and love. Monette's complex, quicksilver prose aims at the heart and never misses. His entrancing tale is illustrated throughout with luminous, spectral pictures that enhance the moonlit aura of enchantment. (Publisher's Weekly.)In a fairy tale that captures the strangeness of society's rules and the liberating nature of love, the Great Horned Owl sets his intolerant agenda for the forest.",
  "genres": [
    "Fantasy",
    "Fiction",
    "LGBT",
    "Queer",
    "Fairy Tales",
    "Animals",
    "Gay"
  ],
  "author": "Paul Monette",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/374833.Sanctuary"
}