{
  "title": "Gaining Ground: A History of Landmaking in Boston",
  "description": "Why and how Boston was transformed by landmaking. Fully one-sixth of Boston is built on made land. Although other waterfront cities also have substantial areas that are built on fill, Boston probably has more than any city in North America. In Gaining Ground historian Nancy Seasholes has given us the first complete account of when, why, and how this land was created.The story of landmaking in Boston is presented geographically; each chapter traces landmaking in a different part of the city from its first permanent settlement to the present. Seasholes introduces findings from recent archaeological investigations in Boston, and relates landmaking to the major historical developments that shaped it. At the beginning of the nineteenth century, landmaking in Boston was spurred by the rapid growth that resulted from the burgeoning China trade. The influx of Irish immigrants in the mid-nineteenth century prompted several large projects to create residential land -- not for the Irish, but to keep the taxpaying Yankees from fleeing to the suburbs. Many landmaking projects were undertaken to cover tidal flats that had been polluted by raw sewage discharged directly onto them, removing the \"pestilential exhalations\" thought to cause illness. Land was also added for port developments, public parks, and transportation facilities, including the largest landmaking project of all, the airport. A separate chapter discusses the technology of landmaking in Boston, explaining the basic method used to make land and the changes in its various components over time. The book is copiously illustrated with maps that show the original shoreline in relation to today's streets, details from historical maps that trace the progress of landmaking, and historical drawings and photographs.",
  "genres": [
    "History",
    "Nonfiction",
    "Urban Planning",
    "Urban Studies"
  ],
  "author": "Nancy S. Seasholes",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/374742.Gaining_Ground"
}