{
  "title": "Elements of Desire",
  "description": "WARNING: This is the final book in a sexy, steamy, over-the-top paranormal romance, reverse harem series! It includes detailed sex scenes (and lots of them), terrible plumbing puns, and is best enjoyed with a glass of wine and a sense of humor.  Seven dysfunctional, supernatural spouses. One jealous, psychotic childhood friend. A match … made in deception?  My name is Arizona Smoke, and I’m the fated soul mate to six elemental dragons. Or, at least I thought I was. We even got married--big white dress, custom suits for my beaus, crazy mother-in-law--but now there’s this girl who claims that she is their rightful soul mate.  At first, I hated the hunky assholes who’d dropped into my life unannounced, flipped my world upside down, and dragged me into supernatural society kicking and screaming. But now? I’m starting to fall for them, all six of them. I mean, I’d taken the plunge and walked the aisle for these guys, hadn’t I? But this girl--Gemma--she wants my guys to be hers.  Fate must hate me because I’ve got more than just relationship drama to deal with: my biological parents still want me dead, the kidnapped spirit elementals are still missing, and I’m pretty sure my best friend is trying to kill me. As if that wasn’t enough, someone’s raided my inherited wine cellar and all the booze has gone missing!  I'm Ari Smoke, blushing (hah) bride, nymphomaniac, and royally pissed off. Being married to six elemental studs is nice … but wondering if I get to keep them, not so much.  ELEMENTS OF DESIRE is a full-length comedic paranormal, reverse harem romance. This means our leading lady has six male love interests and doesn't have to choose between them. This book is full of steamy sex, ridiculous plumbing puns, and heaps of action, intrigue, and ... well, more puns. This is book 3 of 3--the final book in the series!",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Magic",
    "Paranormal Romance",
    "Shapeshifters"
  ],
  "author": "Tate James",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/37482139-elements-of-desire"
}