{
  "title": "Me, My Dog, and a Sheep",
  "description": "Me, My Dog, and a Sheep by Melissa MullamphyYour mental strength, drive, and attitude are as important, if not more, than your physical effort when you face a challenge. You cannot choose what happens to you, but you can choose how you handle it. In this story, a close family deals with a dilemma with love, the support of caring professionals, and a big-hearted dog who did NOT GIVE UP.This book is dedicated to my son, Luke, who learned how to be selfless, compassionate, helpful, and strong at the age of six--with a can-do attitude and a special love for his dog, Grizzy.Grizzy, a disarmingly good-natured puppy--as large as a house with a spirit to match--is suddenly struck with an immobilizing illness. Luckily, this hefty hound has a best buddy, Luke, a tender-hearted boy who will not let Grizzy give up the fight. Together, with the aid of caring veterinary professionals and Luke's attentive parents, Grizzy digs deep to fi nd the grit to fight the odds and withstand the challenges of recovery.Author Melissa Mullamphy tackles a tough subject--when a beloved pet is diagnosed with a life-threatening disease--with charm, humor, and genuine insight as expressed through the eyes of her sensitive son, Luke. Grizzy, no ordinary dog, and Luke, his compassionate sidekick, are portrayed as kindred spirits in Me, My Dog, and a Sheep. At once poignant, authentic, and energizing, Mullamphy's tale will connect with pet lovers--old and young alike--as powerfully and eternally as the bond between a boy and his dog.About the AuthorMelissa Mullamphy was born in Westchester County, New York. She earned a master's degree in counseling and psychology from Marist College. For over twenty years, she worked in the reinsurance industry. In addition, she was employed by various hospitals and involved with many charities. Melissa married her high-school sweetheart, Anthony, in 1992 while he was serving in the United States Marine Corps. Their life together always included animals, the same as when they were children. They spoiled them all and considered their pets, family. In 2009, Melissa and Anthony were blessed with a miracle baby boy, Luke. This year they celebrate their twenty-fifth wedding anniversary. Melissa, retired now, enjoys raising their wonderful little boy--the light of her eyes--and caring for their animal family, including (as you will learn in this story) a special dog that did not give up.",
  "genres": [],
  "author": "Melissa Mullamphy",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/37509930-me-my-dog-and-a-sheep"
}