{
  "title": "جبانة الأجانب",
  "description": "(جبّانة الأجانب)، هو اسم المجموعة القصصية التي سنتحدث عنها.. طرأت الفكرة، في عقل د.إيمان الدواخلي، أثناء ندوة أقامها منتدى التكية الأدبي تحت عنوان (أدب الإنترنت)، وكانت الفكرة هي: لماذا لا نقوم بعمل مسابقة لإحياء تراثنا من الخيال القديم؟.. كان هذا لأن الندوة تحوّلت فجأة للحديث، عن أدب الرعب، والخيال العلمي، والفانتازيا، ومشاكل أدب الواقع الإفتراضي الحالية.. وافق الجميع على الفور، وأعلن الجميع عن ا...ستعدادهم للمشاركة، وحماسهم للفكرة، وفي ذلك اليوم، شحذ الجميع أقلامهم، واخترقوا الكثير من العوالم.. العوالم المليئة بالغيلان، والشياطين، والمعابد القديمة، والمومياوات الغاضبة، والمجاذيب الذين يرتدون الخرق القديمة، و... وبعد انتهاء المُدّة المُحددة؛ لاستلام الأعمال، تم إرسالها، لـ د.سيد البحراوي، الذي أعلن استعداده في الندوة؛ للتحكيم في المسابقة.. عمل شاق للغاية، أن تقرأ عشرات الأعمال، على جهاز الكمبيوتر.. أنتظرنا كثيراً، ولكننا جنينا ثمار الإنتظار، وكانت النتيجة عبارة عن 16 قصة -قصيرة وطويلة- تدور جميعها، حول آداب الواقع الإفتراضي العربية.. بعد ذلك انتظرنا طويلاً أيضاً، وأتت ثورتنا المباركة، لتطيل من انتظارنا، لكن كما انتظر الثوار في ميدان التحرير، وجنوا ثمار الإنتظار، ها نحن أولاء نجني ثمار انتظارنا، بأن نضع بين أيديكم، أول مجموعة قصصية، تحمل بين دفّتيها العديد والعديد، من المُتعة والتشويق والإثارة، وكل ذلك.. في قالب عربي أصيل، نضعها بين يديك قارئنا العزيز، آملين، أن نُحقق، أقصى ما نتمناه لك.. أن تستمتع.▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀أسماء القصص والكُتّابــــــــــــــــــــــــــــــــــــ* سبع أرواح - جمال حمزة عثمان* عذراً محبوبتي - محمد علام* سبعة أيام - إسماعيل وهدان* شيطان شعري - عصام منصور* جبانة الأجانب - ولاء نصر* حائط المعبد - مروة أشرف* شأن عائلي - محمد عبد العليم* فانتازيا الشبشب - محمود مصطفى أحمد الحلو* ذبابة قاتلة - حازم دياب* كلب السيدة - منصف بن دجمان* الليلة تأتي - هبة الله محمد حسن* الحالة 503 إكزيم - مصطفى يحيى* أسطورة النوبي - محمد علاء الدين السيوطي* أبو قوطة - محمد عبد القادر* طريق القبور - مصطفى اليماني* الموتى الأحياء - علاء محمود",
  "genres": [],
  "author": "محمد عبد العليم",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/12237214"
}