{
  "title": "Lies Come Easy",
  "description": "One blizzardy New Mexico night, Posadas County Deputy Pasquale picks up a toddler scooting his Scamper along the shoulder of State 56.Yes, it’s horrifying—a child apparently dumped out of a truck by his father. Nearly as horrifying is what unrolls while Christmas approaches after dad Darrell Fisher’s arrest: a request arrives from the US Forest Service to locate a missing range tech and his unit last reported headed for nearby Stinkin’ Springs, and the brutal murder of Constance Suarez in the border town of Regál, population 37.The Sheriff’s Department is stretched to its limits as its dedicated personnel juggle working cases and caring for citizens with their own relationships and family celebrations. The irony of so much wickedness at the holidays is not lost on anyone. Undersheriff Estelle Reyes-Guzman, heading out her door to a crime scene, reflects: “It would be a glorious holiday evening for somebody.”As their mother joins her colleagues in dealing with the Fisher family, the Forest Service’s absent Myron Fitzwater, the murder, and who knows what else in Regál, Francisco and Carolos, the sons of Estelle and physician Francis, arrange to jet in to spend Christmas with their parents. Francisco the musical prodigy is now a celebrated pianist and composer with an international career. Carlos is thriving at Stanford. Both sons bring special surprises with them. And retired Sheriff Bill Gastner is cooking up a Christmas gift of his own.In Steven Havill’s twenty-third Posadas County Mystery, family dynamics play a huge role as Undersheriff Estelle Reyes-Guzman and the whole department work to pull the right threads out of a tangle of seemingly small lies. It makes for a mix of the mundane with the harrowing. And justice for all will prove elusive.",
  "genres": [
    "Mystery",
    "Fiction",
    "Adult",
    "Thriller"
  ],
  "author": "Steven F. Havill",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/37510077-lies-come-easy"
}