{
  "title": "69 Shades of Nashville: Sociopathic Sex Southern Style",
  "description": "NashvilleKitty is a sociopath. Don't worry. She doesn't want to hurt you. She just wants to screw you, literally. After years doing it the old-fashioned way, Nashville Kitty joins a cheaters' dating website sending her on the scintillating, full-throttle, erotic thrill-ride of her dreams. The serial tryst artist is keenly aware of her sociopathic powers, leveraging them to get anything-and anyone-she wants. The more men (and occasional women) she possesses, the more she craves, until she finds a soul as pure as they come among adulterers. As danger and violence threaten to turn her sweet cheater's dream into a nightmare, this special someone shows her a way out. But can this sociopath change? See for yourself in this erotic psychological thriller written as a fictional memoir with over 300 cartoons to graphically paint the picture of a sociopath's provocative world of sex, murder, mystery, suspense, and manipulation. It is an adventure you will not soon forget.Nicole Kelly, M.D. is the nom de plume of an established Nashville physician who had first hand experience dealing with the manipulations of a sociopath. She writes with authority and wit about the adulterous adventures of NashvilleKitty on a cheaters' dating site resulting in murder and suspense. Written from her home in Nashville, Tennessee, these fictional tales expose the saucy, secret sex lives of her Southern aristocratic neighbors. If while reading this book, you recognize someone you know-please be assured, it is merely a coincidence. Visit 69ShadesOfNashville.com for free downloads including a provocative glimpse of NashvilleKitty's future adventures and delve deeper into the nature of the sociopathic mind next door in Nicole Kelly, M.D.'s non-fiction work on this fascinating subject.",
  "genres": [],
  "author": "Nicole Kelly",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/37508210-69-shades-of-nashville"
}