{
  "title": "How the Heather Looks: A Joyous Journey to the British Sources of Children's Books",
  "description": "Over forty years ago, Joan Bodger, her husband, and two children went to Britain on a very special family quest. They were seeking the world that they knew and loved through children’s books.In Winnie-the-Pooh Country, Mrs. Milne showed them the way to “that enchanted place on the top of the Forest [where] a little boy and his Bear will always be playing.” In Edinburgh they stood outside Robert Louis Stevenson’s childhood home, tilting their heads to talk to a lamplighter who was doing his job. In the Lake District they visited Jemima Puddle-Duck’s farm, and Joan sought out crusty Arthur Ransome to talk to him about Swallows and Amazons. They spent several days “messing about in boats” on the River Thames, looking for Toad Hall and other places described by Kenneth Grahame in The Wind in the Willows. Mud and flood kept them from attaining the slopes of Pook’s Hill (on Rudyard Kipling’s farm), but they scaled the heights of Tintagel. As in all good fairy tales, there were unanswered questions. Did they really find Camelot? Robin Hood, as always, remains elusive.One thing is certain. Joan Bodger brings alive again the magic of the stories we love to remember. She persuades us that, like Emily Dickinson, even if we “have never seen a moor,” we can imagine “how the heather looks.”First published in 1965 by Viking in New York, How the Heather Looks has become a prized favorite among knowledgeable lovers of children’s literature. Precious, well-thumbed copies have been lent out with caution and reluctance, while new admirers have gone searching in vain for copies to buy second-hand. This handsome reprint, with a new Afterword by Joan Bodger, makes a unique and delightful classic available once more.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Books About Books",
    "Geography",
    "Memoir",
    "British Literature",
    "Education"
  ],
  "author": "Joan Bodger",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/375045.How_the_Heather_Looks"
}