{
  "title": "An Economics of Justice and Charity: Catholic Social Teaching, Its Development and Contemporary Relevance",
  "description": "Since Pope Leo XIII’s landmark encyclical Rerum Novarum of 1891, a significant part of Catholic social doctrine has focused on man’s economic life and the challenge of building a well-ordered society rooted in correct first principles and animated by the twin virtues of justice and charity. The Church has boldly engaged the ideologies of the modern age—not only anarchism, communism, and fascism, but also the seductive alternatives of liberalism and libertarianism. Understanding and applying Catholic social doctrine presents special difficulties. The sheer mass of material is a steep mountain to climb for the non-expert. Developments over time and the different styles of papal authors can give an impression of inconsistency or even contradiction. Agenda-driven commentators ignore or distort whatever they dislike, creating an ersatz magisterium. An Economics of Justice and Charity offers readers a compact, objective summary of the economic teaching of the Popes from Leo XIII to Francis that makes manifest its inner unity, its intended authority, and its perennial applicability. It bears witness to the Church’s living history of ethical wisdom, care for workers and the poor, and urgent desire to “penetrate and perfect the temporal order with the spirit of the Gospel.” “This book should be read by anyone who wants to understand the Catholic concept of social justice, particularly how it applies to the realms of economics and politics. Thomas Storck has delivered a concise explanation showing how the Church’s social teaching has been clear and consistent.”— DAVID W. COONEY , Editor, Practical Distributism “In 1991, St. John Paul II encouraged a New Evangelization that included ‘a proclamation of the Church’s social doctrine.’ In the modern world, however, rarely have these teachings been presented holistically. Thomas Storck’s commitment to thinking with the mind of the Church and masterful curation of the best of the social tradition make him a notable successor to his intellectual heroes from the golden age of social thought.”— RICHARD ALEMAN , Editor-in-chief, The Distributist Review “ An Economics of Justice and Charity comes at a time when both the reality and the ideology of capitalism are increasingly being questioned. Its critique of capitalism stands outside the usual left/right dichotomy, providing an opportunity for a deeper analysis of our economic and social woes. For those new to the Church’s ‘best kept secret,’ Storck has produced a clear but philosophically sophisticated introduction to the major contributions and ideas within this tradition.”— CHARLES M. A. CLARK , Professor of Economics, St John’s University “This is a superb exposition of the major social encyclicals, both in their historical development and in their application to our current situation. For those not familiar with the teachings, it provides a brief but brilliant introduction; for those who have studied these texts, Mr. Storck raises many interesting questions. Be sure not to skip the appendices, which shed new light on usury (the besetting sin of finance capitalism) and put forward a refutation of the neo-liberal interpretation of Centesimus Annus .”— JOHN MÉDAILLE , University of Dallas",
  "genres": [
    "Economics",
    "Nonfiction"
  ],
  "author": "Thomas Storck",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/37511792-an-economics-of-justice-and-charity"
}