{
  "title": "The Addiction Spectrum: A Compassionate, Holistic  ​Approach to Recovery",
  "description": "\"If anyone you know is struggling with addiction—or if you think you  might  have a problem—you want to read this book.”— GARTH STEIN, bestselling author of  The Art of Racing in the Rain \" a proven, comprehensive program that compassionately guides the reader to a place of resolution\"— DAVID PERLMUTTER, MD, #1 New York Times bestselling author of   Grain Brain, and, Brain Maker      \" a massive achievement and a giant step forward for addiction medicine\"— ANNIE GRACE, author of This Naked Mind Drug overdose is now the leading cause of death for Americans under fifty. Even as opiate addiction skyrockets, more people than ever before are hooked on alcohol, sedatives, cigarettes, and even screens. The face and prevalence of addiction has changed and evolved, but our solutions to addiction are stuck in the past. We’ve been treating addiction as a black or white issue, a disease you either suffer from or will never suffer from. The problem with this model is that it doesn’t account for the incredible forces working against all of us, pushing all of us toward addiction: stress, undernourishment, sleep-deprivation, vitamin D deficiency, and isolation, not to mention a flawed medical system and corrupt pharmaceutical companies doling out prescriptions at every turn. The truth: Addiction is a disease that, like many others, exists on a spectrum. We are more vulnerable to becoming addicted to substances at certain points in our lives and based on the evidence provided in The Addiction Spectrum , most effective at kicking addiction when we take a holistic approach. With the help of the 13-point plan and individual protocols detailed in this book, you have the power to change your destiny. No one understands this more than Dr. Paul Thomas, who recovered from alcohol addiction early in his career and founded one of the most effective rehabilitation centers for teens and young adults in his hometown of Portland, OR. Named one of the top family doctors and one of the top pediatricians in the country, Dr. Paul is also board-certified in both integrative medicine and addiction medicine. This unique combination of specialties is intentional: Dr. Paul has devoted his entire life and career to saving lives. Using the best conventional medicine alongside the new science of alternative health, Dr. Paul has treated thousands of patients with the life-saving solutions provided in The Addiction Spectrum . Addiction is a compendium of often devastating circumstances that have gone unchecked by society for far too long. This book is a positive light and guide to overcoming not only addiction but the challenges and obstacles that affect us all.",
  "genres": [
    "Health",
    "Psychology",
    "Nonfiction",
    "Audiobook",
    "Psychiatry"
  ],
  "author": "Paul     Thomas",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/37505600-the-addiction-spectrum"
}