{
  "title": "The Blue Cotton Gown: A Midwife's Memoir",
  "description": "Heather is pale and thin, seventeen and pregnant with twins when Patricia Harman begins to care for her. Over the course of the next five seasons Patsy will see Heather through the loss of both babies and their father. She will also care for her longtime patient Nila, pregnant for the eighth time and trying to make a new life without her abusive husband. And Patsy will try to find some comfort to offer Holly, whose teenage daughter struggles with bulimia. She will help Rebba learn to find pleasure in her body and help Kaz transition into a new body. She will do noisy battle with the IRS in the very few moments she has to spare, and wage her own private battle with uterine cancer.Patricia Harman, a nurse-midwife, manages a women's health clinic with her husband, Tom, an ob-gyn, in West Virginia-a practice where patients open their hearts, where they find care and sometimes refuge. Patsy's memoir juxtaposes the tales of these women with her own story of keeping a small medical practice solvent and coping with personal challenges. Her patients range from Appalachian mothers who haven't had the opportunity to attend secondary school to Ph.D.'s on cell phones. They come to Patsy's small, windowless exam room and sit covered only by blue cotton gowns, and their infinitely varied stories are in equal parts heartbreaking and uplifting. The nurse-midwife tells of their lives over the course of a year and a quarter, a time when her outwardly successful practice is in deep financial trouble, when she is coping with malpractice threats, confronting her own serious medical problems, and fearing that her thirty-year marriage may be on the verge of collapse. In the words of Jacqueline Mitchard, this memoir, \"utterly true and lyrical as any novel . . . should be a little classic.\"",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "Medical",
    "Book Club",
    "Biography",
    "Medicine"
  ],
  "author": "Patricia Harman",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/3753626-the-blue-cotton-gown"
}