{
  "title": "BYE Student Loan Debt: Learn How to Empower Yourself by Eliminating Your Student Loans",
  "description": "In 2016, 70% of college graduates exited school with student debt - equivalent to 43 million student loan borrowers. Together, these students carry over $1.4 trillion dollars in loans, which continues to grow at a rate of about $3,000 per second! The average 2017 graduate will leave school with over $37,000 in debt and an average payment of over $350 a month. BYE Student Loan Debt was created by author Daniel J. Mendelson to tackle this epidemic. He and his wife accumulated nearly $150,000 in student loan debt through a combined 14 years of secondary education. By sticking to the principles outlined in this book, they eliminated this debt in just 5 years! This provided the inspiration to share their story so that others could follow the same steps they used to rapidly eliminate their debt. This interactive online book is linked to online calculator tools that when paired with the simple process outlined in the book, allow for a customized repayment solution. If you or someone you know is saddled or soon to be saddled with this burden, BYE Student Loan Debt is the book for you! For those that are already in student loan debt, this book will show you the fundamentals of how to understand, manage and eventually eradicate your debt. For those yet to take out loans, the book will highlight the principles required to minimize your debt burden and prevent a lifetime of student loan payments. Within these chapters, you will learn 1) Organize your loan situation and set realistic goals 2) Create a budget and make a plan 3) Bargain hunt for favorable loan consolidation terms 4) Execute a loan plan by prioritizing the most costly loans first 5) Employ programs to alter, delay, or have loans completely forgiven 6) Save and invest for your future 7) Prevent student loan debt from the beginning of your education 8) Customize a loan repayment plan with interactive online calculators",
  "genres": [],
  "author": "Daniel J. Mendelson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/37539044-bye-student-loan-debt"
}