{
  "title": "Shadow Weaver: The Ederiss Chronicles",
  "description": "A YOUNG OUTLAW WHO CAN SEE PEOPLE'S MEMORIES IS CAPTURED AND SOLD TO AN AMNESIC PRINCESixteen-year-old Mirra can see people's memories. She is a Shadow Weaver, one of the outlawed, glitter-eyed race feared in her land and forced into brutal slavery as children. She and her brother Kel have escaped their fate by hiding near the frozen mountains. But when bounty hunters snatch Kel, Mirra injured and unable to track long distances will lose him unless she gives herself up to his captors. As as a Shadow Weaver who's survived childhood and whose golden-flecked irises have faded, concealing her talent, Mirra's own value is priceless on the black-market.Taken to a lawless town in the northern territories, Mirra convinces her captors to sell her to a mysterious young man destined for the same province as the officer who has bought her brother. The young man is the Kingdom's missing Prince, feared dead after his escort was attacked on an expedition. He has been in hiding, waiting for a Shadow Weaver whose skill he can use to discover who ordered his assassination. But before he will risk breaking his father's law and taking Mirra to the royal court, he must test her talent and her ability to hide it. If Mirra fails, her hopes of seeing her brother again will be cut by the noose around her neck.What Early Readers are Saying:\"Your beautiful book has left me stunned, flushed and hungry. I got so hooked I read it in three days and now I have no idea what to do with myself...\"\"Wow. Simply wow! This is one captivating book. I am definitely glad I spent some of my life reading this!\"\"...Hooked the entire time...This book has been the cause of more than a few sleepless nights.\"\"Holy smidgens, I read this in a day because I loved it so much and COULD NOT for the LIFE of me put it down!\"\"I've been yearning for a book that was different... Reading this made me feel as if I was one of the characters.\"\"Shadow Weaver was a lifetime experience for me. Mirra taught how no pain is capable to hold you back if you're determined on your dreams and promises.\"",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Adventure",
    "Romance"
  ],
  "author": "Claire Merle",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/37540813-shadow-weaver"
}