{
  "title": "Heart of the Dragon",
  "description": "*Now a complete series!* Even the deadliest dragon warrior has a weakness … his answers to the name Evangeline. Liam suffered the loss of his mate once before, but with forbidden magic, Evie has returned to him. His reputation as “The Reaper” is one he earned … one kill at a time. So, if there’s any warning his enemies should heed, it’s that he’ll stop at nothing to keep history from repeating itself; will stop at nothing to protect her. Evie senses the walls rapidly closing in as her role in the revolution becomes clear—a movement in which the supernatural order has begun to shift. All who stand for the cause have made sacrifices, including Evie who’s faced several hard truths. The hardest lesson being one that brought loyalty into question—a single, careless act at the hands of someone she trusted. Someone who nearly cost her everything. Nick never wanted any of this. As he struggles to understand the nature of his dual identities, he’s haunted by the pain and destruction he’s caused as his dark side gains strength. Escaping his cell and running was the only option, but that doesn’t mean he’ll escape the repercussions. No one’s out of the woods yet. The line between enemies and allies blurs for the Seaton Falls clan amidst rising tension, rumors of a traitor among them ... and the arrival of an uninvited guest. “I’m a sucker for a badass sweetheart kind of hero. I devoured this book.” ★★★★★ -Amazon Review “It just keeps getting better and I'm here for it.” ★★★★★ -Amazon Review “If you haven't read the first two books in this BRILLIANT series yet, run... Don't walk to read them!” ★★★★★ -Amazon Review “This series is a bold and heart-wrenching read!” ★★★★★ -Amazon Review “The author has me overcome with all these emotions that I don't know what to do with them!” ★★★★★ -Amazon Review “Dripped with excitement from beginning to end.” ★★★★★ -Amazon Review The Lost Royals Saga is an upper YA/NA crossover. This is a tale of long-forgotten royalty and a fated love too powerful for time to erase. It's the ideal paranormal romance for fans of urban fantasy and star-crossed love. This book is for anyone who * Shifter Romance (Dragons and Werewolves/lycans) * Teen and Young Adult Paranormal Romance * New Adult Paranormal Romance * Magical Powers and Supernatural Creatures * Alternative Reality and Alternative History * Tales of forbidden love * Fiction involving lost princesses and fallen or ruined kingdoms This is BOOK THREE in the Lost Royals saga. BOOK FOUR, now available. ***Grab your copy of HEART OF THE DRAGON today!***",
  "genres": [
    "Paranormal",
    "Romance",
    "Dragons",
    "Fantasy",
    "Shapeshifters",
    "Magic",
    "Young Adult"
  ],
  "author": "Rachel Jonas",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/37538738-heart-of-the-dragon"
}