{
  "title": "The Cure For Love",
  "description": "The Cure for Love is the first book in The Cure for Love Romance series. It’s a light–hearted romance set in Cornwall and London during the summer.1. The Cure for Love2. The Cure for Love at The story starts in London. Daisy is broken-hearted when her boyfriend, Sebastian, announces his engagement to Celeste. Sebastian works for a publishing company in London. Celeste's father, Franklin, owns the company. Daisy is a freelance botanical illustrator who often works for Franklin, illustrating books.Angry and betrayed, Daisy leaves London and heads for a break in Cornwall. The seclusion she seeks is soon disturbed when she meets Jake Wolfe who owns a health food shop in the town. Then there are the various gossips such as Mrs Lemon, Sharky the baker and Jake's uncle Woolley to deal with. Daisy's life by the seaside is set to be hectic, but amid the mayhem will she find romance, especially when Sebastian arrives in Cornwall?New releases by De-ann Cure for Love at Christmas, Vintage Dress Shop on the Island, Scottish Island Fairytale Castle, Scottish Loch Summer Romance, Sewing & Mending Cottage, Knitting Shop by the Sea, Colouring Book Cottage, Knitting Cottage, and Scottish Highlands Christmas Wedding.Oops! I’m the Paparazzi, Again.Romance books by De-ann Highlands & Island Romance Scottish Island Knitting Bee2. Scottish Island Fairytale Castle3. Vintage Dress Shop on the IslandScottish Loch Romance Sewing & Mending Cottage2. Scottish Loch Summer RomanceScottish Chateau, Colouring & Crafts Christmas Cake Chateau2. Colouring Book CottageQuilting Bee & Tea Shop The Quilting Bee2. The Tea Shop by the Sea3. Embroidery Cottage4. Knitting Shop by the SeaSewing, Crafts & Quilting The Sewing Bee2. The Sewing Shop3. Knitting Cottage (Scottish Highland romance)4. Scottish Highlands Christmas WeddingCottages, Cakes & Crafts The Flower Hunter’s Cottage2. The Sewing Bee by the Sea3. The Beemaster’s Cottage4. The Chocolatier’s Cottage5. The Bookshop by the Seaside6. The Dressmaker’s CottageOops! I’m the Paparazzi Oops! I’m the Paparazzi2. Oops! I’m up to Mischief (prequel)3. Oops! I’m the Paparazzi, Again (sequel)About the Black is a bestselling author, scriptwriter and former newspaper journalist. She has over 100 books published. Romance, thrillers, various fiction & non-fiction books.De-ann is also a professional artist, illustrator and designer. Embroidery patterns, fabric design, dressmaking, sewing, knitting and fashion are part of her work.Additionally, De-ann has always been interested in fitness, and was a fitness and bodybuilding champion, 100 metre runner and mountaineer. As a former N.A.B.B.A. Miss Scotland, she had a weekly fitness show on the radio that ran for over three years. De-ann trained in Shukokai karate, boxing, kickboxing, Dayan Qigong & Jiu Jitsu. She is currently based in Scotland.Her embroidery pattern books & colouring books are available in paperback on Amazon.",
  "genres": [],
  "author": "De-ann Black",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/12238669-the-cure-for-love"
}