{
  "title": "Unchained by a Forbidden Love",
  "description": "Lost to the darkness, Fuery wages a daily war against the corruption that lives within him, constantly in danger of slipping into the black abyss and becoming the monster all elves fear. Work as an assassin gives him purpose, but what reason is there to go on when he killed the light of his life—his fated mate?Shaia has spent forty-two centuries mourning her mate. Tired and worn down, she agrees to wed a male of her family’s choosing, following tradition that has always bound her as a female and hoping she will be able to gain just a little freedom in return. But as she resigns herself to being the mate of a male she could never love, fate places an old friend in her path—one who tells her that her lost love is alive.Will Shaia find the courage to break with tradition and leave the elf kingdom in search of her mate? And as a ray of light pierces his soul again, can Fuery find the strength to win his battle against the darkness or will it devour him and that light of their forbidden love forever?Unchained by a Forbidden Love is the fifteenth novel in the Eternal Mates Romance series. This fated mates paranormal romance can be read out of order and features a dark elf hero assassin and a determined elf heroine, a second chance at happiness, and lots of action and adventure--and steamy scenes! All Eternal Mates world books have no cliffhangers, a guaranteed happily ever after, and some strong language. Enjoy!Grab your copy today and step into a passionate, lush, and powerful paranormal romance series packed with dark elves, vampires, demons, fae, shifters and angels from New York Times and USA Today Best-Selling Paranormal Romance Author Felicity Heaton.Paranormal Romance Books in the Eternal Mates SeriesBook 1: Kissed by a Dark PrinceBook 2: Claimed by a Demon KingBook 3: Tempted by a Rogue PrinceBook 4: Hunted by a JaguarBook 5: Craved by an AlphaBook 6: Bitten by a HellcatBook 7: Taken by a DragonBook 8: Marked by an AssassinBook 9: Possessed by a Dark WarriorBook 10: Awakened by a DemonessBook 11: Haunted by the King of DeathBook 12: Turned by a TigerBook 13: Tamed by a TigerBook 14: Treasured by a TigerBook 15: Unchained by a Forbidden LoveBook 16: Avenged by an AngelBook 17: Seduced by a Demon KingBook 18: Scorched by DarknessBook 19: Inflamed by an IncubusBook 20: Craved by a WolfBook 21: Bewitched by a Vampire... next book in the Eternal Mates series coming soon!",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Chick Lit",
    "Fae",
    "Shapeshifters",
    "Fantasy"
  ],
  "author": "Felicity Heaton",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/37542545-unchained-by-a-forbidden-love"
}