{
  "title": "Craft of Intelligence: America's Legendary Spy Master On The Fundamentals Of Intelligence Gathering For A Free World",
  "description": "If the experts could point to any single book as a starting point for understanding the subject of intelligence from the late twentieth century to today, that single book would be Allen W. Dulles's The Craft of Intelligence . This classic of spycraft is based on Allen Dulles's incomparable experience as a diplomat, international lawyer, and America's premier intelligence officer. Dulles was a high-ranking officer of the CIA's predecessor--the Office of Strategic Services--and was present at the inception of the CIA, where he served eight of his ten years there as director. Here he sums up what he learned about intelligence from nearly a half-century of experience in foreign affairs.In World War II his OSS agents penetrated the German Foreign Office, worked with the anti-Nazi underground resistance, and established contacts that brought about the Nazi military surrender in North Italy. Under his direction the CIA developed both a dedicated corps of specialists and a whole range of new intelligence devices, from the U-2 high-altitude photographic plane to minute electronic listening and transmitting equipment.Dulles reveals much about how intelligence is collected and processed, and how the resulting estimates contribute to the formation of national policy. He discusses methods of surveillance, and the usefulness of defectors from hostile nations. His knowledge of Soviet espionage techniques is unrivaled, and he explains how the Soviet State Security Service recruited operatives and planted \"illegals\" in foreign countries. He spells out not only the techniques of modern espionage but also the philosophy and role of intelligence in a free society threatened by global conspiracies.Dulles also addresses the Bay of Pigs incident, denying that the 1961 invasion was based on a CIA estimate that a popular Cuban uprising would ensue. This account is enlivened with a wealth of personal anecdotes. It is a book for readers who seek wider understanding of the contribution of intelligence to our national security.",
  "genres": [
    "History",
    "Nonfiction",
    "Espionage",
    "Military Fiction",
    "Politics",
    "War",
    "Political Science"
  ],
  "author": "Allen W. Dulles",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/375593.Craft_of_Intelligence"
}