{
  "title": "Outlaw Xmas",
  "description": "Deck the halls with boughs of holly.  As the snow quietly falls over Pinewood Springs, a shadow lurks among the evergreen trees, watching and waiting to strike.  Fa-la-la-la-la, la-la-la-la.  The Insurgents MC gears up for their annual toy drive.  ’Tis the season to be jolly.  An axe destroys Christmas trees, the spray of BB gun pellets deflate inflatables swaying in the wind, toys go missing.  Fa-la-la-la-la, la-la-la-la.  Someone wants to ruin Christmas in Insurgents Motorcycle Club territory.  Troll the ancient Yule-tide carol.  Bad mistake.  Fa-la-la-la-la, la-la-la-la.  Outlaw bikers don’t take crap from anybody. They demand respect. And they make sure they get it.  When the evil Scrooge steals the toys for the Toy Drive, Banger, the Prez, sees red, and his fellow brothers are chomping at the bit to run a candy cane through the madman’s heart.  As the Insurgents try to figure out who’s stealing the donations at the charity center, the real possibility of a turf war with the Deadly Demons, looms over them. What would the old ladies say if Christmas was spent in lockdown at the clubhouse? Hawk’s pretty sure Cara wouldn’t be agreeable, especially since he’s already in deep water with her over some of his antics. A lockdown wouldn’t go over too well with the other old ladies either.  And if that isn’t enough, Banger, Hawk, and Throttle notice the heat brewing between one of their brothers, Wheelie, and another member’s old lady, Sofia. Moving in on another brother’s wife is strictly prohibited.  Wheelie knows that, but the way Sofia steals glances at him, ignites a fire that’s hard to contain. Even though chaos and danger crackle around the club, the Insurgent men always have time to show their old ladies how loving an outlaw can be.  When the cruel Scrooge puts Hawk’s and Banger’s children in danger, he finds out that there is nothing like the fury of a one-percenter biker.  Will the Insurgents save Christmas for their families and the town?  This is the story of a rough and tumble outlaw motorcycle club: the Insurgents. This is not a standalone book. In order to enjoy the book more fully, it’s suggested that the reader is familiar with the Insurgents MC series. This book contains violence, strong language, and steamy/graphic sexual scenes. It’s about sexy, tough men who love their women fiercely and protect them valiantly. HEA. 18+.",
  "genres": [
    "Suspense",
    "Romance",
    "Contemporary",
    "Holiday",
    "Contemporary Romance",
    "Christmas"
  ],
  "author": "Chiah Wilder",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/37546686-outlaw-xmas"
}