{
  "title": "Black Fathers Are Real: \"We Do Exist\"",
  "description": "Have you ever heard the sayings, “Black Men Are Not Present in Their Kids’ Lives”? The Increasing Number of Single-Parent Homes is Exclusively A Black Problem? Black Fathers Are An Anomaly? If so, Black Fathers Are We Do Exist is the book for you. This classic children’s book conveys the importance of fathers in lives of their children. Narrated by Camren J. McRae, he specifically highlights Black Fathers, making known to the world that they do exist. Black Fathers are hardworking, educated, loving men who wants the best for their children. this book shines a light through on Black Fatherhood through Camren’s eyes, the views from a child about his hero. According to the National Health Statistics Report, Fathers’ involvement in their children’s lives has been shown to have a positive effect on children and their well-being in many areas. for example, on increasing the chances of academic success (2 out of 3) and in reducing the chances of delinquency and substance abuse. (4 out of 6). According to a CNN report, statistics from the Centers for Disease Control and Prevention (CDC) reported that “children under the age of 5: Black Fathers prepared and/or ate meals more with their children vs their white and Hispanic counterparts. Children 5 through 18: Black Fathers took children to and from activities daily more compared to their white and Hispanic counterpart’s. Children 5 through 18: Black Fathers also helped their kids with homework more than their white and Hispanic counterparts.” (Source Aaron Paxton Arnold. “dispelling the myths about black fathers”, In an effort to educate, inspire, motivate, and captivate the audience, Black Fathers Are We Do Exist is a great depiction of day to day interactions with a black father. it involves lessons learned, the culture, and the inspiration Camren receives, which is received by millions of African American children.",
  "genres": [],
  "author": "Jerry McRae",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/37549444-black-fathers-are-real"
}