{
  "title": "Harvest of Ruins",
  "description": "Detective Sergeant Hunter McKenna is on trial, charged with negligent homicide after her investigation into the suspicious death of a local teenager led to more deaths and personal tragedy. Hunter faces accusations in the courtroom, and is tormented by her own guilt over personal choices she’s made. The community’s grief demands someone to blame, and Hunter can’t deny she’s haunted by regret. As her partner, DS Noah Wilmott, continues to investigate, he wonders if the nightmares plaguing his partner are really Hunter’s subconscious, piecing things together, or something more, and when he follows a hunch it leads to answers that will stun a community. “Intricately layered, Harvest of Ruins works well on several levels. On the surface it’s a taut legal thriller that interweaves the proceedings currently unfolding in the courtroom with the events that brought McKenna to this point. On a deeper level, however, Harvest of Ruins is a psychological study of the devastating effects of guilt, both for actions taken as well as those not taken. “Author Sandra Ruttan’s writing is some of the smoothest and most realistic you will ever come across. Everything from the setting to the dialog to the courtroom process rings true – and as an attorney I am hard on courtroom scenes, trust me – and the characters are so finely drawn it feels as though you’re reading about people who could be your friends or neighbors. Indeed, Harvest of Ruins will not only entertain you, it will cause you to take a lingering look at those around you, forcing you to wonder what may be going on with them just beneath the surface, waiting to boil over.” - Elizabeth A. White, All-Purpose Monkey \"Ruttan effortlessly brings to life a varied cast of complex characters. She writes with tremendous passion, honesty and skill. This is a story you will care about.\" Allan Guthrie, Edgar Nominated Author of KISS HER GOODBYE “Ruttan has a spellbinding style.\" NY Times Bestselling Author Clive Cussler “Ruttan combines devilishly clever plots with genuinely empathic characters...\" Russel D. McLean, Crime Scene Scotland \"One absolute wallop of a novel. Not only does it make you want to know when Sandra Ruttan's next book is due, but when's the next flight to Canada… A totally mesmerizing narrative and a plot that burns off the page.\" Ken Bruen, Shamus Award-Winning Author of THE GUARDS \"A taut, crackling read with switch-blade pacing. A sizzling story by one of crime fiction's hot new voices.\" Rick Mofina, internationally best-selling author of A PERFECT GRAVE \"Sandra Ruttan writes with utter ferocity. Twists and turns that stun and dialog that absolutely crackles with wit and authenticity. With each page, Ruttan delivers the goods.\" GREGG OLSEN, New York Times Bestselling Author of A WICKED SNOW “Ruttan clearly has the potential to be a very successful author... Lots of talent which I expect will be realized!\" Maddy Van Hertbruggen, Mystery News \"Ruttan has made one big mistake in my eyes, she waited too long to bring her writing to us. She is talented in the way that a natural musician is talented, making all the notes seem effortless. Characters that feel very real, and a wonderful sense of timing, Ruttan brings it all and leaves it on the page. Lucky us. And unlucky me, because now I have to wait for the next one…\" Jon Jordan, Crimespree Magazine “Watch for more efforts from Ruttan, who shows a great deal of skill in developing an intriguing, complicated story.\" Lesa Holstine, BookBitch “Ruttan has a keen eye for description, a wonderful ear for dialogue, and an acute instinct for the nuances of characterization.” Anne Frasier, USA Today Bestselling Author of HUSH “Sandra Ruttan writes with a machine gun rhythm that pulls you through every unexpected twist and dark turn.” Bill Cameron, Author of LOST DOG Ruttan's deft touch intrigues and satisfies, making her a powerful new force in the mystery field.” JT Ellison, ITW award-nominated author of THE COLD ROOM",
  "genres": [],
  "author": "Sandra Ruttan",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/12238772-harvest-of-ruins"
}