{
  "title": "The Necronists: A Paranormal Steampunk Thriller",
  "description": "What Happens When the White Witch of London Wrangles With the Weird Wild West?Rose and Dolly are stumped as to how 132 souls were lost in an instant. A break in the case is presented when a wire-type comes to them from the distant Colorado Territory, U.S.A. The newly badged U.S. Marshal has clues and requests their help. So why not hop into Captain Reidun Falk's newly remodeled airship and dash over to the wild west?While the trail warms in the Rocky Mountains, it points to the idyllic provinces of France and the Piedmont Region of Italy, then crosses paths with Guild master Gérard Saint Yves, his Necronists Brotherhood and their abominable creations.Lord Gilchrist has returned from the jungles of Mexico with secrets of his own, but he is solely focused on relieving Preston of his blighted mind, even if it means exposing his heir to the painful experiments of a famous Swiss brain surgeon.The boulevards of Paris will run with blood again, but who's? You will be shocked when you see the results!Rose, Dolly and the team cross paths with former foes, some of whom become fair-weather friends to uncover the dark plots that the mysterious Caiaphas weaves across time and space.The series     The Untold Tales of DOlly WIlliamson 99 cents B076948NTVThe Alchemists  B077XCKL99The Necronists  B076948NTVThe Mechanists Release 2018FAQsWhat other books have you written and what order should they be read?The Untold Tales of Dolly WilliamsonThe AlchemistsThe NecronistsWhy should a reader pick up your book?If they are looking for a series of character-driven stories that include fantasy and science fiction but also a nod to history then pick up this book. I love it when a reader writes me that I introduced them to a historical figure they never knew existed and after researching learned that the life they lead was not all that different from how I portrayed them. Here is what one reader wrote;'I really enjoyed this paranormal-steampunk-metaphysical-dark fantasy-historical, set during the Victorian Era, in England, France, Italy, and America's Frontier period. I had not first read the first in this series, THE ALCHEMISTS, but that never interfered with the intrigue nor with my understanding of the story and continuing characters. Although I am not an aficionado of nor expert in fantasy, I do love a story in which magic works and is a way of life. I also love science, and to me, steampunk is like alternate history with science (and steam engines). Here, too, is metaphysics, spirituality, and secret societies! You want to see character evolution? Look right here! We've got it in spades--even with characters who are in a sense virtual ; and we get Homunculi (and golems). Plus we have a heroine who is the first female detective constable at Scotland Yard, the White Witch of London, a metaphysical engineer--and formerly a nun!! I found myself glued from the first chapter and totally enjoyed.'What is Steampunk?Steampunk is an aesthetic and for some a way of life. One key point is that steam is the main mode of power. I heard a good tagline \"When the Victorian comes together with science fiction like clockwork.\"My rules for the steampunk world I have built is this is an alternative history to our timeline.",
  "genres": [
    "Steampunk"
  ],
  "author": "J.M. Bannon",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/37559399-the-necronists"
}