{
  "title": "Dark Age",
  "description": "The #1 New York Times bestselling author of Morning Star returns to the Red Rising universe with the thrilling sequel to Iron Gold.\nHe broke the chains. Then he broke the world….\nA decade ago Darrow led a revolution, and laid the foundations for a new world. Now he’s an outlaw.Cast out of the very Republic he founded, with half his fleet destroyed, he wages a rogue war on Mercury, in hopes that he can still salvage the dream of Eo. But as he leaves death and destruction in his wake, is he still the hero who broke the chains? Or will he become the very evil he fought to destroy? Will another legend rise to take his place?\nIn his darkening shadow, a new hero rises.\n Lysander au Lune, the heir to the old empire in exile, has returned to bridge the divide between the Golds of the Rim and Core. Determined to bring peace back to mankind at the edge of his sword, he must overcome or unite the treacherous Gold families of the Core and face down Darrow over the skies of war-torn Mercury. If united, their combined might may prove fatal to the fledgling Republic.\nBut theirs are not the only fates hanging in the balance.\nOn Luna, Mustang, the embattled Sovereign of the Republic, Virginia au Augustus campaigns to unite the Republic behind her husband, fights to preserve her precious demokracy and her exiled husband. Beset by political and criminal enemies, can she outwit her opponents in time to save him? But one may cost her the other, and her son is not yet returned.Abducted by a new threat to the Republic, Pax and Electra, the children of Darrow and Sevro, must trust in Ephraim, a Gray thief, for their salvation—and Ephraim must look to them for his chance at redemption.Far across the void, young Lyria, Once a Red refugee, now stands accused of treason, and her only hope is a desperate bid for freedom with the help of two unlikely new allies.Fear dims the hopes of the Rising as alliances shift, break, and re-form—and power is seized, lost, and reclaimed—every player is at risk in a game of conquest and the worlds spin on and on toward a new Dark Age.Don’t miss any of Pierce Brown’s Red Rising Saga:RED RISING • GOLDEN SON • MORNING STAR • IRON GOLD • DARK AGE",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Audiobook",
    "Dystopia",
    "Space Opera",
    "Adult"
  ],
  "author": "Pierce Brown",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/37562956-dark-age"
}