{
  "title": "Everybody, Always: Becoming Love in a World Full of Setbacks and Difficult People",
  "description": "What if we stopped avoiding the difficult people in our lives and committed to simply loving everybody? What happens when we give away love like we're made of it? In Everybody, Always, Bob Goff's joyful New York Times bestselling follow-up to Love Does, you'll discover the secret to living without fear, constraint, or worry.Bob teaches us that the path toward the outsized, unfettered, liberated existence we all long for is found in one simple love people, even the difficult ones, without distinction and without limits.In Everybody, Always, Bob shows us the simple truths about life that have the power to shift our mindset Jesus uses our blind spots to reveal himself to usIt's easy to love kind, lovely, humble people, but you have to tackle fear in order to love people who are difficultWhat we do with our love will become the conversations we have with GodDark and scary places are filled with beautiful people who need our unconditional loveExtravagant love has extraordinary power to change lives, including our ownDriven by Bob's trademark storytelling, this book reveals the wisdom Bob learned--often the hard way--about what it means to love without inhibition, insecurity, or restriction. From finding the right friends to discovering the upside of failure, Everybody, Always points the way to embodying love by doing the unexpected, the intimidating, the seemingly impossible.Whether losing his shoes while skydiving solo or befriending a Ugandan witch doctor, Bob steps into life with a no-limits embrace of others that is as infectious as it is extraordinarily ordinary. Everybody, Always reveals how we can do the same.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Self Help",
    "Christian Living",
    "Audiobook",
    "Religion"
  ],
  "author": "Bob       Goff",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/37549779-everybody-always"
}