{
  "title": "Africans In Colonial Louisiana: The Development of Afro-Creole Culture in the Eighteenth-Century",
  "description": "Although a number of important studies of American slavery have explored the formation of slave cultures in the English colonies, no book until now has undertaken a comprehensive assessment of the development of the distinctive Afro-Creole culture of colonial Louisiana. This culture, based upon a separate language community with its own folkloric, musical, religious, and historical traditions, was created by slaves brought directly from Africa to Louisiana before 1731. It still survives as the acknowledged cultural heritage of tens of thousands of people of all races in the southern part of the state. In this pathbreaking work, Gwendolyn Midlo Hall studies Louisiana's creole slave community during the eighteenth century, focusing on the slaves' African origins, the evolution of their own language and culture, and the role they played in the formation of the broader society, economy, and culture of the region. Hall bases her study on research in a wide range of archival sources in Louisiana, France, and Spain and employs several disciplines--history, anthropology, linguistics, and folklore--in her analysis. Among the topics she considers are the French slave trade from Africa to Louisiana, the ethnic origins of the slaves, and relations between African slaves and native Indians. She gives special consideration to race mixture between Africans, Indians, and whites; to the role of slaves in the Natchez Uprising of 1729; to slave unrest and conspiracies, including the Pointe Coupee conspiracies of 1791 and 1795; and to the development of communities of runaway slaves in the cypress swamps around New Orleans.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Race",
    "Cultural",
    "African American"
  ],
  "author": "Gwendolyn Midlo Hall",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/1223912.Africans_In_Colonial_Louisiana"
}