{
  "title": "The Power of Dao: A Timeless Guide to Happiness and Harmony",
  "description": "The description tells potential customers about your title. A good example of an appropriate book summary is the kind you often find on the inside flaps or back cover of a physical book dust jacket. Your description can have up to 4,000 characters, or about 760 words.  For over 2,500 years, Lao Tzu's philosophy of Dao has helped hundreds of millions of people to attain equanimity and sustain serenity. In The Power of Dao, Lou Marinoff shows how Dao, or \"the Way,\" can serve as a potent remedy to the stress, anxiety, and daily challenges of living in our wildly unpredictable and constantly changing world.   The Power of Dao illuminates the central teachings of Lao Tzu, applying them to everyday matters facing us all in the areas of health and well-being, love and marriage, creativity and career, personal achievement and purpose. Every chapter is replete with illustrative case studies, revealing how emperors, artists, athletes, and ordinary citizens alike have accessed the power of Dao. Daoist wisdom can restore balance in precarious human relationships, promote calm when coping with illness and mortality, and empower us to be better citizens and wiser leaders. Harmonizing nature and nurture, Dao teaches us to attain our true potential, and avoid envy, greed, and anger. Beyond transforming individual lives, Dao holds out the promise of a new golden age of prosperity, peace, and cultural advancement.  Americans among other Westerners have sustained growing mainstream fascination with Dao (and its sister philosophy, Buddhism) for several decades, embracing the Way not only for its inherent beauty and power, but also as a spiritual remedy for culturally-induced epidemics that are sweeping Western and Westernized cultures. Increasingly today, Westerners are turning to holistic practices that originated in China as outgrowths of Daoism: qigong, tai chi, meditation, feng shui, acupuncture, and herbal medicine, among others. The Power of Dao is a quintessential guide to personal happiness, social harmony, economic prosperity, and political balance.  As enthusiastic endorsers and Amazon reviewers attest, The Power of Dao is a refreshing and timely book, written for a mainstream American audience by an ideal author and respected teacher. True to the book’s subtitle—A Timeless Guide to Happiness and Harmony—it’s an inexhaustible treasure of Daoist wisdom for every conceivable challenge and tribulation of daily life.  Lou Marinoff is Professor of Philosophy and Asian Studies at The City College of New York. He has taught Chinese Philosophy there since 1994, to CCNY students hailing from more than one hundred and fifty countries. His clarity, humor, and passion have engendered popular acclaim in America’s largest urban university.  Dr. Lou is also an internationally bestselling author and philosophical counselor, applying Western and Asian philosophy to everyday life for private clients and public audiences worldwide. Faculty to Horasis among other global communities, he meets regularly with Chinese business leaders, civil servants, social entrepreneurs, and artists.  Well- known in East Asia, Dr. Lou’s works have led to book and lecture tours in mainland China, Hong Kong, Japan, Singapore, South Korea, and Taiwan. University students from South Korea and philosophy professors from China nowadays journey to City College, funded by their governments, to study with him.  As a young man in Canada, Dr. Lou learned Kung Fu and Chinese medicine for eleven years with revered Grandmaster Sing Ming Li, attaining the rank of seventh degree black belt. More recently, Dr.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Self Help",
    "Psychology"
  ],
  "author": "Lou Marinoff",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/37553146-the-power-of-dao"
}