{
  "title": "Poems from a Runaway",
  "description": "Welcome to Ben Westwood's collection of 60 true-story poems - ‘Poems from a runaway’.It’s his story of being a teenager in care, and a frequent runaway from the west midlands (UK). Follow him on a journey from ten years old, wandering from town to town before eventually at the age of twelve, finding himself in the east end of London with drug addicts and prostitutes. A year later he was to be sleeping rough in London’s West end, meeting celebrities and all sorts of folk. It’s a story with many tragedies, but also comedic moments. Choices that would have only been made with a youngsters thinking, and angels along the way. Predators, friends, heart-warming times and dangerous moments. Hustles, wind-ups and the way young people entertain themselves along the way. Some moments in life that some may never had knew existed.Welcome to the runaway story of Ben Westwood - a novel in poetry - ‘Poems from a runaway’.It’s his story of being a frequent runaway missing from his foster carers and childrens homes back in his west midlands (UK) homelands. Follow him on a runaway journey from ten years old, wandering from town to town before eventually at the age of twelve, finding himself in the east end of London among drug addicts and prostitutes. Soon later to be sleeping rough in London’s West end, meeting allsorts of people. It’s a story with many tragedies, but also comedic moments. Choices that would have only been made with a youngsters thinking, and angels along the way. Predators, friends, heart-warming times and dangerous moments. Hustles, wind-ups and the way young people entertain themselves along the way. Some moments in life that some may never had knew existed.A collection of sixty poems of various lengths in story timeline form, this book will guide the reader through the reality of his true-story childhood journey.Not only a great read and an eye-opener for general book and poetry lovers, but also a must-have resource for foster parents, social workers, mental health support services, homeless services, child advocates, care leavers and anyone that works with young people.Review snippets.\"Written skilfully as poetic prose, Ben relives his time as a runaway child on the streets but he doesn’t want people to feel sorry for him. If there is one main message, it is the power we all have to make a difference to lives, ‘to never give up on ourselves or others\" \"A powerful testimony and one that should be read by everybody working with young runaways.\" Maggie F\" I guarantee you will laugh at some of Ben's antics, be consistently amazed at the strength of his survival instinct (especially during the more sinister episodes he relates) and you might even have your heart broken when you read some of Ben's more poignant and personal observations! This book certainly acts as a reminder that more empathy, compassion, love and humanity are necessary to make the world a better place for us all.\" Rainbow 1\"The book documents Ben's true life-story from his very earliest memories to the age of 16, when he finally achieves his much sought after freedom from the well-meaning interventions of Children's Social Services. Along the way, Ben describes some gripping moments such as when, at the age of 9, he is first compelled to run away from home and when, age 12, he is locked in the house of a stranger and held at knife-point.\" \"A truly fascinating read that I couldn't put down.\" Emma\"This is a story of a runaway boy – an example of runaways and homeless people – expressed through the personal experiences of Ben Westwood. The threats, exposure to drug addiction, prostitution, are all encounters Ben has witnessed and are revealed from a destructive and humorous perspective. I can’t imagine a life like this and it is heart-breaking and distressing that many young people live like this in our society.\" \" Like a lot of poetry collections, I find it more rewarding to read the poems in small bursts and consider each poem for its own spirit\" Peter - The reading desk.\"It is a must read for anyone who works with youth that are in foster care, group homes and homeless. This holds true not only in Britain but here in the United States. Ben is a gifted writer.\" Susan Hickey\"A great book honest and heartfelt a genuinely insightful, inspiring and readable book I couldn’t put down.\" Hirst\"An amazing story! highly recommended. It almost felt like the life of a modern day Oliver Twist.I could seriously imagine a film being made of this!Warning: Very difficult to put down once you start reading!!\" Neil Paterson (Cover illustrator)",
  "genres": [
    "Poetry"
  ],
  "author": "Ben  Westwood",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/37554154-poems-from-a-runaway"
}