{
  "title": "Zorro's Last Stand",
  "description": "Zorro’s Last Stand follows the story of a man who chases his past to a drowsy Spanish fishing village. His search for the truth ends in a raucous gun battle between thirty ships, while the majority of the pueblo remains positioned on the beach, defending an ancient tradition. In the fray, a bunch of dysfunctional expats fight to keep their dreams of living in the sun alive. This enigmatic novel oozes glimpses of no-bull-truth, revealing the naked underbelly of being an expat living on the Costa Blanca. This raw novel stirs up a paella of murderous gangsters, eccentric Indian bar owners, a sociopathic hotel owner and a quirky xenophobic cop. The brutal murder of a young English woman - turned prostitute, forbidden love, a donkey named Pedro, and out of work sixty-something-gossipmongers ensconced in the local bar - paint a colourful, ragtag, group of characters. If you're not cringing, you're laughing and wondering, what the hell next?When I moved to Spain twelve years ago, I imagined the expats would be affluent go-getters searching for something new and strange. I pictured intellectuals working on books about their exotic travels and painting watercolour scenes of beach barbeques, backlit by the blue Mediterranean. All while discussing this evening’s meeting at the amateur dramatic society over chilled sangria and various tapas.Instead I was faced with desperate people chasing after the same crumbs, associating with English people they would normally avoid back in the UK. I never thought I would meet Romanian gangsters, British smugglers, property scammers, drug dealers, slave traded prostitutes and murderers. However, they all sat in my local bar wearing cheap flip flops and sawn off clothes. All of them blended in with the latest holiday makers. But this isn’t my story; this is Danny's.I first saw Danny running through the car park of our neighbourhood adjacent to the beach. He was flamboyantly dressed as El Zorro and chasing a breast-heavy woman in her fab-fifties as she desperately clutched a freshly baked baguette and skilfully jogged in her fluffy flip flops.",
  "genres": [],
  "author": "Mark Shearman",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/37564650-zorro-s-last-stand"
}