{
  "title": "0 Absolutes",
  "description": "My name is Yuki Shiro. I am the daughter of winter and shadow. Since birth, I have been trained to be a thief, a spy, and an assassin. I hate my life.  Okay, that was a lie. I kind of love my life, but it just got a lot more complicated. See, I have been summoned to stand before the Empress of Shadows, the wife of my biological father, which makes her my “stepmother,” to receive a mission of vital importance. Great! This totally won’t be a suicide mission.  She’s ordered me to travel to someplace in the middle of nowhere in America, under the cover of a diplomatic representative attending the Yuletide Celebration of some guy claiming the title of High King of the Gray Sidhe. While I’m there, I’m supposed to somehow figure out a way into the rumored underground city beneath the Cœur de Lyon Estates, steal a mirror, avoid any complications or guards, and then bring it back all the way to Tokyo, without getting caught.  Don’t ask me why she wants a mirror, she’s a bit of a crazy woman, but as Empress, her word is law. I don’t have much choice in the matter.  Oh, and to make things even worse? I seem to have developed this strange tattoo that’s decided to grow across my chest, and just what in the name of Susanō’s Ten-Grip-Sword are these empty circles supposed to represent? I’m cursed, aren’t I? That wicked empress probably cursed me. Great.  Can my life get any more complicated?  0 Absolutes is a lead-in story introducing a new complication to the tangled skein of supernaturals converging at the Cœur de Lyon Estates in Colorado, as the Night Parade (Japanese supernaturals) decide to make their presence known to the world. It is connected to the world shared by the A Renaissance Flair novels, but no previous knowledge of those books is necessary—just some shared characters.  Yuki Shiro is a Paranormal Reverse Harem/Polyamorous Urban Fantasy Romance, with one girl and a bunch of guys who are all fated to be together. There may eventually be some sword-crossing, both figuratively and literally, but you’ll have to stay tuned to find out! Some content may not be suitable for younger audiences, due to language, violence, and other adult situations.",
  "genres": [],
  "author": "C.A. Storm",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/37564710-0-absolutes"
}