{
  "title": "Neverday",
  "description": "For almost 20 years, Carlton Mellick III has been writing some of the strangest and most compelling novels the bizarro fiction genre has to offer. Described as one of the top 40 science-fiction writers under the age of 40 by The Guardian and \"one of the most original novelists working today\" by extreme horror legend Edward Lee. In his 57th book, Neverday, Mellick has created a dystopian horror tribute to time loop stories in the tradition of Groundhog Day, Edge of Tomorrow and Happy Death Day.Karl Lybeck has been repeating the same day over and over again, in a constant loop, for what feels like a thousand years. He's been stuck in this endless cycle for so long that he doesn't remember what his life was like before time stopped moving forward. He doesn't remember his parents' faces or what he used to do for a living. He doesn't remember which president is currently in office or what city he lives in. The only reason he remembers his own name is because it's printed on his Oregon State driver's license.He thought he was the only person trapped in this eternal hell until a woman named January appears in his backyard one morning, fleeing armed pursuers who claim to be with the police. She doesn't know why today is exactly the same as yesterday. She doesn't realize she's trapped in the same loop that Karl's been stuck within for so many centuries.But it turns out that Karl and January aren't alone. In fact, the majority of the population has been repeating the same day just as they have been. While Karl was hiding isolated in his suburban home, he didn't realize that a new world was being built just outside of his door. Society has adapted to repeating the same day over and over again. New laws have been implemented. A new memory-based currency has been put into place.Karl and January find themselves in a therapy group with other people who are having a difficult time dealing with their situation--from hospital patients with illnesses that will never be cured to parents who will never see their children grow up. But there's something not quite right about those in charge of the new repeating government. They don't understand why going into the neverday--that time period that only exists if you stay awake all night to avoid repetition--is considered the worst possible crime that anyone can commit.With the help of others who share their suspicions that something is not quite right with their situation, Karl and January explore the neverday in search of answers. But what they discover could destroy the very fabric of their new society forever.",
  "genres": [
    "Bizarro Fiction",
    "Science Fiction",
    "Horror",
    "Fiction"
  ],
  "author": "Carlton Mellick III",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/37572975-neverday"
}