{
  "title": "The Best American Science Fiction and Fantasy 2018",
  "description": "A collection of the best American science fiction and fantasy stories from 2017.Today’s readers of science fiction and fantasy have an appetite for stories that address a wide variety of voices, perspectives, and styles. There is an openness to experiment and pushing boundaries, combined with the classic desire to read about space ships and dragons, future technology and ancient magic, and the places where they intersect. Contemporary science fiction and fantasy looks to accomplish the same goal as ever—to illuminate what it means to be human. With a diverse selection of stories chosen by series editor John Joseph Adams and guest editor N. K. Jemisin, The Best American Science Fiction and Fantasy 2018 explores the ever-expanding and changing world of SFF today, with Jemisin bringing her lyrical, endlessly curious point of view to the series’ latest edition.Rivers Run Free / Charles Payseur --Destroy the City With Me Tonight / Kate Alice Marshall --You Will Always Have Family: A Triptych / Kathleen Kayembe --Justice Systems in Quantum Parallel Probabilities / Lettie Prell --Loneliness is in Your Blood / Cadwell Turnbull --The Hermit of Houston / Samuel R. Delany --The Last Cheng Beng Gift / Jaymee Goh --Brightened Star, Ascending Dawn / A. Merc Rustad --The Resident / Carmen Maria Machado --The Greatest One-Star Restaurant in the Whole Quadrant / Rachael K. Jones --Tasting Notes on the Varietals of the Southern Coast / Gwendolyn Clare --Don't Press Charges and I Won't Sue / Charlie Jane Anders --Church of Birds / Micah Dean Hicks --ZeroS / Peter Watts --Carnival Nine / Caroline M. Yoachim --The Wretched and the Beautiful / E. Lily Yu --The Orange Tree / Maria Dahvana Headley --Cannibal Acts / Maureen McHugh --Black Powder / Maria Dahvana Headley --Zen and the Art of Starship Maintenance / Tobias S. Buckell",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Speculative Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "N.K. Jemisin",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/37570572-the-best-american-science-fiction-and-fantasy-2018"
}