{
  "title": "Bournemouth Boys and Boscombe Girls",
  "description": "We’re the oddballs, weirdoes, comedians, eccentrics, head cases and hard cases, and this book is for those who ‘get it’ In the lead-up to a recent reunion party, many of the old stories came out. We were seasonal workers during the late ‘70s and early ‘80s in Bournemouth. Many worked the deckchairs, some worked hotels, pubs, bars, or nightclubs, either as bar staff or bouncers. We lived off our wits and, yes, from time to time we were rogues, but we had each other’s backs and we had some laughs. This book recalls those days and tells the story of bringing a special group of people back together again after almost 40 years. And do you know what, it was as if we hadn’t skipped a beat. There were even people who’d missed each other first time around, yet all of us have a very rare and exceptional connection. It’s pure magic. Now if you’re reading the above and are thinking this was some kind of school reunion with a bunch of old codgers on Zimmer fames, playing inflatable ball games and drinking Dandelion & Burdock, mate, you’ve got it all wrong! If you’ve worked holiday towns as a seasonal worker, either in the UK or abroad, then you’ll ‘get it’ or if you’re looking to work a season in Spain or Portugal or the South coast of England, then these are the tough but crazy times you can expect. I’ve always loved wild people and wild places, always been drawn to them, and here are some of the stories. Now, for the first time ever, I think I understand what was so special about those years. Yes, at times they were tough, but we stuck with each other through thick and thin, and especially afterwards when we travelled the globe together. We’re not crazy, none of us (well, those in prison and mental asylums might be), but none of us on the ‘out’ are, but we had lively, buoyant and animated fun. We were carefree at an age when you’re supposed to be carefree. The flip side of this, I’m well aware, is that at times it may make some of us feel as if we’re outsiders, a lone wolf so to speak. People occasionally talk about us in hushed tones, whispering that we’re a bit of a loose cannon. They don’t really want to say it to our faces because every now and again we can still be a little unpredictable. But they look at us with a strange curiosity, because in comparison – although they’re often very successful at ‘fitting in’ – they lead lives that are drab, dreary and monotonous. They’re not unruly like you and me. And it’s that unruliness which has kept us young. These are the stories, some told in very funny poetic format, of those years. This book has been published for the people who shared those years to be able to keep a record. If you weren’t around on the south coast during the late 70’s and early 80’s I’d honestly give this book a miss. That’s as honest as we can get, because you won’t know the people involved, and it’s unlikely you’ll ‘get it’ Some of us, you see, weren’t meant to be tamed. We weren’t meant to be pacified or subdued. We were meant to run free until we discovered others just as wild to run with. And after all we’ve been through, we’re still standing and we’re still laughing out loud. And that bothers some people. Danny and I wish to dedicate this book to all who couldn’t be there on the night. Some are living abroad, some are in prison, others in mental institutions, and some have passed on. This isn’t anything morbid. We just want to remember the laughs they gave us. KW",
  "genres": [],
  "author": "Danny Winter",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/37594559-bournemouth-boys-and-boscombe-girls"
}