{
  "title": "The Sleeping Beauty",
  "description": "The story of the beautiful princess who sleeps for a hundred years has captured the imaginations of children for an even longer period of time. How could everyone in a castle - even the flies on the walls - sleep for a century and then wake up? This magical, beautifully illustrated tale begins when the king excludes the most difficult fairy of the kingdom from a feast celebrating the birth of his beautiful daughter Briar Rose. Furious, the fairy storms in and curses the baby, pronouncing that on her fifteenth birthday she will be pricked by a distaff (from a spinning wheel) and fall down dead. The youngest fairy softens the curse to a century-long sleep. Despite the fact that the king burns all the spinning wheels in the kingdom, 15-year-old Briar Rose finds herself in the tower where the evil fairy and her fate await her. The drama of the spell unfurls as she and the other inhabitants of the castle fall instantly asleep, from courtiers to kitchen maids. Thorny briars - moodily captured by Trina Schart Hyman's masterful paintbrush - grow up around the castle. Hyman depicts those who died attempting to break through the maze of thorns to reach the legendary sleeping beauty in a nightmarish illustration. But goodness and true love prevail when the perfect prince does finally find his way through the thick vines.Hyman won a Caldecott Medal for her work in Saint George and the Dragon by Margaret Hodges, and her version of The Sleeping Beauty makes us believe in the magic of the spell. The scenes inside the castle are alive with color and movement and rich with details that children will devour eagerly. Moods and expressions are rendered exquisitely, especially those of the wild, red-haired beauty Briar Rose. This wonderful read-aloud classic is one of Hyman's best.",
  "genres": [
    "Picture Books",
    "Fairy Tales",
    "Childrens",
    "Fantasy",
    "Classics",
    "Fiction",
    "Folklore"
  ],
  "author": "Trina Schart Hyman",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/375990.The_Sleeping_Beauty"
}