{
  "title": "The Illusion of Murder",
  "description": "Accused of murder, Rena is forced to flee the dangerous reach of the real killer, her uncle and planetary leader, Geran Kelshan. Using his political and criminal connections, Geran seeks to dispose of her before she can prove her innocence and expose his complicity. He enlists the aid of her twin sister, Beka, who is a captain in the Guardians, a branch of the Galactic Defense Forces responsible for pursuing criminals. Past animosity between the sisters ensures that there will be no cooperation between the two, and that Rena will find no allies in her sister's squad. However, she is not without resources of her own, and using unrevealed telekinetic talents, she is able to escape off world to Fenaira, a planet obsessed with protecting their environment no matter the cost in human lives.  As Beka and her squad attempt to track Rena down, they are forced to battle the dangerous wildlife and difficult terrain with the limited equipment and supplies allowed by the Fenairan officials. Rena's illusions and tricks slow them down even more, allowing her to increase the distance between them. Geran's other forces, including his chief-of-security assigned as liaison with Beka's squad, further hinder their efforts, threatening to not only prevent them from completing their mission, but also endangering their lives.  The Illusion of Murder is a science fiction story set in the midst of the corrupt democratic society of the Galactic Confederacy. Beka and Rena, forced onto opposite sides of the law, must put their past, with its tangle of old hurts and misconceptions, behind them as they face predator cats, dangerous betrayals, and a shadowy group that believes they know too much. Their very survival depends on them achieving a level of cooperation that neither of them desires, nor believes to be possible.",
  "genres": [],
  "author": "Diane Henson",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/37593981-the-illusion-of-murder"
}