{
  "title": "Empty Planet: The Shock of Global Population Decline",
  "description": "From the authors of the bestselling The Big Shift, a provocative argument that the global population will soon begin to decline, dramatically reshaping the social, political, and economic landscape.For half a century, statisticians, pundits, and politicians have warned that a burgeoning planetary population will soon overwhelm the earth's resources. But a growing number of experts are sounding a different kind of alarm. Rather than growing exponentially, they argue, the global population is headed for a steep decline.Throughout history, depopulation was the product of catastrophe: ice ages, plagues, the collapse of civilizations. This time, however, we're thinning ourselves deliberately, by choosing to have fewer babies than we need to replace ourselves. In much of the developed and developing world, that decline is already underway, as urbanization, women's empowerment, and waning religiosity lead to smaller and smaller families. In Empty Planet, Ibbitson and Bricker travel from South Florida to Sao Paulo, Seoul to Nairobi, Brussels to Delhi to Beijing, drawing on a wealth of research and firsthand reporting to illustrate the dramatic consequences of this population decline--and to show us why the rest of the developing world will soon join in.They find that a smaller global population will bring with it a number of benefits: fewer workers will command higher wages; good jobs will prompt innovation; the environment will improve; the risk of famine will wane; and falling birthrates in the developing world will bring greater affluence and autonomy for women. But enormous disruption lies ahead, too. We can already see the effects in Europe and parts of Asia, as ageing populations and worker shortages weaken the economy and impose crippling demands on healthcare and social security. The United States is well-positioned to successfully navigate these coming demographic shifts--that is, unless growing isolationism and anti-immigrant backlash lead us to close ourselves off just as openness becomes more critical to our survival than ever before.Rigorously researched and deeply compelling, Empty Planet offers a vision of a future that we can no longer prevent--but one that we can shape, if we choose.",
  "genres": [
    "Nonfiction",
    "Science",
    "Politics",
    "Sociology",
    "History",
    "Economics",
    "Anthropology"
  ],
  "author": "Darrell Bricker",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/37585564-empty-planet"
}