{
  "title": "A Primate's Memoir",
  "description": "\"I had never planned to become a savanna baboon when I grew up; instead, I had always assumed I would become a mountain gorilla,\" writes Robert Sapolsky in this witty and riveting chronicle of a scientist's coming-of-age in remote Africa. Raised in an intellectual, immigrant family in Brooklyn, Sapolsky wished he could live in the primate diorama in the Museum of Natural History. He wrote fan letters to primatologists, started reading their textbooks at age fourteen, and even learned Swahili in high school, all with the hopes of one day joining his primate brethren in Africa. Finally, upon graduating from college, Sapolsky's dream comes true when, at age twenty-one, he leaves the comforts of the United States for the very first time to join a baboon troop in Kenya as a \"young transfer male.\" Book smart and naive, Sapolsky sets out to study the relationship between stress and disease. But he soon learns that life in the African bush bears little resemblance to the tranquillity of a museum diorama. He is alone in the middle of the Serengeti with no radio, no television, no electricity, no running water, and no telephone. His nearest neighbors are the Masai, a warlike tribespeople whose marriages are polygamous, with wedding parties featuring tureens of cow's blood. The victim of countless scams and his own idealistic illusions, Sapolsky nevertheless survives culinary atrocities, gunpoint encounters, and a surreal kidnapping, while witnessing the encroachment of the tourist mentality on the farthest vestiges of unspoiled Africa. As he conducts unprecedented physiological research on wild primates, he becomes evermore enamored with his subjects -- unique and compelling characters in their own right -- and he returns to them summer after summer, until tragedy finally prevents him. Here is Robert Sapolsky's exhilarating account of his life in the bush with neighbors both human and primate, by turns hilarious and poignant. The culmination of more than two decades of experience and research, A Primate's Memoir is a magnum opus from one of our foremost scientist-writers.",
  "genres": [
    "Nonfiction",
    "Science",
    "Memoir",
    "Animals",
    "Biology",
    "Biography",
    "Anthropology"
  ],
  "author": "Robert M. Sapolsky",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/376042.A_Primate_s_Memoir"
}