{
  "title": "The Sanctuary",
  "description": "Naples, 1750. In the dead of night, three men with swords burst into the bed chamber of the Marquis de Montferrat. Their leader, Raimundo di Sangro – the Prince of San Severo – accuses him of being an imposter, and demands to know a secret he believes the marquis harbors. The false marquis resists and manages to escape, leaving behind a burning palazzo and a raging prince now obsessed with finding his quarry – and his secret – at any cost.Baghdad, 2003. An army unit tracking Saddam’s cronies stages a spectacular raid on a fortified villa and makes a horrifying discovery in its basement: a state- of-the-art, concealed lab where dozens—men, women, children—have died, the subjects of gruesome experiments. The mysterious scientist they were after, a man believed to be working on a bioweapon and known only as the hakeem—the doctor—escapes, taking with him the startling truth about his work. In one of his victims’ cells, a puzzling clue is left behind: an Ouroboros – the tail devourer – a circular symbol of a snake that’s feeding on its own tail.As the power of the symbol comes to light, revealing the centuries of mystery and pain left in its wake, one unsuspecting woman – Mia Bishop, a geneticist – stands at the center of a conspiracy that could change the world forever. From Baghdad to the chaos of a Beirut still reeling from a fresh war in the fall of 2006, to the lost villages of eastern Turkey and northern Iraq by way of epic chapters set in eighteenth century Europe, and in the masterful hands of international bestseller Raymond Khoury, The Sanctuary delivers the same rapid-fire suspense and provocative scholarship that made The Last Templar an international blockbuster.",
  "genres": [
    "Thriller",
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Adventure",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Raymond Khoury",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/376008.The_Sanctuary"
}