{
  "title": "1,000 Books to Read Before You Die: A Life-Changing List",
  "description": "Celebrate the pleasure of reading and the thrill of discovering new titles in an extraordinary book that’s as compulsively readable, entertaining, surprising, and enlightening as the 1,000-plus titles it recommends. Covering fiction, poetry, science and science fiction, memoir, travel writing, biography, children’s books, history, and more, 1,000 Books to Read Before You Die ranges across cultures and through time to offer an eclectic collection of works that each deserve to come with the recommendation, You have to read this. But it’s not a proscriptive list of the “great works”—rather, it’s a celebration of the glorious mosaic that is our literary heritage. Flip it open to any page and be transfixed by a fresh take on a very favorite book. Or come across a title you always meant to read and never got around to. Or, like browsing in the best kind of bookshop, stumble on a completely unknown author and work, and feel that tingle of discovery. There are classics, of course, and unexpected treasures, too. Lists to help pick and choose, like Offbeat Escapes, or A Long Climb, but What a View. And its alphabetical arrangement by author assures that surprises await on almost every turn of the page, with Cormac McCarthy and The Road next to Robert McCloskey and Make Way for Ducklings, Alice Walker next to Izaac Walton.  There are nuts and bolts, too—best editions to read, other books by the author, “if you like this, you’ll like that” recommendations , and an interesting endnote of adaptations where appropriate. Add it all up, and in fact there are more than six thousand titles by nearly four thousand authors mentioned—a life-changing list for a lifetime of reading.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Reference",
    "Essays",
    "Literary Criticism",
    "Literature",
    "Writing"
  ],
  "author": "James Mustich",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/37588678-1-000-books-to-read-before-you-die"
}