{
  "title": "The Ancient Nine",
  "description": "Cambridge, Massachusetts, Fall 1988Spenser CollinsAn unlikely Harvard prospect, smart and athletic, strapped for cash, determined to succeed. Calls his mother—who raised him on her own in Chicago—every week.Dalton WinthropA white-shoe legacy at Harvard, he's just the most recent in a string of moneyed, privileged Winthrop men in Cambridge. He's got the ease—and the deep knowledge—that come from belonging.These two find enough common ground to become friends, cementing their bond when Spenser is \"punched\" to join the Delphic Club, one of the most exclusive of Harvard's famous all-male final clubs. Founded in the nineteenth century, the Delphic has had titans of industry, Hollywood legends, heads of state, and power brokers among its members.Dalton Winthrop knows firsthand that the Delphic doesn't offer memberships to just anyone. His great-uncle is one of their oldest living members, and Dalton grew up on stories of the club's rituals. But why is his uncle so cryptic about the Ancient Nine, a shadowy group of alums whose identities are unknown and whose power is absolute? They protect the Delphic's darkest and oldest secrets—including what happened to a student who sneaked into the club's stately brick mansion in 1927 and was never seen again.Dalton steers Spenser into deeper and deeper recesses of the club, and beyond, to try to make sense of what they think they may be seeing. But with each scrap of information they get from an octogenarian Crimson graduate, a crumbling newspaper in the library's archives, or one of Harvard's most famous and heavily guarded historical books, a fresh complication trips them up. The more the friends investigate, the more questions they unearth, tangling the story of the club, the disappearance, and the Ancient Nine, until they realize their own lives are in danger.",
  "genres": [
    "Mystery",
    "Fiction",
    "Dark Academia",
    "Thriller",
    "Historical Fiction",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Ian K. Smith",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/37638320-the-ancient-nine"
}