{
  "title": "Mother Tongue: A Saga of Three Generations of Balkan Women",
  "description": "***   A MUST READ FOR TRAVELERS TO CROATIA  *** Mother Tongue is an exploration of lives lived in the chaos of a part of the world known as the Balkans. It follows the lives of three generations of women―Katarina, Zora, and Tania―over the last 100 years. It follows countries that dissolved, formed, and reformed. Lands that were conquered and subjugated by Fascists and Nazis and nationalists. Lives lived in exile, in refugee camps, in new worlds.Tania Romanov's story clarifies the history and geography of Croatia, Serbia and Montenegro by pulling you into the lives of real people. It makes those countries come alive.  And through it all glows a love of language. What language did you speak with your mother? What language did you speak with your father? What language did you speak with your brother? For Tania Romanov there are three different answers to those questions.Did you speak your mother tongue with anyone except your mother? That is the most bizarre question of all. But for Tania Romanov, the answer is no. She spoke a unique language with her mother, one in which she is still fluent. And by the way, it was not her mother's native language.The language is Serbian. Tania's mother was Croatian. Her father was Russian. Tania was born in Serbia, but left when she was six months old. She and her brother grew up in San Francisco speaking English. She didn't speak any language until she was two.Tania doesn't know why she spoke Serbian, rather than Croatian, with her mother Zora. It never occurred to her to ask until she started writing her memoir. And by then, her mother was gone.The country of birth listed on Tania's American passport changed four times in four successive renewals. Until the first time, she believed your country of birth was a fixed point. Today she knows better.Go with her as she journeys through time and history looking for answers, and finding some.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Language",
    "Biography",
    "Autobiography",
    "Travel"
  ],
  "author": "Tania Romanov",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/37634997-mother-tongue"
}