{
  "title": "Soldier On",
  "description": "Take a walk in Army reservist Molly McKinney's boots as she serves our country in Afghanistan and confronts a minefield of interpersonal relationships. Men and women from all walks of life are thrown together on what they call the “rock\" or \"Hell on earth.\" The story follows Molly as she adjusts to her new reality of living in a combat zone, learns the ropes of prison life, and realizes the many complexities of war. Born in Chicago, Molly barely out of her teens is an aspiring doctor who joined the Army Reserve pre-911, mainly to pay for medical school. She is a breath of fresh air in the hot, dusty, hell-hole the soldiers temporarily call home. Molly, with her battle buddy Osborne, a quirky seductress, work alongside active duty troops as MP’s (Military Police) stationed at a prison camp. The insurgents, assumed to have Taliban connections, some awaiting transit to Guantanamo Bay, often fall on the thin line between very scary and somewhat ridiculous. Molly’s life becomes a rollercoaster of fear, passion, pain, and boredom as she guards captured insurgents and she soon realizes that she too is a prisoner of the desolate, and unbearably hot prison. Molly becomes drawn to a quick witted, shameless soldier named Spc. Shaw to get through the long and mundane days of the prison. As her feelings for Shaw grow so does her loathing for the insanely handsome, yet robotic, Sgt. Beck. Sgt. Beck makes it clear on day one that Molly is unfit for the job. In his attempts to take her down he begins to see the true measure of her resilience, courage, determination and fiery temper. As Molly battles her 12-hour work schedule, sleep deprivation, camel spiders and a host of other obstacles while living in a combat zone, Beck, who is sleeping with Molly’s friend, entrusts Molly with a more personal side of himself. As Beck's guard lowers, so does Molly’s and their friendship becomes unbreakable. But when tragedy strikes Molly realizes that some people are not at all what they appear to be.",
  "genres": [
    "Fiction",
    "Military Fiction"
  ],
  "author": "J.D. Wynne",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/37640367-soldier-on"
}