{
  "title": "Crushed: A Journey Through Depression",
  "description": "An inspiring true story of triumph over despair so relatable and unflinchingly honest that you’ll wonder if you’re reading your own story and will start believing in your own happy ending. This captivating narrative empowers the reader with tools to revive hope and facilitate healing. Here’s what readers are saying: I couldn't put it down! I loved how the author showed greatness through trial and tribulation, and how real and raw her emotions were throughout the book. I laughed, I cried, and I celebrated as she conquered life throughout her journey! This book was life changing, deepening my vision as to how we can truly learn and become better from others experiences! Everyone who reads it will find some way that they can relate to the authors experiences and at the same time gain insight as to how to cope with the struggles of life! Such an amazing read! One that I will read over and over again!!! - Misty C. A very personal honest and insightful journey of self-reflection and emotional healing. We are all broken to some degree and need to be aware of some of the tools we have to find healing and mending the things that create a false and negative self-image. Linda has opened herself up in a very vulnerable way to allow you on that journey of healing in the hopes that you may find something of value in there to help with your healing. I did, and I hope you will as well. - Troy J. I couldn't put this book down. Linda is so real, so honest, and made it easy for me to identity things in my own life that I needed to process and let go of. She clearly explains her entire journey, from a lifetime of being depressed and suicidal to finding contentment and self-love. Great book! - Jane D. Heartbreakingly resonant for every invisible woman. A beautifully written display of how generational pain can lead to generational healing. - Sherrie C. Bjork takes readers through some very personal and real struggles and points them to the light at the end of the dark tunnel of depression. She provides readers with resources that allow them to emerge from that tunnel and embrace new levels of happiness. - Debbie E.It's a great read! I hooked from the start and read it in one sitting! I am so happy Linda chose to share her personal journey from such inner turmoil to finding hope and joy in life once more! It makes me wonder how many others may have similar false beliefs about themselves that are holding them back from the joy this life is meant to be. How grateful I am that she was courageous enough to face her struggles and challenge them! She is so open and descriptive of the healing process she took that anyone can benefit from her story. - Lindsay S. Linda is an amazing writer and has done a superb job with this book of self-exploration and mastery over a difficult and debilitating subject. Great and satisfying read. - Marie R. I had a hard time putting it down. This book caused me to think differently about others, and the secret pain that so many carry. But, by far the greater portion of this book is about the process of healing that took the author from crushed to truly recovering, and in the process healing many of her relationships as well. My favorite thing about this book is the detail it gives of the various tools she learned for recovery. It has caused me to think differently in ways that are affecting my own inner happiness. There are many people I know who I hope will read this book and be blessed by it. - David C.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Linda  Bjork",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/37648908-crushed"
}