{
  "title": "Power Play",
  "description": "Power Play, the first book in the Scarcity War Saga, is an adult Science Fiction novel which takes place towards the end of this century. Fast paced and tightly plotted, it is designed to entertain while simultaneously setting the scene for the Saga’s more epic story arc involving multiple, richly drawn characters forced into conflict by the global threat of accelerating scarcity. On a sunny summer’s morning in February 2075, Damien, Arabella and Michael simultaneously discover their Powers and each other. Smart, active, post-grads, they are each about to embark on another year of study when they suddenly realize that they can hear and feel each other’s thoughts and emotions. At first the three attribute this to a BioNet malfunction. Smartphones and wearables have been superseded by implanted SmartChips called BioBots (linked to sensor tattoos - eTats). The BioNet, successor to the Internet, is the ubiquitous network that connects these BioBots. The three soon come to realize, however, that their psychic bond has nothing to do with electronics. For their telepathic ability is not their only Power… Then life gets complicated for these uninhibited, idealistic, post-graduate students. For with these Powers comes insight into just how close the world is to disaster. Over fourteen billion people are alive to witness the winding down of the twenty-first century and two opposing factions are at loggerheads over how to address the growing scarcity of natural resources. On the far right, a secret global fascist conspiracy is surreptitiously enforcing stricter conservation measures in multiple countries, usually at the expense of the less privileged. On the far left, a militant band of libertarian anarchists are willing to do whatever it takes to stop them, even at the cost of civilization itself. In the middle, old established governments appear to be in denial, desperately hoping new technologies and luck will save us all. The Trio believe they can offer a solution based on their Powers, and seek to diffuse growing tensions. They soon discover, however, that they are not the only ones with Powers. And these others have been around a lot longer than them. Worse, the others also seem to have their own, somewhat less altruistic, ideas about what should be done. Power Play explores many contemporary themes without sacrificing pace. It charts the development and interaction of unique and colorful characters who all too often find themselves in extreme situations.",
  "genres": [],
  "author": "Jonathan  Newman",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/37651878-power-play"
}