{
  "title": "Dear, I Hate You",
  "description": "About the book: Unlike any other story, it begins with an end. The protagonist of the story has met with a severe accident and is dying under the sun, on a street of Delhi.Few people are trying to rush him to a nearby hospital but he is slowly losing his grip on his breaths. In the last hours of his life someone asks him a question and with that question he enters into a series of flashbacks from his past life.He remembers his first day at his school, his father’s death, his best friends, his first crush in his school and how he meets her after many years, his gold medal and the time in University, the unfortunate death of the girl who loved him, his life in Banking Academy and his meeting with the man he aspires to be like and the arrival of another girl for whom he was ready to do anything.Is true love an obsession? Can someone live with the guilt of killing someone? Will he survive? Who is he? What brought him here? Was it an accident or something else? “Dear, I hate you!” is about love, hatred, sex and the transition one undergoes when no one is around.About the Author: Nitya Prakash is a versatile personality - author, screen writer, banker, management expert, investment consultant, software engineer, motivational speaker, media man, all rolled in one. He was born and brought up in the city of Nawabs - Lucknow, UP (India). He did his computer graduation from the University of Lucknow, Lucknow followed by an Executive Management Program from K.J.Somaiya Institute of Management & Research, Mumbai and also a Post Graduate Diploma in Banking Management from ICICI Manipal Academy, Bangalore. He is NSDL and AMFI certified, which enables him to work as an investment consultant. He is a ferocious reader and a prolific writer and has been regular in writing many youth awakening articles in TOI and many other reputed magazines. He is the Co-Founder of www.CreativeEcstasy.in, a popular online portal. He can be reached at prakashnitya@ymail.com or www.NityaPrakash.com.",
  "genres": [],
  "author": "Nitya Prakash",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/12242035-dear-i-hate-you"
}