{
  "title": "Money Toughness: Riches of Heaven upon Earth 21 Principles of Financial Success and Abudance A New Transformed Better Lifestyle",
  "description": "This book is designed to be a very practical one. It is intended for the individual whose pressing need is to build a sustainable wealth by laying hold of the infinite riches life has in store in the Heavenly Father’s House. The book is for the individual who desires immediate financial transformation and who is willing to put into application the simple down-to-earth Biblical based principles outlined in detail in this book. Within the book, you will find specific details, illustrations, principles and techniques to apply for tapping into the infinite riches as your natural every day of life. In writing this book, I have focused on the specific principles that the might men and women applied that I also adopted in building my own life from nothing into something exceptionally beautiful life and lifestyle. Adopting this financial toughness perspective to creating wealth is reinforced by the insights gained under the guidance of Mr. Baraka whose name means a blessing in Kiswahili. During each interaction, he blessed me with profound words of wisdom. I have transcribed the messages here as well as added my own life experiences so that you too my dear reader can take part on the journey to financial transformation and jointly the Heavenly Father’s Riches of Heaven upon Earth can bless us as we bring glory to His every blessed name! • Dear reader, are you stuck in the valley of the dry bones, dry bills, dry relationships, and dry careers? • Do you feel like a Better Lifestyle is slowly passing you by? Then this is just the right book for you. Join me as I share excellent life transforming principles for experiencing not only getting out of debt, but principles of flourishing and experiencing a more abundant life by applying principles contained in the Bible. A Better Lifestyle begins at the point whereby you make the confession that you are not yet the best version of yourself and thus you express a hunger for Christ to guide you on your journey of becoming financially tough. Most importantly, you will learn just how to turn nothing into something in your Better Lifestyle, just as I have done. I was born and raised in the Kenyan Kariobangi slums and then I relocated to South Africa with basically the shirt on my back, I was almost homeless on many occasions and I could not afford my tuition fees but with diligence and prayers I managed to turn my lifestyle around. You too can do the same by the power of God the Father, the Son and the Holy Spirit who is ever present rejoicing in seeing you become an overcomer day-by-day and moment-by-moment. A more abundant life and lifestyle is waiting those who desire it! Let that be you my dear reader!",
  "genres": [],
  "author": "Wanjiru Gachie",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/37652976-money-toughness"
}