{
  "title": "قصة حياتي العجيبة",
  "description": "ا الفتاة التى تمكنت من قهر الإعاقة المزدوجة التى أصيبت بها بفقد بصرها وسمعها، ومن المشاركة الفعالة فى الحياة العامة والأنشطة الاجتماعية، وأبتداء من الوقت الذى أصيبت فيه هيلين بالمرض الذى أفقدها السمع والبصر وهى فى عمر 19 شهراً فقط، وإلى أن بلغت العام السابع من عمرها، ظلت محل رعاية أسرتها المحبة لها، والتى منحتها قدراً كبيراً من الحرية فى نطاق المنزل، وبدون أى ضوابط. لذا كانت هيلين تتصرف بطريقة شاذة وفى منتهى السوء كلما حاول أحد أن يحول بينها وبين أن تفعل ما ترغب فيه بالضبط أو تأخذ ما تريده بالتحديد. ولذلك كله فليس من المستغرب أن تشير هيلين إلى اليوم الذى وصلت فيه الأنسة \"آن سوليفان\" لتتولى مسئولية تعليمها باعتباره \"أهم يوم فى حياتها\".. فهو يوم خلاصها من السجن الرهيب.لقد حاولت آن سوليفان ببساطة شديدة تعليم اللغة لهيلين كيلر بنفس الطريقة التى يتعلم بها كل طفل من المحيطين به ولكن عن طريق أبجدية الأيدى لكونها تفتقد المقدرة إلى السمع. وسيجد القارئ فى متن هذا الكتاب وصفاً شائقاً للكيفية التى انتبهت بها هيلين إلى \"فكرة اللغة\" ذاتها، حينما تحققت بعد حيرة طويلة من العلاقة بين الأحاسيس الملسية فى يديها \"الناجمة عن إستخدام أبجدية الأيدى\" وبين الأشياء الحقيقية الموجودة فى العالم.ونظراً لكون هيلين أول شخص كفيف أصم يتلقى تعليماً كاملاً (حتى المرحلة الجامعية) فقد اعتبرت أكثر من مجرد \"فرد من البشر\".. إذ اعتبرت \"حدثاً تعليمياً\". وكان العالم كله فى تلك الفترة يقرأ أخبار تعليمها بكل شغف ويتابع التقارير الخاصة بذلك باهتمام شديد، كما تلقت هيلين العون من أجل مواصلة تعليمها فى صورة هدايا من الكتب وفى صورة هبات مالية من أهل الخير فى كل أنحاء العالم. وشمل الإهتمام بتلك الفتاة الفذة ومعلمتها البارعة ليس المعلمون فقط بل الكتاب والمثقفون وغيرهم من المتهمين بحياة العقل والروح، وهذا الكتاب الذى بين يديك كتبته هيلين كيلر وهى بعد طالبة فى الجامعة عام 1902، لتروى لك لمحات من حياتها وقصتها مع تجربة التعليم خصوصاً فى مراحلها الأولى. وقد تخرجت هيلين فى كلية راد كليف Radcleffe بمرتبة الشرف عام 1904، واختارت منذ ذلك الوقت مسار حياة كانت قد بدأته بالفعل فى الحادية عشرة من عمرها حين قامت بتنظيم حفل شاى من أجل الخير تولت فيه جمع بعض التبرعات المالية من أجل تعليم طفلة أخرى أصغر منها ومحرومة مثلها من نعمتى السمع والبصر.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "History",
    "Autobiography",
    "Biography Memoir",
    "Classics"
  ],
  "author": "Helen Keller",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/37644109"
}