{
  "title": "The Trail Rules",
  "description": "Junior year’s looking up for sixteen-year old Mike. Her new BFF isn’t a sadistic control freak, her boyfriend adores her, and she’s learning to bike in the mountains without decapitating herself on a tree. Well, almost.When she meets a group of riders who welcome her into their pack, she feels like she’s finally found where she belongs. One particular rider—a boy with an amazing smile and an even more amazing ability to see what she’s truly capable of—gives her the confidence to go after what she wants: her own life with her own rules.There’s only one problem—he’s not her boyfriend.Just as things seem to be falling into place, her parents put on the pressure to figure out her future—one that doesn’t include riding. Mike soon realizes that having everything isn’t that great when she’s not the one choosing it. She needs to decide if she’s going to continue to be a follower or step out of the shadows and find her own trail.*****Gold Winner (Special Interest: Sports) 2018 -- Children's Literary ClassicsSilver Winner (YA Fiction General) 2018 -- Moonbeam Children's Book AwardsSilver Winner (YA Romance) 2018 -- Readers' Favorite\"Hooyenga gives us an expertly-written, well-paced narrative and a fascinating and well-developed cast of teen and adult characters. On its surface, it's a simple romance that incorporates high school social drama with personal growth through the physical, emotional, and mental challenge of a sport. Mike is a very likable teen who hasn't yet found her own path or her inner courage. As she gains experience on the bike,she devises ten (plus one) \"trail rules,\" which also help her face the challenges of life. ...this is an extremely positive and engaging story told in a very beautiful way.\" -- Readers' Favorite\"In a must-read book a target audience of teenage girls will coast through, the hilarious yet drama-fueled book THE TRAIL RULES follows one girl's adventure into self-discovery and security, leading to a goose bump-inducing conclusion that will inspire young adults to take worthy risks in their own lives that could reap a handsome reward.\" -- IndieReader\"A fantastic sequel from Melanie Hooyenga... A well-done portrait of life at it's finest--when things end to make way for new challenges and excitement. When love trumps disappointment. And when we find out just how limitless we really are.\" -- YA Books Central\"Mike's story is solidly plotted and well paced, and it shows that a change of heart is only the beginning step in understanding who you are. The characters here ring true, especially Mike, whose evolution and growing self-awareness propel the story forward. The writing has an immediacy and works to bring readers inside of Mike's head. And while there are some melodrama moments, they never overwhelm the narrative,instead, they keep the emotions raw and honest.\" -- The BookLife Prize\"Hooyenga continues to deliver an exciting story with page-turning plotsand sub-plots and an underlying theme of genuine female characters whoare likeably flawed.\" -- Children's Literary Classics",
  "genres": [
    "High School",
    "Romance"
  ],
  "author": "Melanie Hooyenga",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/37650625-the-trail-rules"
}