{
  "title": "Farfall",
  "description": "Secrets. Rebellion. Two men drawn together by a bond that may change the land forever...  Captain Andon Grazon, the poor son of a prostitute, shares a rare bond with Ceris, the only wild-born griffon in the land to bond with a human. He and Ceris are part of the flight corp at Farfall, where he is treated like an outsider and abused by the noble-born riders at the base. When his only friend is killed on patrol, the loss has Andon spiraling down into darkness. The misery of his life leaves him cold and withdrawn, unable to interact with others, and isolated from everyone except Ceris. But after Captain Daren Phalnir and his wing of riders arrive to replace Farfall's lost griffon wing, the powerful and charismatic man brings complications Andon does not need. He doesn't trust the man, no matter how respectful he might seem. Andon has many secrets, and the closer Daren comes to them, the greater the danger to Andon...and to his heart.  After Captain Daren Phalnir arrives at Farfall with Gretnel, his grif, he remains wary. The border base's reputation is anything but pleasant—a place where griffons are considered mere property of the throne, little more than animals. Then he meets a legend: Ceris, the only wilds born griffon to imprint on a man, and her rider, Andon Grazon. Andon is a compelling mystery, keeping Daren at arm's length, remaining hostile, aggressive, and very, very alone. At least until Ceris and Gretnel mate...and discover they may share a true bond, the rarest in existence. Andon's isolation stirs Daren's curiosity and his compassion. He begins to uncover a dark secret, with Andon and Ceris at the center—a secret that may just reach all the way to the throne...  Reader note: contains intense emotional elements. Reader Discretion Advised.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "Dark",
    "Historical",
    "Abuse",
    "Paranormal"
  ],
  "author": "J.C. Owens",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/37656112-farfall"
}