{
  "title": "The Covert Passive Aggressive Narcissist: Recognizing the Traits and Finding Healing After Hidden Emotional and Psychological Abuse",
  "description": "Choosing Therapy selected this book as part of the 2020 Best Books on Narcissism and Narcissistic Personality Disorder.Do you feel confused and exhausted by a relationship, and you can't figure out why?Do you feel like you can't think straight, and the person in your life seems fine, so you wonder if maybe you are the problem?Has someone mentioned you might be with a narcissist, or you wonder yourself, and when you research narcissism, they don't seem to completely fit the description, although some of the traits do ring true?The Covert Passive Aggressive Narcissist is the most comprehensive and helpful book on the topic of covert narcissism. Also available in Spanish as El Nacisista Pasivo Agresivo. Find the answers you are looking for. This book You will see that you are not crazy, that your instincts are correct, and you will learn how to see through covert manipulation and control.The most common description a survivor of this type of relationship will use is crazy-making. The emotional abuse and gaslighting makes you question your own view of reality, and sometimes your own sanity. You will know after reading this book if the person you are with is a covert narcissist, and your experience with them will begin to make sense for the first time.When most people think of a narcissist, they think of someone who is grandiose, obviously self-absorbed, sees themself as superior to others, and throws fits of rage when they don't get their way. But what if the narcissist is one of the nicest people you've ever met? What if they are a great listener, seem to care about others, or are a pillar of the community? What if they are the mother that volunteers at the school, the husband that your friends wish they had, the boss that your co-workers feel so lucky to work for? Parents, spouses, partners, bosses, and friends who are covert narcissists come across as the nicest people. They can be spiritual leaders, therapists, moms who bring over casseroles to needy people, and bosses who everyone loves.A covert narcissist has the same traits of narcissism as the well-known overt type. The difference is when they control and manipulate, when they demean and devalue you, it is done in such a subtle way you don't notice it.This type of narcissism is one of the most damaging forms because the abuse is so hidden and so insidious. You can be in a relationship with a covert narcissist that can last for decades and not realize you are being psychologically and emotionally controlled, manipulated, and abused. There are no visible scars with this form of abuse, and you are usually the only one that experiences their destructive and psychologically debilitating behavior.Living with a covert narcissist drains your spirit and leaves you questioning your own reality.You have been lied to for years, and it is time to finally see the truth of what you have been through, who you really are, and how much you deserve love and happiness.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Relationships",
    "Mental Health",
    "Abuse",
    "Personal Development"
  ],
  "author": "Debbie Mirza",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/37660370-the-covert-passive-aggressive-narcissist"
}