{
  "title": "The Number: One Man's Search for Identity in the Cape Underworld and Prison Gangs",
  "description": "On 9 June 2003, a 43-year-old coloured man named Magadien Wentzel walked out of Pollsmoor Prison in Cape Town. Behind him lay a lifelong career in the 28s, South Africa's oldest and most reviled prison gang, for decades rumoured to have specialised in rape and robbery. In front of him lay the prospect of a law-abiding future, and life in a household of eight adults and six children, none of whom earned a living. Jonny Steinberg met Wentzel in prison in the dying months of 2002. By the time Wentzel was released, he and Steinberg had spent more than 50 hours discussing his life experiences. The Number is an account of their conversations and of Steinberg's journeys to the places and people of Wentzel's past. Wentzel had lived a bewilderingly schizophrenic life, wandering to and fro between three the arcane universe of prison gangs, steeped in a mythology of banditry and retribution, where he was known as JR; the fringes of South Africa's criminal economy, where he lived by a string of stolen names and learned the arts of commercial fraud; and his scattered family which eked out a living int the coloured ghettos of the Cape flats. The Number visits each of those worlds in turn. It is a tale of modern South Africa's historic events seen through the eyes of the country's underclass. Surprisingly, perhaps, it is neither a story of passivity nor despair, but of beguiling ingenuity and cool cynicism. Most of all, the book is an account of memory and identity, of Wentzel's project to make some sense of his bewildering past and something worthy of his future. When Steinberg met him, Wentzel was embarking on a quest to retrieve the name he had been given at birth. He was also beginning the daunting task of gathering together the estranged children he had sired into a nuclear family. It was an eccentric and painful venture for a man with his past, but it has led him to construct an account of himself that begs to be told.",
  "genres": [
    "Nonfiction",
    "South Africa",
    "Africa",
    "Crime",
    "Cape Town",
    "History",
    "True Crime"
  ],
  "author": "Jonny Steinberg",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/376799.The_Number"
}