{
  "title": "Dutch: A Memoir of Ronald Reagan",
  "description": "\"This book, the only biography ever authorized by a sitting President - yet written with complete interpretive freedom - is as revolutionary in method as it is formidable in scholarship. When Ronald Reagan moved into the White House in 1981, one of his first literary guests was Edmund Morris, the Pulitzer Prize-winning biographer of Theodore Roosevelt. Morris developed a fascination for the genial yet inscrutable President and, after Reagan's landslide reelection in 1984, put aside the second volume of his life of Roosevelt to become an observing eye and ear at the White House.\"Coming and going with Reagan's benign approval ('I'm not going to charge up San Juan Hill for you'), Morris found the President to be a man of extraordinary power and mystery. Although the historic early achievements were plain to see - the restoration of American optimism and patriotism, a repowering of the national economy, a massive arms buildup deliberately forcing the 'Evil Empire' of Soviet Communism to come to terms - nobody, let alone Reagan himself, could explain how he succeeded in shaping events to his will. And when Reagan's second term came to grips with some of the most fundamental moral issues of the late twentieth century - at Bitburg and Bergen-Belsen, at Geneva and Reykajavik, publicly outside the Brandenburg Gate ('Mr. Gorbachev, tear down this wall!'), and deep within the mother monastery of the Russian Orthodox Church, Morris realized that he had taken on a subject of epic dimensions.\"Thus began a long biographical pilgrimage to the heart of Ronald Reagan's mystery, beginning with his birth in 1911 in the depths of rural Illinois (where he is still remembered as 'Dutch,' the dreamy son of an alcoholic father and a fiercely religious mother) and progressing through the way stations of an amazingly varied career: young lifeguard (he saved seventy-seven lives), aspiring writer, ace sportscaster, film star, soldier, union leader, corporate spokesman, Governor, and President. Reagan granted Morris full access to his personal papers, including early autobiographical stories and a handwritten White House diary.\"",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Presidents",
    "Politics",
    "American History",
    "Us Presidents"
  ],
  "author": "Edmund Morris",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/376589.Dutch"
}