{
  "title": "‫عبقرية محمد‬",
  "description": "نبذة المؤلف:إنه لنافع لمن يقدرون محمداً، وليس بنافع لمحمد أن يقدروه؛ لأنه فى عظمته الخالدة لا يضار بإنكار، ولا ينال منه بغى الجهلاء، إلا كما نال منه بغى الكفار.. وإنه لنافع للمسلم أن يقدر محمداً بالشواهد والبينات التى يراها غير المسلم، فلا يسعه إلا أن يقدرها ويجرى على مجراه فيها.. لأن مسلماً يقدر محمداً على هذا النحو يحب محمداً مرتين: مرة بحكم دينه الذى لا يشاركه فيه غيره، ومرة بحكم الشمائل الإنسانية التى يشترك فيها جميع الناس. وحسبنا من \"عبقرية محمد\" أن نقيم البرهان على أن محمداً عظيم فى كل ميزان: عظيم فى ميزان الدين، وعظيم فى ميزان العلم، وعظيم فى ميزان الشعور، وعظيم عند من يختلفون فى العقائد، ولا يسعهم أن يختلفوا فى الطبائع الآدمية، إلا أن يرين العنت على الطبائع فتنحرف عن السواء وهى خاسرة بانحرافها، ولا خسارة على السواء. إن عمل محمد لكاف جد الكفاية لتخويله المكان الأسنى من التعظيم والإعجاب والثناء... إنه نقل قومه من الإيمان بالأصنام إلى الإيمان بالله، ولم تكن أصناماً كأصناه يويان، يحسب للمعجب بها ذوق الجمال إن فاته أن يحسب له هدى الضمير.. ولكنها أصنام شائهات كتعاويذ السحر التى تفسد الأذواق وتفسد العقول..فنقلهم محمد من عبادة هذه الدمامة إلى عبادة الحق الأعلى.. عبادة خالق الكون الذى لا خالق سواه، ونقل العالم كله من ركود إلى حركة، ومن فوضى إلى نظام، ومن مهانة حيوانية إلى كرامة إنسانية، ولم ينقله هذه النقلة قبله ولا بعده أحد من أصحاب الدعوات...إن عمله هذا لكاف لتخويله المكان الأسنى بين صفوف الأخيار الخالدين، فما من أحد يضن على صاحب هذا العمل بالتوقير ثم يجود بالتوقير على اسم إنسان. إلا أننا نمضى خطوة وراء هذا، حين نقول إن التعظيم حق \"لعبقرية محمد\" ولو لم تقترن بعمل محمد.. لأن العبقرية قيمة فى النفس قبل أن تبرزها الأعمال، ويكتب لها التوفيق، وهى وحدها قيمة يغالى بها التقويم.. فإذا رجح بمحمد ميزان العبقرية، وميزان العمل، وميزان العقيدة؛ فهو نبى عظيم وبطل عظيم وإنسان عظيم. وحسبنا من كتابنا هذا أن يكون بناناً تومىء إلى تلك العظمة فى آفاقها، فإن البنان لأقدر على الإشارة من الباع على الإحاطة، وأفضل من عجز المحيط طاقة المشير..",
  "genres": [
    "Religion",
    "Biography",
    "History",
    "Nonfiction",
    "Audiobook",
    "Spirituality",
    "Islam"
  ],
  "author": "عباس محمود العقاد",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/37656763"
}