{
  "title": "El hilo rojo que une el abandono",
  "description": "En esta colección de “cuentos oscuros”, Shūji Terayama cose con el hilo rojo del título retazos de desamor y de soledad, de accidentes y de decepciones. Y lo hace desde un realismo mágico muy personal, en ocasiones copiando o parodiando el estilo de los clásicos cuentos de hadas.En “El hilo rojo que une el abandono”(1978) encontramos pájaros que hablan como humanos, humanos que hablan como pájaros, tijeras mágicas, lazos embrujados, clínicas experimentales, tiendas extrañas, juegos que acaban mal y sobre todo amantes trágicos y personajes incomprendidos, en una colección de cuentos que se resiste a que sus protagonistas sean felices y coman perdices.“Presentados como inocentes cuentos, las historias de El hilo rojo que une el abandono tejen lo real y lo imaginado. Los personajes de Terayama se embarcan en una aparentemente tradicional búsqueda del amor, pero siempre terminan en situaciones perturbadoras e increíbles.”Shūji Terayama nació el 10 de diciembre de 1935 en Aomori (Japón) y murió el 4 de mayo de 1983 en Tokio (Japón). Fue un artista polifacético y miembro prominente del underground cultural japonés de los 60 y 70, en un punto intermedio entre Yukio Mishima y Les Rallizes Denudés. En sus 47 años de vida, y aproximadamente 30 años de carrera como escritor, cineasta, poeta, fotógrafo, músico y dramaturgo, publicó más de veinte libros, estrenó unas quince obras de teatro y rodó ocho películas. Es por esta última faceta por la que más se le conoce en Occidente, gracias a títulos como “Pastoral” o “Emperor Tomato Ketchup”, mientras que en Japón es reconocido sobre todo como poeta. “El hilo rojo que une el abandono” (1978) es su primer título publicado en castellano.",
  "genres": [
    "Short Stories",
    "Japan",
    "Japanese Literature",
    "Fiction",
    "Literature",
    "Weird Fiction",
    "Magical Realism"
  ],
  "author": "Shūji Terayama",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/37671970-el-hilo-rojo-que-une-el-abandono"
}