{
  "title": "Hope Rising",
  "description": "The last mass-extinction event was 65 million years ago. The next one is today. The nation’s newest and most hi-tech reconnaissance submarine, the SS Beowulf, was heading to Hawaii with only a skeleton crew aboard when the world ended. No one knows exactly what happened, but the blackened sky is raining down ash and the world is getting colder by the minute. Petty Officer Third Class Storm McClain has just been assigned duty aboard the SS Beowulf. He arrives just after the Beowulf’s shakedown cruise and quickly learns that his new duty station is already headed back to dry dock to get a major repair. He remains onboard as part of the truncated crew that will see the boat on its way to Pearl Harbor. McClain’s duties change abruptly after a minor detour welcomes some civilians aboard. It’s during this time that something violent and disastrous happens to the world above. Was it a meteor strike? Did a super volcano erupt? No one knows, but it’s quickly looking like a modern mass-extinction event. Perhaps the safest place to be is aboard the Beowulf, but now nearly half the existing ‘crew’ are a bunch of untrained civilians. They’re going to have to work together to survive in a rapidly changing world. Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, and Ghosts of Ophidian. A veteran of the US Navy, Scott McElhaney served aboard the USS South Carolina during Operation Desert Shield operating in the Red Sea. With over 250,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, One Crazy Summer, and Erinyes by McElhaney. EDITORIAL  \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer and Vine Voice Michael Gallagher Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/37676195-hope-rising"
}