{
  "title": "The Tragedy of American Compassion",
  "description": "Can a man be content with a piece of bread and some change tossed his way from a passerby? Today's modern welfare state expects he can. Those who control the money in our society think that giving a dollar at the train station and then appropriating a billion dollars for federal housing can cure the ails of the homeless and the poor. But the crisis of the modern welfare state is more than a crisis of government. Private charities that dispense aid indiscriminately while ignoring the moral and spiritual needs of the poor are also to blame. Like animals in the zoo at feeding time, the needy are given a plate of food but rarely receive the love and time that only a person can give. Poverty fighters 100 years ago were more compassionate--in the literal meaning of \"suffering with\"--than many of us are now. They opened their own homes to deserted women and children. They offered employment to nomadic men who had abandoned hope and human contact. Most significantly, they made moral demands on recipients of aid. They saw family, work, freedom, and faith as central to our being, not as life-style options. No one was allowed to eat and run. Some kind of honest labor was required of those who needed food or a place to sleep in return. Woodyards next to homeless shelters were as common in the 1890s as liquor stores are in the 1990s. When an able bodied woman sought relief, she was given a seat in the \"sewing room\" and asked to work on garments given to the helpless poor. To begin where poverty fighters a century ago began, Marvin Olasky emphasizes seven ideas that recent welfare practice has put affiliation, bonding, categorization, discernment, employment, freedom, and most importantly, belief in God. In the end, not much will be accomplished without a spiritual revival that transforms the everyday advice we give and receive, and the way we lead our lives. It's time we realized that there is only so much that public policy can do. That only a richness of spirit can battle a poverty of soul. The century-old question--does any given scheme of help... make great demands on men to give themselves to their brethren?--is still the right one to ask. Most of our 20th-century schemes have failed. It's time to learn from the warm hearts and hard heads of the 19th-century. \"We are indebted to Olasky for bringing past lessons of history to bear on a present cultural crisis. Another great work by one of today's foremost thinkers.\" --Charles W. Colson, Chairman, Prison Fellowship \"A comprehensive, well documented, and much needed study of the decline of true compassion that provides fresh analysis and provocative insight into the causes and cures of this American tragedy. Must reading for people who want to understand and help correct the plight of hurting people.\" --Dr. Anthony T. Evans, President, The Urban Alternative \"Those who read and understand Olasky's work will be better prepared to move creatively in affirming the dignity of the poor, and in affirming work as a virtue.\" --John Perkins, Publisher, Urban Family magazine \"Marvin Olasky's perceptive book shows how we, as individuals and in community with one another, can best demonstrate the genuine compassion that the poor need most of all.\" --Doug Bandow, Senior Fellow, Cato Institute \"Finally someone has put the horse and the cart in the right order. Marvin Olasky neither shuns compassion nor assistance for the poor, but rather gives the historical definition of each and assigns them their proper priority. Not only can this book benefit the truly needy, it can benefit the country. Not a bad accomplishment for one book.\" --Cal Thomas, Los Angeles Times Syndicate",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Economics",
    "American History",
    "Cultural",
    "Christian"
  ],
  "author": "Marvin Olasky",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/37663.The_Tragedy_of_American_Compassion"
}