{
  "title": "Snow Moon Rising",
  "description": "Mischka Gallo, a proud Roma woman, knows horses, dancing, and travel. Every day since her birth, she and her extended family have been on the road in their vardo wagons meandering mostly through Poland and Germany. She learned early to ignore the taunts and insults of all those who call her people \"Gypsies\" and do not understand their close-knit society and way of life. Pauline \"Pippi\" Stanek has lived a settled life in a small German town along the eastern border of Poland and Germany. In her mid-teens, she meets Mischka and her family through her brother, Emil Stanek, a World War I soldier who went AWOL and was adopted by Mischka's troupe. Mischka and Pippi become fast friends, and they keep in touch over the years. But then, the Second World War heats up, and all of Europe is in turmoil. Men are conscripted into the Axis or the Allied armies, \"undesirables\" are turned over to slave labor camps, and with every day that passes, the danger for Mischka, Emil, and their families increases. The Nazi forces will not stop until they've rounded up and destroyed every Gypsy, Jew, dissident, and homosexual. On the run and separated from her family, Mischka can hardly comprehend the obstacles that face her. When she is captured, she must use all her wits just to stay alive. Can Mischka survive through the hell of the war in Europe and find her family? In a world beset by war, two women on either side of the conflagration breach the divide-and save one another. Snow Moon Rising is a stunning novel of two women's enduring love and friendship across family, clan, and cultural barriers. It's a novel of desperation and honor, hope and fear at a time when the world was split into a million pieces.",
  "genres": [
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Lesbian",
    "LGBT",
    "Poland",
    "World War II"
  ],
  "author": "Lori L. Lake",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/376918.Snow_Moon_Rising"
}