{
  "title": "Lost Lake",
  "description": "Vanessa Kohler wakes from a sound sleep in a California lakeside mansion to find her host, a young Congressman, near death--he's been tortured, his safe is wide open--and the man who seems to have attacked him, is about to flee the house, is Carl Price, someone she once loved. Missing are the documents that prove Vanessa's father, the General, runs a covert military unit of assassins who answer only to him. Once the General arrives on the scene and hustles her off to a mental hospital where she's held for more than a year, her charges are dismissed as the rantings of a crazy woman. A decade later Carl Price reappears, caught in an incident at a Little League game in Oregon that briefly makes the national news and thus brings him to Vanessa's notice again. But by now she's a tabloid reporter, so even those who don't know about her stint in the asylum won't take her charges against the General seriously. And Carl Price may have killed the Congressman, but he's the only person who can prove that the Unit exists; if Vanessa doesn't get him before the General has him killed, he'll never be able to corroborrate her story, and the General may well be elected President. Vanessa's a more interesting, if less likeable and engaging heroine than Ami, the woman lawyer who tries to help the man she knows as Dan Morelli, a.k.a. Carl Price, who makes beautiful furniture, lives comfortably in the apartment over her garage, and is a surrogate father to her young son. But the official records of Carl Price reveal a whole other side of her friend and client, and when the psychiatrist to whom Dan has also revealed his alter identity and the General's secret is tortured and killed in the same way the Congressman was, she's not certain whom to believe. The complicated plot is a little over the top, but Margolin drives his thriller to its bloody denouement with the same fast pace and velocity that will probably drive it to the bestseller list, just like his previous books. --Jane Adams",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Legal Thriller",
    "Crime"
  ],
  "author": "Phillip Margolin",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/376915.Lost_Lake"
}