{
  "title": "Twenty Thousand Leagues Under the Sea",
  "description": "Twenty Thousand Leagues Under the Sea, by Jules Verne, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. Widely regarded as the father of modern science fiction, Jules Verne wrote more than seventy books and created hundreds of memorable characters. His most popular novel, Twenty Thousand Leagues Under the Sea, is not only a brilliant piece of scientific prophecy, but also a thrilling story with superb, subtle characterizations.The year is 1866 and the Pacific Ocean is being terrorized by a deadly sea monster. The U.S. government dispatches marine-life specialist Pierre Aronnax to investigate aboard the warship Abraham Lincoln. When the ship is sunk by the mysterious creature, he and two other survivors discover that the monster is in fact a marvelous submarine—the Nautilus—commanded by the brilliant but bitter Captain Nemo. Nemo refuses to let his guests return to land, but instead taking them on a series of fantastic adventures in which they encounter underwater forests, giant clams, monster storms, huge squid, treacherous polar ice and—most spectacular of all—the magnificent lost city of Atlantis!Victoria Blake is a freelance writer. She has worked at the Paris Review and contributed to the Boulder Daily Camera, small literary presses in the United States, and English-language publications in Bangkok, Thailand. She currently lives and works in San Diego, California.",
  "genres": [
    "Classics",
    "Science Fiction",
    "Fiction",
    "Adventure",
    "Fantasy",
    "France",
    "Audiobook"
  ],
  "author": "Jules Verne",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/376976.Twenty_Thousand_Leagues_Under_the_Sea"
}