{
  "title": "Palaces for the People: How Social Infrastructure Can Help Fight Inequality, Polarization, and the Decline of Civic Life",
  "description": "An eminent sociologist and bestselling author offers an inspiring blueprint for rebuilding our fractured society.  We are living in a time of deep divisions. Americans are sorting themselves along racial, religious, and cultural lines, leading to a level of polarization that the country hasn't seen since the Civil War. Pundits and politicians are calling for us to come together, to find common purpose. But how, exactly, can this be done?In Palaces for the People, Eric Klinenberg suggests a way forward. He believes that the future of democratic societies rests not simply on shared values but on shared spaces: the libraries, childcare centers, bookstores, churches, synagogues, and parks where crucial, sometimes life-saving connections, are formed. These are places where people gather and linger, making friends across group lines and strengthening the entire community. Klinenberg calls this the \"social infrastructure\" When it is strong, neighborhoods flourish; when it is neglected, as it has been in recent years, families and individuals must fend for themselves.Klinenberg takes us around the globe--from a floating school in Bangladesh to an arts incubator in Chicago, from a soccer pitch in Queens to an evangelical church in Houston--to show how social infrastructure is helping to solve some of our most pressing challenges: isolation, crime, education, addiction, political polarization, and even climate change.Richly reported, elegantly written, and ultimately uplifting, Palaces for the People urges us to acknowledge the crucial role these spaces play in civic life. Our social infrastructure could be the key to bridging our seemingly unbridgeable divides--and safeguarding democracy.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Politics",
    "Urban Planning",
    "Social Justice",
    "Urbanism",
    "Audiobook"
  ],
  "author": "Eric Klinenberg",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/37707827-palaces-for-the-people"
}