{
  "title": "Circle for Hekate - Volume I: History & Mythology",
  "description": "In Circle for Hekate – Volume I: History & Mythology, the author draws together scholarly research from a wide range of sources, highlighting the manifold and universal nature of this extraordinary goddess. The book serves as a comprehensive introduction to her many myths and legends, viewed through the Divine Ancestry attributed to her in Hesiod’s Theogony (800-700BCE), as well as an exploration of her conflation with other goddesses, archaeology, literature, and iconography.  Hekate’s worship was never limited to one geographical region. Her presence is well attested in Greece and Turkey, as well as Egypt, Bulgaria, Macedonia, Russia, Afghanistan, Libya, Syria, Sicily and Southern Italy. She has possible links to Minoan Crete, her most famous temple stood in Lagina, and she was a popular goddess in ancient Athens. Her history reveals many fascinating stories: how Hekate Phosphoros saved ancient Byzantium from an invasion by Phillip II of Macedonia (father of Alexander the Great); and how a visit to her temple in Ephesus influenced Julian the Apostate, the last Pagan Emperor of Rome.  Hekate was connected to Artemis, Demeter, Persephone, Isis, Diana, Despoina and other significant goddesses, appearing in single-and triple-bodied forms, as well as theriocephalic emanations with the heads of various animals. She shared the symbols of the torch, whip, snake and dagger with the Erinyes, and wielded the key to the Mysteries, wearing variously the modius, polos, kalathos and Phrygian cap. She shared paeans with Dionysos, stood with Hermes at the throne of the Phrygian Kybele, and sat next to Zeus in the cult of the Empty Throne. Far from being an obscure goddess, her torches illuminated the Mysteries at Eleusis, Samothrace, Aegina and Ephesus, leading the way for initiates.  Suitable for reading as a standalone text by those fascinated in the history and myths related to Hekate, Circle for Hekate: History & Mythology also serves as background reading for those wishing to pursue a more practical understanding of the goddess, providing a clear contextual foundation for practice. Subsequent volumes in this series build upon the foundation provided in this first book to include devotional rites, meditations, contemplations and charms, giving readers the opportunity to develop their own personal understandings and relationships with this goddess.",
  "genres": [
    "Nonfiction",
    "Witchcraft",
    "Occult",
    "Spirituality",
    "Mythology",
    "Religion",
    "Paganism"
  ],
  "author": "D'Este D'Este",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/37715442-circle-for-hekate---volume-i"
}