{
  "title": "Desired",
  "description": "\"A book to rival TWILIGHT and VAMPIRE DIARIES, and one that will have you wanting to keep reading until the very last page! If you are into adventure, love and vampires this book is the one for you!\"--Vampirebooksite. com (re Turned)DESIRED is book #5 in the Bestselling series THE VAMPIRE JOURNALS, which begins with TURNED (Book #1), a free download on Amazon with over 600 five star reviews!In DESIRED (Book #5 in the Vampire Journals), Caitlin Paine wakes to discover that she has once again traveled back in time. This time, she has landed in eighteenth century Paris, an age of great opulence, of kings and queens—but also of revolution.Reunited with her true love, Caleb, the two of them finally have the quiet, romantic time together that they never had. They spend idyllic time together in the city of Paris, visiting its most romantic sites, as their love grows ever deeper. Caitlin decides to give up the search for her father, so that she can savor this time and place, and spend her life with Caleb. Caleb takes her to his medieval castle, near the ocean, and Caitlin is happier than she ever dreamed.But their idyllic time together is not destined to last forever, and events intercede that force the two of them apart. Caitlin once again finds herself united with Aiden and his coven, with Polly and with new friends, as she focuses again on her training, and on her mission. She is introduced to the lavish world of Versailles, and encounters outfits and opulence beyond what she ever dreamed. With never ending feasts and parties and concerts, Versailles is a world of its own. She is happily reunited with her bother Sam, who is also back in time, and having dreams of their father, too.But all is not as well as it seems. Kyle has traveled back in time, too—this time, with his evil sidekick, Sergei—and he is more determined than ever to kill Caitlin. And Sam and Polly each fall ever deeper into toxic relationships, which just might threaten to destroy everything around them.As Caitlin becomes a true and hardened warrior, she comes closer than ever to finding her father, and the mythical Shield. The climactic, action-packed ending, takes Caitlin through a whirlwind of Paris’ most important medieval locations, on a hunt for clues. But surviving this time will demand skills she never dreamed she had. And reuniting with Caleb will require her to make the hardest choices—and sacrifices—of her life.“DESIRED is very well balanced. It was the perfect amount of words and a great follow-up for all the other books. The characters are very believable and I really care about what happens to them.”--The Romance ReviewsAll 11 books in THE VAMPIRE JOURNALS are now available!",
  "genres": [
    "Vampires",
    "Paranormal",
    "Fantasy",
    "Young Adult",
    "Romance",
    "Fiction",
    "Supernatural"
  ],
  "author": "Morgan Rice",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/12244575-desired"
}