{
  "title": "Etta",
  "description": "Beautiful, elusive, and refined, Etta Place captivated the nation at the turn of the last century as she dodged the law with the Wild Bunch, led by Butch Cassidy and the Sundance Kid. Her true identity and fate have remained a mystery that has tantalized historians for decades. Now, for the first time, Gerald Kolpan envisions this remarkable woman’s life in a stunning debut novel.Kolpan imagines that Etta Place was born Lorinda Jameson, the daughter of a prominent financier, who becomes known as the loveliest of the city’s debutantes when she makes her entrance into Philadelphia society. Though her position in life is already assured, her true calling is on horseback. She can ride as well as any man and handle a rifle even better. But when a tragedy leads to a dramatic reversal of fortune, Lorinda is left orphaned, penniless, homeless, and pursued by the ruthless Black Hand mafia.Rechristened “Etta Place” to ensure her safety, the young woman travels to the farthest reaches of civilization, working as a “Harvey Girl” waitress in Grand Junction, Colorado. There, fate intervenes once more and she again finds herself on the run from the ruthless Pinkerton Detective Agency. But this time she has company. She soon finds herself at the legendary hideout at Hole-in-the-Wall, Wyoming, where she meets the charismatic Butch Cassidy and the handsome, troubled Harry Longbaugh, a.k.a. the Sundance Kid. Through a series of holdups and heists, Etta and Harry begin an epic and ultimately tragic romance, which will be the greatest of Etta’s life. Then, when Etta meets the young and idealistic Eleanor Roosevelt, her life is changed forever.Blending a compelling love story, high adventure, and thrilling historical drama, Etta is an electrifying novel. With a sweeping 1900s setting, colorful storytelling, and larger-than-life characters, Etta is debut that is both captivating and unforgettable.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Westerns",
    "Historical",
    "Book Club",
    "Romance",
    "Literary Fiction"
  ],
  "author": "Gerald Kolpan",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/3775435-etta"
}