{
  "title": "The Intruders",
  "description": "1973. The skies over Vietnam have finally gone silent. America has pulled out, the war is over. But for Lieutenant Jake Grafton, USN, fresh from two combat cruises and a harrowing shoot-down over Laos, the personal battle is just beginning.... His country has not welcomed him home with open arms, but with closed minds and closed fists. When his girlfriend's father called him a murderer, Jake walked away. But when a stranger in a bar challenged his honor, the man was not so lucky - the guy landed in the hospital. Jake landed in jail. And Grafton's shore-duty commander, who bailed him out, has devised the perfect punishment for his ace flight instructor: an eight-month cruise on the aircraft carrier Columbia teaching jarheads - Marines - the nuances of carrier aviation. Flying missions over Vietnam was a living hell; now, as a Navy man working side by side with Marines who have no carrier aviation experience, Grafton's about to discover another world of fresh hell. The Marines may be made of tempered steel and brass balls, but taking off and landing from a slippery flight deck, on a choppy sea in a pitch-black night, there is no margin for error - or for animosity. And men like Marine Captain Flap Le Beau, his bombardier and navigator, have a real gift for pushing Jake's buttons. But he's going to have to learn to live with him...or die trying. They belong to the same society of warriors, they fought in the same war, they drink the same whiskey to toast fallen comrades. Now they must fly together in the same cockpit, must lock into each other and into their million-dollar machine, and make the split-second decisions which will insure that, tonight, their fellow pilots won't raise a glass to them.2 cassettes, 3 hours",
  "genres": [
    "Fiction",
    "Thriller",
    "Military Fiction",
    "Adventure",
    "Action",
    "War",
    "Aviation"
  ],
  "author": "Stephen Coonts",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/377414.The_Intruders"
}