{
  "title": "How To Create Positive Change in 21 Days: Be Brave, Put YOURSELF First",
  "description": "You have a dream to achieve. You have that one idea that, if implemented, you know it will add to your success. But you are scared. You have been struggling to overcome the obstacles in your life; these obstacles could be anything or anyone.This self-help book is your guide to moving forward in your life, to overcome those obstacles in your life, to rid your mind of those negative memories, and bring in new, more positive thought processes. This book is your guide to creating that positive change you need to succeed in life in just 21 days!It is much more than the collection of the blog posts I had written during my Mission #WUNITT (Wake Up, Now Is The Time). As you read through the book, you will realise that you do not require any particular set of skills to deal with the reasons or things that hinder your growth. All you need is a mindset and a plan to achieve your goals.- Learn how to feed your mind with a plan- Learn how to use affirmations to give yourself a boost- Learn the secrets and benefits of getting up early- Learn how to boost your self-confidence and self-worth- Learn how to manage your time effectivelyGet the copy of motivational book titled \"HOW TO CREATE POSITIVE CHANGE IN 21 DAYS\" to be the best version of yourself you can be!---------------------------------------------------------------------------------------------------------------------------------------------About Author Sara KhanSara Khan is an author, writer and social media strategist. She holds a Masters in Journalism and Mass Communication. She was honoured with Khateeb-e-Akbar Samman by Shia P.G. College, Lucknow. She has been associated with online media since 2011. She began her writing career in early 2008, and has written two books – Separated! And How To Create Positive Change in 21 Days; both are non-fiction, self-help books. Sara enjoys sharing her observations on the different aspects of life through her writings. Her writings are more focused towards the betterment of women.She wrote her first book Separated! in an effort to help and support the married women going through a lot of stress during separation and divorce process.How to Create Positive Change in 21 Days, is her second book where she shares her experience on how getting up early in the morning transformed her goals into a reality, and transformed her into a stronger person.Besides, she is a motivational speaker and owns two blogs – a motivational and a food blog, named Foodeez Junction. She is also named among the top food bloggers in Hyderabad; she has stayed there for a year.---------------------------------------------------------------------------------------------------------------------------------------------Message to YouDo not trust anyone else except youThat’s the true worth of you--------------------------------------------------------------------------------------------Order Paperback Now to Get the Kindle Version of the Book Free",
  "genres": [],
  "author": "Sara   Khan",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/37764681-how-to-create-positive-change-in-21-days"
}