{
  "title": "Romance Novels & RPGs",
  "description": "They were the most elite, totally dark, special operations team. On. The. Planet. Officially, Wraith team did not exist in any known database. Unofficially, the team of badass SEALs were the ghosts who handled the missions that official spec ops teams couldn't touch, and didn't want to. Until they were betrayed by the covert CIA unit controlling them.  When the enemy changed the rules of engagement and went after their women, the newly decommissioned SEAL team perceived it as a declaration of war. In retaliation, they formed their own private security agency. INVICTUS Security had one mission objective: To destroy the Illuminati, the secret cabal behind the CIA unit.  Against all odds. At any cost.  Failure was not an option.  A man skilled at torture. A sadistic killer. An innocent woman caught in the middle.  Jaxon 'Blade' Caulder was a former Navy SEAL whose enhanced interrogation training had been acquired at CIA black sites that made Gitmo look like summer camp. Jax was not a violent man, but he was a man capable of great violence. How much he'd never known until an enemy targeted his woman. Now nothing will stop him from exacting vengeance with ruthless intent. And without a shred of mercy.  Kira 'Vixen' Walker was the one woman created just for him. She saw through his shield of cold, clinical detachment to the caring, compassionate, closet romantic hidden inside. A man willing to do anything for the woman he loved. And the Happily Ever After he craved.  Series Reading Order: 1 - FUBAR & Fur Rugs 2 - Steel Balls & Stilettos 3 - Romance Novels & RPGs 4 - Raven's Redemption 5 - Shitkickers & Satin Sheets (Coming Soon)  Or the boxed sets: Invictus Security Volume One - FUBAR & Fur Rugs and Steel Balls & Stilettos Invictus Security Volume Two - Romance Novels & RPGs and Raven's Redemption",
  "genres": [],
  "author": "Tonya Brooks",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/37757363-romance-novels-rpgs"
}