{
  "title": "The Last Madam: A Life in the New Orleans Underworld",
  "description": "The “raunchy, hilarious, and thrilling” true story of the incomparable Norma Wallace, proprietor of a notorious 1920s New Orleans brothel (NPR).  Norma Wallace grew up fast. In 1916, at fifteen years old, she went to work as a streetwalker in New Orleans’ French Quarter. By the 1920s, she was a “landlady”—or, more precisely, the madam of what became one of the city’s most lavish brothels. It was frequented by politicians, movie stars, gangsters, and even the notoriously corrupt police force. But Wallace acquired more than just repeat customers. There were friends, lovers . . . and also enemies.   Wallace’s romantic interests ran the gamut from a bootlegger who shot her during a fight to a famed bandleader to the boy next door, thirty-nine years her junior, who became her fifth husband. She knew all of the Crescent City’s dirty little secrets, and used them to protect her own interests—she never got so much as a traffic ticket, until the early 1960s, when District Attorney Jim Garrison decided to clean up vice and corruption. After a jail stay, Wallace went legitimate as successfully as she had gone criminal, with a lucrative restaurant business—but it was love that would undo her in the end.  The Last Madam combines original research with Wallace’s personal memoirs, bringing to life an era in New Orleans history rife with charm and decadence, resurrecting “a secret world, like those uncovered by Luc Sante and James Ellroy” (Publishers Weekly). It reveals the colorful, unforgettable woman who reigned as an underworld queen and “capture[s] perfectly the essential, earthy complexity of the most fascinating city on this continent” (Robert Olen Butler).",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "True Crime",
    "Book Club",
    "Crime",
    "Biography Memoir"
  ],
  "author": "Christine Wiltz",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/37758452-the-last-madam"
}