{
  "title": "The Magical Realms of Elfin: Answers to Questions About Being an Elf and Following the Elven Path",
  "description": "THE MAGICAL REALMS OF ELFIN contains questions and answers about being elven that many people who are exploring the Elven Way have posed to The Silver Elves throughout the 40 + years that they have been living and sharing the Elven Way. The Silver Elves have put them all in this one book for all those who need a convenient, yet thorough and easy-to-read, resource to explore their questions about who the modern elves are and about the Elven Way or elven spiritual path -- past, present and future.Most often, a person has questions as one tries: to decide if one is ones'elf an elf or is some otherkin; to understand what it means to be an elf and how one might know of one's elfin nature; to understand one's experience of having an Elven Awakening; to determine how elven magic is alike or different from that performed by other spiritual groups; to understand the keys to elven magic and enchantment; to explore more about being an elf in a human body and how this is possible; and to learn about how elves live and relate to mankind and otherkin. All of this is covered in The Magical Realms of Elfin along with a complete section for each answer about a myriad of questions about elves, to name just a few: How do you know if a person is an elf or faerie or pixie or whatever? Are there really diminutive Fae Folk? How do you give Elven Blessings? Why are elves born into the normal world? Is being an elf a matter of blood of genetic heritage? Once an awakened elf are you always an awakened elf? What's the difference between elves and witches? Is Christianity incompatible with being elves? Are elves related to Devas? What is the Orb of Healing? What oracles do elves use? Do elves believe in past lives? Is the sphere of Netzach specifically related to Elves? Do the elves come from a distant star system? How far back in history do elves and the original \"Elven Faith\" go? Are elves the people of the future? Recently, the Silver Elves have noticed these inquiries and questions to them about the Elven Way have greatly increased because it seems that more and more people are becoming interested in knowing about elves and the elven community. Many in the elven movement today like to think that there is a spiritual Awakening of elven kin beginning to occur worldwide, and this may certainly be the reason for all the recent curiosity about elves and the Elven Way. Of course, too, Tolkien's romantic descriptions and understanding of elves made popular by recent movies (The Lord of the Rings Trilogy and The Hobbit) have certainly contributed to the growing numbers of participants now joining in the modern elven community, and with a surge in social media this community is becoming more accessible by the day to the general public and sparking more and more excitement and reflection about all things elfin. If you are curious about elves and want to learn more about modern elves, then you will surely find this book by the Silver Elves to contain many of your questions answered and it will be a great comfort and help in finding your way home to the Magical Realms of Elfin.",
  "genres": [
    "Philosophy",
    "Magic",
    "Elves"
  ],
  "author": "The Silver Elves",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/37788128-the-magical-realms-of-elfin"
}