{
  "title": "The Letter",
  "description": "LOSE YOURSELF IN THE THE NO.1 BESTSELLER READERS THE WORLD OVER ARE FALLING IN LOVE WITH.Are you ready to stay up all night reading?ONE DAY meets DOWNTON ABBEY in this haunting historical mystery with a twist that will break your heart . . .On the eve of the First World War Kit Rivers, heir to a Cornish manor house and aspiring poet had been raised to do his duty by his country and family, but when he falls in love with the one woman he cannot marry his world is changed beyond all recognition. A forbidden love affair across the classes and hidden for decades, Kit's story refuses to rest and waits patiently for the right person to hear it...One century later young widow Chloe exchanges London life for the rugged Cornish coast. Haunted and grieving, Chloe’s interest in a local war memorial proves a welcome distraction, but when her own life becomes entwined with Kit’s lost story, time and place collide as she finds herself caught in a web of forbidden love, loss, and the very darkest of secrets.Shortlisted for the prestigious Winston Graham Historical Fiction Prize 2018, The Letter is a beautiful novel set in England between the First World War and the present day. ***** \"One of my books of the year,\" Being Anne.***** \"Will break your heart and touch your soul.\" Amazon Vine reviewer.***** “Reminiscent of Daphne du Maurier and Rosamunde Pilcher.”***** “Romantic and moving, a tale of loss and love, the devastation of war and a homage to the lives shattered in the trenches and at home.”A #1 bestseller on Amazon UK, The Letter is a vivid novel of heartbreak and passion, with characters - and an ending - the reader won't forget.THOUSANDS OF READERS HAVE ALREADY GIVEN THE LETTER FIVE STARSTHE LETTER was a No.1 Kindle Store bestseller in 2018",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Historical",
    "Historical Romance",
    "War",
    "Mystery"
  ],
  "author": "Ruth Saberton",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/37785963-the-letter"
}