{
  "title": "Roadhouse",
  "description": "He's not looking for her kind of trouble at his Roadhouse. But if it comes, he won't run.New York Times bestselling author, Victoria Danann, adds an unlikely romance that leads two lonely people straight into the middle of a stand off between three motorcycle clubs.How we long for a community, extended family, who would put everything on the line at the drop of a hat. For us. CLOVER: How did I end up almost two hundred thousand dollars in debt? It wasn’t as hard as it sounds.I went to Colombia and studied anthropology. The perfect background to get a great job. Right? Okay. It was a stupid choice. As it turns out, one of several. But I was still a teenager when I picked a major. I’ve since learned that brains aren’t fully developed until years later. A lot of good that information does me now. So I ended up answering phones at a third rate magazine. In New Jersey. When a duffel bag full of big bills showed up in my gym locker, I did what anybody with student loans would do. I paid them off. It turns out that the money didn't come from my fairy godmother after all. Some goons stashed it in the wrong locker. For the mob. It probably won't surprise you to learn they want it back. So, again, I did what anybody would do. I ran. All the way to the Texas Hill Country. I mean, they wouldn't follow me there. Right? It's practically the Outback. Right?RAZE: It was Bike Night at my place, which meant it was crowded. But when she came through the door, she stood out like a neon sign. I didn't care that she looked lost or that she had unbelievably suckable curves. And it didn't occur to me to worry when she looked back over her shoulder. Should have, but it didn't. The fact was, I needed help. Marjorie called in with some lame excuse, which meant she was fired. Employees can't bail on Bike Night. It's a cardinal sin. I don't really know what that is 'cause I'm not Catholic, but it's bad. I said, \"You got any experience slingin' drinks?\" She shook her head. I gave up a disgusted sigh. \"You good with people?\" She gave me a cute little smirk that's probably served her well up to now and shrugged. I shook my head, knowing I'd be sorry, and handed her an apron. She took it, looked at it like she didn't know what to do with it. After a second of two she raised those big blue eyes to mine and said, \"I don't have a place to stay.\" I looked away so she wouldn't think she had me by the balls and let go with a stream of cuss words in my head.\"Do a good job and you can sleep in the studio in the back. For tonight,\" I said. She gave me a hug like she was grabbing onto a lifesaver and filled my nose with her rainy green apple feminine shampoo smell. 'Course I didn't show it, but that hug knocked me on my ass. She was just some woman coming off the road. I knew this. But there was something... I pushed her away. \"Just for tonight.\" My voice was gruff, sounded harsh. Good. She needed to know my Roadhouse was no plushy crash pad.",
  "genres": [
    "Romance",
    "Adventure",
    "Adult",
    "Contemporary",
    "Contemporary Romance",
    "Paranormal Romance"
  ],
  "author": "Victoria Danann",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/37783434-roadhouse"
}