{
  "title": "A Room Away From the Wolves",
  "description": "“Shiver-inducingly delicious.”— The New York Times Book Review“[Suma’s] narratives are subtle, quicksilver creatures, her language is elegant, and her characters keep more secrets than they reveal. If this book was a dessert, it wouldn't be a chocolate chip cookie or a vanilla birthday cake — it would be an earl grey lavender macaroon, or maybe balsamic fig ice cream.” – NPR.com “This beautiful story is full of magical-realism and luscious, lyrical writing.” – BuzzFeed“Terrific . . . A gothic love letter to secret places of New York City and the runaway girls who find them.” — Kelly Link, author of Pulitzer Prize finalist Get in Trouble“Nova Ren Suma surpasses herself with this gorgeously-told, mesmerizing, tense and twisted story.”— Laura Ruby, National Book Award Finalist and Printz-Winning author of Bone Gap\"Nova Ren Suma is a force to be reckoned with. Nobody writes like her.\"—Courtney Summers, author of Sadie\" A Room Away From the Wolves is a page-turning thrill.  Prepare to be left shivery and spooked and a little bit heartbroken.”—Emily X.R. Pan, New York Times bestselling author of The Astonishing Color of After\" A Room Away from the Wolves is a beautifully tangled chain, a modern gothic haunting by one of our masters.\"—Elana K. Arnold, author of National Book Award finalist  What Girls Are Made OfBina has never forgotten the time she and her mother ran away from home. Her mother promised they would hitchhike to the city to escape Bina’s cruel father and start over. But before they could even leave town, Bina had a new stepfather and two new stepsisters, and a humming sense of betrayal pulling apart the bond with her mother—a bond Bina thought was unbreakable. Eight years later, after too many lies and with trouble on her heels, Bina finds herself on the side of the road again, the city of her dreams calling for her. She has an old suitcase, a fresh black eye, and a room waiting for her at Catherine House, a young women’s residence in Greenwich Village with a tragic history, a vow of confidentiality, and dark, magical secrets. There, Bina is drawn to her enigmatic downstairs neighbor Monet, a girl who is equal parts intriguing and dangerous. As Bina’s lease begins to run out, and nightmare and memory get tangled, she will be forced to face the terrible truth of why she’s come to Catherine House and what it will cost for her to leave . . .In A Room Away from the Wolves , critically acclaimed and New York Times bestselling author Nova Ren Suma weaves a spellbinding ghost story about who deserves a second chance, how we lie to those around us and ourselves, and what lengths girls will go to in order to save each other.",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Magical Realism",
    "Mystery",
    "Fiction",
    "Contemporary",
    "Horror"
  ],
  "author": "Nova Ren Suma",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/37792722-a-room-away-from-the-wolves"
}