{
  "title": "Navigating the Stars",
  "description": "New York Times bestselling author Maria Snyder returns with a compelling new sci-fi series. Perfect for fans of Star Wars and Poison Study. \n2019 PRISM Award Young Adult Category\nYear 2471. A new discovery. Those three words thrill my parents - the galaxy's leading archaeologists - but for me, it means another time jump to a different planet. One so big, my friends will be older than my dad when we arrive. And I'll still be seventeen. Thanks, Einstein.I really can't blame Einstein, though. No one expected to find life-sized terracotta warriors buried on other planets. So off we go to investigate, traveling through space and time. With my social life in ruins, I fill my days illegally worming into the quantum net - the invention that allows us to travel in space. Of course the only person close to my age is a hot-but-pain-in-the-neck security officer who threatens to throw me into the brig.But when one of the warrior planets goes silent, we have bigger problems on our hands. The planet's entire population might be dead. And now my worming skills, along with a translation of an ancient alien artefact, might be the key to finding out why. But my attempts to uncover the truth lead to the discovery of a deadly new alien phenomenon, and also alert those who wish to keep it quiet. The galaxy is in real danger and time is not on our side...A page-turning story of courage and determination in the face of the unknown.PRAISE for Maria V. 'YA with a pretty strong romantic thread and HUGE adult crossover appeal. The plot is fantastic, the pacing spectacular, the intricacies, the snark, the banter...oh my! Go, go, go. You'll love this!' Amanda Bouchet, USA Today bestselling author of The Kingmaker Chronicles.'Smart, witty and full of heart, Navigating the Stars had me hooked from the very first page!' - Lynette Noni, bestselling author of Weapon & The Medoran Chronicles",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fantasy",
    "Romance",
    "Space",
    "Fiction",
    "Audiobook"
  ],
  "author": "Maria V. Snyder",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/37801467-navigating-the-stars"
}