{
  "title": "The Four Kingdoms Box Set One",
  "description": "The first three interconnected stand-alone fairy tale retellings from The Four Kingdoms series  \nBook 1 - The Princess Companion: A Retelling of The Princess and the Pea\n  Danger and romance await a woodcutter’s daughter in a royal palace. One dark and stormy night, lost and alone, Alyssa finds herself knocking on the door of a castle. After a lifetime spent in the deep forest, she has no idea what to expect on the other side. What she finds is two unruly young princesses and one very handsome prince. When Alyssa accepts the job of Princess Companion she knows her life will change. What she doesn't know is that the royal family is about to be swept up in unexpected danger and intrigue, and that she just might be the only thing standing between her kingdom and destruction. This retelling of the classic fairy tale, The Princess and the Pea, reimagines the risks and rewards that come when one royal family goes searching for a true princess.  \nBook 2 - The Princess Fugitive: A Reimagining of Little Red Riding Hood\n Princess Ava used to be a weapon—sharp, strong and beautiful. But when she fails at her most important task, she's forced to flee from her own family. Only her personal bodyguard, Hans, remains loyal. Hans claims to know the real Ava but she finds that hard to believe—after all, she's been the villain so long that she can't remember anything else. Deep in exile, Ava learns her kingdom needs a hero and she might be the only one who can save it. The catch? She'll have to ally herself with the very people she blames for her downfall. But in a game of life and death where the stakes are an entire kingdom, winning over her enemies will only be the beginning. Can one fugitive save her people, her kingdom and, hardest of all, herself? In this reimagining of the classic fairy tale, Little Red Riding Hood, the girl in the red hood has been swallowed up by the wolf and must decide if she's willing to fight for her freedom, no matter the cost.  \nNovella 2.5 - Happily Ever Afters: A Reimagining of Snow White and Rose Red\n Sometimes a fairy tale ending is only the beginning… Sarah and Evelyn have already risked everything to help Ava win a crown. But they soon learn that a coronation is a beginning, not an ending. Not everyone in Rangmere is happy to see the young queen on the throne, and intrigue and danger lurk all around.  The cousins find themselves fighting not only for their new kingdom but also for their own survival in the royal court. When a new threat emerges, the two girls must defeat it to both save the crown and secure their own Happily Ever Afters.",
  "genres": [
    "Fantasy",
    "Fairy Tales",
    "Romance",
    "Audiobook",
    "Young Adult",
    "Fiction",
    "Fairy Tale Retellings"
  ],
  "author": "Melanie Cellier",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/37796986-the-four-kingdoms-box-set-one"
}