{
  "title": "The Real Cost of Prisons Comix",
  "description": "One out of every hundred adults in the U.S. is in prison. This book provides a crash course in what drives mass incarceration, the human and community costs, and how to stop the numbers from going even higher. Collected in this volume are the three comic books published by the Real Cost of Prisons Project. The stories and statistical information in each comic book are thoroughly researched and documented. Prison Paying the Price tells the story of how the financing and site locations of prisons affects the people of rural communities in which prison are built. It also tells the story of how mass incarceration affects people of urban communities where the majority of incarcerated people come from. Prisoners of the War on Drugs includes the history of the war on drugs, mandatory minimums, how racism creates harsher sentences for people of color, stories of how the war on drugs works against women, three strikes laws, obstacles to coming home after incarceration, and how mass incarceration destabilizes neighborhoods. Prisoners of a Hard Women and Their Children includes stories about women trapped by mandatory sentencing and the “costs” of incarceration for women and their families. Also included are alternatives to the present system, a glossary, and footnotes. Over 125,000 copies of the comic books have been printed and more than 100,000 have been sent to people who are incarcerated, to their families, and to organizers and activists throughout the country. The book includes a chapter with descriptions of how the comix have been put to use in the work of organizers and activists in prison and in the “free world” by ESL teachers, high school teachers, college professors, students, and health care providers throughout the country. The demand for the comix is constant and the ways in which they are being used are inspiring.",
  "genres": [
    "Graphic Novels",
    "Nonfiction",
    "Comics",
    "Social Justice",
    "Education",
    "Graphic Novels Comics"
  ],
  "author": "Lois Ahrens",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/3779455-the-real-cost-of-prisons-comix"
}