{
  "title": "Beneath The Mask:",
  "description": "What does a twenty-eight-year-old virgin have in common with a Dom/sub relationship in a private sex club?Nothing.Yet.Beneath The Mask is Tre J's love story, and the stand-alone, Book 2 in the Love, Lies, and Ninja Missions Series, a scintillating, steamy contemporary romance novel by USA Today bestselling author, Tracy Ellen.A voluptuously beautiful early-bloomer, Tre J has been relentlessly chased by men since she was a young girl. Determined to have a meaningful relationship with a man, and not be treated as a brainless sex object to be won and then easily discarded, Tre J vows to stay a virgin until she can marry the man of her dreams. Since none of the real men in her adult life come near to meeting her ideal, or arouse the hot fantasies and guilty pleasures Tre J experiences when reading erotic romance novels, keeping her word isn’t too difficult. But the dark desires Tre J dreams about are pretty kinky. They're taboo for your normal, middle class, small-town girl, and never to be taken seriously or acted upon.Or are they?After years of always being the good girl while working hard to pay her way through college, and after the unwelcome shock of getting dumped by her last boyfriend, Tre J is frustrated and depressed with her life. She's staring the big 3-0 in the face and there's no man she's interested in, much less a meaningful relationship on the horizon. When overhearing a conversation about a private men's club in Minneapolis catering to kinky sexual desires, Tre J can't get the titillating idea out of her head. Before long, she's convinced this is fate telling her she needs a vacation from her real life. She's always longed to let loose and open the door to that secret sexual side she’s kept deeply buried for years, and a two-week fantasy vacation nobody knows about would be the perfect opportunity to explore all her hidden desires.But then real life unexpectedly collides with Tre J's fantasy vacation time. Suddenly, there's not only one hot, dream man in her life, but two! Tre J is faced with the question if following her hidden fantasies has led her down the wrong path, or is it the life she’s been living for years that’s the imposter?*Beneath The Mask was written for the entertainment of an adult audience.More books by Tracy Ellen:Love, Lies, Ninja Missions SeriesAll Jazzed Up, Book 1The Adventures of Anabel AxelrodA Date with Fate, 1Courted by Karma, 2In Love by design, 3Adieu to Destiny, 4Family Fortune, 5Coupled with Chance, 6The Kiss of Kismet, 7A Wedding Written in the Stars, 7.5Honeymoon and Happenstance, 8A Marriage with Mojo, 9 (Coming soon!)Stay in touch! Sign up for Tracy Ellen's occasional newsletter or read and review team. www.tracyellenink.com",
  "genres": [],
  "author": "Tracy Ellen",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/37802948-beneath-the-mask"
}