{
  "title": "13 Things Mentally Strong Women Don't Do: Own Your Power, Channel Your Confidence, and Find Your Authentic Voice for a Life of Meaning and Joy",
  "description": "International bestselling author and leading global expert on mental strength Amy Morin turns her focus to feminism, explaining what it means—and what it takes—to be a mentally strong woman in the age of the #MeToo and #TimesUp movements.The emergence of the #MeToo and #TimesUp movements have awakened society and encouraged women to find their voice and claim their power. But to do this, women must learn to improve their own mental strength. Contending with a host of difficult issues—from sexual assault on college campuses, to equal pay and pay gaps, to mastering different negotiation styles—demands psychological toughness. In this crucial book, prominent psychotherapist and licensed clinical social worker Amy Morin gives women the techniques to build mental muscle—and just as important, she teaches them what not to do.What does it mean to be a mentally strong woman? Delving into critical issues like sexism, social media, social comparison, and social pressure, Amy addresses this question and offers thoughtful, intelligent advice, practical tips, and specific strategies and combines them with personal experiences, stories from former patients, and both well-known and untold examples from women from across industries and pop culture. Throughout, she explores the areas women—and society at large—must focus on to become (and remain) mentally strong.Amy reveals that healthy, mentally tough women don’t insist on perfection; they don’t compare themselves to other people; they don’t see vulnerability as a weakness; they don’t let self-doubt stop them from reaching their goals. Wise, grounded, and essential, 13 Things Mentally Strong Women Don’t Do can help every woman flourish—and ultimately improve our society as well.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Personal Development",
    "Feminism",
    "Womens",
    "Audiobook"
  ],
  "author": "Amy Morin",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/37819094-13-things-mentally-strong-women-don-t-do"
}