{
  "title": "Cold Warriors: Writers Who Waged the Literary Cold War",
  "description": "In this brilliant account of the literary war within the Cold War, novelists and poets become embroiled in a dangerous game of betrayal, espionage, and conspiracy at the heart of the vicious conflict fought between the Soviet Union and the WestDuring the Cold War, literature was both sword and noose. Novels, essays, and poems could win the hearts and minds of those caught between the competing creeds of capitalism and communism. They could also lead to blacklisting, exile, imprisonment, or execution for their authors if they offended those in power. The clandestine intelligence services of the United States, Britain, and the Soviet Union recruited secret agents and established vast propaganda networks devoted to literary warfare. But the battles were personal, friends turned on one another, lovers were split by political fissures, artists were undermined by inadvertent complicities. And while literary battles were fought in print, sometimes the pen was exchanged for a gun, the bookstore for the battlefield.In Cold Warriors, Duncan White vividly chronicles how this ferocious intellectual struggle was waged on both sides of the Iron Curtain. Among those involved were George Orwell, Stephen Spender, Mary McCarthy, Graham Greene, Aleksandr Solzhenitsyn, John le Carré, Anna Akhmatova, Richard Wright, Ernest Hemingway, Boris Pasternak, Gioconda Belli, and Václav Havel. Here, too, are the spies, government officials, military officers, publishers, politicians, and critics who helped turn words into weapons at a time when the stakes could not have been higher.Drawing upon years of archival research and the latest declassified intelligence, Cold Warriors is both a gripping saga of prose and politics, and a welcome reminder that--at a moment when ignorance is all too frequently celebrated and reading is seen as increasingly irrelevant--writers and books can change the world.",
  "genres": [
    "History",
    "Nonfiction",
    "Writing",
    "Politics",
    "War",
    "Literary Criticism",
    "Books About Books"
  ],
  "author": "Duncan White",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/37819078-cold-warriors"
}