{
  "title": "Accidental Hotwife: An Erotic Interracial Adventure",
  "description": "What If A Secret Sexual Fantasy Suddenly Turns Real?Jon and Cheryl are happily married and in love. But Jon has a secret desire for his wife to be pleasured by other men. He devises a game. Cheryl will flirt with other men in public, and he'll watch from a distance. Cheryl plays along, mostly to please Jon at first, but then she starts getting turned on too.Enter Dante. This buff self-assured ebony professional athlete shows up at a new bar and restaurant where Jon and Cheryl are waiting for a table. With Jon's approval, Cheryl starts flirting with Dante at the bar. But soon Cheryl discovers everything about Dante seems finely tuned to seduce her, and she's definitely falling for his masculine alpha mystique. She retreats to the ladies room to check in with her husband via text, and confesses that her panties are soaked by how turned on she is. Then she drops a bombshell—Dante has invited her back to his luxury hotel suite. What should she do?It’s a critical moment. Jon is suddenly faced with the prospect of his fantasy becoming real. He hesitates, but finally texts back that Cheryl can take things as far as she feels comfortable.Dante knows Cheryl is married, but has no idea her husband has been watching. Now Cheryl finds her heart is racing as she slips into the cool leather seat of this ebony god’s exotic muscle-car. But she has no idea her husband has raced ahead to the expensive hotel she mentioned Dante was staying at. Will Jon be able to handle seeing his wife enter a luxury hotel suite with another man? How will Cheryl react when minutes later she reopens the door to hang a ‘do not disturb’ sign, clad only in her bra and panties, and finds her husband standing there? Dante’s going to take them both for a wild ride, throbbing with sexual tension, unfettered primal urges, and a huge emotional release at the end. The twists in the plot are sure to keep you guessing!Warning: This erotic interracial hotwife novella contains graphic descriptions of adult sexuality.Alternative Cover Edition of ASIN: B077MNZL5R",
  "genres": [],
  "author": "Dean Fox",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/37811538-accidental-hotwife"
}