{
  "title": "Warhead: The True Story of One Teen Who Almost Saved the World",
  "description": "An often hilarious and always relevant memoir about one teen boy's battle with brain cancer and his Starlight Children's Foundation wish: to meet Mikhail Gorbachev in Russia and plead for nuclear disarmament and world peace.It's 1986, and Jeff is an average fifteen-year-old: he thinks a lot about dating, he bounces around with his friends, and he's trying his hardest to get a car. Conversely, the world around him feels crazy: the United States and the Soviet Union are at glaring odds, with their leaders in a standoff, and that awful word, \"nuclear,\" is on everyone's mind. Then, boom--Jeff learns that he has brain cancer and it's likely terminal. Well, that puts a damper on his summer plans and romantic prospects, doesn't it?Jeff's family rallies around him, but they are fiercely complicated--especially Jeff's father, a man who can't say \"I love you\" even during the worst of Jeff's treatment. So when the Starlight Children's Foundation offers to grant Jeff a wish, he makes one certain to earn his father's respect: he asks to travel to Moscow and meet with Mikhail Gorbachev to discuss nuclear disarmament and ending the Cold War. Nothing like achieving world peace to impress a distant father, right? Jeff has always been one to aim high.Jeff's story is dark, but it's also funny, romantic, and surprising. As his life swings from incredibly ordinary to absolutely incredible, he grapples with the big questions of mortality, war, love, hope, and miracles.\"A sweet but unsentimental account of a truly fascinating nuclear childhood. Henigson had me at 'Gorbachev.'\" --Gary Shteyngart, \nNew York Times \nbestselling author of \nLittle Failure \nand \nLake Success",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Historical",
    "Family",
    "Biography Memoir"
  ],
  "author": "Jeff Henigson",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/37829308-warhead"
}