{
  "title": "Hearts on Fire",
  "description": "\"Julia Gabriel does an amazing job with this devastatingly heartbreaking love story.\" — RT Book Reviews, 4.5 Stars, Top Pick  Return to the shores of the Chesapeake Bay in Julia Gabriel’s new series about love, family, and second chances ... The 300-year-old town of St. Caroline, Maryland, is part fishing village and part summer playground for the wealthy and powerful. Meet the Trevor women—Michelle, Becca, Charlotte, Natalie, Cassidy and Lauren—and their popular quilt shop, Quilt Therapy. Across town, the men of the Wolfe family have been the backbone of the St. Caroline fire department for generations—and Tim, Jack, Matt and Oliver are continuing the tradition.  The girl who couldn't get anything right …  No good deed goes unpunished. That pretty much summed up Becca Trevor’s life. Help out a woman being harassed in a bar—and get fired? Check. Come home for parents’ anniversary party—and cause her mother’s quilt shop to burst into flames? Check again. Help a geeky classmate and family friend lose his virginity before college—and get pregnant? Check check check.  The boy who could do no wrong ...  Jack Wolfe was the golden boy of St. Caroline. Smart, Ivy League-educated, law school-bound. He has a nice, steady job as an attorney with a hotshot tech company in California … well no, scratch that. The thought of spending his life in an office pushing paper filled him with such existential dread that he dropped out of law school a year ago without telling anyone. He’d much rather follow his father and brothers into the family business—firefighting. But he’s also the namesake of his uncle Jack, who was killed in the line of duty. It would kill Jack’s mother to see her youngest child join the fire department, too … and she’s dying already.  And a secret that will change their lives forever …  The last thing Jack Wolfe needed was a baby. All those Ivy League dreams would go right down the drain—and Becca knew she would get blamed for it. So seven years ago she left town without a word, had the baby by herself, and arranged for the adoption. She never intended to see Jack Wolfe again. But now they’re both back in St. Caroline and falling into a friendship … maybe even more. Becca always planned to keep their baby a secret forever. But now that secret needs her and Becca can’t say no—and can’t keep the news of their daughter from Jack any longer. Can their budding love survive the revelation that they are already a family?  Can the biggest mistake of their lives be the best thing that ever happened to them?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Amazon",
    "Fiction",
    "Second Chance"
  ],
  "author": "Julia Gabriel",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/37835817-hearts-on-fire"
}