{
  "title": "تأسيس وعي المسلم المعاصر",
  "description": "داخل فقاعات من الوهم نعيش، نرى العالم من حولنا بمفاهيمه التى أراد أن يصدرها لنا، نكتفي بالتحسر على الماضي العتيق، تهب علينا الريح من كل مكان سحيق، فيتبدل وعي أجيال كاملة، وتتحول ثقافات شعوب لتصبح مفاهيم بالية، لا تسمن ولا تغني من جوع، فما الشورى أمام الديمقراطية، وما الليبرالية أمام الحرية، وما القومية أمام الأمة، والقانون أمام الشريعة، وماذا عن العلمانية، وماذا عن تجارب التحديث في الدول من حولناوماهي الدروس المستفاده منها، هل يمكننا تكرار التجارب أم لكل أمة مقومات وأدوات، وماذا عن مقومات اللغة العربية وكيف تؤثر على رؤيتنا للعالم ولعقيدتنا، وهل حياة المسلم ووتخطيطه لوقته ورؤيته عن نفسه وعن العالم صالحة لتصحيح ما فسد من ماضيه وحاضره ..تساؤلات عديدة نحاول الإجابة عليها معكم بصحبة المهندس أيمن عبد الرحيم:1- ما طبيعة تكوين المجتمع المسلم التقليدي؟ والتغيرات التي طرأت عليه بمجيء الاستعمار؟2- ما سر صمود المجتمعات الإسلامية التي لم تخضع للتحديث في وجه الاستعمار (مثل مصر في وقت المماليك في مواجهة الحملة الفرنسية) وسقوط جميع المجتمعات الإسلامية التي تم تحديثها فريسة سهلة للاستعمار بعد التحديث (مثل مصر بعد محمد على في مواجهة بريطانيا)؟3- ما التغيرات التي أحدثتها محاولات التحديث و التي أضعفت مناعة المجتمعات الإسلامية ضد الاستعمار؟4- ما سبب ظهور معظم أعراض الأمراض الحضارية المرتبطة بالإستعمار في بعض المجتمعات الإسلامية التي لم تستعمر قط (مثل: تركيا و السعودية)؟5- ما أهم وأبرز التغيرات التي طرأت على المجتمعات الإسلامية بعد الاستعمار؟؟6- ماذا يعني تطبيق الشريعة؟ وما الفارق بين الشريعة والقانون؟7- ما طبيعة العلاقة بين القوى الاستعمارية والحركات الإسلامية في التاريخ المعاصر؟8- ما هي البنية المعرفية المفترضة للمسلم المعاصر؟--------المحاضرة الأولى : مقدمة في العلاقة بين تغيير الأفكار وتغيير السلوك.1. تجارب تغيير الواقع بتغيير الأفكار.2. لماذا تتخذ المجتمعات قرارات كارثية نتيجة لأفكارها؟المحاضرة الثانية : تجربة التحديث في إندونيسيا والهند.1. الجماعات المتوهمة ونشأة القوميات.2. النظام السياسي (الدولة القومية الحديثة).3. النظام الاقتصادي.4. النظام الاجتماعي.5. النظام التعليمي.المحاضرة الثالثة : تجربة التحديث في إفريقيا.1. الجماعات المتوهمة ونشأة القوميات.2. النظام السياسي (الدولة القومية الحديثة).3. النظام الاقتصادي.4. النظام الاجتماعي.5. النظام التعليمي.المحاضرة الرابعة : تجربة التحديث في تركيا.1. الجماعات المتوهمة ونشأة القوميات.2. النظام السياسي (الدولة القومية الحديثة).3. النظام الاقتصادي.4. النظام الاجتماعي.5. النظام التعليمي.المحاضرة الخامسة : أثر اللغة على العقيدة ورؤية العالم.1. العلوم الطبيعية وعلاقتها باللغة.2. علاقة اللغة برؤية العالم وظواهر الكون.3. علاقة اللغة بالعقيدة.المحاضرة السادسة : تجربة التحديث في (أفغانستان-إيران-جمهوريات آسيا الوسطى).1. الجماعات المتوهمة ونشأة القوميات.2. النظام السياسي (الدولة القومية الحديثة).3. النظام الاقتصادي.4. النظام الاجتماعي.5. النظام التعليمي.المحاضرة السابعة والثامنة : ماذا بعد تأسيس الوعي ؟1. إدارة الوقت.2. الرسالة الفردية.3. الرسالة المجتمعية.4. الطريق إلى الريادة المجتمعية.5. كيف تؤسس مشروعك؟المفاهيم والقضايا محل اهتمام الدورة :( الخلافة - الخليفة - الدولة - الشريعة - القانون - الحزب - الجهاد - الديموقراطية - الشورى - القومية - العلمانية - الليبرالية - الاشتراكية - الأمة )--------التعريف بالدورة:1- التعريف بالأمة على مستوى التاريخ.2- التعريف بالأمة على مستوي الجغرافيا.3- التعريف بالأمة على مستوى البنية الاجتماعية و السياسية.(وذلك عن طريق السرد التاريخي لعلاقة الأمة الإسلامية بالاستعمار منذ ظهور البرتغال كدولة استعمارية مرورا بـ :أسبانيا و هولندا و بلجيكا و فرنسا و بريطانيا و روسيا و الاتحاد السوفيتي و أمريكا).4- من خلال السرد التاريخي يتم مناقشة عوامل صمود الأمة أو انسحاقها في وجه هذه الموجات المتتالية ، و لكن بالتركيز على أثر هذه الموجات و ما تبعها من محاولات للتحديث على يد بعض حكام المسلمين على البنية السياسية و الاجتماعية و الاقتصادية للأمة الإسلامية.",
  "genres": [
    "Islam",
    "History",
    "Religion"
  ],
  "author": "أيمن عبد الرحيم",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/37844209"
}