{
  "title": "Letters From The Universe: The Framework of Everything and a Cosmic Guidance to Love, Life and Beyond",
  "description": "Observe, listen, and go with the flow of energy…Letters from the Universe presents a new, simplistic framework for this vast expanse we exist in. By understanding the cosmos and knowing how everything began, we can emulate the ways of the universe and orchestrate a beautiful symphony of life, love and happiness. You will learn:• How we are connected to the universe• What we are made of and how we are connected to each other• How love plays a role in the universe• How to tap into the frequency of the universe and its built-in intelligence• How we apply that connection to our lives• What awaits us in the afterlife.\nThe Cosmos explained with simplicity…\nThe author and his team of astrophysicists and cosmologists present a new theory / framework of the universe. We as a people can learn to explore space in a whole new way, allowing us to break free from the confines of our own solar system. • Insight on a time prior to the Big Bang• How new universes are born• How every galaxy was created• How black holes are formed• How we can travel faster than the speed of light• Wormhole predicted outside earth's atmosphere on a specific day in 2018\n\n\n\nThe Universe will guide you...\nIf you observe, listen, and go with the flow of energy, you will discover a cosmic connection and embark on a love affair with both nature and an inner-awareness that will resonate with purity and beauty. Your journey will soon take a turn and open your life to new opportunities you never thought possible. It’s time to stop resisting these prevailing forces and to start having the courage, strength, and knowledge to ride that wave of good energy for the rest of your days on planet Earth—and beyond into the afterlife.\nThe universe is speaking. It's time to listen.",
  "genres": [
    "Science",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Geo Douglas",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/37833118-letters-from-the-universe"
}