{
  "title": "Just Deceits: A Historical Courtroom Mystery",
  "description": "In 1793, Virginia's most powerful family found itself embroiled in Richard Randolph and his sister-in-law, the beautiful Nancy Randolph, were charged with adultery and infanticide. Richard Randolph demanded a public trial. They hired John Marshall, a young lawyer who was connected to their family through marriage, to defend them. John Marshall would go on to become the greatest Chief Justice of the U.S. Supreme Court, a man whose theories of law are now taught to every first year law student, though at the time of the Randolph trial he was relatively unknown. Uncertain about Marshall's abilities, the Randolph family at the last minute and unbeknownst to Marshall brought in co-counsel; none other than founding father and former Virginia governor Patrick Henry. Henry's wild, improvisational style clashed with Marshall's reasoned defense based on the facts, but Henry was so successful that Marshall was forced to learn from him and then to improve on the master. Author Michael Schein, a former professor of American legal history, drew on John Marshall's actual trial notes in writing this novel that centers on the celebrity trial of the 18th century. JUST DECEITS shows how the remarkable defense team of wily Patrick Henry and ambitious John Marshall battled each other, their clients, the prosecution, and the truth itself, in an effort to save their clients from the gallows. In its ribald portrayal of a young legal system already driven more by spectacle than evidence, JUST DECEITS calls into question the feasibility of uncovering the whole truth. Ultimately, as secrets are revealed and relationships brought to light, JUST DECEITS is as much about the trials of love as about the trial in the courtroom.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "18th Century",
    "Historical",
    "Legal Thriller",
    "Historical Mystery"
  ],
  "author": "Michael  Schein",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/3782690-just-deceits"
}