{
  "title": "Promised Land",
  "description": "One question. What would you do, if you woke up one day and life as you’ve known it changed forever? For Aubrey Evans and Melody Daniels, along with their families, that day has now arrived. Their lives will never be the same, and after believing that silence is golden as it pertains to the biggest sins of America, they will be forced to confront White Supremacy head on and fight for what they once relished as FREEDOM. Succumbing to hatred and bigotry is not an option for Malcolm Garvey. He’s an activist who has intensely studied the Promised Land; a land that was created by The Masters who are determined to take their country back. By any means necessary they plan to do it, but will the strength of black men and women, along with their efforts to unite, be enough to put an end to the gut-wrenching madness they all endure in the name of hate? No one could’ve predicated it would come to this, not even in their wildest dreams. But when reality kicks in and the truths behind the Promised Land are revealed, the shock will be felt across America. Next question. Will it shock you? “I am shaken to my core. This writing is phenomenal and this is a book that every black person or person on this plant should read. It wasn’t an enjoyable read. It was a necessary and thought-provoking read that has made me even more proud to be black. I’m speechless and I will NEVER be the same.” Christine Pauls, Author of One Good Thing “From the very beginning, my heart broke. I was hooked emotionally and it was raw emotion that dragged me through this book. It’s not just a story. This is an account of the fight against racism, injustice and hatred. This story makes you “get it.” It made me sickeningly uncomfortable in my privileged white skin. It’s a catalyst for change, and if it doesn’t move you, you’re part of the problem.” Chanda M Carte’ “The writing felt very real. It was intense and I felt like I was in the story, living through the pain and desperation of the characters. This book will move you and make you think. The topic is hard, but I hope it provokes a much needed conversation in America.” Rose Jackson Beavers, Author of Broken Spirit “The Promised Land is a disturbing story with a plot I’m sure White Supremacists fantasize about. The characters were well written and are a true reflection of black folks we surround ourselves with every day.” Shantel Bynum",
  "genres": [
    "Fiction"
  ],
  "author": "Brenda Hampton",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/37834399-promised-land"
}