{
  "title": "Fade",
  "description": "Perhaps the best way to describe just how much this book caught my imagination is to reveal that even almost a year after reading it, there are still scenes that I remember vividly, quotations that I can recall and to confess that I will never think of doughnuts with sprinkles in the same way again.\"Brilliantly written love story captures your thoughts and emotions throughout the whole reading and long after it. The lucid and detailed narration provides multi layered complexity of each character's personality, startling revelations, creative turns of the plot.\"Dramatic and touching, the author does a brilliant job of capturing the reader's attention and reeling them into the depths of his story telling. FIC027000 Darren Smith Smith, Darren Darren Smith is the author of The Bends and Shadow?s Bliss, his plays include A Picture of Teetering Crockery, Comments in Red, Kiss Me Quick and One In, One Down, One Out and is a member of the Dramatists Guild of America. iUniverse 2008-12-03 00:00:00.000 The Fade NULL 978-0-59548-079-1 294 2007-12-05 00:00:00.000 6 9 TP BW eng 18.95 109800 What if you find the woman of your dreams and are then diagnosed with degenerating blindness? What if this could mean that you may never see your unborn baby's face?In this entertaining and engaging love story, The Fade follows the life of Patrick Bryce. A sales trader by profession and working on the West Coast Patrick finds himself forced East after a buyout that leaves him in New York City alone, single and suffering from numerous lifestyle founded neuroses. It is then that he meets Olivia, a brash and overconfident local and her bitter cat, Tinsel. Their touching and unique love affair runs before learning to walk and soon they are cohabiting and pregnant, an unplanned yet welcome event for both before Patrick is diagnosed as a having a variant of Stargardt's Disease, a strain that causes complete blindness leading him to embark on a journey of rediscovery. FIC027010 Darren Smith Smith,",
  "genres": [],
  "author": "David Whitney",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3785744-fade"
}