{
  "title": "Powerless",
  "description": "This is an alternate Cover Edition for ASIN: B00FHNW530.POWERLESSCarol Anne Sullivan is a tough but burnt-out NYSE broker. She's going through a rough patch managing her business and dealing with a frustrating sex life. Regardless of the efforts on her hot ex-jock lover’s part, she just can’t get any satisfaction. Not even a former infallible rubber sex toy has been able to take her mind off problems, since it started acting out on her. Carol can’t take any more aggravations. Having to deal with a new cheeky receptionist is the last thing she needs right now. So why can’t she stop thinking about the young woman? More importantly, she’s never been attracted to another woman so what is it about Cindy O’Rourke that’s so alluring? Mark Aikens, said drop-dead-gorgeous lover and Carol’s assistant, knows he’s not getting the job done. Being the good submissive he is, he can’t confront his Mistress. But can he stand by and watch as Carol slips away? Will he risk losing her on account of remaining an obedient pet? Cindy O’Rourke was first of her MBA class and her best papers were about a certain genius NYSE broker named Carol Sullivan. When she had a chance to apply for a position in Carol’s company, she ran for it. However, her professional role-model soon becomes a serious daydream fantasy. And nighttime as well. She believes Carol’s way out of her league and she knows it’s wrong to lust for her boss. Besides, Carol’s straight. So why can’t she resist flirting with the older woman every chance she has? Why can’t she erase from her memory the hot scenes she witnesses when she walked in on Carol and Mark having sex? *** This short-story is intended for adults only! It contains graphic language plus kinky scenes involving a stressed out stock broker, her gorgeous ex-jock assistant, and a naughty young receptionist. Plus first-time lesbian action, naughty toys, and light BDSM. ***",
  "genres": [
    "Erotica",
    "BDSM",
    "Lesbian",
    "Contemporary Romance",
    "Novella",
    "LGBT",
    "Adult"
  ],
  "author": "Liz Gavin",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/37848977-powerless"
}