{
  "title": "Kitchen Sense: More than 600 Recipes to Make You a Great Home Cook",
  "description": "Imagine if everything you needed to know to be a great home cook were contained between the covers of a single volume. There’d be new twists on cozy favorites like Macaroni and Cheese with Buttermilk Fried Onions and Crumbled Bacon, classic stews such as Chicken Paprikash, Asian-inspired dishes like Chilled Soba Salad, and all-American staples such as juicy hamburgers hot off the grill. There would be reliable, fundamental recipes for basics, including rice (white, yellow, basmati, jasmine, and brown) and vinaigrette (French, Italian, creamy, and others), along with countless creative variations. There would be boxes packed with time-saving tips and useful information on topics ranging from cleaning leafy greens to putting up jams and pickles. There’d be advice for mailing baked goods and pointers for making pan sauces. Each recipe would include not just a list of ingredients but also accurate cooking times, notes for advance prep, and specifics on how to store (and reheat or recycle) leftovers. In short, there’d be kitchen sense. And now there is.In Kitchen Sense, renowned food authority Mitchell Davis provides more than 600 of his inviting, foolproof recipes along with the guidance you need to become a terrific home cook. If you already are one, you’ll find plenty of dishes to add to your repertoire. Because so much great American home cooking is inspired by this country’s unprecedented infusion of international ingredients, techniques, and preparations, Davis’s enticing collection takes its cues from far and wide, combining recipes from across the globe to create a true melting pot of flavors. Written with flair by a true scholar of food who enjoys cooking and eating everything, from the simplest down-home cooking to the most sophisticated international cuisine, and crammed with informed, lively, passionate opinions, Kitchen Sense is like cooking alongside the Italian-Midwestern-Thai-Hungarian-Mexican-Southern-French-Israeli-Yankee-Indian grandmother you never had.From the Hardcover edition.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction"
  ],
  "author": "Mitchell Davis",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/378511.Kitchen_Sense"
}