{
  "title": "Der Judenstaat: Versuch einer modernen Lösung der Judenfrage (Deutsche Klassiker)",
  "description": "Klassiker aus dem Jahr 2008 im Fachbereich Germanistik - Neuere Deutsche Literatur, , Sprache: Deutsch, Abstract: Vorrede. Der Gedanke, den ich in dieser Schrift ausführe, ist ein uralter. Es ist die Herstellung des Judenstaates. Die Welt widerhallt vom Geschrei gegen die Juden, und das weckt den eingeschlummerten Gedanken auf. Ich erfinde nichts, das wolle man sich vor Allem und auf jedem Punkte meiner Ausführungen deutlich vor Augen halten. Ich erfinde weder die geschichtlich gewordenen Zustände der Juden, noch die Mittel zur Abhilfe. Die materiellen Bestandtheile des Baues, den ich entwerfe, sind in der Wirklichkeit vorhanden, sind mit Händen zu greifen; jeder kann sich davon überzeugen. Will man also diesen Versuch einer Lösung der Judenfrage mit einem Worte kennzeichnen, so darf man ihn nicht „Phantasie“, sondern höchstens „Combination“ nennen. Gegen die Behandlung als Utopie muß ich meinen Entwurf zuerst vertheidigen. Eigentlich bewahre ich damit nur die oberflächlichen Beurtheiler vor einer Albernheit, die sie begehen könnten. Es wäre ja keine Schande, eine menschenfreundliche Utopie geschrieben zu haben. Ich könnte mir auch einen leichteren literarischen Erfolg bereiten, wenn ich für Leser, die sich unterhalten wollen, diesen Plan in den gleichsam unverantwortlichen Vortrag eines Romans brächte. Aber das ist keine solche liebenswürdige Utopie, wie man sie vor und nach Thomas Morus so häufig producirt hat. Und ich glaube, die Lage der Juden in verschiedenen Ländern ist arg genug, um einleitende Tändeleien überflüssig zu machen. Um den Unterschied zwischen meiner Construction und einer Utopie erkennbar zu machen, wähle ich ein interessantes Buch der letzten Jahre: „Freiland“ von Dr. Theodor Hertzka. Das ist eine sinnreiche Phantasterei, von einem durchaus modernen, national-ökonomisch gebildeten Geist erdacht, und so lebensfern, wie der Aequatorberg, auf dem dieser Traumstaat liegt. „Freiland“ ist eine complicirte Maschinerie mit vielen Zähnen und Rädern, die sogar ineinander greifen; aber nichts beweist mir, dass sie in Betrieb gesetzt werden könne. Und selbst, wenn ich Freilands-Vereine entstehen sehe, werde ich es für einen Scherz halten. Hingegen enthält der vorliegende Entwurf die Verwendung einer in der Wirklichkeit vorkommenden Treibkraft. Die Zähne und Räder der zu bauenden Maschine deute ich nur an, in aller Bescheidenheit, unter Hinweis auf meine Unzulänglichkeit und im Vertrauen darauf, dass es bessere ausführende Mechaniker geben wird, als ich einer bin. Auf die treibende Kraft kommt es an. Und was ist diese Kraft? [...]",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Israel",
    "Jewish",
    "Philosophy",
    "Judaism"
  ],
  "author": "Theodor Herzl",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/37850723-der-judenstaat"
}