{
  "title": "Crones Don't Whine: Concentrated Wisdom for Juicy Women",
  "description": "Crowning the Crone. In works like Goddesses in Everywoman and Goddesses in Older Women , bestselling author Jean Shinoda Bolen, M. D, inspired a generation of women to realize their potential and value. Hundreds of thousands of copies later, her books still affect the lives of women. Dr. Bolen is elebrated by some of the most acclaimed women and literati of the twentieth century like Isabel Allende, Gloria Steinem, and Alice Walker. In her book, Crones Don't Whine , she offers mature women thirteen qualities to cultivate personal growth during their crone years. What’s in a crone? Life after forty doesn’t end. So why do most women treat it like it does? Put aside your midlife crisis symptoms and embrace the aging process with this archetype― Crones Don't Whine ; they're juicy and they trust their own instincts. Meditating, not groveling, and choosing the path with heart, crones are fierce about what matters to them. They speak the truth with compassion. They listen to their bodies, reinvent themselves, and savor the good in their lives. Grow and behold. Forget about getting old, aging gracefully is all about perspective. As Dr. Bolen explains, crone years are \"growing\" years in women’s lives. In this new stage, women can finally devote their time, energy, and creativity to what really matters to them. Thirteen essays and practices. Featuring thirteen brief essays and small practices, this lighthearted book gives readers resources to turn to again and again. Inside, If you’re a fan of Dr. Bolen, or books like Women Rowing North , Wild Mercy , or Goddesses Never Age , order a copy of Crones Don’t Cry !",
  "genres": [
    "Nonfiction",
    "Spirituality",
    "Psychology",
    "Self Help",
    "Womens",
    "Feminism",
    "Personal Development"
  ],
  "author": "Jean Shinoda Bolen",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/378547.Crones_Don_t_Whine"
}