{
  "title": "The Many-Coloured Land",
  "description": "In the year 2034, Theo Guderian, a French physicist, made an amusing but impractical discovery: the means to use a one-way, fixed-focus time warp that opened into a place in the Rhine River valley during the idyllic Pliocene Epoch, six million years ago. But, as time went on, a certain usefulness developed. The misfits and mavericks of the future—many of them brilliant people—began to seek this exit door to a mysterious past. In 2110, a particularly strange and interesting group was preparing to make the journey—a starship captain, a girl athlete, a paleontologist, a woman priest, and others who had reason to flee the technological perfection of twenty-second-century life.Thus begins this dazzling fantasy novel that invites comparisons with the work of J.R.R. Tolkien, Arthur C. Clarke, and Ursula Le Guin. It opens up a whole world of wonder, not in far-flung galaxies but in our own distant past on Earth—a world that will captivate not only science-fiction and fantasy fans but also those who enjoy literate thrillers.The group that passes through the time-portal finds an unforeseen strangeness on the other side. Far from being uninhabited, Pliocene Europe is the home of two warring races from another planet. There is the knightly race of the Tanu—handsome, arrogant, and possessing vast powers of psychokinesis and telepathy. And there is the outcast race of Firvulag—dwarfish, malevolent, and gifted with their own supernormal skills. Taken captive by the Tanu and transported through the primordial European landscape, the humans manage to break free, join in an uneasy alliance with the forest-dwelling Firvulag, and, finally, launch an attack against the Tanu city of light on the banks of a river that, eons later, would be called the Rhine.Myth and legend, wit and violence, speculative science and breathtaking imagination mingle in this romantic fantasy, which is the first volume in a series about the exile world.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Time Travel",
    "Science Fiction Fantasy",
    "Audiobook",
    "Speculative Fiction"
  ],
  "author": "Julian  May",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/378639.The_Many_Coloured_Land"
}