{
  "title": "Looking for Lorraine: The Radiant and Radical Life of Lorraine Hansberry",
  "description": "A revealing portrait of one of the most gifted and charismatic, yet least understood, Black artists and intellectuals of the twentieth century.Lorraine Hansberry, who died at thirty-four, was by all accounts a force of nature. Although best-known for her work A Raisin in the Sun, her short life was full of extraordinary experiences and achievements, and she had an unflinching commitment to social justice, which brought her under FBI surveillance when she was barely in her twenties. While her close friends and contemporaries, like James Baldwin and Nina Simone, have been rightly celebrated, her story has been diminished and relegated to one work—until now. In 2018, Hansberry will get the recognition she deserves with the PBS American Masters documentary \"Lorraine Hansberry: Sighted Eyes/Feeling Heart\" and Imani Perry's multi-dimensional, illuminating biography, Looking for Lorraine.After the success of A Raisin in the Sun, Hansberry used her prominence in myriad ways: challenging President Kennedy and his brother to take bolder stances on Civil Rights, supporting African anti-colonial leaders, and confronting the romantic racism of the Beat poets and Village hipsters. Though she married a man, she identified as lesbian and, risking censure and the prospect of being outed, joined one of the nation's first lesbian organizations. Hansberry associated with many activists, writers, and musicians, including Malcolm X, Langston Hughes, Duke Ellington, Paul Robeson, W.E.B. Du Bois, among others. Looking for Lorraine is a powerful insight into Hansberry's extraordinary life—a life that was tragically cut far too short.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "LGBT",
    "Queer",
    "Race",
    "Feminism"
  ],
  "author": "Imani Perry",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/37857804-looking-for-lorraine"
}