{
  "title": "When Death Becomes Life: Notes from a Transplant Surgeon",
  "description": "At the University of Wisconsin, Dr. Joshua Mezrich creates life from loss, transplanting organs from one body to another. In this intimate, profoundly moving work, he illuminates the extraordinary field of transplantation that enables this kind of miracle to happen every day.When Death Becomes Life is a thrilling look at how science advances on a grand scale to improve human lives. Mezrich examines more than one hundred years of remarkable medical breakthroughs, connecting this fascinating history with the inspiring and heartbreaking stories of his transplant patients. Combining gentle sensitivity with scientific clarity, Mezrich reflects on his calling as a doctor and introduces the modern pioneers who made transplantation a reality—maverick surgeons whose feats of imagination, bold vision, and daring risk taking generated techniques and practices that save millions of lives around the world.Mezrich takes us inside the operating room and unlocks the wondrous process of transplant surgery, a delicate, intense ballet requiring precise timing, breathtaking skill, and at times, creative improvisation. In illuminating this work, Mezrich touches the essence of existence and what it means to be alive. Most physicians fight death, but in transplantation, doctors take from death. Mezrich shares his gratitude and awe for the privilege of being part of this transformative exchange as the dead give their last breath of life to the living. After all, the donors are his patients, too.When Death Becomes Life also engages in fascinating ethical and philosophical debates: How much risk should a healthy person be allowed to take to save someone she loves? Should a patient suffering from alcoholism receive a healthy liver? What defines death, and what role did organ transplantation play in that definition? The human story behind the most exceptional medicine of our time, Mezrich’s riveting book is a beautiful, poignant reminder that a life lost can also offer the hope of a new beginning.",
  "genres": [
    "Nonfiction",
    "Medicine",
    "Medical",
    "Science",
    "Memoir",
    "History",
    "Audiobook"
  ],
  "author": "Joshua D. Mezrich",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/37868562-when-death-becomes-life"
}