{
  "title": "The Vampire Wish: The Complete Series",
  "description": "Dive into The Vampire The Complete Series and get ready for a whirlwind of dark secrets, magical romance, heart-stopping action, and twists that will keep you turning the pages late into the night.For Annika Pearce, winter break with her family was usually a boring affair. Not this year. Everything changes in an instant when vampires attack Annika’s family and abduct her to the hidden kingdom of the Vale.In the Vale, her normal life is turned upside down. Her role? To give blood whenever vampires demand.As Annika desperately searches for a way to escape, she meets a mysterious stranger named Jake who captures her heart and might be her only hope. But as Annika peels back the layers of the mystery surrounding her abduction, she learns that things aren’t as they seem. Everyone seems to be hiding a secret. Including Jake.It turns out that his name isn't even Jake.It's Jacen.And he's a vampire.A vampire prince.With time running out, Annika races to unravel the mystery of the Vale—and decide who to trust. With her heart pulling her in one direction, and her instincts in another, she faces an impossible decision.Can she get Jacen to fall in love with her and turn her into a vampire, so she can have the strength to escape his dangerous kingdom?With thousands of rave reviews and millions of pages read, The Vampire Wish is your ticket to an epic saga where love bites, heroines are fierce, and readers binge until the sun comes up. Grab your copy now and join the adventure that's taken readers around the world by storm. Your next fantasy vampire romance obsession awaits!Praise for The Vampire Wish“This series is extraordinary… it had me at the edge of my seat the entire time!”-Nicole, Goodreads Reviewer ★★★★★“Fast paced and action packed! Michelle’s plots have twists that will make you hooked and driven mad to read what comes next!”-BookAddict'sReviews, Amazon Reviewer ★★★★★“I have loved each book, and the characters all have grown so much from the start. Get it as soon as you can don't miss a wonderful story!”-Athena Lee Brown, Amazon Reviewer ★★★★★“Twists and turns at every chapter. Michelle knows how to keep you on your toes!”-Akbish, Amazon Reviewer ★★★★★This bundle contains all five books in The Vampire Wish The Vampire Wish2) The Vampire Prince3) The Vampire Trick4) The Vampire Fate5) The Vampire War",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Audiobook",
    "Vampires",
    "Paranormal",
    "Fiction",
    "Romance"
  ],
  "author": "Michelle Madow",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/37884826-the-vampire-wish"
}