{
  "title": "Mort in China Comic Issue 1 (Funny, Chinese, Indie, Comic Book For Kids, Teens, Adults, Short Read):: Understanding Modern China and Chinese Culture Through Comics",
  "description": "About Mort in China Comic  Mort in China  is a  Comic Book for Children, Teens, Young Adults and alike. If you’ve ever been curious about  China, or you just love  Asian comics and  CUTE Asian characters, this Entertaining and Informative  Indie comic produced by expats living in  China is sure to bring joy with its  Humorous tale of a protagonist out of his element trying to navigate  Chinese Culture. Available on  Kindle Short Reads. Additionally, while studying and living in China the author began to notice a need for a  fun resource that would make  modern Chinese culture accessible and easy to understand, as well as give  students of Chinese an entertaining way to improve their reading skills and to help support students of Chinese across the globe. The author’s mission with this series was to create an  entertaining story that could help the two cultures better understand one another. For the western audience it is our hope that they will learn about life in  modern China through our main character Mort, as he stumbles his way through the culture.  Issue 1: Charon’s Slow Boat to China. After 500 years of work and still only being considered ‘2nd best’ a mild-mannered soul collection agent for Final Destinations, an afterlife tourism agency, named Mort has his world turned upside down when his boss sends him to root out and correct the efficiency issues in their China branch office. Things take a turn on arrival as he quickly realises that he is woefully unqualified to deal with the nuances and pitfalls of Chinese culture. Will Mort succeed, or will his failure spell doom for all of China? Please that this book is available in colour for all devices that support colour viewing.   This is book one of the  ‘Mort in China’miniseries, a prelude to the  ‘Final Destinations’ comic book series. You only live once, so start your adventure today and take advantage our limited timediscount price  Download Today",
  "genres": [],
  "author": "Vali Morrison",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/37880206-mort-in-china-comic-issue-1-funny-chinese-indie-comic-book-for-kids"
}