{
  "title": "Boy for the Cheer",
  "description": "Word Count: 64,000+, 126 pages  Boy for the Cheer introduces Lee Corcoran, a freshman in high school whose life is not going as planned. With visions of being a star athlete, Lee is disappointed when he is not good enough to play on the high school soccer team. Days later, his best friend Darby and several other cheerleaders convince Lee to help them train.  As the year progresses, Lee becomes more and more involved in the cheerleading program leading to his reluctant introduction to cross-dressing and feminization. There will be surprises and successes along the way as Lee blazes his own path. Spending most of his first year immersed with a group of high school girls will have an effect on Lee. He will build strong friendships with many of the girls.  The majority of crossdressers are heterosexual and most people don’t understand how their preferences fit into their daily life. Every crossdresser has their own story of how their fetish developed. They also have a personal story on how they integrate crossdressing into their life. This story deals with a reluctant crossdresser who tries not to sacrifice his manhood while enjoying his unusual choice in clothing. Being a freshman in high school only complicates the situation.  The story begins with a few pages to introduce the primary characters and provide a bit of historical context to allow the reader to get to know the different players. The Background section will help the reader understand the characters and their interaction in the long term.  This book tries to deal with cross-dressing as part of a real life. In many ways, Lee has a life many real-world crossdressers only dream of.  Given the ages of the characters, the story does not involve explicit sex. The story focuses on cross-dressing [not gender change]. Young adult readers should be comfortable reading this book.  **********  The Cheerleader series follows Lee Corcoran as he grows, matures, and experiences life from pre-high school through college. The main characters in this story will be recurring in future installments in the series. While the long-term series involves romance, the first installment lays the groundwork while focusing on character development.  Enjoy Daring Diane  Disclaimer This story is a work of fiction. Names, characters, businesses, places, events, locales, and incidents are either the products of the author’s imagination or used in a fictitious manner. Any resemblance to actual persons, living or dead, or actual events is purely coincidental.  Keywords: cross-dressing, reluctant feminization, cheerleader, romance, coming of age",
  "genres": [
    "Young Adult",
    "Transgender"
  ],
  "author": "Daring Diane",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/37888398-boy-for-the-cheer"
}