{
  "title": "The Lumberjack's Dove",
  "description": "“Serious art does not need to be weighty or explicitly topical. It can be, as it is here, apparently as light as a feather: The Lumberjack’s Dove is, in its manner, a folktale; it is also a meditation on attachment, on loss, on transformation. Like its less humble relatives, myth and parable, it is pithy, magical, its many insights, its cautions and clarifications, unfolding in a chain of brief scenes and koan-like revelations. This is a book of unexpected lightness and buoyancy, as necessary in our tense period as the more urgent confrontations.” --Louise Gluck A boldly original and visceral debut collection from the winner of the 2017 National Poetry Series Competition, selected by Louise GluckIn the ingenious and vividly imagined narrative poem The Lumberjack’s Dove, GennaRose Nethercott describes a lumberjack who cuts his hand off with an axe—however, instead of merely being severed, the hand shapeshifts into a dove. Far from representing just an event of pain and loss in the body, this incident spirals outward to explore countless facets of being human, prompting profound reflections on sacrifice and longing, time and memory, and—finally—considering the act of storytelling itself. The lumberjack, his hand, and the axe that separated the two all become participants in the story, with unique perspectives to share and lessons to impart. “I taught your fathers how to love,” Axe says to the acorns and leaves around her. “I mean to be felled, sliced to lumber, & reassembled into a new body.”Inflected with the uncanny enchantment of modern folklore and animated by the sly shifting of points-of-view, The Lumberjack’s Dove is wise, richly textured poetry from a boundlessly creative new voice.",
  "genres": [
    "Poetry",
    "Fantasy",
    "Short Stories",
    "Magical Realism",
    "Fiction",
    "Adult",
    "Disability"
  ],
  "author": "GennaRose Nethercott",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/37880096-the-lumberjack-s-dove"
}