{
  "title": "News of Our Loved Ones",
  "description": "Set in France and America, News of Our Loved Ones is a haunting and intimate examination of love and loss, beauty and the cost of survival, witnessed through two generations of one French family, whose lives are all touched by the tragic events surrounding the D-Day bombings in NormandyWhat if your family’s fate could be traced back to one indelible summer?Over four long years, the Delasalle family has struggled to live in their Nazi occupied village in Normandy. Maman, Oncle Henri, Yvonne, and Françoise silently watched as their Jewish neighbors were arrested or wordlessly disappeared. Now in June 1944, when the sirens wail each day, warning of approaching bombers, the family wonders if rumors of the coming Allied invasion are true—and if they will survive to see their country liberated.For sixteen-year-old Yvonne, thoughts of the war recede when she sees the red-haired boy bicycle past her window each afternoon. Murmuring to herself I love you, I love you, I love you, she wills herself to hear the whisper of his bicycle tires over the screech of Allied bombs falling from the sky.Yvonne’s sister, Geneviève, is in Paris to audition for the National Conservatory. Pausing to consider the shadow of a passing cloud as she raises her bow, she does not know that her family’s home in Normandy lies in the path of British and American bombers. While Geneviève plays, her brother Simon and Tante Chouchotte, anxiously await news from their loved ones in Normandy.Decades later, Geneviève, the wife of an American musician, lives in the United States. Each summer she returns to her homeland with her children, so that they may know their French family. Geneviève’s youngest daughter, Polly, becomes obsessed with the stories she hears about the war, believing they are the key to understanding her mother and the conflicting cultures shaping her life.Moving back and forth in time, told from varying points of view, News of Our Loved Ones explores the way family histories are shared and illuminates the power of storytelling to understand the past and who we are.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "World War II",
    "France",
    "Adult Fiction",
    "Holocaust"
  ],
  "author": "Abigail DeWitt",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/37880095-news-of-our-loved-ones"
}