{
  "title": "On the Brink: The Great Lakes in the 21st Century",
  "description": "As one of the world’s great natural treasures, the Great Lakes have also served in recent decades as an early warning system for many emerging environmental problems. In the early twenty-first century, as the Lakes face unprecedented challenges, we need to revisit both the wonder of the Lakes and the perils plaguing them, and to take action to protect this majestic ecosystem.      Dave Dempsey weaves the natural character and phenomena of the Great Lakes and stories of the schemes, calamities, and unusual human residents of the Basin with the history of their environmental exploitation and recovery. Contrasting the incomparable beauty and complexity of the Lakes, and the poetry, folklore, and citizen action they have inspired, with the disasters that short-sighted human folly has inflicted on the ecosystem, Dempsey makes this history both engaging and relevant to today’s debates and decisions.     Underlying the neglectful treatment of the Lakes are two irreconcilable and faulty human that the Lakes are a system so big that human beings cannot do great harm to it, and that the Lakes are a resource that can be bent to the will of humankind. Dempsey finds evidence that, despite great changes in the laws governing the Lakes and public attitudes toward them in the last fifty years, government policy and institutions are still dominated by these dangerous attitudes.     A central theme of On the Brink is that citizens, who have displayed an increasing sense of commitment to the Lakes and a growing sense of place, must challenge their leaders to reform Great Lakes institutions. While everything from large-scale water exports to global climate change looms in the future of the Lakes, single-purpose solutions do not suffice—no more than a Band- aid would on a gaping wound. Dempsey shows that it is necessary to create a governing system that reflects the realities of life “on the ground” in communities and that taps into the passion and determination of citizens to protect these treasures.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Dave Dempsey",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/379137.On_the_Brink"
}