{
  "title": "The Morning After: Sex, Fear, and Feminism",
  "description": "When Katie Roiphe arrived at Harvard in the fall of 1986, she found that the feminism she had been raised to believe in had been radically transformed. The women's movement, which had once signaled such strength and courage, now seemed lodged in a foundation of weakness and fear. At Harvard, and later as a graduate student at Princeton, Roiphe saw a thoroughly new phenomenon taking shape on campus: the emergence of a culture captivated by victimization, and of a new bedroom politics in the university, cloaked in outdated assumptions about the way men and women experience sex. Men were the silencers and women the silenced, and if anyone thought differently no one was saying so. Twenty-four-year-old Katie Roiphe is the first of her generation to speak out publicly against the intolerant turn the women's movement has taken, and in The Morning After she casts a critical eye on what she calls the mating rituals of a rape-sensitive community. From Take Back the Night marches (which Roiphe terms \"march as therapy\",and \"rhapsodies of self-affirmation\") to rape-crisis feminists and the growing campus concern with sexual harassment, Roiphe shows us a generation of women whose values are strikingly similar to those their mothers and grandmothers fought so hard to escape from - a generation yearning for regulation, fearful of its sexuality, and animated by a nostalgia for days of greater social control. At once a fierce excoriation of establishment feminism and a passionate call to our best instincts, The Morning After sounds a necessary alarm and entreats women of all ages to take stock of where they came from and where they want to go.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Gender",
    "Sexuality",
    "Gender Studies",
    "Womens",
    "Politics"
  ],
  "author": "Katie Roiphe",
  "average_rating": "2.79",
  "url": "https://www.goodreads.com/book/show/379097.The_Morning_After"
}