{
  "title": "Embraced at Seaside",
  "description": "Sweet with Heat: Seaside Summers features a group of fun, flirty, and emotional friends who gather each summer at their Cape Cod cottages. They're sassy, flawed, and so easy to relate to, you'll be begging to enter their circle of friends! In EMBRACED AT SEASIDE...After working hard all day creating his beautiful metal sculptures, Hunter Lacroux likes to unwind with a hot babe–or two. But after spending a handful of nights with smart, sassy, and beautiful Jana Garner, the woman who challenges everything he does and says, Hunter wants more.As a dancer, boxer, actress, and waitress, Jana is tough, organized, and as dedicated as she is committed. She has to be to maintain her crazy schedule. But when it comes to men, Jana’s had a string of bad relationships, and there’s only one thing she’ll commit to–not committing.Passion ignites every time Jana and Hunter are together, but the closer Hunter gets, the faster Jana runs. When Hunter lays on the charm, Jana throws out a challenge she’s sure he can’t meet, and Hunter steps up to the plate, forcing her to face her hurtful past or let go of him forever.SWEET WITH HEAT: SEASIDE SUMMERS SERIESRead, Write, Love at SeasideDreaming at SeasideHearts at SeasideSunsets at SeasideSecrets at SeasideNights at SeasideSeized by Love at SeasideEmbraced at SeasideLovers at SeasideWhispers at Seaside***PLEASE NOTE: \"Embraced at Seaside\" is true sweet with heat. Jana and Hunter’s story is the steamiest in the series, and remains true to the characters’ personalities. As with all Addison Cole novels, \"Embraced at Seaside\" does not include any explicit scenes or harsh language (with the exception of an occasional “damn” or “hell”).Embraced at Seaside is a Sweet with Heat novel and conveys all of the passion you'd expect to find between two people in love without any graphic scenes or harsh language. If you're looking for a spicier romance, pick up the steamy edition, Seaside Embrace, written by New York Times bestselling author Melissa Foster. Addison Cole is Melissa's sweet-romance pen name.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Addison Cole",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/37902582-embraced-at-seaside"
}