{
  "title": "Gentleman Takes a Chance",
  "description": "1. Gentleman Takes a Chance is a fast-moving urban fantasy adventure of a desperate clash of shape-shifters in a modern city, and will appeal to the readers who have made Mercedes Lackey's urban fantasy novels top-sellers.2. Quotes for - Publishers Weekly called Ill Met by Moonlight \"A literate first novel...a quality item with crossover appeal.\"- Library Journal called it \"fanciful and charming.\"- Booklist praised the concluding novel in a starred \"Exceptional,wonderful and enormously entertaining.\"3. Advertising in Locus, more4. Large distribution of ARCs5. Featured book on Baen.com6. Co-op availableThere are those living secretly among us who have the power to change their physical form from that of a human to an animal, even animals thought to be mythical, such as dragons. Throughout out the ages, these shape shifters have come together in a loose organization to protect themselves from humans—and other shape shifters. According to their code, killing another shifter is a crime, no matter if the shifter was slaughtering humans.Kyrie Smith, a young panther shifter, must decide where she will with her group or with humanity at large. And she’ll have to do it while both older shifters and her boyfriend Tom Ormson—a dragon shifter—push her from quandary to quandary and police detective Rafiel Thrall—who happens to be a lion shifter—demands her help in solving mysterious murders that he suspects have been committed by a shifter. But when Tom begins getting telepathic warnings from the Great Sky Dragon that his life is in danger, the same dragon who recently almost killed him, he and Kyrie realize that much more is involved than a homicidal shape shifter.Someone—or something—has been killing shifters in large numbers, and the most ancient and powerful of shifters are converging on the city to find the killer. And anyone, human or shifter, who gets in their way will be eliminated without mercy. . . .",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Shapeshifters",
    "Dragons",
    "Science Fiction Fantasy",
    "Paranormal",
    "Fiction"
  ],
  "author": "Sarah A. Hoyt",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/3791004-gentleman-takes-a-chance"
}