{
  "title": "Between the Lies",
  "description": "Excellent psychological thriller that hooks you from the get go and won't let you go until you've read every last page.' ***** Goodreads reviewerYOU WAKE UP IN HOSPITAL. YOU DON'T REMEMBER WHO YOU ARE. SO WHO CAN YOU TRUST?Totally gripping and full of twists, this unputdownable psychological thriller will keep fans of Lisa Jewell, Shari Lapena's THE COUPLE NEXT DOOR and Laura Marshall's FRIEND REQUEST guessing until the last page.CHLOE DANIELS WAKES IN A HOSPITAL WITH NO MEMORY OF HOW SHE GOT THERE. She doesn't recognise the strangers who call themselves family. She can't even remember her own name.As she slowly recovers, her parents and sister begin to share details of her life. The successful career. The seaside home. The near-fatal car crash.But Chloe senses they're keeping dark secrets - and her determination to uncover them will have devastating consequences as the shocking truth is revealed... WHY READERS ARE RAVING ABOUT BETWEEN THE you like unsettling, brilliantly paced and gripping books you'll love this!' ***** Goodreads Reviewer'[Adams] is adept at writing a story that pulls you in whether you like it or not!' **** Goodreads Reviewer'I was absolutely hooked ... I would definitely recommend' *****Goodreads reviewer 'This is an easily devoured book that I lost myself in immediately' **** Goodreads ReviewerPRAISE FOR MICHELLE ADAMS'In Elle, Michelle Adams has created a truly terrifying character who exerts her power from the first page, drawing you in to the last. Intricately plotted, My Sister kept me gripped to the stunning finale' Amanda Reynolds, Close to Me.'A fabulously chilling tale of two twisted sisters...grabs you by the throat from first page to last.' Camilla Way, Watching Edie'I loved this dark and disturbing thriller. Tense and twisted, it glued me to the sofa from the first page to the last C. J. Tudor' The Chalk Man)'A magnificent exploration of the toxic relationship between two sisters and the hold they exert on each other...chilling and tragic in equal measure' Nuala Ellwood, My Sister's Bones'SO fantastic; twisty and exciting yet original and beautifully written. I'm in awe!' Gillian McAllister, Anything You Do SayA first-rate shocker of a psychological thriller (Irish Independent)",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Psychological Thriller",
    "Suspense",
    "Psychological Suspense"
  ],
  "author": "Michelle    Adams",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/37912967-between-the-lies"
}