{
  "title": "Desire Island",
  "description": "\"I was totally absorbed in the love and scorching passion that Ayailla and Roanen shared through the centuries in Shelby Morgen's The Summoning -- very hot! Scorching and erotic describes Lilli and Harry's relationship in Reflections -- their encounters are so hot and descriptive that readers will be squirming for relief. Readers will not be able to resist the humor, danger and hot sex in Stephanie Burke's Take Me With You.\" -- Literary Nymphs 4.5 Stars! \"This book follows the lives of people who came to Desire Island to escape from a life filled with disappointment and pain. Marylin and Lilli bloom in their new environment. Gray comes face-to-face with memories of the past. When he comes to terms with his past, he is ready to begin a new life with the woman he loves. The reader will enjoy this trio of stories.\" -- Ecataromance Desire Island A gateway to the heart's deepest desire, To passion's heat, to love. The wind-tossed sign at the front gate always reads \"Vacancy.\" Stephanie Take Me With You Lost in a futuristic desert, Gray finds himself surrounded by his worst nightmares and falling for an exotic creature who stirs up memories of his dark past. Gray will stop at nothing to ignite a passion that will unite their souls as one. Treva Reflections The perfect trophy wife. Mason's given Lilli everything she's asked for. And she's given him -- everything. Now her mirror shows her a truth she'd rather not see. And is the hunk who beckons to her from another life in her past, or is he her future? Shelby The Summoning A spell so powerful -- and dangerous -- its use is forbidden. Welcome to Earth 2456. Marylin accidentally steps into a future that's not her own. Roanen appears to be the fulfillment of Marylin's every sexual fantasy, but are the visions that haunt her memories of past lives and past loves...or mistakes she's doomed to repeat?",
  "genres": [],
  "author": "Shelby Morgen",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/37929984-desire-island"
}