{
  "title": "Chance",
  "description": "Cyn City is crumbling beneath the weight of water and wealth. Old New York is drowning, while Cyn City is building right over it’s crumbling bones. Ocean swells threaten the massive wall holding back the tides, In the skycity transhumanism means implants and virtual reality, but down in the lower depths where rats and mold rule, cyborgs are a hackjob of nuts and bolts, cynked together for strength, not beauty.  Chance has fought his entire life, first for survival in the streets of Cyn City and later for money and prestige in the underground Cyborg Fight League. After losing the love of his life to Rhumitisin, he never thought he’d find love again. Death closes in fast in the Cyborg Slums, and Chance doesn’t even care until he meets a woman who can see past the metal arm on his left side.  Verity has left behind everything she knows to start a new life in Cyn City. But her Ecovangalit upbringing has left her unprepared for the hard realities of life amongst the Cyborgs. When a dangerous man everyone tells her to stay away from proves to be the only person she can trust, can she lower her walls enough to let him in?  When Verity finds herself in debt to the wrong kind of man who will sell her body as fast as he will sell her soul, Chance is the only one who can clear her ledger, but only if he'll fight in the Cyborg Fight Circuit again, which means killing for the woman he just might love enough to risk his life for.  Each book in the series is fully stand alone and can be read in any order.  Book One: Chance Book Two: Enver More To Be Announced!  Note to Readers: This science fiction cyborg dystopian romance series contains lots of action, alpha males, fierce women, and steamy romance. If you love bad boys who love as hard as they fight, then this series is for you! Guaranteed happily-ever-afters with no cliffhangers.",
  "genres": [
    "Romance",
    "Audiobook",
    "Science Fiction",
    "Science Fiction Romance",
    "Paranormal Romance",
    "Post Apocalyptic"
  ],
  "author": "Pearl Foxx",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/37935227-chance"
}