{
  "title": "The Happy Pear: Recipes for Happiness: A delicious, easy vegetarian cookbook with healthy recipes for the whole family",
  "description": "THE NO.1 BESTSELLING BOOK - PACKED WITH QUICK AND EASY MEAT-FREE VERSIONS OF OLD FAVOURITES AND INSPIRING ADVICE ON HOW TO BE HEALTHIER!  'These lovely boys always create incredibly tasty food' Jamie Oliver David and Stephen Flynn, the twins behind the Happy Pear cafés and food business, know it can be challenging to juggle everything and still feel inspired! And being busy dads themselves they also know the pressure of getting delicious healthy meals on the table every day. So Recipes for Happiness is very close to their hearts. And it does what it says on the it is crammed with recipes to make you happier, · ECONOMICAL EASY DINNERS - Thai golden curry, chickpea tikka masala and one-pot creamy mushroom pasta· GORGEOUS HEARTY DISHES - Greek summer stew, goulash and an ingenious hob lasagne· PLANT-BASED ALTERNATIVES TO FAMILY FAVOURITES - Burgers, hotdogs, nuggets and even kebabs· IRRESISTIBLE TREATS - Summer fruit bakewell tart, double choc brownie cakeFor nearly 15 years David and Stephen's mantra has been Eat More Veg! They have seen fads come and go and they know that what works - for themselves, their families and the thousands of people who eat the Happy Pear way. Cook from Recipes for Happiness and you too will definitely be well on the way to making your life healthier and happier! _______________  'The poster boys for a healthy way of life!' Sunday Times 'Healthy, vegan and all ready in under 30 minutes!' Veggie 'Proper good food . . . hearty, decent and delicious' Russell Brand 'Two of the most positive people I have ever had the pleasure of spending time with . . . their story is one of inspiration' Dr Rangan Chatterjee 'A healthy eating phenomenon' Mail on Sunday 'These twins are on a roll' Time Out '[They] couldn't look healthier or happier . . . poster boys for vegetarianism' The Times 'Crammed with great recipes to make you healthier and happier' Take a Break 'The boys are helping to make the world a healthier, happier place . . . what's not to love?' Vegan Food and Living 'Enjoy these indulgent-but-healthy dishes indoors or out - you won't even notice it's raining' Vegan Living 'Substantial . . . just right for someone interested in exploring the world of \"plant-power\"' The Vegetarian",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Health",
    "Vegetarian",
    "Vegan"
  ],
  "author": "David Flynn",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/37920099-the-happy-pear"
}