{
  "title": "Oceana: Our Endangered Oceans and What We Can Do to Save Them",
  "description": "Most people know Ted Danson as the affable bartender Sam Malone in the long-running television series Cheers. But fewer realize that over the course of the past two and a half decades, Danson has tirelessly devoted himself to the cause of heading off a looming global catastrophe—the massive destruction of our planet's oceanic biosystems and the complete collapse of the world's major commercial fisheries.In Oceana, Danson details his journey from joining a modest local protest in the mid-1980s to oppose offshore oil drilling near his Southern California neighborhood to his current status as one of the world's most influential oceanic environmental activists, testifying before congressional committees in Washington, D.C., addressing the World Trade Organization in Zurich, Switzerland, and helping found Oceana, the largest organization in the world focused solely on ocean conservation.In his incisive, conversational voice, Danson describes what has happened to our oceans in just the past half-century, ranging from the ravages of overfishing and habitat destruction to the devastating effects of ocean acidification and the wasteful horrors of fish farms. Danson also shares the stage of Oceana with some of the world's most respected authorities in the fields of marine science, commercial fishing, and environmental law, as well as with other influential activists.Combining vivid, personal prose with an array of stunning graphics, charts, and photographs, Oceana powerfully illustrates the impending crises and offers solutions that may allow us to avert them, showing you the specific courses of action you can take to become active, responsible stewards of our planet's most precious resource—its oceans.",
  "genres": [
    "Nonfiction",
    "Science",
    "Environment",
    "Nature",
    "Politics",
    "Conservation",
    "Science Nature"
  ],
  "author": "Ted Danson",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/10228546-oceana"
}