{
  "title": "Out of My Mind",
  "description": "For four years Rafferty Jones and Nick Tucker have worked side-by-side as police detectives in their small Maine town. But lately, Rafferty's imagination has been creating fantasies about Nick-more specifically, about Nick and him together-that have shocked Rafferty. Detailed erotic scenarios a thirty-something, set-in-his-ways straight man shouldn't be imagining. He's been struggling to keep them secret, afraid that if Nick discovers the truth it will end their friendship. But with each passing day it's getting harder and harder to pretend Nick is \"just\" a friend. And harder and harder for Rafferty to come to terms with the possibility he might not be as straight as he's always believed.  Nick's always known he's gay and he's had deep feelings for Rafferty for years. But after a difficult experience at his former police precinct in Boston, he decided when he moved to Maine to keep his sexual orientation under wraps on the job. He wants to be acknowledged at work for what he can do, not who he's doing. And with Rafferty being straight, there's always been a clear-cut line that Nick's known he can't cross with his unsuspecting partner and best friend. And yet...for the past few months it's become difficult to remember that line. He's not sure why, he just knows that for the first time in four years his heart and his body are urging him to go for what he really wants...Rafferty.  When a stormy weekend trip on Rafferty's boat gives birth to an unexpected night of passion, will it be the spark they need to forge a new and deeper relationship? Or will Nick's past and Rafferty's fear drive a wedge between them that will destroy not only their barely-begun love affair, but their partnership and friendship as well?  Gay / Contemporary",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Contemporary",
    "Gay For You",
    "Romance",
    "Gay",
    "Erotica"
  ],
  "author": "M.L. Rhodes",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/3791878-out-of-my-mind"
}