{
  "title": "McIntyre Security Bodyguard Series - Box Set 1",
  "description": "The McIntyre Security Bodyguard Series - Box Set 1  Fall in love with the characters of the McIntyre Security Bodyguard series! Find out why so many readers are addicted to this series.  Book 1: Vulnerable  Beth Jamison had a rough start in life. She survived a childhood abduction, but her emotionally traumatic past still haunts her, and she suffers from anxiety and issues with intimacy. She doesn't know it, but the man who kidnapped her has just been released early from prison. Now she has secret bodyguards keeping her safe 24/7.  When CEO Shane McIntyre meets Beth, their mutual attraction is instant and intense, and Shane falls hard for Beth. Shane has his work cut out for him if he’s going to gain her trust before it’s too late. This alpha protector is determined to keep Beth safe and make her his.   Book 2: Fearless  Beth Jamison - Since childhood, I’ve lived under a shadow of fear and anxiety, afraid to trust anyone. All that changed when I met Shane. He's my lover, my protector, and my best friend. He's also my avenger. He taught me to cope with my fears. He gave me the courage to let someone in. But the threat’s still out there, and it’s coming back for me. I know Shane won’t let him get me this time, but at what cost? I can’t lose Shane. I just can’t.   Book 2.5: Shane (a novella)  Shane is a 26,000-word novella that retells the ending of Fearless from Shane's point of view, plus some additional material. Shane McIntyre will do anything to protect the love of his life. Even kill a monster. When convicted kidnapper Howard Kline comes after Beth Jamison to exact revenge for his two decades spent in prison, Shane will be waiting for him, ready to put an end to Beth's nightmare once and for all.   Book 3: Broken  Lia McIntyre - As a 22-year-old female professional bodyguard, Lia’s a rarity in a male-dominated field. She may be a petite, cute blond, but she’s a master of martial arts and Krav Maga, and she can render a man twice her size unconscious in just seconds. Lia hides a painful past behind a snarky, take-no-prisoners attitude. She was horribly betrayed by her first love, and she’s determined never to let anyone use her or hurt her again. To make sure that never happens again, she’s got rules. One, never sleep with a client. And two, never sleep with the same guy twice. The walls she’s built up to protect herself are rock solid. Until she meets her new client, Jonah Locke, a swoon-worthy rock star with a heart of gold.  Jonah Locke - Jonah Locke is the front man for the most popular rock band in the United States. His band dominates the charts, and he’s constantly hounded by crowds of fan-girls and paparazzi. The guy can’t sneeze without everyone on social media knowing. A bad break-up with the Queen of Pop sends him from LA to Chicago, where he just wants to lie low and write new songs. Unfortunately, trouble follows him to Chicago. When he meets his new bodyguard, he falls hard for her. But lust transforms into something more when he gets to know the woman beneath the kick-ass shell.",
  "genres": [],
  "author": "April  Wilson",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/37924868-mcintyre-security-bodyguard-series---box-set-1"
}