{
  "title": "Portrait of a Body in Wreckages",
  "description": "Details:  Winner of the 2017 Newfound Prose Prize.   Risograph printed on FSC-certified paper and stab-stitched in Austin, TX.   Author:Meghan McClure lives in Washington. Her work can be found in American Literary Review, Mid-American Review, LA Review, Water~Stone Review, Superstition Review, Bluestem, Pithead Chapel, Proximity Magazine, Boaat Press, Black Warrior Review, among others. Her collaborative book with Michael Schmeltzer, A Single Throat Opens (Black Lawrence Press, 2017). Praise:  “In spare and fragmented lyric essays reminiscent of Maggie Nelson’s Bluets the author of Portrait of a Body in Wreckages interrogates the body as landscape, as first possession, as desired and desiring, wrecked and repaired. Or not. A stunning, thoughtful, and thoroughly original work.”  –Kathy Fish “Meghan McClure's segmented work ranges with breathtaking ease across the terrain of the body and memory, looping between thought-provoking quotes and lyrical fragments. This work pushes beyond the autobiographical into an urgent and timeless present tense, beautifully delving into the corporeal and giving voice to the physical self.”  –Sonya Huber “Here, in what you are reading, Meghan McClure has made of her body a book, each fragment a searching scar. I am in love with her for this. To read Portrait of a Body in Wreckages is to know intimacy, and grace, and violence, and love. It is to know the deepest reaches of human vulnerability and the aching tenderness that results when we, forever pained, move through our own hurt. It is hard to describe the beauty of this book. It is a gift of curiosity and trust. It is a compassionate testament to life both in spite of and because of birth. I wish everything I touched shimmered as true as these words do. Read this on a day you feel like surrendering, when what you do not understand becomes wild and surrounds you. 'People are too big to love whole, and so we love them in parts,' Meghan writes. This book is little, so I can love it wholly. But even if it were bigger, I would rip out its pages and fashion out of them a skin.”  –Devin Kelly",
  "genres": [
    "Poetry",
    "Essays"
  ],
  "author": "Meghan McClure",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/37926684-portrait-of-a-body-in-wreckages"
}