{
  "title": "Raising the Hunley: The Remarkable History and Recovery of the Lost Confederate Submarine",
  "description": "The history of the Confederate submarine H. L. Hunley is as astonishing as its disappearance. On February 17, 1864, after a legendary encounter with a Union battleship, the iron “fish boat” vanished without a trace somewhere off the coast of South Carolina. For more than a century the fate of the Hunley remained one of the great unsolved mysteries of the Civil War. Then, on August 8, 2000, with thousands of spectators crowding Charleston Harbor, the Hunley was raised from the bottom of the sea and towed ashore. Now, award-winning journalists Brian Hicks and Schuyler Kropf offer new insights into the Hunley ’s final hours and recount the amazing true story of its rescue.The brainchild of wealthy New Orleans planter and lawyer Horace Lawson Hunley, the Hunley inspired tremendous hopes of breaking the Union’s naval blockade of Charleston, only to drown two crews on disastrous test runs. But on the night of February 17, 1864, the Hunley finally made good on its promise. Under the command of the heroic Lieutenant George E. Dixon, the sub rammed a spar torpedo into the Union sloop Housatonic and sank the ship within minutes, accomplishing a feat of stealth technology that would not be repeated for half a century.And then, shortly after its stunning success, the Hunley vanished.This book is an extraordinary true story peopled with a fascinating cast of characters, including Horace Hunley himself, the Union officers and crew who went down with the Housatonic , P. T. Barnum, who offered $100,000 for its recovery, and novelist Clive Cussler, who spearheaded the mission that finally succeeded in finding the Hunley . The drama of salvaging the sub is only the prelude to a page-turning account of how scientists unsealed this archaeological treasure chest and discovered the inner-workings of a submarine more technologically advanced than anyone expected, as well as numerous, priceless artifacts.Hicks and Kropf have crafted a spellbinding adventure story that spans over a century of American history. Dramatically told, filled with historical details and contemporary color, illustrated with breathtaking original photographs, Raising the Hunley is one of the most fascinating Civil War books to appear in years.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "War",
    "Maritime",
    "Archaeology"
  ],
  "author": "Brian Hicks",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1225398.Raising_the_Hunley"
}