{
  "title": "Winston Graham Poldark Series 12 Books Collection Set by Winston Graham (2015-11-09",
  "description": "Winston Graham Poldark Series 12 Books Collection Set (Ross Poldark, Demelza, Jeremy Poldark, Warleggan, The Black Moon, The Four Swans, The Angry Tide, The Stranger From The Sea, The Miller's Dance, Bella Poldark, The Twisted Sword, The Loving Cup. Description:- Ross Poldark Cornwall in the 1780s - when powerful forces of revolution and reaction are at large in the world. Tired from a grim war in America, Ross Poldark returns to his land and his family. Jeremy Poldark Cornwall 1790. Ross Poldark faces the darkest hour of his life. Accused of wrecking two ships, he is to stand trial at the Bodmin Assizes. Demelza Demelza Carne, the impoverished miner's daughter Ross Poldark rescued from a fairground rabble, is now his wife. But in the events of these turbulent years test their marriage and their love. Warleggan Cornwall 1792. Ross plunges into a highly speculative mining venture which threatens not only his family's financial security but also his turbulent marriage to Demelza. The Black Moon Cornwall 1794. The birth of a son to Elizabeth and George Warleggan serves only to accentuate the rift between the Poldark and Warleggan families. The Four Swans Cornwall 1795 -1799. Although Ross Poldark - now something of a war hero - seems secure in his hard-won prosperity, a new dilemma faces him in the sudden infatuation of a young naval officer for his wife Demelza. The Angry Tide Cornwall, towards the end of the 18th century. Ross Poldark sits for the borough of Truro as Member of Parliment. The Stranger From The Sea Cornwall 1810. The Poldark family awaits the return of Ross from his mission to Wellington's army in Portugal. But their ordered existence ends with Jeremy Poldark's dramatic rescue of The Stranger from the Sea. The Miller's Dance Cornwall 1812. At Nampara, the Poldark family finds the new year brings involvement in more than one unexpected venture.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Romance"
  ],
  "author": "Winston Graham",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/37955351-winston-graham-poldark-series-12-books-collection-set-by-winston-graham"
}