{
  "title": "The Inferno Series Boxed Set",
  "description": "Dante & The spark that ignited the Inferno....read about Dante and Becca's first encounter. SALVATION'S INFERNO Still reeling from a tragedy that changed his life, baseball superstar Dante Lamonte is a broken man. He keeps his demons at bay with alcohol and kinky sex, but never finds relief. Becca Hernandez is a sweet girl with terrible luck with men—and worse luck with sex. She hasn’t been able to forget her one-night stand with Dante or how he took her way out of her comfort zone in bed, but she knew they could never be together. When their paths cross again, they can’t resist picking up where they left off. One night of passion turns into much more, but their struggles dealing with the past and the present make it difficult to imagine a future. Becca stands to lose everything when details of their less-than-vanilla night at a sex club are leaked to the press—love may be their only salvation. TEMPTATION'S Two men. One threesome. Zero expectations. Jamie Teller has had a rough year. After being blackmailed by a teammate, weathering a sex scandal, and being traded to a team on the other side of the continent, he’s overwhelmed and looking for a distraction. A sexy threesome with his burly roommate and his wife wasn’t expected--neither is his sudden attraction to a guy. Viggo Sjoberg has been openly bisexual since he was 17, but he’d always assumed he would settle down with a woman. When he’s surprised with news he has a child from a past fling, he jumps headfirst into marriage and fatherhood, but his new wife isn't what she appeared to be. Adding to Viggo’s confusion are the feelings aroused by his seemingly straight roommate, Jamie. When Jamie moves thousands of miles away, Viggo tells himself it’s over. Until a life-changing event puts the two men on a collision course. Suddenly, Jamie needs Viggo—badly—and Viggo is prepared to do whatever it takes to help. Even if it means he has to give up everything he always thought he wanted. CUPID'S Join Jamie and Viggo at their wedding reception for a sweet, poignant story about life, love and family. REDEMPTION'S Emilie Sjoberg is haunted by her past. As the manager of a Las Vegas sex club she's no stranger to bindings, but she can't shake the dreams that hold her down. Unable to put together the details of what happened, she's determined to find out -- no matter the cost. Darryl \"Chains\" Carruthers never looked back after he left the elite British intelligence agency, MI6, because of a brutally failed mission. Currently the head of security at a sex club, he's slowly rebuilding his life. When his beautiful but mysterious boss disappears, Chains must revisit his own troubling past to find her because the past hasn't forgotten about either of them. As their feelings start to twist into something stronger than ever expected, they prepare to face it together. Chains will do anything to offer Emilie the redemption she desperately seeks and she's finally found the only Chains she'll ever need...but the cost of their picture-perfect future may be too high. Author’s This series is somewhat darker than my other books. Although they are all HEA’s, there are elements of BDSM, ménage, hate crimes, vigilante justice and LGBTQ relationships throughout the series. If you're concerned about trigger warnings, this may not be the series for you.",
  "genres": [],
  "author": "Kat Mizera",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/37936845-the-inferno-series-boxed-set"
}