{
  "title": "Boy Can Cheer",
  "description": "Word Count: 86,500+  Boy Can Cheer, the second book in the Lee Corcoran series, follows Lee Corcoran, a sophomore boy in high school whose life is not going as planned. In the first book, Boy for the Cheer, Lee became involved in a girls cheerleading program where he was reluctantly introduced to crossdressing. Lee finds that he enjoys the softer side of clothing. Circumstances seem to be forcing Lee to wear a feminine wardrobe in more situations. Even his summer seems destined to steal any attempt at masculinity.  In Boy Can Cheer, Lee’s choices in clothing and long hair lead to more complications in his life. Lee enters the dating scene and begins exploration of the relationships between boys and girls while finding himself further immersed in the cheerleading program.  When one of the competition cheerleaders gets injured before a major competition, they need a replacement who knows and can perform all the programs.  Every crossdresser has their own story of how their fetish developed. They also have a personal story on how they integrate crossdressing into their life. This story deals with a reluctant crossdresser who tries not to sacrifice his manhood while enjoying his unusual choice in clothing. As a sophomore, he finds himself pulled further into the feminine world than he believes he wants to go.  This story is a continuation of Boy for the Cheer and many of the characters may be better understood if you have read the first installment.  This book tries to deal with crossdressing as part of a real life. In many ways, Lee has a life many real world crossdressers only dream of.  Given the ages of the characters, the story does not involve explicit sex. Young adult readers should be comfortable reading this book.  **********  The Cheerleader series follows Lee Corcoran as he grows, matures, and experiences life from pre-high school through college. The main characters in this story will be recurring in other installments in the series. The long-term series involves romance and the second installment introduces Teen romance and exploration. Enjoy Daring Diane Keywords: cross-dressing, reluctant feminization, cheerleader, romance, coming of age",
  "genres": [
    "Young Adult",
    "Transgender"
  ],
  "author": "Daring Diane",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/37942222-boy-can-cheer"
}