{
  "title": "Minced, Marinated, and Murdered: A French Culinary Mystery",
  "description": "Revelations in a city where food is so much more than a meal in a deliciously authentic culinary mystery novel set in France.  A routine assignment in Lyon, France's traditional capital of gourmet food, turns bitter for food writer Laure Grenadier when a beloved chef is found murdered. A wave of panic follows with a second death, and Laure sets out to find the truth. As she reviews the city's traditional bistros, interviews the town's best chefs and local food producers, and shares stories and culinary lore with her photographer Paco Alvarez, she uncovers secrets and rivalries. But will she find the murderer before the city loses more of its master chefs?  Laure's passion for food and deep knowledge of culinary history combine with a reporter's natural curiosity and a particular Parisian chic, turning her into a natural sleuth in a city where food is so much more than a meal. Paco's photographer's eye brings the details to life, while murder and mayhem spice up the mix.  In this fun, satisfying, mouth-watering French mystery novel, authors Noël Balen and Vanessa Barrot whisk readers to France for a troubling mystery, local culinary anecdotes, recipes, home-grown products, and very human feelings.  \"When you feel as much hunger as grief, then you know you're still alive.\"  Praise  “To devour!” —Tribune de Lyon “A novel to savor and a series that promises to be delicious.” —ABC Polar “A succulent mystery in a series that mixes abominable crimes with the pleasures of the table. The recipe was perfectly simmered to give the reader cold chills and tickled tastebuds. “ —L’Actu Littéraire “Clever with strong dialogue.” —La Revue du Vin de France “Pleasant and easy to read.” —Mag 2 Lyon “Extremely well researched with fabulous suspense.” —Alsace Magazine  The authors Noël Balen, writer and musician, has over thirty mysteries to his name, including the Winemaker Detective series, a hit cozy mystery and TV series. Hi co-author and wife Vanessa Barrot is a corporate lawyer who comes from a family of Parisian restaurant owners.  Translator Anne Trager founded Le French Book as an expression of her ongoing passion for France and crime fiction. She adapted this mystery into English with the help of award-winning editor Amy Richards.",
  "genres": [
    "France",
    "Food",
    "Mystery"
  ],
  "author": "Noël Balen",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/37937935-minced-marinated-and-murdered"
}