{
  "title": "Escape to Clown Town",
  "description": "General Sharaya touched Duchess’ dark brown hair as she lay weak and dying on the cold stone floor of their jail cell. The dark star Epsilon Eridani finally succeeded in taking her star stone. Duchess has yet to learn that General Sharaya is her cousin and that she herself is Faree.18 year old Duchess is a simple village girl that has no idea that she is at the center of the most epic war of the ages that is soon to come. Duchess tries desperately to escape her village upbringing and dreams of becoming a dancer in the famous Royal Clown Ballet. Duchess has not been told the truth about her royal fairy lineage and falls victim to a universal plot; conjured by the dark star Epsilon Eridani. The clowns easily ensnare Duchess by seducing her with the life she’s always dreamed of.After Duchess escapes her kidnapper, she wakes up in the grandest room she has ever been in. When she gets up to look out of her window, she realizes that she is in the Grand Clown Plaza Hotel located in the center of Clown Town. King Clownington quickly learns of Duchess’ arrival to Clown Town and immediately plots with Epsilon on how to extract her star stone. Epsilon learned from killing many fairies that star stones must be freely given in order to retain their power and cannot be extracted under duress. King Clownington orders his son Jax to court Duchess and the entire clown family does all that they can to trick Duchess into sacrificing her stone.Duchess falls in love with the king’s son but starts to grow suspicious when she tries to leave Clown Town and is not able to. General Sharaya sends Duchess a seemingly cryptic message about the clowns that Duchess fails to understand, until it’s too late. With the universe on the brink of a war that has the power to penetrate space and time, will Duchess become trapped by her hatred of the clowns or freed by her new found destiny?",
  "genres": [],
  "author": "Tephra Miriam",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/37944796-escape-to-clown-town"
}