{
  "title": "The Union that Shaped the Confederacy: Robert Toombs and Alexander H. Stephens",
  "description": "One was a robust charmer given to fits of passion, whose physical appeal could captivate women as easily as cajole colleagues. The other was a frail, melancholy man of quiet intellect, whose ailments drove him eventually to alcohol and drug addiction. Born into different social classes, they were as opposite as men could be. Yet these sons of Georgia, Robert Toombs and Alexander H. Stephens, became fast friends and together changed the course of the South.Writing with the style and authority that has made him one of our most popular historians of the Civil War, William C. Davis has written a biography of a friendship that captures the Confederacy in microcosm. He tells how Toombs and Stephens dominated the formation of the new nation and served as its vice president and secretary of state. After years of disillusionment, each abandoned participation in the government and left to its own fate a Confederacy that would not dance to their tune.Davis traces this unlikely relationship from its early days in the Georgia legislature through the trials of secession and war, revealing how both men persevered during the war and developed a deep animosity for Jefferson Davis. He then chronicles their postwar lives up to the emotional moment when Toombs stood eulogizing his long-time friend at his funeral, just four months after Stephens was elected governor of the Georgia they had loved as much as one another.Drawing extensively on primary sources, including Stephens's voluminous letters and Toombs' widely scattered papers, Davis tells how two men of different temperaments remained friends, out of step with all but a few and occasionally even with each other. He concentrates on their Confederate years, when the fraternity they shared had its greatest impact, to show how they embodied both the strengths and the weaknesses of the Confederacy.While there are biographies of each man, none convey the significance--or the depth--of their friendship. Davis shows us how they loved the South as it once was, the Union as they thought it ought to have been, and the Confederacy of their dreams that never came to be. They lost all three, but through five decades of crisis, they never failed each other.",
  "genres": [
    "Civil War",
    "Biography",
    "History",
    "Politics",
    "American History"
  ],
  "author": "William C. Davis",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/379608.The_Union_that_Shaped_the_Confederacy"
}