{
  "title": "Poached: Inside the Dark World of Wildlife Trafficking",
  "description": "An intrepid investigation of the criminal world of wildlife trafficking--the poachers, the traders, and the customers--and of those fighting against itJournalist Rachel Nuwer plunges the reader into the underground of global wildlife trafficking, a topic she has been investigating for nearly a decade. Our insatiable demand for animals -- for jewelry, pets, medicine, meat, trophies, and fur -- is driving a worldwide poaching epidemic, threatening the continued existence of countless species. Illegal wildlife trade now ranks among the largest contraband industries in the world, yet compared to drug, arms, or human trafficking, the wildlife crisis has received scant attention and support, leaving it up to passionate individuals fighting on the ground to try to ensure that elephants, tigers, rhinos, and more are still around for future generations.As Reefer Madness (Schlosser) took us into the drug market, or Susan Orlean descended into the swampy obsessions of The Orchid Thief , Nuwer--an award-winning science journalist with a background in ecology--takes readers on a narrative journey to the front lines of the to killing fields in Africa, traditional medicine black markets in China, and wild meat restaurants in Vietnam. Through exhaustive first-hand reporting that took her to ten countries, Nuwer explores the forces currently driving demand for animals and their parts; the toll that demand is extracting on species across the planet; and the conservationists, rangers, and activists who believe it is not too late to stop the impending extinctions. More than a depressing list of statistics, Poached is the story of the people who believe this is a battle that can be won, that our animals are not beyond salvation.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Science",
    "Nature",
    "Environment",
    "Wildlife",
    "Conservation"
  ],
  "author": "Rachel Love Nuwer",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/37969630-poached"
}