{
  "title": "The Foundry",
  "description": "The Dianis, A World in Turmoil chronicles are here, lead off by The Foundry. Chief Inspector Achelous begins his battle with Nordarken Mining, the most powerful conglomerate in the galaxy. Assigned to protect the primitive planet of Dianis from extrasolar incursions, Achelous learns that he and the entire Interspecies Development Branch have been reassigned, under questionable circumstances, to a distant world. The recent discovery of a critical resource on Dianis, a gem crucial to the Turboii War effort, is suspiciously coincidental to the reassignment. Protected by the Universal Law of Unclaimed Planets, Dianis is strictly off limits for resource extraction and societal interference. Achelous, a ULUP enforcer and cultural anthropologist, is distressed. What will happen when the IDB leaves Dianis, exposing it to the plundering of galactic corsairs? His fear is acute as he has fallen in love with Marisa, a Dianis provincial, which is strictly forbidden by ULUP. Moreover, he and Marisa have a son. The thought of leaving Marisa and his son behind in the IDB exodus is unbearable, yet he has only one other choice.  Moral conflict affects all members of the IDB team. Led by Achelous they plot to thwart the supposed invasion of Nordarken Mining. However, other forces conspire against the team, not least of which are the Paleowrights, a Dianis religious sect obsessed with Achelous's activities. The Paleowrights want his secrets for themselves. Saving the planet from Nordarken transgression is not their concern. They instead seek to crush all opposing religions and aid their ally, the Empire of Nak Drakas, in continental conquest.However, in the fight between liberty and tyranny, the IDB team is not alone. Come join us to witness Marisa, the trader princess, and Christina, the Ascalon Defender, respond to the call of their home, Dianis.",
  "genres": [],
  "author": "Frank Dravis",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/37969933-the-foundry"
}