{
  "title": "SEAL of My Dreams",
  "description": "True heroes who will win your heart. Honor, duty, courage, passion . . . the men of the Navy SEALs are a special breed of hero, and in these stories by eighteen top romance authors the SEALs are celebrated not only as symbols of devoted service to their country but as the kind of man every woman wants to love. They'll rescue a damsel in distress and her lap dog, too. They'll battle hometown dramas and international bad guys. When it comes to giving away their hearts, they'll risk everything. All proceeds from sales of SEAL of My Dreams goes to the Veterans Research Corporation, a non-profit fundraiser for veterans' medical research.Among them, the authors of SEAL of My Dreams have won dozens of writing awards including multiple RITAs from Romance Writers of America. Their nearly 600 published novels have sold at least 25 million copies worldwide. The SEAL of My Dreams roster includes many of the best-known authors in modern romance fiction. In addition, many have strong family connections to the servicemen and women of our nation's military, and many specialize in novels featuring heroes and heroines from all branches of service. Visit the authors at www.sealofmydreams.com.Contents:Foreword by Robyn CarrComing Home by Jami AldenBaby I'm Back by Stephanie Bond -- Southern Roads #3.5SEALed Fates by Kylie BrantGoing Dark by Helen BrennaFinding Home by HelenKay DimonSEALed With a Kiss by Cindy Gerard -- Black Ops #6.5Panama Jack by Tara JanzenWrapped and SEALed by Leslie KellyWorth the Risk by Elle KennedyTwenty-one Hours by Alison Kent -- The Dalton Gang #0.5Not Waving But Drowning by Jo LeighHer Secret Pirate by Gennita Low -- Crossfire #4 SEALed by Fate by Marliss MeltonSigned, SEALed, Delivered...I'm Yours by Christie RidgwayDog Heart by Barbara SamuelWhirlwind by Roxanne St. ClaireHolding On by Stephanie Tyler -- Hold Trilogy #3.5Letters to Ellie by Loreth Anne White",
  "genres": [
    "Romance",
    "Anthologies",
    "Military Fiction",
    "Contemporary Romance",
    "Romantic Suspense",
    "Contemporary",
    "Military Romance"
  ],
  "author": "Jami Alden",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/12255481-seal-of-my-dreams"
}