{
  "title": "Chappaquiddick: Power, Privilege, and the Ted Kennedy Cover-Up",
  "description": "\"An achievement of reportorial diligence, this book tells a story that the most imaginative crime novelist would have been hard put to invent. It is a tale of death, intrigue, obstruction of justice, corruption and politics.\" — People MagazineA young woman leaves a party with a wealthy U.S. senator. The next morning her body is discovered in his car at the bottom of a pond.This is the damning true story of the death of campaign strategist Mary Jo Kopechne at Chappaquiddick and of the senator—37-year-old Senator Ted Kennedy—who left her trapped underwater while he returned to his hotel, slept, and made phone calls to associates. It is the story of a powerful, privileged American man who was able to treat a woman's life as disposable without facing real consequences. And it is the story of a shameful political coverup involving one of the nation's most well-connected families and its network of lawyers, public relations people, and friends who ensured Ted Kennedy remained a respected member of the Senate for forty more years.Originally published in 1988 under the title Senatorial Privilege , this book almost didn't make it into print after its original publisher, Random House, judged it too explosive and backed out of its contract with author Leo Damore. Mysteriously, none of the other big New York publishers wanted to touch it. Only when small independent publisher Regnery obtained the manuscript was the book's publication made possible and the true story of the so-called \"Chappaquiddick Incident\" finally told. This new edition, Chappaquiddick , is being released 30 years after the original Senatorial Privilege to coincide with the nationwide theatrical release of the movie Chappaquiddick starring Jason Clarke, Kate Mara, Ed Helms, Bruce Dern, and Jim Gaffigan.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Politics",
    "Crime",
    "Biography",
    "Audiobook"
  ],
  "author": "Leo Damore",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/37955957-chappaquiddick"
}