{
  "title": "Body Drama: Real Girls, Real Bodies, Real Issues, Real Answers",
  "description": "\"You’d think a Miss America swimsuit winner would feel completely confident about her body, right? Not always! So I decided to write the book I wish I’d had as a teen and in college—an honest, funny, practical, medically accurate, totally reassuring guide to how women’s bodies actually look, smell, feel, behave, and change. Alongside real-deal photographs of women just like you and me (no airbrushing, no supermodels, no kidding) you’ll find medical pictures of things you need to be able to recognize, true confessions by yours truly, and the encouragement you need to appreciate the uniqueness, strength, and beauty of your body. What are you waiting for?\"—Nancy ReddFrom fashion magazines to taboo Web sites, curious young women have access to tons of old wives' tales about and thousands of airbrushed and inaccurate images of the female body—misinformation and harmful portrayals that can lead to low self-esteem, self-destructive acts, or even disturbing plastic surgery procedures. Teaming up with a leading physician specializing in adolescent health issues, Harvard graduate and former Miss Virginia Nancy Redd now offers a down-to-earth, healing, and reassuring response to those damaging myths. In Body Drama , Redd gives girls insight into the issues they're often too ashamed to raise with a doctor or parent. She also reveals her own experiences with the culture of \"American beauty,\" and shows readers all the many versions of \"normal.\" From body hair and bras, to acne and weight issues, along with crucial issues such as the importance of a healthy self image, Body Drama is a groundbreaking book packed with informative fast facts, FYIs, how-tos, and moving personal anecdotes as well as hundreds of un-retouched photographs. A highly visual book, it’s the first of its kind for filled with real information and real photographs of real bodies, to celebrate all our different shapes and sizes.Named by Glamour magazine as one of America’s top-ten college women \"most likely to succeed—at anything,\" Redd has spent the most recent years of her life on a mission to tackle the issues least discussed but most significant in young women’s lives. Celebrating the many versions of \"normal,\" and replacing seriously erroneous information with the honest, medically proven truth in a language all girls can understand, Body Drama dares to empower a new generation—with facts instead of fantasies, and the priceless gift of self-knowledge.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Health",
    "Teen",
    "Self Help",
    "Womens",
    "Adult"
  ],
  "author": "Nancy Amanda Redd",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/1225592.Body_Drama"
}