{
  "title": "The Forbidden Place",
  "description": "In this \"bone-chillingly cool crime debut\" (Paula Hawkins, author of The Girl on the Train ), a young biologist studying the remote Swedish wetlands stumbles upon a body -- and finds that if the marsh's secrets can't stay buried, neither can hers . . .In the remote Swedish wetlands lies the village on the edge of the mire where, once upon a time, people came to leave offerings to the gods.Biologist Nathalie came in order to study the peat bogs. But she has a Mossmarken was once her home, a place where terrible things happened. She has returned at last, determined to confront her childhood trauma and find out the truth.Soon after her arrival, she finds an unconscious man out on the marsh, his pockets filled with gold -- just like the ancient human sacrifices. A grave is dug in the mire, which vanishes a day after. And as the police investigate, the bodies start to surface . . .Is the mire calling out for sacrifices, as the superstitious locals claim? Or is it an all-too-human evil?Richly atmospheric and haunting to the last page, Susanne Jansson's stunning debut is a gripping tale of the power of nature to shape our reality, the stories we tell ourselves to make sense of the world, and the terrible consequences they may have. This international sensation will captivate fans of the celebrated suspense fiction of Jane Harper or Tana French.In the North Swedish wetlands lies the village on the edge of the mire where, once upon a time, people came to leave offerings to the gods.Biologist Nathalie has come to the village to study the peat bogs, but she has a Mossmarken was once her home. She has finally returned, determined to confront her childhood trauma and uncover the truth behind the terrible things that happened.Soon after her arrival, Nathalie finds an unconscious man out on the marsh, his pockets filled with gold - just like the ancient human sacrifices. A grave is dug in the mire, which vanishes a day after. And as the police investigate, the bodies begin to surface . . .Is the mire calling out for sacrifices, as the superstitious locals claim? Or is it an all-too-human evil?An international sensation, The Forbidden Place is a gripping tale of the power of nature in shaping our reality; the stories we tell ourselves to make sense of the world and the lasting consequences they may have.",
  "genres": [
    "Mystery",
    "Thriller",
    "Crime",
    "Fiction",
    "Contemporary",
    "Mystery Thriller",
    "Horror"
  ],
  "author": "Susanne Jansson",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/37955613-the-forbidden-place"
}