{
  "title": "Evolution: The Remarkable History of a Scientific Theory",
  "description": "“I often said before starting, that I had no doubt I should frequently repent of the whole undertaking.” So wrote Charles Darwin aboard The Beagle , bound for the Galapagos Islands and what would arguably become the greatest and most controversial discovery in scientific history. But the theory of evolution did not spring full-blown from the head of Darwin. Since the dawn of humanity, priests, philosophers, and scientists have debated the origin and development of life on earth, and with modern science, that debate shifted into high gear.In this lively, deeply erudite work, Pulitzer Prize–winning science historian Edward J. Larson takes us on a guided tour of Darwin’s “dangerous idea,” from its theoretical antecedents in the early nineteenth century to the brilliant breakthroughs of Darwin and Wallace, to Watson and Crick’s stunning discovery of the DNA double helix, and to the triumphant neo-Darwinian synthesis and rising sociobiology today.Along the way, Larson expertly places the scientific upheaval of evolution in cultural the social and philosophical earthquake that was the French Revolution; the development, in England, of a laissez-faire capitalism in tune with a Darwinian ethos of “survival of the fittest”; the emergence of Social Darwinism and the dark science of eugenics against a backdrop of industrial revolution; the American Christian backlash against evolutionism that culminated in the famous Scopes trial; and on to today’s world, where religious fundamentalists litigate for the right to teach “creation science” alongside evolution in U.S. public schools, even as the theory itself continues to evolve in new and surprising directions.Throughout, Larson trains his spotlight on the lives and careers of the scientists, explorers, and eccentrics whose collaborations and competitions have driven the theory of evolution forward. Here are portraits of Cuvier, Lamarck, Darwin, Wallace, Haeckel, Galton, Huxley, Mendel, Morgan, Fisher, Dobzhansky, Watson and Crick, W. D. Hamilton, E. O. Wilson, and many others. Celebrated as one of mankind’s crowning scientific achievements and reviled as a threat to our deepest values, the theory of evolution has utterly transformed our view of life, religion, origins, and the theory itself, and remains controversial, especially in the United States (where 90% of adults do not subscribe to the full Darwinian vision). Replete with fresh material and new insights, Evolution will educate and inform while taking readers on a fascinating journey of discovery.",
  "genres": [
    "Science",
    "History",
    "Nonfiction",
    "Evolution",
    "Biology",
    "History Of Science",
    "Natural History"
  ],
  "author": "Edward J. Larson",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/380082.Evolution"
}