{
  "title": "The Last of the Lairds: or The Life and Opinions of Malachi Mailings Esq. of Auldbiggings",
  "description": "Excerpt:\"...could make no impression, and apprehensive that entreaty would prove equally ineffectual; but nevertheless he again addressed the Nabob, in a firmer tone, however, than he had hitherto employed - \"Sir, such proceedings are not in unison with the feelings of this country. Mr. Mailings is the representative of an ancient family; the habits and affections of the people of Scotland are still strongly disposed to take the part of a man of his condition when he suffers from oppression.\" \"They were\" replied the Nabob, drily; \"but now, I suspect, they are quite as well disposed to esteem those who, by their own merits, have made their own fortunes, and have brought home from other countries the means of improving their native land. I have myself spent more money here, Dr. Lounlans, on Nawaubpore, than all that the Mailings, since the Ragman's Roll, have had to spend, whether got by thieving in days of yore, or by rack rents and borrowing in our own time.\" \"But, Sir,\" replied the young minister, fervently, \"the day is yet far distant, and I hope will long remain so, when the honest people of Scotland will look tamely on and see mere wealth and ostentation treading down their ancient gentry.\" \"Ay, honest Ah that's but a small portion of the nation, even including the General Assembly of the Church and the College of Justice. But if they were as numerous as the daft and the imbecile, who, you will allow, are not to seek among gentry of the landed interest, as, indeed, in my opinion, they constitute the majority of the nation at large; for, you know, that every man of sense and talent seeks his fortune abroad, and leaves only the incapable and those who are conscious of their deficiences at home.\" Apprehensive that the conversation might become a little too eagerly po...'",
  "genres": [],
  "author": "John Galt",
  "average_rating": "2.67",
  "url": "https://www.goodreads.com/book/show/3800457-the-last-of-the-lairds"
}