{
  "title": "The Language of Stones",
  "description": "The Language of StonesThe first volume of an epic fantasy and a mythological thriller where the Wars of the Roses are raging, but this is not England as we know it. Young Will and Master Gwydion, a wizard, struggle to save the Realm from the stones of power. A kind of magic flows through the veins of the earth in the Realm and this is used by wizards and misused by sorcerers to change history.The Realm is poised for war. Its weak king - Hal, grandson of a usurper - is dominated by his beautiful wife and her lover. Against them stands Due Richard of Ebor and his allies. The two sides are set on a bloody collision course. Gwydion is watching over the realm. He has walked the land since before the time of the druids, since before the Slavers came to subdue the people. Gwydion was here when Arthur rode to war: then they called him 'Merlyn'. But for his young apprentice, Willand, a fearsome lesson in the ways of men and power lies ahead.The Realm is an England that is still magical. Legendary beasts still populate its by-ways. It is a land criss-crossed by lines of power upon which standing stones have been set as a secret protection against invasion. But the power of the array was broken by the Slaver who laid straight roads across the land, and built walled cities of shattered stone.A thousand years have passed since then, and those roads and walls have fallen into decay. The dangerous stones are awakening, and their unruly influence is calling men to battle. Unless Gwydion and Will can unearth them, the Realm will be plunged into a disastrous civil war. But there are many enemies ranged against them: men, monsters and a sorcerer as powerful as Gwydion himself.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Arthurian",
    "Historical Fiction",
    "Historical",
    "Mythology"
  ],
  "author": "Robert    Carter",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/38079.The_Language_of_Stones"
}