{
  "title": "The Giants' Dance",
  "description": "A rich and evocative tale set in a mythic 15th century Britain, to rival the work of Bernard Cornwell. In the peaceful village of Nether Norton life goes on as it has for centuries in the Realm, through the coming and going of the Slavers and the arrival of the Sightless Ones and their Chapter Houses. On Loaf Day, as the villagers celebrate gathering in the first of their harvest, Will looks back fondly on the two years since he and his sweetheart Willow circled the fire together, especially the year since their daughter Bethe was born. But despite his good fortune, a feeling of unease is stirring inside him. When he sees an unnatural storm raging on the horizon he knows that his past is coming back to haunt him. Four years ago Will succeeded in cracking the Doomstone in the vault of the Chapter House at Verlamion to bring a bloody battle to its end. It seemed then that the lust for war in men's hearts had been calmed forever. But now Will is no longer certain his success was quite so absolute, and he calls on his old friend and mentor Gwydion, a wizard of deep knowledge and power once called 'Merlyn', for advice. Gwydion suspects his old enemy, the sorcerer Maskull, has escaped from the prison he was banished to when Will cracked the Doomstone. Now Maskull is once again working to hasten a devastating war between King Hal and Duke Richard of Ebor, with the help of the battlestones that litter the landscape inciting hatred in all who draw near. Only Will, whom Gwydion believes to be an incarnation of King Arthur, has the skill to break the power of the battlestones. When Will last left Nether Norton he was an unworldly youth of thirteen. Now he is a husband and father, he has a lot more to lose. But he has a whole Realm to save.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Arthurian",
    "Historical Fiction"
  ],
  "author": "Robert    Carter",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/38077.The_Giants_Dance"
}