{
  "title": "Porphyry's Against the Christians",
  "description": "Throughout its first three centuries, the growing Christian religion was subjected not only to official persecution but to the attacks of pagan intellectuals, who looked upon the new sect as a band of fanatics bent on worldwide domination even as they professed to despise the things of this world. Prominent among these pagan critics was Porphyry of Tyre (ca. 232-ca. 305 C.E.), scholar, philosopher, and student of religions. His book Against the Christians (Kata Christianon), was condemned to be burned by the imperial Church in 448. It survives only in fragments preserved by the cleric and teacher Macarius Magnes.This new translation of the remains of Against the Christians, by renowned biblical scholar R. Joseph Hoffmann, reveals a work of deft historical and literary criticism. Porphyry's trenchant comments extend to key figures, beliefs, and doctrines of Christianity as he roundly attacks the divinity of Jesus, the integrity of the apostles, the Christian concept of God, and the Resurrection. Porphyry dismisses the gospels as the work of charlatans and Jesus himself as a criminal and failure. In short, the gospels, as a collective account of the life and deeds of Jesus, are hardly worth the reverence with which an increasing number of Christian converts of Porphyry's own day have begun treating them.Critical notes by the translator provide a running commentary to the text. A lively introduction and comprehensive epilogue describe the \"buildup\" to the pagan critique of Christianity, and help put Porphyry's work in historical perspective.Accessible to the general reader, and a valuable scholarly tool as well, this new translation of Against the Christians proves a worthy addition to both classical and patristic studies.",
  "genres": [
    "Philosophy",
    "Religion",
    "Nonfiction",
    "History",
    "Classics",
    "Christianity",
    "Ancient History"
  ],
  "author": "Porphyry",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/1225720.Porphyry_s_Against_the_Christians"
}