{
  "title": "Cose Non Soggette Alla Gravità",
  "description": "\"Cose Non Soggette Alla Gravità è un eccentrico thriller costellato di personalità discutibili ma anche d’insegnamenti per la crescita spirituale, di riferimenti esoterici ma anche della chiave per far sparire tutti i misteri, a volte con poca pazienza e tante sigarette ma capace di essere sexy, illuminante e di far innamorare.\" Michael Shiva Surya - Tu hai decisamente qualche rotella fuori posto – rispose Set passandosi le mani sulla faccia. - Forse o forse sono l’unico personaggio di questa storia che ha capito la verità – considerò Sybil con una scrollata di spalle. Si rigirò l’anello sull’anulare e si piegò verso di lui per guardarlo meglio. – Set, tu credi che esistano delle regole prefissate? Credi nel concetto di giusto e sbagliato? – chiese curioso. - Credo in quello che vedo – rispose asciutto il suo ospite. - Anche Newton quando ha scoperto la gravità ha creduto in quello che ha visto, eppure c’è un numero incalcolabile di cose invisibili e, tra queste, innumerevoli sono le cose non soggette alla gravità – argomentò paziente l’Oracolo. - E questo che cosa c’entra con il fatto che mi sono quasi scopato la tua domestica? – rispose Set piegandosi a sua volta sul tavolo e guardandolo storto. \"Il futuro è tutto già scritto? O ci sono innumerevoli cose che sfuggono anche al destino perché non sono soggette alla gravità? La vita di Set cambia all'improvviso, quando lo avvicina Sybil, l'uomo che lui è destinato ad uccidere. Sybil é una persona enigmatica, estranea ai comuni modelli psicologici e quasi soprannaturale. Tra loro nasce un rapporto profondo che porta entrambi ad ampliare la propria conoscenza di sé, a dominare i propri demoni interiori fino all'epilogo finale. Il tutto si muove all'interno di un gioco più grande, in cui una potente organizzazione religiosa su scala mondiale sta cercando Sybil per impedire che un prezioso amuleto cada nelle mani sbagliate. Un thriller mistico in cui ogni personaggio si muove in autonomia e ci mostra la storia dal suo punto di vista; il lettore segue passo passo la matassa che si dipana fino a trovare l'inizio del filo che unisce tutti in un unico, grande disegno.\" Clara Portelli \"Un libro emozionante che parla alla mente e all'anima. Ho adorato la caratterizzazione dei personaggi e le trame psicologiche. E' un libro che fa riflettere su varie domande che l'uomo si pone da sempre.\" Alessia Gobbo aka AlyCrafty",
  "genres": [],
  "author": "Michael Shiva Surya",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/38092816-cose-non-soggette-alla-gravit"
}