{
  "title": "Old Times On The Mississippi",
  "description": "Old Times On The Mississippi is a memoir written by Mark Twain about his experiences as a steamboat pilot on the Mississippi River before the American Civil War. The book is a collection of anecdotes and observations about life on the river, including descriptions of the people, places, and events that Twain encountered during his time as a pilot. Twain's writing is humorous and insightful, and he provides a unique perspective on a bygone era of American history. The book also includes illustrations and photographs that help to bring the stories to life. Overall, Old Times On The Mississippi is a fascinating and entertaining read for anyone interested in American history, river travel, or the writings of Mark Twain.And then if you will go on until you know every street crossing, the character, size, and position of the crossing-stones, and the varying depth of mud in each of those numberless places, you will have some idea of what the pilot must know in order to keep a Mississippi steamer out of trouble. Next, if you will take half of the signs in that long street, and change their places once a month, and still manage to know their new positions accurately on dark nights. and keep up with these repeated changes without making any mistakes, you will understand what is required of a pilot's peerless memory by the fickle Mississippi.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Nonfiction",
    "Classics"
  ],
  "author": "Mark Twain",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/380808.Old_Times_On_The_Mississippi"
}