{
  "title": "Dream Dancer",
  "description": "The universe called. She answered. Everything you've seen or read till now took you only to the brink . . .Neither pure fantasy, nor straight science fiction, nor earthbound dynastic saga, Dream Dancer is a stunning amalgam of all three. It is a family saga with the epic appeal of Dune and the action and excitement of Star Wars. It is a saga of love, power and treachery that will appeal to men and women equally; full of action, compulsively readable and quite unlike anything being published in the realms of fantasy today.The heroine, Shebat, is a remarkable girl from Earth. She is brought to the vast empire of the Kerrion family by a renegade son; named as its future ruler on a whim of his autocratic father; abducted to the slums where the Kerrions' slaves drug themselves with powerful mystical sorcery; and finally rescued to take part in a great rebellion. She falls in love with one brother but marries another and becomes more Kerrion than some born to the name. A magical seductress of men, passionate in her lust for power, Shebat moves among those who control the destinies of millions, for whom treachery and betrayal are as easy as murder. Set in the timeless future on a primitive, savage Earth and on the sophisticated habitats of deep space, Dream Dancer is the first volume of a three-part saga. \"Not since Dune have we witnessed a power struggle of such awesome intensity. Dream, Dancer may well be the I, Claudius of fantasy novels. A literary feast!\" -- Eric Van Lustbader, author of The Ninja.\"Dream Dancer is a fascinating and lyrical story, told with great invention\" -- Peter Straub, author of Ghost Story.\"The pacing is brisk; fascinating concepts abound.\" -- Booklist",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Space Opera"
  ],
  "author": "Janet E. Morris",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/38117618-dream-dancer"
}