{
  "title": "Demand the Impossible: Essays in History as Activism",
  "description": "Born from the wave of activism that followed the inauguration of President Trump, Demand the Impossible asks scholars what they can do to help solve present-day crises. The twelve essays in this volume draw inspiration from present-day activists. They examine the role of history in shaping ongoing debates over monuments, racism, clean energy, health care, poverty, and the Democratic Party. Together they show the ways that the issues of today are historical expressions of power that continue to shape the present. Adequately addressing them means understanding their origins.The way our society remembers the past has long served to cement inequality. It is no accident that the ahistorical slogan “make America great again” emerged after decades of income inequality and a generation of funding cuts to higher education. But the movement toward openly addressing injustice and inequality though historical inquiry is growing. Although many historians remain tucked away in ivory towers of their own making, we join a long tradition of activist scholars like W.E.B. Du Bois, C.L.R. James, and C. Vann Woodward, as well as a growing wave of engaged colleagues including Keri Leigh Merritt, who penned the foreword for this volume. As historians and citizens, we feel a responsibility to preserve an authentic vision of the past in a moment riddled with propaganda and lies. In doing so, we hope to help provide a framework to fight the inequities we inherited from prior generations that are repurposed and enshrined by the powerful today.Nathan Wuertenberg is a doctoral candidate at The George Washington University. He is conducting research for a doctoral dissertation on the 1775 American invasion of Quebec, entitled “Divided We Stand: The American War for Independence, the 1775 Quebec Campaign, and the Rise of Nations in the Twilight of Colonial Empires.”William Horne is a PhD candidate at The George Washington University researching the relationship of race to labor, freedom, and capitalism in post-Civil War Louisiana. His dissertation, “Carceral State: Baton Rouge and its Plantation Environs Across Emancipation,” examines the ways in which white supremacy and capitalism each depended on restricting black freedom in the aftermath of slavery.",
  "genres": [
    "History",
    "Politics",
    "Essays"
  ],
  "author": "Nathan Wuertenberg",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/38124557-demand-the-impossible"
}