{
  "title": "France and England in North America, Volume 2",
  "description": "This is the second of two Library of America volumes (the companion volume here) presenting, in compact form, all seven parts of Francis Parkman’s monumental narrative history of the struggle for control of the American continent. Thirty years in the writing, Parkman’s “history of the American forest” is an accomplishment hardly less awesome than the explorations and adventures he so vividly describes. The story reaches its climax with the fatal confrontation of two great commanders at Quebec’s Plains of Abraham—and a daring stratagem that would determine the future of a continent.Count Frontenac and New France under Louis XIV (1877) details how France might have won her imperial struggle with England. Frontenac, a courtier who was made governor of New France by that most sagacious of monarchs, oversaw the colony’s brightest era of growth and influence. Had Canada’s later governors possessed his administrative skill and personal force, his sense of diplomacy and political talent, or his grasp of the uses of power in a modern world, the English colonies to the south might have become part of what Frontenac saw as a continental scheme of French dominion.England’s American colonies flourished, while France, in both the Old World and the New, declined from its greatness of the late seventeenth century. Conflict over the developing western regions of North America erupted in a series of colonial wars. As narrated by Parkman in A Half-Century of Conflict (1892), these American campaigns, while only part of a larger, global struggle, prepared the colonies for the American Revolution.In Montcalm and Wolfe (1884) Parkman describes the fatal confrontation of the two great French and English commanders whose climactic battle marked the end of French power in America. As the English colonies cooperated for their own defense, they began to realize their common interests, their relative strength, and their unique position. In this imperial war of European powers we also begin to see the American figures—Benjamin Franklin, George Washington—soon to occupy a historical stage of their own.Parkman’s chronicle of nearly two and a half centuries of conflict will permanently transform our image of the American landscape. Written with verve, suppleness, and wit, this grand narrative history of political and theological conflict, of feats of physical endurance, of courtly manners practiced with comic disproportion against the backdrop of a looming wilderness, is itself one of the still-undiscovered treasures of our national and of world literature.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Classics",
    "19th Century",
    "American",
    "Canada"
  ],
  "author": "Francis Parkman",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/1225981.France_and_England_in_North_America_Volume_2"
}