{
  "title": "Prophet of Doom",
  "description": "The first time I saw the future I lost hope.It wasn't just that the future sucked; that civilization had gone and ruined itself; that we'd altered our own DNA and devolved into predatory monsters that fed on the few remaining survivors. That was all awful enough, but it was more than that. I remember being young and thinking, when I grow up, I'll have a nice big house. I'll get an exciting, interesting job. I'll meet the man of my dreams and we'll fall in love and stay together forever.But that all disappeared the first time I tripped 20 years into the future and found the houses burned, the handsome boys dead, and the only jobs were the ones young girls gave hairy old survivors in tents in exchange for a little food and water. Nobody asked little girls what they wanted to be when they grew up anymore. Nobody wanted to draw attention to the fact that most of them wouldn't live that long.There was no hope, no peace for anyone. At least I had it better than they did. When my trip was over, I would get to go back. Back to the normalcy of 2015. Back to iPhones and Twitter and buying so much food it went bad before you could eat it. Back to laughing over foamy cappuccinos and iced lattes at the mall, window shopping and flirting with hot guys (not that I ever did that, mind you - but I always wanted to). And I still could. That was the point. Unlike everybody else, for whom 2015 was 20 years ago - long before humanity was destroyed - it was my reality. At least, it was some of the time.But after seeing the future; after struggling to make it to the end of the day; after my first kill - none of those other things were the least bit enjoyable. All I could think when I got back to the real world, is how can I stop what's coming?Prescient is a young adult time-travel dystopia, this is Part One of the first book in the series.",
  "genres": [
    "Time Travel",
    "Young Adult",
    "Dystopia",
    "Science Fiction",
    "Fantasy",
    "Zombies",
    "Amazon"
  ],
  "author": "D.S. Murphy",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/38117893-prophet-of-doom"
}