{
  "title": "The Legacy of Parmenides: Eleatic Monism and Later Presocratic Thought",
  "description": "Parmenides of Elea was the most important and influential philosopher before Plato. He rejected as impossible the scientific inquiry practiced by the earlier Presocratic philosophers and held that generation, destruction, and change are unreal and that only one thing exists. In this book, Patricia Curd argues that Parmenides sought to reform rather than to reject scientific inquiry, and she offers a more coherent account of his influence on later philosophers.The Legacy of Parmenides examines Parmenides' arguments, considering his connection to earlier Greek thought and how his account of what-is could have served as a model for later philosophers. Curd also explores the theories of his successors, including the Pluralists (Anaxagoras and Empedocles), the Atomists (Leucippus and Democritus), the later Eleatics (Zeno and Melissus), and the later Presocratics (Philolaus of Croton and Diogenes of Apollonia). She concludes with a discussion of the importance of Parmenides' work to Plato's Theory of Forms. The Legacy of Parmenides challenges traditional views of early Greek philosophy and provides new insights into the work of Parmenides.\" The Legacy of Parmenides represents a milestone . . . of Parmenides' interpretation. It is full of ideas and tells a coherent story about Parmenides and early Greek thought.\" -- Alexander Nehamas, Princeton University\"Professor Curd offers a genuinely original and possibly correct interpretation of the core thesis of the poem of Parmenides in a field so well worked over that saying something both new and true is profoundly difficult, this is a notable achievement.\" -- Thomas M. Robinson, University of Toronto\"This will be a substantial book in the story of early Greek philosophy, and future writers on the tradition from Thales through Plato will not be able to ignore it without missing an important interpretive alternative. It will be of value to students of Presocratic philosophy or the Greek tradition, as well as to students of the scientific revolution, cosmology, the origins of logic, or comparative mysticism.\" -- Scott W. Austin, Texas A&M UniversityPATRICIA CURD is professor at Purdue University where she works primarily in Ancient Philosophy. She is a co-editor of Readings in Ancient Greek Philosophy , and is the editor of A Presocratics Reader.",
  "genres": [
    "Philosophy"
  ],
  "author": "Patricia Curd",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/381170.The_Legacy_of_Parmenides"
}