{
  "title": "By Being, It Is: The Thesis of Parmenides",
  "description": "The adventure of philosophy began in Greece, where it was gradually developed by the ancient thinkers as a special kind of knowledge by which to explain the totality of things. In fact, the Greek language has always used the word onta , \"beings,\" to refer to things. At the end of the sixth century BCE, Parmenides wrote a poem to affirm his fundamental thesis upon which all philosophical systems should be that there are beings.In By Being, It Is , Nestor-Luis Cordero explores the richness of this Parmenidean thesis, which became the cornerstone of philosophy. Cordero''s textual analysis of the poem''s fragments reveals that Parmenides'' intention was highly didactic. His poem applied, for the first time, an explicative method that deduced consequences from a true by being, it is . To ignore this reality meant to be a victim of opinions. This volume explains how without this conceptual base, all later ontology would have been impossible. This book offers a clear and concise introduction to the Parmenidean doctrine and helps the reader appreciate the imperative value of Parmenides''s claim that \"by being, it is.\"\"This thorough and controversial book will certainly be valued highly by the international community of scholars devoted to the study of ancient philosophy as well as by educated readers worldwide.\" -- Alfonso Gomez-Lobo, Georgetown University\" By Being, It Is offers a meticulous discussion of one of the most puzzling theses in the history of philosophy. It is a highly challenging piece of work from a philosophical viewpoint, an outstanding model of philological work, and a contribution that causes anyone interested in philosophical matters to reflect.\" -- Marcelo D. Boeri, National Council for Scientific and Technological Research, Argentina\"Parmenides' importance consists in the fact that he represents an absolute beginning in history, and particularly in the history of thought. We can understand why, for more than twenty years now, N.L. Cordero has devoted tremendous efforts to understanding the few verses that remain to us of this Poem. The result is the present book, characterized by its completeness and its rigor. It is an essential work on a seminal author.\" -- Luc Brisson, National Council for Scientific Research, FranceNÉSTOR-LUIS CORDERO is Professor of Ancient Philosophy at the University of Rennes, France. He is the author of Les deux chemins de Parménide (1997), and Siendo, Se Es [the Spanish edition of By Being, It Is ] (2005).",
  "genres": [
    "Philosophy"
  ],
  "author": "Nestor-Luis Cordero",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/381173.By_Being_It_Is"
}