{
  "title": "Don't Come",
  "description": "The DomI’m not broken, tortured, or scarred, some cliched, overdone and sensationalized misconception about this lifestyle… and the men in it who control their submissives with a strong hand.I’m just a Dom. Just a man who gets off on a woman who entrusts me with her submission. Just a man who loves to be able to show them all the ways the gift of their trust can bring them untold, never-before-experienced layers of pleasure.But casually.Just play. Just sex.Nothing more.Until I came across her.She’s everything a Dom as experienced as I am shouldn’t want - new to the lifestyle, unsure, untrained. It should never have gone beyond those first few exchanges online. But there was something about her, something that kept me texting, calling, teaching her to trust me enough to meet with me.After one touch, one taste, one night, I knew there was no going back. She was mine. And I was going to show her everything she had been craving from a man all her life.I guess I just had no idea - or at least didn’t want to admit to myself - that this was different, she was different, we were different. And once I got to have her, I wanted to keep her.You know… if I could convince her to stay…AdleyIt was just a drunken decision.I woke up after a night of a little - okay, a lot - of ‘Thirty is just a number’ drinking to find that drunk-me had decided to do something that sober-me would never have had the guts to do, no matter how much I wanted it.I had joined a D/s dating site.And I was totally, absolutely going to delete my account and move on with my life. A life where I had secretly been craving a hand strong enough to take the control I held onto so tightly away from me.Except I had a message.From him.I could never have anticipated the pull I felt toward him, how strong the need within me would be to feel him show me all the things I had been wanting, but denying myself.I didn’t know it could feel like it did, that it could consume me, that it could make me crave not only his touch, but him.It was dangerous territory, slowing falling for a man who made it clear that what was between us was casual. He wouldn’t even tell me his real name. And as things started to get more intense - both physically and emotionally - I had to start to debate whether the pleasure he gave me was worth staying for if it leads to a heartbreak I was sure I wasn’t prepared for…",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Dark Romance",
    "Adult"
  ],
  "author": "Jessica Gadziala",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/38125675-don-t-come"
}