{
  "title": "Anniversaries: From a Year in the Life of Gesine Cresspahl",
  "description": "An NYRB Classics OriginalAs a novel, Uwe Johnson’s masterpiece, Anniversaries, is at once daringly simple in conception and wonderfully complex and engaging in effect. Late in 1967, Johnson, already one of the most celebrated German novelists of his generation, set out to write a book that would take the form of an entry for every day of the year that lay ahead. The first section was dated August 20, and Johnson had of course no idea what the year would bring - that was part of the challenge - but he did have his main character: Gesine Cresspahl, a German emigre living on the Upper West Side of New York City and working as a translator for a bank who is the single mother of a ten-year-old daughter, Marie. The book would tell the story of a year in the life of this little family in relation to the unfolding story of the year, as winnowed from the pages of the New York Times, of which Gesine is a devoted if wary reader. These stories would in turn be overlayed by another: Gesine is 34, born just as Hitler was coming to power, and she has decided to tell Marie the story of her grandparents’ lives and of her own rural childhood in Nazi Germany. It is important that Marie know where and what she comes from. The days of the year are also anniversaries of years past. The world that was and the world of the 1960s - with the struggle for civil rights leading to riots in American cities and, abroad, the escalating destruction of the Vietnam War - are, in the end, one world.Anniversaries was published in four volumes over the more than ten years that it took Johnson to write it, and as the volumes came out it became clear that this was one the great twentieth-century novels. The book courts comparison to Joyce’s Ulysses, the book of a day, and to Proust’s In Search of Lost Time, the book of a lifetime, but it stands apart in its dense polyphonic interplay of voices and stories. Anniversaries is many books: the book of a mother and daughter, of a family and its generations, of the country and the city, and of two times and two countries that seem farther apart perhaps than they are. It is a novel of private life, a political novel, and a new kind of historical novel, reckoning not only with past history but with history in the making. Monumental and intimate, sweeping in vision and full of incident, richly detailed and endlessly absorbing, Anniversaries, now for the first time available in English in a brilliant new translation by Damion Searls, is nothing short of a revelation.",
  "genres": [
    "Fiction",
    "German Literature",
    "Germany",
    "Classics",
    "Novels",
    "Literature",
    "Historical Fiction"
  ],
  "author": "Uwe Johnson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/38118675-anniversaries"
}