{
  "title": "Men and Marriage",
  "description": "\"Timely when originally published, Men and Marriage is essential now given the the warlike climate of male-female relationships, unfortunately fostered by radical feminism.\" Rush LimbaughMen and Marriage is a critical commentary that asks the burning question, How can society survive the pervasive disintegration of the family? A profound crisis faces modern social order as traditional family relationships become almost unrecognizable.George Gilder's Men and Marriage is a revised and expanded edition of his 1973 landmark work, Sexual Suicide . He examines the deterioration of the family, the well-defined sex roles it offered, and how this change has shifted the focus of our society. Poverty, for instance, stems from the destruction of the family when unmarried parents are abandoned by their lovers or older women are divorced because society approves of their husbands' younger girlfriends.Gilder claims that men will only fulfill their paternal obligations when women lead them to do so, and that this civilizing influence, balanced with proper economic support, is the most important part of maintaining a productive, healthy, loving society.He offers a concrete plan for rebuilding the family in America. His solutions challenge readers to return to these roles and reestablish the family values that were once so crucial in staving off the ills that plague our country. Gilder insists that it is time to reexamine what \"liberation\" has wrought and at what cost. Only a return to traditional family values, he contends, can stem the tide of disaster.George Gilder is the author of Wealth and Poverty, the best-selling critique of Reaganomics, The Spirit of Enterprise, Visible Man, Naked Nomads, and The Party That Lost Its Head . He was a speechwriter for Ronald Reagan and now writes regularly for The Wall Street Journal and National Review about material advances and their effect on society. His most recent books include two other well-known social commentaries, Microcosm and Life After Television. Also available in paperback.",
  "genres": [
    "Marriage",
    "Cultural",
    "Nonfiction",
    "Politics",
    "Sociology",
    "Family",
    "Philosophy"
  ],
  "author": "George Gilder",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/1225913.Men_and_Marriage"
}