{
  "title": "The Last Palace: Europe's Turbulent Century in Five Lives and One Legendary House",
  "description": "A masterfully told and immersive narrative about the last hundred years of European history, as seen through an extraordinary mansion – and the lives of the people who called it home When Norman Eisen moved into the US ambassador’s residence in Prague, returning to the land his mother had fled after the Holocaust, he was startled to discover swastikas hidden beneath the furniture. These symbols of Nazi Germany were remnants of the residence’s forgotten history, and evidence that we never live far from the past. From that discovery unspooled the twisting, captivating tale of four of the remarkable people who had called this palace home. Their story is Europe’s, and  The Last Palace  chronicles the upheavals that have transformed the continent over the past century. There was the optimistic Jewish financial baron Otto Petschek, who build the palace after World War I as a statement of his faith in democracy, only to have that faith shattered; Rudolf Toussaint, the cultured, compromised German general who occupied the palace during World War II, ultimately putting his life at risk to save the house and Prague itself from destruction; Laurence Steinhardt, the first postwar US ambassador, whose quixotic struggle to keep the palace out of Communist hands was paired with his pitched efforts to rescue the country from Soviet domination; and Shirley Temple Black, an eyewitness to the crushing of the 1968 Prague Spring by Soviet tanks, who determined to return to Prague and help end totalitarianism – and did just that as US ambassador in 1989.Weaving in the life of Eisen’s own mother to demonstrate how those without power and privilege moved through history,  The Last Palace  tells the dramatic and surprisingly cyclical tale of the endurance of liberal democracy.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "War",
    "Politics",
    "World War II",
    "European History"
  ],
  "author": "Norman Eisen",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/38139979-the-last-palace"
}