{
  "title": "The Melancholy of Race: Psychoanalysis, Assimilation, and Hidden Grief",
  "description": "In this groundbreaking, interdisciplinary study Anne Anlin Cheng argues that we have to understand racial grief not only as the result of racism but also as a foundation for racial identity. The Melancholy of Race proposes that racial identification is itself already a melancholic act--a social category that is imaginatively supported through a dynamic of loss and compensation, by which the racial other is at once rejected and retained. Using psychoanalytic theories on mourning and melancholia as inroads into her subject, Cheng offers a closely observed and carefully reasoned account of the minority experience as expressed in works of art by, and about, Asian-Americans and African-Americans. She argues that the racial minority and dominant American culture both suffer from racial melancholia and that this insight is crucial to a productive reimagining of progressive politics. Her discussion ranges from \"Flower Drum Song\" to \"M. Butterfly,\" Brown v. Board of Education to AnnaDeavere Smith's \"Twilight,\" and Invisible Man to The Woman Warrior , in the process demonstrating that racial melancholia permeates our fantasies of citizenship, assimilation, and social health. Her investigations reveal the common interests that social, legal, and literary histories of race have always shared with psychoanalysis, and situates Asian-American and African-American identities in relation to one another within the larger process of American racialization. A provocative look at a timely subject, this study is essential reading for anyone interested in race studies, critical theory, or psychoanalysis.",
  "genres": [
    "Nonfiction",
    "Race",
    "Psychology",
    "Academic",
    "Psychoanalysis",
    "Asian Literature",
    "Theory"
  ],
  "author": "Anne Anlin Cheng",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/381426.The_Melancholy_of_Race"
}