{
  "title": "Monday To Friday Cookbook",
  "description": "The consummate book for the harried cook. (Chicago Tribune) You know the problem. It's getting late. Papers are piling up, the phone won't stop ringing. You need to keep working and you need to quit working, and the last thing you're thinking about is dinner. There's no time to plan, no time to shop, no time to think. Now here's the solution. Developed by a chef who also has a family to feed, the award-winning MONDAY-TO-FRIDAY COOKBOOK shows you how to create delicious, nutritious, no-fuss meals every night of the week. No matter how busy you are. Over 300 recipes with variations that will make your workday life easier How to organize your kitchen, stock the pantry, and take advantage of proven shortcuts More than 20 one-pot meals, 28 main course salads, a dozen quick and tasty ways to cook chicken breasts, plus weeknight desserts with weekend taste Winner of the James Beard Award \"The consummate book for the harried cook.\" (Chicago Tribune) A SAMPLING: 30 MINUTES OR LESS: Fiery Tubetti with Tuna and Black Olives-Pork Chops Baked in a Pear Sauerkraut-Unbelievable Chocolate-Chesnut Puree WHEN YOU CAN'T EAT TOGETHER: Herbed Lamb Chops-Smoked Mussel, Pea, and Couscous Salad-Garlic- and Mustard-Crumbed Chicken-Pasta Fagioli with Vegetables WHEN COMPANY'S COMING: Woodsy Mushroom and Scallop Soup-Glazed Veal Chops-Fresh Tuna Steaks Over Piquant Kale OMNIUM GATHERUM, OR GUILT-FREE DINNERS: Stuffed Rolled Tortillas-Baked-for-Dinner Potatoes-Red and Yellow Pancakes \"This is a great book! Ms. Urvater's timing is perfect. As busy as you are, you'll ask yourself \"How can I get into the kitchen?\" rather than \"How can I get out?\" (Sheila Lukins, author of All Around the World Cookbook and co-author of The Silver Palette Cookbooks and The New Basics Cookbook",
  "genres": [
    "Cookbooks"
  ],
  "author": "Michele Urvater",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/3816670-monday-to-friday-cookbook"
}