{
  "title": "The Battle of Kursk",
  "description": "Immense in scope, ferocious in nature, and epic in consequence, the Battle of Kursk witnessed (at Prokhorovka) one of the largest tank engagements in world history and led to staggering losses-including nearly 200,000 Soviet and 50,000 German casualties-within the first ten days of fighting. Going well beyond all previous accounts, David Glantz and Jonathan House now offer the definitive work on arguably the greatest battle of World War II. Drawing on both German and Soviet sources, Glantz and House separate myth from fact to show what really happened at Kursk and how it affected the outcome of the war. Their access to newly released Soviet archival material adds unprecedented detail to what is known about this legendary conflict, enabling them to reconstruct events from both perspectives and describe combat down to the tactical level. The Battle of Kursk takes readers behind Soviet lines for the first time to discover what the Red Army knew about the plans for Hitler's offensive (Operation Citadel), relive tank warfare and hand-to-hand combat, and learn how the tide of battle turned. Its vivid portrayals of fighting in all critical sectors place the famous tank battle in its proper context. Prokhorovka here is not a well-organized set piece but a confused series of engagements and hasty attacks, with each side committing its forces piecemeal. Glantz and House's fresh interpretations demolish many of the myths that suggest Hitler might have triumphed if Operation Citadel had been conducted differently. Their account is the first to provide accurate figures of combat strengths and losses, and it includes 32 maps that clarify troop and tank movements. Shrouded in obscurity and speculation for more than half a century, the Battle of Kursk finally gets its due in this dramatic retelling of the confrontation that marked the turning point of the war on the Eastern Front and brought Hitler's blitzkrieg to a crashing halt.",
  "genres": [
    "History",
    "World War II",
    "Military History",
    "Nonfiction",
    "Military Fiction",
    "War",
    "Russia"
  ],
  "author": "David M. Glantz",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1226071.The_Battle_of_Kursk"
}