{
  "title": "Verdict: Assessing the Civil Jury System",
  "description": "\"The right to a jury trial is a fundamental feature of the American justice system. In recent years, however, aspects of the civil jury system have increasingly come under attack. Many question the ability of lay jurors to decide complex scientific and technical questions that often arise in civil suits. Others debate the high and rising costs of litigation, the staggering delay in resolving disputes, and the quality of justice. Federal and state courts, crowded with growing numbers of criminal cases, complain about handling difficult civil matters. As a result, the jury trial is effectively being challenged as a means for resolving disputes in America. Juries have been reduced in size, their selection procedures altered, and the unanimity requirement suspended. For many this development is viewed as necessary. For others, it arouses deep concern. In this book, a distinguished group of scholars, attorneys, and judges examine the civil jury system and discuss whether certain features should be modified or reformed. The book features papers presented at a conference cosponsored by the Brookings Institution and the Litigation Section of the American Bar Association, together with an introductory chapter by Robert E. Litan. While the authors present competing views of the objectives of the civil jury system, all agree that the jury still has and will continue to have an important role in the American system of civil justice. The book begins with a brief history of the jury system and explains how juries have become increasingly responsible for decisions of great difficulty. Contributors then provide an overview of the system's objectives and discuss whether, and to what extent, actual practice meets those objectives. They summarize how juries function and what attitudes lawyers, judges, litigants, former jurors, and the public at large hold about the current system. The second half of the book is devoted to a wide range of recommendations that will both improve citizens' access to jury determinations and help resolve disputes in a more effective and efficient manner. Among their many suggestions, the authors call for changes in trial procedures and techniques that would improve the ability of jurors to understand the lay and evidence, a reduction in administrative costs and delays, and a change in they way juries are chosen. The authors also recommend shorter hours and more pay for jurors, greater flexibility in court schedules, and elimination of alternate jurors. In the final chapter the civil jury is considered in the broader context of how society resolves or manages civil disputes.\"",
  "genres": [],
  "author": "Robert E. Litan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3815085-verdict"
}