{
  "title": "Descended by Blood",
  "description": "Brooke Keller's a high school junior who never spent much time living in one place. She's finally in a town long enough to almost snag the boy of her dreams, until her life is threatened by a fanged man in his attempt to kidnap her. Brooke begins a dangerous journey to find out who is after her and how to stop them. Thrown into a world with powerful and prejudiced vampires, Brooke must tap into the side of herself that she never knew existed, at the risk of losing her life in order to save it.A twig snapped, and I jerked my head to the right. I caught the glint from the eyes of a mountain lion creeping toward us, his ears pulled back, teeth bared. I froze, hoping we weren't the prey he stalked.Kaitlynn shrieked. She grabbed my arm and tried pulling me with her as she ran back to the cars.The lion rose from his crouch and started charging down the mountain straight for us.We didn't have enough time for both of us to make it out of there alive, and the lion sped up at the site of Kaitlynn running away.I planted my feet. Something clicked inside of me; heat coursed through my veins. My vision intensified, and I could distinguish the areas of down between the lion's coarse fur as his muscles flexed and stretched. I'd heard before that you shouldn't look a wild animal directly in its eyes, but my instinct screamed for me to not turn my back on my attacker. I listened to my gut and looked the mountain lion square into his charging eyes.The lion and I connected on an intellectual predator versus predator. Only I knew, and I deemed the lion knew, as well, that I outranked him as the more fearsome predator. How I recognized this, or how I knew the lion realized this, I couldn't fathom. I had never been hunting before, so this instinct didn't come from a belief that man ruled supreme on the food chain. And this moment felt different somehow. It wasn't man versus beast; it was beast versus beast.",
  "genres": [
    "Vampires",
    "Young Adult",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Supernatural"
  ],
  "author": "Angeline Kace",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/12260236-descended-by-blood"
}