{
  "title": "Susie: The Life and Legacy of Susannah Spurgeon, wife of Charles H. Spurgeon",
  "description": "The definitive biography of Susannah Spurgeon. While many Christians recognize the name of Charles H. Spurgeon, the beloved preacher and writer, few are familiar with the life and legacy of his wife, Susie.  Yet Susannah Spurgeon was an accomplished and devout woman of God who had a tremendous ministry in her own right, as well as in support of her husband. Even while dealing with serious health issues, she administered a book fund for poor pastors, edited and published her husband’s sermons and other writings, led a pastor’s aid ministry, wrote five books, made her home a hub of hospitality, and was instrumental in planting a church. And as her own writing attests, she was also a warm, charming, and fascinating woman. Now, for the first time, Susie brings this vibrant woman’s story to modern readers. Ray Rhodes Jr. examines Susannah’s life, showing that she was not only the wife of London’s most famous preacher, but also a woman who gave all she had in grateful service to the Lord. Susie is an inspiring and encouraging account of a truly remarkable woman of faith that will delight Spurgeon devotees and fans of Christian biographies alike. “I am writing in my husband’s study, where he thought, and prayed, and wrote. Every inch of the place is sacred ground. Everything remains precisely as he left it. His books (now my most precious possessions), stand in shining rows upon the shelves, in exactly the order in which he placed them, and one might almost fancy the room was ready and waiting for its master. But oh! That empty chair! That great portrait over the door! The strange, solemn silence, which pervades the place now that he is no longer on earth! I kneel sometimes by his chair, and laying my head on the cushioned arms, which so long supported his dear form, I pour out my grief before the Lord, and tell Him again that though I am left alone, yet I know that ‘He hath done all things well’…”",
  "genres": [
    "Biography",
    "Christian",
    "Nonfiction",
    "History",
    "Audiobook",
    "Christian Non Fiction",
    "Faith"
  ],
  "author": "Ray Rhodes Jr.",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/38141074-susie"
}