{
  "title": "Courtroom 302: A Year Behind the Scenes in an American Criminal Courthouse",
  "description": "Steve Bogira’s riveting book takes us into the heart of America’s criminal justice system. Courtroom 302 is the story of one year in one courtroom in Chicago’s Cook County Criminal Courthouse, the busiest felony courthouse in the country.We see the system through the eyes of the men and women who experience it, not only in the courtroom but in the lockup, the jury room, the judge’s chambers, the spectators’ gallery. When the judge and his staff go to the scene of the crime during a burglary trial, we go with them on the sheriff’s bus. We witness from behind the scenes the highest-profile case of the three young white men, one of them the son of a reputed mobster, charged with the racially motivated beating of a thirteen-year-old black boy. And we follow the cases that are the daily grind of the court, like that of the middle-aged man whose crack addiction brings him repeatedly back before the judge.Bogira shows us how the war on drugs is choking the system, and how in most instances justice is dispensed–as, under the circumstances, it must be–rapidly and mindlessly. The stories that unfold in the courtroom are often tragic, but they no longer seem so to the people who work there. Says a deputy in 302: “You hear this stuff every day, and you’re like, ‘Let’s go, let’s go, let’s get this over with and move on to the next thing.’”Steve Bogira is, as Robert Caro says, “a masterful reporter.” His special gift is his understanding of people–and his ability to make us see and understand them. Fast-paced, gripping, and bursting with character and incident, Courtroom 302 is a unique illumination of our criminal court system that raises fundamental issues of race, civil rights, and justice.",
  "genres": [
    "Nonfiction",
    "Law",
    "True Crime",
    "Crime",
    "Politics",
    "Sociology",
    "Social Justice"
  ],
  "author": "Steve Bogira",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/381346.Courtroom_302"
}