{
  "title": "Mr. Flood's Last Resort",
  "description": "FROM THE PUBLISHER OF A MAN CALLED OVE The award-winning author of Himself presents the spellbinding tale of a lonely caregiver and a cranky hoarder with a house full of secrets. Packed with charming eccentricities, greedy heirs, unresolved disappearances, and a whole lot of heart, Mr. Flood's Last Resort is a gripping mystery that examines the space between sin and sainthood, reminding us that the most important forgiveness we can offer is to ourselves.Maud Drennan is a dedicated caretaker, but her sunny, capable disposition and snappy quips mask a deep sadness. A tragic childhood event left her in the company of a cast of patron saints who pop in and out of her life like unwelcome tourists. She tries to find solace in her hard work in London...but then she meets the inimitable Mr. Flood. A menace by all accounts, Cathal Flood is a widower living alone in a Gothic Dorset mansion crawling with collector’s items and feral cats. Stubborn as anything and an extreme hoarder, he has been battling his son’s attempts to move him into an old age home, and rumor has it he sent his last caretaker to the madhouse. But Maud is this insolent old man’s last chance: if she can help him get the house in order, he might be able to fend off the deportation. So the unlikely pair begin to cooperate, connecting over their shared love of folk tales and their suspicion of Gabriel, Cathal’s overbearing son. Still, shadows are growing in the cluttered corners of the mansion, hinting at buried family secrets, and reminding Maud that she doesn’t really know this man at all. When she starts poking around, the forgotten case of a missing local schoolgirl comes to light, and a full-steam search for answers begins. Full of charming eccentricities, twisted comedy, a whole lot of heart, and Jess Kidd’s “lyrical, lush, and hugely imaginative” (Sunday Express Magazine) prose, Mr. Flood's Last Resort is a mesmerizing tale that will make you re-examine the space between sin and sainthood, reminding you that when all is said and done, the most important forgiveness that we can offer is to ourselves.",
  "genres": [
    "Fiction",
    "Mystery",
    "Magical Realism",
    "Fantasy",
    "Audiobook",
    "Contemporary",
    "Ireland"
  ],
  "author": "Jess Kidd",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/38128947-mr-flood-s-last-resort"
}