{
  "title": "Pain Killer: A Wonder Drug's Trail of Addiction and Death",
  "description": "Pain Killer OxyContin, a potent painkiller containing opium-derived oxycodone as its key active ingredient, was first sold in 1996 as a treatment for cancer patients and other chronic pain sufferers. From the start, the drug's manufacturer aggressively marketed its patented time-release formula as a breakthrough in the effort to reduce prescription drug abuse. It wasn't long, however, before thrill-seeking teenagers shattered that illusion of safety; by simply crushing an \"Oxy,\" they were able to tap into a high so seductive it would come to dominate their lives. Some patients, seeking relief from pain, also found themselves drawn to the drug's dark side. Pain Killer takes readers on a journey of discovery that begins with the true story of Lindsay, a high-school cheerleader in Virginia who gets hooked on Oxys, and expands outward to explore the critical issues of legitimate pain management, prescription drug abuse, and how the misuse of science by the drug industry threatens the public good. With the fast-rising abuse of prescription drugs by young people ringing alarm bells within government, the how and why behind the OxyContin disaster is a gripping read not only for parents, but also for medical professionals, community leaders, business executives, and all those concerned with this crisis. The dangers described in Pain Killer also reverberate far beyond the threat from a single drug at a particular moment in time. The focus of our government's war on drugs has clearly misled many of us into thinking that only illegal drugs smuggled from beyond our borders can be abused. As Meier tells the dramatic story, some of the most deadly substances are produced and sold legally right here at home. THE EXTRAORDINARY AND TRUE STORY OF OXYCONTIN EQUAL PARTS crime thriller, medical detective story, and business exposé, Pain Killer takes a hard-hitting look at how a powerful drug touted as the salvation for millions triggered a national tragedy. At its inception, the legal narcotic OxyContin was seen as a pharmaceutical dream, a \"wonder\" drug that would herald a sea change in medical care while reaping vast profits for its maker. It did do that; but it also unleashed a public health crisis that cut a swath of despair and crime through unsuspecting small towns, suburbs, and cities across the country. As reports of OxyContin overdoses made front-page and network news, doctors, narcotics agents, regulators, industry executives, and lawmakers raced in, scrambling to slow the damage. Behind it all stood one of America's wealthiest families, and a drug company whose relentless promotion helped fuel the problem Written by award-winning journalist Barry Meier, whose special report in the New York Times triggered national interest in OxyContin, Pain Killer chronicles the rise of the multibillion dollar pain management industry and lays bare its excesses and abuses.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Health",
    "Medicine",
    "Politics",
    "Medical"
  ],
  "author": "Barry Meier",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/1226104.Pain_Killer"
}