{
  "title": "BRAT and the Kids of Warriors",
  "description": "Brat and the Kids of Warriors is the first in a series of novels about the military brats. Jack McMasters and his sisters, perfect Queenie and out-of-control Rabbit, are military brats creating adventures wherever they go. But their dad s new assignment to Cooke Barracks, in West Germany, means leaving behind every friend they have. Again. But the seven-day voyage to Germany ( Explore everywhere marked Off Limits on their U.S. Navy troop-transport ship) is better than any holiday cruise. Their dad s new assignment as a tank commander with 4th Armored Division comes soon after Germany lost World War II and the Russians split Germany in two with the Iron Curtain. As they travel to the base, they see unimaginable beauty, but also the rubble left from bombs. As the story progresses the kids gradually discover Germany is still very much a war zone, this time of the new Cold War. Jack soaks up war stories he overhears about WWII. Longing to make his father proud and become a son worthy of a warrior, he struggles to adapt to this totally different world. A world that is sometimes violent, at school, at home and beyond. Jack gathers a small band of friends, and together they create their own adventures, on and off the Army base. Teaming up with two German kids, Jack s gang sets out on a quest to prove they are as tough as any Russian kid. It takes successfully applying the lessons they learned from the war stories they were raised on. But things turn serious when they accidentally uncover a spy, one they can t prove exists. The discovery helps them realize why their dads are really in holding back, not the Nazis, but the Russian and East German communists, both of whom seem invincible. Their tanker dads are poised to fight more than 3,000 communist tanks lined up on the Iron Curtain, a threat to West Germany s freedom and all their lives.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Michael Joseph Lyons",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/38188871-brat-and-the-kids-of-warriors"
}