{
  "title": "Checkmate",
  "description": "Levi Objectively, Zade was a great catch. He was funny, good-hearted, gentle, affectionate, and very, very attractive – everything that Lee said he was. But he was still an Alpha. So, in other words, he was absolutely not for me. \"It's just that I don't want to be claimed. I don't want to belong to an Alpha.\" Zade frowned at me. \"But you're an Omega.\" I nodded, entirely too used to having this conversation. Omegas only wanted one thing out of life; a claim. Except, like with most generalizations, it wasn't necessarily true. \"I am,\" I agreed, \"but I don't want to be claimed by an Alpha.\" \"Why not?\" Oh. Well, that was a new twist in the old plotline. I was used to everyone I told steamrolling over my wishes, telling me I was confused, laughing it off as a tease or fear that I wouldn't measure up. Even the Coruscation Omega - sweet, supportive Trevor - had stared at me like I was a crossword puzzle clue in an unknown language before quietly assuring me that I would never be forced into a claim. I couldn't remember anyone ever asking why.  Zade From the time I first set eyes on Levi riding up to my house on the back of a Blood Valley Beta’s motorcycle, I’d known he was meant to be mine. So, when I agreed not to continue pursuing a claim on Levi, I saw it as a temporary agreement that would allow him to get to know me. After all, I might be a little impulsive in non-life-threatening situations, but I’m a good guy. And a good catch. Or so I’ve been told. When Levi had rebuffed my suggestion that we could play chess together, I’d managed to hold my wince in. In all fairness, he couldn’t have known that I played, and I was stuffing candy in my mouth with one hand and tossing my lucky fetch ball in my other – I couldn’t exactly dispute that I looked nothing like a grandmaster should. Unable to use the one thing that I now knew we had in common without looking like a pouty twat, I set my mind to the next challenge.  Game on. Pawn to a4.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Omegaverse",
    "LGBT",
    "Paranormal Romance"
  ],
  "author": "Kian Rhodes",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/38199812-checkmate"
}