{
  "title": "The Jewels of Kinfairlie Boxed Set",
  "description": "Alternate cover for ASIN B00PHSJNMGFour magical medieval romances from the “Queen of Medieval Romance”, Claire Delacroix. Meet the siblings in the mischievous and loving family at Kinfairlie and follow their adventures in pursuit of true love.In \nThe Beauty Bride\n, Madeline is appalled by her older brother’s determination to see her wed against her will. When he auctions her hand to an outlawed mercenary, she flees them both, certain that her fate cannot be worse. But Rhys FitzHenry is not a man to abandon what he holds dear, and Madeline’s proud beauty has captured his heart. Can a rough knight enchant her with stories and convince her to be his wife in truth, or will his enemies have their vengeance first?In \nThe Rose Red Bride\n, Vivienne is convinced that only destiny could bring such a wondrous secret lover to her chamber, but with morning’s light, her lover abducts her. Erik knows that justice can only be gained from the Lammergeier with force, especially as the fate of his young daughters hangs in the balance. Can Vivienne help this wounded highlander to regain his legacy, and win his heart for her own?In \nThe Snow White Bride\n, Eleanor seeks sanctuary at Kinfairlie on Christmas Eve. The Laird of Kinfairlie’s sisters decide that the beautiful widow will be the perfect match for their brother. Alexander’s heart is quickly lost, but as Eleanor’s secrets are revealed, he fears he has trusted too much too soon. Will Eleanor’s past jeopardize the future of this knight who has claimed her heart, or can she save him from the peril that follows her?This digital boxed set includes all three medieval romances in the Jewels of Kinfairlie trilogy – The Beauty Bride, The Rose Red Bride, The Snow White Bride – as well as the linked short story, The Ballad of Rosamunde.This edition also includes an excerpt from The Renegade's Heart.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical Fiction"
  ],
  "author": "Claire Delacroix",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/38190342-the-jewels-of-kinfairlie-boxed-set"
}