{
  "title": "Bound by Destiny",
  "description": "Love knows no names—no bounds—sometimes you’re bound by destiny…Micah’s choices and actions when he was young left him estranged from his family—the Ravage MC family. Older and wiser, it’s now one of his biggest regrets … along with pushing Emery away. Emery has been walking a tight rope for far too long. Everything has changed. Dealing with her near death experience, her brother’s return, and her parents problems have left her feeling very lost in a world she thought she knew. Except—sometimes when we are so lost we manage to find exactly where we should be.Jacks didn’t mean for it to happen, but Emery slammed into him like a freight train pushing all the buttons he’d kept locked down for far too long. Jacks though, can’t get caught up in a game of who is the better man. Been there, done that, and lost in a big way. When everything changes, destiny is all we can hold onto. Emery finds herself caught between two very different men unable to keep her heart out of the mix. Sometimes we bleed for others—and sometimes the past, it just won’t let go.Other times—some people walk away not allowing us to have a choice in the matter ...Those are the times that hurt the most and cut the deepest.--------------** Bound by Destiny (Ravage MC Bound Series #5) is a full-length standalone novel. If you'd like to see where it all began you should start with Ravage Me and work your way up. **The Ravage MC Bound series is the second generation of the Ravage MC. It is a suspenseful motorcycle club romance that will have you quickly turning the pages to find out what's next. Two men fighting for one woman. If you like an alpha, bad boy biker who will grab your heart—a troubled man trying to get his life back together, and an independent woman ready to take her life back, you've found the perfect MC book.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Adult",
    "Crime",
    "Erotica",
    "Suspense"
  ],
  "author": "Ryan Michele",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/38192500-bound-by-destiny"
}