{
  "title": "Dr Olga's American Dream: Biography of a Transylvanian Expat",
  "description": "This is the Biography of Dr Olga Magdalena Lazin. Her Doctoral Dissertation titled Decentralized Globalization paints globalization as more than managed trade blocs and economics. Collapse of dictatorships in Romania, Hungary and Mexico left civil society leaders like Dr Olga to take life into her own hands and start her own publishing business in sunny Los Angeles, California.Dr. Olga Magdalena Lazin discusses various aspects, effects of ‘Decentralized Globalization’LOS ANGELES – After the fall of the Berlin Wall in Europe, Dr. Olga Magdalena Lazin was enchanted by the complexities of the globalization process and wanted to overcome ridiculous myth and propaganda that distract people from understanding the multifaceted aspects of globalism and regionalism. She writes “Decentralized Globalization” (published by AuthorHouse), a far cry from other globalization literature in that it concentrates on the significant role that civil society and civil government play in globalization.“Decentralized Globalization” provides a fresh, multi-dimensional viewpoint on globalization. In this it is unlike other globalization literature, which tends to be written either in favor or against globalization, or highlight cross-border issues such as economic dislocation, the spread of pandemic disease, cultural assimilation, rapid decrease in transportation times, immigration, or the growth of drug-trafficking and crime cartels.Lazin acknowledges that readers have become more knowledgeable and can now shake off the narrow views on globalization by better studying the statistical data enclosed and the facts. Her book then aids them in further understanding by explaining the anti-globalization movement. It is based on the premise that globalization is more than trade and economics.“Decentralized Globalization” cites analysis and data proving the effectiveness of all Free Trade Agreements, especially within NAFTA. It has done a world of good. California is perfectly intertwined with the Mexican economy; the balance struck being a perfect model for the rest of the World. The race for Free Trade agreements and elimination of tariff has started long time ago with the creation of the EU, and it works.Civic society keeps the government honest and clamours to take into account the non-governmental interst groups. E.g. to reform Constitutions. Too many countrie will need to change from their judicial systems, from “guilty until proven innocent to \" innocent until proven guilty\".Dr Olga is a UCLA graduate in history. She is a published author and history lecturer at UCLA. You can access and download her books at She has been teaching history at University of California Los Angeles, California State University–Dominguez Hills, and Cal State University–Long Beach, as well as University of Guadalajara (UDG) and University of Quintana Roo in Cancún, Mexico for over 28 years. Her specialty is history of food, globalization of technology, the American Constitution and history of the Internet. As a hobby, she is practicing permaculture, and speaks eight languages. Her radio show is accessible 24 hours a day at Since the Cold War has been reset by Putin in 2011, the whole world has been restructuring itself in different spheres of influences, but the struggles are basically the objective number one is counterbalancing the power of the overly-intrusive governments and dictatorships, lead by civic attitudes and civil society agents striving to keep the world in balance. Dr Lazin has lived through a horrible dictatorship in Romania, during the Ceausescu's, and is now reflecting upon new experiences with working with civil society actors and agents in California, Los Angeles, which she uses as a platform for justice and spiritual healing with stupendous organic oil blends.",
  "genres": [],
  "author": "Olga Magdalena Lazin",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/38196919-dr-olga-s-american-dream"
}