{
  "title": "Broken Chord",
  "description": "THIS IS NOT A STANDALONE BOOK. BROKEN CHORD IS THE THIRD AND FINAL INSTALLMENT IN THE TWELVE MONTHS SERIES. Nearly twelve months has passed since Sylvie Embers’ heart went MIA. She knows exactly where it is, but she can’t go back there, not to him. But fate is a twisted bitch and has other plans... She finds herself right back in the center of Jamison Rivera’s life when her best friend - Lucy Dalton, announces she’s marrying his best friend and bandmate - Ben Travers. Honoring her closest friends wishes, she blindly steps into her own personal version of hell on earth to confront the devil himself. Everything’s changed. Old feelings certainly haven’t. He wont give her up. She needs him to. What happens when what they had, won’t let go? “In what lifetime did you think I could have come back to you? I was destitute in every sense of the word after you. I’ve made my life work now because I’ve had to. But as far as dating and love go, I’m not interested... because of us. Because I had no faith in you not to do the same thing to me again and again and again. There would have always been another Samara waiting to fuck it up for us, and you would never have been strong enough to weather the storm with me. The most miserable part of all this, is the fact that after everything, I still love you… I always will. I just can’t be in love with you. I can’t even contemplate giving someone else what I gave you. You own my fucking everything, Jamison, but you annihilated it, too.” I was terrified keeping her would completely deplete that wonderful woman. So, I pushed her away... and every fiber of my being had mourned for her ever since. I can’t fucking see beyond her. Here with me, that’s where she’s meant to be. In my house, my bed. Every. Damn. Night. Any other man having that with her is just not going to happen. No matter who I’ve got to piss off in the process, she’s going to be Mrs. Rivera one day, whether she likes it or not. This is the third installment of the Twelve Months series. This is not a standalone. It is recommended that you read Twelve Months (book 1) and Reprieve (book 2) before Broken Chord. Due to graphic language, drug use, and scenes of a sexual nature, this book is recommended for an 18+ audience.",
  "genres": [
    "Romance",
    "Music"
  ],
  "author": "R. Gadd",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/38198754-broken-chord"
}