{
  "title": "Platinum Magic",
  "description": "Elves, orcs, dwarves and other fantasy races are depicted in a modern society whose physics are based on magic spells. This world acts as the backdrop for this engaging and action packed series of Bruce Davis mysteries and procedurals, starting with book Platinum Magic . When King’s Agents Simon Buckley and Haldron Stonebender raid a suburban farmhouse, they expect to find an illegal bomb factory full of Orc terrorists. Instead, they end up killing the sister of the current Elf ruler, turning a straightforward police raid into an international incident. Now, Simon and his team must battle terrorists, gangsters, and their own superiors to find the truth behind the High-Elf’s involvement and avert a war. Accolades- \"What a page turner. Everything started off with a bang, pun intended, and the race to the finish never slowed down. Every chapter I read made me want to get into the next.\"- Adal McCloud \"Davis has done an excellent job with this world he's created. He's turned our world into a magic world – or perhaps a magic world into our world.\"- Theoden Humphry About Bruce Davis- \"I have always been a storyteller, even before I began writing seriously. I have written stories all my life, but didn’t begin to think in terms of writing for an audience until after I finished my medical training. As many people know, I am a General and Trauma surgeon and that gives me the privilege of observing people under extraordinary circumstances. Much of what I write tries to deal with some of those circumstances and how people respond to them. If there is an overall theme to my writing it’s the big question of what makes us human.\" Excerpt \"The thing by the hearth cocked its head at Simon’s command. It was squat and broad, like a full-sized man whose legs had been shoved up into his torso. Its long muscular arms reached almost to the floor. Its head was human in outline but flattened on top, as if the skull had been sheared off at the brow line. It was hairless, naked and sexless, the space between its short legs smooth and featureless. Simon cursed and fired two bolts as it growled and bared long, fang-like teeth. He dropped the bolt thrower and it swung down beside his left hip on its harness. He drew the Bonecleaver and shouted over his shoulder toward Hal, “Golem!” The creature rushed him, the two cold iron bolts from the pneumatic protruding from its chest. The bolts didn’t even slow it down. Simon swung his sword at the thing and the double-edged blade sliced deep into its left shoulder. It roared and spun to its right, nearly wrenching the sword out of his hand. He backpedaled away from the golem, bringing the Bonecleaver up to a high overhead ready position.\"",
  "genres": [
    "Fantasy"
  ],
  "author": "Bruce Davis",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/38213705-platinum-magic"
}