{
  "title": "Tales from the Kurtherian Universe",
  "description": "A multitude of Kurtherian Gambit Fans. Eight stories. One amazing book.\nThe Kurtherian fans have come together to create a book by the fans - for the fans. Step inside and take a peek at stories inspired by the wonderful world of the KGU. \nThe Kurtherian Universe Expands, by Micky Cocker\n\nA poem to kick introduce our collection of stories\nHoli’s Savior, by N.D. Roberts\nOn the alien world Castellegia, brave young Holi fights for the survival of her ragged band of orphans. Who will save them from the green-eyed mutants who stalk the night? Justice calls upon Castellegia at the moment all is lost for Holi.A story of strength, determination, and the softer side of everybody's favorite benevolent dictator.  \nLast Adventure First, by S.E. Weir \nPhina just wants to be a spy and use her self-taught hacker skills to help the Etheric Empire. She embarks on one last adventure to try and make her best friend's wish come true. All it takes is a little B&E and some access pass forgery- no big deal for Phina's skills. \nBut with a mystery man talking in her head and tracking her every move, and a confrontation with leaders of the Etheric Empire, Phina might get more than she bargained for.\n\nRenegade,by Erika Everest\nI am one of the Drakis, the enhanced warriors of our race. Our Gods have sent us to fight ignorance and injustice in the universe, and to bring peace and enlightenment instead.On the planet I am assigned to, I meet a native who is not grateful for our help. In fact, she despises us for our interference. Her attitude challenges my entire worldview. Is my cause truly as noble as I have always believed? Or is it something more sinister?\nAnd what are the God’s real intentions for the Drakis?\n\nSarah Jennifer’s First Samhain, By N.D. Roberts\nHow do you survive an eternity alone?Sarah Jennifer Walton had it all. A family, a purpose, a husband. Not anymore. Loss has shaped her into a true nomad, wandering the country in a bid to outrun her pain. A chance encounter and a little magic could be the answer to Sarah Jennifer's prayers.Set on the foundation of The Terry Henry Walton Chronicles this reconciles the past with the future, and a hidden destiny.\nThe Terrorist Within, by James Gartside\nThe Meredith Reynolds is a beacon of hope to many in the federation, but to one young girl it is a symbol of everything she wants to destroy.\nDark Savior, by Ian Nicholson\n\nWhat will you do for the one you love?\nHow will you face your worst nightmares?Something sinister is lurking in the dark of New York City, preying on those abandoned by society. Young runaway Adam tries to rescue his best friend, but he ends up caught as well. They have little time and no hope left. Because when monsters are real who can step up to fight them and set things right?\nTill The End Comes, by James Gartside\nThe Kurtherians created them to fulfill a need.",
  "genres": [
    "Science Fiction"
  ],
  "author": "S.E. Weir",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/38213330-tales-from-the-kurtherian-universe"
}