{
  "title": "The Ultimate Hail Damage Guide For Homeowners: Learn The Storm Damage Industry Secrets and Avoid Getting Ripped Off.",
  "description": "I'm John Francis- the owner of Northern Virginia Roofing and Exteriors - a family owned and operated home improvement company serving the Washington DC area since 1963.Over the years, we have seen it all and I’ve gotten tired of seeing homeowners being taken advantage of by unscrupulous contractors and well-intentioned contractors that inadvertently mislead the homeowner due to their lack of experience. Unfortunately unethical practices (self-serving contract agreements, high pressure sales techniques, and unlicensed contractors) as well as fraud and insurance storm restoration scams are still very common.By writing this book, I wanted to arm the homeowner with the knowledge and background information on how the storm restoration industry operates, how to avoid some of the common scams and frauds and how to hire a Qualified Local Contractor (I call them QLCs).Who Is a QLC?QLC stands for Qualified Local Contractor; an established, local contractor who strives to maintain excellent customer relationships by working with their clients to resolve problems, perform quality work, always pay their subcontractors and vendors, and conduct themselves professionally with the goal of building a successful business. If you hire a QLC, you are in good hands and won’t have to worry about most of the things in this book. If you end up with a Non-QLC or an out-of-town Storm Chaser(read more about these contractors in Chapter 4), the best practices and advice in this book are meant to help you reduce your chances of getting ripped off, while keeping the contractor accountable.This book deals specifically with the hail storm industry and will act as a guide to navigate you through the restoration process. From recognizing the signs of hail damage and determining whether to file an insurance claim or not, to getting the full amount you are entitled to from the insurance company, this book covers everything you need to know. You’ll learn how to choose a good contractor you can trust, how to screen the contractor, negotiate a contract, and avoid getting ripped off. Why You Need This Book Whether you’ve had wind or hail damage or not, you will find this information useful, because there is a high likelihood that your home will experience wind or hail damage in the future. Although the dealings of out-of-town Storm Chasers and other unethical contractors have been heavily publicized- thousands of homeowners fall victim to roofing scams (and frauds) every year. This book will help you prepare for such an event before it happens and will guide you after.",
  "genres": [],
  "author": "John Francis",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/38201762-the-ultimate-hail-damage-guide-for-homeowners"
}