{
  "title": "Nomadland: Surviving America in the Twenty-First Century",
  "description": "An alternate cover edition of ISBN 9780393356311 can be found here.The inspiration for Chloé Zhao's celebrated film starring Frances McDormand, winner of the Academy Awards for Best Picture, Best Director, and Best ActressMarch and April pick for the PBS Newshour-New York Times \"Now Read This\" Book ClubNew York Times bestseller\"People who thought the 2008 financial collapse was over a long time ago need to meet the people Jessica Bruder got to know in this scorching, beautifully written, vivid, disturbing (and occasionally wryly funny) book.\" —Rebecca Solnit From the beet fields of North Dakota to the National Forest campgrounds of California to Amazon’s CamperForce program in Texas, employers have discovered a new, low-cost labor pool, made up largely of transient older Americans. Finding that social security comes up short, often underwater on mortgages, these invisible casualties of the Great Recession have taken to the road by the tens of thousands in late-model RVs, travel trailers, and vans, forming a growing community of nomads.On frequently traveled routes between seasonal jobs, Jessica Bruder meets people from all walks of life: a former professor, a McDonald’s vice president, a minister, a college administrator, and a motorcycle cop, among many others—including her irrepressible protagonist, a onetime cocktail waitress, Home Depot clerk, and general contractor named Linda May.In a secondhand vehicle she christens “Van Halen,” Bruder hits the road to get to know her subjects more intimately. Accompanying Linda May and others from campground toilet cleaning to warehouse product scanning to desert reunions, then moving on to the dangerous work of beet harvesting, Bruder tells a compelling, eye-opening tale of the dark underbelly of the American economy—one that foreshadows the precarious future that may await many more of us. At the same time, she celebrates the exceptional resilience and creativity of these quintessential Americans who have given up ordinary rootedness to survive. Like Linda May, who dreams of finding land on which to build her own sustainable “Earthship” home, they have not given up hope.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Audiobook",
    "Sociology",
    "Book Club",
    "Economics",
    "Memoir"
  ],
  "author": "Jessica Bruder",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/38212124-nomadland"
}