{
  "title": "The Empress Capsule",
  "description": "PRODIGY. DESERTER. COMMANDER.  At 22, Commander Ellen Ryu is a little young to be \"retired.\" Yet she’s planned—and bled in—more battles than veterans twice her age. And, well, she didn’t exactly retire so much as desert. Betrayed by her superiors, turned into a science experiment, and nearly driven insane, Ellen seized the chance for freedom when a shadowy organization offered her a ship of her own and an elite, all-female crew. She's got a new mission now: get revenge on the scientist who almost destroyed her. Nobody is going to get in her way this time. Especially not the merc who's just shown up at her cargo hatch, looking to hitch a ride.  MERCENARY. CONVICT. RENEGADE.  In the middle of an op gone wrong, cyborg mercenary Kael Sidassian gets stuck with a mission he can't refuse: carry a capsule to safety, the contents of which would bring the galaxy down on his head if anyone knew what was inside. But he’s also got damaged hardware inside his head and a plan to escape from the merc company that forcibly conscripted him over ten years ago. So when a humanitarian ship grants him passage, he thanks his lucky stars for a job that'll solve all his problems at once. That is, if the attachment he’s forming to the ship’s commander—one that goes way beyond duty and loyalty—doesn’t get in the way.  As a new threat rises, the prodigy and the screw-up discover far more in common than they ever thought possible. Now both their missions will have to wait, because if they aren't audacious enough to work together, they'll never survive what's coming for them. For lovers of romantic space opera, Lois McMaster Bujold, and David Weber, THE EMPRESS CAPSULE is the first volume in the Audacity series.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Romance",
    "Science Fiction Romance",
    "Audiobook"
  ],
  "author": "R.K. Thorne",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/38214057-the-empress-capsule"
}