{
  "title": "Joyride:",
  "description": "The Short Blurb, for those who have read Detour (which is optional but recommended)   In book one of the Beautiful Biker series, Ella’s best friend Jenna was interested in Deacon’s brother, Rider, and after spending the night with him, told Ella she’d spent the night with the father of her future children.  But then she got that video text with that very damning evidence that Rider was someone she should stay FAR away from.  In Detour, we heard that Rider had chained the very angry Jenna to his bed in order to keep her from putting herself in the Wyld Jackals MC line of fire. How did all that go? Read Joyride and find out!   The Longer Blurb:  Rider Valentine’s family, all members of the Dominion Brotherhood MC, opened up a new charter and three businesses in a new town. The Wyld Jackals MC do not want them there and are determined to make that point in a variety of violent ways, including using Dominion Brotherhood women to do so.  Rider has never tied himself to just one woman. But, when a certain gorgeous girl he's spent some time with is suddenly in danger of being the Jackals’ next target, things change.  Jenna Murdoch has always tried to be a good-time girl, but guarding her heart because heartache is not a good time. Something about Rider makes her see potential and what could be. Can she trust letting her guard down with a good-time guy who seems to be playing games with her heart?  There are sexual assault accusations and Rider has an explanation, but there’s some pretty damning evidence against him, so Jenna decides she’s not interested in playing his games.  Despite Jenna trying to retreat, Rider is determined to keep her safe from the Jackals by any means necessary, even if it includes handcuffing her to his bed.  How hard will Jenna make him work to win her over? Can Jenna overcome the things she knows, the things she saw, the fears she has from being burnt in the past? Can she let him crack her protective shield? And will Rider simply lose interest once the threat is neutralized?  The Beautiful Biker series books are standalone but connected and overlapping stories. Each book focuses on a different couple and could be read as standalone, but reading in order will provide the best reading experience.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Crime",
    "Suspense",
    "Enemies To Lovers"
  ],
  "author": "D.D. Prince",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/38208175-joyride"
}