{
  "title": "The Oath and the Office: A Guide to the Constitution for Future Presidents",
  "description": "An essential guide to the presidential powers and limits of the Constitution, for anyone voting―or running―for our highest office. Can the president launch a nuclear attack without congressional approval? Is it ever a crime to criticize the president? Can states legally resist a president’s executive order? In today’s fraught political climate, it often seems as if we must become constitutional law scholars just to understand the news from Washington, let alone make a responsible decision at the polls. The Oath and the Office is the book we need, right now and into the future, whether we are voting for or running to become president of the United States. Constitutional law scholar and political science professor Corey Brettschneider guides us through the Constitution and explains the powers―and limits―that it places on the presidency. From the document itself and from American history’s most famous court cases, we learn why certain powers were granted to the presidency, how the Bill of Rights limits those powers, and what “we the people” can do to influence the nation’s highest public office―including, if need be, removing the person in it. In these brief yet deeply researched chapters, we meet founding fathers such as James Madison and Alexander Hamilton, as well as key figures from historic cases such as Brown v. Board of Education and Korematsu v. United States . Brettschneider breathes new life into the articles and amendments that we once read about in high school civics class, but that have real impact on our lives today. The Oath and the Office offers a compact, comprehensive tour of the Constitution, and empowers all readers, voters, and future presidents with the knowledge and confidence to read and understand one of our nation’s most important founding documents.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Government",
    "Audiobook",
    "Law",
    "American History"
  ],
  "author": "Corey Brettschneider",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/38212162-the-oath-and-the-office"
}