{
  "title": "Nightmare Jack and Other Tales",
  "description": "John Metcalfe's tales of the macabre and the supernatural are amongst the finest in the genre, and are comparable to the stories of such authors as Walter de la Mare, L.P. Hartley, and Robert Aickman. The horrors in his stories are insidious and unnerving, frightening by stealth rather than by violence as they intrude into the quiet lives of ordinary people, who find their worlds shaken by forces they can neither understand nor control. Like the best horror tales of Poe and Le Fanu, Metcalfe's narratives are often disturbing accounts of excursions into the 'bad lands' of the subconscious mind. Writing about John Metcalfe in The Penguin Encyclopaedia of Horror and the Supernatural, T.E.D. Klein said that the author's work is marked by 'a rare artistry, wit, and intelligence—and by a restraint too often lacking in the genre'. Mike Ashley, in Who's Who in Horror and Fantasy Fiction, calls Metcalfe's works 'skilful and bizarre', while E.F. Bleiler, in his The Guide to Supernatural Fiction, refers to them as 'tense, cryptic stories of brooding supernaturalism' which are now 'unjustly forgotten'. In The St James Guide to Horror, Ghost and Gothic Writers, Brian Stableford 'The neglect into which Metcalfe's work has fallen is very unfortunate; an excellent eclectic collection could be compiled by combining The Feasting Dead with the cream of his short fiction, and it is high time that some such project was attempted.' Nightmare Jack and Other Tales does just that. Introduction by Richard Dalby; 'Nightmare Jack'; 'The Double Admiral'; 'The Smoking Leg'; 'The Grey House'; 'The Tunnel'; 'The Bad Lands'; 'Mr Meldrum's Mania'; 'Time-Fust'; 'Mortmain'; 'Funeral March of a Marionette'; 'Brenner's Boy'; 'Not There'; '\"Beyondaril\"'; 'The Firing-Chamber'; 'The Renegade'; 'The Childish Thing'; 'The Feasting Dead'; Afterword, 'A Forgotten Man' by Alexis Lykiard.",
  "genres": [
    "Horror",
    "Fiction",
    "Short Stories"
  ],
  "author": "John Metcalfe",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/3822643-nightmare-jack-and-other-tales"
}