{
  "title": "Earth and Beyond: A Space Adventure Origin Story",
  "description": "The sky is not the limit in this near-future medical mystery.Earth is at peace…then an alien infection changes things.An engineer creates a revolutionary engine to launch the world's hope for salvation into distant space.A crew of Earth’s top talent face never-before-seen adversity as they search for a cure for humanity.Earth had achieved a semi-utopia until aliens destroyed the peace. After a bizarre robot occupation leading to all-out war, humanity was left with a deadly alien pandemic. Their possible salvation lies in a team brought together to search for a solution beyond the stars.An ambitious Ambassador heads up a mission to cure the medical crisis. A war hero Captain is at her side as they launch a dangerous deep space drive invented by a possibly unstable genius. The revolutionary ship carries mission specialists collected from around the world including an all-star surgeon pushed beyond Earthly skills, a security head with all-too deadly martial arts skills, and a scientist willing to risk it all for a solution.As their journey into deep space begins, they encounter obstacles and battles of wills as they strive to survive the harsh and not-so empty space on the way to their distant goal. Together, the hand-picked team deals with technical problems, illness, personal issues, and secret elements of Earth’s warring bio-tech ideologies as they kick off their mission to save Earth.Enhanced with hand drawn ship illustrationsWhat reviewers are sayingWell written, with interesting characters and an intriguing plot~ Marc \"StarWolf\" Gerin-LaJoie, Founder, Ottawa Science Fiction SocietyThis is a very interesting book…I strongly recommend you read this amazing MedSci Missions.~ Alain Faucher, Chief Instructor at International Todokai Karate AssociationExtremely well written…the novel displays an amazingly wide knowledge of science, of humanpsychology, of yogic practices and of what could exist beyond the known galaxy.~Robert Hawkes, professor emeritus, University of New BrunswickProfessor emeritus, UNB",
  "genres": [
    "Amazon"
  ],
  "author": "Wendy Gamble",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/38219799-earth-and-beyond"
}