{
  "title": "Little Maryam",
  "description": "While giving a speech for his Nobel Prize nomination, Dr. Saadiq Haider, a renowned gene therapist and professor at Stanford University, receives a phone call that changes his life. Abandoning his duties and responsibilities, Saadiq hurriedly boards a flight bound for India, embarking on a journey that spans thousands of miles and pulls him back into a past Saadiq thought long-buried. Seated next to him on the flight, Anne Miller—an intrepid journalist with a nose for headline news—senses the reclusive genius has a story to tell.During the flight, Anne manages to break through Saadiq’s hard exterior and listens, rapt, as he unfurls a tale fraught with love and heartbreak.His story transports Anne back in time to a small, sleepy town nestled in the mountains of northern India, where Saadiq spent his childhood. Through Saadiq’s narrative, Anne meets Maryam and witnesses the friendship between Maryam and Saadiq mature into an intense love; a love that is tested when tragedy strikes and the lovers are separated. Try as they might, their devotion is no match against the workings of fate, and the tighter Saadiq and Maryam cling to one another, the faster they slip apart.Now, after two decades of trying to forget his past with alcohol and drug abuse, Saadiq tells Anne that fate has acted again; Maryam is the hospital, her condition critical. When their plane lands in India, the newfound friends part ways and while Saadiq rushes to Maryam’s side, Anne returns to her life, grateful to have met the enigmatic man.Months later, Anne learns that after wrenching Maryam from the indomitable grip of death, Saadiq took her back to America, where they finally married. But, her assumption that the greatest love story she had ever known would end happily is shattered when Anne receives devastating news.",
  "genres": [
    "Fiction"
  ],
  "author": "Hamid Baig",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/38229715-little-maryam"
}