{
  "title": "Die Nacht des Vergessens: Tantans Geschichte",
  "description": "Die anderen vergaßen im Verlauf der Jahre tatsächlich. Ich jedoch, ich vergaß nie …  Durch Zufall und verbotenes Wissen entging Tantan Arreidas dem Zauber, der einen zweiten Nebel des Vergessens über ihr Volk legte.  Jahrelang bewahrte die mutige Königstochter der Arrya ihre Erinnerungen für sich. Nun, während die Zukunft ungewisser scheint als jemals zuvor, erzählt sie zum ersten Mal von all den Geheimnissen, die sie und ihr geliebter Zwillingsbruder Sinjhar gemeinsam mit ihren Freunden entdeckten.  Ihr Erkundungsdrang führt Tantan zum Grund der Waldseen und in die Gebirge jenseits der Heimat, denn in Erriada ist nur selten etwas so, wie es auf den ersten Blick scheint. Und dann sind da noch die Erkenntnisse, die Tantan selbst vor ihren besten Freunden geheim halten muss, weil sie die absoluten Verbote der Menschen verletzen.  Während Tantan sich durch ihre grenzenlose Neugier ein ums andere Mal in Schwierigkeiten bringt, passieren im Dorf unheimliche Dinge und belasten die Gemeinschaft der Menschen schwer. Plötzlich schleichen die anderen Bewohner des Landes – die Geister – um die Baumwohnungen, und im Schatten der Wälder breitet sich ein finsterer Einfluss aus.  Doch so chaotisch die Welt draußen auch scheint, sie kann nicht mit dem Durcheinander in Tantans Gefühlen mithalten. Denn langsam beginnt die Zeit, in der Freundschaft sich zu Liebe und Zuneigung in Begehren wandelt.   Der Verlag über das Buch  Bei \"Die Nacht des Vergessens: Tantans Geschichte\" handelt es sich um den vierten Band der Fantasy-Saga Der Weg des Heilers von Isa Day. Er kann für sich allein gelesen werden. Da Tantans Geschichte jedoch die Rätsel aus Der verletzte Himmel (Band 1) und In den Tiefen der Ewigkeit (Band 2) vertieft, ist das Leseerlebnis nicht ganz das Gleiche, wie wenn man die Serie in Sequenz liest.",
  "genres": [],
  "author": "Isa Day",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/38218476-die-nacht-des-vergessens"
}