{
  "title": "Memoirs",
  "description": "For the \"old crocodile,\" as Williams called himself late in life, the past was always present, and so it is with his continual shifting and intermingling of times, places, and memories as he weaves this story. When Memoirs was first published in 1975, it created quite a bit of turbulence in the mediathough long self-identified as a gay man, Williams' candor about his love life, sexual encounters, and drug use was found shocking in and of itself, and such revelations by America's greatest living playwright were called \"a raw display of private life\" by The New York Times Book Review . As it turns out, thirty years later, Williams' look back at his life is not quite so scandalous as it once seemed; he recalls his childhood in Mississippi and St. Louis, his prolonged struggle as a \"starving artist,\" the \"overnight\" success of The Glass Menagerie in 1945, the death of his long-time companion Frank Merlo in 1962, and his confinement to a psychiatric ward in 1969 and subsequent recovery from alcohol and drug addiction, all with the same directness, compassion, and insight that epitomize his plays.And, of course, Memoirs is filled with Williams' amazing friends from the worlds of stage, screen, and literature as heoften hilariously, sometimes fondly, sometimes notremembers Laurette Taylor, Gore Vidal, Truman Capote, Elia Kazan, Marlon Brando, Vivian Leigh, Carson McCullers, Anna Magnani, Greta Garbo, Elizabeth Taylor, and Tallulah Bankhead to name a few. And now film director John Waters, well acquainted with shocking the American public, has written an introduction that gives some perspective on the various reactions to Tennessee's Memoirs , while also paying tribute to a fellow artist who inspired many with his integrity and endurance.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Autobiography",
    "LGBT",
    "Classics"
  ],
  "author": "Tennessee Williams",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/12264.Memoirs"
}