{
  "title": "Bright Not Broken: Gifted Kids, ADHD, and Autism",
  "description": "The future of our society depends on our gifted children--the population in which we'll find our next Isaac Newton, Albert Einstein, or Virginia Woolf.  Yet the gifts and talents of some of our most brilliant kids may never be recognized because these children fall into a group known as twice exceptional, or \"2e.\" Twice exceptional kids are both gifted and diagnosed with a disability--often ADHD or an Autism Spectrum Disorder--leading teachers and parents to overlook the child's talents and focus solely on his weaknesses. Too often, these children get lost in an endless cycle of chasing diagnostic labels and are never given the tools to fully realize their own potential.Bright Not Broken sheds new light on this vibrant population by identifying who twice exceptional children are and taking an unflinching look at why they're stuck.  The first work to boldly examine the widespread misdiagnosis and controversies that arise from our current diagnostic system, it serves as a wake-up call for parents and professionals to question why our mental health and education systems are failing our brightest children.Finally, the authors show what we can do to help 2e children, providing a whole child model for parents and educators to strengthen and develop a child's innate gifts while also intervening to support the deficits.  Drawing on painstaking research and personal experience, Bright Not Broken offers groundbreaking insight and practical strategies to those seeking to help 2e kids achieve their full potential.Diane M. Kennedy, author of The ADHD-Autism Connection, is a long time advocate, international speaker/trainer, and mother of three twice-exceptional sons.Rebecca S. Banks, M.A., co-author of The ADHD-Autism Connection, is a veteran educator, national speaker/trainer, and mother of two twice-exceptional children.Temple Grandin, Ph.D., is a professor, prolific author, and one of the most accomplished and renowned adults with autism in the world.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Autistic Spectrum Disorder",
    "Adhd",
    "Psychology",
    "Education",
    "Self Help"
  ],
  "author": "Diane M. Kennedy",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/12262980-bright-not-broken"
}