{
  "title": "A Heart at Fire's Center: The Life and Music of Bernard Herrmann",
  "description": "No composer contributed more to film than Bernard Herrmann, who in over 40 scores enriched the work of such directors as Orson Welles, Alfred Hitchcock, François Truffaut, and Martin Scorsese. In this first major biography of the composer, Steven C. Smith explores the interrelationships between Herrmann's music and his turbulent personal life, using much previously unpublished information to illustrate Herrmann's often outrageous behavior, his working methods, and why his music has had such lasting impact.From his first film ( Citizen Kane ) to his last ( Taxi Driver ), Herrmann was a master of evoking psychological nuance and dramatic tension through music, often using unheard-of instrumental combinations to suit the dramatic needs of a film. His scores are among the most distinguished ever written, ranging from the fantastic ( Fahrenheit 451 , The Day the Earth Stood Still ) to the romantic ( Obsession , The Ghost and Mrs. Muir ) to the terrifying ( Psycho ).Film was not the only medium in which Herrmann made a powerful mark. His radio broadcasts included Orson Welles's Mercury Theatre on the Air and The War of the Worlds . His concert music was commissioned and performed by the New York Philharmonic, and he was chief conductor of the CBS Symphony.Almost as celebrated as these achievements are the enduring legends of Herrmann's combativeness and volatility. Smith separates myth from fact and draws upon heretofore unpublished material to illuminate Herrmann's life and influence. Herrmann remains as complex as any character in the films he scored―a creative genius, an indefatigable musicologist, an explosive bully, a generous and compassionate man who desperately sought friendship and love.Films scored by Bernard Citizen Kane, The Ghost and Mrs. Muir, Vertigo, Psycho, Fahrenheit 451, Taxi Driver, The Magnificent Ambersons, The Man Who Knew Too Much, North By Northwest, The Birds, The Snows of Kilimanjaro, Cape Fear, Marnie, Torn Curtain, among others",
  "genres": [
    "Music",
    "Biography",
    "Film",
    "Media Tie In",
    "Nonfiction"
  ],
  "author": "Steven C.   Smith",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/1226433.A_Heart_at_Fire_s_Center"
}