{
  "title": "Fat: An Appreciation of a Misunderstood Ingredient, with Recipes",
  "description": "A rich and unapologetic celebration of this luscious food. For all of history, minus the last thirty years, fat has been at the center of human diets and cultures. When scientists theorized a link between saturated fat and heart disease, industry, media, and government joined forces to label fat a greasy killer, best avoided. But according to Jennifer McLagan, not only is our fat phobia overwrought, it also hasn’t benefited us in any way. Instead it has driven us into the arms of trans fats and refined carbohydrates, and fostered punitive, dreary attitudes toward food–that wellspring of life and pleasure.In Fat , McLagan sets out with equal parts passion, scholarship, and appetite to win us back to a healthy relationship with animal fats. She starts by defusing fat’s bad rap, both reminding us of what we already know–that fat is fundamental to the flavor of our food–and enlightening us with the many ways fat (yes, even animal fat) is indispensable to our health.Mostly, though, Fat is about pleasures–the satisfactions of handling good ingredients skillfully, learning the cultural associations of these primal foodstuffs, recollecting and creating personal memories of beloved dishes, and gratifying the palate and the soul with fat’s irreplaceable savor. Fat lavishes the reader with more than 100 recipes from simple to intricate, classic to contemporary, • Butter-Poached Scallops• Homemade Butter• Carnitas• Duck Confit• Prosciutto-Wrapped Halibut with Sage Butter• Steak and Kidney Pie• Salted Butter Tart Observing that though we now know everything about olive oil, we may not know what to do with lard or bone marrow, McLagan offers extensive guidance on sourcing, rendering, flavoring, using, and storing animal fats, whether butter or bacon, schmaltz or suet. Stories, lore, quotations, and tips touching on fat’s place in the kitchen and in the larger culture round out this rich and unapologetic celebration of food at its very best.",
  "genres": [
    "Cookbooks",
    "Food",
    "Cooking",
    "Nonfiction",
    "Reference",
    "Food and Drink",
    "Health"
  ],
  "author": "Jennifer McLagan",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/3822679-fat"
}