{
  "title": "Tennessee Williams: Plays 1937–1955",
  "description": "Tennessee Williams’s explosive, often violent, plays shattered conventional proprieties and transformed the American stage. They inspired some of the most famous productions and performances in theatrical and film history, and they continue to grip audiences all over the world. Now, in an authoritative two-volume edition, The Library of America collects the plays that define Williams’s extraordinary range and achievement.This first volume begins with the stunning rediscovered plays of Williams’s early career: Spring Storm, a tragedy of provincial longing that prefigures the mood and language of his later work, and Not About Nightingales, a stark prison drama, produced in 1998 to international acclaim, that resounds with the playwright’s outraged idealism. With the autobiographical The Glass Menagerie in 1944, Williams attained what he later called “the catastrophe of success,” a success made all the greater by A Streetcar Named Desire, his most famous play and one of the most influential works of modern American literature.Forging an idiom that uniquely blended lyricism and brutality, a tragic sense of life and a genius for comic observation, he continued to revolutionize the American theater with a series of masterpieces: the poignant and melancholy Summer and Smoke, the light-hearted erotic comedy The Rose Tattoo, the sprawling and surrealistic Camino Real, and Cat on a Hot Tin Roof, the Pulitzer Prize–winning portrayal of a ruthless family struggle. This volume also contains Battle of Angels (an early version of Orpheus Descending), and a selection of Williams’s one-act plays, including 27 Wagons Full of Cotton, The Property Is Condemned, and I Rise in Flame, Cried the Phoenix, a meditation on the life and work of D. H. Lawrence.This edition includes a newly researched chronology of Tennessee Williams’s life, explanatory notes (including cast lists of many of the original productions), and an essay on the texts.This volume is edited by Mel Gussow (1933–2005), who was a drama critic, a cultural writer at The New York Times, and author of several books, including Edward Albee: A Singular Journey, and by Kenneth Holditch, professor emeritus at the University of New Orleans, editor since 1989 of the Tennessee Williams Journal, and the author of In Old New Orleans.--front flap",
  "genres": [
    "Plays",
    "Drama",
    "Classics",
    "Fiction",
    "Theatre",
    "Literature",
    "Southern"
  ],
  "author": "Tennessee Williams",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/12265.Tennessee_Williams"
}