{
  "title": "It Is Not What It Is: THE REAL (s)PAIN OF EUROPE",
  "description": "REVISED, UPDATED and ADDED AUTHOR´S NOTE (March 2019)The world needs to know what is happening in Spain. Visiting tourists are served beautiful beaches, sports and gastronomy numbing their senses. There are many things going on in this glorious nation that never make the headlines in their home countries. Important issues since they ultimately determine the state of Europe and its position in the world.The EU, which has focused strongly on expansion, is fractionalizing. Politicians, who follow outdated economic indicators, fail to see what is really going on. They are clueless! Economic indicators and corruption are measured “post-action”. Therefore, they are merely consequences and not the causes of social-economic turmoil.How can Europeans, speak of human rights issues in China, when thousands of women are forced to work in “alegal” prostitution in Spain? Many of whom are victims of human trafficking. Not to speak of the 100,000 African immigrants who work and live under slave-like conditions in Almeria.Close to 30% of Spanish citizens lives on the verge of poverty. A number, which will not improve shortly. The EU keeps on pouring money into the largest single beneficiary, but “Espanistan” keeps on wasting it. It has the richest politicians and former politicians in Europe. Many Spanish citizens have lost hope.The country is run by an invisible force that goes by many names (e.g. la casta). This force places itself above the law and overturns Supreme Court rulings, replaces critical judges in important cases, silences and bribes witnesses and exercises the outdated \"gag-law\". A law that clearly contradicts freedom of speech.Unfortunately, the corrupt practices of politicians rub off on corporate structures and society and the country has proven – time and time again – it cannot run its EU-course without intervention. It Is Not What It Is reveals 7 characteristics that function as a handbrake on Spain's development and shows the devastating effects of a conformist's attitude when applied on a national level.***\"The way you look at Spain will never be the same again.\" - Brian Larsen, CEO Bancore***\"Let's imagine (…) this Dutch immigrant is right and his criticisms are for our own good... If this was not a written article, an image of a \"SPLASH!\" would be next. A slap in the face to wake us up from our false national dream.\"- José Luis Roig, Spanish political analist (La Información)***¨After analizing the 7 characterisctics on our show, we conclude that we agree with them¨- P. Perez Salazar, journalist/RADIO host (Entre tu y yo... Lo que tu quieras), Madrid***¨People who criticize you the most should know better! Great job.¨- J. Encinas, Former Country Director USA (Codorniu)***¨I guess you will have a lot of critics coming from Spain, but you are just telling the truth.¨- M. Lopez***Featured in Huffingtonpost, Euronews, 15 newspapers in 5 different countries, TV and 7 radio stations***VINCENT R. WERNERA worried EU-citizen living in Spain. Werner has worked with companies like ABN AMRO, L'Oréal and Apple. He has lived in Spain for more than 18 years where he advised hundreds of people and companies on starting up their ventures.",
  "genres": [],
  "author": "Vincent R. Werner",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/38236342-it-is-not-what-it-is"
}