{
  "title": "The World of Lore: Dreadful Places",
  "description": "Captivating stories of the places where human evil has left a nefarious mark, featuring stories from the podcast Lore--now a streaming television series--including \"Echoes,\" \"Withering Heights,\" and \"Behind Closed Doors\" as well as rare material.Sometimes you walk into a room, a building, or even a town, and you feel it. Something seems off--an atmosphere that leaves you oddly unsettled, with a sense of lingering darkness. Join Aaron Mahnke, the host of the popular podcast Lore, as he explores some of these dreadful places and the history that haunts them.Mahnke takes us to Colorado and the palatial Stanley Hotel, where wealthy guests enjoyed views of the Rocky Mountains at the turn of the twentieth century--and where, decades later, a restless author would awaken from a nightmare, inspired to write one of the most revered horror novels of all time. Mahnke also crosses land and sea to visit frightful sites--from New Orleans to Richmond, Virginia, to the brooding, ancient castles of England--each with its own echoes of dark deeds, horrible tragedies, and shocking evil still resounding.Filled with evocative illustrations, this eerie tour of lurid landmarks and doomed destinations is just the ticket to take armchair travelers with a taste for the macabre to places they never thought they'd visit in their wildest, scariest dreams.The World of Lore series includes: MONSTROUS CREATURES - WICKED MORTALS - DREADFUL PLACESPraise for \nWorld of Lore: Dreadful Places\n\"Well-written, rooted in deep historical research, and ridiculously entertaining . . . Each chapter brings a creepy story from folklore to life. . . . Hair-raising stuff.\"--SyFy Wire\n \n \"Fans of the Lore podcast won't want to miss this latest volume in the creator's series, a collection of illustrated versions of both rare and well-known stories about 'lurid landmarks and doomed destinations.'\"--io9\n \n \"Dreadful Places is a delight for Lore fans and newbies alike. In the book, [Aaron] Mahnke visits places around the world that are steeped in a supernatural legacy.\"--Refinery29",
  "genres": [
    "Nonfiction",
    "Horror",
    "History",
    "Paranormal",
    "Folklore",
    "Audiobook",
    "Mythology"
  ],
  "author": "Aaron Mahnke",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/38245217-the-world-of-lore"
}