{
  "title": "Pieces: A Collection of New Voices",
  "description": "MTV has discovered the authors of tomorrow. Read them today in Pieces.This unique short-story collection is more than a good read—it's an exciting glimpse into the future of fiction. The winners of MTV's \"Write Stuff\" competition share their voices and visions in tales that are endearingly raw, undeniably bold, and engagingly inventive.In Next Time, a housewife encounters a gunman—an experience that changes her life, and her mind, in surprising ways...Pinball is an edgy tale of a young mail clerk's hidden sex life...After her broken engagement, a cook in New York goes to work for a chic SoHo couple in Roam...Mother captures the tragedy of a woman's illness, as witnessed through her daughter's eyes...In Day of the Dead, a humorously doomed relationship begins when a twentysomething's boyfriend returns from an Outward Bound trip and moves in with her...Two old high school friends reunite—and compare their very different lives—in Black Cowboy.Along with other stories and an introduction by Stephen Chbosky (The Perks of Being a Wallflower), Pieces is filled with the excitement of discovery—as a host of newcomers present their works to a wide and eager audience.Scoring / William Clifford --Polaroid / Matthew Loren Cohen --Day of the dead / Aury Wallington --The white carousel horse / Dennis G. Dillingham, Jr. --First snow / Davy Rothbart --The carnival / Clementyne Howard --Petty theft / Martin Wilson --Next time / Michelle Rick --Black cowboy / Carmen Elena Mitchell --Pinball / Jason Rekulak --Roam / Kathleen Bedwell Hughes --Mother / Alsha D. Gayle --Respiration / Chandra Steele --A fortune / Joy Monica T. Sakaguchi --Forbidden fate / Sujata DeChoudhury",
  "genres": [
    "Short Stories",
    "Fiction",
    "Young Adult",
    "Anthologies",
    "Short Story Collection",
    "Collections",
    "Contemporary"
  ],
  "author": "Stephen Chbosky",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/38277.Pieces"
}