{
  "title": "Just Mercy (Adapted for Young Adults): A True Story of the Fight for Justice",
  "description": "The young adult adaptation of the acclaimed, #1 \n\nNew York Times\n\n bestseller \n\nJust Mercy\n\n--soon to be a major motion picture starring Michael B. Jordan, Jaime Foxx, and Brie Larson and now the subject of an HBO documentary feature!\nIn this very personal work--adapted from the original #1 bestseller, which the New York Times calls \"as compelling as To Kill a Mockingbird, and in some ways more so\"--acclaimed lawyer and social justice advocate Bryan Stevenson offers a glimpse into the lives of the wrongfully imprisoned and his efforts to fight for their freedom.Stevenson's story is one of working to protect basic human rights for the most vulnerable people in American society--the poor, the wrongly convicted, and those whose lives have been marked by discrimination and marginalization. Through this adaptation, young people of today will find themselves called to action and compassion in the pursuit of justice.Proceeds of this book will go to charity to help in Stevenson's important work to benefit the voiceless and the vulnerable as they attempt to navigate the broken U.S. justice system.A \nKIRKUS REVIEWS \nBEST BOOK OF THE YEARA \nBOOKLIST \nEDITORS' CHOICEFEATURED ON \nCBS THIS MORNING\nA NEW YORK PUBLIC LIBRARY BEST BOOK OF THE YEARPRAISE FOR \nJUST MERCY: A TRUE STORY OF THE FIGHT FOR JUSTICE\n \"It's really exciting that young people are getting a version tailored for them.\" --Salon\"A deeply moving collage of true stories. . . . This is required reading.\" --Kirkus Reviews, starred review\"Compassionate and compelling, Stevenson's narrative is also unforgettable.\" --Booklist, starred reviewPRAISE FOR \nJUST MERCY: A STORY OF JUSTICE AND REDEMPTION\n \"Gripping. . . . What hangs in the balance is nothing less than the soul of a great nation.\" --DESMOND TUTU, Nobel Peace Prize Laureate\"Important and compelling.\" --Pulitzer Prize-winning author TRACY KIDDER\"Inspiring and powerful.\" --#1 New York Times bestselling author JOHN GRISHAM",
  "genres": [
    "Nonfiction",
    "School",
    "Memoir",
    "Social Justice",
    "Audiobook",
    "Biography",
    "Read For School"
  ],
  "author": "Bryan Stevenson",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/38255359-just-mercy-adapted-for-young-adults"
}