{
  "title": "La solitudine dei numeri primi",
  "description": "Mattia pensava che lui e Alice erano così, due primi gemelli, soli e perduti, vicini ma non abbastanza per sfiorarsi davvero. A lei non l'aveva mai detto.Alice ha sette anni e odia la scuola di sci, ma suo padre la obbliga ad andarci. È una mattina di nebbia fitta, lei ha freddo e il latte della colazione le pesa sullo stomaco. In cima alla seggiovia si separa dai compagni e, nascosta nella nebbia, se la fa addosso. Per la vergogna decide di scendere a valle da sola, ma finisce fuori pista, spezzandosi una gamba. Resta sola, incapace di muoversi, al fondo di un canalone innevato, a domandarsi se i lupi ci sono anche in inverno.Mattia è un ragazzino intelligente con una gemella ritardata, Michela. La presenza costante della sorella umilia Mattia di fronte ai suoi coetanei. Per questo, la prima volta che un compagno di classe li invita entrambi alla sua festa, Mattia decide di lasciare Michela nel parco, con la promessa che tornerà presto da lei.Questi due episodi iniziali, con le loro conseguenze irreversibili, saranno il marchio impresso a fuoco nelle vite di Alice e di Mattia, adolescenti, giovani e infine adulti. Le loro esistenze, così profondamente segnate, si incroceranno e i due protagonisti si scopriranno strettamente uniti eppure invincibilmente divisi. Come quei numeri speciali, che i matematici chiamano primi gemelli: due numeri primi separati da un solo numero pari, vicini ma mai abbastanza per toccarsi davvero.Questo romanzo è la storia dolorosa e commovente di Alice e di Mattia, e dei personaggi che li affiancano nel loro percorso. Paolo Giordano tocca con sguardo lucido e profondo, con una scrittura di sorprendente fermezza e maturità, una materia che brucia per le sue implicazioni emotive. E regala ai lettori un romanzo capace di scuotere per come alterna momenti di durezza e di spietata tensione a scene più rarefatte e di trattenuta emozione, piene di sconsolata tenerezza e di tenace speranza.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Italian Literature",
    "Italy",
    "Novels",
    "Book Club",
    "Young Adult"
  ],
  "author": "Paolo Giordano",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/3828372-la-solitudine-dei-numeri-primi"
}