{
  "title": "Edge of Insanity",
  "description": "Scorching hot and sexy stories set in science fiction and paranormal worlds that come alive in your hands. Internationally acclaimed for her writing, S.E. Smith's stories are unapologetic happily-ever-afters. They are also full of alpha heroes, heroines with a brain, action, adventure, and humor. Don't miss out on stories that readers say they can't get enough of!  Sometimes the only way to survive is to let insanity take over…  Edge remembers little of his capture but all of what has happened since. Sold to the Waxians, he resists their efforts to gain information on the Trivator military and weapons systems. He can feel his mind splinter from their repeated tortures, but a soft voice in the darkness urges him to resist-and fight back.  Lina Daniels is used to fighting fire with fire. She isn't afraid of death, but she is terrified of being captured. As a resistance fighter on Earth, she knew the dangers. Those threats seem minuscule compared to those on the alien world she was taken to.  Determined to return home, her plan is simple - free the Trivator warrior she discovered and force him to take her and the other women that are with her back to Earth. That plan turns out just as hazardous as being a fugitive on an alien world! The last thing Lina expects is for the Trivator to have an intense protectiveness of her or his stubborn determination in believing she is his Amate!  The soft sound of Lina's voice is the only thing that prevents Edge's mind from completely shattering. With the Waxian and Drethulan forces on their tail, it will take more than a few daring moves to escape to freedom. Can a tortured warrior and his rebellious rescuer escape the forces chasing them or will the threat of losing the last thing holding him together hurl Edge over the precipice and into insanity?",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens",
    "Science Fiction Romance",
    "Audiobook",
    "Paranormal Romance",
    "Fantasy"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/38277571-edge-of-insanity"
}