{
  "title": "Army Detective: Life and Times of Dick Miller: Retired Special Agent US Army Criminal Investigation Division",
  "description": "Dick Miller is a retired special agent with the US Army Criminal Investigation Division who faithfully served his country for over twenty-three years in the military and an additional twenty years working for various US government law enforcement, intelligence, and security agencies. His book, Army Life and Times of Dick Miller, not only chronicles his early years growing up in a small coal-mining town in southwestern Indiana but goes into his first tour in the US Army where he served a year in Vietnam then left to pursue a college degree.He writes about how his personal life, studies, and aspirations to work in law enforcement were hindered by his wife’s refusal to support his career ambitions, which overflowed into her disruptive personality and own personal desires to make him stay in their hometown without the hope of pursuing any type of career.Knowing his life would be forever stagnated without hope of achieving his goals and realizing his marriage was a failure, he reentered the US Army and achieved his career goal at the same time by seeking to serve as a CID special agent. His decision caused his marriage to end but opened the opportunity to find true love with a different woman and establish a stronger bond with his son, Chris.His journey to become successful picked up momentum at this stage, and as he rose through the ranks from a street investigator to senior investigative manager, he accomplished a lifelong dream of having that career in law enforcement. The many gruesome and violent crimes he investigated took their toll on his health and psyche. Realizing what his lifelong career had done, he had to find an avenue to allow him to keep associated with his work without the trials and tribulations of the job.Knowing it was a risk to get out of investigations, he pursued a position with the US Army Protective Services Unit. This action would allow him to continue working until retirement. This decision caused him to leave investigations but to stay in the job until his retirement. At the end, the US Army did offer him a chance to return to criminal investigations, but he turned them down and retired.He moved to Sun City Center, Florida, where he enjoys spending time with his wife of thirty-five-plus years, Elda, traveling throughout the United States and other parts of the world with her, and reading the many books accumulated over the years.",
  "genres": [],
  "author": "Dick Miller",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/38306897-army-detective"
}