{
  "title": "The Lies That Bind: Rethinking Identity",
  "description": "A Washington Post Notable Book of the YearAs seen on the Netflix series ExplainedFrom the best-selling author of Cosmopolitanism comes this revealing exploration of how the collective identities that shape our polarized world are riddled with contradiction.Who do you think you are? That’s a question bound up in another: What do you think you are? Gender. Religion. Race. Nationality. Class. Culture. Such affiliations give contours to our sense of self, and shape our polarized world. Yet the collective identities they spawn are riddled with contradictions, and cratered with falsehoods.Kwame Anthony Appiah’s The Lies That Bind is an incandescent exploration of the nature and history of the identities that define us. It challenges our assumptions about how identities work. We all know there are conflicts between identities, but Appiah shows how identities are created by conflict. Religion, he demonstrates, gains power because it isn’t primarily about belief. Our everyday notions of race are the detritus of discarded nineteenth-century science. Our cherished concept of the sovereign nation—of self-rule—is incoherent and unstable. Class systems can become entrenched by efforts to reform them. Even the very idea of Western culture is a shimmering mirage.From Anton Wilhelm Amo, the eighteenth-century African child who miraculously became an eminent European philosopher before retiring back to Africa, to Italo Svevo, the literary marvel who changed citizenship without leaving home, to Appiah’s own father, Joseph, an anticolonial firebrand who was ready to give his life for a nation that did not yet exist, Appiah interweaves keen-edged argument with vibrant narratives to expose the myths behind our collective identities.These “mistaken identities,” Appiah explains, can fuel some of our worst atrocities—from chattel slavery to genocide. And yet, he argues that social identities aren’t something we can simply do away with. They can usher in moral progress and bring significance to our lives by connecting the small scale of our daily existence with larger movements, causes, and concerns.Elaborating a bold and clarifying new theory of identity, The Lies That Bind is a ringing philosophical statement for the anxious, conflict-ridden twenty-first century. This book will transform the way we think about who—and what—“we” are.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Politics",
    "Sociology",
    "Psychology",
    "Race",
    "History"
  ],
  "author": "Kwame Anthony Appiah",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/38321385-the-lies-that-bind"
}