{
  "title": "Bone Driven",
  "description": "Book Two in the powerfully addictive fantasy series The Foundling , perfect for fans of Ilona Andrews, Jenn Stark and Helen HarperThe bayou is burning, the battle is just beginning - and Luce Boudreau is smack in the middle of no-man's land . . .Life as a cop in Canton Town, Mississippi, is never dull - particularly when hiding deep within you is a demon bent on the apocalypse. Luce is doing her best to pretend her two worlds aren't crashing into each other, but what should be a routine arson investigation takes a shocking turn when Luce discovers a link between the suspects and her own dark secrets. There's no turning back, even though her search for the truth threatens to burn her old life down around her.Lines are being drawn in a war Luce barely understands, and she just might be on the wrong side of them. Now she must embrace her powerful destiny, or the ones she loves most will pay the ultimate price.Readers LOVE Hailey ' Edwards creates amazing fantasy worlds' - (Goodreads reviewer)' A fantasy of a five-star read! ' (Amazon reviewer)' Hailey Edwards has exceeded all expectation ' (Goodreads)'Well-plotted fantasy with intriguing characters , heart-pounding action , suspenseful intrigue and subtle romance' ( RT Book Reviews )' Edwards has this way of writing that makes you feel like the narrator is talking to you and that you're old friends ' (Goodreads)'The world building is fresh . . . The characters are well-drawn and easy to root for. And the romance really hits the spot' ( Red Hot Books )'She builds dynamic character bases, using common mythology but takes it one step further using previously unseen species or imbibing currently known species with skills and know how that offers readers something new in the paranormal world ' ( Smexybooks )",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Demons",
    "Romance",
    "Dragons",
    "Shapeshifters"
  ],
  "author": "Hailey Edwards",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/38315584-bone-driven"
}