{
  "title": "Look to the Lady",
  "description": "The Gyrth family had guarded the Gyrth Chalice for hundreds of years. It was held by them for the British Crown. Its antiquity, its beauty, the legends that were connected with it, all combined to make it unique. It was irreplaceable. No thief could hope to dispose of it in the ordinary way. And indeed no ordinary thief would dream of trying. Kept in a windowless chapel, and protected by a fearsome curse, the Chalice should be impervious to thievery. But this is 1930, and the crooks have all the advantages of the modern world. Chief among these is the craving for publicity, to which at least one member of the Gyrth clan has succumbed. Her careless chatter about the Chalice seems to have called up all manner of misfortunes - of which larceny is just the beginning. Finding himself the victim of a botched kidnapping attempt, Percival St. John Wykes Gryth, current heir to the Gyrth family and guardian-elect of the Chalice, suspects that he might be in a spot of trouble. Unexpected news to him - but not to the mysterious Mr Campion, who reveals that the ancient Chalice entrusted to Val's family is being targeted by a ruthless ring of wealthy thieves intent on supplementing their own private treasure trove. The vague, bespectacled Albert Campion doesn't look like he'll be much help against them. But looks can be deceptive. Fleeing London for the supposed safety of the village of Sanctuary, in Suffolk, Campion and his trusty assistant Luggand come face to face with events of a perilous and puzzling nature. When Val's aunt is found dead with an expression of terrified - and terrifying - shock upon her face, Campion must preserve not only the safety of Chalice, but also that of the Gyrth family. Campion might be accustomed to outwitting criminal minds, but can he foil supernatural forces?",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "British Literature",
    "Classics",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Margery Allingham",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/383189.Look_to_the_Lady"
}