{
  "title": "Guardian Angel",
  "description": "From the award-winning historical fiction author, Anne Rouen, comes the World War II romantic drama, Guardian Angel.Feted and cosseted all his young life by legions of adoring fans, ten-year-old French singer Nicolas de Beaulieu seems to have it all in the rigours and depression of the 1930s: money, social status, fame. But he grows up no stranger to grief and loss, and during his teen years, jealousy rears its ugly head, keeping his minders hard-pressed to protect him from a stalking evil. Able to choose from thousands, at eighteen, Nicolas falls in love with fellow musician, Natalie: fiery, independent—a socialist unimpressed by his lineage and stardom. He has never met a girl like this.World War II begins and Nicolas finds himself in deadly peril, hunted by the Nazis. His complex relationship with the girl he loves takes another direction when France surrenders to Germany and they have to fight a different kind of war. They join the Resistance in the Paris underground, but the hunt for Nicolas intensifies. When a childhood friend turned enemy surfaces as an officer of the Gestapo, Nicolas is in more danger than ever, and he and Natalie are spirited out of Paris to vanish, with the help of colleagues, into the countryside.Hidden in the fastness of their mountain stronghold, every day is a battle of wits, courage and endurance as they fight to survive and undermine the overwhelming might of the Nazi war machine. As the years of the war play out with no sign of retreat on the part of the enemy, Nicolas's group, the Belvoir Maquis, grit their teeth and hold on, sabotaging their invaders whenever they can.The Nazis appear to be gaining the upper hand, as one by one the members of the Maquis fall to their brutal methods, until salvation comes from an unexpected source ...",
  "genres": [
    "Historical Romance",
    "Historical Fiction",
    "World War II",
    "War",
    "Romance",
    "Love Inspired Historical"
  ],
  "author": "Anne Rouen",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/38313620-guardian-angel"
}