{
  "title": "All This Hell: U.S. Nurses Imprisoned by the Japanese",
  "description": "Before December 1941 drew to a close, five navy nurses on Guam became the first American military women of WWII to be taken prisoner by the Japanese. More than seventy army nurses survived five months of combat conditions in the jungles of Bataan and Corregidor before being captured, only to endure more than three years in prison camps. In all, nearly one hundred nurses became POWs. Many of these army nurses were considered too vital to the war effort to be evacuated from the Philippines. Though receiving only half the salary of male officers of the same rank, they helped establish outdoor hospitals and treated thousands of casualties despite rapidly decreasing supplies and rations. After their capture, they continued to care for the sick and wounded throughout their internment in the prison camps. When freedom came, the U.S. military ordered the nurses to sign agreements with the government not to discuss their horrific experiences. Evelyn Monahan and Rosemary Neidel-Greenlee have conducted interviews with survivors and scoured archives for letters, diaries, and journals to uncover the heroism and sacrifices of these brave women. Their dedication to accuracy, combined with their personal expertise in medical care and military culture and discipline, has resulted in a honest, fair history of the dedicated military nurses who were captured in the Pacific theater during WWII. “Like their male counterparts, these nurses faced the reality of combat, anguish of surrender, and the brutality of captivity. Their story is one chapter in the annals of World War II that must be told, if American men and women are to appreciate the depth of sacrifices made by their countrymen and women in the cause of freedom.”—Rear Admiral Frances Shea Buckley, Nurse Corps, U.S. Navy (Ret.) “Goes far toward telling their story in a way most readers can grasp, sensing the heroism as well as the horrors of some of the most desperate years our Republic has ever faced.”—Frank F. Mathias “As well as ably telling the story of what women can tolerate in the service of their country, the authors give a stirring account of the fighting that took place on Bataan and Corregidor at that time.”—American History “Adds a tremendous chapter to the narrative of women prisoners in wartime by following a cast of characters almost cinematically through their daily routines and their reflections recorded in letters, diaries, and interviews.”—Rain Taxi",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Nursing",
    "Womens",
    "Read For School",
    "Historical"
  ],
  "author": "Evelyn M. Monahan",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/1226608.All_This_Hell"
}