{
  "title": "Yang Terucap Yang Tertulis",
  "description": "Bukan hanya tulisan Mas Wantik yang saya baca, tapi saya pernah dua hari bersama beliau. Dengan tulus beliau mengajarkan arti kehidupan sesungguhnya. Satu kata dari saya, tulisan dan kepribadian beliau, KEREN!Ardi GunawanPenulis bestseller 7 Metode Terlarang,founder Nutrisi Otak Omar Smart BrainHe and I have been together for a long time. When I established a company, he advised me eagerly. His advice based on the results of the business with many furniture stores of the world was precise.And then, my company was able to greatly grow up. I can trade without anxiety so long as he is in Wisanka. I respect his cheerful disposition that can make people around him happy, his positive strength toward his goal, and his kindness to protect a weak and small people.Teru MarubayashiOsaka JepangMas Wantik mengubah hal yang biasa menjadi luar biasa. Meninggalkan yang biasa untuk jadi tidak biasa. Jangan mempertanyakan agamanya, karena sudah dapat dilihat dari tanda di dahinya. Jangan tanyakan keluarganya, karena putri tertuanya kini tengah berjuang menjadi penghapal Al-Quran. Jangan bertanya tentang usahanya, karena rotan sudah banyak ia kirim ke mancanegara. Tapi tanyakan, apa lagi yang akan beliau usahakan untuk generasi selanjutnya?Af'idatun KhoiriyahPenyiar radio, penyuka dunia teknologi informasi,tinggal di KlatenMenginspirasi. Ya, Bapak yang satu ini benar-benar menginspirasi saya, meskipun tidak secara langsung, hanya dari status-status di BBM. But, it means a lot for me. Tak hanya memberikan inspirasi dalam hal pekerjaan, tetapi juga tentang kehidupan. Renyah dan ramah adalah kesan pertama yang saya tangkap dari Pak Wantik. Belajar adalah hal yang perlu diteladani dari sosok beliau. Thumbs up.CahyaPengusaha Kuliner, tinggal di SoloSumringah orangnya. Saya tidak pernah berhenti untuk iri. Karena, saya kagum atas kemampuannya untuk menyikapi hidup ini dengan pendekatan yang sederhana dan penuh keikhlasan. Apa yang saya pelajari dari kehidupan Mas Wantik adalah suatu kesegaran. Mari kita menulari diri dan teman-teman kita dengan virus kesumringahan Mas Wantik.Dodong CahyonoPengusaha, penggerak-praktisi UMKM dan koperasiSapa weruh ing panuju, sasat sugih pager wesi. Di mata saya, Mas Wantik adalah sosok sahabat yang bisa dijadikan rujukan. Ia mempunyai niat kuat menuju masa depan dan hal ini menjadikannya mempunyai visi dan misi yang jelas. Sudah dibuktikannya beberapa langkah bisnis yang sukses serta menjaga kelangsungan bisnis itu sendiri. Salah satunya adalah mengelola bisnis ekspor rotan yang sampai sekarang masih bertengger di urutan satu di lingkungannya. Ringan tangan untuk membatu teman, tanpa melihat latar belakang pendidikan serta asal muasalnya. Sungguh, seorang figur yang bersahaja, agamis, dan modern thinking yang sudah mulai jarang ditemui di zaman sekarang.Gagat Priyanto WibowoPakar Teknologi Informasi, tinggal di SoloMy 'brother' ini adalah seseorang yang menjalani hidupnya dengan sangat simpel, jujur, dan inspiratif.Wiendha SubiantoroIbu dari 2 anak, penyuka tantangan, marketingSeorang pribadi yang sudah lupa di mana letak kekhawatiran, kesedihan, kesombongan, kemewahan, dan harta duniawi dalam dirinya. Karena, yang ia tahu dan ingat selalu, hanya siapa yang menciptakannya dan ke manakah tujuan hidupnya. Dalam kehidupan, umumnya orang sangat sulit menciptakan dunianya sendiri untuk menikmati hidupnya senikmat mungkin. Tapi lain dengan Suwantik. Begitu mudahnya dia menciptakannya dan menikmatinya sampai orang lain pun banyak yang terheran-heran, apa sih yang dinikmatinya. Cepat, sederhana, dan positif. Apabila harus memilih dari jutaan kata, dengan mantap saya akan memilih tiga kata tersebut untuk mengilustrasikan Mas Wantik.Agato W. ArdiMotivator, asli Salatiga, penyuka olahragaPak Wantik memang aneh. Beliau adalah salah satu dari sedikit orang yang yakin secara bulat-bulat akan The Miracle of Giving. Beliau dengan sangat yakinnya rela memberikan apa saja yang beliau miliki kepada orang lain yang membutuhkan, termasuk walau harus memberikan kepemilikannya yang memang cuma itu yang beliau miliki. Pak Wantik paling jarang berbasa-basi. Beliau sangat lugas, langsung pada inti dan pokoknya saja. Membaca tulisan-tulisannya, seolah beliau bertutur. Dengan bahasa yang sederhana, lugas, mudah dimengerti, serta beralur ringan, pembaca tidak dibuat mengerutkan dahi, tapi dibuat mengangguk-angguk, seolah diingatkan akan hal yang sederhana, namun sering dilupakan. Satu hal yang membuat saya secara pribadi merasa terkesan dengan beliau adalah gaya kesederhanaannya. Dan saya begitu merasa amat sangat diingatkan dengan jargon beliau, I Love My Job, untuk selalu mencintai dan mensyukuri setiap pekerjaan yang dilakukan.Abdoel DahringMultitalenta, musisi, marketing, tinggal di CirebonBapak Suwantik pribadi yang sederhana sikap, sifat, dan tutur katanya. Gaya komunikasi yang santai dan sederhana membuatnya disenangi oleh rekan-rekannya. Tipikal pemimpin modern yang sangat fleksibel dan cepat tanggap terhadap perubahan. Beliau adalah salah satu figur inspirasional yang membuktikan bahwa pengalaman hidup tidak kalah penting dari sekadar background akademik dalam mencapai kesuksesan.Deny Eko PrasetyoPebisnis muda, tinggal di JakartaBaru kali ini saya menemukan sosok seperti ini. Sebagai orangtua, teman, dan rival yang energik, meledak-ledak, namun tetap teduh dan bijaksana dalam bertukar pikiran.Sono PamungkasPakar desain furniture dan lighting",
  "genres": [],
  "author": "Mas Wantik",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/38336796-yang-terucap-yang-tertulis"
}