{
  "title": "Eat Your Heart Out: Who Really Decides What Ends Up on Your Plate?",
  "description": "Why is it... That almost all the processed foods we eat contain the same handful of ingredients?That these handful of ingredients are produced by only a handful of multi-nationals? That some cereals contain more salt per serving than a packet of crisps?That served with milk, sugar and raisins, some cardboard packets have been said to be more nutritious than the cereal they contain? That there are half the number of dairy farms in the UK than there were 10 years ago?That over the same period the turnover of the top 20 global dairy corporations has increased by 60%? That over 60% of all processed foods in Britain contain soya?That the UK government's Committee on the Toxicity of Food judged that eating soya could have hormone-disrupting effects? That in 1970, a hundred grams of an average chicken contained less than 9 grams of fat, but today it contains nearly 23 grams of fat?That the amount of protein in that chicken has fallen by more than 30%? That children aged 4-14 in the UK get 16-17% of their daily calories from processed sugars?That the World Health Organisation's recommended limit is 10%? That industrialised farming uses 50 times more energy than traditional farming?That livestock farming creates greater carbon emissions than all of global transport put together?That some salmon farmers dye their fish?That sugar could be as bad for you as tobacco?That you might have been better off eating butter rather than margarine all along?That industrial processing removes much of the nutritional value of the food it produces?That by changing our diets we could reduce cancers by a third?That corporations are shaping our bodies, our minds and the future of the planet? Eat Your Heat Out explains how big business took control of what we eat – and why so few of us even noticed. Crossing the globe in search of agribusiness's darkest secrets, Felicity Lawrence uncovers some startling facts and stomach-churning figures. Essential reading for anyone who cares about their health and our planet.",
  "genres": [
    "Food",
    "Nonfiction",
    "Environment",
    "Health",
    "Nutrition",
    "Politics",
    "Science"
  ],
  "author": "Felicity Lawrence",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3833419-eat-your-heart-out"
}