{
  "title": "Resistance: Reclaiming an American Tradition",
  "description": "\"Well-informed and witty...Biggers succeeds in showing how the long tradition of resistance movements continues today.\"--Publishers Weekly“These times are tumultuous and divisive. But Jeff Biggers, a gifted writer who approaches history as expansively as Howard Zinn and as passionately as Eduardo Galeano, finds resistance everywhere. He shows us how freedom movements—led by people of color, women, and commoners, from revolutionary-era rebels to today’s loud majority—have pulled American democracy away from tyranny and toward humanity time and again. These powerful, urgent essays remind us that everywhere there is resistance there is hope.” —Jeff Chang, author of We Gon’ Be Alright: Notes on Race and Resegregation“Reading this book, I saw history vanquish amnesia, David slay Goliath, and tenacity take down tyrants. I saw a long, unbroken chain of resistance extending back through centuries. I saw the world saved over and over. I saw heroes and declared them my ancestors. I heard stories to inspire bold action. I found traditions I want to pass on.” —Sandra Steingraber, activist and author of Living Downstream and Raising ElijahAcross cities, towns, and campuses, Americans are grappling with overwhelming challenges and the daily fallout from the most authoritarian White House policies in recent memory.In an inspiring narrative history, Jeff Biggers reframes today’s battles as a continuum of a vibrant American tradition. Resistance chronicles the courageous resistance movements that insured the benchmarks of our democracy—movements that served on the front lines of the American Revolution, the defense of the Constitution and Bill of Rights, the struggle to end slavery, the defeat of fascism during World War II, and various civil rights and environmental protection achievements.Legendary historian Studs Terkel praised Biggers’s The United States of Appalachia, now in its eighth printing, as a \"how-to book\" in the tradition of the American Revolution. With Resistance, Biggers opens a new window into American history and its meaning today. As an intimate people’s history, Resistance is a provocative reconsideration of the American Revolution and its unfolding promises, bringing alive early Native American, African American, and immigrant struggles, women’s rights, and pioneering environmental justice movements. Biggers shows our republic of resistance has served our history, especially in times when our nation—and its leaders—need to be held accountable.“With compelling and engaging prose, Jeff Biggers lays out the case for Resistance in the age of Trump. Using Common Sense, Thomas Paine’s incendiary call to overthrow the British, as the thread that binds his narrative, Biggers interweaves stories from before the American Revolution to the present to offer the reader a view of history not found in most high school textbooks. From the armed resistance of the Powhatan in 1622 to the protests of the Water Protectors against the Dakota Access Pipeline; from the speeches and essays of Maria Stewart, ‘the first Black feminist-abolitionist in America,’ to the words of Black Lives Matter founder Alicia Garza, he entreats us to remember that the constitution of our country is founded on the premise of ‘We the People.’ There are so many lessons to learn from Resistance: Reclaiming an American Tradition. Our turbulent times, Biggers shows us, have eerie and chilling parallels to the birth pangs of our nation and to the continuing struggles of ‘We the People’ to define and claim our voices. At this moment in history, when even the act of listening to the news can cause despair, Biggers gives us hope. In response to our darkness, he reaffirms the light that resistance offers. He shows us that the free expression of Resistance, whether with the pen, our marching feet, the taking of a knee before a football game, the words to a song—to name a few—remains a cornerstone of what it means to be American.” —Naomi Benaron, author of the Bellwether Prize–winning Running the Rift“Resist we must, resist we will—and as this volume powerfully reminds us, in so doing we are acting on the deepest American instincts.” —Bill McKibben, author of Radio Free Vermont: A Fable of Resistance",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Essays",
    "Social Justice"
  ],
  "author": "Jeff Biggers",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/38332654-resistance"
}