{
  "title": "The Devil Dog Trilogy: Out Of The Dark",
  "description": "A Reluctant Hero  Devil Dog – Book 1  Dick, AKA Devil Dog's world changes drastically when the EMP takes out the power grid. The loss of electricity brings out the darker side of human nature across the city. A homeless Marine veteran living in the abandoned tunnels beneath Chicago, he's far better prepared than most people. Good folk have survived, but they are often outnumbered and outgunned. Only the tunnels provide the safety he needs.  Devil Dog becomes the reluctant savior of women and children from the worst of the gangs that now rule topside. Doing the right thing makes him new enemies, driving him ever deeper into the tunnels that keep his charges safe – until he runs across a young woman who might be his daughter.  The Devil’s Road – Book 2  With the horrors of Chicago put down hard, Dick AKA Devil Dog, Jamie, Mel, Luis and Courtney head west, where they are hoping to reunite with family. There are only a few problems along the way... Only a few. Rabid Cannibals, hunted by psychotic raiders, and a town that's forcing a \"Tithe\" on travelers and a government gone wild... all before the main event...  If you like a good old fashioned \"Good Guys Vs. Bad Guys\" fast action, and a post-apocalyptic thriller, you're going to love the Devil Dog Saga.  The Devil’s Due – Book 3  Live like the dead, or sleep like the dead? Dick makes his choice...  Dick is finally clean--mind and body--from his poisonous addiction, only to be sent reeling again upon awakening and discovering Steve and Jamie have startling secrets of their own. It will take every ounce of focus and resolve to shake off his new reality and make a trek to Arkansas to reunite with his wife and daughter, especially with the other challenges he faces along the way. He thought he was ready to face the world anew until he realized the world was out to get him first. Devil Dog III is the ending to the action-packed prepper thriller trilogy, filled with real-life gut-wrenching decisions, and a twist so sharp it may snap your neck.  Proceed with caution!!!",
  "genres": [],
  "author": "Boyd Craven",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/38331792-the-devil-dog-trilogy"
}