{
  "title": "Robert Mugabe. Power, plunder and tyranny in Zimbabwe",
  "description": "Robert Mugabe was once hailed around the world as a revolutionary hero. After a fierce civil war against white minority rule in Rhodesia, he emerged as the new leader of Zimbabwe, embracing the cause of reconciliation and racial harmony. Hopes were high that Mugabe had the intelligence, political savvy and idealistic vision to overcome the legacy of war and forge ahead with economic and social development. As Western governments lined up with promises of aid, Zimbabwe at independence in 1980 seemed destined for an era of peace and prosperity.The honeymoon did not last long. Determined to gain total power through a one-party system, Mugabe unleashed a campaign of mass murder and terror against his political opponents in Matabeleland. Year by year, he acquired huge personal power, ruling the country through a vast system of patronage, favouring loyal aids and cronies with government positions and contracts and feeding the spreading blight of corruption. One by one, state corporations and funding organisations were plundered. It was as if Mugabe and his inner circle had come to regard Zimbabwe as merely a prize of war.Today Zimbabwe is a country beset by violence and lawlessness, regarded by the international community as a pariah state. Its economy is in tatters. Determined to stay in power, Mugabe has used armed gangs to crush political opposition, subverted the rule of law, undermined the judiciary, harassed the independent press and vilified the small white community.What happened in Zimbabwe? Now for the first time the whole story is told in detail. Martin Meredith has spent much of his life writing about Africa: first as a foreign correspondent for the London Observer and Sunday Times, then as a research fellow at St Anthony’s College, Oxford, and now as an independent author and commentator. His account of the last decade of white rule in Rhodesia, The Past is Another Country, was highly praised. Now, in Robert Mugabe, he pieces together the riveting and tragic political story of what happened to Zimbabwe and to a leader who once represented one of the world’s best hopes for a democratic Africa. It is essential reading for anyone wanting to understand today’s Africa.",
  "genres": [
    "Africa",
    "Biography",
    "History",
    "Nonfiction",
    "Zimbabwe",
    "Politics",
    "World History"
  ],
  "author": "Martin Meredith",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/12266690-robert-mugabe-power-plunder-and-tyranny-in-zimbabwe"
}