{
  "title": "Riding the Tiger: Twenty Years on the Road- Risks and Joys of Bringing Tibetan Buddhism to the West",
  "description": "\"My recipe is tell people the necessity of finding something which can carry them through sickness, aging, and death, and don't be afraid to give them a glimpse of your joy of life. Tell people that the mind is like open, clear and limitless, and talk about both the way and the goal.\" In 1969 Ole and Hannah Nydahl became the first Western students of H.H. the Karmapa, the head of the Kagyu tradition of Tibetan Buddhism. After years of practice in the Himalayas, he authorized them to teach and start centers in his name. An audience with the Queen of Denmark started their work in the West. A basement in historical Copenhagen became the first Tibetan Buddhist center on the European continent, and a rusted-through VW-bus with race-car qualities got them everywhere. Riding the Tiger is the inside story of the development of Tibetan Buddhism in the West. In his refreshingly unsentimental style, Lama Ole shows all aspects of the work. With breathtaking intensity, he highlights both healthy and unhealthy tendencies in the light of the Buddha's ultimate to bring about the fully developed beings whose every activity blesses the world. Amazon Jason Anderson from Monterey, \"Lama Ole Nydahl is a unique figure in modern Buddhist history--first Western student of the Black Hat lama, H.H. the XVIth Gyalwa Karmapa, married lama 'without robes, ' and spiritual figure personally chosen by the Karmapa to teach and make foundations in his name--and Riding the Tiger is filled to overflowing with his particular energies and gifts. It is a galloping book that takes the reader around the world, inviting him in for a close-up look at the making of a Buddhist center for meditation and study, and Lama Ole has successfully started over one hundred such centers. And a deep look, as well, at the nature of Buddhism in the West, how it has been transplanted, how it has flourished. ... This is a magical book and a magical ride!\"",
  "genres": [
    "Buddhism"
  ],
  "author": "Ole Nydahl",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/383345.Riding_the_Tiger"
}