{
  "title": "PARADOX: Super Indy",
  "description": "Comic book.Indy, certified yoga master in his 18 years of age, comes from a small town to study in the college the theory of magic. At the moment Indy is living with his girlfriend Allis, 26 in the house of her mother Tesha.Tesha, a pretty, attractive woman, had suffered an attack of unusual weakness and dizziness right when a part from “The Great Book of Yoga” was being read by Indy in his full voice. Tesha is a lady with modern and progressive views, is an employee of a scientifically oriented industrial plant. Her bravery and decisiveness was the reason someone named her the “Witch”.At the same a secret community, masking as a carrot farm, is looking for someone who possess a special sort of power they need. They suspect somebody, but they are not sure. Anyway, that person might be taken to a special facility for an examination. He should be taken, even if he does not want to go.If they are right, the community will have access to the tomorrow-direct-access-time-tunnel.At the same a radical militarized group (“Liberators”) is suffering from strange damage to its electronic spy system because of a brief visit by an unknown person. (Indy?)They must vacate a building in full secret to avoid possible detection. Right after they left the site, the building collapsed. That attracted the attention of TV team and all others to the event and mysterious renters, who managed to disappear at the last moment.And at the same Tesha, by chance, took pictures of “Liberators”. Those pictures should be recovered by visiting her house. The “liberator’s” action people can do that…And meanwhile, a college administration is worrying about disappearance of a college professor and is starting search actions. Mysteriously the professor has materialized the same day on a parking lot bench…unconscious…And meanwhile, Indy, the certified yoga master, while teaching yoga, discovered his power to rule machines (or that is look like this).And meanwhile, Tesha, in spite of being a very pretty woman is sad for some unpleasant circumstances in her she has not practiced love for about two years already. She became depressed about this until she met some young men who represented themselves as…angels.And more things happened…",
  "genres": [],
  "author": "Alex Letner",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/38339351-paradox"
}