{
  "title": "Las moscas y otros cuentos",
  "description": "Cáceres escribe para descifrar los miedos íntimos que definen nuestras vidas diarias. Este libro contiene historias marcadas por situaciones terroríficas, asuntos tétricos y oscuros. Un hombre cree equivocadamente que las moscas devoran a su vecino, mientras viajan por el ascensor. Un escritor consumido por su adicción al alcohol va de tumbo en tumbo en lo personal y profesional, mientras trata de cumplir con el compromiso de redactar una novela para pagar un dinero que recibió de sus patrocinadores. Dos torturadores conviven con fantasmas que no dejan de atormentarlos por el sufrimiento que causaron. Las moscas y otros cuentos muestra el quiebre entre los límites de lo físico y lo mental, entre la materia y el espíritu donde los personajes hallan sus fantasmas en sus propias perversiones. Una imaginación oscura y una prosa veloz, como una pantera negra. \"Las moscas y otros cuentos\" es un paseo por el infierno del que apenas sales vivo y con ganas de más. Santiago Roncagliolo. Este libro, representa una apuesta completa por el género que Cáceres remasteriza en un contexto nacional. Estas historias que asustan confirman que la literatura es un mecanismo para incitar la imaginación de quién lee y para enfrentarlo a sus temores. Fernando Balseca. Diario El Universo.Cáceres arriesga por una escritura que aborda temas complejos de la condición humana que remiten al mal, a la oscuridad, a lo siniestro, al sadomasoquismo, al terrorismo de Estado, empleando una unidad compositiva del proyecto narrativo que va acompañado, por un limpio y prolijo manejo del lenguaje. Veredicto del jurado del premio nacional de literatura Joaquín Gallegos Lara de Ecuador.Existe en estas narraciones un mecanismo superior, una especie de condena que persigue a los personajes y los atormenta hasta volverse tangible. Los personajes de Cáceres hallan sus fantasmas en sus propias perversiones. Abril Altamirano, Liberoamérica. Una de las figuras potentes de la literatura ecuatoriana actual. Miguel Molina Díaz. Diario El Universo.",
  "genres": [
    "Horror"
  ],
  "author": "Jorge Luis Cáceres",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/38348201-las-moscas-y-otros-cuentos"
}