{
  "title": "Hollywood Hulk Hogan",
  "description": "You think you know Hollywood Hulk Hogan? Brother, you don't know squat about me. Yeah, I'm the towering red-and-yellow warrior who revolutionized the wrestling business, the larger-than-life superhero who transformed an entire country into a horde of Hulkamaniacs. I'm the guy who spit blood and breathed fire to help create an empire called World Wrestling Entertainment. But it wasn't always like that. Once I was a fat kid named Terry Bollea watching legends like Dusty Rhodes and Superstar Billy Graham, never dreaming I'd be a professional wrestler myself one day. Run with me on the streets of Tampa, where a bass guitar became my salvation. Fight alongside me in the wrestling arenas of Japan, where opponents try to bite your fingers off to make a name for themselves. Slide into the ring with me against 700-pound Andre the Giant, who only became my best friend after he found out he couldn't beat me down. Then cruise L.A. with me and Sylvester Stallone on the heels of Rocky III. Learn why Minnesota Governor Jesse Ventura hates my guts. Go head-to-head with Dennis Rodman in a hard-liquor drinking contest, and share a dressing room with Liberace. Find out what makes me cry like a baby, what makes my blood boil, what I think of Jesus Christ, and what scares the living hell out of me. Then tell me you know the man called Hollywood Hulk Hogan. Join the Babe Ruth of wrestling on a gritty, no-holds-barred odyssey from his start in the barbaric wrestling arenas of the seventies through the heartbreak of potentially career-ending surgery to the achievement of his greatest triumph yet. Along the way, lock up with the likes of Cyndi Lauper, Andy Kaufman, Dolly Parton, Mr. T, Ted Turner, George Foreman, Jay Leno, Undertaker, Triple H, The Rock...and of course, Vince McMahon, head of World Wrestling Entertainment. They're all in here, waiting to show you what they've got. Hollywood Hulk Hogan. It's the real deal, brother.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Sports",
    "Autobiography",
    "Memoir",
    "History",
    "American"
  ],
  "author": "Hulk Hogan",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/12267668-hollywood-hulk-hogan"
}