{
  "title": "La scomparsa di Patò",
  "description": "Uno dei romanzi più divertenti e originali di Camilleri: in forma di dossier, attraverso una raccolta di documenti, rapporti, lettere, anche anonime, scritte murali, segue il filo di una scomparsa misteriosa. Per la prima volta nel catalogo Sellerio.Un tal Andrea Camilleri, sedicente «autore» vissuto nella seconda metà dell’Ottocento, ha ordinato dentro un faldone una sfilza di documenti (anche riservati) recuperati dagli archivi. Di lui possiamo dedurre solo che ha dei parenti a Vigàta, probabilmente tre figlie: le «tre gentili sorelle», Andreina, Elisabetta e Maria Carmela. E aggiungere che la sua erudizione lo fa pignolo quanto un filologo, fino ad arrivare a chiedere scusa ai lettori per avere inserito nel primo dei quattro classificatori del dossier l’articolo di un professore approssimativo e anche plagiario. La sistemazione cronologica dell’incartamento, che include pagine di giornali, lettere anonime, avvisi pubblici, scritte murali, informative di carabinieri e agenti di questura, planimetrie, verbali di interrogatori, estratti di consigli comunali e scambi epistolari, consente al quadro di composizione di darsi come cronaca in presa diretta; e inventarsi come romanzo giallo, grazie agli incastri delle carte e al governo investigativo. «Ma unni sinni ì Patò»; «murì o s’ammucciò»: è morto, o si è nascosto? È questo il busillis, su cui tutti si interrogano nel romanzo; mentre dalle pagine del giornale antigovernativo di Palermo le «Autorità inquirenti» vengono invitate a non limitare le indagini alle «vicende di un ragioniere oscuramente scomparso», ma di estenderle «alla carica che quel ragioniere rivestiva e all’opera bancaria da lui svolta in obbedienza agli ordini del politico consanguineo che a quel posto l’aveva voluto». La «faccenda» può risultare «merdosa». Il ragioniere Antonio Patò è scomparso a Vigàta nel marzo del 1890, mentre recitava la parte di Giuda sul palco di una sacra rappresentazione del Venerdì Santo. È stato inghiottito da una botola della macchina scenica, senza che lasciasse traccia di sé. È stato rapito? L’hanno ammazzato? Vaga per le campagne, smemorato? Le ipotesi sono tante.Camilleri, in questo spassoso romanzo (pubblicato dalla Mondadori nel 2000), si è dato un doppio ottocentesco; al quale ha delegato la messa in opera di un virtuoso romanzo di apocrifi, che è uno dei suoi capolavori. (Salvatore Silvano Nigro)",
  "genres": [
    "Fiction",
    "Crime",
    "Mystery",
    "Thriller",
    "Italian Literature",
    "Historical Romance",
    "Historical Fiction"
  ],
  "author": "Andrea Camilleri",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/38348343-la-scomparsa-di-pat"
}