{
  "title": "In the Hurricane's Eye: The Genius of George Washington and the Victory at Yorktown",
  "description": "The thrilling story of the Revolutionary War finale from the New York Times bestselling author of In the Heart of the Sea and Valiant Ambition.Here is the story of the remarkable year leading up to the siege of Yorktown. It sets Washington against his traitorous nemesis Benedict Arnold and places him in impossible situations and constant acrimonious negotiation with his French allies, along with his young protégé, the Marquis de Lafayette and his energetic general Nathanael Greene. In a narrative that moves from the ship-crowded waters off Newport, Rhode Island, to a wooded hillside near North Carolina's Guilford Courthouse, to the Dutch storehouses on the Caribbean island of St. Eustatius, Philbrick narrates the pivotal naval battle that brought the end of America's long, elusive path to independence. It was an improbable triumph made possible by Washington's brilliant strategy, leadership, and revolutionary use of sea power.In the Hurricane's Eye opens in the fall of 1780. For five years, American and British forces had clashed along the edge of a vast continent and were now at a stalemate. The Royal Navy, with its fleet of powerful warships (just one of which mounted more cannons than possessed by the entire rebel army), could attack the rebels' seaside cities at will. The Rebels could just fall back inland and wait. Neither side could inflict the killing blow. As Washington knew better than anyone, only the French navy could break Britain's stranglehold on the eastern seaboard and thus ensure an American victory.In the Battle of the Chesapeake (1781 - called the most important naval engagement in the history of the world), a French admiral foiled British attempts to rescue the army led by General Cornwallis. By making the subsequent victory at Yorktown a virtual inevitability, this naval battle--masterminded by Washington but waged without a single American ship--was largely responsible for the independence of the United States. A riveting and wide-ranging narrative, full of dramatic, unexpected turns, In the Hurricane's Eye reveals that the fate of the American Revolution depended, in the end, on Washington and the sea.",
  "genres": [
    "History",
    "Nonfiction",
    "American Revolution",
    "American History",
    "War",
    "American Revolutionary War",
    "Biography"
  ],
  "author": "Nathaniel Philbrick",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/38363272-in-the-hurricane-s-eye"
}