{
  "title": "This Ain't Lolita: An Erotic Story of Me and My Step Daddy, Part 1",
  "description": "Jessica wants to sleep with her Daddy and there's nothing she won't do to make it happen.The summer before going off to college she realizes that more than anyone, she desperately loves (and wants to please) her step-father. She teases and taunts him, getting more and more daring each day, until finally she gets what she needs.And then some.Sometimes sweet, sometimes silly, and always hot, This Ain't Lolita explores the forbidden passion been a young woman and the man who raised her. This is a work of erotic fiction for mature adults. It is about 15,000 words or 50 pages long.\"Why were you crying this afternoon?\" he finally asked. I still had my legs over his lap and his arm was around me.\"Cause I slept with a boy I don't really like all that much.\" I don't know why I went with the truth, but so it goes. I blame the wine.\"Oh,\" was all he said.\"You probably think I'm a slut,\" I told him, as I rested my head against his shoulder. \"A gross slut.\"\"Was it terrible?\"\"No.\"We had a long moment of silence and once again I wasn't sure how much he wanted to know or how much I was willing to tell him. He brushed my hair with his fingers absentmindedly, and we both reached down and had another sip of our wine. Just what we needed.\"How come you slept with him if you don't really like him?\"That was the first question he asked that I really didn't want to answer, but somehow it slipped out. Just like that I said the words I could never take back and everything changed.\"Because he called me Babygirl.\"I thought he was going to push me off his lap or stand up and storm out. I thought he might move or try to say something funny so he could pretend he didn't hear me. Instead he was silent. He didn't move his arm and I didn't move a muscle. I kept my head on his shoulder and he ran his fingers through my hair.\"Babygirl,\" he whispered quietly.\"Yes Daddy?\" I asked looking up at him...",
  "genres": [],
  "author": "Sock Drawer Press",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/12267943-this-ain-t-lolita"
}