{
  "title": "Aloha Rodeo: Three Hawaiian Cowboys, the World's Greatest Rodeo, and a Hidden History of the American West",
  "description": "In the spirit of The Boys in the Boat comes the captivating true story of the Hawaiian cowboys who changed rodeo and the West forever. In August 1908, three unknown riders arrived in Cheyenne, Wyoming, their hats adorned with wildflowers, to compete in the world’s greatest rodeo. They had travelled 3,000 miles from Hawaii, where their ancestors had herded cattle for generations, to test themselves against the toughest riders in the West. Dismissed by whites, who considered themselves the only true cowboys, the Hawaiians left the heartland as champions—and American legends.David Wolman and Julian Smith’s Aloha Rodeo unspools a fascinating and little-known tale, blending rough-knuckled frontier drama with a rousing underdog narrative. Tracing the life story of steer-roping virtuoso Ikua Purdy and his cousins Jack Low and Archie Ka’au’a, the writers delve into the dual histories of ranching in the islands and the meteoric rise and sudden fall of Cheyenne, “Holy City of the Cow.” At the turn of the century, larger-than-life personalities like “Buffalo Bill” Cody and Theodore Roosevelt capitalized on a national obsession with the Wild West, and helped transform Cheyenne’s annual Frontier Days celebration into an unparalleled rodeo spectacle, the “Daddy of ‘em All.”A great deal rode on the Hawaiians’ shoulders during those dusty days in August. Just a decade earlier, the overthrow of Hawaii’s monarchy and forced annexation by the U.S. had traumatized an independent nation whose traditions dated back centuries. Journeying to the mainland for the first time, the young riders brought with them the pride of a people struggling to preserve their cultural identity and anxious about their future under the rule of overlords an ocean away.In Cheyenne, the Hawaiians didn’t just show their mastery of riding and roping, skills that white Americans thought they owned. They also overturned simplistic thinking about the “Wild West,” cowboys-versus-Indians, and the very concept of cattle country. Blending sport and history, while exploring questions of identity, imperialism, and race, Aloha Rodeo brings to light an overlooked and riveting chapter in the saga of the American West.Includes maps and 25 pages of black-and-white photos.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Sports",
    "Westerns",
    "Historical",
    "American History"
  ],
  "author": "David Wolman",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/38376054-aloha-rodeo"
}