{
  "title": "The Witches Are Coming",
  "description": "In this wickedly funny cultural critique, the author of the critically acclaimed memoir and Hulu series Shrill exposes misogyny in the #MeToo era.THIS IS A WITCH HUNT.WE’RE WITCHES,AND WE’RE HUNTING YOU. From the moment powerful men started falling to the #MeToo movement, the lamentations began: this is feminism gone too far, this is injustice, this is a witch hunt. In The Witches Are Coming, firebrand author of the New York Times bestselling memoir and now critically acclaimed Hulu TV series Shrill, Lindy West, turns that refrain on its head. You think this is a witch hunt? Fine. You’ve got one.In a laugh-out-loud, incisive cultural critique, West extolls the world-changing magic of truth, urging readers to reckon with dark lies in the heart of the American mythos, and unpacking the complicated, and sometimes tragic, politics of not being a white man in the twenty-first century. She tracks the misogyny and propaganda hidden (or not so hidden) in the media she and her peers devoured growing up, a buffet of distortions, delusions, prejudice, and outright bullsh*t that has allowed white male mediocrity to maintain a death grip on American culture and politics-and that delivered us to this precarious, disorienting moment in history.West writes, “We were just a hair’s breadth from electing America’s first female president to succeed America’s first black president. We weren’t done, but we were doing it. And then, true to form—like the Balrog’s whip catching Gandalf by his little gray bootie, like the husband in a Lifetime movie hissing, ‘If I can’t have you, no one can’—white American voters shoved an incompetent, racist con man into the White House.”We cannot understand how we got here-how the land of the free became Trump’s America—without examining the chasm between who we are and who we think we are, without fact—checking the stories we tell ourselves about ourselves and each other. The truth can transform us; there is witchcraft in it. Lindy West turns on the light.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Audiobook",
    "Politics",
    "Humor",
    "Memoir"
  ],
  "author": "Lindy West",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/38362811-the-witches-are-coming"
}