{
  "title": "Silent Terror: A Journey into Contemporary African Slavery",
  "description": "Silent Terror is the disturbing story of a black American's journey into the horrors of modern-day slavery in Africa. The author's odyssey takes him from New York to the Islamic Republic of Mauritania, where he comes face to face with the Arab-Berbers' centuries-old practice of enslaving black Africans. Samuel Cotton's research exposes this heinous practice while documenting and analyzing the hatred that the Arab minority holds for blacks, both slave and free, in a country where everyone is Muslim.Cotton takes the reader into the life of oppressed Africans and provides critical insights into the use of religion and language to successfully enslave blacks. He also shows the process by which Arab masters produce docile slaves. The narratives he recorded from those who escaped reveal the horrible truth of slave life, the despair and humiliation, and the slaves' capacity for hope and courage. Interviews with former slaves who have become abolitionist leaders show the path from bondage to freedom and offer the hope that this grim practice will one day be a relic of the past. Silent Terror examines why African nations have been silent on this subject and the role that neocolonialism plays in continuing an unspeakable practice.This book is also a personal narrative. The author shares the impact of coming to grips with his African past and identity and his internal and external struggles to bring the issue of slavery to the American public. He sheds light on the growth of a modern-day abolitionist movement aimed at destroying the remaining strongholds of slavery and details the difficulty of getting the Black Muslim community to confront the idea of slavery in the Islamic world and to get black people in general to deal with this painful reality.",
  "genres": [
    "Africa",
    "History",
    "Nonfiction"
  ],
  "author": "Samuel Cotton",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/383683.Silent_Terror"
}