{
  "title": "Tadaima! I Am Home",
  "description": "Tadaima! I Am Home unearths the five-generation history of a family that migrated from Hiroshima to Honolulu but never settled. In the telling, the common Japanese greeting \"tadaima!\" takes on a perplexing meaning. What is home? Where most immigrants either establish roots in a new place or return to their place of origin, the Miwa family became transnational. With one foot in Japan, the other in America, they attempted to build lives in both countries. In the process, they faced the challenges of internment, a civilian prisoner exchange, the atomic bomb, and the loss of their holdings on both sides of the Pacific.The story begins and ends with the fifth-generation figure, Stephen Miwa of Honolulu, who is trying to get to the bottom of a shadowed reference to his family name: \"The Miwas are unlucky.\" Tom Coffman's research tracks back to the founding sojourner, Marujiro, a fallen samurai, and to the sons of subsequent generations--Senkichi, a field laborer turned storekeeper; James Seigo, a merchant prince; Lawrence Fumio, a heroically struggling \"foreign\" student; and, finally, the contemporary Stephen, whose nagging questions drive him to excavate his enigmatic past. Among the book's unusual finds, the most extraordinary is the fourteen-year-old Fumio's student diary, which he maintained in Hiroshima from July 4, 1945, through his survival of atomic bombing and into the following autumn.The Miwas climbed from poverty to wealth, and then fell precipitously from wealth into poverty. The most recent generations have regrouped by dint of intense determination and devotion to education, exercised against the strange transformation of Japanese Americans from despised \"other\" to model minority. Throughout, this resilient family has kept an outwardly facing cheerfulness, giving no clues as to what they have been through.Tadaima! I Am Home confronts history from a largely unexplored transnational viewpoint, suggesting new ways of looking and seeing. Although it does not explicitly beg the question of internal security in the present, it poses new perspectives on immigration, acculturation, commitment to nation, and the marginalization of distrusted minorities.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Tom Coffman",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/38364194-tadaima-i-am-home"
}