{
  "title": "The Infinite Game",
  "description": "Do you know how to play the game you're in?  In finite games, like football or chess, the players are known, the rules are fixed, and the endpoint is clear. The winners and losers are easily identified.In infinite games, like business or politics or life itself, the players come and go, the rules are changeable, and there is no defined endpoint. There are no winners or losers in an infinite game; there is only ahead and behind.The more I started to understand the difference between finite and infinite games, the more I began to see infinite games all around us. I started to see that many of the struggles that organizations face exist simply because their leaders were playing with a finite mindset in an infinite game. These organizations tend to lag behind in innovation, discretionary effort, morale and ultimately performance.The leaders who embrace an infinite mindset, in stark contrast, build stronger, more innovative, more inspiring organizations. Their people trust each other and their leaders. They have the resilience to thrive in an ever-changing world, while their competitors fall by the wayside. Ultimately, they are the ones who lead the rest of us into the future.Any worthwhile undertaking starts with Why - the purpose, cause or belief that inspires us to do what we do and inspires others to join us. Good leaders know how to build Circles of Safety that promote trust and cooperation throughout their organizations. But that's not enough to help us chart a course through the unpredictable, often chaotic landscape of today's marketplace.I now believe that the ability to adopt an infinite mindset is a prerequisite for any leader who aspires to leave their organization in better shape than they found it.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Self Help",
    "Audiobook",
    "Personal Development",
    "Psychology"
  ],
  "author": "Simon Sinek",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/38390751-the-infinite-game"
}