{
  "title": "Shadow Star",
  "description": "In Shadow Moon and Shadow Dawn, George Lucas, creator of Star Wars, and Chris Claremont, author of the bestselling X-Men adventures, created a new world of myth, magic, and legend unlike any before. Now they bring their epic trilogy to an unforgettable conclusion in a novel of blazing imaginative brilliance...Elora Danan has done the unthinkable. She has slain the dragons that were the embodiment of the soul of Creation. It was a desperate act--the only way to save the dragons from the Deceiver, who would have used them to rule the Realms. Yet in Elora's possession are two last dragon eggs. To protect them, Elora spellbinds herself to her faithful companions Thorn Drumheller, the Nelwyn sorcerer and her sworn guardian, and Khory Bannefin, the long-dead woman warrior whose body is inhabited by a demon's offspring. It is a dire spell that ensures none of them will betray their cause...even at the cost of their lives. And if one of them dies, the magic of the eggs is lost forever.Pursued through a land of shadow predators by the dreaded Black Rose, the Deceiver's commando assassins, Elora and her allies must reach the free city-state of Sandeni. There they will be reunited with old friends: the brownies Franjean and Rool, the eagles Anele and Bastian, and the young warrior-scribe Luc-Jon. But Sandeni is besieged by mighty armies fueled by the Deceiver's sorcery, warrior wizards, and engines of evil magic. With defeat all but certain, Elora must convince the Sandeni people to continue the fight. What she doesn't tell them is that the greatest enemy lies within her. For the Deceiver is her own dark twin from a potential future of unimaginable evil...an evil that lies dormant in Elora's soul. And the only way Elora can stop the future is to befriend an enemy whose insatiable appetite for destruction could destroy all of Creation. Or is that, too, part of the Deceiver's plan?Seamlessly weaving together the many strands of this rich tapestry, Shadow Star is guaranteed to satisfy its many fans...and leave them breathless.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Epic Fantasy",
    "High Fantasy",
    "Adventure",
    "Dragons"
  ],
  "author": "Chris Claremont",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/383921.Shadow_Star"
}