{
  "title": "The Sacred Blood",
  "description": "Secrets, miracles, prophecies, and the threat of Armageddon intertwine in this riveting sequel to the international bestseller \"The Sacred Bones\"When American geneticist Charlotte Hennesey examined what she believed were the bones of Jesus, the Vatican tried to stop word of her discovery from spreading. Now her proof has vanished.But the bones were just the beginning. In her tests, Charlotte discovers that the DNA extracted from the bones contains miraculous powers. Dying from cancer, the determined scientist uses herself as a human guinea pig to astonishing results. When she injects herself with this miracle DNA, the bone cancer that is slowly killing her doesn't just go into remission, it vanishes completely. It seems the DNA has the ability to repair damaged genes, to heal the sick, to cure incurable diseases. And much to her surprise, Charlotte discovers that now she possesses these very powers.But someone wants those bones--and Charlotte. Rabbi Aaron Cohen--a descendent of the biblical Aaron and the high priests of the long-destroyed Temple in Jerusalem--foresees a time when Jerusalem's Temple Mount is cleared of the Dome of the Rock and the al-Aqsa Mosque and replaced with the Third Temple. And for Cohen, that time is now. Cohen's family has been the guardian of the Ark of the Covenant for many years and he is ready to retrieve the Ark from its hiding place and bring it back to Jerusalem to unleash its awesome power. He has only one problem--he cannot touch the Ark because his bloodline isn't pure. Charlotte, her blood now purified by Jesus Christ's own DNA, is kidnapped and brought to Israel in order to open the Ark.Cohen's dangerous plan doesn't go unnoticed, however. When Israeli archaeologist Amit Mizrachi--digging in the Qumran cave area where the Dead Sea Scrolls were discovered in 1947--uncovers a mysterious Egyptian hieroglyph in a hidden and previously undiscovered room, he brings in noted Egyptologist Julie LeRoux to interpret it for him. Their romantically charged sparring leads them on a quest to unravel the mystery, and when the bullets start to fly, they know they are onto something huge.As Cohen puts his plan into action, the Muslim keepers of the mosques on Temple Mount are outraged. Will this be the act that leads to vast armies meeting on the hills of the town named Megiddo causing a global Armageddon?",
  "genres": [
    "Thriller",
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Religion",
    "Mystery Thriller",
    "Action"
  ],
  "author": "Michael Byrnes",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/3839564-the-sacred-blood"
}