{
  "title": "Visions : How Science Will Revolutionize the 21st Century and Beyond",
  "description": "In Visions, physicist and author Michio Kaku examines the great scientific revolutions that have dramatically reshaped the twentieth century--the quantum mechanics, biogenetics, and artificial intelligence--and shows how they will change and alter science and the way we live.The next century will witness more far-reaching scientific revolutions, as we make the transition from unraveling the secrets of nature to becoming masters of nature. We will no longer be passive bystanders to the dance of the universe, but will become creative choreographers of matter, life, and intelligence.The first section of Visions presents a shocking look at a cyber-world infiltrated by millions of tiny intelligence systems. Part two illustrates how the decoding of DNA's genetic structure will allow humans the \"godlike ability to manipulate life almost at will.\" Finally, VISIONS focuses on the future of quantum physics, in which physicists will perfect new ways to manipulate matter and harness the cosmic energy of the universe.What makes Michio Kaku's vision of the science of the future so compelling--and so different from the mere forecasts of most thinkers--is that it is based on the groundbreaking research taking place in labs today, as well as the consensus of over 150 of Kaku's scientific colleagues. Science, for all its breathtaking change, evolves slowly; we can accurately predict, asserts Kaku, what the direction of science will be, based on the paths that are being forged today.A thrilling, unique narrative that brings together the thinking of many of the world's most accomplished scientists to explore the world of the future, Visions is science writing at its best.From the Trade Paperback edition.",
  "genres": [
    "Science",
    "Nonfiction",
    "Physics",
    "Technology",
    "Futurism",
    "Philosophy",
    "Popular Science"
  ],
  "author": "Michio Kaku",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/38395.Visions_"
}