{
  "title": "The Viper Contract: A High Tech Aviation Thriller",
  "description": "Several years after a bitter retirement from the Air Force, former fighter pilot Colin Pearce has found a second career: flying Gulfstream and Falcon business jets as a daily contractor. Between the constant travel and his extensive Single-Malt Scotch collection, he manages to keep the demons of has past where they belong. It’s a lucrative, solitary existence and that’s the way he likes it. But then he takes a phone call while making a connection in the Atlanta airport and his life changes forever. The call leads Pearce to a dark corner of a nearby hotel bar, where he finds himself across a table from two CIA operations officers – one of whom looks oddly familiar. Over the last year, they’ve been following the activities of a mercenary F-16 unit which has been conducting bombing raids all over the world. Now, thanks to an informant on the inside, they have solid intelligence on an upcoming strike that could have devastating global consequences. But their informant has gone silent and they need Pearce’s help. Pearce flatly refuses and tells them, “…where all this service to country shit is concerned, my ‘give-a-damn’ has been flat out busted.”Then, they tell Pearce the one thing he wasn’t prepared to hear. Their informant was Burt Magnusson, Pearce’s Air Force Academy roommate and close friend. Before he went missing, Magnusson added Pearce’s name to the unit’s “talent pool” of possible replacements. Now the unit needs a new pilot and the CIA needs someone to stop them. Colin Pearce, a former F-16 instructor with no family ties, seems to be the perfect candidate. But that’s not the only reason the CIA wants him. They also know enough about Pearce’s dark side to be confident he’ll do what must be done. Reluctantly, Pearce goes in and immediately finds himself in a desperate race against time as he frantically tries to thwart the unit’s destructive intentions as the day of the fateful strike rapidly approaches. In the midst of this struggle, Pearce must cope with the competing romantic attentions of the unit’s seductive commander and its voluptuous flight doctor, while simultaneously trying to evade an anonymous assassin who seems intent that Pearce doesn’t leave the island alive. Pearce has lived his life by a single creed: “I’d rather be lucky than good.” With lottery-like odds against his survival, he’s going to have to be very lucky indeed.",
  "genres": [
    "Aviation"
  ],
  "author": "Chris Broyhill",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/12268316-the-viper-contract"
}