{
  "title": "Ruth Bader Ginsburg: A Life",
  "description": "The first full life—private, public, legal, philosophical—of the 107th Supreme Court Justice, one of the most profound and profoundly transformative legal minds of our time; a book fifteen years in work, written with the cooperation of Ruth Bader Ginsburg herself and based on many interviews with the justice, her husband, her children, her friends, and her associates.In this large, comprehensive, revelatory biography, Jane De Hart explores the central experiences that crucially shaped Ginsburg’s passion for justice, her advocacy for gender equality, her meticulous her desire to make We the People more united and our union more perfect. At the heart of her story and abiding beliefs—her Jewish background. Tikkun olam , the Hebrew injunction to “repair the world,” with its profound meaning for a young girl who grew up during the Holocaust and World War II. We see the influence of her mother, Celia Amster Bader, whose intellect inspired her daughter’s feminism, insisting that Ruth become independent, as she witnessed her mother coping with terminal cervical cancer (Celia died the day before Ruth, at seventeen, graduated from high school).     From Ruth’s days as a baton twirler at Brooklyn’s James Madison High School, to Cornell University, Harvard and Columbia Law Schools (first in her class), to being a law professor at Rutgers University (one of the few women in the field and fighting pay discrimination), hiding her second pregnancy so as not to risk losing her job; founding the Women's Rights Law Reporter , writing the brief for the first case that persuaded the Supreme Court to strike down a sex-discriminatory state law, then at Columbia (the law school’s first tenured female professor); becoming the director of the women’s rights project of the ACLU, persuading the Supreme Court in a series of decisions to ban laws that denied women full citizenship status with men.     Her years on the U.S. Court of Appeals for the District of Columbia Circuit, deciding cases the way she played golf, as she, left-handed, played with right-handed clubs—aiming left, swinging right, hitting down the middle. Her years on the Supreme Court . . .      A pioneering life and legal career whose profound mark on American jurisprudence, on American society, on our American character and spirit, will reverberate deep into the twenty-first century and beyond.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Politics",
    "Feminism",
    "Biography Memoir",
    "Memoir"
  ],
  "author": "Jane Sherron De Hart",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/38395059-ruth-bader-ginsburg"
}