{
  "title": "Scotland: The Autobiography: 2,000 Years of Scottish History by Those Who Saw it Happen",
  "description": "Now in a revised edition with extra material and a new introduction for 2014.'In a year which will see the Scots vote on independence, this book is a timely reminder of their country's fascinating past' Independent'History caught on the hoof and the wing by those who were actually there - a brilliant selection' Andrew MarrA vivid, wide-ranging and engrossing account of Scotland's history, composed of eye-witness accounts by those who experienced it first-hand. Contributors range from Tacitus, Mary Queen of Scots and Oliver Cromwell to Adam Smith, David Livingstone and Billy Connolly.These include key historic moments - ranging from Bannockburn and Flodden to the SNP parliamentary victory in 2007 - along with a vast array of wonderfully readable insights into the everyday life of Scotland through the millennia. This is living, accesible history told by crofters, criminals, servants, house-wives, poets, journalists, nurses, politicians, novelists, prisoners, comedians, sportsmen and many more.'An unqualified triumph, superb, a real page-turner . . . what a stirring, dramatic, poignant story it has been' Alexander McCall Smith, Spectator'Fascinating and very valuable. Goring gives us vivid snapshots of Scottish life and history from Neolithic times . . . should find a place in every Scottish home' Allan Massie, ScotsmanRosemary Goring took a degree in Economics and Social History at St Andrews University. She started her career in publishing in the role of in-house editor for Chambers Biographical Dictionary and has since edited and written for many reference books, among them the Larousse Dictionaries of Writers and Literary Characters. She was Literary Editor of Scotland on Sunday for several years before becoming Literary Editor of the Herald.",
  "genres": [
    "History",
    "Scotland",
    "Nonfiction",
    "Historical",
    "European History",
    "Biography",
    "Travel"
  ],
  "author": "Rosemary Goring",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/12268402-scotland"
}