{
  "title": "The Perfectionist: Life and Death in Haute Cuisine",
  "description": "An unforgettable portrait of France's legendary chef, and the sophisticated, unforgiving world of French gastronomyBernard Loiseau was one of only twenty-five French chefs to hold Europe's highest culinary award, three stars in the Michelin Red Guide, and only the second chef to be personally awarded the Legion of Honor by a head of state. Despite such triumphs, he shocked the culinary world by taking his own life in February 2003. The GaultMillau guidebook had recently dropped its ratings of Loiseau's restaurant, and rumors swirled that he was on the verge of losing a Michelin star (a prediction that proved to be inaccurate).Journalist Rudolph Chelminski, who befriended Loiseau three decades ago and followed his rise to the pinnacle of French restaurateurs, now gives us a rare tour of this hallowed culinary realm. The Perfectionist is the story of a daydreaming teenager who worked his way up from complete obscurity to owning three famous restaurants in Paris and rebuilding La Côte d'Or, transforming a century-old inn and restaurant that had lost all of its Michelin stars into a luxurious destination restaurant and hotel. He started a line of culinary products with his name on them, appeared regularly on television and in the press, and had a beautiful, intelligent wife and three young children he adored - Bernard Loiseau seemed to have it all.An unvarnished glimpse inside an echelon filled with competition, culture wars, and impossibly high standards, The Perfectionist vividly depicts a man whose energy and enthusiasm won the hearts of staff and clientele, while self-doubt and cut-throat critics took their toll.",
  "genres": [
    "Food",
    "Biography",
    "Nonfiction",
    "Cooking",
    "France",
    "Biography Memoir",
    "Food Writing"
  ],
  "author": "Rudolph Chelminski",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/384298.The_Perfectionist"
}