{
  "title": "Past Lives, Future Bodies",
  "description": "In her debut short collection, poet Kristin Chang bursts onto the page and into our consciousness like a dazzling, dizzying uproar: \"I suck / until my teeth riot / with rot & I have nothing / left in my mouth to keep / quiet.\" Quiet Chang's speakers are not. In these nineteen poems, the body is personal and communal, hunter and hunted: \"My mother says / women who sleep with women / are redundant: the body symmetrical / to its crime. Between your knees / I mistake need for belief / in a father figure: once, we renamed / our fathers by burning them / out of our bodies, smoking the sky / into meat.\" PAST LIVES, FUTURE BODIES is a knife-sharp and nimble examination of migration, motherhood, and the malignant legacies of racism. In this collection, family forms both a unit of survival and a framework for history, agency, and recovery. Chang undertakes a visceral exploration of the historical and unfolding paths of lineage and what it means to haunt body and country. These poems traverse not only the circularity of trauma but the promise of regeneration—what grows from violence and hatches from healing—as Chang embodies each of her ghosts and invites the specter to speak. \"Kristin Chang wields the line break like a sword cutting through dimensions of reality and language. Each break offers another surprise gut-punch or gutting grace on the other side as these fiercely sharp poems turn and turn, Chang never faltering to rise to the occasion of these blood-filled verses. Chang, quite simply, can write her ass off. I read these poems and I feel like I'm discovering poetry all over again. Chang makes a spell rise from every wound, and I'm caught all the way up in this magic. Kristin Chang is one of the best emerging writers out there, and this chapbook is one step into a career we will all be transformed by. PAST LIVES, FUTURE BODIES couldn't be a better way to be introduced to your new favorite poet. It's Kristin's world, thank God we're reading in it.\"—Danez Smith \"Kristin Chang's PAST LIVES, FUTURE BODIES is full of mouths swallowing food, language, home, memory, and bodily desires to finally arrive at explosive demonstrations of what happens when the unspeakable is uttered and shouted. Each poem shows the process of turning a painful reflection on history, sexuality, race, family, and nation into a prismatic object of beauty. We are lucky to witness Chang's use of silence as a productive narrative frame.\"—Emily Jungmin Yoon \"In PAST LIVES, FUTURE BODIES, Kristin Chang's knotty examination into the complexities of intergenerational relationships, we come to understand the fraught nature of both the known and the unknown. These meditations on family, pain, and the ways we communicate untangle the threads of what it means to love those who have hurt us. Chang writes, 'Every language has different / words for the same want,' and the poems in this collection stunningly reveal those words and leave us wanting for more.\"—Eloisa Amezcua",
  "genres": [
    "Poetry",
    "Queer",
    "LGBT",
    "Race",
    "Cultural",
    "Contemporary"
  ],
  "author": "Kristin Chang",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/38463627-past-lives-future-bodies"
}