{
  "title": "War is Fun",
  "description": "Somalia, 21st Century. Pirates have made a comeback and are ruthlessly capturing any ship they can throw their hook in. Captain Phillips and the MV Maersk Alabama, sailors, merchants and fishermen are helpless. Politicians all around the world send in their navies in support, to no avail. In Norway, a recently returned veteran from the Afghanistan War finds trouble in adjusting to everyday life, but doesn't find redemption and peace in a pacified society that rejects a soldier's plight as something ancient, used and forgotten. The veteran travels to England to team up with modern-day mercenaries, and soon finds himself in the midst of new war. The fight has been taken from the sea - to the mainland of Somalia. As he tries to re-learn what it was that made him turn his back to society, he meets the woman of his life, and a new purpose in the Heart of Darkness that is Africa. Some thought mercenaries in Africa was a thing of the past. That died out in '60s and '70s. This is a novel about the new breed of mercenaries - still fighting, shedding their pasts and refusing to let go of the tribalistic and instinctual claw of war. They belong to a generation that had no great war, only video games, hot showers and pizza delivered at your door in 30 minutes. Yet they refuse to let go of war. Because War is Fun.The Norwegian novel was first published in Norway in 2013 to critical acclaim, and was bought in by the State Culture Board for Quality Literature by Norwegian libraries.Link to Publishing House: http://www.kagge.no/index.cfm?tmpl=bu... “The honesty about a soldiers emotions and motivation is eye opening, and it is a shame that we haven’t had access to it before.” – RISS (literary magazine) “The book gives deep credibility to an insight of veterans and structural criticism. There is a nerve and closeness that will teach, shock and explain you.” – VG (Norway’s biggest newspaper) “War is Fun is a crazy description of a young mans experiences with war. (…) That in itself is a pretty exciting reading experience.” – Stavanger Evening“This is a book that will shock and fascinate you. You should read it because it will expand your horizons, correct your naivety and challenge your prejudices.” – The One I Have Read (book blog)",
  "genres": [],
  "author": "Kamal Anwar",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/38470817-war-is-fun"
}