{
  "title": "Book of the Just",
  "description": "After centuries of searching, Mouse now has everything she’s ever wanted within her reach—a normal life, a lover, a brother. What will she risk to keep them?Cherished by a Father, coveted by a king, loved by an almost-priest; tormented by demons, tortured by a madman, hunted by a cult, hounded by her father. Mouse has survived it all. But then, she was never just a girl.Despite Mouse’s power, her father always wanted a son—and now, at long last, he has him. And Mouse has a brother, someone else in the world just like her. Though she’s never met him, the hope of what they might mean for each other tugs at her soul, even as it terrifies her lover, Angelo.Hiding among a tribe of the Martu in the isolation of the Australian outback near the edges of Lake Disappointment, Mouse and Angelo have seemingly evaded at least one of the predators hunting them. Carefully dropping bogus breadcrumbs across Europe, they misdirect the Novus Rishi, a ruthless cult that wants Mouse as the ultimate weapon in their battle against evil. But when unnerving dreams start to plague Angelo, and the ancient beings of the Martu’s Dreaming send prophetic warnings that include visions of Mouse at her father’s side, the two lovers realize it’s time to act. With nowhere left to run, Mouse and Angelo prepare for a last showdown with their enemies. As they chase after legendary ancient weapons ensconced in the ages old battle between good and evil, Mouse and Angelo must each decide if a final victory is worth the cost.Book of the Just continues Mouse’s story after The Devil’s Bible and completes the journey she started so long ago in Bohemian Gospel . Imbued with a rich sense of history, magic, and mythology, this explosive final installment in Mouse’s journey will keep you captivated until the very end.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Paranormal",
    "Mystery",
    "Fiction",
    "Supernatural",
    "Audiobook"
  ],
  "author": "Dana Chamblee Carpenter",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/38471796-book-of-the-just"
}