{
  "title": "His Alpha: Curving Straight Lines",
  "description": "If the moon made me this way, then why does it feel like a curse? He is the Alpha, and I am his Beta. It's time for me to bend straight - there are some lines I must not cross. But every time I see him, the lines curve, gnawing into my soul. This is our destiny, yet nobody can know that the Moon has both blessed and cursed us with this forbidden love. A hidden, dark fire. It was our secret. A secret we denied - a secret too dark to share. We don't bend that way. I left. I had to escape the torture, the heartache. I lived among humans. I studied them. I found myself. Or, should I say, The Professor discovered me. They can never know that a human male seduced me, or that I loved him - it means certain death for both of us. He taught me everything I know, made me the wolf I am today. But even that love was not enough. I return to my territory. Leaving the sophisticated freedom of the city for the stifling traditionalism of my pack - a place where my soul, my desire, my love, must be locked away and hidden. This ache is my one true companion, never leaving my side. Perhaps the pain never ends, but I must go on. I'm not the runt I once was. My body is lean, muscled, and powerful now. I see my transformation in their eyes. I see it in his eyes. He may be my Alpha, but he will come to me. The moon may have cursed us both, and our path may be full of torture, pain, and lines so curved that we get lost, but I have no choice. He has no choice. It is time for me to bend straight for the pack, but in my soul, I know my lines are curved and undulating, and that they all lead to him; my rightful mate. My cursed mate, one that fate demands and that our society forbids. I don't know how to go on...",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Shapeshifters",
    "Werewolves",
    "Fantasy",
    "Romance",
    "Queer"
  ],
  "author": "Rachelle Mills",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/38470377-his-alpha"
}