{
  "title": "A Call to Vengeance",
  "description": "Book three in the nationally best-selling Manticore Ascendant series, a prequel series to David Weber's multiple New York Times best-selling Honor Harrington series. Sequel to A Call to Duty and A Call to Arms.  After the disastrous attack on the Manticoran home system by forces unknown, the Royal Manticoran Navy stands on the brink of collapse. A shadowy enemy with the resources to hurl warships across hundreds of light years seeks to conquer the Star Kingdom for reasons unknown, while forces from within Manticore’s own government seek to discredit and weaken the Navy for reasons very much known: their own political gain.  It’s up to officers like Travis Long and Lisa Donnelly to defend the Star Kingdom and the Royal Manticoran Navy from these threats, but the challenge is greater than any they have faced before. Weakened but not defeated, the mercenary forces and their mysterious employer could return at any time, and the anti-Navy faction within Parliament is growing. The situation becomes even more dire when fresh tragedy strikes the Star Kingdom.  While the House of Winton faces their enemies at home, Travis, Lisa, and the other officers of the Royal Manticoran Navy must reunite with old friends and join new allies to hunt down and eliminate the forces arrayed against them in a galaxy-spanning conspiracy.  Manticore has learned that the universe is not a safe place, but the Star Kingdom’s enemies are about to learn it's dangerous to mess with the Manticore!  At the publisher's request, this title is sold without DRM (Digital Rights Management).  With over eight million copies of his books in print and thirty titles on the New York Times bestseller list, David Weber is the science fiction publishing phenomenon of the new millennium. In the hugely popular Honor Harrington series, the spirit of C.S. Forester’s Horatio Hornblower and Patrick O’Brian’s Master and Commander lives on—into the galactic future. Books in the Honor Harrington and Honorverse series have appeared on fourteen best-seller lists, including those of The Wall Street Journal, The New York Times, and USA Today. While Weber is best known for his spirited, modern-minded space operas, he is also the creator of the Oath of Swords fantasy series and the Dahak saga. Weber has also engaged in a steady stream of bestselling collaborations including his Starfire series with Steve White, which produced the New York Times bestseller The Shiva Option among others. Weber’s collaboration with alternate history master Eric Flint led to the bestselling 1634: The Baltic War, and his planetary adventure novels with military science fiction ace and multiple national best-seller John Ringo includes the blockbusters March to the Stars and We Few. Weber’s collaboration with Linda Evans and Joelle Presby produced the bestselling Multiverse series. David Weber makes his home in South Carolina with his wife and children.  Timothy Zahn is a Hugo award winner and author of the #1 New York Times best seller Heir to the Empire. Born in Chicago, Zahn earned a B.S. in physics from Michigan State University and an M.S. in physics from the University of Illinois. He sold his first story to Analog magazine in 1978 and immediately attracted attention as a new writer of science fiction based on real, cutting-edge science. Other Zahn works include the Conqueror and Dragonback series. His books for Baen include his popular Cobra SF adventure series, with latest entry Cobra Traitor, and now the Manticore Ascendant series, cowritten with David Weber and Thomas Pope.  Thomas Pope is a founder of BuNine, a collection of professionals assisting David Weber in defining and documenting the Honorverse.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Military Fiction",
    "Military Science Fiction",
    "Audiobook",
    "Science Fiction Fantasy"
  ],
  "author": "David Weber",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/38467806-a-call-to-vengeance"
}