{
  "title": "Juan Luna's Revolver",
  "description": "The poems in Juan Luna's Revolver both address history and attempt to transcend it through their exploration of the complexity of diaspora. Attending to the legacy of colonial and postcolonial encounters, Luisa A. Igloria has crafted poems that create links of sympathetic human understanding, even as they revisit difficult histories and pose necessary questions about place, power, displacement, nostalgia, beauty, and human resilience in conditions of alienation and duress.Igloria traces journeys made by Filipinos in the global diaspora that began since the encounter with European and American colonial power. Her poems allude to historical figures such as the Filipino painter Juan Luna and the novelist and national hero José Rizal, as well as the eleven hundred indigenous Filipinos brought to serve as live exhibits in the 1904 Missouri World’s Fair. The image of the revolver fired by Juan Luna reverberates throughout the collection, raising to high relief how separation and exile have shaped concepts of identity, nationality, and possibility.     Suffused with gorgeous imagery and nuanced emotion, Igloria’s poetry achieves an intimacy fostered by gem-like phrases set within a politically-charged context speaking both to the personal and the collective. \"In \nJuan Luna's Revolver\n, Luisa Igloria establishes herself as a singular and revelatory voice in American poetry. Here, she explores the dichotomy of Filipino: interwoven yet hermetically singular, acquisitive yet inventive, docile yet amok. Her engrossing poems hide, behind their gorgeous scrims, a bristling wall of spears.\" —Sabina Murray, author of Forgery, A Carnivore's Inquiry, and The Caprices “When I read a Luisa Igloria poem, a bright enchanted light falls over my being. Juan Luna’s Revolver is Igloria’s best work to date. These poems never let us forget they are wrought from an immigrant's love for family, country, and the history of the reinvented self.” —Virgil Suarez, author of 90 Miles  \" 'What a world to have lived in, to have arrived in,' Luisa Igloria writes early on in this brilliant collection that explores colonization and cultural displacement, and how the artist must live in the aftermath of both. Even when she writes about places many miles away, Igloria constructs a luminous portrait of what is utterly human and ultimately familiar. These poems reveal a poet devoted to the truth of her craft.\" —Honorée Fanonne Jeffers, author of Outlandish Blues and Red Clay Suite “In sure and compelling measures, with richly textured turns, and attending to the mystery of matter, Luisa Igloria’s poems offer a powerfully tangible world, and a world within, and a world beyond.” —Scott Cairns, author of Compass of Affection: Poems New and Selected",
  "genres": [
    "Poetry"
  ],
  "author": "Luisa A. Igloria",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/3846799-juan-luna-s-revolver"
}