{
  "title": "Early Novels & Stories: Go Tell It on the Mountain / Giovanni’s Room / Another Country / Going to Meet the Man",
  "description": "“The civil rights struggle,” said The New York Times Book Review, “found eloquent expression in [Baldwin’s] novels. His historical importance is indisputable.” Here, in a Library of America volume edited by Nobel laureate Toni Morrison, is the fiction that established James Baldwin’s reputation as a writer who fused unblinking realism and rare verbal eloquence.His first novel, Go Tell It on the Mountain (1953), tells the story, rooted in Baldwin’s own experience, of a preacher’s son coming of age in 1930’s Harlem. Ten years in the writing, its exploration of religious, sexual, and generational conflicts was described by Baldwin as “an attempt to exorcise something, to find out what happened to my father, what happened to all of us.”Giovanni’s Room (1956) is a searching, and in its day controversial, treatment of the tragic self-delusions of a young American expatriate at war with his own homosexuality. Another Country (1962), a wide-ranging exploration of America’s racial and sexual boundaries, depicts the suicide of a gifted jazz musician and its ripple effect on those who knew him. Complex in structure and turbulent in mood, it is in many ways Baldwin’s most ambitious novel.Going to Meet the Man (1965) collects Baldwin’s short fiction, including the masterful “Sonny’s Blues,” the unforgettable portrait of a jazz musician struggling with drug addiction in which Baldwin came closest to defining his goal as a writer: “For, while the tale of how we suffer, and how we are delighted, and how we may triumph is never new, it must be heard. There isn’t any other tale to tell, it’s the only light we’ve got in all this darkness.”",
  "genres": [
    "Fiction",
    "Short Stories",
    "Literature",
    "Classics",
    "Novels",
    "African American Literature",
    "African American"
  ],
  "author": "James Baldwin",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/38456.Early_Novels_Stories"
}