{
  "title": "The Skeptics' Guide to the Universe: How to Know What's Really Real in a World Increasingly Full of Fake",
  "description": "An all-encompassing guide to skeptical thinking in the popular \"The Skeptics Guide to the Universe\" podcast's dryly humorous, accessible style.It's intimidating to realize that we live in a world overflowing with misinformation, bias, myths, deception, and flawed knowledge. There really are no ultimate authority figures-no one has the secret and there is no place to look up the definitive answers to our questions (not even Google). But, by thinking skeptically and logically, we can combat sloppy reasoning, bad arguments and superstitious thinking. It's difficult, and takes a lot of vigilance, but it's worth the effort.In this tie-in to their incredibly popular \"The Skeptics Guide to the Universe\" podcast, Steven Novella, MD along with \"Skeptical Rogues\" Bob Novella, Cara Santa Maria, Jay Novella, and Evan Bernstein will explain the tenets of skeptical thinking and debunk some of the biggest scientific myths, fallacies and conspiracy theories (Anti-vaccines, homeopathy, UFO sightings, etc.) They'll help us try to make sense of what seems like an increasingly crazy world using powerful tools like science and philosophy. THE SKEPTICS' GUIDE TO THE UNIVERSE is your guide through this maze of modern life. It covers essential critical thinking skills, as well as giving insight into how your brain works and how to avoid common pitfalls in thinking. They discuss the difference between science and pseudoscience, how to recognize common science news tropes, how to discuss conspiracy theories with that crazy coworker of yours, and how to apply all of this to everyday life.So, are you ready to join them on an epic scientific quest, one that has taken us from huddling in dark caves to stepping foot on the Moon? (Yes, we really did that.) Like all adventures, this one is foremost a journey of self discovery. The monsters you will slay and challenges you will face are mostly constructs of your own mind. With the SKEPTIC'S GUIDE TO THE UNIVERSE, we can do this together.",
  "genres": [
    "Science",
    "Nonfiction",
    "Philosophy",
    "Psychology",
    "Skepticism",
    "Audiobook",
    "Self Help"
  ],
  "author": "Steven Novella",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/38485991-the-skeptics-guide-to-the-universe"
}