{
  "title": "Once Upon A Quest",
  "description": "Fifteen brand new fairytale twists from the bestselling and award-winning authors who brought you Once Upon A Curse and Once Upon A Kiss! With inspirations ranging from The Ugly Duckling to Snow White, and everything in between (including trips to Camelot and Oz), these fabulous tales are full of adventure, magic, and a touch of romance.  WEST OF THE MOON by Annie Bellet When her twin brother sacrifices his freedom to save their starving family, Lina embarks on a quest through a magical forest to save him and restore their fortunes.  A BELL IN THE NIGHT by Evelyn Snow For Stevie Silver, waking the beautiful boy in the glass box is only the beginning, as her mysterious past catches up with her.  MISTRESS BOOTSI by Anthea Sharp A girl sets out to seek her fortune - and luckily, she has a clever cat for a companion…  WHITE ROSE by Phaedra Weldon Jack Frost must find his true love and save her from the Snow Queen’s icy shards before he loses her - and his chance at humanity - forever.  THE GOBLIN AND THE TREASURE by Alethea Kontis Out-of-work soldier Kira Kobold is handpicked by the High Wizard Zelwynn to go on a quest. Her companions? A growly ogress, a surly dwarf, a dimwitted troll, and an overly optimistic goblin. This wasn’t exactly the quest she was looking for…  THE RUINS OF OZ by Alexia Purdy The Land of Oz was the last place Thea thought she’d find herself after falling through her mother’s enchanted mirror. If the stories she’s been told are real, why is the Emerald City in ruins?  A TOUCH OF GOLD by Rachel Morgan When Tilly helps two strangers escape from danger, she becomes part of their quest to keep a powerful magical ability out of the wrong hands ...  MAGIC AND MACHINERY by Jamie Ferguson Maude works with machinery, not magic. Can she find a way to escape the magician’s grasp and free her beloved brother?  BLOW YOUR HOUSE DOWN by Nikki Jefford In a brave new world, three wizards journey through wild shifter territories to find somewhere to begin anew.  BANE AND BALM by Jenna Elizabeth Johnson When the stream providing healing water to Claire’s sick aunt dries up, she must venture into the dreaded Dorcha Forest, where she discovers a stranger willing to risk his freedom in order to help her on her quest.  CAT WHITE by Kay McSpadden He thought he was following the music, but a white cat led him to realize life held more adventure than he’d guessed.  KING ARTHUR AND THE CHALICE OF LIFE by Julia Crane Camelot may be at peace, but betrayal and death lurk within the mists surrounding it.  FEAR OF FALLING by Shawntelle Madison Cast from her griffin’s nest, Ireti is forced into the cruel world of the ground-walkers below. Before she can fly, Ireti must find the strength to walk, and the key to acceptance lies in an undiscovered place—between two worlds.  THE MERROW’S GOLDEN RING by Sara C. Roethle Ailios was taught to never believe a promise from one of the Faie, but that doesn’t stop her from doing it anyway.  TAKE MY MONSTERS by C. Gockel In the wilds of the barbarian north, Roman slave Margusa meets a warrior enchanted and enslaved by an Elf Queen. To set him free, Margusa must first confront the monsters within herself...",
  "genres": [
    "Fantasy",
    "Anthologies",
    "Fairy Tales",
    "Retellings",
    "Fairy Tale Retellings"
  ],
  "author": "Annie Bellet",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/38473095-once-upon-a-quest"
}