{
  "title": "Lucky Number",
  "description": "Hello? Wrong number… What happens when you accidentally text a sexy photo of yourself to your favorite hockey player?  Las Vegas Kingsnakes superfan Hannah Hendrix never planned on her sexy photos ending up in the hands of a complete stranger. But she never planned to walk in on her boyfriend with another woman, either. Or for her mom to get sick. The only bright spots in her life are her upcoming college graduation and her fast-growing video blogging channel, Pretty Paper Planning with Hannah. And of course, her first love-hockey.  Hockey superstar Brandon Lear is drowning in drama. A divorce from his drug addicted ex-wife has left him the sole caregiver of his two little girls. Trying to juggle being a single father and the grind of another long hockey season has left him exhausted and stressed. So when photos of a woman clad in nothing but glasses and sexy lingerie land on his phone after a tough road game, it's a welcome distraction. He likes what he sees, but quickly discovers he likes talking to the mystery woman who sent the photos even more.  When Hannah learns that the man on the other end of the phone in possession of her sexy pictures is *the* Brandon Lear, her favorite hockey player of all time, she's completely mortified-until she learns that her attraction might not be as one-sided as she originally thought. But Brandon's determined to keep Hannah strictly in the friend-zone. Despite their sizzling chemistry and his growing desire to get his hands all over her delicious curves, pulling the sweet college co-ed into his chaotic life right now just doesn't seem like a smart decision.  Her crush on the charming, tattooed forward heats up along with their budding friendship, and Brandon soon finds himself breaking his own rules when it comes to Hannah-giving in to temptation at every turn.  Will dating her favorite hockey player play out just like Hannah's always dreamed? Or are some dreams never meant to come true?",
  "genres": [
    "Hockey",
    "Sports",
    "College",
    "Contemporary",
    "Sports Romance",
    "Romance"
  ],
  "author": "Jennifer Lazaris",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/38484343-lucky-number"
}