{
  "title": "Rebel Dragon",
  "description": "Can this rebel dragon learn to play by the rules when his destined mate’s life is at stake?Off to Maui for a relaxing vacation? Surfer Jenna Monroe can only wish. Instead, she’s on the run from a stalker who lusts after her blood. She’d rather comb the beach for lost treasures than venture any deeper into the terrifying world of shapeshifters. There, even the good guys are hard to trust — except for the hot-blooded rebel she can’t get out of her head.Connor Hoving and his band of Special Forces shifters were planning to leave trouble behind by moving to Maui, but destiny has other ideas. His whole future — and that of his brothers — depends on acing his new job as head of security at an exclusive seaside estate. But Connor can barely get his inner dragon to focus with alluring, off-limits Jenna around. Can this rebel dragon learn to play by the rules when his fated mate’s life is at stake?The closer Connor and Jenna become, the higher forbidden passions blaze. The more they give in to simmering desire, the more impossible love seems. And the more secrets they uncover, the closer their enemies creep. Vampires and ruthless dragons lurk in the shadows, and it’s impossible to tell whose side fate will take. Only one thing is certain: great heroes don’t get to pick their destinies — only the choices they make.Maui just got hotter with this exciting new series of steamy, suspenseful paranormal romance! ALOHA SHIFTERS: PEARLS OF DESIRE is a series of sizzling paranormal romances with adult content. This series spins off from Aloha Shifters: Jewels of the Heart. It’s fun to read each series in order, but any of the books can be read as standalone title in its own right. Just be warned: hot alpha shifters, ruthless enemies, and unveiled desires ahead!  No cliff hangers. Each story is a page-turner packed with action, emotion, and romance! If you like Magnum, PI and smoldering hot, alpha shapeshifters, you'll love these books! Each includes strong heroines, alpha heroes, werewolves and shapeshifters, billionaires, military romance, paranormal suspense, action-adventure romance, fantasy romance, and exotic, tropical locales!",
  "genres": [
    "Dragons",
    "Paranormal",
    "Fantasy",
    "Shapeshifters",
    "Romance",
    "Paranormal Romance",
    "Supernatural"
  ],
  "author": "Anna Lowe",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/38481952-rebel-dragon"
}