{
  "title": "Beautiful Wasps Having Sex",
  "description": "\"Producers are like feudal lords exercising droit du seigneur; they all want to have first crack at a promising virgin script. And like the poor young maiden, once a producer gets hold of a script, spreads its pages, and tosses it aside, it's never as valuable again.\" Speaking from experience is bruised, inveterate screenwriter Frankie Jordan, who spares nothing and no one in her razor-sharp vivisection of Hollywood -- a town with rituals, ceremonies, and sacrifices as strange as any savage culture. Not that the rest of Frankie's life is any less perilous. She's turning forty, her husband wants a divorce, men aren't noticing her anymore, and all she can think about is the script she can't finish. Along comes Jonathan Prince, a confident, Ivy League twenty-four-year-old agent trainee in butter-soft loafers who glides into Frankie's messy life. In a town that takes glee in the failure of others, Jonathan becomes her biggest fan, the only one who seems to recognize her brilliance. The lunacy of trying to sell her script is described in harrowing detail and perfect-pitch dialogue. But it's when her script finally does sell that the real nightmare begins. Frankie's career starts its painful descent as Jonathan's takes off, leaving Frankie completely unprepared for his cunning betrayal. Trying to discover why Hollywood attracts and rewards so many \"little monsters,\" she's compelled to confront how Jews feel about themselves in a town that both loves and hates its own invention -- the beautiful WASP. Frankie ultimately comes to understand the forces that created Hollywood, Jonathan Prince, and herself. Biting, smart, and uncompromising, Dori Carter's Beautiful WASPs Having Sex is as truthful as any novel written about Hollywood, a modern classic that will stand beside The Player and What Makes Sammy Run as a revealing window on the madness behind the movies.",
  "genres": [
    "Fiction"
  ],
  "author": "Dori Carter",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/1227142.Beautiful_Wasps_Having_Sex"
}