{
  "title": "First Lessons",
  "description": "A brilliant Medical school graduate Aliya, a sporty and active girl, dies suddenly in a car crash… only to find herself reborn in a completely different body, in the middle of a dilapidated castle during Medieval times. While confused and dismayed, Aliya realizes she has been given another chance at life — so she rolls up her sleeves and gets to work on restoring her new castle and her new life. Aliya has an unusual and difficult goal: reborn as Countess Lilian; she must learn to adjust to an unfamiliar world while trying to introduce the daily conveniences from her familiar modern world. She needs to take care of the collapsing estate of Irton and its inhabitants while living in the past as a disenfranchised woman. Regular robbers and slave-holders attacks won’t let her live in peace, killers and spies are just waiting for her to show a bit of weakness so that they can strike. On the horizon, there is a prospect of meeting with her perpetually absent husband, whom by the way, after her rebirth as Countess Lilian, Aliya has never even seen.“First Lessons” is the opening book of the series “Medieval Tale” by Lina J. Potter. The heroine finds herself only at the beginning of a thorny path to progress and happiness. She makes her first steps, building a defense for herself, her new friends, and her rapidly developing business empire — and this is no piece of cake for sure. Despite everything, she has to still go up against the unprogressive and sexist society of the Medieval Ages, with only her knowledge, science, experience, and strong will on her side. Still, Lilian has to act carefully in order not to draw too much attention to her innovations — she knows she could be praised for her genius, or conversely, accused of witchcraft. Aliya-turned-Countess Lilian gets acquainted and communicates easily with everyone from noble people, peasants, artisans, notorious pirates, proud traders of the East, and even with members of the royal family... but will she be able to bring peace to her own family?Her plan is to make the best of her unusual circumstances to make the world better. She is not a girl in trouble, waiting for a prince in shining armor — she strives to achieve everything herself. Will Lilian forge her own “happy-ever-after?” And if so, at what cost?",
  "genres": [
    "Fantasy",
    "Time Travel",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Romance",
    "Medieval"
  ],
  "author": "Lina J. Potter",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/38490718-first-lessons"
}