{
  "title": "Women of the Raj: The Mothers, Wives, and Daughters of the British Empire in India",
  "description": "In the nineteenth century, at the height of colonialism, the British ruled India under a government known as the Raj. British men and women left their homes and traveled to this mysterious, beautiful country–where they attempted to replicate their own society. In this fascinating portrait, Margaret MacMillan examines the hidden lives of the women who supported their husbands’ conquests–and in turn supported the Raj, often behind the scenes and out of the history books. Enduring heartbreaking separations from their families, these women had no choice but to adapt to their strange new home, where they were treated with incredible deference by the natives but found little that was familiar. The women of the Raj learned to cope with the harsh Indian climate and ward off endemic diseases; they were forced to make their own entertainment–through games, balls, and theatrics–and quickly learned to abide by the deeply ingrained Anglo-Indian love of hierarchy.Weaving interviews, letters, and memoirs with a stunning selection of illustrations, MacMillan presents a vivid cultural and social history of the daughters, sisters, mothers, and wives of the men at the center of a daring imperialist experiment–and reveals India in all its richness and vitality.“A marvellous book . . . [ Women of the Raj ] successfully [re-creates] a vanished world that continues to hold a fascination long after the sun has set on the British empire.”–The Globe and Mail“MacMillan has that essential quality of the historian, a narrative gift.”–The Daily Telegraph“MacMillan is a superb writer who can bring history to life.”–The Philadelphia Inquirer“Well researched and thoroughly enjoyable.”–Evening Standard",
  "genres": [
    "History",
    "Nonfiction",
    "India",
    "Asia",
    "Historical",
    "Womens",
    "Biography"
  ],
  "author": "Margaret MacMillan",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/1227215.Women_of_the_Raj"
}