{
  "title": "The Dove",
  "description": "Book 2 of 2 in the Villain Duology, a Dark Regency Erotic Romance duet set in the wilds of Scotland.  A quest for vengeance…  Lord Adam Callahan, Earl of Hartmoor has spent the past five years destroying the Fairchild family as recompense for the ruination of his sister. Yet, it never seemed like enough … until the family’s only daughter appeared on his doorstep searching for answers. In her, he found the perfect tool for his final revenge. His plan had been simple—coerce Lady Daphne Fairchild into an illicit affair and ruin her.  An unexpected obsession… After thirty days and nights in his bed, Adam sends Daphne back to London a fallen woman, the final blow that will see the Fairchild family scorned by society. However, he is hard-pressed to forget the beauty of her submission, or the brief moments of peace and balance she brought his tortured existence. Despite the bad blood between their families, he is determined to possess her, to stake his claim on her beyond the thirty nights she gave him. She will fight him at every turn … which will only make the chase, and her inevitable surrender, all the better.  A choice between love and retribution… When the consequences of Adam’s deeds begin to fall back on not only him, but Daphne, as well, he is forced to bring her under his protection. He will end this feud between his family and hers once and for all, and is determined to put her behind him when all is said and done. Yet, it becomes increasingly clear that setting her aside will not be as simple as he thought. Her heart could be his for the taking, but only if he will abandon his vendetta against her family once and for all. Will Adam choose a lifetime of peace and love with Daphne … or will the need for revenge consume him, and eventually, destroy him?",
  "genres": [
    "Historical Romance",
    "Historical",
    "Dark",
    "BDSM",
    "Romance",
    "Dark Romance",
    "Erotica"
  ],
  "author": "Victoria  Vale",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/38496032-the-dove"
}