{
  "title": "El paradigma de la perversión",
  "description": "Valeria se ve obligada a entrar al mundo de los vivos ―al que no pertenece, porque ella se siente más a gusto en la morgue destripando cadáveres que persiguiendo a sus asesinos. En busca de la reconciliación con su madre, que la tuvo en internados desde los ocho años de edad, se convierte en inquilina de su casa de huéspedes en la colonia Roma, y entra a trabajar a la policía judicial del Distrito Federal. La obligada convivencia con un manojo de machos retrógradas y albureros, con Xavier ―el enigmático inquilino de 27 años, por quien entra en competición con su progenitora―, el encuentro con Amaranta, un travesti bien dotado que le hace perder la cabeza, y la incansable búsqueda del hermano que fue secuestrado al nacer y de cuya existencia ella ni siquiera sabía, la hunden en un torbellino febril donde el principal objetivo es atrapar al llamado \"Matameretrices\" de La Merced antes de que estrangule a otra prostituta....Una inspectora que conversa con las moscas, otro que sentó las bases del crimen organizado al servicio del Estado en la época del Negro Durazo. Una ninfómana psicótica, que usurpa la identidad de divas cinematográficas. Un nazi que decide vaciar los archivos de su memoria y presentar pruebas de que ¡Hitler era judío! Un estrangulador desalmado que es liberado en Viena por méritos literarios, sirve de contrapunto a un asesino serial mexicano devoto y considerado, que redime a las putas y las presenta como si fueran santas. Un pintor misterioso que decide inmortalizarlas mientras traduce la autobiografía de Jack Unterweger, “el poeta de la muerte”. Un travesti apuñalado que atestigua que los crímenes del gobierno son legítimos y revocables. Una legión de abusadores que, en nombre de Cristo y ocultos en las enaguas del santo Papa, forman una red de pedofilia mundial. Personajes intricados, perversos o atormentados dan vida a un mundo surrealista, carnavalesco y absurdo, pero terriblemente humano, donde la pobreza nacional y la corrupción del gobierno son el menor de los males; el verdadero meollo del asunto son los traumas infantiles, la falta de identidad y la injusticia divina.CRÍMENES A LA MEXICANA I es la primera entrega de una novela policíaca, donde la ficción se acerca peligrosamente a la verdad, para desenmascarar hechos que ocurrieron en México en una época donde el que estaba sentado en la silla presidencial había cometido su primer asesinato a los cuatro años. Sigue las peripecias de la psicóloga e investigadora de homicidios Valeria Cardoso, quien logra demostrar que en México la perversión es un paradigma y que es el único lugar donde ser un \"hijo de la chingada\" puede afirmarse con orgullo",
  "genres": [],
  "author": "Nancy Almazán",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/38494383-el-paradigma-de-la-perversi-n"
}