{
  "title": "Primal Heat",
  "description": "\"Moonlust\" by Sherri L King Series: Moonlust #1During Brianna's trip to the Ural Mountains of Russia, a life-threatening accident places her at the mercy of a strange, reclusive man. A man whose secrets and unquenchable hunger will change her life forever... \"Pack Law\" by Lorie O'Clare Series: Lunewulf, #1 Pack law states every female shall have three mates. It's a necessary action in order to keep the lunewulf breed alive. Sophie Rousseau has just learned who her three mates will be. And one of them is the sexy Nik Alexander who has invaded her dreams since high school. Though Sophie's nervous about fulfilling pack law, she can't wait to mate with Nik. Nik has lusted after Sophie, wanted her for his mate and mother of his children. He gets his way, but by pack law, Sophie cannot be his alone. Nik will share her with two other werewolves. But only on his terms. \"Running Mate\" by Jaci Burton Series: Devlin Dynast, #1 Senator Jason Devlin is a man with a secret. A big one that could ruin his political career and his family. He guards his secret closely, allowing no outsiders to penetrate his intimate circle. Kelsey Harper is a reporter itching for an interview with the elusive senator. When a case of mistaken identity lands her in his bed, she gets much more than an interview.  \"Wolfe's Hope\" by Lora Leigh Series: Wolf Breeds , #2Hope believed Wolfe was dead, but he was only waiting for the right time to claim her. He is a man whose DNA was altered, infused with the genetic code of the wolf. His unique genetic makeup has created a male unlike any other and will make itself known in the most surprising ways. Now Hope must convince her mate she hasn't betrayed him, and they must defeat the plans of a scientist gone mad.",
  "genres": [
    "Paranormal",
    "Romance",
    "Anthologies",
    "Paranormal Romance",
    "Erotica",
    "Erotic Romance",
    "Shapeshifters"
  ],
  "author": "Lora Leigh",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/3852.Primal_Heat"
}