{
  "title": "Midnight Quill Trio: Three Historical Romances",
  "description": "Three linked historical romances that will touch your heart and make you laugh, cry, and fall in love…Join a desperate young countess, an enterprising spinster, and a penniless widow as they fall in love and learn to experience pleasure for the very first time.This trio of sensual and deeply emotional stories includes one daring rescue, one scandalous secret, one extremely awkward wedding night, one gentle giant, two battle-scarred officers, a darkly gothic manor house, and some of the worst food in England.The Midnight Quill Trio by award-winning and USA Today bestselling author Emily Larkin consists of two novellas and one full-length The Countess’s Groom, The Spinster’s Secret, and The Baronet’s Bride.If you love richly detailed historical romances brimming with passion, emotion, and compelling characters, then this collection is for you! One novel and two novellas totaling 104,000 wordsSensuality These historical romances contain steamy love scenesThe Countess’s Groom (a novella)Rose, the young Countess Malmstoke, is trapped in a violent marriage. Escape seems impossible—until her horse groom, Will Fenmore, steps forward to help her.The Spinster’s Secret (a novel)Matilda Chapple is penniless, orphaned, and dependent on her uncle’s grim charity, but she’s finally found a way to she’ll write her way to financial freedom! Her secret is safe—until battle-scarred Waterloo veteran, Captain Edward Kane, agrees to uncover the anonymous author’s identity.The Baronet’s Bride (a novella)Sir Gareth Locke lost an arm at Waterloo. He’s in love with his new bride, Cecily, but he’s dreading their wedding night. He knows it will be an clumsy, awkward, and mortifying. But Cecily and Gareth are about to have a wedding night that neither of them expects...",
  "genres": [
    "Romance"
  ],
  "author": "Emily Larkin",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/38514473-midnight-quill-trio"
}