{
  "title": "Người tình",
  "description": "Người tình là một tiều thuyết dạng hồi ký của nữ nhà văn Pháp Marguerite Duras. Từ cuộc đời thơ ấu của mình, bà tái hiện lại bối cảnh đầy bi kịch của người Pháp trên đất thuộc địa Đông Dương một thuở.… là một cô gái đẹp, có một sức sống cuồng nhiệt tỏa ra từ sức quyến rũ lạ kỳ. Theo cha sang tham chiến ở Việt Nam với những giấc mộng xa hoa, cả gia đình cô đã sớm mang nỗi thất vọng câm lặng. Nỗi thất vọng đó trở thành vũng lầy khi cha cô chết và người mẹ đau khổ của cô trở nên điên loạn trong mọi cư xử thường nhật, cũng như trong nỗ lực bám trụ vùng thuộc địa. Cuộc sống gia đình là một địa ngục, nơi cô thậm chí không dám vùng vẫy thoát ra vì biết nếu những người thân còn hơi thở, thì sự khốn khổ của họ còn phả phất khôn nguôi trong tâm trí của cô.Đối diện với cái chết, đói khát, tuyệt vọng, những linh hồn bị đọa đày, bệnh hoạn, cô gái trẻ 15 tuổi rưỡi đã ngột thở trong nỗi đau đầy ám ảnh. Một trí tuệ hơn người càng khiến cho sự ám ảnh đó bóp chặt trái tim non trẻ, đưa cô đến những tâm tưởng vượt qua thời thiếu nữ, những suy nghĩ khinh nạm trong bất lực, những mơ ước bị chôn vùi. Và khi gặp người đàn ông gốc Hoa trên bến phà Cửu Long đó, cô tức khắc hiểu được con đường duy nhất giải thoát linh hồn bằng bản năng thơ dại. Đó là một người tình. Tất cả chuyện yêu đương của họ nằm trong vòng tình dục. Tình dục lôi họ ra khỏi nỗi đau thực tại, xóa bỏ tất cả sợ hãi, khơi dậy mọi mặc cảm để rồi nhấn chìm nó trong niềm kiêu hãnh của thể xác…Cuộc tình đó có số phận hòa lẫn vào số phận cô gái trẻ. Và cũng như cái thực tại mong manh, vô vọng, cuộc tình của họ đã biết một ngày mai không hứa hẹn. Vết thương chia ly đó hàng chục năm sau cũng không lành. Người tình là tột cùng đau khổ của những số phận trong tác phẩm, nhưng cũng chính là chấm điểm hạnh phúc nhỏ nhoi duy nhất mà, bám vào đó, họ biết mình còn tồn tại.",
  "genres": [
    "Fiction",
    "France",
    "Romance",
    "French Literature",
    "Historical Fiction",
    "Literature",
    "Novels"
  ],
  "author": "Marguerite Duras",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/12272952-ng-i-t-nh"
}