{
  "title": "Undying",
  "description": "BRINGER OF DEATH…  Orishok is the last of his kind — a valo shaped by the Creators to embody death. He’s stood vigil over his people for centuries, watching them fade away, one by one succumbing to the entropic energies they hold inside. With his slightest touch unwillingly bringing death to all living things, he has remained isolated in his people’s city, his heart as empty as the buildings around him…until a pale, slight female arrives and shakes the foundations of his world.  GIVER OF LIFE…  Quinn Dalton lost everything when she was convicted of murder — her sister, her niece, her budding career — but it isn’t until she’s transferred to an interstellar penitentiary that she realizes her very life is no longer her own. Her existence aboard the Concord is a nightmare, broken only when the station is torn through a wormhole and crash lands on an alien world. After waking up alone and bloodied, but somehow unharmed, she seeks shelter in an abandoned city — where she discovers an ancient, wondrous mystery. Can she survive alongside a being whose touch means death? ------------------------------------------------- Warning: This book contains foul language, explicit sexual content, and violence and is intended for mature readers only. ------------------------------------------------- The Valos of Sonhadra series is the shared vision of nine sci-fi and fantasy romance authors. Each book is a standalone, containing its own Happy Ever After, and can be read in any order. For more books in the Valos of Sonhadra Series, check out:  Amanda Milo - Alluvial (Valos of Sonhadra #1) Poppy Rhys - Tempest (Valos of Sonhadra #2) Nancey Cummings - Blazing (Valos of Sonhadra #3) Ripley Proserpina - Whirlwind (Valos of Sonhadra #4) Naomi Lucas - Radiant (Valos of Sonhadra #5) Isabel Wroth - Shadowed (Valos of Sonhadra #6) Tiffany Roberts - Undying (Valos of Sonhadra #7)Marina Simcoe - Enduring (Valos of Sonhadra #8) Regine Abel - Unfrozen (Valos of Sonhadra #9)",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Romance",
    "Science Fiction Romance",
    "Fantasy",
    "Fantasy Romance",
    "Adult"
  ],
  "author": "Tiffany Roberts",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/38506863-undying"
}