{
  "title": "Powerdown: Options and Actions for a Post-Carbon World",
  "description": "If the US continues with its current policies, the next decades will be marked by war, economic collapse, and environmental catastrophe. Resource depletion and population pressures are about to catch up with us, and no one is prepared. The political elites, especially in the US, are incapable of dealing with the situation and have in mind a punishing game of “Last One Standing.” The alternative is “Powerdown,” a strategy that will require tremendous effort and economic sacrifice in order to reduce per-capita resource usage in wealthy countries, develop alternative energy sources, distribute resources more equitably, and reduce the human population humanely but systematically over time. While civil society organizations push for a mild version of this, the vast majority of the world’s people are in the dark, not understanding the challenges ahead, nor the options realistically available. Powerdown speaks frankly to these dilemmas. Avoiding cynicism and despair, it begins with an overview of the likely impacts of oil and natural gas depletion and then outlines four options for industrial societies during the next Last One the path of competition for remaining resources; the path of cooperation, conservation and sharing;Waiting for a Magic wishful thinking, false hopes, and denial;Building the path of community solidarity and preservation. Finally, the book explores how three important groups within global society—the power elites, the opposition to the elites (the antiwar and antiglobalization movements, et the “Other Superpower”), and ordinary people—are likely to respond to these four options. Timely, accessible and eloquent, Powerdown is crucial reading for our times. Richard Heinberg is an award-winning author of five previous books, including The Party’s Oil, War and the Fate of Industrial Societies . A member of the Core Faculty of New College of California, he lives in Santa Rosa, California.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Politics",
    "Peak Oil",
    "Ecology",
    "Science",
    "Technology"
  ],
  "author": "Richard Heinberg",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/385207.Powerdown"
}