{
  "title": "يكفي أن يحبك قلب واحد لتعيش",
  "description": "إذا أردنا أن نتعرف أكثر على معاني الحياة وأسرارها الخفية، فلا بد لنا من قراءة د.هيفاء بيطار\"، فهي خير من عبر عن مكنونات النفس البشرية، وعن تعقيدات الحياة الاجتماعية، وأطرها الثقافية. في مجموعتها القصصية الرائعة هذه والتي جاءت تحت عنوان \"يكفي أن يحبك قلب واحد لتعيش\" كتبت عن الناس، عن همومهم، شخصياتها من واقع الحياة، يمكن أن تشاهدهم في كل يوم، ولكن، هل لنا أن نعرف ما يدور في أعماقهم، هم، أناس حالمون، عاشقون، يائسون، فقراء، ولكنهم صامدون يواجهون مصيرهم بثقة وكبرياء. تتألف هذه المجموعة من سبعة عشر قصة قصيرة، مكتوبة بأسلوب سهل، خلي من التعقيد والزخرفة، فصيح وواضح المعاني، ففي قصة \"يكفي أن يحبك قلب واحد لتعيش\" استطاعت الروائية أن تفرغ في هذه القصة -على قصرها- الشحنة العاطفية التي تتأجج داخل كل أم، حتى نخالها حين قراءتها، موسيقى هادئة، ولكنها حزينة، تتناغم مع عاطفة صادحة شجية تحكي فيها قصة أم لم يخطر لها يوماً أن تكون أماً لطفل معتوه متخلف ومجنون كما شخص له الأطباء، ولكنها أحبته أكثر من أي شيء آخر: \"لم تكن تستطع تخيل خلو حياتها منه، نها تحبه بجنون، تحسه قطعة منها، هذا المعتوه الصغير، الذي يفاجئها في لحظات خاظفة كيف يرنو إليها بعينين تفضيان وجداً\".أما في قصة \"رغيف خبر ووظيفة\" تحكي الروائية هنا تفاصيل الحياة اليومية لتركيبات إنسانية أفرزتها تركيبة سياسية اقتصادية فاسدة فنتج منها تركيبة اجتماعية متوسطة الحال أو بالأحرى فقيرة \"ضحايا\" هم أناس لا يملكون في حياتهم سوى الرتابة والألم والحسرة، سبب تردي أوضاعهم المعيشية، فيفقدون الأمل في تحسنها ويتحولون إلى شخصيات مبرمجة وممحية، تقول الكاتبة: \" تتحول إلى وظيفة ورغيف خبز... ماتت رغباتك حتى أنك ما عدت تخاطب نفسك وبماذا ستتحاور مع ذاتك وأنت لا تحلم ولا تأمل ولا تفكر، وكيف تفكر ودماغك قرص عجين تعامله الحياة بضربات قاسية قوية، و تقلبه كما تقلب يدا الفران قرص العجين ثم تلقيه في النار...آه\".مجموعة قصصية رائعة، واقعية، دون إدعاء، ودون تعقيد، يكشف مضمونها حقائق مجتمعنا، إضافة إلى تركيبة الشخصية التي يحملها كل واحد منا، فيقرأ أفكاره، ويعرف ذاته أكثر ولكن هل يستطيع التغيير؟",
  "genres": [
    "Short Stories",
    "Novels"
  ],
  "author": "هيفاء بيطار",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/3852474"
}