{
  "title": "Goodnight Moron",
  "description": "HEALTH WARNING: This parody may prove harmful for thin-skinned snowflakes, anyone inclined to irrational bouts of political correctness, Trump supporters, and crotchety old, white, Christian conservatives.  This bedtime nightmare - er, story - details in comic relief Donald J. Trump's scorched-earth candidacy and gravity-defying ascendancy to win the most powerful position on the planet. In an improbable (and, some say, suspect) turn of events, the lying, pussy-grabbing, foul-mouthed loser shocked and dismayed the civilized world, almost certainly as much as he shocked himself, by winning.  This story was assembled one hundred days into what is undoubtedly the most vile, crooked, and incompetent administration in American history. It highlights the multiple scandals and controversies of the festering slime filling the Oval Office. Do we really expect them to do anything but wallow in the sludge of the swamp Trump promised to drain?  \nGoodnight Moron\n delivers an unflinchingly hard, yet satirical, punch in the gut. It's like a game of Sadistic Deja Vu as we reflect back on the first hundred - some would say worst hundred - days of what could possibly be the last American President (or, in Russian terms, first American shlyukha). Riffing off of the beloved and often-parodied children's bedtime classic, Goodnight Moon, by Margaret Wise Brown, Goodnight Moron offers light reading with simple words that even his pandering supporters can understand. For those still challenged by words, graphic illustrations help guide the way. It's okay to laugh at our pain (it's called schadenfreude). But be warned, for after the chuckles are gone (hopefully sooner rather than later), the nightmares will likely haunt us for years to come.  Highly recommended with a warm glass of milk and the strongest narcotic legally available (not marijuana, of course, since Attorney General Jeff Sessions has declared a one-man war on weed). The paperback also makes a great gag gift for that bleeding heart liberal, raving conservative, and alt-right white supremacist in your life. Good guys all around.  And be sure to look for other D Trumple Thinskin titles, including \nThe Very Angry Caterwauler.",
  "genres": [],
  "author": "D. Trumple Thinskin",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/38513855-goodnight-moron"
}