{
  "title": "The Promise and the Dream: The Untold Story of Martin Luther King, Jr. And Robert F. Kennedy",
  "description": "No issue in America in the 1960s was more vital than civil rights, and no two public figures were more crucial in the drama of race relations in this era than Martin Luther King, Jr. and Robert F. Kennedy. Fifty years after they were both assassinated, noted journalist David Margolick explores the untold story of the complex and ever-evolving relationship between these two American icons.Assassinated only sixty-two days apart in 1968, King and Kennedy changed the United States forever, and their deaths profoundly altered the country's trajectory. As trailblazers in the civil rights movement, leaders in their respective communities, and political powerhouses with enormous personal appeal, no single pairing of white and black ever mattered more in American history. In The Promise and the Dream, Margolick examines their unique bond and the complicated mix of mutual assistance, impatience, wariness, awkwardness, antagonism and admiration that existed between the two, documented with firsthand interviews from close sources, oral histories, FBI files, and previously untapped, contemporaneous newspaper accounts.At a turning point in social history, MLK and RFK embarked on distinct but converging paths toward lasting change. Even when they weren't interacting directly, they monitored and learned from, one another. Yet the distance they maintained from one another reflected much broader tensions between the races in the United States, and their nearly simultaneous deaths embodied the nation's violent predilections and ongoing racial turmoil. Their joint story, a story each man took some pains to hide and which began to come into focus only with their murders, is not just gripping history but a window into contemporary America and the challenges we continue to face.Complemented by eighty-three revealing photographs by the foremost photojournalists of the period, The Promise and the Dream offers a compelling look at one of the most consequential but misunderstood relationships in our nation's history.\"Now is the time to make justice a reality for all of God's children.\" --Martin Luther King, Jr., 1967 \"In this difficult day, in this difficult time... It is perhaps well to ask what kind of a nation we are and what direction we want to move in.\" --Robert F. Kennedy, 1968",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "American History",
    "Race",
    "Social Justice"
  ],
  "author": "David Margolick",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/38510413-the-promise-and-the-dream"
}