{
  "title": "King Sigismund of Poland and Martin Luther: The Reformation before Confessionalization",
  "description": "The first major study of the early Reformation and the Polish monarchy for over a century, this volume asks why Crown and church in the reign of King Sigismund I (1506-1548) did not persecute Lutherans. It offers a new narrative of Luther's dramatic impact on this monarchy - which saw violent urban Reformations and the creation of Christendom's first Lutheran principality by 1525 - placing these events in their comparative European context. King Sigismund's realm appears to offer a major example of sixteenth-century religious the king tacitly allowed his Hanseatic ports to enact local Reformations, enjoyed excellent relations with his Lutheran vassal duke in Prussia, allied with pro-Luther princes across Europe, and declined to enforce his own heresy edicts. Polish church courts allowed dozens of suspected Lutherans to walk free.Examining these episodes in turn, this study does not treat toleration purely as the product of political calculation or pragmatism. Instead, through close analysis of language, it reconstructs the underlying cultural beliefs about religion and church (ecclesiology) held by the king, bishops, courtiers, literati, and clergy - asking what, at heart, did these elites understood 'Lutheranism' and 'catholicism' to be? It argues that the ruling elites of the Polish monarchy did not persecute Lutheranism because they did not perceive it as a dangerous Other - but as a variant form of catholic Christianity within an already variegated late medieval church, where social unity was much more important than doctrinal differences between Christians. Building on John Bossy and borrowing from J.G.A. Pocock, it proposes a broader hypothesis on the Reformation as a shift in the languages and concept of orthodoxy.",
  "genres": [
    "History"
  ],
  "author": "Natalia Nowakowska",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/38524895-king-sigismund-of-poland-and-martin-luther"
}