{
  "title": "The Mirror Prince",
  "description": "Max Ravenhill thinks he's human...but he's wrong. He's been given false memories over and over again by his Wardens, who don't want him to realize that he's been alive for over one thousand years.Max and his Wardens are Riders - what humans call the Faerie folk - and back in their Lands Max was the Prince Guardian, Keeper of the Talismans. As the Prince Guardian, Max lost a civil war and was banished to the Shadowlands, the human country. To prevent his escape, his memory was bound, along with his dra'aj, the magical energy that is manifested in all Faerie. His Wardens were with him to make sure that the powerless Exile was not accidentally killed by humans.The Banishment is nearing its end when Warden Cassandra Kennaby gets a most unexpected warning that Max is in imminent danger from his old enemy, the Rider who has become known as the Basilisk Prince. Cassandra has personal reasons for avoiding her charge, but when the warning is confirmed by the appearance of the Hunt, she has no choice but to remember her Oath and go to the rescue. As the Hunt closes in, the only way Cassandra can save Max is to risk returning him home before the end of the Banishment. Max finds himself in the bewildering Lands of the People, where nothing, not the Riders or the Naturals or the Solitaries - not even the landscape itself - does what he expects. Cassandra and Max find that the dra'aj of the Lands has been waning during the Banishment, and the Basilisk Prince has been growing in power since the time of the Great War. Max's old supporters desperately need him to prevent the Basilisk from declaring himself High Prince and destroying the natural Cycles of the Lands. But it isn't really Max they need - it's his true self, the Prince Guardian. Max must decide whether to give up the only life he knows, in order to become someone else. For only then can he hope to fight an ancient enemy he doesn't even remember.",
  "genres": [
    "Fantasy",
    "Adult",
    "Urban Fantasy",
    "Fiction",
    "Canada",
    "Magic",
    "Science Fiction Fantasy"
  ],
  "author": "Violette Malan",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/385487.The_Mirror_Prince"
}