{
  "title": "Target Rich Environment",
  "description": "Hard-hitting Stories from the Creator of Monster Hunter International. The first short story collection from nationally best-selling author Larry Correia.Larry Correia, the New York Times best-selling author of the wildly popular Monster Hunter International and Grimnoir Chronicles series of no-holds-barred urban fantasy and the Dead Six trilogy of military adventure novels, now sets his sights on the short story form.Together for the first time, fourteen action-packed tales of demons, monster, vampires, and cosmic horrors too terrible to name--and the men and women who take them all down. Oh, and toss in an interdimensional insurance salesman for good measure.You'll also find: An elven princess from the pages of Monster Hunter International on a mission to redeem her people. A samurai pirate with a blood vendetta against an extremely large sea beast. And a magic-wielding P.I. who walks the mean streets of Detroit.Journey back to the origins of Monster Hunter International in \"Bubba Shackleford's Professional Monster Hunters.\" Uncover the origin of one of Dead Six's central characters in \"Sweothi City.\" And celebrate the holidays with the Grimnoir Chronicle's own Jake Sullivan in \"Detroit Christmas.\"Discover why it always pays to hire the very best when it comes to fighting a war when Correia takes on David Drake's genre-defining Hammer's Slammers series. And find out just how much damage a vampire can do when he was a Green Beret before he became one of the undead as Correia tackles Jonathan Maberry's V Wars universe.Includes three stories never before in print! \"Murder on the Orient Elite\" and \"The Adventures of Tom Strange, Interdimensional Insurance Salesman\" have previously only been available in audio format (narrated by Adam Baldwin of Firefly fame). And \"Blood on the Water\" makes its first appearance.About Larry Correia and the Monster Hunter International series: \"[E]verything I like in fantasy: intense action scenes, evil in horrifying array, good struggling against the darkness, and most of all people--gorgeously flawed human beings faced with horrible moral choices that force them to question and change and grow.\"--Jim Butcher on Son of the Black Sword\"[A] no-holds-barred all-out page turner that is part science fiction, part horror, and an absolute blast to read.\"--Bookreporter.com\"If you love monsters and action, you'll love this book. If you love guns, you'll love this book. If you love fantasy, and especially horror fantasy, you'll love this book.\"--Knotclan.com\"A gun person who likes science fiction--or, heck, anyone who likes science fiction--will enjoy [these books] . . . The plotting is excellent, and Correia makes you care about the characters . . . I read both books without putting them down except for work . . . so whaddaya waitin' for? Go and buy some . . . for yourself and for stocking stuffers.\"--Massad Ayoob\"This lighthearted, testosterone-soaked sequel to 2009's Monster Hunter International will delight fans of action horror with elaborate weaponry, hand-to-hand combat, disgusting monsters, and an endless stream of blood and body parts.\"--Publishers Weekly on Monster Hunter Vendetta",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Urban Fantasy",
    "Horror",
    "Short Stories",
    "Fiction",
    "Anthologies"
  ],
  "author": "Larry Correia",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/38531439-target-rich-environment"
}