{
  "title": "Shell",
  "description": "“A luminous look at a city at a time of change, a time when the building of the Sydney Opera House was a reach for greatness.” —The New York TimesIn this spellbinding and poignant historical novel—perfect for fans of All the Light We Cannot See and The Flamethrowers —a Swedish glassmaker and a fiercely independent Australian journalist are thrown together amidst the turmoil of the 1960s and the dawning of a new modern era.1965: As the United States becomes further embroiled in the Vietnam War, the ripple effects are far-reaching—even to the other side of the world. In Australia, a national military draft has been announced and Pearl Keogh, a headstrong and ambitious newspaper reporter, has put her job in jeopardy to become involved in the anti-war movement. Desperate to locate her two runaway brothers before they’re called to serve, Pearl is also hiding a secret shame—the guilt she feels for not doing more for her younger siblings after their mother’s untimely death.Newly arrived from Sweden, Axel Lindquist is set to work as a sculptor on the besieged Sydney Opera House. After a childhood in Europe, where the shadow of WWII loomed large, he seeks to reinvent himself in this utterly foreign landscape, and finds artistic inspiration—and salvation—in the monument to modernity that is being constructed on Sydney’s Harbor. But as the nation hurtles towards yet another war, Jørn Utzon, the Opera House’s controversial architect, is nowhere to be found—and Axel fears that the past he has tried to outrun may be catching up with him.As the seas of change swirl around them, Pearl and Axel’s lives orbit each other and collide in this sweeping novel of art and culture, love and destiny.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Australia",
    "Historical",
    "Book Club",
    "Literary Fiction",
    "Audiobook"
  ],
  "author": "Kristina Olsson",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/38532219-shell"
}