{
  "title": "Who Killed the Fonz?",
  "description": "The legendary 1950s-era TV show Happy Days gets reinvented as a gritty 1980s noir.Late October, 1984. Prince and Bruce are dominating FM radio. Ron and Nancy are headed back to the White House. Crockett and Tubbs are leading men everywhere to embrace pastels. And Richard Cunningham? Well, Richard Cunningham is having a really bad Sunday.First, there’s the meeting with his agent. A decade ago, the forty-something Cunningham was one of Hollywood’s hottest screenwriters. But Tinseltown is no longer interested in his artsy, introspective scripts. They want Terminator cyborgs and exploding Stay Puft Marshmallow men. If he isn’t interested in that sort of thing, his agent tells him, he’s gonna have to find new representation.Then later that same day he gets a phone call with even worse news. His best friend from childhood back in Milwaukee, back when everyone called him Richie, is dead. Arthur Fonzarelli. The Fonz . Lost control of his motorcycle while crossing a bridge and plummeted into the water below. Two days of searching and still no body, no trace of his trademark leather jacket.Richard flies back for the memorial service, only to discover that Fonzie’s death was no accident—it was murder. With the help of his old pals Ralph Malph and Potsie Weber, he sets out to catch the killer. Who it turns out to be is shocking. So is the story’s final twist.Who Killed The Fonz? imagines what happened to the characters of the legendary TV series Happy Days twenty years after the show left off. And while much has changed in the interim—goodbye drive-in movie theaters, hello VCRs—the story centers around the same timeless themes as the the meaning of family. The significance of friendship. The importance of community.Fast-paced and full of nostalgia, Who Killed the Fonz? is an ingenious twist on a beloved classic that proves sometimes you can go home again.TM & © 2018 CBS Studios Inc. All Rights Reserved",
  "genres": [
    "Mystery",
    "Fiction",
    "Pop Culture",
    "Suspense",
    "Crime",
    "Humor",
    "Media Tie In"
  ],
  "author": "James Boice",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/38532226-who-killed-the-fonz"
}