{
  "title": "The Post Card: From Socrates to Freud and Beyond",
  "description": "17 November 1979You were reading a somewhat retro loveletter, the last in history. But you have not yet received it. Yes, its lack or excess of address prepares it to fall into all a post card, an open letter in which the secret appears, but indecipherably.What does a post card want to say to you? On what conditions is it possible? Its destination traverses you, you no longer know who you are. At the very instant when from its address it interpellates, you, uniquely you, instead of reaching you it divides you or sets you aside, occasionally overlooks you. And you love and you do not love, it makes of you what you wish, it takes you, it leaves you, it gives you.On the other side of the card, look, a proposition is made to you, S and p, Socrates and plato. For once the former seems to write, and with his other hand he is even scratching. But what is Plato doing with his outstretched finger in his back? While you occupy yourself with turning it around in every direction, it is the picture that turns you around like a letter, in advance it deciphers you, it preoccupies space, it procures your words and gestures, all the bodies that you believe you invent in order to determine its outline. You find yourself, you, yourself, on its path.The thick support of the card, a book heavy and light, is also the specter of this scene, the analysis between Socrates and Plato, on the program of several others. Like the soothsayer, a \"fortune-telling book\" watches over and speculates on that-which-must-happen, on what it indeed might mean to happen, to arrive, to have to happen or arrive, to let or to make happen or arrive, to destine, to address, to send, to legate, to inherit , etc., if it all still signifies, between here and there, the near and the far, da und fort , the one or the other.You situate the subject of the between the posts and the analytic movement, the pleasure principle and the history of telecommunications, the post card and the purloined letter, in a word the transference from Socrates to Freud, and beyond. This satire of epistolary literature had to be farci, stuffed with addresses, postal codes, crypted missives, anonymous letters, all of it confided to so many modes, genres, and tones. In it I also abuse dates, signatures, titles or references, language itself.J. D.\"With The Post Card , as with Glas , Derrida appears more as writer than as philosopher. Or we could say that here, in what is in part a mock epistolary novel (the long section is called \"Envois,\" roughly, \"dispatches\" ), he stages his writing more overtly than in the scholarly works. . . . The Post Card also contains a series of self-reflective essays, largely focused on Freud, in which Derrida is beautifully lucid and direct.\"—Alexander Gelley, Library Journal",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "France",
    "Classics",
    "Psychology",
    "Literary Criticism"
  ],
  "author": "Jacques Derrida",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/385654.The_Post_Card"
}