{
  "title": "Bad with Money: The Imperfect Art of Getting Your Financial Sh*t Together",
  "description": "The beloved writer-comedian expands on her popular podcast with an entertaining, refreshing, and empowering book chronicling her quest for financial literacy. In the first episode of her “Bad With Money” podcast, Gaby Dunn asked random people at a coffee shop two questions: First, what’s your favorite sex position? Everyone was game to answer, even the barista. No holds barred. Then, she asked them how much money was in their bank accounts. Deathly silence. People were aghast. “That’s a very personal question!” they cried. And therein lies the problem.Gaby argues that our inability to speak honestly about money is our #1 barrier to understanding it, nurturing a stigma that leads to our shame, embarrassment, and anxiety, which in turn prevents us from taking ownership over this important part of our lives. She wants you to know that there are real reasons to feel helpless when it comes to managing your money, and that the patronizing know-it-alls on TV who blow air horns in your face and charge you up the wazoo for their self-help seminars do not have the answers.But despair not, there is a light at the end of this dark, moneyless tunnel. Through her own journey toward “financial literacy,” Gaby uncovers the real reasons that we feel so disempowered when it comes to finance—deeply rooted habits we inherited from our families, systemic imbalances, and intentionally-complicated terminology that makes it impossible for regular people to feel competent. Bad With Money isn’t going to tell you how to get rich or erase your debt, nor will it offer up a litany of humiliating confessions about horrible financial decisions that Gaby has made (okay, maybe some): it is an invitation from a friend who is just as clueless as you are. Equal parts memoir and journalistic investigation, Gaby covers topics like the financial dynamics of dating, the costs of mental health, and how to maintain your self-respect as a freelancer. In addition to debunking the “entitled millennial” stereotype, Gaby reveals essential truths like how “401K” is not the name of a sci-fi movie, why it feels like your bank teller is speaking a foreign language, and how to decide whether to take an unpaid internship.Weaving her own stories with the perspectives of various researchers, artists, students, her parents, a financial psychologist, her exes, and more, she reveals the ways that money makes us feel confused, hopeless, and terrified, and what it might look like to start taking control of our financial futures.",
  "genres": [
    "Nonfiction",
    "Finance",
    "Self Help",
    "Money",
    "Memoir",
    "Audiobook",
    "Personal Finance"
  ],
  "author": "Gaby Dunn",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/38532177-bad-with-money"
}