{
  "title": "The Omega Project, Book 2: Drumbeats of War",
  "description": "The Omega Project, Book 2: Drumbeats of War by Angus MacM. HodgsonAt the end of World War 2, to most people outside of the Department of State it was obvious that communism was incompatible with the American way of life. Therefore the Russians were most likely to become our next major enemy.Based upon the OSS Project Omega plan and authorized by President Truman, a series of secret shelters were built throughout the United States. Each shelter designed to be self-suffi cient for long term survival and very comfortable for long term living. The hero and his Military Working Dog, Klavia, are assigned to one such shelter, Omega 11.This book starts off with Jon reminiscing about one of his early CAG missions in Afghanistan hunting for Taliban controlled caves. Later during a lull in operations he is invited to go hunting on the surface with the Chiricahua Apache. After the hunt one of the Chiricahua medicine men has a vision of the future that reveals a new enemy. An invasion from Mexico by a coalition of Mexican and Chinese forces. Jon has a little time to prepare for this threat while at the same time eliminating another threat that started in Book 1.Angus Hodgson grew up in Buffalo, New York the son of a naval officer turned attorney.  He remembers the Cuban Missile Crisis, air raid drills in school and helping his father turn the basement into a fallout shelter. Scary times that left an indelible memory.In 1975 he graduated from Norwich University, the Military College of Vermont with a degree in education. After trying out a few different jobs he ended up in south Texas as a police officer. During his twenty year career in law enforcement he served in a variety of roles including suburban and rural patrol, investigations, both urban and rural surveillance and high risk warrant service. Along the way he learned to write good accurate detailed reports to keep himself out of court on his days off. Angus finished his law enforcement career as an instructor of police hard skills including defensive tactics, driving, firearms, mechanics of arrest and VIP protection.Now semi-retired, Angus lives on a quiet south Texas ranch with his two loyal border collies and a huge personal and professional library. He is still active in learning more skills for himself and teaching those skills part-time. He also still does consulting to select clients on the subjects of surveillance detection and facility vulnerability.",
  "genres": [],
  "author": "Angus MacM. Hodgson",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/38531055-the-omega-project-book-2"
}