{
  "title": "Her Majesty's American",
  "description": "THE UNION JACK TAKES TO SPACE! All-new alternate history science fiction from New York Times best-selling author Steve White.In an alternate future where the British empire never crumbled, the space ships of Her Majesty’s Navy work to keep the spaceways safe. Commander Robert Rogers of the Royal Space Navy is a defense intelligence officer known for his unconventional ways. Rogers is American born-and-raised, a loyal citizen of the Viceroyalty of North America. He’s a descendant of the founder of the highly effective, pro-British Rogers’ Rangers during the Colonial unpleasantries of 1776, and he’s inherited his ancestor’s intelligence and drive in spades.But there are those among the stars who are not so happy being subjects of the British Empire. In the Tau Ceti system, a cauldron of trouble brews as a terrorist faction of the rebellious Sons of Arnold attacks the empire from within, and warships of the theocratic Caliphate enters the system, prepared to do their worse to destroy the hated empire head on. Yet standing against the coming anarchy and tyranny is one intrepid spy prepared to risk all for queen and COMMANDER ROBERT ROGERS, HER MAJESTY’S AMERICANAbout Her Majesty's American :\"White presents thought provoking observations about humanity in an alternate future, with clever twists and turns.\"— Booklist\"With a strong combination of alternate history, science fact, and science fiction, White (the Starfire series) takes readers into a future of interplanetary colonization and threats both foreign and domestic.\"— Publishers WeeklyAbout Steve “Creative . . . White seamlessly inserts his characters into history, blending science fiction and vintage military action to deliver a fast-paced, high-stakes story. The time travel leads to a twisty, clever series of surprises and plot mechanics.”— Publishers Weekly on Soldiers out of Time“White offers fast action and historically informed world-building.”— Publishers Weekly“. . . recalls the best of the John Campbell era of SF. White's core audience of hard SF fans will be pleased . . .”— Publishers Weekly“. . . Engaging entertainment . . . much suspense and many well-handled action scenes . . .”— Booklist",
  "genres": [
    "Science Fiction",
    "Alternate History",
    "Space Opera",
    "Fiction",
    "Military Science Fiction",
    "Adventure",
    "Mystery"
  ],
  "author": "Steve  White",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/38531437-her-majesty-s-american"
}