{
  "title": "The Arbiter",
  "description": "Alternate cover edition of ASIN B079SSSJ2J\n\"She is too sinful to be Divine and too righteous to be Damned.\"\n  Nocturna; a hybrid, an all around smart ass, and the owner of The Apothecary, a night club for all the denizens that walk the earth to play amongst humans, is about to have her life altered by the Creator of all.  The last Arbiter has fallen and a new one must be chosen, one of both Divine and Damned blood. She will be both judge and executioner for the supernatural races, choosing how to punish or bless the souls brought before her.  Within her first week with her new status, Damned from all over are disappearing and disturbing videos of Damned being tortured and killed are surfacing. When Lord Monroe, one of The Infernal leaders of the Damned, becomes one of those who are missing, the Damned begin to point their fingers at The Rites; the Divine soldiers who are part of The Order of Abel. The clock is ticking, and it is her responsibility to find who is responsible and pass judgement. With the help of Enoch, an Infernal of the Damned, and Larkan, a Rite of the Order, Nocturna travels to Lord Monroe's estate, hoping to find clues as to what happened to him and all the others.  Her integrity and her heart will be pushed and pulled in all directions as she faces the biggest dilemma of her existence; can she make the decision that is right for the lives of all, not the decision that is easiest for her. Will she stay true and lead the world into peace? Or will she choose sides like all the Arbiters before her and lead them all to destruction?   **This is a Reverse Harem Dark Romance that is recommended for ages 18+. There are elements of violence, such as torture and a body count, and steamy scenes that are sure to light you on fire. If you’re into that sort of thing, then boy do we have the book for you!",
  "genres": [
    "Reverse Harem",
    "Demons",
    "Paranormal",
    "Fantasy",
    "Urban Fantasy",
    "Angels",
    "Vampires"
  ],
  "author": "K.B. Ladnier",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/38530722-the-arbiter"
}