{
  "title": "Death Blossoms: Reflections from a Prisoner of Conscience",
  "description": "In Death Reflections from a Prisoner of Conscience Mumia Abu-Jamal, America’s best known political prisoner, offers poetic observations and reflections on life on this planet and on death row. In this collection of short essays and personal vignettes, which take on everything from spirituality and religion to capitalism and the prison-industrial complex, Mumia examines the deeper dimensions of existence. Mumia’s ability to celebrate life and advocate for revolutionary change while being held, at the state’s convenience, at death’s door, imbues his thoughts and words with power and passion. \"Many people say it is insane to resist the system, but actually, it is insane not to,\" he writes in \"Politics.\" In \"God-Talk on Phase II\" he writes, \"On death’s brink, men begin to see things they’ve perhaps never seen before. Like those around them, and especially those who share their fate…men whose death warrants have been signed, men with a date to die—live each day with a clarity and a vibrancy they might have lacked in less pressured times.\" Mumia turns this clarity towards his quest for spiritual and social fulfillment drawing connections between religion and race politics. He embraces spirituality while exploring the true nature of the institutions that have sentenced him to die. \"Crucial reading for all opponents of the death penalty—and for those who support it, too.\"—Katha Pollitt, The Nation \"A brilliant, lucid meditation on the moral obligation of political commitment by a deeply ethical—and deeply wronged—human being. Mumia should be freed, now.\"—Henry Louis Gates, Jr. \"If Mumia Abu-Jamal has nothing important to say, why are so many powerful people trying to kill him and shut him up? Read him.\"—John Edgar Wideman Mumia Abu-Jamal , an award-winning journalist and former Black Panther Party member, has been living on death row in a Pennsylvania prison since 1982.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Race",
    "Essays",
    "Memoir",
    "History",
    "Poetry"
  ],
  "author": "Mumia Abu-Jamal",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/385942.Death_Blossoms"
}