{
  "title": "Alpha Ablaze",
  "description": "After thousands of years, they’re back…  Paranoid Inventor and draconian expert Sam isn't anything special... and that's all he wants anyone who may be watching to think about him. Sam is a conspiracy theorist who lives on the fringes, preferring to keep a low profile while he does what he knows best—study the ancient draconian culture that he knows isn't a fairytale. Aided by his intuitive ability to create gadgets and harness sound waves, Sam changes identities and addresses as often as he changes his clothes... all in a life-long quest to evade The Man. When he accidentally wakes a \"sleeping\" dragon who insists that they are mates, Sam's carefully structured world shifts sideways.  Blaze is a dragon warrior—an alpha guardian assigned to protect the Crown Prince of Novis. When he and his men at arms are sent into stasis after a battle for their lives, the last thing he expects after being awakened is to find himself thousands and thousands of years in the future. Not only is he now in a modern world where his kingdom no longer exists, but the people here believe dragons are nothing more than mythological creatures. The sound of his true mate's heartsong coming from the adorably awkward omega who freed him from stasis gives the alpha all the reason he needs to quickly acclimate to the changes the fates have thrown his way. But first, he needs to make Sam see reason and admit that not only is he an omega, but also Blaze's mate.  Is Sam truly paranoid if someone is watching them? Settle in and let our dragons sweep you off your feet… and into a world filled with adventure!  Alpha Ablaze is the second book in the Waking the Dragons series and features literally rock-hard hunks, a group of dragon hunters who shouldn't be discounted, something called a 'Corny,' and an HEA just as legendary as the dragons in it. This 52k book contains mpreg and is 18+ only… did you really expect anything less from Susi Hawke and Piper Scott?",
  "genres": [
    "M M Romance",
    "Dragons",
    "Romance",
    "Omegaverse",
    "Paranormal",
    "Shapeshifters",
    "Fantasy"
  ],
  "author": "Susi Hawke",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/38591154-alpha-ablaze"
}