{
  "title": "How to Give Up Plastic: A Guide to Changing the World, One Plastic Bottle at a Time",
  "description": "As read by James Corden, Fearne Cotton, Jim Chapman and Dougie Poytner.'We have a responsibility, every one of us' David AttenboroughAround 12.7 million tonnes of plastic are entering the ocean every year, killing over 1 million seabirds and 100,000 marine mammals.By 2050 there could be more plastic in the ocean than fish by weight.Plastic pollution is the environmental scourge of our age, but how can YOU make a difference?This accessible guide, written by the campaigner at the forefront of the anti-plastic movement, will help you make the small changes that make a big difference, from buying a reusable coffee cup to running a clean-up at your local park or beach. Tips on giving up plastic include:· Washing your clothes within a wash bag to catch plastic microfibers (the cause of 30% of plastic pollution in the ocean)· Replacing your regular shampoo with bar shampoo· How to lobby your supermarket to remove unnecessary packaging · How to throw a plastic-free birthday party· How to convince others to join you in giving up plasticPlastic is not going away without a fight. We need a movement made up of billions of individual acts, bringing people together from all backgrounds and all cultures, the ripples of which will be felt from the smallest village to the tallest skyscrapers. This is a call to arms - to join forces across the world and to end our dependence on plastic.#BreakFreeFromPlastic\nPlastic is not going away without a fight. We need a movement made up of billions of individual acts, bringing people together from all backgrounds and all cultures, the ripples of which will be felt from the smallest village to the tallest skyscrapers.\n'Plastic waste is one of the greatest environmental challenges facing the world' Theresa May'As Head of Oceans at Greenpeace, Will is on the front line of humanity's global fight against plastic. This timely book not only explains how we got into this mess, but most importantly offers an optimistic and proactive approach as to how we can get out of it'. - Richard Walker, Managing Director at Iceland",
  "genres": [
    "Nonfiction",
    "Environment",
    "Sustainability",
    "Science",
    "Nature",
    "Self Help",
    "Climate Change"
  ],
  "author": "Will McCallum",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/38587839-how-to-give-up-plastic"
}