{
  "title": "A False Report: A True Story of Rape in America",
  "description": "Two Pulitzer Prize-winning journalists tell the riveting true story of Marie, a teenager who was charged with lying about having been raped, and the detectives who followed a winding path to arrive at the truth. On August 11, 2008, eighteen-year-old Marie truthfully reported that a masked man broke into her apartment near Seattle, Washington, and raped her, but within days police and even those closest to Marie became suspicious of her story. The police swiftly pivoted and began investigating her. Confronted with inconsistencies in her story and the doubts of others, Marie broke down and said her story was a lie. Police charged her with false reporting. One of her best friends created a web page branding her a liar.More than two years later, Colorado detective Stacy Galbraith was assigned to investigate a case of sexual assault. Describing the crime to her husband that night--the attacker's calm and practiced demeanor, which led the victim to surmise \"he's done this before\"--Galbraith learned that the case bore an eerie resemblance to a rape that had taken place months earlier in a nearby town. She joined forces with the detective on that case, Edna Hendershot, and the two soon realized they were dealing with a serial rapist: a man who photographed his victims, threatening to release the images online, and whose calculated steps to erase all physical evidence suggested he might be a soldier or a cop. Through meticulous police work the detectives would eventually connect the rapist to other attacks in Colorado--and beyond.Based on investigative files and extensive interviews with the principals, An Unbelievable Story is a serpentine tale of doubt, lies, and a hunt for justice, unveiling the disturbing reality of how sexual assault is investigated today--and the long history of skepticism toward rape victims.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Feminism",
    "Crime",
    "Audiobook",
    "Adult",
    "Mystery"
  ],
  "author": "T. Christian Miller",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/38590852-a-false-report"
}