{
  "title": "Paco",
  "description": "Paco, the rugged VP of the Night Rebels MC, only stopped to get out of the rain and have some chow at the diner. He was headed back to Alina. He never intended on staying, but he saw her sitting alone at the booth next to his. She had on too much makeup and too little clothing for the cold wintry night.  Then she looked at him: her eyes were dark like an endless stretch of midnight sky. In their inky depths, he saw sorrow and pain and threads of fierceness. They drew him in.  He, the man who never looked past one night with a woman, wanted to know about this small woman sitting across from him. He knew he should just pay his bill, hop on his Harley, and head home, but he couldn’t.  Misty Sullivan hated the cold nights when she’d have to haul her butt from truck to truck to make enough to satisfy her boyfriend. She used to have another name, but that was a long time ago when she was normal and life was good. She tried not to remember what was—it just made her new life worse.  The stranger staring at her didn’t look like a trucker. He was decked out in leather and denim and looked at her like she was a person, not a piece of a$$. But… men couldn’t be trusted. They only wanted to use and abuse women. Yet, she sensed the sexy stranger was different.  A series of events kept throwing them together. Soon Misty’s past threatened to crash with her present. Could she trust the biker who was playing havoc with her heart to save her from destruction?  Paco had closed off his heart since his first love had shattered it many years before. Would Misty be the woman to break through his barriers? Could he let her slip away from him?  This is the fifth book in the Night Rebels MC Romance series. This is Paco’s story. It is a standalone. This book contains violence, sexual assault (not graphic), strong language, and steamy/graphic sexual scenes. It describes the life and actions of an outlaw motorcycle club. If any of these issues offend you, please do not read the book. HEA. No cliffhangers! The book is intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Contemporary",
    "BDSM",
    "Suspense",
    "Dark",
    "Crime",
    "Contemporary Romance"
  ],
  "author": "Chiah Wilder",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/38606096-paco"
}