{
  "title": "One Way or Another",
  "description": "‘OMG, OMG, OMG I love this book!… Laugh out loud… Hilarious.’ Chelle’s Book Reviews Twenty-nine-year-old Katie Kelly is at an all-time low. By now she was supposed to have the perfect relationship and her dream career – but her boyfriend left her behind to travel the world, she’s sleeping on a friend’s sofa, and she’s working a temporary job... that she’s been in for two years. This is not the life she dreamed of. But with the help of Martha, an eighty-year-old who believes in living life to the absolute full, Katie is about to start again – to grab hold of life with both hands and give it a big shake up, starting with getting out of her dead-end job. When old flame, gorgeous Ben Cole, unexpectedly reappears in Katie’s life, it seems like true love might be within reach too… Soon Katie is on the cusp of getting everything she dream job, dream man, dream life. But can she really have it all? A hilarious, heart-warming story full of romance, friendship and laughs. If you like Lindsey Kelk, Marian Keyes or Cate Woods, you need to read Colleen Coleman! Read what people are saying about One Way or  ‘Amazing… I read this book in one sitting… I was completely engulfed… I loved every minute of the drama… An uplifting read and a laugh-out-loud story.’ The Flickering Pages, 5 stars ‘Fantastic!… Absolutely divine… The story was absolutely wonderful and it had me hooked… from page one until I’d finished it!… Made me laugh and cry… Everything that you could need from a book!… Absolutely perfect!’ Stardust Book Reviews, 5 stars ‘A fabulously light-hearted and entertaining read that will have you bubbling with emotions… So wonderful that I read it in one sitting… Captivated me and I couldn't put it down.’ By The Letter Book Reviews, 5 stars ‘Fun and fabulous… I had many good belly laughs. This is quite the uplifting story… I absolutely adored this book… Loved this book.’ Goodreads reviewer ‘Oh my days, what a fantastic book… I absolutely flipping well LOVED it… Once I picked this book up, I couldn’t put it down… I found myself laughing out loud… I wholeheartedly recommend this author.’ Ginger Book Geek, 5 stars ‘Ohhhhhhhhhhh this author doesn't disappoint!... I was able to lose myself in every word… I loved everything about One Way or Another… Everything I could want from a book and more, deserving a rating of the entire amount of stars in the universe. Truly – five ain't gonna cut it at all, this book is pint-sized perfection.’ The Writing Garnet, 5 stars ‘What a book this was!’ Being Unique Being a Reader, 5 stars ‘A truly uplifting and hopeful story! Five stars from me!’",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Humor",
    "Womens Fiction"
  ],
  "author": "Colleen Coleman",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/38602052-one-way-or-another"
}