{
  "title": "Miracles on the Water: The Heroic Survivors of a World War II U-Boat Attack",
  "description": "An unforgettable story of children in wartime, of heroism at sea, and--above all--of courage and the power of the human spirit.On September 17, 1940, at a little after ten at night, a German submarine torpedoed the passenger liner S.S. City of Benares in the North Atlantic. There were 406 people on board, but the ship's prized passengers were 90 children whose parents had elected to send their boys and girls away from Great Britain to escape the ravages of World War II. They were considered lucky, headed for quiet, peaceful, and relatively bountiful Canada.The Benares sank in half an hour, in a gale that sent several of her lifeboats pitching into the frigid sea. They were more than five hundred miles from land, three hundred miles from the nearest rescue vessel.Miracles on the Water tells the astonishing story of the survivors--not one of whom had any reasonable hope of rescue as the ship went down. The initial \"miracle\" involves one British destroyer's race to the scene, against time and against the elements; the second is the story of Lifeboat 12, missed by the destroyer and left out on the water, 46 people jammed in a craft built and stocked for 30. Those people lasted eight days on little food and tiny rations of drinking water. The survivors have grappled ever since with questions about the Should the Benares have been better protected? How and why did they persevere? What role did faith and providence play in the outcome?Based on first-hand accounts from the child survivors and other passengers, including the author's great-uncle, Miracles on the Water brings us the story of the attack on the Benares and the extraordinary events that followed.Tom Nagorski is currently the Executive Vice President of the Asia Society following a three-decade career in journalism - having served most recently as Managing Editor for International Coverage at ABC News. Nagorski has won eight Emmy awards and the Dupont Award for excellence in international coverage, as well as a fellowship from the Henry Luce Foundation. He lives in Brooklyn with his wife and two children.",
  "genres": [
    "Nonfiction",
    "History",
    "World War II",
    "War",
    "Military History",
    "British Literature",
    "Survival"
  ],
  "author": "Tom Nagorski",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/385995.Miracles_on_the_Water"
}