{
  "title": "Blai2e",
  "description": "Part 2 in the highly anticipated Dark Romance Series   NOTE FROM AUTHOR: BLAI2E is best enjoyed without reading the reviews as they might spoil the ending.  Don’t take what isn’t yours. Unless you’re willing to fight for it.  I survived my depraved master, Maksim. Now, I belong to Charlie Decena, by nature and by nurture. He broke everything I believed in.   My life still lingers in the gray zone — dark and light, love and hate, betrayal and murder.  I’m battling Maksim’s brutal conditioning to uncover who Blaire is, for Charlie. I adhere to his counsel, indulge in his debauched desires, and pacify his dominance  — until he pushes me too far.  I hope I didn’t completely shatter your heart in the beginning of my story because it’s just getting started. I’m being tested beyond my limit by a lurking threat who has taken something very dear to me. And if they don’t return what isn’t theirs, someone is going to die.    EDITORIAL REVIEWS    “Nothing will prepare Blaire fans for part 2”. Editor, Eli Peters  “I was a huge fan of Blaire book one, and I was hoping book two would deliver up to my expectations. Well, it went way beyond. Anita Gray does dark in the best of ways. A true master at this craft. I couldn't put Blai2e down!” Alta Hensley, USA Today Bestselling Author  “Anita Gray has created a seductive, dark world of vulnerability, fragility, love, deceit and gut wrenching heart ache. You will be consumed with a story that is unputdownable until the last, jaw dropping page!!!! Pure brilliance.” Lani, Lipsmackin Goodbooks   “I don’t say this lightly, but Charlie Decana has fast become my ultimate male alpha hero. 6 soul stealing stars!” Trish, Unbound Book Reviews  “Anita Gray RIPPED my heart and soul to shreds with this MASTERFULLY told tale of DARKNESS, LOVE, SACRIFICE and...FORGIVENESS?!” Jacquie, Unbound Book Reviews  “Mind twisting. Gut wrenching. Heart pounding. Epic-ness!” Bookalicous Babes Blog, Vicki  “I had to invent brand new emotions to deal with what Blai2e made me feel because it was just that intense.” In Between The Pages  “This series will pull you in, drag you under and leave you begging for more.” Michelle McGinty, Reviewer",
  "genres": [
    "Dark",
    "Dark Romance",
    "Romance",
    "Abuse",
    "Suspense",
    "Crime",
    "BDSM"
  ],
  "author": "Anita Gray",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/38614766-blai2e"
}