{
  "title": "The Widow Next Door: Learning to Live Again as a Young Widow and Single Mom after Losing my Husband to Suicide",
  "description": "My name is Heather and this is my story. It follows me from marrying my best friend and succeeding through an infertility struggle, to becoming a widow and ultimately a single mother. This is the journal of my life after losing the love of my life to mental illness and suicide. My hope is to help others out there who may be travelling a similar path as I am. I had a rather normal life. I was twenty-eight years old, married to a wonderful man, seven months into motherhood, and following my expected career path. In one night, with the shocking discovery of my husband's death, everything changed. I needed a way to heal, to grieve, and to get the demons out of my head. I needed a way to make something positive from the trauma I had been handed. That was the start of my blog, The Widow Next Door. This book is the story of that journey. It is a day-to-day journal of the raw truth of what I was living and how I survived. When I began writing my blog, I really had no idea where it would take me. I knew it was helping to write down my thoughts and feelings, and I hoped it was helping others as well. The response was incredible. I was doing it! I was helping and connecting with people. It really meant something to others to watch my struggles and successes. There were so many out there that could relate to my stories. It helped some just by knowing there was someone that could relate to their experiences. It helped bring awareness to something so prominent in our society that no one ever wants to talk about. By writing this book, it puts everything together. It follows me through who I was before, how I survived, and where I am now. The positive impact can only grow. This is my life, and I have not only survived, but thrived. I hope to help others do the same.",
  "genres": [],
  "author": "Heather Cruz",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/38602813-the-widow-next-door"
}