{
  "title": "Spiritual Symbols",
  "description": "Spiritual Symbols with their Meaning, AoL Mindfulness Book #8. To all Mindfulness and Alchemy Explorers who see the beauty in every-day Nature & Universal sacred language of symbols and signs. We will not talk about spiritual symbols worshiped by major religions but about trees, numbers, spirals that we meet daily. Through symbols to mindfulness meditations. Symbols and signs are the languages of the soul. Symbols and signs are the language of dreams. Occultists believe that signs and symbols are given a supernatural power at their creation. Words, signs and symbols, images, colors, light, are all used for eons to convey a spiritual meaning. The Mystics of India In ancient India yogis observed the world as an illusion. Yet, the magic of the spiritual world stayed deeply connected to the sense world. Within the science of yoga, the way we treat our spine influences our health and well-being, the way we treat our thoughts, or the practice of meditation influences our current incarnation. The Mystics of Greece For the philosophers of ancient Babylonia and Greece the sense world was not considered an illusion. In the search for Divine, they turned towards art, towards symbols and signs within myths and legends. In mysterious ways the wisdom of the initiates poured into poets, artists, and thinkers. Manipulating the elements, they turned towards the Lady Science and carried her principles to the point that we are now able to manipulate the sound, the light, the matter and its manifestation. The Mystics of China Chinese created I Ching that within its symbolism reflects the universe in miniature. The book is at the heart of Confucian thought and Taoism, but also a common tool among the fortune tellers that use it as a divination text and a roadside oracle. The Mystics of Kabbalah Kabbalists designed the Tree of Life and the Tarot symbolism followed it. Kabbalah is an esoteric teaching, a science that explores metaphysical principles of the universe. Any material object and action from both the micro and the macro world is controlled by the spiritual forces. Kabbalah attempts to understand these spiritual sources, to know their nature and properties. Mystics Magic and God To a Chinese sage, a Yogi, and a Cabbalist Mystic, the earth is a field of activity that has to be transformed, so that it carries an imprint of human will. The Mystics, the Magi initiates, the guardians of the oracle mysteries acquired deep knowledge of the laws of the spiritual world and their interaction with the sense world. Some of them worked hard all through their lives to decipher the spiritual forces behind the forces of nature and to learn how to control the elements. Just as God is hidden, so are the inner secrets of Her divine message. We read about them, hear them uttered, but we cannot possibly comprehend their meaning unless we have a direct experience of their truth. That is why to be able to talk to our souls we use meditation, we use rituals, symbols and signs, we use dreams and careful observation of souls’ subconscious messages. The mystics of our past help us in this quest. From Zarathustra who comes from the ancient Persian spiritual culture, to Pythagoras who comes from the Greco-Latin cultural epoch, to Lao Tzu, Buddha and Christ, they all carry the keys to the secrets of the most varied mysteries. In March 2015, Artof4Elements developed and launched the Alchemy of Love Mindfulness Training Series of 9 fiction and non-fiction books with 7 authors focusing on spiritual growth, creativity and mindfulness. A series of many genre's, including poetry, personal development, historical fiction, the world of Alchemy of Love Mindfulness Training explores numerous self development themes. The main theme that books and courses explore is mindfulness, alchemy, and reaching ones highest potential.",
  "genres": [
    "Philosophy",
    "Spirituality",
    "Self Help"
  ],
  "author": "Nataša Pantović",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/38617321-spiritual-symbols"
}