{
  "title": "The Scorpion's Mate",
  "description": "The Scorpion’s Mate Claire has never really fit in with everyone around her, but she's carved out a life for herself using her own unique style and artistic ability to support herself on the Internet. The last thing she expects is to be abducted by aliens and dropped into a research facility, where a genetically-engineered alien soldier chooses her as his life-mate. Thrax’s pheromones are compelling, and his status as a fellow unwilling test subject makes them allies, but Claire isn't certain she can trust someone who is convinced she belongs to him, when all she wants to do is find a way to return home to Earth—a place that her devoted alien can never follow, because there’s no way the scorpion-like alien would ever be able to pass for human. Still, she’ll accept help where she can find it, so she doesn't hesitate to escape with Thrax from the facility, though their time running from their pursuers in the warrens beneath the research facility will forever change Claire, and could make it impossible for her to return to Earth. But will there be anywhere else in the galaxy they can go where their love will be accepted?  Plus a BONUS Full-length novel: Into the Dead Fall Though she was raised by a survivalist, Alice was not prepared to be ripped from her dimension and dropped without ceremony into the massive junkyard of a parallel dimension.  She’s wounded, alone, and lost in a world her mind struggles to comprehend. When a strange, four-armed alien comes to her aid, saving her life, she has no choice but to accept his help.  She finally starts growing comfortable around her leonine companion, until another warrior intervenes to save her when creatures from the Dead Fall attack them during their exploration, making everything much more complicated.  Alice still doesn’t understand what either of the warriors is saying, and if she can’t find the right words to soothe her beastly new protectors, they’ll end up killing each other.  Author’s Note: 18+ These books contain scenes that are not suitable for younger audiences. It should also be noted that the alien heroes in these books look alien in many ways, and their cultures and mating habits might not be for everyone.",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction",
    "Science Fiction Romance",
    "Paranormal",
    "Fantasy",
    "Monsters"
  ],
  "author": "Susan Trombley",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/38601826-the-scorpion-s-mate"
}