{
  "title": "Sadie and the Bad Boy Billionaire",
  "description": "I will NOT fall for the smart-mouthed, pretty-boy billionaire who owns Oakley Island. But his yacht is another story …Love and happily-ever-after? It’s not for me. I’m much happier keeping everyone at arm’s length, focusing on my government cybersecurity work.But then I push things a little too far and hack my way into trouble. When I need to lay low and stay off the radar for a bit, what better place to do so than on Oakley Island with my sisters?With limited housing options, I reluctantly agree to stay on the yacht of the very annoying Benedict King—the billionaire who has been messing—flirting?—with me since we met.I did NOT agree, however, to a voyage out to sea.But I wake up to find the yacht that should be docked and empty somewhere in the Atlantic with two government agents tasked with babysitting me and one Benedict King.Who also lied about being my boyfriend.Typical rich man—thinking he can take whatever he wants.But he won’t take my heart. Not even when I see his softer side, see behind his walls, see the real man behind the reputation.Honestly, this might be more dangerous than any of the other trouble I stirred up. Because if I fall for Benedict King, I’m not sure there’s any hope of rescue.Sadie and the Bad Boy Billionaire is a closed door romantic comedy with mild suspense, sizzling kisses, and a boat full of witty banter. The Oakley Island Romcoms follow three very different sisters as they renovate the house they inherited and find love on the island along the way. The stories are standalone, but if you like continuous stories, we recommend reading them in order. Each book is closed-door, with sizzling chemistry and swoony kisses only.",
  "genres": [
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Clean Romance",
    "Forced Proximity",
    "Fiction",
    "Romantic Comedy"
  ],
  "author": "Emma St. Clair",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/122752787-sadie-and-the-bad-boy-billionaire"
}