{
  "title": "The Unfortunate Expiration of Mr. David S. Sparks",
  "description": "An utterly gripping science-fiction thriller for readers who adored Philip K. Dick, William Gibson, Kurt Vonnegut and Michael Crichton . Discover why readers are calling The Unfortunate Expiration of Mr. David S. Sparks \" an intricate and evocative sci-fi triumph ,\" \" a feat of impossible imagination ,\" and \" a complete science fiction masterpiece .\" Who is David S. Sparks? Where is David S. Sparks? When is David S. Sparks? In the aftermath of The Chemical Wars, nature has reclaimed humanity's infrastructure. This world, lush with life - yet dangerously uninhabitable for mankind - houses the remaining population who ekes out an existence in quarantined cities anchored off the mainland.David S. Sparks awakens into the chaos of this future world, unsure of his place in a reality wildly different from his fragmented memories. As the desire to retake the planet swells, so too does the question of how. Will the same mistakes be repeated? Can technology beat nature, or is it time for another approach? And what is David Sparks' role in it all?Dive into a wild, mind-bending journey as one man chases the ultimate question of self, discovering the truly illusive nature of reality . --------------------------------------------------------- What Readers are Saying About The Unfortunate Expiration of Mr. David S. Sparks\"Most, if not all of Aicher's stories feature characters and situations that inspire confusion, curiosity, exploration of the self, and exploration of reality. This one is no different, and it reaches new heights of tension and originality .\" - Peak Story Reviews\"A futuristic post-apocalyptic, dystopian, mind-bending thriller that will keep you on the edge of your seats. A completely wonderful sci-fi novel that overwhelms the senses. A feat of impossible imagination and a triumph of the sci-fi genre .\" - Alliereads Book Blog\"... you find yourself thinking about your choices in life and the way the world is headed. Is there something that we should be doing differently to stop this from happening? What's more, this world was unique from many I have read in the post-apocalyptic genre (which is increasingly hard to find any more.)\" - Official Onlinebookclub.org Review\"If you like futuristic mystery, this one is definitely worth your time.\" - Sci-Fi & Scary\"... a book with multiple levels of interpretation and the author manages to awake the ancestral and subconscious fears of the human being, in the best tradition of science fiction .\" - Eva Garcia Fornet, author Keep Ithaka Always In Your Mind \"A thought-provoking , intellectual book about our environment, digitally obsessed society , and need for self-preservation, Aicher sneakily creates an ingenious modern day satire with David Sparks.\" - The Uncorked Librarian\"... my mind was just blown and I need to talk about it with someone.\" - Micah Chaim Thomas , author The Little Demons Inside\"Aicher pulls out all the stops and goes full-on Philip K. Dick on his readers. You literally cannot trust what is real from one paragraph to the next.\" - Amazon.com Review",
  "genres": [
    "Science Fiction",
    "Dystopia",
    "Fiction"
  ],
  "author": "William F. Aicher",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/38612479-the-unfortunate-expiration-of-mr-david-s-sparks"
}