{
  "title": "West Winging It: An Un-presidential Memoir",
  "description": "The West Wing meets The Office in this “funny, moving story about working in the White House that is a must read for anyone who misses having Barack Obama as President” (Dan Pfeiffer, cohost of Pod Save America), directly from his senior writer and former Deputy Director of Messaging.West Winging It is the “fitfully funny…warm and observant” (Kirkus) story of Pat Cunnane and his journey from outsider to insider—from his dreary job at a warehouse to his dream job at the White House. Pat pulls the drapes back on the most famous and exclusive building in the United States, telling the story of the real West Wing with compelling and quirky portraits of the people who populate the place, from the President to the press corps. Pat takes you into the Oval Office, providing a “snappy, sunny” (USA TODAY) insider’s glimpse of what it’s really like—from the minutiae to the momentous—to work at 1600 Pennsylvania Avenue. Along the way, Pat draws an intimate portrait of the side of President Obama that few were privy to—the funnyman, the nerd, the athlete, the caring parent. He describes both the small details—the time he watched in horror as the President reached over the sneeze guard at Chipotle—and the larger, historic moments, such as watching the President handle the news of the 2015 terrorist attacks in Paris. In some ways, working at the White House is a lot like every office, and in some ways, it’s like no office ever. Pat recounts the time he accidentally slammed a door on Joe Biden, plotted to have the Pope bless him by faking a sneeze, and almost killed America’s First Dog. “West Winging It is a fun, poignant reminder that the best part about working in the Obama White House was the people working with you, and knowing that everyone was there for the right to try to do as much good, for as many people, as we possibly could” (Jay Carney, former press secretary). At its core, it’s a fish-out-of-water story—only these fish are trying to run the United States of America.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Memoir",
    "Biography",
    "Presidents",
    "Biography Memoir",
    "Humor"
  ],
  "author": "Pat Cunnane",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/38621765-west-winging-it"
}