{
  "title": "Geddy Lee's Big Beautiful Book of Bass",
  "description": "\"It's not surprising that sooner or later I'd dive down the proverbial rabbit hole into the world of vintage bass guitars.\"—Geddy LeeFrom Rush frontman Geddy Lee's personal collection of vintage electric bass guitars, dating from the 1950s to the 1980s, comes the definitive volume on the subject.Geddy's love of the bass has been nurtured over a lifetime spent in the limelight as one of the world's premier rock bassists. For the past seven years, he's dedicated himself to studying the history of the instrument that's been so essential to his career, collecting hundreds of basses from around the globe, 250 of which are presented here in breathtaking detail with specially commissioned photography by Richard Sibbald.Representing every tone in the bass palette, every nuance of the rock and roll genre as well as blues, jazz, pop, and country, this one-of-a-kind collection features so-called \"beauty queens\"—pristine instruments never lifted from their cases—as well as \"road warriors\"—well-worn, sweat-soaked basses that proudly show their age and use. Complete with personal commentary from Geddy that showcases his knowledge both as a musician and an aficionado, this luxuriously produced volume is a revelatory look at the heavy hitters in the world of bass—Fender, Gibson/Epiphone, Rickenbacker, Höfner, Ampeg—and lesser known but influential global luthiers such as Antonio Wandr Pioli, Dan Armstrong, and Tony Zemaitis.The book also features interviews with John Paul Jones (Led Zeppelin); Adam Clayton (U2); Robert Trujillo (Metallica); Jeff Tweedy (Wilco); Bill Wyman (The Rolling Stones); Les Claypool (Primus); Bob Daisley (Rainbow); Fender expert and owner of the legendary Gibson Explorer, Bass Ken Collins; veteran guitar tech for The Who, Alan Rogan; plus comments from many other great players across three decades of rock and roll.Written in Geddy's singular voice, this book reveals the stories, songs, and history behind the instruments of his inimitable collection. Complete with an index and a graphically designed timeline of the history of the bass, as well as an up-close look at Geddy's basses on Rush's final R40 Tour, his stage and recording gear from 1968 to 2017, and forewords by author and respected vintage expert, Terry Foster, and Rush band member, Alex Lifeson, Geddy Lee's Big Beautiful Book of Bass is the ultimate compendium for the consummate collector, musician, Rush fan, and anyone who loves the bass guitar.",
  "genres": [
    "Music",
    "Nonfiction",
    "History"
  ],
  "author": "Geddy Lee",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/38633535-geddy-lee-s-big-beautiful-book-of-bass"
}