{
  "title": "Havoc: Valentine's Battles",
  "description": "r/AmITheAssholeAm I the asshole for telling my alpha I threw his suits off the balcony for banning me from waffles? I have four boyfriends and none of them will get me waffles.So my (22/F/omega) pack lead (24/M/alpha) has banned me from waffles. The backstory is that I wanted waffles since I saw the BetaButter’s Waffle truck at The Crimson Bullet. It’s been a week at least and I’ve been very patient. I got into a spot of trouble the other day (nothing major) and because of that, my pack lead has banned me from having waffles.I was very upset about it yesterday, so I got all of his suits and hid them under my bed. But I told him I chucked them off the balcony because he wouldn’t let me have waffles. (We live really high up).He was quite upset and told me it was too far and now he’s also banned the rest of my pack from getting me waffles and the ban is now indefinite. They think this is funny enough that they’re playing along.I’ve not yet told him the truth about the suits.I tried to order waffles, but so far he’s caught all of my skip the dishes (Which is worse, because then he eats the waffles). He realised what was going on when I tried to get it delivered to the lobby.He said I’m allowed pancakes, but I suspect it’s because he knows he can’t stop me making pancakes. I feel quite strongly about this because it’s valentine’s day.Am I the asshole here? I tried to order a waffle iron online, but he found it before I could sneak it into my nest. I accidentally ordered an industrial sized one, so it was bigger than I thought it would be. He has now hidden it until I replace his suits.To those saying get them myself, I grew up pretty sheltered. I can’t drive but I’m learning. There doesn’t seem to be any waffle places in walking distance. I’m debating if I want waffles enough to deal with my fear of public transport. I lost. He found this thread online and got back all of his suits. I still haven’t had waffles.",
  "genres": [
    "Omegaverse",
    "Reverse Harem",
    "Contemporary",
    "Romance",
    "Fantasy",
    "Novella",
    "Adult"
  ],
  "author": "Marie Mackay",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/122753775-havoc"
}