{
  "title": "Mr. Deeds Goes to Town, or Opera Hat",
  "description": "THE BOOK THAT INSPIRED THE ACADEMY AWARD WINNING MOVIE CLASSIC.  \"What happens when a young man inherits $20,000,000 and finds no greater joy than playing the tuba in a small town band? Everybody thinks he's crazy! But when he goes to town, he goes to town! The comedy of the year.\" –Harrisonburg Telegraph  How Clarence Budington Kelland created Mr. Deeds: \"As I sat around for days on end, I dreamed up a pet character, myself no doubt, who was young and fine and suddenly acquired a bit of money. Then he went- to a strange city and did good things with it in romantic ways. Thirty-odd years later that brain child blossomed into print in \"Opera Hat\" and onto the screen as \"Mr. Deeds Goes to Town.\"  You may have already met Mr. Deeds in the Academy Award winning 1930s film, \"Mr. Deeds Goes to Town\", or the 1960s television series of the same name, or the recent Adam Sandler movie remake, \"Mr. Deeds\".  But whether you have met him before or not, here is the original Mr. Deeds, the poetry writing, tuba playing man from Mandrake Falls, exactly as novelist Clarence Budington Kelland created him - with a small seasoning of mystery and a dash of murder they left out of the movie versions.  Here is Clarence Budington Kelland, the old master of romantic comedy and romantic suspense, with his signature oddball characters, madcap satire, and pixilated characters. Among the latter:  Victor Semple, a long-lost great-uncle who left $20,000,000 to Longfellow Deeds of Mandrake Falls VT. Lathrop Cedar, senior member of the firm of Cedar, Cedar, Cedar and McGonigle, Attorneys at Law, representing the Victor Semple estate – Mr. Cedar was even more pedantic than his title suggested. Madame Pomponi - the world trembled when this super diva threw one of her famed volcanic fits – but not Mr. Deeds. Simonetta Petersen, personal secretary to Madame Pomponi - this cynical child of the Big Apple would never have believed she could fall for a sincere hick from small town USA, until she met Mr. Deeds. Percival Dide, one of the most highly regarded authors of the age - he had no idea anyone actually make money writing, until he learned how much Mr. Deeds got paid for composing greeting card verse. Nina Motti, the opera company's leading dancer – she died in the second act, in her dressing room, with a bullet through her heart. Mario Granzi, an attorney not quite of the bracket of Cedar, Cedar, Cedar and McGonigle, who claimed to represent Mrs. Victor Semple, or at least his common-law-wife, or at least they lived together \"man and wife\" – and who anyway was entitled to a substantial settlement from the estate.  \"Deeds, a verse writing young man in Mandrake Falls, who plays the tuba in the town band, falls heir to $20,000,000. His arrival in New York to claim the fortune surrounds him with a nest of grafters who are out to leave Deeds as little of his money as possible. Deeds' eccentricities provide a field day.\" – Minneapolis Star  \"Longfellow Deeds, a simple tuba-playing, verse-writing young man in Vermont, is suddenly left $20,000,000. What he does with the money and what happens to him in New York give the plot unexpected twists, turns and suspense.\" -Philadelphia Inquirer  Inspiration for the movie Pauline Kael, in the New Yorker, called \"a homey fantasy demonstrating the triumph of small-town values over big-city cynicism. Longfellow Deeds the sincere greeting-card poet from New England comes to New York.\"",
  "genres": [
    "Fiction"
  ],
  "author": "Clarence Budington Kelland",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/38639230-mr-deeds-goes-to-town-or-opera-hat"
}