{
  "title": "Embers",
  "description": "Enter an addictive world of sizzlingly hot paranormal romance . . .'Strong heroine and a sexy possessive hero, witty banter and sizzling chemistry and an enthralling storyline'⭐ ⭐ ⭐ ⭐ ⭐ reader review..................Harper and Knox are back and better than ever . . . Discover the unmissable fourth book in Suzanne Wright's globally bestselling The Dark in You series.The final horseman awaits . . . and the stakes have never been higher.With the birth of their son, Asher, Harper and Knox are both more powerful and more vulnerable than they've ever been before. Asher's charm has seduced even the devil himself, but Harper knows that the real villain is still out there, and as desperate as ever to see the Primes fall. They're laying low, and there's no way to tell which one of their circle is really a deadly foe . . .When the final horseman makes their move, Harper and Knox will have to use all the considerable power at their disposal - and that may even include Asher's mysterious abilities. One thing's for sure - this is a baby who's more than a match for any demon coming after him.It's time for the world's most formidable family to take the fight to the enemy . . . Find out why readers everywhere are obsessed with Suzanne 'It's been two minutes since my last fix and I need Suzanne Wright to give me more' Edgy Reviews'No words to describe how much I ADORE this extraordinary and magical read!' Gi's Spot Reviews 'A whole lot of action and excitement. Add in lots of sarcastic banter, a sexy alpha demon and his smart-mouthed heroine, an intense, highly passionate romance and a bit of a mystery, and I devoured this book from start to finish!' The Escapist Book Blog 'What a great start to yet another fab Suzanne Wright Series!' Aurora B's Book Blog 'Unique, original and very entertaining' Ramblings from this Chick'Run, don't walk, to your preferred device and click this title immediately. The worst that will happen is you will be compelled to read everything she has ever written!' Amazon Reviewer, 5 stars'Just read it. NOW! A gigantic 5 FREAKING STARS!' Amazon Reviewer, 5 stars'No words to describe how much I ADORE this extraordinary and magical read!!!' Gi's Spot Reviews on BurnIf you love this book, make sure you check out the rest of The Dark In You series - discover how this sizzling hot story began . . . BURN BLAZE ASHES EMBERS SHADOWS OMENSFALLENREAPERHUNTED",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Romance",
    "Paranormal Romance",
    "Urban Fantasy",
    "Magic",
    "Demons"
  ],
  "author": "Suzanne Wright",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/38618911-embers"
}