{
  "title": "Missing Pieces",
  "description": "Librarian Note: This is an alternate cover edition of ASIN: B01N031EST. The original cover edition is  here and another alternate cover edition is  here.Tyler Stevens - Five years ago my world shattered into a million tiny pieces. I held onto the first positive thing that came into my life after that - a girl who I could never have. Because her smile made me feel whole again. Her laughter warmed my soul. The thought of her made me feel less broken. The only problem was that she didn't love me back. I waited. I tried. I hoped. But I failed. She just married someone else.I'm shattered again. So I'm driving across the country toward my new future, trying to escape my past, trying to pick up my own pieces this time. But then I met Hailey Shaw. She came into my life like a whirlwind. Opinionated, full of energy, and sexy as hell. Before her, what if I didn't know what love really was? What if the decision I made a few days ago, at one of my lowest points, is going to make me lose out on happiness once again?-Hailey Shaw - I didn't like to rely on other people. I learned at a young age that my dad and I were on our own. But now my dad's sick. And I'll do whatever it takes to save him. Even if it means facing my biggest fears. Even if it means climbing in a stranger's car and driving across the country with him. And I'm not talking about just any stranger. Because Tyler Stevens is different than anyone I've ever met before. He's the first boy that's made my heart race in five years. The first boy that makes me want to trust. The first boy that makes me feel whole again.But he's in love with someone else. I've spent my whole life being second, cast aside, unwanted. I can't do it again. So why am I falling for the one boy I can't keep?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "New Adult",
    "Audiobook",
    "Fiction",
    "Friends To Lovers"
  ],
  "author": "Ivy Smoak",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/38621223-missing-pieces"
}