{
  "title": "The Golden Gate",
  "description": "Amy Chua's debut novel, The Golden Gate, is a sweeping, evocative, and compelling historical thriller that paints a vibrant portrait of a California buffeted by the turbulent crosswinds of a world at war and a society about to undergo massive change.In Berkeley, California, in 1944, Berkeley Homicide Detective Al Sullivan has just left the swanky Claremont Hotel after a drink in the bar when a former presidential candidate is assassinated in one of the rooms upstairs. A rich industrialist with enemies among the anarchist factions on the far left, Walter Wilkinson could have been targeted by any number of groups. But strangely, Sullivan’s investigation brings up the specter of another tragedy at the Claremont, ten years earlier: the death of seven-year-old Iris Stafford, a member of the Bainbridge family, one of the wealthiest in all of San Francisco. Some say she haunts the Claremont still.The many threads of the case keep leading Sullivan back to the three remaining Bainbridge heiresses, now adults: Iris’s sister, Isabella, and her cousins Cassie and Nicole. Determined not to let anything distract him from the truth—not the powerful influence of Bainbridges’ grandmother, or the political aspirations of Berkeley’s district attorney, or the interest of Chinese first lady Madame Chiang Kai-Shek in his findings—Sullivan follows his investigation to its devastating conclusion.Chua’s page-turning debut brings to life a historical era rife with turbulent social forces and groundbreaking forensic advances, when race and class defined the very essence of power, sex, and justice, and introduces a fascinating character in Detective Sullivan, a mixed race former Army officer who is still reckoning with his own history.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Thriller",
    "Historical",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Amy  Chua",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/122753645-the-golden-gate"
}