{
  "title": "Disturbed in Their Nests: A Journey from Sudan's Dinkaland to San Diego's City Heights",
  "description": "Nineteen-year-old refugee Alephonsion Deng, from war-ravaged Sudan, had great expectations when he arrived in America three weeks before two planes crashed into the World Trade Towers. Money, he'd been told, was given to you in pillows. Machines did all the work. Education was free.Suburban mom Judy Bernstein had her own assumptions. The teenaged Lost Boys of Sudan-who'd traveled barefoot and starving for a thousand miles-needed a little mothering and a change of scenery: a trip to the zoo, perhaps, or maybe the beach.Partnered through a mentoring program in San Diego, these two individuals from opposite sides of the world began an eye-opening journey that radically altered each other's vision and life.Disturbed in Their Nests recounts the first year of this heartwarming partnership; the initial misunderstandings, the growing trust, and, ultimately, their lasting friendship. Their contrasting points of view provide of-the-moment insight into what refugees face when torn from their own cultures and thrust into entirely foreign ones.Alepho struggles to understand the fast-paced, supersized way of life in America. He lands a job, but later is viciously beaten. Will he ever escape violence and hatred?Judy faces her own struggles: Alepho and his fellow refugees need jobs, education, housing, and health care. Why does she feel so compelled and how much support should she provide?The migrant crises in the Middle East, Central America, Europe, and Africa have put refugees in the headlines. Countless human tragedies are reduced to mere numbers. Personal stories such as Alepho's add a face to the news and lead to greater understanding of the strangers among us. Readers experience Alepho's discomfort, fears, and triumphs in a way that a newscast can't convey. This timely and inspiring personal account will make readers laugh, cry, and examine their own place in the world.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Africa",
    "War",
    "History",
    "Sudan"
  ],
  "author": "Alephonsion Deng",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/38641953-disturbed-in-their-nests"
}