{
  "title": "War Crimes Against Southern Civilians",
  "description": "\"Does an astonishing job telling the truth about the wrongdoings of the United States government and its officers.\"--Confederate VeteranThe sobering and brutal consequences of the Civil War off the battlefield are revealed in this examination of atrocities committed against civilians. Rationale for the Union's \"hard war\" and the political ramifications of such a war set the foundation for Walter Cisco's enlightening research. Styled the \"Black Flag\" campaign, the hard line was agreed to by Lincoln in a council with his generals in 1864, when he gave permission to wage unlimited war against civilians, including women and children.In a series of concise and compelling chapters, Cisco chronicles the \"St. Louis Massacre,\" where Federal authorities proceeded to impose a reign of terror and dictatorship in Missouri. He tells of the events leading to, and the suffering caused by, the Federal decree that forced twenty thousand Missouri civilians into exile. The arrests of civilians, the suppression of civil liberties, theft, and murder to \"restore the Union\" in Tennessee are also examined.Women and children, black and white, were robbed, brutalized, and left homeless in Sherman's infamous raid through Georgia. Torture and rape were not uncommon. In South Carolina, homes, farms, churches, and whole towns disappeared in flames. Civilians received no mercy at the hands of the Union invaders. Earrings were ripped from bleeding ears, graves were robbed, and towns were pillaged. Wherever Federal troops encountered Southern Blacks, whether free or slave, they were robbed, brutalized, belittled, kidnapped, threatened, tortured, and sometimes raped or killed by their blue-clad \"liberators.\"Carefully researched, largely from primary sources, the book includes notes and illustrations. This untold story will interest anyone exploring an alternative perspective on this period in American history.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "American Civil War"
  ],
  "author": "Walter Brian Cisco",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/386395.War_Crimes_Against_Southern_Civilians"
}