{
  "title": "Terminal Alliance",
  "description": "In his hilarious new sci-fi series, Jim C. Hines introduces the unlikely heroes that may just save the galaxy: a crew of space janitors.The Krakau came to Earth to invite humanity into a growing alliance of sentient species. However, they happened to arrive after a mutated plague wiped out half the planet, turned the rest into shambling, near-unstoppable animals, and basically destroyed human civilization. You know--your standard apocalypse.The Krakau's first impulse was to turn around and go home. (After all, it's hard to have diplomatic relations with mindless savages who eat your diplomats.) Their second impulse was to try to fix us. Now, a century later, human beings might not be what they once were, but at least they're no longer trying to eat everyone. Mostly.Marion \"Mops\" Adamopoulos is surprisingly bright (for a human). As a Lieutenant on the Earth Mercenary Corps Ship Pufferfish, she's in charge of the Shipboard Hygiene and Sanitation team. When a bioweapon attack wipes out the Krakau command crew and reverts the rest of the humans to their feral state, only Mops and her team are left with their minds intact.Escaping the attacking aliens--not to mention her shambling crewmates--is only the beginning. Sure, Mops and her team of space janitors and plumbers can clean the ship as well as anyone, but flying the damn thing is another matter.As they struggle to keep the Pufferfish functioning and find a cure for their crew, they stumble onto a conspiracy that could threaten the entire alliance... a conspiracy born from the truth of what happened on Earth all those years ago.Jim C. Hines has proven himself a master of humorous fantasy with his Jig the Goblin novels, and has turned the usual fantasy tropes sideways and upside down with his Princess and his Magic Ex Libris series. With Terminal Alliance, the debut novel in his humorous military science fiction series, Jim takes us into a brand-new universe of entertainment certain to appeal to fans of both Douglas Adams and Terry Pratchett.",
  "genres": [
    "Science Fiction",
    "Humor",
    "Fiction",
    "Space Opera",
    "Aliens",
    "Space",
    "Post Apocalyptic"
  ],
  "author": "Jim C. Hines",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/38650698-terminal-alliance"
}