{
  "title": "The Norse Chronicles",
  "description": "Midnight Burning  Solina Mundy lives a quiet life, running the family bakery in her small North Carolina hometown. But one night, she suffers a vivid nightmare in which a wolfish beast is devouring her twin brother, who lives in Alaska. The next morning, police notify her that Mani is dead. Driven to learn the truth, Solina heads for the Land of the Midnight Sun. Once there, she begins to suspect Mani’s friends know more about his death than they’ve let on. Skyla, an ex-Marine, is the only one willing to help her.  As Solina and Skyla delve into the mystery surrounding Mani’s death, Solina is stunned to learn that her own life is tied to Mani’s friends, his death, and the fate of the entire world. If she can’t learn to control her newfound gifts and keep her friends safe, a long-lost dominion over mortals will rise again, and everything she knows will fall into darkness.  Arctic Dawn  Alone and exhausted after her month-long sojourn as a shooting star, Solina Mundy flees to southern California to lie low, recuperate, and plot a survival strategy. The one person she trusts to watch her back is her best friend, Skyla Ramirez. But Skyla has been missing for weeks. The arrival of a dangerous stranger and the discovery of a legendary weapon of mass destruction force Solina out of hiding and back into the fight for her life.  Solina knows she won’t last long on her own. She must find out what happened to Skyla and unite her contentious allies if she hopes to track down this devastating weapon before her enemies use it to burn the world to ash.  Molten Dusk  While recovering from a devastating betrayal, Solina becomes increasingly drawn to Thorin as he helps her hunt down Skoll, the mythical wolf who vowed to kill her. If she can find and destroy the beast, she’ll bring a swift and brutal end to her enemies’ schemes. But nothing ever goes as planned in Solina’s strange new world.  During her search for Skoll, Solina uncovers a plot to unleash a battalion of legendary soldiers and launch an apocalyptic war. Before she and her allies can locate the fabled army, several ghosts from her past return to haunt her. Solina must fight for life and the fate of the world, or her hopes for love and a peaceful future will go up in flames.",
  "genres": [],
  "author": "Karissa Laurel",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/38669740-the-norse-chronicles"
}