{
  "title": "The Life of Saul Bellow: Love and Strife, 1965-2005",
  "description": "When this second volume of The Life of Saul Bellow opens, Bellow, at forty-nine, is at the pinnacle of American letters - rich, famous, critically acclaimed. The expected trajectory is one of decline: volume 1, rise; volume 2, fall. Bellow never fell, producing some of his greatest fiction (Mr Sammler's Planet, Humboldt's Gift, all his best stories), winning two more National Book Awards, a Pulitzer Prize, and the Nobel Prize. At eighty, he wrote his last story; at eighty-five, he wrote Ravelstein. In this volume, his life away from the desk, including his love life, is if anything more dramatic than in volume 1. In the public sphere, he is embroiled in controversy over foreign affairs, race, religion, education, social policy, the state of culture, the fate of the novel.Bellow's relations with women were often fraught. In the 1960s he was compulsively promiscuous (even as he inveighed against sexual liberation). The women he pursued, the ones he married and those with whom he had affairs, were intelligent, attractive and strong-willed. At eighty-five he fathered his fourth child, a daughter, with his fifth wife. His three sons, whom he loved, could be as volatile as he was, and their relations with their father were often troubled.Although an early and engaged supporter of civil rights, in the second half of his life Bellow was angered by the excesses of Black Power. An opponent of cultural relativism, he exercised great influence in literary and intellectual circles, advising a host of institutes and foundations, helping those he approved of, hindering those of whom he disapproved. In making his case, he could be cutting and rude; he could also be charming, loyal, and funny. Bellow's heroic energy and will are clear to the very end of his life. His immense achievement and its cost, to himself and others, are also clear.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History"
  ],
  "author": "Zachary Leader",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/38651569-the-life-of-saul-bellow"
}