{
  "title": "Guilt",
  "description": "Mark Dooher is the last person anyone would suspect of a savage, bloody murder--the most hate-filled crime one veteran detective had ever come across. But Dooher, a prosperous attorney and prominent Catholic, is the first man San Francisco detective Abe Glitsky suspects. Soon Dooher is standing in the sights of the great, flawed machine called the criminal justice system. And Mark Dooher, a paragon of success and a master of all he touches, is about to be indicted for murder.As the Dooher trial begins, dozens of lives are drawn into the drama, from the men and women who knew Mark Dooher best to those whose fates are now entwined with his. For Wes Farrell, an attorney struggling with his own sense of failure, the defense of Mark Dooher will mean a chance at self-respect. For beautiful, aspiring attorney Christina Carrera, the case leads to a dangerous liaison with Dooher, who has wanted more than anything to have this woman by his side and in his bed. And for Abe Glitsky, whose wife is dying of cancer, the trial is a nightmare of DNA evidence, shaky witnesses, and long odds: Dooher, the unofficial consigliere of the Archbishop of San Francisco, has the Catholic Church on his side.As the trial builds to a crescendo, as evidence is sifted and witnesses discredited, as Farrell rises to heights he never knew he could reach and Abe Glitsky grieves, a woman emerges from Mark Dooher's past. Her story will change the role of nearly every player in this trial, and ignite a chain reaction of truth and violence that will alter lives forever.A novel that surprises from its first page to its last, Guilt is more than a story about crime and punishment. It is a riveting drama of moral responsibility and uncertain justice, of families bound by loyalty and divided by tragedy and betrayal. Building to one of the most nerve-shattering endings in recent fiction, Guilt is a true masterpiece of hard-hitting, contemporary suspense.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Legal Thriller",
    "Crime",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "John Lescroart",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/386620.Guilt"
}