{
  "title": "Guardian",
  "description": "Rescued from alien slavers, former cop Dayna wakes to discover she’s host to a powerful alien symbiont, and the only man who can help her is the mysterious and dangerous casino owner, Rillian.  Dayna Caplan has dedicated her life to protecting others…and now that she’s no longer a captive at the desert arena of Zaabha, she desperately wants to help find the last of the other human women who were abducted by the Thraxians. But now she has to deal with the intense hunger and powerful new abilities the alien living inside grants her…and the person forcing her to confront her new reality is the cool, enigmatic, and far-too-attractive Rillian.  Rillian has wheeled and dealed his way to the top of the food chain on the lawless desert world of Carthago. He lets no one close and keeps iron-clad control on his life…which vital to keeping the lethal power within him in check. But one human woman—tough, stubborn, and fascinating Dayna—works her way under his skin, and he finds himself obsessed with protecting her. But as dead bodies start appearing in his casino as a deadly warning, dangers are closing in on them.  With their allies, the gladiators from the House of Galen, Rillian and Dayna find themselves fighting for survival on every front. On the hunt to find Zaabha and the lost humans, they will face murderers, slavers, and the deadliest of all challenges…the aliens living within them.  Note to readers: This sci fi romance contains a lot of action (think wild gladiatorial fights and terrible murders), tough gladiators (the warriors of the House of Galen) and a steamy romance (between a sexy, mysterious casino owner and a tough, stubborn cop from Earth). So if you like it fast, and gritty, and sexy, this is for you!",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Science Fiction Romance",
    "Fantasy",
    "Paranormal Romance",
    "Erotic Romance"
  ],
  "author": "Anna Hackett",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/38650664-guardian"
}