{
  "title": "The Undying Monster: A Tale of the Fifth Dimension",
  "description": "Published 15 January 2006; Limited to 500 copies Jacket art by Jason Van Hollander. 'Where grow pines and firs amain, Under stars, sans heat or rain, Chief of Hammand, ’ware thy Bane!' For generations, the Hammand family has lived under the shadow of a deadly curse. It will sleep for a time, only to burst into deadly life when conditions are right; and if it does not kill its victims outright, it will leave them with such terrible, unspeakable memories of the event that they go mad with the knowledge of it. No one knows the origin of the curse, or what shape it takes, or when it will strike again; but it seems to be directed at the head of the family, and centred in an area near the Hammand estate known as the Shaw, under the shadow of a chalk carving called the Monstrous Man. When Swanhild Hammand receives news that 'The Monster's in the Shaw!' and realises that her old brother Oliver is not yet home, she fears the worst. Although Oliver survives the attack physically, Swanhild realises that the danger is not yet past, so she enlists the aid of Miss Luna Bartendale, who is 'the greatest hand at hunting down ghosts and anything supernatural that was ever known.' Together they attempt to trace the origin and nature of the Hammand curse; a search which takes in a secret room, racial memory, Theosophy, the Black Arts, a haunted barrow, and Norse mythology, before bringing the protagonists face to face with the Undying Monster itself. First published in 1922, The Undying Monster is a thrilling tale of mystery, adventure, and horror, which provided the archetype for the Hollywood werewolf movie. In his introduction to this edition, Jack Adrian discusses the strange, sad fate of the novel and its author, while two contemporary appendices provide a fascinating look at Jessie Douglas Kerruish and the novel's initial reception.",
  "genres": [
    "Horror",
    "Werewolves",
    "Fiction",
    "Classics",
    "Weird Fiction",
    "Occult Detective",
    "Gothic"
  ],
  "author": "Jessie Douglas Kerruish",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/3866498-the-undying-monster"
}