{
  "title": "Beyond Belief: The Secret Gospel of Thomas",
  "description": "Pagels, a writer and thinker on religion and history, winner of the National Book Award for The Gnostic Gospels, reflects on what matters most about spiritual and religious exploration in the 21st century. This book explores how Christianity began by tracing its earliest texts, including the Gospel of Thomas, rediscovered in Egypt in 1945.When her infant son was diagnosed with fatal pulmonary hypertension, Pagels' spiritual and intellectual quest took on a new urgency, leading her to explore historical and archaeological sources and to investigate what Jesus and his teachings meant to his followers before the invention of Christianity. The discovery of the Gospel of Thomas, along with more than 50 other early Christian texts, some unknown since antiquity, offers clues. She compares such sources as Thomas' gospel (which claims to give Jesus' secret teaching and finds its closest affinities with kabbalah) with the canon to show how Christian leaders chose to include some gospels and exclude others from the collection many call the New Testament. To stabilize the emerging church in times of persecution, church fathers constructed the canon, creed and hierarchy - and, in the process, suppressed many of its spiritual resources.Drawing on new scholarship - her own and that of an international group of scholars - that has come to light since the 1979 publication of The Gnostic Gospels, she shows that what matters about Christianity involves much more than any one set of beliefs. Traditions embodied in Judaism and Christianity can powerfully affect us in heart, mind and spirit, inspire visions of a new society based on practising justice and love, even heal and transform us.Provocative and moving, Beyond Belief, the most personal of her books to date, shows how the impulse to seek god overflows the narrow banks of a single tradition. She writes, \"What I have come to love in the wealth and diversity of our religious traditions - and the communities that sustain them - is that they offer the testimony of innumerable people to spiritual discovery, encouraging us, in Jesus' words, to 'seek, and you shall find.'\"CONTENTSFrom the feast of Agape to the Nicene CreedGospels in conflict: John and Thomas God's word or human words?The canon of truth and the triumph of JohnConstantine and the Catholic Church AcknowledgementsNotesIndex",
  "genres": [
    "Religion",
    "Nonfiction",
    "History",
    "Christianity",
    "Spirituality",
    "Theology",
    "Gnosticism"
  ],
  "author": "Elaine Pagels",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/386559.Beyond_Belief"
}