{
  "title": "Good Girl Gone",
  "description": "This is an alternate Cover Edition for ASIN: B018RCHYQA.Someone will have the Devil to pay.Doris Watson is an engineer by profession, a designer of kitchen appliances. But when she gets an emergency late night call, her mundane existence takes a decided turn into the bizarre and deadly realm of human trafficking as her secret existence resurfaces. She is an on-call agent for a firm called Seekers Worldwide, a front for a loose group of high-tech mercenaries, managed by one Della Jamay Charboneau and run by NSA agent, Sam Namath.Someone made the mistake of taking Della’s niece. And that was a truly epic mistake indeed.Della Jamay is no ordinary aunt. She is an assassin with a very short temper and a very large arsenal. Doris’ assignment from Sam—to keep Della’s body count low. Plagued by prophetic dreams and embroiled in Della’s most private matters, rookie Doris finds herself in way over her head. Together the two women fight for their lives against ruthless New Orleans criminals and a mysterious voodoo priestess claiming to be stealing souls with fire in this thriller about family love versus true evil.Non-stop action and suspense propels these two tough women through a mystery shrouded in the darkest aspects of human behavior and crime. Time is of the essence—every hour, every day the girl is missing means the trail is growing colder and her fate more dire. Della Jamay is forced back to her home, her hidden past and memories she would like to keep buried. Doris is pulled with her into a morass so dangerous and unthinkable it is beyond even her darkest nightmares. Intriguing subplots, explosive situations, humor, heartwarming moments and a cast of highly memorable characters combine with a touch of the paranormal to weave a tapestry of memorable proportions in this contemporary romance adventure.",
  "genres": [
    "Mystery"
  ],
  "author": "Sam Berretti",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/38720954-good-girl-gone"
}