{
  "title": "Love, Janis",
  "description": "A revealing and intimate biography about Janis Joplin, the Queen of Classic Rock, written by her younger sister.Janis Joplin blazed across the sixties music scene, electrifying audiences with her staggering voice and the way she seemed to pour her very soul into her music. By the time her life and artistry were cut tragically short by a heroin overdose, Joplin had become the stuff of rock–and–roll legend.Through the eyes of her family and closest friends , we see Janis as a young girl, already rebelling against injustice, racism, and hypocrisy in society. We follow Janis as she discovers her amazing talents in the Beat hangouts of Venice and North Beach–singing in coffeehouses, shooting speed to enhance her creativity, challenging the norms of straight society. Janis truly came into her own in the fantastic, psychedelic, acid–soaked world of Haight–Asbury. At the height of her fame, Janis's life is a whirlwind of public adoration and hard living. Laura Joplin shows us not only the public Janice who could drink Jim Morrison under the table and bean him with a bottle of booze when he got fresh; she shows us the private Janis, struggling to perfect her art, searching for the balance between love and stardom, battling to overcome her alcohol addiction and heroin use in a world where substance abuse was nearly universal.At the heart of Love, Janis is an astonishing series of letters by Janis herself that have never been previously published. In them she conveys as no one else could the wild ride from awkward small–town teenager to rock–and–roll queen. Love, Janis is the new life of Janis Joplin we have been waiting for–a celebration of the sixties' joyous experimentation and creativity, and a loving, compassionate examination of one of that era's greatest talents.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "History",
    "Pop Culture"
  ],
  "author": "Laura Joplin",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/387218.Love_Janis"
}