{
  "title": "Alpha Deceived",
  "description": "After thousands of years, they’re back…  Proud dragon warrior and healer Sana has a secret… one that may forever turn his friends against him, and one that he’ll do anything to keep. He’s worked too hard to keep who he truly is from the world, and he refuses to let the charade drop, even after waking up thousands of years in the future. But when Peter walks into his life and wakes his heartsong, he knows it’s a secret he won’t be able to hide much longer. With his muscular body and incredible strength, Sana is decidedly alpha in appearance, but Peter is no omega, and that means…  Human lie detector and reformed dragon hunter Peter will stop at nothing to figure out why there’s music in his heart whenever Sana is around… and why that music makes him feel like he’s known Sana his whole life. Peter’s been with other alphas, but the way Sana makes him feel is unlike anything he’s experienced before. But as his attraction to Sana builds at breakneck speeds, so too does the danger they face. The Master Guardian is still on the loose, and the hunters are still under his control… and as a former hunter, Peter may be the key to taking them down.  Can fated mates still so new in their relationship survive the perils of the Hunters’ Guild and rise victorious? Buckle up and let our dragons take you on a ride you’ll never forget… straight into the Alpine Compound, and the dangers therein.  Alpha Deceived is the third book in the Waking the Dragons series and features men as hot as dragonfire, a life-changing secret, a prehistoric version of a certain laundry pod challenge, and a HEA just as legendary as the dragons in it. This 52k book contains mpreg and is 18+ only… did you really expect anything less from Susi Hawke and Piper Scott?",
  "genres": [
    "M M Romance",
    "Romance",
    "Dragons",
    "Omegaverse",
    "Paranormal",
    "Fantasy",
    "Shapeshifters"
  ],
  "author": "Susi Hawke",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/38723862-alpha-deceived"
}