{
  "title": "Best Seller",
  "description": "Alternate cover edition of ASIN B07BC5BR4D\nJEALOUSY IS A GREEN-EYED MONSTER, AND HIS NAME IS WILLIAM BARNES\nAll characters are not created equal. And isn’t that half the fun? In Best Seller, we meet two very different people, and both have big problems.Ten-year-old Nem has just witnessed her mother’s brutal murder, and she thinks it was all her fault. Now, her life appears destined for tragedy. Until she finds her mother‘s old green journal which holds an incredible secret.She discovers it has the power to control others’ luck. But the diary keeps a strange kind of karmic balance; in gifting someone luck, she must steal someone else's first. All it takes is a simple entry.They say “luck is probability taken personally,” and Nem now has revenge on her mind, and she’s getting personal with her own brand of justice.Decades later, the literary world hails William Barnes’ debut novel as a masterpiece. His best seller success doesn’t survive his next two books. Readers abandon him, his publisher cancels his contract, and his agent isn’t returning his calls. Life can‘t get any worse.What really makes his skin crawl too is his undeserving protégé Orelia Mason enjoying a meteoric rise in the charts. This success of hers coinciding suspiciously with his rapid fall from grace.So William embarks on a plan to win back the life he’s certain she has somehow stolen.If people die along the way, well, that’s their problem. What he will discover though, is that battling fate when luck is not on your side can be a deadly game.This is A Star is Born meets A Portrait of Dorian Gray, and the consequences are not pretty. In fact, they’re darn well ugly.From Susan May, the international best selling author readers are calling the new Stephen King, comes a dark and twisted tale of jealousy, revenge and an extraordinary, unique power.",
  "genres": [
    "Mystery",
    "Fantasy",
    "Thriller",
    "Suspense",
    "Fiction",
    "Paranormal",
    "Horror"
  ],
  "author": "Susan May",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/38727186-best-seller"
}