{
  "title": "কষ্টিপাথর",
  "description": "কষ্টিপাথর' বইয়ের ভূমিকার প্রথম অংশঃপ্রশংসা একমাত্র আল্লাহর, যিনি সকল দোষত্রুটি থেকে পবিত্র। আমাদের দুরবস্থার জন্য আমাদের কর্মই দায়ী। আমরাই আমাদের গুনাহ-অবাধ্যতার রাস্তা বেছে নিয়ে অনিবার্য আযাবের উপযুক্ত হয়েছি। উনি বিধান করে দিয়েছেন, আমার রাসূলের ইত্তেবা-অনুসরণ –অনুকরণ করলে সম্মান দিব ; আর রাসূলকে ছেড়ে কুফফারের অনুকরণ করলে অপমান চাপিয়ে দেব। আমরা কুফফারের সাথে কদমে কদম মিলিয়ে গুইসাপের গর্তেও যেতে কবুল । আমরা বাই চয়েস বিধানে পড়ে গেছি। আমরাই জুলুম করেছি নিজেদের সাথে, দ্বীনের সাথে, নবীজীর শিক্ষা ও সুন্নতের সাথে। লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নী কুনতু মিনাজ জ্বোয়ালিমীন।আল্লাহ তাঁকে পাঠালেন সমগ্র বিশ্বের প্রতি রহমত হিসেবে। কাফির-মুশরিক-মুমিন-যিন্দীক সবার জন্য রহমত হিসেবে। কাফির-মুশরিক-যিন্দীকরা তো ওনার উপর জুলুম করলোই, এমনকি আমরা মুমিনরাও কম করলাম না। ওনার চরিত্র হনন করে ইউরোপ যে পরিমাণ গ্রন্থ রচনা করেছে, এতো বেশি রচনা অন্য টপিকে নেই । আর আমরা সুন্নাহ হনন করে যে পরিমাণ আত্মতৃপ্তি পেয়েছি, এতটা অন্য কিছুতে পাইনি। ওরা সীরাতের উপর জুলুম করেছে, আর আমরা সুন্নতের উপর। সুন্নাহকে আমরা এমনভাবে ছেড়েছি, আজ সুন্নাহ দেখলে ‘প্রেমের বদলে ভয়’, ‘ভক্তির বদলে যুক্তি’ আর ‘গ্রহণের বদলে বর্জনের ফতোয়া’ এর কথা মনে আসে। আহ ... সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম।এই বইটা লেখা শুরু করেছিলাম ‘ডাবল স্ট্যান্ডার্ড’-এরও আগে। আগের মতই এটাতেও সবার জন্যই খোরাক আছে। জাস্ট একটু ভাবাতে চাই, মুসলিম-অমুসলিম-অবিশ্বাসী সবাইকে। কী ভাবলেন তা মুখ্য না, শুধু একটু ভাবাতে পারলেই চলে। যা ইচ্ছা ভাবেন। বইটি পড়ার আগে কিছু কথা না বললেই নয়।(ক) অবিশ্বাসীগণ যা ইচ্ছা বলতে পারেন। তবে ‘সুন্নাতের বৈজ্ঞানিক ভিত্তি’ কথাটা কোন বিশ্বাসীর মুখে মানায় না। কথাটা হবে ‘সুন্নাতের বৈজ্ঞানিক ব্যাখ্যা’ বা ‘মানবজ্ঞানের আলোকে সুন্নাতের ব্যাখ্যা’ বা ‘বিজ্ঞানের সুন্নাহভিত্তিক ব্যাখ্যা’। সুন্নাত হল বৃদ্ধের মত, যার মনন পরিপূর্ণ, সিদ্ধান্ত সুপরিণত, যুক্তি সম্পূর্ণ (কেননা তা স্বয়ং স্রষ্টা আল্লাহ থেকে উৎসারিত, সংযোজনের সুযোগ নেই)। আর বিজ্ঞান হল শিশুর মত, যার এখনও অনেক কিছু দেখা বাকি, যার মনন এখনও গঠন হচ্ছে, সিদ্ধান্ত পরিবর্তনশীল, যুক্তি ইন্দ্রিয়ের সীমায় আবদ্ধ। শিশুকে ভিত্তি করে বৃদ্ধের সিদ্ধান্ত পর্যালোচনা হাস্যকর। বরং বৃদ্ধের সিদ্ধান্তের কতটুকু শিশুর মস্তিষ্কে ধরে সেটা আলোচনার বিষয় হতে পারে। বিজ্ঞানকে দলিল মেনে পবিত্র সুন্নাহকে কাঠগড়ায় তোলা নিঃসন্দেহে ধৃষ্টতা। মানুষ এ পর্যন্ত তার পঞ্চ ইন্দ্রিয় দ্বারা সর্বকল্যাণময় সুন্নাতের যেটুকু কল্যাণ উপলব্ধি করেছে তাই এ বইয়ের আলোচ্য। ‘সুন্নাত গুলো বিজ্ঞানসম্মত কিনা’- এ বিচার কম করা হয়নি। সুন্নাতের বিচার নয়, আজ বিজ্ঞানের বিচার করতে বসেছি আমরা। আর সেকুলার বিজ্ঞানে ঈমান এনেছে যারা, তাদেরও।",
  "genres": [
    "Science",
    "Islam",
    "Nonfiction",
    "Religion",
    "Research"
  ],
  "author": "শামসুল আরেফীন",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/38740180"
}