{
  "title": "The Book of Delights: Essays",
  "description": "Ross Gay’s The Book of Delights is a genre-defying book of essays—some as short as a paragraph; some as long as five pages—that record the small joys that occurred in one year, from birthday to birthday, and that we often overlook in our busy lives. His is a meditation on delight that takes a clear-eyed view of the complexities, even the terrors, in his life, including living in America as a black man; the ecological and psychic violence of our consumer culture; the loss of those he loves. Among Gay’s funny, poetic, philosophical delights: the way Botan Rice Candy wrappers melt in your mouth, the volunteer crossing guard with a pronounced tremor whom he imagines as a kind of boat-woman escorting pedestrians across the River Styx, a friend’s unabashed use of air quotes, pickup basketball games, the silent nod of acknowledgment between black people. And more than any other subject, Gay celebrates the beauty of the natural world—his garden, the flowers in the sidewalk, the birds, the bees, the mushrooms, the trees.This is not a book of how-to or inspiration, though it could be read that way. Fans of Roxane Gay, Maggie Nelson, and Kiese Laymon will revel in Gay’s voice, and his insights. The Book of Delights is about our connection to the world, to each other, and the rewards that come from a life closely observed. Gay’s pieces serve as a powerful and necessary reminder that we can, and should, stake out a space in our lives for delight. Preface1. My Birthday, Kinda2. Inefficiency3. Flower in the Curb4. Blowing It Off5. Hole in the Head6. Remission Still7. Praying Mantis8. The Negreeting9. The High-Five from Strangers, Etc10. Writing by Hand11. Transplanting12. Nicknames13. But, Maybe ..14. \"Joy Is Such a Human Madness15. House Party16. Hummingbird17. Just a Dream18. \"That's Some Bambi Shit\" ..19. The Irrepressible: The Gratitudes20. Tap Tap21. Coffee without the Saucer22. Lily on the Pants23. Sharing a Bag 24. Umbrella in the Café25. Beast Mode26. Airplane Rituals27. Weirdly Untitled28. Pecans29. The Do-Over30. Infinity31. Ghost32. Nota Bene33. \"Love Me in a Special Way\"34. \"Stay,\" by Lisa Loeb35. Stacking Delights36. Donny Hathaway on Pandora37. \"To Spread the Sweetness of Love\"38. Baby, Baby, Baby39. \"REPENT OR BURN\"40. Giving My Body to the Cause41. Among the Rewards of My Sloth . .42. Not Grumpy Cat43. Some Stupid Shit44. Not Only . .45. Microgentrification: WE BUY GOLD46. Reading Palms47. The Sanctity of Trains48. Bird Feeding49. Kombucha in a Mid-century Glass50. Hickories51. Annoyed No More52. Toto53. Church Poets54. Public Lying Down55. Babies. Seriously56. \"My Life, My Life, My Life, My Life in the Sunshine57. Incorporation58. Botan Rice Candy59. Understory60. \"Joy Is Such a Human Madness\": The Duff Between Us61. \"It's Just the Day I'm Having\" ..62. The Purple Cornets of Spring63. The Volunteer64. Fishing an Eyelash: Two or Three Cents on the Virtues of the Poetry Reading65. Found Things66. Found Things (2)67. Cuplicking68. Bobblehead69. The Jenky 70. The Crow's Ablutions71. Flowers in the Hands of Statues72. An Abundance of Public Toilets73. The Wave of Unfamiliars74. Not for Nothing75. Bindweed ... Delight?76. Dickhead77. Ambiguous Signage Sometimes78. Heart to Heart79. Caution: Bees on Bridge80. Tomato on Board81. Purple-Handed82. Name: Kayte Young; Phone Number: 555-867-530983. Still Processing84. Fireflies85. My Scythe Jack86. Pawpaw Grove87. Loitering88. Touched89. Scat90. Get Thee to the Nutrient Cycle!91. Pulling Carrots92. Filling the Frame93. Reckless Air Quotes 94. Judith Irene Gay, Aged Seventy-six Today!95. Rothko Backboard96. The Marfa Lights97. The Carport98. My Garden (Book):99. Black Bumblebees!100. Grown101. Coco-baby102. My Birthday",
  "genres": [
    "Essays",
    "Nonfiction",
    "Poetry",
    "Memoir",
    "Audiobook",
    "Book Club",
    "Short Stories"
  ],
  "author": "Ross Gay",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/38746152-the-book-of-delights"
}