{
  "title": "Small Victories: The True Story of Faith No More",
  "description": "'Credit where it is due, it's a quality piece. The man has done his research and it shows. It provided me with more than a few revelations ... and I'm in the band.' --  Bill Gould, Faith No MoreSmall The True Story of Faith No More is the definitive biography of one of the most intriguing bands of the late twentieth century. Written with the participation of the group's key members, it tells how such a heterogeneous group formed, flourished, and fractured, and how Faith No More helped redefine rock, metal and alternative music. Based on meticulous research and hundreds of interviews with current and former band members and other key figures, Small Victories combines a fan's passion with a reporter's perspicacity.\"Harte's eye for detail coupled with bullseye analysis and a breezy prose style illuminates the band's dramatic and chaotic trajectory with authoritative calm...Moreish quotes and anecdotes further sugar the ride, and ultimately steer the book into the category marked \"Essential\".\"-- Classic Rock\"Beautifully captures the bellicosity, the vitality, the surreptitious virtuosity and the inveterate internal hostility that permeated Faith No More.\" -- The Quietus\"Harte's work probes every cranny and crevice with the zeal of a hungry aye-aye looking for grubs...A fascinating insight into one of the greatest bands ever to capture - and perhaps fracture - the public imagination.\"-- Record Collector\"Small Victories is a fabulously detailed dissection of the life and times of one of rock's most idiosyncratic, fractious and gleefully perverse collectives. Revelations abound...\"-- Planet Rock\"Small Victories proves as entertaining a biography as one could hope to read. Harte's narrative is so engaging, one does not want the band's tale to end. For the Faith No More enthusiast, there is much to dig into here. But perhaps more tellingly and to the book's great credit, even the Faith No More newbie will be entranced and enrapt by the tale.\"-- Under The Radar\"Reading this detailed study of their life and times felt like the opening of a brand new musical world...there's plenty for Faith No More devotees and newcomers to get their teeth into. And as with any good music book, you find yourself wanting to discover more about a band whose music has largely defied categorisation.\"-- Irish Independent\"Excellent. Although it is packed with facts, it doesn't turn into some boring fact sheet but is vibrant and profound with a sympathetic empathy for the subject. One of the best band biographies that there has been for a long time.\"-- Rocks magazine Germany \"Small Victories is a joy to read. Faith No More has an impossibly complex history and a habit of deliberately obfuscating the truth, and Harte has managed to streamline all of it into a cohesive and compelling narrative.\"-- Spectrum Culture\"Adrian Harte's extraordinarily dense biography presents a strong case for the band's multifacetedness.\"-- The Wire\"Harte captures the whole story, along with innumerable detours, in rich prose that makes for a hell of a satisfying read and will have you turning pages long past the point you intended to put the book down.\"-- Rock N' Roll Globe\"A meticulously researched and highly readable work...Small Victories will surely prove to be the definitive book on a band who were long overdue the biographical treatment.\"-- Wee Review\"First-hand testimonies are cunningly interwoven with an empirical narrative that serves as an encyclopedia for every triumph and struggle the band has faced.\"-- Sound Renaissance\"The most comprehensive Faith No More book you'll ever get your hands on, hands down, and a must own for fans of the band or of the evolution of rock music.\"-- Rock N' Roll Fables\"Small Victories, no doubt the result of meticulous and titanic work, is as gripping as a novel and reads like a thriller...Bio of the year.\"-- Darras on the Loose",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography"
  ],
  "author": "Adrian Harte",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/38741112-small-victories"
}