{
  "title": "A New Reality: Human Evolution for a Sustainable Future",
  "description": "A New Human Evolution for a Sustainable Future  provides a startling, fresh new message of understanding, perspective and hope for today’s tense, rapid-fire, kaleidoscopically changing world. A New Human Evolution for a Sustainable Future  provides a startling, fresh new message of understanding, perspective and hope for today’s tense, rapid-fire, kaleidoscopically changing world. Drawn from the writings of visionary scientist Jonas Salk, who developed the polio vaccine, extended and developed by his son Jonathan, the message of the book explodes from the past and sheds light on tensions that besiege us and the currents of discord that are raging as these words are written. More importantly, it indicates a way forward out of our current situation.Written by a world-famous doctor and folk hero, based on population data, rich in visual imagery, elegantly designed, and clearly written,  A New Reality is unique in the marketplace. Readable in one or two sittings, it is accessible to the general reader while at the same time being of essential value to policy makers and academics. Its brevity and simplicity of design belie the importance and sophistication of its message. “We are at a point in the course of human social evolution when the demands of survival converge with the higher ideals of humankind and the well-being and flourishing of human society. It is up to us to see that we navigate this transition, adapting to and emerging in a new reality.” —A New RealityOur country is divided and polarized. Terrorism is a major threat throughout much of the world. Mass migrations are causing national and international tension. Population growth continues to increase, especially in the developing regions of the world. Controversy rages as to the use of fossil fuels versus the development of alternative forms of energy. Disagreement continues about climate change. Opposing currents of opinion collide as to how much we should help other areas in the world and how much to help ourselves. Basic values are in conflict.More than 40 years ago, Jonas Salk understood that we are at a unique moment in the history of the human species. After centuries of increase, population growth has begun to slow and is trending toward equilibrium. This change is accompanied by an equally significant change in human values—a shift from those based on unlimited availability of resources, unremitting growth, excess, independence, competition and short-term thinking to those based on limits, equilibrium, balance, interdependence, cooperation and long-term thinking. This momentous transition is the source of far-reaching tension and conflict.The way through this difficult era is to understand its basis and to focus on new values that will be of the greatest benefit to humankind. There is an urgency, however, and failure to adapt will result in disaster both for humanity and for the planet as a whole. A New Reality  delivers a message of both caution and hope. Readers across the social and political spectrum will find it a reasoned and balanced counterpoint to current social and political trends. Its elegant design and long-range perspective will appeal to general readers, policy makers, millennials, baby boomers, teachers, and students, filling a need in the marketplace for a work of positivity and wisdom in otherwise bleak times.",
  "genres": [
    "Nonfiction",
    "Science",
    "Climate Change",
    "Philosophy",
    "Sustainability",
    "Politics",
    "Environment"
  ],
  "author": "Jonas Salk",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/38745667-a-new-reality"
}