{
  "title": "Life Is Short, Don't Wait to Dance: Advice and Inspiration from the UCLA Athletics Hall of Fame Coach of 7 NCAA Championship Teams",
  "description": "Highly acclaimed UCLA Women's gymnastics coach of 7 NCAA championships Valorie Kondos Field shares insights on how to use uniqueness and authenticity to achieve success.Former professional ballerina Valorie Kondos Field--or Miss Val, as she's affectionately known--has never tumbled, flipped, or even played any type of organized sports, and yet she has been able to craft a legendary coaching career through curiosity, creativity, attention to detail, and unwavering care for the overall well-being of her athletes. For Miss Val, it's not about winning and losing, it's about choreographing your life and owning the choices you make.Miss Val has shaped her UCLA Gymnastics program as a life skills class and now she's sharing those lessons with you, whether you're an athlete, business leader, or simply someone who wants to own their destiny. Miss Val's philosophies are timeless. Her coaching style is unorthodox. Life Is Short, Don't Wait to Dance is a thought-provoking, fun journey through the anecdotes of the 35-year career of a dancer/choreographer turned athletic coach.The book includes unforgettable stories of the Olympians and athletes with whom she's worked-including the inspirational journey of Katelyn Ohashi, whose joyful transformation under the tutelage of Miss Val was evident to the world when her perfect 10 floor routine went viral -- reaching over 100 million viewers. Other triumphs include Olympian Jamie Dantzscher, who found her confidence at UCLA and learned the tools to combat her previous abuse; and sensation Christine Peng Peng Lee, who helped the Bruins clinch the 2018 NCAA championship with back-to-back 10's. Miss Val also shares her favorite memories of her mentor, legendary basketball coach John Wooden, as well as her thoughts on Larry Nassar and the gymnastics sexual abuse scandal.Miss Val reveals how her coaching journey had a rocky start before she found her own best approach. In time she realized that her dance background wasn't a detriment, it was a gift. When she embraced this, Miss Val led the Bruins to victory. Life Is Short, Don't Wait to Dance is packed with great advice for anyone on a quest for success, delivered in Miss Val's reassuring and inspirational tone. She took the same approach to her breast cancer diagnosis, explaining how she made that struggle into one of the best years of her life. For Miss Val, it's all about attitude. Life Is Short, Don't Wait to Dance is a powerful book that shows you how to make the leap of faith in choosing your own path to greatness.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Biography",
    "Memoir",
    "Leadership",
    "Autobiography",
    "Audiobook"
  ],
  "author": "Valorie Kondos Field",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/38744007-life-is-short-don-t-wait-to-dance"
}