{
  "title": "Lion Hearted: The Life and Death of Cecil and the Future of Africa's Iconic Cats",
  "description": "“Until the lion has its own storyteller, tales of the lion hunt will always glorify the hunter.” —Zimbabwean proverbIn 2015, an American hunter named Walter Palmer shot and killed a lion named Cecil. The lion was one of dozens slain each year in Zimbabwe, which legally licenses the hunting of big cats. But Cecil’s death sparked unprecedented global outrage, igniting thousands of media reports about the peculiar circumstances surrounding this hunt. At the center of the controversy was Dr. Andrew Loveridge, the zoologist who had studied Cecil for eight years. In Lion Hearted , Loveridge pieces together, for the first time, the fascinating life and murky details of this beloved lion’s slaying.In the tradition of Born Free and Gorillas in the Mist , Lion Hearted chronicles Loveridge’s long acquaintance with a host of charismatic lions that his team has tracked, often from birth to death. Born and raised in Zimbabwe, Loveridge learned to love predators at the knee of his father, an eminent herpetologist who stored baby crocodiles in the family bathtub. After earning his doctorate at Oxford, he seized an invitation to study the lions of Zimbabwe’s Hwange National Park. There he meets Stumpy Tail, who, despite her name, has the dignity of the Queen of the Animal Kingdom; Dynamite, a venerable coalition leader who, muscled out by younger males, sets off on an incredible thirty-seven-day, 137-mile journey to find a new home; and Kataza, who escapes another lion’s claws, and whom Loveridge twice saves from death at the hands of humans. And, of course, there is Cecil. Dethroned in an epic battle, he forms an alliance with a former rival. He also becomes a favorite of photographers and tourists—until the fateful night when a Minnesota dentist and his hunting guide entice the trusting cat with a free meal.Loveridge unravels the complexities of lion society and the dangers the cats face both within their ranks and from the outside world. Despite their ruthless reputation, lions can form deep emotional bonds—females live in prides, a sisterhood of mothers, daughters, sisters, and aunts that can exhibit military precision when hunting in formation; males band together in coalitions to vie for control of territory and the female prides. They also display a wide range of emotional behavior, including mourning the loss of their mates, partners, and cubs.Africa’s lion population is estimated to have shrunk by 43 percent in the last twenty years. There may now be as few as 20,000 wild lions across the entire continent—far fewer than the number of elephants. While deploring the killing of lions for sport, Loveridge does not believe that banning trophy hunting, by itself, will halt the decline of Africa’s lion populations. He sees greater threats in human population growth, the loss of habitat to agriculture, and the illegal trade in lion body parts for use in traditional medicines. And he offers concrete proposals for averting the lion’s extinction.More than a gripping detective story, Lion Hearted is an exploration of humanity’s relationship with the natural world and an attempt to keep this majestic species from disappearing. “Lions are one of the most beloved animals on the planet,” Loveridge observes. “They are the national symbol of no fewer than fifteen countries. . . . Surely, we can think of a better way to save the wild animals we love besides killing them.”",
  "genres": [
    "Nonfiction",
    "Science",
    "Africa",
    "Wildlife",
    "Natural History"
  ],
  "author": "Andrew Loveridge",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/38747903-lion-hearted"
}