{
  "title": "From a Certain Point of View: Return of the Jedi",
  "description": "Celebrate the lasting impact of Return of the Jedi with this exciting reimagining of the timeless Star Wars film featuring new perspectives from forty contributors.On May 25, 1983, Star Wars cemented its legacy as the greatest movie franchise of all time with the release of Return of the Jedi. In honor of the fortieth anniversary, forty storytellers re-create an iconic scene from Return of the Jedi through the eyes of a supporting character, from heroes and villains, to droids and creatures. From a Certain Point of View features contributions by bestselling authors and trendsetting artists:• Olivie Blake provides a chilling glimpse into the mind of Emperor Palpatine.• Saladin Ahmed recounts the tragic history of the rancor trainer.• Charlie Jane Anders explores the life and times of the Sarlacc.• Fran Wilde reveals Mon Mothma's secret mission to save the Rebel Alliance.• Mary Kenney chronicles Wicket the Ewok's quest for one quiet day on the forest moon of Endor.• Anakin Skywalker becomes one with the Force in a gripping tale by Mike Chen.Plus more hilarious, heartbreaking, and astonishing tales from:Tom Angleberger, Kristin Baver, Akemi Dawn Bowman, Emma Mieko Candon, Olivia Chadha, Gloria Chao, Adam Christopher, Paul Crilley, Amal El-Mohtar, M. K. England, Jason Fry, Adam Lance Garcia, Lamar Giles, Max Gladstone, Thea Guanzon, Ali Hazelwood, Patricia A. Jackson, Alex Jennings, Jarrett Krosoczka, Sarah Kuhn, Danny Lore, Sarah Glenn Marsh, Kwame Mbalia, Marieke Nijkamp, Danielle Paige, Laura Pohl, K. Arsenault Rivera, Dana Schwartz, Tara Sim, Phil Szostak, Suzanne Walker, Hannah Whitten, Sean Williams, Alyssa Wong",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Audiobook",
    "Fantasy",
    "Anthologies"
  ],
  "author": "Elizabeth Schaefer",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/122769178-from-a-certain-point-of-view"
}