{
  "title": "The Future Is Blue",
  "description": "Thirteen stories unlike any others.In the title story, Theodore Sturgeon Award-winning novelette “The Future Is Blue,” an outcast girl named Tetley lives on floating Garbagetown, in a world that dreams of the long lost land. Lovecraft’s Cthulhu mythos is explored and reinvented in style in “Down and Out in R’lyeh.” In the novelette “The Limitless Perspective of Master Peek, or, the Luminescence of Debauchery,” Perpetua masquerades as a man in order to continue her father’s business as a glassblower and must fashion a special eye for a queen. And in “The Beasts Who Fought for Fairyland Until the Very End,” the wyvern A-Through-L, the warrior Green Wind and his giant cat the Leopard of Little Breezes cope with their broken-hearted disappointment over politicks as the evil Marquess ascends to rule. Of her previous collection, The Bread We Eat in Dreams, the New York Times said, “Valente’s writing DNA is full of fable, fairy tale and myth drawn from deep wells worldwide.” With The Future Is Blue she continues to build and invent unforgettable worlds and characters with lyrical abandon, creating stories that feel old and new at once.The Future is Blue also includes three never-before-printed stories, for almost 30,000 words of work exclusive to this collection: “Major Tom,” “Two and Two is Seven,” and the long novelette “Flame, Pearl, Mother, Autumn, Virgin, Sword, Kiss, Blood, Heart, and Grave.”Limited: 1250 signed numbered hardcover copiesTable of Contents:The Future Is BlueNo One Dies in NowhereTwo and Two is SevenDown and Out in R'lyehThe Limitless Perspective of Master Peek, or, the Luminescence of DebaucherySnow DayPlanet LionFlame, Pearl, Mother, Autumn, Virgin, Sword, Kiss, Blood, Heart, and GraveMajor TomThe Lily and the HornThe Flame After the CandleThe Long Goodnight of Violet WildThe Beast Who Fought for Fairyland Until the Very End",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Science Fiction",
    "Anthologies",
    "Adult",
    "Collections",
    "Fiction"
  ],
  "author": "Catherynne M. Valente",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/38768896-the-future-is-blue"
}