{
  "title": "Art of the Black Dog: Ending Black Dog Syndrome",
  "description": "REVIEWS - ART OF THE BLACK DOG - 5 STARS - A poetic collection of exceptional photography, endearing poetry. \"Art of the Black Dog\" as the title suggests, is a loving tribute to Black Dogs. A poetic collection of exceptional photography, endearing poetry, as presented by Atlanta-centric author Steven Monahan, a well-known animal advocate and non-profit founder of Green Pets America Charities. Art of the Black Dog is rich with emotion including photos of playful little faces of unconditional love to heart-grabbing prose describing the human-animal connection. Mr. Monahan has successfully depicted BDS (Black Dog Syndrome) in a way that is not critical, judgmental, or negative. Quite the opposite in fact. This book is a lovely gift for anyone who loves all dogs, is perhaps involved in animal welfare, or works in animal care in any capacity. It is also a beautiful complement to any coffee table, including mine. 5 STARS - Breathtaking Photos. As an animal lover and lifelong advocate for dogs this is now in my collection of coffee table books. Why? Because what better way to bring awareness and knowledge than breathtaking photos and short quotes about man's best friend. I stumbled across this book via a friend on Facebook and I couldn't be happier! Grateful for this wonderful addition to my collection. Elegant. Beautifully designed Large 8.5x8.5 \"Full-Color\" Book. 5 Star Rated. Black dogs - The least adopted shelter dogs in America. 5 STARS - A poetic collection of exceptional photography, endearing poetry. \"Art of the Black Dog\" as the title suggests, is a loving tribute to Black Dogs. A poetic collection of exceptional photography, endearing poetry, as presented by Atlanta-centric author Steven Monahan, a well-known animal advocate and non-profit founder of Green Pets America Charities. Art of the Black Dog is rich with emotion including photos of playful little faces of unconditional love to heart-grabbing prose describing the human-animal connection. Mr. Monahan has successfully depicted BDS (Black Dog Syndrome) in a way that is not critical, judgmental, or negative. Quite the opposite in fact. This book is a lovely gift for anyone who loves all dogs, is perhaps involved in animal welfare, or works in animal care in any capacity. It is also a beautiful complement to any coffee table, including mine.",
  "genres": [],
  "author": "Steven Monahan",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/38772524-art-of-the-black-dog"
}