{
  "title": "Headcase: LGBTQ Writers and Artists on Mental Health and Wellness",
  "description": "Headcase is a groundbreaking collection of personal reflections and artistic representations illustrating the intersection of mental wellness, illness, and LGBTQ identity, as well as the lasting impact of historical views equating queer and trans identity with mental illness. The pieces offer personal views from both providers and clients, often one and the same, about their experiences. In the anthology, readers will access the inner thoughts of an array of individuals, including: a therapist with dual status who also happens to be transgender and practicing in the Midwest; a lesbian writer and psychotherapist recounting her mother's experience with forced institutionalization, shock therapy, and \"conversion therapy\" in the 1950s; a queer illustrator presenting unique glyph illustrations that represent a panoply of identity-related questions and answers; an award-winning gay male writer discussing his struggle with depression publicly for the first time; and a trans activist of color writing about surviving madness in the inner city and how his community of mental health and social justice youth activists help each other thrive. Several contributors also document the difficulty of navigating flawed health care systems that limit affordable access to genuinely affirming, effective services.Cultural norms and barriers to accessibility have an enormous impact on the quality of care available to LGBTQ communities. Traversing boundaries of race and ethnic identity, age, gender identity, and socioeconomic status, Headcase should appeal to LGBTQ communities and, specifically, LGBTQ mental health consumers and their friends, families, and comrades.",
  "genres": [
    "Nonfiction",
    "Queer",
    "LGBT",
    "Mental Health",
    "Disability",
    "Essays",
    "Transgender"
  ],
  "author": "Stephanie Schroeder",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/38794749-headcase"
}