{
  "title": "Heirs of the Founders: The Epic Rivalry of Henry Clay, John Calhoun and Daniel Webster, the Second Generation of American Giants",
  "description": "From New York Times bestselling historian H. W. Brands comes the riveting story of how, in nineteenth-century America, a new set of political giants battled to complete the unfinished work of the Founding Fathers and decide the future of our democracyIn the early 1800s, three young men strode onto the national stage, elected to Congress at a moment when the Founding Fathers were beginning to retire to their farms. Daniel Webster of Massachusetts, a champion orator known for his eloquence, spoke for the North and its business class. Henry Clay of Kentucky, as dashing as he was ambitious, embodied the hopes of the rising West. South Carolina's John Calhoun, with piercing eyes and an even more piercing intellect, defended the South and slavery. Together these heirs of Washington, Jefferson and Adams took the country to war, battled one another for the presidency and set themselves the task of finishing the work the Founders had left undone. Their rise was marked by dramatic duels, fierce debates, scandal and political betrayal. Yet each in his own way sought to remedy the two glaring flaws in the Constitution: its refusal to specify where authority ultimately rested, with the states or the nation, and its unwillingness to address the essential incompatibility of republicanism and slavery.  They wrestled with these issues for four decades, arguing bitterly and hammering out political compromises that held the Union together, but only just. Then, in 1850, when California moved to join the Union as a free state, \"the immortal trio\" had one last chance to save the country from the real risk of civil war. But, by that point, they had never been further apart. Thrillingly and authoritatively, H. W. Brands narrates an epic American rivalry and the little-known drama of the dangerous early years of our democracy.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Biography",
    "Politics",
    "Audiobook",
    "American"
  ],
  "author": "H.W. Brands",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/38772485-heirs-of-the-founders"
}