{
  "title": "The Bat Woman",
  "description": "Lurid 1930s horror thriller, an entertainingly bad potpourri of mad scientists, vampires, sinister Orientals and dumb cops. Cited in Alternative Hall of Fame by Bill Pronzini in Son of Gun-in-Cheek.\" - Robert Knowlton. Combines weird menace, detective and science-fictional pulp conventions to produce a story of vampirism in New York City, against a back story involving vampire bats from South America and a half-dozen intercalated 'cases' of vampirism from around the world. The evil German genius Schalkenbach has set up a secret barricaded laboratory in Greenwich Village, where, when he is not conducting experiments on the revived corpse of a beautiful young society woman, he is moodily reciting Wagner on an organ behind a black velvet curtain. The writing is actually rather good when the author confines himself to descriptions of traditional settings (the cozy club on a stormy winter day, etc.), but his characters are barely one-dimensional, the theme is muddled, the action writing ludicrous. Still, in the exuberance of its unintentional cacophony there lies a certain charm. Not to mention the repeated references to \"duckless glands.\" Bleiler \"The stirring story of the bizarre love of a proud, bitter, misshapen, physical and mental giant for a lovely New York society girl, 'a man you could never forget once you had seen him'. A prodigy of tremendous force who is virtually shunned by polite society. Eric von Schalkenbach resolves to win for himself love and happiness in the civilized world, as his great strength and cunning had won for him fabulous wealth in the role of a strange white god among the savage Indians of the wild Amazon country. When the sex starved monstrosity finds that his adroitness and money fail to attract the lovely Cynthia Winthrop he ruthlessly attempts to win her by seemingly supernatural means-with gruesome and fantastically surprising results.\"",
  "genres": [
    "Fiction"
  ],
  "author": "Cromwell Gibbons",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/38778656-the-bat-woman"
}