{
  "title": "A Stranger to Command",
  "description": "A STRANGER TO COMMANDIn this much-anticipated prequel to CROWN DUEL, Vidanric Renselaeus, fifteen-year-old Marquis of Shevraeth, finds himself sent across the continent to a military academy in Marloven Hess, a kingdom known for its violent history. Vidanric is used to civilized life in pleasant Remalna--except that the evidence is increasingly clear that the civilization is only on the surface. Too many young, smart heirs have suffered accidents of late, and the evidence is beginning to point to the king, Galdran, who has grandiose plans for expansion.In Marloven Hess, no one can pronounce his real names, and they assume his title is his name. He becomes Shevraeth--discovering that there are no marquises or dukes or barons in this kingdom, and no one has the slightest interest in Remalna. Or in foreigners. Until very recently, the academy was closed to outsiders. But the king--also fifteen, and recently come to his throne after a nasty civil war--wants him there.Learning about command turns out to be very different than Shevraeth had assumed, and the Marlovens, who are going through political and social change at all levels, are not at all what he expected. He makes friends as well as enemies; experiences terror and laughter as well as challenges on the field and off.He discovers friendship, loyalty--and love.All the while greater events in the world are moving inexorably toward conflagration, drawing the smartest of the young people into key positions--whether they want it or not. They're going to have to be ready.\"Involving characters, exquisite world building, politics, intrigue, and choices to be made between love, school and country. A Stranger to Command has everything. Drop what you're doing and read it immediately.\"--Justine Larbalestier author of HOW TO DITCH YOUR FAIRY\"War games. Courtly Vidanric, sent for his own protection to train as a warrior in a foreign land four months' journey from home, considers himself alien, sensitive, weak, and ignorant among his fellow cadets. Remaining a study in courage and integrity, despite the grinding discipline that takes away even his name, Vidanric's soldier's skills grow swordblade sharp even as he also learns lessons of the heart. But capability, responsibility, and all-too-real invasion come together as Vidanric realizes that not only is he being trained for kingship, he's capable of it, too . . . A diamond-bright portrait of a harsh and magical journey to adulthood.\" --Elizabeth E. Wein, author of THE MARK OF SOLOMON\"Sherwood Smith's universe is so detailed at this point that you feel like a traveller in a real foreign land--charmed, sometimes bewildered, and finally at home with no desire to leave. This book deals thoughtfully with the creation of a hero, and also creates an exciting, occasionally-painful, and always absorbing adventure.\"--Sarah Rees Brennan, author of THE DEMON LEXICON",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Adventure",
    "Young Adult Fantasy",
    "High Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Sherwood Smith",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/3876030-a-stranger-to-command"
}