{
  "title": "Bad Move",
  "description": "In the too-quiet town of Oakwood, only the lucky die of boredom... and new homeowner Zack Walker isn’t feeling lucky. Whoever said the burbs were boring will think twice after reading Linwood Barclay’s hilarious debut mystery, in which Dad learns the hard way that he doesn’t always know best.Zack wouldn’t blame you for thinking he’s safety-obsessed. True, he masterminded a plot to trade his family’s exciting city lifestyle for one of suburban tranquillity. True, even after this strategic move, Zack still has issues with family members who forget their keys in the front door, leave their cars unlocked, or park their backpacks at the top of the stairs — where you could kill yourself tripping over them. Just ask his wife, Sarah, or his teenage kids, Paul and Angie, who endure their share of lectures. Zack knows that he needs to chill out and assume the best for once — but we know what happens to those who assume.When Zack realizes their two-faced developer sent a petty thief to fix their leaky shower, he starts fighting hard to ignore the fact that Oakwood isn’t the crime-free paradise he was hoping for. But his brief state of denial comes to an abrupt end when, during a walk by the creek, he stumbles across a dead body. Even more shocking, Zack actually knows who the victim is — and who might want him dead. With a killer roaming around their neighborhood and Zack’s overactive imagination in overdrive, he’s sure things can’t get any worse. But then another local is murdered — and Zack’s paranoid tendencies get him implicated in the crime. While his wife is trying to remember why she married him in the first place, and his kids are considering whether it’s time to have him committed, Zack decides there’s only one thing he can do. To protect his family — and avoid being busted for a crime he didn’t commit — he’s going to have to override his safety-first instincts, tap into his delusions of machismo, and track down the killer himself.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Humor",
    "Canada"
  ],
  "author": "Linwood Barclay",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/1227735.Bad_Move"
}