{
  "title": "Farsighted: How We Make the Decisions That Matter the Most",
  "description": "The hardest choices are also the most consequential. So why do we know so little about how to get them right?Big, life-altering decisions matter so much more than the decisions we make every day, and they're also the most difficult: where to live, whom to marry, what to believe, whether to start a company, how to end a war. There's no one-size-fits-all approach for addressing these kinds of conundrums. Steven Johnson's classic Where Good Ideas Come From inspired creative people all over the world with new ways of thinking about innovation. In Farsighted, he uncovers powerful tools for honing the important skill of complex decision-making. While you can't model a once-in-a-lifetime choice, you can model the deliberative tactics of expert decision-makers. These experts aren't just the master strategists running major companies or negotiating high-level diplomacy. They're the novelists who draw out the complexity of their characters' inner lives, the city officials who secure long-term water supplies, and the scientists who reckon with future challenges most of us haven't even imagined. The smartest decision-makers don't go with their guts. Their success relies on having a future-oriented approach and the ability to consider all their options in a creative, productive way. Through compelling stories that reveal surprising insights, Johnson explains how we can most effectively approach the choices that can chart the course of a life, an organization, or a civilization. Farsighted will help you imagine your possible futures and appreciate the subtle intelligence of the choices that shaped our broader social history.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Business",
    "Science",
    "Self Help",
    "Management",
    "Productivity"
  ],
  "author": "Steven Johnson",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/38769051-farsighted"
}