{
  "title": "Reagan: An American Journey",
  "description": "From New York Times bestselling biographer Bob Spitz, a full and rich biography of an epic American life, capturing what made Ronald Reagan both so beloved and so transformational.More than five years in the making, based on hundreds of interviews and access to previously unavailable documents, and infused with irresistible storytelling charm, Bob Spitz's REAGAN stands fair to be the first truly post-partisan biography of our 40th President, and thus a balm for our own bitterly divided times.It is the quintessential American triumph, brought to life with cinematic vividness: a young man is born into poverty and raised in a series of flyspeck towns in the Midwest by a pious mother and a reckless, alcoholic, largely absent father. Severely near-sighted, the boy lives in his own world, a world of the popular books of the day, and finds his first brush with popularity, even fame, as a young lifeguard. Thanks to his first great love, he imagines a way out, and makes the extraordinary leap to go to college, a modest school by national standards, but an audacious presumption in the context of his family's station. From there, the path is only very dimly lit, but it leads him, thanks to his great charm and greater luck, to a solid career as a radio sportscaster, and then, astonishingly, fatefully, to Hollywood. And the rest, as they say, is history.Bob Spitz's REAGAN is an absorbing, richly detailed, even revelatory chronicle of the full arc of Ronald Reagan's epic life - giving full weight to the Hollywood years, his transition to politics and rocky but ultimately successful run as California governor, and ultimately, of course, his iconic presidency, filled with storm and stress but climaxing with his peace talks with the Soviet Union that would serve as his greatest legacy. It is filled with fresh assessments and shrewd judgments, and doesn't flinch from a full reckoning with the man's strengths and limitations. This is no hagiography: Reagan was never a brilliant student, of anything, and his disinterest in hard-nosed political scheming, while admirable, meant that this side of things was left to the other people in his orbit, not least his wife Nancy; sometimes this delegation could lead to chaos, and worse. But what emerges as a powerful signal through all the noise is an honest inherent sweetness, a gentleness of nature and willingness to see the good in people and in this country, that proved to be a tonic for America in his time, and still is in ours. It was famously said that FDR had a first-rate disposition and a second-rate intellect. Perhaps it is no accident that only FDR had as high a public approval rating leaving office as Reagan did, or that in the years since Reagan has been closing in on FDR on rankings of Presidential greatness. Written with love and irony, which in a great biography is arguably the same thing, Bob Spitz's masterpiece will give no comfort to partisans at either extreme; for the rest of us, it is cause for celebration.",
  "genres": [
    "Biography",
    "Presidents",
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Us Presidents"
  ],
  "author": "Bob Spitz",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/38820062-reagan"
}