{
  "title": "Capturing Jonathan Pollard: How One of the Most Notorious Spies in American History Was Brought to Justice",
  "description": "Jonathan Jay Pollard, an intelligence analyst working in the U.S. Naval Investigative Service’s Anti-Terrorist Alert Center, systematically stole highly sensitive security secrets from almost every major intelligence-gathering agency in the United States. Over the course of eighteen months in the mid 1980s, he took and subsequently sold to Israel more than one million pages of classified material, enough to fill a six-by-ten-foot room stacked six feet high. No other spy in the history of the United States has stolen so many secrets, so highly classified, in such a short period of time. Ronald J. Olive, the author of this book was the assistant special agent in charge of counterintelligence in the Washington office of the Naval Investigative Service who led the whirlwind investigation against Pollard. Olive interrogated Pollard and garnered the confession that led to his arrest in November 1985 and eventual life sentence. During the twenty plus years that Pollard has spent in prison, many questions have arisen about the case because it never went to trial and so much information surrounding it remains classified. Most of the books and articles that have been written about Pollard denounce his life sentence as unjust. This book tells the other side of the story. It is an account from deep inside the espionage investigation that gives details of Pollard’s confession immediately following his arrest and describes Pollard’s interaction with the author before and during the time suspicion about his activities was mounting. Revealed are countless other details that have never before been made public. Calling the Pollard story an extreme case of a counterintelligence failure, Olive writes that mistaken assumptions and leadership failures enabled Pollard to ransack America’s defense intelligence long after he should have been fired. The author hopes the vital insights his book offers will serve as a lesson in history and prevent similar problems in the future and provide an antidote to the uncertainty that has fueled speculation, rumor, and lies surrounding the Pollard case.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Ronald J. Olive",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/38839.Capturing_Jonathan_Pollard"
}