{
  "title": "Exit Music: The Radiohead Story",
  "description": "This October, when Radiohead release their highly anticipated follow-up to 1997's guitar-driven OK Computer, music critics may very well bestow the Oxford quintet with \"The Most Important Band in Rock\" accolade that cursed U2, R.E.M. and the Clash. The East Coast editor of Launch magazine, Randall is undoubtedly one of the many journalists eager to exclaim \"genius!\" again, but his biography of the Grammy winners is economical, restrained and unauthorized (band members \"respectfully declined\" Randall's requests to cooperate). After briefly reenacting the now mythic June 1997 concert at New York City's Irving Plaza, attended by rock's superstar aristocracy (Bono, Lenny Kravitz, Madonna, etc.), Randall smartly spends most of his narrative on the band's fascinating, decade-long conception in and around culturally barren Oxford, whose Radiohead landmarks he visited and lays out. Non- and neo-Anglophiles will especially appreciate Randall's definitions of British terms and background on the British music industry, music press and education system (all five musicians met at the all-male Abingdon School). As for the inevitable \"record critique\" chapters, Randall rarely throws in his two cents, preferring to sprinkle passages with the band's own pithy observations and recording-session anecdotes culled from magazine interviews. Exit music? Not quite, as Radiohead are pushing the boundaries of pop music (the new record is rumored to include Miles Davis and backwards singing). Because the book will be published right before the new album debuts, it will be nearly out of date by the time it hits bookstores. However, Randall's work will still serve as a reliable introduction to an ever-evolving band.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "British Literature"
  ],
  "author": "Mac Randall",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/388281.Exit_Music"
}