{
  "title": "Cornerstones: The Life of H.M. Farmar, from Omdurman to the Western Front: Sudan, South Africa, Gallipoli, France and Belgium",
  "description": "A chance encounter with a bundle of small dusty envelopes neatly wrapped up in string set Katherine Swinfen Eady on a journey of discovery about her Great Grandfather, Harold Mynors Farmar. As a regular soldier with the Lancashire Fusiliers Mynors began his army career in the traditional infantry format of a fighting square facing up to the Dervishes in the desert of the Sudan. Miraculously he survived the battle and the disease that followed and continued his career through the South African Wars and the First World War where Mynors suffered the horrors of Gallipoli, Messines and Third Ypres. At Gallipoli, as Staff Captain of the 86th Brigade, he witnessed the death of his friends on W Beach and then took command of the Brigade when the GOC was injured and the brigade major killed. At Messines, on General Sir John Monash's staff of 3rd Australian Division he helped plan the battle and in the mud of Passchendaele he worked tirelessly to get his division fed, supplied and cared for. He was with the 35th Division when they played an important part in stemming the German advance in the Spring of 1918. And later on in the final year of the war, he taught at the newly established US Army Staff College in France before his wealth of knowledge and experience was called for by IX Corps when they pushed the Germans back before the Armistice. Mynors was a close friend of Tubby Clayton and worked closely with him for Toc H both during the war and afterwards. He was also part of the Inter-Allied Command in Turkey post war under Sir Charles Harington when they took the opportunity to review the Landings at Gallipoli with a Staff Tour. This book draws on a wealth of private papers that had lain undiscovered for years, and a hoard of letters written every day throughout the war to his beloved wife. Their importance lies in the wide breadth of operational theatres Mynors served in throughout his career and clearly shows how regular army officers of his generation not only understood the need for adaptation and learning at a period of desperate fighting but builds on our understanding of the importance of individual initiative and relationships in inter-theatre learning and cooperation. It dismisses the concept that Staff Officers of the First World War were incompetent and inexperienced and shows the true feeling these 'Cornerstones' of the military endeavour had for the men under their care.",
  "genres": [],
  "author": "Katherine Swinfen Eady",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/38814190-cornerstones"
}