{
  "title": "You Can't Fight Molecular Attraction",
  "description": "Emily Morgan is a hyper-competitive and brilliant young scientist poised to take the world of molecular genetics by storm. She has been asked to present her research at a prestigious conference and her mentor has all but promised Emily that she will be her replacement when she retires. Everything is going well for her except her love life–she’s had a dry spell so long that it could be called a drought–but when she has a meet-cute with the handsome Alex Davidson that leads to an intense night of passion, Emily thinks that maybe everything is finally lining up for her.She’s feeling on top of the world until Alex treats her like a disposable one-night stand and she learns that he stole the job she thought was hers. As her boss, he is exacting and cold, pretending not to know Emily at all. He’s the total opposite of the guy that she thought she met at the hotel bar and it’s going to take all she’s got to put on a professional smile and pretend that she doesn’t know just how enticing her boss is underneath that lab coat. As Emily struggles to navigate her complex feelings for Alex, the challenges of working under him, and the regular pressure of being a woman in STEM, she can't help but wonder if their chemistry is a fleeting attraction or if there could be a deeper, molecular bond between them.Fans of The Love Hypothesis and other Ali Hazelwood novels are sure to enjoy this full-length enemies-to-lovers workplace romance featuring women in STEM, laugh-out-loud romcom moments, strong female friendships, and a slow-burn steamy relationship with a boss. Set in a molecular genetics lab in Boston, Massachusetts, this is the first book in the CellTheraGene Romance series and can be read as a standalone novel.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Workplace Romance",
    "Fiction",
    "Contemporary",
    "Forced Proximity",
    "Chick Lit"
  ],
  "author": "Marceline Addams",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/122779167-you-can-t-fight-molecular-attraction"
}