{
  "title": "Healing Springs",
  "description": "Falling out of love is one thing, but purposefully forgetting it is another.  Selene McAlister is a successful author who had it all. Best selling novels, a beautiful beach house, a fast car and perfect health…until one rainy night that changed her life forever.  Selene had to be cut from the wreckage of her sports car, and despite horrific injuries, she survived. Whether that was a good thing or a bad thing, she couldn’t decide…not when she had to deal with the aftermath of her injuries every day after that. Broken and battered, scarred and in pain, she was a ghost of her former self, but that wasn’t the worst of it. The accident had taken something more important from her than physical health…it had robbed her of the ability to write…and taken huge chunks of memory along with it.  Now, at forty years old, she’s being forced to move back to Healing Springs and return to the small family Inn her mother owns. Returning to her childhood home was never a part of her plans. On top of everything else that happened, it only served to convince her that her life was a total failure, and that she had nothing left to look forward to other than a lifetime of pain and isolation.  Amy Fontaine is a successful businesswoman and photographer. She is also Selene’s best friend and has been since before High School. She’s not the type to let Selene retreat from life and succumb to self-pity, not if she has anything to say in that matter. Maybe that’s why Amy was the last person Selene wanted to see when she returned to Healing Springs. Fortunately for Selene, her friends and family were having none of it. They would find a way to reach Selene and show her that she still had worth…and in Amy’s case…that she was still worthy of love.  This novel is dedicated to all the strong women out there that wake up every day and struggle with disabilities, both visible and invisible. Your fight is what inspired this novel. You ladies rock.   *Loosely based on the short story, The Potter’s Wheel.",
  "genres": [
    "LGBT",
    "Romance",
    "Audiobook",
    "Lesbian Fiction",
    "Fantasy",
    "Lesbian Romance",
    "Lesbian"
  ],
  "author": "Rhavensfyre",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/38866246-healing-springs"
}