{
  "title": "Esperanza: A Latina Story",
  "description": "Fourteen-year old Esperanza Ignacio could only think of a few words to sum up her crap, man, crap! She was born into a poor Latino family living in a small crummy apartment in the barrio side of town, where the graffiti chiseled more the souls and character of the residents than it impacted the exterior looks of the buildings or anything else. Her father was a drunkard, gambler, and wife-beater who, one cold night, got arrested after a violent intrusion. Her entire circle of relatives consisted of nothing but formers-- former drug-addicts, former gangsters and gang-bangers, former alcoholics, former everything. Yep, her life was nothing but a huge load of crap. And she hadn't even started high school yet. After surviving a scorching summer heat, Esperanza enters the unfamiliar world of high-school with a tight knot in her stomach. On the very first day, she is sucked into a blunder of catastrophic events beginning with accidentally running into the world's BIGGEST bully. And it definitely isn't an understatement either. Now, she has made herself the prime target for a main course. And, to top it all off, she has to see this girl everyday in P.E! P.E.-- the one class Esperanza truly despises the most. Could life be any worse for her? Well, her family could take in a relative hopped up on drugs, a probable shooting can take place right in front of her, and Esperanza could also sit and listen to the crazed ranting of her loud psychotic mother. Oh, wait, all that does happen. To make things even easier, her best friend, Carla, won't stop trying to marry her off to her twin brother, Carlos. And she has these two puny siblings constantly vying for her attention. God, it's a wonder she doesn't strap herself in a straight jacket and pretend to be Elvis. Nonetheless, Esperanza attempts to get through it all. She is a smart and ambitious young kid struggling to survive her life while fighting to make her mark on the world. Her story is filled with pain, strength, and too much loud bickering. It carries a voice enriched with barrio slang and sarcastic humor. Esperanza illustrates what a persistent Latino youth can achieve when they get back up after a fall and keep on walking straight into college. \"Esperanza is an admirable and too real story of many Latino youth lacking role models, who find themselves lost and isolated in the paved jungles of the inner cities and overwhelmed by the dissonance of barrio life. Sandra C. Chávez has created a resilient and likeable character, Esperanza, who seems closer to a naked truth-seeker than to a barrio kid-- desperately trying to get out of a crappy world, but not knowing exactly where she was going to. Highly Recommended.\" - Andrea Alessandra, University of California, Berkeley.",
  "genres": [],
  "author": "Sandra C. Lopez",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/3885097-esperanza"
}