{
  "title": "Hotel Kid: A Times Square Childhood",
  "description": "A Manhattan landmark for fifty years, the Taft in its heyday in the 1930s and '40s was the largest hotel in midtown, famed for the big band in its basement restaurant and the view of Times Square from its towers. As the son of the general manager, Stephen Lewis grew up in this legendary hotel, living with his parents and younger brother in a suite overlooking the Roxy Theater. His engaging memoir of his childhood captures the colorful, bustling atmosphere of the Taft, where his father, the best hotelman in New York, ruled a staff of Damon Runyonesque house dicks, chambermaids, bellmen, and waiters, who made sure that Stephen knew what to do with a swizzle stick by the time he was in the third grade.The star of this memoir is Lewis's fast-talking, opinionated, imperious mother, who adapted so completely to hotel life that she rarely left the Taft. Evelyn Lewis rang the front desk when she wanted to make a telephone call, ordered all the family's meals from room service, and had her dresses sent over from Saks. During the Depression, the tough kids from Hell's Kitchen who went to grade school with Stephen marveled at the lavish spreads his mother offered her friends at lunch every day, and later even his wealthy classmates at Horace Mann-Lincoln were impressed by the limitless hot fudge sundaes available to the Lewis boys.Lewis contrasts the fairy-tale luxury of his life inside the hotel with the gritty carnival spirit of his Times Square neighborhood, filled with the noise of trolleys, the smell of saloons, the dazzle of billboards and neon signs. In Hotel Kid, lovers of New York can visit the nightclubs and movie palaces of a vanished era and thread their way among the sightseers and hucksters, shoeshine boys and chorus girls who crowded the streets when Times Square really was the crossroads of the world.Stephen Lewis on Hotel Kid: \"Raised in a loving cocoon of chambermaids, bellboys, porters, waiters, and housedicks, I led a fairy tale existence as the son of the general manager of the Hotel Taft, just off Times Square and Radio City. During the darkest days of the Depression, my younger brother and I treated our friends to limitless chocolate éclairs and ice cream sodas. Vague longings for a 'real American life' rose only occasionally — as rare as the home-cooked meals my mother attempted once or twice a year. From my privileged vantage point in a four-room suite on the fifteenth floor, overlooking the chorus girls sunbathing on the roof of the Roxy Theater, I grew into adolescence, both street-smart and sheltered by the hundreds of hotel workers who had known me since I was a baby.\"",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Coming Of Age"
  ],
  "author": "Stephen      Lewis",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/388579.Hotel_Kid"
}