{
  "title": "The Foster's Market Cookbook: Favorite Recipes for Morning, Noon, and Night",
  "description": "For more than a decade, Foster’s Markets have been cooking and baking foods made fresh each day from ingredients picked locally at the peak of flavor. Now Sara Foster shares more than two hundred delicious recipes, providing modern takes on favorite home-style classics.The Foster’s Market Cookbook features old-fashioned ideas about how good food should taste and new-fashioned ideas about prep times and the use of high-quality prepared ingredients. Filled with eighty color photos, this is the perfect cookbook to refer to over and over again for everyday meals or for entertaining, whether it be for two or for twenty.Before moving to Durham, North Carolina, Sara worked alongside Martha Stewart in the kitchen of Martha’s catering business. When she opened her own catering company, Sara kept her food simple yet soulful, trusting the complex flavors of seasonal ingredients. This same basic principle guides the daily offerings at Foster’s Markets in Durham and Chapel Hill. Each week the markets serve nearly a thousand customers hungrily searching out Sara’s innovative, new-style home cooking. And now food lovers everywhere will be able to prepare with ease sumptuous dishes such as Roasted Chicken, Sweet Potato, and Arugula Salad; Herb-Grilled Salmon with Fresh Tomato-Orange Chutney; and Risotto Cakes with Roasted Tomatoes and Foster’s Arugula Pesto. Also featured are a host of wonderful desserts, such as Lemon Chess Pie with Sour Cherries and Chocolate Espresso Layer Cake with Mocha Latte Frosting.Featuring mouthwatering favorites from the market and dozens of helpful sidebars that discuss ingredients, techniques, and make-ahead tips, The Foster’s Market Cookbook provides all you need to know to make the most of every season’s finest offerings.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food"
  ],
  "author": "Sara  Foster",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/388503.The_Foster_s_Market_Cookbook"
}