{
  "title": "The Cello Still Sings: A Generational Story of the Holocaust and of the Transformative Power of Music",
  "description": "In a world in which antisemitism is on the rise, Horvath’s story—equal parts disturbing and inspiring—is necessary and timely reading. A poetic, nuanced tribute to the power of music and family. — Kirkus Reviews, starred reviewMs Horvath's ability of unrestrained self-reflection combined with her eloquent writing style, her way of summarizing complex events into comprehensible paragraphs will not let you put the book down . — Jewish Book WorldJanet Horvath tells [her parents'] gripping story with honesty and humour in an engaging style as if talking to a friend. — THE STRAD music magazineA sweeping history of three generations darkened by the long shadow of the Holocaust, The Cello Still Sings is a vivid, moving, and true story of personal discovery. As a child Janet is haunted by the eerie hush surrounding her parents' experiences. George and Katherine, two professional musicians and Holocaust survivors, bury the memories of who and what they were before, silencing the past in order to live. Music is their lifeline. After five decades of secrets, Janet finally unravels her Holocaust heritage when she stumbles upon a clue. After the war, George performed morale-boosting programs throughout Bavaria in a twenty-member orchestra of concentration camp survivors. Although Janet also becomes a cellist, her father never discloses that two of the programs, in 1948, were led by the legendary American maestro, Leonard Bernstein. Janet's father was more fortunate than others. When he was rounded up for hard labor, narrowly missing deportation to the death camps of Auschwitz, a music-loving Nazi guard gave him gloves to protect his cello-playing hands. Janet's memoir of the Holocaust is deeply personal and illuminating. Through humor and colorful story-telling, she weaves her parents' life into her own and captures the intensity of their life experiences. The lingering scars are healed through the sustenance and power of music, and their music-making unites people from generation to generation.",
  "genres": [
    "Nonfiction",
    "Book Club",
    "Music"
  ],
  "author": "Janet Horvath",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/122782247-the-cello-still-sings"
}