{
  "title": "In My Hands: Compelling Stories from a Surgeon and His Patients Fighting Cancer",
  "description": "In In My Hands , surgical oncologist Dr. Steven Curley shares the empowering lessons he's learned over 25 years from his cancer patients' unique stories of struggle, perseverance, and triumph.As Chief of Surgical Oncology at Baylor College of Medicine, Dr. Steven Curley has worked with cancer patients for over two decades. While his life's work has been to help his patients live longer lives, he found that they helped him in ways he never could have expected. In My Hands is a rare, often emotional look at some of Dr. Curley's real patients and real situations in modern cancer care. These stories of resilience, hope, and determination changed and inspired Dr. Curley, and he uses these same stories to encourage patients dealing with the fear and uncertainty coupled with a diagnosis of cancer. Every story in the book has a theme inspired by his Hope, Courage, Strength, Determination, Wonder, Cooperation, Creativity, Diligence, Service, Perseverance, Wisdom, Grace, Consideration, Gratitude, Discernment, Reverence, Resourcefulness, Faith, Beauty, Acceptance, and Empathy. Some are positive messages, reminding us of the importance of maintaining balance between family, work, and leisure activities. Others are examples of the remarkable resilience of the human spirit when facing the reality of and the surgical risks that accompany a cancer diagnosis. Realistically, despite remarkable advances in multidisciplinary cancer care, some remind us cancer is still a potentially lethal and destructive disease affecting patients and the family and friends supporting them. While many people are told that there is no hope in their situation, Dr. Curley's patients taught him to always provide hope, to push the envelope and give people a chance, and that hope is a critical component of treatment and care. In My Hands is medical narrative at its finest, and provides insight into medicine and patient care along with fascinating details about one of our most feared diseases.",
  "genres": [
    "Nonfiction",
    "Contemporary",
    "Adult",
    "Biography",
    "True Story",
    "New Adult",
    "Medical"
  ],
  "author": "Steven A. Curley",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/38895679-in-my-hands"
}