{
  "title": "Essence",
  "description": "It's here! Essence, the much anticipated book three in the Nectar trilogy is ready for you. Wondering how Tristan & Kyla will get their much-deserved HEA? Here you go! All three books are now ready to be devoured!Essence is book three in the Nectar trilogy, a dark paranormal romance. Reading these books in order is essential. This is a dark paranormal vampire romance and contains scenes and triggers that may be disturbing.Contains: VAMPIRES, BLOOD, SEX, MYSTERY, BAD GUYS, ANSWERS, and running-a-red-light sex.In Nectar, we met Tristan and Kyla, who found themselves together in a dark bedroom. Kyla, an offering to Tristan, a vampire with an insatiable appetite.They were almost instantly addicted to one another.Kyla couldn't help feel magnetized, drawn to the handsome vampire prince, despite the fact that he held her in his home and in his bedroom against her will. He forced her to feel things physically as well as emotionally.Tristan was clearly drawn to Kyla, too. Not only was she his preferred type but the fact that she wasn't mesmerized like all the others and the fact that her blood was better than any blood he'd ever tasted created a fierce protectiveness as well as other mysterious emotions in him. He transformed from arrogant hedonistic vampire to a lovesick romantic. Love is rarely easy and this REALLY seems to be the case when the supernatural gets added into the mix!Things weren't going well at the end of book one and Kyla had a tough snap decision to make. In Ambrosia, Kyla had to deal with the fallout of that decision and process the truth, as it revealed itself. There was a whole lot of stunning, unbelievable truth to process while she felt herself changing, getting stronger, exhibiting some supernatural powers of her own.At the end of Ambrosia, things went terribly wrong and Tristan was faced with the reality of the agendas of those around him, those he'd trusted, those who had been grooming him for his leadership role.Essence begins with Tristan's POV as he processes what happened at the end of book two and tries to find a way to right those wrongs. The twists, the turns, the steam (phew), the blood? Wait until you see where this story goes!This book is the end of the Nectar trilogy but won't be the end for these characters. There's a HEA, no cliffy, but the doors will be left open for you to potentially learn more about some of the secondary characters as well as to see where Tristan & Kyla's adventures will take them next.This dark romance contains explicit sex, blood and gore, violence, sexual aggression, potential triggers, and a connection that surpasses all the heroine and her alpha vampire prince ever thought possible.Subscribe to the free newsletter, The Scoop, (http://bit.ly/ddprincescoop) for updates and like DD Prince on Facebook @ddprincebooks to learn more.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Dark",
    "Fantasy",
    "Romance",
    "Erotica",
    "Paranormal Romance"
  ],
  "author": "D.D. Prince",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/38894083-essence"
}