{
  "title": "Understanding Antidepressants",
  "description": "About 16 million Americans experience a major depression each year, and at any given time about one in ten adults is taking antidepressants. There are many different ones, in what can seem like a bewildering variety. In this book, Dr. Mendelson makes sense of the many treatments for depression, and shows that understanding how antidepressants work can help in making better decisions.The book begins with a non-technical, lavishly illustrated introduction to how antidepressants affect the brain, and a more general presentation of how drugs are absorbed, and processed by the body. The second section describes the various classes of antidepressants, including how they work, how long they stay in the body, their interactions with other medicines, side effects, and things to consider when choosing a particular one. The third section provides guidance if things are not improving, such as changing or adding medicines, as well as non-medication alternatives including psychotherapy and transcranial magnetic stimulation. Finally, there is a presentation of related depressive disorders such as seasonal affective disorder, dysthymia, and premenstrual dysphoric disorder.Written with both scientific rigor and compassion, Understanding Antidepressants is a useful guide for anyone suffering from depression, as well as their families. It is written broadly enough to be a helpful introduction for students and trainees, and mental health workers with non-technical backgrounds who wish to learn more about these commonly used medications. About the author: Wallace B. Mendelson MD is a Professor of Psychiatry and Clinical Pharmacology (ret) at the University of Chicago, and a Distinguished Fellow of the American Psychiatric Association. He has authored or co-authored four books and numerous scientific papers, primarily in the fields of psychopharmacology and sleep medicine. His most recent book, The Science of Sleep (available on Amazon), shares with Understanding Antidepressants the goal of providing the scientific background of a group of disorders in a non-technical and very readable manner.",
  "genres": [],
  "author": "Wallace B. Mendelson",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/38907641-understanding-antidepressants"
}