{
  "title": "All the Memories That Remain: War, Alzheimer's, and the Search for a Way Home",
  "description": "Winner, 2024 Eric Hoffer Award for Best Memoir * Winner, 2024 Eric Hoffer First Horizon Award * 2023 1st Place Military & Front Lines Award Winner, Chanticleer International Book Awards * Shortlisted for 2024 Eric Hoffer Award Grand Prize * 2023 Book Excellence Award Finalist for Military\n\n\n\n\n\"If therapy is getting a master's degree in yourself, then All the Memories That Remain should be on the syllabus ... I can't wait to hear about the lives this book saves.\" --Jason Kander, author of the New York Times bestseller, Invisible Storm: A Soldier's Memoir of Politics and PTSD\n\n\n\n\n\"[A] beautiful tribute to the permanence of what's been lost, and what we can gain from accepting the same.\" -Matt Gallagher, author of Empire City and Youngblood\n\n\n\n\n\"A searing story about the moral costs of war and the healing power of remembrance.\" -Kirkus Reviews\n\n\n\nWhen E.M. Liddick, a legal advisor to a special operations task force, returns from another tour in Afghanistan, he finds his formerly idyllic life in shambles. He's haunted by the decisions he made overseas, he's just told his wife of eleven years he's no longer in love with her, and his father--the person whom he would have turned to for advice-is ten-years deep into a battle with younger-onset Alzheimer's. Broken and lost, Liddick wonders, How can I possibly find my way without you, Dad? Then he remembers his father's letters to him during Marine Corps bootcamp. In those letters, scrawled in indelible script, he discovers old memories and new ways to heal, along with the enduring image of his father--and, perhaps, Liddick's old self as well.An unflinchingly vulnerable memoir, All the Memories That Remain stands witness to one man's fall from grace and his journey to find meaning in what remains.",
  "genres": [
    "Memoir",
    "War",
    "Mental Health",
    "Nonfiction"
  ],
  "author": "E.M. Liddick",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/122782197-all-the-memories-that-remain"
}