{
  "title": "Reclaiming Your Life from a Traumatic Experience: A Prolonged Exposure Treatment Program Workbook",
  "description": "If youve experienced a traumatic event and are having trouble moving past feelings of fear and helplessness, you may be suffering from Posttraumatic Stress Disorder (PTSD). This workbook will help you overcome your PTSD and reclaim your life.Best used in combination with treatment by a mental health professional, this workbook will help you work through your PTSD regardless of the type of trauma youve experienced. Whether you have been in a motor vehicle accident, or are a veteran of combat, or have been the victim of a physical or sexual assault, the program outlined in this book will reduce your anxiety and distress. You will learn to face the memories of your trauma, while processing your emotions about the event using a scientifically-tested and proven technique called Prolonged Exposure Therapy (PE).Instead of avoiding or escaping situations that provoke anxiety, you will learn how to confront these situations and begin to reevaluate your feelings and beliefs to think differently about what happened to you. You will participate in exposure exercises where you will face the memories of your trauma, as well as any real-life situations that bring about feelings of fear in a step-by-step controllable way. Breathing retraining exercises will keep you calm and relaxed. As time goes on and you practice these exercises, you will notice a marked decrease in your levels of anxiety.Complete with information on PTSD, as well as case examples, self-assessment tools, and homework assignments, Reclaiming Your Life from a Traumatic Experience, Workbook is an invaluable tool on the road to recovery.Treatments\nThatWork\nTM represents the gold standard of behavioral healthcare interventions!- All programs have been rigorously tested in clinical trials and are backed by years of research- A prestigious scientific advisory board, led by series Editor-In-Chief David H. Barlow, reviews and evaluates each intervention to ensure that it meets the highest standard of evidence so you can be confident that you are using the most effective treatment available to date- Our books are reliable and effective and make it easy for you to provide your clients with the best care available- Our corresponding workbooks contain psychoeducational information, forms and worksheets, and homework assignments to keep clients engaged and motivated- Continuing Education (CE) Credits are now available on select titles in collaboration with PsychoEducational Resources, Inc. (PER)",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology"
  ],
  "author": "Barbara Olasov Rothbaum",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/388889.Reclaiming_Your_Life_from_a_Traumatic_Experience"
}