{
  "title": "She Stoops to Conquer",
  "description": "\"\"She Stoops To Conquer\"\" is a play written by Oliver Goldsmith and first performed in 1773. The play is a comedy of manners and tells the story of a young man named Charles Marlow, who is set to visit the home of Mr. Hardcastle with his friend George Hastings. They are both interested in marrying Mr. Hardcastle's daughter, Kate, and her cousin, Constance Neville. However, Marlow is shy around women of his own class and becomes tongue-tied and awkward in their presence. To rectify this, Kate decides to pretend to be a barmaid and flirt with Marlow, hoping to win his affections. Meanwhile, Constance is being forced into a marriage with a man she does not love, and she and Hastings devise a plan to elope. The play is full of mistaken identities, misunderstandings, and humorous situations. It satirizes the manners and customs of the upper class in the 18th century, highlighting their vanity and snobbery. Overall, \"\"She Stoops To Conquer\"\" is a witty and entertaining play that remains popular to this day. It is a classic of English literature and a must-read for anyone interested in the history of comedy and theater.MISS HARDCASTLE. (Alone). Lud, this news of papa's puts me all in a flutter. Young, these he put last; but I put them foremost. Sensible, good-natured; I like all that. But then reserved and sheepish; that's much against him. Yet can't he be cured of his timidity, by being taught to be proud of his wife? Yes, and can't I--But I vow I'm disposing of the husband before I have secured the lover.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Plays",
    "Classics",
    "Drama",
    "Fiction",
    "Humor",
    "18th Century",
    "Theatre"
  ],
  "author": "Oliver Goldsmith",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/388997.She_Stoops_to_Conquer"
}