{
  "title": "A Voyage to Arcturus",
  "description": "The novel has very little, if any, science fiction. An interstellar voyage is depicted solely to provide a mostly superficial and perfunctory framework to the narration. The book was written at a time when it was no longer possible to conceive strange lands in the antipodes (as in Jonathan Swift's Gulliver's Travels, or in Thomas More's Utopia), and so these have to be set at Tormance, an imaginary planet orbiting Arcturus, which, in the novel (but not in reality), is a double star consisting of stars Branchspell and Alppain. (The choice may have been inspired by the nonfictional A Voyage to the Arctic in the Whaler Aurora published in 1911 by an identically-named David Moore Lindsay.) The lands are used to represent philosophical systems, or states of mind, through which the main character, Maskull, passes on his search for the meaning of life.Maskull is depicted as a man longing for adventures, who accepts an invitation from Krag, an acquaintance of his friend Nightspore, to travel to Tormance. The three set off from an abandoned observatory in Scotland but Maskull finds himself alone in Tormance. In every land he passes through he usually meets only one or two persons; these meetings often (though not always) end in the death of those he meets. He learns of his impending death, meets Krag again, and dies shortly after learning that he is Nightspore himself. The book concludes with a final revelation from Krag (who claims to be known on Earth as \"Pain\") to Nightspore about the origin of the Universe.All characters and lands are types used to convey the author's critique of several philosophical systems. (That is why the inhabitants of Tormance are so few; they suffice to make the point they are intended for.) The author turns out to support a variation of the doctrine of the Demiurge, somewhat similar to that defended by some Gnostics.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Classics",
    "Philosophy",
    "Novels",
    "Science Fiction Fantasy"
  ],
  "author": "David  Lindsay",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/3891243-a-voyage-to-arcturus"
}