{
  "title": "A Voyage to Arcturus",
  "description": "The novel has very little science fiction. An interstellar voyage is depicted solely to provide perfunctory framework to the narration. The book was written at a time when it was no longer possible to conceive strange lands in the antipodes as in Jonathan Swift's Gulliver's Travels, or in Thomas More's Utopia. Thus these have to be set at Tormance, an imaginary planet orbiting Arcturus, which is represented as a binary consisting of stars Branchspell & Alppain. (The choice may have been inspired by the nonfictional A Voyage to the Arctic in the Whaler Aurora published in '11 by identically-named David Moore Lindsay.) The lands are used to represent philosophical systems, or states of mind, thru which the main character, Maskull, passes on his search for life's meaning. Maskull is depicted as a man longing for adventure, who accepts an invitation from Krag, an acquaintance of his friend Nightspore, to travel to Tormance. The three set off from an abandoned Scottish observatory but Maskull finds himself alone in Tormance. In every land he traverses he usually meets only a few persons; these meetings often end in the death of some he meets. He learns of his impending death, meets Krag again & dies shortly after learning that he is Nightspore himself. The book concludes with a final revelation from Krag (known on Earth as \"Pain\") to Nightspore about the origin of the cosmos. All characters & lands are types used to convey the author's critique of several philosophical systems. The inhabitants of Tormance are so few because they suffice to make the point they are intended for. The author turns out to support a variation of the doctrine of the Demiurge, similar to that defended by some gnostics.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Classics",
    "Philosophy",
    "Novels",
    "Science Fiction Fantasy"
  ],
  "author": "David  Lindsay",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/3891253-a-voyage-to-arcturus"
}