{
  "title": "The Pages of Her Life",
  "description": "New from the award–winning author of The Five Times I Met Myself.How Do You Stand Up for Yourself When It Means Losing Everything?Allison Moore is making it. Barely. The Seattle area architecture firm she started with her best friend is struggling, but at least they’re free from the games played by the corporate world. She’s gotten over her divorce. And while her dad’s recent passing is tough, their relationship had never been easy.Then the bomb drops. Her dad had a secret life and left her mom in massive debt.As Allison scrambles to help her mom find a way out, she’s given a journal, anonymously, during a visit to her favorite coffee shop. As the pressure to rescue her mom mounts, Allison pours her fears and heartache into the journal.But then the unexplainable happens. The words in the journal, her words, begin to disappear. And new ones fill the empty spaces— words that force her to look at everything she knows about herself in a new light.Ignoring those words could cost her everything . . . . but so could embracing them.“James L. Rubart’s writing always delivers characters that echo our own lives, living in a world not too removed from our own. The Pages of Her Life is another captivating taste of who we really can be.” —David Rawlings, author of The Baggage Handler“I’m a slow reader, but I couldn’t put down The Pages of Her Life. This intriguing story is brimming with wonderful characters and more than a few surprises, including marvelous cameos by characters from another favorite Rubart novel. Immensely thought-provoking, this novel would make a fabulous book-club read. I can’t recommend it highly enough!” —Deborah Raney, author of A Vow to Cherish and the Chandler Sisters Novels“The Pages of Her Life is quintessential James Rubart and showcases why his novels are automatic must-reads. Rubart’s new novel explores courage and self-discovery. The right decisions are almost always hard, and Rubart’s deft hand with character and theme shine in his new novel. Highly recommended!” —Colleen Coble, USA TODAY bestselling author of the Lavender Tides series",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Inspirational",
    "Contemporary",
    "Christian",
    "Supernatural",
    "Novels"
  ],
  "author": "James L. Rubart",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/38915872-the-pages-of-her-life"
}