{
  "title": "Dead in Tangier",
  "description": "What do a woman's freshly burned corpse and a stallion shot dead at a birthday party have in common? They're Captain Equi's first cases in his new post as a homicide detective in Tangier, between the two World Wars. The Italian aristocrat is in North Africa after running afoul of Mussolini’s inner circle, assigned to the Tangier International Zone in July 1936. The crimes couldn't be more different except that they reveal a disturbing side to this place, where secrecy and silence are the norms. Captain Equi is determined to do his job but he soon learns that Berbers, Arabs, expats of dubious provenance, smugglers, and spies were there first, and all co-exist under uneasy adherence to the unspoken “Tangier Rules.\"Captain Equi navigates the turbulent region to find answers, even as he realizes there are those in his own department sabotaging his efforts. There's the by-the-book Brit, a proud old career French officer, and an urbane, dapper Portuguese detective with a taste for expensive clothing. Whom can he trust and who will sell him out to the highest bidder? Equi discovers what following the Tangier Rules can ultimately mean, as well as who’s really running the Zone and what they want from him. If that isn’t enough trouble, the Spanish Civil War breaks out next door to Tangier in Spanish Morocco, and Equi is forced to decide between justice and survival.Fans of Donna Leone and Louise Penny will love this new series set in 1930s Morocco.\"Dead In Tangier snakes its way through a tangle of competing forcesthat will define the rest of the century, with Philip Kerr–like ease, anda surprising fact on every page.\" -- John MacLachlan Gray,author and playwright Billy Bishop Goes to War , White Stone Day , Not Quite Dead\"Tangier, 1936. Here's a unique look into European and native intrigue on the eve of the Spanish Civil War. A dashing Italian sleuth moves deftly and breathlessly among strange characters, shady villains, and mysterious women, in search of a killer who is as elusive as he is terrifying.\" -- Ben Pastor, prize-winning author of the best-selling Martin Bora novels",
  "genres": [],
  "author": "John Harlan Hughes",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/38910662-dead-in-tangier"
}