{
  "title": "Prisons That Could Not Hold",
  "description": "Prisons That Could Not Hold weaves together diary entries, letters, and interviews to provide a very human portrait of the evolution of an individual activist and the development of contemporary \"movement\" philosophy.The centerpiece of this volume is the acclaimed Prison Notes , a powerful account of the twenty-seven days Barbara Deming and thirty-five others spent in an Albany, Georgia, jail during their Canada-to-Cuba Walk for Peace in 1963 and 1964. Demanding that black demonstrators and white demonstrators be able to walk together, the peace marchers were imprisoned, leading many in the group to fast and employ other nonviolent techniques of protest. Their presence and discipline had a lasting effect on the Albany Movement and other nonpacifist civil rights groups in the South.The remainder of the book relates Deming's final protest walk some twenty years later in 1983 with the Seneca Women's Peace Encampment, a group of women-only peace marchers scheduled to walk from Seneca, New York, the site of the first Women's Rights Declaration in 1848, to the missile base in Romulus, New York. This nonviolent march in honor of Elizabeth Cady Stanton and other feminist heroines was interrupted by protestors. Deming and fifty-three other women were arrested and spent five days in a Waterloo, New York, jail. These events are told in \"A New Spirit Moves Among Us,\" an essay written in letter form to a friend in defense of women-only actions, an interview with Deming conducted after her release from jail, and a statement of purpose issued from jail by the Waterloo Fifty-Four.As Grace Paley notes in her introduction, Prisons That Could Not Hold is \"the story of two walks undertaken to help change the world without killing it. Barbara Deming was an important member of both. Twenty years of her brave life lie between them. . . . That difference between the two walks measures a development in movement history and also tells the distance Barbara traveled in those twenty years.\"",
  "genres": [
    "History"
  ],
  "author": "Barbara Deming",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/1227887.Prisons_That_Could_Not_Hold"
}