{
  "title": "White Picket Fences: Turning toward Love in a World Divided by Privilege",
  "description": "A Gentle Invitation into the Challenging Topic of Privilege Gently addressing the challenging topics of privilege and race, power and inequality, White Picket Fences is a memoir of Amy Julia Becker's growing awareness of the unequal benefits (and secret harm) she received by virtue of her white skin, Protestant heritage, education and able body.Through telling her own story, Amy Julia Becker shares her process to acknowledge and examine the injustice, oppression and silence that has characterized American history and her own life. These forces of division, social power and unequal opportunities are still active and relevant to the church, education system, and even the books we give our children to read today. She reflects on her upper-middle-class childhood both in the American South and later New England, her own struggles with perfectionism, and raising a child with a disability, in light of privilege. Amy Julia Becker guides readers through her growing realization of how inequality has negatively impacted herself and others. \"Privilege harms everyone,\" she writes, \"those who are excluded from it and those who benefit from it.\" Black and white, rich and poor, strong and weak.Through reflections on parenting, family, and faith, Amy Julia Becker traces her process to discover how she can participate in actions and conversations of truth and love in order to bring wholeness and healing.  \"Identifying the wounds of privilege is one thing,\" she writes, \"participating in their healing is even harder.\" She offers a challenge to \"This book is an invitation, especially for people from a similar cultural background to mine, to consider the reality of privilege, the benefits and wounds that come from privilege, and whether we can respond to the fact of our privilege with generosity, humility, and hope.\"Winner of  Christianity Today 's 2018 Book Awards Award of \"Told with grace and humility, this memoir will be a helpful companion to those who are wrestling with similar questions about privilege.\" -- Ruth Everhart,  Christianity Today",
  "genres": [
    "Nonfiction",
    "Christian",
    "Faith",
    "Race",
    "Book Club",
    "Christian Living",
    "Justice"
  ],
  "author": "Amy Julia Becker",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/38942813-white-picket-fences"
}