{
  "title": "Would It Kill You to Stop Doing That? A Modern Guide to Manners",
  "description": "\"We all know bad manners when we see them,\" NPR and Vanity Fair contributor Henry Alford observes at the beginning of his new book. But what, he asks, do good manners look like in our day and age? When someone answers their cell phone in the middle of dining with you, or runs you off the sidewalk with their doublewide stroller, or you enter a post-apocalyptic public restroom, the long-revered wisdom of Emily Post can seem downright prehistoric.  Troubled by the absence of good manners in his day-to-day life-by the people who clip their toenails on the subway or give three-letter replies to one's laboriously crafted missives-Alford embarks on a journey to find out how things might look if people were on their best behavior a tad more often. He travels to Japan (the \"Fort Knox Reserve\" of good manners) to observe its culture of collective politesse. He interviews etiquette experts both likely (Judith Martin, Tim Gunn) and unlikely (a former prisoner, an army sergeant). He plays a game called Touch the Waiter. And he volunteers himself as a tour guide to foreigners visiting New York City in order to do ground-level reconnaissance on cultural manners divides. Along the way (in typical Alford style) he also finds time to teach Miss Manners how to steal a cab; designates the World's Most Annoying Bride; and tosses his own hat into the ring, volunteering as an online etiquette coach.  Ultimately, by tackling the etiquette questions specific to our age-such as Why shouldn't you ask a cab driver where's he's from?, Why is posting baby pictures on Facebook a fraught activity? and What's the problem with \"No problem\"?-Alford finds a wry and warm way into a subject that has sometimes been seen as pedantic or elitist. And in this way, he looks past the standard \"dos\" and \"don'ts\" of good form to present an illuminating, seriously entertaining book about grace and civility, and how we can simply treat each other better.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Self Help",
    "Reference",
    "Essays",
    "Sociology",
    "Adult"
  ],
  "author": "Henry  Alford",
  "average_rating": "2.94",
  "url": "https://www.goodreads.com/book/show/12279740-would-it-kill-you-to-stop-doing-that-a-modern-guide-to-manners"
}