{
  "title": "Ghosts in the Schoolyard: Racism and School Closings on Chicago's South Side",
  "description": "“Failing schools. Underprivileged schools. Just plain bad schools.” That’s how Eve L. Ewing opens Ghosts in the Schoolyard : describing Chicago Public Schools from the outside. The way politicians and pundits and parents of kids who attend other schools talk about them, with a mix of pity and contempt. But Ewing knows Chicago Public Schools from the as a student, then a teacher, and now a scholar who studies them. And that perspective has shown her that public schools are not buildings full of failures—they’re an integral part of their neighborhoods, at the heart of their communities, storehouses of history and memory that bring people together. Never was that role more apparent than in 2013 when Mayor Rahm Emanuel announced an unprecedented wave of school closings. Pitched simultaneously as a solution to a budget problem, a response to declining enrollments, and a chance to purge bad schools that were dragging down the whole system, the plan was met with a roar of protest from parents, students, and teachers. But if these schools were so bad, why did people care so much about keeping them open, to the point that some would even go on a hunger strike? Ewing’s answer begins with a story of systemic racism, inequality, bad faith, and distrust that stretches deep into Chicago history. Rooting her exploration in the historic African American neighborhood of Bronzeville, Ewing reveals that this issue is about much more than just schools. Black communities see the closing of their schools—schools that are certainly less than perfect but that are theirs —as one more in a long line of racist policies. The fight to keep them open is yet another front in the ongoing struggle of black people in America to build successful lives and achieve true self-determination.",
  "genres": [
    "Nonfiction",
    "Education",
    "Race",
    "History",
    "Politics",
    "Social Justice",
    "Sociology"
  ],
  "author": "Eve L. Ewing",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/38923643-ghosts-in-the-schoolyard"
}