{
  "title": "Jinnah of Pakistan",
  "description": "“Few individuals significantly alter the course of history. Fewer still modify the map of the world. Hardly anyone can be credited with creating a nation-state. Muhammad Ali Jinnah did all three.” Stanley WolpertThese are the opening lines of the preface of Stanley Wolpert’s book, “Jinnah of Pakistan” and serves to entice you to read an extremely thorough, comprehensive and detailed study about one of the most pragmatic and charismatic leaders of South Asia, Muhammad Ali Jinnah.Stanley Wolpert is an American academic who is considered to be one of the world's foremost authorities on the political history of modern South Asia. During a trip to Bombay in 1948, he became interested in the complexities of Indian culture, history and politics. Since 1962, he has published many fictional and non-fictional books on his favorite subject.In the preface, Wolpert adds: “For more than a quarter century, I have been intrigued by the apparent paradox of Jinnah’s strange story which has to date never been told in all the fascinating complexity of its brilliant light and tragic darkness.”“Jinnah of Pakistan” was published in 1984. This unique and insightful biography explores the fascinating public and private life of founder of Pakistan, Muhammad Ali Jinnah from his birth in 1876 till his death in 1948. In recording the events that unfold and shape Jinnah’s life, Wolpert also chronicles almost eight decades of Indian history to the point where India achieves independence from British rule amid growing Muslim-Hindu antagonism.It is a tragedy that the new generation of Pakistan knows about the founder of their country only through text books, a few websites and television programs. These limited resources do not tell the complete picture of a very intelligent, shrewd and resilient lawyer, politician and statesman who altered the map of South Asia through his sheer indomitable will against all odds.It is almost a standard statement in Pakistani textbooks that Muhammad Ali Jinnah was a great man but after reading Stanley Wolpert’s “Jinnah of Pakistan” one can get a better understanding of why Jinnah can be….. and should be…. regarded as such a great leader. Physically a frail man, he alone gave courage, hope, strength, and voice to millions of Muslims of South Asia who were dismissed as second class citizens in United India before partition in 1947.The biography is placed on a huge canvas and takes the readers to the bustling port of Karachi where Jinnah was born and follows him to London, Bombay, Calcutta, Lucknow, Nagpur, Amritsar, New Delhi, Simla, Lahore, Peshawar, Quetta, Ziarat and finally Karachi again where lies buried “ one of history’s most remarkable, tenacious, enigmatic figures.”The book reveals Jinnah’s failings, his loneliness, his pain, his broken marriage, his estrangement from his only daughter, his long and fatal disease which he kept under wraps and yet the true worth of his gigantic accomplishment can only be more appreciated when viewed alongside his human weaknesses.The book also brings under the spotlight, Jinnah’s love and marriage to the beautiful and vivacious “flower of Bombay\" Ruttie. The whole episode is dealt with a great deal of compassion as Wolpert gives a rare glimpse into Jinnah’s most private moments and thoughts___ and his ultimate pain when due to Jinnah’s extremely demanding political and legal career, the marriage breaks down and ends with Ruttie’s tragic death when she was only 29.An excerpt from the book: “It (the funeral) was a painfully slow ritual. Jinnah sat silently through all its five hours. As Ruttie’s body was being lowered into the grave, Jinnah as the nearest relative was the first to throw the earth on the grave. He broke down suddenly and wept and sobbed like a child for minutes together. That was the only time when I found Jinnah betraying some shadow of human weakness.”The best thing about the book is that is very impartial and does not gloss over any facts or resort to hyperbole. Like an artist who creates a masterpiece with careful strokes of his paintbrush, Wolpert also records small anecdotes and major incidents to show Jinnah’s shrewd and skillful leadership as well his single-minded tenacity to win his case for the creation of Pakistan on behalf of the Muslims of South Asia.For this great and engrossing biography, Stanley Wolpert has won a great deal of gratitude from those who have read and enjoyed this book. ’Jinnah of Pakistan’ is an absolute must-read for the students of the political history of South Asia and for every Pakistani who is interested in knowing the extent of debt owed to Quaid-e-Azam Muhammad Ali Jinnah for freedom and a separate country after the end of British Raj in the sub-continent.",
  "genres": [
    "Pakistan",
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "India",
    "Historical"
  ],
  "author": "Stanley Wolpert",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/389424.Jinnah_of_Pakistan"
}