{
  "title": "Guys Write for Guys Read",
  "description": "What is a typical guy moment, anyhow? Daniel Pinkwater remembers the disappointment of meeting his Lone Star Ranger hero up close and personal. Gordon Korman relishes the goofy ultra violence of the old Looney Tunes cartoons. Stephen King realizes that having your two hundred-pound babysitter fart on your five-year-old head prepares you for any literary criticism. And that's just a sampling from Guys Write for Guys Read, a fast-paced, high energy collection of short works: stories, essays, columns, cartoons, anecdotes, and artwork by today's most popular writers and illustrators. Guys Write will feature work from Brian Jacques, Jerry Spinelli, Chris Crutcher, Mo Willems, Chris Van Allsburg, Matt Groening, Neil Gaiman, the editors and columnists from Sports Illustrated,The Onion and Esquire magazines, and more. Selected by voters at the Guys Read Web site and compiled by Jon Scieszka, this wide-ranging collection of authors and illustrators shows that guys do read . . . and will read more if given things they enjoy reading.The truth about the world / Lloyd Alexander --My maturity, in flames / M.T. Anderson --Daniel Adel --Stone=throw / Marc Aronson --Superpatriot / Avi --The crossing / T.A. Barron --Reading can be dangerous / Tedd Arnold --My entire football career / David Bauer --Only a game / Edward Bloor --Gondanaland / Tony DiTerlizzi --E, A minor, B7 / Bruce Brooks --My brilliant invention / William G. Brozo --A real guy / Michael Cart --My life of crime / Peter Cherches --Triplets / Timothy Basil Ering --The legend of Tripod / Eoin Colfer --\"O\" foods / Chris Crutcher --What I'm telling you is the truth / Terry Davis --The rules / Esquire --Any questions, class? / Matt Groening --Guide for guys / Douglas Florian --Why books are dangerous / Neil Gaiman --Brett Helquist --The follower / Jack Gantos --The red fire engine / David Macaulay --There must be a mistake / Morris Gleitzman --Thwacked / David Granger --My superpowers / Dan Greenburg --My dad is better than your dad / Andy Griffiths --Adam McCauley --Let's go to the videotape / Dan Gutman --Boys, beer, barf, and bonding / Bruce Hale --Shooting the breeze / Dave and Liam McKean --Principals and principles / Daniel Handler --A great, big, beautiful world / Will Hobbs --My French teacher tried to kill me / Anthony Horowitz --Learning how to be a boy / James Howe --Lightning man / Jarrett J. Krosoczka --A casualty of war / Brian Jacques --Wrestling with reading / Patrick Jones --Dav Pilkey --from \"on writing\" / Stephen King --Pop / David Klass --Guy things / Gordon Korman --Role-playing and discovery / Jerry Pinkey --Busted / Erik P. Kraft --Copies / David Lubar --When all bicycles were black / Vladimir Radunsky --The pellet in the paint can / Chris Lynch --Unfinished business / John Marsden --Sergio Ruzzier --Daydreams / Walter Dean Myers --Licky Dave / Garth Nix --Anything can happen / Kenneth Oppel --No, David! / David Shannon --Dead body / Jerry Pallotta --It all began with books / Christopher Paolini --from \"How Angel Peterson got his name\" / Gary Paulsen --The 1928 Packard / Richard Peck --Lone [star] Ranger / Daniel Pinkwater --David Sheldon --A day at the zoo ; Boys are big experts / Jack Prelutsky --\"Funny you should ask\" from The life of Reilly / Rick Relly --Peter Sís --The death of a writer / David Rice --Sweet dreams / Steve Rushin --Maybe yeah, maybe nah / René Saldaña, Jr. --Bufos / Graham Salisbury --Lane Smith --Brothers / Jon Scieszka --GUYfesto --who we are! / Darren Shan --The day I threw the Trivia Bowl / Robert Siegel --Bringing up 'saur subjects / Rick Spears --Roy G. Biv / Seymour Simon --The hammer and the bullet / Arthur Slade --The masque of the red death / William Sleator --Reading and relating / Michael W. Smith --The dragon in the big glommy castle / Mark Teague --Bombs, girls / Jerry Spinelli --Conduct / Rick Telander --The fire escape / Ned Vizzini --My first step to the White House / Chris Van Allsburg --Give a guy a newspaper / Bill Vlasic --Eat dirt / Rich Wallace --Training the bear / Will Weaver --Pals forever: me Bobby Fisher, and the Hardy Boys / Jeffrey D. Wilhelm --Aw, nuts! / Mo Willems --\"Puzzle pieces\" from The lost garden / Laurence Yep --Heartbeat / David Yoo --I was young in the old days / Paul O. Zelinsky",
  "genres": [
    "Short Stories",
    "Young Adult",
    "Humor",
    "Fiction",
    "Realistic Fiction",
    "Middle Grade",
    "Childrens"
  ],
  "author": "Jon Scieszka",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/389548.Guys_Write_for_Guys_Read"
}