{
  "title": "Lover Come Back",
  "description": "Scott Hildreth is a married father of six children. He is an international bestselling romance author who has published more than fifty novels, over half of which have been number one bestsellers. His journey to his current existence, however, wasn’t always an easy one. He never imagined that a weekend hobby would land him in federal prison, a donut shop would produce the love of his life, or that contemporary romance novels would have his name splashed across the covers. At one point, he had it all: a house on the hill, a wife, three children, and a rewarding career. After becoming the focus of an ATF investigation, his world was turned upside down.The legal battle for his freedom ended in a loss on the steps of the United States Supreme Court. In the subsequent trip to federal prison, he lost his wife, contact with his children, and his home. After serving his prison sentence, he returned to work and reunited with the men in his motorcycle club. Once again on top of the world, but lacking trust in society - and women in general - his only relationship was with his motorcycle. Three years later, Scott was jobless, carless, penniless, and holding an eviction notice. He then took a chance at a career he had no formal training in - being an author. His inspiration came from a woman he shared a table with in a donut shop. Fueled by nothing more than his love for her, he clawed his way to the top of the industry and hasn’t looked back since.Lover Come Back is a true - but often unbelievable - story of loss, sacrifice, second chances, and ultimately, love. It takes the reader on a tear-jerking journey from the horrors of a federal criminal trial to the lush beaches of Naples Florida, where Scott and his family currently reside. A testament to the pain the human heart can endure, and to the repair that only love can bring, Lover Come Back is a must-read memoir that will cause you to believe that second chances can produce first loves.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Romance",
    "Audiobook",
    "Biography",
    "Second Chance",
    "Autobiography"
  ],
  "author": "Scott Hildreth",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/39006572-lover-come-back"
}