{
  "title": "Captivating Debutantes",
  "description": "Three Captivating Debutantes. Three Irresistible Gentleman. \nA vengeful viscount, an arrogant earl and a damaged soldier all find love with ladies that defy their plans and disrupt their lives. A sensual Regency Romance Box Set with warmth and wit. This volume collect books 1-3 including; Captivated by the Viscount, My Captive Earl and Her Noble Captive.Captivated by the ViscountA lot can change in four nights.... Ruination and kidnap were not on Miss Lucy Lazenby´s list of planned events for that week...even if it seems to be for her own good. Caught up in the lies and passion of Lord Danbury, Lucy finds the truth can never be hidden for long. Jasper Carnforth, Viscount Danbury is really doing the girl a favour by ruining her...if it just so happens to coincide with his own need for vengeance - all the better. However keeping the delectable Lucy in his home is more of a challenge than he´d imagined. Retribution may have brought them together, but desire has its own agenda. This fast paced Regency novella (34,000 words) is the first standalone story in The Captivating Debutantes Series.My Captive EarlThe Earl of Rookdean did not want to host a house party.Miss Clara Lockwood did not want to attend the Earl of Rookdean’s house party.You don’t always get what you want…At a masquerade ball on the opening night, Rookdean encounters a captivating Grecian-dressed goddess. With identities hidden, will his heart be able to find what his eyes cannot see?It started by chance, in a moonlit sunken garden. It leads to a week of concealed passion, deception and misunderstanding. With a house full of hidden desires, demanding men, song, charades, debutantes and…Lady Minkworth – who wouldn’t want a house party?This regency novella (49,000 words) is the second standalone story in The Captivating Debutantes Series. Heat level: Sensual. 3 out of 5.Her Noble CaptiveThat bitter winter of 1813…Her… Miss Rosalind Trewent. Irrepressibly vivid. Improperly spoken. Burdened by secrets. Refuses to marry.Noble… Major Lucas Mainwaring. Excessively grouchy. Reluctant earl. Self-admitted wreck. Can never marry.Captive… Winter and the cold hand of a murderer stalk the land, but the arrival of the Major as a houseguest warms Rosalind to her very toes.But the past can never be hidden for long…An idyllic country village is not always as it appears and when Lucas delves deeper, he discovers murky secrets, veiled passions, lust he thought he could never feel...and a love that began many years before.The Captivating Debutantes series can be read in any order.",
  "genres": [
    "Historical",
    "Historical Romance"
  ],
  "author": "Emily Windsor",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/38983115-captivating-debutantes"
}