{
  "title": "The Earl’s Timely Wallflower",
  "description": "Never let destiny meddle in your romantic affairs…When Lily Bennett became the caretaker of her teenage sister, it came at the expense of her hopes, dreams, and the home she grew up in. Now that her sister is grown and on her own, Lily struggles to find a place to call home. She wants to feel part of a family again and intends to mend the broken relationships with her siblings. That is, until she discovers an unusual timepiece that lands her in Regency England at the feet of one of the most eligible men in society. Unfortunately, he believes that she’s crazy. Any attraction Lily feels for the stubborn man is clearly one-sided. Too bad she’s stuck with him until she can figure out how to get home.Gabriel Hawthorne, Earl of Rothden, has decided to host one last house party before returning to London for the dreaded season where every simpering chit and money-hungry mother will hover around him like flies. Add to that his sister’s hunt for a husband and Gabriel would rather shoot himself than a grouse. Still, it’s his duty to find his sister a suitable match, which he’ll do after one last bit of respite to shore up his defenses. A respite interrupted when a pretty little wallflower in scandalous clothes lands at his feet claiming to be from the future. He'd turn her over to doctors if she weren’t so damned intriguing. Suddenly, all thoughts of London, responsibilities, and simpering debutantes don’t seem half as hard as getting Lily to stay with him.But when his ex-mistress arrives unannounced at the house party, she makes every effort to drive a wedge between the fragile bond Gabriel and Lily have forged. If she succeeds, he could lose Lily forever. And if Lily finds a way back to her time, he may have to follow her.Because the Earl of Rothden always gets what he wants. Even when it’s a wallflower from the future.",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Historical Fiction",
    "Time Travel Romance"
  ],
  "author": "Aurrora St. James",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/122812844-the-earl-s-timely-wallflower"
}