{
  "title": "STOKER",
  "description": "Every writer has an inspiration.  Every icon holds a story.  Every legend hides a dark side.    Dear reader,    When the boon of sleep becomes a presage of horror, while one’s long, shadowy days are laden with sordid events so terrifying they only bridge a thread to the same wicked nightmare, in what can a gentleman find refuge and catharsis? Writing.  No one can deny that Abraham Stoker penned a Gothic tour de force in 1897. All readers and moviegoers are familiar with the name Dracula, as a parade of literary colleagues and Hollywood directors have probed the monster’s conscience for generations. Even so, few artists have explored Stoker’s motivations for creating such a loathsome, seductive protagonist. Welcome to Bram’s frightmare: a wild, historical tale that fuses the life and times of a struggling author, a ruthless prince, and vampire mythology.  Set in London in 1887, aspiring writer and stage manager Bram Stoker attends a séance that changes his life forever. What starts as an innocent ritual follows as a series of unforeseen yet connected plot twists and encounters with the bloodthirsty beast mistakenly freed from the underworld on that fateful night. As Bram’s young son Noel intervenes to pull his father from the madness that ensues, wife Florence’s health begins to decline, and his employer, actor Henry Irving, is being questioned about a violent murder that takes place outside his Lyceum Theater. To save careers, families, and souls, father and son seek answers to the darkest secrets hidden within the Carpathian Mountains, an ancient monastery, a ruined castle, and a forbidden cavern.  My Dracula prequel is meant to pay homage to a brilliant man, writer, and Romantic masterpiece, mixing fantasy, fact, and Gothic elements to show how literary art is born. I have been a vampire enthusiast since the tender age of seven, having first read Stoker’s work in comic-book form. Since then I have made it my avocation to study vampire lore, the historical Vlad the Impaler, as well as everything known about Bram. A vast amount of commentary on his novels, the same reference materials Stoker used in composing his works, as well as the author’s very notes and private journals inform my narrative.",
  "genres": [],
  "author": "Calvin Cherry",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/39008602-stoker"
}