{
  "title": "A Year of Living Kindly: Choices That Will Change Your Life and the World Around You",
  "description": "2020 New York City Big Book Awards Winner in Motivational2020 14th Annual National Indie Excellence Award-Winner in Self-Help Motivational2019 IPPY Gold Medal Self Help2019 Nautilius Book Awards Gold Winner in Personal Growth & Self-Help2019 Next Generation Indie Book Gold Medal Winner in Motivational2019 Readers’ Favorite Gold Medal Winner in Nonfiction Self-Help2019 Eric Hoffer Award Self-Help2019 Independent Author Network Book of the Year First Place in Self-Help2019 Chanticleer I & I Book Awards for Instruction and Insight Finalist2019 International Book Finalist, General2019 Nancy Pearl Best Book Finalist in Memoir2019 Eric Hoffer Montaigne Finalist2019 Foreword Indies Adult Nonfiction―Self-HelpKirkus Reviews Best Books of 2018Being kind is something most of us do when it’s easy and when it suits us. Being kind when we don’t feel like it, or when all of our buttons are being pushed, is hard . But that’s also when it’s most needed; that’s when it can defuse anger and even violence, when it can restore civility in our personal and virtual interactions. Kindness has the power to profoundly change our relationships with other people and with ourselves. It can, in fact, change the world.In A Year of Living Kindly ―using stories, observation, humor, and summaries of expert research―Donna Cameron shares her experience committing to 365 days of practicing kindness. She presents compelling research into the myriad benefits of kindness, including health, wealth, longevity, improved relationships, and personal and business success. She explores what a kind life entails, and what gets in the way of it. And she provides practical and experiential suggestions for how each of us can strengthen our kindness muscle so choosing a life of kindness becomes ever easier and more natural. An inspiring, practical guide that can help any reader make a commitment to kindness, A Year of Living Kindly shines a light on how we can create a better, safer, and more just world―and how you can be part of that transformation.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Psychology",
    "Adult",
    "Philosophy",
    "Mental Health"
  ],
  "author": "Donna    Cameron",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/39027381-a-year-of-living-kindly"
}