{
  "title": "New York Stories",
  "description": "NEW YORK STORIES by YURIE KIRIWinner of \"Unpublished\" fiction category in 2022 New England Book Festival.Chick Lit Cafe awarded first place for best Science Fiction & Post-Apocalyptic Novel - CLC Book Excellence Award Winner! New York Stories by Yurie Kiri - Best Science Fiction & Post Apocalyptic.  Artisan Book Reviews (ABR) Book Excellence AwardEntrada Publishing - Beta Reader Summary Report\"I loved the feel of the story and the pacing. It [New York Stories] is unique and a little quirky, while tackling ideas that are very possible in today's society.... It reminds me of some of the classic sci-fi novels and things like Timeless or Bladerunner but with more quirkiness to it.\"\"I like the story. It [New York Stories] is definitely different. The author has created a world that is vastly different from today. Many of the major cities and countries are destroyed, systems of government have changed, and people live lives based on technology and a cashless society... The pace of the book was great. It kept me engaged and reading even into the late hours of the night. I liked the twists that the author put in... This book shows what can happen if things go unchecked.\"What it's not...New York Stories is not a cute travelogue or a guide book to my favorite NYC bars and restaurants nor is it a guide to programming, artificial intelligence or computer languages. This is a survival story... about surviving all the horrors of a post-modern wars, environmental disasters, homelessness and poverty along with how to get your bills paid so that the insurance men won't come after your shoes, so to speak... or maybe they just want dry socks? Who doesn't these days?What's happening in New York City in the late 21st century?The wars have wound down and New York still stands, largely undamaged and more crowded than ever before. Global warming has not abated so the city is hot, soggy and the oceans are rising which means there are a lot of pumps running in all the flooded areas as well as ever taller barriers around the rivers and bays. Just pray that the electricity holds but people can live with those kinds of problems as long as there's some kind of diversion...What do people do for fun?Terrestrial travel is difficult in a mostly destroyed world except for \"spiritual travel\" where you get your spirit, your inner essence, sucked out, extracted and then shot into space, leaving your empty physical body \"sleeping\" like the dead far behind on Earth. Giant antennas on Mars catch those modulated \"spirits\" moving at light speed and process them into manufactured, artificial bodies for a few fun filled weeks before the process gets reversed. But if you're afraid of travel, there's always a tough, complex computer game available to play... so life can be fun as long as the game doesn't want you dead, too.Who's in charge of NYC anyway?The Board of Directors, elected by the shareholders, mostly rich business men, are the only form of government now and that means everything has to be good for the bottom line or profitable to be exact. That doesn't mean life isn't fair, because nothing happens that can't be litigated in tough courts by good attorneys and judges. However, one of those courts just issued a ruling that might favor the banks and the way that they can collect on consumer debt...",
  "genres": [],
  "author": "Yurie Kiri",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/122825247-new-york-stories"
}