{
  "title": "Simon Kenton Unlikely Hero: Biography of a Frontiersman",
  "description": "He lived on the edge of danger, and the frontier provided plenty of it! Indian attack, disease, even near-starvation—early pioneers faced these and more. Never one to run away from danger, frontiersman Simon Kenton used his scouting skills to aid them whenever he could. Rifle loaded, Kenton crept as silently as an Indian to rescue kidnapped settlers. His narrow escapes from Shawnee Indians rivaled those of his famous friend, Daniel Boone. Simon’s influence on the events of his day can be gauged by the men he counted as friends—the daring military leader George Rogers Clark, fellow frontiersman Boone, and the renegade Simon Girty, whom settlers loved to hate. Bravely facing gauntlets and tortures, Kenton earned great respect from the Shawnee, and admiration from the pioneers. But would the death sentence of burning at the stake be his undoing? Tramp the woods with frontiersman, Simon Kenton and gain a new appreciation for what the pioneers faced as they sought to claim their own slice of wilderness on the Ohio frontier. Simon Kenton first came to Kentucky in 1772 as a teen fleeing justice. The land captivated his heart and he dedicated the next 28 years to helping settlers, fighting Indians, and scouting for famous military leaders. When Lord Dunmore picked a fight with the Shawnee, Simon and his buddy Simon Girty carried war messages at the Battle of Point Pleasant. They also carried Chief Logan's eloquent speech to the peace negotiations. When his friend Daniel Boone fell from a Shawnee bullet, Simon lifted him like a sack of grain and carried him to safety. When George Rogers Clark led the daring attack on British Kaskaskia, Kenton played a key role. When captured and tortured by Shawnee Indians, Simon showed remarkable courage and endurance. When General \"Mad Anthony\" Wayne led an army in the Northwest Indian War, Captain Kenton headed the crew of one hundred scouts. When the Greenville Treaty brought peace and settlement of the Ohio Country, Simon headed to this new frontier. When Tecumseh and his brother The Prophet gathered Indians for a final effort to regain their lands, Kenton rode to investigate rumors and kept the nation advised. When Tecumseh joined forces with the British in the War of 1812, Simon, though not a young man, rode with the Kentucky militia as an advisor. Read the fascinating story of this mostly unsung hero of our nation's early history.",
  "genres": [],
  "author": "Karen  Meyer",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/39028466-simon-kenton-unlikely-hero"
}