{
  "title": "Promises Part 4",
  "description": "Men found him attractive, interesting even. He was like a fascinating experiment gone wrong that men liked to investigate. He’d get a date - or two, if he was lucky - but it wasn’t long before Brian’s darkness showed, and the men were running from him.  Brian King was honorably discharged from the United States Navy five years ago. He’d left with the highest honors a man can receive in his country, but he’d paid the ultimate price to earn them. He was considered one of the best; an Intelligence Officer in a Joint Special Operations Delta team that’d been a twelve-man wrecking crew. They’d thought they were invincible… until they weren’t. Brian was the only member that survived the ambush. He survived ten months of pain, of torture, only to emerge on the other side a warrior. A POW survivor. He’d returned home with all his limbs, his right mind, and with his only brother Ford, at his side. But, one thing had been lost, maybe for good… his voice.  Now, being a bounty hunter is Brian’s only means to satisfy his need to calculate, track, and capture. His only outlet to the stress caused by his silence. He was good at what he did. But, all work and no play for a forty-four year old man was taking its toll. Brian wasn’t a faulty experiment. He missed companionship, he missed communicating. So, when he met Sway Hamilton – in the most unconventional means – he’d been surprised at his special way of understanding Brian’s every look… and touch.  Sway grew up in the rough part of ATL, trailing behind his twin brother Stanton and his best friend, Dana. He and his brother had a bond only twins could understand. So when Stanton’s life was taken during their sophomore year in college, Sway didn’t think he’d ever recover. He finally finished school, got his masters in nursing, worked hard, and focused on taking care of his mother. However, Sway knew there was more to life than heartache, and caring for others. There had to be. But he didn’t know what any of those things were until he met a dark hunter that blew his mind… and the intense man had never uttered a single word.  Brian and Sway can feel the powerful connection between them. It was there from the start—but both of them have battled with loss and anguish for so long, neither understand that love can ease all of it. Do they have the courage to battle through it together? Sway has to learn to trust in love, and Brian has to believe that Sway will always understand him even if he never speaks again.  Sway held him tight around his neck, “I don’t need you to talk Brian. I can hear you just fine,” Sway whispered softly, kissing his throat.  This novel is a part of a series but can be read as a standalone. No cliffhangers. Trigger Warning: This story contains acts of bond recovery agent violence. Mention of war zones and descriptions of war prisoners. This story DOES NOT contain overly-described acts of torture.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Disability",
    "Military Fiction",
    "Audiobook",
    "LGBT"
  ],
  "author": "A.E. Via",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/39058693-promises-part-4"
}