{
  "title": "The Big Book of Hap and Leonard",
  "description": "The boys are back, and just in time for Season 3 of the Hap and Leonard TV series, starring Michael K. Williams (The Wire) and James Purefoy (Altered Carbon).Hap Collins looks like a good ’ol boy, but his lefty politics don’t match. His buddy, Vietnam veteran Leonard Pine, is even more complicated: black, conservative, gay . . . and an occasional arsonist. With Hap and Leonard on the job, small-time crooks all on the way on up to the Dixie Mafia are extremely nervous.Everyone's favorite ass-kicking Texan duo are further immortalized in this expanded collection of tall tales, slick nonfiction, and four full-length novellas.Foreword for The Big Book of Hap and LeonardJoe R. Lansdale can be a pain in the ass. That’s why this book exists.Hap and Leonard collected all of the not-so-dynamic duo’s previously published shorter adventures (circa 2016) plus the original story “Not Our Kind,” basically everything that’s not a novel, in one handsome volume. This being the 21st century and all, an ebook edition was required. And therein lies the problem.Seems Joe had promised the digital rights to the novellas “Hyenas,” “Dead Aim,” and the short story “The Boy Who Became Invisible” to another publisher than Tachyon. So we could wait until 2018 for the ebook, when the rights reverted, or figure out something else. We opted for the latter.The ebook Hap and Leonard Ride Again contained all of the material present in Hap and Leonard except for the trio of stories mentioned above. Since the remaining material scarcely made for a book, we added the original short story “The Oak and the Pond,” the Marvin Hanson novella “A Bone Dead Sadness,” Joe’s comic script adaptation of “The Boy Who Became Invisible,” my interview with Joe, and an original remembrance about the creation of Hap and Leonard by Bill Crider, who sadly died while we were putting together The Big Book of Hap and Leonard.When Joe offered us the rights to “Hyenas,” “Dead Aim,” and “The Boy Who Became Invisible,” we decided it was best to combine the two editions into this one super—dare I say big—book you hold in your virtual hands.Sometimes a pain in the ass leads to gold. Not sure if this qualifies as such but if not, it’s damn close.Rick Klaw, editorAustin, TexasFebruary 23, 2018Table of ContentsForeword for The Big Book of Hap and Leonard by Rick KlawAn Appreciation of Joe R. Lansdale by Michael KorytaJoe R. Lansdale, Hap and Leonard, and Me by Bill CriderHyenasVeil’s Visit (co-written by Andrew Vachss)Death by ChiliDead AimA Bone Dead SadnessThe Boy Who Became Invisible (story)The Boy Who Became Invisible (comic book script)Not Our Kind (original e-book publication)The Oak and the Pond (original e-book publication)Bent TwigJoe R. Lansdale Interviews Hap Collins and Leonard PineInterview with Joe R. LansdaleThe Care and Feeding and Raising Up of Hap and Leonard",
  "genres": [
    "Mystery",
    "Crime",
    "Short Stories",
    "Fiction",
    "Thriller",
    "Noir"
  ],
  "author": "Joe R. Lansdale",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/39079230-the-big-book-of-hap-and-leonard"
}