{
  "title": "Enterre seus mortos",
  "description": "Edgar Wilson é “um homem simples que executa tarefas”. Trabalha no órgão responsável por recolher animais mortos em estradas e levá-los para um depósito onde são triturados num grande moedor. Seu colega de profissão, Tomás, é um ex-padre excomungado pela Igreja Católica que distribui extrema unção aos moribundos vítimas de acidentes fatais que cruzam seu caminho.A rotina de Edgar Wilson, absurda em sua pacatez, é alterada quando ele se depara com o corpo de uma mulher enforcada dentro da mata. Quando descobre que a polícia não possui recursos para recolhê-lo — o rabecão está quebrado —, o funcionário é incapaz de deixá-lo à mercê dos abutres e decide rebocar o cadáver clandestinamente até o depósito, onde o guarda num velho freezer, à espera de um policial que, quando chega, não pode resolver a situação.Nos próximos dias, o improvisado esquife receberá ainda outro achado de Wilson, o lacônico herói deste desolador romance kafkiano: desta vez o corpo de um homem. Habituados a conviver com a brutalidade, Edgar e Tomás não se abalam diante da morte, mas conhecem a fronteira, pela qual transitam diariamente, entre o bem e o mal, o homem e o animal. Enquanto Tomás se empenha em salvar a alma, Edgar se preocupa com a carcaça daqueles que cruzam seu caminho. Por isso, os dois decidem dar um fim digno àqueles infelizes cadáveres.Em sua tentativa de devolvê-los ao curso da normalidade, palavra fugidia no universo que Ana Paula Maia constrói magistralmente, os dois removedores de animais mortos conhecerão o insalubre destino de seus semelhantes. Com uma linguagem seca, que mimetiza as estradas pelas quais o romance se desenrola, a autora faz brotar questões existenciais de difícil resolução. O resultado é uma inusitada mescla de romance filosófico e faroeste que revela o poderoso projeto literário de Maia.",
  "genres": [
    "Fiction",
    "Horror",
    "Literature",
    "Contemporary",
    "Romance",
    "Portuguese Literature",
    "Suspense"
  ],
  "author": "Ana Paula Maia",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/39072869-enterre-seus-mortos"
}