{
  "title": "My Night With Orson",
  "description": "Product DescriptionMy Night With Orson is the story of Oscar nominated screenwriter and playwright Julian Barry’s forty year journey through the wilds of the American and English theatre as well as the movie business. Julian worked with numerous actors, producers and writers and shares his insightful, comical interactions with many of them – allowing readers to see these celebrities in a whole new light. This engaging book reads like you are in the room with Julian and he is discussing the stories with you. The “cast” of the book includes Actors: Orson Welles, Mel Gibson, Dustin Hoffman, Richard Burton, Jose Ferrer, Mandy Patinkin, Jane Alexander, Sissy Spacek, Faye Dunaway, Tommy Lee Jones, Tony Bennett and Eddie Izzard; Directors Sir Peter Hall, Bob Fosse, Marty Ritt, Tom O’Horgan and Mel Brooks; the Composer Marvin Hamlisch; a weekend in Vermont with our first Poet Laureate Robert Penn Warren and an unforgettable afternoon in Las Vegas with Frank Sinatra.About the AuthorA former Broadway actor and stage manager, Mr. Barry is best known for the play Lenny, based on the life and words of comic Lenny Bruce, and for the Bob Fosse/Dustin Hoffman film adaptation of the play for which Mr. Barry was nominated for an Academy Award. He began writing for the screen during the first season of Mission: Impossible. His first produced screenplay was an adaptation of Eugene Ionesco’s play Rhinoceros for the American Film Theatre which starred Zero Mostel and Gene Wilder. His next film was The River starring Mel Gibson and Sissy Spacek followed by Me, Myself And I starring George Segal and Jobeth Williams. His continuing work in the theatre was mainly in the United Kingdom where he resided for two years. Jean Seberg a Musical (National Theatre), written with Marvin Hamlisch and Chris Adler, directed by Sir Peter Hall, Born Again, in collaboration with Peter Hall, starring Mandy Patinkin and Jose Ferrer (Chichester Festival Theatre), The Matter of the Officers (National Theatre) and Peter Hall’s revival of Lenny with Eddie Izzard (London). Mister Barry returned to Television to write A Marriage: Georgia O’Keeffe and Alfred Stieglitz for PBS’ American Playhouse, starring Jane Alexander and Christopher Plummer. An Opera, Zyklon, written in collaboration with the English musician and composer Peter King was performed in New York in 2005. Mr. Barry lives in Redding, Connecticut and spends most of his time playing the trumpet.",
  "genres": [],
  "author": "Julian Barry",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/12283467-my-night-with-orson"
}