{
  "title": "Samadhi: Unity of Consciousness and Existence",
  "description": "Are you searching for enlightenment?Do you seek knowledge of the chakra system?Enjoy discovering essential answers about yourself and existence.The more alert people are, the more they are in harmony, full of understanding and love; the more unconscious they are, the more they are conditioned by natural causality, and undergo conflict with nature, the world, and the people around them.The true goal of all of spirituality and all methods of meditation is enlightenment, and the true essence of enlightenment is knowledge of the unity of consciousness and existence.Consciousness is basically all of existence. Consciousness and existence are one and the same, but express themselves in different ways: existence as all of manifested matter and energy, and consciousness as our unexpressed inner being. Consciousness refers to all the higher and finer dimensions that manifest themselves as the gross reality of the physical world.All of nature is one big information system that communicates instantaneously amongst all of its seemingly divided parts. Our nervous system does not create or convey consciousness, but it slows consciousness down to a recognisable level in order for us to be able to communicate and live in this three-dimensional physical reality, in the way we exist now. If this were not so, we would be lost in the entirety of nature, and it would not be possible for us to exist in this physical shape.All of life and all beings exist in order to manifest the unity of consciousness and existence, in all possible ways. Throughout all forms of existence, there is always one divine consciousness. There are not many different consciousnesses. Therefore, the consciousness within us recognises and connects with everything that exists. It is the consciousness of our soul.Our soul is the individual expression of the divine consciousness that enables everything, that enables existence itself.In man, the unity of existence and consciousness is the most clearly condensed and expressed. His psycho-energetic centres - or chakras - are where consciousness and existence gradually connect, creating different frequencies of energy and action. The ultimate recognition of the unity of the divine consciousness and existence is man's enlightenment, Samadhi.In their overall awareness and expression, all of the drama of our human lives, all of culture and civilization is contained. All of the destruction in our lives is manifested by our unconsciousness of the unity of consciousness and existence, by our misunderstanding of existence.Now you can explore the connection of both in all aspects of your individual existence, and understand how your existence, and your consciousness, is related to the existence of everything.Explanations are given in the following chapters:- The Nature of Existence- The Nature of Energy- Parallel Realities- The Dimensions of Existence- Unity of Consciousness and Existence, of Body and Soul- The Higher and Lower Nature of Chakras- Energetic Chakra Activation- The Principle of Energy Preservation for the Uplifting of Consciousness- And much more... ---  \"I have read thousands of books on Spirituality. In all of them I consider this book as the very best one.\" - Justine, author of the book \"Actual Freedom - Made Easy\" \"Nowhere did I find a better connection between the state of man's consciousness, or the chakras, with the civilization development, so brief and clear. The ultimate conclusion that the whole nature exists with the purpose of enlightening the man makes this book unforgettable and necessary.\" - Clifford Thurlow, writer and independent filmmaker.",
  "genres": [
    "Spirituality"
  ],
  "author": "Ivan Antic",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/39076003-samadhi"
}