{
  "title": "Daughters of Artemis",
  "description": "Werewolf lore has long been dominated by tales of the strong alpha male, but what of the strong alpha females? The Storm Moon Press anthology \"Daughters of Artemis\" explores this mostly neglected aspect of the werewolf mythos, with an erotic twist.Bounty hunter Toni McGowan has faced supernatural beasts that would send most running, but her latest assignment may be the toughest yet--playing babysitter to a New Ager wannabe. Jade Nicols, though, has a few secrets of her own, the darkest of which may just get them both killed.Luna Rivers isn't the most graceful of people at the best of times, and being stalked by shadowy figures and prowling wolves hardly qualifies. But after being rescued by the beautiful and sensual Syrene, Luna learns that there is more to herself than she'd ever suspected. She's a werewolf, too, and in a whole new world of danger.Andrea---Andy to most---is a pack leader in the forests of Washington state. Poaching in a nearby pack's territory throws suspicion on Andy's leadership. In order to find the truth, Andy and her mate Fiona find themselves forced into an uneasy alliance with Rafael, the other pack's alpha.Susan Runningwind is forty-five, but already strong enough to have earned a seat among her pack's elders. Jesse Westfield is a documentary filmmaker investigating the so-called \"Werewolves of South Dakota.\" But when Jesse begins to get too close to the truth, Susan must make a choice between her pack's welfare, and the growing attraction she feels to the younger woman.Sasha is the first female in the kingdom of the shapeshifting House of Wood to be granted leadership of her own pack. The transition is hardly smooth, however, and Sasha winds up at odds with Aneira, her mate. Failure to maintain control of her pack would mean demotion and shame, but doing what she knows she must could drive Aneira away forever.When werewolf Katya captures blind weretiger Yun alone in the wilderness, she sees only an opportunity to finally end the raging conflict between their two peoples. Yun remains loyal to the tigers, though, and as time passes, Katya finds herself less and less inclined to force the information from her. But when the fight comes to them, both will see their loyalties tested in the crucible of battle.",
  "genres": [
    "Fantasy",
    "Anthologies",
    "Lesbian",
    "Werewolves",
    "Paranormal",
    "Erotica",
    "Romance"
  ],
  "author": "S.L. Armstrong",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/12283443-daughters-of-artemis"
}