{
  "title": "Taming the Giant",
  "description": "A Princess ruling on a cold, dark world A Warrior dreaming of a female he can love and protect A perfect match? Maybe not…he's a Giant. Can Alanah and Bram overcome their differences to be together? Read Taming the Giant to find out…  The Princess and the Giant…  Meet the Jor’gen Kindred. After leaving the main Mother Ship centuries ago to make a genetic trade with a massive race of people, they are thirty percent bigger than their ancestors. Which makes them 9 feet tall—giants to regular sized humanoids. Now, hundreds of years after the genetic trade which made them so huge, the Jor’gen Kindred have no more females and are seeking a new people to trade with. Bram, their captain, has been dream-sharing with a female from a small, cold, rocky planet at the far edge of the galaxy. The problem? She’s tiny compared to him.  Alanah is the ruler of her people but not by choice. After a plague carried off all the men and boys, including her father the king, she and the female members of her pre-industrial society were left to fend for themselves. Alanah has always felt like an outsider. Not only is she a princess but she’s considered much too tall for a woman. The other ladies at court sneer at her behind her back, wondering where she will ever find a man big enough to take her on.  Enter Bram, a giant three feet taller than Alanah. Suddenly the formerly too-tall princess is feeling positively petite. But Alanah’s planet is stuck in the Dark Ages and Kindred technology looks like magic to them—black magic. Can Alanah convince her people the giant race is safe to join with? And can she and Bram overcome their differences—both physical and emotional—to form a lasting relationship?  You’ll have to read Taming the Giant to find out.",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction",
    "Paranormal",
    "Science Fiction Romance",
    "Erotica",
    "Fantasy"
  ],
  "author": "Evangeline Anderson",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/39077347-taming-the-giant"
}