{
  "title": "Soul by Soul: Life Inside the Antebellum Slave Market",
  "description": "Soul by Soul tells the story of slavery in antebellum America by moving away from the cotton plantations and into the slave market itself, the heart of the domestic slave trade. Taking us inside the New Orleans slave market, the largest in the nation, where 100,000 men, women, and children were packaged, priced, and sold, Walter Johnson transforms the statistics of this chilling trade into the human drama of traders, buyers, and slaves, negotiating sales that would alter the life of each. What emerges is not only the brutal economics of trading but the vast and surprising interdependencies among the actors involved.Using recently discovered court records, slaveholders' letters, nineteenth-century narratives of former slaves, and the financial documentation of the trade itself, Johnson reveals the tenuous shifts of power that occurred in the market's slave coffles and showrooms. Traders packaged their slaves by \"feeding them up,\" dressing them well, and oiling their bodies, but they ultimately relied on the slaves to play their part as valuable commodities. Slave buyers stripped the slaves and questioned their pasts, seeking more honest answers than they could get from the traders. In turn, these examinations provided information that the slaves could utilize, sometimes even shaping a sale to their own advantage.Johnson depicts the subtle interrelation of capitalism, paternalism, class consciousness, racism, and resistance in the slave market, to help us understand the centrality of the \"peculiar institution\" in the lives of slaves and slaveholders alike. His pioneering history is in no small measure the story of antebellum slavery.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Race",
    "African American",
    "Grad School",
    "Politics"
  ],
  "author": "Walter Johnson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/390812.Soul_by_Soul"
}