{
  "title": "The Breakthrough: Immunotherapy and the Race to Cure Cancer",
  "description": "From the New York Times bestselling author of The Good Nurse comes an empowering and accessible story of the discoveries of the tricks cancer uses to avoid the immune system, and the important new therapies already unleashing the immune system to fight -- and beat -- the disease. Four years in the writing, The Breakthrough is an \"exciting read\" about the discoveries which received the 2018 Nobel Prize winning discoveries in October, and a dramatic and exciting turning point in our relationship with a disease that has for too long defined us.For decades, scientists have puzzled over one of medicine's most confounding mysteries: Why doesn't our immune system recognize and fight cancer the way it does other diseases, like the common cold?As it turns out, the answer to that question can be traced to a series of tricks that cancer has developed to turn off normal immune responses-tricks that scientists have only recently discovered and learned to defeat. The result is what many are calling cancer's \"penicillin moment,\" a revolutionary discovery in our understanding of cancer and how to beat it.In THE BREAKTHROUGH, Graeber guides readers through the revolutionary scientific research bringing immunotherapy out of the realm of the miraculous and into the forefront of twenty-first-century medical science. As advances in the fields of cancer research and the human immune system continue to fuel a therapeutic arms race among biotech and pharmaceutical research centers around the world, the next step-harnessing the wealth of new information to create modern and more effective patient therapies-is unfolding at an unprecedented pace, rapidly redefining our relationship with this all-too-human disease.Groundbreaking, riveting, and expertly told, THE BREAKTHROUGH is the story of the game-changing scientific discoveries that unleash our natural ability to recognize and defeat cancer, as told through the experiences of the patients, physicians, and cancer immunotherapy researchers who are on the front lines. This is the incredible true story of the race to find a cure, a dispatch from the life-changing world of modern oncological science, and a brave new chapter in medical history",
  "genres": [
    "Science",
    "Nonfiction",
    "Medicine",
    "Health",
    "Biology",
    "Medical",
    "Health Care"
  ],
  "author": "Charles Graeber",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/39088907-the-breakthrough"
}