{
  "title": "Resilient Cities: Responding to Peak Oil and Climate Change",
  "description": "Half of the world’s inhabitants now live in cities. In the next twenty years, the number of urban dwellers will swell to an estimated five billion people. With their inefficient transportation systems and poorly designed buildings, many cities―especially in the United States―consume enormous quantities of fossil fuels and emit high levels of greenhouse gases. But our planet is rapidly running out of the carbon-based fuels that have powered urban growth for centuries and we seem to be unable to curb our greenhouse gas emissions. Are the world’s cities headed for inevitable collapse? The authors of this spirited book don’t believe that oblivion is necessarily the destiny of urban areas. Instead, they believe that intelligent planning and visionary leadership can help cities meet the impending crises, and look to existing initiatives in cities around the world. Rather than responding with fear (as a legion of doomsaying prognosticators have done), they choose hope. First, they confront the problems, describing where we stand today in our use of oil and our contribution to climate change. They then present four possible outcomes for ”collapse,” “ruralized,”  “divided,” and “resilient.” In response to their scenarios, they articulate how a new “sustainable urbanism” could replace today’s “carbon-consuming urbanism.” They address in detail how new transportation systems and buildings can be feasibly developed to replace our present low efficiency systems. In conclusion, they offer ten “strategic steps” that any city can take toward greater sustainability and resilience. This is not a book filled with “blue sky” theory (although blue skies will be a welcome result of its recommendations). Rather, it is packed with practical ideas, some of which are already working in cities today. It frankly admits that our cities have problems that will worsen if they are not addressed, but it suggests that these problems are solvable. And the time to begin solving them is now.",
  "genres": [
    "Environment",
    "Urban Planning",
    "Sustainability",
    "Collections",
    "Peak Oil"
  ],
  "author": "Peter Newman",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/3909145-resilient-cities"
}