{
  "title": "And the Whole Mountain Burned",
  "description": "Four-tour combat veteran Ray McPadden offers a vivid portrayal of American soldiers facing an unseen enemy and death in the Mountains of Afghanistan.Sergeant Nick Burch has returned to the crags of tribal Afghanistan seeking vengeance. Burch's platoon has one goal: to capture or kill an elusive insurgent, known as the Egyptian, a leader who is as much myth as he is man, highly revered and guarded by ferocious guerrillas. The soldiers of Burch's platoon look to him for leadership, but as the Egyptian slips farther out of reach, so too does Burch's battle-worn grasp on reality.Private Danny Shane, the youngest soldier in the platoon, is learning how to survive. For Shane, hunting the Egyptian is secondary. First he must adapt to the savage conditions of the battlefield: crippling heat, ravenous sand fleas, winds thick with moondust, and a vast mountain range that holds many secrets. Shane is soon chiseled by combat, shackled by loyalty, and unflinchingly marching toward a battle from which there is no return. A new enemy has emerged, one who has studied the American soldiers and adapted to their tactics. Known as Habibullah, a teenage son of the people, he stands in brazen defiance of the Ameriki who have come to destroy what his ancestors have built. The American soldiers may be tracking the Egyptian, but Habibullah is tracking them, and he knows these lands far better than they do.With guns on full-auto, Shane and Burch trek into the deepest solitudes of the Himalayas. Under soaring peaks, dark instinct is laid bare. To survive, Shane and Burch must defeat not just Habibullah's militia but the beast inside themselves.And the Whole Mountain Burned reveals, in stunning, ruthless detail, the horrors of war, the courage of soldiers, and the fact that no matter how many enemies we vanquish, there is always another just over the next ridge.",
  "genres": [
    "Fiction"
  ],
  "author": "Ray McPadden",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/39088997-and-the-whole-mountain-burned"
}