{
  "title": "Mudwoman",
  "description": "A riveting novel that explores the high price of success in the life of one woman—the first female president of a lauded ivy league institution—and her hold upon her self-identity in the face of personal and professional demons, from Joyce Carol Oates, author of the New York Times bestseller A Widow’s StoryMudgirl is a child abandoned by her mother in the silty flats of the Black Snake River. Cast aside, Mudgirl survives by an accident of fate—or destiny. After her rescue, the well-meaning couple who adopt Mudgirl quarantine her poisonous history behind the barrier of their middle-class values, seemingly sealing it off forever. But the bulwark of the present proves surprisingly vulnerable to the agents of the past.Meredith “M.R.” Neukirchen is the first woman president of an Ivy League university. Her commitment to her career and moral fervor for her role are all-consuming. Involved with a secret lover whose feelings for her are teasingly undefined, and concerned with the intensifying crisis of the American political climate as the United States edges toward war with Iraq, M.R. is confronted with challenges to her leadership that test her in ways she could not have anticipated. The fierce idealism and intelligence that delivered her from a more conventional life in her upstate New York hometown now threaten to undo her.A reckless trip upstate thrusts M.R. Neukirchen into an unexpected psychic collision with Mudgirl and the life M.R. believes she has left behind. A powerful exploration of the enduring claims of the past, Mudwoman is at once a psychic ghost story and an intimate portrait of a woman cracking the glass ceiling at enormous personal cost, which explores the tension between childhood and adulthood, the real and the imagined, and the “public” and “private” in the life of a highly complex contemporary woman.",
  "genres": [
    "Fiction",
    "Horror",
    "Literary Fiction",
    "Book Club",
    "Contemporary",
    "Literature",
    "Adult Fiction"
  ],
  "author": "Joyce Carol Oates",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/12285072-mudwoman"
}