{
  "title": "Gailsone: Head of the Dragon",
  "description": "Alice Gailsone returns in the third explosive novel in the Gailsone series!The superhuman community is in trouble. The newly appointed senator Carter has joined forces with the Purge in an effort to rid the world of superhumans, and he has the means, and the backup, to do it. With an orchestrated public relations nightmare focused on Alice and her team and the disappearance of Allen Tanner, it will take everything Victoria Green, newly appointed head of Tanner Industries and head of the Collective Good, has to keep her friends safe.One by one, heroes have been disappearing and no one knows how or why. As the clues start to come together, a menace from the past known only as the Grey has become the number one suspect, but who is he, and what makes him such a menace? As Allison Gailsone puts her analytical skills to use, she and her boyfriend Brandon Vitags, the Red Guard, delve into the mystery of the Grey to once and for all put a stop to his reign of terror.Meanwhile, Holly Gailsone is ready to acclimate back into a normal life. With her first day of middle school in front of her, things are looking bright. Still, old ghosts are hard to shake, and before long the past comes calling for Holly in the most violent way possible. On top of all of this, Anna May and her newly reformed Purge have begun putting their endgame plan in motion. While her generals question her sanity and motives, Anna has gone out of her way to craft the best revenge possible against Alice for sins of the past, and this time Alice, despite her cunning and ability, may not be able to come out on top. After over two years, Head of the Dragon is an all-new novel-length entry to the Gailsone series. With a focus on the Gailsone universe as a whole, Head of the Dragon takes the Gailsone family down a road that they will not easily recover from, and before things are finished, more than one familiar face will be gone forever. An action-packed mystery, Head of the Dragon answers some long-standing questions, including the biggest mystery of the Gailsone universe: who is Anna May, and why does she hate Alice Gailsone?Head of the Dragon is the third in a series of Action/Adventure Urban Fantasy novels about the Gailsone family. Join Alice and Allison as they deal with insubordinate golems, super villain gangs, secret psychics, armed soldiers and insane, killer androids. Follow along as secret plots and sinister forces worm their way out of the shadows to test not only Alice, but the other 'heroes' of the Gailsone universe. A larger plan is unfolding with terrifying implications for the world, and Alice, whether she likes it or not, is still stuck smack dab in the middle.Head of the Dragon is the third book in the Gailsone series, and follows Big In Japan, Red Rook, and the novella series which contain twelve separate Gailsone adventures, both past and present.",
  "genres": [],
  "author": "Casey Glanders",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/39126801-gailsone"
}