{
  "title": "Aegis Evolution",
  "description": "MOVIE RIGHTS OPTIONED. For fans of Maze Runner, Hunger Games and Percy Jackson comes an award-winning story of friendship, courage and a battle for humanity.\n\n\n\nThe second wave is unleashed. The world is forced to its knees.\nTwo strains of a devastating pathogen infect population centers around the globe. From mega-cities to remote villages, the descent into chaos is swift as the disease spreads like wildfire.When Jag is injured from an accident, Tegan reluctantly assumes leadership of the group as they are tasked with their most challenging mission yet by the Elders of Dema-Ki.But things take a turn for the worse when one of them becomes infected and hovers on the brink of death. The friends throw caution to the wind and risk everything in their quest for a cure… one which, for reasons unknown, has remained concealed for over two thousand years.Can Tegan and the League discover the remedy before a relentless enemy locates and destroys it, sending millions of lives to their end?\nIf you like gripping action-adventure stories in an immersive world, then you will love the Aegis League series!\n\n\nWorlds Collide. Heroes Arise.\n\n \"Following the tradition of the prior two books, readers are treated to chapter after chapter of fascinating characters, exciting action and apocalyptic consequences.\" ~~ The US Review of Books ~\nOver 100,000 copies sold/downloaded & 1.5 million page-reads in Kindle Unlimited!\n\nThis is a LIMITED TIME new release offer. Price returns to $4.99 soon!\n\n\nFive Books in the Aegis League Series\n \n   Book 1: Aegis Rising (available now) \n   Book 2: Aegis Incursion (available now) \n   Book 3: Aegis Evolution (available Mar. 2018) \n   Book 4: Aegis Desolation (available May 2018) \n   Book 5: Aegis Reckoning (available Nov. 2018)",
  "genres": [
    "Thriller",
    "Young Adult",
    "Fantasy"
  ],
  "author": "S.S. Segran",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/39104888-aegis-evolution"
}