{
  "title": "The Independence of Miss Mary Bennet",
  "description": "Everyone knows the story of Elizabeth and Jane Bennet in \"Pride and Prejudice.\" But what about their sister Mary? At the conclusion of Jane Austen's classic novel, Mary, bookish, awkward, and by all accounts, unmarriageable, is sentenced to a dull, provincial existence in the backwaters of Britain. Now, master storyteller Colleen McCullough rescues Mary from her dreary fate with \"The Independence of Miss Mary Bennet,\" a page-turning sequel set twenty years after Austen's novel closes. The story begins as the neglected Bennet sister is released from the stultifying duty of caring for her insufferable mother. Though many would call a woman of Mary's age a spinster, she has blossomed into a beauty to rival that of her famed sisters. Her violet eyes and perfect figure bewitch the eligible men in the neighborhood, but though her family urges her to marry, romance and frippery hold no attraction. Instead, she is determined to set off on an adventure of her own. Fired with zeal by the newspaper letters of the mysterious Argus, she resolves to publish a book about the plight of England's poor. Plunging from one predicament into another, Mary finds herself stumbling closer to long-buried secrets, unanticipated dangers, and unlooked-for romance. Meanwhile, the other dearly loved characters of \"Pride and Prejudice\" fret about the missing Mary while they contend with difficulties of their own. Darcy's political ambitions consume his ardor, and he bothers with Elizabeth only when the impropriety of her family seems to threaten his career. Lydia, wild and charming as ever, drinks and philanders her way into dire straits; Kitty, a young widow of means, occupies herself with gossip and shopping; and Jane, naive and trusting as ever, spends her days ministering to her crop of boys and her adoring, if not entirely faithful, husband. Yet, with the shadowy and mysterious figure of Darcy's right-hand man, Ned Skinner, lurking at every corner, it is clear that all is not what it seems at idyllic Pemberley. As the many threads of McCullough's masterful plot come together, shocking truths are revealed, love, both old and new, is tested, and all learn the value of true independence in a novel for every woman who has wanted to leave her mark on the world.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Regency",
    "Chick Lit",
    "Historical Romance"
  ],
  "author": "Colleen McCullough",
  "average_rating": "2.98",
  "url": "https://www.goodreads.com/book/show/3919195-the-independence-of-miss-mary-bennet"
}