{
  "title": "The Bed I Made: A Journey of Fulfilled Hope, Fifty Years in the Making",
  "description": "Christmas sale!Purchase the paperback for $14.95 (regular $16.95) and you can then get the Kindle version for $1.99 (regular $6.95)! So get the paperback(s) as a gift and keep the Kindle for yourself! Only at Amazon.The Chosin Reservoir was one of the toughest tests passed for the greatest fighting force the world has ever known: The United States Marine Corps. For Joe Lynch, the greater test would be the fifty-two year battle with PTSD that followed.When Joe landed in Korea with the 1st Provisional Marine Brigade on August 2, 1950—his nineteenth birthday—the North Korean People’s Army had all but secured victory in their unprovoked invasion of South Korea and their desire to unite the peninsular under communist rule. But the Fire Brigade, as these Marines were known, weren’t going to let it happen.Follow Joe through the most famous Marine Corps battles during the opening months of the Korean War in this gripping and heartfelt personal account of a gruesome war. The grueling Pusan Perimeter, the unlikely and perfectly executed Inchon Landing, the repatriation of Seoul, and the inhuman Chosin Reservoir Campaign are recounted in vivid prose through this young Marine’s eyes. There is no glorification of war, only of the courage displayed and the heartbreak experienced by men who, only months before, couldn’t find Korea on a map.Thrust into battle undermanned and poorly equipped, the Marines proved their worth and saved a nation. Thrust back into civilian life, this Marine would carry the weight of war for over five decades. His medals for bravery, both in Korea, and later with the New York City Police Department, merely masked his personal struggle to reunite with his former happy and carefree nature, and to prevent his death… by his own hand.Joe’s heroism in Korea pales in comparison to the courage he displays in sharing this personal and revealing account of courage, tragedy, and improbable triumph over the demons of PTSD. But his story is not his alone. His is the story of combat veterans of generations before and after. It is the shared story of the uncounted hidden heroes among us who fight their own daily battles of survival.One reader says: “This book should be required reading at every high school in America.”The Bed I Made was awarded first place in the 2016 Royal Palm Literary Award Competition.",
  "genres": [
    "History"
  ],
  "author": "Robert M.  Lynch",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/39171056-the-bed-i-made"
}