{
  "title": "West Wingers: Stories from the Dream Chasers, Change Makers, and Hope Creators Inside the Obama White House",
  "description": "The Obama White House staff invites us behind-the-scenes of history for a deeply personal and moving look at the presidency and how the president’s staff can change the nation“ West Wingers is exceptional. . . . We have so much to learn from these stories. ” —President BidenWhen we elect a president, we elect with them an entire team that will join them in the West Wing to help run the country. Each of these staffers has a story to tell, and in West Wingers , Barack Obama’s White House staff reveals how these extraordinary citizens shape the presidency and the nation.In these moving and revealing personal stories, eighteen Obama staffers bring us deep inside the presidency, offering intimate accounts of how they made it to the White House, what they witnessed, and what they accomplished there.  We hear from a married gay staffer pushing the president towards marriage equality; a senior aide working to implement the Affordable Care Act while battling Stage IV cancer; a hijab-wearing Muslim adviser accompanying the President to a mosque. In each one we see the human face of government, staffers devoting themselves to the issues that have defined their lives. From the triumphs of Obamacare and marriage equality to the tragedy of the Charleston shooting, this book tells the history of the Obama presidency through the men and women who worked tirelessly to support his vision for America. More than just a history though, West Wingers is an inspiring call to arms for public service, a testament to the possibility of real social change, and a powerful demonstration of what true diversity, inclusivity, and progress can look like in America.“These deeply moving stories offer more than a fascinating view into the window of  they show us how hope becomes real, sustainable change.” —Valerie Jarrett, former senior advisor to President Obama",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Essays",
    "Memoir",
    "American History",
    "Anthologies"
  ],
  "author": "Gautam Raghavan",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/39198114-west-wingers"
}