{
  "title": "Scorched Earth",
  "description": "From David L. Robbins, bestselling author of The End of War and War of the Rats, comes a novel of searing intensity and uncompromising vision. Part mystery, part legal thriller, it is a story of crime and punishment set in a small southern town during one brutal, hot, and unforgiving summer that lays bare the potential of the human heart to hate–and, ultimately, to heal.Scorched EarthThe inhabitants of Good Hope, Virginia, haven’t felt the cooling effects of rain in weeks. The crops are withering. The ground is parched. There is no relief in sight. With the town a tinderbox waiting to explode, all it takes is a spark to ignite all the prejudice, the rage, and the secrets that are so carefully kept hidden. And then, in the midst of the terrible heat, a tragedy occurs. A baby is born and dies in her mother’s arms. The child, Nora Carol, is buried quickly and quietly the next day in a church graveyard. It should have ended right there–but it didn’t, for Nora Carol is of mixed race.The white deacons of Good Hope’s Victory Baptist Church, trying to protect the centuries-old traditions of their cemetery, have the body exhumed. That night the church is set ablaze, and the sole witness is the only suspect–Elijah Waddell, Nora Carol’s father.Nat Deeds, a former prosecutor and an exile of Good Hope, is pressed into service as Elijah’s attorney. With a politically savvy prosecutor and a vindictive sheriff aligned against him, Nat knows it will be nearly impossible to get Elijah acquitted. But Elijah refuses to accept a plea.As the evidence mounts, Nat begins to suspect there is something his client isn’t telling him, and the next revelation turns Good Hope into a powder a body is found in the ashes of the church. Now Elijah is accused of murder, and the case is no longer a matter of winning or losing, but of life or death.The only way Nat can save his client is to scratch and claw for any shred of evidence, even if he has to bend the law to find it. As the summer heat intensifies and passions reach their boiling point, Nat must navigate through the incendiary secrets kept by friends and neighbors, by the guilty and the innocent, to an act of justice that has nothing to do with the law.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery Thriller",
    "Mystery",
    "Book Club",
    "Thriller",
    "Contemporary"
  ],
  "author": "David L. Robbins",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/3916352-scorched-earth"
}