{
  "title": "Girl in a Blue Dress",
  "description": "A sweeping tale of love and loss, Girl in a Blue Dress is both an intimate peek at the woman who was behind one of literature’s most esteemed men and a fascinating rumination on marriage that will resonate across centuries.At the end of her life, Catherine, the cast-off wife of Charles Dickens, gave the letters she had received from her husband to their daughter Kate, asking her to donate them to the British Museum, “so the world may know that he loved me once.” The incredible vulnerability and heartache evident beneath the surface of this remark inspired Gaynor Arnold to write Girl in a Blue Dress, a dazzling debut novel inspired by the life of this tragic yet devoted woman. Arnold brings the spirit of Catherine Dickens to life in the form of Dorothea “Dodo” Gibson–a woman who is doomed to live in the shadow of her husband, Alfred, the most celebrated author in the Victorian world. The story opens on the day of Alfred’s funeral. Dorothea is not among the throngs in attendance when The One and Only is laid to rest. Her mourning must take place within the walls of her modest apartment, a parting gift from Alfred as he ushered her out of their shared home and his life more than a decade earlier. Even her own children, save her outspoken daughter Kitty, are not there to offer her comfort–they were poisoned against her when Alfred publicly declared her an unfit wife and mother. Though she refuses to don the proper mourning attire, Dodo cannot bring herself to demonize her late husband, something that comes all too easily to Kitty. Instead, she reflects on their time together–their clandestine and passionate courtship, when he was a force of nature and she a willing follower; and the salad days of their marriage, before too many children sapped her vitality and his interest. She uncovers the frighteningly hypnotic power of the celebrity author she married. Now liberated from his hold on her, Dodo finds the courage to face her adult children, the sister who betrayed her, and the charming actress who claimed her husband’s love and left her heart aching. A sweeping tale of love and loss that was long-listed for both the Man Booker Prize and the Orange Prize, Girl in a Blue Dress is both an intimate peek at the woman who was behind one of literature’s most esteemed men and a fascinating rumination on marriage that will resonate across centuries.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "British Literature",
    "Victorian",
    "19th Century"
  ],
  "author": "Gaynor Arnold",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/3916763-girl-in-a-blue-dress"
}