{
  "title": "Left to Their Own Devices: How Digital Natives Are Reshaping the American Dream",
  "description": "A sociologist explores the many ways that digital natives' interaction with technology has changed their relationship with people, places, jobs, and other stabilizing structures and created a new way of life that is at odds with the American Dream of past generations.Digital natives are hacking the American Dream. Young people brought up with the Internet, smartphones, and social media are quickly rendering old habits, values, behaviors, and norms a distant memory--creating the greatest generation gap in history. In this eye-opening book, digital sociologist Julie M. Albright looks at the many ways in which younger people, facilitated by technology, are coming \"untethered\" from traditional aspirations and ideals, and What are the effects of being disconnected from traditional, stabilizing social structures like churches, marriage, political parties, and long-term employment? What does it mean to be human when one's ties to people, places, jobs, and societal institutions are weakened or broken, displaced by digital hyper-connectivity? Albright sees both positives and negatives. On the one hand, mobile connectivity has given digital nomads the unprecedented opportunity to work or live anywhere. But, new threats to well-being are emerging, including increased isolation, anxiety, and loneliness, decreased physical exercise, ephemeral relationships, fragmented attention spans, and detachment from the calm of nature.In this time of rapid, global, technologically driven change, this book offers fresh insights into the unintended societal and psychological implications of lives exclusively lived in a digital world.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Parenting",
    "Education",
    "Technology"
  ],
  "author": "Julie M.  Albright",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/39196377-left-to-their-own-devices"
}