{
  "title": "My Name Is a Knife",
  "description": "Following on \n\nAll True Not a Lie in It\n\n, her brilliant, award-winning first novel, Alix Hawley brings us the dramatic end of fabled frontiersman Daniel Boone's story--a heartbreaking and powerful imagining of a crucial period in North American history.\nThe truth of it is that Daniel Boone, captured by the Shawnee, now the adopted son of a chief he respects and husband to a Shawnee wife, does not want to come back to his settler life. But when he learns the Shawnee and the English plan to attack the fort he founded, where his white wife and children remain, he escapes in order to warn them. No arms open to greet him, however: Rebecca has taken all of their children save one--Jemima--back east. The other settlers view him with suspicion, and some of them want him hanged as a traitor. Yet even his enemies know that nobody but Boone can save them in the brutal siege of the fort that is soon upon them, led by Blackfish, Boone's Shawnee father.  Heartsick over the carnage, when the siege is over Boone travels east to retrieve his family. He finds a wife who has made a life for herself and their children, and still resents him for their oldest son's death. Slowly he woos her, until Rebecca finds herself following him back to Kentucky, to a new Boone settlement across the river from the old one. For a brief and peaceful time, Boone believes that maybe there's a way that indigenous and white can travel forward together, but inevitably he realizes that he can't control the juggernaut of hate and conquest that will soon roll over the Shawnee and the Cherokee. And he has to decide whether to simply be killed in the fighting, or to kill. In the tragic aftermath, Rebecca is left to wonder whether there is any way she can continue to love what remains of Boone.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Alix Hawley",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/39204170-my-name-is-a-knife"
}