{
  "title": "Theory",
  "description": "A smart, sensual and witty novel about what happens when love and intellect are set on a collision course. This compact tour de force affirms Dionne Brand's place as one of Canada's most dazzling and influential artists. Theory begins as its narrator sets out, like many a graduate student, to write a wildly ambitious thesis on the past, present, and future of art, culture, race, gender, class, and politics--a revolutionary work that its author believes will synthesize and thereby transform the world.While our narrator tries to complete this magnum opus, three lovers enter the story, one after the other, each transforming the endeavour: first, there is beautiful and sensual Selah, who scoffs at the narrator's constant tinkering with academic abstractions; then altruistic and passionate Yara, who rescues every lost soul who crosses her path; and finally, spiritual occultist Odalys, who values magic and superstition over the heady intellectual and cultural circles the narrator aspires to inhabit. Each galvanizing love affair (representing, in turn, the heart, the head, and the spirit) upends and reorients the narrator's life and, inevitably, requires an overhaul of the ever larger and more unwieldy dissertation, with results both humorous and poignant.By effortlessly telling this short, intense tale in the voice of an unnamed, ungendered (and brilliantly unreliable) narrator, Dionne Brand makes a bold statement not only about love and personhood, but about race and gender--and what can and cannot be articulated in prose when the forces that inhabit the space between words are greater than words themselves.A gorgeous, profoundly moving, word- and note-perfect novel of ideas that only a great artist at the height of her powers could write.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Canada",
    "Contemporary",
    "Literary Fiction",
    "Canadian Literature"
  ],
  "author": "Dionne Brand",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/39204173-theory"
}