{
  "title": "Tschiffely's Ride: Ten Thousand Miles in the Saddle from Southern Cross to Pole Star",
  "description": "No one knew they were looking at a hero and his two horses. Instead the local press derided him as \"a lunatic proposing to ride overland to New York.\" The time was 1925. The place, Buenos Aires, Argentina. Standing on the threshold of equestrian travel history was a young Swiss Long Rider named Aimé Tschiffely. Next to him were his two faithful Criollo horses, Mancha and Gato. Their collective goal was to ride more than ten thousand miles from Buenos Aires to New York. No one had ever attempted such a journey. Everyone thought Tschiffely was mad. Looking back on what would become the most famous equestrian journey of the modern age, it is difficult to believe that anyone doubted the abilities of the legendary Long Rider and his hardy horses. Yet the school teacher who became an equestrian explorer had been told he was too inexperienced, his horses too old, and the journey too difficult. What Aimé Tschiffely was told was wrong. This is the story of the greatest equestrian epic of the twentieth century, a journey that came about because a man and his horses refused to quit - ever! During the course of their travels Tschiffely, Mancha and Gato crossed deadly deserts, passed through jungles, traversed sky-high mountain passes - and rode on. They were assailed by vampire bats, mistaken for gods and navigated the Panama Canal - but rode on. Nothing stopped them. No one since has rivalled their accomplishments. Often imitated but never outdone, this timeless book remains the most beloved equestrian travel classic of all time. So saddle up for the ride of a lifetime. But the story of Tschiffely's Ride has inspired five generations to take to the saddle in search of mounted adventure.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Adventure",
    "History",
    "Animals",
    "Horses"
  ],
  "author": "Aimé Tschiffely",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/392227.Tschiffely_s_Ride"
}