{
  "title": "Jung and the Lost Gospels: Insights into the Dead Sea Scrolls and the Nag Hammadi Library",
  "description": "The \"Lost Gospels\" refer to the Dead Sea Scrolls and the Nag Hammadi Library, both discovered in the 1940s. The Nag Hammadi Library consists of writings found by two peasants who unearthed clay jars in 1945 in upper Egypt. These did not appear in English for 32 years, because the right to publish was contended by scholars, politicians, and antique dealers. The Dead Sea Scrolls , discovered in clay jars in Palestine by a goat herder in 1947, weathered similar storms. The first team of analysts were mostly Christian clergy, who weren't anxious to share material that frightened church leaders. As Dr. Hoeller shows, they rightly feared the documents would reveal information that might detract from unique claims of Christianity. Indeed, the Dead Sea Scrolls and Nag Hammadi Library both contradict and complement accepted tenets of the Old and New Testaments. As to the connection with Jung, Dr. Hoeller states, \"Jung knew that the one and only tradition associated with Christianity that regarded the human psyche as the container of the divine-human encounter was that of the Gnostics of the the first three centuries of our era. For this reason he called for a renewed appreciation of this ancient tradition, and particularly for a return to the Gnostic sense of God as an inner directing and transforming presence.\" Dr. Hoeller goes on in his preface, \"His sympathetic insight into the myths, symbols, and metaphors of the Gnostics, whom by his own admission he regarded as long-lost friends, continues as the brightest beacon of our day...\" Chapters include such topics as Saintly The People of the Scrolls, The Dancing The Myth of the Gnostic Christ and The Secret Sayings of The Gospel of Thomas. The book also includes a thorough notes section as well as an index.",
  "genres": [
    "Psychology",
    "Gnosticism",
    "Religion",
    "Philosophy",
    "Spirituality",
    "Nonfiction",
    "Mythology"
  ],
  "author": "Stephan A. Hoeller",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/392720.Jung_and_the_Lost_Gospels"
}