{
  "title": "American River: Currents: Book Two of the American River Trilogy",
  "description": "In the second book of the American River trilogy, a cavalcade of disastersboth personal and publicthreatens to overwhelm the scattered members of the McPhalan, Ashida, and Morales clans during the tumultuous 1960s. Katestill mourning the death of her brother, Julianfinds herself torn between her love for Carl, now a celebrated conductor who is looking for career opportunities on the East Coast, and her devotion to the West and especially the family ranch at Mockingbird. Also, while attending a music festival in Venice, Italy, she meets Stefan Molnar, a renowned concert pianist, who has become her sister Alexs mentor (and lover). As Kate and Stefans unintentional relationship grows, complications multiply. Meanwhile, Tommy Ashida, now studying in Japan, falls in love with Emiko Namura, the beautiful, sheltered daughter of a Tokyo businessman. He hopes she holds the key to understanding his Japanese heritage, but will that knowledge lead to happiness or something darker? Determined to make her mark in the male-dominated art world, Kates mother, Marian, decides to move to New York while Kates father, Owen, becomes involved in local politics. When he is elected to the California Assembly, he finds himself in direct opposition to Jorge Morales, Carls father. Alliances fray, relationships dissolve, divisive secrets are revealed, and promises are broken as the members of three California families struggle to salvage their shattered dreams. Set against the natural beauty of Northern California, OConnor weaves a complex tapestry of interrelationships and betrayals that captures the mood and resonance of a decade that began in innocence and ended in despair. American Currents, Book Two of the American River Trilogy, is filled with passionate and resolute characters who refuse to let go of their unique visions of successeven as lifes tumultuous currents threaten to sweep them all away.",
  "genres": [],
  "author": "Mallory M. O'Connor",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/39277720-american-river"
}