{
  "title": "The Castle of Earth and Embers",
  "description": "BRAND NEW reverse harem series laced with Celtic mythology, gothic mystery, and four gorgeous guys, all served up with lashings of British wit.  Maeve Crawford has her life mathematically calculated down to the last detail; Leave her podunk Arizona town, graduate MIT, get into the space program, be the first woman on Mars, read lots of books, get a cat (not necessarily in this order).  All Maeve’s careful plans come crashing down when her parents are killed in a freak accident, and she discovers she’s inherited a real, honest-to-goodness English castle – complete with turrets, ramparts, and four gorgeous male tenants.  Corbin – the protector wallowing in guilt Arthur – the warrior tired of fighting Flynn – the trickster with an artist’s soul Rowan – the enigma whose scars run deep  As soon as Maeve enters Briarwood, she’s drawn to Corbin, Arthur, Flynn and Rowan – four beautiful boys drenched in grief, hope, and ancient magic. Maeve needs them all to heal her broken heart, and they need her to help them protect the world from the fae host baying at the castle gates.  Dark forces converge on Briarwood castle, and Maeve Crawford – science geek, scarred soul, lover of four remarkable men – must draw from herself a power she never imagined in order to protect the shattered remains of her life.  The Castle of Earth and Embers is the first in a brand new steamy reverse harem romance by USA Today bestselling author, Steffanie Holmes. This full-length book glitters with love, heartache, hope, grief, dark magic, fairy trickery, steamy scenes, British slang, meat pies, second chances, and the healing powers of a good cup of tea. Read on only if you believe one just isn’t enough.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Magic",
    "Fae",
    "Paranormal Romance"
  ],
  "author": "Steffanie Holmes",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/39258305-the-castle-of-earth-and-embers"
}