{
  "title": "The Alien's Mate",
  "description": "I've come to Earth to hunt down a killer, not find a mate. But then I see her and all I can think is...MINE.Just one dangerous problem—My enemy knows she's here...and he wants her for himself.Cassie Anderson has been an orphan since the age of four. Left on her own, she grew up a hard-working, pragmatic woman of the Montana Territory, her steady employment at the Selby boarding house the only life she knows. When strange, sensual dreams drive her from her bed at night, her body heavy with desire and the scar on her palm burning, Cassie isn't sure what to think. When the handsome stranger tempting her each night with stolen kisses and irresistible caresses suddenly appears in the flesh, she believes she's truly lost her mind. Maddox of Everis was born a Hunter. Second son to a powerful ruling family, he volunteers for the dangerous mission to a far away, primitive planet called Earth. His mission? To track down an evil foe responsible for his twin sister's death. He's come ready for the hunt, prepared to kill, if necessary, but he is not prepared for the mating mark on his hand to burn with sexual fire. Shocked but desperate to find his mate, Maddox will do whatever it takes to protect her from his enemy. He expects to find a mate eager to welcome him into her bed and her heart. But Cassie is an Earth woman, an orphan who has no idea who or what she is... not a simple cowgirl, but a descendant of ancient warriors who once colonized Earth. Cassie is a powerful shock to his system, a woman he will do anything to possess. But when he tells her the truth, that he's an alien bounty hunter and she's his marked mate, she refuses to believe him. That is, until the dangerous madman he's traveled across the galaxy to hunt finds her as well. Suddenly it's not just Maddox's skillful kiss forcing Cassie to rethink everything she thought she knew, but an evil alien bent on possessing her for himself. She'll have to trust Maddox with both her life and her heart if they're going to survive.*The Alien's Mate is a historical romance prequel to His Virgin Mate by Grace Goodwin. Enjoy!*",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Audiobook",
    "Erotica",
    "Fantasy",
    "Historical Romance"
  ],
  "author": "Grace  Goodwin",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/39280137-the-alien-s-mate"
}