{
  "title": "The Girl Who Forgot The Butterflies",
  "description": "This couldn’t be the end of us. We had so much promise….Travis has no big dreams life is perfect, and he already sees his destiny written in glittering stars. The 21-year-old college student is dating Marilyn, his high school sweetheart, and knows his future lies in marrying her, working at a stable job and providing for their family.However, fate has other plans in store for Travis – plans that will turn his life upside-down.What starts out as a routine date at Marilyn’s favorite place soon turns into a gut-wrenching nightmare. In just a matter of hours, Travis hasn’t just been dumped: his life plan has been ripped up, shredded, and destroyed by a version of Marilyn he doesn’t understand – and all through one cruel and impersonal text message.Unable to move on, Travis is determined not to give up, vowing to win Marilyn back and reclaim the future that he has worked so hard for. As his efforts continue to flounder against a stone-faced Marilyn, he sinks deeper into despair, he barely notices another woman who is eager to be a part of his life.Redheaded Emma’s vivacious personality and easy manner, combined with her ability to crop up in his life everywhere initially irritate Travis. Over time, his mistrust gives way slowly to something greater as Emma reveals that her cheerful demeanor is covering her own deep pain. Intrigued by her ability to be so carefree despite her past, Travis finds himself opening up to her, little by little.Travis and Emma grow closer together, first by shared pain then by newfound feelings, they begin to heal. However, just as Travis’ last memories of Marilyn are fading into the background, she reappears – and Travis realizes that his heart is now split between the two women and he must make a difficult choice.Travis finds himself trapped in the middle of a love triangle where making the right choice seems impossible. His memories of Marilyn, combined with his long-held dreams of a comfortable existence now fight with the exciting Emma, who was the only person who truly helped him heal after being dumped.As Travis struggles to choose between Marilyn and Emma, he must decide whether his future really lies in where he thought it did – or if he can build a new dream.The Girl: Who Forgot the Butterflies by Marsha Heather Graham is a heartfelt novella which explores the joys and pains of first love and the second chances which follow. Click Order Now to add this novella to your shopping cart today.",
  "genres": [],
  "author": "Marsha Heather Graham",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/39278574-the-girl-who-forgot-the-butterflies"
}