{
  "title": "Pars vite et reviens tard",
  "description": "Pour avoir rossé un armateur responsable de la mort de deux marins, Joss Le Guern, capitaine du chalutier Le Vent de Norois, a connu la prison, puis le chômage avant d'échouer à Paris et de devenir \"crieur\", place Edgar Quinet. Trois fois par jour, Joss relève les messages, accompagnés de pièces ou de billets, que ses clients ont déposés dans sa boîte et, trois fois par jour, perché sur une estrade, il crie les nouvelles devant les habitués du quartier. Un jour, Joss découvre dans sa boîte une étrange missive qui se révèle inquiétante. C'est tout au moins ce que pense Hervé Decambrais, un septuagénaire qui allie à la broderie de napperons une érudition peu commune. Et comme ces messages bizarres continuent d'arriver trois fois par jour, il va déployer tous ses efforts pour en détecter le sens caché. Le commissaire principal Jean-Baptiste Adamsberg, qui vient d'être affecté à l'antenne du XIIIe arrondissement de la brigade criminelle, reçoit Maryse. La jeune femme est affolée d'avoir découvert peint en noir sur presque toutes les portes de son immeuble un grand 4 inversé accompagné des lettres CLT. Le policier se décide à prendre l'affaire au sérieux lorsque des tags similaires sont découverts dans un autre arrondissement et qu'un cadavre est retrouvé, la peau enduite de charbon. Bientôt les deux affaires vont se recouper. Avec ses accroches insolites, Fred Vargas crée d'emblée un mystère. Elle entraîne le lecteur dans une plongée au cœur de l'histoire en compagnie de personnages déjà croisés dans de précédent romans, comme Adamsberg et son amie Camille (L'Homme à l'envers), ou encore Marc, l'un des évangélistes (Debout les morts). On y croise aussi d'autres individus singuliers comme Joss le crieur, Hervé, l'as du napperon brodé ou l'ancienne prostituée Lizbeth. Instructif et divertissant, ce nouvel opus qu'on déguste avec délice, est évidemment copieusement garni de digressions et des célèbres aphorismes qui font le charme des polars de Fred Vargas. --Claude Mesplède",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "France",
    "Thriller",
    "Detective",
    "Roman"
  ],
  "author": "Fred Vargas",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/392937.Pars_vite_et_reviens_tard"
}