{
  "title": "First Love Forever Romance Collection",
  "description": "A first love is never easily forgotten...and coming face to face with that person again can be awkward when the heartstrings are still holding on to the “what ifs.”In settings from 1865 to 1910, nine couples are thrown back on the same path by life’s changes and challenges. A neighbor returns from law school. An heiress seeks a quick marriage. A soldier’s homecoming is painful. A family needs help. A prodigal son returns. A rogue aeronaut drops from the sky. A runaway bridegroom comes home. A letter for aid is sent. A doctor needs a nurse. Can love rekindle despite the separation of time and space?First Things First by Susanne Dietze1877 – South Texas rancher’s daughter Georgie Bridge mourned when her first love, Ward Harper, left town to study the law, but now he’s back—as opposing counsel in a case against her father. A Most Reluctant Bride by Cynthia Hickey1880 – Ozark foothill Maggie Spoonmore marries her father’s former foreman, Zach Colton in order to salvage her reputation, yet struggles to believe he married her for love and not her inheritance. Weeping Willow by Marcia GruverMay of 1861 – Port Royal, In Civil War Virginia, tables are turned for Willow Bates when Julian Finney, her childhood crush and steadfast defender, returns from the war a broken man in need of rescue. His Anchor by Carrie Fancett Pagels1894 – Mackinac Island, Robert Swaine, a ship captain, returns to Mackinac Island where his first love, Sadie Duvall struggles to support her siblings. Will she anchor him to the island he has vowed to leave behind? After the Ball by Martha Rogers1910 – Dallas, Chase Thornton, a wealthy oil man yearns for the life of a cowboy and his first love, Susannah King, but can she trust him to keep his word to leave the city and stay on the ranch?   Lighter Than Air by Lorna Seilstad1900 – St. Louis, After Titus Knott crashes his hot air balloon behind Ella Mason’s boarding school, he must convince his former sweetheart that his words are true and not full of hot air. In Due Season by Connie Stevens1901 – Whitley, Leah Brown accepts her role of town spinster until Gareth Shepherd unexpectedly steps back into her life. Now she’s faced with a choice. Can she forgive the man who jilted her? Heartfelt Echoes by Jennifer Uhlarik1875—Virginia City, A short, urgent letter mentioning his childhood love, Millie Gordon, forces deaf Travis McCaffrey to turn to his estranged birth father for help rescuing the woman he can’t forget. Prescription for Love by Erica Vestch1905 – New Erstwhile fiancée Natalie Morrison is the last person Dr. Mackenzie wants as his new nurse, but when an epidemic hits, Phin finds she’s come back into his life at the perfect time.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Romance",
    "Historical",
    "Christian Fiction",
    "Inspirational",
    "Novella"
  ],
  "author": "Susanne Dietze",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/39286266-first-love-forever-romance-collection"
}