{
  "title": "Winning her Hand",
  "description": "A list of suitors. A rational-minded lady. And a gentleman who vows to win her hand.When it comes to choosing a husband, LADY WINIFRED is at a loss. The only man who constantly occupies her thoughts is her brother’s oldest friend. However, Trent Henwood, Earl of Chadwick, could not be more unsuitable…at least for her.Although he may be titled, wealthy and handsome, his personality constantly clashes with hers. And Winifred is much too reasonable to choose a match based on love alone.TRENT HENWOOD, EARL OF CHADWICK, has been in love for as long as he can remember. Equally long has he been aware of the fact that Winifred would never accept him.Settling for being her friend, Trent finds his worst nightmares realised when the woman he loves starts to look for her future husband…anyone but him.Desperate, Trent turns to her brother for help, and Griffin actually has an idea.However, Trent will have to risk losing her in order to win her hand.This tale by a USA TODAY bestselling author shows that love isn’t always rational…but it is always powerful.If you like sweet stories about a love so deep and compelling that it unhinges your whole world and leaves you reeling, then you’ll love this instalment of Bree Wolf’s emotionally charged Forbidden Love Novella Series. Buy WINNING HER HAND, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!A Forbidden Love Novella Series#1 The Wrong Brother#2 A Brilliant Rose#3 The Forgotten Wife#4 An Unwelcome Proposal#5 Rules to Be Broken#6 Hearts to Be Mended#7 Winning her Hand (Coming June 26, 2018)#8 Conquering her Heart (Coming July 31, 2018)Love's Second Chance Series#1 Forgotten Remembered - The Duke's Late Wife#2 Cursed Cherished - The Duke's Wilful Wife#3 Despised Desired - The Marquess' Passionate Wife#4 Abandoned Protected - The Marquis' Tenacious Wife#5 Ruined Redeemed - The Earl's Fallen Wife#6 Betrayed Blessed - The Viscount's Shrewd Wife#7 Deceived Honoured - The Baron’s Vexing Wife#8 Sacrificed Reclaimed - The Soldier's Daring Widow (Bonus Novella) (Coming May 29, 2018)More to follow!For more information, visit www.breewolf.com",
  "genres": [
    "Romance",
    "Regency",
    "Historical Fiction",
    "Novella",
    "Historical Romance",
    "Historical",
    "Friends To Lovers"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/39297678-winning-her-hand"
}