{
  "title": "The Summer Demands",
  "description": "Taking place over a single summer in an abandoned Massachusetts summer camp, this quietly menacing novel explores the sting of seduction, unspoken female rage, and how desire and ambition shift over time to reveal the “undercurrents between our younger and older selves” (O, The Oprah Magazine).After Emily inherits an abandoned summer camp in Massachusetts just before her fortieth birthday, she and her husband David move onto the property with grand plans to fix it up. Instead, Emily finds herself drifting, grieving her recent miscarriage and her own perceived lack of ambition, while David works in the city. Until the day Emily discovers that their new property includes an unexpected guest. Living undetected in one of the cabins is a magnetic twenty-two-year-old named Stella. Their immediate and intense connection expands and contracts over the course of an single summer, calling all of Emily’s relationships, including her marriage, into closer scrutiny.As the two women begin spending time together―talking and drinking, swimming in the lake, watching seductive French films through long afternoons―Emily finds herself playing at performing various roles relative to Stella: friend, mother, lover. Each encounter they share promises to bring Emily a little closer to an understanding of her own identity, but it also puts her marriage and future at risk. How much does she really know about Stella? Why is Stella here, and what does she want, and what might she take with her, if and when she leaves?Named one of the best books of the summer by O, The Oprah Magazine, this “sun-saturated tale of love and longing” is a “smart, funny, nuanced and seductive” read (Chicago Tribune). Startling yet dreamlike, The Summer Demands marks Deborah Shapiro as a master at capturing complex relationships and the electricity of what passes unsaid between people.",
  "genres": [
    "Fiction",
    "Contemporary",
    "LGBT",
    "Adult",
    "Adult Fiction"
  ],
  "author": "Deborah  Shapiro",
  "average_rating": "2.97",
  "url": "https://www.goodreads.com/book/show/39298129-the-summer-demands"
}