{
  "title": "Wolf's Pursuit",
  "description": "This edition was previously published under the ASIN B077D76Z3W \nA Wolf’s Pursuit. A Seer’s Path. A wolf on the prowl. A clairvoyant in the know. Yet can anyone truly discern what surprises desire might bestow?\n  A wolf’s pursuit to lay claim to the ruby from Merlin’s staff and to end his curse of celibacy once and for all leads him straight to a local seer. Never would Dark Knight and wolf shifter Gideon Saint-Valeri court a sorceress, yet his yearning for her surges with the approach of the Mage’s Moon. Wronged by the greatest soothsayer of them all, both drawn to and repelled by the modern-day enchantress, he battles his inner beast. Can he and his wolf nature accept this woman as his potential fated mate?  Harboring the weight of hidden investments a too many secrets, Olivia Trudeau uses her clairvoyant abilities to raise funds and gather resources for her Appalachian community. Always burdened by the need to control, which comes with her gift of knowing, she faces her greatest revelation when destiny delivers a shifter—not true boyfriend or one true mate material at all—to her in the form of a shifter.  Danger on their heels, together, Olivia and Gideon fight both supernatural and local forces bent on collecting those of her kind and capturing the Dark Knights in Wolf’s Pursuit, Knight Fever Series #2.  Each one of a contingency of Dark Knights sets out on his final quest. After a millennia and a half of celibacy, each must find his one true mate to end Merlin's curse. A vampire, a wolf shifter, a sorcerer, a shape shifter, a dragon shifter, a wraith, a gargoyle shifter, a phantom, a cougar shifter, a raven shifter, a demon, a specter, and the reaper search for their fated mates.  As are each book in the Knight Fever Series, Wolf's Pursuit is a standalone romance featuring a Dark Knight created to battle the evil that rose up against the Kingdom of Camelot, and a member of a modern-day coven of supernaturally talented women.  Light swearing. High sensuality. Unique, refreshing, edgy shifter romance, paranormal romance, and fated mate romance.",
  "genres": [
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Fantasy"
  ],
  "author": "Alexa Dare",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/39297796-wolf-s-pursuit"
}