{
  "title": "The War Before the War: Fugitive Slaves and the Struggle for America's Soul from the Revolution to the Civil War",
  "description": "“Excellent . . . stunning.” —Ta-Nehisi CoatesThe devastating story of how fugitive slaves drove the nation to Civil WarA New York Times Notable Book Selection * Winner of the Mark Lynton History Prize* Winner of the Anisfield-Wolf Book Award * A New York Times Critics' Best Book \nFor decades after its founding, America was really two nations—one slave, one free. There were many reasons why this composite nation ultimately broke apart, but the fact that enslaved black people repeatedly risked their lives to flee their masters in the South in search of freedom in the North proved that the \"united\" states was actually a lie. Fugitive slaves exposed the contradiction between the myth that slavery was a benign institution and the reality that a nation based on the principle of human equality was in fact a prison-house in which millions of Americans had no rights at all. By awakening northerners to the true nature of slavery, and by enraging southerners who demanded the return of their human \"property,\" fugitive slaves forced the nation to confront the truth about itself.By 1850, with America on the verge of collapse, Congress reached what it hoped was a solution—the notorious Compromise of 1850, which required that fugitive slaves be returned to their masters. Like so many political compromises before and since, it was a deal by which white Americans tried to advance their interests at the expense of black Americans. Yet the Fugitive Slave Act, intended to preserve the Union, in fact set the nation on the path to civil war. It divided not only the American nation, but also the hearts and minds of Americans who struggled with the timeless problem of when to submit to an unjust law and when to resist. The fugitive slave story illuminates what brought us to war with ourselves and the terrible legacies of slavery that are with us still.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Civil War",
    "Race",
    "Politics",
    "War"
  ],
  "author": "Andrew Delbanco",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/39304812-the-war-before-the-war"
}