{
  "title": "Horror Island - Where Nightmares Become Reality: Voted Scariest Horror of 2019 by Horror Readers USA",
  "description": "Cocooned in rock, the alien organism was propelled into space when the dying planet exploded. Dormant for many millennia as it travelled through the cosmos, it headed towards a blue planet. A fiery spectacle announced its arrival when it entered Earth’s atmosphere and crashed to the surface. Trapped on an island it couldn’t escape from, it grew, evolved, hunted and spawned. Time passed. Human’s arrived…Almost sixty years after it was abandoned by the mysterious movie director, Ezra Houghton, successful horror writer Zane Baloc comes into possession of the remote and infamous Horror Island. Believing it will provide the perfect inspiration for a new horror novel, he wastes no time gathering a small team together to travel to the island to investigate. He plans to spend a few weeks there soaking up the atmosphere and exploring the extravagant horror themed movie sets Ezra spent seven years creating. Stranded miles from help, the team soon discover they are not alone and the rumours of strange, unearthly creatures inhabiting the island are more than just a myth. Their mission of exploration and wonderment turns into a bloody fight for survival against the island’s monstrous inhabitants. Stranded on the island filled with fear inspiring buildings and vicious, alien infected monsters, survival will be difficult. Escape unlikely. From award winning author of the international bestseller Ice Rift series comes a new foray into fear - Horror Island - Where nightmares become realityHorror Island is an action adventure alien monster survival horror set on a remote island.First “Swap dinosaurs for alien monsters and you have Jurassic park on steroids.”“Monster horror at its finest.”“Scary, gut-wrenching horror. I loved it. More please.”“Hammott is the new master of alien monster horror.”“Hammott’s limitless imagination is possibly scarier than his books and I can’t wait to see what he comes up with next.”“Alien meets Jurassic Park in Hammott’s latest monster horror fear fest.”“Never short, always packed with exciting action, atmosphere, unique monsters and expertly described scenes, you certainly get your money’s worth with Ben’s books. Horror Island did not disappoint.”",
  "genres": [
    "Horror",
    "Fiction"
  ],
  "author": "Ben Hammott",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/39302398-horror-island---where-nightmares-become-reality"
}