{
  "title": "Bethany's Knight",
  "description": "Chapter 1I awake just as the sun is rising over the trees. It’s my turn to change the chamber pot, the worst job to have. My sister Betsy and I always fight over whose job it is to change it. Betsy and I share a room together above my father’s bakery shop and she is to be married soon. She is 13; I am older by two years. Betsy is short like our mother and has brown hair, and when she lets it down it reaches to her waist. She has green eyes that light up her face when she smiles. Betsy is very dainty, never a hair out of place. She talks quite softly, almost as if she is afraid to talk out loud. Most of the time, you would not know she was in the room with you. Her beauty is what brings her to life. She has a glow about her, and a good heart.She’s marrying the Ramsey boy down the road on the other part of town. The Ramseys own a lot of land, and father says it is a good match. My father is right, of course. It is hard to find someone with such a good family in town. The Ramsey boy is not a handsome man at all; he has beady eyes that seem to look right through you. I truly believe he can see into your soul, just enough to make you squirm a little. As if he knows all the secrets you hold close to your heart that you would not want anyone else to know. Shivers go down my spine whenever I see him. Henry is his name. He thinks he is the ruler of the world and that you should be glad he chose to speak to you at all, as if you were beneath him. Truth be told, his social class is above mine but I feel he would not be worth the climb.Henry comes to the shop all the time. I thought at first it would be me he chose to marry. The fear I felt back then – let me tell you, I would have rather married a sheep herder’s son than him. I cringe even now at the thought of it. When he’d come into the shop, he’d stop and stare at me. But I believe he wanted someone he could fully control, a submissive wife. Someone to make sure he is taken care of and well fed... probably even to carry him over the threshold on his wedding night. That would not be me at all. Betsy, on the other hand, is just happy to be marrying someone and thinks she has done well for herself. I wish I could make her see that this may not be the right marriage for her. I feel this will only bring her much grief and not a moment’s rest. If they have children, I think he will make sure she takes care of him before them.Father has already told him “Yes,” so at this point she does not have much of a choice. I feel badly for her even as she rejoices at the idea. Betsy is very beautiful and I hate to think of her as being conquered and controlled. Somehow she seems okay with this aspect of marriage and can’t wait to fulfill her wifely cooking, cleaning, raising children. She tells me she does not wish to be an old maid like the Burk sisters who live down the road, who never married and live alone on their father’s farm. I’m not sure if the sisters have ever been in love. I’m sure at one time or another they were, but that the love passed before they could be married. I, on the other hand, think of how free they are – only having to take care of themselves. They have no one to tell them what to do. If only I could live as free as them, at least for awhile.",
  "genres": [],
  "author": "Tammy Kraynik",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/39325799-bethany-s-knight"
}