{
  "title": "Butterfly's Children",
  "description": "Butterfly's Children is set on a planet - some way into the future - that has moved beyond the Anthropocene into the Ecozoic Era. The inhabitants are both clearing up the toxic mess their ancestors have left in their wake and are trying to find a way to honour the prophetic \"How do we love all the children of all species for all time?\" Within this context, a young woman, Meriel, goes on a voyage - inner and outer, multi-facetted and metaphysical - where she leaves the safety of her foster parents and community and faces her uncertain future. Sailing forth into the Deep and Dancing Ocean she meets her guardian angel (in the form of an inter-galactic unicorn) and other folk who help her to weave her story. Yet Meriel is restless and as mercurial as the seas she sails upon; in a bid to find out why the planet was ravaged to such a degree by her ancestors, she recklessly sets sail without telling a soul and is shipwrecked upon an island that is not marked on any map. Knowing that rescue is unlikely - for who can find an island that does not exist? - Meriel gradually accepts her fate, looking death in the face, and finds there unimaginable beauty. However, having a shapeshifting guardian angel has distinct benefits for who else could navigate the Atlas of Forbidden, Hidden and Mysterious places to find her? Twenty-five years in the making, this book flows with magic and sparkle, painting an unforgettable picture of what could be Earth's parallel one where good decision-making has restored the Earth to its former, magnificent, awe-inspiring natural beauty, where the people have no need of money, where all is shared equally, and where young girls are encouraged to fulfil their destiny. Following in the footsteps of Tolkein, Le Guinn and Rowling, it is a story that will stay with the reader for many moons.",
  "genres": [],
  "author": "Annie March",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/39315129-butterfly-s-children"
}