{
  "title": "The Ani Maxima Files: Collection",
  "description": "Is she a beast sent from the pits of hell or is she an angel sent from God? Opinions vary, but all can agree that she has a heart of gold and a supernatural talent that can hopefully save her planet. Here are the first three books in one volume for your enjoyment.  Ptolemy’s The entire crew of ex-cons aboard the USS Cepheus are woken after fifty-nine years of cryogenic sleep only to discover that the ancient derelict ship USS Ptolemy is located much closer than they originally expected to find it. The ship is clearly powered down and tumbling aimlessly, but the moment that the Cepheus decides to hail the ship, they get a reply from a surviving member of the original crew. Yet after over 300 years now, such a thing would be entirely impossible. A boarding party is sent to the Ptolemy where they quickly discover that someone somehow is definitely still alive on that ship…  Nearly a hundred years after they left Earth, the crew of the USS Cepheus has arrived at their new home in the Eta Cassiopeia system. This was only after they rescued the beautiful and oddly talented Ani Maxima from her three hundred year imprisonment aboard the USS Ptolemy. The life of a start-up colony on a distant world is quite busy, but they manage to find time for fun and for each other. Ani Maxima’s super-ability to control technology with merely her thoughts doesn’t serve much purpose for a farmer, however she can still reprogram spy satellites without losing track of her current conversation. Then the ships start to arrive, and although these are coming from Earth, they aren’t of human origin. They are searching for a ship that disappeared a couple days prior, only they don’t realize that the ship was vaporized by a blonde farmer with supernatural talents. How can Ani go up against a whole armada however when their antiviral technologies evolve so rapidly that she can barely get started before she’s detected. And just because she’s not physically on those enemy ships doesn’t mean that she can’t be killed. Veiled  Nearly a month had passed since Ani Maxima destroyed an alien armada and saved the entire planet. Life was normal again for the farming colony on Cassiopeia… at least up until every electronic device on the planet received a viral photo of Ani with alien instructions on how to kill this powerful SuperVirus. There was no telling what sort of alien bounty hunters would be coming. All that was known was that this time, her superpowers would be useless. The only way to protect Ani would be to protect the entire planet. And the only way to protect the planet would be to call upon some tactics that Ani might have buried deep inside her head from her time on the USS Ptolemy. Perhaps with the assistance of her new friend, a spacecraft engineer from the distant continent, she might find a solution. If only she could get his heart off of her and to focus more on saving the planet. The entire Ani Maxima series was voted in the top 10 for \"Best Kindle Space Opera\" and \"Best Amazon Prime Books to Borrow\" by Goodreads! Brought to you by the international bestselling author of the Mystic Saga and Ghosts of Ophidian. Over 300,000 books downloaded worldwide! Also check out the others in the Ani Maxima Enigma, Flying in the Rain, Silent lucidity, Flesh and Blood, & Soul Sister EDITORIAL  \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review \"The author does a goo",
  "genres": [
    "M M Romance"
  ],
  "author": "Scott McElhaney",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/39325427-the-ani-maxima-files"
}