{
  "title": "Captain Hooter teaches \"What To Do While You're High\" in his new book Connoisseur's Guide to the Amsterdam Coffeeshops",
  "description": "Connoisseur’s guide to the amsterdam coffee shops is the first of its kind “high end” guide offering travelers and enthusiasts of north american consumption and standards, an insider’s review of cannabis, tips, suggestions and reviews on amsterdam coffee shops and their best cannabis available. written and compiled by captain hooter, the book is a chronicle of captain hooter’s journey through all of the 167 coffee shops selecting 18 which are the “best of the best” coffee shops in amsterdam.amsterdam is one of the cities of the world synonymous with cannabis on several fronts. however, many enthusiasts of cannabis as well as coffee lovers now have the only guide that offers the best of both worlds. this is what captain hooter is offering in his new guide.The book is written to provide tourists, travelers and other such readers with tips, reviews, and suggestion about the cannabis industry as well as the best coffee shops in Amsterdam, helping them make quick, easy, and more informed decisions as regards their travel plans centered on the cannabis and hospitality industry in Amsterdam.The guide will provide visitors an easy to read fun and informative overview of where to find the shops that sell the best options and service their customers with knowledgeable and respectful information. this unbiased critique provides the reader with the historical and legal path the cannabis industry in the Netherlands has taken. using the guide will take the visitor to the best 18 coffee shops and suggest the strain of cannabis to look for. this informative book also shares where to find the stoniest of places to eat, play and the best experiences not to be missed in Amsterdam. it shares the social media access for each shop and explains the protocol of purchasing cannabis and what to expect.Connoisseur’s Guide to the Amsterdam Coffee shops also includes the best coffee shops based on the current location of the reader, as well as the “stoniest” things to do in the immediate area, offering a comprehensive travel guide for travelers and tourists in Amsterdam.More information about the book and how to be among the first persons to get a copy of it is available on Publisherz.About the Author“Captain Hooter” is the author of connoisseur’s guide to the amsterdam coffee shops. captain hooter has been traveling to the “holy grail” for marijuana smokers, attending and judging multiple high time cannabis cup events since 1995. all these were done while learning about what Amsterdam has to offer, from its people and its history, and the cool and best experiences, to do in Amsterdam.Systematically visiting every coffee shop in Amsterdam, Captain Hooter put together a comprehensive guide that helps travelers and tourists get the best of the best without the stress and time involved in doing all the legwork.Media ContactCompany Name: Captain Hooter GuidePhone: +19496324222Country: United StatesWebsite: www.captainhooter.comhttp://www.crossroadstoday.com/story/...",
  "genres": [],
  "author": "Captain Hooter",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/39327828-captain-hooter-teaches-what-to-do-while-you-re-high-in-his-new-book-co"
}