{
  "title": "Sweet, Sexy Heart",
  "description": "Discover the magic of New York Times bestseller Melissa Foster's writing and see why millions of readers have fallen in love with the fiercely loyal and sassily sexy characters in the Love in Bloom big-family romance collection. All Love in Bloom books can be enjoyed as stand-alone novels or as part of the larger series.For this sweet bookstore owner, avoiding the charms of a famed-football-player-turned-author was supposed to be easy... Funny, sinfully sexy, opposite-attracts romance.In SWEET, SEXY HEART...Amber Montgomery is perfectly happy with her quiet life. She loves running her bookstore, taking long walks with Reno, her Labrador retriever seizure-response dog, and spending time with her close-knit family. She’s never needed thrills the way some of her sisters have. In an effort to control her epilepsy, she tries to avoid anything that creates too much excitement or stress—including relationships. When Amber hosts a book signing for famed-athlete-turned-author Dash Pennington, he’s everything she’s spent her life avoiding: loud, aggressive, and far too handsome, as proven by the hordes of women who surround him everywhere he goes. Amber can’t ignore the sparks flying between her and Dash, but this is a no-brainer for her: Ignore their chemistry and hold her breath until he leaves town.Dash Pennington has spent his life running. Running the ball in for a touchdown, running from town to town to appease his public relations reps, and for years, running into the arms of too many women to count. He’s also an expert at protecting—his reputation, his family, and lately, his sanity. But he’s ready to make a change. When he comes to the sleepy little town of Oak Falls, Virginia, and witnesses the most beautiful woman he’s ever seen living the life he craves, she refuses to have anything to do with him. But now that Dash has found the one thing he doesn’t want to run from, he’ll stop at nothing to win her over.**Within the Love in Bloom big-family romance collection, characters from each sub-series appear in future books.Snow SistersThe Bradens at WestonThe Bradens at TrustyThe Bradens at Peaceful HarborThe Bradens & The MontgomerysThe RemingtonsSeaside SummersBayside SummersSteeles at Silver HarborWild Billionaires After DarkBad Billionaires After DarkHarborside NightsTru Blue and The Whiskeys: Dark Knights at Peaceful HarborThe Wickeds: Dark Knights at BaysideSugar LakeHarmony PointeSilver Harbor",
  "genres": [
    "Romance",
    "Sports",
    "Contemporary",
    "Contemporary Romance",
    "Sports Romance",
    "Family",
    "Football"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/39329375-sweet-sexy-heart"
}