{
  "title": "Real American: A Memoir",
  "description": "A fearless debut memoir in which beloved and bestselling How to Raise an Adult author Julie Lythcott-Haims pulls no punches in her recollections of growing up a biracial black woman in America“Courageous, achingly honest.\" —Michelle Alexander, New York Times bestselling author of The New Jim Crow: Mass Incarceration in the Age of Colorblindness“A compelling, incisive and thoughtful examination of race, origin and what it means to be called an American. Engaging, heartfelt and beautifully written, Lythcott-Haims explores the American spectrum of identity with refreshing courage and compassion.”—Bryan Stevenson, New York Times bestselling author of Just Mercy: A Story of Justice and RedemptionA fearless debut memoir in which beloved and bestselling How to Raise an Adult author Julie Lythcott-Haims pulls no punches in her recollections of growing up a black woman in America.Bringing a poetic sensibility to her prose to stunning effect, Lythcott-Haims briskly and stirringly evokes her personal battle with the low self-esteem that American racism routinely inflicts on people of color. The only child of a marriage between an African-American father and a white British mother, she shows indelibly how so-called \"micro\" aggressions in addition to blunt force insults can puncture a person's inner life with a thousand sharp cuts. Real American expresses also, through Lythcott-Haims’s path to self-acceptance, the healing power of community in overcoming the hurtful isolation of being incessantly considered \"the other.\"The author of the New York Times bestselling anti-helicopter parenting manifesto How to Raise an Adult, Lythcott-Haims has written a different sort of book this time out, but one that will nevertheless resonate with the legions of students, educators and parents to whom she is now well known, by whom she is beloved, and to whom she has always provided wise and necessary counsel about how to embrace and nurture their best selves. Real American is an affecting memoir, an unforgettable cri de coeur, and a clarion call to all of us to live more wisely, generously and fully.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Social Justice",
    "Race",
    "African American",
    "Audiobook"
  ],
  "author": "Julie Lythcott-Haims",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/39321613-real-american"
}