{
  "title": "Climbing The Mountain: The Heart of Budgeting",
  "description": "This is not your typical book on budgeting …Yikes! When you hear the word “budget,” do you feel like running towards the exit? Does it summon a sense of dread in your soul? Does the subject of budgeting make you recoil with disgust and perhaps even a touch of fear? If so, this may be the book to help you break through this negativity and discover the power of obedience to God and its positive financial impact on people from virtually all income levels.There are many factors which go into the proper management of one’s personal financial resources. The skilled techniques you can learn from seminars on how to be financially successful are absolutely essential. But will merely following a prescribed set of procedures result in a sustained financial victory over your money management issues? Or, is there something else involved in conquering the obstacles which prevent you from getting along with your money?Presented from a definitively Christian perspective, there is much to glean from this testimony by Christian novelist Wade Carey and his travails with personal money management over the past four decades. His story centers on the unquestionably most critical ingredient in the handling of every single penny which enters your life—your heart. Once you set your heart correctly, your handling of money and budgeting can absolutely catapult you to success and serenity in your life. But if you leave your heart on the sidelines, budgeting success is very difficult to sustain.From the open-minded skeptic to the committed Christian; whether you’re rich or you’re poor; find out how “climbing the mountain” of budgeting is the key to uniting your heart and your wallet. Once you get your heart set properly, the rest can fall into place—no matter how much money you make.",
  "genres": [],
  "author": "Wade Carey",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/39325654-climbing-the-mountain"
}