{
  "title": "Veiled Sky",
  "description": "The bounty is out on Ani Maxima. Her name, her photo, and her exact location is now known to everyone in the entire galaxy. And worse that that - the bounty even includes the exact instructions on how to beat her at her own game.  Nearly a month had passed since Ani Maxima destroyed an alien armada and saved the entire planet. Life was normal again for the farming colony on Cassiopeia… at least up until every electronic device on the planet received a viral photo of Ani with alien instructions on how to kill this powerful SuperVirus. There was no telling what sort of alien bounty hunters would be coming. All that was known was that this time, her superpowers would be useless. The only way to protect Ani would be to protect the entire planet. And the only way to protect the planet would be to call upon some tactics that Ani might have buried deep inside her head from her time on the USS Ptolemy. Perhaps with the assistance of her new friend, a spacecraft engineer from the distant continent, she might find a solution. If only she could get his heart off of her and his focus more on saving the planet. The Ani Maxima Files: Ptolemy’s Child SuperVirus Veiled Sky  EnigmaFlying in the RainSilent LucidityFlesh and BloodSoul SisterSocial Animal Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Kepler Moon Alpha, and Ghosts of Ophidian. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Maelstrom, Terraformer, One Crazy Summer, and Endeavor by McElhaney.   EDITORIAL REVIEWS:   \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review  \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer and Vine Voice Michael Gallagher  Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/39325438-veiled-sky"
}