{
  "title": "Greyriver Shifters",
  "description": "The shifters of Greyriver are hot as hell and nothing will stop them in their paths, so cozy up and be ready for some sexy fun!Enjoy 5 Standalone, full length books in this bundle.More than 400,000 words.NO CLIFFHANGERS.UNWANTED MATEI don’t want to feel this pull towards Mika Bright and feel the lust that overtakes me when I smell her. She’s the opposite of everything I want in a female and as the next Alpha to my pack I want my mate to be of my kind, strong, capable, on the fringes of my emotions. Mika isn’t like that. She’s sweet and soft and she needs me to give her things I don’t think I can give her. She’s human to my wolf. Light to my dark. She’s not mine and yet I want her unlike any other female in this world. If I mate her I will lose every iota of control in my life and to a guy like me, control is power.UNWILLING MATEI will not mate Hannah Seers even if destiny and my animal call to me to do it. She’s spoilt, rude, mean and ugly in ways that have nothing to do with her perfect form and the body that drives me crazy. I shouldn’t look at her and want her and I damn sure should not give in to her demands for a mating but she has something I need and if I have to mate her to get it, I will. That doesn’t mean I will love her even as I take her body and it sure as hell doesn’t mean I want her heart. Or do I?RELUCTANT MATEThe problem with being a liar and a cheat is that before you know it you don’t recognise yourself anymore. I’ve spent my life lying, living in a world where other people don’t really know the real me. I’ve lied to myself, my friends and the one female who I should have claimed years ago. Beebee hates me, for good reason. She doesn’t trust me, for good reason. She wants me, because I make her believe that she should. Now it’s up to me to decide if loving her is worth the risk of losing my freedom and risk losing myself once again when things fall apart.UNLIKELY MATEI’m a mixed breed shifter who has both bear and wolf within my blood. I am dangerous, big andscare the females in my own pack. I prefer solitude and I keep to myself because I doubt that I will ever be lucky enough to find my Fated, my true female, the one who will complete me. When a car breaks down on the side of the highway that borders my pack and the land I guard the last thing I expect is to see the smallest human female staring back at me. The very last thing I know is that she definitely can never be mine. Even if I know it’s true.DESTINED TO MATEI’ve killed. I’ve lied. I’ve stolen. I’ve committed every unspeakable crime that you can think of and I haven’t regretted it once until the day Julia Silverton comes for me. She’s my Fated, my one but I don’t want her. I can’t. She’s good and I’m, not. She’s love and I’ve hated for so long I don’t know what that means anymore. She wants me. Needs me and I will save her but I will never give her my heart. I can’t. She’d break me.",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Contemporary"
  ],
  "author": "Kristina Weaver",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/39334745-greyriver-shifters"
}