{
  "title": "The Watchmaker's Doctor",
  "description": "If you could go back in time and redo one thing in your life, what would it be? The Watchmaker’s Doctor is the first novella in Erase and Rewind, a collection for new adults that delves into the biggest regrets of the dying, and follows their stories of what might have been. 10% of G. M. T. Schuilling's proceeds from The Watchmaker’s Doctor will go to the Brain & Behavior Research Foundation. The Foundation is committed to alleviating the suffering caused by mental illness by awarding scientific research grants to improve treatment. Their vision is to ultimately develop cures and methods of prevention to enable people with mental health issues to live full, happy, and productive lives.To learn more about them, visit: https://www.bbrfoundation.org#KnowScience\"With the pace of a thriller and ideas from science fiction, The Watchmaker’s Doctor takes us on Anaya’s journey of discovery through shifts in time. In doing so, it has things to say about the choices we make and how we might live our life differently.\" - Roisin Heycock, Director of YA and Children's list at Oneworld, winner of the Booker Prize 2015 and 2016. \"The Watchmaker’s Doctor is a thought-provoking look at the nature of free will, at the same time as an intimate picture of one girl’s growth to adulthood. I’d also highly recommend it to anyone interested in seeing an unsensationalised depiction of life with bipolar disorder.\" - Anna Bowles, former Commissioning Editor at Hachette UK. Anaya, a disillusioned, thirty-five-year-old doctor, has been looking after Gregory, a retired watchmaker and resident of an aged care facility. On her last visit, he gifts her his final creation, an exquisitely-crafted watch, knowing she will die tragically that very day. It will turn back time. With one condition: she must choose the time and place to reset the clock, and redo just one thing in her life. Regrets, it seems, are easy to realise when you’re dying. Hers was dropping out of school at seventeen. But what if, after one small change, her life would become much worse than it was? Or unthinkable disasters result from a single step off her path? When the alternative is die now, her choice makes itself. And so, Anaya’s story begins with her last thought. Would I have done this if I had any option but the grave? Would you?",
  "genres": [
    "Time Travel",
    "Young Adult",
    "Science Fiction",
    "Fantasy",
    "Novella"
  ],
  "author": "G.M.T. Schuilling",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/39357430-the-watchmaker-s-doctor"
}