{
  "title": "It Takes Two",
  "description": "February, 1949. Fort Myers Florida. It started out to be such a nice day. But early morning gunfire at the Royal Plaza Motor Hotel changed all that. One white man is dead. One black man is dead. The widow of the white man has just crashed the investigation, and is waving a gun around. Barely escaping the shot that blows the window out of the car in which he is sitting is Dan Ewing, who isn't even supposed to be there. Saving his bacon is police detective Bud Wright. Bud and Dan are more than fishing buddies, but no one can know that. But their secret is just one of many in this small town. To start, Dan is the manager of the Caloosa Hotel, a class act if you're just passing through, but if you are a member of the less known Caloosa Club, Dan provides a variety of \"services\" club members may discreetly enjoy. This doesn't sit well with everyone in town, including the sheriff, a wealthy car dealer, the KKK, and Bud Wright, despite the fact that he's sleeping with Dan. But the car dealer is the dead white man, the black man is the husband of his wife's former maid, and the sheriff, Bud's boss seems determined to keep the investigation off track. So what does this apparent murder suicide have to do with the Caloosa? Journalist Elliott Mackle takes his wonderfully realized \"why-done-it?' mystery to fascinating levels as he explores the various factions of a small southern town facing the giant implications of a rapidly changing society. Elliott Mackle served for ten years as the Atlanta Journal Constitution's restaurant critic. As a Journal-Constitution staffer he also covered the Olympic Games, political conventions and wrote a weekly travel feature. Hecurrently lives with his partner of many years in Atlanta. This is his first novel.",
  "genres": [
    "Historical",
    "Mystery",
    "M M Romance",
    "Gay",
    "LGBT",
    "Crime",
    "Historical Fiction"
  ],
  "author": "Elliott Mackle",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/1229218.It_Takes_Two"
}