{
  "title": "Amazon Seller Central Secrets: Use Amazon Profits to fire your boss",
  "description": "Are you tired of working the 9-5 and have nothing? Tired of being a slave to your boss? When the corporation closes what do you do then?That is where I was seven years ago. Safe, happy and living the American dream. That is until my corporate job ended and the company suddenly closed with no warning. There I was with a family, house, and children to care for I was stunned. I decided then I would not be a slave to the corporate world again. I was a research analyst, and I used my knowledge to create a reliable system to make sure I never depended on anyone but myself and my family.I eventually started with Amazon, building a successful Amazon empire with a warehouse in less than one year. I proceeded from there to create multiple other business ventures and protect my way of life. With this book, you can start your life of freedom and break the chains.If you are looking to start your own business online and you are looking to get started with Amazon, then you came to the right place. If you want to make yourself a supplemental living or make this a full-time venue, then this book is for you. I will show you how and I will show you the mistakes that I made when I started out on Amazon. Then I will show you how to do it better with what I have learned over the years. This book is a how-to book based on my real experiences and challenges in the Amazon world of selling.Be Your Own BossWe start here with Amazon and show you how to go from Zero to making a living, just by selling on Amazon. My proven method will show you how to stop being a slave and Be Your Own Boss. My method is not a quick get-rich-quick scheme; my method is hard work. My method is going to show you how to do things efficiently and better than I did. I will show you how to make money while having a good time. All so you can have a more relaxed life and profitable lifestyle. If that is what you are looking for, then read on, and I will teach you everything you need to know.What do you get inside?My secret list of wholesalers.- How to buy in bulk.- How to develop your own Brand Name items.- How to market.- How to deal with Amazon.- Amazon suspension.- How to deal with bad feedback.- How to respond to nasty customers and win them over.And much much more.We also show you how to create multiple streams of income through our BYOB series to assure you of success.This book 1 in BYOB series. The following books in the series are BYOB eBay, BYOB Auto Dealer, BYOB Clickbank, BYOB Blogging and BYOB Affiliate links. Each book is designed to help you avoid the pitfalls and mistakes I made in these businesses and show you the path to success.Be your own boss. Change your destiny and fire your old boss. Become financially free of the corporate world. Stop being a working stiff and become the person you dreamed you would be, the person you deserve to be, the person you want to be.",
  "genres": [
    "Business"
  ],
  "author": "Bruce   Walker",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/39350321-amazon-seller-central-secrets"
}