{
  "title": "The Displaced Children Of Displaced Children",
  "description": "Poetry. Asian & Asian American Studies. Moving through past, present and future, this is a family history that journeys between America, Pakistan, modern Europe and even into space. Faisal Mohyuddin delves into the past of his parents and their neighbours in Pakistan and India in a self-consciously impossible attempt to find some way of belonging to a place that is lost. Moving from elegant ghazals of lament to stuttering, disjointed phrases of yearning, Mohyuddin portrays with restrained emotion the complexities of what it is to be displaced, geographically, spiritually, psychologically. With moments of sorrow interspersed with unsettling humour, deep familial love and celebrations of beauty, it is a story recognizable to any who have felt displaced in a new world. If the personal is political, then this is truly poetry for our times.\"THE DISPLACED CHILDREN OF DISPLACED CHILDREN demands your attention from its title, which speaks directly to a specific immigrant reflexivity, the way the seam of placelessness both separates and connects generations. In one poem the speaker 'forgets the Urdu / word for loneliness, forgets the Punjabi word for / loneliness, forgets the English word for loneliness.' In another, he finds himself 'holding two large rocks, // looking for something else / sacred to smash open.' These aren't hopeless poems, but they have known hopelessness. What a marvel it is then, this work (and it is work) to turn back toward joy, to create joy despite (or to spite) those forces that would conspire against it. Here, starlight travels centuries just to dazzle us. The son of a father becomes the father of a son. Eternity exists only in mirrors, the book says, then demonstrates. I am such an eager student of this book, this poet, and this light.\"—Kaveh Akbar\"Faisal Mohyuddin's debut collection speaks to the desire to forge a wholeness in a world that seems, too often, to be splitting at the seams. Written with an abiding sense of empathy, and charged with an unmistakable longing, these poems dissolve the boundaries between historical record, memory, and the imagination. Mohyuddin memorialises the suffering of the displaced, while at the same time transforming grief into song, heartache into story, and hunger into wisdom. This collection wrung out my tired heart.\"—Colum McCann\"In these poems, Faisal Mohyuddin assembles a lyrical narrative using historical fact and ethereal longing as material a longing that sprouts from, or settles into, the unlikeliest crevices of the historical-personal. For every gash on the map of partition, there is a gap closing between ceramic tiles affixed on the floor by a mother as she speaks of staying close; for every good king, there is an assassin by the same name; for every assassin, a poet; and for every loss, a legend. What I admire the most in this work is how it confronts and diminishes hubris and elevates the quality of desire to echo the idiom of the mystic 'a longing with an energy and weight all its own, a longing that resides in song or sigh, in prayer or embrace, in caw / or coo.'\"—Shadab Zeest Hashmi",
  "genres": [
    "Poetry",
    "Nonfiction"
  ],
  "author": "Faisal Mohyuddin",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/39398482-the-displaced-children-of-displaced-children"
}