{
  "title": "Temptation and Surrender",
  "description": "Handsome, wealthy, and well-born, Jonas Tallent has everything a gentleman needs to enjoy London society to the fullest - and he has. He's played cards until dawn, flirted with eligible young ladies, and made love to some ineligible ones. But now he's restless, bored with the mindless frivolity and careless pleasure, so its with a sense of relief that he takes up the reins of his family's estate in rural Devon. His most pressing need is to hire a new manager for the inn--the center of village life. Such a small task, yet he discovers few decent applicants are willing to live in a quiet country backwater. Then genteel but impoverished Miss Emily Beauregard applies for the position. Jonas's initial response is an emphatic \"no!\" Ladies, especially one as attractive as Emily, belong in the ballroom or the bedroom, not running an inn. But with no alternatives, he grudgingly allows Emily to try, and she rapidly proves herself worthy, resurrecting the inn with tact and skill. But Em has a secret. Its not only the need to provide for herself and her orphaned siblings that has brought her to Devon. She's surreptitiously searching for a family treasure hidden in the village, the only clues to its location a cryptic rhyme handed down through the generations. Emily is determined to solve the puzzle, find the treasure and reinstate her family to its rightful place in society. Yet Em hasn't bargained on Jonas. His experience is temptation, his attentions irresistible, and he's determined to aid her in her quest. He eventually persuades her to trust him, and together they unravel the clues . But someone else is watching, waiting, and once the family legacy is unearthed, the villain strikes, threatening Em, her family, and the love she and Jonas have discovered in each others' arms.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Regency Romance",
    "Fiction"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/3939628-temptation-and-surrender"
}