{
  "title": "The Silver Gryphon",
  "description": "In celebration of Golden Gryphon Press's 25th book, writers who contributed to the first 24 books were asked to write a story that best defines them as writers. The result is an anthology of stories ranging from fantasy, science fiction, mystery, and horror to genres that are often a combination of all four. Warren Rochelle portrays a struggle between magical and normal humans. George Zebrowski questions how to reclaim one's life when thrust two and a half years into the past. Andy Duncan combines literary style with southern heritage in a strange tale of courtship on a ghost trolley car. Michael Bishop spins the sad tale of a dead Vietnam soldier who won't die and continues to lay down his life to help others. James Patrick Kelly paints a world where people are regulated, even in their ability to become parents, and there is no place for dissenting views. Kage Baker's story \"A Night on the Barbary Coast\" won the Emperor Norton award for 2003. The wide range in style, tone, and content in these tales provides genre fans with a diverse spectrum of short fiction.Mother - James Patrick KellyPresent from the Past - Jeffrey FordThe Door Gunner - Michael BishopA Night on the Barbary Coast - Kage BakerThe American Monarchy - Richard A. LupoffAn Innocent Presumption - Kevin J. AndersonWhy Then Ile Fit You - Howard WaldropWhat's Up Tiger Lily? - Paul Di FilippoThe Time-Travel Heart - Geoffrey A. LandisTakes You Back - George ZebrowskiSeparate Lives - Ian WatsonAfter Ildiko - Lucius ShepardThe Golden Boy - Warren RochelleCowboy Grace - Kristine Kathryn RuschTropical Nights at the Natatorium - Richard Paul RussoNight of Time - Robert ReedThe Haw River Trolley - Andy DuncanFar Barbary - R. Garcia y RobertsonKwantum Babes - Neal Barrett Jr.Fire Dog - Joe R. Lansdale",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fantasy"
  ],
  "author": "Gary Turner",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/394052.The_Silver_Gryphon"
}