{
  "title": "The Edinburgh Seer Complete Trilogy",
  "description": "Fans of Cassandra Clare and Diana Gabaldon will love this fantasy romance set in an alternate, modern-day Scotland!She can see his memories, but he has more to hide than just his past…In a land divided by rebellion, Aini MacGregor manages her father’s magical candy lab and keeps everyone at arm’s length so she won’t see their memories—an entirely illegal ability that could land her in jail. But when a dangerously handsome apprentice named Thane arrives, she realizes it’s harder than she expected to stay out of trouble. But life goes from sweet to sour when the most nefarious clan in Scotland abducts her father.Thane Campbell has more secrets than truths in his tortured life. Sometimes, he forgets which is which. Spying on the candy lab for the clan chief, his father, Thane must develop a plan for using the MacGregors’ inventions to wreck havoc on the king’s court or his clan will kill him. He’s had plenty of chances to prove his loyalty, they say.  If he isn’t careful, his growing feelings for the MacGregor lass will bring his death sentence on like a storm over the moors. With Mr. MacGregor in the clan’s grip, Aini and Thane dive into the dark side of their alternate Scotland and there is no way for everyone to come out alive. If you love the sweet steam, tension, and handsome fellows with accents in the Infernal Devices series and Outlander, you’ll love USA Today bestselling author Alisha Klapheke’s action-packed adventure filled with alternate history and romance! Get your copy today.What Readers Are Saying About This Series on Goodreads and \"I couldn't get enough of it!\"\"A wonderful twist on the modern world!”\"Great storytelling and such a unique fantasy idea!\"\"Loved the romance!\"\"A great new author rises!”Buy the series today!",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Fiction"
  ],
  "author": "Alisha Klapheke",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/39398388-the-edinburgh-seer-complete-trilogy"
}