{
  "title": "Three Lives for Mississippi",
  "description": "In the civil rights movement, 1964 was the year of Freedom Summer. On June 21, Mississippi, one of the last bastions of segregation in America and a bloody battleground in the fight for civil rights, reached the low point in its history. On that steamy night three young activists were abducted and murdered in Neshoba County near the small town of Philadelphia.Their names were James Chaney, Andrew Goodman, and Michael Schwerner. Two were from the North and labeled locally as “outside agitators.” Chaney was a Mississippi black. The murders not only shook the nation and shamed the state of Mississippi but also forced loose the iron grip of white supremacy in the South.William Bradford Huie was sent to this seething community by the New York Herald Tribune to cover the breaking story. Probing for answers and conducting interviews, he wrote this documentary account in the heat of the dangerous and dramatic moment, not in the safe zone of retrospection.This is not a political or sociological study, a collection of articles or a diary, but a journalist's fact-filled story of people that fate brought together in a tragic confrontation. Huie tells the history of each young man and studies the personalities of the killers. He reveals not only the harrowing events in this heinous case but also the prejudice of ordinary citizens who allowed murder to serve as their defense of prejudice. He helps us know the young martyrs closely and introduces us to their killers and to the hatred and suspicion that led inexorably to murder. This edition includes Huie's report on the trial three years later. Nineteen local men were charged. Seven were found guilty of conspiracy but none of murder.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Crime",
    "American History",
    "True Crime"
  ],
  "author": "William Bradford Huie",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/394624.Three_Lives_for_Mississippi"
}