{
  "title": "Brother Twelve: The Incredible Story of Canada's False Prophet",
  "description": "“As Mercury dwelleth near the Sun, so I abide in the heart of my Lord. My feet run upon His errands and by my mouth are His words spoken.” Thus wrote Brother XII in the preface to The Three Truths , describing his role as the divinely-ordained agent of an ancient mystical Brotherhood known as the Great White Lodge. As the agent of this mysterious fraternity, Edward Arthur Wilson, aka Brother XII, a slight, soft-spoken former English sea-captain, embarked on a dramatic and sensational career that established him as one of the most fascinating figures in the history of modern religion. Brother The Strange Odyssey of a 20th-century Prophet chronicles the life and exploits of the enigmatic figure who established a utopian community in southern British Columbia in the late 1920s and early 1930s. The tales of gold, sex and black magic associated with Brother XII and his flamboyant mistress, a whip-wielding devotee of ritual magic with the pulp-fiction name of Madame Z, have gripped people’s imaginations for years, and the story has been described as a Gone with The Wind of the occult, an evocative mixture of the sacred and profane. Though other religious figures may be better known, for pure drama, nothing rivals the story of Brother XII. Though Brother XII largely fell through the cracks of history, his amazing chronicle is being rediscovered, for it rings with contemporary relevance; not only was he a prototypical cult leader, he was a genuine mystic and seer, while also writing on political issues in a way that eerily foreshadows the world today. Brother XII was both a forerunner of the New Age and one of the few spiritual teachers of his time to give expression to the geopolitical and conspiratorial concerns that dominate the cultural debate today. Both mystic and mountebank, seer and charlatan, he was a complex, contradictory individual, the ultimate “man of mystery.” The story of Brother XII features an intriguing cast of characters who find themselves irresistibly drawn to the power of this classic rogue messiah, a spiritual anti-hero possessed of a Nietzschean will to power. After the destruction of his colony, Brother XII and Madame Z fled with nearly half-a-million dollars in gold, outwitting the authorities and escaping justice. Brother XII’s fate is uncertain, for his death in Switzerland remains a matter of speculation. For all that is known about him, he's still an elusive figure, leaving his metaphysical teachings and the provocative legend that has grown up around him as his legacy. Praise for Brother The Strange Odyssey of a 20th-century Prophet “I found myself totally absorbed…a book that will become a classic of its kind. I know of no more fascinating or better researched study of a ‘false messiah.’” From the Foreword by Colin Wilson “Sex, sadism, black magic and mystery upon mystery. It sounds like the recipe for a Stephen King potboiler, and author John Oliphant has made the most of it. The difference is that Oliphant’s Brother XII is a true story…a marvelous web of suspense and intrigue…riveting stuff.” The Vancouver Sun “Brother XII is a fascinating read!” William Gibson “A tremendously exciting story of the religious mania in extreme form. Brother XII is a type who recurs throughout human history, and Oliphant provides not only a great horror tale, but a warning as to how we can recognize such types and be armed against them. I heartily recommend this book.” Robert Anton Wilson “Sharing the brilliance of an L. Ron Hubbard, the destructiveness of a Jim Jones, and the hypnotic hold of a Rasputin, E. A. Wilson ranks as one of the most intriguing, mysterious, and infamously charismatic and prophetic cult leaders to grace the annals of North American history…a well-documented…thoroughly fascinating book.” Theosophical History",
  "genres": [
    "Nonfiction",
    "Cult Classics",
    "Cults",
    "Religion",
    "History"
  ],
  "author": "John Oliphant",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/3946739-brother-twelve"
}