{
  "title": "I Before E, Except After C: Spelling for the Alphabetically Challenged",
  "description": "Bad Spellers Of The World . . . Untie! Unite!Are you a victim of text messaging, typing \"CU L8R\" instead of \"See you later\"? Do mysterious voices tell you to use \"their\" and \"there\" interchangeably? Don't know the difference between \"its\" and \"it's\"? Have you often had to deal with, um. . . embarrassing vowel movements? Suffer no more--help is on the way!Meet Dr. Laurie E. Rozakis--professor, best-selling author, English expert, and reformed terrible speller. Having corrected the many errors of her ways, she has a to convert even the world's worst English speller into an incredible spelling machine.Like a ketchup stain on your best suit, bad spelling can instantly ruin a first impression. In fact, poor spelling can hold you back--in school, in your career, and even in your personal life. Great spelling, on the other hand, boosts confidence and success.I Before E Except After C can save even the most alphabetically challenged. In this entertaining, indispensable guide, anyone who's forgotten--or never learned--their way around English can quickly get up to speed.You'll    • The top 50 most misspelled words and how to fix them   • 50+ \"hard\" words that'll immediately power up your spelling IQ   • Painless step-by-step exercises   • Memory joggers   • How a celebrity superstar and a U.S. Vice President trashed their reputations with lousy spelling   • . . . And much more!Using amusing quizzes, humorous tests, and \"MadLibs\"-type exercises, I Before E Except After C will help you get into perfect spelling shape. It's never too soon--or too late!Dr. Laurie E. Rozakis earned her Ph.D. in English and American Literature from the State University of New York at Stony Brook. A full professor of English at Farmingdale State College, Dr. Rozakis has published over 100 books, including The Complete Idiot's Guide to Grammar and Style, The Complete Idiot's Guide to Creative Writing, Vocabulary for Dummies, and The Portable Jewish Guilt, Food, and . . . When Are You Giving Me Grandchildren? Dr. Rozakis frequently appears on television, including Live with Regis and Kelly, The CBS Morning Show, Good Day, New York, Metro Relationships, and Fox Personal F/X. Her career and books have been profiled in The New York Times, the New York Daily News, Time magazine, and the Chicago Tribune.Did you just end your last memo to your boss \"CU L8R\"?If you're alphabetically challenged, you're not alone. Thanks to miracles of technology like the Blackberry, instant messaging, and e-mail, a staggering number of people today can't spell.Terrible spelling can be hazardous to your career . . . maybe even your love life. But the tragedy that is lousy spelling can easily be averted.Enter Dr. Laurie E. Rozakis, professor, author, and spelling goddess. In her book, I Before E Except After Spelling for the Alphabetically Challenged, she can teach any mere mortal how to wrestle the spelling monster--and win!",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Laurie E. Rozakis",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/3942046-i-before-e-except-after-c"
}