{
  "title": "The Treasure Keeper",
  "description": "With such novels as Queen of Dragons and The Dream Thief , Shana Abé has created a unique and vividly imagined world that exists side by side with our own—a realm populated by a race of supersensual men and women whose power to change shape permits them unlimited acts of pleasure…and ever-present danger. Now the survival of the drákon rests in the hands of a young woman with untried and unexpected powers—and the powerful Alpha male she must break every drákon law to save.The drákon are at war, surrounded by an enemy they have every reason to fear. The sanf inimicus are no ordinary human beings but the most dangerous of hunters. They’ve sworn to exterminate the shape-shifters whose presence they now can detect, and they’ve already claimed a prize Lord Rhys Langford.It’s a blow the drákon clans feel from Darkfrith, England, all the way to the Carpathian Mountains of Transylvania. But it strikes no one harder than Zoe Cyprienne Lane. A mere seamstress’s daughter, Zoe isn’t even in the same league as Rhys. In fact, as an unwed male in the Alpha line, according to drákon custom, he owns her. So nothing could be more outrageous—or personally ruinous—than the mere notion that she might set out on her own to find her childhood friend...and first true love.But the unexpected is exactly what Zoe intends to do. For years she’s been hiding two extraordinary Gifts that have set her apart from other drákon the power to become invisible and the power to feel others’ emotions. Now, guided by a link to Rhys—his presence and touch as electric as if he were beside her in the flesh—Zoe uses both Gifts to infiltrate the sanf inimicus . And for Rhys, whose time is running out, Zoe is his last lifeline to a world—and a love—he never thought he’d regain. Only together again, hunter and huntress, can they save the drákon from the traitor in their midst who would destroy them all.",
  "genres": [
    "Fantasy",
    "Romance",
    "Dragons",
    "Paranormal Romance",
    "Paranormal",
    "Historical Romance",
    "Historical"
  ],
  "author": "Shana Abe",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/3944722-the-treasure-keeper"
}