{
  "title": "No Word for Wilderness: Italy's Grizzlies and the Race to Save the Rarest Bears on Earth",
  "description": "Fifty miles outside of Rome live the rarest grizzlies on earth.In Italian, there is no word for wilderness. Yet in the mountains of Italy, brown bears not only exist, they are fighting to survive amid encroaching development, local and international politics, and the mafia. This meticulously researched and eye-opening book tells the incredible stories of two special populations of bears in Italy--one the last vestige of a former time that persists against all odds, the other a great experiment in rewilding that, if successful, promises to change how we see not only Italy but all of Europe.The Abruzzo bears of central Italy have survived amid one of the oldest civilizations on earth--but now, with numbers estimated at as low as fifty individuals, they face a critical future as multiple forces, from farmers to the mob, collide within their territory. The Slovenian bears of northern Italy, brought to the Alps at the turn of the century, have sparked controversy among local and international interests alike. The stories of these bears take readers on a spectacular journey across Italy, where we come face-to-face not only with these fascinating species but with embattled park directors, heroic environmentalists, innovative scientists, and a public that is coming to terms with the importance of Italy's rich natural history.Award-winning author Roger Thompson has traveled throughout Italy documenting the history and current crises of these bears, and the result is an engaging and in-depth examination that resonates across all endangered species and offers invaluable insights into the ever-evolving relationships between human and non-human animals in a rapidly changing world.",
  "genres": [
    "Nonfiction",
    "Nature"
  ],
  "author": "Roger  Thompson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/39465786-no-word-for-wilderness"
}