{
  "title": "Healing Happens: Stories of Healing Against All Odds",
  "description": "Imagine healing a chronic condition or terminal illness against all odds by making one simple change. Healing Happens brings you insight and inspiration from health and healing experts who cured themselves and others despite dire medical prognoses from over twenty illnesses ranging from cancer, diabetes, and multiple sclerosis to Hashimoto’s, hypothyroidism, bipolar personality disorder, stroke, musculoskeletal pain, blindness, ADHD, obesity, fibromyalgia, hepatitis C, cerebral palsy, and anxiety. Enhance the power to heal yourself through natural healing techniques and awareness in order to comfortably, energetically, and joyfully live your passions.Some of the people in the stories in this book were in wheelchairs or expecting to undergo major surgery, while others had been on medication most of their lives or in hospice expecting to die. Through attitude, willpower, belief, food, sound, light, or simple physical exercises, all returned to full health medication-free, able to walk, work, engage in hobbies, and enjoy time with their families.The stories in Healing Happens emerge from enlightening interviews with seventeen health and healing Bernie Siegel, MD, Brooke Goldner, MD, Meir Schneider, PhD, Ruben J. Guzman, MPH, Nicole DeAvilla, Michael Platt, MD, K. P. Stoller, MD, Tara Gesling, Tryshe Dhevney, Maureen Belle, Gail Lynn, Connie Hernandez, ND, Mamie Lamley, Bhavna Srivastava, Sam Shelley, Mary Wutz, and Peter Leach. They have repeatedly helped others heal through knowledge attained from personal experiences, studies, and the latest scientific research. Their specialties range from Western medicine to naturopathy, yoga therapy, physical therapy, nutrition, herbal medicine, sound healing, energy healing, meditation, and spirituality. They reveal there are more possibilities for healing than are commonly known.Avital Miller, former program manager at Microsoft and yoga and fitness trainer, has been sharing natural healing techniques ever since they radically improved her situation with Hashimoto’s and hypothyroidism. Discovering there were many stories of healing against all odds, she saw the importance of collecting such stories to inform people about their potential for overcoming seemingly insurmountable health challenges.Discover the most profound wisdom and techniques for gaining more power over your health and healing. Fatal pronouncements do not have to be your fate.",
  "genres": [],
  "author": "Avital Miller",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/39426708-healing-happens"
}