{
  "title": "Jack Kennedy: Elusive Hero",
  "description": "“What was he like?”Jack Kennedy said the reason people read biography is to answer that basic question. With the verve of a novelist, Chris Matthews gives us just that. We see this most beloved president in the company of friends. We see and feel him close-up, having fun and giving off that restlessness of his. We watch him navigate his life from privileged, rebellious youth to gutsy American president. We witness his bravery in war and selfless rescue of his PT boat crew. We watch JFK as a young politician learning to play hardball and watch him grow into the leader who averts a nuclear war.What was he like, this person whose own wife called him “that elusive, unforgettable man”? The Jack Kennedy you discover here wanted never to be alone, never to be bored. He loved courage, hated war, lived each day as if it were his last.Chris Matthews’s extraordinary biography is based on personal interviews with those closest to JFK, oral histories by top political aide Kenneth O’Donnell and others, documents from his years as a student at Choate, and notes from Jacqueline Kennedy’s first interview after Dallas. You’ll learn the origins of his inaugural call to “Ask what you can do for your country.” You’ll discover his role in the genesis of the Peace Corps, his stand on civil rights, his push to put a man on the moon, his ban on nuclear arms testing. You’ll get, more than ever before, to the root of the man, including the unsettling aspects of his personal life. As Matthews writes, “I found a fighting prince never free of pain, never far from trouble, never accepting the world he found, never wanting to be his father’s son. He was a far greater hero than he ever wished us to know.”",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Politics",
    "Presidents",
    "American History",
    "Biography Memoir"
  ],
  "author": "Chris Matthews",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/12293756-jack-kennedy"
}