{
  "title": "A Modest Harmony: Seven Summers in a Scottish Glen",
  "description": "\"It is a story everyone likes to hear: how, without ever having seen it, we bought a small stone cottage beside a loch in Scotland, and spent our summers, year after year, in the fastness of those lonely hills.\"From the first call from Scotland, and the impulsive decision to purchase the cottage, this lyrical, flawlessly rendered account of the Gordons' seven summers in Glenauchen is a tale of two cultures.The Gordons, longtime residents of New York, are enchanted by the serene beauty and rich historical tradition of the remote Perthshire village. Over the course of their summers they learn to cook grouse and fresh herring, to bake scones and drink malt whiskey, and they witness the cycle of dipping, shearing, and the rending of lamb from ewe for the sheep sales.And they learn that the past is always part of the present--in the old drove roads where they hike, in the ubiquitous rowan trees planted to keep witches away, in the nearby Roma ruins and the standing stones that are a legacy from the original settlers of Scotland in the misty dawn of history.The Gordons become acquainted, as well, with the inhabitants of the highland village--people as quirky, fey, and irresistible as any one is likely to meet. The \"lady of the glen,\" whose genteel poverty does not prevent her from dining in full evening dress off the family silver, though her meal consists of a kipper and boiled potato; the minister who lurks about the hillside at dusk, trapping rare moths; the two \"wild\" brothers whose mundane diurnal chores contrast vividly with their drunken nocturnal ramblings--all are a constant source of wonder and delight to the Gordons.Though they immediately recognize the rightness of their decision to purchase the cottage, they cannot stop the intrusion of the world. As summer follows summer, Glenauchen changes, and when the peaceful glen can no longer keep the disturbances of modern life at bay, the Gordons wisely decide to leave forever.This beautiful portrait of a Scottish glen is simply told, but its implications are profound. It speaks to the reader of the richness of time and of the wonder of our humanity.[From the jacket flap.]",
  "genres": [
    "Travel"
  ],
  "author": "Sheila Gordon",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3946955-a-modest-harmony"
}