{
  "title": "Russian Pulp: The Detektiv and the Russian Way of Crime",
  "description": "The detektiv , Russia's version of the murder mystery, has conquered what in Soviet days loved to call itself \"the most reading nation on earth.\" Most Russians don't read much Tolstoy, but they devour the lurid covers and cheap paper of the detektiv s by the millions. Serials based on the works of two of the most popular authors (Andrei Kivinov and Aleksandra Marinina) have been hits of the last few TV seasons, their characters now a part of Russian everyday life.The ubiquity of the detektiv may puzzle Westerners, who may conclude that this is a post-Soviet import like McDonalds. Not so―Russia sprouted its own versions of \"penny dreadfuls\" as soon as peasants came off the land and learned to read. The guardians of Russia's \"high culture,\" however, were enraged by this pulpy popular genre and so contrived under the Soviets to supress it, making everyone read \"improving\" and \"uplifting\" literature instead. Russia's junk readers hung on, though, snatching up the few detektiv s that made their way through censorship, until, in the Gorbachev era, the genre blossomed as the perfect vehicle for social criticism―the detektiv talked about social problems in a way that was exciting enough that people wanted to read it. When the Soviet Union finally collapsed, one of the few things left standing in the rubble was the detektiv ―which now is sold on every street corner and read on every bus.The first full-length study of the genre, Russian Pulp demonstrates that the detektiv is no knock-off. Summarizing and quoting extensively from scores of novels, this study shows that Russians understand law-breaking and crime, policemen, and criminals in ways wholly different from those of the West. After explaining why solving a crime is always a social function in Russia, Russian Pulp examines the staples of crime fiction―sex, theft, and murder―to demonstrate that Russians see police officer and criminal, thief and victim, as part of a single continuum. To the Russians,",
  "genres": [
    "Nonfiction",
    "Literature",
    "Russia"
  ],
  "author": "Anthony Olcott",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/3948821-russian-pulp"
}