{
  "title": "Talent",
  "description": "A wickedly funny debut in which the niece of a legendary and enigmatic writer forever alters the life and work of a young student writing about--and desperately searching for--inspiration.Anna Brisker is a 29-year-old graduate student in English at Collegiate University who can't seem to finish her dissertation. Her project: an intellectual history of inspiration. Her take: that the way writers and artists describe the moment of inspiration - that it strikes indiscriminately, that it's handed down from on high and entirely out of their control - is really just self-serving bullshit designed to elevate the artist above the rest of us. To Anna, whose academic prowess has never before been in question, inspiration is just another name for good old fashioned work. Plain and simple. And yet, for the first time, Anna has found herself utterly and truly uninspired. Rather than work on her thesis, she spends her days eating strawberry Pop-Tarts and wandering the streets of New Harbor in a state of perpetual procrastination.It's amidst this unnerving stasis that Anna meets and strikes up a tenuous friendship with Helen Langley, a strangely compelling, free-spirited woman with a penchant for rare book forgery, who just so happens to be the niece of the legendary short story writer Frederick Langley. Freddy quickly penned three wildly successful collections as a young man in the 1960s, then published exactly nothing for the rest of his wayward, hermetic life. A possibly fatal case of writer's block, or so say the critics; as Helen confides to Anna, Freddy actually kept secret notebooks in the last years of his life that are now under lock and key at Collegiate's Elston Library, viewable at Helen's sole discretion. Inspired, uninspired, potentially reinspired-a perfect case study for Anna's dissertation, and one she simply cannot pass up. But as her initial fascination with Freddy Langley and his notebooks blooms into zealous obsession, Anna finds herself falling irrevocably into the criminal machinations of his sole living heir.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Novels",
    "Audiobook",
    "Campus",
    "Modern"
  ],
  "author": "Juliet Lapidos",
  "average_rating": "3.07",
  "url": "https://www.goodreads.com/book/show/39599928-talent"
}