{
  "title": "Race Traitor",
  "description": "Product DescriptionTo sixteen-year old runaway Lara Aslan, the new friends she finds in the secretive Patriot Front are the family she’s never had. They feed her when she’s hungry, watch her back and provide her with shelter at the home of infamous Holocaust denier Heinz Zimmer, whose web of hate connects neo-Nazis worldwide. Under the guidance of the mysterious Markus Bellow, the covert leader of the Patriot Front, Lara swiftly undergoes a radical transformation that integrates weapon-training, combat skills and information-gathering tactics to produce the perfect terrorist. Thinking it’s all a game, Lara doesn’t know that the Patriot Front will stop at nothing to achieve their clandestine aim. The Patriot Front, in turn, is not aware of Lara’s own dark, long-buried secrets, which come to light on the heels of a brutal attack.Forced to confront her own past, Lara knows she has to take swift action before it’s too late. With the help of a middle-aged French journalist and a lesbian police officer, Lara begins to spy on Heinz Zimmer and the Patriot Front. But the deeper she delves into their network of hatred, the deadlier her quest becomes.INSPIRED BY A TRUE STORYA gripping, fast-paced storyline inspired by actual events, Race Traitor blends the thrilling joyride of The Girl with the Dragon Tattoo with the haunting poetry of The Kite Runner. An unforgettable journey into the darkness of the human heart, this is a tale that is sure to stay with you long after the book has ended.ABOUT THE AUTHORAt age 16, Elisa Hategan was an alienated runaway who became recruited into Canada’s most powerful white supremacist movement, the Heritage Front. She was groomed by top leaders to become a recruiter and rising star of the extremist far-right movement. An errand girl for notorious Holocaust denier Ernst Zundel, she was a witness to the illicit activities of an undercover CSIS agent and co-founder of the Heritage Front. At age 18, she turned against the group and spied on them for several months before testifying in court and going into hiding. Borrowing from her own experiences, Elisa Hategan now weaves an incredible story of one teenage girl’s courage and transformation against a backdrop of hatred and brutality.PRAISE FOR RACE TRAITOR“The author conjures up a powerful premise, and frighteningly captures the world of separatist groups.”Ballantine USA“The edginess of this novel appeals to me, as does the complicated teen heroine drawn in Larissa.”Doubleday USA“I couldn’t put it down – really interesting story.”Penguin Canada“Elisa is a talented, courageous writer and Race Traitor is a compelling story.”Douglas & McIntyre“I was intrigued by the concept for this novel, and it’s clear that Ms. Hategan is a talented writer.”Grand Central Publishing“Elisa’s story is an intriguing one, definitely, and her writing is accessible, vivid, and energetic.”McClelland & Stewart“Very real-seeming, and thus quite harrowing.”Editorial DirectorMinotaur Books“Elisa is a very effective writer.”Knopf / Random House “Interesting stuff. Should get attention, published by the right house”Penguin USA",
  "genres": [
    "Thriller",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Elisa Hategan",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/12295084-race-traitor"
}