{
  "title": "The Science Question in Feminism",
  "description": "Esta obra revisa, por primera vez desde el nacimiento de la ciencia moderna, las críticas feministas de la ciencia y las investigaciones realizadas con ópticas androcéntricas. Enmarcando el actual debate feminista, Sandra HARDING critica tres enfoques epistemoló el empirismo feminista, que sólo identifica como problema la mala ciencia; el punto de vista feminista, que sostiene que la experiencia social de las mujeres constituye el único punto de partida para descubrir el sesgo masculino de la ciencia; y el postmodernismo feminista, que discute los supuestos científicos más fundamentales. Señala las tensiones existentes entre estas posturas y los inadecuados conceptos que subyacen en sus análisis, aunque sostiene que el discurso crítico que favorecen es vital para la búsqueda de una ciencia informada por una moral y una política emancipadoras. La autora domina las perspectivas de las ciencias sociales y naturales más hegemónicas, e incorpora los puntos de vista de las bibliografías feministas, africanistas y postmodernas más recientes, para desvelar cómo el desarrollo de la ciencia incorpora valores y sesgos de los que es difícil ser conscientes. Asimismo, HARDING cuestiona los fundamentos intelectuales y sociales del pensamiento científico y se ocupa a fondo de las posibilidades de utilizar la ciencia con fines emancipadores, a pesar de estar inmersa en un entramado occidental, masculino y burgués. Ciencia y feminismo sintetiza y critica los supuestos de la filosofía de la ciencia hegemónica, contribuye a crear el fundamento de una ciencia basada en valores participativos y asume posiciones como el antirracismo, el anticlasismo y el antisexismo. Es la obra pionera que esperaban las personas interesadas por las teorías feministas, la filosofía y la historia de la ciencia.",
  "genres": [
    "Feminism",
    "Science",
    "Philosophy",
    "Nonfiction",
    "Academic",
    "Gender",
    "Feminist Theory"
  ],
  "author": "Sandra G. Harding",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/395692.The_Science_Question_in_Feminism"
}