{
  "title": "The Famous Union",
  "description": "Adult humorous fiction Famous Union College is a slow moving train wreck, a place where what is what is not. Two hapless heroes.An exhibitionist secretary.Bumbling administrators.A paranoid football coach.Conniving coeds.A sex obsessed football player. Who knows what will happen next...\"The characters are all interesting and well developed - and many would be great study cases for a psych major.\" - HAMPTON REVIEWS \"It's light and humorous with a bit of a wink and a lot of wry puckish humor.\" - Pop Bop, Top 500 Amazon ReviewerFrom the author of the endearing story THE SURVIVAL OF MARVIN BAINES.EXCERPTBut after a particularly unproductive day cluttered with nothing more than boredom, Bill Ferris finally had had it; he knew he had to get away, or else, so he ventured across campus to the college cafeteria for an early dinner.\"What's the special today?\" he asked the young coed who was on the ready to take his order.\"Buzzgetti.\"\"What's that?\" asked Ferris.\"Buzzgetti.\"\"What?\" asked Ferris again. \"Buzzgetti,\" said the young unsmiling coed, her face clearly demonstrating her growing impatience with the guy.\"Is that some type of local specialty. I've never heard of it,\" said Bill Ferris.\"Buzzgetti,\" the tortured young thing said, two octaves too loudly for the crowded cafeteria.Bill Ferris, finally resigned to the fact that he was not about to get any further information from her, decided what the hell. \"I'll take a stab at it,\" he said.When his plate was finally handed over to him, Ferris sighed deeply, refraining purposely from uttering what he truly felt inside. What good would it do? What purpose would it serve? As he looked down at his plate of probably day-old spaghetti, most likely heated-over canned stuff, to boot, he was thinking that nothing around the place made any sense at all. The place had gone completely insane, crazy. Loco. It seemed more a lunatic asylum than a place of scholarly reflection and application. But what a fitting end to his day, he also thought, as the tasteless special of the day churned around his intestines like worms squirming to their death on a sunburned sidewalk.",
  "genres": [
    "Humor",
    "Fiction"
  ],
  "author": "Mike  Meyer",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/12295039-the-famous-union"
}