{
  "title": "Kingdom of Ash and Soot",
  "description": "Everyone Lies. \n\n\nPRAGUE, 1870.\nFor the last ten years, nineteen-year-old Eleanora Svobodová has worked as a servant in her stepmother's household. Along with her older brother, she dreams of the day they will be free to live life on their own terms.But everything changes when their estranged grandmother comes to Prague on behalf of Queen Victoria. Throughout Bohemia, a string of murders and secret whispers hint at a larger coup. As the leader of the Order of the Crystal Daggers, an ancient order of spies and soldiers that protect kingdoms and their rulers, Lady Penelope is determined to discover the perpetrators. Now, Eleanora must make the choice between a life of intrigue and saving the lives of others.Can Eleanora find a way do the right thing and still find freedom?\nFROM THE BOOK: \n\n“I want to be free.” The words came rushing out of me before I could think through their implications and consequences.\n\n“There are two things you need to know about yourself if you want to be free—what you stand for, and what you stand against.” Lady Penelope held up her hands, brandishing a pair of daggers that had been hidden in her skirts. “This world lives enslaved to its destruction, and so long as you are living, as long as you are fighting, you will be free.”\n\nI gazed at the daggers, transfixed. Each blade was clothed in a leather scabbard, but the silver and obsidian of the daggers’ hilts winked at me, as though it was calling for me.\n\n\nFROM THE AUTHOR: \nWith a fun blend of historical fiction, true love, castle intrigue, and family dysfunction, The Order of the Crystal Daggers is my latest adventure series!\n\n\nWHAT REVIEWERS ARE SAYING: \n5 STARS! ~ Reader's FavoriteThis story was fantastic! Definitely one of my favorite reads of this year! ~ Laura A. Grace, Unicorn Quester Book Review",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Young Adult",
    "Romance",
    "Historical",
    "Espionage",
    "Audiobook"
  ],
  "author": "C.S.  Johnson",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/39604038-kingdom-of-ash-and-soot"
}