{
  "title": "You Complicate Me",
  "description": "The road to happily ever after has never been more hilarious... or complicated...Grace Montgomery has a very simple plan. Fly to her younger brother’s wedding, stop the wedding, go home, make partner at her law firm. Almost getting arrested by air marshal Nick O’Connor? Not part of the plan. Neither was puking on him. (Don’t ask.) Finding out he’s her soon-to-be brother-in-law… also a minor setback to her plan. And don’t even get her started on her untimely attraction to the tall, dark, and dead-sexy jerk. If Nick had a plan, it wouldn’t include getting involved with a woman as complicated as Grace. It especially wouldn’t include road tripping with her to attend a week of pre-wedding family events. But as it turns out, traveling—and sparring — with the lovely, sharp-witted Grace is the most fun Nick’s had since, well, ever. And their sexual chemistry? Off. The. Charts.It doesn’t take long for Grace to realize there’s a lot more to her air marshal than a pretty face and a big, um, gun. If she’s not careful, she just might lose her highly prized control — not to mention her heart — to Nick. But before Grace and Nick can set foot on the road to happily ever after, they’ll have to deal with Grace’s meddling ex, a slew of dysfunctional family members, and a contaminated pumpkin bisque (long story)… and that’s all before the end of day two. It’s gonna be a long, complicated week…You Complicate Me is book 1 in the You Complicate Me duet, but both books can be read as a standalones. Book 2, You Wrecked Me, is also now available. This duet is not intended for anyone who doesn't like characters who cuss, snarky banter, tons of nerdy pop culture references, and all manner of familial silliness. For the rest of you, happy reading!",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Humor",
    "Adult",
    "Enemies To Lovers",
    "Audiobook"
  ],
  "author": "Isabel Jordan",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/39603249-you-complicate-me"
}