{
  "title": "Burr, Hamilton, and Jefferson: A Study in Character",
  "description": "This book restores Aaron Burr to his place as a central figure in the founding of the American Republic. Abolitionist, proto-feminist, friend to such Indian leaders as Joseph Brant, Burr was personally acquainted with a wider range of Americans, and of the American continent, than any other Founder except George Washington. He contested for power with Hamilton and then with Jefferson on a continental scale. The book does not sentimentalize any of its three protagonists, neither does it derogate their extraordinary qualities. They were all great men, all flawed, and all three failed to achieve their full aspirations. But their struggles make for an epic tale.Written from the perspective of a historian and administrator who, over nearly fifty years in public life, has served six presidents, this book penetrates into the personal qualities of its three central figures. In telling the tale of their shifting power relationships and their antipathies, it reassesses their policies and the consequences of their successes and failures. Fresh information about the careers of Hamilton and Burr is derived from newly-discovered sources, and a supporting cast of secondary figures emerges to give depth and irony to the principal narrative. This is a book for people who know how political life is lived, and who refuse to be confined within preconceptions and prejudices until they have weighed all the evidence, to reach their own conclusions both as to events and character.This is a controversial book, but not a confrontational one, for it is written with sympathy for men of high aspirations, who were disappointed in much, but who succeeded, in all three cases, to a degree not hitherto fully understood.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Politics",
    "Presidents"
  ],
  "author": "Roger G. Kennedy",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/395444.Burr_Hamilton_and_Jefferson"
}