{
  "title": "The Persistence of the Old Regime: Europe to the Great War",
  "description": "Historians of the left and right and of all methodological persuasions have agreed, if on nothing else, that World War I followed the ascendancy of the bourgeoisie in Western Europe. It has become a historical truism that the aristocratic old regime, on the verge of its demise in Russia, Germany, and Austria-Hungary, had long ceased playing a significant role in the advanced sectors of Europe. Newly triumphant capitalists, the consensus has it, led Europe and the rest of the world into the Great War of 1914—a conflict initiated by large industrialists and financiers in order to expand their influence and power.Now, in this startling book the noted historian Arno J. Mayer challenges the validity of every one of these assertions His brilliant analysis of Europe from the late nineteenth century until 1914 exposes the continuing domination of the old regime rather than folding its tent after 1789, the \"feudal element\" remained in control in Western as well as Eastern Europe. Mayer's provocative thesis is supported by his masterful survey of Europe from England to Russia. In a clear, persuasive style, he demonstrates with wonderful examples that in the Europe of 1914, the economics and politics, the society and culture, and the social philosophies and attitudes al derived from and reinforced the power of the old regime.The implications of this book for the understanding of our own recent history are vast. Not merely does Mayer allege that the old regime was responsible for World War I, but he asserts that it took two world wars and the Holocaust—Europe's second \"Thirty Years' War\"—to finally dislodge it. The Persistence of the Old Regime is certain to stir the passions of historians and the public for a long time to come.",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "World War I",
    "Politics",
    "War",
    "World History"
  ],
  "author": "Arno J. Mayer",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/396579.The_Persistence_of_the_Old_Regime"
}