{
  "title": "Fatherland",
  "description": "The New York Times bestselling classic of alternate history, a murder mystery set in a world where the Nazis won World War II—for fans of  The Plot Against America  and  The Man in the High CastleBerlin, 1964. The Greater German Reich stretches from the Rhine to the Urals, and keeps an uneasy peace with its nuclear rival, the United States. As the Fatherland prepares for a grand celebration honoring Adolf Hitler’s seventy-fifth birthday and anticipates a conciliatory visit from U.S. president Joseph Kennedy and ambassador Charles Lindbergh, a detective of the Kriminalpolizei is called out to investigate the discovery of a dead body in a lake near Berlin’s most prestigious suburb.But when Xavier March discovers the identity of the body, he also uncovers signs of a conspiracy that could go to the very top of the German Reich. And, with the Gestapo just one step behind, March, together with the American journalist Charlotte Maguire, is caught up in a race to discover and reveal the truth—a truth that has already killed, a truth that could topple governments, a truth that will change history.Praise for Fatherland“A singular achievement displaying original and carefully wrought suspense . . . Fatherland easily transcends convention.” — The Washington Post“A solid thriller, vividly imagined and genuinely frightening.” — The Atlanta Journal-Constitution“Ingenious . . . a triumph . . . suspenseful and elegant.” — San Francisco Chronicle“A dazzler . . . fast-paced . . . Historical fact is blended skillfully with fiction.” — Detroit Free Press“Absorbing . . . expertly written.” — The New York Times Book Review“Truly captivating.” —Robert Ludlum“A strong premise for a police thriller with rich foreign atmosphere and political texture galore? Absolutely!” — Entertainment Weekly“A sly and scary page-turner.” — Los Angeles Times“A well-plotted, well-written detective tale and a fascinating trek through parallel history.” — Chicago Tribune“ Fatherland works on all levels. It’s a triumph.” — The Washington Times“Distinguished by vivid details based on impeccable research, the thriller is a crackling-good read in the le Carré tradition.” — Time“Wonderful.” — Newsday“A gripping detective story as well as a chilling visit to the Germany that might have been. It is so plausibly written it seems quite real. Robert Harris is a name to watch for.” — BookPage",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Thriller",
    "Alternate History",
    "Mystery",
    "Crime",
    "Science Fiction"
  ],
  "author": "Robert   Harris",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/396250.Fatherland"
}