{
  "title": "O Nariz",
  "description": "«O Nariz, um conto do absurdo, claro, mas de um absurdo de dois bicos: age sobre o trivial, mas também o trivial age sobre ele, tornando-o estranhamente verosímil. Portanto, nada de fantasias! Podemos fartar-nos de estabelecer paralelos com os antecedentes românticos em que se perdia magicamente qualquer coisa: ora o coração, ora a sombra, ou então era o nariz que crescia—mas sentimos sempre uma diferença nítida: em Gógol não encontramos o ambiente de enigma: a suposição dos efeitos de magia como causa do acontecimento é rejeitada de imediato (a carta da “vítima” com as acusações balbuciantes de bruxaria, em que nem ele próprio acredita, e a carta de resposta da acusada que nem sequer percebeu as insinuações e que por isso lhes dá uma interpretação muito prosaica e, como tal, cómica). Nada de magias! Esta, aliás, é uma das particularidades da escrita russa, a partir de Púchkin: por mais misticismos, crenças, superstições, por mais almas que andem no ar, o escritor tem sempre os pés assentes na terra e alimenta dela a sua inspiração.Iúri Mann (O Sistema Poético de Gogol, Moscovo, 1978) escreve que as ligações genéticas dos contos de Gógol com a literatura do romantismo (Hofmann, Chamisso) já estão suficientemente estudadas pela crítica. O que faltava era descobrir a mudança fundamental que esta tradição sofreu em Gógol. O motivo da perda pelo herói de uma parte do seu Eu, seja corporal, seja espiritual, estava ligado, na tradição romântica, com a acção de forças sobrenaturais. Em O Nariz não existe portador nem personificação da força não-real. Não se descortina culpado e, pelos vistos, não existe.Existe apenas facto. E também a atitude das personagens para com o facto. Não há culpado, não há explicação do fenómeno. O leitor espera involuntariamente qualquer esclarecimento — mas o narrador afasta-se, põe a máscara do “censor” e prega ao leitor uma partida (“não percebo absolutamente nada”, diz) e, ainda por cima, declara que “acontecem coisas destas no mundo—raramente, mas acontecem”; depois sai de cena, deixando o leitor de mãos a abanar…»",
  "genres": [
    "Classics",
    "Short Stories",
    "Fiction",
    "Russian Literature",
    "Russia",
    "Magical Realism",
    "19th Century"
  ],
  "author": "Nikolai Gogol",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/3963495-o-nariz"
}