{
  "title": "The Preacher’s Wife: The Precarious Power of Evangelical Women Celebrities",
  "description": "From the New York Times bestselling author of Everything Happens for a Reason: And Other Lies I've Loved, a fascinating look at the world of Christian women celebritiesSince the 1970s, an important new figure has appeared on the center stage of American evangelicalism--the celebrity preacher's wife. Although most evangelical traditions bar women from ordained ministry, many women have carved out unofficial positions of power in their husbands' spiritual empires or their own ministries. The biggest stars--such as Beth Moore, Joyce Meyer, and Victoria Osteen--write bestselling books, grab high ratings on Christian television, and even preach. In this engaging book, Kate Bowler, an acclaimed historian of religion and the author of the bestselling memoir Everything Happens for a Reason: And Other Lies I've Loved, offers a sympathetic and revealing portrait of megachurch women celebrities, showing how they must balance the demands of celebrity culture and conservative, male-dominated faiths.Whether standing alone or next to their husbands, the leading women of megaministry play many parts: the preacher, the homemaker, the talent, the counselor, and the beauty. Boxed in by the high expectations of modern Christian womanhood, they follow and occasionally subvert the visible and invisible rules that govern the lives of evangelical women, earning handsome rewards or incurring harsh penalties. They must be pretty, but not immodest; exemplary, but not fake; vulnerable to sin, but not deviant. And black celebrity preachers' wives carry a special burden of respectability. But despite their influence and wealth, these women are denied the most important symbol of spiritual power--the pulpit.The story of women who most often started off as somebody's wife and ended up as everyone's almost-pastor, The Preacher's Wife is a compelling account of women's search for spiritual authority in the age of celebrity.",
  "genres": [
    "Nonfiction",
    "Religion",
    "History",
    "Christianity",
    "Christian",
    "Womens",
    "Audiobook"
  ],
  "author": "Kate Bowler",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/39664928-the-preacher-s-wife"
}