{
  "title": "Finding Fernanda: Two Mothers, One Child, and a Cross-Border Search for Truth",
  "description": "An in-depth investigation of $30,000 U.S. dollars, four Guatemalan orphans, one nonprofit evangelical Christian adoption agency, an accused family-run child-trafficking ring, one infant cut from her unconscious mother's womb, two missing sisters, and a nine-member Tennessee family who believed wholeheartedly in Christian love and faith-- until the dark side of international adoption shattered their trust. Investigative journalist Erin Siegal reveals the heart-wrenching story of how one poor Guatemalan woman, Mildred Alvarado, was separated from her two young daughters-- and how the American housewife slated to adopt one of those children, Elizabeth \"Betsy\" Emanuel, accidentally became a reformer dedicated to an ethical adoption system.Finding Fernanda sheds light on the highly politicized landscape of Guatemala's adoption industry, a multi-million dollar trade that was both highly profitable and barely regulated. Children have been stolen, sold, and offered as orphans to well-intentioned Western parents since the industry began in the 1980's. Both governments of Guatemala and the United States have repeatedly proved incapable of adequately regulating the baby trade.With help of documents obtained via Freedom of Information Act requests, leaked emails, and key sources inside both the Guatemalan and U.S. governments, Siegal traces the riveting story of two very different women brought together by the same missing child.  Along the way, roles of various players are illuminated, including jaladoras  (baby-finders), caretakers, Guatemalan judges, Embassy officials, adoption agencies, and many more. No one has given the American public a full understanding of how human rights abuses in adoption have occurred-- until now.",
  "genres": [
    "Adoption",
    "Nonfiction",
    "Biography Memoir",
    "Feminism"
  ],
  "author": "Erin Siegal",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/12295571-finding-fernanda"
}