{
  "title": "The Amber Brooch",
  "description": "Sparks fly and tension soars when a gutsy 21st century lawyer meets a 19th century Pinkerton agent in a Colorado mining town!  \n  Fast-paced Western adventure with a railroad war, gunslingers, dinosaur bones, and romance... \nAmber Kelly, mining lawyer and amateur paleontologist, visits her family’s 19th century log cabin in the Colorado mountains, and discovers a puzzle box hidden in a 200-year-old loom. Inside the box is a brooch engraved with a Gaelic inscription. After reciting the words, an earthy-scented fog engulfs Amber and whisks her off to Leadville, Colorado, in the year 1878. Within minutes of arriving in the infamous boomtown, she witnesses a horrifying accident.Pinkerton Agent Daniel Grant, a widower on assignment to the Rio Grande Railroad, sees his son fall into the path of a freight wagon. Terrified, he knows he can’t reach him in time. Amber sprints toward the boy, grabs him, and drags him to safety. Although Daniel is grateful to Amber for saving his son’s life, he quickly becomes suspicious of her legal knowledge, odd passion for hunting dinosaur bones, and the inability to answer simple questions about her identity.Olivia Kelly, real estate Broker and former litigator, is distraught over her sister’s disappearance. With the assistance of her client, former NYPD detective Connor O’Grady, they search the cabin for clues to Amber’s whereabouts. Connor recognizes the puzzle box and is convinced Amber has gone back in time. But where? With the help of his friends, David and Kenzie McBain, they identify two possibilities: Morrison and Caǹon City, Colorado, in the late 1870s. A plan to rescue Amber is immediately put into action.The time travelers are drawn into the middle of two wars: a ruthless and competitive bone war between two noted paleontologists, and a desperate railroad war between the Santa Fe and the Rio Grande. Their involvement in these wars puts at risk the future of paleontology, the outcome of a sensational legal battle, and the health and hearts of two couples, a ten-year-old boy, and a dog named Ripley.\nScroll up and grab a copy today.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Historical Fiction",
    "Fantasy",
    "Paranormal",
    "Fiction"
  ],
  "author": "Katherine Lowry Logan",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/39678955-the-amber-brooch"
}