{
  "title": "Backwards Book Launch: Reverse Engineer Your Book and Unlock Its Hidden 6-Figure Potential, Go From Being a Broke Author to a Rich Author",
  "description": "Attention Authors! There is hidden money locked away inside your book. We’re talking about 6, 7 and even 8 figures...  Whether you’re just starting out as an author and have already published a book OR you’re thinking of publishing a book in the future – all authors face the same How to Actually Make Money With Their Book. The author, Michelle Kulp, has published and launched 6 of her own bestselling books and has helped over 6 dozen clients do the same through her Amazon Bestseller program at www.bestsellingauthorprogram.com Many of Michelle's clients are using their books as a tool to build 6-figure businesses and beyond with! The publishing landscape has changed and the way authors make money with their books has changed too; it's no longer just about royalties. This book will show you exactly how to 10x your income by Reverse Engineering the PROFIT into your book and consequently create multiple streams of income. Smart Authors are learning how to create something very valuable to their long-term BUSINESS ASSETS The Backwards Book Launch method has 3 Design Your PROFIT Path into your book first, not last; Publish your Book the Right Way so it's guaranteed to become a Bestseller; Promote your book to #1 Bestseller; In this book, you will learn the 12 Profit Paths that you can add on to your book right now to increase your profits! As well as a special Bonus, also included 100 Ways to Make $100k! This book is Coaches, consultants, healers, accountants, doctors, lawyers, speakers, software developers, and high level business owners! And any smart author who wants to cash in on their knowledge and expertise to the tune of an additional 6-figures and beyond from their book. Here's some of what's included in this  How a guy who wrote a book about Pumpkin Patches is now making 7-figures on the back-end of his books. How this entrepreneur went from dead broke to an 8-Figure Business by giving away FREE books. How this computer nerd used his books to attract thousands of followers and built a 7-figure business with multiple streams of income. How this entrepreneur who suffered from complications of Lyme’s Disease used his #1 bestselling book to build a brand new 6-figure coaching and 7-figure product business. How an investment of 8 hours per year of your time, can add on 6-Figures in revenue to your book. How NOT to write Income-Blocking Books (which is what most Authors Write). The 3 types of Income-Producing books you should be writing. How a $37 per month program is generating $166,000 per month for this Author-Preneur. How to add on as many profit paths to your book as you want to 10x your income. Why shorter books are better and how you can realistically write a book a month. And MORE! This book is for all authors who are passionate about getting their message out to the world with their book so they can have a bigger impact...and make a living with their book.",
  "genres": [],
  "author": "Michelle Kulp",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/39675723-backwards-book-launch"
}