{
  "title": "Practical Wisdoms @ Work: Navigating the present with a plan for the future",
  "description": "Practical Wisdoms @ Work is a must-read for every woman who wants career success. Practical Wisdoms @ Work provides advice to broaden your career with skills that will set you apart. In this book you will find insights to navigate situations, challenges, and opportunities that arise every day in business. How can you manage your time and stress? Is telecommuting right for you? How do you work successfully with diverse individuals? Practical Wisdoms @ Work is your first step on the ladder to figure it all out. With approachable stories and positive examples that answer your questions, Practical Wisdoms @ Work is written by women who have been there, done that and are in it with you. Practical Wisdoms @ Work is a resource for women who are entering the workforce and building their careers. The advice and wisdoms contained in this volume are garnered from the experiences of Lynn, Tina, Rachel, and our friends and family. Our words are not gospel and should not be taken as such. This book is filled with what we learned through our own trials and tribulations—lessons that we’ve found useful in our careers. So, use our experience as guidance as you find what works for you. With Practical Wisdoms @ Work, you don’t need to start at square one as you forge your own path and work out your own solutions. Try out our advice, and see what fits. Women’s presence in the workplace is growing, and it’s clear that that’s not going to change. The women of decades past have paved the way for this rising generation, and millennials will continue to push the progress further. As we move forward, the best strategy is for women who have been there and done that to help the ones who are currently facing the obstacles of new employment. Practical Wisdoms @ Work is here to help with that process as we offer advice and stories from Lynn and Tina, with some insights from Rachel, about how to be successful in a career. Find in these pages the inspiration and guidance to keeping climbing toward your dreams. You go! Chapter 1 - Embarking on Your Journey Chapter 2 - Building & Embracing Success Chapter 3 - Making Yourself Indispensable Chapter 4 - Work-Life Balance & Boundaries Chapter 5 - Time Management Chapter 6 - Stress Management Chapter 7 - Networking Chapter 8 - Friend vs. Business Relationship Chapter 9 - Dealing with Difficult People Chapter 10 - Bullying & Harassment at Work Chapter 11 - Mentors & Support Structures Chapter 12 - Breaking Double Standards Chapter 13 - Leadership Styles Chapter 14 - Find Fulfillment & Feed Your Soul Conclusion MAIN LESSONS FROM THE BOOK Throughout this book, we have related our hard-earned experience through advice and stories. We endeavored to be specific to the challenge, whether it’s with time management or workplace bullies. After all, it’s usually best to tailor the advice to the situation! Still, there are a few principles that you can carry with you throughout your career. KNOW YOURSELF AND BE TRUE TO YOURSELF In order to choose your path, you need to know yourself— your strengths, values, and goals. What you are good at or have a natural talent for can inform you of which careers you are most likely to succeed in. Your values are the kinds of causes and people you want to work for and which practice you prefer. And your goals—those are your dreams, where you want to be in the future. Once you are certain of these things, the way forward will become clearer. For some people, this self-awareness comes easily, but others have to work hard for self-discovery. Even if you think you know yourself, it helps to ask yourself questions.",
  "genres": [],
  "author": "Lynn M. Whitbeck",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/39674334-practical-wisdoms-work"
}