{
  "title": "Laura Ingalls Wilder and Rose Wilder Lane: Authorship, Place, Time, and Culture",
  "description": "The mother-daughter partnership that produced the Little House books has fascinated scholars and readers alike. Now, John E. Miller, one of America’s leading authorities on Laura Ingalls Wilder and Rose Wilder Lane, combines analyses of both women to explore this collaborative process and shows how their books reflect the authors’ distinctive views of place, time, and culture. Along the way, he addresses the two most controversial issues for Wilder/Lane how much did Lane actually contribute to the writing of the Little House books, and what was Wilder’s real attitude toward American Indians.            Interpreting these writers in their larger historical and cultural contexts, Miller reconsiders their formidable artistic, political, and literary contributions to American cultural life in the 1930s. He looks at what was happening in 1932—from depression conditions and politics to chain stores and celebrity culture—to shed light on Wilder’s life, and he shows how actual “little houses” established ideas of home that resonated emotionally for both writers.            In considering each woman’s ties to history, Miller compares Wilder with Frederick Jackson Turner as a frontier mythmaker and examines Lane’s unpublished history of Missouri in the context of a contemporaneous project, Thomas Hart Benton’s famous Jefferson City mural. He also looks at Wilder’s Missouri Ruralist columns to assess her pre–Little House values and writing skills, and he readdresses her literary treatment of Native Americans. A final chapter shows how Wilder’s and Lane’s conservative political views found expression in their work, separating Lane’s more libertarian bent from Wilder’s focus on writing moralist children’s fiction.            These nine thoughtful essays expand the critical discussion on Wilder and Lane beyond the Little House. Miller portrays them as impassioned and dedicated writers who were deeply involved in the historical changes and political challenges of their times—and contends that questions over the books’ authorship do not do justice to either woman’s creative investment in the series. Miller demystifies the aura of nostalgia that often prevents modern readers from seeing Wilder as a real-life woman, and he depicts Lane as a kindred artistic spirit, helping readers better understand mother and daughter as both women and authors.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History"
  ],
  "author": "John E. Miller",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/3966551-laura-ingalls-wilder-and-rose-wilder-lane"
}