{
  "title": "Death by the River",
  "description": "“Weis and Astor just completely dominated the YA Thriller genre ...”~NetGalley“You could practically taste the fear.”~Laura Hernandez, YA Book Divas“Nothing can prepare you for what you will find within these pages.”\n~Goodreads\n\n\n“Death by the River represents a standout in literature. Mesmerizing, thoroughly engrossing, and emotionally gripping.” \n~Midwest Book Review\n\n\n“The drama of Riverdaleand Pretty Little Liars mixed with American Psycho.”\n~The Book Curmudgeon\n\n\n“Dark secrets and disturbed minds. A brilliant mystery thriller.”~Isabel Rivera\"A deliciously dark and timely teen crime thriller deserving of a TV series that tackles heavy-duty subject matter with grace and sophistication.” ~BestThrillers“Catching the current vogue of teen psycho and revenge tales like Bates Moteland 13 Reasons Why [Death by the River] is a horrifically brilliant book.”\n~Readers’ Favorite\n\n\n\"An evocative setting, powerfully defined characters, and a long hard look at the darker side of human desire, you will hold your breath until the very end. RECOMMENDED.”\n~US Review\n\n\n“A crime thriller that pulls readers into the twisted mind of the protagonist and holds them engaged till the exhilarating finish. Death by the River is psychologically engaging, emotionally rich, and utterly absorbing.” ~Christian Sia*Nominated multiple times for THE INDIE NEXT LIST: Great Reads from Booksellers*AWARDS:Winner/Gold: Young Adult Fiction Horror/Mystery2019 Moonbeam Book AwardsWinner/Gold: Young Adult Fiction2019 International Book AwardsWinner/Gold: Social Issues2019 Readers’ Favorite Book Awards1st Place Winner: Young Adult2021 PenCraft Book AwardDistinguished Favorite/Silver: New Adult2019 New York City Big Book AwardWinner/Bronze: Mystery/Thriller/Suspense/Horror2019 Feathered Quill Book Awards*Top 5 Finalist: Mystery/Thriller2019 Kindle Book Awards from Kindle Book Review (Amazon)Finalist: Young Adult Fiction2019 Killer Nashville Silver Falchion AwardFinalist: Thriller2019 ScreenCraft Cinematic Book Awards~ON THE RED LIST:#8 for Thriller Book/Manuscripts of the month#8 for Thriller Book/Manuscripts of the yearSemifinalist: Suspense and Thriller Fiction2019 CLUE Book AwardsA division of Chanticleer International Book AwardsShortlist: Literary and Contemporary Fiction2019 SOMERSET Book Awards",
  "genres": [
    "Young Adult",
    "Thriller",
    "Horror",
    "Mental Health",
    "Psychological Thriller",
    "Fiction",
    "Crime"
  ],
  "author": "Alexandrea Weis",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/39675320-death-by-the-river"
}