{
  "title": "The New Vegetarian Epicure: Menus--with 325 all-new recipes--for family and friends",
  "description": "Anna Thomas, author of the best-selling The Vegetarian Epicure, which became the bible of vegetarian cooks in the seventies and remains a classic, now returns with an exuberant new cookbook that reflects the way we live and eat today. The 66 menus are geared to busy, health-conscious families who are drawn to good fresh foods and lighter fare, filled with the pungent ethnic flavors that Anna Thomas loves.Here are more than 325 recipes for every occasion, from seasonal family meals and little dinner parties to picnics and holiday feasts. For A Simple Autumn Dinner Party that includes a freshly made Focaccia, Lima Bean Soup, Torta di Polenta with a Roasted Tomato Sauce, and Parfaits of Fruit and MascarponeA family meal of a Salad of Bitter Greens with Gorgonzola Cheese and Walnuts, Oyster Mushroom Chowder, Fast Buttermilk Rolls, and an Apple and Pear CrumbleA celebratory Cinco de Mayo Dinner of Nopalito Salad, Tamales with Zucchini and Cilantro Filling, Chile Ancho Salsa, Garlic and Cumin Rice, and Flan with Caramel and PineappleThere are easy Salad Lunches, Soup Suppers, Pasta Dinners, Dinner in a Bowl, and A Casserole Supper--all foods that children love. And there are salad lunches for hot days, mezze (hearty little Middle Eastern dishes) for a crowd, a variety of teas, brunches, and a wine-tasting.Freshness is all-important to Anna Thomas, and she offers great tips about growing tomatoes, gathering wild mushrooms, and understanding chiles, as well as suggesting strategies for getting children to eat well.The captivating voice of Anna Thomas, which inspired a whole generation, is now even more irresistible as she persuades her contemporaries, pressured by all the demands of the day, to carve out a little time to prepare delicious, healthy meals and to experience the joy of sharing with family and friends the pleasure of the table.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Vegetarian",
    "Nonfiction",
    "Reference"
  ],
  "author": "Anna Thomas",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/396753.The_New_Vegetarian_Epicure"
}