{
  "title": "The White Russian: A Novel",
  "description": "St. Petersburg, 1917 — the glittering capital of the Tsarist empire and a city on the brink of revolution– where the jackals of the secret police maneuver for their own survival and their aristocratic masters indulge in one final moment of hedonism.For Sandro Ruzsky, chief investigator of the St. Petersburg police department, this decaying world provides the opportunity for a new beginning. Recently returned from a three-year banishment to Siberia (for pursuing a case his superiors would have like buried), Ruzsky is welcomed back to the city of his birth by a gruesome the bodies of a young couple found on the ice of the frozen river Neva just outside the Tsar’s Winter Palace.The dead woman was a nanny at the palace, the man, an American from Chicago. The brutality of their deaths seems an allegory for the times, and the investigation leads Ruzsky, at every turn, dangerously close to the royal family. He is also drawn back to Maria–a beautiful ballerina he once loved and lost. While Maria is on the verge of being swept away by the revolution, Ruzsky suspects she may also be the murderer’s next target.Pitted against a ruthless killer who relishes taunting him, Ruzsky finds himself face-to-face with his own past and the unstoppable tide of revolution as he fights to save everything he cares for. Summoning the same rich atmosphere and meticulous research that earned high praise for The Master of Rain , Tom Bradby brilliantly transports readers to St. Petersburg at the crossroads of history.Tom Bradby is the royal correspondent for the British television network ITN. He has spent the last eight years covering British and American politics as well as conflicts in China, Ireland, Kosovo, and Indonesia. He now lives in London with his wife and three children.",
  "genres": [
    "Historical Fiction",
    "Russia",
    "Mystery",
    "Fiction",
    "Thriller",
    "Historical",
    "Suspense"
  ],
  "author": "Tom Bradby",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1229655.The_White_Russian"
}