{
  "title": "Enigma",
  "description": "He’s been watching her for days and she doesn’t even know it. It’s time now to move on the bounty. She’ll be his in the morning and there’s nothing that anyone could do about it.  Bahn was one of the greatest thieves, smugglers, and bounty hunters of his time, but his time was a half a million years ago when humans didn’t even exist in the Milky Way. His host body died however, leaving his Ch-khana soul stuck waiting inside a black cerebral box. And there he waited. And he waited. Then nearly half a million years later, he finds himself alive again, attached to a male human host on the planet Earth. It doesn’t take him very long to steal an intergalactic freighter and then shortly thereafter, he receives a notification regarding one of the largest bounties ever offered. And all it required was the capture and delivery of a young and beautiful woman in the Eta Cassiopeia system.  Ani Maxima’s days were numbered at that very moment because Bahn has never failed before. The Ani Maxima Files: Ptolemy’s Child SuperVirus Veiled Sky Enigma Flying in the Rain Silent LucidityFlesh and BloodSoul SisterSocial Animal Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Kepler Moon Alpha, and Ghosts of Ophidian. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Hope Rising, One Crazy Summer, and Vestige by McElhaney.   EDITORIAL REVIEWS:   \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review  \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher  Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/39670576-enigma"
}