{
  "title": "The Labyrinth Queen",
  "description": "From the author of Serprent's Touch comes a wicked story of love, loss, and terrible danger.  In a world where Kings and Queens make court, where monsters are real, and magic is to be feared, there exists a great and terrible labyrinth of unknown origin, lorded over by an equally enigmatic and mysterious King. No one who enters the labyrinth without the King's permission leaves, those who defy the King are thrown in as punishment, but for everyone else who lives within this King's domain, the labyrinth is a source of safety and protection. For Cora, the labyrinth is about to become a nightmare from which she can never awaken.  The Labyrinth Queen is the first in a brand new series by Tansey Morgan, author of the hit debut novel, 'Serpent's Touch', and the Last Serpent series. Departing from her usual style of contemporary paranormal romance in favor of the fantastical, Tansey offers a spellbinding story filled with twists, turns, magic, and danger, told from the standpoint of a woman who questions her own self worth, but yearns to find it. More than just that, however, Tansey introduces us to the love interests in the story by giving you their unique points of view, allowing you to follow this Reverse Harem novel through the eyes of not just one, but many viewpoints.  If you love the paranormal romance and fantasy genres, if you like your stories to have a little bite in them, if you aren't scared of excitement, then this is the book for you.  Disclaimer: this book is part of a continuing series of novels, all which will follow the same arc over many books, but each which will tease into the next - expect to be left with questions at the end. As a reverse harem fantasy novel, you can expect there to be action, magic, intrigue, and multiple primary love interests. Sexual content will also form a part of this series, as will swearing and violence. If you're happy with all of this, then...  Pre-order the Labyrinth Queen today, and \"forget about the baby\"!",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Paranormal"
  ],
  "author": "Tansey Morgan",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/39674728-the-labyrinth-queen"
}