{
  "title": "Evolution of a Killer",
  "description": "Synopsis of “Evolution of a Killer: A Lazarus Solaris Novel”\tEvolution of a killer is the story of how Lazarus Solaris, only child of Jared and Margaux, evolved into a contract killer known as the Chameleon.The first three chapters are set in Chicago. The year is 2003; the reader is introduced to Lazarus – a sadistic killer exacting revenge on two men; men who destroyed the life of a young Japanese girl. The reader also gets a glimpse into Lazarus’ complex morality, and learns how he earned the nick-name “The Chameleon.”In chapter four we are taken to Rockport, Texas – May 1, 2016. Lazarus has been contracted by a local bank president to be “killed” when in fact he wants to be relocated with a new identity – a first for Lazarus. Through flashbacks the reader follows the life of Lazarus and the events that shaped him into the man he is today – a man his psychology professor referred to as “a sociopath with the tattered remnants of a conscience.” Other major characters and players are introduced through other trips back in time, and the reminiscing of Lazarus. Katsumi Tanaka: the young Japanese girl he avenged in 2003. Dr. Helen Hudson, his former psychology professor and her husband Darnell – a member of a Chicago street gang. Leonard James: one of Lazarus most trusted associates. Enrique Garza: president of Gulf Coast Bank and Trust, the client, and his wife; former model Angelique Shaloub. Carlos Torano: aka “El Corazon”, (The Heart) – head of the Mexican drug cartel Los Zapatos de la Muerte, (The Shoes of Death). “Cooper Johnson”, the alias and persona that Lazarus uses to deal with Garza. Last, but far from least is Langston Van Schäfer – a 100 pound black German shepherd with piercing green eyes – who will kill on command as dispassionately as his master.A relationship grows between Lazarus and Angelique, beginning with a chance encounter. This adds a romantic sub-plot. El Corazon discovers over fourteen million dollars of his money is missing – money that Enrique Garza had laundered for the Cartel, adding multiple twists and turns in the execution of Lazarus’ contract.The climax to the story is Lazarus, with the help of his friends and associates fulfilling the contract on Enrique Garza – dealing with the Drug Lord at the same time. Murders, as well as the rescues of innocent parties are woven into the fabric of the story before it’s finale in Argentina.Lazarus Solaris: Evolution of a Killer will pull you in to the lives, hopes, dreams and sometimes, the fears of the cast of characters around him. There is much more to Lazarus than meets the eye. As you read along, you’ll find yourself strangely drawn to this man by his dichotomy – a killer who is as capable of random acts of kindness as he is of brutal and sadistic murder. Evolution of a Killer is a story of hope – hope for the man who lost almost everyone he loved by the age of 16. Lazarus the man will touch your heart, once you learn the events of his childhood that shaped him into the killer known as the Chameleon. You will understand the loyalty of those around him, as you witness the lengths he will go for those who love him for who he is – not what. I hope you will join me in this journey with Lazarus, as this is merely the beginning of the story I have to tell about the Chameleon – a sociopath with the tattered remnants of a conscience.Robert Ullrich",
  "genres": [],
  "author": "Robert Ullrich",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/39683653-evolution-of-a-killer"
}