{
  "title": "Santori Reborn",
  "description": "MICHAEL KAGE SANTORI doesn’t think his life can get any more complicated. Juggling a new business, a fledgling UFC career, and the only real relationship he’s ever had is taking a toll on him both mentally and physically. After being attacked for daring to question the inner workings of his own business, he is left broken and confused. The discovery of his uncle’s journals has brought him face-to-face with a past he never understood, and the new perspective has him reeling. Add to that the fact that he hasn’t been totally honest with the love of his life, and you have a recipe for a serious nervous breakdown. When an old friend resurfaces with new information, Kage discovers things are only going to get worse before they get better. If he ever hopes to free himself from the chains of his uncle’s dark legacy, he’s going to have to become something he never wanted to be. And risk losing the only person he’s ever truly loved.  JAMIE ATWOOD is in over his head. Instead of the happily ever after he’d envisioned, moving in with Kage has only been one disappointment after another. Kage has come out to the entire world and still managed to keep his reputation and his UFC contract intact, but mysterious forces Jamie has yet to discover are transforming his sexy alpha fighter into someone he doesn’t recognize anymore. If Kage doesn’t come clean soon, Jamie fears he’s going to have to leave. With his journalism degree and a newly-flourishing MMA blog, he knows he’s got what it takes to make it on his own financially. It’s his heart he’s worried about. Because without Kage by his side, what is there to live for?  MEANWHILE IN ANOTHER LIFETIME...  PETER SANTORI has found his bliss. Being Gio’s boy is a dream come true for a guy who thought he was doomed to a life of abuse and poverty. His confidence and sense of security are flourishing in the warm glow of Gio’s love, and he has started to believe that maybe he can have the fairytale after all. Never mind that he’s got to keep the true nature of their relationship a secret. Never mind that one of Gio’s associates seems to have something against him. And never mind that sometimes he gets the feeling that there’s a lot more to Gio than meets the eye. All that matters is that he and Gio are together. 4 EVER & EVER...  Previous books in this series (in order): Kage (The Kage Trilogy Book 1) Kage Unleashed (The Kage Trilogy Book 2) Kage Unmasked (The Kage Trilogy Book 3) Santori (The Santori Trilogy Book 1)",
  "genres": [
    "M M Romance",
    "Romance",
    "Audiobook",
    "Sports",
    "LGBT",
    "Contemporary",
    "Crime"
  ],
  "author": "Maris Black",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/39695432-santori-reborn"
}