{
  "title": "Her Secret",
  "description": "“Our love is so much more than a mere catastrophic occurrence.”  My name is Freya Wilson. I am not your typical girl next door. I’m far from it.  As my mother likes to point out since I graduated high school, I should be planning my life instead of wallowing around the house, in my pajamas all day. Girls my age are either preparing for college or taking advantage of the warm summer days that California provides in spades. She doesn’t understand why I prefer to be stuck in my room, watching the world pass by.  But there is a reason to my melancholy that she will never know. I’m in mourning. I morn a love I can never have. A love that if anyone were to learn about its existence, I would be judged and ridiculed. Branded with names too ugly to mention. Years ago, I had made the ultimate sacrifice so no one would discover my secret.  However, now my secret is being put to the test. I will need to overcome one last obstacle.  When fate brings me to live under the same roof temptation lies, I fear I might not be strong enough to hide my feelings. The moment I set foot inside it, my life takes an unexpected turn and the vision I once had of eternal solitude, seems out of reach. The chains I have weaved around me are no match for the allurement the house next door provides.  There is no running away from love, and I was a fool to think otherwise.  This love story involves five alpha knights that will do anything to get their princess back. If you believe that love conquers all, and adore all things Reverse Harem than this book is for you.  *Bad Influence is a Reverse Harem series. Each book is a standalone novel, with all new characters and brand new love stories. *Recommended 18+ due to mature language and situations.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Contemporary",
    "New Adult",
    "Contemporary Romance",
    "Audiobook",
    "Dark"
  ],
  "author": "Ivy Fox",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/39682017-her-secret"
}