{
  "title": "Kockroach",
  "description": "It is the mid-1950s; in a fleabag hotel off Times Square Kockroach, perfectly content with life as an insect, awakens to discover that somehow he's become, of all things, a human. As Kockroach, led by his primitive desires and insectile amorality, navigates through the bizarre human realms of crime, business, politics, and sex, he meets with both great triumph and great disaster.In Kockroach, a wholly original work of literary noir, Tyler Knox brilliantly turns Kafka's The Metamorphosis on its head. It is the mid-1950s, and in a fleabag hotel off Times Square, Kockroach, perfectly content with life as an insect, awakens to discover that somehow he's become, of all things, a human. This tragic turn of events would be enough to fling a more highly evolved creature into despair, but cockroaches know no despair. Firmly entrenched in the present tense, they are awesome coping machines, and so Kockroach copes. Step by step, he learns the ways of humans—how to walk, how to talk, how to wear a jaunty brown fedora. In Times Square he discovers a blistering sea of lights, a great smoking god, walls of glass laden with food, and the opportunity to rise in the human world. Two companions guide him on his way: Mite, an undersized gangster suffering an acute case of existential angst, and Celia Singer, a reserved woman with a disfigured body who finds in Kockroach a key to unlocking her hidden passions. As Kockroach, led by his primitive desires and insectile amorality, navigates through the bizarre human realms of crime, business, politics, and sex, he meets with both great triumph and great disaster. Will he find success or be squashed flat from above? Will he change humanity, or will humanity change him? Packed with love, violence, and a perverse sense of humor, Kockroach is the classic tale of an immigrant's search for the American dream as seen from a stunning new perspective.",
  "genres": [
    "Fiction",
    "Mystery",
    "Novels",
    "Literary Fiction",
    "Noir"
  ],
  "author": "Tyler Knox",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/396881.Kockroach"
}