{
  "title": "Scala: Le leggi universali della crescita, dell'innovazione, della sostenibilità e il ritmo di vita degli organismi, delle città, dell'economia e delle aziende",
  "description": "Il mito narra che Sisifo, il più scaltro degli uomini, sconta la sua condanna facendo rotolare lungo il versante di una collina un macigno che, una volta raggiunta la cima, ripiomba sempre giù in basso. Proprio come Sisifo, anche noi oggi sembriamo condannati a sospingere incessantemente un peso a tratti insopportabile, quello cioè del cambiamento continuo, della costante accelerazione. L'innovazione, che ogni giorno dischiude ai nostri occhi scenari inimmaginabili soltanto pochi anni fa, procede a un ritmo vertiginoso. E con essa l'idea della crescita ininterrotta dei consumi, delle città, della popolazione mondiale, e, dunque, anche dei costi in termini di mutamenti climatici, risorse energetiche e sostenibilità del pianeta.Forse potremmo pensare al futuro con maggiore fiducia se riuscissimo a comprendere a fondo le dinamiche della crescita continua nonché il loro sviluppo e le loro implicazioni in un quadro di prevedibilità quantitativa. Se riuscissimo, cioè, a ipotizzare l'esistenza di un ordine nascosto e sotteso alle molteplici forme del vivente, di un numero circoscritto di leggi cui obbediscono tutti i sistemi complessi.È quanto suggerisce Geoffrey West, già direttore del Santa Fe Institute nel New Mexico, in questo libro sorprendente e per certi versi visionario. Con il rigore e la creatività del fisico teorico, West ci invita a guardare alla realtà che ci circonda con occhi diversi, a osservare cosa succede se confrontiamo tra loro fenomeni differenti, come, per esempio, il tasso metabolico del corpo umano, il numero dei battiti cardiaci, il valore dell'attivo netto delle società quotate in borsa e il numero di brevetti prodotti in una città. Ci stupiremo nello scoprire che esiste una regolarità esprimibile attraverso il linguaggio della matematica, e cioè che, variando di scala con l'aumentare delle dimensioni, piante, ecosistemi, città, microrganismi, grandi aziende, il nostro stesso corpo e certe malattie variano in maniera coerente e prevedibile. E questo perché sono tutti soggetti a leggi generali, sistemiche e unificanti, condividono una comune struttura concettuale e sono riconducibili a una serie di principi fondamentali. In altre parole, sono solo delle variazioni su un tema universale, il quale, se interpretato correttamente, diventa uno strumento predittivo straordinario per pianificare il futuro del pianeta.Integrando temi di biologia e matematica, fisica e scienze sociali ed economiche, Scala offre una prospettiva affascinante e insolita sulle grandi sfide globali che ci attendono.",
  "genres": [
    "Science",
    "Nonfiction",
    "Economics",
    "Business",
    "Biology",
    "Physics",
    "Philosophy"
  ],
  "author": "Geoffrey West",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/39690036-scala"
}