{
  "title": "Speaking of Faith",
  "description": "The host of public radio’s Speaking of Faith explores the role of faith in the world and in human life today  Krista Tippett is the creator and host of public radio’s phenomenally popular program Speaking of Faith, a weekly conversation about religion, meaning, ethics, and ideas. As a journalist and then as a diplomat in Berlin, Tippett was enthralled by the promise of political solutions to divisive issues. When politics did not provide worthy answers, Tippett attended Yale Divinity School to pursue larger questions about what makes a meaningful life. In her quest for faith’s illumination of life’s complexities, passions, and frailties, she developed a compelling style of discourse—a “life of conversation”—that she now shares with millions of people every week. Tippett’s unique, in-depth conversations with theologians, scientists, ethicists, and seekers who share their experiences, combined with her engaging style, are revolutionizing the way many think and speak of faith in their families and communities and in the larger world.  Speaking of Faith is the story of this conversational journey and what it yields. Tippett draws on her life experiences and her studies, as well as on conversations with Elie Wiesel, Karen Armstrong, Thich Nhat Hanh, and other renowned figures, to explore such complex subjects as justice, science, fundamentalism, evil, love, and mystery, all within the context of spirituality. In the tradition of Kathleen Norris and Anne Lamott, Krista Tippett here shares a life of conversation that anyone, secular or religious, will find thought provoking about what faith does— and can—mean to us today. BACKCOVER: Praise for Krista Tippett and her public radio program Speaking of Faith:  “The brilliance of Krista Tippett’s idea is to trust people to use the first person singular, to commit themselves with passion and clarity as they enlarge our urgent national conversation.” —Martin Marty, Emeritus Professor of American Religious History, University of Chicago  “Speaking of Faith isn’t just a good idea and a welcome concept for a muchneeded forum on religion, belief and spirituality in contemporary life—it already is that forum.” —Patricia Hampl, Poet, memoirist, and MacArthur “Genius” Grant recipient",
  "genres": [
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Faith",
    "Memoir",
    "Biography",
    "Audiobook"
  ],
  "author": "Krista Tippett",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/396805.Speaking_of_Faith"
}