{
  "title": "Sand and Storm",
  "description": "When junior mage Faryn is offered an internship with Professor Shaun Valerian—famous for edgy magic and breaking hearts—she can’t afford to say no, even at the expense of her own archaeological dig. But when they join an expedition in the middle of the enchanted Caladoner desert, Shaun reveals he’s up to far more than excavating dragon sarcophagi. Growing high above the sands is a storm so massive it could destroy the planet’s magical balance. There’s just one chance to stop the cataclysm—a lost super weapon, long buried in a forgotten temple. A temple that Faryn must rob.Faryn’s cousin Cora has also been drafted into the temple expedition. Newly married to a man she barely knows, Cora is more interested in kindling romance than in digging up artifacts. But as the desert’s strange enchantment infiltrates the magical bond that ties her to her husband, Cora begins to burn with a power that’s been forbidden for centuries. It could kill her—but it may be the only way to unlock the legendary weapon.As the storm clouds darken, Faryn and Cora will have to choose: between safety and sacrifice, between duty and love, between old dreams and a new magic that will change the world—if the world can survive it. excerpt from Chapter 1Faryn twisted her copper-colored braid around her hand as she stared at the auditorium clock. Professor Valerian’s lecture should have started forty-five minutes ago, and if tonight’s crime was to go as planned, Faryn couldn’t afford to run late. She considered slipping out, but this was the last chance she’d have to hear Shaun Valerian lecture before she graduated.The restless stir of students hushed as magic shimmered behind the podium. A moment later, a young man materialized, carpet bag in hand. Dropping his luggage and kicking it beneath the podium, he brushed his tawny hair out of his eyes. “Sorry I’m late. I got held up by a nest of sky wyverns.”His bright hazel eyes swept the room, and for one moment, Faryn could have sworn they rested on her front row seat. She had to be imagining things, but a responsive smile curled her full lips anyway. Of course, if Shaun Valerian ever actually noticed her, she’d probably implode with sheer ecstasy.Digging a sheaf of battered notes out of his back pocket, he said, “Today we’re talking about wild magic—what causes it, what its effects can be, and whether or not we should work to tame it.”Faryn opened her notebook, but it was only camouflage. She had no intention of wasting the hour looking down at notes, when she could be gazing at the man behind the podium.Shaun began, “Wild magic is the name we give to natural confluences of magions. Usually, these sparks of power remain inert and spread evenly throughout the atmosphere, unless channeled by a creature with essence—like me.” He stabbed his pointer finger into the air and a line of fire appeared. He flicked his wrist and the line twisted itself into a glowing caricature of his own face. The auditorium rumbled with laughter.Faryn’s mind drifted away from the mechanics of magic. If the academy administration expected her to pay attention, they should hire less attractive teachers. Older ones, for sure. Shaun didn’t look like he could be more than twenty-five. Only six years older than me. It would also help if he didn’t transport straight onto the stage with the smell of adventure wafting off him. She wondered whether he could give her any tips for her burglary, and then her mind drifted to the rare nest he’d so casually mentioned. She’d give her eyeteeth to see wyverns on the verge of hatching. She slipped into a daydream where Shaun took her to see the nest. They’d watch as the hatchlings exploded out of their air-woven eggs, ballooning to ravenous adult size in minutes. The forest would go up in flames as the starving dragons drove out game for their first meal. Sweeping her up in his arms, Shaun would transport her to safety, accidentally leaving his shirt behind and—Faryn snapped back into the present and realized that a pair of brilliant hazel eyes held her own. There was no doubt—Shaun Valerian was leaning over his podium, looking right at her. His intent gaze made her feel caught in the act, her daydream exposed.A scarlet blush exploded across her face. Cursing the fair skin that went with her red hair, Faryn took deep breaths, trying to think of anything but a shirtless Professor Valerian, and completely failed to cool her cheeks.Valerian was still staring at her, a quizzical look on his face even as he continued to speak.If she stayed, she’d look like she was on fire for the rest of the lecture. Good thing she had to go anyway. Clutching her notebook, she stood and hurried toward a side door. On the threshold, she risked a look back. Valerian had paused to watch her exit. After a horrified moment, Faryn realized everybody else was staring, too. She ran.By the time she reached the front steps of the Academy for Thaumaturgical Study and Practice (Outskirts campus), her face had returned to its normal color. He’s noticed me now, she thought, and wanted to crawl into a hole for the rest of her life. At least she was graduating in the fall, never again in danger of looking Shaun Valerian in the eye.Faryn took a deep breath and shoved the humiliating episode out of her mind. Lengthening her stride, she headed for the gates.She had a bag to pack, a train to catch, and a factory to rob.",
  "genres": [
    "Fantasy",
    "Romance",
    "Dragons",
    "Fiction",
    "Fantasy Romance"
  ],
  "author": "Stella Dorthwany",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/39686092-sand-and-storm"
}