{
  "title": "Christoff's",
  "description": "His life was simple – work, heroin, sleep, REPEAT! The insanity increased after meeting Gabrielle. She was young, a kid really, but acted as though she'd lived this life for years. He began to take a hard look at his own life and what was slowly killing him - he had to stop. Jake and Gabrielle had one real connection – heroin! She was a tough kid who had a tenderness buried deep beneath the surface, which was how she wanted to keep it. With over a year of heavy heroin use, hardly any food and little sleep, she was dying at a rapid rate – he hated to watch it, but had no control over what was about to happen to her. She came into his life fast and loud but left it quietly and far too soon. Heroin took away this intense force…he would never forget her!Gabrielle's life was hanging in the balance as the gurney burst through the doors of the Emergency Room. She didn't die at the flat after all, but was barely alive as she lay on the gurney in ICU. Dr. Carson and his team saved her, giving her the chance to live a life she had never expected. Following her overdose, Gabrielle had been given a second chance and was determined to get healthy. At St. George Hospital, she had found not only her savior, but a better life with a family who loved her unconditionally. The Carson's fell in love with a runaway drug addict who, through endurance and strength, changed her life around. They were determined to give Gabrielle the support she needed to work towards her dream of becoming one of the most sought after models in New York. How long would she be loved and envied by millions, would her past come back to haunt her, ripping happiness from her grasp? Gabrielle would soon learn the devil she’d been running from, was never far away.CHRISTOFF’S combines drugs and murder with love, renewed friendships and incredible hope, creating an experience not easily forgotten. Jake’s life is a dramatic ride you'll never forget as Gabrielle steals your heart. Her rise from a desolate beginning full of anger, pain, abuse, and heroin, to a life of success, determination, and love, creates a relationship you didn't expect to have with this young runaway. She had become an unforgettable part of everyone's world, a beautiful bright flame that fought against a deadly beginning created from a lighter and a spoon.",
  "genres": [],
  "author": "Cate Wilding",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/39680925-christoff-s"
}