{
  "title": "Mintzberg on Management",
  "description": "Henry Mintzberg revolutionized our understanding of what managers do in The Nature of Managerial Work, his landmark book. Now in this comprehensive new volume, Mintzberg broadens his vision to explore not only the function of management, but also that of the organization itself and its meaning for society. A treasury of the dynamic and iconoclastic ideas that have made him a mentor to an entire younger generation of leading management thinkers, Mintzberg on Management presents the collective wisdom of this influential scholar -- in strategy, structure, power, and politics -- the gestalt of organizational theory. Known as the guru of bottom-up management, Mintzberg broke with convention by actually going inside companies to witness the business of business. Revealing how strategy is really formulated, he shows here that successful strategy is rarely, if ever, born in solitary contemplation; rather, the elements usually come together in the heat of battle. In addition, Mintzberg identifies the keys to outstanding management. He begins by describing the good manager who successfully combines interpersonal, informational, and decision-making roles. However, effectiveness in management, Mintzberg demonstrates, depends not only on a manager's embodiment of these necessary qualities, but also his or her insight into their own work. Performance depends on how well he understands and responds to the pressures and dilemmas of the job. As Mintzberg illustrates, it is often the case that job pressures can drive a manager to be superficial in his actions -- to overload himself with work, encourage interruption, respond quickly to every stimulus, avoid the abstract, make decisions in small increments, and do everything abruptly. The effective manager surmounts the pressures of superficiality by stepping back in order to see a broad picture, and making use of analytical inputs. Keeping his focus on how real companies work, Mintzberg challenges traditional assumptions and answers from the grass roots level such essential questions as \"How do organizations function and structure themselves?....How do their power relations develop and their goals form?\" And, \"By what processes do managers make important strategic decisions?\" With the same hard-hitting impact of his popular seminars for executives, Mintzberg on Management conveys Mintzberg's latest ideas on management and organization, including \"Society Is Unmanageable as a Result of Management\" and \"Training Managers, Not MBAs? As solid and reality oriented in its approach as his classic The Nature of Managerial Work, this volume promises to have comparable sweeping influence on managers in all fields.",
  "genres": [
    "Management",
    "Business",
    "Nonfiction",
    "Leadership",
    "Buisness"
  ],
  "author": "Henry Mintzberg",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/39699.Mintzberg_on_Management"
}