{
  "title": "Stop Thinking Like That",
  "description": "An Athlete's Road to Redemption from Addiction Hyland’s charismatic, witty, and candid writing style brings you onto the couch with him as he takes you through the wallows of addiction and alcoholism at their greatest depths, to a rejuvenated, motivated, inspirational rebirth. He is an example that addiction does not discriminate and puts to rest the stigmas attached. He was a man who seamlessly had it all with a bright future ahead, but the power behind drugs and alcohol took a stranglehold on him, halting any progression. Stop Thinking Like That is not your typical addiction story leaving you solemn, rather you end each chapter inspired and uplifted.After a nearly two-decades long run in and out of the bowels of the diseases he finally surrendered and found the courage to ask for help. His journey in recovery gives hope to anyone facing great challenges in life, that no matter how far down you have dropped, you can pick yourself up, and be even better than you ever imagined. During his first couple months sober, a newfound passion and burning rush filled him within. This passion has brought to light what is now Stop Thinking Like That. All the while living in a sober-home with upwards of eighteen other addicts and alcoholics, he relentlessly pursued his passion of spreading the message of hope. His tireless efforts seep through the pages in his quest to find the greatest version of himself that exists. He will have you jumping out of your chair to attack life, with constant motivation and reminders of what we are capable of despite how lost we may feel we are. Hold on tight, because this journey is one helluva roller coaster ride that will leave you inspired to be a better person and with the drive to help others. No matter the adversities you face in life, you can overcome them and live out the life you always dreamed of. Hyland is living proof that anything is possible, No Matter What.",
  "genres": [],
  "author": "Jason Hyland",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/39693315-stop-thinking-like-that"
}