{
  "title": "Denmark Vesey’s Garden: Slavery and Memory in the Cradle of the Confederacy",
  "description": "“Denmark Vesey’s Garden reveals that the long struggle over how Americans remember slavery has been inseparable from the long struggle for racial justice.”—Ibram X. Kendi “ Kytle and Roberts’s meticulous research, compelling writing, and thoughtful analysis are vital to our nation at a time when we were haunted by a history we need to understand more deeply.”—Bryan Stevenson“Eye-opening history.”—Kirkus Reviews (starred review)  In the tradition of James Loewen’s Lies My Teacher Told Me, a deeply researched book that uncovers competing histories of how slavery is remembered in Charleston, South Carolina—the heart of Dixie A book that strikes at the heart of the recent flare-ups over Confederate symbols in Charlottesville, New Orleans, and elsewhere, Denmark Vesey’s Garden reveals the deep roots of these controversies and traces them to the heart of slavery in the United States: Charleston, South Carolina, where almost half of the U.S. slave population stepped onto our shores, where the first shot at Fort Sumter began the Civil War, and where Dylann Roof shot nine people at Emanuel A.M.E. Church, the congregation of Denmark Vesey, a black revolutionary who plotted a massive slave insurrection in 1822. As early as 1865, former slaveholders and their descendants began working to preserve a romanticized memory of the antebellum South. In contrast, former slaves, their descendants, and some white allies have worked to preserve an honest, unvarnished account of slavery as the cruel system it was. Examining public rituals, controversial monuments, and whitewashed historical tourism, Denmark Vesey’s Garden tracks these two rival memories from the Civil War all the way to contemporary times, where two segregated tourism industries still reflect these opposing impressions of the past, exposing a hidden dimension of America’s deep racial divide. Denmark Vesey’s Garden joins the small bookshelf of major, paradigm-shifting new interpretations of slavery’s enduring legacy in the United States.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Race",
    "Civil War",
    "Southern",
    "Politics"
  ],
  "author": "Ethan J. Kytle",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/39711186-denmark-vesey-s-garden"
}