{
  "title": "Initializing",
  "description": "When Martin Fuller finally got to visit the pyramids in Egypt, the would-be archeologist did not just achieve his dream… He also unknowingly fulfilled an age-old prophecy. Because there was a reason why the young man had been hearing voices since he was a kid and why he had been fascinated by the majestic tombs made of limestone. By setting foot inside the Great Pyramid of Khufu, he will learn the truth; a truth that will send him all the way across the galaxy.  Transported to a planet on the verge of a catastrophic invasion, Martin will be tasked with protecting this foreign world from the powerful beings about to land and harvest the souls of its unsuspecting inhabitants. To help him in this mission, Martin will be granted command over a production facility that can build basic defense mechanisms. However, that stronghold is too ancient and decrepit, and the units it can manufacture too lousy and clumsy; especially in comparison to the invaders’ powers which—as Martin could witness from the vision he experienced when his mind was captured—seemed godlike and completely unstoppable. Still, if Martin wants to ever go back home or even survive the war to come, he will need to search for a way to fight back. And that will go through finding how to upgrade his units and develop new weapons as well as combat strategies.  He has to hurry. Because if dealing with that ominous threat wasn’t bad enough, he will have to compose with the nations comprising that strange world and which see his arrival as a danger to be stopped. Will Martin be able to have them hear reason, set aside their quarrels and cooperate before they’re all annihilated?  Archeologist Warlord: Initializing is a dungeon core-like work of fiction belonging to the LitRPG genre, and the first book in a series to come.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction"
  ],
  "author": "E.M. Hardy",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/39701639-initializing"
}