{
  "title": "Genetic Imperfections",
  "description": "A bitter father who lost his only child to leukemia risks everything to save a ten-year-old's life with the first genetic cure for cancer in this action-packed second thriller from the author of The Sunset Conspiracy.Fifteen years ago, David Wellington abandoned his lucrative banking career and joined Rexsen Labs to save his young son's life. But despite his sacrifices and prayers, he helplessly watched him die. On that day his heart hardened, and he embarked on a path of cynicism, materialism and self-indulgence. Now, at forty-five, he's ready to collect the payoff for selling his soul when he takes Rexsen Labs public. Propelled by the pending FDA approval of CGT, the first genetic cure for leukemia, he's on the verge of becoming Newport Beach's newest billionaire. But his dream suddenly becomes a nightmare when his jet crashes into the Pacific Ocean. While David miraculously survives, he loses control of Rexsen to his ruthless wife, Priscilla, her scheming brother, and her Wall-Street-cover-boy lover. Meanwhile, Rexsen researcher Tori Clarke discovers a fatal flaw in CGT, and becomes the target of a deadly cover-up to save their multi-billion dollar payday. Framed for murder and on the run, David joins forces with Tori to regain control of Rexsen, fix CGT, and save a young girl's life. Trapped between the authorities and the company he helped build, David risks everything to give meaning to his second chance at life and his only chance for love. Genetic Imperfections is a story of redemption uniquely packaged in the thriller genre. It's a story about how the fundamental goodness in one man can be buried by tragedy and replaced with bitterness and greed--and how the path to redemption reveals itself in mysterious ways. According to the National Institute of Health, there are over sixty clinical trials for cancer using gene therapy underway in the US--there are none underway to treat greed.",
  "genres": [
    "Fiction",
    "Thriller",
    "Science Fiction"
  ],
  "author": "Steve Hadden",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/39706500-genetic-imperfections"
}