{
  "title": "Louis Pasteur: The Life and Legacy of the Legendary French Scientist Recognized as the Father of Microbiology",
  "description": "*Includes pictures *Includes quotes about Pasteur's life and work *Includes online resources and a bibliography for further reading *Includes a table of contents “Do not let yourself be tainted with a barren skepticism.” – Louis Pasteur While it would be impossible to name every individual who has contributed to the ever-advancing field of science, it almost goes without saying that one of the most important was Louis Pasteur, father of microbiology and modern immunology. Apart from propelling the field of vaccination to new heights, this visionary scientist would also revolutionize a significant part of the beverage industry, and highlight the importance of sterilization. These are only some of the extraordinary achievements on Louis' glaring résumé, one so well-rounded and extensive that it beggars belief. Like many other polymaths, this inspirational figure has become an unwitting incendiary, and he has attracted his fair share of critics over the years. Though undoubtedly one of the greatest intellectuals to have ever graced the world of science, Louis was also a conveniently private man steeped in scandal, fraudulence, and secrecy, which only makes his story all the more riveting. In 1995, which UNESCO declared “The Year of Pasteur,” Louis Pasteur’s name was posthumously disgraced on an international stage as a controversy ensued that would have certainly caused him to roll in his grave. Pasteur had remained a secretive man until the day of his death, even ordering his family members to hold onto his private journals and never disclose them to anyone. Most chalked it up to the man's introversion, and his secrets might have indeed died with him if not for his last surviving descendant, who donated the scientist’s notes to the French National Library in the 1970s. Not only did Louis oversell some of his findings, he had, as it appears, unabashedly lied about the results of his experiments, and he has since been accused of stealing credit for some of his work. Concerning his rabies trials with the diseased mutts, for example, it was revealed that only 30 – a fraction of what Louis had reported – had been examined, and at least a third of them died from their illnesses. Most distressing of all, the “foolproof” vaccine he injected into the dogs was not the same vaccine he used on Joseph Meister, which meant that he had exposed the child to an untested treatment. On top of “regularly violat[ing] the standard conception of the scientific method,” as Princeton University historian Gerald Geison puts it, Pasteur’s work on anthrax, he claims, “is a clear example of scientific misconduct by the current definition.” Rumor has it that Jean-Joseph Henri Toussaint, a local veterinarian, was conducting research on the bacterium at the same time, but Toussaint used a chemical formula he personally designed instead of oxygen. Enraptured by the progress he was making, Toussaint visited Pasteur and made the mistake of confiding in him the recipe for the chemical formula. Before Toussaint knew it, Pasteur had appropriated his formula, and began using it in his public experiments. At the end of the day, whether or not Louis Pasteur is fully deserving of all the credit he’s received is still a matter of dispute, but one truth is incontestable. Pasteur revolutionized biology and ushered it into the modern era, and the institute erected in his honor continues to bring about tremendous advances that are slowly, but surely making the world a better place. Louis The Life and Legacy of the Legendary French Scientist Recognized as the Father of Microbiology examines the career that made Pasteur one of the 19th century’s foremost scientists.",
  "genres": [
    "Biography",
    "History"
  ],
  "author": "Charles River Editors",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/39715515-louis-pasteur"
}