{
  "title": "Another One",
  "description": "Get ready to laugh out loud, swoon, and fall in love with this new, fun, and sexy stand-alone novel from New York Times bestselling author Aleatha Romig. Demonstrating her versatility in writing, Aleatha revisits her lighter side that you loved in PLUS ONE. A complete stand-alone, ANOTHER ONE is the next big summer hit.   *Shana* Trevor Willis is sexy, sweet, and oh so fun. He’s also my best friend’s brother-in-law. That should mean he’s off-limits, or that I should be off-limits to him. Someone probably should have told us that before my best friend married his brother, before the morning of the wedding when we woke in each other’s arms with gaping holes in my memory. They didn’t. We did. The hilarious truth behind our crazy, secret adventure secured this handsome, off-limits man in my heart. But alas, life goes on. After our one secret night, we went back to our lives—our hardworking, solitary lives. And then it happened. My phone began to buzz. Each night with thousands of miles between us, we laughed, talked, and shared. And then, the phone stopped ringing. Before it did, I knew one thing... Our secret one had bloomed and blossomed, and now that our circumstances have changed I want another one!  *Trevor*  Shana Price is that one woman. You know, the one who suddenly makes the world more than a place to work, but also a place to live. Usually shy and awkward, in her presence I want to be more—I am more. I don’t even have to try. She’s my one. I knew it the moment I first met her. What followed simply confirmed it. The problem is the little hassle of the thousands of miles between us. I tried to make it work, but each phone call made it harder. (Yes, that is a pun) I couldn’t take it any more—and she became the one who got away. Now, everything has changed. Shana is back in the United States—all I have to do is make her see that her job isn’t the only reason to stay. That shouldn’t be a problem, right? From a secret one to another one!  Try Aleatha’s lighter side for a guaranteed smile—the perfect getaway. Have you been Aleatha’d? Aleatha's \"Lighter Ones\" are all stand alone lighter romances guaranteed to make you smile, possibly shed a tear, and definitely enjoy the ride! They may be read in any order.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Contemporary Romance",
    "Second Chance",
    "Humor",
    "Friends To Lovers"
  ],
  "author": "Aleatha Romig",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/39706741-another-one"
}