{
  "title": "The Tao of Bob",
  "description": "This memoir is the unlikely story of how, Bob, an 87 year-old midwestern farmer, moved from Mooresville, Indiana to Garfield, Texas in 2016, to live with Spike, a middle-aged woman with a punk rock sensibility and a ranch that fell into her lap. Spike had zero knowledge of how to run the ranch, an abandoned meth lab and junkyard when she bought it. Bob was exhausted from having spent years caring for his wife of 66 years, who died a long, slow death. Total strangers when they met, Bob and Spike fast became best friends. Bob, aka Pop, taught Spike how to run the ranch. Spike made Pop into a social media star. More importantly, he helped heal her from a shattered heart and the extreme trauma she experienced at the hands of Peter, a Narcissistic Abuser who led a secret double life full of darkness and deceit. It didn't take long for Bob to also take on the role of honorary father and re-parent Spike, helping her overcome the damage of childhood abuse, too. In Spike, Pop found a partner in crime. Left to their own devices, the two of them had more fun than a couple of teenagers whose parents had gone away for the weekend with the warning, \"Now you kids, don't get into trouble!\" They ate candy for dinner and did donuts in Bob's golf cart on the lawn. They discovered the healing properties of THC. They laughed their asses off. And together they discovered that, if you open your mind, you can discover True Love can be found in the most unlikely places. This collection includes interlocking pieces about their time together with a cast of characters including a horse with cancer, a flock of very funny chickens, Chuck Norris, snakes in the house, Weekend Vampires, lesbian brides, gospel singers, rock n' rollers, and a whole host of others. It's a story of deep pain, tremendous healing, and enduring love.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Spike Gillespie",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/39710938-the-tao-of-bob"
}