{
  "title": "The Poverty of Communism",
  "description": "One third of the world's population today lives under governments that consider themselves to be Marxist-Leninist. In many of these places, severe poverty was endemic in the years before Communist authorities came to power. Communist governments claim to have a special understanding into and effectiveness in dealing with problems of poverty. Marxist-Leninist rulers have been in power for nearly thirty years in Cuba, nearly forty years in China, and over sixty-five years in the Soviet Union. How do the poor fare in such places today? Western intellectuals often assume there is an inevitable tradeoff between bread and freedom under communism. What populations lose in the way of civil and political rights, they gain in social guarantees that protect them against material hardship. In The Poverty of Communism, Nick Eberstadt challenges this assumption and shatters it. He shows that Communist governments in a wide variety of settings have been no more successful in attending to the material needs of the most vulnerable segments of the populations they govern than non-Communist governments against which they might most readily be compared. Indeed, measured by the health, literacy, and nutrition of their people, Communist governments may today be less effective in dealing with poverty than are non-Communist governments. The Poverty of Communism is a pathbreaking investigation. In a series of separate studies, Eberstadt analyzes the performance of Communist governments in the Soviet Union, Eastern Europe, China, and Cuba. This is the first scholarly effort to assess the record of Communist governments with respect to poverty in a detailed and comprehensive fashion. Well written, carefully argued, and reflecting a sweeping range of knowledge, The Poverty of Communism will be of interest to specialists in the countries investigated as well as those concerned with comparative economic and political development. Above all, it gives testimony to the plight of voiceless populations about which all too little has been written from an objective standpoint.",
  "genres": [
    "Politics",
    "History"
  ],
  "author": "Nicholas Eberstadt",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3971316-the-poverty-of-communism"
}