{
  "title": "Three If by Sea",
  "description": "Amelia  Amelia has been with David forever, or at least it seems like forever. While their relationship was great for the first few years, everything is beginning to crumble. When things finally blow up, she's totally crushed.  Now she has a job opportunity in Scotland, just the journey she needs to get away from the Midwestern US and lick her wounds. Little does she know, she's about to meet not one, but two gorgeous European guys who know just how to get David out of her mind. But first, she's going to need to untangle one hell of a lot of drama between these fascinating men.  Adam  Adam is a man of few words, a dark past, and endless emotional depth, not to mention a body to die for. After setting down his roots in small-town Scotland, he's content to work at his small pub and try to forget the past.  He's been perfectly happy keeping it simple, but when Amelia enters his pub one fateful night, he knows in his bones that things are about to change for good.  Callum  After leaving his hometown where he attended school with Adam, Callum moved to Edinburgh for college. But the siren song of his friend Adam continues to gnaw at him, reminding him of what could have been despite their drama. When he comes back to visit, he gets a double dose of hotness: Adam is still there in all of his sensitive, muscular brooding, but now there's a new woman in town and she's impossible to ignore with her gorgeous face and beautiful mind.  These three people have played the game of love and paid dearly for it. Now they're inextricably drawn together, but they're playing with emotional fire. Will they be consumed by the flames or will they find just the healing they need to patch up their broken hearts?  Three if by Sea is a scorching hot Bisexual / Menage MMF standalone romance with VERY steamy scenes, a beautiful small European town, and a HEA ending with no cliffhangers!",
  "genres": [
    "M M F",
    "LGBT",
    "Contemporary Romance",
    "Romance"
  ],
  "author": "Nicole Stewart",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/39716730-three-if-by-sea"
}