{
  "title": "The Mountain of the Women: Memoirs of an Irish Troubadour",
  "description": "In an irresistible tale of a life lived fully, if not always wisely, Liam Clancy, of the legendary Irish group the Clancy Brothers, describes his eventful journey from a small town in Ireland in the 1930s into the heart of the New York music scene in the 1950s and ’60s.Following in the grand tradition of such Irish memoirs as Angela’s Ashes and Are You Somebody? , Liam Clancy relates his life’s story in a raucously funny and star-studded account of moving from provincial Ireland to the bars and clubs of New York City, to the cusp of fame as a member of Tommy Makem and the Clancy Brothers. Born in 1935, the eleventh out of as many children, young Liam was a naive and innocent lad of the Old Country. His memories of childhood include bounding over hills, streams, and the occasional mountain, getting lost, and eventually found, and making mischief in the way of a typical Irish boy.As an aimless nineteen-year-old, Clancy met a strange and wonderfully energetic lover of music, Ms. Diane Guggenheim, an American heiress. She and a colleague from America had set out to record regional Irish folk music, and their undertaking led them to Carrick-on-Suir in the shadow of Slievenamon, \"The Mountain of the Women,\" where Mammie Clancy had been known to carry a tune or two in her kitchen. Guggenheim fell for young Liam and swept him along on her travels through the British Isles, the American Appalachians, and finally Greenwich Village, the undisputed Mecca for aspiring artists of every ilk in the late 1950s.Clancy was in New York to become an actor. But on the side, he played and sang with his brothers, Paddy and Tom, and fellow countryman Tommy Makem, in pubs like the legendary White Horse Tavern. In the heady atmosphere of the Village, Clancy’s life was a party filled with music, sex, and McSorley’s. His friendships with then-unknown artists such as Bob Dylan, Maya Angelou, Robert Redford, Lenny Bruce, Pete Seeger and Barbra Streisand form the backdrop of the charming adventures of a small-town boy making it big in the biggest of cities.In music circles, the Clancy Brothers and Tommy Makem are known as the Beatles of Irish music. The band’s music continues to play on jukeboxes in pubs and bars, in living rooms of folk music fans, and in Irish American homes throughout the country. Liam Clancy’s lively memoir captures their wild adventures on the road to fame and fortune, and brings to life a man who never lets himself off the hook for his sins, and happily views his success as a blessing.",
  "genres": [
    "Memoir",
    "Ireland",
    "Music",
    "Biography",
    "Nonfiction",
    "History",
    "Audiobook"
  ],
  "author": "Liam Clancy",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/397160.The_Mountain_of_the_Women"
}