{
  "title": "Four Walls and a Passion",
  "description": "Four Walls and a Passion contains five of Luke Hartwell's best stories. In \"Hooves are a Horse’s Glue (But You Still Need a Nail for the Shoe),\" a high school senior in small town Arkansas finds a new boy in class on the first day of school--a handsome exchange student from Turkey whose presence in town causes a stir. As the friendship develops, hearts and minds are stirred as well. \"Blue South\" relates the reunion of two friends separated for twenty years while one was in prison. The reunification is haunting in many ways, as the narrator discovers truths he never knew. \"Nothing Strikes Back!\" and \"Space\" involve a younger boy infatuated with an older boy. Both stories are tender and beautiful and portray adolescent longing and older boy responsibility adeptly and honestly. \"Baby Self-Hate\" is an account of an unlikely friendship between two boys who meet in a group session, one attending over anger issues, the other there for help with his depression. The story itself is anything but depressing, with humor and sex dripping from the pages. As with his longer fiction, Hartwell here creates characters that stick with the reader long after the stories end. These remarkably-written stories, with their compelling narrative voices, are must-reads for those who appreciate moving short fiction like \"The Lost Boy,\" \"Brokeback Mountain,\" and Gide's \"The Prodigal Son.\"Publisher’s Luke Hartwell has spent the past two years rewriting all of his previously published books. As his publisher, Watersgreen House has debated how to handle the new editions, which we believe to be universally better than the old. Industry guidelines suggest that for minor changes in fiction titles, a new edition labeled “revised” will suffice, but for major changes, the work needs a new title. We have deemed that the majority of Luke’s books need new titles. Here, we will offer guidance to those customers who have read the majority of Luke’s previously published work.To begin, two early Hartwell works that were published not only under different titles but under a different name have been rewritten, given new titles, and added to Hartwell’s catalogue. This includes the book that remains his masterpiece, Memory and Madness, as well as his semi-autobiographical work Who You Are and Where You Come From. We believe the newly revised Memory and Madness is a must read, even for readers who have read the earlier version, which was titled Clicking Beat on the Brink of Nada in Europe and Cody in the U.S.A.The two new titles we believe Hartwell readers will want to read again (or listen to, as several of his titles are now available in audiobook format, with more to come) are Love Underneath and Space. Although the opening chapters of Love Underneath will sound familiar to those who read Hartwell’s Locomotives in Winter, Love Underneath is not the same book. Hartwell has used the opening chapters of Locomotives as a base, but the opening section has been expanded, with a new character added, and the second part of the book, while maintaining some similarity to Locomotives, contains an enormous amount of new material and a very different ending, one which we think readers will applaud.Hartwell also completely rewrote his novel Nathan’s Story to make it a stand-alone work not connected with Atom Heart John Beloved. The new work is titled Space and is available both as a single volume bearing that name and also as part of Hartwell’s collection of shorter fiction, Four Walls and a Passion. As with Love Underneath, the new book is much better than the old and contains a very powerful ending. With Love Underneath and Space, we feel readers will be missing a lot if they don’t experience the beautiful changes Hartwell has made to these books.- Michael Wilson, PublisherWatersgreen House",
  "genres": [],
  "author": "Luke Hartwell",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/39728256-four-walls-and-a-passion"
}