{
  "title": "Her Glass Heart",
  "description": "A short story prequel to the Messenger Chronicles series ~ coming soon.Draft excerpt:The new boy in the cell next to mine would be dead in a day.Dagnu barely spared the new arrival a glance as he walked the strip between the cells, silently appraising his stock behind their bars. He wore black today. Sometimes it was grey, sometimes a blue so dark it reminded me of Faerie’s night skies. Partially reinforced leather wrapped him from head-to-toe. In his hand, he carried a startle-prod. My back itched at the sight of its prongs, old scars puckering.I kept my gaze fixed on a crack in one of my fifteen bars, halfway between the floor and Dagnu’s hard eyes. Always the same crack. I used to have to lift my chin to look up at it, but I’d grown since then. Now, when I kneeled, the crack was eye level.Dagnu walked on. His boots clicked on the cobblestones, like hollow heartbeats.Some saru Dagnu liked, for no other reason than they were pleasing to look at, or they already bore the kind of bone structure that implied they might make impressive fighting specimens. Others, like the boy who had just arrived, Dagnu needed no more reason to hate them than they hadn’t knelt quickly enough, or they hadn’t averted their eyes when he had first examined them. Sometimes, it took nothing less than Dagnu's mood to determine whether a saru lived or died.In the corner of my eye, I saw the boy hug his knees closer to his chest and tuck in his chin. To speak with him would be a waste of breath. To look at him, would acknowledge he was here, and I had enough saru ghosts crowding my head. I didn’t need his too.Dagnu stopped outside my cell. I stared at the cracked bar. Behind it was his leather-clad thigh. A looped whip hung from his belt. Its ragged tails rested against the side of his thigh. When the winterland fae brought their storms to the city, the cold air tightened long-healed lashing scars made by that whip.“You,” he said.A tiny thrill skittered down my spine. I dragged my gaze up the proud figure he cut. The fae were all so tall and lean, it made them fast and deadly, made them all look down on us, but Faerie had crafted Dagnu into a fae as strong and unyielding as a guardian’s named sword.Dagnu never faltered. He never hesitated. I had heard through saru whispers that he had once been formidable in battle and I believed it.He looked down on me now, his eyes cold, his lips thin, and I felt the weight of his expectations.“You and the new one fight at daybreak.”I bowed my head in acknowledgment.The boy in the cell next to mine jerked his head up.I knew he wouldn’t live beyond a day, because I would be the one to kill him.***Her Glass HeartMessenger Chronicles Prequel© Pippa DaCosta 2018Work in progress.Coming soon.Publication date subject to change.",
  "genres": [
    "Romance",
    "Reverse Harem",
    "Fantasy"
  ],
  "author": "Pippa DaCosta",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/39722433-her-glass-heart"
}