{
  "title": "Compassionate Artificial Superintelligence AI 5.0",
  "description": "The book defines the concept of Compassionate Artificial Superintelligence AI 5.0. The book explains how the emerging technologies like Internet of things (IoT), Drone, Brain-Computer-Interface, Blockchain, Big data can be used with deep learning and other modern artificial intelligence (AI) architectures for the ultimate level of joint evolution of human and machine superintelligence. Humans and AI systems are co-evolving. Gradually they are becoming co-dependent. The gaps between human and AI systems are reducing. Establishing heart to heart communication is a must. Tomorrow's AI based systems must be able to understand humans from its depth and not just fulfill the surface level requirements. Sensitivity towards human pain, mistakes, and sufferings must be the part of the evolving new AI systems.Serving humanity intelligently is held up as the “gold standard” of AI based systems. But, with the emergence of new technologies and AI systems with bio-metric data storage, surveillance, tracking and big data analysis, humanity and the society is facing a threat today from evilly designed AI systems in the hands of monster governments and irresponsible people. Humanity is on the verge of digital slavery. Now the primary requirement of a AI based system is that not only it should serve humanity but also should not do any harm to the human liberty, society, environment and the humanity at large. Moreover, AI should act morally, socially, responsibly and compassionately. Dr. Ray calls it Compassionate Artificial Superintelligence or \"AI 5.0\", which empowers humanity and machine with super-intelligence, super-creativity and super-compassion, which will help humanity and machine to reach new levels of evolution of consciousness. Such compassionate intelligent systems would be a boon to the human society rather than being an evil force.To obtain maturity in new AI systems, AI must focus on solving social issues intelligently. Solving the social issues like terrorism, loneliness, digital slavery, corruption and social inequality must be the part of the new compassionate AI systems. Human freedom and empowerment should be one of the primary criteria. In this book Dr. Ray says that compassionate artificial superintelligent (CAS) system will have the potential to free the humanity from corruption and other evils. The real challenge is how to digitize and incorporate the human values like compassion, forgiveness, bravery, morality, love and creativity in AI based systems. In this book Dr. Ray explains compassionate artificial intelligence in depth. The book provides the blueprint, directions, frameworks and strategies to develop such compassionate artificial superintelligent systems in coming days.",
  "genres": [
    "Artificial Intelligence",
    "Inspirational",
    "Science"
  ],
  "author": "Amit Ray",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/39716156-compassionate-artificial-superintelligence-ai-5-0"
}