{
  "title": "The Occult in Russian and Soviet Culture",
  "description": "A pioneering, richly interdisciplinary volume, this is the first work in any language on a subject that has long attracted interest in the West and is now of consuming interest in Russia itself. The cultural ferment unleashed by the collapse of the Soviet Union reawakened interest in the study of Russian religion and spirituality. This book provides a comprehensive account of the influence of occult beliefs and doctrines on intellectual and cultural life in twentieth-century Russia.Bernice Glatzer Rosenthal's introduction delineates the characteristics of occult cosmology which distinguish it from mysticism and theology, and situates Russian occultism in historical and pan-European contexts. Contributors explore the varieties of occult thinking characteristic of prerevolutionary Russia, including Kabbala, theosophy, anthroposophy, and the fascination with Satanism. Other contributors document occultism in the cultural life of the early Soviet period, examine the surprising traces of the occult in the culture of the high Stalin era, and describe the occult revival in contemporary Russia. The volume includes bibliographical essays on Russian occult materials available outside Russia.Contributors:  Mikhail Agursky, Hebrew University; Valentina Brougher, Georgetown University; Maria Carlson, University of Kansas; Robert Davis, New York Public Library; Mikhail Epstein, Emory University; Kristi Groberg, North Dakota State University; Irina Gutkin, UCLA; Michael Hagemeister, Ruhr University, Bochum; Linda Ivanits, Pennsylvania State University; Edward Kasinec, New York Public Library; Judith Deutsch Kornblatt, University of Wisconsin; Hakan Lovgren, Independent Scholar; Bernice Glatzer Rosenthal, Fordham University; William F. Ryan, Warburg Institute, London; Holly Denio Stephens, University of Kansas; Anthony Vanchu, University of Texas, Austin; Renata Von Maydell, Munich University; George Young, Independent Scholar",
  "genres": [
    "History",
    "Russia",
    "Nonfiction",
    "Occult",
    "Religion",
    "Mythology"
  ],
  "author": "Bernice Glatzer Rosenthal",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/1229858.The_Occult_in_Russian_and_Soviet_Culture"
}