{
  "title": "Same Bed Different Dreams",
  "description": "A wild, sweeping novel that imagines an alternate secret history of Korea and the traces it leaves on the present—loaded with assassins and mad poets, RPGs and slasher films, K-pop bands and the perils of social media.In 1919, far-flung Korean patriots establish the Korean Provisional Government to protest the Japanese occupation of their country. This government-in-exile proves mostly symbolic, though, and after Japan’s defeat in World War II, the KPG dissolves and civil war erupts, resulting in the North-South split that remains today.But what if the KPG still existed now, today—working toward a unified Korea, secretly harnessing the might of a giant tech company to further its aims? That’s the outrageous premise of Same Bed Different Dreams, which weaves together three distinct narrative voices and an archive of mysterious images and twists reality like a kaleidoscope, spinning Korean history, American pop culture, and our tech-fraught lives into an extraordinary and unforgettable novel.Early on we meet Soon Sheen, who works at the sprawling international technology company GLOAT, and comes into possession of an unfinished book authored by the KPG. The manuscript is a mysterious, revisionist history, tying famous names and obscure bit players to the KPG’s grand project. This strange manuscript links together figures from architect-poet Yi Sang to Jack London to Marilyn Monroe. M*A*S*H is in here, too, and the Moonies, and a history of violence extending from the assassination of President McKinley to the Soviet downing of Korean Air Lines Flight 007.Just as foreign countries have imposed their desires on Korea, so too has Park tucked different dreamers into this sprawling bed of a novel. Among them: Parker Jotter, Korean War vet and appliance-store owner, who saw something--a UFO?--while flying over North Korea; Nora You, nail salon magnate; and Monk Zingapan, game designer turned writing guru. Their links are revealed over time, even as the dreamers remain in the dark as to their own interconnectedness. A thrilling feat of imagination and a step forward from an award-winning author, Same Bed Different Dreams begins as a comic novel and gradually pulls readers into another dimension—one in which utopia is possible.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Science Fiction",
    "Literary Fiction",
    "Historical",
    "Speculative Fiction",
    "Asia"
  ],
  "author": "Ed     Park",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/122993405-same-bed-different-dreams"
}