{
  "title": "Territories of Difference: Place, Movements, Life, Redes",
  "description": "In Territories of Difference, Arturo Escobar, author of the widely debated book Encountering Development, analyzes the politics of difference enacted by specific place-based ethnic and environmental movements in the context of neoliberal globalization. His analysis is based on his many years of engagement with a group of Afro-Colombian activists of Colombia’s Pacific rainforest region, the Proceso de Comunidades Negras (PCN). Escobar offers a detailed ethnographic account of PCN’s visions, strategies, and practices, and he chronicles and analyzes the movement’s struggles for autonomy, territory, justice, and cultural recognition. Yet he also does much more. Consistently emphasizing the value of local activist knowledge for both understanding and social action and drawing on multiple strands of critical scholarship, Escobar proposes new ways for scholars and activists to examine and apprehend the momentous, complex processes engulfing regions such as the Colombian Pacific today.Escobar illuminates many interrelated dynamics, including the Colombian government’s policies of development and pluralism that created conditions for the emergence of black and indigenous social movements and those movements’ efforts to steer the region in particular directions. He examines attempts by capitalists to appropriate the rainforest and extract resources, by developers to set the region on the path of modernist progress, and by biologists and others to defend this incredibly rich biodiversity “hot-spot” from the most predatory activities of capitalists and developers. He also looks at the attempts of academics, activists, and intellectuals to understand all of these complicated processes. Territories of Difference is Escobar’s effort to think with Afro-Colombian intellectual-activists who aim to move beyond the limits of Eurocentric paradigms as they confront the ravages of neoliberal globalization and seek to defend their place-based cultures and territories.",
  "genres": [
    "Anthropology",
    "Sociology",
    "Geography",
    "International Development",
    "Ethnography"
  ],
  "author": "Arturo Escobar",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/3973381-territories-of-difference"
}