{
  "title": "#IMomSoHard",
  "description": "In their highly-anticipated first book, the hilarious mom duo with millions of followers explores all the ridiculous shit you’re expected to do to keep multiple humans alive and happy-ish, and celebrates the love for the friends who get you through it.Kristin Hensley and Jen Smedley, the creators of #IMomSoHard, are just like you and your best mom friend, only funnier and with more wine. Perhaps you’ve seen one of their insanely popular videos musing on everything from impractical swimsuit fashions to “Things I Found in My Bra.” Or maybe you’ve gone to one of the shows on their sold-out tour, hailed as “monster truck rallies for moms.” Or you might have just taken a break from mom-ing so hard yourself and decided to read some adult words for a few minutes. Did you pour yourself some wine?This is not a self-help book. Kristin and Jen know that you probably didn’t get to shower today and that the last thing you need is advice on all the stuff you’re doing wrong. Instead, Kristin and Jen talk nipple hair, sex after marriage, Mom-bods, and their unhealthy obsession with Khal Drogo from Game of Thrones. #IMomSoHard is packed with the back-and-forth laugh-out-loud best-friend banter that Kristin and Jen are known for, with plenty of real talk about post-partum depression, bullying, and the dark thoughts that plague every mom. Throughout it all, they know the ups and downs of motherhood often have nothing to do with your kids—it’s the female friendships and solidarity you have with other moms that makes it all worthwhile.#IMomSoHard is like a long, funny, gab session with your best mom friends. Kristin and Jen know 6:00–8:00 pm is the worst time to call you. They know not to harass you when you show up to a playdate in a free t-shirt you got from the dentist. They won’t give pep talks, but they will talk you down from the motherhood ledge, because, congrats: you’re passing with a “C”—and that’s all any of us can hope for.Duration: 07:26:59",
  "genres": [
    "Nonfiction",
    "Parenting",
    "Humor",
    "Audiobook",
    "Memoir",
    "Adult",
    "Book Club"
  ],
  "author": "Kristin Hensley",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/39731945-imomsohard"
}