{
  "title": "I Am Sustainability: How The Human Body Can Save The Planet",
  "description": "E.J. Wensing is the founder of Ecosphere Net (www.ecosphere.net). Based out of St. John in the US Virgin Islands, we are a global network providing powerful cross-cultural education for personal and global sustainability. This book introduces a new approach to global sustainability, one that links conversation, action and research in a continuous cycle of exploration and discovery. The first part of this approach is called I Am Sustainability. It is a curriculum for personal and global sustainability that we continually create and recreate together across all cultures of the world. This book starts the I Am Sustainability conversation, action and research with an opening argument that describes how all of the human impediments to global sustainability begin in a single human problem, that is, the psychology of the currently disproportionate human need to belong to competitive social groups. While competition can bring out the best in us, it also brings out the worst in us. For instance, it results in our overconsumption and exploitative behaviors toward the environment and other humans. Who we are, our \"self\", is almost entirely defined, maintained and lost in the competitive social groups we chose to belong to. As described in this book, the best way to sustain the self is to ground our individuality in the body. An individual in a healthy balance between their \"self\" in their body and their group is also less likely to be exploitative of others and the environment. So you get your self and save the planet too! At Ecosphere Net we are teachers, graduate students, therapists, scholars, physicians, professors and people who just want to make a positive difference regarding sustainability; both human and environmental. I invite you to read this book, visit us at www.ecosphere.net and join us in the I Am Sustainability conversation, action and research to save the planet.",
  "genres": [],
  "author": "Enrico J. Wensing",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/3975055-i-am-sustainability"
}