{
  "title": "Foothills Fae Academy: Book One",
  "description": "This book has multiple POVs and is quite lengthy. If you enjoy multiple viewpoints and don't mind a longer read, you may enjoy it. However, this one will not be for you if you prefer short books or one or two POVs, and you may want to find another book to read. I'm putting this warning here now so you're not surprised by the length or the POVs, and you can instead, find a book that would be more enjoyable for you. The first book reads like middle grade, but the characters mature with each book. The last two books, in particular, will be more mature, so discretion is advised when reading this series because this book is the most innocent of the four.This book will be leaving Kindle Unlimited at the end of June.Please read the trigger warning and disclaimer at the front of the book just in case you don't want to read it with the subject matter.Welcome to Foothills Fae Academy, where four thirteen-year-old students embark on a journey to master the power of the Earth, Air, Fire, and Wind. Ben, Amber, Ellen, and Michael forge a strong bond as they navigate the challenges of the school, but they soon realize that their training goes beyond preparing for adulthood – dangerous Dark Magic Wielders now threaten their world. As the four friends hone their abilities and embrace their true Fae potential, Ben and Amber discover they possess a special gift that puts them in grave danger.Set in 1999, this thrilling fantasy adventure follows their quest to defend against the malevolent Dark Magic Wielders while honing their skills as aspiring Fae. Join them as they prepare to face an epic battle and unravel the mysteries that lie within the magical realm.This is a coming-of-age story where the characters start at thirteen in the first book and mature into adults by the last one. The series leans more towards New Adult (NA) than Young Adult (YA) due to the content in the last two books, which might be inappropriate for certain YA age groups. While the first two books fit YA, the rating is specifically for the last two books, where the characters are adults, and I've written them to reflect that progression. Reader discretion is advised, especially for younger readers.Book Three could also be released soon.",
  "genres": [
    "Fantasy"
  ],
  "author": "Callie Woodridge",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/122993525-foothills-fae-academy"
}