{
  "title": "The War Planners, The War Stage, Pawns of the Pacific",
  "description": "The War PlannersA CIA operative in Shanghai transmits two earth-shattering revelations to his contacts in Langley, and then goes missing. First, the U.S. government has been infiltrated with Chinese spies. Second, an inner circle of Chinese leaders have set in motion plans to do the unthinkable - to invade the United States of America. Lena Chou is one of the few U.S. officials who knows the truth. She must put together a top-secret task force to help America’s government prepare for what will come. Now, in order to covertly plan the U.S. defense, Lena has gathered a Red Cell, a group of experts that will plan how China could best attack it. David Manning is one of those experts. After he is abruptly taken to the covert island base where the Red Cell is being held, Lena presents the group with evidence of China’s imminent attack. But while the Red Cell plans for war, David suspects that something about this gathering of minds is terribly wrong…The War StageA US Navy destroyer sinks an Iranian patrol craft during a controversial exchange in the Persian Gulf. With tensions soaring between the two nations, an Iranian politician secretly contacts the CIA with a chilling revelation involving the Chinese. Chase Manning is a rugged ex-SEAL working for the CIA's Special Operations Group in the Middle East. Now, he is tasked with uncovering the truth behind the Iranian claims before it is too late. But in the midst of battling deadly assassins and uncovering the layers of intrigue, Chase discovers that his own brother, David Manning, is right at the heart of the conspiracy.Pawns of the PacificA nation on the brink of war. A conspiracy that threatens the globe. And one military family, caught in the middle, fighting for freedom.While the United States is preparing for war with Iran, Chinese billionaire Cheng Jinshan and his wicked spy, Lena Chou, are moving their pieces on the board. Deception and misinformation are everywhere. Now, in order to save America, the leaders in the CIA and Pentagon have set up a secretive task force at the CIA headquarters. Their mission: to thwart Jinshan's plans, and reveal the truth to the world.Each member of the Manning family has a critical role to play. David Manning is brought in to the CIA task force. Chase Manning is sent to team up with a US Marine Corps special operations unit. Admiral Manning leads the USS Ford Carrier Strike Group, filled with America's latest and greatest naval technology. And Lieutenant Commander Victoria Manning is the officer in charge of a helicopter detachment on the navy destroyer, the USS Farragut - the only ship that stands in the way of a Chinese onslaught.",
  "genres": [
    "Fiction",
    "Military Fiction",
    "War",
    "Thriller",
    "Action",
    "Adventure"
  ],
  "author": "Andrew  Watts",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/39730863-the-war-planners-the-war-stage-pawns-of-the-pacific"
}