{
  "title": "Death Cursed",
  "description": "The monsters at the door can be ignored. The monster in the mirror, however…★★★★★ “Here is another book that just grabs you, like watching an elephant stampeding at you.”★★★★★ “…the overall feel was intense, intriguing and incredible.”★★★★★ “I cannot wait to see what happens next.”★★★★★ “Complex and superb.”Madeline is cursed. A touch from her, even accidental, can kill, and she’s haunted by the victims she never meant to hurt. Alone, isolated, and remorseful, she thinks life can’t get any worse--until she’s kidnapped in the middle of the night and thrown into a secret world more twisted than her darkest nightmares.The Vaettir claim to be the children of the gods, created by the fates themselves, and tell her she’s one of them--and that they can help her control her abilities. But not everything is as it seems, not all gods are good, and the dark powers surrounding Madeline are no exception. She finds herself in the middle of an ancient search for a dangerous and all-powerful charm, one that has the power to kill all humans and bestow its bearer dominion over all. Amid the secrets and danger is Alaric, a deadly cat shifter, who’s as mysterious as he is alluring.When the Vaettir’s plans come to light and Madeline is betrayed, she embarks on a quest to find the charm herself, with the fate of the world hanging in the balance. Her dark gifts may just be the key to everything, but will she be able to accept them in time, or will the Vaettir destroy mankind, and inherit the earth?Find out in Death Cursed, the first book in a series sure to please fans of Bella Forrest’s Shade of Vampire and Ilona Andrew’s Kate Daniels series.Discover the underworld of the Vaettir, gods and monsters, secrets and lies, and a temptation equal parts irresistible and deadly...",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Amazon",
    "Magic",
    "Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Sara C. Roethle",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/39780556-death-cursed"
}