{
  "title": "Eichmann in Jerusalem: Ein Bericht von der Banalität des Bösen",
  "description": "Der Prozeß gegen SS-Obersturmbannführer Adolf Eichmann 1961 in Jerusalem war neben den Nürnberger Kriegsverbrecherprozessen die wichtigste Gerichtsverhandlung gegen Schergen des NS-Regimes. Spätestens mit der Vollstreckung des Todesurteils gegen Eichmann begann auch eine Diskussion um die Sinnhaftigkeit der Aufarbeitung der Nazi-Verbrechen durch juristische Mechanismen. Hannah Arendt hat den Prozeß selbst miterlebt und seine Unterlagen dazu genutzt, ihr eigenes Resümee über den Holocaust und die Person Adolf Eichmann mit seiner Rolle bei der Judenverfolgung zu ziehen. Heraus kam dabei ein Buch, das bis zum heutigen Tag nichts an Gültigkeit oder Bedeutung verloren hat.Eichmann steht prototypisch für viele der verbrecherischen Nazi-Gefolgsleute, die mit oder ohne ideologischer Verblendung, dafür aber immer mit voller Obrigkeitshörigkeit doch stets nur Befehle ausführten. Irgendeine Form der Reue geht ihm ab, denn \"Reue ist etwas für kleine Kinder\", so Eichmann in den Verhören. Dabei ist Reue und die daraus resultierende Selbsterkenntnis der vielleicht wichtigste Punkt einer sinnvollen Aufarbeitung. Hinter der Maske des vermeintlichen Normalos Eichmann verbirgt sich tausendfacher Schrecken -- ein Schrecken, den man auch heute noch an so manchen Stellen des Erdballs in den Personen scheinbar normaler Bürger wiederfinden kann.Arendts Buch ist zudem eine über die persönliche Ebene hinausgehende Zusammenfassung des Holocaust, von den ersten Vertreibungen bis hin zur fürchterlichen Endlösung, denn all dies war Gegenstand des Prozesses. Bei aller berechtigter Kritik -- so gibt es heute sicherlich ausführlichere Bücher über die Historie des Holocaust -- darf man ihr eigentliches Anliegen nicht übersehen. Es ging ihr gerade um die im Untertitel aufgeführte Banalität des Bösen, um die Betrachtung der Person, die das Töten verwaltet und plant. Und genau diese Betrachtungsweise packt den Leser, denn bei der Analyse der Ereignisse im Dritten Reich sollte man immer auch die einzelnen Täter berücksichtigen. Die Erkenntnis, daß normale Menschen zu Greueltaten solchen Ausmaßes fähig sind, darf nie in Vergessenheit geraten, und so behält dieses Buch auch in Zukunft seinen Stellenwert als Warnung wie auch als Mahnmal.",
  "genres": [
    "History",
    "Nonfiction",
    "Philosophy",
    "Politics",
    "Holocaust",
    "Psychology",
    "Classics"
  ],
  "author": "Hannah Arendt",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/3975255-eichmann-in-jerusalem"
}