{
  "title": "Perry and Her Princes",
  "description": "Perry's lineage constitutes an only God knows how many times 'great' grandfather who settled in Tennessee after the potato famine in Ireland, and a great grandmother who escaped the Nazis before the war. She's farmer stock. And has the hips to prove it. Still, lineage doesn't mean much when it comes to friends. Especially college friends. So, when a Prince of Veronia comes to Boston, attends her college, and just happens to make her acquaintance, who's she to judge when a friendship is born? And who's to question why, when years later, they're more like family than anything else? Even if that's way more platonic than she'd like. She'd hump George DeSauvier six ways 'til Sunday if he'd let her, but, as far as she can tell, he only sees her as a 'chum'. Little does she know. George DeSauvier is the second in line to the throne of Veronia, a tiny country, nestled between Italy, France, and Austria. Being a royal means nothing to him, not with the price it comes at, but to his brother? The heir? It's everything. Back in the day, Edward DeSauvier had been a wild child, and together, they'd discovered they had a penchant for sharing the women they bedded. All these years later, George has decided it's time to start up that little habit of theirs again. With Perry in the middle. Trouble is, Perry doesn't even know George wants her. Never mind his brother. And when a cousin of theirs, Xavier, accidentally gets thrown into the mix, Perry's suddenly up to her eyeballs in DeSauvier royals. It's a hard life for some being surrounded by regal hunks, that is, of course, until the doodah hits the fan, and anti-Royal sentiment reaches a peak in Veronia once more. Will fear of loss make Perry take the next step into a very complicated future? Or, will the sheer need she feels for three very different men be all that's required...? Find out in PERRY AND HER PRINCES.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers",
    "Royal Romance",
    "Erotica"
  ],
  "author": "Serena Akeroyd",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/39783339-perry-and-her-princes"
}