{
  "title": "Renegade Witch",
  "description": "\"Hell is empty, and all the demons are here.\"   All my life I've had the Sight. 'Seeing demons and talking to spirits' doesn't make the list of desirable traits in a foster kid, so instead of letting my foster family ship me off to an institution, I ran away at sixteen and I've been on my own in Chicago for three long years.  I've finally made a quiet life for myself selling magical items on the black market here, so I most definitely don't want to be noticed by a cabal of dangerous men with knives and guns who toss me in their murder dungeon.  And they're not the only ones looking for me. I narrowly escape my prison only to fall into the lives of three gorgeous, sexy boys more dangerous to me than my kidnappers, but for very different reasons...  Adrian the leader, the golden boy, with a face that would make Michelangelo weep Dominic the guarded cynic, with scars that won't heal Noah the light-hearted dreamer  They're my Bloodsworn and I'm their Witch. Together, we save the city from invading hordes of demons. I'm the source of their power, and theirs to protect. And that goes both ways.  There's just one problem: I might be falling for them. That's right, all of them.  Then there's the boy I keep dreaming about...the boy with the voice like smoke and eyes like midnight--eyes that haunt me. He's being kept in chains and tortured by the same enemies who want me dead. He's a violent contradiction: vicious and beautiful, frightening and tender. And I'm the only one who can save his life.  But I can't even be sure that he's real.  With danger snapping at my heels, demons invading the city, and my enemies two steps ahead of me at every turn...  My name is Sophia Landry, and I might not be getting out of this one alive.    Renegade Witch is a TRUE slow burn Reverse Harem Romance with one badass witch, her three harem and plenty of action, steamy scenes and jaw-dropping reveals to keep you turning the pages!",
  "genres": [
    "Reverse Harem",
    "Magic"
  ],
  "author": "T.S. Bishop",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/39780009-renegade-witch"
}