{
  "title": "His Boy",
  "description": "A Gay Romantic ComedyCharlie Stone has problems.He’s just found his boyfriend and his new BFF in bed together, and that’s only because he failed to show up for his fortnightly back, crack and sack wax. Furious, he speeds away from the gates of his luxury home and life into the unknown. When he finds himself stranded on the side of the road in a remote village, his future looking bleak, his dreams wasted on a fairy tale that turned out to be a nightmare, he doesn’t expect the handsome but shaggy-looking bookshop owner, Nathan Marshall, to come to his rescue. A Divine Intervention if Charlie ever saw one.But the village is foreign land to glamour puss Charlie, who’s more at home in the bustling city, shopping for the latest trends. getting his hair coiffed and his nails buffed by his best friends, glamour girls Trinny, Kylie and Sasha than he is trekking through muddy hills in jeans and wellies. And Nathan’s never even seen the inside of a beauty salon, let alone considered having that tumbleweed on his chest waxed. How on earth can a queen even begin to craft himself into something fabulous in such dire circumstances?Hope seems lost until Charlie discovers that an amateur dramatics group are looking for budding stars to fill in two of their starring roles at the last minute. Could the village offer more than babbling streams, scenic moorland and the smell of horse manure? Could it offer a chance for Charlie to claim back the dreams he thought he’d lost? And, more importantly, could an unlikely romance be brewing on the horizon, even when the dark characters from this unlikely pairing’s pasts come back to make matters worse for them?A darkly comic look at love, death, dysfunctional family, emotional trauma and finding yourself, with a huge cast of characters. More than a romance. A story of self discovery. Gay romance. Gay romantic comedy.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Humor",
    "LGBT",
    "Comedy",
    "Queer"
  ],
  "author": "Dean Cole",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/39778740-his-boy"
}