{
  "title": "Colorado Takedown",
  "description": "Suspense-filled. Romantic. Nothing will stop a McAllister cowboy from protecting the woman he loves.  Hannah Hudson has a distorted view of home and family due to her odd, impoverished upbringing. She longs for her own Happily Ever After, but she’s willing to settle for escaping the Phoenix heat and her dreary job. Then, along comes a miracle. Luck crash-lands in her lap. With a new, improved To Do List, and a heart filled with hope, she heads for a ranch in the cool hills of Colorado. At last, she’s loving life.  Shortly after arriving, her luck runs out. A tragic accident occurs, and a troubling reality sets her reeling. She’s alone. There is no Dairy Queen, no Circle K, not even a hospital along the winding mountain road that links the remote ranch to the nearest town. The seclusion of her new world is frightening.  Reluctantly, she teams up with Trace McAllister, a wise, local cowboy, who helps her learn the ropes around the ranch and in the bedroom. Love is in the Rocky Mountain air. A brilliant cattle dog and an intuitive palomino horse add fun and excitement to their days. But their fast-blooming chemistry is fraught with conflict, secrets, and a relentless, unidentified evil.  WHAT READERS ARE SAYING …  “The descriptions of Hannah’s interactions with Oatie, the dog, and Lewissa, the horse, were delightful and satisfying.”  “There was a bit of Bonanza in the story that appealed to my TV past, especially in the scenes that took place at the Lucky Seven.”  “An excellent, believable account of one character’s claustrophobia.”  “Loved the main characters, Trace and Hannah, and the supporting characters were fascinating and unusual, adding twists and turns.”",
  "genres": [
    "Novels",
    "Contemporary",
    "Book Club",
    "Romance",
    "Drama",
    "Contemporary Romance",
    "Westerns"
  ],
  "author": "Cricket Rohman",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/39789257-colorado-takedown"
}