{
  "title": "Dangerous Conjurings",
  "description": "Eighteen-year-old Leah Sullivan lost both her brother and her childhood sweetheart on the same Civil War battlefield. Left a spinster, she dutifully cares for her parents while trying to survive on their farm in Georgia after the South’s surrender. With her now-barren mother believing a fertility spell to be the only way she can bear another family heir, Leah acts in secret to obtain the mojo from the dangerous conjurer Kali Despierre. When handsome veteran Marcus Quinn comes calling to deliver her brother’s last words, sparks fly between the mysterious soldier and lonely Leah. To her delight, Marcus accepts her father’s offer to remain as a hired hand. Although they are falling in love, Leah keeps from Marcus what haunts will her mother’s “conjured” babe be cursed? Her fears seem realized when Elijah is born with the birth sac covering his face. Suspicions plague such newborns, known as caulbearers. The strangeness of Elijah’s birth convinces Kali that she has conjured a special voodoo babe. She kidnaps him and heads to New Orleans, certain the Queen of Voodoo, Marie Laveau, will pay gold for him. Rumors abound that the Queen sacrifices infants to the voodoo gods on October 31, the Day of the Dead, only weeks away. Leah, with Marcus at her side, chases after Kali to save her brother from the voodoo underworld. The couple’s passion heats up while sleeping under the stars only inches apart and surrounded by peril. However, through a cruel twist of fate, Leah discovers the devastating secret about Marcus’s past that breaks her heart and jeopardizes her brother’s rescue. Will Leah’s love for Marcus be powerful enough to overcome his betrayal? Or will dangerous conjurings doom their future together?",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical Romance"
  ],
  "author": "Anne Armistead",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/39786133-dangerous-conjurings"
}