{
  "title": "Rebel Bear",
  "description": "Up-and-coming supermodel Hailey Crewe can’t wait to escape the limelight and return to the modest, anonymous lifestyle she once led. Escaping literally? That was never part of her plan. But when an unwanted suitor — and her scheming mother/manager — go a step too far with a surprise Hawaii wedding, Hailey becomes a bride on the run. Before she knows it, she’s not only being hunted by a greedy oil tycoon, but by his creepy security force, too. A good thing she bumps into her very own Lancelot at exactly the right time.  Bear shifter Timber Hoving is just another Special Forces vet slowly adjusting to island time. That is, until an irresistible stranger rushes into his meticulously organized world. Before Tim knows it, his human side is wrestling with temptation, and his bear is head-over-heels in love. But Hailey’s first encounter with shifters is a terrifying one, and Tim can’t reveal the truth about himself without losing her forever. Worse, sinister shifter forces are closing in, following a ruthless agenda of their own. They’ll stop at nothing to capture Tim’s destined mate — dead or alive.  Rebel Bear is a fast-paced, emotion-packed paranormal romance filled with yearning, sizzling passions, and forbidden love. Ready to be swept off to sunny Maui’s suspense-filled shifter side?   Maui just got hotter with this exciting new series of steamy, suspenseful paranormal romance!  ALOHA SHIFTERS: PEARLS OF DESIRE is a series of sizzling paranormal romances with adult content. No cliff hangers. Each story is a page-turner packed with action, emotion, and romance! If you like Magnum, PI and smoldering hot, alpha shapeshifters, you'll love these books! Each includes strong heroines, alpha heroes, werewolves and shapeshifters, billionaires, military romance, paranormal suspense, action-adventure romance, fantasy romance, and exotic, tropical locales!",
  "genres": [
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Paranormal Romance",
    "Supernatural",
    "Fantasy",
    "Suspense"
  ],
  "author": "Anna Lowe",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/39791720-rebel-bear"
}