{
  "title": "Go Find: My Journey to Find the Lost—and Myself",
  "description": "*An Apple iBooks bestseller in Biographies and Memoirs*A Bend Magazine Pick of 10 Best New Books for Fall“A love story about a woman and her amazing rescue dog. A tale of exciting, life-changing adventures.” -- Kat Martin, New York Times bestselling authorSomewhere between hunting for gold in Latin America as a geologist and getting married to a new husband, thirty-three-year-old Susan Purvis loses her way.Susan comes to believe that a puppy and working on ski patrol at the last great ski town in Colorado will improve her life. When she learns about avalanches that bury people without warning, she challenges “What if I teach a dog to save lives?” This quest propels her to train the best possible search dog, vowing to never leave anyone behind.With no clue how to care for a houseplant, let alone a dog, she chooses a five-week-old Labrador retriever, Tasha. With the face of a baby bear and the temperament of an NFL linebacker, Tasha constantly tests Susan’s determination to transform her into a rescue dog. Susan and Tasha jockey for alpha position as they pursue certification in avalanche, water, and wilderness recovery. Susan eventually learns to truly communicate with Tasha by seeing the world through her dog’s nose.As the first female team in a male-dominated search-and-rescue community, they face resistance at every turn. They won’t get paid even a bag of kibble for their efforts, yet they launch dozens of missions to rescue the missing or recover the remains of victims of nature and crime.Training with Tasha in the field to find, recover, and rescue the lost became Susan’s passion. But it was also her circumstance—she was in many ways as lost as anyone she ever pulled out of an avalanche or found huddled in the woods. “Lostness” doesn’t only apply to losing the trail. People can get lost in a relationship, a business, or a life. Susan was convinced that only happened to other people, until Tasha and a life in the mountains taught her otherwise.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Animals",
    "Biography",
    "Outdoors",
    "Audiobook",
    "Dogs"
  ],
  "author": "Susan Purvis",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/39786728-go-find"
}