{
  "title": "The Iron Fin",
  "description": "A vampiric octopus hunting selkies. A torrid love affair. Traitors who prey on those closest to them in a bid for power.Isa McQuiston is caught between two worlds. Strange creatures are attacking her people, their injuries beyond her medical expertise. More than one fisherman has been tossed ashore by the waves, drained of blood, a severed tentacle piercing his flesh. To find answers, she must forge a cautious alliance with the outsider making inquiries… even if he does present an almost irresistible temptation.Dr. Alec McCullough, an injured naval officer, is restless and bored. Until his brother—an agent for the Crown—offers him an investigate a recent rash of unexplained octopus attacks. On the wet and windy Hebridean Isles, his every effort is met with resistance. Coaxing an attractive young widow—the local healer—to allow him to examine the latest victim only leads to further complications.A fusion of living and mechanical components, the creatures follow instinct, but also command. Together, they uncover layers of deceit, revealing traitorous tentacles that entangle both their lives. As those behind their creation callously sacrifice innocent lives in pursuit of their goals, Isa and Alec struggle to forge a future together while attempting to prevent a disaster of international proportions.THE IRON FIN is a story set in the Elemental Steampunk World, including The Elemental Steampunk Chronicles, Elemental Steampunk Tales, and Elemental Steampunk Stories. Steampunk adventure wrapped around a romance and threaded with biotechnology. Join USA Today bestselling author, Anne Renwick, as she takes you back into an alternate past.THE ELEMENTAL STEAMPUNK The Golden Spider, The Silver Skull, The Iron Fin, Venomous SecretsELEMENTAL STEAMPUNK A Trace of Copper, In Pursuit of Dragons, A Reflection of Shadows, A Snowflake at Midnight, A Ghost in Amber, A Whisper of Bone, Flight of the ScarabELEMENTAL STEAMPUNK The Tin Rose, Kraken and Canals, Rust and Steam",
  "genres": [
    "Steampunk",
    "Romance",
    "Fantasy",
    "Audiobook",
    "Historical",
    "Fiction",
    "Historical Romance"
  ],
  "author": "Anne Renwick",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/39798527-the-iron-fin"
}