{
  "title": "Front Row: Anna Wintour: The Cool Life and Hot Times of Vogue's Editor in Chief",
  "description": "From the New York Times bestselling author of Just Martha The Unauthorized Biography comes a scrupulously researched investigative biography that tells the inside story of Anna Wintour's incredible rise to powerFrom her exclusive perch front row center, glamorous Vogue magazine editor in chief Anna Wintour is the most powerful and influential style-maker in the world. Behind her trademark sunglasses and under the fringe of her Louise Brooks bob she determines whether miniskirts are in or out, whether or not it's politically correct to wear fur. She influences designers, wholesalers, and retailers globally from Seventh Avenue to the elegant fashionista enclaves of L'Avenue Montaigne and Via della Spiga. In the U.S. alone a more than $200 billion fashion industry can rise or fall on Anna Wintour's call. And every month millions of women-and men-read Vogue , and are influenced by the pages of the chic and trendy style wish-book that she has controlled with an iron hand in a not-always-so-velvet glove since fighting her way to the most prestigious job in fashion journalism.Anna Wintour's fashion influence extends to celebrities and because of it, Hillary Clinton underwent a drastic makeover and became the first First Lady to strike a pose on the cover of Vogue in the midst of Monicagate; Oprah Winfrey was forced to go on a strict diet before Wintour would put her on Vogue 's cover. And beauties like Rene Zellweger and Nicole Kidman follow Anna Wintour's fashionista rules to the letter.Now in her mid-fifties, as she nears her remarkable second decade at the helm of Vogue , comes this revealing biography that will shock and surprise both Anna's fans and detractors alike. Based on scores of interviews, Front Row unveils the Anna Wintour even those closest to her don't know. Oppenheimer chronicles this insecure and creative powerhouse's climb to the top of the bitchy, competitive fashion magazine world, showing up close, as never before exposed, how she artfully crafted and reinvented herself along the way.She's been called many things-\"Nuclear Wintour,\" by the British press, \"cold suspicious and autocratic, a vision in skinniness,\" by Grace Mirabella, the editor she dethroned at Vogue , and the \"Devil\" by those who believe she's the inspiration for a recent bestselling novel written by a former assistant.Included among the startling revelations in Front Row * Anna's \"silver spoon\" childhood spent craving time with her father.* Anna's rebellious teen years in London, obsessed with fashion, night-clubbing and dating roguish men.* Anna's many tempestuous romances.* Anna's curious marriage to a brilliant child psychiatrist, her role as a mother, and the shocking scandal that led to divorce when she had an affair with a married man.",
  "genres": [
    "Fashion",
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Memoir",
    "Autobiography"
  ],
  "author": "Jerry Oppenheimer",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/397940.Front_Row"
}