{
  "title": "Beg For Mercy",
  "description": "Two men fight to prove their innocence. A cop and a convicted murderer. One of them is lying.Fifteen years ago, local crime boss Duncan Usher was sent to prison for killing his wife. A young Detective Solomon Gray was first at the scene and instrumental in putting Usher away. But now Usher is out, released on a technicality.Usher has held a grudge all this time, and he won't stop until he gets revenge on the dirty cop who framed him all those years ago. Usher wants Gray’s help, acting as an inside man within the police. Gray refuses, but Usher has leverage – information on Gray's missing son. Gray agrees to work with Usher because he’ll do anything to find his son. But Gray is taking a huge risk; playing both sides of the game and carrying out his own investigation into what really happened fifteen years ago.Can Gray get to the truth? Or will the past bring Gray down?Set in the once grand town of Margate in the south of England, the now broken and depressed seaside resort becomes its own character in this dark detective thriller, perfect for fans of Ian Rankin, Stuart MacBride, and Peter James.Beg For Mercy is the third book in the series featuring Detective Sergeant Solomon Gray. Buy it now to discover whether Gray can track down the real killer and escape Usher’s clutches in this tense crime series.What Others Say\"Nixon combines his trademark gritty humour with a flawless police procedural.\"M.W. Craven, author of the Washington Poe series\"A compelling murder mystery with a multilayered and engaging new hero. Great read.\"Mason Cross, author of the Carter Blake thriller series\"A dark, uncompromising tale of loss, murder, and revenge. Glorious noir, which takes the police procedural elements and gives them new life. I can't wait to read the next step in Solomon Gray's journey for answers ...\"Luca Veste, author of the Murphy and Rossi crime series\"Be prepared for everything to resolve in dramatic fashion.\"Crime Fiction LoverWhat Readers Say\"I follow a lot of Detective series but this is by far one of the best.\"\"You’ve no idea how glad I am to be back in Gray’s world!\"\"The author has such an amazing talent for telling tales.\"\"Hard to put down and gripping to the very end.\"\"There has to be another installment soon!\"\"Wow, this series just gets better.\"\"Another strong instalment in a thoroughly enjoyable series.\"\"A fantastic read with brilliant characters.\"\"A very entertaining and well executed thriller. \"\"... deeply emotional, a dark rollercoaster ride.\"Ed James, author of bestselling DI Fenchurch series\"A damaged detective, haunted by a tragic past, a young son missing or dead, a man on a quest for redemption. Detective Sergeant Solomon Gray is a fine creation and Dig Two Graves an intriguing, nourish mystery. Keith Nixon is a sparkling crime fiction talent.\"Howard Linskey, author of the Detective Ian Bradshaw crime series",
  "genres": [
    "Crime",
    "Mystery"
  ],
  "author": "Keith Nixon",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/39794677-beg-for-mercy"
}