{
  "title": "The Ball at Versailles",
  "description": "Four American debutantes attend a renowned Paris cotillion in #1 New York Times bestselling author Danielle Steel’s captivating new novel.It’s the summer of 1959 and the Palace of Versailles is hosting an event that will make history. It is an exclusive dusk to dawn ball in which a select group of American and French debutantes will be presented to international society and royalty. Four young women, all with something to prove, receive what some see as the invitation of a lifetime.Amelia Alexander, who hopes to eventually attend law school, hesitates to participate in what she sees as an archaic and privileged tradition. But her indomitable widowed mother, Jane, who’s struggled financially and sacrificed for a career, encourages her to attend. Jane would do anything for Amelia to have the chance at happily ever after.Felicity Smith is equally uncertain about the ball. Although her family is prominent in the Dallas social scene, Felicity prefers to keep to herself, avoiding the older sister who torments her. But to get out of her sister’s shadow, Felicity decides to accept. If it’s a success, the tables will have turned at last.For Caroline Taylor, the beautiful ingénue and daughter of Hollywood legends, the ball is an irresistible opportunity. But an unexpected heartbreak just before she leaves for France gets things off to a bad start.Then there’s Samantha Walker, an art history major with an overprotective father. Her excitement about the invitation is overshadowed by the emotional and physical effects of a past tragedy that still haunts her. For all these young women, Paris and one transcendent night will change their lives forever. Bestselling author Danielle Steel extends an invitation to all, in The Ball at Versailles.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Fiction",
    "Drama",
    "Chick Lit",
    "Love Story",
    "Romantic"
  ],
  "author": "Danielle Steel",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/123004948-the-ball-at-versailles"
}