{
  "title": "The Sisters Who Would Be Queen",
  "description": "#NEW YORK TIMES BESTSELLER: Inspiration for Philippa Gregory's 2017 novel The Last Tudor and for Elizabeth Fremantle's 2014 novel Sisters of TreasonLeanda de Lisle brings the story of nine days’ queen, Lady Jane Grey and her forgotten sisters, the rivals of Elizabeth I, to vivid life in her fascinating biography’ Philippa GregoryLady Jane Grey is an iconic figure in English history. Misremembered as the ‘Nine Days Queen’, she has been mythologized as a child-woman destroyed on the altar of political expediency. Behind the legend, however, was an opinionated and often rebellious adolescent who died a passionate leader, not merely a victim. Growing up in Jane’s shadow, her sisters Katherine and Mary would have to tread carefully to survive.The dramatic lives of the younger Grey sisters remain little known, but under English law they were the heirs – and rivals – to the Tudor monarchs Mary and Elizabeth I. The beautiful Katherine ignored Jane’s dying request that she remain faithful to her beliefs, changing her religion to retain Queen Mary’s favour only to then risk life and freedom in a secret marriage that threatened Queen Elizabeth’s throne.While Elizabeth’s closest adviser fought to save Katherine, her younger sister Mary remained at court as the queen’s Maid of Honour. Too plain to be considered significant, it seemed that Lady Mary Grey, at least, would escape the burden of her royal blood. But then she too fell in love, and incurred the queen’s fury.Exploding the many myths of Lady Jane’s life and casting fresh light onto Elizabeth’s reign, acclaimed historian Leanda de Lisle brings the tumultuous world of the Grey sisters to life, at a time when a royal marriage could gain you a kingdom or cost you everything.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "Historical",
    "British Literature",
    "16th Century"
  ],
  "author": "Leanda de Lisle",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/3980321-the-sisters-who-would-be-queen"
}