{
  "title": "Flying in the Rain",
  "description": "There’s something hidden beneath the soil of the Cepheus colony and it might be worth killing for  A satellite just passed overhead and it’s searching for something very specific. Oddly enough, the only person who might know what it is would be the same person who hid it on this planet a million years ago. And that person happens to still be alive and residing in the Cepheus colony today. Perhaps Bahn could explain why they’d be willing to kill Ani over such a buried treasure.  \"It’s better to live an entire mortal existence of having never kissed an angel, than it is to have kissed one and then spend all of eternity with a beloved memory and an unquenchable desire that can never again be fulfilled. I’m ruined!\"  The Ani Maxima Files: Ptolemy’s Child SuperVirus Veiled Sky Enigma Flying in the Rain Silent Lucidity Flesh and BloodSoul SisterSocial Animal Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Kepler Moon Alpha, and Ghosts of Ophidian. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Maelstrom, Endeavor, Hope Rising, One Crazy Summer, and Vestige by McElhaney.   EDITORIAL REVIEWS:   \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review  \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher  Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/39801712-flying-in-the-rain"
}