{
  "title": "Secret Admirer",
  "description": "His mission: Get close to Alice May. Learn her secrets. Expose her lies. And if she's guilty...lock her up.Undercover FBI Agent Zander Todd typically spends his days and his nights tracking killers. But, lately, he's been pretending that he's a different man. He's been working his way into the life of beautiful but reserved Alice May. He's supposed to make her trust him completely. Alice is the key to a serial murder case that the FBI has been working for years. She's also the chief suspect.Alice was engaged to Hugh Collins, the man who turned out to be the elusive \"Secret Admirer\" killer. Hugh picked women that he thought were perfect, he seduced them, and when they failed to live up to his image of perfection...their Secret Admirer brutally killed them. The only time that Hugh broke his MO--that was with Alice. Hugh was on his way to the chapel to marry Alice when the FBI killed him. The FBI has long suspected that Alice may have been involved in the killings, but they could never find solid evidence to tie her to the crimes.Her goal: Bury her past. Pretend to be someone new. Live a lie.Alice May knows better than to trust a handsome man with a seductive smile. The last time she fell for a charmer, she learned her lover was a serial killer. Not the news a woman expects to learn on her wedding day. Since that brutal revelation, she's sworn off men, she's gone into hiding to get away from voracious reporters, and she hasn't let herself get close to anyone.But...a year has passed since her life fell apart. And it's hard to be alone all the time. She thinks that one night, one date with Zander might remind her of what it's like to be alive. To feel normal. The passion that burns between them is white-hot and electrifying. It's so intense that it scares Alice. She never expected to ever want anyone that much.He will punish her.Their passion ignites the fury of a killer who has been watching her, waiting for her. A man who has finally decided that Alice isn't quite so perfect. And if she's not perfect, then Alice has to die.When Alice's life is threatened, Zander must reveal his true identity. The new betrayal batters at Alice's soul, but when Zander takes her into protective custody, they are forced into close proximity. With a killer watching her every move, Alice has no choice but to trust Zander. Because her past isn't dead, but if Alice isn't very, very careful...she will be.Author's Note: SECRET ADMIRER is a romantic suspense novella of 40,000 words. It is a complete, stand-alone story.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary",
    "Mystery",
    "Serial Killer",
    "Thriller"
  ],
  "author": "Cynthia Eden",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/39803410-secret-admirer"
}