{
  "title": "cum să devii remarcabil",
  "description": "Cartea Cum sa devii remarcabil este un ghid bine structurat pentru formarea si cizelarea abilitatilor dumneavoastra, cu ajutorul caruia, daca il urmati pas cu pas, veti putea deveni o persoana remarcabila. Mai mult, vi se dezvaluie metode usor de pus in practica pentru a avea o conduita de mare clasa. Pornind de la gestionarea stresului si organizarea timpului si abordand dezvoltarea unor insusiri precum generozitatea, empatia si sinceritatea, veti descoperi calea de a va stabili obiectivele dorite si de a va asigura ca se transforma in realitate. Pentru a avea succes, conteaza enorm abilitatea de a va remarca in multime, de a va demonstra valoarea. Sa fiti acel om cu care ceilalti isi doresc cu adevarat sa comunice, sa munceasca, sa traiasca si pe care vor sa-l aiba drept lider, partener de afaceri sau de cuplu, sau mentor. Ca sa deveniti remarcabil, trebuie sa va stabiliti misiunea in viata si sa stiti cum sa dobanditi o influenta autentica asupra celor din jurul dumneavoastra. Dale Carnegie (1888–1955), pe numele lui real Dale Carnegey, s-a nascut intr-o familie saraca de fermieri americani. Dupa absolvirea facultatii, a vandut cursuri prin corespondenta in Nebraska si a obtinut cateva roluri ca actor la New York, fara mare succes. In 1912, este angajat de Young Men Christian Association sa predea cursuri pentru adulti si descopera, fara sa-si propuna asta, o metoda de a diminua teama celor care vorbesc in fata unui public numeros. Astfel incepe faimoasa cariera a lui Dale Carnegie, care a ajuns sa fie considerat cel mai mare autor de literatura motivationala al secolului al XX-lea. In anii ’50, au inceput sa prinda contur proiectele din cadrul programului Dale Carnegie Training, asa cum exista astazi. Acesta se bazeaza pe principiile promovate de fondatorul sau, Dale Carnegie.",
  "genres": [],
  "author": "Dale Carnegie",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/39801850-cum-s-devii-remarcabil"
}