{
  "title": "Rogue Hearts",
  "description": "From high office to the heartland, six brand-new romances about #resistance for readers who haven't given up hope for a Happily Ever After...  In Her Service by Suleikha Snyder  U.S. Vice President Letitia Hughes has one thing that's hers and only hers: her relationship with much younger Secret Service agent Shahzad Khan. When push comes to shove, what will take precedence: political ambitions or protecting their hearts?  Run by Emma Barry  Public defender Maddie Clark doesn’t want to be a candidate for the state senate—but she’s running. Her high school nemesis turned campaign advisor Adam Kadlick shouldn’t be back home managing campaigns—but he is. They definitely should avoid falling for each other—but they won’t.  The Rogue Files by Stacey Agdern  Reporter John DiCenza wants to go back. To New Jersey, to his life, the hockey team he covers, and the fanbase he’s proud to know and support. Back to before he had the Rogue Files, documents rumored to be the final nail in President Crosby’s term.  Journalist Sophie Katz wants to move forward. Toward her new TV show, and a life where the stories she tells will make a difference. She needs the Rogue Files and the story behind them to get there.  But when life comes at them, John and Sophie realize that the true story behind the files is standing up for the truth right where you are.  Coming Up Rosa by Kelly Maher  When her mother's health crisis forces Rosa Donnelly back to her hometown, she crosses paths with her former crush, and town golden boy, Ian Stroman. Ian's shine is even brighter thanks to his advocacy work to fight inhumane government policies. However, their past hurts and a current business threat may spike their chance at happiness.  The Sheriff & Mr. Devine by Amy Jo Cousins  There’s a new sheriff in Clear Lake and he has Eli Devine, the town librarian, on edge. Between arguing with the town council about inclusive library programming and keeping his three grandmas from getting into trouble, Eli has enough on his plate already. He doesn’t need the imposing Sheriff Baxter to be so very . . . distracting. Luckily for Eli, John Baxter is full of all kinds of good ideas, both for the town and for one stubborn librarian in particular.  Good Men by Tamsen Parker  Laid-back Benji Park is the keyboard player for the world’s hottest boy band, License to Game. While LtG is no stranger to charity gigs, Benji’s never been what you’d call a social justice warrior. But when smart, sexy, and ruthless immigration lawyer Jordan Kennedy comes along and asks Benji for a favor, he just may change his tune.",
  "genres": [
    "Anthologies",
    "Romance",
    "Contemporary",
    "Fiction",
    "Short Stories",
    "Contemporary Romance",
    "Novella"
  ],
  "author": "Suleikha Snyder",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/39848290-rogue-hearts"
}