{
  "title": "Hiding Abigail. The Girl with the Yellow Star. : An absolutely beautiful and heartbreaking WW2 historical novel",
  "description": "It is January 1942 and ten year old German boy Deiter can’t understand how with all the efforts by the Fuhrer and the soldiers to make his country great again, why does everything just seem to be getting worse. In only seven days his whole world falls apart as he waits for the evacuations to happen and bring Abigail the girl with the yellow star and everyone he loves to the countryside which he believes to be Just like heaven. The world and the war through the eyes of innocence.Brendan Mac an Mhaoir's first novel ''Hiding Abigail'' was inspired by stories from his father's youth, where his father's best friend was an orphaned German boy named Dieter. The story follows seven days in the life of Dieter from Bilker street Dusseldorf in the winter of 1942. With all that seems to be going wrong in his life, he seems not to understand or just ignore what's happening and daydream of a better future in the countryside with his family and Abigail.An extremely enjoyable coming of age wartime story suitable for all ages.PRAISE. Sweet book. I really enjoyed this Sweet yet Sad Book, it was well written too. Everyone should read so History never ever repeats itself anywhere. Terri Leigh Farmer A beautiful story to remember. This story touched my heart. Elaboration will only dilute my feelings. I hope many will read it and appreciate this author's writing, sad but beautiful. Manisha Mukherjee Haunting and sad tale of a ten year old German boy during World War Two who is just trying to make sense of the world he lives in. I enjoyed this book from start to finish and felt as if I really got to know Deiter the main character very well and couldn’t wait to get back to reading this Novel every time I left it down. The book left me asking questions at the end as to what exactly happened to Abigail. I love when a book or Movie does this and it leaves you to figure it out for yourself what you think actually happened. The book flows from start to finish with the story of seven days in the life of Deiter. With some very funny memories thrown in too of his life in better times. Really worth a read as it is a beautiful haunting story and very well written too. Brenda York The book is charming, sad and in the end poignant evocative and haunting. An easy to read but nicely written book about a young boy during World war two. The book starts out at the end and we hear the story told through the eyes of Deiter as he goes through seven days of his life. Seven days of events that are all very strange to him which start out with stories and memories of better times. Stories of his family and the girl from next door. Once I started to read this book I found it easy to read and enjoyable from start to finish. Once I started I couldn’t leave it down and found I could relate in many ways to the main character and found him to be a very credible ten year old boy which isn’t always the case in many books. I checked on some of the events of the book and it turns out that they are in fact true like the appearance of Adolf Hitler on that very date at the sports palace in Berlin and the deportations from Dusseldorf freight station. Even the songs that were sang are real and the mention of the Bunkerkirche which was also built during the war. A book of fiction but true to real life events. Dan Young Enjoy and please feel free to review 'Hiding Abigail. The girl with the yellow star'",
  "genres": [
    "Holocaust",
    "World War II",
    "History"
  ],
  "author": "Brendan Mac an Mhaoir",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/39846661-hiding-abigail-the-girl-with-the-yellow-star"
}