{
  "title": "The Pentagon Papers",
  "description": "\"The WikiLeaks of its day\" (Time) is as relevant as ever to present-day American politics.Not fake news! The basis for the 2018 film 'The Post', 'THE PENTAGON PAPERS' are a series of articles, documents, and studies examining the Johnson Administration's lies to the public about the extent of US involvement in the Vietnam War, bringing to light shocking conclusions about America's true role in the conflict.Published by 'The New York Times' in 1971, 'THE PENTAGON PAPERS' riveted an already deeply divided nation with startling and disturbing revelation about the United States involvement in Vietnam. 'The Washington Post' called them \"the most significant material in American history\" and they remain relevant today as a reminder of the importance of a free press and First Amendment rights. 'THE PENTAGON PAPERS' demonstrated that the government had systemically lied to both the public and to Congress.THIS INCOMPARABLE VOLUME INCLUDES:•  The Truman and Eisenhower Years:  1945-1960 by Fox Butterfield•  Origins of the insurgency in South Vietnam by Fox Butterfield•  The Kennedy Years:  1961-1963 by Hedrick Smith•  The Overthrow of Ngo Dinh Diem:  May-November, 1963 by Hedrick Smith•  The Covert War and Tonkin Gulf:  February-August, 1964 by Neil Sheehan•  The Consensus to Bomb North Vietnam:  August, 1964-February, 1965 by Neil Sheehan•  The Launching of the Ground War:  March-July, 1965 by Neil Sheehan•  The Buildup:  July, 1965-September, 1966  by Fox Butterfield•  Disenchantment:  October, 1966-May, 1967  by Hedrick Smith•  The Tet Offensive and the Turnaround by E.W. Kenworthy•  Analysis and Comment•  Court Records•  Biographies of Key FiguresWith a brand-new foreword by James L. Greenfield, this edition of the Pulitzer Prize-winning story is sure to provoke discussion about free press and government deception, and shed some light on issues in the past and the present so that we can better understand and improve the futureRUNNING TIME ⇒ 37hrs.©2018 Neil Sheehan, E.W. Kenworthy, Fox Butterfield, Hendrick Smith (P)2018 Brilliance Audio, Inc., all rights reserved.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "War",
    "Banned Books",
    "Journalism",
    "Military Fiction"
  ],
  "author": "Neil Sheehan",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/398288.The_Pentagon_Papers"
}