{
  "title": "The Experts' Guide to 100 Things Everyone Should Know How to Do",
  "description": "The simplest things are the hardest to master. From brewing your morning cup of coffee and reading the newspaper to apologizing or remembering names, it’s the small stuff that makes up day-to-day life. The Experts’ Guide to 100 Things Everyone Should Know How to Do provides unparalleled insights into how to do them better—more resourcefully, more effectively, and more efficiently—in 100 brief how-to essays by 100 of the world’s leading experts, • Interpersonal skills like how to Tell a Story by Ira Glass and Listen by Larry King• Etiquette essentials like how to Shake Hands by Letitia Baldrige, Set a Formal Table by Peggy Post, and Give and Receive a Compliment by Ms. Demeanor, Mary Mitchell• Home pointers such as how to Paint a Room by Bob Vila, Remove a Stain by Linda Cobb, the Queen of Clean, and Do Laundry by Heloise• Beauty basics that include how to Apply Lipstick by Bobbi Brown and Wash Your Hair by Frederic Fekkai• Cooking tips such as how to Bake Chocolate Chip Cookies by Mrs. Fields, Barbecue by Bobby Flay, and Make Eggs by Jean-Georges Vongerichten• Health hints like how to Breathe by Bikram Choudhury and Do Push-ups and Sit-ups by Kathy Smith• Athletic advice including how to Hit a Tennis Ball by Jennifer Capriati, Swing a Golf Club by Jim McLean, and Swim by Summer SandersSome of these experts are household names, others are industry leaders—all are at the very top of their professions. From Holiday Inn’s housekeeper of the year (Make a Bed), the head groundskeeper of Fenway Park (Mow a Lawn), and the mayor of Buffalo (Shovel Snow) to the CEOs of Harry Winston (Buy a Diamond) and Thomas Pink (Tie a Windsor Knot), they are the authorities on their subjects. The Experts’ Guide to 100 Things Everyone Should Know How to Do brings together the best of the best, offering the world’s most valuable advice. With this book in hand, life will indeed be better.",
  "genres": [
    "Nonfiction",
    "Reference",
    "Self Help",
    "How To",
    "Audiobook",
    "Trivia",
    "Adult"
  ],
  "author": "Samantha  Ettus",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/398440.The_Experts_Guide_to_100_Things_Everyone_Should_Know_How_to_Do"
}