{
  "title": "Evolutionary Psychopathology: A Unified Approach",
  "description": "Mental disorders arise from neural and psychological mechanisms that have been built and shaped by natural selection across our evolutionary history. Looking at psychopathology through the lens of evolution is the only way to understand the deeper nature of mental disorders and turn a mass of behavioral, genetic, and neurobiological findings into a coherent, theoretically grounded discipline. The rise of evolutionary psychopathology is part of an exciting scientific movement in psychology and medicine -- a movement that is fundamentally transforming the way we think about health and disease.Evolutionary Psychopathology takes steps toward a unified approach to psychopathology, using the concepts of life history theory -- a biological account of how individual differences in development, physiology and behavior arise from tradeoffs in survival and reproduction -- to build an integrative framework for mental disorders. This book reviews existing evolutionary models of specific conditions and connects them in a broader perspective, with the goal of explaining the large-scale patterns of risk and comorbidity that characterize psychopathology. Using the life history framework allows for a seamless integration of mental disorders with normative individual differences in personality and cognition, and offers new conceptual tools for the analysis of developmental, genetic, and neurobiological data. The concepts presented in Evolutionary Psychopathology are used to derive a new taxonomy of mental disorders, the Fast-Slow-Defense (FSD) model. The FSD model is the firstclassification system explicitly based on evolutionary concepts, a biologically grounded alternative to transdiagnostic models. The book reviews a wide range of common mental disorders, discusses their classification in the FSD model, and identifies functional subtypes within existing diagnostic categories.",
  "genres": [
    "Psychology",
    "Evolution",
    "Nonfiction",
    "Science",
    "Health"
  ],
  "author": "Marco del Giudice",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/39834203-evolutionary-psychopathology"
}