{
  "title": "Nos vemos en el baño. Renacimiento y rock and roll en Nueva York, 2001-2011",
  "description": "De los clubs de la parte baja del East Side a los almacenes de Williamsburg: el relato de una época que cambió la música y la ciudad de Nueva York para siempre, narrado por sus protagonistas. A partir de casi doscientas entrevistas originales realizadas por una escritora que recuerda las resacas en primera persona, Meet me in the bathroom continúa la gran tradición del entrañable clásico Por favor, mátame de Legs McNeil y Gillian McCain. Este libro describe la primera década de nuestro milenio con su inagotable gloria épica y traza un retrato brillante de una ciudad, una industria y una generación al borde de un cambio sísmico. A medida que el siglo XX llegaba a su fin, la ciudad de Nueva York iba apagándose como capital cultural. El vibrante centro de la ciudad se había convertido -«gracias» a inyecciones de dinero fresco- en un museo moribundo, en el patio de recreo de banqueros y de la nueva hornada de profesionales punto com. Si querías vivir el rock and rol¡, la ciudad de Nueva York era el último lugar al que ir. Y, sin embargo, la década siguiente, este mismo escenario se convertiría en la plataforma de un radical renacimiento cultural. ¿Cómo sucedió todo esto? En este fascinante relato oral de quienes estuvieron allí, tocando en bandas, sirviendo copas, firmando cheques e informando de lo que ocurría, Lizzy Goodman recopila la crónica del renacimiento del rock neoyorquino. A partir de 2000 y durante los primeros años del nuevo milenio, The Strokes, Yeah Yeah Yeahs, Interpol, The Moldy Peaches, LCD Soundsystem y otros grupos musicales, que habían estado afinando su estilo en la oscuridad, se convirtieron inesperadamente en reflejos de una floreciente y renovada ciudad que estaba decidida a renacer tras los devastadores atentados del 11 de septiembre.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Audiobook",
    "New York",
    "Memoir",
    "Biography"
  ],
  "author": "Lizzy Goodman",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/39844562-nos-vemos-en-el-ba-o-renacimiento-y-rock-and-roll-en-nueva-york-2001-2"
}