{
  "title": "Life and Times of Jesus the Messiah",
  "description": "One of the most important, detailed works of history on the most important event in our history.  The face of global politics, society, law, and belief changed irrevocably when Jesus of Nazareth was crucified.  Through vivid, thoroughly painted historical research, you are invited to walk down the dusty streets of ancient Palestine, enter the dwellings, the Temple and the Synagogue, visit the Academy, market-place and workshops, associate with the locals in familiar discourse and discover the world that bore Jesus, and the world that decided to kill him.  Across five books Edersheim attempts, with unflinching resolve, to construct a fresh, independent and impartial investigation into the historical development of philosophy and religion 2,000 years ago which bore the seeds of Christianity, and yet which was irreconcilably antagonistic to it.  By analysing the leading figures of Church and State in Palestine, their views, teaching, pursuits, and aims; popular opinion, proverbs, customs and daily life, Edersheim hopes to produce a richer and clearer understanding of the life of ‘Him Who is the Life of all our life.’  A consideration of each passage from the gospels produces an informal commentary on the scripture, dismantling interpretations of previous scholars’ whose evidence lacked context and was biased and fractured.  Edersheim feels that as we transport ourselves into this historical scene, the Gospels become real; the people populating its pages become recognisable, speaking and acting how you would expect them to act, the scenarios and dramas playing out as products of a greater environment.  Seven years of continual and earnest labour enabled Edersheim to construct, not only the frame in which to set the picture of Christ, but the very background of the picture itself.  “And now I part from this book with thankfulness to Almighty God for sparing me to complete it, with lingering regret that the task is ended...“  Alfred Edersheim (7 March 1825 – 16 March 1889) was a Jewish convert to Christianity and a Biblical scholar. Born in Vienna, he was educated in the Talmud, Torah and Rabbinical languages, entering the University of Vienna in 1841. He emigrated to Hungary, becoming a teacher of languages before converting to Christianity, studying theology at Edinburgh’s New College and the University of Berlin. In 1846 Alfred married and entered the ministry in the Free Church of Scotland. In 1875 he was ordained into the Church of England and was Curate of the Abbey Church, giving lectures on Judaism and Christianity at the University of Oxford. Edersheim died at Menton, France, on 16 March 1889.",
  "genres": [
    "History",
    "Theology",
    "Christian",
    "Reference",
    "Religion",
    "Nonfiction",
    "Christianity"
  ],
  "author": "Alfred Edersheim",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/39822109-life-and-times-of-jesus-the-messiah"
}