{
  "title": "Beaches, Bungalows & Burglaries",
  "description": "Welcome to Normal, Kentucky~ where nothing is normal.  Mae West, a far cry from the Hollywood actress, has been thrown for a loop. Her plush lifestyle in the big city of New York comes to a screeching halt after the FBI raids her mansion and arrests her husband, Paul West, for a Ponzi scheme that rips people out of millions of dollars.  Mae finds herself homeless, friendless, and penniless. All hope isn't lost. . .the only thing Mae got to keep that the government didn't seize is a tourist camp ground, Happy Trails, in Normal, Kentucky and an RV to live in. One problem, Mae's idea of camping has room service.  By the look of the brochure, Happy Trails has plush Kentucky Bluegrass, a crystal clear lake, a beach chair with her name on it and thoughts of how much money it could bring her after she sells it. Mae figures she'll take a couple weeks vacation with her toes dipped in the lake. Things aren't always as they appear. The Kentucky Bluegrass is nothing but dirt and the crystal clue lake is murky with green slime on top.  Mae quickly find out that Happy Trails and the citizens of Normal were also victims of Paul's schemes, making her lower than tha lake scum in the residents' eyes. Mae doesn't think things could get much worse, but as luck would have it, Paul West has escaped from prison and is found dead, murdered, floating in the Happy Trails mucky green lake.  Mae is the number one suspect on Detective Hank Sharp's short list. After all, Mae has the perfect motive as a kept wife who has been scorned to ashes, embarrassed to death, and seeking revenge.  Time is running out for Mae to prove that she's innocent and nothing like her husband. If only she could get someone to believe her and talk Detective Sharp into looking at other residents who've lost all their savings to Paul's Ponzie scheme before the curtain is closed on this Hollywood namesake.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Audiobook",
    "Fiction",
    "Cozy",
    "Contemporary",
    "Adult"
  ],
  "author": "Tonya Kappes",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/39827834-beaches-bungalows-burglaries"
}