{
  "title": "The New Chesapeake Kitchen",
  "description": "The latest cookbook by the \"Culinary Ambassador of the Chesapeake\" encourages us to cook in a way that is not only healthy for us but also for the Bay. Captain John Smith, upon entering the Chesapeake, wrote in his diaries that the fish were so plentiful “we attempted to catch them with a frying pan.” That method sums up classic Chesapeake cooking―fresh and simple. In The New Chesapeake Kitchen , celebrated Maryland chef John Shields takes the best of what grows, swims, or grazes in the Bay’s watershed and prepares it simply, letting the pure flavors shine through. Honoring the farmers, watermen, butchers, cheese makers, and foragers who make the food movement around the Chesapeake Bay watershed possible, along with the environmental and food organizations working to restore the Bay, the land, and food security, Shields promotes a healthy locavore diet and a holistic view of community foodways. In this scrumptious book, enhanced with beautiful full-color images by former Baltimore Sun Magazine photographer David W. Harp, Shields urges readers to choose local, seasonal ingredients. Presenting what he dubs “Bay- and body-friendly food,” he advocates for a plant-forward and sustainable diet, one that considers how food consumption affects both your health and the environment. Shields presents creative and healthy options that nourish us while protecting the Bay, including one-pot recipes for meals like Fishing Creek Seafood Chili, Old Line Veggie Creole Oyster Stew, and Spring Pea Soup with Tarragon-Truffle Oil. To round it out, this holistic cookbook includes directions for canning, preserving, and fermenting. Shields offers many vegan- and vegetarian-friendly options, as well as innovative new takes on Chesapeake classics. You’ll find recipes for dozens of delicious dishes, from Aunt Bessie’s Crab Pudding and Hutzler’s Cheese Bread to “I Can’t Believe It’s Not Crab” Cakes, Blue Cat Seafood Hash, and an array of savory soups, braised meats, luscious desserts, and green breakfast smoothies―even recipes for a locavore cocktail party!",
  "genres": [
    "Cookbooks"
  ],
  "author": "John Shields",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/39827347-the-new-chesapeake-kitchen"
}