{
  "title": "Cork Wars: Intrigue and Industry in World War II",
  "description": "In 1940, with German U-boats blockading all commerce across the Atlantic Ocean, a fireball at the Crown Cork and Seal factory lit the sky over Baltimore. The newspapers said that you could see its glow as far north as Philadelphia and as far south as Annapolis. Rumors of Nazi sabotage led to an FBI investigation and pulled an entire industry into the machinery of national security as America stood on the brink of war.In Cork Wars, David A. Taylor traces this fascinating story through the lives of three men and their families, who were all drawn into this dangerous intersection of enterprise and espionage. At the heart of this tale is self-made mogul Charles McManus, son of Irish immigrants, who grew up on Baltimore's rough streets. McManus ran Crown Cork and Seal, a company that manufactured everything from bottle caps to oil-tight gaskets for fighter planes. Frank DiCara, as a young teenager growing up in Highlandtown, watched from his bedroom window as the fire blazed at the factory. Just a few years later, under pressure to support his family after the death of his father, DiCara quit school and got a job at Crown. Meanwhile, Melchor Marsa, Catalan by birth, managed Crown Cork and Seal's plants in Spain and Portugal--and was perfectly placed to be recruited as a spy.McManus, DiCara, and Marsa were connected by the unique properties of a seemingly innocuous substance. Cork, unrivaled as a sealant and insulator, was used in gaskets, bomber insulation, and ammunition, making it crucial to the war effort. From secret missions in North Africa to 4-H clubs growing seedlings in America to secret intelligence agents working undercover in the industry, this book examines cork's surprising wartime significance. Drawing on in-depth interviews with surviving family members, personal collections, and recently declassified government records, Taylor weaves this by turns beautiful, dark, and outrageous narrative with the drama of a thriller. From the factory floor to the corner office, Cork Wars reflects shifts in our ideas of modernity, the environment, and the materials and norms of American life. World War II buffs--and anyone interested in a good yarn--will be gripped by this bold and frightening tale of a forgotten episode of American history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "World War II"
  ],
  "author": "David A.  Taylor",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/39827366-cork-wars"
}