{
  "title": "Love Into Eternity",
  "description": "When an honorable, young, Southern man witnesses a young lady endangered by three men, he makes a bold attempt to rescue her, but then…Over the last few years, Remi’s life has been tough. He has huge responsibilities, bills to pay, tuition due, and he has to deal with issues that require an unbelievable amount of patience.His life is difficult enough already. Then Remi witnesses three men threatening to assault a young lady. He knows he could never win against three guys, but he has to do something. If he can just give her a chance to run…Could things get any worse?Welcome to a rural Southern Louisiana cul-de-sac, where neighbors are like family. Together, they share intimate friendships, abundant laughter, and delicious food. Tragedy strengthens their characters, and sweet romances develop among them.Ava Baptiste and her Mama live a tranquil life in the rural countryside. A brutal event compels Remi to help Ava, but then he finds himself needing her help. Over time, a deep bond of friendship develops between them. Ava and her welcoming neighbors encourage Remi to persevere through the many difficult challenges he faces. Grateful for finding friendship and support for his disillusioned soul, Remi encourages his new friends to obey their hearts and pursue love. Through times of great joy as well as moments of pain, violence, and heartache this group of friends, young and old, persevere together squeezing every drop of happiness they can get out of life.Ava, an opinionated college student who finds herself alone and in danger.Angeliqùe, a single mother who raised her daughter, Ava, alone.Santiago, a thirty-something immigrant with an excellent business sense and a beautiful face. Sometimes he acts like a big kid, but he has a great heart.María, Santiago’s sister. Intelligent, beautiful, sweet, and single. A bachelor’s dream.José, Santiago’s best friend. And, he’s secretly been in love with María for years.Rosamunde, after four years of waiting for Santiago’s attention, she’s moving on.Chiquita, an eccentric and occasionally obnoxious Creole who’s desperate for a husband.Pablo, Santiago’s employee. Chiquita has him in her crosshairs.Mr. Emile, an elderly Southern gentleman. Generous, wise and dependable.Two guys, professionals by day and Harley riders by night.Love Into Eternity: A Contemporary Christian Romance is a stand-alone love story. Interwoven lives within the narrative encompass many genres, including Romantic Comedy, Young Adult, and Christian Romantic Suspense. Join these friends as they endure life’s greatest joys, along with suffering and tragedy. With lovable characters and tender relationships, Love Into Eternity is a moving tale of a community bonded by a passion for life and strengthened by genuine faith.Greater love has no one than this ... Previously published under the title Love: A Christian Romance by Marcelle",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Christian Fiction",
    "Christian",
    "Fiction"
  ],
  "author": "Marcel Lyon",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/39856826-love-into-eternity"
}