{
  "title": "Rain Dogs",
  "description": "With Rain Dogs, McMahon follows the lives of two central characters who are inexplicably intertwined together as a supernatural rainstorm batters the landscape. Guy Renford is returning to his hometown of Stonegrave after losing three years of his life to prison that resulted from a rash moment of violence against an intruder. Rosie, who has the ability to see the dead after a childhood tragedy, has been on the run from her past until events occur that send her running back to Stonegrave where the ghosts of drowned schoolgirls wait within the down pour. As the storm increases and something evil begins surfacing from the rain, Guy and Rosie are drawn together towards a final confrontation where not only their lives are at stake, but the lives of the entire town. Living within this atmospheric story are McMahon’s expertly written characters that come to life so perfectly that you can literally feel their flaws and are haunted right along with them. He puts so much life into even to lesser characters that you feel as if you have been living within the town of Stonegrave you entire life. I want to tell you that Rain Dogs took me on a nostalgic trip back to the heyday of horror fiction or that this novel is a perfect example of the state of horror fiction today, but Gary McMahon has successfully taken this book and raised it above any preconceived notions about what horror has been or will be in the future to create an exception work of fiction that stands alone within it’s own ideal of the horror genre. Tightly written and perfectly plotted, this book is a fast moving read that begs to be read slowly and every word savored. I cannot recommend Rain Dogs enough. This is one of those books that I wish would be plucked from the Small Press and placed in every bookstore so everyone could experience the pleasure of this amazing horror novel. Rain Dogs by Gary McMahon is one of those rare books that is just about as perfect as a novel can get. -- Horror World",
  "genres": [
    "Horror"
  ],
  "author": "Gary McMahon",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/3985765-rain-dogs"
}