{
  "title": "Sorcerer's Conquest",
  "description": "This edition was previously published under the ASIN B07C5WLVZQ A Sorcerer’s Conquest. A Medium’s Fate. A sexy sorcerer returns to the stage for what might be his final act, while a medium is haunted by more than just her past.  When an evil spirit from takes up residence in a modern psychic medium all too willing to house the dead, Sorcerer Maddox Chadwick is forced to kidnap her to keep the rest of the world safe. Although attracted to and intrigued by the supposed witch, the Dark Knight has fought against evil forces for so long he refuses to fall under any sort of spell. Yet, as the rise of the Mage’s Moon nears, his chance of freeing himself from the bonds of knighthood and maintaining his power grows slim. Along with surging desire, he battles the rise and wane of magic in the new world. With her possessed by a being of pure evil that tricked, used, and harmed so many, how can he accept the medium as his fated mate?  Ashlyn Bartholomew doesn’t only see dead people, she serves as a vessel for the dearly departed, which made her the perfect target for an evil soul in search of a host. The medium bears her possession with as much grace as possible when dealing with an entity whose taken up residence and refuses to move out, until her fascination with and passion for Maddox takes over. As an inner battle rages, she must open herself up to connecting, instead of the dead, with a sexy, living sorcerer.  Together, Ashlyn and Maddox must battle a vile threat to mankind and fight to close a Netherworld gateway to embrace one another as one true mates in Sorcerer’s Conquest, Knight Fever Series #3.  A one true mate paranormal romance.  Each one of a contingency of Dark Knights sets out on his final quest. After a millennia and a half of celibacy, each must find his one true mate to end Merlin's curse. A vampire, a wolf shifter, a sorcerer, a shape shifter, a dragon shifter, a wraith, a gargoyle shifter, a phantom, a cougar shifter, a raven shifter, a demon, a specter, and the reaper search for their fated mates.  As are each book in the Knight Fever Series, Vampire's Quest is a standalone romance featuring a Dark Knight created to battle the evil that rose up against the Kingdom of Camelot, and a member of a modern-day coven of supernaturally talented women.  The books in the series may be read in any order; however, the series might be best enjoyed as follows:  - Vampire’s Quest - Wolf’s Pursuit - Sorcerer’s Conquest  Unique, refreshing, edgy paranormal romance, shifter romance, wizard and sorcerer romance, fated mate romance, and one true mate romance.",
  "genres": [],
  "author": "Alexa Dare",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/39857177-sorcerer-s-conquest"
}