{
  "title": "Revealing His Prize",
  "description": "Twenty-three-year-old Frankie Nolan has just won a prestigious prize to produce a portfolio to sell office space in the sought after location of Mallory City Scene.  When she, along with her two best friends attend the glittering party held in the building she has won the right to publicise she is excited and scared because the prize and the night are huge.  She has an encounter with Adam, a handsome and slightly older man who has his sights clearly set on her and she is powerless to resist his charms. He makes her open up with no effort and as she explains that she didn't even want to enter the competition to publicise Mallory City Scene she goes as far as to describe her image of Mr Mallory as 'fifty-five, balding, with a middle-age spread and an overindulged wife and kids at home while he uses his position and money to address his erectile dysfunction with a combination of little blue pills and high-class hookers', much to Adam's amusement.  That one meeting leads to a succession of encounters that see Frankie finding it increasingly difficult to keep her secrets while Adam is intent on revealing every last detail about her.  She won the competition, been awarded the prize, but the real question was, who was the winner and exactly what or who would prove to be the prize?  Frankie  Life has scarred Frankie, making her scared of everything and everyone. Her biggest fear is letting people in because if she chooses the wrong people to share her past with she stands to lose everything again. When she meets Adam she quickly realises that there is something between them, a connection that neither of them can deny, even if she does try to run from it at every opportunity. She knows he might be the one person in the world who could eventually know everything about her and that scares her, but what scares her most is the thought of losing Adam to a past she wasn’t responsible for.  Adam  He had a good life and that didn’t include a long-term relationship or real commitment and then he met her. From the second he set eyes on Francesca, Adam had felt it, an invisible connection that meant he had to have her and when he kissed her and touched her the deal was done for him, she would be his, only his.  He intended to take full advantage of her prize and manipulate the details to his own advantage until he’d revealed each and every single secret she kept hidden, no matter how dark, dangerous or disturbing and every time she ran, well it just made him more determined to chase and capture her.  This is a standalone story that has been written, edited and published independently by me. It is solely intended for an adult audience (+18) with scenes and descriptions of mature situations including sex, violence, swearing and general encounters.",
  "genres": [],
  "author": "Elle M. Thomas",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/39861157-revealing-his-prize"
}