{
  "title": "Honeymoon in Tehran: Two Years of Love and Danger in Iran",
  "description": "Both a love story and a reporter’s first draft of history, Honeymoon in Tehran is a stirring, trenchant, and deeply personal chronicle of two years in the maelstrom of Iranian life.In 2005, Azadeh Moaveni, longtime Middle East correspondent for Time magazine, returns to Iran to cover the rise of President Mahmoud Ahmadinejad. As she documents the firebrand leader’s troublesome entry onto the world stage, Moaveni richly portrays a society too often caricatured as the heartland of militant Islam. Living and working in Tehran, she finds a nation that openly yearns for freedom and contact with the West, but whose economic grievances and nationalist spirit find a temporary outlet in Ahmadinejad’s strident pronouncements. Mingling with underground musicians, race car drivers, young radicals, and scholars, she explores the cultural identity crisis and class frustration that pits Iran’s next generation against the Islamic system.And then the unexpected Azadeh falls in love with a young Iranian man and decides to get married and start a family in Tehran. Suddenly, she finds herself navigating an altogether different side of Iranian life. Preparing to be wed by a mullah, she sits in on a government marriage prep class where young couples are instructed to enjoy sex. She visits Tehran’s bridal bazaar and finds that the Iranian wedding has become an outrageously lavish–though often still gender-segregated–production. When she becomes pregnant, she must prepare to give birth in an Iranian hospital, at the same time observing her friends’ struggles with their young children, who must learn to say one thing at home and another at school.Despite her busy schedule as a wife and mother, Azadeh continues to report for Time on Iran’s nuclear standoff with the West and Iranians’ dissatisfaction with Ahmadinejad’s heavy-handed rule. But as women are arrested on the street for “immodest dress” and the authorities unleash a campaign of intimidation against journalists, the country’s dark side reemerges. This fundamentalist turn, along with the chilling presence of “Mr. X,” the government agent assigned to mind her every step, forces Azadeh to make the hard decision that her family’s future lies outside Iran.Powerful and poignant, fascinating and humorous Honeymoon in Tehran is the harrowing story of a young woman’s tenuous life in a country she thought she could change.",
  "genres": [
    "Iran",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Travel",
    "Biography",
    "Book Club"
  ],
  "author": "Azadeh Moaveni",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/3985545-honeymoon-in-tehran"
}