{
  "title": "France",
  "description": "'For his final book, the late Norwich tackled the dauntingly vast subject of two millennia of French history with admirable lightness and urbanity . . . his comic footnotes deserve a review of their own' DAILY TELEGRAPH I can still feel, as if it were yesterday, the excitement of my first Channel crossing (as a child of nearly 7) in September 1936; the regiment of porters, smelling asphyxiatingly of garlic in their blue-green blousons; the raucous sound all around me of spoken French; the immense fields of Normandy strangely devoid of hedges; then the Gare du Nord at twilight, the policemen with their kepis and their little snow-white batons; and my first sight of the Eiffel Tower . . . This book is written in the belief that the average English-speaking man or woman has remarkably little knowledge of French history. We may know a bit about Napoleon or Joan of Arc or Louis XIV, but for most of us that's about it. In my own three schools we were taught only about the battles we Crecy and Poitiers, Agincourt and Waterloo. The rest was silence. So here is my attempt to fill in the blanks . . . John Julius Norwich's last book is the book he always wanted to the extremely colourful story of the country he loves best. From frowning Roman generals and belligerent Gallic chieftains, to Charlemagne (hated by generations of French children taught that he invented schools) through Marie Antoinette and the storming of the Bastille to Vichy, the Resistance and beyond, FRANCE is packed with heroes and villains, adventures and battles, romance and revolution. Full of memorable stories and racy anecdotes, this is the perfect introduction to the country that has inspired the rest of the world to live, dress, eat -- and love better.",
  "genres": [
    "History",
    "Nonfiction",
    "France",
    "European History",
    "Audiobook",
    "Historical",
    "Politics"
  ],
  "author": "John Julius Norwich",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/39848726-france"
}