{
  "title": "Closing the Food Gap: Resetting the Table in the Land of Plenty",
  "description": "This powerful call to arms offers a realistic vision for getting locally produced, healthy food onto everyone’s table, “[blending] a passion for sustainable living with compassion for the poor” (Dr. Jane Goodall) In Closing the Food Gap , food activist and journalist Mark Winne poses questions too often overlooked in our current conversations around What about those people who are not financially able to make conscientious choices about where and how to get food? And in a time of rising rates of both diabetes and obesity, what can we do to make healthier foods available for everyone?To address these questions, Winne tells the story of how America’s food gap has widened since the 1960s, when domestic poverty was “rediscovered,” and how communities have responded with a slew of strategies and methods to narrow the gap, including community gardens, food banks, and farmers’ markets. The story, however, is not only about hunger in the land of plenty and the organized efforts to reduce it; it is also about doing that work against a backdrop of ever-growing American food affluence and gastronomical expectations. With the popularity of Whole Foods and increasingly common community-supported agriculture (CSA), wherein subscribers pay a farm so they can have fresh produce regularly, the demand for fresh food is rising in one population as fast as rates of obesity and diabetes are rising in another.Over the last three decades, Winne has found a way to connect impoverished communities experiencing these health problems with the benefits of CSAs and farmers’ markets; in Closing the Food Gap , he explains how he came to his conclusions. With tragically comic stories from his many years running a model food organization, the Hartford Food System in Connecticut, alongside fascinating profiles of activists and organizations in communities across the country, Winne addresses head-on the struggles to improve food access for all of us, regardless of income level.",
  "genres": [
    "Food",
    "Nonfiction",
    "Politics",
    "Health",
    "Social Justice",
    "Sustainability",
    "Sociology"
  ],
  "author": "Mark Winne",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/3985173-closing-the-food-gap"
}