{
  "title": "Why You Like It: The Science and Culture of Musical Taste",
  "description": "From the chief architect of the Pandora Radio’s Music Genome Project comes a definitive and groundbreaking examination of how your mind, body, and upbringing influence the music you love.Everyone loves music. But what is it that makes music so universally beloved and have such a powerful effect on us?In this sweeping and authoritative book, Dr. Nolan Gasser―a composer, pianist, and musicologist, and the chief architect of the Music Genome Project, which powers Pandora Radio―breaks down what musical taste is, where it comes from, and what our favorite songs say about us.Dr. Gasser delves into the science, psychology, and sociology that explains why humans love music so much; how our brains process music; and why you may love Queen but your best friend loves Kiss. He sheds light on why babies can clap along to rhythmic patterns and reveals the reason behind why different cultures across the globe identify the same kinds of music as happy, sad, or scary. Using easy-to-follow notated musical scores, Dr. Gasser teaches music fans how to become engaged listeners and provides them with the tools to enhance their musical preferences. He takes readers under the hood of their favorite genres―pop, rock, jazz, hip hop, electronica, world music, and classical―and covers songs from Taylor Swift to Led Zeppelin to Kendrick Lamar to Bill Evans to Beethoven―and through their work, introduces the musical concepts behind why you hum along, tap your foot, and feel deeply.Why You Like It will teach you how to follow the musical discourse happening within a song and thereby empower your musical taste, so you will never hear music the same way again.",
  "genres": [
    "Music",
    "Nonfiction",
    "Science",
    "Psychology",
    "Audiobook",
    "Cultural",
    "Art"
  ],
  "author": "Nolan Gasser",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/39863398-why-you-like-it"
}