{
  "title": "Ten Years a Nomad: A Traveler's Journey Home",
  "description": "Part memoir and part philosophical look at why we travel, filled with stories of Matt Kepnes' adventures abroad, an exploration of wanderlust and what it truly means to be a nomad.\"Matt is possibly the most well-traveled person I know...His knowledge and passion for understanding the world is unrivaled, and never fails to amaze me.\" ―Mark Manson, New York Times bestselling author of The Subtle Art of Not Giving a F*ckTen Years a Nomad is New York Times bestselling author Matt Kepnes’ poignant exploration of wanderlust and what it truly means to be a nomad. Part travel memoir and part philosophical look at why we travel, it is filled with aspirational stories of Kepnes' many adventures.New York Times bestselling author of How to Travel the World on $50 a Day , Matthew Kepnes knows what it feels like to get the travel bug. After meeting some travelers on a trip to Thailand in 2005, he realized that living life meant more than simply meeting society's traditional milestones, such as buying a car, paying a mortgage, and moving up the career ladder. Inspired by them, he set off for a year-long trip around the world before he started his career. He finally came home after ten years. Over 500,000 miles, 1,000 hostels, and 90 different countries later, Matt has compiled his favorite stories, experiences, and insights into this travel manifesto. Filled with the color and perspective that only hindsight and self-reflection can offer, these stories get to the real questions at the heart of wanderlust. Travel questions that transcend the basic \"how-to,\" and plumb the depths of what drives us to travel ― and what extended travel around the world can teach us about life, ourselves, and our place in the world.Ten Years a Nomad is for travel junkies, the travel-curious, and anyone interested in what you can learn about the world when you don’t have a cable bill for a decade or spend a month not wearing shoes living on the beach in Thailand.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Adventure",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Matthew Kepnes",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/39863472-ten-years-a-nomad"
}