{
  "title": "Finding Forever",
  "description": "Twelve years is a long time to wait for the one you love.Mina’s husband Grey was a problem long before he died, but the realization that it’s been two years since she buried him still startles her. She’s been so busy learning to fend for herself—learning to leave Grey’s ugly legacy behind—that Mina’s barely noticed her efforts were turning her into an empty shell of a woman. However, when a sexy friend from her past comes to town, she can finally recognize that she isn’t the one who died. There might be a lot of life left to live—if she’s willing to look behind a door she’s never dared to open. Mack has always maintained a strict hands-off policy when it came to his buddy’s delectable wife Mina. Sure, he noticed her—a guy would have to be dead not to notice Mina. That didn’t mean Mack could do anything about it, though. For twelve long and painful years, he’s had to sit on the sidelines, watching the lousy way Grey treated her. But now that Mina is free, Mack knows he won’t pass up the chance to be with her himself. He wants it all—except there’s a very real possibility that the woman he hungers for can’t give him what he needs. Mack has no idea what happens then.Can Mina and Mack seize their shot at forever, once and for all? Or will the demons Grey left behind sink them both?Don’t miss Finding Forever, book four in Kristen Casey’s Second Chances series! If friends-to-lovers romances always hit you in the feels, then this heartfelt, steamy contemporary standalone needs to be on your bookshelf today! About the Series:Meet the Flynn and O’Connell sisters: four women who just need one more chance to get things right… and fall in love with the four men who are only too happy to hand it to them. These may not be your traditional kind of second chance stories, but all of them involve getting another chance at love, at life, and at forever. Enjoy!",
  "genres": [],
  "author": "Kristen Casey",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/39862609-finding-forever"
}