{
  "title": "Song of Blood & Stone",
  "description": "A Time Magazine Best Fantasy Book of 2018L. Penelope's Song of Blood & Stone is a treacherous, thrilling, epic fantasy about an outcast drawn into a war between two powerful rulers.The kingdoms of Elsira and Lagrimar have been separated for centuries by the Mantle, a magical veil that has enforced a tremulous peace between the two lands. But now, the Mantle is cracking and the True Father, ruler of Lagrimar and the most powerful Earthsinger in the world, finally sees a way into Elsira to seize power.All Jasminda ever wanted was to live quietly on her farm, away from the prying eyes of those in the nearby town. Branded an outcast by the color of her skin and her gift of Earthsong, she’s been shunned all her life and has learned to steer clear from the townsfolk…until a group of Lagrimari soldiers wander into her valley with an Elsiran spy, believing they are still in Lagrimar.Through Jack, the spy, Jasminda learns that the Mantle is weakening, allowing people to slip through without notice. And even more troubling: Lagrimar is mobilizing, and if no one finds a way to restore the Mantle, it might be too late for Elsira. Their only hope lies in uncovering the secrets of the Queen Who Sleeps and Jasminda’s Earthsong is the key to unravel them.Thrust into a hostile society and a world she doesn’t know, Jasminda and Jack race to unveil an ancient mystery that might offer salvation.Per Author: Special Earthsinger Edition is nearly 40K words longer than the original, hardcover edition and expands the storyline of an existing character but also brings you brand new characters and action. Jack and Jasminda's story is the same, but I hope you'll love Ella and Benn just as much!",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Fiction",
    "Fantasy Romance",
    "New Adult",
    "Magic"
  ],
  "author": "L. Penelope",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/39863207-song-of-blood-stone"
}