{
  "title": "Husbands That Cook: More Than 120 Irresistible Vegetarian Recipes and Tales from Our Tiny Kitchen",
  "description": "FEATURED LA Times • Relish Magazine • Epicurius.com • Eat Your Books • The Eagle Rock Boulevard-Sentinel • Men's Vow's • Powell's Books Blog • Bay Area Reporter • Passport MagazineGaby Dalkin \"Adam and Ryan make vegetarian recipes that are not only delicious but they'll satisfy any meat lover too!\"Molly Yeh \"I love this book! It is truly impossible not to love Adam and Ryan and Husbands that Cook . Between the giggle-worthy headnotes and wildly craveable recipes, this is a book that you will use again and again, and all the while feel as if you are cooking with two great friends.\"From the award-winning bloggers behind Husbands That Cook comes a book of original recipes inspired by their shared love of vegetarian food, entertaining, world travel―and each other.Food has always been a key ingredient in Ryan Alvarez and Adam Merrin’s relationship―and this cookbook offers a unique glimpse into their lives beyond their California kitchen. From their signature Coconut Curry with Chickpeas and Cauliflower, which was inspired by their first date at a shopping mall food court, to the Communication Breakdown Carrot Cake (which speaks for itself), these and other recipes reflect the husbands' marriage in all its flavor and variety.Written with the same endearing, can-do spirit of their blog, the husbands present more than 120 brand-new recipes―plus some greatest hits from the site―that yield delicious results every time. Each entry in Husbands That Cook is a reminder of how simple and satisfying vegetarian meal-making can be, from hearty main dishes and sides to healthy snacks and decadent desserts and drinks. Ryan and Adam also outline common pantry items and everyday tools you’ll need to fully stock your kitchen. Whether you’re cooking for one or feeding the whole family, this book is chock-full of great creative recipes for every day of the week, all year long.",
  "genres": [
    "Cookbooks",
    "Nonfiction",
    "Food"
  ],
  "author": "Ryan Alvarez",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/39863360-husbands-that-cook"
}