{
  "title": "Someday Is Not a Day in the Week: 10 Hacks to Make the Rest of Your Life the Best of Your Life",
  "description": "\"Inspired me to ask myself why and to stop postponing the forgotten dreams.\" --Geneen Roth, #1 New York Times bestselling author of Women Food and God and This Messy Magnificent LifeFull of inspirational insights and advice, lifehacks, and real-world examples,  Someday is Not a Day in the Week is CEO Sam Horn's motivational guide to help readers get what they want in life today rather than \"someday.\"Are you: - Working, working, working?- Busy taking care of everyone but yourself?- Wondering what to do with the rest of your life?- Planning to do what makes you happy someday when you have more time, money, or freedom?What if someday never happens? As the Buddha said, \"The thing is, we think we have time.\"Sam Horn is a woman on a mission about not waiting for SOMEDAY ... and this is her manifesto. Her dad's dream was to visit all the National Parks when he retired. He worked six to seven days a week for decades. A week into his long-delayed dream, he had a stroke. Sam doesn't want that to happen to you. She took her business on the road for a Year by the Water. During her travels, she asked people, \"Do you like your life? Your job? If so, why? If not, why not?\"The surprising insights about what makes people happy or unhappy, what they're doing about it (or not), and why...will inspire you to carve out time for what truly matters now, not later.Life is much too precious to postpone. It's time to put yourself in your own story. The good news is, there are \"hacks\" you can do right now to make your life more of what you want it to be. And you don't have to be selfish, quit your job, or win the lottery to do them. Sam Horn offers actionable, practical advice in short, snappy chapters to show you how to get started on your best life -- now.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Productivity",
    "Personal Development",
    "Audiobook",
    "Psychology",
    "Business"
  ],
  "author": "Sam Horn",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/39863457-someday-is-not-a-day-in-the-week"
}