{
  "title": "Enchantée",
  "description": "Love.Magic.Revolution.When smallpox kills her parents, seventeen-year-old Camille Durbonne must find a way to provide for her frail sister while managing her volatile brother. Relying on petty magic--la magie ordinaire--Camille painstakingly transforms scraps of metal into money to buy the food and medicine they need. But when the coins won't hold their shape and her brother disappears with the family's savings, Camille must pursue a richer, more dangerous mark: the glittering court of Louis XVI and Marie Antoinette.With the dark magic she learned from her mother, Camille transforms herself into 'the Baroness de la Fontaine' and is swept up into life at the Palace of Versailles, where aristocrats both fear and hunger for la magie. Her resentment of the rich at odds with the allure of glamour and excess, Camille is astonished to find that her would-be suitor Lazare, a handsome young inventor whom she thought shared her dreams of liberty, is also living a double life.As the Baroness de la Fontaine, Camille gambles at cards and flirts, desperate to maintain her place at court and keep herself and her sister off the streets. But la magie has its costs. When a scheming courtier blackmails her and Lazare's affections shift, Camille loses control of her secrets. Then revolution erupts, and she must choose--love or loyalty, democracy or aristocracy, reality or la magie--before Paris burns.Bestselling author of Caraval Stephanie Garber calls Enchantée \"a lit firework crackling with treacherous magic, decadent romance, and disguises that take on lives of their own--deliciously addictive!\" Gita Trelease's lush, imaginative debut fantasy is perfect for anyone looking for immersive magic in the world of Sofia Copola's Marie Antoinette.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Young Adult",
    "Historical",
    "Romance",
    "Fiction",
    "Magic"
  ],
  "author": "Gita Trelease",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/39863494-enchant-e"
}