{
  "title": "A Farther Shore: Ireland's Long Road to Peace",
  "description": "He’s been imprisoned, shot at, denounced, shunned, and banned, yet Sinn Féin president Gerry Adams remains resolute in his belief that peace is the only viable option for the Irish people. Adams led the oldest revolutionary movement in Ireland on an extraordinary journey from armed insurrection to active participation in government. Now he tells the story of the tumultuous series of events that led to the historic Good Friday Agreement as only he with a tireless crusader’s conviction and an insider’s penetrating insight.In vivid detail, Adams describes the harrowing attack on his life, and he offers new details about the peace process. We learn of previously undisclosed talks between republicans and the British government, and of conflicts and surprising alliances between key players. Adams reveals details of his discussions with the IRA leadership and tells how republicans differed, “dissidents” emerged, and the first IRA cessation of violence broke down. He recounts meetings in the Clinton White House, tells what roles Irish-Americans and South Africans played in the process, and describes the secret involvement of those within the Catholic Church. Then—triumphantly—this inspiring story climaxes with the Good Friday what was agreed and what was promised.Gerry Adams brings a sense of immediacy to this story of hope in what was long considered an intractable conflict. He conveys the acute tensions of the peace process and the ever-present sense of teetering on the brink of both joyous accomplishment and continued despair. With a sharp eye and sensitive ear for the more humorous foibles of political allies and enemies alike, Adams offers illuminating portraits of the leading characters through cease-fires and standoffs, discussions and confrontations. Among the featured players are John Major, Tony Blair, Bill and Hillary Clinton, Jean Kennedy Smith, and Nelson Mandela.As the preeminent republican strategist of his generation, Gerry Adams provides the first comprehensive account of the principles and tactics underpinning modern Irish republicanism. And in a world where peace processes are needed more urgently than ever, A Farther Shore provides a template for conflict resolution.",
  "genres": [
    "History",
    "Ireland",
    "Nonfiction",
    "Politics"
  ],
  "author": "Gerry Adams",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/398632.A_Farther_Shore"
}