{
  "title": "Hero Dogs: How a Pack of Rescues, Rejects, and Strays Became America's Greatest Disaster-Search Partners",
  "description": "Lola was a buckshot-riddled stray, lost on a Memphis highway. Cody was rejected from seven different homes. Ace had been sprayed with mace and left for dead on a train track. They were deemed unadoptable. Untrainable. Unsalvageable. These would become the same dogs America relied on when its worst disasters hit.In 1995, Wilma Melville volunteered as a canine search-and-rescue (SAR) handler with her Black Labrador Murphy in the aftermath of the Oklahoma City bombing. At the time, there were only fifteen FEMA certified SAR dogs in the United States. Believing in the value of these remarkable animals to help save lives, Wilma knew many more were needed in the event of future major disasters. She made a vow to help 168 dogs receive search-and-rescue training in her lifetime—one for every Oklahoma City victim.Wilma singlehandedly established the National Disaster Search Dog Foundation (SDF) to meet this challenge. The first canine candidates—Ana, Dusty, and Harley—were a trio of golden retrievers with behavioral problems so severe the dogs were considered irredeemable and unadoptable. But with patience, discipline, and love applied during training, they proved to have the ability, agility, and stamina to graduate as SARs. Paired with a trio of firefighters, they were among the first responders searching the ruins of the World Trade Center following 9/11—setting the standard for the more than 168 of the SDF’s search-and-rescue dogs that followed. Beautiful and heart-wrenching, Hero Dogs is the story of one woman’s dream brought to fruition by dedicated volunteers and firefighters—and the bonds they forged with the incredible rescued-turned-rescuer dogs to create one of America’s most vital resources in disaster response.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Dogs",
    "Audiobook",
    "Memoir",
    "Adult",
    "Biography"
  ],
  "author": "Wilma Melville",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/39863518-hero-dogs"
}