{
  "title": "Rebel Lion",
  "description": "Swinging shifter bachelor gets the surprise of his life. Is he up to the challenge?*** Voted a FAVORITE SERIES OF 2018 by PNR Lovers! *** Lion shifter Dell O’Roarke has never been serious about life, but life is about to get serious with him. The beautiful stranger who’s just arrived in Maui isn’t just looking for anyone — she’s looking for him. And that’s not just any surprise she’s brought along — it’s a baby who looks a hell of a lot like Dell. Soon, he discovers there’s more at stake than his lifestyle as a swinging bachelor. Vengeful shifters are hot on the stranger’s heels, making Dell wonder… Are they after the woman, the baby, or him?Ad executive Anjali Jain hasn’t taken a vacation in years — and she sure isn’t on vacation now. She’s simply keeping a promise, and then she’ll get back to climbing the corporate ladder. But there’s nothing simple about taking care of a baby — or handing that baby off to a handsome, mysterious stranger who feels like a long-lost friend.Easygoing Dell isn’t her type, but the more he reluctantly reveals of his hidden, soulful side, the deeper she falls in love — and the more mysteries she discovers. How can one man possibly awaken so many lusts and desires at the same time? What evil forces lurk behind the brutal murder of her best friend? And why does she have the feeling there’s something not quite human about the murderers — or about Dell?Maui just got hotter with this exciting new series of steamy, suspenseful paranormal romance!ALOHA PEARLS OF DESIRE Book 1: Rebel DragonBook 2: Rebel BearBook 3: Rebel LionBook 4: Rebel WolfBook 4.5: Rebel HeartBook 5: Rebel AlphaReady to be swept off to sunny Maui’s suspense-filled shifter side?Get your copy today of REBEL LION in ebook, paperback, or AUDIO today!",
  "genres": [
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Fantasy",
    "Paranormal Romance",
    "Dragons",
    "Audiobook"
  ],
  "author": "Anna Lowe",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/39884719-rebel-lion"
}