{
  "title": "The Money Deception - What Banks & Governments Don't Want You to Know",
  "description": "„It is well enough that people of the nation do not understand our banking and monetary system, for if they did, I believe there would be a revolution before tomorrow morning.“ - Henry Ford  In this new startling book, Mr. Herold provides the most sophisticated insight, and shocking details about the current monetary system. Never before has the massive manipulation of money caused so much despair and income inequality all over the world.  This book unveils over 20 secret methods that banks, governments and cooperations are using to legally strip 90% of your income. Brilliantly written and astoundingly easy to understand, this book is an eye-popping exposure of the most sophisticated fraud in the history of mankind.  - Why the current monetary system stands before the abyss - The magic trick how banks create money out of thin air - The myth of GDP growth and what really causes it - The physiological methods by which advertisers and insurances get your money - Will the government soon be forced to support Universal Basic Income? - Why BitCoin is not a practical investment tool and will soon vanish - Why crypto-currencies could free us from central banks and government regulations - Why a resource based economy could be the solution and make money obsolete - What you can do right now to shift from a money mindset into wealth creation  Over 8 years in the making… The shocking details about the biggest fraud in history ever – happening to you right now.  Bubbles blow – in 2000 the Internet business bubble imploded, only eight years later the housing market crashed. Now we have the everything bubble! More than 3 trillion dollars – that’s a three with 12 zeros – have been injected into the market since then to keep it from collapsing.  With catastrophic results… This money has been souped up by the 1% that now control 50% of the worlds wealth. The fastest and biggest wealth transfer in history is underway. Money evaporates - as quick as water in the desert - from the middle class, leaving them struggling and without hope for retirement. The elite class is celebrating their biggest heist with insane, astronomical profits. This is not going to last.  Beginning in 2018 this ‘Everything Bubble’ is going to bust… This book reads like a thrilling novel, but sadly it’s based on facts. The secret techniques and methods almost all banks and governments have been using, and still using today to steal your money legally. It exposes in detail, brilliance and with clarity over 20 stunning tactics, which leaves you wondering why the whole system hasn’t crashed a long time ago.  Hint: All of us keep it going by simply believing and trusting it… Nevertheless the frightening facts, this book also provides astonishing insights for a solution that could create abundance for all people. This is a must read if you want to survive the global monetary transformation that’s under way right now.  What's Happening to Our Money? It also describes the most likely transition into a new worldwide crypto-based currency, which will become the basis of our financial system. The financial transition into the cryptocurrency area marks one of the most significant changes in the history of money, and has the potential to end the control of central banks and governments.",
  "genres": [
    "Economics",
    "Nonfiction"
  ],
  "author": "Thomas Herold",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/39875112-the-money-deception---what-banks-governments-don-t-want-you-to-know"
}