{
  "title": "A Dirty Wedding Night",
  "description": "It wouldn’t be a rock star wedding without a whole lot of s*x…  It’s been one hell of a night at Cathedral Cove Resort. Love and lust are in the air, and rock star Jesse Mayes is just about to drag his bride, Katie, back to their luxurious cabin to celebrate in private.  But the newlyweds aren’t the only ones in the mood…  After all, sexy “wild card” Roni just disappeared into the dark with two hot, naked rock stars.  And Dirty's lead singer, Zane, just took off—also naked—into the woods, with the band's assistant manager, Maggie.  And what ever happened to that tall, dark and mysterious best man, Jude?  And where the heck is the groom’s poor ex-girlfriend and bandmate, Elle?  In this steamy must-read story collection, find out what happens (not always what you’d think!) when your favorite Dirty characters vanish into the night after the rock star wedding event of the year.  4 couples… 4 dirty stories  Included in A Dirty Wedding Night: \nA Dirty Vow\n \nA Dirty Secret\n \nA Dirty Lie\n \nA Dirty Deal\n  A Dirty Wedding Night is the 4th book in the Dirty series—a rockstar romance series about the members of the rock band Dirty and the women and men who love them.  Novels in the Dirty series are interconnected standalones, each with an HEA; other books (novella/story collection) are not necessarily HEA, but are essential pieces of the overall story arcs. (There are ongoing storylines that develop throughout the series; reading the books in order is not crucial but is HIGHLY recommended.)  Reading order: \nDirty Like Me (Dirty #1)\n Dirty Like Us (Dirty #0.5) (novella) \nDirty Like Brody (Dirty #2)\n A Dirty Wedding Night (Dirty #2.5) (story collection)",
  "genres": [
    "Romance",
    "Music",
    "Contemporary",
    "Novella",
    "Contemporary Romance",
    "Erotica",
    "New Adult"
  ],
  "author": "Jaine Diamond",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/39868414-a-dirty-wedding-night"
}