{
  "title": "Growing Good Food: A Citizen's Guide to Backyard Farming",
  "description": "Growing Good Food is a beginner’s guide to growing your own herbs, fruits, and vegetables using organic and sustainable practices. It’s for home gardeners who want to raise food on their own patch of soil—all while cultivating a microbe-rich, carbon-sucking, regenerative foodscape.Acadia Tucker, a regenerative farmer, gardener, and climate activist, invites us to think of gardening as civic action. By building organically-rich soil, even in a backyard, we can capture greenhouse gases, all while growing nutritious food. To help us get started, Tucker drafts plans for gardeners who have a little ground or a lot of it. She offers advice on how to prep and clear land, cultivate healthy soil, plant food from seeds, fend off pests and disease, and grow 21 popular perennials and annuals, including fruit trees, herbs, strawberries, peppers, tomatoes, cabbage, carrots, garlic, beans, peas, and potatoes. Tucker also describes the climate changes taking place in our own backyards, and the various steps we can take to boost a garden’s resilience.Growing Good Food includes calls to action and insights from leaders in the regenerative growing movement, including David Montgomery, Anne Biklé, Gabe Brown, Wendell Berry and Mary Berry, and Tim LaSalle. By the end of this book, you'll know how to grow some really good food, and build a healthier world, too.\"Acadia Tucker tells us that what we do matters and if we have access to any piece of ground we can start addressing climate change. My father, Wendell Berry, says that this kind of work is radical now, when public attention is focused on global solutions. This work is what people are for.” -Mary Berry, New Castle, Kentucky",
  "genres": [
    "Gardening",
    "Nonfiction",
    "Food",
    "Cookbooks",
    "Sustainability",
    "Health",
    "Agriculture"
  ],
  "author": "Acadia Tucker",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/39873680-growing-good-food"
}