{
  "title": "Going to the Mountain: Life Lessons from My Grandfather, Nelson Mandela",
  "description": "The first-ever book to tell Nelson Mandela's life through the eyes of the grandson who was raised by him, chronicling Ndaba Mandela's life living with, and learning from, one of the greatest leaders and humanitarians the world has ever known. To the rest of the world, Nelson Mandela was a an anti-apartheid revolutionary, a world-renowned humanitarian, and South Africa's first black president. To Ndaba Mandela, he was simply \"Granddad.\" In Going to the Mountain, Ndaba tells how he came to live with Mandela shortly after he turned eleven--having met each other only once, years before, when Mandela was imprisoned at Victor Verster Prison -- and how the two of them slowly, cautiously built a relationship that would affect both their lives in extraordinary ways. It wasn't an easy transition. Mandela had high expectations for those around him, especially his family, and Ndaba chafed at the strict rules and exacting guidelines in his grandfather's home. But at the same time -- through overheard calls from foreign dignitaries as well as the Xhosa folk wisdom that his grandfather shared with him at every opportunity -- Ndaba was learning how to be a man. On a scale both personal and epic, Ndaba's extraordinary journey mirrors that of South Africa's coming of age -- from the segregated Soweto ghettos into which he was born to the privileged life in which he grew up and the turbulent yet exciting times in which he carries on his grandfather's legacy.Going to the Mountain is, in the end, a story about unlocking the power within each of us. It's a cautionary tale about how a child's life can go one way or the other, depending upon the intervention of a caring soul--and about the awesome power of love to serve as a catalyst for change.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Africa",
    "South Africa",
    "Biography",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Ndaba Mandela",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/39864206-going-to-the-mountain"
}