{
  "title": "Marine, Public Servant, Kansan: The Life of Ernest Garcia",
  "description": "For Ernest \"Ernie\" Garcia, the American dream began in Mexico more than a hundred years ago. Ernie, raised in Kansas, became the US Senate sergeant at arms and escorted President Ronald Reagan to the podium to deliver the State of the Union address. After the president's speech, Ernie reflected on his family's long and arduous journey from Zacatecas to El Paso to Kansas as well as on his presence in the Capitol alongside the president, Congress, and the Supreme Court. He was certain his ancestors never imagined that their dreams would lead him to the White House.Ernie's experience as sergeant at arms is just one chapter in the inspiring life story told in this book. Drawing upon oral histories recounted by family members, friends, and Ernie himself, Dennis Raphael Garcia reaches back to the travails and grit of great-grandfather Pedro as he made his way to the American heartland with his son Jose. Like so many immigrants with courage and determination, they found great hardship but also great opportunity. A decade of field labor, the Great Depression, the Dust Bowl, and two world wars laid the groundwork for Ernie's story. Marine, Public Servant, Kansan describes how this Mexican American boy, fatherless at a young age and facing discrimination, found his way to a place alongside a senator and a president through hard work and education--and some basketball. Along the way he realized his own ambition to become an officer in the Marine Corps. The book follows Ernie through both Iraq wars to his service, even in retirement, as superintendent of the Kansas State Highway Patrol.In Marine, Public Servant, Kansan, the remarkable character of not just one Kansan son of Mexican immigrants, but also the immigrant experience itself is eloquently and poignantly weaved into the story of Ernie and his family's American dream.",
  "genres": [],
  "author": "Dennis Raphael Garcia",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/39868841-marine-public-servant-kansan"
}