{
  "title": "Scottish Brides",
  "description": "A land of legend and wild beauty--of clans, lairds, honor, and passion--Scotland forever stirs the soul to romance. Now, in one incomparable volume, four of Avon Romance's bestselling authors present stirring tales of hearts won and weddings to be, featuring a quartet of unforgettable heroines about to discover the rapture of love in a world as untamed as the men they will one day marry.Displaying the bold and breathtaking sensuality that is her hallmark, bestselling author CHRISTINA DODD enthralls us with the tale of a willful Scottish beauty--kidnapped by an arrogant yet irresistible Englishman--who fights to keep from succumbing to her brazen captor's passionate, and persuasive, proposal.Experience the fiercely emotional power of STEPHANIE LAURENS who is at her passionate best with this story of a wealthy gentleman who finds his childhood nemesis has blossomed into a most desirable lass--and he's determined to do everything in his power to claim her as his own, before she is quite unsuitably wed.The delightful wit and warm humor of JULIA QUINN shine brightly in this winning romantic romp, in which a lovely English miss--feigning marriage to a dashing, beguiling Scotsman--discovers she has a very real desire for her make-believe groom.Another strikingly dramatic and deeply compelling tale by KAREN RANNEY. A legend decrees that the sexy Laird of Sinclair must marry a woman he has never met. But only sweet, passion-filled love will him to his true--and forbidden--bride.stories are:Under the Kilt (Fairchild Family #2.5) by Christina Dodd (Hadden Fairchild finds romance and adventure in the wild Scottish highlands as he chases down the legend of the Marriage Kilt … and Lady Andra MacNachtan)Rose in Bloom by Stephanie LaurensGretna Greene by Julia QuinnThe Glenlyon Bride by Karen Ranney",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Anthologies",
    "Regency",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Christina Dodd",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/398647.Scottish_Brides"
}