{
  "title": "Lots of Bullies in High School",
  "description": "Word Count: Over 37,500+  One of the reasons I decided to write this series is because of the rampant bullying and mistreatment which goes on day to day in our schools. I created an interesting character to help highlight and give a different perspective to some of these situations. I will try to highlight the insensitiveness and the often two-faced way in which individuals look at things and even authority figures like school administrators. The administration in a school is not unlike the leadership in companies.  Every day we see people doing things or saying things that hurt others. Do you take the easier road of ignoring things and not getting involved? When someone gets hurt or feels like an outcast or feels like the world is out to get them, do you have any responsibility?  Many of the situations portrayed are based on real incidents in real schools but presented in a fictional manner to try to raise awareness and trigger discussion. If you find yourself asking questions and considering changes in your own attitudes or behavior, then pass the book on to others in the hope it will help them also.  The main character Drew is a male whose body experienced gynecomastia which resulted in his growing breasts. He hid these breasts for a while. With the help of a friend named Lacy, he is now embracing his breasts and cross-dressing to go to school looking like a girl. No one knows this except Lacy, his parents, and his doctors. This gives Drew a unique perspective on many of the situations he encounters. Finally, there are inklings of romance between Drew and his friend Lacy.  The author hopes that the reader will embrace the key characters and want to know what happens next. Like many other stories, the author tries to create likable main characters who care about others.  Given the ages of the characters, the story does not involve explicit sex. Young adult readers should be comfortable reading this book.  Enjoy Daring Diane  Disclaimer This story is a work of fiction. Names, characters, businesses, places, events, locales, and incidents are either the products of the author’s imagination or used in a fictitious manner. Any resemblance to actual persons, living or dead, or actual events is purely coincidental.",
  "genres": [
    "Young Adult",
    "Transgender"
  ],
  "author": "Daring Diane",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/39888325-lots-of-bullies-in-high-school"
}