{
  "title": "The Gown",
  "description": "“Millions will welcome this joyous event as a flash of color on the long road we have to travel.”—Sir Winston Churchill on the news of Princess Elizabeth’s forthcoming weddingLondon, 1947: Besieged by the harshest winter in living memory, burdened by onerous shortages and rationing, the people of postwar Britain are enduring lives of quiet desperation despite their nation’s recent victory. Among them are Ann Hughes and Miriam Dassin, embroiderers at the famed Mayfair fashion house of Norman Hartnell. Together they forge an unlikely friendship, but their nascent hopes for a brighter future are tested when they are chosen for a once-in-a-lifetime honor: taking part in the creation of Princess Elizabeth’s wedding gown.Toronto, 2016: More than half a century later, Heather Mackenzie seeks to unravel the mystery of a set of embroidered flowers, a legacy from her late grandmother. How did her beloved Nan, a woman who never spoke of her old life in Britain, come to possess the priceless embroideries that so closely resemble the motifs on the stunning gown worn by Queen Elizabeth II at her wedding almost seventy years before? And what was her Nan’s connection to the celebrated textile artist and holocaust survivor Miriam Dassin?With The Gown, Jennifer Robson takes us inside the workrooms where one of the most famous wedding gowns in history was created. Balancing behind-the-scenes details with a sweeping portrait of a society left reeling by the calamitous costs of victory, she introduces readers to three unforgettable heroines, their points of view alternating and intersecting throughout its pages, whose lives are woven together by the pain of survival, the bonds of friendship, and the redemptive power of love.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Audiobook",
    "British Literature",
    "Adult Fiction"
  ],
  "author": "Jennifer Robson",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/39893613-the-gown"
}