{
  "title": "My Mother's Persian Stories: Folk tales for all ages in English and Farsi",
  "description": "My Mother’s Persian Stories is a collection of thirty bedtime stories told by the author’s mother to her many children as they were growing up in Shiraz, Iran. Fearing that these stories would disappear forever, the author and his wife decided to collect them and write them down. They collaboratively wrote in both Persian and English to create a bilingual book, capturing both western and eastern storytelling while keeping the original flavor of Persian folk tales. Some of the stories in this collection are based on ancient Persian mythology, some are mystical, some are humorous, and some are perhaps allusions to actual historical events. They encompass the many religions and sects of Iranian culture in simple, beautiful tales.The illustrations use a mixed media approach that combine pictures and drawings. Most have Persian elements, such as a Persian carpet, or Persian motifs found in the ancient Persepolis ruins near Shiraz, with a hint of classic Persian miniatures. My Mother’s Persian Stories is an ideal Nowruz gift for the Persian New Year, or any time of the year. The bilingual format is perfect for learning English in an interesting and enjoyable way. It is a collection that encompasses both east and west in the simplicity of folk stories that can be enjoyed by those who are young or old, from any walk of life, and of any background. About the AuthorsSaeid Shammass grew up in Shiraz, Iran one of the youngest of ten siblings. He recalls his childhood with nostalgia, remembering the warm and loving environment created by his mother’s bedtime stories. Saeid has always loved drawing and painting. This is his first set of book illustrations, and many of the drawings represent images that he imagined while listening to these stories as a child.Shaunie Shammass grew up in Edmonton, Canada. She has a doctorate in linguistics and has always loved language and literature. Shaunie’s other main interest is music composition. She has composed orchestral music for dancers and a storyteller, called GreenRobe, based on the second story in this collection. Saied and Shaunie met at the University of Alberta, Edmonton, Canada and were married in 1978. They have two children, who have also loved hearing these stories before going to bed. And now, they have a grandson, who will certainly love to hear them as well.",
  "genres": [
    "Short Stories"
  ],
  "author": "Saeid Shammass",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/39886264-my-mother-s-persian-stories"
}