{
  "title": "hAurorae. The recalling or the retelling of the many Pasts made Present & Whole again.",
  "description": "• By Gabriel McCaughry (Editor-in-chief of Anathema Publishing Ltd.)• Preface by Shani Oates (Maid of the Clan of Tubal Cain, and author of Tubelos Green Fire, Crafting the Arte of Tradition, and The Devils Supper)• Thoroughly illumined by the talented artist José Gabriel Alegría Sabogal (Handbook of Sacred Anatomy, and A Second Nature)(h)Auroræ is a mystifying, albeit utterly profound journey. Part ontological synthesis, philosophical rambling, magickal diary, visual grimoire, inspired mystical poem, revelatory/individuation process, and part alchemical vessel of expression, the book exists under the umbrella of what the author refers to as Gnostic Luciferianism. First and foremost, however, (h)Auroræ exists as an act of eternal remembrance.“This alchemical treatise walks us through a startling expression of emotive gnosis… (h)Auroræ seeks beyond and above the all-too-human condition in order to understand it, and advance it vis-à-vis a sensual Sophianic psychology, witnessed in cogitation. Mind in tandem with vision, incorporates a veiled process of subtle Jungian analysis leading to a Grail quest, of intent to remove the blindfold from the Holy Fool… A work of pilgrimage, conjunction and apotheosis, it directs the reader through pause, anticipation and intake. Sometimes rapturous, sometimes ponderous.”  (~Shani Oates, Preface to (h)Aurorae.)G. McCaughry writes:“This Opus Alchymicum is presented in a certain “light” and, at its core, (h)Auroræ is centred on the sempiternal theosophical discourse which sparks anew the Flame of Old within the heart of the predisposed reader, struggling, yet inclined, to separate the subtil from the dross so that we may uncover our inner philosophers stone or perfected being.“Tis a work of Agapae, in the purest sense of the words“This manuscript, far from being a modern-day grimoire by any means, is, primarily, a mystical handbook. A useful resource to have by ones side upon undertaking an initiatory odyssey on the Path of Exile & Exalt – regardless of which favoured system or tradition the practitioner employs.”(h)Auroræ is Gabriel McCaughrys first published manuscript, a tome which correlates directly with Anathema Publishings mandate, and his views and methodologies on alchemical book-making. This is very much a continuation in the spirit of his previous contributions to the PILLARS occult periodical (and elsewhere), but within (h)Auroræ these concepts are fully developed and actualized.“A supreme work of Beauty, in every sense of that aesthetic. A sublime work of Arte, in every sense of that metaphysic. In short, a meditational treatise of transformative alchemy of – and for – the Soul.”  (~Shani Oates)¶ Hardcover Standard Edition (limited to approx. 500 copies):5.25 x 8.5 inches. 304 pages. Hardbound 100pts, Tele Legatoria Bronze bookbinding Cloth from Italy. Gold foil blocking on rounded spine and on the cover. Colour interior, with fully illustrated Endpapers. Thoroughly illustrated throughout by José Gabriel Alegría Sabogal, Fine typography, printed on Cougar Natural 160M archive-quality paper. Individually hand-numbered.",
  "genres": [
    "Occult",
    "Magick",
    "Alchemy"
  ],
  "author": "Gabriel McCaughry",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/39893030-haurorae-the-recalling-or-the-retelling-of-the-many-pasts-made-present"
}