{
  "title": "Lean Impact: How to Innovate for Radically Greater Social Good",
  "description": "Despite enormous investments of time and money, are we making a dent on the social and environmental challenges of our time? What if we could exponentially increase our impact?Around the world, a new generation is looking beyond greater profits, for meaningful purpose. But, unlike business, few social interventions have achieved significant impact at scale. Inspired by the modern innovation practices, popularized by bestseller The Lean Startup, that have fueled technology breakthroughs touching every aspect of our lives, Lean Impact turns our attention to a new goal - radically greater social good.Social change is far more complicated than building a new app. It requires more listening, more care, and more stakeholders. To make a lasting difference, solutions must be embraced by beneficiaries, address root causes, and include an engine that can accelerate growth to reach the scale of the need. Lean Impact offers bold ideas to reach audacious goals through customer insight, rapid experimentation and iteration, and a relentless pursuit of impact.Ann Mei Chang brings a unique perspective from across sectors, from her years as a tech executive in Silicon Valley to her most recent experience as the Chief Innovation Officer at USAID. She vividly illustrates the book with real stories from interviews with over 200 organizations across the US and around the world.Whether you are a nonprofit, social enterprise, triple bottom line company, foundation, government agency, philanthropist, impact investor, or simply donate your time and money, Lean Impact is an essential guide to maximizing social impact and scale.",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership",
    "Entrepreneurship",
    "Self Help",
    "Productivity",
    "Audiobook"
  ],
  "author": "Ann Mei Chang",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/39892123-lean-impact"
}