{
  "title": "Deadmarsh Fey",
  "description": "Flesh and bone and hearts unknown, lead to the rath and your fate will be shown…  Deadmarsh. The name struck terror into the hearts of all who heard it. But to Roger Knightley, neither Deadmarsh the house, nor Deadmarsh the family, had ever been anything to fear. Nearly each summer of his young life had been spent in that manor on the moors, having wild adventures with his cousin, Lockie, the Deadmarsh heir. This year should have been no different, but when Roger arrives, he finds everything, and everyone, changed. The grounds are unkempt, the servants long gone. Kip, the family cat, has inexplicably grown and glares at Roger as if he is trying to read the boy’s mind. Roger’s eldest cousin, Travers, always treated as a servant, now dresses like a duchess and wears round her neck a strange moonstone given to her by someone known as Master Coffyn, who has taken over the teaching of Lockie at a school in Wales called Nethermarrow.  And soon after he crosses the threshold of Deadmarsh, Roger discovers that Coffyn has overtaken Lockie. The boy is deceitful, riddled with fear, and has returned bearing tales of creatures called Jagged Ones that claim to be of the Fey and can somehow conceal themselves while standing in the full light of the moon. What they want with Lockie, Roger cannot fathom, until the horror within his cousin lashes out, and it becomes savagely clear that these Jagged Ones and the Dark Wreaker they serve are not only after Lockie and Travers, but Roger, too.  Joining forces with an ally whose true nature remains hidden, Roger seeks to unravel the tapestry of lies woven round his family’s connection to the death-haunted world of Everl’aria—and the Dark Wreaker who calls it home. The deeper Roger delves into the past, the more he begins to suspect that the tales of dark deeds done in the forest behind Deadmarsh, deeds in which village children made sacrifice to an otherworldly beast and were never seen or heard from again, are true. And if there is truth in these outlandish stories, what of the rumor that it was not an earthquake which rocked the moors surrounding Deadmarsh sixteen years ago, but a winged nightmare attempting to break free of its underground prison? Enlisting the aid of a monster equipped with enough inborn firepower to blast his enemies into oblivion might be as suicidal as Roger’s friends insist, yet the boy knows he needs all the help he can get if there is to be any hope of defeating not only the Dark Wreaker and his servants, but an unholy trinity known as the Bear, the Wolf, and the Curse That Walks The Earth.  And then there is the foe named Blood Wood, who might be the deadliest of them all.  Racing against time, Roger must find a way to end the battle being waged across worlds before the night of Lockie’s eleventh birthday—two days hence. If he fails, blood will drown the earth. And Roger and his entire family will fulfill the prophecy of fey’s older, more lethal meaning…  Fated to die.",
  "genres": [
    "Fantasy",
    "Horror",
    "Dark Fantasy"
  ],
  "author": "Melika Dannese Hick",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/39889091-deadmarsh-fey"
}