{
  "title": "Whisper",
  "description": "The truth is complicated.On September 11th, 2001, Kris Caldera was a junior member of the CIA's Alec Station, the unit dedicated to finding and stopping Osama Bin Laden.They \nfailed.\nTen days later, he was on the ground in Afghanistan with a Special Forces team, driven to avenge the ghosts that haunted him and the nation he'd let down. On the battlefield, he meets Special Forces Sergeant David Haddad. David - Arab American, Muslim, and gay - becomes the man Kris loves, the man he lives for, and the man he kills for, through the long years of the raging wars.David Haddad thought he'd be an outsider his whole life. Too American for the Middle East, too Arab for America, and too gay to be Muslim. It took Kris to bring the parts of himself together, to make him the man he'd always wanted to be. But the War on Terror wreaks havoc on David's soul, threatening to shatter the fragile peace he's finally found with Kris.When a botched mission rips David from Kris's life, Kris's world falls into ruin and ash. A shell of the man who once loved with the strength to shake both the CIA and the world, he marks time on the edges of his life. The days bleed together, meaningless after losing the love of his life.After being captured, tortured to the edge of his life, and left for dead by his comrades, David doesn't know how much of himself is left. He vanished one day in the tribal belt of Pakistan, and the man who walks out almost a decade later is someone new: Al Dakhil Al-Khorasani.But strange rumblings are whispering through the CIA. Intelligence from multiple sources overseas points to something new. Something deadly, and moving to strike the United States. Intercepts say an army from Khorasan, the land of the dead where the Apocalypse of Islam will rise, is coming.And, at the head of this army, a shadowy figure the US hasn't seen before: Al Dakhil Al-Khorasani.David is coming \nhome.",
  "genres": [
    "M M Romance",
    "Military Fiction",
    "Romance",
    "Contemporary",
    "Suspense",
    "Audiobook",
    "LGBT"
  ],
  "author": "Tal Bauer",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/39911958-whisper"
}