{
  "title": "Israel on the Appomattox: A Southern Experiment in Black Freedom from the 1790s Through the Civil War",
  "description": "Thomas Jefferson condemned slavery but denied that whites and liberated blacks could live together in harmony. Jefferson’s young cousin Richard Randolph and ninety African Americans set out to prove the sage of Monticello wrong. When Randolph died in 1796, he left land for his formidable bondman Hercules White and for dozens of other slaves. Freed, they could build new lives there alongside white neighbors and other blacks who had gained their liberty earlier.Fittingly, the Randolph freedpeople called their promised land Israel Hill. These black Israelites and other free African Americans established farms, plied skilled trades, and navigated the Appomattox River in freight-carrying “batteaux.” Hercules White’s son Sam and other free blacks bought and sold boats, land, and buildings, and they won the respect of whites.Melvin Patrick Ely captures a series of remarkable personal and public free black and white people do business with one another, sue each other, work side by side for equal wages, join forces to found a Baptist congregation, move West together, and occasionally settle down as man and wife. Even still-enslaved blacks who face charges of raping or killing whites sometimes find ardent white defenders.Yet slavery’s long shadow darkens this landscape in unpredictable ways. After Nat Turner’s slave revolt, county officials confiscate and auction off free blacks’ weapons–and then vote to give the proceeds to the blacks themselves. One black Israelite marries an enslaved woman and watches, powerless, as a white master carries three of their children off to Missouri; a free black miller has to bid for his own wife at a public auction. Proslavery hawks falsely depict Israel Hill to the nation as a degenerate place whose supposed failure proves blacks are unfit for freedom. The Confederate Army compels free black men to build fortifications far from home, until Lee finally surrenders to Grant a few miles from Israel Hill.Ely tells a moving story of hope and hardship, of black pride and achievement. He shows us an Old South we hardly know, where ties of culture, faith, affection, and economic interest crossed racial barriers–a society in which, ironically, many whites felt secure enough to deal fairly and even cordially with free African Americans partly because slavery still held most blacks firmly in its grip.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "African American",
    "Civil War",
    "Historical"
  ],
  "author": "Melvin Patrick Ely",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/1230298.Israel_on_the_Appomattox"
}