{
  "title": "Underworld",
  "description": "Finalist for the Pulitzer PrizeFinalist for the National Book AwardFinalist for the National Book Critics Circle AwardWinner of the Howell’s Medal of the American Academy of Arts and LettersOne of The New York Times Book Review ’s 10 Best Books“A great American novel, a masterpiece, a thrilling page-turner.” — San Francisco Chronicle*With a new preface by Don DeLillo on the 25th anniversary of publication*Don DeLillo's mesmerizing novel was a major bestseller when it was published in 1997 and was the most widely reviewed novel of the year. It opens with a legendary baseball game played between the Brooklyn Dodgers and the New York Giants in 1951. The home run that won the game was called the Shot Heard Round the World, and was shadowed by the terrifying news that on the same day, Russia tested its first hydrogen bomb. Underworld then tells the story of Klara Sax and Nick Shay, and of a half century of American life during the Cold War and beyond.“A dazzling, phosphorescent work of art.” — Michiko Kakutani, The New York Times“This is a novel that draws together baseball, the Bomb, J. Edgar Hoover, waste disposal, drugs, gangs, Vietnam, fathers and sons, comic Lenny Bruce and the Cuban Missile Crisis. It also depicts passionate adultery, weapons testing, the care of aging mothers, the postwar Bronx, '60s civil rights demonstrations, advertising, graffiti artists at work, Catholic education, chess and murder. There's a viewing of a lost Eisenstein film, meditations on the Watts Tower, an evening at Truman Capote's Black & White Ball, a hot-air balloon ride, serial murders in Texas, a camping trip in the Southwest, a nun on the Internet, reflections on history, one hit (or possibly two) by the New York mob and an apparent miracle. As DeLillo says and proves, ‘Everything is connected in the end.’\" — Michael Dirda, The Washington Post Book World“ Underworld is an amazing performance, a novel that encompasses some five decades of history, both the hard, bright world of public events and the more subterranean world of private emotions. It is the story of one man, one family, but it is also the story of what happened to America in the second half of the 20th century.” — The New York Times“Astonishing…A benchmark of twentieth-century fiction, Underworld is stunningly beautiful in its generous humanity, locating the true power of history not in tyranny, collective political movements or history books, but inside each of us.” —Greg Burkman, The Seattle Times“It’s hard to imagine a way people might better understand American life in the second half of the twentieth century and beginning of the twenty-first than by reading Don DeLillo. The scale of his inquiry is global and historic… His work is astounding, made of stealthy blessings… it proves to my generation of writers that fiction can still do anything it wants.” —Jennifer Egan, in her presentation of the Medal for Distinguished Contribution to American Letters“ Underworld is a page-turner and a masterwork, a sublime novel and a delight to read.” —Joan Mellen, The Baltimore Sun",
  "genres": [
    "Fiction",
    "Novels",
    "Literature",
    "Literary Fiction",
    "American",
    "Classics",
    "Historical Fiction"
  ],
  "author": "Don DeLillo",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/399.Underworld"
}