{
  "title": "100 Common Sense Policies to make BRITAIN GREAT again",
  "description": "Our way of life is under threat from a hidden enemy, and the people who are trying to destroy our country never take a day off, so if we hope to make BRITAIN GREAT again, neither should you or I.People in this country are getting angry, and in this book I analyse their views and justify them in the words of the bloke who goes to football on a Saturday afternoon, enjoys a few pints with his mates before the game and puts the world to rights.I haven’t watered any of my Policies down, or bent them to suit the do-gooders, I promise you that. What I have done, however, is put full integrity into the writing of this book. You, like me, may feel something needs to be done about the following issues;•\tGrooming Gangs•\tTerrorist Activity•\tExtremism•\tFemale Genital Mutilation•\tModern Slavery•\tAcid Attacks•\tImmigration – respect for the home nation•\tImmigration – get a job!•\tRacism•\tStop ‘n’ Search – Knife Crime•\tRefugees •\tBurglary•\tThe Windrush Generation•\tEducation•\tThe NHS•\tBenefit Cheats•\tEx-Servicemen Sleeping Rough•\tBullies•\tReligion•\tThe Union JackI’ve no doubt there will be people who disagree with my Policies, and that’s okay. We’re not all supposed to agree. But there are issues right now that need addressing. We read about them in the papers, we listen to radio hosts discuss them on phone-in programmes and we talk about them to our mates at work and in the pub. I also speak to a lot of football supporters from various clubs and I know most are in accordance with my views.I am deadly serious that if the majority of the Policies I propose here were adopted, Great Britain would be a safer place to live and, of course, GREAT again. And isn’t this what we all want? A safer place for our children and our grandchildren?From time to time I tend to get a little frustrated in the book, and if my language upsets you then I apologise, but far better you read it with full emotion than a half-hearted attempt to hold myself in check. I hope you enjoy, and I hope my Policies give you something to believe in",
  "genres": [
    "Politics"
  ],
  "author": "Karl Wiggins",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/39912571-100-common-sense-policies-to-make-britain-great-again"
}