{
  "title": "Strong as Fire, Fierce as Flame",
  "description": "In 1857 India, 12-year-old Meera escapes a life she has no say in--and certain death on her husband's funeral pyre--only to end up a servant to a British general in the East India Company. When a rebellion against British colonizers spreads, she must choose between relative safety in a British household or standing up for herself and her people.India, 1857Meera's future has been planned for her for as long as she can remember. As a child, her parents married her to a boy from a neighboring village whom she barely knows. Later, on the eve of her thirteenth birthday, she prepares to leave her family to live with her husband's--just as her strict religion dictates. But that night, Indian soldiers mutiny against their British commanders and destroy the British ammunition depot, burning down parts of Delhi. Riots follow, and Meera's husband is killed. Upon hearing the news, Meera's father insists that she follow the dictates of their fringe religious sect: She must end her life by throwing herself on her husband's funeral pyre.Risking everything, Meera runs away, escaping into the chaos of the rebellion. But her newfound freedom is short-lived, as she is forced to become a servant in the house of a high-ranking British East India Company captain. Slowly through her work, she gains confidence, new friends, new skills--and sometimes her life even feels peaceful. But one day, Meera stumbles upon the captain's secret stock of ammunition, destined to be used by the British to continue colonizing India and control its citizens.Will Meera do her part to take down the British colonists and alert the rebellion of the stockpile? Or will she stay safe and let others make decisions for her? It really comes down to this: how much fire must a girl face to finally write her own destiny?",
  "genres": [
    "Historical Fiction",
    "Middle Grade",
    "Historical",
    "Fiction",
    "Young Adult",
    "India",
    "Juvenile"
  ],
  "author": "Supriya Kelkar",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/39908400-strong-as-fire-fierce-as-flame"
}