{
  "title": "On Editing: How to edit your novel the professional way",
  "description": "\"Highly On Editing is indispensable reading for anyone who is or wants to be a writer. Every desk should have a copy!\"- Dr Samantha J. Rayner, Director of the Centre for Publishing, UCL\"On Editing is a feast with many courses. When you have finished this book, you will feel encouraged, empowered, and indomitable. If you are writing-or editing-a novel, you could do no better than to have this book by your side. Comprehensive, easily digestible, it is a classic in the making.\" - Shaye Areheart, Director of the Columbia Publishing CourseWriting a novel is a magical but often difficult journey; and when your first draft is complete, that journey's not over. As the editing process gets underway, authors often find themselves in unfamiliar territory. What does it mean to 'map your plot'? How do you know if you're 'head-hopping'? When is your novel ready to send out to agents, and how do you make each submission count? Written by the team behind one of the world's most successful literary consultancies, On Editing will show you how to master the self-edit. You will learn to compose, draft, and edit while sharpening your writing and ensuring that your novel is structurally sound, authentic, well-written, and ready for submission.On Editing will help you harness your creative potential, transform the way you think about your writing, and revolutionise your editorial process.\"It's easy for writers to be overwhelmed by the technicalities of writing, editing and getting published, but Helen Corner-Bryant and Kathryn Price share their decades of experience nurturing writers in On Editing. They know all the problems and how to fix them - including many you might not even think of - and explain it all in a clean, jargon-free, way that demystifies the whole process, with infectious enthusiasm that will have you ready, eager and bursting with the confidence to take your writing to the next level.\" - Writing Magazine",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference"
  ],
  "author": "Helen Corner-Bryant",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/39914417-on-editing"
}