{
  "title": "The Last Child - Part 1",
  "description": "From the acclaimed author of the Dead Camp series of books, Sean Kerr, comes a contemporary horror thriller that delves into the fascinating world of religious conspiracy theory to deliver a terrifying new story of occult mystery.  'If Derek had been facing the window, he would have seen it, the figure standing behind the lower pane, watching him through the darkened glass. It was nothing but a blurred outline behind the frilly lace curtain, but it was there, its head juddering violently from side to side until it became indistinguishable from the lace that concealed it.'  Some children are born for a purpose.  Samuel is having a tough time of it in school as he is tormented by a vicious gang of bullies, but it is nothing compared to the torture of his home life. Every night he hopes that his friend will take him away from his horrors, a friend he calls the Universe, a constant voice that speaks to him in his darkest moments. At least the Universe loves him.  As his teacher, Christina King wants so much to help Samuel, but she’s haunted by her own horrific childhood and the monstrous tragedy that stole her youth. She feels drawn to the young boy, she understands his pain, but she has no idea of the nature of the true horror that binds them in a vicious game of tug and war.  There is only one group of people who know the truth about Christina and Samuel, a sinister group of watchers who have observed them all their lives, a group known as 'I Tredici'. They have been waiting for centuries, and as the signs of the oncoming apocalypse reveal themselves in blood and brutal murder, they know the ancient war is upon them at last. Only they understand the roles that Christina and Samuel must play in the coming days, and only they know how the outcome will change the course of history forever.  For Christina, this is the start of her journey towards a terrible truth, but for Samuel, it is the start of a new and terrifying existence.",
  "genres": [
    "Horror"
  ],
  "author": "Sean Kerr",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/39914439-the-last-child---part-1"
}