{
  "title": "Darkness Falls",
  "description": "If the lights go out forever, can love survive?When four women from different walks of life are brought together by fate to witness the end of the world as they know it, each must find a way to survive against the odds as well as learn to rely on each other. Jackie Scott wields incredible influence as a magazine executive in Seattle. As she plans a smashing party for her fortieth birthday, everything is precisely as she wants it. But when a solar storm lights up the night sky in a dazzling display, it not only ruins the party but destroys power around the planet and Jackie must turn for help from the one woman she has tried so hard not to want … Taylor. Taylor Barnes is an Army veteran new to Seattle and wants nothing more than to find some peace and quiet working as a rent-a-cop in a corporate high-rise. When she is asked to attend the birthday party of the building's powerful and sexy CEO, she can hardly say no. Little did she realize every skill she ever learned would be put to the test to save the woman she can't seem to stop thinking about … Jackie. Anna Patten is a nurse practitioner who has returned one last time to the town she ran away from to pack up the house where she grew up. Trying to avoid any drama, she cannot get away fast enough, or so she tells herself while her heart wonders about her high school crush. When fate lands them together in Seattle at a birthday party, suddenly Anna must lean on the woman she once left behind … Lexi. Lexi Scott has built a simple life of writing novels and remodeling her farmhouse, but when she runs into a long-lost friend, her world is turned upside down. It's not until she attends her sister Jackie's birthday party that she is forced to not only face the apocalypse but now she must decide if she is willing to risk her heart again to save the only woman she ever loved ... Anna. The end of the world is only the beginning.If you like a story with romance and adventure, mixed with conflict and heroism, then you will love KC Luck’s page-turning new book. Explore the world of “Darkness Falls” today!Note: This is a full-length, stand-alone novel with a science fiction/end-of-the-world theme, but is significantly more focused on strong female characters in a loving lesbian relationship.",
  "genres": [
    "Romance",
    "Science Fiction",
    "Lesbian",
    "Post Apocalyptic",
    "Lesbian Romance",
    "Dystopia",
    "LGBT"
  ],
  "author": "K.C. Luck",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/39900623-darkness-falls"
}