{
  "title": "The Obesity Myth: Why America's Obsession with Weight is Hazardous to Your Health",
  "description": "Is your weight hazardous to your health? According to public-health authorities, 65 percent of us are overweight. Every day, we are bombarded with dire warnings about America’'s “obesity epidemic.” Close to half of the adult population is dieting, obsessed with achieving an arbitrary “ideal weight.” Yet studies show that a moderately active larger person is likely to be far healthier (and to live longer) than someone who is thin but sedentary. And contrary to what the fifty-billion-dollar-per-year weight-loss industry would have us believe medical science has not yet come up with a way to make people thin. After years spent scrutinizing medical studies and interviewing leading doctors, scientists, eating- disorder specialists, and psychiatrists, Professor Paul Campos is here to lead the backlash against weight hysteria— -- and to show that we can safeguard our health without obsessing about the numbers on the scale. But The Obesity Myth is not just a compelling argument, grounded in the latest scientific research; it’s also a provocative, wry expose of the culture that feeds on our self-defeating war on fat. Campos will show: * How the nation’s most prestigious and trusted media sources consistently misinform the public about obesity * What the movie industry’s love affair with the “fat suit” tells us about the relationship between racial- and body-based prejudice in America * How the skinny elite—with their “supersized” lifestyles and gas-guzzling SUVs —project their anxieties about overconsumption on the poorer and heavier underclass * How weight-loss mania fueled the impeachment of Bill Clinton In this paradigm-busting read, Professor Campos challenges the conventional wisdom regarding the medical, political, and cultural meaning of weight and brings a rational and compelling new voice to America’s increasingly irrational weight debate.",
  "genres": [
    "Nonfiction",
    "Health",
    "Science",
    "Fat Studies",
    "Feminism",
    "Fat",
    "Fat Acceptance"
  ],
  "author": "Paul Campos",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/399147.The_Obesity_Myth"
}