{
  "title": "The Bread Baker's Apprentice: Mastering the Art of Extraordinary Bread",
  "description": "Co-founder of the legendary Brother Juniper’s Bakery, author of ten landmark bread books, and distinguished instructor at the world’s largest culinary academy, Peter Reinhart has been a leader in America’s artisanal bread movement for more than thirty years. Never one to be content with yesterday’s baking triumph, however, Peter continues to refine his recipes and techniques in his never-ending quest for extraordinary bread. In this updated edition of the bestselling , Peter shares bread breakthroughs arising from his study in France’s famed boulangeries and the always-enlightening time spent in the culinary college kitchen with his students. Peer over Peter’s shoulder as he learns from Paris’s most esteemed bakers, like Lionel Poilâne and Phillippe Gosselin, whose has revolutionized the art of baguette making. Then stand alongside his students in the kitchen as Peter teaches the classic twelve stages of building bread, his clear instructions accompanied by more than 100 step-by-step photographs. You’ll put newfound knowledge into practice with fifty master formulas for such classic breads as rustic ciabatta, hearty , old-school New York bagels, and the book’s Holy Grail—Peter’s version of the famed ,  as well as three all-new formulas. En route, Peter distills hard science, advanced techniques, and food history into a remarkably accessible and engaging resource that is as rich and multitextured as the loaves you’ll turn out. In this revised edition, he adds metrics and temperature conversion charts, incorporates comprehensive baker’s percentages into the recipes, and updates methods throughout. This is original food writing at its most captivating, teaching at its most inspired and inspiring—and the rewards are some of the best breads under the sun.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Culinary",
    "Foodie"
  ],
  "author": "Peter Reinhart",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/39910.The_Bread_Baker_s_Apprentice"
}