{
  "title": "The White Indian Boy: The Story of Uncle Nick Among the Shoshones",
  "description": "What was life like to live among the Native Americans in the nineteenth century?\n  At twelve years old Elijah Nicholas Wilson ran away from his family.  Fighting off the constraints of his Mormon upbringing he found a new home with a Shoshone Indian tribe.  Under their guidance, particularly of the Great Chief Washakie, he learned how to live and survive in the wild lands of the far west.  But realising that he could not stay with his adopted family for ever he left the Shoshones and returned to his family as a teenager.  Those lessons that he learnt from the Native Americans stayed with him for the rest of his eventful life when he worked as a Pony Express rider, stagecoach driver, trapper, and whatever other job he could do to support his family  He never lost his connection with Native Americans and would frequently act as a translator and liaison between various tribes and the ever-encroaching United States.  The White Indian Boy is a fascinating memoir of a young boys life spent with a Shoshone tribe and how their love and teachings greatly influenced him throughout his later life.  Yet one account alone cannot answer the question of what life like to live among the Native Americans in the nineteenth century so the publisher has therefore included two other accounts of lives spent with Native American tribes in the nineteenth century, both with different subject matters and tones to Wilson’s account.  The first is J. W. Schultz’s  My Life as an Indian which covers his adult life with the Blackfeet, where he immersed himself in the ways of these Native Americans, assisting his friends in fighting rivals, hunting alongside them and even marrying Nat-ah’-ki, a Blackfoot woman.  The second follows the life of Nelson Lee who was captured by the Comanches and sold as a slave between various warriors before he was eventually able to make his escape in the mid-nineteenth century.  Together they should provide three different insights into what life was life among Native Americans in the nineteenth century.  Elijah Nicholas Wilson was known as \"Yagaiki\" when among the Shoshones, and in his later years as \"Uncle Nick\" when entertaining young children with his adventurous exploits. His book was first published in 1910 and he passed away in 1915.",
  "genres": [
    "History",
    "Nonfiction",
    "Native American",
    "Biography",
    "Autobiography",
    "Memoir",
    "Westerns"
  ],
  "author": "Elijah Nicholas Wilson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/39927044-the-white-indian-boy"
}