{
  "title": "Day",
  "description": "As the world changes around them, a family weathers the storms of growing up, growing older, falling in and out of love, losing the things that are most precious—and learning to go on—from the Pulitzer Prize–winning author of The HoursApril 5, 2019 : In a cozy brownstone in Brooklyn, the veneer of domestic bliss is beginning to crack. Dan and Isabel, troubled husband and wife, are both a little bit in love with Isabel’s younger brother, Robbie. Robbie, wayward soul of the family, who still lives in the attic loft; Robbie, who, trying to get over his most recent boyfriend, has created a glamorous avatar online; Robbie, who now has to move out of the house—and whose departure threatens to break the family apart. Meanwhile Nathan, age ten, is taking his first uncertain steps toward independence, while Violet, five, does her best not to notice the growing rift between her parents.April 5, 2020: As the world goes into lockdown, the brownstone is feeling more like a prison. Violet is terrified of leaving the windows open, obsessed with keeping her family safe, while Nathan attempts to skirt her rules. Isabel and Dan communicate mostly in veiled jabs and frustrated sighs. And beloved Robbie is stranded in Iceland, alone in a mountain cabin with nothing but his thoughts—and his secret Instagram life—for company.April 5, 2021: Emerging from the worst of the crisis, the family reckons with a new, very different reality—with what they’ve learned, what they’ve lost, and how they might go on.From the brilliant mind of Pulitzer Prize winner Michael Cunningham, Day is a searing, exquisitely crafted meditation on love and loss and the struggles and limitations of family life—how to live together and apart.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Audiobook",
    "Family",
    "LGBT",
    "Queer"
  ],
  "author": "Michael Cunningham",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/123033397-day"
}