{
  "title": "U. S. Grant: The Civil War Years: Grant Moves South and Grant Takes Command",
  "description": "Pulitzer Prize–winning historian Bruce Catton’s acclaimed two-book biography of complex and controversial Union commander Ulysses S. Grant.In these two comprehensive and engaging volumes, preeminent Civil War historian Bruce Catton follows the wartime movements of Ulysses S. Grant, detailing the Union commander’s bold tactics and his relentless dedication to achieving the North’s victory in the nation’s bloodiest conflict. While a succession of Union generals were losing battles and sacrificing troops due to ego, egregious errors, and incompetence in the early years of the war, an unassuming Federal army colonel was excelling in the Western theater of operations. Grant Moves South details how Grant, as commander of the Twenty-First Illinois Volunteer Infantry, though unskilled in military power politics and disregarded by his peers, was proving to be an unstoppable force. He won victory after victory at Belmont, Fort Henry, and Fort Donelson, while sagaciously avoiding near-catastrophe and ultimately triumphing at Shiloh. His decisive victory at Vicksburg would cost the Confederacy its invaluable the Mississippi River. Grant Takes Command picks up in the summer of 1863 when President Abraham Lincoln promoted Grant to the head of the Army of the Potomac, placing nothing less than the future of an entire nation in the hands of the military leader. Grant’s acute strategic thinking and unshakeable tenacity led to the crushing defeat of the Confederacy in the Overland Campaign in Virginia and the Siege of Petersburg. In the spring of 1865, Grant finally forced Robert E. Lee’s surrender at Appomattox Court House, ending the brutal conflict. Although tragedy struck only days later when Lincoln was assassinated, Grant’s triumphs on the battlefield ensured that the president’s principles of unity and freedom would endure. Based in large part on military communiqués, personal eyewitness accounts, and Grant’s own writings, this engrossing two-part biography offers readers an in-depth portrait of the extraordinary warrior and unparalleled strategist whose battlefield brilliance clinched the downfall of the Confederacy in the Civil War.",
  "genres": [
    "Civil War",
    "History",
    "Biography",
    "American History",
    "Nonfiction"
  ],
  "author": "Bruce Catton",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/39936775-u-s-grant"
}