{
  "title": "The Confessions of Frannie Langton",
  "description": "A servant and former slave is accused of murdering her employer and his wife in this astonishing historical thriller that moves from a Jamaican sugar plantation to the fetid streets of Georgian London--a remarkable literary debut with echoes of Alias Grace, The Underground Railroad, and The Paying Guests.All of London is abuzz with the scandalous case of Frannie Langton, accused of the brutal double murder of her employers, renowned scientist George Benham and his eccentric French wife, Marguerite. Crowds pack the courtroom, eagerly following every twist, while the newspapers print lurid theories about the killings and the mysterious woman being held in the Old Bailey.The testimonies against Frannie are damning. She is a seductress, a witch, a master manipulator, a whore.But Frannie claims she cannot recall what happened that fateful evening, even if remembering could save her life. She doesn’t know how she came to be covered in the victims’ blood. But she does have a tale to tell: a story of her childhood on a Jamaican plantation, her apprenticeship under a debauched scientist who stretched all bounds of ethics, and the events that brought her into the Benhams’ London home—and into a passionate and forbidden relationship.Though her testimony may seal her conviction, the truth will unmask the perpetrators of crimes far beyond murder and indict the whole of English society itself.The Confessions of Frannie Langton is a breathtaking debut: a murder mystery that travels across the Atlantic and through the darkest channels of history. A brilliant, searing depiction of race, class, and oppression that penetrates the skin and sears the soul, it is the story of a woman of her own making in a world that would see her unmade.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "LGBT",
    "Gothic",
    "Audiobook"
  ],
  "author": "Sara  Collins",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/39937621-the-confessions-of-frannie-langton"
}