{
  "title": "A Weird and Wild Beauty: The Story of Yellowstone, the World's First National Park",
  "description": "The summer of 1871, a team of thirty-two men set out on the first scientific expedition across Yellowstone. Through uncharted territory, some of the day’s most renowned scientists and artists explored, sampled, sketched, and photographed the region’s breathtaking wonders-from its white-capped mountain vistas and thundering falls to its burping mud pots and cauldrons of molten magma. At the end of their adventure, the survey packed up their specimens and boarded trains headed east, determined to convince Congress that the country needed to preserve the land from commercial development. They returned with “stories of wonder hardly short of fairy tales,” to quote the New York Times.With the support of conservationists such as Ralph Waldo Emerson, Henry David Thoreau, Frederick Law Olmsted, and John Muir, the importance of a national park was secured. On March 1, 1872, Ulysses S. Grant signed the Yellowstone Park Bill into law. It set aside over two million acres of one-of-a-kind wilderness as “a great national park for the benefit and enjoyment of people.” This important and fascinating book will introduce young adults to the astonishing adventure that led to “the best idea America ever had.” Today over 130 countries have copied the Yellowstone model, and billions of acres of critical habitat and spectacular scenery are being preserved for all of us to enjoy.This book has a wonderful ecological and historical message for readers ages 12 and up. No book about Yellowstone's founding has been written for this age group before, yet Yellowstone National Park is a major destination for many families, so many readers will likely have heard of Yellowstone or even have visited there. This is a great book for any school library or for history or science classrooms in middle and high school, where information can be used for research projects.",
  "genres": [
    "History",
    "Nonfiction",
    "Nature",
    "Travel",
    "Science",
    "Adult"
  ],
  "author": "Erin Peabody",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/39948809-a-weird-and-wild-beauty"
}