{
  "title": "Tengo miedo torero",
  "description": "Pedro Lemebel desafía todo intento catalogador. \"Irónico, sarcástico, salvajemente paródico, cursi, relamido, retorcido y, ademas, tierno, divertido y siempre intenso, abrumadoramente lírico,\" este escritor dirige su mirada a un universo poco o mal explorado entre nosotros: \"la identidad homosexual, la alternativa travesti y sus complejidades.\"Una historia de amor en el Santiago del '86, el año del atentado a Pinochet. Un muchacho del Frente Patriótico Manuel Rodríguez que va a participar en la acción, vive una relación sentimental con un gay, que lo apoya, sin saber-sabiéndolo, en sus planes políticos. Estos fracasan y la ligazón se frustra. El escenario es exactamente el del ano que pudo ser decisivo pero no lo fue: las protestas, los neumáticos humeando en las calles de la capital, los apagones; los boleros, rancheras y baladas de la época; Pinochet lidiando en la intimidad con sus fantasmas y sus pesadillas, y con una Lucia encaprichada con los últimos modelos de Nina Ricci; y la Loca del Frente, protagonista y testigo, personaje entrañable, puente entre los suenos y la desdicha.Tengo miedo torero es el verso de una antigua cancion que interpretaba Sara Montiel. Sus palabras sugieren, mas allá de \"su densa teatralidad\" y sus ecos melancólicos, la interioridad recóndita de un país que, según lo define Lemebel, \"suena muy poco, suena a crédito, no suena lo imposible.\"PEDRO LEMEBEL se dio a conocer en la década de los 80 como integrante del colectivo de arte conocido como \"Yeguas del Apocalipsis,\" que desarrolla en esos anos una destacada labor en fotografía, video e instalaciones, protagonizando algunas memorables performances. Su trabajo se concentra enseguida en la literatura,seduciendo casi de inmediato a críticos y lectores, que lo convierten en alguien cercano al escritor de culto. Introduce con sus crónicas un genero virtualmente inaugural en nuestras letras, haciendo del mundo urbano marginal -\"esos territorios en los que nadie se atreve a entrar\"-\"una construcción cultural y existencial poderosa.\" Dedica al sistema una devastadora visión critica, apoyándose en una escritura transgresora, torrencial, una suerte de fulgurante barroco popular.Su primer libro fue Incontables (1986), un breve volumen de cuentos, pero fue con La esquina es mi corazón. Crónica urbana (1995), que consiguió una inmediata notoriedad, alcanzando con su obra siguiente, Loco afán. Crónicas de sidario (1996), un reconocimiento definitivo. En 1997 apareció otro volumen de crónicas, De perlas y cicatrices. Aparte de haber sido adaptada exitosamente al teatro, Loco afán fue publicada en España, donde tuvo muy buena acogida crítica. Junto con ello, sus viajes a Estados Unidos, México y otros países, en los que ha participado en coloquios y conferencias, han afirmado su perfil de escritor con plena implantación a nivel tanto nacional como internacional. Lemebel es columnista regular de diversas publicaciones, entre ellas, Punto Final y The Clinic. En los años recientes ha gozado de becas otorgadas por el Consejo Nacional del Libro y la Lectura y la Fundación Guggenheim, gracias a las cuales ha podido avanzar en varios proyectos literarios. Entre ellos, la obra presente, Tengo miedo torero, su primera novela.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Historical Fiction",
    "Spanish Literature",
    "Latin American",
    "Romance"
  ],
  "author": "Pedro Lemebel",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/3994538-tengo-miedo-torero"
}