{
  "title": "Olympic Pride, American Prejudice: The Untold Story of 18 African Americans Who Defied Jim Crow and Adolf Hitler to Compete in the 1936 Berlin Olympics",
  "description": "In this “must-read for anyone concerned with race, sports, and politics in America” (William C. Rhoden, New York Times bestselling author), the inspirational and largely unknown true story of the eighteen African American athletes who competed in the 1936 Berlin Olympic Games, defying the racism of both Nazi Germany and the Jim Crow South.Set against the turbulent backdrop of a segregated United States, sixteen Black men and two Black women are torn between boycotting the Olympic Games in Nazi Germany or participating. If they go, they would represent a country that considered them second-class citizens and would compete amid a strong undercurrent of Aryan superiority that considered them inferior. Yet, if they stayed, would they ever have a chance to prove them wrong on a global stage? Five athletes, full of discipline and heart, guide you through this harrowing and inspiring journey. There’s a young and feisty Tidye Pickett from Chicago, whose lithe speed makes her the first African American woman to compete in the Olympic Games; a quiet Louise Stokes from Malden, Massachusetts, who breaks records across the Northeast with humble beginnings training on railroad tracks. We find Mack Robinson in Pasadena, California, setting an example for his younger brother, Jackie Robinson; and the unlikely competitor Archie Williams, a lanky book-smart teen in Oakland takes home a gold medal. Then there’s Ralph Metcalfe, born in Atlanta and raised in Chicago, who becomes the wise and fierce big brother of the group. From burning crosses set on the Robinsons’s lawn to a Pennsylvania small town on fire with praise and parades when the athletes return from Berlin, Olympic Pride, American Prejudice has “done the world a favor by bringing into the sunlight the unknown story of eighteen black Olympians who should never be forgotten. This book is both beautiful and wrenching, and essential to understanding the rich history of African American athletes” (Kevin Merida, editor-in-chief of ESPN’s The Undefeated).",
  "genres": [
    "History",
    "Sports",
    "Nonfiction",
    "Politics",
    "American History",
    "Audiobook",
    "Race"
  ],
  "author": "Deborah Riley Draper",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/39939278-olympic-pride-american-prejudice"
}