{
  "title": "Wednesday",
  "description": "The book's message: save the planet, find true love, trust in what you believe, have fun and make your own Happy Hours!New York Times bestselling author, Victoria Danann, adds some warlock wizardry to the captivating witch series.  Wednesday's not just a witch. She's a modern woman who doesn't like being told what to do. It's her turn for the spring rites, but she stuns the entire colony by saying no. She further befuddles everyone by refusing to give her reasons. Hoping she'll change her mind, they recruit her friends to apply pressure and proceed with plans as usual.The warlock, Rally, met Wednesday at a witches' gathering in Aspen. They barely spoke the entire weekend and he didn't think much of it until afterward, when he found himself waking during the night with her on his mind. He could track her down, but to what end? He certainly had no interest in a relationship lasting longer than forty minutes, but it had been months since the brief encounter and he was still being caught by friends, musing about Wednesday instead of listening.Then one day it came to him that she must have cast some kind of spell. That was all the reason he needed to track her down.Perhaps he expected to travel a great distance to find a compliant, cooperative, submissive female with inferior magics. One thing was certain. He was not prepared for an aloof witch who couldn't manage to care enough about the accusation to even pretend indignation. When she laughed in his face, said, \"Think what you want,\" and walked away, he was left standing with an open mouth and the ancient hunter's impulse to chase, the essential masculine principle, blooming to life. In his pants.PREORDER YOUR COPY TODAY and find out why readers call this series magical, enchanting, and witching good fun.",
  "genres": [
    "Paranormal Romance",
    "Magic",
    "Witches",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Adventure"
  ],
  "author": "Victoria Danann",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/39945019-wednesday"
}