{
  "title": "The Songs of Trees: Stories from Nature's Great Connectors",
  "description": "\"Here is a book to nourish the spirit. The Songs of Trees is a powerful argument against the ways in which humankind has severed the very biological networks that give us our place in the world. Listen as David Haskell takes his stethoscope to the heart of nature - and discover the poetry and music contained within.\" -- Peter Wohlleben, author of The Hidden Life of TreesThe author of the Pulitzer Prize finalist The Forest Unseen visits with nature's most magnificent networkers -- trees David Haskell's award-winning The Forest Unseen won acclaim for eloquent writing and deep engagement with the natural world. Now, Haskell brings his powers of observation to the biological networks that surround all species, including humans.Haskell repeatedly visits a dozen trees around the world to stop, listen, and look, exploring each tree's connections with webs of fungi, bacterial communities, cooperative and destructive animals, and other plants, and demonstrating how the lives of trees and people are deeply interwoven. Several trees, including a balsam fir in Ontario and an Amazonian ceibo, are located in areas that seem mostly natural, but which are affected by industrial development and climate change. Haskell also turns to trees in places where humans seem to have subdued \"nature\" - a pear tree on a Manhattan sidewalk, an olive tree in Jerusalem - demonstrating that wildness permeates every location.We have much to learn from trees, says Haskell; they show us how to thrive and participate in nature's networks. Roots communicate with neighboring fungi and bacteria, sending chemical messages through the soil. Twigs have memories of light, gravity, heat and minerals. Plant cells in leaves use airborne odors to attract caterpillar-eating insects. Haskell pays particular attention to the sounds that emerge from or surround trees; behind each sound are fascinating stories of how tree lives are joined to other lives.With its deep understanding of the complexity of trees and the way they shape their ecosystems, Haskell's book will make you look at trees in an entirely new way.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Science",
    "Environment",
    "Biology",
    "Natural History",
    "Plants"
  ],
  "author": "David George Haskell",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/39944370-the-songs-of-trees"
}