{
  "title": "A Taste of Shotgun",
  "description": "A master of small-town crime returns with this gripping tale of one man's struggle against Fate and Circumstance in an America that’s left him behind. In a bleak Rust-Belt town, bar owner Denis Carroll is barely holding on, doing whatever it takes to keep a roof over his family’s heads — legal or not. Now, after four years in stir, Denis’ brother/business partner Vince is back in town. In the words of one reviewer: \"Vince's return to town sets in motion a chain of events that involve old family grudges, financial shakedowns, and, soon, a rising body count.\" And like all classic noirs, the more the Carrols try to dig themselves out of the hole they’ve gotten themselves into, the worse things get. In this darkly humorous, gritty, small-town crime story, everyone has something to hide and nothing is as it seems.PRAISE FOR A TASTE OF SHOTGUNOne of Crime Fiction Lover's Hot Summer Reads (2018)\"Classic noir! A Taste of Shotgun features craven characters creating carnage and feckless fuckwits failing and flaming out fantastically. Fuck yeah.\" -- Jedidiah Ayres, author of Peckerwood, Fierce Bitches \"Orlet's setting in a small American town is spot-on. Even the two-bit crooks and hoodlums are just that, small-time. They fly below the police's radar with their penny-ante drug deals and as long as they don't get blatant with their activity or start beating people, their criminal lives go on. Orlet's \"A Taste of Shotgun\" is a great view of small-time crime and its working-class in America roots as people struggle to keep a roof over their heads and feed their families.\" -- David Nemeth, Unlawful Acts“Often very funny, and true to the “noir” tradition in that its central characters are terminal screw-ups who get themselves deeper and deeper into horrible fixes. The more they try to dig themselves out, the worse it gets.” Rory Costello, Hard Sentences: Crime Fiction Inspired by Alcatraz“White trash noir at its finest. Dirt balls, criminals, and other assorted living train wrecks doing crazy stupid things, and it is funny as well. What is there not to love? I look forward to other titles by this author.” Paul McBride, Book Reviewer",
  "genres": [
    "Noir",
    "Crime"
  ],
  "author": "Chris Orlet",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/39937261-a-taste-of-shotgun"
}