{
  "title": "Westside",
  "description": "A young detective who specializes in “tiny mysteries” finds herself at the center of a massive conspiracy in this beguiling historical fantasy set on Manhattan’s Westside—a peculiar and dangerous neighborhood home to strange magic and stranger residents—that blends the vivid atmosphere of Caleb Carr with the imaginative power of Neil Gaiman.New York is dying, and the one woman who can save it has smaller things on her mind.It’s 1921, and a thirteen-mile fence running the length of Broadway splits the island of Manhattan, separating the prosperous Eastside from the Westside—an overgrown wasteland whose hostility to modern technology gives it the flavor of old New York. Thousands have disappeared here, and the respectable have fled, leaving behind the killers, thieves, poets, painters, drunks, and those too poor or desperate to leave.It is a hellish landscape, and Gilda Carr proudly calls it home.Slightly built, but with a will of iron, Gilda follows in the footsteps of her late father, a police detective turned private eye. Unlike that larger-than-life man, Gilda solves tiny mysteries: the impossible puzzles that keep us awake at night; the small riddles that destroy us; the questions that spoil marriages, ruin friendships, and curdle joy. Those tiny cases distract her from her grief, and the one impossible question she knows she can’t answer: “How did my father die?”Yet on Gilda’s Westside, tiny mysteries end in blood—even the case of a missing white leather glove. Mrs. Copeland, a well-to-do Eastside housewife, hires Gilda to find it before her irascible merchant husband learns it is gone. When Gilda witnesses Mr. Copeland’s murder at a Westside pier, she finds herself sinking into a mire of bootlegging, smuggling, corruption—and an evil too dark to face.All she wants is to find one dainty ladies’ glove. She doesn’t want to know why this merchant was on the wrong side of town—or why he was murdered in cold blood. But as she begins to see the connection between his murder, her father’s death, and the darkness plaguing the Westside, she faces the hard truth: she must save her city or die with it.Introducing a truly remarkable female detective, Westside is a mystery steeped in the supernatural and shot through with gunfights, rotgut whiskey, and sizzling Dixieland jazz. Full of dazzling color, delightful twists, and truly thrilling action, it announces the arrival of a remarkable talent.",
  "genres": [
    "Fantasy",
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Urban Fantasy",
    "Historical",
    "Adult"
  ],
  "author": "W.M. Akers",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/39937623-westside"
}