{
  "title": "F**ked My Way Up to the Top: The Complete Biography of Lana Del Rey Using Her Own Words",
  "description": "\"If you are born an artist, you have no choice but to fight to stay an artist.\" ― Lana Del ReyWith her latest album, Did You Know That There's a Tunnel Under Ocean Blvd, Lana Del Rey has again proven herself as one of the most crucial and original female musicians of the 21st century. So let this celebrity biography reveal the full story of Elizabeth Woolridge Grant, largely told in Lana's own words using hundreds of interviews and public statements.We connect the dots between Lana's humble Catholic school beginnings, her teenage troubles with alcoholism, and her earliest unknown recordings as May Jailer/Lizzy Grant. We explore how the ruthless streets of New York City and the noir of Los Angeles struck a chord of nostalgic romance in Lana's creative mind, seeking retro Hollywood glamour at whatever cost, transforming into the multi-platinum \"gangster Nancy Sinatra\" superstar we love today. And we illustrate how the accusations of toxic femininity and a fabricated past could never compromise her vision; instead, the opposition provided even stronger material for her unique artistic dedication, selling millions of records across the globe.More importantly, this book delves deep into her music, where Lana has always felt the most comfortable sharing personal details. We document her hundreds of unreleased songs, her biggest hits (such as the viral sensation Video Games), her soundtrack contributions (The Great Gatsby, Maleficent, Big Eyes), and her collaboration work with The Weeknd, Taylor Swift, Miley Cyrus, Ariana Grande, and Stevie Nicks. Furthermore, we passionately analyse each of her eight studio albums, including the critically acclaimed Born to Die, Ultraviolence, Honeymoon, and Norman F**king Rockwell!. In doing so, we present a commercially successful career that hides within the darker underbelly of the pop world, just like her cult following prefers it.For dedicated fans only, here is everything there is to know about the real Lana Del Rey.",
  "genres": [
    "Nonfiction",
    "Biography"
  ],
  "author": "Jared Woods",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/123042090-f-ked-my-way-up-to-the-top"
}