{
  "title": "Crush",
  "description": "Shea Ellis doesn't have time for love -- all the Boston Brawlers captain wants is one last shot at the Cup before he retires. Besides, after his ex-wife did him dirty, the single dad isn't sure if he could love again. Hell, he'd be happy just to find a decent nanny to help with his three kids. Sure, the latest nanny to get a try-out, Brynn, is a babe. But the hottest thing about the bright-eyed twenty-something isn't her sizzling figure -- it's how fast his kids fall for her. For a grizzled veteran, it's a pointless crush on a girl he knows he shouldn't have. And with the Brawlers marching towards the playoffs, the last thing he needs is a distraction. So why can't he get the cutie out of his mind? Can the hockey legend keep his eyes on the ice ... \nand his hands off the nanny?\n Brynn Conley never expected to nanny for her childhood crush. The pretty-boy rookie whose poster she painted with lipstick kisses all those years ago? He's a rugged man now. A salt-and-pepper single dad struggling with a troubled teen daughter and two wild twin boys. The hockey star has aged like fine wine, but Brynn's not looking for love -- she's got a job to do. And to Shea's delight, she's great with kids. It's a cruel irony for a young woman who can't have any children of her own. Brynn knows she shouldn't hook up with the athlete -- the last thing she'd ever want to do is confuse the kids. But when her hunky boss wraps his big hockey hands around her waist, will she insist that their relationship remain professional? Or will it be the start of an ice-melting romance? \nCrush is a 70,000 word single dad hockey romance! This stand-alone novel is the third and final book in the Boston Brawlers series. No cheating, no cliffhanger, HEA always guaranteed!",
  "genres": [
    "Romance",
    "Hockey",
    "Sports Romance",
    "Sports",
    "Contemporary",
    "Audiobook",
    "Contemporary Romance"
  ],
  "author": "June Winters",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/39948984-crush"
}