{
  "title": "American Hate: Survivors Speak Out",
  "description": "A moving and timely collection of testimonials from people impacted by hate speech and hate crimes before and after the 2016 presidential electionIn American Hate: Survivors Speak Out, Arjun Singh Sethi, a community activist and civil rights lawyer, chronicles the stories of individuals affected by hate. In a series of powerful, unfiltered testimonials, survivors tell their stories in their own words and describe how the bigoted rhetoric and policies of the Trump administration have intensified bullying, discrimination, and even violence toward them and their communities.We hear from the family of Khalid Jabara, who was murdered in Tulsa, Oklahoma, in August 2016 by a man who had previously harassed and threatened them because they were Arab American. Sethi brings us the story of Jeanette Vizguerra, an undocumented mother of four who took sanctuary in a Denver church in February 2017 because she feared deportation under Trump’s cruel immigration enforcement regime. Sethi interviews Taylor Dumpson, a young black woman who was elected student body president at American University only to find nooses hanging across campus on her first day in office. We hear from many more people impacted by the Trump administration, including Native, black, Arab, Latinx, South Asian, Southeast Asian, Muslim, Jewish, Sikh, undocumented, refugee, transgender, queer, and people with disabilities.A necessary book for these times, American Hate explores this tragic moment in U.S. history by empowering survivors whose voices white nationalists and right-wing populist movements have tried to silence. It also provides ideas and practices for resistance that all of us can take to combat hate both now and in the future.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Race",
    "Essays",
    "Social Justice",
    "Anthologies",
    "Social Issues"
  ],
  "author": "Arjun Singh Sethi",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/39975855-american-hate"
}