{
  "title": "A Rosenberg by Any Other Name: A History of Jewish Name Changing in America",
  "description": "Winner, 2019 Saul Viener Book Prize, given by the American Jewish Historical Society\nA groundbreaking history of the practice of Jewish name changing in the 20th century, showcasing just how much is in a nameOur thinking about Jewish name changing tends to focus on clichés: ambitious movie stars who adopted glamorous new names or insensitive Ellis Island officials who changed immigrants' names for them. But as Kirsten Fermaglich elegantly reveals, the real story is much more profound. Scratching below the surface, Fermaglich examines previously unexplored name change petitions to upend the clichés, revealing that in twentieth-century New York City, Jewish name changing was actually a broad-based and voluntary behavior: thousands of ordinary Jewish men, women, and children legally changed their names in order to respond to an upsurge of antisemitism. Rather than trying to escape their heritage or \"pass\" as non-Jewish, most name-changers remained active members of the Jewish community. While name changing allowed Jewish families to avoid antisemitism and achieve white middle-class status, the practice also created pain within families and became a stigmatized, forgotten aspect of American Jewish culture.This first history of name changing in the United States offers a previously unexplored window into American Jewish life throughout the twentieth century. A Rosenberg by Any Other Name demonstrates how historical debates about immigration, antisemitism and race, class mobility, gender and family, the boundaries of the Jewish community, and the power of government are reshaped when name changing becomes part of the conversation.Mining court documents, oral histories, archival records, and contemporary literature, Fermaglich argues convincingly that name changing had a lasting impact on American Jewish culture. Ordinary Jews were forced to consider changing their names as they saw their friends, family, classmates, co-workers, and neighbors do so. Jewish communal leaders and civil rights activists needed to consider name changers as part of the Jewish community, making name changing a pivotal part of early civil rights legislation. And Jewish artists created critical portraits of name changers that lasted for decades in American Jewish culture. This book ends with the disturbing realization that the prosperity Jews found by changing their names is not as accessible for the Chinese, Latino, and Muslim immigrants who wish to exercise that right today.",
  "genres": [
    "History",
    "Jewish",
    "Nonfiction",
    "Judaism",
    "Religion",
    "Linguistics",
    "Sociology"
  ],
  "author": "Kirsten Fermaglich",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/39971077-a-rosenberg-by-any-other-name"
}