{
  "title": "Nobody's Sweetheart Now",
  "description": "The first mystery book in a rollicking new historical cozy series! When Lady Adelaide's dinner party is visited by lady death, she'll have to partner with the irksome spirit of her dead husband to crack the case… \"A lively debut filled with local color, red herrings, both sprightly and spritely characters, a smidgen of social commentary, and a climactic surprise.\"― Kirkus Reviews A delightful English cozy series begins in August 1924. Lady Adelaide Compton has recently (and satisfactorily) interred her husband, Major Rupert Charles Cressleigh Compton, hero of the Somme, in the family vault in the village churchyard. Rupert died by smashing his Hispano-Suiza on a Cotswold country road while carrying a French mademoiselle in the passenger seat. With the house now Addie's, needed improvements in hand, and a weekend house party underway, how inconvenient of Rupert to turn up! Not in the flesh, but in―actually, as a―spirit. Rupert has to perform a few good deeds before becoming welcomed to heaven―or, more likely, thinks Addie, to hell. Before Addie can convince herself she's not completely lost her mind, a murder disrupts her careful seating arrangement. Which of her twelve houseguests is a killer? Her mother, the formidable Dowager Marchioness of Broughton? Her sister Cecilia, the born-again vegetarian? Her childhood friend and potential lover, Lord Lucas Waring? Rupert has a solid alibi as a ghost and an urge to detect. A debaucher in life and an annoyance in death, Addie knows she can't leave Rupert to solve the murders of her sweet old gardener and a naked neighbor by himself. Enter Inspector Devenand Hunter from the Yard, an Anglo-Indian who is not going to let some barmy society beauty witnessed talking to herself derail his investigation. Something very peculiar is afoot at Compton Court and he's going to get to the bottom of it―or go as mad as its mistress trying. The Lady Adelaide Nobody's Sweetheart Now (Book 1) Who's Sorry Now? (Book 2) Just Make Believe (Book 3)",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Cozy Mystery",
    "Historical Mystery",
    "Audiobook"
  ],
  "author": "Maggie Robinson",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/39970739-nobody-s-sweetheart-now"
}