{
  "title": "Embracing the Best of East and West: How One Woman's Spiritual Quest For Lasting Inner Peace Can Help You Find Your Zen",
  "description": "Interested in meditations that immediately bring peace of mind and relief from stress and anxiety?Would you like lasting forgiveness for yourself or others?Discover within this book methods of spiritual alchemy to heal yourself of past anger, pain and unforgiveness and ways to transform all that negative energy into love.Just like in Quantum Physics where there are many possible states of existence, so also can you internally shift from a state of fear to one of love. You will discover how inside this book! The author, a highly sensitive person and empath, had experiences from growing up that left ‘holes in her being’, so to speak. Right from her 20s, due to intense inner emotional and mental turmoil, she was filled with a burning desire to find lasting inner peace and forgiveness. This book contains methods that work from 11 years of her search for, and practice of, inner healing techniques. These have left her carefree and glowing from the inside-out!These methods are especially powerful if you find words to be healing and transforming.Just as one can utilize the Akashic Records for healing, one can use the techniques contained within for healing as well. The author has had the experience of all of these healing modalities and speaks from experience.This is a guidebook to spiritual healing methods based on the principle of oneness, that there is only one of us. You will to apply an ancient Hawai’ian forgiveness method called Ho’oponopono to forgive yourself or others.New Age meditations for lasting inner peace. These are non-denominational in nature, so they fit into the context of any religion you might be practicing (or not).Affirmations and methods such as Cutting the Ties that Bind to heal yourself of difficult and painful relationships.Along with New Age practices, the book also seamlessly discusses Hinduism and its practices as well as Hindu deities.It clearly explains the essence of the various philosophies behind Hinduism. It focuses on Advaita, the non-dualistic philosophy of the East which finds parallels with A Course in Miracles in the West and discusses the meaning and purpose of life according to Advaita or There is also a charming description of life in a real ancient orthodox Hindu village, in which the author’s mother grew up. It still exists today, and such villages are exceedingly rare to find even in India these days. You will be transported to another time and era!Buy this book to experience more peace, love and happiness today!",
  "genres": [
    "Philosophy"
  ],
  "author": "Geeta Rao",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/39976743-embracing-the-best-of-east-and-west"
}