{
  "title": "Wicked Sinner",
  "description": "Wicked Sinner is the 7th book in USA Today Bestselling Author, Carole Mortimer’s, all Amazon #1 Regency Sinners series.Author’s Note: All the books in the very hot Regency Sinners series are complete and HEA stories. Books in the series are connected by the friendship of the heroes and their search for the traitor to the Crown. And did I mention they’re HOT?When Nik’s own wife is the last of eight ladies suspected of treason, he knows he can delay no longer and has to investigate the accusation. After all, he is Dominik Sinclair, the Duke of Stonewell, and has long been an agent and spymaster for the Crown.But he’ll carry out the investigation in his own way. A way that Angel knows well and will understand is not a game.Angelique knows there is something seriously wrong with the marriage that began so promisingly three years ago. She still loves Nik as much as she ever did but his increasing coldness toward her over this past year seems to indicate he no longer feels the same way about her.When he arrives unexpectedly at his estate in Kent, where Angelique has been residing with her mother since the end of the London Season, he is colder than he has ever been. Leading Angelique to the heart breaking conclusion their marriage is over and Nik must now have a mistress to cater to his darker, sexual appetites.She denies it emphatically when Nik accuses her of treason, but her husband has his own ways and means of extracting information from her.Usually on her knees.There will be a Christmas Special to this series published in October, titled Wicked Christmas (Regency Sinners 8), and featuring all the heroes and heroines in the previous 7 books.NEW Regency Lovers Series:INDECENT (Regency Lovers 1)OBSESSION (Regency Lovers 2)More to come in this seriesSteele Protectors - NEW Contemporary Romantic Suspense Series COMING SOONLOGAN (Steele Protectors 1)More to come in this series",
  "genres": [
    "Historical",
    "Historical Romance",
    "Regency Romance",
    "Marriage",
    "Regency",
    "Romance",
    "Erotic Romance"
  ],
  "author": "Carole Mortimer",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/39975462-wicked-sinner"
}