{
  "title": "The Golden Rhinoceros: Histories of the African Middle Ages",
  "description": "A leading historian reconstructs the forgotten history of medieval AfricaFrom the birth of Islam in the seventh century to the voyages of European exploration in the fifteenth, Africa was at the center of a vibrant exchange of goods and ideas. It was an African golden age in which places like Ghana, Nubia, and Zimbabwe became the crossroads of civilizations, and where African royals, thinkers, and artists played celebrated roles in the globalized world of the Middle Ages. The Golden Rhinoceros brings this unsung era marvelously to life, taking readers from the Sahara and the Nile River Valley to the Ethiopian highlands and southern Africa.Drawing on fragmented written sources as well as his many years of experience as an archaeologist, François-Xavier Fauvelle painstakingly reconstructs an African past that is too often denied its place in history--but no longer. He looks at ruined cities found in the mangrove, exquisite pieces of art, rare artifacts like the golden rhinoceros of Mapungubwe, ancient maps, and accounts left by geographers and travelers--remarkable discoveries that shed critical light on political and architectural achievements, trade, religious beliefs, diplomatic episodes, and individual lives.A book that finally recognizes Africa's important role in the Middle Ages, The Golden Rhinoceros also provides a window into the historian's craft. Fauvelle carefully pieces together the written and archaeological evidence to tell an unforgettable story that is at once sensitive to Africa's rich social diversity and alert to the trajectories that connected Africa with the wider Muslim and Christian worlds.",
  "genres": [
    "History",
    "Nonfiction",
    "Africa",
    "Medieval",
    "Medieval History",
    "Audiobook",
    "France"
  ],
  "author": "François-Xavier Fauvelle",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/39964438-the-golden-rhinoceros"
}