{
  "title": "Blood Ties",
  "description": "Beautiful, arrogant and lawless, the Bycrafts have menaced the tiny isolated mountain settlement of ‘Little Town’ for generations in a one-family crime wave. The Bycraft women are uncontrollable, the men violently obsessive and their kids feral. And nobody in town has suffered at their hands as much as the Fuller family.Surviving a traumatic childhood and the continued focus of sustained aggression from the Bycrafts, Tess Fuller has grown up scarred and wary, highly skilled in self-defence and armed at all times. Although glad to escape to the city at the first opportunity, her dying father brings Tess back to her home town. To support him she abandons her promising city cop career to take up duties as the town’s junior officer. But with a lazy, retiring sergeant as her only colleague and working the state’s worst resourced station, Tess has become increasingly lawless herself trying to police the hostile Bycrafts.Out on parole, predatory Red Bycraft is a constant threatening presence, and Tess’ life is further complicated by her widely condemned relationship with his brother, Jake.Tess’ new sergeant, Finn Maguire, is unimpressed with her approach to the job. He’s from the city – obstinate, taciturn and by-the-books. She’s grown used to working solo and struggles to be subordinate again, especially when he proves patronising and unwilling to respect her abilities or local knowledge. But they must work together to solve the intersecting mysteries of possible land fraud, an abandoned suitcase of money and a peeping tom with a preference for older women. All the while, Tess is the target of a revengeful week of escalating violence that ends in a dangerous confrontation with a gang of Bycraft men. Can Tess and the Sarge put aside their differences, team up to save her life and finally bring some order to Little Town?",
  "genres": [
    "Mystery",
    "Romance",
    "Fiction",
    "Crime",
    "Suspense",
    "Romantic Suspense",
    "Thriller"
  ],
  "author": "J.D. Nixon",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/12304936-blood-ties"
}