{
  "title": "The MISSadventure Brides Collection: 7 Daring Damsels Don’t Let the Norms of Their Eras Hold Them Back",
  "description": "Love Is One of Life’s Greatest AdventuresSeven daring damsels don’t let the norms of their eras hold them back. Along the way these women attract the attention of men who admire their bravery and determination, but will they let love grow out of the adventures?Along the Yellowstone River by Debby Lee1832 MontanaHeather Duncan takes over her father’s fur trapping business, believing it’s an opportunity to also gain knowledge of medicinal plants, but a growing sympathy for animals and blossoming adoration for a rugged mountain man capture her heart.MissTaken Identity by Kimberley Woodhouse 1883 TexasHeadstrong, bubbly, accident-prone Abigail Monroe is on a quest for adventure away from society’s expectations. But her pursuits are unexpectedly thwarted when she is arrested by a handsome Texas Ranger.Lesson of Love by Cynthia Hickey 1885 ArkansasCity girl, Leah Ellison has big dreams but soon finds out that teaching in a backwards Ozark mountain community is far different than what she’d imagined.Maddy’s Llamas by Marjorie Vawter1898 ColoradoIn spite of Maddy’s “missadventures” raising her llamas for their wool and strictly-by-the-book Harry’s attempts to get her to do things “right,” they learn to work together and find love in the laughter.Zola’s Cross-Country Adventure by Mary Davis1903 cross-country tripZola Calkin sets out on an adventure to be the first woman to drive across the country. Will the journalist tasked to report her presumed failure sabotage her efforts? Or will he steal her heart?Detours of the Heart by Donna Schlachter1925 New MexicoA tour guide who wants to move on and a playboy who’s never had a place to call home—can they overcome their own plans and allow God to make their path straight, or will they take yet another detour?Riders of the Painted Star by Kathleen E. Kovach1936 ArizonaZadie Fitzpatrick, an artist from New York, is commissioned to go on location in Arizona to paint illustrations for an author of western novels and falls for the male model.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Christian",
    "Historical",
    "Novella",
    "Christian Fiction"
  ],
  "author": "Mary   Davis",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/39984099-the-missadventure-brides-collection"
}