{
  "title": "A Mind Unraveled",
  "description": "The compelling story of an acclaimed journalist and New York Times bestselling author’s ongoing struggle with epilepsy—how, through personal resilience and the support of loved ones, heovercame medical incompetence and institutional discrimination to achieve once unthinkable success.  “REMARKABLE . . . inspirational in the true sense of the word.”—The New York Times Book Review This is the story of one man’s battle to pursue his dreams despite an often incapacitating brain disorder. From his early experiences of fear and denial to his exasperating search for treatment, Kurt Eichenwald provides a deeply candid account of his years facing this misunderstood and often stigmatized condition. He details his encounters with the doctors whose negligence could have killed him, but for the heroic actions of a brilliant neurologist and the family and friends who fought for him. Ultimately, A Mind Unraveled is an inspirational story, one that chronicles how Eichenwald, faced often with his own mortality, transformed trauma into a guide for reaching the future he desired.Praise for A Mind Unraveled“An intimate journey . . . bravely illuminating the trials of living inside a body always poised to betray itself.”— The Oprah Magazine“Poignant and infuriating . . . merges elements of medical drama, anti-discrimination fable, and coming-of-age memoir.”—The New Yorker“One of the best thrillers I’ve read in years, yet there are no detectives, no corpses, no guns or knives.”—Minneapolis Star-Tribune“Terrific . . . Eichenwald’s narrative is a suspenseful medical thriller about a condition that makes everyday life a mine field, a fierce indictment of a callous medical establishment, and an against-the-odds recovery saga.”—Publishers Weekly (starred review)“Riveting . . . Eichenwald has created a universal tale of resilience wrapped in a primal scream against the far-too-savage world.\"—Booklist (starred review)“An extraordinary book.”—Harriet Lerner, Ph.D., New York Times bestselling author of The Dance of Anger",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Medical",
    "Biography",
    "Health",
    "Science",
    "Medicine"
  ],
  "author": "Kurt Eichenwald",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/39987223-a-mind-unraveled"
}