{
  "title": "Ancient Dreams Omnibus Edition",
  "description": "This is an omnibus collection of the novels Ancient Ruins, Spells of Old, and Halls of Power. The collection has been revised and has several expanded scenes, but is largely the same. I must note that this book is dark fantasy, with an emphasis on dark.Ancient awakened after millennia of dormancy, her memories in tatters and born anew. Residing in the ruins of an ancient city, she finds herself drawn into a war between two elven nations and the slaver kingdom of Kelvanis when she rescues a princess from slavery. With her domain containing hints of forgotten knowledge, Sistina becomes a dungeon, stronghold, and source of hope all at once. And perhaps, just perhaps, she could finally find love in her new life.Spells of successfully driven off an assault and freed captives of Kelvanis, Sistina begins fortifying to defend those she cares about from further attacks. Yet with all her power within her halls, she cannot grant those under her protection true freedom. To truly bring hope to her love, Sistina must delve into who she once was, and bring forth every scrap of magic she has to become a shining beacon of hope.Sadly, Kelvanis' plans are only mildly impeded by her efforts up until now, and they will stop at nothing to bring their ends about. The only question is, whose side is time on?Halls of rocked the world via high magic that was believed lost, the dungeon Sistina has shown her power at last, as she has done everything in her power to protect those that she loves. Crowned queen of the new city of Beacon, Phynis Constella is searching for allies as full-scale war erupts between her homeland of Sifaren and the fell nation of Kelvanis.Each side must use everything in their power to defeat the other, but with the threat of the goddess Tyria looming, there can be only one victor. Long-waiting plans at last are rising to a head, and even Sistina is uncertain of whether or not she can survive them. But for her beloved Queen, she is willing to risk anything.",
  "genres": [
    "Fantasy"
  ],
  "author": "Benjamin Medrano",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/39984647-ancient-dreams-omnibus-edition"
}