{
  "title": "The Knight Banneret",
  "description": "The William Marshal Series - Book 1 “Woodman has done justice to a remarkable story and man. William Marshal is portrayed as being brave, intelligent - but flawed and human too.” Michael Arnold \"The general reader will be engrossed in the narrative, while students of the era will admire Woodman’s accurate eye for historical detail and vocabulary and his incisive reveals of the customs and attitudes of the time.\" Paul BannisterWilliam Marshal was born in a time of civil war. In a time of bloodshed and honour.As a boy he is used as a pawn, during the conflict between Stephen and Matilda. But as a young man he trains as a knight.Marshal learns his trade in England and Normandy, fighting in tournaments and war-games, gaining friends and enemies alike.But the boy must become a man - and the squire must become a knight.Marshal soon finds himself embroiled in the campaigns of Henry II and the rivalry between French Kings.Where once he fought for fame and riches, the young knight finds himself fighting for his life.The Knight Banneret is the first book in an epic series chronicling the story of William Marshal, “the Greatest Knight”.For fans of Bernard Cornwell, Conn Iggulden and Michael Jecks.Praise for Richard “This series could develop into something very special. Richard Woodman knows how to tell a story, but has a healthy respect for history... Compulsive reading.” Saul David“Brings medieval Europe to life. The well-crafted action and historical insights enthral and entertain.” Richard Foreman, author of Band of Brothers.‘Richard Woodman reminds us of the importance of merchant ships and our debts to the seafarers – men and women – who manned.’ HRH Princess Anne‘If Neptune’s Trident sets the standard for what is to follow - we can at least rest assured that there is a series that truly does justice to our proud merchant maritime past.’ Nautilus UK Telegraph‘Richard Woodman tells many a good tale in this first volume and it is fascinating to read. I highly recommend this first volume in the Neptune s Trident for anyone with an interest in the early modern period. If the rest of the series is as good as this one, they should all be on the bookshelves of those studying the history of Britain, from the sixteenth to the twentieth centuries.’ Open HistoryCaptain Richard Martin Woodman LVO is an English novelist and naval historian. He is the author of the series ‘A History of the British Merchant Navy’ and the Sword of State trilogy, which recreates the true story of George Monck, a giant of the 17th Century.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction"
  ],
  "author": "Richard Woodman",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/39993904-the-knight-banneret"
}