{
  "title": "Begging for Change: The Dollars and Sense of Making Nonprofits Responsive, Efficient, and Rewarding for All",
  "description": "You are a good person. You are one of the 84 million Americans who volunteer with a charity. You are part of a national donor pool that contributes nearly $200 billion to good causes every year. But you Why don't your efforts seem to make a difference? Fifteen years ago, Robert Egger asked himself this same question as he reluctantly climbed aboard a food service truck for a night of volunteering to help serve meals to the homeless. He wondered why there were still people waiting in line for soup in this day and age. Where were the drug counselors, the job trainers, and the support team to help these men and women get off the streets? Why were volunteers buying supplies from grocery stores when restaurants were throwing away unused fresh food every night? Why had politicians, citizens, and local businesses allowed charity to become an end in itself? Why wasn't there an efficient way to solve the problem? Robert knew there had to be a better way. In 1989, he started the D.C. Central Kitchen by collecting unused food from local restaurants, caterers, and hotels and bringing it back to a central location where hot, nutritious meals were prepared and distributed to agencies around the city. Since then, the D.C. Central Kitchen has been named one of President Bush Sr.'s Thousand Points of Light and has become one of the most respected and emulated nonprofit agencies in the world, producing and distributing more than 4,000 meals a day. Its highly successful 12-week job-training program equips former homeless transients and drug addicts with culinary and life skills to gain employment in the restaurant business. In Begging for Change, Robert Egger looks back on his experience and exposes the startling lack of logic, waste, and ineffectiveness he has encountered during his years in the nonprofit sector, and calls for reform of this $800 billion industry from the inside out. In his entertaining and inimitable way, he weaves stories from his days in music, when he encountered legends such as Sarah Vaughan, Mel Torme, and Iggy Pop, together with stories from his experiences in the hunger movement -- and recently as volunteer interim director to help clean up the beleaguered United Way National Capital Area. He asks for nonprofits to be more innovative and results-driven, for corporate and nonprofit leaders to be more focused and responsible, and for citizens who contribute their time and money to be smarter and more demanding of nonprofits and what they provide in return. Robert's appeal to common sense will resonate with readers who are tired of hearing the same nonprofit fund-raising appeals and pity-based messages. Instead of asking the \"who\" and \"what\" of giving, he leads the way in asking the \"how\" and \"why\" in order to move beyond our 19th-century concept of charity, and usher in a 21st-century model of change and reform for nonprofits. Enlightening and provocative, engaging and moving, this book is essential reading for nonprofit managers, corporate leaders, and, most of all, any citizen who has ever cared enough to give of themselves to a worthy cause.",
  "genres": [
    "Nonfiction",
    "Business",
    "Unfinished",
    "Social Change"
  ],
  "author": "Robert Egger",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/40000.Begging_for_Change"
}