{
  "title": "The Ultimate Protein Cookbook: 142 Insanely Delicious Recipes",
  "description": "Introducing a brand new approach to finding health, healing, weight-loss and happiness naturally with delicious recipes. Melanie Wildman, the mom-of-three behind award-winning nutrition company, Nutracelle, is bringing you over 140 incredible recipes in her brand new cookbook: The Ultimate Protein Cookbook: 142 Insanely Delicious Recipes.Eating healthy is hard. As Moms, we have less time than ever for things like meal planning and cooking healthy recipes that are complicated and require a ton of ingredients. Ordering out and quick food has become the standard in many North American families, and we're unknowingly feeding our bodies potentially harmful ingredients linked to hormone disruption, weight gain, heart disease and even cancer.In this cookbook, Melanie provides the tools you need to empower yourself to live a guilt-free and healthy life. Every recipe is keto-friendly, low-carb, LCHF, paleo-friendly, high in protein, gluten-free, nut-free and insanely yummy! Not to mention each recipe is SO easy to make and requires just the regular ingredients you keep in your cupboards already. Losing weight and feeling full with foods you love is the recipe for long-term health.Over 142 healthy and delicious whole-food recipes that will help your body burn fat, including: Fluffy Old-Fashioned Pancakes Easy & Yummy Pizza Cheesy Burger Buns Home Made No-Churn Ice Cream No-Bake Cheesecake Chocolate Chip Cookies Even Grilled Cheese Sandwiches! A Message From Melanie As a nut-free mom who has held my child's little body in my arms, not knowing if he would live after an exposure to peanuts - I know just how important knowing exactly what is in our food really is.That's why I created Nutracelle and this cookbook. I needed to know what I'm putting in my body-and feeding my family. Like every mother, I want my children to grow up understanding that each of us can make simple, easy choices to give our bodies the vital nutrients and energy we need, and still enjoy delicious and fun food.All of us deserve to feel beautiful and we all want what is best for ourselves and our families. My dream is for everyone to have the opportunity to live healthier lives. The food we eat should nourish, not only our bodies, but also our spirits.About Melanie After struggling with obesity until having a sleeve gastrectomy 10 years ago, Melanie has won numerous awards, including Woman of the Year, Start-Up of the Year, Best New Product and Innovator of the Year. Melanie hosts a YouTube cooking show, has authored cookbooks, is a 2016 Gold winner in several categories in the International Business Awards, a finalist for the 2017 Mompreneur Awards, a former Mrs. Canada and first runner-up for Mrs. Universe. Melanie is passionate about improving people's health along with mentoring and encouraging women in business.What People Are Saying\"These recipes have been key to my success! I still can't get over how delicious they are, AND I've lost over 106 lbs thanks to Nutracelle.\" - Tracy Stewart\"I've lost 90 lbs thanks to my Nutracelle lifestyle. My entire family loves the recipes and we look forward to our Friday night Nutracelle pizza night every week!!\" - Chris McNab\"After my last baby, I gained over 50 lbs and hated what I saw in the mirror. I am happy to announce that I've reached my goal weight just by replacing flour & sugar with my Nutracelle and using the recipes in this cookbook to make filling, healthy meals for me and my family.\" Jenn Bauder",
  "genres": [],
  "author": "Melanie R.E. Wildman",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/40007142-the-ultimate-protein-cookbook"
}