{
  "title": "Gestation",
  "description": "To face Death itself, to hide from deadly guards, to conduct dark rituals and to use forbidden death magic? Being sent to Hell is definitely not what 12-year-old Anji would have ever expected from a government orphanage program.  Chrysalis — the project of the century. It is a hyper-realistic fantasy RPG game, set in the Middle Ages. Leveling up, distributing attribute points, and choosing your way of life are only a few ways the players play the game. Chrysalis is the perfect virtual space where every orphan under the care of the government is placed in an in-game family to receive all the love and care of parents they so desperately need. This project helps kids socialize and mold them into the adults of the future. They are in charge of how they grow up in the virtual space, which was built to advance society.  But something went seriously wrong for Anji.  He has lost everything that he had been so happy to finally receive. Now, instead of a loving mama and strict but generous father, he has bloodthirsty demons and flesh-eating worms. Instead of fishing and baking lessons, he has to perform bloody rituals to survive the nine circles of Hell. Instead of the dreams of a happy childhood, his wounded child’s soul suffers demonification.  Betrayed, for the sake of someone else's master plan, he appeared in the most hopeless place of Chrysalis. It is full of ash, despair and… possibilities? Sagie, Anji’s in-game username, fueled by homesickness and revenge, will go through the Hell to face what is hidden in the darkest corners. The road will be long and difficult, but those who can, do.  Once, long ago, the first wave of Wanderers appeared in the world of Chrysalis. They had proved themselves by killing the ancient gods. Now it is time for the second wave of Wanderers and for new young gods, dreaming about a wide-scaled and deadly war. The beta-test is now open to people. While they are “playing” in Chrysalis, they have no idea about the truth behind the Project.  Project Chrysalis: Book one: Gestation is the first of four books of a brand new LitRPG series. This is a story of a battle for your dreams. It is full of turns, twists, riddles, and revelations; it is a story of… Oh, sorry. No spoilers today.  The story of Sagie has just begun. But first, one line of advice: do not believe your own eyes.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Amazon"
  ],
  "author": "John Gold",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/40020652-gestation"
}