{
  "title": "Hawthorn Lake: Reprisal",
  "description": "Bigfoot, Sasquatch, Yeti - Dozens of names refer to the existence of a similar creature. Native American tribes have hundreds of stories that have been passed down from generation to generation. The Cherokee has one such story of a beast called Tsula 'kalu, who is said to be a forest-dwelling giant living in solitude covered in hair from head to foot. Many believe that the government is aware of Sasquatch, and to protect financial interests, they choose to cover up what they know. Many other theories permeate the landscape of cryptozoology, yet no scientific proof has ever been documented. Is it real? Could there be something out there yet to be discovered living only in myth, legend, and lore? You decide. A fun-filled weekend of camping, hiking, and a search for a lost gold mine turns into a nightmare for five friends when they stumble upon an ancient evil hidden away for centuries in the snow-covered mountains of the Colorado Rockies. Michelle Evers has put the event behind her and moved on with a new life in a new town. She’s made friends and has an exciting job as a Sheriff's deputy in the resort town of Hawthorn Lake. But just as she’s getting settled in, mysterious events begin to unfold, events that seem eerily similar to the things, she experienced so long ago. She soon discovers the sheriff, and his close friend, Troy Turner, harbors a dark secret that could prove devastating for the tourist-driven town. Michelle is forced to make a decision that could thrust her back into the nightmare that has haunted her all this time and leaves her clinging to the edge of sanity. Should she face her greatest fears and confront the evil that keeps her awake at night, or should she run and try to start over again somewhere else? Will she survive a second time, or will this prove to be a fatal mistake? The Lost Gold Mine of Idaho Springs is the prologue to Hawthorn Lake Reprisal",
  "genres": [],
  "author": "Paul G. Buckner",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/40015772-hawthorn-lake"
}