{
  "title": "Rising",
  "description": "Inception meets War of the Worlds with a sassy female lead.   My name is Kit Steele and I was ten years old when thousands of alien ships landed all over the world in the year 2020. We thought for sure that we'd be goners, about to be obliterated or terraformed out of existence. But when the ship doors opened, they were… empty. Maybe they were just communication vessels, we thought. But that night, when humanity fell asleep, we were sucked into an alternate dimension. The Dream Wars. A place where the alien ghouls fed off of your body unless you fought back. If you're killed in the Dream War, your body dies on earth. That was ten years ago and I've been training for the Dream War every night since then. Each time I close my eyes and drift off to sleep I become a merciless killer. Taking out as many ghouls as I can. It's earned me the rightful title of Commander and now I protect the rich in their sleep with my team of warriors. But the one thing I didn't expect was that my new client Damien Striker might be able to put a stop to this war, if I can keep him alive long enough.  MEET THE TEAM:  Commander Kit Steele  - Carnivore, protector of billionaires, has a penchant for blue hair and anything sweet, hates cats, despises the color pink, and loves 80's rock music.  Medic Ronnie Sotto - Kit's best friend, graduated Harvard medical school at age 15, loves cats, favorite color pink, and once did leg surgery on a cat in the dream war to save its life.  Lieutenant Brisk Hutchins  - Slept with Kit one time, is in love with Ronnie even though she turns him down because he slept with Kit, pretends to like cats, has one of the highest ghoul kill records second to Kit, secretly loves old Britney Spears songs.  Pyrotechnic expert Nox Lightfoot  - nickname 'pretty boy', likes to light things on fire, thinks cats are okay, would jump in front of a bus if it would bring bacon back and misses the times when the skies were filled with birds.  Maxine Cross  - Miss USA runner up, has rage issues but won't go to anger management, is proudly promiscuous, and wouldn't be caught dead in the same room as a cat. She enjoys dancing in the rain, first kisses and killing ghouls.  *This book is for upper YA/NA audience, beware of language.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Romance",
    "Aliens",
    "Paranormal",
    "Dystopia",
    "Fantasy Romance"
  ],
  "author": "Leia Stone",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/40024572-rising"
}