{
  "title": "The Road Rebels Motorcycle Club Box Set",
  "description": "I am a Road Rebel. I love my woman as much as I love my motorcycle club. Now I just have to figure out how to keep them both safe.    The Road Rebels Motorcycle Club Box Set includes all of The Road Rebels MC books! You get Hawk, Talon, Snake, and Fox all in one steamy set!  Hawk  She was supposed to be mine forever. But the night our father's were killed, Sydney decided this life wasn't for her. So she ran. She left me, and our club behind. I never expected to see her on my doorstep six years later. With our child. She looks different, but she's still as beautiful as ever. Those hips, her sultry smile, I can't get over her. But she didn't leave the life, and she's got a DEA agent on her tail. I have to keep her safe, and my daughter too. I'll do anything to protect them. Even if I have to lie to my club about her.   Talon Never touch another club members sister. It's one rule in the MC I'll never understand. That means Gemma is off limits. Too bad I don't listen to rules very well. I'll make Gemma see that she's the only woman for me. On my bike, in the clubhouse. She'll be mine. The Devil Saints are on our heels though, so I won't get to take my sweet time with her. And that's all I want to do. If I have to kill somebody to be with her, so be it. Those bastards have no idea what it really means to be the devil. I'll show them.    Snake  She's the one I tried to forget. But I can't get her out of my head. I'm no prisoner. And I'm no coward. I won't stay locked away at the clubhouse hiding from those @ssholes, The Devil Saints. So I go to a bar, away from my brothers. I need a break from all the chaos. Until drama walks right through the door. Laiken. The one who got away. Or I pushed away, I can barely remember. She's looking fine in that police uniform. I wonder if she'd let me use those cuffs on her. But we can't be together. A patched member and a cop? No. Laiken and me? I'm not supposed to want her. But you know what they say. The heart wants what it can't have. And my heart is achin' for trouble.    Fox  They say don't sleep with your target. But we won't be doing much sleeping. I have a job to do, for my Club. To get information on the indictment of our rivals, the Devil's Saints. I’m going to find out how to put away those @ssholes for good The Club didn’t give me the nickname Fox for my good looks. The mission changes when I meet Harlow Carmichael. Getting involved with her is a bad idea, but I can’t get my mind off her lips, or those curves. I don’t care if she’s the daughter of the man working for the enemy. When her life is threatened, I have to decide who to save. Her or my Club.",
  "genres": [
    "Family",
    "Romance",
    "Erotica",
    "Contemporary"
  ],
  "author": "Savannah Rylan",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/40017143-the-road-rebels-motorcycle-club-box-set"
}