{
  "title": "David Dellinger: The Life and Times of a Nonviolent Revolutionary",
  "description": "The year was 1969. In a Chicago courthouse, David Dellinger, one of the Chicago Eight, stood trial for conspiring to disrupt the National Democratic Convention. Dellinger, a long-time but relatively unknown activist, was suddenly, at fifty-three, catapulted into the limelight for his part in this intense courtroom drama.From obscurity to leader of the antiwar movement, David Dellinger is the first full biography of a man who bridged the gap between the Old Left and the New Left. Born in 1915 in the upscale Boston suburb of Wakefield to privilege, Dellinger attended Yale during the Depression, where he became an ardent pacifist and antiwar activist. Rejecting his parents’ affluent lifestyle, he endured lengthy prison sentences as a conscientious objector to World War II and created a commune in northern New Jersey in the 1940s, a prototype for those to follow twenty years later.His instrumental role in the creation of Liberation magazine in 1956 launched him onto the national stage. Writing regular essays for the influential radical monthly on the arms race and the Civil Rights movement, he earned an audience among the New Left radicals. As anti-Vietnam sentiment grew, he became, in Abbie Hoffman’s words, the father of the antiwar movement and the architect of the 1968 demonstrations in Chicago. He remained active in anti-war causes until his death on May 25, 2004 at age 88.Vilified by critics and glorified by supporters, Dellinger was a man of a rigid Ghandian who nonetheless supported violent revolutionary movements; a radical thinker and gifted writer forced to work as a baker to feed his large family; and a charismatic leader who taught his followers to distrust all leaders. Along the way, he encountered Eleanor Roosevelt, Ho Chi Minh, Martin Luther King, Jr., the Black Panthers and all the other major figures of the American Left.The remarkable story of a stubborn visionary torn between revolution and compromise, David Dellinger reveals the perils of dissent in America through the struggles of one of our most important dissenters.",
  "genres": [
    "Politics",
    "History"
  ],
  "author": "Andrew E. Hunt",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/400139.David_Dellinger"
}