{
  "title": "Unbroken",
  "description": "Everything was supposed to go back to normal when I was rescued. It hasn't. And I'm starting to think it never will because I don't even know what normal is anymore...It's been two years since Aleks Silva was rescued by his older brother from the dark underworld of sex trafficking and every day since then has been a battle. Leaving the house, interacting with people, even doing something as boring as deciding what clothes to wear or what to eat for breakfast are tasks that most people take for granted. But for Aleks, they're torture. Because freedom and choice are things that once came at a steep price and survival meant submitting to the whims of those who only saw him as a possession and plaything.Until there was one man who saw him as something more...I knew from the moment I saw him that I was going to get him out. But I also knew once I did, I'd need to let him go...He's known as Vaughn and nothing more. His job is to make sure secrets don't get out and the possessions he's been tasked with guarding never escape and tell their story. After eight years in a world where innocent kids are used to feed the darkest of depravities, Vaughn has seen things that would break even the strongest man. But he's played it smart and built up a wall between himself and the darkness that threatens to consume him.It wasn't until he met a young man who had to be a thousand times stronger to survive the life he was forced into as a child that the first crack appeared in his carefully constructed wall.Vaughn's only job was to make sure young Aleks Silva remained the ugly little secret of one of the most powerful men in Chicago. It was one job he was more than happy to fail at, and when he eliminated the threat against Aleks and set him free, he was sure their paths would never cross again.But fate has other plans...Vaughn is the only man from my other life who never had a starring role in my nightmares... but he's been in every one of my dreams. And I don't know why...When Aleks is suddenly abducted after leaving work one quiet spring evening, he's certain he'll never see his brother and family again. But terror quickly turns to relief when a familiar face once again comes to his rescue, along with all the feelings he's always had but never quite understood around the dangerous, older Vaughn. Certain that Vaughn will make everything okay again like he did once before, Aleks knows he doesn't even need to ask Vaughn to take him home. But when he does anyway, nothing he's ever experienced prepares him for Vaughn's answer... or the brutal betrayal that comes along with it.I'm sorry, Aleks, I can't do that.Trigger Warning: Sexual Assault Against a Minor*Can be read as a standalone novel but if you have not read any books in this series, you may want to at least read Book 6, Atonement, first. Atonement is the story of Aleks's brother, Dante, and both brothers appear in each other's books so it is helpful to know their backstories.The Protectors series crosses over with some of my other series, so for the most enjoyment, they should be read in order, but it is not required. You can find the correct reading order at the beginning of each book. I've also bundled all my series in the correct reading order under the title of A Family Chosen: The Protectors and Barrettis.",
  "genres": [
    "M M Romance",
    "Romance",
    "Abuse",
    "Contemporary",
    "Dark",
    "LGBT",
    "Gay"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/40032551-unbroken"
}