{
  "title": "Ride: Complete Series",
  "description": "Bad boys and naughty girls provide the tone for this hot motorcycle romance in the world of Juliet. Take on all three Fluff, Bounce, and Raw in this “favorite of 2017.”  Set within the Juliet world, this series is standalone and will leave you breathless and begging for more. Meet the major players Dale, Amber, Sal, and Deacon as you ride alongside them in their journey to find love.  *FLUFF* She needs to escape.  AMBER  His assistant hired me on a whim, thinking I would be just what he needed. Boy, was she right. I bounced into his dressing room and discovered the famous actor held dual personalities – a nasty player and the naughty gentleman.  I won’t say which one I fell in love with but when I least expected it, the bastard broke my heart. Now, fifteen years later, the last man to break me is the only one who can save me.  His heart takes her captive.  DALE  After an intense twelve-week love affair, I lost the only girl I ever loved—all to save her—to keep her safe. What she doesn’t know is I’ve been watching her every move, guarding her from a dangerous world she knows nothing about.   Keeping secrets for so long with only a promise, the wall I built around her crumbles to the ground. In the ruins, the only question that remains is… Will she still answer to me?  Ride or die in the love affair of Mae East & Cyclone Blonde.  *BOUNCE* She escaped into his arms.  AMBER  I have everything I could want – the man of my dreams, his baby girl, a great career, and a beautiful home. I should be happy and having the time of my life. But I just can’t…  The past I left behind haunts me, threatening to destroy everything. I worked so hard to escape, yet the hooks are piercing into my soul, pulling me to the past and forcing me into a nightmare I can’t wake up from. And I know this time, he may not be able to save me.  His heart brought her freedom.  DALE  Every day I wake up thankful my beautiful angel is back in my life. I have it all now. But something is missing—the darkness I crave. I know I can’t exist without it. I need the tears in her ache and the fear in her sobs.  The closer she is to me, the less my grip becomes. I am losing control of her, of us, and worst of all—myself. And I cannot imagine the monster I will become when I let go… all to get her back.   The hunt is on in the love affair of Mae East & Cyclone Blonde.  *RAW* Escape.  AMBER  I need this man––this alpha dog of a man––D. His arrogance. His savage. His Dominance over everything that I am.  I thought I could run from the past, until it caught me. I thought I could erase the memory and make it go away, but it only brought on a flood of red. And now I am trapped—captured—between hell and him.  Heart.  DALE  Just when you think you have it all, it vanishes with one bullet. Her hands hold my baby. Her hands rule my world. Her hands brought everything crumbling down that night.  Forcing me to question her allegiances—who is she here for?  I will fight to protect us both. But I cannot save the girl who doesn’t want to be saved. We have been tested—time and again. But now, her hands belong to a monster of a girl I do not know.  The battle is on in the love affair of Mae East & Cyclone Blonde.",
  "genres": [],
  "author": "Kailee Reese Samuels",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/40033659-ride"
}