{
  "title": "Epic of Helinthia",
  "description": "EXPLORE THE UNTOLD EPIC OF ANCIENT GREECE!Anassa Iptys' glorious city burns. Forluna escapes with the rightful heir, a descendent of Apollo, and hides him away. But the new Anax, Charixes, is relentless. He will not rest until his hands are drenched in their blood.Under Charixes' rule, the gods abandon the island, and a devastating famine ravages the population. Desperate to win divine favor and end Charixes' cruelty, Dargos persuades Kelric and Gadnor to join him in rebellion. They embark on a quest to rally support for war, leaving Dargos' sister, Gonivein, safe behind the walls of Shallinath.But the Anax' spies have been watching, waiting for the right opportunity to strike. Capturing Gonivein is the devastating blow Charixes needs to crush all opposition to his tyranny.To defeat him, they need the gods on their side. The heir of Apollo can bring them back.There's just one problem: only Forluna knows where he is, and she has vowed to take her secret with her to the Underworld.\nEpic of Helinthia\n is the first in a series of four. An original Greek myth of warring gods and the mortals who must find a way to end the conflict before it destroys their world.~*~*~*~\"An AMAZING DEBUT filled with gods and goddesses, heroes and villains, love and loss, blood and tears: everything a fantasy novel needs to keep readers turning the page late into the night!\" - Maria V. Snyder, New York Times Bestselling author of The Poison Study\"Epic of Helinthia is A PAGE-TURNER OF AN EPIC-FANTASY DEBUT! Inspired by ancient Greek culture and mythology (and well-researched, too), this story is rich with political intrigue, plot twists, and betrayal, oh my! Can't wait to see what happens next.\" - Sharon Lynn Fisher, author of Salt & Broom",
  "genres": [
    "Mythology",
    "Fantasy",
    "Greek Mythology",
    "Historical Fiction",
    "Fiction",
    "Adult",
    "Retellings"
  ],
  "author": "M.J. Pankey",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/123076137-epic-of-helinthia"
}