{
  "title": "Cry Baby",
  "description": "Tristan Lopez is loyal to his brothers. He doesn’t really have a choice, born into a gang that has a chokehold on every kid that roams its streets. He gave his life to them willingly, knowing if he did then one day this kingdom, led by boys drunk with power and ruled by fear, would all be his.He was loyal through it all. Loyal when prison took his dad away. Loyal when his face was touched by the cold metal of the rival gang’s gun. Loyal even though his mom begged him to run the moment she returned home from rehab.He thought about becoming someone else. It was hard not to crave the life of a regular 17-year-old. It’s the only reason he stayed in school—to pretend. But he always fell back in line.Loyal.Riley Rojas didn’t belong in Tristan’s real world. She should have only been part of the fantasy, one of the many faces he got to pretend with amidst rows of metal chairs and desks and whiteboards with assignments. But there she was, moving boxes from the back of an old pick-up into a house Tristan had shot up on a dare with his friends only a few months before.Tall enough to look him in the eyes and strong enough to fill his shadow, Riley took up space on his streets, her loud mouth fearless in the face of the gang leaders who terrified everyone else. She pushed Tristan around on the hard court, and she balled better than his friends—better than him sometimes. She challenged him. She needed him. He liked it. And when her pale blue eyes stared into his, he quit wanting to pretend.He couldn’t ask her to leave because she’d only dig her heels in deeper. He couldn’t ask because he didn’t want her to go. She was blurring his lines. She was testing his loyalty.He was falling in love.And it was going to tear him apart.",
  "genres": [
    "Romance",
    "Young Adult",
    "New Adult",
    "Contemporary",
    "High School",
    "Sports",
    "Dark"
  ],
  "author": "Ginger Scott",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/40035422-cry-baby"
}