{
  "title": "Michael Faraday: The Life and Legacy of the Influential 19th Century Scientist Who Pioneered Electromagnetism",
  "description": "*Includes pictures *Includes Faraday's own quotes about his work *Includes online resources and a bibliography for further reading *Includes a table of contents “Nothing is too wonderful to be true, if it be consistent with the laws of nature.” – Michael Faraday \"Without such freedom there would have been no Shakespeare, no Goethe, no Newton, no Faraday, no Pasteur and no Lister.\" - Albert Einstein, in a speech on intellectual freedom after fleeing Nazi Germany, October 3, 1933 On April 18, 1955, a bell-like symphony of ringing telephones erupted in news stations, radio offices, and the homes of media figures across the United States. 38-year-old LIFE photographer Ralph Morse was among those whose phone started ringing off the hook. The groggy Morse was teetering on the line between lucidity and slumber when he picked up, but by the end of the call, which came from a clearly keen, but jittery LIFE editor, it was like he'd downed a liter of the world's strongest coffee. The one and only Albert Einstein had died. Morse grabbed his equipment, piled into his car, and raced to Princeton Hospital, where Einstein had been admitted to just 3 days earlier. Seeing that the place was pulsating with mobs of journalists, photographers, and nosy onlookers, Morse dipped into the Princeton Institute for Advanced Study and persuaded the superintendent to unlock Einstein's office with a case of premium scotch. As such, Morse was able to compactly capture one of the most defining photographs of the man's life and his work, and on the day of his death no less. Viewers are given a taste of Einstein’s unrivaled tenacity with the mound of journals and books strewn about on his desk, his pipe and tobacco tin serving as makeshift paper weights. Behind his swiveling leather chair, sitting slightly askew, was a blackboard featuring a wall of complex formulas and equations. It was in this very study, as well as his home office back in Berlin, that Einstein, perhaps the most celebrated genius in history, displayed the photographs of his five muses. Though only the framed portraits of Gandhi and another German composer have been pictured in Einstein's study, the faces of three other illustrious scientists are said to have once graced his walls. One of them was Michael Faraday, an endlessly luminous mind equipped with an unflagging hunger for knowledge, a hunger so ungovernable that not even poverty or social norms could stand in the way of his ambitions. Indeed, it was reportedly Einstein's expertise in the lives of Maxwell and Faraday, as well as his mastery of their work and accomplishments, that landed him his first job at the Swiss Patent Office after months of job-scouring. Moreover, Einstein's admiration for Faraday was so profound that when a friend gifted him a biography of his “hero” for his birthday, Einstein cherished it to the utmost degree. He expressed his gratitude towards his friend in an eloquent letter, writing, “You have given me great joy with the little book about Faraday. This man loved mysterious Nature as a lover loves his distant beloved. In this day, there did not yet exist the dull specialization that stares with self-conceit through horn-rimmed glasses and destroys poetry...” Needless to say, Michael Faraday, often hailed as one of the “greatest experimenters” to have ever lived, was in his own right an indispensable and boundlessly influential scientific pioneer. But what was it about Faraday, among so many other noteworthy scientists, that captivated Einstein, one of history's most fabled polymaths? Michael The Life and Legacy of the Influential 19th Century Scientist Who Pioneered Electromagnetism examines the life and work that made Faraday one of history’s most impor",
  "genres": [],
  "author": "Charles River Editors",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/40039752-michael-faraday"
}