{
  "title": "Married To A Chicago Bully",
  "description": "Bad lil’ thang, fine as hell. If you got a man, let him know I’m coming for him. And if you don’t, let these dudes know you belong to me – Atif Known on the streets of the Chi as God, Atif had no interest in being with one woman and one woman only. With his reputation as judge, jury and executioner wrapped into one, being in love has no place in his chosen line of work. Bumping into Kapri twice in one day was more than a coincidence, he had to know more about the exotic beauty whose eyes told the story of love and pain. You should know not to mess with me, I’ll break your heart – Kapri Chicago’s wild, wild west side was known for gunfights and shootouts on a daily basis. Kapri grew up as a product of her environment determined not to stay that way. Little did anyone know she was keeping a dark secret that no one would understand if it ever got out. Does she allow her past to dictate her future? Or can she teach Atif how to love a woman? When I found out my husband cheated on me I was determined to get back at him – Tanjalyn Tanjalyn had her own cross to bear stuck in a loveless marriage. Steve grounded her and provided her with stability while her heart begged to be with Prince, God’s ace. When Steve receives yet another commendation and promotion as an officer in the Navy, naturally he wants his family back together. Does she follow her heart or choose stability? The fact that she was married was the ONLY thing stopping me from putting her name on the deed to this house and the bank accounts. – Prince Prince treated women as disposable before meeting Tanjalyn. One date turned into a baby and a potentially messy situation two years later. Can he balance being one of Chicago’s biggest bullies while being a family man? Heavy is the head that wears the crown. But being married to a Chicago bully is even more of a headache. Will these women live through it? Or will the pressure be too much?",
  "genres": [
    "New Adult",
    "Fiction",
    "Contemporary",
    "Adult",
    "Young Adult",
    "Romance",
    "Love Story"
  ],
  "author": "Fatima Munroe",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/40039708-married-to-a-chicago-bully"
}