{
  "title": "It Came from the Sky",
  "description": "\"A page-turner as engrossing as any classic Twilight Zone starring two spirited brothers who run circles around the Hardy Boys.\" - Ben Philippe, Morris Award-winning author of The Field Guide to the North American TeenagerFrom the author of The Hundred Lies of Lizzie Lovett and  As You Wish comes the unforgettable story of the one small town's biggest hoax and the two brothers who started it all.This is the absolutely true account of how Lansburg, Pennsylvania was invaded by aliens and the weeks of chaos that followed. There were sightings of UFOs, close encounters, and even abductions. There were believers, Truth Seekers, and, above all, people who looked to the sky and hoped for more.Only...there were no aliens.Gideon Hofstadt knows what really happened. When one of his science experiments went wrong, he and his older brother blamed the resulting explosion on extraterrestrial activity. And their lie was not only believed by their town―it was embraced. As the brothers go to increasingly greater lengths to keep up the ruse and avoid getting caught, the hoax flourishes. But Gideon's obsession with their tale threatened his whole world. Can he find a way to banish the aliens before Lansburg, and his life, are changed forever?Told in a report format and comprised of interviews, blog posts, text conversations, found documents, and so much more, It Came from the Sky is a hysterical and resonant novel about what it means to be human in the face of the unknown.Additional Praise for It Came from the Sky\"Well written…Believable characters facing realistic teenage issues coupled with a thematic exploration of wishes, fears, and principles of honesty and ethics will help to keep readers' attention.\" - \nSchool Library Connection",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Science Fiction",
    "Fiction",
    "LGBT",
    "Queer",
    "Aliens"
  ],
  "author": "Chelsea Sedoti",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/40032347-it-came-from-the-sky"
}