{
  "title": "Tap",
  "description": "If only life were as simple as a clever pickup line.  Cade McNaughton is the last man standing. His brothers have all found love. Despite his recent oh-so-revealing Instagram nightmare and his family’s subsequent disappointment, Cade is ready to fall for a woman who cares more about the last book he read and less about his body. But amid the buzz and banter of tending Foghorn Brewery’s bar, Cade is not exactly settle-down material. All that’s about to change, starting with buzzing off his fauxhawk and sporting a cardigan that has everyone talking.  Sistine Branch has more bills than money, yet she’s fine eating barbecue chips for dinner if it means keeping her knitting shop open. But when her lights go out and the electrician puts a ten-thousand-dollar price tag on renovations, Sistine’s back is against an old and crumbling wall. For the past two years, she’s relied solely on herself, which makes selling out to the one woman from her past who can ruin everything the worst decision ever.  Cade and Sistine are backgammon and end-of-the-bar friends. One rejection, a literal fall into Cade’s arms, and a dinner date with farm animals has them enmeshed in feelings neither thought possible. But, it only takes one lie, a literal fall from grace, and a date with the she-devil to unravel everything they’ve come to know.  If they want a real shot, they’ll need to start from the beginning and realize that love is often a tangled mess, sometimes a funny T-shirt, but never perfect.Note:  Each Love Story  is a standalone. There are some shared characters throughout the books (siblings, friends, etc.) Closely related books are often distinguishable by the similar covers. The book order so far is as follows:-Premiere-Candidate-Taste-Reserved-Stirred-Vacancy-Playbook-Exposure-Brew-Smooth-Tap-Blow",
  "genres": [
    "Romance",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Tracy Ewens",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/40032970-tap"
}