{
  "title": "Wellsprings: A Natural History of Bottled Spring Waters",
  "description": "Bottled water is a part of everyday life for millions of Americans. Per capita consumption in the United States now tops fifteen gallons per year with sales over $5 billion in 2002. Even as fuel prices climb, many people are still willing to pay more for a gallon of bottled water than they are for the equivalent in gasoline. At the same time, bottled water has become a symbol of refined taste and a healthy lifestyle. But despite its growing popularity, many people cannot quite put their finger on just why they prefer bottled water to the much less expensive tap variety. Some have a vague notion that bottled water is \"healthier,\" some prefer the convenience and more consistent taste, and others are simply content to follow the trend. The fact is most people know very little about the natural beverage that they drink and enjoy. It is reasonable to wonder, therefore, just what differentiates bottled water from other water? Is it really better or healthier than tap water? Why is it that different brands seem to have subtle variations in taste? As Francis H. Chapelle reveals in this delightful and informative volume, a complex story of geology, hydrology, and history lies behind every bottle of spring water. The book chronicles the history of the bottled water industry in America from its beginnings in Europe hundreds of years ago to the present day. Subsequent chapters describe the chemical characteristics that make some waters desirable, and provide an overview of the geologic circumstances that produce them. Wellsprings explains how these geologic conditions vary throughout the country, and how this affects the kinds and quality of bottled water that are available. Finally, Chapelle shows how the bottled water industry uses this natural history, together with the perceived health benefits of spring waters, to market their products. Accessibly written and well illustrated, Wellsprings is both a revealing account and a user’s guide to natural spring waters. Regardless of your drinking preference, this timely exploration will make your next drink of water refreshingly informed.",
  "genres": [
    "History",
    "Food",
    "Nonfiction"
  ],
  "author": "Frank Chapelle",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/400441.Wellsprings"
}