{
  "title": "God: The Evidence: The Reconciliation of Faith and Reason in a Postsecular World",
  "description": "In the modern age science has been winning its centuries—old battle with religion for the mind of man. The evidence has long seemed Life was merely a product of blind chance—a cosmic roll of an infinite number of dice across an eternity of time. Slowly, methodically, scientists supplied answers to mysteries insufficiently explained by theologians. Reason pushed faith off into the shadows of mythology and superstition, while atheism became a badge of wisdom. Our culture, freed from moral obligation, explored the frontiers of secularism. God was dead.\"Glynn's arguments for the existence of God put the burden of disproof on those intellectuals who think that the question has long since been settled.\" — Andrew M. GreeleyBut now, in the twilight of the twentieth century, a startling transformation is taking place in Western scientific and intellectual thought. At its heart is the dawning realization that the universe, far from being a sea of chaos, appears instead to be an intricately tuned mechanism whose every molecule, whose every physical law, seems to have been design from the very first nanosecond of the big bang toward a single end—the creation of life. This intellectually and spiritually riveting book asks a provocative Is science, the long-time nemesis of the Deity, uncovering the face of God?Patrick Glynn lays out the astonishing new evidence that caused him to turn away from the atheism he acquired as a student at Harvard and Cambridge. The facts are Physicists are discovering an unexplainable order to the cosmos; medical researchers are reporting the extraordinary healing powers of prayer and are documenting credible accounts of near-death experiences; psychologists, who once considered belief in God to be a sign of neurosis, are finding instead that religious faith is a powerful elixir for mental health; and sociologists are now acknowledging the destructive consequences of a value-free society. The Evidence argues that faith today is not grounded in ignorance. It is where reason has been leading us all along.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Christian",
    "Philosophy",
    "Spirituality",
    "Christianity",
    "Theology"
  ],
  "author": "Patrick Glynn",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/1230824.God"
}