{
  "title": "Barbara Anderson Uncensored: Eyewitness To Deceit",
  "description": "Barbara Anderson was a Jehovah’s Witness from 1954 to 1997. But while working as a researcher and writer at their worldwide headquarters from 1982 thru 1992, something went terribly wrong. Barbara uncovered a conflict that would derail her plans, and change her life forever.Her unique story shines a bright light on Watchtower/JW.ORG policies that not only protect sexual predators, but unduly influence members to believe policies and beliefs of Jehovah’s Witnesses are Bible-based and inspired from God.Barbara’s story also includes unprecedented commentary from Bonnie Zieman, M.Ed., psychotherapist, and author Jon Atack. Bonnie and Jon have written extensively about coercive control and report behind the scenes, while Barbara shares her story, of what was happening psychologically in her high-control world.Praise for Barbara Anderson Uncensored – Eyewitness to Nothing short of awe-inspiring! Barbara’s valor in the face of an epic David versus Goliath battle to protect children against the policies of an international organization demonstrates how the efforts of one person, who stands up for right, truly can effect change. – Mariuca RofickThis unique book, about a woman who has changed so many lives, will also give readers a rare peek behind the scenes of how policies and beliefs are formed at the world headquarters for Jehovah’s Witnesses. – Mark O’DonnellI found myself spellbound reading Barbara’s story, which provides a unique perspective on how things work at Watchtower’s headquarters. Her time spent there as a researcher yielded some real nuggets regarding Watchtower’s history that were previously unknown, and expose how Watchtower white washes its history. – Lee ElderI highly recommend reading Barbara Anderson’s book. It is a candid narrative of a worldwide religion, one that most people have seen as harmless until now. She also offers a workable plan of action for change. – Joanna Foreman",
  "genres": [],
  "author": "Barbara   Anderson",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/40044556-barbara-anderson-uncensored"
}