{
  "title": "The Snow Angel",
  "description": "The woman in the picture was so young she looked like a child. Her hair was loose, eyes wide, blue T-shirt stark against the pale lines of arching collarbones. I felt the air leave me in a quiet rush. Not because of the way the photo captured her fleeting youth, but because of the way it highlighted the bruise.It was a photo of me.Rachel Price has just one happy memory from her the moment her father took her hands while playing outside on a cold, snowy day and called her his angel. It was a rare and sacred moment in her young life, one in which she finally felt safe, loved, and protected.But it didn’t last long.Years later, Rachel’s daughter is the only light in what has become a dark life. Rachel repeats the patterns she learned as a child and exposes her own daughter to those same destructive behaviors. Consumed by an abusive marriage, but secure in the safety of the familiar, she is too afraid to escape.Rachel accepts what her life has become, even as she makes excuses for those who keep her in a constant state of despair and regret. But then, an unexpected phone call from an old friend changes everything. Her ordered world is turned upside down as she’s set on a journey that might be her last chance to salvage the life she’d given up on long ago.While new friendships tentatively blossom, Rachel realizes that everything she once believed may be nothing but lies and misunderstandings. But knowing the truth is not as easy as it seems. Sometimes ignorance truly is bliss. As the snow falls and the promise of Christmas redemption nears, Rachel begins to see her entire childhood in a brand-new light and must now decide what her future holds—and what her past really means. Will knowing the truth set her free, or will it condemn her to a life full of regret and “what ifs”?The Snow Angel is a poignant tale about family, forgiveness, and the freedom to live a future free of the past.",
  "genres": [
    "Christmas",
    "Fiction",
    "Holiday",
    "Christian Fiction",
    "Book Club",
    "Abuse",
    "Inspirational"
  ],
  "author": "Glenn Beck",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/12307716-the-snow-angel"
}