{
  "title": "Growing Up Greenpoint: A Kid's Life in 1970s Brooklyn",
  "description": "\"An entertaining memoir that reads like a sitcom.\"\"Made me laugh until tears were coming down my face.\"In Growing up Greenpoint, Tommy Carbone captures what it was like to be a kid during the 1970s and 80s in Brooklyn, New York. This funny, and sometimes emotional, memoir follows the years Tommy was educated not only in the classrooms of St. Stan’s, but on the streets of Greenpoint. It was there, playing street games with friends, being cornered by muggers, playing kissing games with the girls, spending time with family, and constantly seeking out the best snack foods in the neighborhood, where Tommy learned a lot about life; although he may not have known it at the time. A simple conversation, years later, about the New York City Blackout of 1977 sparks Tommy to recall his youth in the city he loved. His stories will bring you into the action of what it was like to dodge cars during a ballgame, to take a hike to another borough in search of a particular burger, to the hours spent playing pinball in a corner candy store, and how special it was to build traditions with three generations of Polish and Italian relatives in Brooklyn’s garden spot. The vivid descriptions of his antics of what it was like to grow up during those years will transport you to the sounds and smells of living in the city during those trying years. Reading this book, you’ll be entertained, and at the same time, you may shake your head wondering how Tommy ever survived - Growing up in Greenpoint. *************************************Praise for Growing up Greenpoint,\"This book is a lot of fun. I enjoyed reading about a childhood so different from mine. It was fun to see childhood through a different lens.\" -- Golden State Media Concepts Book Review Podcast*************************************\"The narrative is skillfully woven together in a series of scenes covering a score of years and introducing a series of unforgettable characters who appear and disappear, offering the reader familiarity and a comfortable rhythm.Tommy Carbone writes with such feeling and warmth.\"Ronald MackayAuthor of, \"Fortunate Isle: A Memoir of Tenerife.\"*************************************\"I'd give it ten stars if i could\" - Amazon Review*************************************Find out more about Greenpoint Brooklyn and Tommy Carbone on the book's Facebook Page at:Greenpoint Brooklyn - The Book",
  "genres": [],
  "author": "Tommy Carbone",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/40059058-growing-up-greenpoint"
}