{
  "title": "Dead Men's Trousers",
  "description": "A spectacular return of the wild, dissolute gang from Trainspotting, from the author the New York Times called “Blisteringly funny…. ”The gang from Trainspotting have mostly cleaned up their act…until they are drawn back together to Scotland for one last scheme—a scheme one of them won’t survive. It’s an action-packed, hilarious and rollicking trip, as well as a moving elegy to the crew.“Welsh makes these amoral misadventures so propulsive, so joyfully awful, that you have to go with the flow…this roues’ romp is about as much fun as you can have between two book covers.”— The TimesMark Renton is finally a success. An international jet-setter, he now makes significant money managing DJs, but the constant travel, airport lounges, soulless hotel rooms and broken relationships have left him dissatisfied with his life. He’s then rocked by a chance encounter with Frank Begbie, from whom he’d been hiding for years after a terrible betrayal and the resulting debt. But the psychotic Begbie appears to have reinvented himself as a celebrated artist and - much to Mark’s astonishment - doesn’t seem interested in revenge.Sick Boy and Spud, who have agendas of their own, are intrigued to learn that their old friends are back in town, but when they enter the bleak world of organ-harvesting, things start to go so badly wrong. Lurching from crisis to crisis, the four men circle each other, driven by their personal histories and addictions, confused, angry - so desperate that even Hibs winning the Scottish Cup doesn’t really help. One of these four will not survive to the end of this book. Which one of them is wearing Dead Men’s Trousers?Fast and furious, scabrously funny and weirdly moving, this is a spectacular return of the crew from Trainspotting.",
  "genres": [
    "Fiction",
    "Scotland",
    "Thriller",
    "Novels",
    "Contemporary",
    "Mystery",
    "Crime"
  ],
  "author": "Irvine Welsh",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/40068450-dead-men-s-trousers"
}