{
  "title": "The Accidental Time Traveller",
  "description": "Life on Mars meets It's a Wonderful Life in this inventive romantic comedy that looks at what we can learn from the past….Journalist Rosie Hartford is having an odd day. Or one hell of a hangover…Having had a blazing row with her boyfriend - fellow journalist Will - she reluctantly sets off for her latest assignment: an interview with one of the residents of The Meadows, a grotty local estate about to become the set for a major reality TV show, The 1950s House.But stepping through the front door, Rosie finds herself in a different house - and transported back in time. Everything is grey and drab - the food, the clothes, the TV. It's like the world is in permanent black and white.It's not long before Rosie realises what's going on. She's obviously a contestant on the 1950s show! She's pretty miffed she's not been given warning, but she might as well give it a go - after all, the cameras are always watching and the first rule of reality TV is always keep smiling…But what really sends Rosie into a spin is the fact that Will is there too - but here he is known as Billy and has been married since he was 16 to Rosie's best friend. In the 1950s, Will/Billy is a family man and devoted father, a side to him that Rosie finds hard to imagine. He grows vegetables, repairs shoes and even has a shed. He is, in fact, a grown up.The truth slowly dawns on Rosie that this is reality, not reality TV. After she gets over the shock, she begins to embrace daily life 1950s-style. Gone are the excessive consumerism, drifting relationships and cheap thrills of the Noughties. In its place is make do and mend, commitment, duty and honour.Together Rosie and Billy make a great team, covering dramatic local stories, and inevitably growing closer until Rosie falls in love with Will/Billy all over again. But now he has a wife and kids and is out of bounds…Unless she can get back to 2008…",
  "genres": [
    "Time Travel",
    "Fiction",
    "Historical Fiction",
    "Romance",
    "Chick Lit",
    "Fantasy",
    "Contemporary"
  ],
  "author": "Sharon Griffiths",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/4006246-the-accidental-time-traveller"
}