{
  "title": "The Ghastling: Book Seven",
  "description": "This edition is a very special monster issue in celebration of the Bicentenary of Mary Shelley's Frankenstein.In Nigel Jarrett's Spectres of Innocence a son and daughter help their grieving father start afresh after the death of their mother. He moves into an old rectory with a troubled history. Unsettling events begin to unravel: who is the woman keeping their father company? And what might be pushing the empty swing on a still summer's day?Ever walked into a building and felt the hairs on the back of your neck prick up? Two travellers rent an old apartment but one becomes convinced it harbours something - a grudge, a dislike, perhaps it wants her out? Or is it just the intense heat closing in around her in Mark Blayney's peculiar tale Straits Eclectic.Catrin Kean spins a yarn of an old woman who lives alone on the old family farm by the sea. She is visited by a couple who want to buy her home. She agrees, but a secret is buried that threatens to rise and spill out if she leaves in Birdcage.Jess Thomas's Don't Stop Playing tells a story of monsters guarding treasure in a cave and a girl whose flute playing seduces them to sleep. Think of the old saying, 'Finders keepers' - but will what you find keep you...?Charlotte Symons, mesmerising tale, The Man Who Gathered Sorrow, the seemingly good deed of a man becomes monstrous - he has no choice but to destroy the thing before it destroys him...In Ewan Hannah's story, The Creature, a notorious and fiendish whisky hunter returns from his journey to Antarctica with bounty - Magnus MacSorley's lost ninth bottle. But beware on opening, this contains more than the warming amber liquid...Kevin O'Connor's Inis Suil a party of teenagers head to an island in what is supposed to be a night of camping, catching up and having fun. But something lurks in the darkness...A grave is dug up and the body of a young girl is exhumed because a farm settlement in America is disturbed by a revenant - a restless corpse. Measures must be taken to rest her soul in Mat Troy's The Connecticut TraditionTina Rath's The Banks of the Roses tells the story of two young lovers who meet at a quarry on a hot summer's day. There is a rumour a murder happened there and something called Jenny Greenteeth will pull you in and drown you if you get too near to the pool. Heed the warning, it is not always hearsay...In Chip Limeburner's story Along the Road set in the time of the Crusades a lone highwayman ambushes a team of horses and their cavalcade. He finds a casket of pristine bones but this is far from treasure - a very sinister loot...",
  "genres": [
    "Horror"
  ],
  "author": "Rebecca Parfitt",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/40080910-the-ghastling"
}