{
  "title": "Radio Silence: A Selected Visual History of American Hardcore Music",
  "description": "Radio A Selected Visual History of American Hardcore Music is a tribute to the innocence and accidental sophistication that jump-started the look and sound of hardcore music.Hardcore music emerged just after the first wave of punk rock in the late 1970s. American punk kids who loved the speed and attitude of punk took hold of its spirit, got rid of the “live fast, die young” mind-set and made a brilliant hardcore. The dividing line between punk and hardcore music was in the less pretense, less melody, and more aggression. This urgency seeped its way from the music into the look of hardcore. There wasn’t time to mold your liberty spikes or shine your Docs, it was jeans and T-shirts, Chuck Taylors and Vans. The skull and safety-pin punk costume was replaced by hi-tops and hooded sweatshirts. Jamie Reid’s ransom note record cover aesthetic gave way to black-and-white photographs of packed shows accompanied by bold and simple typography declaring things \"The Kids Will Have Their Say\", and \"You’re Only Young Once.\"Radio Silence documents the ignored space between the Ramones and Nirvana through the words and images of the pre-Internet era where this community built on do-it-yourself ethics thrived. Authors Nathan Nedorostek and Anthony Pappalardo have cataloged private collections of unseen images, personal letters, original artwork, and various ephemera from the hardcore scene circa 1978-1993. Unseen photos lay next to hand-made t-shirts and original artwork brought to life by the words of their creators and fans. Radio Silence includes over 500 images of unseen photographs, illustrations, rare records, t-shirts, and fanzines presented in a manner that abandons the aesthetic clichés normally employed to depict the genre and lets the subject matter speak for itself. Contributions by Jeff Nelson, Dave Smalley, Walter Schreifels, Cynthia Connolly, Pat Dubar, Gus Peña, Rusty Moore, and Gavin Ogelsby with an essay by Mark Owens.",
  "genres": [
    "Music",
    "Punk",
    "Art",
    "Photography",
    "Design",
    "Nonfiction"
  ],
  "author": "Nathan Nedorostek",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/4008247-radio-silence"
}