{
  "title": "Eyes Of The Keep",
  "description": "The demons have returned and are ravaging the countryside. The realms appear to be under siege by unknown forces, and the Kings have dispatched armies to march in their defense. The powerful wizards of the Keep are oblivious, and remain in their Keep with their noses buried in their studies. Once, the wizards of the Havenhold Keep ruled the world and were considered gods, now, they are irrelevant and forgotten. Ja'tar, the Keeper of the wizards, is confused. Events lead him to believe, for the first time in centuries, that all is not right and that it may be time for the wizards to re-enter society. His friend Zedd'aki, the only other surviving mage from the days of yore, cautions him against rash action, while Dra'kor and his followers, long for adventure and are willing to risk all to have it.The great mage wars had culminated with an epic battle at Ror, a distant province in the land of the Torren, where the last Dark Magi were finally conquered, abet at the cost of tens of thousands of wizards. The battle was waged for centuries, destroying vast swatches of land, leveling cities and destroying their advanced culture. Fearing future insurrections, the last of the magic races formed a Guild: an all powerful collection of autonomous members, who rule, guide and strictly enforce the Articles of Tofar, a pact that outlines permissible magic use in the Realms. For over sixteen hundred years, the wizards of the Keep have followed the Guild's rules to the letter. They remained secluded, didn't dabble in politics and never performed magic in public. They withdrew from the world and occupied themselves solely with their studies, in part, out of fear of the Zola'far, the Guild's nameless assassins. They trusted in the wisdom of the elders; that if they followed the law, they would never again be forced to fight their brethren. Perhaps they had erred. Mayhap those dark times had returned.",
  "genres": [
    "Fantasy",
    "Demons"
  ],
  "author": "Scott D. Muller",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/12309573-eyes-of-the-keep"
}