{
  "title": "The Medical Librarian's Guide to Natural Mental Health: Anxiety, Bipolar, Depression, Schizophrenia, and Digital Addiction: Nutrition, and Complementary Therapies",
  "description": "Author William Jiang, MLS is a former Columbia Psychiatry library chief, the author of more than 70 books in English, Spanish, French, and Portuguese, and has been featured in the New York Times and CBS News, as well as other major mental health news outlets for curing his own major depression using nutritional psychiatry. This is the 3rd edition of Mr. Jiang's best-selling book. See the new edition titled \"The Medical Librarian's Guide to Natural Mental Anxiety, Bipolar, Depression, Schizophrenia, and Digital Nutrition, and Complementary Therapies, 4th edition.\"From the book “In sum, 1,000 years ago, if somebody had a mental health issue, they told the patient to pray about it, take this or that herb, rest, and take care of themselves- their body being their temple. That all changed when the first of the anti-psychotics, the major class of drug used to treat psychosis, was discovered in France in 1952, named chlorpromazine, more commonly known as Thorazine. Thorazine secured FDA approval on March 26, 1954 as the first psychiatric medication. Since then for pretty much all mental illnesses, the advice has been. Don’t pray, don’t take that supplement, don’t worry about anything, just take this drug. Now, with the nutritional psychiatry movement, medicine is incorporating the wisdom of the ages with the science of modern psychiatric treatments to reduce human suffering and increase mental wellness as never before, and it is about time.” -William Jiang, MLSThe thrust of this book is nutrition and complementary therapies for digital addiction, anxiety, bipolar, depression, and schizophrenia. Truisms that have been passed down through the ages about mental health that have stood the rigors of scientific inquiry are presented. How does belief make one's brain stronger? The role of nutrition in ameliorating anxiety, bipolar, depression, and schizophrenia is discussed. Light is thrown on the benefits of meditation, yoga, aromatherapy, exercise, the healing power of music, and the detrimental effects of playing too many video games or too much electronic stimulation. The effect of light on bipolar disorder and the importance of good sleep hygiene is underlined. A question relevant to many of us, “What are the effects of being indoors all the time?” is delved into. A long list of things that can be helpful for ameliorating depression is presented natural herbal remedies, meditation, religion, yoga, the effect of too much or too little light, the role of exercise in fighting depression, the role of music on the mood, the role of a positive social network in recovery, the role of pets, the harmful effects of the digital lives we lead, and the healing power of scent. Finally, the amazing fact that nutrition can sometimes prevent psychosis or depression in its beginning stages before it becomes a fully-blown problem is presented. Many exciting and useful additional mental health tips are added to fourth edition. This is a book packed with word-class tips from a leader in natural mental health.",
  "genres": [],
  "author": "William Jiang",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/40110374-the-medical-librarian-s-guide-to-natural-mental-health"
}