{
  "title": "Dreyer’s English: An Utterly Correct Guide to Clarity and Style",
  "description": "\"An utterly delightful book to read, Dreyer's English will stand among the classics on how to use the English language properly.\" ELIZABETH STROUT\n_______________________\nAn indispensable, New York Times-bestselling guide to the craft of writing from Random House’s long-time copy chief and one of Twitter’s leading language gurus.We all write, all the books, blogs, tweets, emails, emails, emails – and we all want to write better. Benjamin Dreyer is here to help.As Random House’s copy chief, Dreyer has upheld the standards of the legendary publisher for more than two decades. He is beloved by authors and editors alike – not to mention his followers on social media – for playfully, brilliantly deconstructing the English language. Dreyer's English is the distillation of everything he has learned from copy-editing thousands of books, the perfect guide not just for writers but for everyone who wants to put their best prose foot forward.Both authoritative and amusing, Dreyer’s English offers lessons on punctuation, from the underloved semicolon to the enigmatic en-dash; the rules and nonrules of grammar, including why it’s OK to begin a sentence with “And” or “But” and to confidently split an infinitive; and why it’s best to avoid the doldrums of the Wan Intensifiers and Throat Clearers, including “very,” “rather,” “of course,” and the dreaded “actually.”And “Only godless savages eschew the Oxford comma.”Stuffed with advice, insider wisdom, and fun facts, this book will prove to be invaluable to everyone who wants to shore up their writing skills, mandatory for people who spend their time editing and shaping other people’s prose, and – perhaps best of all – an utter treat for anyone who simply revels in language.\n_______________________\n\nThis book is written in British English.\n\n_______________________\n\"Benjamin Dreyer's brilliant, pithy, incandescently intelligent book is to contemporary writing what Geoffrey Chaucer's poetry was to medieval a gift that broadens and deepens the art and the science of literature by illustrating that convention should not stand in the way of creativity, so long as that creativity is expressed with clarity and with conviction.\" JON MEACHAM\"Meet the guardian of grammar who wants to help you be a better writer. Benjamin Dreyer sees language the way an epicure sees food. And he finds sloppiness everywhere he looks.\" THE \nNEW YORK TIMES\n“Playful, smart, self-conscious, and personal . . . One encounters wisdom and good sense on nearly every page of Dreyer’s English.” WALL STREET JOURNAL“Destined to become a classic.” THE MILLIONS\"A mind-blower--sure to jumpstart any writing project, just by exposing you, the writer, to Dreyer's astonishing level of sentence-awareness.\" GEORGE SAUNDERS“Dreyer can help you . . . with tips on punctuation and spelling. . . . Even He’ll entertain you while he’s at it.” NEWSDAY\"It is Benjamin Dreyer's intense love for the English language and his passion for the subject that make the experience of reading Dreyer's English such a pleasure, almost regardless of the invaluable and practical purpose his book serves in such dark and confusing times for grammar and meaning.\" AYELET WALDMAN & MICHAEL CHABON\"This work is that rare writing handbook that writers might actually want to read straight through, rather than simply consult.\" \nPUBLISHERS WEEKLY",
  "genres": [
    "Nonfiction",
    "Writing",
    "Language",
    "Reference",
    "Linguistics",
    "Humor",
    "Books About Books"
  ],
  "author": "Benjamin Dreyer",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/40106480-dreyer-s-english"
}