{
  "title": "The Right to Be Wrong: Ending the Culture War over Religion in America",
  "description": "We call it the \"culture war.\" It's a running feud over religious diversity that's liable to erupt at any time, in the midst of everything from judicial confirmations to school board meetings. One side demands that only their true religion be allowed in public; the other insists that no religions ever belong there. As the two sides slug it out, the stakes are rising. An ever-growing assortment of faiths insist on an ever-wider variety of truths. How can we possibly all live together and keep both the peace and our integrity (not to mention our sanity)? How can we end the war without surrendering our principles? THE RIGHT TO BE WRONG explains how. It skewers both extremes, which it dubs the \"Pilgrims\" and the \"Park Rangers.\" Pilgrims get their name from the Plymouth Colony folk who banned Christmas just weeks after celebrating their first Thanksgiving. Pilgrims want to outlaw diversity by declaring their religion the official one. The truth, they say, licenses them to restrict others' freedom. The opposite extreme deals with diversity by trying to drive it underground, eliminating religious expression from public life altogether. The \"Park Rangers\" are named after the bureaucrats in a too-good-to-be-true story about New Agers, a public park and a certain sacred parking barrier. They say freedom requires them to banish other people's truths. THE RIGHT TO BE WRONG offers a solution that avoids both pitfalls. It draws its lessons from a series of stories —some old, others recent, some funny, others not. They tell of heroes and scoundrels, of riots, rabbis and reverends, Founders and flakes, from the colonial period to the present. The book concludes that freedom for all of us is guaranteed by the truth about each of us: Our common humanity entitles us to freedom — within broad limits — to follow what we believe to be true as our consciences say we must, even if our consciences are mistaken. Thus, we can respect others' freedom when we're sure they're wrong. In truth, they have the right to be wrong.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Cultural",
    "History"
  ],
  "author": "Kevin Seamus Hasson",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/401023.The_Right_to_Be_Wrong"
}