{
  "title": "Loving a Stranger",
  "description": "A Warrior able to take over the body of another...Thrust into his enemy's life...Soon begins to love his enemy's lonely, abused wife...but can she ever trust him again when she finds out she has been Loving a Stranger?*TROPES*--Fake Relationship, Hurt/Comfort, Forced Proximity, One Bed, He Falls First (and Hard!)**THIS IS A STAND ALONE NOVEL SET IN THE KINDRED UNIVERSEReeve J'lorn is an M-Switch Kindred. Their ability to jump into and control the body of another male for a limited period of time has gotten them the derisive nickname, \"Snatchers\" and they are not trusted by the other branches of the Kindred. Nevertheless, it is to Reeve, an acknowledged pirate and Snatcher, that the Kindred must turn with a top secret mission--to snatch the body of a high ranking enemy and destroy a secret weapon which threatens the entire universe. And so, Reeve steps into the body of his enemy...and into a whole different world.When Nallah Parokk's husband goes into a coma, she secretly hopes he will never awaken. Harryx is cruel and cold to her, beating her often and using her like a whore. Her existence is nearly unbearable but she knows it could be worse if her husband decides to throw her out on the street. Then he wakes up and suddenly he's...different. He's kind and loving in a way he never was before, so much so that Nallah is almost ready to forgive his past behavior. But what is behind her husband's sudden transformation? And will this change for the better last?Though he tries not to, Reeve is falling in love with his enemy's wife. But the beautiful little female with wide golden eyes is so wary around him, he wonders what the real Harryx did to her. When he begins to find out, he is horrified. How can he ever get Nallah to love him back when he is inhabiting the body of a monster--her jailer and abuser? He knows he has to tell her the truth about who he is but how can he make her understand? And if he does, will she ever be able to trust again after she finds out she has been...Loving a Stranger?*Author's Warning* Though I have tried to handle it in a delicate way, readers with a past history of domestic abuse may find parts of this book disturbing. Sadly, many of the situations my heroine encounters are taken from true accounts of abused women. If you are in an abusive situation, please seek help.",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction Romance",
    "Erotica",
    "Audiobook",
    "Science Fiction",
    "Paranormal"
  ],
  "author": "Evangeline Anderson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/40110605-loving-a-stranger"
}