{
  "title": "Condemned & Admired - The Earl's Cunning Wife",
  "description": "A French privateer’s daughter. A marquess’s son. And a chance encounter on the high seas.Twelve years ago, Lady Silcox fled England with her six-year-old daughter Violet to spare her the life she herself had been forced into: an arranged marriage to an older man.Today, VIOLET WINTERS is a grown woman sailing the seas on her French stepfather’s privateer, dreaming of commandeering a ship of her own. However, when she stumbles upon a betrothal announcement of the man she was set to marry, Violet cannot help but feel honour-bound to protect the woman who had been forced to take her place.Fortune smiles on Violet and delivers an English lord into her hands - and with him the chance to return to England unrecognised.OLIVER CORNELL, EARL OF CULLINGWOOD, is trapped in a life he abhors. Not seen as a son, but merely an heir, he dreams of sailing the seas, the epitome of freedom.By sheer happenstance, Oliver ends up on a merchant vessel, which is promptly boarded by a French privateer. On board the Chevalier Noir, Oliver meets the captain’s daughter, a woman unlike any other he has ever met. Utterly fascinated by the adventurous gleam in her eyes, he does not hesitate to offer his assistance when Violet finds herself in need of a guide to London’s upper society.Reveling in his first taste of adventure, Oliver poses as her husband…only to realise before long that posing as her husband will not be good enough.Can a privateer’s daughter and a marquess’s son ever have a happily-ever-after? Or is their love doomed to fail?This adventure story on the high seas by a USA TODAY bestselling author proves that love finds you even when you don't believe in it.If you like marriage of convenience stories with a touch of mystery, a dash of humour as well as heartfelt emotion, then you’ll love this instalment of Bree Wolf’s emotionally charged Love’s Second Chance Series. Buy CONDEMNED AND ADMIRED, grab a cup of tea, settle into your favorite reading spot and start this swoon worthy romance now!Love's Second Chance Series#1 Forgotten Remembered - The Duke's Late Wife (Rosabel Graham)#2 Cursed Cherished - The Duke's Wilful Wife (Anna Edmond)#3 Despised Desired - The Marquess' Passionate Wife (Ellie Frederick)#4 Abandoned Protected - The Marquis' Tenacious Wife (Henrietta Connor)#5 Ruined Redeemed - The Earl's Fallen Wife (Charlotte Sebastian)#6 Betrayed Blessed - The Viscount's Shrewd Wife (Beth Tristan)#7 Deceived Honoured - The Baron’s Vexing Wife (Madeline Derek)#8 Sacrificed Reclaimed - The Soldier's Daring Widow (Meagan Edward)#9 Condemned Admired - The Earl's Cunning Wife (Violet Oliver)More to follow:#10 Trapped Liberated - The Privateer's Bold Beloved (Alexandra Antoine)",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Regency",
    "Regency Romance",
    "Clean Romance"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/40100066-condemned-admired---the-earl-s-cunning-wife"
}