{
  "title": "Gunpowder Soup",
  "description": "Although there are a lot of football stories in this book, it isn't all about visits to away grounds (Millwall, Arsenal, Tottenham, West Ham, Leicester, Liverpool etc.) and other football-related essays. I also talk about home games against Stoke, Chelsea and Man U for instanceMy diatribes in my blogs and newspaper columns are simply my way of spinning the balls, because sometimes I like to see what number they land on. That’s all.But although I’m known mostly as a raconteur - and most of my books can be described as coming from the humourist vein – in ‘Gunpowder Soup’ I also touch on some subjects that are surely going to upset a few people.I’ve never quite understood the politically correct brigade. Hardly any subject is taboo to the Englishman when he’s laughing. No longer simply a fad, blogging is now an important new literary innovation. This book is not a story, and if you’re looking for a book that is all sweetness and light, please give this one a miss. It’s not for you. I won’t be offended and I honestly wish you a great life. If everyone likes me, then I’m not being controversial enough – and trust me when I say that in this book I get controversial.Right now the planet is spinning in new and scary directions, and this needs to be addressed. So inside the covers of this book I take a look at some of the challenges we’re currently facing. And some of my opinions are going to rattle a few people.So why the title ‘Gunpowder Soup’? Well, although my last book was entitled ‘100 Common Sense Policies to make BRITAIN GREAT again’ the book before that, ‘Nobody Asked Me, But …’, showed a rabbit popping out of a tin of soup on the cover. ‘Rabbit & Pork,’ of course, is Cockney rhyming slang for Talk, and on more than one occasion I’ve been accused of rabbiting away excessively – mostly at parties, and generally by my wife. So why a tin of soup? And why in particular Gunpowder Soup? Well I tend to believe that everyone is born perfect. Nobody is born with an inherent capacity to hate. It has to be taught. All of our experiences – family, school, work, the books we read, the newspapers we peruse, the music we listen to, our friends, our social life, the opinions of those around us, religion, sports we play or watch, those we love and those who love us, those we desire and those who desire us, those we travel with, our hopes and dreams and ambitions and achievements, our triumphs and disasters - go into a metaphorical cooking pot that we carry with us throughout our lives. All these ‘ingredients’ make up our Soup of Life.Now, when making a soup, once you’ve added an ingredient, it’s forever blended in and you can’t take it out again. You add a sprinkling of finely chopped garnish; cumin or oregano, and you can never take that ingredient out again. Never, ever, ever.So say at the age of six you add black pepper or rosemary or hatred or love or comedy, from then onwards it’ll always be part and parcel of your ‘soup.’ And as you add more ingredients the ‘recipe’ of your life evolves, and before you know it you can’t taste the coriander or the love any more, but it’s still there at a deep subliminal level. Remember that.Some people may not add hatred until they’re in their twenties, and most of us never add it at all. And you can never entirely erase the flavour of a particular spice in soup. That’s the metaphorical significance of a tin of soup, but since writing ‘Nobody’ it’s becoming abundantly clear that we’re facing greater challenges, and if we’re not very, very careful the country as we know it - these ‘pleasant pastures green’ - are set to implode! What else can I say? I write like a finger up your bum. I’m either a pleasant surprise or I make everything awkward and uncomfortable. I’m strong-willed, a bit outspoken and I write exactly what I’m thinking. I’m not to everyone’s taste, but I have a good sense of humour, a dirty mind and an honest heart.",
  "genres": [],
  "author": "Karl Wiggins",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/40097776-gunpowder-soup"
}