{
  "title": "Love's Magic",
  "description": "Professor Nate Reese rushes to protect a female student and is severely injured at the hands of her assailant. Traumatized by the attack, Nate sets his feet on a no-holds-barred path of activism designed to force university officials into addressing the issue of on-campus assault. To his shock, his primary frustration comes not from the university, but from his partner, David Gardener, a veteran of 12 years as a very popular Professor of Revolutionary War History. Terrified of losing his hard-won status at the school, David is reluctant to support Nate's militant efforts, while Nate, feeling abandoned by his partner, sees David's aversion to his activism as indifference to the trauma he suffered. Day by day they watch as their relationship disintegrates, while still struggling to resolve the disruptive issues engulfing the school they love. At the same time Irishman Colin Campbell, handsome and charismatic Sergeant for the campus police force, fights his own on-going war against campus assault. But behind his obsessive desire to gain justice for victims lies a devastating secret which could forever destroy his fiercely independent facade and expose his deepest fear. Ultimately, it is Colin’s powerful connection to a quiet, dark-eyed Title IX consultant which threatens to tear down his defenses and shatter the barriers protecting his heart.Colin was the bolt of lightning that ignited Joshua Abram’s heart. Cocky and irresistible, the dynamic police officer was everything Joshua had ever longed for in a man, and despite Colin’s insistence that he didn’t ‘do relationships’ Joshua couldn’t help but fall hopelessly in love. He knew his attraction to Colin could only end in heartbreak. His quiet, introverted nature could never hope to snare the vibrant, freedom-loving Irishman, so despite the undeniable and heated passion between them, he forces himself to back slowly away.When disagreements over an oddly disturbing case causes Colin’s hot Irish temper to erupt, their relationship is irrevocably shattered. Heartbroken, and convinced that Colin never wants to see him again, Joshua flees Charlottesville without a word, leaving Colin adrift and inconsolable. Finally forced to admit that he desperately needs Joshua by his side, Colin must now face the dark and long-suppressed memories which are irrevocably linked to his love for the handsome, Jewish consultant. Without even a forwarding address to guide him, he vows to find Joshua and beg his forgiveness. Colin’s struggle to conquer his pride and fear in order to find the love of his life and achieve their happily ever after will touch your heart. Four lives in turmoil fighting for the relationships they cherish, and at the heart of the struggle, a great university struggles to survive its most harrowing challenge. Please Note: This book contains adult language & steamy adult activities, it is intended for 18+ Adults Only.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Mystery",
    "Crime",
    "LGBT",
    "Audiobook"
  ],
  "author": "Janice Jarrell",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/40098122-love-s-magic"
}