{
  "title": "Silent Lucidity",
  "description": "She’s pinned in a crevasse beneath a field of high grass where no one in the colony has ever been. There’s no chance that anyone will ever find her even after she’s passed on. As if that weren’t enough, pinned next to her is an armored alien who has enough weaponry to kill them both.  Ani’s been getting better at maneuvering her hover board after much practice. Her skills will finally be put to the test however when an alien bounty hunter arrives in a flying armored suit. Although her superpowers won’t allow her to control the suit or shut it down, she manages to find a way to communicate with the alien and even to borrow the eyes of the suit. Through those eyes, all she can are many weapons targeting her as she flees to the woods on her board. They’d never yet traversed the whole Northern Wood, so she’s headed into uncharted territory with a hunter close on her tail. What she doesn’t know is at the top of the northern cliffs are some hidden fissures beneath the high grasses and her hover board wasn’t created to leap those. The Ani Maxima Files: Ptolemy’s Child SuperVirus Veiled Sky Enigma Flying in the Rain Silent Lucidity Flesh and Blood Soul SisterSocial Animal Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Kepler Moon Alpha, and Ghosts of Ophidian. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Terraformer, Maelstrom, Hope Rising, One Crazy Summer, and Vestige by McElhaney.   EDITORIAL REVIEWS:   \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review  \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher  Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/40098420-silent-lucidity"
}