{
  "title": "Understanding Our Cosmos -The Philosophical Way",
  "description": "This book aims to make an earnest endeavor to reconcile the different aspects and realms of the cosmos. It is a compendium of original philosophical ideas presented in the most practical way. From comprehensively defining God - De-cluttering the disarray that surrounds it to classifying human nature , categorizing instinctual behavior of individuals, distilling good and evil, elaborating pertinent theories and proposing new ones - this book beautifully touches upon all those aspects with simplicity and clarity. The book also gives ample illustrations to make concepts clear and tangible. Focusing on Morality and virtue, it explains logically as to why that is the best choice there is for individuals - systematically proving the same. It explains righteousness in the light of several theories including the Karma theory (called 'Karma Yoga' as per hindu view of life).It also compares and contrasts - logic, instinct and intuition and the validity of each of those under different circumstances. The author also speaks of the importance of progressive thinking and lucidly explains aspects like transformation and evolution of the soul.To quote Socrates - \" All right conduct depends on clear knowledge, that not only does the definition of a virtue aids us in acquiring that virtue, but also that the definition of the virtue is the virtue.\" This book is an attempt at doing just that.Understanding Our Cosmos' is a distinctive compendium of brilliant and deep philosophical ideas that are often misunderstood, presented in a style that is stunningly original. It is an attempt at simplifying and making philosophy accessible. This book is not meant to serve as a comprehensive treatise on the subject but rather aims to stimulate people to think. After reading this book your way of looking at philosophy will never remain the same.",
  "genres": [],
  "author": "Bhaktee Kale",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/40106564-understanding-our-cosmos--the-philosophical-way"
}