{
  "title": "Zeta: Resin Pines",
  "description": "After decades of regeneration, the event has left the world divided and ruled by Zeta. In southern England, a lone wolf named Snipe Siren gains a reputation as a fearless rebel and protector of non-citizens.Snipe’s head is full of unanswered questions. Presumed dead for over a year and having no recollection of missing time, he discovers his girlfriend Lexi had disappeared that same night. Subtle changes to the town and the introduction of scan pods entraps him within the small community he was raised in after he was abandoned by his father.Snipe embarks on a roller coaster ride of escape and capture to find Lexi, as well as a secret base controlled by his father. With only a coded diagram, Snipe’s journey unearths his past and the perils facing Lexi. Fraught with dangerous challenges, he battles Zeta through towns and villages, helping the innocent to escape an invisible killer.Thrust into a path of self-discovery, spies, clones, cannibals, and a doorway to another world; time is running out to liberate those born outside the system and escape the next event. Snipe Siren is the hunter, the hunted, and an outsider in search of love.“Zeta, by S.P. Rowell, is a deeply engaging, character-driven science fiction novel that accomplishes the impossible by combining the hard-hitting power of a fast-paced, action-packed narrative with emotionally-charged character development and rich, well-crafted relationships that feel realistic and grounded. A rare credit to its genre, Zeta is an unpredictable must-read with refreshingly vibrant female characters and a witty, resilient anti-hero that immediately steals the reader’s heart. With a bold storyline full of labyrinthine twists and turns, culminating in a cerebral ending that is as surprising as it is satisfying, Rowell masterfully balances the surreal qualities of a futuristic landscape with the gritty realism of a desolate dystopia to provide a gripping tale you won’t soon forget.”-Abigail Stefaniak, EditorTristan Williams5.0 out of 5 stars WOW! A fantastic read. Can’t define it by genre, as it twists and turns, page by page!!!27 July 2018 PaperbackVerified PurchaseHaving read other works by S P Rowell, I sought this book out and have only been further impressed!!It is impossible to define this book by genre as it seamlessly shifts between SCI-FI, dystopian, thriller, action, adventure and philosophical aspects constantly. The story development is thoroughly fascinating, character development is clear and is clearly linked to the narrative.However, the greatest achievement is the main protagonist as the author has managed to achieve the perfect balance of heroism, flaws, humour and ultimately, a character trying his very best to deal with everything the world throws at him.I won’t ruin this read for any prospective buyers with spoilers, but if you want an exciting, engaging, beautifully crafted and ‘un-put-downable’ read from an up and coming author, this IS the book for you.Since I finished this book, I have been in touch with the author via his website, and he has said that there are more instalments in the works! Seriously, I can’t wait and I have added the author to my wish list!!Ulrich Braunbeck 5.0 out of 5 stars enjoy the book PaperbackThere are books and books but sometimes, there are new writers with a new approach to write.All I can say is, enjoy the book. Maybe there is more from this author in future.Josh 5.0 out of 5 stars Couldn’t put the book down! Kindle EditionSuch a good read – would recommend to everyone!Kindle Customer Five Stars 18 June 2018 Kindle EditionGripping and original",
  "genres": [],
  "author": "S.P. Rowell",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/40124819-zeta"
}