{
  "title": "Leonardo's Swans",
  "description": "Isabella d'Este, daughter of the Duke of Ferrara, born into privilege and the political and artistic turbulence of Renaissance Italy, is a stunning black-eyed blonde and a precocious lover and collector of art. Worldly and ambitious, she has never envied her less attractive sister, the spirited but naive Beatrice, until, by a quirk of fate, Beatrice is betrothed to the future Duke of Milan. Although he is more than twice their age, openly lives with his mistress, and is reputedly trying to eliminate the current duke by nefarious means, Ludovico Sforza is Isabella's match in intellect and passion for all things of beauty. Only he would allow her to fulfill her destiny: to reign over one of the world's most powerful and enlightened realms and be immortalized in oil by the genius Leonardo da Vinci.Though Isabella weds the Marquis of Mantua, a man she has loved since childhood, Beatrice's fortunes rise effortlessly through her marriage to Ludovico. The two sisters compete for supremacy in the illustrious courts of Europe, and Isabella vows that she will not rest until she wrestles back her true fate and plays temptress to the sensuous Ludovico and muse to the great Leonardo. But when Ludovico's grand plan to control Europe begins to crumble, immortality through art becomes a luxury, and the two sisters must choose between familial loyalty and survival in the treacherous political climate.Leonardo's Swans is an evocation of the artist during his years in the glittering court of Milan, re-creating the thrilling moments when he conceived The Last Supper and the Mona Lisa. It portrays a genius ahead of his time who can rarely escape the demands of his noble patrons long enough to express his own artistic vision.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Italy",
    "Historical",
    "Art",
    "Art History",
    "Romance"
  ],
  "author": "Karen Essex",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/40127.Leonardo_s_Swans"
}