{
  "title": "Instructions for a Funeral: Stories",
  "description": "\"Poetic, insightful, and deeply moving. David Means is one of my very favorite writers.\" --Tara Westover, author of EducatedFollowing the publication of his widely acclaimed, Man Booker-nominated novel Hystopia, David Means here returns to his signature form: the short story. Thanks to his four previous story collections, Means has won himself an international reputation as one of the most innovative short fiction writers working today: an \"established master of the form.\" (Laura Miller, The Guardian). Instructions for a Funeral--featuring work from The New Yorker, Harper's, The Paris Review, and VICE--finds Means branching out beyond the explorations of violence and trauma with which he is often identified, prominently displaying his sly humor and his inimitable way of telling tales that deliciously wind up to punch the reader in the heart. With each story Means pushes into new territory, writing with tenderness and compassion about fatherhood, marriage, a homeless brother, the nature of addiction, and the death of a friend at the hands of a serial-killer nurse. Means transmutes a fistfight in Sacramento into a tender, life-long love story; two FBI agents on a stakeout in the 1920s into a tale of predator and prey, paternal urges and loss; a man's funeral instructions into a chronicle of organized crime, real estate ventures, and the destructive force of paranoia.Means's work has earned him comparisons to Flannery O'Connor, Alice Munro, Sherwood Anderson, Denis Johnson, Edgar Allan Poe, Anton Chekhov, and Raymond Carver but his place in the American literary landscape is fully and originally his own.Confessions --Fistfight, Sacramento, August 1950 --The chair --The terminal artist --Fatherhood: three --Farewell, my brother --The Mighty Shannon --Instructions for a funeral --El Morro --The butler's lament --The ice committee --The tree line, Kansas, 1934 --Carver & Cobain --Two ruminations on a homeless brotherv",
  "genres": [
    "Short Stories",
    "Fiction",
    "Book Club",
    "American",
    "Essays",
    "Audiobook",
    "Short Story Collection"
  ],
  "author": "David Means",
  "average_rating": "3.01",
  "url": "https://www.goodreads.com/book/show/40121975-instructions-for-a-funeral"
}