{
  "title": "The Big Book of Bizarro",
  "description": "“Salacious - Sacrilegious - Scatalogical - Scotomizing - Strange!” The Big Book of Bizarro brings together the peculiar prose of an international cast of the most grotesquely-gonzo, genre-grinding modern writers who ever put pen to paper (or mouse to pad), including: NIGHT OF THE LIVING DEAD horror writers John Russo & George Kosana HUSTLER MAGAZINE erotica contributors Eva Hore, Andrée Lachapelle, & J. Troy Seate and Established Bizarro genre authors D. Harlan Wilson, William Pauley III, Laird Long, Richard Godwin and so many more! From Alien abductions to Zombie sex, The Big Book of Bizarro contains OVER FIFTY STORIES of the most outrélandish transgressive fiction that you’ll ever lay your capricious and curious hands upon! WARNING: This book may be one of the most controversial and dangerous books you’ll ever read. The stories in The Big Book of Bizarro include: HORROR Daniel In The Lion's Den by Kai MiroWet by Mark GallagherThe Whore of the Dartmoor by Rich Bottles Jr.The Fall by David J. FairheadGlory Holes by Gary Lee VincentChannel 666 by John RussoForever Ago Sunshine by Wol-vriey JesutoHoney-do by Nikko LeeEvery Bite by Matt SmallwoodNothing Really Satisfies by Kelly R. MartinDecorations by Nelson W. PylesKarnivali by Jesse J. SaxonFront Page by Michael A. MiglioreInto The Night by Heather LinHades on Ice by Kimberly BennettHis Own Worst Enemy by Laird LongWriter's Block by Ryan J. McBriarEvery by Charlie KirbyCity of the Dead by Clare de LuneWant by Meself JohnSCI-FI & FANTASY Alien Apocalypse by ZmortisSaved by Thomas FuchsPearl by Scott EmersonWorms by George R. GaluschakIn Cocoon, I am Embryo by Kenzie MathewsThe Only One To Save by Derek TaborScotomization by D. Harlan WilsonFalse Idols by Sean MartinI'm Going To The Moon by Christy Leigh StewartDiethylamide by Michael C. ThompsonTheir Quiet, Bookish Life by Chadwick H. SaxelidGloriana by Angela CapertonBleedin' Hearts by Salvatore ButtaciThe Image of the Lord by Jon JudyPunch and Jesus by Anonymous ChristianJumpers by Michael BrackenNude Sushi with a Twist by Keith DuggerTalking Heads by Nicole E. PefferBOOM CLICK CLICK by William Pauley IIISuccor the Child by Mercy LoomisShe Who Cleans: A Dung Sticker’s Shitty Tale by A.D. SpencerTiffany's!! It's Get Even Time!! by George KosanaCotton Mouth by Christopher DanaherInBox by Brennon ThompSonLosing Control by R. Scott SteeleEROTICA One Hell of a Band by J.T. SeateLester's Ominous Gift by Eva HoreThe Gathering by Madeleine SwannWomb With a View by Reina SobinLove Bites by Andrée LachapellePomegranate Moth by Richard GodwinSonata for Insects and Violins by Peter BaltenspergerFrosty by Alice JacobsFun House by Kimber ValeButterfly Kisses by Duncan MeeceSexual Madness by Rose de FerTerra Cupidus by Robin Tiergarten",
  "genres": [
    "Bizarro Fiction",
    "Short Stories",
    "Horror",
    "Fiction",
    "Fantasy",
    "Anthologies"
  ],
  "author": "Rich Bottles Jr.",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/12311511-the-big-book-of-bizarro"
}