{
  "title": "Headmaster",
  "description": "At one time, I had truly believed that I’d experienced enough drama in my life.  Clearly, I’d been wrong.  It all began the night before I was due to start my final year of school—the night of my eighteenth birthday. Since I had been considered “missing” for three years, I had failed to finish off the last year of my education. This was why I needed to let loose a little. I was turning eighteen and was finally legal to drink, so, why not? The next morning, I would be going to school with a bunch of ladies three years younger than I was. Even if it was for no other reason, I felt this entitled me to have a little fun.  The night started off well enough: Girl meets boy. Girl gets dared to buy boy drink and kiss him within fifteen minutes of receiving said drink.  It sounds like it would have been plain and simple, right?  Wrong.  I had no idea that his kiss would be the kiss to end all kisses. One taste of him, and I was lost for the first time in all my eighteen years.  But I wasn’t meant to feel anything… Three years of living in Hell had taught me that. But, this man … just … awakened me.  I went home that night feeling both alive and scared shitless at the same time.  However, that wasn’t the worst of it.  The very next day at assembly in school, we were all introduced to our new headmaster…  None other than the very same man who had—just the night before—locked lips with me in the most hypnotic, take-your-breath-away kiss I had ever had.  Yeah, I am seriously screwed.  He’s a forbidden fruit that I long to taste again. No matter how hard I try, I can’t seem to get that kiss out of my head. So badly, I want to escape him, his presence, his ... everything.  It seems, however, that the universe has other ideas.  *I don’t want anyone to feel misled, so I’m adding a sort of disclaimer to this book.*  To my longtime readers: You all know what sort of books I write and what to expect (even if it’s the unexpected). Darkness is a defining element of most of what I write. That’s why I would like to introduce HEADMASTER to you as being unique among my books. It is a contemporary romance novel with threads of dark woven through it. It’s not what you’re used to, but if you like this genre as well and are willing to give me a chance, it is my hope that you’ll enjoy it for what is, since it can’t properly be compared to anything else I have written to date.  To new readers: Welcome, and please take this statement in reverse. HEADMASTER is the tamest I’ve written, but if you enjoy it and a also enjoy books that have a little more bite, I hope you’ll enjoy the others as well.  Happy Reading!",
  "genres": [
    "Romance",
    "Dark",
    "Contemporary Romance",
    "High School",
    "Contemporary",
    "Suspense",
    "Teachers"
  ],
  "author": "Jaimie Roberts",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/40115173-headmaster"
}