{
  "title": "La escritora muerta",
  "description": "Sinopsis: Anna es una escritora de mediana edad que crió a su hija sola. En la actualidad Berta ha crecido, y las dudas que le supondría conocer a su padre, a quien solo ha visto en una fotografía, se incrementan cuando la relación que mantiene con su novio entra en crisis. Hans trabaja en una fábrica y tiene una hermana, Clara, una joven incomprendida que vive obsesionada por un tipo que conduce una moto amarilla. Pero es, ante todo, la historia de Anna Flieder, que cuando opta por escribir un libro de estilo más biográfico, la inspiración la visita y toma la forma de aquel hombre a quien hace años abandonó.\"En la historia se observa el proceso de creación de la literata. [...] Es una obra que va dirigida a quienes les gusta leer y se dejan absorber por la lectura, porque deja mucha imaginación, y hay muchas cosas que se intuyen.\" -La Mañana. Leer entrevista\"La escritora muerta\" es, por tanto, una invitación a todos aquellos que aprecian el modo con que la Literatura se refleja sobre sí misma en una obra literaria. Pero también representa la oportunidad de seguir otros personajes con sentimientos y en situaciones que nos provocan, de manera inevitable, una identificación. [...] El deleite de un texto literario que sobresale por un lenguaje metafórico y que sugiere imágenes capaces de revelar escenas cotidianas, pero que, muchas veces la vida, llena de múltiples posibilidades, no nos permite ver.\"-Dra. Alexandra Santos Pinheiro, en revista Resonancias literarias, no. 153 Leer reseña\"Este libro cuenta la historia de Anna, una escritora, y el mundo y la vida de las personas que la rodean. Anna vive su vida literaria como la real, sufre un tipo de esquizofrenia cuando los personajes de sus libros chocan con su vida en su deseo de ver la luz.\" -Debbie Garrick, traductora\"La escritora muerta, una obra que demuestra no solo su buen hacer como autora sino además, como veremos, su manejo de la herramienta esencial de todo novelista, el lenguaje. [...] Esta novela que es al mismo tiempo un lúcido artefacto literario que de seguro satisfará el variopinto gusto del lector contemporáneo.\" -Letralia, Tierra de Letras Leer reseña\"La escritora Núria Añó teje con una maestría que va muy lejos y ahonda en la exploración del individuo contemporáneo.\" -Noury Bakrim, Traductor",
  "genres": [
    "Fiction",
    "Spanish Literature",
    "Spain",
    "Novels",
    "Cultural"
  ],
  "author": "Núria Añó",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/40114920-la-escritora-muerta"
}