{
  "title": "It's Not A Hard Habit To Break: How To Develop Good Habits For Success In All Areas Of Your Life",
  "description": "When you really think about it, most of life is something we do out of habit. From the moment we wake up in the morning to the actions we take throughout the day – our “morning routine”, or “regular breakfast”, our “typical commute”, the “daily grind” at work – the habits we develop literally control about 95% of our actions. These types of unconscious thoughts determine what we think, how we feel and how we behave in nearly every situation we find ourselves in.Because our habits dictate all the small details that make up our everyday lives, they also are directly related to the bigger issues in our lives, such as how much money we earn, the kind of person we live with or marry, our physical condition and health, and every other area of our lives.Our habits determine our character, the type of person we project to the rest of the world and, ultimately, our destiny. So, if we embrace bad habits – those habits which have a negative impact on who we are – then those same habits will prevent us from achieving excellence in our lives, holding us back from reaching our fullest potential.It’s only by breaking bad habits and replacing them with good habits that we can ultimately succeed in life and be the people we were truly meant to be. The purpose of this book is to show you how to break bad habits – any sort of bad habit, from those that are damaging to your health, like smoking or not wearing a seatbelt, to those that affect your self-esteem, such as negative thinking or overeating – and replace them with positive behaviors that can become part of your daily life and finally cause you to see the results you truly want.Albert Einstein once said that the definition of insanity was performing the same task over and over again and expecting a different result. When you keep repeating the same bad habits, you would have to be crazy to think that anything will ever change for you. “It’s Not A Hard Habit To Break” will show you how to end the madness and start living your life to its fullest by abandoning bad habits and replacing them with positive ones.",
  "genres": [],
  "author": "David Schmall",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/40118823-it-s-not-a-hard-habit-to-break"
}