{
  "title": "The Case Against Impeaching Trump",
  "description": "\"Alan Dershowitz is a brilliant lawyer...He has written a new and very important book called The Case Against Impeaching Trump, which I would encourage all people...to read!\"—President Donald TrumpThe New York Times bestseller“This brand new book by Professor Dershowitz is absolutely amazing….If you care about justice and the President with the witch hunt, you’re going to want to read this book.”—Sean Hannity “Maybe the question isn’t what happened to Alan Dershowitz. Maybe it’s what happened to everyone else.”—PoliticoAlan Dershowitz has been called “one of the most prominent and consistent defenders of civil liberties in America” by Politico and “the nation’s most peripatetic civil liberties lawyer and one of its most distinguished defenders of individual rights” by Newsweek. Yet he has come under partisan fire for applying those same principles to Donald Trump during the course of his many appearances in national media outlets as an expert resource on civil and constitutional law.\nThe Case Against Impeaching Trump\n seeks to reorient the debate over impeachment to the same standard that Dershowitz has continued to uphold for the law of the United States of America, as established by the Constitution. In the author’s own “In the fervor to impeach President Trump, his political enemies have ignored the text of the Constitution. As a civil libertarian who voted against Trump, I remind those who would impeach him not to run roughshod over a document that has protected us all for two and a quarter centuries. In this case against impeachment, I make arguments similar to those I made against the impeachment of President Bill Clinton (and that I would be making had Hillary Clinton been elected and Republicans were seeking to impeach her). Impeachment and removal of a president are not entirely political decisions by Congress. Every member takes an oath to uphold the Constitution of the United States, and the Constitution sets out specific substantive criteria that MUST be met.I am thrilled to contribute to this important debate and especially that my book will be so quickly available to readers so they can make up their own minds.”",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Law",
    "Political Science",
    "Audiobook"
  ],
  "author": "Alan M. Dershowitz",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/40137894-the-case-against-impeaching-trump"
}