{
  "title": "Back in the Game: One Gunman, Countless Heroes, and the Fight for My Life",
  "description": "The \"gripping and inspiring\" true story ( Washington Examiner ) of how Congressman Steve Scalise survived a political mass shooting and returned to Congress with the help of his friends, family, and faith.On the morning of June 14, 2017, at a practice field for the annual Congressional Baseball Game, a man opened fire on the Republican team, wounding five and nearly killing Louisiana congressman Steve Scalise.In heart-pounding fashion, Scalise's minute-by-minute account tells not just his own harrowing story, but the stories of heroes who emerged in the seconds after the shooting began and worked to save his life and the lives of his colleagues and teammates.Scalise delves into the backgrounds of each hero, seeking to understand how everyone wound up right where they needed to be, right when they needed to be there, and in possession of just the knowledge and experience they needed in order to save his life. Scalise takes us through each miracle, and each person who experienced it. He brings us the story of Rep. Brad Wenstrup, an Army Reserve officer and surgeon whose combat experience in Iraq uniquely prepared him for the attack that morning; of the members of his security detail, who acted with nearly cinematic courage; of the police, paramedics, helicopter pilots, and trauma team who came together to save his life.Most important, it tells of the citizens from all over America who came together in ways big and small to help one grateful man, and whose prayers lifted up Scalise during the worst days of his hospitalization. As we follow the gripping, poignant, and ultimately inspiring story, we begin to realize what Scalise learned firsthand in real that Americans look out for each other, and that there is far more uniting us than dividing us.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Steve Scalise",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/40144521-back-in-the-game"
}