{
  "title": "The Nasty Bits: Collected Varietal Cuts, Usable Trim, Scraps, and Bones",
  "description": "New York Times BestsellerThe good, the bad, and the ugly, served up Bourdain-style.Bestselling chef and No Reservations host Anthony Bourdain has never been one to pull punches. In The Nasty Bits , he serves up a well-seasoned hellbroth of candid, often outrageous stories from his worldwide misadventures. Whether scrounging for eel in the backstreets of Hanoi, revealing what you didn't want to know about the more unglamorous aspects of making television, calling for the head of raw food activist Woody Harrelson, or confessing to lobster-killing guilt, Bourdain is as entertaining as ever. Bringing together the best of his previously uncollected nonfiction--and including new, never-before-published material-- The Nasty Bits is a rude, funny, brutal and passionate stew for fans and the uninitiated alike. Anthony Bourdain is the author of seven books including the bestselling Kitchen Confidential and A Cook's Tour . A thirty-year veteran of professional kitchens, he is the host of No Reservations on the Discovery Channel, and the executive chef at Les Halles in Manhattan. He lives in New York City.Praise for Anthony Bourdain: \"Bourdain's enthusiasm is so intense that it practically explodes off the page . . . Bourdain shows himself to be one of the country's best food writers. His opinions are as strong as his language, and his tastes as infectious as his joy.\"-- New York Times Book Review\"[Writes] the kind of book you read in one sitting, then rush about annoying your coworkers by declaiming whole passages.\"-- USA Today\"Bourdain's prose is utterly riveting, swaggering with stylish machismo and a precise ear for kitchen patois.\"-- New York magazine",
  "genres": [
    "Nonfiction",
    "Food",
    "Memoir",
    "Cooking",
    "Travel",
    "Biography",
    "Food Writing"
  ],
  "author": "Anthony Bourdain",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/40136.The_Nasty_Bits"
}