{
  "title": "The Dialogue of the Dogs",
  "description": "\"Ever since I could chase a bone, I've longed to talk....\"The first talking-dog story in Western literature—from the writer generally acknowledged, alongside William Shakespeare, as the founding father of modern literature, no less?Indeed, The Dialogue of the Dogs features, in a condensed, powerful version, all the traits the author of Don Quixote is famous It's a picaresque rich in bawdy humor, social satire, and fantasy, and it uses story tactics that were innovative at the time, such as the philandering husband who, given syphilis by his wife, is hospitalized. Late one feverish night he overhears the hospital's guard dogs telling each other their life's story—a wickedly ironic tale within the tale within the tale, wherein the two virtuous canines find themselves victim, time and again, to deceitful, corrupt humanity.Here in a sparkling new translation, the parody of a Greek dialogue is so entertaining it belies the stunningly prescient sophistication of this novella—that it is a story about telling stories, and about creating a new way to discuss morality that isn't rooted in empiricism. In short, it's a masterful work that flies in the face of the forms and ethics of its time...and perhaps ours as well.The Art of The Novella SeriesToo short to be a novel, too long to be a short story, the novella is generally unrecognized by academics and publishers. Nonetheless, it is a form beloved and practiced by literature's greatest writers. In the Art Of The Novella series, Melville House celebrates this renegade art form and its practitioners with titles that are, in many instances, presented in book form for the first time.",
  "genres": [
    "Fiction",
    "Classics",
    "Spanish Literature",
    "Novella",
    "Literature",
    "Short Stories",
    "Audiobook"
  ],
  "author": "Miguel de Cervantes Saavedra",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/4012749-the-dialogue-of-the-dogs"
}