{
  "title": "Right Against Might: The Trio Versus the Sefids",
  "description": "Join the exciting story of right against might as the trio tries to save the world from falsehood and extinction. Get your copy at www.inkedresistanceislamicpublishing.com.\"Right Against Might: The Trio Versus the Sefids\" is a thriller about three Muslim high-school students, Ali, Ahmad and Salim, who live in the west. They must uncover the conspiracies of the Sefids, a mysterious international organization, before they take over the world. The novel incorporates aspects of true life, including glimpses into the illuminati and the 9-11 conspiracy. It mimics the secret conspiracies of zionism as its adherents attempt to control people’s minds, dominate the world’s resources and oppress the weak in humanity. The trio face danger, jinns, kidnapping and even death to expose the dreaded organization’s mechanisms. The boys must help to clear the name of the Momineen, the true believers of God, who have been demonized by the Sefids’ control of the media.Muslim readers, thirsty for Islamic mysteries, will enjoy this “save the world” book. All young adults will identify with the exciting story of right against might as the trio attempts to save the world. Reading Preview\t“We are known as the humiliated and wretched,” Waters began, clearing his throat. “That is fine! Let them think of the Sefids like that. For all they know, the Sefids are a distant memory. No longer are there Sefids to disobey and transgress and kill the Prophets, they believe. Good!\t“With our extermination, we have grown large. With our downfall, we have arisen. With our dispersion, we have gained strength. With the stupid belief that we are gone, we have multiplied. To the animals we are something vague and ambiguous, something from before they were born. They have knowledge of nothing. Let them remain ignorant of us! And when we decide to strike, who will be able to stop us?”\tShouts of “Long live the Sefids!” and “Born to rule! Rule to crush!” rocked the Cave.So begins the introduction to the dreaded Sefids in Fajr Almas’s patiently awaited novel, \"Right Against Might: The Trio Versus the Sefids.\"About the AuthorFajr Almas is the pen name of a North American Muslim writer. Due to the seriousness of this book’s topic, the author has chosen not to publish under their real name. It is hoped that readers do not view this as cowardice, but as intelligence in the face of dangerous times in the “new world order.”",
  "genres": [
    "Muslims"
  ],
  "author": "Fajr Almas",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/40142245-right-against-might"
}