{
  "title": "Taming the Vampire",
  "description": "An unlikely partnership...Demon hunter Liz Marlowe and vampire Jack Morgan have hated each other from the moment they met. But when a powerful enemy threatens their beloved city of Boston, they form a reluctant alliance. It's supposed to be temporary--just one night, in fact. But as the tension between them builds to the breaking point, neither is prepared for what happens next.Taming the Vampire is a sexy paranormal romance novella of 17,000 words, or about 60 pages. It's the first book in the Blood and Absinthe series.The Blood and Absinthe series:Book 1 - Taming the Vampire (a novella)Book 2 - Bound by the Vampire (a novella)Book 3 - Claiming the Vampire (a full-length novel)Book 4 - Drawn to the Vampire (a full-length novel)Book 5 - Caught by the Wolf (coming in 2014!)EXCERPT\"I'll stay on one condition,\" he said.Her heart thumped against her ribs. \"What?\"\"We'll do the ritual, but on my terms.\"She wished he wasn't so tall. It gave him an unfair advantage, being able to tower over her like this. It was hard to breathe, hard to-- \"What do you mean, your terms?\"\"Do you want to know a secret?\"Her blood was rushing in her ears. She couldn't speak.He slid an arm around her waist and pulled her hard against him. She gasped, as shocked as if she'd stepped into icy water. She felt his strength, his power, and for a second her own power seemed to desert her. He bent his head close to hers. \"I want you,\" he whispered.Her face flamed, like a teenager's.\"I've wanted you from the first moment I saw you,\" he said, and now his lips were on her throat, at her pulse point, against her collar bone.She opened her mouth but no words came out. Her eyes closed and her head went back, and he kissed his way up her throat, to her ear, and then he was whispering to her again.\"I can make you feel good, Liz. Better than anyone's ever made you feel.\"",
  "genres": [
    "Vampires",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Erotica",
    "Novella"
  ],
  "author": "Chloe Hart",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/12312972-taming-the-vampire"
}