{
  "title": "Doomsday is on Wednesday",
  "description": "Doomsday is on Wednesday is fueled with earthshattering mystery and thrills in the traditions of David Baldacci, Lee Child, Tom Clancy, and Brad Thor where a monstrous power struggle takes place. A high stakes game of cat and mouse plays throughout the story. It's a combination of Russian Roulette and Enemy of the State.-EARL SWINGER, a solitary nuclear engineer with an elusive past, is on the run from the Nay Slayers; hunters trained by multiple intelligence agencies, after uncovering the largest illegal research project in history. He's got his good name, a cryptic message from The Consortium - a group high-tech Crunchers - who've all mysteriously vanished, and a head start.The Nay Slayers plan to destroy Swinger by drawing him into an inescapable trap made just for him. When he gets a slew of crucial emails from The Consortium, his instinct is put on high alert. It means one gruesome thing: a chilling guarantee that his escalating paranoia and obsessive plummet into the pits of darkness and despair weren't symptoms of denial after all.Shattered and desperately trying to understand the incomprehensible urgency of the messages, Swinger bolts from his safehouse, leaving everything behind. Already a wanted fugitive, Swinger is relentlessly hunted not only by the government but by the Nay Slayers who use their uncanny detecting abilities to sniff him out, but Swinger has his secrets, and he hopes that even the savage Nay Slayers won't find his most precious gambit until it's too late. JULIAN MERCY, shriveling away on her deathbed, wants revenge on her government for something she's called the ultimate sin. The new government refuses to let this happen and already have multiple plans in place to prevent any of her terroristic threats from being realized in America. Julian has promised to deliver her payback, someday on a Wednesday, with her remaining breath, to as wide an audience as possible as their DOOMSDAY, and it will be their apocalypse. The public wants the truth, and Mercy wants vengeance, but Swinger must dodge his trackers for as long as possible while all the pieces of the puzzle come together. Can Swinger, a civilian, deliver the deathblow, and survive long enough against the best-trained government assassins the world has ever seen to expose the greatest government conspiracy of the century?",
  "genres": [],
  "author": "Sean Bela",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/40171364-doomsday-is-on-wednesday"
}