{
  "title": "Prey: Immigration, Islam, and the Erosion of Women's Rights",
  "description": "Why are so few people talking about the eruption of sexual violence and harassment in Europe’s cities? No one in a position of power wants to admit that the problem is linked to the arrival of several million migrants—most of them young men—from Muslim-majority countries.In Prey, the best-selling author of Infidel, Ayaan Hirsi Ali, presents startling statistics, criminal cases and personal testimony. Among these facts: In 2014, sexual violence in Western Europe surged following a period of stability. In 2018 Germany, “offences against sexual self-determination” rose 36 percent from their 2014 rate; nearly two-fifths of the suspects were non-German. In Austria in 2017, asylum-seekers were suspects in 11 percent of all reported rapes and sexual harassment cases, despite making up less than 1 percent of the total population. This violence isn’t a figment of alt-right propaganda, Hirsi Ali insists, even if neo-Nazis exaggerate it. It’s a real problem that Europe—and the world—cannot continue to ignore. She explains why so many young Muslim men who arrive in Europe engage in sexual harassment and violence, tracing the roots of sexual violence in the Muslim world from institutionalized polygamy to the lack of legal and religious protections for women. A refugee herself, Hirsi Ali is not against immigration. As a child in Somalia, she suffered female genital mutilation; as a young girl in Saudi Arabia, she was made to feel acutely aware of her own vulnerability. Immigration, she argues, requires integration and assimilation. She wants Europeans to reform their broken system—and for Americans to learn from European mistakes. If this doesn’t happen, the calls to exclude new Muslim migrants from Western countries will only grow louder. Deeply researched and featuring fresh and often shocking revelations, Prey uncovers a sexual assault and harassment crisis in Europe that is turning the clock on women’s rights much further back than the #MeToo movement is advancing it.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Feminism",
    "Religion",
    "Islam",
    "History",
    "Sociology"
  ],
  "author": "Ayaan Hirsi Ali",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/40153681-prey"
}