{
  "title": "Sun",
  "description": "And the Bridge spins her light, until we come to live here no more…  In this final installment of the epic science-fantasy series, Allie and Revik fight their final war of all against all, facing off with the Mythers, a silent, behind-the-scenes army of religious fanatics and murderers mobilized to end this life-cycle on Earth.  While Revik and Allie try to pull the pieces of their life and marriage back together after the nightmare of their last mission in China, Myther armies pop up around the globe, murdering seers and humans from the Displacement Lists and taking over quarantine cities left over from the human plague. Worse, the grisly, ritualistic murders they perform aren’t simply sadistic or religiously-motivated, but part of a millennia-long plan of the Dreng to leave Earth altogether, destroying the planet and murdering most of its inhabitants in the process.  Allie and Revik have no time left to fix things between them––and no future left to put things off. Cobbling together the last remnants of their own forces, they launch a final counter-offensive, teaming up with the most unlikely of allies and using every weapon left at their disposal. Only together with their entire dysfunctional “family” of seers and humans can they change the course of history and forge a new hope for both races.  Standalone novel. No cliffhanger.  SUN is book 10 and the FINAL book in the main Bridge & Sword series (not including prequel novels). It is also related to the Quentin Black World, and takes place in the wider history/world of the seers.  THE BRIDGE & SWORD WORLD is a dark, gritty science fiction and apocalyptic series with strong romantic elements, starring Alyson Taylor and her partner, dark and dangerous infiltrator, Dehgoies Revik. For fans of gritty, character-driven science fiction and fantasy worlds, filled with twists and turns and backstabbing betrayals, with heroes and villains who can be equally relatable (and sometimes the same people). The Bridge & Sword books span continents and historical periods as Allie and Revik try to save the human and seer races from destroying one another, and keep their friends and loved ones alive in the process.  BRIDGE & SWORD WORLD Reading Order: Rook (Bridge & Sword Series #1) Shield (Bridge & Sword Series #2) Sword (Bridge & Sword Series #3) Shadow (Bridge & Sword Series #4) Knight (Bridge & Sword Series #5) War (Bridge & Sword Series #6) Bridge (Bridge & Sword Series #7) Prophet (Bridge & Sword Series #8) Dragon (Bridge & Sword Series #9) Sun (Bridge & Sword Series #10)  QUENTIN BLACK MYSTERY SERIES Reading Order: Black In White (Quentin Black Mystery #1) Black As Night (Quentin Black Mystery #2) Black On Black (Quentin Black Mystery #3) Black Is Back (Quentin Black Mystery #4) Black And Blue (Quentin Black Mystery #5) Black Of Mood (Quentin Black Mystery #6) Black To Dust (Quentin Black Mystery #7) ~ Coming Soon!",
  "genres": [
    "Science Fiction"
  ],
  "author": "J.C. Andrijeski",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/40165754-sun"
}