{
  "title": "Mutmassungen über Jakob",
  "description": "Uwe Johnsons erster veröffentlichter Roman ist wegen seiner komplexen Erzählkonstruktion ein schwieriges Buch, das durch seine Thematik (die deutsche Teilung) den jungen Nachkriegsautor und Grenzgänger aus Ostdeutschland sogleich bekannt machte.Entstehung: Johnsons Mutter arbeitete bei der Reichsbahn als Schaffnerin, dann beim Gütertransport. Nach ihrer Flucht konnte der Sohn weiter in der Güstrower Bahnkantine essen. So lernte er die Arbeitswelt kennen. Nach Schwierigkeiten, erste Romanskripte drucken zu lassen, schrieb Johnson zwischen dem 6.2. und dem 4.12.1958 an dem Buch, das zunächst »Guten Tag, Jakob« heißen und unter dem Pseudonym Joachim Catt erscheinen sollte.Inhalt: Jakob Abs, 28 Jahre alt, stammt aus Mecklenburg und ist Beamter bei der DDR-Reichsbahn in Dresden. Im November 1956 wird er auf dem Rangiergelände von einer Lok überfahren. Ob sein Tod ein Unfall im Nebel, Selbstmord oder gar von den Behörden geplant war, kann nur Gegenstand von »Mutmaßungen« sein, welche die Vorgeschichte erhellen.Der fleißige, ruhige, kollegiale, loyale, gegenüber der DDR-Politik vorsichtige und gegenüber Westdeutschland eher skeptische Abs wird von der Spionageabwehr überwacht, seit seine Mutter und seine Freundin Gesine Cresspahl, die nun für die NATO arbeitet, sich in den Westen abgesetzt haben.Die Handlung ist geprägt von der Halbdurchlässigkeit des Eisernen Vorhangs in der kurzen Tauwetter-Periode, die nach dem Ungarn-Aufstand 1956 – Jakob muss als Eisenbahner die sowjetischen Militärtransporte bemerken – wieder endet: Gesine besucht ihren Vater Heinrich und Jakob, wobei sie vom Abwehr-Hauptmann Rohlfs unter Druck gesetzt wird. Während er den regimekritischen, in Gesine verliebten Hochschulassistenten Dr. Blach verhaftet, lässt Rohlfs das Paar Cresspahl-Abs an der langen Leine, um beide möglichst ohne Gewalt zu gewinnen (Aktion »Taube auf dem Dach«), so dass Jakob sogar in den Westen reisen kann, von wo er trotz Gesines Liebe freiwillig zurückkehrt und am selben Tag stirbt.Aufbau: Die mysteriöse, aber unspektakuläre, für die Schwierigkeiten der innerdeutschen Beziehungen, seien sie privat oder politisch, typische Geschichte aus dem gut beobachteten und durch Fachsprache lebendig gemachten Eisenbahneralltag verfährt analytisch und ist keinesfalls linear erzählt. Ähnlich Max R Frischs Figur Stiller muss Jakob Abs von anderen rekonstruiert werden. Daher besteht der größte Teil der fünf Kapitel aus Bruchstücken von Gesprächen zwischen dem Kollegen Jöche und Jonas Blach, zwischen diesem und Gesine, zwischen dieser und Rohlfs sowie aus kursiv gesetzten inneren Monologen, die der Leser in einem Rekonstruktionsspiel Jakobs Kontaktpersonen zuweisen muss. Hinzu kommen Passagen, in denen ein Erzähler den Zusammenhang herstellt, jedoch nicht so, dass am Schluss eine Lösung für den Anfang stünde: »Aber Jakob ist doch immer quer über die Gleise gegangen.« Der Zwang zu »Mutmaßungen« überträgt sich von den beteiligten Personen, die ihre Rolle oder Schuld mitreflektieren, auf die Leser. Die Sprache mit ihren Anklängen plattdeutscher Mündlichkeit charakterisiert in Satzbau und Grammatik die Figuren. Bibelanklänge durchziehen, bei Jakobs Namen beginnend, das Buch und verleihen ihm eine überzeitliche Dimension. Für den Autor war das komplizierte Erzählen kein Formalismus, sondern adäquater Ausdruck der deutschen VerhältnisseWirkung: Das Buch, als kritischer Beitrag zur eigenständigen DDR-Literatur konzipiert, erregte Aufsehen, da Johnson bald nach der Veröffentlichung durch den Frankfurter Suhrkamp Verlag in den Westen übersiedelte. Die DDR ignorierte es 20 Jahre lang; allerdings kann man den Roman Der geteilte Himmel (1963) von Christa R Wolf als gezielten Gegenentwurf lesen. Johnson erhielt 1960 für die Mutmaßungen über Jakob den Fontane-Preis.",
  "genres": [
    "German Literature",
    "Fiction",
    "Germany",
    "Classics"
  ],
  "author": "Uwe Johnson",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/1231400.Mutmassungen_ber_Jakob"
}