{
  "title": "Change Your Underwear Twice a Week: Lessons from the Golden Age of Classroom Filmstrips",
  "description": "In the pre-Internet, pre-VCR—oh, go ahead, call them prehistoric—days of baby boomers' grade school, the high art of audiovisual classroom programming was the filmstrip. If you're old enough, you remember the darkened room, the hum of the projector, and the beeep that signaled the teacher to turn to the next frame. If you weren't busy shooting spitballs, filmstrips might even have taught you something about science, hygiene, the great bounty of American farms and factories. With simple illustrations and quaint photographs that evoke a more innocent era, Change Your Underwear Twice a Week is the first book to collect dozens of these filmstrip treasures together, creating a panorama of four decades of overlooked graphic design, popular culture, and inadvertent humor. Readers from the Internet generation will get a good chuckle over what appears to be electronic cave art. But you'll also discover one of the great subtexts of postwar American life. From the mid-1940s until the late 1960s, filmstrips were the coming attractions of capitalism and the American way, teaching youngsters how society wanted them to view the world. Filmstrips celebrated our foundering railroads (\"Tommy Takes a Train Trip\"), the space program (\"The Moon, Our Nearest Neighbor\"), and our trusted friend the butcher, the milkman, the mailman, and the cop. They taught us not to sit too close to our new TV sets and why we should change our underwear twice a week (presumably, Commies did this only once a week). A chronicle of America's filmstrip experience, Change Your Underwear Twice a Week is also a glimpse into the companies and eccentric pioneers who created these graphic gems and how they influenced several generations of American youth.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Education",
    "Art",
    "History"
  ],
  "author": "Danny Gregory",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/40169.Change_Your_Underwear_Twice_a_Week"
}