{
  "title": "For the Hope of a Crow",
  "description": "Ramsey Hunt is caught in a spiral no one can save him from, and he’s taking his entire Clan of crow shifters down with him. A broken mating bond has him going insane, and all he can do is try to hold onto his Alpha position as long as possible. But when a spirited beauty comes waltzing into his MC’s clubhouse demanding an audience with him, he can’t help but think he’s dreaming her up. She’s got paperwork saying he’s her mate, and this shifter has one serious stubborn streak in her. All he wants to do is go insane in peace, but she isn’t having it. And now the real work begins. He’s got to sever one mating bond completely if he wants a shot at survival. And if this crazy plan works, he might just have a second shot at happiness too.  Vina wants a crow. She doesn’t care who they are, as long as their shifter animal is a crow. They mate for life and she’s tired of being pushed around by the men she dates. So when a crow comes up on the shifter matchmaking service she applied for three years ago, she has a good feeling her stars are about to change. That is, until she meets Ramsey. The half-crazed Alpha of the biggest, baddest Clan of crow shifters in existence isn’t going to make pairing up easy. And the more Vina gets to know him, the more she thinks it wasn’t him who signed up for a mate after all.  And now Vina has two choices—cut and run from the storm coming for the Red Dead Mayhem Clan, or dig her heels in and rip that old mating bond out of Ramsey. Up until now, no one has appreciated her, but what if…just what if…she could be the one to save the crows?   Content Warning: Explicit love scenes, naughty language, and piles of sexy shifter secrets. Intended for mature audiences.",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Supernatural",
    "Fiction"
  ],
  "author": "T.S. Joyce",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/40164845-for-the-hope-of-a-crow"
}