{
  "title": "Black Is the Body: Stories from My Grandmother's Time, My Mother's Time, and Mine",
  "description": "An extraordinary, exquisitely written memoir (of sorts) that looks at race--in a fearless, penetrating, honest, true way--in twelve telltale, connected, deeply personal essays that explore, up-close, the complexities and paradoxes, the haunting memories and ambushing realities of growing up black in the South with a family name inherited from a white man, of getting a PhD from Yale, of marrying a white man from the North, of adopting two babies from Ethiopia, of teaching at a white college and living in America's New England today. \"I am black--and brown, too,\" writes Emily Bernard. \"Brown is the body I was born into. Black is the body of the stories I tell.\"The storytelling, and the mystery of Bernard's storytelling, of getting to the truth, begins with a stabbing in a New England college town. Bernard writes how, when she was a graduate student at Yale, she walked into a coffee shop and, along with six other people, was randomly attacked by a stranger with a knife (\"I remember making the decision not to let the oddness of this stranger bother me\"). \"I was not stabbed because I was black,\" she writes (the attacker was white), \"but I have always viewed the violence I survived as a metaphor for the violent encounter that has generally characterized American race relations. There was no connection between us, yet we were suddenly and irreparably bound by a knife, an attachment that cost us both: him, his freedom; me, my wholeness.\"Bernard explores how that bizarre act of violence set her free and unleashed the storyteller in her (\"The equation of writing and regeneration is fundamental to black American experience\").She writes in Black Is the Body how each of the essays goes beyond a narrative of black innocence and white guilt, how each is anchored in a mystery, and how each sets out to discover a new way of telling the truth as the author has lived it. \"Blackness is an art, not a science. It is a paradox: intangible and visceral; a situation and a story. It is the thread that connects these essays, but its significance as an experience emerges randomly, unpredictably . . . Race is the story of my life, and therefore black is the body of this book.\"And what most interests Bernard is looking at \"blackness at its borders, where it meets whiteness in fear and hope, in anguish and love.\"",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Essays",
    "Race",
    "Anti Racist",
    "Biography",
    "African American"
  ],
  "author": "Emily Bernard",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/40163296-black-is-the-body"
}