{
  "title": "Down and Out in Purgatory",
  "description": "Twenty tales of science fiction and fantasy from the two-time World Fantasy and Philip K. Dick Award winning author of The Anubis Gates and On Stranger Tides.POWERS OF THE IMAGINATION!  Twenty-one pulse-pounding, mind-bending tales of science fiction, twisted metaphysics, and supernatural wonder from the two-time World Fantasy and Philip K. Dick Award-winning author of The Anubis Gates and On Stranger Tides.  A complete palette of storytelling colors from Powers, including acclaimed tale “The Bible Repairman,” in which a psychic handyman who supernaturally eliminates troublesome passages of the Bible for paying clients finds the remains of his own broken soul on the line. Time travel takes a savage twist in “Salvage and Demolition,” where the chance discovery of a long-lost manuscript throws a down-and-out book collector back in time to 1950s San Francisco where he must prevent an ancient Sumeric inscription from dooming millions in the future. And obsession and vengeance survive on the other side of death in “Down and Out in Purgatory,” where the soul of a man lusting for revenge attempts to eternally eliminate the killer who murdered the love of his life.  Wide-ranging, wonder-inducing, mind-bending—these and other tales make up the complete shorter works of a modern-day master of science fiction and fantasy.   Praise for Down and Out in Purgatory:  \"Powers creates tales of dark, thought-provoking drama that are just frightening enough to make you keep the lights blazing but not enough to give you nightmares. . . . This is a treat for fans and newbies alike; hand it to readers who enjoy genre-blending authors as varied as Jim Butcher, Dean Koontz and China Mieville.\"—Booklist  “Powers is a writer whose senses and soul are attuned to a cosmic symphony most of us would not hear without his deft channeling of the music.”—Paul di Filippo, Locus  About Tim Powers:  \"Powers writes in a clean, elegant style that illuminates without slowing down the tale. . . . [He] promises marvels and horrors, and delivers them all.\"—Orson Scott Card  \". . .  immensely clever stuff.... Powers' prose is often vivid and arresting . . . All in all, Powers' unique voice in science fiction continues to grow stronger.”—Washington Post Book World  “Powers is at heart a storyteller, and ruthlessly shapes his material into narrative form.”—The Encyclopedia of Science Fiction  “On Stranger Tides . . . immediately hooks you and drags you along in sympathy with one central character's appalling misfortunes on the Spanish Main, [and] escalates from there to closing mega-thrills so determinedly spiced that your palate is left almost jaded.\"—David Langford  \"On Stranger Tides . . . was the inspiration for Monkey Island. If you read this book you can really see where Guybrush and LeChuck were -plagiarized- derived from, plus the heavy influence of voodoo in the game. . . .  [the book] had a lot of what made fantasy interesting . . .”—legendary game designer Ron Gilbert  “Powers's strengths [are] his originality, his action-crammed plots, and his ventures into the mysterious, dark, and supernatural.” Los Angeles Times Book Review  \"[Powers’ work delivers] an intense and intimate sense of period or realization of milieu; taut plotting, with human development and destiny . . . and, looming above all, an awareness of history itself as a merciless turning of supernatural wheels. . . . Powers' descriptions . . . are breathtaking, sublimely precise . . . his status as one of fantasy's major stylists can no longer be in doubt.”—SF Site",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Horror",
    "Fiction",
    "Science Fiction"
  ],
  "author": "Tim Powers",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/40167774-down-and-out-in-purgatory"
}