{
  "title": "Mind Fixers: Psychiatry's Troubled Search for the Biology of Mental Illness",
  "description": "In Mind Fixers, Anne Harrington, author of The Cure Within, explores psychiatry’s repeatedly frustrated struggle to understand mental disorder in biomedical terms. She shows how the stalling of early twentieth century efforts in this direction allowed Freudians and social scientists to insist, with some justification, that they had better ways of analyzing and fixing minds.But when the Freudians overreached, they drove psychiatry into a state of crisis that a new “biological revolution” was meant to alleviate. Harrington shows how little that biological revolution had to do with breakthroughs in science, and why the field has fallen into a state of crisis in our own time.Mind Fixers makes clear that psychiatry’s waxing and waning biological enthusiasms have been shaped not just by developments in the clinic and lab, but also by a surprising range of social factors, including immigration, warfare, grassroots activism, and assumptions about race and gender. Government programs designed to empty the state mental hospitals, acrid rivalries between different factions in the field, industry profit mongering, consumerism, and an uncritical media have all contributed to the story as well.In focusing particularly on the search for the biological roots of schizophrenia, depression, and bipolar disorder, Harrington underscores the high human stakes for the millions of people who have sought medical answers for their mental suffering. This is not just a story about doctors and scientists, but about countless ordinary people and their loved ones.A clear-eyed, evenhanded, and yet passionate tour de force, Mind Fixers recounts the past and present struggle to make mental illness a biological problem in order to lay the groundwork for creating a better future, both for those who suffer and for those whose job it is to care for them.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Science",
    "History",
    "Mental Health",
    "Psychiatry",
    "Medicine"
  ],
  "author": "Anne Harrington",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/40180010-mind-fixers"
}