{
  "title": "The Clearing",
  "description": "Enjoy the bestselling historical romance series now!You change the world, but the world changes you in turn — there is no getting around it. A simple wish to survive irrevocably changed the life of Aliya, a medical student from the modern era. Trapped in a body that isn’t hers in a world in which she does not belong to, Aliya has made her decision – she will live… and she will thrive.A Medieval Tale series takes place in the dark ages of Ativerna, a land inhabited by different peoples that worship different gods. In this world, women are deprived of their voices, unable to pursue their calling. There are only five things a woman can a daughter, a wife, a mother, a widow, and a whore…and those who stand out are burnt at the stake as witches.Will Aliya be able to balance out the darkness with her yearning for life, her bright mind, and her confidence without raising too much suspicion? Something smells fishy in the estate of Earton, and despite Aliya’s prudence, she attracts both curiosity and jealousy. She is too different from the Lilian everyone knew. Will she be discovered?As if dealing with corruption, discontent, famine, and devastation weren’t enough, she has to take care of her stepdaughter Miranda, who acts like a spoiled little brat. Still, Aliya is she will not let her authority be undermined. Quiet times make way for a turbulent storm. While Aliya is cleaning the castle of both dust and snitches, her husband, the Earl of Earton, meets the now widowed Adele. Will he be able to uncover her sinister plans? Meanwhile, Prince Richard is allowed to choose his bride. Will princess Anna of Welster succeed in conquering his heart and keep the Jester satisfied?The time travel saga by highly acclaimed author Lina J. Potter continues…",
  "genres": [
    "Fantasy",
    "Time Travel",
    "Historical",
    "Fiction",
    "Historical Fiction",
    "Medieval",
    "Adventure"
  ],
  "author": "Lina J. Potter",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/40178706-the-clearing"
}