{
  "title": "Fault Lines: A History of the United States Since 1974",
  "description": "Two award-winning historians explore the origins of a divided America.If you were asked when America became polarized, your answer would likely depend on your age: you might say during Barack Obama’s presidency, or with the post-9/11 war on terror, or the culture wars of the 1980s and 1990s, or the “Reagan Revolution” and the the rise of the New Right.For leading historians Kevin M. Kruse and Julian E. Zelizer, it all starts in 1974. In that one year, the nation was rocked by one major event after another: The Watergate crisis and the departure of President Richard Nixon, the first and only U.S. President to resign; the winding down of the Vietnam War and rising doubts about America’s military might; the fallout from the OPEC oil embargo that paralyzed America with the greatest energy crisis in its history; and the desegregation busing riots in South Boston that showed a horrified nation that our efforts to end institutional racism were failing.In the years that followed, the story of our own lifetimes would be written. Longstanding historical fault lines over income inequality, racial division, and a revolution in gender roles and sexual norms would deepen and fuel a polarized political landscape. In Fault Lines, Kruse and Zelizer reveal how the divisions of the present day began almost five decades ago, and how they were widened thanks to profound changes in our political system as well as a fracturing media landscape that was repeatedly transformed with the rise of cable TV, the internet, and social media.How did the United States become so divided? Fault Lines offers a richly told, wide-angle history view toward an answer.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Audiobook",
    "American",
    "Historical"
  ],
  "author": "Kevin M. Kruse",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/40180012-fault-lines"
}