{
  "title": "Mama's Last Hug: Animal Emotions and What They Tell Us about Ourselves",
  "description": "New York Times best-selling author and primatologist Frans de Waal explores the fascinating world of animal and human emotions.Frans de Waal has spent four decades at the forefront of animal research. Following up on the best-selling Are We Smart Enough to Know How Smart Animals Are?, which investigated animal intelligence, Mama’s Last Hug delivers a fascinating exploration of the rich emotional lives of animals.Mama’s Last Hug begins with the death of Mama, a chimpanzee matriarch who formed a deep bond with biologist Jan van Hooff. When Mama was dying, van Hooff took the unusual step of visiting her in her night cage for a last hug. Their goodbyes were filmed and went viral. Millions of people were deeply moved by the way Mama embraced the professor, welcoming him with a big smile while reassuring him by patting his neck, in a gesture often considered typically human but that is in fact common to all primates. This story and others like it form the core of de Waal’s argument, showing that humans are not the only species with the capacity for love, hate, fear, shame, guilt, joy, disgust, and empathy.De Waal discusses facial expressions, the emotions behind human politics, the illusion of free will, animal sentience, and, of course, Mama’s life and death. The message is one of continuity between us and other species, such as the radical proposal that emotions are like organs: we don’t have a single organ that other animals don’t have, and the same is true for our emotions. Mama’s Last Hug opens our hearts and minds to the many ways in which humans and other animals are connected, transforming how we view the living world around us.",
  "genres": [
    "Nonfiction",
    "Science",
    "Animals",
    "Psychology",
    "Nature",
    "Biology",
    "Anthropology"
  ],
  "author": "Frans de Waal",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/40180060-mama-s-last-hug"
}