{
  "title": "In an Abusive State: How Neoliberalism Appropriated the Feminist Movement against Sexual Violence",
  "description": "In an Abusive State puts forth a powerful argument: that the feminist campaign to stop sexual violence has entered into a problematic alliance with the neoliberal state. Kristin Bumiller chronicles the evolution of this alliance by examining the history of the anti-violence campaign, the production of cultural images about sexual violence, professional discourses on intimate violence, and the everyday lives of battered women. She also scrutinizes the rhetoric of high-profile rape trials and the expansion of feminist concerns about sexual violence into the international human-rights arena. In the process, Bumiller reveals how the feminist fight against sexual violence has been shaped over recent decades by dramatic shifts in welfare policies, incarceration rates, and the surveillance role of social-service bureaucracies.Drawing on archival research, individual case studies, testimonies of rape victims, and interviews with battered women, Bumiller raises fundamental concerns about the construction of sexual violence as a social problem. She describes how placing the issue of sexual violence on the public agenda has polarized gender- and race-based interests. She contends that as the social welfare state has intensified regulation and control, the availability of services for battered women and rape victims has become increasingly linked to their status as victims and their ability to recognize their problems in medical and psychological terms. Bumiller suggests that to counteract these tendencies, sexual violence should primarily be addressed in the context of communities and in terms of its links to social disadvantage. In an Abusive State is an impassioned call for feminists to reflect on how the co-optation of their movement by the neoliberal state creates the potential to inadvertently harm impoverished women and support punitive and racially based crime control efforts.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Gender",
    "Womens Studies",
    "Sociology",
    "Research",
    "Race"
  ],
  "author": "Kristin Bumiller",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/4018127-in-an-abusive-state"
}