{
  "title": "Wayward Lives, Beautiful Experiments: Intimate Histories of Social Upheaval",
  "description": "A breathtaking exploration of the lives of young black women in the early twentieth century.In Wayward Lives, Beautiful Experiments, Saidiya Hartman examines the revolution of black intimate life that unfolded in Philadelphia and New York at the beginning of the twentieth century. Free love, common-law and transient marriages, serial partners, cohabitation outside of wedlock, queer relations, and single motherhood were among the sweeping changes that altered the character of everyday life and challenged traditional Victorian beliefs about courtship, love, and marriage. Hartman narrates the story of this radical social transformation against the grain of the prevailing century-old argument about the crisis of the black family.In wrestling with the question of what a free life is, many young black women created forms of intimacy and kinship that were indifferent to the dictates of respectability and outside the bounds of law. They cleaved to and cast off lovers, exchanged sex to subsist, and revised the meaning of marriage. Longing and desire fueled their experiments in how to live. They refused to labor like slaves or to accept degrading conditions of work.Beautifully written and deeply researched, Wayward Lives recreates the experience of young urban black women who desired an existence qualitatively different than the one that had been scripted for them—domestic service, second-class citizenship, and respectable poverty—and whose intimate revolution was apprehended as crime and pathology. For the first time, young black women are credited with shaping a cultural movement that transformed the urban landscape. Through a melding of history and literary imagination, Wayward Lives recovers their radical aspirations and insurgent desires.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Race",
    "Queer",
    "LGBT",
    "Gender"
  ],
  "author": "Saidiya Hartman",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/40180089-wayward-lives-beautiful-experiments"
}