{
  "title": "Health Yourself to the 22nd Century",
  "description": "This is one book that you will not want to put down. It is compelling and packed full of current data. It will become your GO-TO reference book for health for many years to come.In the 21st century we have vast and growing populations with immense, ever-evolving knowledge at hand. Yet, we are beholden to self-indulgent lifestyles, social oppression, out-of-control diseases, chemicals and pollution that threaten our lives… and foods that do not nourish our bodies... But still, there is great hope. Together we can build a contemporary structure for personalized self-care. Piece by piece, we can develop a skillset that encompasses current and historical understandings of the many components needed to create a new model for optimum human wellness. Most of us simply don’t need to be sick or overweight.We never did! The name Chrysona was given to the author decades ago by a spiritual master, and to go with such a unique name she offers her highly unconventional life and esoteric point of view to the world.She hopes to inspire her readers to put aside what they think they know for a few hours… and open their hearts and minds to the inﬁ nite possibilities of the 21st century and beyond.Chrysona asks: Is there any limit to how far we can go in optimizing our minds, bodies, spiritual connection and emotions? Chrysona has had several careers, architectural design being the longest. She knew that the skill of preparing construction documents for large buildings would be valuable when creating a complex manuscript.After an underprivileged childhood in Indiana Chrysona migrated to Malibu, California in her late teens. Much later, she moved to Sedona, Arizona, and also spent some years in Santa Fe, New Mexico. Chrysona intends to write several more books about health and empowerment, as well as books on other subjects, including care and diet for dogs… organic food gardening… Keep in touch with her at her website CHRYSONA.COM for other Health Yourself series books and well-vetted products for sale.Chrysona will be available for nutritional and life coaching by appointment, plus live workshops and gatherings.To view Chrysona’s architectural work, visit LAURAPHILLIPSDESIGN.COM(Laura is her birth name)",
  "genres": [],
  "author": "Chrysona",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/40177991-health-yourself-to-the-22nd-century"
}