{
  "title": "The Five People You Meet in Heaven",
  "description": "An enchanting, beautifully crafted novel that explores a mystery only heaven can unfold.Eddie is a grizzled war veteran who feels trapped in a meaningless life of fixing rides at a seaside amusement park. As the park has changed over the years — from the Loop-the-Loop to the Pipeline Plunge — so, too, has Eddie changed, from optimistic youth to embittered old age. His days are a dull routine of work, loneliness, and regret.Then, on his 83rd birthday, Eddie dies in a tragic accident, trying to save a little girl from a falling cart. With his final breath, he feels two small hands in his — and then nothing. He awakens in the afterlife, where he learns that heaven is not a lush Garden of Eden, but a place where your earthly life is explained to you by five people who were in it. These people may have been loved ones or distant strangers. Yet each of them changed your path forever.One by one, Eddie’s five people illuminate the unseen connections of his earthly life. As the story builds to its stunning conclusion, Eddie desperately seeks redemption in the still-unknown last act of his life: Was it a heroic success or a devastating failure? The answer, which comes from the most unlikely of sources, is as inspirational as a glimpse of heaven itself.In The Five People You Meet in Heaven, Mitch Albom gives us an astoundingly original story that will change everything you’ve ever thought about the afterlife — and the meaning of our lives here on earth. With a timeless tale, appealing to all, this is a book that readers of fine fiction, and those who loved Tuesdays with Morrie, will treasure.It is a tale of a life on earth. It’s a tale of life beyond it. It’s a fable about love, a warning about war, and a nod of the cap to the real people of this world, the ones who never get their name in lights.Since its publication, it has sold over 14 million copies in 38 territories and in 35 languages.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Inspirational",
    "Fantasy",
    "Classics",
    "Book Club",
    "Spirituality"
  ],
  "author": "Mitch Albom",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/40193713-the-five-people-you-meet-in-heaven"
}