{
  "title": "Dark and Stormy",
  "description": "Quinn finally gets what she’s always wanted—a Fae-Cation. But now Boston faces annihilation. A bloody murder spree in the Land of the Fae with her vampire bestie should have been all fun and games for Quinn… that is, until she finally learns the stunning truth about her past and the decision she was born to make — a decision which threatens to bring her world to a screeching halt.Because the price is just too high.But when a trusted friend betrays her, unleashing the storm of the century — not to mention an army of ancient, lethal monsters — upon Boston Harbor, Quinn is forced to choose whether she will save herself or those she cares about.This former black magic arms dealer must call in every favor she has ever earned, and, even then, there’s a good chance she won’t be strong enough to stop the Eye at the center of the storm from taking away everything she’s ever loved.Because the only way to save Boston...Is to become something even worse. What she was born to become…The newest antihero in the Worldwide Bestselling Temple Verse by Shayne Silvers. Join Cameron O’Connell and Shayne at the literary bar to sip a dirty cocktail of feisty Irish brogue – with an unhealthy splash of monsters – TODAY!If you like KF Breene, Shannon Mayer, CN Crawford, Ilona Andrews, or Patricia Briggs, you will LOVE the FOURTH installment of the Phantom Queen Diaries. Release Schedule:  \n   \n    Whiskey Ginger (Book 1) - June 12, 2018\nCosmopolitan (Book 2) - June 19, 2018\nOld Fashioned (Book 3) - June 26, 2018\nDark and Stormy (Book 4) - July 10, 2018\n   \n  Phantom Queen Diaries eBook categories:  \n   \n    Dark Fantasy\nSupernatural Thriller\nWitches & Wizards\nUrban Fantasy Thriller\nParanormal Romance\nSupernatural Shifter\nAngels & Demons\nScience Fiction & Fantasy\nParanormal and Urban Romance\nSupernatural Mystery and Suspense\nVampires and Werewolves\n OVER HALF A MILLION READERS HAVE BEEN PLEASURED BY THE TEMPLE VERSE NOVELS. NOW IT’S YOUR TURN…",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Magic",
    "Urban",
    "Mythology",
    "Vampires"
  ],
  "author": "Shayne Silvers",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/40192768-dark-and-stormy"
}