{
  "title": "Cracking the Boy Code: How to Understand and Talk with Boys",
  "description": "A clinical psychologist specializing in children and adolescents shares the secret language of boys and how to reconnect with them.All too quickly, talkative, affectionate young boys seem to slip away. Adolescents may be transformed overnight into reclusive, seemingly impenetrable young people who open up only to their friends and spend more time on devices than with family. How do you penetrate this shell before they are lost to you?Drawing on decades of experience garnered through thousands of hours of therapy with boys, Cracking the Boy Code explains how the key to communicating with boys is understanding their universal psychological needs and using specific, straightforward communication techniques. Coverage it’s important to understand the psychological needs of boysHow to talk to be heard, and listen to understandThe crucial role of non-verbal cuesLearning the universal tone that helps boys listenMotivating boys to become their authentic selvesUsing purposeful work to teach boys self-respect and confidenceReducing stress and creating greater closeness between boys and caregiversCracking the Boy Code is essential reading for parents, caregivers, teachers, youth workers, coaches, and others who want to make a real connection with the boys in their lives.Praise for Cracking the Boy Code“Cox unpacks in simple language the intricacies of communicating with boys . . . . The book is an educational revelation resulting from remarkable face to face research, and provides an exceptional tool to help parents and teachers understand what makes boys tick.” —David Anderson B.A, Dip TG, B.Ed, Cert. of Care, Sydney Australia IBSC Jarvis/Hawley Award Baltimore USA 2017“A thoughtful, accessible guide to developing meaningful communication with the boys in our lives. Adam Cox’s insights, grounded in practical wisdom cultivated over decades of clinical work with boys, provide readers with compelling possibilities for using non-verbal cues, tone of voice, hands-on activity, and empathetic listening to connect with boys in a manner both deep and enduring . . . . Dr. Cox’s latest work is both inspiring and instructive.” —Dr. John M. Botti, Head of School, The Browning School",
  "genres": [
    "Parenting"
  ],
  "author": "Adam J Cox",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/40198763-cracking-the-boy-code"
}