{
  "title": "How to Think Like a Woman: Four Women Philosophers Who Taught Me How to Love the Life of the Mind",
  "description": "From a bold new voice in nonfiction, an exhilarating account of the lives and works of influential 17th and 18th century feminist philosophers Mary Wollstonecraft and her predecessors who have been written out of history, and a searing look at the author’s experience of patriarchy and sexism in academiaAs a young woman growing up in small-town Iowa, Regan Penaluna daydreamed about the big questions: Who are we and what is this strange world we find ourselves in? In college she fell in love with philosophy and chose to pursue it as an academician, the first step, she believed, to becoming a self-determined person living a life of the mind. What Penaluna didn’t realize was that the Western philosophical canon taught in American universities, as well as the culture surrounding it, would slowly grind her down through its misogyny, its harassment, its devaluation of women and their intellect. Where were the women philosophers?One day, in an obscure monograph, Penaluna came across Damaris Cudworth Masham’s name. The daughter of philosopher Ralph Cudworth and a contemporary of John Locke, Masham wrote about knowledge and God, and the condition of women. Masham’s work led Penaluna to other remarkable women philosophers of the era: Mary Astell, who moved to London at age twenty-one and made a living writing philosophy; Catharine Cockburn, a philosopher, novelist, and playwright; and the better-known Mary Wollstonecraft, who wrote extensively in defense of women’s minds. Together, these women rekindled Penaluna’s love of philosophy and awakened her feminist consciousness.In How to Think Like a Woman, Regan Penaluna blends memoir, biography, and criticism to tell the stories of these four women, weaving throughout an alternative history of philosophy as well as her own search for love and truth. Funny, honest, and wickedly intelligent, this is a moving meditation on what philosophy could look like if women were treated equally.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Feminism",
    "History",
    "Memoir",
    "Audiobook",
    "Womens"
  ],
  "author": "Regan Penaluna",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/123157760-how-to-think-like-a-woman"
}