{
  "title": "Smoky the Brave: How a Feisty Yorkshire Terrier Mascot Became a Comrade-in-Arms during World War II",
  "description": "From acclaimed thriller and war dog writer Damien Lewis comes the story of Smoky, the smallest and arguably bravest dog of World War II, who served as the US military's first therapy dogSmoky the Brave is the extraordinary, touching, and true story of a heroic dog and her adoptive masters in the jungles of the Pacific War. In February 1944, as Japanese military advances threatened to overwhelm New Guinea, a tiny, four-pound Yorkshire Terrier was discovered hiding in the island's thick jungles. The GIs who discovered her thought at first she had been a Japanese army mascot, but it turned out that she didn't understand commands in either Japanese or English. A mystery, she was soon adopted by US Army Air Force Corporal William \"Bill\" Wynne, an air-crewman in a photo reconnaissance squadron, and became something of a lucky charm for Wynne's unit. When Smoky saved Wynne's life by barking a warning of an incoming shell as their landing craft approached an enemy-held beach, he nicknamed her the \"angel from a foxhole.\" Smoky's exploits continued when she famously jumped with the unit in a specially designed parachute. But her most heroic feat of the war was running a cable through a seventy-foot pipe no wider than four inches in places to enable critical communication lines to be run across the recently occupied airbase of Luzon. Her efforts saved hundreds of ground-crew from being exposed to enemy bombing, preventing both injury and loss of life.In recognition of her efforts, and adding to her previously-awarded eight battle stars, Smoky was given the PDSA's Certificate for Animal Bravery or Devotion in 2011. In Smoky the Brave, award-winning war-thriller author Damien Lewis brings to vivid life the danger and excitement of the many missions of World War II's smallest hero.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Military Fiction",
    "Dogs",
    "History",
    "War",
    "Biography"
  ],
  "author": "Damien Lewis",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/40196607-smoky-the-brave"
}