{
  "title": "The Ra Contact: Teaching the Law of One: Volume 1",
  "description": "“I am Ra. We came to your peoples to enunciate the Law of One. We wished to impress upon those who wished to learn of unity that in unity all paradoxes are resolved; all that is broken is healed; all that is forgotten is brought to light.”For thousands of years those of Ra have sought to teach the Law of One to seekers of truth on Earth who wished to learn of the unity or oneness of all things. This basic law of all creation is buried deep within each of our hearts because we really are one in love and in light, the building blocks of the universe. We are all manifestations of the One Infinite Creator. We are the Creator. We are not learning this law for the first time but are remembering it yet again as all mystics have taught throughout Earth’s history. Our journey of self-realization is the discovery or remembrance of this essential truth, our essential identity. A waking up, as some have called it, within an illusion of separation.Don Elkins and Carla L. Rueckert worked together for 12 years to perfect the channeling process and receive philosophical inspiration and guidance from extraterrestrial sources. When Jim McCarty joined them in 1980 they began to receive a new and unique type of channeling contact from those of Ra. Through this contact, Ra shared information to help seekers of truth deepen their awareness and acceptance of self and other, and to help Earth move into the emerging fourth density of love and understanding.This book is the transcript from the recording of that conversation between the Questioner and Ra. Through questions & answers, the metaphysical blueprint of spiritual evolution is explored, from the microcosm to the macrocosm, from the particulars of life on this planet to the life of the cosmos, to the possibilities of healing, transformation, and self-realization for spiritual seekers and wanderers.* * * * * * * * *The Ra Teaching the Law of One Volume 1 contains Ra contact sessions 1–56.",
  "genres": [
    "Spirituality",
    "Philosophy",
    "Paranormal",
    "Occult",
    "Nonfiction",
    "Physics",
    "Metaphysics"
  ],
  "author": "Donald Tully Elkins",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/40190203-the-ra-contact"
}