{
  "title": "Honor Bound",
  "description": "A space pilot finds new friends and bitter enemies in this “non-stop adventure,” the second book of a series from New York Times bestselling authors (Booklist).Zara Cole was a thief back on Earth, but she’s been recently upgraded to intergalactic fugitive. On the run after a bloody battle in a covert war that she never expected to be fighting, Zara, her co-pilot Beatriz, and their Leviathan ship Nadim barely escaped with their lives.Now Zara and her crew of Honors need a safe haven, far from the creatures who want to annihilate them. But they’ll have to settle for the a wild, dangerous warren of alien criminals. The secrets of the Sliver may have the power to turn the tide of the war they left behind—but in the wrong direction.Soon Zara will have to make a run from the ultimate evil—or stand and fight.Praise for Honor Among “Keenly wrought characters, imaginative worldbuilding, and an inventive plot engage and gratify while urging readers to stay curious, question authority, and fight injustice.” —Publishers Weekly (starred review)“Electrifying and unputdownable.” —Beth Revis, New York Times–bestselling author of the Across the Universe trilogy“Caine and Aguirre’s immersive world and unforgettable characters will absolutely enthrall you.” —Zoraida Córdova, author of Labyrinth Lost and the Vicious Deep trilogy“A heart-stopping thrill ride.” —Kami Garcia, #1 New York Times–bestselling coauthor of Beautiful Creatures & author of The Lovely Reckless“A breath of fresh air to the YA community.” —Voice of Youth Advocates (VOYA)“Fresh and fascinating.” —Booklist“Satisfying. . . . should appeal to fans of Yancey’s 5th Wave trilogy.” —Bulletin of the Center for Children’s Books",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fantasy",
    "Aliens",
    "Fiction",
    "Space Opera",
    "Dystopia"
  ],
  "author": "Rachel Caine",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/40207697-honor-bound"
}