{
  "title": "Touring Literary Mississippi",
  "description": "By taking the literary traveler on seven preplanned tours--through the Delta, along Highway 61, to the heart of Faulkner's Yoknapatawpha country, to sites near Interstate 55 and the Natchez Trace, to the piney woods of East and South Mississippi, and along the sun-struck Gulf Coast--this book captures the phenomenal abundance and diversity of Mississippi literature. More than a guidebook, this book includes capsule biographies and well over a hundred photographs of writers, their residences, and their literary environments. It also provides maps and gives explicit directions to writers' homes and other literary sites. The sheer number of writers discovered, recovered, and claimed by Mississippi will astonish travelers both from within and from without the state. Included are not only such major figures in the pantheon of American literature as William Faulkner, Eudora Welty, Tennessee Williams, and Richard Wright but also the less well-known. Every nook and cranny of the state claims a piece of Mississippi's literary heritage. Literature pervades Yazoo City, Jackson, Greenville, Oxford, Natchez, the Gulf Coast, and the Delta Blues country. Willie Morris, Richard Ford, and Beverly Lowry have declared that a famous writer's presence in their hometowns convinced them that they too could be writers. As the locations bring to life the connection of ordinary rituals with the stuff of fiction, poetry, and memoir, these hands-on tours make evident the special cross-pollination of writer and community in Mississippi. Patti Carr Black is the author of Art in Mississippi, 1720-1980 and The Southern Writers Quiz Book (both published by the University Press of Mississippi). Marion Barnwell, a fiction writer and an assistant professor of English at Delta State University, compiled and edited A Place Called Mississippi (published by the University Press of Mississippi).",
  "genres": [],
  "author": "Patti Carr Black",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/4020046-touring-literary-mississippi"
}