{
  "title": "Why I Stand: From Freedom to the Killing Fields of Socialism",
  "description": "Why I Stand highlights the threat of Marxist Socialism to our American culture. The victor will determine the heart, soul, and freedom of our nation for future generations.American Individualism has been the crown jewel of a nation that, based on its Judeo-Christian values, has prioritized God, family, and freedom to out-dream its obstacles. It is the freedom of this individual spirit that is under attack by its adversarial ideology, Marxist Socialism. This destructive ideology has resulted in “killing fields” of bodies, souls, and dreams of billions worldwide. Consistent is the destruction of manhood, womanhood, the family, and every pillar that supports love of God and country.Why I Stand documents an ideology that uses trust to divide and betray. It was the ideology of the 1910 NAACP (National Association for the Advancement of Colored People) founded by twenty-one White Marxist Socialist, atheist, and eugenicist Democrats. They succeeded within decades to undermine the progress of the most entrepreneurial, patriotic, Christian, educated, family-oriented, and competitive minority in our nation during that era: the Black community.This strategy of trust/betrayal is utilized by many of today’s politicians and corporate leaders. It has been the Congressional Black Congress that have voted 100% for every anti-Black policy demanded of them by their White Democratic leadership. It has been the NFL that has prioritized its expansion to 10 international countries over loyalty to its American fans. Its leadership has justified the denigration of its “All American” brand in exchange for a global “World Citizen” brand.“American Individualism is the sole source of progress, granting each individual the chance and stimulation for development of the best with which he has been endowed in heart and mind.” - President Herbert HooverWe MUST defend it.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction"
  ],
  "author": "Burgess Owens",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/40203153-why-i-stand"
}