{
  "title": "For Her Complete Collection",
  "description": "New York Times bestselling author Alexa Riley’s For Her Complete Collection shows just what happens when strong, possessive men find the women of their dreams.Everything for HerI’ll never forget the way she looked, so confident and sure of herself. I watched her from a distance. She wasn’t ready for me yet.Mallory Sullivan is ready to start her new life. After graduating at the top of her class, she’s landed one of the most coveted internships in the United States. Hard work and determination have gotten her to this moment—a life she only dreamed of while growing up in foster care.From the start, I knew that she would be my greatest achievement, so the day I let her go, I set down a path for her. A path to me.She never expected Oz to be the greatest culmination of those dreams. But sometimes fate determines who you fall in love with. Who makes you lose control. Who owns your soul.His AloneShe thinks I’m perfect. A good boss, a good man. She thinks that I play by the rules.She has no idea who I truly am. Why I’m really here.Paige Turner is trying to outrun her past, but there it is, tossed back in her face anytime she manages to get two steps ahead.She has no idea what a man like me will do to get what he wants.Her need for Ryan got in the way of revenge, took her off course. Redirected her focus. Before she knew it, he’d made his way into her life. Into her heart.ClaimedJordan Chen is the man behind the screen. As part of the elite security team for Osbourne Corporation, he has an iron grip on protection, all without having to make close connections with people. Until he meets the beautiful Jay, and suddenly his quiet life doesn’t seem so perfect anymore. He needs more. He needs her.A workaholic to her core, Jay Rose doesn’t have a lot of men in her life. Smiling in the face of her enemies gets her the results she wants at work, but doesn’t exactly project a warm, welcoming vibe. So she’s surprised when the enigmatic security expert strikes up a friendship with her—surprised but flattered, and maybe a little bit turned on.A company as powerful as Osbourne Corporation has powerful enemies, and when Jay becomes a target, Jordan realizes there’s nothing he won’t do to bring her home safeDon’t miss a special bonus story, book one of Rhenna Morgan’s super sexy Men of Haven series, Rough & TumbleJace Kennedy lives for the challenge. He sees Vivienne Moore’s hidden wild side and knows she’s his perfect match, if only he can break it free. Earning her trust is a task unlike any he’s faced so far, but Jace didn’t get where he is by giving up. Jace is everything Vivienne swore she never wanted, but he loves just as fiercely as he fights. He’s proud of who he is and where he came from, and he’ll be damned if he lets Vivienne go before showing her the safest place of all is in his arms.",
  "genres": [
    "Romance"
  ],
  "author": "Alexa Riley",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/40214983-for-her-complete-collection"
}