{
  "title": "The Protocols of the Meetings of the Learned Elders of Zions",
  "description": "A Message from the Anti-Defamation LeagueThe Protocols of the Elders of Zion, circulated by the Czarist secret police at the turn of the 20th century, is plainly and simply a plagiarized forgery. \"The Protocols\" has been a major weapon in the arsenals of anti-Semites around the world, republished and circulated by individuals, hate groups and governments to convince the gullible as well as the bigoted that Jews have schemed and plotted to take over the world.Note from AmazonAmazon does not endorse The Protocols of the Learned Elders of Zion. This book is one of the most infamous, and tragically influential, examples of racist propaganda ever written. It may be useful to some as a tool in the teaching of the history of anti-Semitism, but it's unquestionably propaganda.Does Amazon sell this book? We do, along with millions of other titles. The Protocols of the Learned Elders of Zion is classified under \"controversial knowledge\" in our store, along with books about UFOs, demonic possession, and all manner of conspiracy theories. You can also find books in other sections of Amazon's online bookstore that analyze The Protocols' fraudulent origins and its tragic historical role in promoting anti-Semitism and Jewish persecution, including A Lie and a Libel: The History of the Protocols of the Elders of Zion. As a bookseller, Amazon strongly believes that providing open access to written speech, no matter how hateful or ugly, is one of the most important things we do. And because we think the best remedy for offensive speech is more speech, we also make available to readers the ability to make their own voices heard and express their views about this and all our titles in reviews and ratings.",
  "genres": [],
  "author": "Matvei Vasilyevich Golovinski",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/40217130-the-protocols-of-the-meetings-of-the-learned-elders-of-zions"
}