{
  "title": "Kushiel's Scion",
  "description": "It is whispered that Kushiel's lineage carries the ability to perceive the flaws in mortal souls, to administer an untender mercy. I sense its presence like a shadow on my soul...the memories of blood and branding and horror, and the legacy of cruelty that runs in my veins, shaping my own secret vow and wielding it like a brand against the darkness, whispering it to myself, over and over.I will try to be good.Imriel de la Courcel's blood parents are history's most reviled traitors, but his adoptive parents, the Comtesse Phedre and the warrior-priest Joscelin, are Terre d'Ange's greatest champions. Stolen, tortured, and enslaved as a young boy, Imriel is now a Prince of the Blood, third in line for the throne in a land that revels in art, beauty, and desire. It is a court steeped in deeply laid conspiracies...and there are many who would see the young prince dead. Some despise him out of hatred for his birth mother Melisande, who nearly destroyed the realm in her quest for power. Others because they fear he has inherited his mother's irresistible allure - and her dangerous gifts. And as he comes of age, plagued by dark yearnings, Imriel shares their fears.At the royal court, where gossip is the chosen poison and assailants wield slander instead of swords, the young prince fights character assassins while struggling with his own innermost conflicts. But when Imriel departs to study at the fames University of Tiberium, the perils he faces turn infinitely more deadly.Searching for wisdom, he finds instead a web of manipulation, where innocent words hide sinister meanings, and your lover of last night may become your hired killer before dawn. Now a simple act of friendship will leave Imriel trapped in a besieged city where the infamous Melisande is worshiped as a goddess; where a dead man leads an army; and where the prince must face his greatest test: to find his true self.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fiction",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "Erotica",
    "High Fantasy"
  ],
  "author": "Jacqueline Carey",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/40214.Kushiel_s_Scion"
}