{
  "title": "Sweet Agony",
  "description": "I hurt the one person I care for the most in this world. I shattered his heart into pieces. And now I’m not sure if our relationship can be salvaged.We grew up together. All three of us. Then one day, our dynamic changed. And hormones and lust got involved. It messed with our relationship. Friendship and love are two things that don’t mix well together. I learned it the hard way.One day, he walked past me with a loose towel around his hips and droplets of water cascading down his chest, and I knew in that instant our trio would never be the same. Because it woke up feelings in me I never knew existed before that instant.He was my best friend’s brother. The one we always looked up to because he was older than us, and by definition, wiser. And forbidden.No matter how I try to ignore the throbbing of my heart every time we’re together, my traitorous emotions make me believe we could do this. Be in love.Until I decide to give my dreams a try while he goes around the world, trying to pursue his own risky life mission.We promised each other forever, no matter the time and distance settling between us, we won’t let them spoil what we’ve been so adamant to protect all these years. Our hearts. And our love.No matter how much we’re ready to fight for our happily-ever-after, life and circumstances are trying to keep us apart.But I won’t back down. We’re meant to be together. Our love is written in the stars. And tattooed on my heart.Is our love story worth fighting for? Or is it doomed from the start?Dahlia and Jeff’s love story will play with every string of your heart. It will bring you on the highest highs and lowest lows, and leave an imprint in your heart for a very long time.Emmanuelle Snow writes realistic and emotional love stories that will bring you on a roller coaster of emotions. You'll want to be best friends with her heroines and have her heroes to rock your bed and take hostage your heart. Hello, book boyfriends. Every one of her books will make you laugh, cry, swoon, and leave you with a book hangover by the time you reach the last page.Note: Sweet Agony was previously published as Princess and Country",
  "genres": [
    "Romance",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Emmanuelle Snow",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/123165800-sweet-agony"
}