{
  "title": "Welcome to Lizard Motel: Children, Stories, and the Mystery of Making Things Up, A Memoir",
  "description": "Welcome to Lizard Motel is a completely original memoir about the place of stories in children's lives. It began when Barbara Feinberg noticed that her twelve-year-old son, Alex, who otherwise loved to read, hated reading many of the novels assigned to him in school. These stories of abandonment, kidnapping, abuse, and more-called \"problem novels\"-were standard fare in his middle school classroom. Alex and his friends hated to read these books. As one of them said, \"They give me a headache in my stomach.\" So Feinberg set out to discover just what these kids were talking about.She started to read the books, steeping herself in novels like Chasing Redbird, Bridge to Terabithia, The Pigman, and more. She consulted librarians, children's literature experts, and others, trying to get a handle on why young-adult novels had become so dark and gloomy and, to her mind, contrived.What she found both troubled and surprised her. \"In the middle of the 1960s,\" observed one children's literature expert, \"political and social changes leaned hard on the crystal cage that had surrounded children's literature for ages. It cracked and the world flowed in.\"Welcome to Lizard Motel documents this dramatic change in the content of young-adult novels but does so in a uniquely touching memoir about one family's life with books, stories, and writing. Feinberg's examination of the problem novel opens her eyes to other issues that affect children today-such as how they learn to write, how much reality is too much for a young child's mind, and the role of the imagination in children's experience.Quirky, moving, serious, and witty, Welcome to Lizard Motel is one of the most surprising books about reading and writing to come along in years. Not only does it explore the world of children and stories, but it also asks us to look at how our children are growing up. Feinberg wonders if, as a society, we have lost touch with the organic unfolding of childhood, with that mysterious time when making things up helps deepen a child's understanding of the world. This memoir will reacquaint readers with the special nature of children's imaginations.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Memoir"
  ],
  "author": "Barbara Feinberg",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/402157.Welcome_to_Lizard_Motel"
}