{
  "title": "The Body at Carnival Bridge",
  "description": "A single shot is fired. Was it meant to kill?London, 1922. When reporter Iris Woodmore returns to England after a scandalous trip abroad, not everyone is pleased to see her.Her attempts to mend relationships and get her old job back aren’t helped by her growing attraction to the charismatic Reverend Archie Powell.Only wealthy businesswoman Constance Timpson is pleased her friend has returned. Constance has deadly enemies and needs Iris to defend her from a hostile press – and a mysterious sniper.When a single shot is fired, Constance doesn’t know if it was intended to scare or kill her. Then, two of Constance’s factory workers go missing, and it’s clear the threat is real.Iris turns amateur sleuth to investigate the mystery – and discovers the sniper isn’t the only hidden enemy preying on women.An addictive and cosy murder mystery to delve into! Ideal for fans of Jacqueline Winspear, Helena Dixon, Verity Bright, Claire Gradidge, and Emily Organ.Readers LOVE The Body at Carnival Bridge‘Everything you want in a historical mystery! Historical facts that play into the story, a murder, mystery and many twist and turns that keep you loving every page!’ Reader Review‘Just loved this! I'm fascinated by the time period and the way the story is written. Definitely a must read...’ Reader Review‘… a fantabulous historical mystery. Engrossing, unique and riveting. Highly recommended!’ Reader ReviewPraise for the Iris Woodmore Mysteries:'The mystery itself is intriguing, with plenty of twists and unexpected developments. If you enjoy 1920s mysteries and learning about the suffragettes and all they stood for, then I highly recommend Death at Crookham Hall' Verity Bright, author of the Lady Eleanor Swift Mysteries'A fabulous, well-written, mystery that holds all the promise of much more to come... The Iris Woodmore mysteries are fast becoming some of my favourites' M J Porter, author of The Eagle of Mercia Chronicles'A joy to read! Such a well-researched mystery. I absolutely loved the unconventional heroine, 1920s setting, engaging characterisation and poignant ending, all of which provide a captivating start to the Iris Woodmore cosy mystery series' Anita Davison, author of the Flora Maguire Mysteries‘Death at Crookham Hall is a lovely, murder mystery by a gifted writer’ Helena Dixon, author of The Miss Underhay Mysteries",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Cozy Mystery"
  ],
  "author": "Michelle Salter",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/123166585-the-body-at-carnival-bridge"
}