{
  "title": "Mandy Lamb and the Full Moon: Can a half-sheep girl and a werewolf be friends?",
  "description": "Can a half-sheep girl and a werewolf be friends?Mandy Lamb is the world's only half-sheep girl, thanks to a spot of well-meant but ill-advised genetic tinkering. She’s starting senior school and she’s about to meet James, a strange, dog-like orphan who has a bad habit of running off at the full moon. With danger on the way, will James prove friend or foe?This page-turning rural fantasy is a heart-warming tale about friendship, trust, and courage—and not letting what you are define what you do. Those looking for a unique, challenging read will love this ‘animal yarn with a Christian twist.’Buy the book to start reading Mandy and James’ adventure today! PRAISE FOR MANDY LAMB & THE FULL MOON“I thought Mandy Lamb would just be a fun kid’s story, but it is really deep and exciting! TURNER’s imagination and creativity are simply amazing, and this book takes it to a new level.”THERESA LINDEN, author of award-winning Battle for His Soul“This highly entertaining fantasy weaves a tale of friendship, trust, & courage that will not only warm your heart but keep you flipping the pages all the way to its unexpected & pulse-pounding climax. I am amazed, yet again, by this author's talent and diversity! Anyone young at heart who enjoys a fun & inspiring animal yarn with a Christian twist is sure to love this unusual story!”SUSAN PEEK, author of the God’s Forgotten Friends series“CORINNA TURNER takes Urban Fantasy to the countryside with the adventures of a half-sheep girl who is up for befriending anyone—even a werewolf or a vampire! A hilarious twist on familiar tropes that all ages will enjoy.”ELIZABETH AMY HAJEK, author of The Mermaid and the UnicornMANDY LAMB AND THE FULL MOON has been awarded the Seal of Approval from the Catholic Writers Guild, guaranteeing its moral, doctrinal and literary quality.",
  "genres": [
    "Fantasy"
  ],
  "author": "Corinna Turner",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/40235017-mandy-lamb-and-the-full-moon"
}