{
  "title": "Steel Wind",
  "description": "A routine Coast Guard inspection of a cargo ship in the Caribbean turns into a vicious firefight with unidentified commandos. The second attempt to board the vessel ends with a nuclear detonation.North Korea has been smuggling short and intermediate-range missiles into Cuba. An unknown number of nuclear warheads are hidden less than 100 miles from the tip of Florida. Every American city east of San Antonio is in the target zone.Scrambling to stop the flow of weapons to Cuba, the president orders the Atlantic Fleet to surround the island, cutting off all access. It’s the Cuban Missile Crisis all over again, but this time there won’t be a diplomatic resolution. The North Koreans have developed a secret weapon that rips through the blockade with ease, leaving burning ships in its wake.Against this unimagined threat stand a small detachment of United States Marines and a cutting-edge destroyer that’s never been tested in combat. It’s a battle we never expected to fight, against an enemy we can barely comprehend...Praise for Jeff Edwards \"Jeff Edwards has created a superb thriller that grips the reader from beginning to end. Brilliantly executed.\" -- CLIVE CUSSLER, International bestselling author of 'The Rising Sea' and 'Raise the Titanic'“A taut, exciting story by an author who knows his Navy. Guaranteed to keep you turning pages well into the night!” -- GREG BEAR, New York Times bestselling author of ‘Killing Titan’ and ‘Darwin’s Radio’“Edwards wields politics and naval combat tactics with a skill equal to the acknowledged masters of military fiction.” -- THE MILITARY PRESSOther Books by Jeff EdwardsMilitary Sea of ShadowsThe Seventh AngelSword of ShivaCyberpunk Detective Dome City BluesAngel City BluesShort Postcards from the Moon",
  "genres": [
    "Fiction",
    "War",
    "Military Fiction",
    "Thriller"
  ],
  "author": "Jeff Edwards",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/40225326-steel-wind"
}