{
  "title": "Loved by the Viscount",
  "description": "After three months of marriage, the husband of Lady Rosalind Branson falls to his death down the stairs of a brothel and Rosalind has but one feeling -- relief, as she is now free. She soon learns, however, that her dowry has been spent and the estate is ruin, leaving her destitute. The only option presented to her is marriage to her husband’s brother, a fate she refuses to accept.  William Elliot, Viscount of Southam, has a life of which many are envious. He has a fine estate, a pleasurable life in society, good looks, and charm. He also has a meddling mother, a trying brother, and headaches that plague him for days on end. When the woman he always wanted marries another, he agrees to allow his mother to host a house party in order to find him a wife.  When William’s brother gets himself into yet another spot of trouble, William resolves not to help him this time, until he recognizes the victim of Alfred’s latest scheme -- Rosalind Branson, a woman he has known since childhood, yet has never particularly noticed before. He is determined to right his brother’s wrongs and help the woman. Seeing no other option, Rosalind accepts the offer to stay for the Shandol house party, and both she and William are surprised when they find themselves falling for one another. Their growing attraction, however, is tested by Rosalind’s mistrust of men, William’s former attachment to Lady Olivia, and his mother and brother, who conspire against them. Can they overcome all that stands between them to find love?  Loved by the Viscount is a 61,000-word romance with no cliffhangers, no cheating, and a guaranteed happily ever after! For readers over 18, due to some steamy content.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "British Literature",
    "Historical Romance",
    "Regency"
  ],
  "author": "Ellie St. Clair",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/40231209-loved-by-the-viscount"
}