{
  "title": "Love Changes Everything",
  "description": "This is the first book in the Mercinia series. Each book can be read as a stand-alone story because there are no cliffhanger endings and each couple have their own story. However, I would recommend you read the books in order as this would help you gather background to the Ursus shifters and Mercinia, as well as following the links through the series.  *WARNING* This book is for the reading pleasure of adults 18 years and above who will not be offended by descriptions of sex, violence, strong language and love.  From the moment he set his eyes on her, there was no doubting the feeling. Their attraction was instant, but whilst Brae Sinclair felt the pull of instant lust, Kincaid, Ursus shifter, knew what he felt was the pull of a life-mate. The problem was, he was not looking for a life-mate and he needed to return to his home planet, Mercinia, in twelve hours. The decision to return home with Brae was made the instant he touched her.  On Earth he is known as Richard Stratton, Private Investment Banker of Stratton and Family, back home on Mercinia he is Kincaid, Chief Warrior and Leader of the Ursus Behanzin Army. His planet had been ravaged by war, a war in which his first life-mate was killed for her genetic engineering breakthrough. Kincaid vowed to remain faithful to his first life-mate’s memory, fulfilling his promises and commitments to Mercinia, his clan and most importantly his family. He made a vow to build his planet back and protect the work his life-mate had been killed for. On meeting Brae Sinclair love returns to the heart of a warrior.  Brae Sinclair is the Founder and Chief Executive of Moving Ahead, a charity for ongoing physiotherapy of stroke victims in the UK and West Indies. She has moved a long way from her troubled past and estranged family. Love was something she had given up on a long time ago. Realising she would never have love to call her own, Brae was happy to capture fleeting moments with her mentor and the Chair of Moving Ahead, Professor Jonathan Montgomery. The night before a working holiday to Barbados, she meets and has a strong instant attraction to the tall dark stranger, Richard Stratton. Brae had no idea a night of passion would take her to another world and introduce her to a love she had every right to receive.  Unfortunately, love for Kincaid and Brae would not be such a smooth road to travel. Kincaid, Chief Warrior and Leader of the Ursus Behanzin Army, will need to fight in order to protect his new life-mate, and this time he cannot lose.",
  "genres": [],
  "author": "S.L. Gibson",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/40232289-love-changes-everything"
}