{
  "title": "The All-Night Sun",
  "description": "A lonely young woman gets too close to her charismatic female student in this propulsive debut, culminating in a dangerously debauched Midsommar’s Eve.“Memorable and meaningful.”—Claire Messud, New York Times bestselling author of The Burning GirlLauren Cress teaches writing at a small college outside of Washington, DC. In the classroom, she is poised, smart, and kind, well-liked by her students and colleagues. But in her personal life, Lauren is troubled and isolated, still grappling with the sudden death of her parents ten years earlier. She seems to exist at a remove from everyone around her until a new student joins her class: charming, magnetic Siri, who appears to be everything Lauren wishes she could be. They fall headlong into an all-consuming friendship that feels to Lauren like she is reclaiming her lost adolescence.When Siri invites her along on a trip home to Sweden for the summer, Lauren impulsively accepts, intrigued by how Siri describes it: “Everything will be green, fresh, new, just thawing out.” But once there, Lauren finds herself drawn to Siri’s enigmatic, brooding brother Magnus. Siri is resentful, and Lauren starts to see a new side of her friend: selfish, reckless, self-destructive, even cruel. On the last night of her trip, Lauren accompanies Siri and her friends on a seaside camping trip to celebrate Midsommar’s Eve, a night when no one sleeps, boundaries blur, and under the light of the unsetting sun, things take a dark turn.Ultimately Lauren must acknowledge the truth of what happened with Siri and come to terms with her own tragic past in this gorgeously written, deeply felt debut about the relationships that come to us when things feel darkest–and the transformative power of female friendship.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Thriller",
    "Adult",
    "Mystery Thriller",
    "Mystery"
  ],
  "author": "Diane Zinna",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/40235456-the-all-night-sun"
}