{
  "title": "Exactly How Precision Engineers Created",
  "description": "Bestselling author Simon Winchester writes a magnificent history of the pioneering engineers who developed precision machinery to allow us to see as far as the moon and as close as the Higgs boson. Precision is the key to everything. It is an integral, unchallenged and essential component of our modern social, mercantile, scientific, mechanical and intellectual landscapes. The items we value in our daily lives - a camera, phone, computer, bicycle, car, a dishwasher perhaps - all sport components that fit together with precision and operate with near perfection. We also assume that the more precise a device the better it is. And yet whilst we live lives peppered and larded with precision, we are not, when we come to think about it, entirely sure what precision is, or what it means. How and when did it begin to build the modern world?Simon Winchester seeks to answer these questions through stories of precision's pioneers. Exactly takes us back to the origins of the Industrial Age, to Britain where he introduces the scientific minds that helped usher in modern production: John `Iron-Mad' Wilkinson, Henry Maudslay, Joseph Bramah, Jesse Ramsden, and Joseph Whitworth. Thomas Jefferson exported their discoveries to the United States as manufacturing developed in the early twentieth century, with Britain's Henry Royce developing the Rolls Royce and Henry Ford mass producing cars, Hattori's Seiko and Leica lenses, to today's cutting-edge developments from Europe, Asia and North America.As he introduces the minds and methods that have changed the modern world, Winchester explores fundamental questions. Why is precision important? What are the different tools we use to measure it? Who has invented and perfected it? Has the pursuit of the ultra-precise in so many facets of human life blinded us to other things of equal value, such as an appreciation for the age-old traditions of craftsmanship, art, and high culture? Are we missing something that reflects the world",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Engineering",
    "Technology",
    "Audiobook",
    "Business"
  ],
  "author": "Simon Winchester",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/40244712-exactly-how-precision-engineers-created"
}