{
  "title": "Embrace the Passion",
  "description": "Pets in Space is back! Join us as we unveil eleven original, never-before-published action-filled romances that will heat your blood and warm your heart! New York Times, USA Today and Award-winning authors S.E. Smith, Anna Hackett, Ruby Lionsdrake, Veronica Scott, Pauline Baird Jones, Carol Van Natta, Tiffany Roberts, Alexis Glynn Latner, E D Walker, JC Hay, and Kyndra Hatch combine their love for Science Fiction Romance and pets to bring readers sexy, action-packed romances while helping our favorite charity. Proud supporters of HeroDogs.org, Pets in Space authors have donated over 4,400 in the past two years to help place specially trained dogs with veterans. Open your hearts and grab your limited release copy of Embrace the Passion: Pets in Space 3 today!  HEART OF THE CAT Sarafin Warriors Series By S.E. Smith Can love bridge the gap between a wounded alien warrior and the reclusive human woman who holds the future of his species inside her?  DESERT HUNTER Galactic Gladiators Series By Anna Hackett Among the desert sands of an alien world, a man with secrets to hide finds himself face to face with the one woman who can bring him to his knees.  QUASHI Mandrake Company Series By Ruby Lionsdrake Alien fur balls, a handsome doctor, and a little white lie create havoc for a young woman who only wanted a job. STAR CRUISE: MYSTERY DANCER The Sectors SF Romance Series By Veronica Scott A long-lost princess and her three-eyed cat seek refuge on the Nebula Zephyr only to catch the attention of an inquisitive Security Officer.  OPERATION ARK Project Enterprise Series By Pauline Baird Jones A not quite routine mission to return rescued prisoners to their home worlds turns deadly for unlikely allies, a USMC Sergeant and a raised-by-robots pirate. Is the Sergeant’s unusual pet the wild card that will save or doom them?  CATS OF WAR A Central Galactic Concordance Novella by Carol Van Natta A disgraced military Sub-Captain, a repair technician with secrets, and two special cats must save the day when trouble erupts at an important factory.  HUNTER OF THE TIDE The Kraken #3 By Tiffany Roberts Nearly broke by betrayal, a human discovers solace—and a chance for love—among the creatures he once hunted, but he must overcome prejudice and inhibition to claim the female he desires.  STARWAY By Alexis Glynn Latner A lonely interstellar pilot and a passenger’s mistreated consort find each other in an interstellar hotel that offers everything to satisfy its guests’ desires—even desires they didn’t know they had.  THE BAJO CATS OF ANTEROS XII By E D Walker Two ex-lovers, stranded in space, have to save a pair of kittens with hazardous powers before the local drug cartel catches up to them.  SHADOW OF THE PAST By JC Hay On a world of perpetual night, an aging ranger and a widowed veterinarian need to put aside their past to protect a pack of wolves... and their future.  AFTER THE FALL By Kyndra Hatch The Invaders took everything worth living for. Could an Invader show him how to live again?",
  "genres": [
    "Romance",
    "Anthologies",
    "Science Fiction Romance",
    "Science Fiction",
    "Fantasy",
    "Paranormal",
    "Aliens"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/40237564-embrace-the-passion"
}