{
  "title": "Crazy '08: How a Cast of Cranks, Rogues, Boneheads, and Magnates Created the Greatest Year in Baseball History",
  "description": "From the perspective of 2007, the unintentional irony of Chance's boast is manifest—these days, the question is when will the Cubs ever win a game they have to have. In October 1908, though, no one would have The Cubs were, without doubt, baseball's greatest team—the first dynasty of the 20th century. Crazy '08 recounts the 1908 season—the year when Peerless Leader Frank Chance's men went toe to toe to toe with John McGraw and Christy Mathewson's New York Giants and Honus Wagner's Pittsburgh Pirates in the greatest pennant race the National League has ever seen. The American League has its own three-cornered pennant fight, and players like Cy Young, Ty Cobb, Walter Johnson, and the egregiously crooked Hal Chase ensured that the junior circuit had its moments. But it was the National League's—and the Cubs'—year. Crazy '08 , however, is not just the exciting story of a great season. It is also about the forces that created modern baseball, and the America that produced it. In 1908, crooked pols run Chicago's First Ward, and gambling magnates control the Yankees. Fans regularly invade the field to do handstands or argue with the umps; others shoot guns from rickety grandstands prone to burning. There are anarchists on the loose and racial killings in the town that made Lincoln. On the flimsiest of pretexts, General Abner Doubleday becomes a symbol of Americanism, and baseball's own anthem, \"Take Me Out to the Ballgame,\" is a hit. Picaresque and dramatic, 1908 is a season in which so many weird and wonderful things happen that it is somehow unsurprising that a hairpiece, a swarm of gnats, a sudden bout of lumbago, and a disaster down in the mines all play a role in its outcome. And sometimes the events are not so wonderful at all. There are several deaths by baseball, and the shadow of corruption creeps closer to the heart of baseball—the honesty of the game itself. Simply put, 1908 is the year that baseball grew up. Oh, and it was the last time the Cubs won the World Series. Destined to be as memorable as the season it documents, Crazy '08 sets a new standard for what a book about baseball can be.",
  "genres": [
    "Baseball",
    "Sports",
    "History",
    "Nonfiction",
    "Biography",
    "American History"
  ],
  "author": "Cait Murphy",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/402392.Crazy_08"
}