{
  "title": "Born Again Sinner",
  "description": "CODYOne minute, I'm serving my country as a soldier with a purpose.The next, I sustain a near fatal injury saving my best friend's life and am shipped back home like damaged cargo.Ripped from my military brothers and everything I know, I'm sentenced to my hometown of Spruce to recover - and endure the town's prying eyes and scrutiny. I'm left to question my purpose, struggling to find fulfillment in my new civilian life.No one can deal with me. I scared away all the nurses. Five of them, to be exact.My poor mom is running out of options.That's when they send my last resort: Trey Arnold, the town preacher's son.I don't have high hopes. His sweet face and gentle demeanor don't give me much confidence that he'll have what it takes to handle me. But there is a fearlessness in his eyes I can't deny, and the longer I stare into them, the more I see.It doesn't matter how brave he thinks he is, taking me on.If he had any sense, he'd turn around and go right now.TREYI'm not easily intimidated. But when I am confronted with Cody Davis - and his impossibly intense eyes and boundless strength - I find myself facing my greatest challenge.Being the gay son to the town reverend - in a place as open-hearted and loving as Spruce, Texas - most people assume my life is easy. But I battle my own demons, too, still haunted by the passing of my mother and questioning my faith. My father is not much better off, struggling every day with his own burdens.That makes my duty to Cody all the more meaningful. Each time he challenges me, I become more determined to help the young Army vet. Maybe if I save him, I can save myself, too.But with each minute I spend around Cody, I become more confused, losing track of why I'm here at all. Why does Cody keep looking at me that way? Why can't I keep my heart from racing when he's near?The pain in Cody's eyes seems to mirror mine.So does the desire.✔️ M/M romance✔️ Army vet & preacher's son✔️ Small-townHave you read all the books in the Spruce Texas series?Football SundaeBorn Again Sinner ◄◄HeteroflexibleWrangledRebel At Spruce HighSummer SweatHopeful RomanticMr. Picture PerfectHot Mess Express(with more to come!)What about the Texas Beach Town spin-off series?In Too DeepCrusherFar From Paradise(more on the way!)",
  "genres": [
    "M M Romance",
    "Romance",
    "Military Fiction",
    "Audiobook",
    "Contemporary",
    "LGBT",
    "Disability"
  ],
  "author": "Daryl Banner",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/40245507-born-again-sinner"
}