{
  "title": "No Way to Kill a Lady",
  "description": "The Blackbird sisters are back—and as witty and wonderful as ever!For richer, for poorer...                                                               Nora Blackbird, the Bucks County ex-debutante with a haute couture wardrobe, a hot job as a glamorous society columnist and a stone cold bank account, might finally have her own life just right, but everyone around her is going down in flames. Her sister Libby seems destined to be the lead character in a tabloid sex scandal.  Her sister Emma is expecting a mysterious love child.  Her best friend, Lexie Paine, is serving time in the slammer.  And now her mobbed-up boyfriend, Mick Abruzzo—who might actually be her husband—is conducting clandestine capers from Blackbird Farm while under house arrest. What’s a good girl to do?  Find a killer, that’s what!  Word arrives that the sisters’ great aunt, Madeleine Blackbird, has died in a volcanic eruption on an Indonesian island and left her fabulous country estate, worth millions, to the three of them.  But when the Blackbird sisters show up to claim their windfall, they find the house in a state of disheartening decay and all of Madeleine’s to-die-for treasures gone. Worse, the mansion has been hiding a grisly the body of a woman who died there many years ago.  All the evidence points to a high society murder...Nora’s special bond with flamboyant Aunt Madeleine compels her to seek out the truth.  With her aunt’s amorous stepson dogging her footsteps, her unscrupulous lawyer acting like a skunk, and her devoted housekeeper not to be found, Nora’s investigation is going nowhere.  Good thing Mick’s close by to offer Nora distractions both dark and delightful.  And, as ever, her irrepressible sisters provide some unexpected... and highly unorthodox... assistance when she most needs it.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Romance",
    "Chick Lit",
    "Cozy",
    "Mystery Thriller"
  ],
  "author": "Nancy Martin",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12317338-no-way-to-kill-a-lady"
}