{
  "title": "The Evil Queen",
  "description": "Once Upon a Time meets Game of Thrones in New York Times bestselling author Gena Showalter’s magical, romantic dark fantasy series, in which the fairy tales we know and love are prophecies of the future.Welcome to the Forest of Good and Evil, where villains may be heroes and heroes may be villains…it all depends on who you ask.In the realm of Enchantia, creatures of legend still exist, magic is the norm, and fairy tales are real.Raised in the human world, Everly Morrow has no idea she’s a fairy-tale princess—until she begins to commune with mirrors. Soon, a horrifying truth is revealed. She is fated to be Snow White’s greatest enemy, the Evil Queen.With powers beyond her imagination or control, Everly returns to the land of her birth. There, she meets Roth Charmaine, the supposed Prince Charming. Their attraction is undeniable, but their relationship is doomed. As Everly faces disasters and betrayals, giving in to her wicked side proves more tempting. Can she resist, or will she become the villain she was born to be?Critics love The Evil Queen:“Showalter (the Everlife books) delivers an entertaining series opener that condemns prejudice while championing self-determination. Romance-sweet and steamy, gay and straight-features prominently, action and humor abound, and the mystery of how each character figures into the legend imparts intrigue.”—Publishers Weekly“The novel's conceit has a lot of potential with its deconstruction of a cherished fairy tale, an interesting take on good and evil as actions rather than fate, and a long cast of characters in ever evolving roles that will leave readers wondering who they are supposed to be.”—Kirkus ReviewsThe Forest of Good and Evil The Evil QueenThe Glass Queen",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Retellings",
    "Romance",
    "Young Adult Fantasy",
    "Magic",
    "Fiction"
  ],
  "author": "Gena Showalter",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/40242200-the-evil-queen"
}