{
  "title": "#cincodemayo 110",
  "description": "The Battle of Puebla on 5-5-1862 known as Cinco de Mayo was a Mexican military victory against the French led forces of King Napoleon III. The French had not lost a single battle since Napoleon Bonaparte lost the Battle of Waterloo in 1815. Meanwhile in a parallel universe the French lead forces are able to defeat Mexico on 5-5-1862 leading to the eventual downfall of the Mexican government of President Benito Pablo Juárez García. A new rising star in the Mexican Army earns the title of President of Mexico in the newest colony of France. King Napoleon III has plans for a new alliance with the Confederate States of America, Britain, and Spain. A new war to recuperate Mexico’s lost lands from the Mexican American War of 1846 soon follows to distract the attention of the Mexicans. A group of characters now must deal with the consequences of the defeat on 5-5-1862. Each of them will struggle to adjust to the news. Dulce María discovers a secret that her father Colonel Abraham is hiding in a hole in the wall. Cortez hides in the mountains of Queretaro, Mexico with the rest of the conservative rebels waiting to attack a nearby town to gather supplies for their lost cause. Eva saves the life of a thief by convincing her father that sometimes business comes before revenge. Major José intervenes to help a friend in a tough situation. Francisco earns the title of Mexican Supreme Court Justice after a killing. Enriqueta has a secret plan to preserve her family’s power in Mexico City. Captain Pablo finds a mysterious letter that promises an opportunity to enjoy one last prank before his retirement. Ophelia works as a nurse for the Confederate States of America during the time when the medical field does not accept women. Lyra helps to run a cotton and tobacco smuggling operation out of San Antonio, Texas into the port of Bagdad, Mexico to fool the naval blockade of the United States of America.",
  "genres": [],
  "author": "I.D. Oro",
  "average_rating": "4.96",
  "url": "https://www.goodreads.com/book/show/40241311-cincodemayo-110"
}