{
  "title": "Daddy's New Kitten",
  "description": "Deke Jamison has been waiting for his hot neighbor to fall madly in love with him for years. The day Marshall moved in next door, Deke instantly knew for sure that it was love at first sight. Well, okay… maybe just lust. But since Marshall turned out to be not just be hot, but also super kind and fifty shades of wonderful, the falling-in-love part happened pretty quickly, too. Marshall is everything Deke could ever want in a man, and they’re clearly meant to be together forever. So why is it taking Marshall so dang long to realize how perfect they are for each other? Marshall Palmer has been trying to resist the enthusiastic boy next door for years. But Deke doesn’t make it easy. He may be too young and he’s definitely too vanilla, but he also shares every single one of Marshall’s values and is utterly adorable on top of it. All Deke wants out of life—besides Marshall, which he’s made more than clear because subtle, Deke is not—is to make the world a better place. Between Deke’s endless volunteer work and the energetic determination he brings to helping others, Marshall has no doubt that Deke will manage to do it, too. After all, he’s already made Marshall’s world a better place. But there’s no way Marshall can ever let their friendship become anything more, not after the way Marshall failed the last boy who claimed to love him. (LOL, isn’t it cute that Marshall thinks it’s up to him to decide?) When Deke discovers that the pets up for adoption in the fundraiser Marshall is helping to organize—the one he most decidedly does not want Deke’s help with—aren’t exactly the fluffy cats and dogs Deke expected, he falls down a kinky little rabbit hole and ends up with ears and a tail of his own. And no one can resist an adorable little kitten, right? Besides, everyone knows that cats pick their owners, not the other way around. And if those owners prefer to be called “Daddy,” Deke has no problem with that. No problem at all. Daddy’s New Kitten is a gay romance as utterly adorable as Deke is, featuring an age gap, a soon-to-be-ex-virgin who looks amazing with a tail, and a Daddy who’s going to be adopted by his eager new kitten whether he wants it or not. ( he wants it.) Deke and Marshall’s story is part of the Daddies for Dollars multi-author series, where every book features a swoon-worthy Daddy, a boy he adores, and a happily ever after helped along by a fundraiser event. Each book stands alone, but with six delicious Daddy pairings to choose from, why not read them all?",
  "genres": [
    "M M Romance",
    "BDSM",
    "Romance",
    "Contemporary",
    "Humor",
    "Friends To Lovers",
    "LGBT"
  ],
  "author": "Chara Croft",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/123173571-daddy-s-new-kitten"
}