{
  "title": "Under Pressure: Confronting the Epidemic of Stress and Anxiety in Girls",
  "description": "An urgently needed guide to the alarming increase in anxiety and stress experienced by girls from elementary school through college, from the New York Times bestselling author of UntangledThough anxiety has risen among young people overall, studies confirm that it has skyrocketed in girls. Research finds that the number of girls who said that they often felt nervous, worried, or fearful jumped 55 percent from 2009 to 2014, while the comparable number for adolescent boys has remained unchanged. As a clinical psychologist who specializes in working with girls, Lisa Damour, Ph.D., has witnessed this rising tide of stress and anxiety in her own research, in private practice, and in the all-girls' school where she consults. She knew this had to be the topic of her new book.In the engaging, anecdotal style and reassuring tone that won over thousands of readers of her first book,  Untangled, Damour starts by addressing the facts about psychological pressure. She explains the surprising and underappreciated value of stress and anxiety: that stress can helpfully stretch us beyond our comfort zones, and anxiety can play a key role in keeping girls safe. When we emphasize the benefits of stress and anxiety, we can help our daughters take them in stride.But no parents want their daughter to suffer from emotional overload, so Damour then turns to the many facets of girls' lives where tension takes hold: their interactions at home, pressures at school, social anxiety among other girls and among boys, and their lives online. As readers move through the layers of girls' lives, they'll learn about the critical steps that adults can take to shield their daughters from the toxic pressures to which our culture--including we, as parents--subjects girls.Readers who know Damour from Untangled or the New York Times,  or from her regular appearances on CBS News,  will be drawn to this important new contribution to understanding and supporting today's girls.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Education",
    "Health",
    "Audiobook"
  ],
  "author": "Lisa Damour",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/40265615-under-pressure"
}