{
  "title": "Firstborn",
  "description": "The seventh book in the epic fantasy House War series returns to a beloved world of magic and political intrigue, where new threats are stirring.Jewel ATerafin has never wanted to be a power. What she truly wants, she built in the streets of the poorer holdings. To protect what she built, to protect what she values above all else, she has accepted that power is necessary.But with power comes responsibility.Jewel has forced herself to do what would have once been She has surrendered her den-kin, Carver, to the wilderness, because she must if she is to have any hope of saving the rest of her family, and the city in which they dwell.But she cannot leave him with nothing. Into his hands, she has placed the single, blue leaf that came from the wilderness and the dreaming combined. She doesn’t know what it does or what it was meant to do—but it is the most powerful item on her person, and it is the only thing she can leave him.     That leaf, however, was created to serve a purpose that Jewel does not understand. Nor does Carver, who now possesses it. With Ellerson by his side, Carver intends to traverse the wild Winter in an attempt to reach home—and the people who are waiting for him.     There are those who do understand the significance of Carver’s gift, and the disaster that will prevail if it remains in his hands. But time is of the essence. These lands are not unclaimed, and the Lord of these lands is waking from his ancient slumber.     Nor is the Lord the only threat. Firstborn, demons, and wild elementals are swirling around two mortal men in a storm that threatens to end the only chance the city of Averalaan has of surviving what is to follow.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "Magic",
    "Canada"
  ],
  "author": "Michelle West",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/40274648-firstborn"
}