{
  "title": "Some Very Dignified Disclosures",
  "description": "It is an ordinary summer evening in a remote village near India and Nepal border; Roli’s mother and grandmother are quarrelling beside the well of their dilapidated feudal mansion. Roli is lurking in the courtyard; no one from her joint-family pays attention, and suddenly her father appears and clasps his wife’s throat. Roli watches in horror and envisions her mother’s spirit releasing from the dead body. Her future gets haunted by the twin spectre - mother’s ghost and father’s crime. The narrative moves to a small town, in the large household of a village acquaintance, where Roli shifts for higher studies, and encounters various fascinating lodgers, including an eccentric priest, who collects sundry items on streets to construct a house, and catches an exotic bird which dazzles the neighbourhood, a perplexing night watchman, whose mysterious doings make the priest lose his mind, a bored wife of a sailor, who dabbles in occultism, a scholarly librarian, who convinces Roli to accept her troubled past, and the unhappy wives of her landlord play an intriguing role in her attachment to another of the tenets- a temperamental young man, who becomes Roli’s love interest. The protagonist is an imaginative teenager. She loves reading and is attracted to people with mysterious backgrounds – very much like the characters of her favourite novels. A sympathetic village woman gifts her amber necklace, which smells like ambergris, and details many supernatural incidents involving it. Does the necklace hold magical powers? Will the fragrance of ambergris capture the man she loves? Can Roli find success on the treacherous winding roads of adulthood? Anumita Sharma is the author of The Curse of Yesterday. Inherently a poet, a wordsmith, and voracious reader, Anumita loves telling stories set in the rustic environment of Eastern India.",
  "genres": [
    "Indian Literature",
    "Magical Realism",
    "Fiction"
  ],
  "author": "Anumita Sharma",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/40279615-some-very-dignified-disclosures"
}