{
  "title": "Träumer Chroniken: Chloe-Lenne",
  "description": "Wenn dich deine Alpträume plötzlich in der realen Welt besuchen kommen, was würdest du tun?Die fünfzehnjährige Chloe-Lenne zieht mit ihrer Mutter in die Kleinstadt Laminafani, weit weg von der Stadt, in der sie gemieden wurde und ein schrecklicher Unfall das Sahnehäubchen des Mobbings war. In der Schule schließt sie schnell Freundschaft mit einer Clique aus drei Jungen und einem Mädchen. Obwohl sehr schüchtern, blüht Chloe-Lenne in dieser Freundschaft auf, insbesondere zu Saira. Dieses rothaarige Mädchen entpuppt sich als Hexe, worüber Chloe-Lenne sehr beeindruckt ist. Gemeinsam erleben die beiden einen sehr merkwürdigen Zwischenfall auf der Mädchentoilette, in der sie angegriffen werden und sich wundern, wo sie plötzlich gelandet sind. Chloe-Lenne scheint immer wieder in alptraumhaften Dimensionen zu springen, ohne zu wissen, wie und warum. Während Saira ihren aufkeimenden Hexenkräften nachgeht, findet Chloe-Lenne in ihren Träumen einen Siegelwächter, mit dem sie sich sehr gut versteht. Sie wünscht sich nichts sehnlicheres, als ihm im echten Leben zu begegnen. Saira hingegen geht einer sehr intensiven Affäre nach, von der niemand etwas weiß, weil es verboten ist. Chloe-Lenne verliebt sich und würde es gerne genießen, doch lassen sie wiederkehrende Visionen von Monstern, die ihr nach dem Leben trachten, eine Mädchen Clique, die es sich zum Ziel gemacht hat, sie fertig zu machen und ein Junge, der ihr gegenüber zwischen Freundlichkeit und Hass hin und herspringt, das Leben turbulent bleiben. Eines Tages stirbt ein ihr sehr geliebter Mensch bei einem schrecklichen Unfall, der alle sprachlos macht. Nur durch ihre Clique findet sie Halt in dieser schweren Zeit. Dann findet sie auch noch heraus, dass ihre Träume nicht nur Träume sind und immer mehr verschwimmen die Grenzen zwischen dem Leben hier und dem Leben dort. Ihr Traummann scheint nicht nur in ihren Träumen zu leben und auch nicht unbedingt ihr Traummann zu sein. Was ist Traum und was Wirklichkeit?",
  "genres": [],
  "author": "Jeanne Born",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/40280783-tr-umer-chroniken"
}