{
  "title": "The Emperor's Wolf",
  "description": "A soldier enslaved by the emperor who conquered him, with only one hope to save the man from madness...Jaden, a soldier sold into slavery when his country fell, survives day to day, his only wish to find his little sister and save her from the same fate. The war might be over, but the scars of those who underwent Tranaden's conquest still linger. But when he is given as tribute to the very man who conquered his country—Dersai, known as the Wolf, an emperor feared and loathed beyond Tranaden's borders—Jaden sees his last hope fading away. It is whispered that the emperor is mad, possessed, without the faintest shred of mercy. Yet, Jaden finds that the man is someone quite different among his own people, in the safety of his own world. Old hatreds die hard, but Jaden finds himself fascinated by the complex, mysterious man beneath the warrior shell. There is a darkness in Dersai, but also a chance to set things right at last.Dersai cannot afford the luxury of mercy in any form. His country, his people come first, and he will do anything to defend his borders and drive back those who seek to possess the lush beauty of Tranaden. His ancestor made a pact with a demon, and ever since, each emperor must endure the possession of the demon bound to protect Tranaden at any cost. As with those before him, Dersai will eventually fall into madness, his own people forced to annihilate him, and the next emperor forced to bear the burden again. He'd never held any hope...until he met Jaden and began to believe the old prophecies might finally come true. That a mate for the wolf would come and break the cycle forever... Reader Expanded with new material! Contains intense emotional elements. Reader discretion advised.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "BDSM",
    "Romance",
    "Paranormal",
    "Enemies To Lovers",
    "Erotica"
  ],
  "author": "J.C. Owens",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/40274669-the-emperor-s-wolf"
}