{
  "title": "Madame Edwarda seguido de El muerto",
  "description": "Georges Bataille, con el seudónimo de Pierre Angélique, había publicado, en 1941 y en 1945, dos ediciones clandestinas de Madame Edwarda . En 1956, Bataille entregó el libro a su editor, J.-J. Pauvert, para que lo publicara por primera vez en edición comercial, manteniendo en seudónimo, pero añadiendo un prefacio firmado con su nombre. Diez años después, una vez muerto Bataille, apareció finalmente la edición definitiva con el nombre real del autor. Bataille había concebido publicar, en un solo volumen, Madame Edwarda , seguido de Mi madre y de otros dos textos. (Encontrarán más información acerca de este proyecto en Mi madre , ya publicado en esta misma colección, n.º 19). Finalmente fueron publicados por separado y, ahora, debido a la brevedad del texto de Madame Edwarda -y de El muerto (libro que no entraba en este proyecto de Bataille)-, decidimos, con la autorización del editor francés, reunirlos en un solo volumen, en la edición española. Madame Edwarda es la imagen misma de la mujer transgresora, de esa mujer que, proveniendo de lo que concebimos como el Mal, pasa a ser Dios por su omnipotente poder de disponer de su vida, de su sexo y de su muerte. El hombre que la sigue, cautivado, presa de un miedo atávico, encuentra en ella la total realización del Deseo. El muerto, publicado póstumamente en 1967, está compuesto de veintiocho escenas breves que narran las últimas horas de una mujer cuyo amante acaba de morir en sus brazos. Ese coito interruptus la precipita en un vertiginoso dédalo de vivencias eróticas en las que ella misma va al encuentro de su amante, en la muerte… Se trata de dos pequeños tesoros literarios que harán las delicias de quienes aman la Literatura, de quienes aman el Erotismo y de quienes aman la Literatura Erótica.",
  "genres": [
    "Fiction",
    "Literature",
    "French Literature"
  ],
  "author": "Georges Bataille",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/403302.Madame_Edwarda_seguido_de_El_muerto"
}