{
  "title": "Discretion",
  "description": "For fans of Lisa Scottoline and Law and Order: SVU, former federal sex-crimes prosecutor Allison Leotta's novel explores the intersection of sex and power as Anna Curtis investigates the murder of one of DC's highest-paid escorts.When a beautiful young woman plummets to her death from the balcony of the U.S. Capitol, Assistant U.S. Attorney Anna Curtis is summoned to the scene. The evidence points to a sexual assault and murder. The victim is one of the city's highest-paid escorts. And the balcony belongs to Washington, D.C.'s sole representative to Congress, the most powerful figure in city politics. The Congressman proclaims his innocence, but he's in the middle of a tough primary fight, and the scandal could cost him the election. For Anna, the high-profile case is an opportunity. But as the political stakes rise, she realizes that a single mistake could end her career. At the same time, her budding romance with Jack Bailey, the chief homicide prosecutor, is at a crossroads. Determined to gain respect in the office, Anna wants to keep their relationship under wraps. But the mounting pressure and media attention that come with the office's most important case will inevitably expose their relationship if it doesn't destroy it first. The investigation leads Anna to Discretion, a high-end escort service that caters to D.C.'s elite. But with each break in the case, the mystery deepens. And the further Anna ventures into D.C.'s red-light underworld, the larger the target on her own back. From the secret social clubs where Washington's most powerful men escape from public view to the asphalt track where the city's most vulnerable women work the streets, Discretion is a gripping exploration of sex, power, and the secrets we all keep.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Contemporary",
    "Legal Thriller"
  ],
  "author": "Allison Leotta",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/12318911-discretion"
}