{
  "title": "Into the Jungle",
  "description": "In this pulse-pounding thriller from the author of the “haunting, twisting thrill ride” (Megan Miranda, New York Times bestselling author) The River at Night, a young woman leaves behind everything she knows to take on the Bolivian jungle, but her excursion abroad quickly turns into a fight for her life.Lily Bushwold thought she’d found the antidote to endless foster care and group homes: a teaching job in Cochabamba, Bolivia. As soon as she could steal enough cash for the plane, she was on it. When the gig falls through and Lily stays in Bolivia, she finds bonding with other broke, rudderless girls at the local hostel isn’t the life she wants either. Tired of hustling and already world-weary, crazy love finds her in the form she least expected: Omar, a savvy, handsome local man who’d abandoned his life as a hunter in Ayachero—a remote jungle village—to try his hand at city life. When Omar learns that a jaguar has killed his four-year-old nephew in Ayachero, he gives Lily a choice: Stay alone in the unforgiving city, or travel to the last in a string of ever-more-isolated river towns in the jungles of Bolivia. Thirty-foot anaconda? Puppy-sized spiders? Vengeful shamans with unspeakable powers? Love-struck Lily is oblivious. She follows Omar to this ruthless new world of lawless poachers, bullheaded missionaries, and desperate indigenous tribes driven to the brink of extinction. To survive, Lily must navigate the jungle--its wonders as well as its terrors—using only her wits and resilience. Primal, gripping, and terrifying, Into the Jungle features Erica Ferencik’s signature “visceral, white-knuckle” (Entertainment Weekly) prose that will sink its fangs into you and not let go.",
  "genres": [
    "Fiction",
    "Thriller",
    "Adventure",
    "Mystery",
    "Mystery Thriller",
    "Survival",
    "Suspense"
  ],
  "author": "Erica Ferencik",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/40381874-into-the-jungle"
}