{
  "title": "Bride Tree",
  "description": "5 STARS \"...an enchanting romance woven with espionage, and a power struggle that will keep any historical fan charmed and mesmerized.\"—Reader's FavoriteBride Tree, a sweeping allegory of the Church set in the tumultuous French Revolution era, fuses alternative history with romantic suspense. Enter a world of color—a world in which spies, romance and faith collide with materialism and greed. The year is 1789. France is reeling under the impact of a civil war between its social classes.When a secret agent from Rome joins forces with a vindictive politician bent on revenge, the stage is set for an explosive outcome that will shake the country to its core.Meanwhile, Queen Marie-Antoinette engages the help of her lady-in-waiting, Viviane de Lussan, in a desperate battle to keep her throne... and her head. But how can she win a struggle she seems fated to lose?Amid the chaos of the revolution, Viviane's heart is torn between a nobleman who sacrifices everything for her and a peasant who promises true freedom.Bride Tree fuses unforgettable drama with undeniable truth.Romantic suspense meets alternative history in an explosive story of love, betrayal, and redemption.Please This book is best enjoyed by readers aged 15 and above due to occasional scenes of sensuality and violence that accurately depict life as it was at the court of Versailles. The author has taken every precaution to avoid overtly vivid descriptions but feels it would be an injustice to ignore these issues altogether as they were critical parts of the pre & post French revolutionary periods.\"But with BrideTree--you see the light clearly from the darkness. I liked how even from the prologue the light is clearly defined and I like how you did that right off.\"—Emma, Goodreads\"Author JP Robinson delivers a fast-paced, intense, and exciting novel in BrideTree! From start to finish, he draws you in and you won’t be able to put the book down.\"—ChristianReader, Goodreads\"I found the Bride Tree, by J.P. Robinson, a fascinating historical fiction.\"—PegBoard,Goodreads\"Bride Tree is a story filled with French history, action, romance, betrayal, suspense, and allegory.\"—KellyAbout the Author JP Robinson began writing as a teenage freelance journalist for a prominent New York based newspaper. He soon gained local recognition for his writing, has been a guest speaker on several radio networks and is known for leading dynamic author education workshops in various states. When he's not pounding away at his keyboard, or spending time with his wonderful wife and kids, JP loves perfecting the art of instinctive archery. Become a sales affiliate . Earn cash and help JP spread the love of his books when you sign up on his",
  "genres": [
    "Historical Fiction"
  ],
  "author": "J.P.     Robinson",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/40360956-bride-tree"
}