{
  "title": "The Chessmen of Mars",
  "description": "Impetuous and headstrong is Tara, Princess of Helium and daughter of John Carter. Tara meets Prince Gahan of Gathol, and is initially unimpressed, viewing him as something of a popinjay. Later she takes her flier into a storm and loses control of the craft, and the storm carries her to an unfamiliar region of Barsoom. After landing and fleeing from a pack of ferocious Banths (Martian lions), she is captured by the horrific Kaldanes, who resemble large heads with small, crab-like legs. The Kaldanes have bred a symbiotic race of headless human-like creatures called Rykors, which they can attach themselves to and ride like a horse. While imprisoned, Tara manages to win over one of the Kaldanes, Ghek, with her lovely singing voice.Fifth of his Barsoom series. Burroughs began writing it in January, 1921, and the finished story was first published in Argosy All-Story Weekly as a six-part serial in the issues for February 18 and 25 and March 4, 11, 18 and 25, 1922. It was later published as a complete novel by A. C. McClurg in November 1922.  \"A daughter,\" he replied, \"only a little younger than Carthoris, and, barring one, the fairest thing that ever breathed the thin air of dying Mars. Only Dejah Thoris, her mother, could be more beautiful than Tara of Helium.\"For a moment he fingered the chessmen idly. \"We have a game on Mars similar to chess,\" he said, \"very similar. And there is a race there that plays it grimly with men and naked swords. We call the game jetan. It is played on a board like yours, except that there are a hundred squares and we use twenty pieces on each side. I never see it played without thinking of Tara of Helium and what befell her among the chessmen of Barsoom. Would you like to hear her story?\"I said that I would and so he told it to me, and now I shall try to re-tell it for you as nearly in the words of The Warlord of Mars as I can recall them, but in the third person. If there be inconsistencies and errors, let the blame fall not upon John Carter, but rather upon my faulty memory, where it belongs. It is a strange tale and utterly Barsoomian.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Classics",
    "Adventure",
    "Pulp",
    "Science Fiction Fantasy"
  ],
  "author": "Edgar Rice Burroughs",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/40378.The_Chessmen_of_Mars"
}