{
  "title": "Sizzling Florida Heat: An Anthology of 10 Tropical Romances",
  "description": "Ten bestselling Florida authors bring you ten sexy stories set in the Sunshine State.  Desiree Holt, All Tied Up: Her trip to Florida gives Bree Donovan a chance to recover from her broken relationship with her sub. The last thing she expects to find is a Dom who pushes all her buttons. But can she find the courage to make the leap to a new relationship and a new role?  Maxie Cooper, Pleasure Island: When Piper Sterling receives an anonymous gift guaranteed to fulfill her deepest sexual fantasy, she can only think of one fantasy she desires—to share her honeymoon bed with the man of her dreams. The arranged marriage on Pleasure Island is perfect…until Piper begins falling in love with her \"temporary\" husband.  Olivia Jaymes, Caviar and Covert Ops: When Lily meets handsome attorney Dane in the park, she falls head over heels for his intelligent wit and kindness. Dane feels the same about Lily. There's just the little matter of telling her who he really is...  Ali Whippe, Bound for Release: MaryBell doesn't expect anything but a night’s work when she sets up her table at a fetish event. Selling sex toys has its perks, though, as she discovers when she meets James. As they flirt over her wares, she hopes he's up for an exciting ride, and when she gets him back to her place, she's delighted to find a more than willing partner.  Eliza March, Trouble in the Tropics: Cyber specialist Sage Deming committed herself to the NSA after spring break, until a series of deadly encounters threaten to interrupt her plans. Colonel Ryan O'Malley returns after a two-year deployment with a goal to relax before his next cyber security assignment. Is it just dumb luck or fate that he's there when Sage is almost killed?  Bonnie Vanak, The Mating Intent: Twenty-five years ago, Gabriel Sanders took Sienna Bennett’s virginity in a night filled with fiery passion. For breaking her vow of celibacy, Sienna was severely punished by the Fae king. If she surrenders to Gabriel’s sensual allure this time, Sienna faces banishment from her people forever. Gabriel must convince the pretty Elf to sexually bond with him to defeat the dark enchantment before it destroys the Everglades for good.  Jessica Jayne, Legal Desire: Derek Sage doesn’t mix business with pleasure. But a difficult case has Derek looking to a new attorney for assistance and she brings more than her legal expertise to the table. Raina Dillon is ready to take on the legal world at one of the Tampa Bay area’s premier law firms. Can they put their attraction aside or will it consume them?  Cyn Hadyn, Basket Case: Gunner Nord, a male model who moonlights as a jai-alai player is jilted by his fianceé in Miami. But a delicious Cuban massage therapist relieves more than just knotted muscles. She leaves him with the desire to do something responsible for the rest of his life, but only if she agrees to be by his side.  Kathryn Ascher, In Too Deep: Actress Veronica Madison is growing tired of the carefree hookups she’s grown accustomed to during her career in Hollywood. When she takes her annual Spring Break trip to Florida with her old friends, she runs into a guy she once knew. Keith Brooks knows Veronica's out of her class, but can he overcome her doubts and be the anchor she's looking for?  Marilyn Kelly, Banished to Paradise: A debauched English aristocrat is thrust into pioneer life in Florida as a punishment. Nicholas Simms has only two desires to pass the time: whiskey and willing women. The flirtatious, intelligent Josephine Devereaux makes him question his aversion to marriage, until he uncovers her history of deception.",
  "genres": [],
  "author": "Desiree Holt",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/40375858-sizzling-florida-heat"
}