{
  "title": "Kaitlyn and the Highlander",
  "description": "He crossed time and found her — Kaitlyn. And she means everything — the future, love, a home, but in loving her, he wants to live. He needs to survive.Kaitlyn Sheffield’s awesome life has fallen apart. She had a career and a fiancé, but then their breakup video went viral and now she's embarassed, world-wide.Then she meets Magnus, a mysterious stranger, who arrives during a storm. It doesn’t take long before their stories entwine, and their lives change forever.But she may not be prepared for the danger of tying her life to his.For Magnus, protecting Kaitlyn, his home, the future, is everything. He has to keep her safe, but how can he protect her when he’s not of this time?\"You make me feel like I want tae live, yet I am dust. Tis nae fair tae bind ye tae my life when I am nae alive anymore.” —Magnus, 1702\"He was the past. And it broke my heart to think about what that meant. That in the history of the world there was a Magnus Campbell and now there was a Kaitlyn Campbell and once they loved each other, but now he was nothing more than a grave.” —Kaitlyn, 2017A contemporary romance with a dash of history and a bit of SciFi, Kaitlyn and the Highlander is the first book in the Kaitlyn and the Highlander series.If you love mysterious heroes with desperate hearts and romantic thoughts, heroines with courage who are also very ordinary disasters, and love stories that encompass all time, then you’ll love this suspenseful series. Join the adventure, buy book one today.Book 1 — Kaitlyn and the HighlanderBook 2 — Time and Space Between UsBook 3 — A Warrior of My OwnBook 4 — Begin Where We AreBook 5 — Entangled With YouBook 6 —Magnus and a Love Beyond WordsBook 7 — Under the Same SkyBook 8 — Nothing but DustBook 9 — Again my LoveBook 10 — Our Shared HorizonBook 11 — Son and ThroneBook 12 — The WellspringBook 13 — Lady Mairead (a prequel)Book 14 — The GuardianBook 15 — Magnus the First",
  "genres": [
    "Time Travel",
    "Romance",
    "Fantasy",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Diana Knightley",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/40367611-kaitlyn-and-the-highlander"
}