{
  "title": "Selenocentric",
  "description": "Selene and Artie have awoken on Luna Station to discover that everyone else is dead and that all the systems are claiming that eight years have passed. They need to find out what happened and also find a way to survive in a universe that seems to hate them.The Earth was destroyed by a violent comet impact, but that’s old news. Selene and Artie had known about that before they went to sleep. What they weren’t prepared for when they woke was the fact that they were now the only survivors on the Earth’s moon and an unusual amount of time has passed.Luna Station was built to be a mining operation in order to supply iron and steel to the Luna II Station which built our nation’s interstellars. Now, the last of mankind only existed on three enormous interstellars that had been sent out over the years in three opposing directions. The first of those interstellars, sent out twenty-eight years ago, happens to be orbiting the Earth right now.Selene and Artie are in need of a rescue. The people of the USS Constitution are in need of answers about the annihilation of Earth as well as the deaths of those on Luna Station. Unfortunately, they don’t have these answers and even more unfortunate, it seems that all the people on the ship have a secret of their own.Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Kepler Moon Alpha, and his newest acclaimed series The Ani Maxima Files. With over 250,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Hope Rising, One Crazy Summer, and Vestige by McElhaney.EDITORIAL \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review\"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael GallagherGiven 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [
    "Science Fiction"
  ],
  "author": "Scott McElhaney",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/40384917-selenocentric"
}