{
  "title": "The Road to Newgate: A 17th Century London Mystery",
  "description": "A dangerous ambition. A Popish plot. A marriage at risk.London, 1678Anne Thompson has left a life of luxury and comfort to marry Nat, an ambitious writer and Licenser of King Charles II’s but married life isn’t quite what either of them expected. Nat’s work is time-consuming, with religious sedition on the rise, and Titus Oates’ tales of a Popish plot fueling bigotry against Catholics and causing panic on the streets of London.When he is caught up in the investigation of the murder of a prominent Protestant magistrate, Anne, lonely and frustrated, wonders what kind of man Nat really is.Is he right that this murder is not what it seems, or is Nat’s ambition leading them toward disaster? Should Anne become involved, as he risks his livelihood, his freedom and their marriage in pursuit of the truth about Titus Oates?Based on the true events of the Popish Plot in late 17th century England, The Road to Newgate is a historical mystery thriller and love story perfect for fans of Andrew Taylor and Philippa Gregory.~“Absorbing fascinating historical fiction, bringing to life 17th century London”~ What Cathy Read Next“The author does this type of historical fiction so well, cleverly blending fact with fiction, danger with intrigue and all the necessary emotion along the way.”~ Jaffareadstoo“A deftly plotted book, with plenty of twists and turns, all the more remarkable for being based on real events.”~ Discovering Diamonds Reviews“…excellently written, filled with facts and hints of fiction, intensely inviting characters (primary and secondary), eye-catching building of the mind to step back in time to the 17th century. Highly recommend this for those looking for a bit of intrigue, mystery and history.” ~ The Book Junkie Reads",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Historical",
    "Historical Mystery",
    "17th Century",
    "Fiction",
    "Amazon"
  ],
  "author": "Kate Braithwaite",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/40389353-the-road-to-newgate"
}