{
  "title": "I'm Telling the Truth, but I'm Lying: Essays",
  "description": "A 2020 Audie finalist - short stories/collectionsIn I’m Telling the Truth, but I’m Lying, Bassey Ikpi explores her life - as a Nigerian-American immigrant, a black woman, a slam poet, a mother, a daughter, an artist - through the lens of her mental health and diagnosis of bipolar II and anxiety. Her remarkable memoir in essays implodes our preconceptions of the mind and normalcy as Bassey bares her own truths and lies for us all to behold with radical honesty and brutal intimacy.A Bitch Magazine Most Anticipated Book of 2019A Bustle 21 New Memoirs That Will Inspire, Motivate, and Captivate YouA Publishers Weekly Spring Preview SelectionAn Electric Lit 48 Books by Women and Nonbinary Authors of Color to Read in 2019A Bookish Best Nonfiction of Summer Selection\"We will not think or talk about mental health or normalcy the same after reading this momentous art object moonlighting as a colossal collection of essays.” (Kiese Laymon, author of Heavy)From her early childhood in Nigeria through her adolescence in Oklahoma, Bassey Ikpi lived with a tumult of emotions, cycling between extreme euphoria and deep depression - sometimes within the course of a single day. By the time she was in her early '20s, Bassey was a spoken word artist and traveling with HBO's Def Poetry Jam, channeling her life into art. But beneath the façade of the confident performer, Bassey's mental health was in a precipitous decline, culminating in a breakdown that resulted in hospitalization and a diagnosis of Bipolar II.In I'm Telling the Truth, but I'm Lying, Bassey Ikpi breaks open our understanding of mental health by giving us intimate access to her own. Exploring shame, confusion, medication, and family in the process, Bassey looks at how mental health impacts every aspect of our lives - how we appear to others, and more importantly to ourselves - and challenges our preconception about what it means to be \"normal\". Viscerally raw and honest, the result is an exploration of the stories we tell ourselves to make sense of who we are - and the ways, as honest as we try to be, each of these stories can also be a lie.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Essays",
    "Mental Health",
    "Psychology",
    "Audiobook",
    "Feminism"
  ],
  "author": "Bassey Ikpi",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/40390773-i-m-telling-the-truth-but-i-m-lying"
}