{
  "title": "The Elephant in the Room: One Fat Man's Quest to Get Smaller in a Growing America",
  "description": "The government definition of obesity is a body mass index of 30 or more. My BMI is 60.7. My shirts are size XXXXXXL, which the big-and-tall stores shorten to 6X. I’m 6-foot-1, or 73 inches tall. My waist is 60 inches around. I’m nearly a sphere.\n\nThose are the numbers. This is how it feels…\nSo begins The Elephant in the Room, Tommy Tomlinson’s remarkably intimate and insightful memoir of his life as a fat man. When he was almost fifty years old, Tomlinson weighed an astonishing—and dangerous—460 pounds, at risk for heart disease, diabetes, and stroke, unable to climb a flight of stairs without having to catch his breath, or travel on an airplane without buying two seats. Raised in a family that loved food, he had been aware of the problem for years, seeing doctors and trying diets from the time he was a preteen. But nothing worked, and every time he tried to make a change, it didn’t go the way he planned—in fact, he wasn’t sure that he really wanted to change.In The Elephant in the Room, Tomlinson chronicles his lifelong battle with weight in a voice that combines the urgency of Roxane Gay’s Hunger with the intimacy of Rick Bragg’s All Over but the Shoutin’. He also hits the road to meet other members of the plus-sized tribe in an attempt to understand how, as a nation, we got to this point. From buying a FitBit and setting exercise goals to contemplating the Heart Attack Grill in Las Vegas, America’s “capital of food porn,” and modifying his own diet, Tomlinson brings us along on a candid and sometimes brutal look at the everyday experience of being constantly aware of your size. Over the course of the book, he confronts these issues head-on and chronicles the practical steps he has to take—big and small—to lose weight by the end.Affecting and searingly honest, The Elephant in the Room is a powerful memoir that will resonate with anyone who has grappled with addiction, shame, or self-consciousness. It is also a literary triumph that will stay with readers long after the last page.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Health",
    "Biography",
    "Biography Memoir",
    "Food",
    "Audiobook"
  ],
  "author": "Tommy Tomlinson",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/40415813-the-elephant-in-the-room"
}