{
  "title": "The Whiskey Au Go Go Massacre: Murder, Arson and the Crime of the Century",
  "description": "Truecrimereader.com describes this book as 'an extraordinary read'. As featured in The Australian, Courier Mail, Sydney Morning Herald, Brisbane Times, Daily Telegraph, Gold Coast Bulletin, Geelong Advertiser, ABC News Online, The Advertiser and on the ABC 7.30 Report and Radio 6PR.This is a work of non-fiction. The quoted conversations are taken verbatim from police eyewitness statements, court transcripts, coroners’ reports and other archival material. Unless otherwise stated, the narrative is based on the original police murder investigationfiles.The Whiskey Au Go Go nightclub massacre was a defining moment in 1970s Australia: the ‘horrific epicentre of all the crime and filth, the corruption and deaths that came before and followed that tragic night in March 1973, when 15 innocent people lost their lives’.Despite the quick arrest and subsequent conviction of John Stuart and his sidekick, James Finch, the ashes have never stopped smouldering. Rumours have swirled around that horror-filled night for decades: were Stuart and Finch framed? Were others involved? Were further atrocities committed to hide the truth behind the outrage?For decades it was impossible to uncover the truth behind the tragedy. That changed in 2012, when the author had the privilege of being the first person to view the files created by the original lead detectives. These files reveal what occurred prior to, during, and after the conflagration. They reveal unsettling facts. They reveal that the full story of that night has never been told – until now.Why would people enjoy reading the book?What other true crime story has the following list of characters; an alleged serial killer, a psychopath, child rapists, an LSD freak gang of amateur criminals called the Clockwork Orange, a mentally ill career cop-bashing criminal, a professional fire bug, an alcoholic reporter, a ‘Judas’ brother, prostitutes, a lonesome honest cop, the murder of witnesses, many of Australia’s top crims, top cops with question marks, and a criminal tag team with mice tattooed on their penises.Book features :Police transcripts released under seal for the first time to the AuthorOne of Australia’s most infamous crimes2018 will see a coronial inquest open generating significant publicity",
  "genres": [
    "True Crime",
    "Crime",
    "Nonfiction"
  ],
  "author": "Geoff Plunkett",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/40411070-the-whiskey-au-go-go-massacre"
}