{
  "title": "The Epidemic of Our Time",
  "description": "The Epidemic of Our Time by Solomon AgborAlthough HIV/AIDS can strike anywhere around the globe, no region has been more affected by the deadly ravages of the epidemic than sub-Saharan Africa. Thanks to research and medical advances, the disease has changed from an acute to a chronic condition. Patients, however, still must battle on two the disease that destroys their physical bodies, and the stigma and discrimination that destroy their ability to cope and live normal lives.The Epidemic of Our Time is a memoir of one man's journey into public health and a record of those who have been afflicted with HIV/AIDS. The book begins with the story of the author's cousin, a young woman who becomes infected thanks to choices she made to survive. The second half of the book features the author's story as an African immigrant in the United States treating patients infected with STDs, eventually focusing on HIV/AIDS. It was those patients who inspired him to treat the epidemic, and, armed with hope and a new treatment option, he traveled to nine countries for that purpose.The author, Dr. Solomon Agbor, shares heartfelt stories of patients that will inspire, educate, and even amuse readers. At its heart, The Epidemic of Our Time showcases the courage of one determined doctor and his patients to battle the disease with everything they have. After training in civil engineering in his native country of Cameroon, Dr. Solomon Agbor felt called to care for people instead of building bridges and buildings. He studied in the United States to become a registered nurse and physician assistant before earning a doctorate in public health. He works for the Behavioral Health Administration in the Maryland Department of Health.Agbor's experience includes helping combat the syphilis crisis of the 1990s in Baltimore and joining AIDSRelief, a group of NGOs and academic and private organizations, which is funded by the US government to support the prevention, care, and treatment of HIV/AIDS in developing countries. He has traveled to Uganda, Kenya, Rwanda, Tanzania, Zambia, Nigeria, Ethiopia, Haiti, and Guyana, caring for and educating more than 600,000 patients. He and his wife, Alice, have six children.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Dr Solomon Agbor",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/40409380-the-epidemic-of-our-time"
}