{
  "title": "Palace Intrigue",
  "description": "She suddenly wished that her medical school had offered a course on the art of intrigue… What seemed to be just an accident now carries an ugly and poisonous truth inside. Time to lift the veil. Aliya, now Countess Lillian Elizabeth Mariella Earton and wife to the Earl of Earton, is trying to uncover the truth behind Lillian’s miscarriage and the unhappy course of her marriage. How many enemies does Lilian have? And what do they want of her? King Edward’s interest in the estate of Earton – once collapsing, now prospering – has sparked. He invited Lilian to come to the Royal Palace in spring. Aliya prepares to travel with only one thought in the back of her mind: will she be able to persuade King Edward with her gifts and obtain his permission to continue to develop her business empire as a woman? She has to become an integral part of Edward’s kingdom, so much so that removing her would cause great damage to the rest of the structure. No guts, no glory. Otherwise, she won’t survive, especially with a husband who could exercise total control over her life. In the meantime, Jess, the Earl of Earton, while travelling with the Royal delegation, becomes increasingly disturbed as amassing reports of his wife’s undertakings reach him via the King’s letters. Is Lilian doing all of this by herself or is someone else behind it, telling her what to do? Afterall, she is just a woman. To make matters worse, Jess' cunning mistress Adele is still plotting to eliminate both Miranda and Lilian. Palace Intrigue is the third book in the Medieval Tale series by Lina J. Potter. The plot twists as Lilian's story becomes of interest to neighboring kingdoms. Aliya keeps on winning the trust and hearts of Eveers, Virmans and Khangans and now the King of Wellster sees a powerful ally in the Countess as the struggle for power commences!",
  "genres": [
    "Fantasy",
    "Time Travel",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Medieval",
    "Romance"
  ],
  "author": "Lina J. Potter",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/40418621-palace-intrigue"
}