{
  "title": "Citizen of the World: The Life of Pierre Elliott Trudeau, Volume One: 1919-1968",
  "description": "One of the most important, exciting biographies of our the definitive, major two-volume biography of Pierre Elliott Trudeau – written with unprecedented, complete access to Trudeau’s enormous cache of private letters and papers.Bestselling biographer John English gets behind the public record and existing glancing portraits of Trudeau to reveal the real man and the multiple influences that shaped his life, providing the full context lacking in all previous biographies to-date.As prime minister between 1968 and 1984, Trudeau, the brilliant, controversial figure, intrigued Canadians and attracted international attention as no other Canadian leader has ever done. Volume One takes us from his birth in 1919 to his election as leader in 1968.Born into a wealthy family in Montreal, Trudeau excelled at the best schools, graduating as a lawyer with conservative, nationalist and traditional Catholic views. But always conscious of his French-English heritage, desperate to know the outside world, and an adventurer to boot, he embarked on a pilgrimage of discovery – first to Harvard and the Sorbonne, then to the London School of Economics and, finally, on a trip through Europe, the Middle East, India and China. He was a changed man when he returned – socialist in his politics, sympathetic to labour, a friend to activists and writers in radical causes. Suddenly and surprisingly, he went to Ottawa for two mostly unhappy years as a public servant in the Privy Council Office. He frequently shocked his colleagues when, on the brink of a Quebec election, for example, he departed for New York or Europe on an extended tour. Yet in the 1950s and 60s, he wrote the most important articles outlining his political philosophy.And there were the remarkable relationships with friends, women and especially his mother (whom he lived with until he was middle-aged). He wrote to them always, exchanging ideas with the men, intimacies with the women, especially in these early years, and lively descriptions of his life. He even recorded his in-depth psychoanalysis in Paris. This personal side of Trudeau has never been revealed before – and it sheds light on the politician and statesman he became.Volume One ends with his entry into politics, his appointment as Minister of Justice, his meeting Margaret and his election as leader of the Liberal Party and Prime Minister of Canada. There, his genius and charisma, his ambition and intellectual prowess, his ruthlessness and emotional character and his deliberate shaping of himself for leadership played out on the national stage and, when Lester B. Pearson announced his retirement as prime minister in 1968, there was but one obvious man for the Pierre Trudeau.In 1938 Trudeau began a diary, which he continued for over two years. It is detailed, frank, and extraordinarily revealing. It is the only diary in Trudeau’s papers, apart from less personal travel diaries and an agenda for 1937 that contains some commentary. His diary expresses Trudeau’s own need to chronicle the moments of late adolescence as he tried to find his identity. It begins on New Year’s Day 1938 with the intriguing “If you want to know my thoughts, read between the lines!”–from Citizen of the World",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "History",
    "Canada",
    "Biography Memoir"
  ],
  "author": "John  English",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/404296.Citizen_of_the_World"
}