{
  "title": "The Bride from Moscow",
  "description": "Set against a backdrop of the collapse of the Soviet Empire, The Bride From Moscow follows the travails of a young Russian woman who seeks happiness and a better life in Australia.Svetlana is very much the archetypal Russian woman, like Anna Karenina — outwardly sentimental and passionate — but her strength, determination and conscientiousness emerges in Australia. Her personality has been tempered by fear and suspicion and bureaucracy, but she grows and finds courage through the course of the novel. In Australia, Svetlana finds herself unwittingly tangled in a web of intrigue involving reptile and bird smuggling to Malaysia, and must draw on her inherent honesty and commitment to a cause to deal with the situation. The repressive forces of the Soviet powers make life unbearable for Svetlana in her home country, and she leaves behind the memories of the tragic death of her first husband and an affair with a famous musician, and takes her teenage son to Melbourne. But Svetlana has escaped the political and cultural upheaval in her own country only to find more tragedy in Melbourne. Like many other women from war-torn countries, Svetlana is lured by the promise of a better life and a happy marriage with a Western man she hardly knows. Yet life in her new home seems never to be free from disappointment. Fate cruelly deals her several blows, culminating in her new husband’s death and the heartless interference by her late husband’s family. Thrown out onto the street and desperate, Svetlana is apprehended as a suspect in her Australian husband’s murder.She finds refuge only in a women’s shelter and must struggle to survive and prove her integrity. It is her destiny that is at stake, and the novel climaxes as Svetlana takes matters into her own hands. With new-found vigour, born of bearing blows for too long, she sets out to discover the secrets which surrounded her Melbourne husband’s life, and falls upon information regarding his son Peter’s involvement in some dirty business.The novel turns upon Svetlana’s dilemma: to reveal the information that can damage the people who could hurt her, or forever play the ignorant victim. Both choices are fraught with danger and consequence.A scene, in which Svetlana finally confronts Peter, marks the turning point in Svetlana’s life. Never before had she felt herself capable of such courage, and Peter, too, expects her to fall helpless to his threats. Both players unexpectedly change roles, and now Peter loses his power against a self-confident and forceful Svetlana. The experience draws on many migrants’ lives in a new country free of authoritarianism: Svetlana’s growing sense of self is assisted by a freer atmosphere. Yet Svetlana never truly feels she belongs in Australia, and after a time begins to see her old country in a new light.During this period Svetlana begins to re-structure her life, finds work and feels the deep need for a personal relationship. Dating clubs and introduction agencies play some part in her quest for a special man, but she still fondly remembers her ex-lover, the musician Boris. Her musings on that lost love and life with him are woven in with her attempts to expose the exploits of those whose dealings endanger her very life.Meanwhile, her teenage son, Victor, assimilates perfectly into his new environment, being accepted into a good Melbourne school, and finding future prospects for university entrance. On a trip to New Zeland he falls in love with a local girl and stays there to be with her. The consequence for his mother is devastating, as once again she is left alone. In desperation, she seeks the help of Boris, by telephoning him in Moscow, and discovers that he, too, had been reminiscing over their lost love.",
  "genres": [],
  "author": "Natasha Lukin",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/40396484-the-bride-from-moscow"
}