{
  "title": "Dreaming the Hound",
  "description": "In a spellbinding novel of gods and men, myth and brutality, acclaimed author Manda Scott returns to her heralded saga of a world under siege. For here is the epic tale of Boudica, the legendary Celtic queen, and her embattled Eceni tribe—a bold new work of imaginative fiction that takes us on a thrilling journey into a clash between magic and mankind.To the Eceni tribe of Britannia, nature is the ultimate god, and warriors are joined in battle by the voices and spirits of their ancestors. But the proud Eceni are running out of time. Nero’s army, long since out of patience with Britannia’s wild tribes, is becoming increasingly oppressive. And Boudica’s family is at the center of a gathering Cunomar, Boudica’s son, who longs for the mettle to kill as fiercely as his mother… Graine, her young daughter, gifted with the power of dreamers, scarred forever by the horrors of war...and Boudica’s brother, born Bán of the Eceni, turned the traitor Valerius—a man caught between warrior and dreamer, Roman and Eceni.As conflict erupts between the tribes and their brutal invaders, Boudica is forced to make a bold sacrifice. Cloaking her identity, she will travel directly into the stronghold of an enemy who longs for her crucifixion. What happens next—in a brutal drama of betrayal, heroism, and sacrifice—will leave Boudica with no options but to raise and arm every warrior, every dreamer, every tribe…and push the invader and its legions back into the sea.From the thundering hooves of the Eceni’s great horses to mystical spirit quests of young warriors, from the politics of an empire to the passions of lovers, Dreaming the Hound takes us on a breathtaking journey of the imagination—at once brutal, fantastical, and utterly unforgettable.MAGNIFICENT PRAISE FOR MANDA SCOTT’S BOUDICA SAGADreaming the Hound“Extraordinary.” — Independent , UK“Brilliantly imaginative.”— Colchester Evening Gazette , UK“Dramatic…Vivid…Lyrical.”— Yorkshire Evening Post , UK“One of Britain’s most famous legends…is retold here with extraordinary immediacy.”— Our Time , UK“Irresistible…an excellent read.”— Diva , UKDreaming the Bull“Enthralling…Mesmerising…Creates a living past of battle feats, betrayals, heart-breaking loyalties and cruelties.”— Publishing News , UK“Thrilling…Readers will be swept away.” — Booklist , starred reviewDreaming the Eagle“A powerful novel about one of the most intriguing and mysterious women in history…Alive with the love, deceit, wisdom and heroics of humanity. Read it and enjoy!”—Jean M. Auel“The new Mary Renault…Intensely exciting, a tale of passion, courage and heroism against huge odds.”— Publishing News, UK",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Fantasy",
    "Historical Fantasy",
    "British Literature",
    "Queer"
  ],
  "author": "Manda Scott",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/404828.Dreaming_the_Hound"
}