{
  "title": "One More Croissant for the Road",
  "description": "The nation’s ‘taster in chief’ cycles 2,300 km across France in search of the definitive versions of classic French dishes. A green bike drunkenly weaves its way up a cratered hill in the late-morning sun, the gears grinding painfully, like a pepper mill running on empty. The rider crouched on top in a rictus of pain has slowed to a gravity-defying crawl when, from somewhere nearby, the whine of a nasal engine breaks through her ragged breathing.A battered van appears behind her, the customary cigarette dangling from its driver’s-side window… as he passes, she casually reaches down for some water, smiling broadly in the manner of someone having almost too much fun. ‘No sweat,’ she says jauntily to his retreating exhaust pipe. ‘Pas de problème, monsieur.’ A land of glorious landscapes, and even more glorious food, France is a place built for cycling and for eating, too – a country large enough to give any journey an epic quality, but with a bakery on every corner. Here, you can go from beach to mountain, Atlantic to Mediterranean, polder to Pyrenees, and taste the difference every time you stop for lunch. If you make it to lunch, that is… Part travelogue, part food memoir, all love letter to France, One More Croissant for the Road follows ‘the nation’s taster in chief’ Felicity Cloake’s very own Tour de France, cycling 2,300km across France in search of culinary perfection; from Tarte Tatin to Cassoulet via Poule au Pot, and Tartiflette. Each of the 21 ‘stages’ concludes with Felicity putting this new found knowledge to good use in a fresh and definitive recipe for each dish – the culmination of her rigorous and thorough investigative work on behalf of all of our taste buds.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Food",
    "France",
    "Memoir",
    "Audiobook",
    "Cycling"
  ],
  "author": "Felicity Cloake",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/40492267-one-more-croissant-for-the-road"
}