{
  "title": "A Berry Cunning Conman",
  "description": "Welcome to Sarah’s Eatery, where the food is to-die-for!\nArmed with zero cooking skills but infinite tenacity, Kylie Berry fights tirelessly to learn the ins and outs of operating a restaurant—but when her cook Brenda takes a leave of absence, she’s left to manage the café kitchen alone.   \"Winters will have you giggling into your book!\"  Kylie pulls 12-hour shifts at Sarah’s Eatery and struggles to find time to eat, sleep, and most importantly, keep at her culinary studies. Café regulars and potential suitors Joel and Brad lend a hand, but when Joel finds himself embroiled in a murder investigation, it’s his turn to ask amateur mystery hound Kylie for help.  All the police can find of tipster Morgan Bleur is his hand—clutching a torn piece of Joel’s shirt! As Joel, Kylie, and her fiercely protective best friend Zoey Jin investigate the life and death of Morgan, they find a trail of romanced retirees and a man who lived to collect secrets for his own benefit.  Who stood to benefit from Morgan’s death? One of the many lonely blue-haired ladies he wrung for their clandestine gossip—and possibly for their pensions as well? Or one of the many whose lives were ruined by the tips he sold to the press for big bucks?  While Kylie hunts to clear Joel’s good name and shine a light on the truth, she’s still got a kitchen to run! Will she make it through the ordeal alive, or will exhaustion—or something more sinister—shut her eyes for good?   Praise for A.R. Winters:  \"The perfect balance of being lighthearted, but still a serious page-turning mystery.\" - Jaycie D, Amazon.com   \"A fun cozy mystery with engaging and entertaining characters\" - lq, Amazon.com  \"A cute light read with a final twist at the end.\" - Stacey Puleio, Amazon.com",
  "genres": [
    "Cozy Mystery",
    "Mystery",
    "Cozy"
  ],
  "author": "A.R. Winters",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/40459153-a-berry-cunning-conman"
}