{
  "title": "Frankie B - The Ghost Ship",
  "description": "She’s a jinxed witch with Bruce Lee moves. The coven's being haunted and witches are disappearing. Will she be able to save the coven and herself?  Not yet over the loss of her mom, Frankie B's in a new city, without family, a home or her full powers. Thank goodness for her familiar, Dex, the best Jack Russell in the world.  They're faced with moving into a flea-pit motel, when Dex spots a vacancy at a nearby marina. But this is no ordinary marina, and before they've even had time to finish unpacking, life takes a deadly turn.  Will Frankie solve the mystery of the missing witches and rid the coven of the ghost of Captain Russell Garnet? Or will her ability to make him corporeal see her stuck as his prisoner until her dying breath? Either way, she isn’t going down without a fight and with Zane her mysterious — but drop-dead gorgeous — neighbor helping her, how can she fail?  Frankie B and the Ghost Ship will have you longing to perform magic of your own and maybe even considering a few self-defense classes...  The perfect read for fans of A.A. Albright and Ani Gonzalez.  What others are saying  I really enjoyed this book, and I am looking forward to the next one. I loved the characters and the magic twists.  I like Frankie. She’s independent, feisty and has signed one hell of a lease. When her familiar, Dex, a spunky Fox Terrier, discovers a suspiciously cheap boat for rent in the marina, Frankie thinks it’s too good to be true... And it is. Sneaky witch, Gwen, pulls a fast one and locks Frankie into a magical lease with dire consequences if she does not fulfill the conditions. Supremely pissed, Frankie does not take this lying down, and I was cheering for her, Dex, and the mysterious Zane as they try to thwart Gwen, and not get Frankie dead. Fun, fast paced, with some interesting characters, this story had me until the end. Definitely reading the next book.  Really enjoyed this story, now binge reading the other books in the series.   In this series: #1 - The Ghost Ship #2 - The Blood Hex #3 - All Hallows Keep #4 - Faerie Lights #5 - Vampires and Valentines #6 - A Spell in Paradise  Coming 2019: #7 - The Curse of the Blue Moon #8 - Part-Time Mermaid #9 - House of Hoodoo",
  "genres": [
    "Paranormal",
    "Mystery",
    "Cozy Mystery",
    "Witches",
    "Fiction",
    "Fantasy",
    "Cozy"
  ],
  "author": "Andrene Low",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/40492360-frankie-b---the-ghost-ship"
}