{
  "title": "Captured",
  "description": "**Ebook ban due to content!** Ebook can be purchased in my website, or some wide platforms including scribd, smashwords, Eden Books, b&n, etc. Check out my social media to stay up to date on legitimate platforms selling my book and not pirated copies. Paperbacks are available on Amazon and Etsy! Love has never been enough within these wallsAlexzanderEvery day feels the same. Beaten down, conditioned to hurt others, and unable to feel anything resembling love. My existence is a hollow shell of what it could be, until I find her.The woman I capture turns my world upside down. She's unlike any victim I've taken before, and her will to survive leaves me intrigued. As I get to know her, I start to understand what's right and just how much of my life has been wrong. But I can't let her go, no matter how much I want to.Ophelia's become my obsession, and I know that I'll do anything to keep her with me. Our bond is twisted and complicated, built on a foundation of captivity and control. It's not healthy, but I can't help how I feel. She's mine, and I won't let anyone take her away from me.Trigger Warnings: All, honestly. But… Non con between mcs, heavy non con scenes/discussions/pasts, abuse, dateline level captivity, stockholm syndrome, mention of CA and CSA, Familial SA (side plot point), alcoholism/substance use, throat f*cking, skull f*cking (actually), a REPULSIVE brother captor, another female captive (minimal interaction, no cheating between MCs once FMC is taken), murder, cum jar, cum eating contest, suicide, trauma bonding, some stalking, making checkers WEIRD.**IF NEVER LET GO WAS TOO DARK FOR YOU, SKIP THIS!!*Captured is a dual POV dark horror romance standalone novel with an HEA",
  "genres": [
    "Dark Romance",
    "Dark",
    "Romance",
    "Horror",
    "Abuse",
    "Enemies To Lovers",
    "Forced Proximity"
  ],
  "author": "Lauren Biel",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/123195675-captured"
}