{
  "title": "Electric Impulse",
  "description": "At heart, Electric IMPULSE is a love story of two people from opposite sides of the wealth divide, finding one another. A powerful novel touching on prevalent issues within the black community, it brings to light the effect of the absence of one parent, it calls into question the definition of family, while highlighting socioeconomic disparities, racial discrimination and the journey one takes to discovering who they really are. At times it’s heartbreaking and complex, in the same vein as An American Marriage by Tayari Jones. And at other times, it’s sexy and intriguing, endearing and entertaining as the reader trails the inevitable ups and downs of the main characters’ relationships.\n\n\nELECTRIC IMPULSE invites you on a journey of self-discovery, immersing you in a tale of intense attraction, brazen passion and wild love.Aria Davenport is a girl with a plan. Meet the family. Graduate. Get engaged. And it's happily ever after. Unfortunately, her blissful dream of a life with her longtime boyfriend is cut short when she discovers his future plans don't include her. Adding injury to insult, he drops the news the day before graduation, in a very public way. Suddenly, life after college doesn't look so sweet.In walks Phoenix Prescott, a Forbes-celebrated real estate mogul. He just so happens to be a VIP, seated at one of her tables at Club Lotus. The moment he sees Aria, he can’t turn away. Her unassuming beauty and fiery personality make her a magnetic allure that Phoenix simply wants to possess. Their mutual attraction is explosive and undeniable. Their sexual chemistry overrides good sense. And they're both yearning for love. But, will the complications in both their lives, end it all before it's begun?\n\n*This book contains explicit adult scenes and sensitive subject matter. For a Mature Audience.",
  "genres": [
    "Romance"
  ],
  "author": "Angel Hilson",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/40495777-electric-impulse"
}