{
  "title": "Slippers And Thieves",
  "description": "***This legacy edition is now replaced by an extended version! Please search on Slippers And Thieves Special Edition or 9781945723841***Years ago, Elle — never call her Cinderella — escaped her evil step family in order to build a new life for herself in Manhattan. Today, Elle’s awful past is a distant memory. In fact, Elle even attends West Lake Prep, an exclusive high school where regular humans mix with members of the Magicorum, such as fairies, shifters and witches. Although she still must live in hiding from her evil step family, Elle always has found ways to get whatever her heart desires.That is, until Alec Le Charme. Sure, Alec is the heir to the Le Charme dynasty of high-end jewelers, but he's also kind, charismatic, and has a knee-melting smile. “Must-read YA paranormal romance!” - USA TodayLong story short, Elle has fallen for Alec, hard. Unfortunately, thanks to Elle’s evil step family, the Le Charme heir is absolutely off limits. In fact, if Elle and Alec so much as kiss, it will start a magical chain reaction that would end in powerful factions of witches and wizards going to war. As a result, Elle and Alec vow to stay friends, no matter what. Then West Lake Prep holds a masquerade ball. Identities get mixed up and forbidden kisses are finally shared.Time for the Magicorum to go to war, and for Elle to confront her hidden past in ways she never thought possible.“Mixes cherished fantasy classics with modern magic and moxie” – Foreword Fairy Tales of the Magicorum Series A series of modern fairy tales with sass, action and romance 1. Wolves And Roses1.5 Moonlight And Midtown2. Shifters And Glyphs3. Slippers And Thieves Also From Christina Bauer- Angelbound, the story of a part-demon girl who fights evil souls in Purgatory’s Arena- Dimension Drift, a dystopian adventure with science, snark and hot aliens- Fairy Tales of the Magicorum, a series of modern fairy tales with sass, action and romance- Beholder, where a medieval farm girl discovers necromancy and true loveDon’t Miss OutGet your FREE copy of Christina’s novella, BEVERLY HILLS VAMPIRE, when you sign up for her personal ***Not available in stores***",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Romance",
    "Fairy Tale Retellings",
    "Fairy Tales",
    "Fiction"
  ],
  "author": "Christina Bauer",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/40493454-slippers-and-thieves"
}