{
  "title": "Lies My Teacher Told Me: Everything Your American History Textbook Got Wrong",
  "description": "\"Every teacher, every student of history, every citizen should read this book. It is both a refreshing antidote to what has passed for history in our educational system and a one-volume education in itself.\"―Howard ZinnA new edition of the national bestseller and American Book Award winner, with a new preface by the author Since its first publication in 1995, Lies My Teacher Told Me has become one of the most important―and successful―history books of our time. Having sold nearly two million copies, the book also won an American Book Award and the Oliver Cromwell Cox Award for Distinguished Anti-Racist Scholarship and was heralded on the front page of the New York Times in the summer of 2006. For this new edition, Loewen has added a new preface that shows how inadequate history courses in high school help produce adult Americans who think Donald Trump can solve their problems, and calls out academic historians for abandoning the concept of truth in a misguided effort to be \"objective.\" What started out as a survey of the twelve leading American history textbooks has ended up being what the San Francisco Chronicle calls \"an extremely convincing plea for truth in education.\" In Lies My Teacher Told Me , James W. Loewen brings history alive in all its complexity and ambiguity. Beginning with pre-Columbian history and ranging over characters and events as diverse as Reconstruction, Helen Keller, the first Thanksgiving, the My Lai massacre, 9/11, and the Iraq War, Loewen offers an eye-opening critique of existing textbooks, and a wonderful retelling of American history as it should―and could―be taught to American students.",
  "genres": [
    "History",
    "Nonfiction",
    "Education",
    "Politics",
    "American History",
    "Historical",
    "Teaching"
  ],
  "author": "James W. Loewen",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/40535992-lies-my-teacher-told-me"
}