{
  "title": "90 Seconds to a Life You Love: How to Master Your Difficult Feelings to Cultivate Lasting Confidence, Resilience, and Authenticity",
  "description": "Learn how to manage your most difficult feelings and build the emotional strength you need to create the life of your dreams.​Sadness , shame , helplessness , anger , embarrassment , disappointment , frustration , and vulnerability . In 30 years as a practicing psychologist, Dr. Joan Rosenberg has found that what most often blocks people from success and feeling capable in life is the inability to experience, move through, and handle these 8 unpleasant feelings. Knowing how to deal with intense, overwhelming, or uncomfortable feelings is essential to building confidence, emotional strength, and resilience. Yet when we distract or disconnect from these feelings, we move away from confidence, health, and our desired pursuits, ultimately undermining our ability to fully realize our ambitions.Neuroscientists suggest that the biological lifespan of a feeling, often known first through bodily sensations, lasts approximately 90 seconds. Dr. Rosenberg teaches readers to be aware, consciously lean into, and balance these unpleasant emotions by riding one or more 90-second waves of the bodily sensations. By staying present to these 8 feelings, we cultivate the confidence that we can handle life's challenges and the deep sense we can pursue whatever we want.Combining more than three decades of clinical experience with aspects of clinical psychology, mindfulness, and neuroscience research, 90 Seconds to a Life You Love is a strategic and practical guide on building core emotional strength, reducing anxiety, and developing the confidence you need to create a life of your design -- a life you love.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Personal Development",
    "Health",
    "Mental Health"
  ],
  "author": "Joan I. Rosenberg",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/40537071-90-seconds-to-a-life-you-love"
}