{
  "title": "The Holy Bible, Douay-Rheims Version",
  "description": "The Catholic Holy Bible - Church Authorized Douay-Rheims / Rheims-Douai / D-R / Douai Bible (Kindle MasterLink Technology): Complete ... Testament (Bible for Kindle / Kindle Bible)OVERVIEWThe Definitive Roman Catholic Bible in English is the Douay-Rheims Bible. Also known as the Rheims–Douai Bible or Douai Bible, and abbreviated as D–R, the Douay-Rheims Version of the Holy Bible, is a direct English translation of what is still the authoritative Bible of the Catholic Church - the Latin Vulgate of St. Jerome (342-420). The Douay-Rheims Bible was fully revised by Catholic Bishop Richard Challoner Revision (Imprimatur 1899), and this revised version is regarded by many in the Catholic Church to be the best and most reliable translation of the Bible in the world. CONTENTSTHE OLD TESTAMENT(Douay)THE PENTATEUCH BOOKSGenesisExodusLeviticusNumbersDeuteronomyTHE HISTORICAL BOOKSJoshuaJudgesRuth1 Samuel2 Samuel1 Kings2 Kings1 Chronicles2 ChroniclesEzraNehemiahTobitJudithEsther1 Maccabees2 MaccabeesBOOKS OF WISDOM AND POETRYJobPsalmsProverbsEcclesiastesSong of SolomonWisdom of SolomonSirach (Ecclesiasticus)THE PROPHETICAL BOOKSIsaiahJeremiahLamentationsBaruchEzekielDanielHoseaJoelAmosObadiahJonahMicahNahumHabakkukZephaniahHaggaiZachariahMalachiTHE NEW TESTAMENT(Rheims)GOSPEL BOOKSSt. MatthewSt. Mark St. Luke St. John HISTORICAL BOOKThe Acts ofthe Apostles PAULINE AND OTHER LETTERSRomans1 Corinthians 2 Corinthians GalatiansEphesiansPhilippiansColossians1 Thessalonians2 Thessalonians1 Timothy2 TimothyTitusPhilemonHebrewsCATHOLIC LETTERSJames1 Peter2 Peter1 John2 John3 JohnJudeAPOCALYPSE BOOKThe Apocalypse of St. John: (Also known as the Book of Revelation.)AUTHORIZED FOR KINDLE WITH SPECIAL KINDLE ENABLED FEATURESThe Authorized Catholic Holy Bible for Kindle Edition offers reader special Kindle enabled features, including interactive table of contents, MasterLink(tm) Technology, text-to-speech capabilities which enable audiobook features, as well as words that can be looked up on the Kindle supplied built in dictionary.",
  "genres": [
    "Religion",
    "Catholic",
    "Reference",
    "Christianity",
    "Christian",
    "Theology",
    "Nonfiction"
  ],
  "author": "Douay-Rheims",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/10236757-the-holy-bible-douay-rheims-version"
}