{
  "title": "Sicken of the Calm",
  "description": "Joaquin would never forget the boy who came out in the middle of the school cafeteria when they were both fifteen. Would never forget his bright eyes and clenched fists, in defiance of the rest of the world. Ezra. His unapologetic bravery was something that would haunt Joaquin who, despite being the captain of his high school football team, was too reserved to come out before college, let alone approach the boy he admired from afar.Joaquin is in his third year at Fox Lake University when he sees Ezra again. Joaquin expects the distance between them to remain unbreeched, but Ezra, as brash and impetuous as he was in high school, crashes into his life. At first, it’s just a shared class project, but it doesn’t take long for things between them to heat up. Before Joaquin knows what’s happening, he’s squirming on a chair as Ezra watches him jerk off, those clear, intent eyes pinning him in place. This starts a friends-with-benefits relationship with the aim of exploring a submissive and Dominant dynamic in bed, dipping a toe in the BDSM world together. However, nothing is ever so simple. As their sexual relationship amps up, so does their friendship deepen, fed by those gentle moments after sex, underbelly-soft and vulnerable. As Joaquin gets to know Ezra better he realizes that his assumptions about who Ezra is, and even the assumptions he has made about himself, have to be challenged in order to break the cycles that may lead to their relationship breaking apart. [This story contains plenty of banter, a fuckbuddies-to-more romance, and light, exploratory BDSM themes revolving around Dom/sub dynamics and kinks such as orgasm delay, praise kink and mild bondage. Although part of a series, this story can be read as a standalone with its own HEA.] Preview“Do you want to hear what I was thinking about?” He asks, his voice going a little darker over the phone. I shift on the bed.“Yeah,” I say, trying to keep my voice flat and even.“I was thinking about sucking your dick,” he says, and I can’t help it – I laugh. “Well, if you’re gonna be like that…” he grumbles. “No, no, sorry,” I say, but I can’t stop chuckling. “It’s just…that was so cheesy,” I tease.“Dude, don’t you know me? I’m a connoisseur of cheese. Blue cheese. Gouda. Babybel.”“Ok, that last one-”“Sex cheese.”“Ew,” I laugh. “I thought we were talking about my dick,” I say, surprising myself a little. Usually, I’m only this bold with Iva. “Yeah, and then you laughed.”“I’m wearing my serious expression now, I swear,” I lie, biting down to keep my smile from growing. “You know, I used to think that “serious expression” was like your default expression but you have like…a whole dozen expressions, probably,” Ezra teases. “It’s almost like I’m not a cold, dead, robot.”“I know you’re joking but, damn, that’s hot,” Ezra says. I laugh, shaking my head.“There’s something wrong with you.”“We’ll be here all day if we start on that list,” he says. I want to protest, but he goes on. “So, your dick. How’s it doing?”“It was still there, the last time I checked.”“Maybe you should check again. Just to make sure.”“Pretty sure that’s unnecessary.”“This is going terribly, you know.”“What is this, exactly?”“Phone sex. This is phone sex.”“Sorry,” I laugh.“Don’t be – I don’t think the talk about cheese helped.”“You never know. Some people are probably into that.”“Well, if that’s what you like I can start calling you cheesecake in bed.”“Please don’t,” I laugh, even though thinking about a bed being involved in anything we do makes a rush go through me. Silence falls, comfortable and amused, but the more it goes on, the more it charges. “I really was thinking about you last night,” Ezra says, softer now, the mood shifting.“Yeah?” I say quietly.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "College",
    "New Adult"
  ],
  "author": "Marina Vivancos",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/40530748-sicken-of-the-calm"
}