{
  "title": "Claiming his Secret Baby",
  "description": "“Our marriage will be different. It isn’t a love match. We both know what we’re getting.” His words were like little stones landing against her sides. “Oh?” He angled his head thoughtfully. “We’re giving our son a family. You’re gaining true financial security. I’m gaining a wife on my arm and in my bed.” He shrugged. “It’s a perfect marriage of convenience.” A frisson of warning danced down her spine. The clinical assessment should have been reassuring. After all, boundaries were good, delineations were helpful. But there was danger everywhere. Danger in the way he spoke so casually of a loveless marriage, when she had already seen how easy it was to fall in love with him. But this was different. She knew who he was now, and what he was capable of. The stars had fallen from her eyes and she saw it all clearly. She wouldn’t love him again. And she’d never trust him with her heart; not for a billion pounds.     One night and a lifetime of consequences...   A wild weekend of passion with powerful Xavier Salbatore had broken impressionable young Ellie's heart. She'd loved him madly, but then she'd discovered he was engaged to be married and she'd run a mile!  A bad car accident robbed the ruthless Spanish billionaire of so much. With a failed marriage and the discovery that he'd cheated on his wife and fathered a son with his mistress, Xavier is determined to put his life back together - even if it means marrying the woman who hid their child from him. A woman he'll never forgive!  Ellie knows she needs to keep Xavier at arm's length to avoid being hurt. She vows she won't respond to him, but night by night he wears away her defences, leaving her as powerless and lost to him as ever before...  An emotional story of mistakes, betrayal and the high cost of forgiveness, CLAIMING HIS SECRET BABY is book three in The Evermore Series.",
  "genres": [
    "Second Chance",
    "Contemporary",
    "Romance",
    "Contemporary Romance",
    "Harlequin",
    "Second Chance Romance",
    "Childrens"
  ],
  "author": "Clare   Connelly",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/40526232-claiming-his-secret-baby"
}