{
  "title": "Love Your Enemies: How Decent People Can Save America from the Culture of Contempt",
  "description": "NATIONAL BESTSELLER To get ahead today, you have to be a jerk, right? Divisive politicians. Screaming heads on television. Angry campus activists. Twitter trolls. Today in America, there is an “outrage industrial complex” that prospers by setting American against American, creating a “culture of contempt”—the habit of seeing people who disagree with us not as merely incorrect, but as worthless and defective. Maybe, like more than nine out of ten Americans, you dislike it. But hey, either you play along, or you’ll be left behind, right? Wrong. In Love Your Enemies , social scientist and author of the #1  New York Times bestseller From Strength to Strength Arthur C. Brooks shows that abuse and outrage are not the right formula for lasting success. Brooks blends cutting-edge behavioral research, ancient wisdom, and a decade of experience leading one of America’s top policy think tanks in a work that offers a better way to lead based on bridging divides and mending relationships. Brooks’ prescriptions are unconventional. To bring America together, we shouldn’t try to agree more. There is no need for mushy moderation, because disagreement is the secret to excellence. Civility and tolerance shouldn’t be our goals, because they are hopelessly low standards. And our feelings toward our foes are irrelevant; what matters is how we choose to act. Love Your Enemies offers a clear strategy for victory for a new generation of leaders. It is a rallying cry for people hoping for a new era of American progress. Most of all, it is a roadmap to arrive at the happiness that comes when we choose to love one another, despite our differences.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Self Help",
    "Psychology",
    "Audiobook",
    "Philosophy",
    "Book Club"
  ],
  "author": "Arthur C. Brooks",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/40535689-love-your-enemies"
}