{
  "title": "Alice: All reaLity Is subjeCtivE (Psychological Thriller)",
  "description": "*** NYC Big Book Award - DISTINGUISHED FAVORITE! in \"LGBTQ+\" & \"World Literature\" categories - 2018 ***  The case of Alice is a gripping psychological thriller about freedom and self-discovery set in South Africa.  Alice, is caught in a stifling, imprisoned, life as a carer, which weighs heavily on her, until chance and fortune takes her to Camps Bay, South Africa. What starts out as a fleeting holiday visit to one of the most beautiful locations in the world soon spirals into a life-changing crisis and adventure in this unknown and perilous land. Very soon, there is so much more at stake than just making a new life in a new country — it is a matter of love, life and death.  Meanwhile, Toni and Lizbeth are struggling at their own personal crossroads. So, when presented with a missing person’s case that would take her away and give her some distance from her dilemma, Toni jumps at the opportunity. But, this is no ordinary case. Not everything is what it seems and Toni soon discovers that All reaLity Is subjeCtivE.   ** Although this is another P.I. Toni Mendez adventure, the individual novels can be enjoyed in any order. **   What readers have said about this book:  \"A beautiful, mesmerising, page-turner.\"  \"If you have never been to Cape Town, you will want to go after this.\"  \"I just love the multiple levels and dimensions to this story.\"  ”This book is two stories in one! Once you have read it and discovered the twist, it is worth rereading. Fantastic! “  \"A modern day 'Alice in wonderland'.\"     Questions to the Author:   1) Where is this story set? It straddles the beautiful picturesque seaside suburb of Camps Bay, Cape Town and the dusty bowl of Khayelitsha township on the Cape Flats in South Africa.  2) Which genre fiction does it fall into? It is a psychological drama with a twist but includes elements of quest, adventure, a strong female protagonist, a female sleuth and a lesbian romance.  3) Is it part of a series? It is not strictly a 'series' but more a fictional multi-verse, where the characters exist and participate across a number of different novels, often spanning a number of different genre stories.",
  "genres": [
    "Psychological Thriller"
  ],
  "author": "Sam Skyborne",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/40532812-alice"
}