{
  "title": "The Art of Dying Well: A Practical Guide to a Good End of Life",
  "description": "A reassuring and thoroughly researched guide to maintaining a high quality of life—from resilient old age to the first inklings of a serious illness to the final breath—by the New York Times bestselling author of Knocking on Heaven’s Door.The Art of Dying Well is about living as well as possible for as long as possible and adapting successfully to change. Packed with extraordinarily helpful insights and inspiring true stories, award-winning journalist and prominent end-of-life speaker Katy Butler shows how to thrive in later life (even when coping with a chronic medical condition), how to get the best from our health system, and how to make your own “good death” more likely. This handbook of step by step preparations—practical, communal, physical, and sometimes spiritual—will help you make the most of your remaining time, be it decades, years, or months.Butler explains how to successfully age in place, why to pick a younger doctor and how to have an honest conversation with her, when not to call 911, and how to make your death a sacred rite of passage rather than a medical event.This down-to-earth manual for living, aging, and dying with meaning and even joy is based on Butler’s own experience caring for aging parents, as well as hundreds of interviews with people who have successfully navigated a fragmented health system and helped their loved ones have good deaths. It also draws on interviews with nationally recognized experts in family medicine, palliative care, geriatrics, oncology, hospice, and other medical specialties. Inspired by the medieval death manual Ars Moriendi, or the Art of Dying , T he Art of Dying Well is the definitive update for our modern age, and illuminates the path to a better end of life.",
  "genres": [
    "Nonfiction",
    "Death",
    "Self Help",
    "Medical",
    "Psychology",
    "Health",
    "Philosophy"
  ],
  "author": "Katy Butler",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/40538694-the-art-of-dying-well"
}