{
  "title": "The Parting Glass",
  "description": "“ Downton Abbey meets Gangs of New York …a gem of a novel to be inhaled in one gulp” (Kate Quinn, New York Times bestselling author) about a devoted maid whose secretive world is about to be ripped apart at the seams—a lush and evocative debut set in 19th-century New York that’s perfect for fans of Sarah Waters’s Fingersmith and Emma Donoghue’s Slammerkin .By day, Mary Ballard is dutiful lady’s maid to Charlotte Walden, a wealthy and accomplished belle of New York City high society. But Charlotte would never trust Mary again if she knew the truth about her devoted servant’s past.On her nights off, Mary sheds her persona as prim and proper lady’s maid to reveal her true self—Irish exile Maire O’Farren. She finds release from her frustration in New York’s gritty underworld—in the arms of a prostitute and as drinking companion to a decidedly motley crew consisting of members of a dangerous secret society.Meanwhile, Charlotte has a secret of her own—she’s having an affair with a stable groom, unaware that her lover is actually Mary’s own brother. When the truth of both women’s double lives begins to unravel, Mary is left to face the consequences. Forced to choose between loyalty to her brother and loyalty to Charlotte, between society’s respect and true freedom, Mary finally learns that her fate lies in her hands alone.A captivating historical fiction of 19th century upstairs/downstairs New York City, The Parting Glass examines sexuality, race, and social class in ways that feel startlingly familiar and timely. A perfectly paced, romantically charged “story of the sumptuous world of the privileged and the precarious, difficult environs of the immigrant working poor is highlighted by vibrant characters and a well-paced plot, which will pull readers into the tangled tale” ( Publishers Weekly ).",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "LGBT",
    "Historical",
    "Mystery",
    "New York",
    "Adult"
  ],
  "author": "Gina Marie Guadagnino",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/40539137-the-parting-glass"
}