{
  "title": "The Art and Making of Dumbo",
  "description": "Tim Burton's latest motion picture, Dumbo, elegantly answers the question left at the end of Disney's animated film: What would the world do, if an elephant could fly?Burton is known for creating fantasy worlds, or fantastical real worlds, that are visually stunning and full of trademark characteristics: gothic sensibilities, spirals, stripes, bold colors, and elongated and exaggerated aesthetics. He populates them with unique and distinctive characters who are large-eyed and taper-limbed and often visibly different in some way. His films are quirky, humorous, emotional, and sympathetic to those who don't fit the definition of normal. Every single one is a celebration of individuality, and Burton's Dumbo is no exception.In The Art and Making of Dumbo, author and longtime Burton collaborator Leah Gallo, after first setting the stage with a thoughtful history on Disney's 1941 animated classic, shares a detailed account of how Burton and his talented team reimagined this tale into a magical new film. Through interviews with the cast and crew, a breathtaking collection of art and photography, and a stylish design by fellow Burton collaborator Holly Kempf, this book is an appreciation of the dozens of departments and thousands of people who overlapped, interacted, and collaborated to bring to life the story of a flying elephant and the humans who wanted to exploit him along with those who loved and helped him. Dumbo's story development, location scouting, casting, costuming, set design, special effects, music, and more are vividly presented here in a true celebration of heart and imagination.Searching for that perfect gift for the movie fan in your life? Explore more behind-the-scenes stories from Disney Editions:The Art of Mulan: A Disney Editions ClassicWalt Disney's Ultimate Inventor: The Genius of Ub IwerksOne Day at Disney: Meet the People Who Make the Magic Across the GlobeThe Art of Disney Costuming: Heroes, Villains, and Spaces BetweenThe Walt Disney Studios: A Lot to RememberThe Art and Making of The Lion KingPractically Poppins in Every Way: A Magical Carpetbag of Countless WondersFrom All of Us to All of You: The Disney Christmas CardYesterday's Tomorrow: Disney's Magical Mid-Century",
  "genres": [
    "Nonfiction"
  ],
  "author": "Leah Gallo",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/40537276-the-art-and-making-of-dumbo"
}