{
  "title": "The Storm (2)",
  "description": "THE THRILLING RE-TELLING OF ARTHURIAN LEGEND FROM MASTER OF SCIENCE FICTION AND FANTASY DAVID DRAKE CONTINUES! A young Champion must rescue a friend and battle an enemy at the heart of a chaotic world.The universe has shattered into chaos and monsters. Jon, the Leader, is dedicating his life to reuniting the scattered hamlets into a Commonwealth where all humans can live protected against the darkness and the things that live in that darkness.But no man can reshape the universe by himself. Jon has Makers to build weapons and clerks to handle the business of government—but he also needs Champions to face the powers of chaos, which will not listen to any argument but force.Lord Pal of Beune is one of those Champions. He has fought monsters and evil on behalf of Mankind, and he will fight them again. But now Guntram, the man who transformed Pal from an ignorant rube into a bulwark of the Commonwealth, has disappeared. Pal must locate his friend and mentor—and then he must battle an entity that may be at the core of the splintered universe!Pal of A humane man in a universe full of inhumanity.Pal of A strong man in a universe where some recognize only strength.Pal of A hero who will keep going until something stops him--and who hasn't been stopped yet!Praise for The “I finished The Storm last night. I loved it. It was such a sweet read. Pal is one of [Drake’s] best people, humane and strong and generous, and his voice carries the whole book.”—Cecelia Holland“Counterbalancing the setting’s strangeness, Pal himself is thoroughly levelheaded and decent, the kind of hero readers will enjoy rooting for. This is an enjoyable exploration of a pleasantly peculiar world.”— Publishers Weekly\"...a wonderful cast of characters in a fabulous world of courtiers, peasants, Beasts, and mysterious Envoys. Drake has imbued Arthurian legend with a convincing sf spin.\"— BooklistAbout prequel The Spark :\". . . entertaining tale combining the feel of Arthurian legend with nifty far-future super science . . .\"— Publishers Weekly“Drake retells Arthurian legend to perfect effect… efficient world building and likable characters.”— BooklistAbout David “Drake deftly weaves a web of political machinations and intrigue that vividly depicts the costs of war. Fans of Patrick O'Brian's Maturin and Aubrey novels will enjoy this intricate, rousing space opera.” — Publishers Weekly“[R]ousing old-fashioned space opera.”— Publishers Weekly“The fun is in the telling, and Mr. Drake has a strong voice. I want more!”— Philadelphia Weekly Press“[S]pace opera is alive and well. This series is getting better as the author goes along…character development combined with first-rate action and memorable world designs.”— SFReader.com“[P]rose as cold and hard as the metal alloy of a tank…rivals Crane and Remarque…”— Chicago Sun-Times“Drake couldn’t write a bad action scene at gunpoint.”— Booklist",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction"
  ],
  "author": "David Drake",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/40538902-the-storm-2"
}