{
  "title": "1637: The Polish Maelstrom",
  "description": "NEW SOLO NOVEL BY ERIC FLINT IN THE BEST-SELLING RING OF FIRE SERIES!The Ottoman Empire has captured Vienna and is now laying siege to the Austrian government-in-exile established in the city of Linz. Both the United States of Europe and the Kingdom of Bohemia have come to Austria’s assistance, but everyone knows this is going to be a long and brutal struggle. In order to relieve the pressure on the Austrians, General Mike Stearns proposes to open a second front in the Levant. The USE’s emperor Gustavus Adolphus gives his approval to the plan, and Mike sets it in motion, with the very capable assistance of his wife Rebecca Abrabanel, now the USE’s Secretary of State. Meanwhile, Poland is coming to a boil. Gretchen Richter, the newly elected chancellor of Saxony, has seized control of Lower Silesia. Her small army is now approached to form an alliance with the Polish revolutionaries who have seized power in the Ruthenian province of Galicia—which, in the universe the time-displaced Americans of Grantville came from, would have constituted the western Ukraine. Now, the Bohemians send an army led by Morris Roth into Poland, ostensibly to aid the revolutionaries but also with the goal of expanding King Albrecht Wallenstein’s growing empire in eastern Europe. And—the icing on the cake—Mike Stearns sends the Hangman Regiment of his Third Division under the command of Jeff Higgins to reinforce Jeff’s wife Gretchen in Silesia. The maelstrom in Poland grows… and grows… and grows…Will it drag all its displaced Americans and their allies down with it?About 1635: A Parcel of Rogues: \"The 20th volume in this popular, fast-paced alternative history series follows close on the heels of the events in The Baltic War, picking up with the protagonists in London, including sharpshooter Julie Sims. This time the 20th-century transplants are determined to prevent the rise of Oliver Cromwell and even have the support of King Charles.\"—Library JournalAbout 1634: The Galileo Affair: \"A rich, complex alternate history with great characters and vivid action. A great read and an excellent book.\"—David Drake \"Gripping . . . depicted with power!\"—Publishers WeeklyAbout Eric Flint's Ring of Fire series: “This alternate history series is . . . a landmark…”—Booklist “[Eric] Flint's 1632 universe seems to be inspiring a whole new crop of gifted alternate historians.”—Booklist “ . . . reads like a technothriller set in the age of the Medicis . . . ”—Publishers Weekly",
  "genres": [
    "Alternate History",
    "Fiction",
    "Science Fiction",
    "Time Travel",
    "Fantasy",
    "Military Fiction",
    "Historical Fiction"
  ],
  "author": "Eric Flint",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/40538880-1637"
}