{
  "title": "Our Bodies, Their Battlefields: War Through the Lives of Women",
  "description": "From Christina Lamb, the coauthor of the bestselling I Am Malala and an award-winning journalist—an essential, groundbreaking examination of how women experience war.In Our Bodies, Their Battlefields , longtime intrepid war correspondent Christina Lamb makes us witness to the lives of women in wartime. An award-winning war correspondent for twenty-five years (she’s never had a female editor) Lamb reports two wars—the “bang-bang” war and the story of how the people behind the lines live and survive. At the same time, since men usually act as the fighters, women are rarely interviewed about their experience of wartime, other than as grieving widows and mothers, though their experience is markedly different from that of the men involved in battle.Lamb chronicles extraordinary tragedy and challenges in the lives of women in wartime. And none is more devastating than the increase of the use of rape as a weapon of war. Visiting warzones including the Congo, Rwanda, Nigeria, Bosnia, and Iraq, and spending time with the Rohingya fleeing Myanmar, she records the harrowing stories of survivors, from Yazidi girls kept as sex slaves by ISIS fighters and the beekeeper risking his life to rescue them; to the thousands of schoolgirls abducted across northern Nigeria by Boko Haram, to the Congolese gynecologist who stitches up more rape victims than anyone on earth. Told as a journey, and structured by country, Our Bodies, Their Battlefields gives these women voice.We have made significant progress in international women’s rights, but across the world women are victimized by wartime atrocities that are rarely recorded, much less punished. The first ever prosecution for war rape was in 1997 and there have been remarkably few convictions since, as if rape doesn’t matter in the reckoning of war, only killing. Some courageous women in countries around the world are taking things in their own hands, hunting down the war criminals themselves, trying to trap them through Facebook.In this profoundly important book, Christina Lamb shines a light on some of the darkest parts of the human experience—so that we might find a new way forward. Our Bodies, Their Battlefields is as inspiring and empowering is as it is urgent, a clarion call for necessary change.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "History",
    "War",
    "Politics",
    "Womens",
    "Audiobook"
  ],
  "author": "Christina Lamb",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/40539112-our-bodies-their-battlefields"
}