{
  "title": "Today I Am Carey",
  "description": "REMARKABLE DEBUT NOVEL FROM CRITICALLY ACCLAIMED AUTHOR MARTIN L. SHOEMAKER. Shoemaker proves why he has consitently been praised as one of the best story writers in SF today with this touching, thoughtful, action-packed debut novel, based on his award-winning short story Today I am Paul.TODAY Mildred has Alzheimer's. As memories fade, she acquires the aid of a full-time android to assist her in everyday life. Carey. Carey takes care of Mildred, but its true mission is to fill in the gaps in Mildred’s past. To bring yesterday into today by becoming a copy. But not merely a copy of a physical person. A copy from the inside out. I AM After Mildred passes, Carey must find a new purpose. For a time, that purpose is Mildred’s family. To keep them safe from harm. To be of service. There is Paul Owens, the overworked scientist and business leader. Susan Owens, the dedicated teacher. And Millie, a curious little girl who will grow up alongside her android best friend. And Carey will grow up with her. Carey cannot age. But Carey can change. CAREY Carey struggles. Carey seeks to understand life’s challenges. Carey makes its own path. Carey must learn to live. To grow. To care. To survive. To be.Advance praise for Today I Am Carey:\"Kindness, love, and compassion make Carey an empathetic character through which to view Shoemaker's complex, beautiful world.\"—Publishers Weekly\"Martin Shoemaker proves conclusively that while a science fiction novel must have the trappings of science fiction, it is at its strongest when it is about people, even an artificial (but emotional) person named Carey.\"—Mike Resnick “A dazzling ride through the near future. I enjoyed it thoroughly. I’ve never seen anything remotely like it.”—Jack McDevitt “Martin Shoemaker is a rare writer who can handle the challenges of dealing with future technology while touching the human heart. This is a must-read!\"—David Farland, New York Times Best-selling Author  Praise for the work of Martin L. Shoemaker: \"Martin Shoemaker’s ‘Black Orbit’ is a more conventional Analog adventure, and a very good example of such . . . a really solid story.\" — Rich Horton, Locus Online \"['Bookmark'] is an exceptional example of how to discuss deep moral and philosophical issues while maintaining a tight narrative that brings the reader along. This story will be added to the required readings for my SF classes. – Robert L Turner III, Tangent Online",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Artificial Intelligence",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "Audiobook",
    "Relationships"
  ],
  "author": "Martin L. Shoemaker",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/40538890-today-i-am-carey"
}