{
  "title": "Final Season",
  "description": "When disaster strikes unexpectedly, Sephora finds that she needs answers. Her desires bring her right back to the time and place of the life-changing event. It happened during the summer after Sephora’s sophomore year of high school. She and her brother Isaiah had been making the most of their season passes to the Wild World theme park down the road. It was a summer of excitement and some bonding between two siblings who pretty much ignored each other at school during the past year. Then suddenly an all-important bolt gave way at an inopportune time during a ride they had been enjoying. Sephora woke in the hospital to discover that her injuries were minor compared to what others had been put through. Her life had changed in the blink of an eye and she wasn’t the slightest bit ready. She especially wasn’t ready for all those sympathetic glances and whispers from everyone when she returned to school at the start of her junior year. Something amazing happened however when she returned to the park toward the end of the season. She recalled that on the day of that life-changing event, an odd man had given her a “Lifetime Pass” shortly after they arrived in the park. That pass had now started giving her access to places and things that made no sense to her. Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Kepler Moon Alpha, and his newest acclaimed series The Ani Maxima Files. With over 250,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Hope Rising, One Crazy Summer, and Vestige by McElhaney. EDITORIAL  \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/40556286-final-season"
}