{
  "title": "Last Call for Liberty",
  "description": "The hour is critical. The American republic is suffering its gravest crisis since the Civil War. Conflicts, hostility, and incivility now threaten to tear the country apart. Competing visions have led to a dangerous moment of cultural self-destruction. This is no longer politics as usual, but an era of political warfare where our enemies are not foreign adversaries, but our fellow citizens. Yet the roots of the crisis are deeper than many realize. Os Guinness argues that we face a fundamental crisis of freedom, as America's genius for freedom has become her Achilles' heel. Our society's conflicts are rooted in two rival views of freedom, one embodied in \"1776\" and the ideals of the American Revolution, and the other in \"1789\" and the ideals of the French Revolution. Once again America has become a house divided, and Americans must make up their minds as to which freedom to follow. Will the constitutional republic be restored or replaced? This grand treatment of history, civics, and ethics in the Jewish and Christian traditions represents Guinness's definitive exploration of the prospects for human freedom today. He calls for a national conversation on the nature of freedom, and poses key questions for concerned citizens to consider as we face a critical chapter in the American story. He offers readers a checklist by which they can assess the character and consequences of the freedoms they are choosing. In the tradition of Alexis de Tocqueville, Guinness provides a visitor's careful observation of the American experiment. Discover here a stirring vision for faithful citizenship and renewed responsibility for not only the nation but also the watching world.",
  "genres": [
    "History",
    "Politics",
    "Philosophy",
    "Nonfiction",
    "Sociology",
    "Cultural",
    "American"
  ],
  "author": "Os Guinness",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/40574717-last-call-for-liberty"
}