{
  "title": "Paradigm Shift - Book 1",
  "description": "Imagine a world where women are called fems and have always been chattels with no rights at all. Not slaves, but pets, intelligent domestic animals. In the Britain of this parallel world, the only protection they have are the laws intended to prevent the mistreatment of pets, and the earnest efforts of the Royal Society for the Prevention of Cruelty to Fems (RSPCF). The concept of marriage has never existed in this world, except among some remote, primitive tribes.Imagine a world filled with obedient, loving, pet fems, taxicabs pulled by fems, naked extreme fem boxing and wrestling, and fems performing just about every imaginable service for the pleasure and convenience of men. Selectively bred and always beautiful, fems provide every possible kind of sexual pleasure. Like all domesticated animals, obedience and loyalty are valued traits, while viciousness and unpredictability are ruthlessly stamped out. Fems are strictly forbidden by law to ever cover their genitals with clothing, so that no fem can ever pose as a man.An uneasy balance exists between those who would treat fems as valuable, treasured creatures, like pedigree dogs or pure-bred horses, and those who would strip all protection from fems so that they can be ruthlessly exploited. Even the world's religions are split into factions on this matter.But suddenly things come to a head because of a horrible massacre of male children, with the finger of blame pointed at a group of feral women. Hardliners clamour for a mass cull of fems in the area and the removal of legal protection from all fems. Feelings grow so strong that a civil war seems possible and even the first World Wide War that this world has ever experienced.Parker Hammond is a man of our world, a divorced ex-police officer, who lost his career and his wife when his liking for sadistic sex was exposed by a muck-raking female journalist. He suddenly finds himself drawn into this alternate dimension and tasked to investigate the massacre. Follow Parker and his loyal pet fem Susan, as he fights to survive and find a new life in the world of Paradigm Shift.",
  "genres": [
    "Erotica",
    "Science Fiction",
    "BDSM"
  ],
  "author": "V.W. Singer",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/12320713-paradigm-shift---book-1"
}