{
  "title": "Seven Practices of a Mindful Leader: Lessons from Google and a Zen Monastery Kitchen",
  "description": "What would your work and your life look like if you knew how to stay focused yet flexible, if you got more of the right things done, and if you were helping to create a more peaceful world at the same time?“A mindful leader makes the work environment a generative social field in which compassion, connection, and creativity thrive. The seven accessible practices in this book can teach you how to become just such a leader.”— from the foreword by Daniel J. Siegel, MD , executive director of Mindsight InstituteToday’s leaders are grappling with the pace and complexity of change, the challenge of supporting healthy collaboration and alignment among teams, and the resulting stress and burnout. The practice of mindful leadership may be one of the most important competencies in business today if leaders are to move beyond fear, anxiety, nagging self-doubt, and the feeling of constant overwhelm.Marc Lesser has taught his proven seven-step method to leaders at Google, Genentech, SAP, Facebook, and dozens of other Fortune 500 companies for over twenty years and has distilled a lifetime of mindfulness and business experience into these chapters. This incredibly practical yet accessible book draws on Marc’s experience as a CEO of three companies, as cofounder of the world-renowned Search Inside Yourself (SIY) program within Google, and as a longtime Zen practitioner.The principles in this book can be applied to leadership at any level, providing readers with the tools they need to shift awareness, enhance communication, build trust, eliminate fear and self-doubt, and minimize unnecessary workplace drama.Embracing any one of the seven practices alone can be life-changing. When used together, they support a path of well-being, productivity, and positive influence.Practicing mindful leadership will allow you to achieve results — with more energy, clarity, meaning, and connection. Your intentions and actions will be more aligned. You will accomplish more with less wasted effort.After reading this book, you’ll understand why some of the world’s most successful companies routinely incorporate the Seven Practices of a Mindful Leader , integrating mindfulness, emotional intelligence, and business savvy to create great corporate cultures, and even a better world.",
  "genres": [
    "Leadership",
    "Nonfiction",
    "Business",
    "Psychology",
    "Self Help",
    "Buddhism",
    "Audiobook"
  ],
  "author": "Marc Lesser",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/40558014-seven-practices-of-a-mindful-leader"
}