{
  "title": "Why Can't I: Have a Cell Phone Yet?",
  "description": "Everyone has a phone. But my hand is all alone.Why can’t I have a phone yet?Why is it something I just can’t get?Why Can’t I, Have a Cell Phone Yet? Is a social story that portrays a young boy who struggles with  the fact his parents won’t allow him to have a cell phone like all the other kids. The boy meets several animals, including a dragon, a cat and an eagle on his journey. The animals help him realize that “maybe” it’s not the right time.  Join him on his “cell phone” journey.  What will the animals teach him?Technology is changing the way children socialize with others. The boom of social media has completely changed the way we view others and social interactions. Social skills in children need to develop in person face to face before they can develop in cyberspace. It is not uncommon to find a Facebook profile belonging to a six-year-old. Do six-year-olds really need social media? In my personal opinion, NO!Move over Dr. Seuss, Mary Lee Kendal is in town. During Mary Lee’s years as a teacher, she found the best way to teach was to be “entertaining without being entertainment.”  She saw how children and teens are extremely creative if you just give them a chance.  Kids learn in many different ways.  Some learn through reading, playing, singing, dancing, rhyming, or even drawing. They learn visually, and by writing poetry. They love to creatively express themselves and her classroom was one place they could do that.So how did she come up with the quirky Dr. Seuss type rhyming books? As a kid she loved to rhyme.  She was always encouraged to write, read, rhyme, play, act, sing, dance, and be as creative as possible by her parents.  She feels her books bring in many of the favorite ways to learn.   Her social stories are meant to be read together aloud with an adult or older sibling and a child bringing the bond between each other even closer.All of Mary Lee’s social stories are meant to educate in an entertaining way. \"If I can help one child feel a little bit better about whom they are; build self-confidence, increase self-esteem, help them realize they are not alone, and deal with peer pressure, then I have done what I have set out to do.\"Stay Tough Kids!Mary Lee KendalMaryLeeKendal.com",
  "genres": [],
  "author": "Mary Lee Kendal",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/40576983-why-can-t-i"
}