{
  "title": "Carnage",
  "description": "Carnage Whispers From the Bayou Book 1 Raised by a father who curses the day she was born, Carolena finds herself in the swamps of south Louisiana under the guise of overseeing her father’s investments. In truth, she is making every attempt to avoid forced marriage to any of the men he would have her shipped off to. She’s always believed that her husband would love her, would give his very life just to hold her; not be a man who would marry her to claim her father’s wealth. When she arrives in the deep-south, she catches the eye of a local backwoods family of brothers. The eldest, Bobby, decides that he is deserving of a step-up in life, takes her against her will to his hovel of a home at the edge of the swamps to be shared between himself and his brothers. Carolena — not the shrinking flower they think her to be, flees into the deepest, darkest, wildest portion of the swamps in an effort to escape the brothers and their plans for her. Death at the hands of the creatures in these wetlands is a better option, in her mind. Little does she know, she’s also caught the eye of the most dangerous creature there, one of legend — of nightmares. He’s watching her every move, admiring her bravery — and he’s decided he’s keeping her. Carnage is a Gargoyle. He’s also volatile, dangerous, unpredictable, and lonely. One evening minding his own business at the edge of the sanctuary he calls home, he spies a female. A human female, and she’s running headlong into his swamps, with no regard for her own safety. Then he sees the reason; three men, and they’re hot on her trail, torches in hand, hell bent on catching her before she can get away. He watches as they get closer and closer to her, easily following her trail. Carnage makes a snap decision that changes both their lives forever; he drops out of a tree right behind her, slaps one clawed hand over her mouth to keep her from screaming, wraps her in his huge arms and goes right back to the treetops. He shelters her while the men traverse the ground below, unable to determine why her trail disappeared. Carnage admires this little female — she was brave to run into the swamps alone. There are many creatures lying in wait for just such a meal. But she no longer has to worry about that, because now she’s his. He only hopes that she doesn’t fear him too much once she gets a good look at his blue-grey skin, his fangs and his horns. Because regardless of what she thinks, or the rules of his community — he’s not giving her up.",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Paranormal Romance",
    "Vampires",
    "Monsters",
    "Historical"
  ],
  "author": "Sandra R. Neeley",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/40576587-carnage"
}