{
  "title": "Chicken Soup for the Soul: Christmas Cheer: Stories about the Love, Inspiration, and Joy of Christmas",
  "description": "1. With a new contemporary cover design, a new interior layout, and up-to-date stories, this book will have fresh appeal to everyone looking for a great Christmas and holiday read.2. Books represent a new thematic experience, even for readers of past books, as Chicken Soup has tightened the content, and books contain only relevant stories. Out-of-date stories were eliminated.3. Each book contains 101 stories recompiled from dozens of past Chicken Soup titles.4. \"Our 101 Best Stories\" collection is an efficient way for new readers to obtain books covering Chicken Soup's most popular topics.5. Every books has a warm and moving foreward from Jack Canfield and Mark Victor Hansen explaining the company's rebirth and its return to 101 stories per book.6. Chicken Soup for the Soul earned the Guinness World Record for having the most books on the New York Times bestseller list at one time.7. Last year, USA Today named Chicken Soup for the Soul #5 on its list of 25 books that left a legacy over the past quarter century.Everyone loves Christmas and the holiday season. We love reuniting scattered family members, watching the wonder in the eyes of a child, and seeing the joy on the face of a gift giver. The rituals of the holiday season give a rhythm to the years and create a foundation for our family lives. We love the chance to gather with our communities at church, at school, and even at the mall, to share the special spirit of the season, brightening those long winter days.The first Chicken Soup for the Soup book was published in 1993, and became a publishing industry sensation, ultimately selling eight million copies. Since then, more than 150 Chicken Soup titles have been published, selling more than 100 million copies.Chicken Soup for the Soul has won dozens of awards over the past 15 years, and its founders, Jack Canfield and Mark Victor Hansen have become celebrity motivational speakers and authors.",
  "genres": [
    "Christmas",
    "Short Stories",
    "Inspirational",
    "Audiobook",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Jack Canfield",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/4055439-chicken-soup-for-the-soul"
}