{
  "title": "الحفيدة الأمريكية",
  "description": "نبذة النيل والفرات:\"لو كان الشجن رجلاً لما قتلته بل لدعوت له بطول العمر. كيف تمكن هذا الإحساس المختال أن يصقلني ويشذب نزقي الذي كان طبعاً فيّ؟ كيف صرت أرى الدنيا ومن فيها بلون آخر لا خبرة لي به، أجهل درجاته وتتلعثم في تفسيره كلماتي، بل تتعثر في الإقرار به عيناي؟ هل كنت مصابة بعمى الألوان؟ أم أنني كنت سليمة، ستة على ستة، وإن ما أراه الآن، على شاشة رؤيتي، هو اللون الغلط؟ حتى ضحكتي تغيرت. لم أعد أقهقه من قلبي كالسابق، كاشفة بلا خجل عن أسناني السفلية المعوجة التي وصفها كالفن بأنها تشبه مقهى شعبياً تشاجر رواده بالكراسي. كان كالفن، يومذاك، يقصد أن يغازلني. لكن الغزل ما عاد اليوم ، يناسبني. ومن يغازل امرأة تحمل مقبرة بين الضلوع؟ بائسة أنا. طاولة زينة مقلوبة، مشروخة المرآة. أضحك من قشرة القلب بإيجاز وبلا كثير حبور. ضحكة بلا دسم، \"دايت\"، مثل مشروب غازي بلا طعم. هل أضحك بالفعل أم أجاهد لكي تطلع مني ابتسامة وجيزة مكتوبة بـ\"الشورت هاند\"؟ كأنني أتقشف في المباهج المفترضة والمسرات الهاربة. أتستر على جوفي لئلا يفور ما فيه وينضح ويشي بالهزة التي حدثت لي منذ أن عدت من بغداد خرقة معصورة من خرق مسح البلاط. خرقة كاشي. هكذا عدت. وتخليت عن عادات كثيرة لازمتني منذ طفولتي. ولم أعد أنظر إلى ما يجري حولي مثل سلسلة متصلة من الأفلام الخام. كل فصل أعيشه هو فيلم يغريني بالبحث عن العنوان المناسب له. وأقوى أفلامي يمر أمام ناظري ولا أفلح في إيجاد عنوان يليق به. أراني على الشاشة قديسة مخذولة تحمل حاجياتها في كيس خاكي على الظهر، ترتدي خوذة صلبة وبسطالاً مترباً وتسير وراء جنود مهزومين يرفعون شارات النصر. أين رأيت مثل هذا المشهد من قبل؟ أليس هنا في العراق، أيضاً، في زمن ماضٍ وحياة أخرى؟ هل تتناسل الجيوش المهزومة على خصب هذه الأرض وبين هذين الرافدين؟ أقر بأنني عدت مقهورة، محملة بحصى الشجن وبحبتين من النومي الحلو، اشتهيتهما لأمي التي يبدو أنها اكتشقت نعمة الخذلان من قبلي، وبالتحديد منذ ذلك اليوم الذي سيقت فيه إلى الاحتفال الكبير في ديترويت لكي تؤدي قسم الولاء لأميركا وتنال بركة جنسيتها. دمعت عيناها وأنا أمد يدي لها بالثمرتين الصفراوين اللتين قطفتهما من حديقة البيت الكبير الذي أمضت شبابها فيه. أخذت النوميّتين بكلتا يديها وتنشّقتهما بعمق كأنها تشم مسبحة أبيها وحليب أمها وعمرها الماضي. حياة مغدورة تكورت في ليمونتين. لكني أحب شجني هذا وأستعذب نعومة حصاه وأنا أخوض بروحي العارية في ساقيته، ولا أرغب أن أطرح عبئه عن كاهلي. شجني الجميل الذي يشعرني بأنني لم أعد امرأة أميركية عادية بل إنسانة من منبع آخر، بعيد وموغل في القدم، تطوي اليد على جمرة حكاية تندر مثيلاتها.\".عندما تطيح بك رياح الزمن بعيداً عن الوطن تطوي أيامك على أمل العودة إليه، ويأخذك الشجن في دوامته ذارفاً دمع الوجد والإشتياق إلى ذاك الوطن الجريح. إنها قصة العراق وشعبه التي أجبرته الظروف على هجر جنسيتهم والركض لاهثين وراء الجنسية الأمريكية التي أبت السياسة الأمريكية إلا أن يدفع ثمنها العراق باهظاً.تأتي الرواية على لسان زينة، تلك الفتاة التي رمى بها القدر وبأسرتها في شوارع ديترويت، والتي حاولت إخراج عائلتها من مذلة العيش بتطوعها في الجيش الأميركي الذي قام بشن حرب ضد صدام أو بالأحرى ضد العراق وأبنائه. وتتوالى الأحداث وتنخرط زينة في الجيش الأميركي وتكون المفارقات وذلك عندما تصبح وكجندي أميركي في مواجهة مع أبناء شعبها. عندها يأخذها الشجن على أجنحته لتبدأ الحكاية.يمكنك تحميل الكتـاب من هنا:http://www.4shared.com/file/233694922...",
  "genres": [
    "Fiction",
    "Novels",
    "Historical Fiction",
    "Literature",
    "Audiobook",
    "War",
    "Asia"
  ],
  "author": "Inaam Kachachi",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/10237034"
}