{
  "title": "Lifeboat 12",
  "description": "“This page-turning true-life adventure is filled with rich and riveting details and a timeless understanding of the things that matter most.”—Dashka Slater, author of The 57 Bus “Brilliantly told in verse, readers will love Ken Sparks.” —Patricia Reilly Giff, two-time Newbery Honor winner “Lyrical, terrifying, and even at times funny. A richly detailed account of a little-known event in World War II.” —Kirkus Reviews “Middle grade Titanic fans, here’s your next read.” —BCCB “An edge-of-your seat survival tale.” —School Library Journal (starred review) A Junior Library Guild Selection The 2019 Golden Kite Middle Grade Fiction Award Winner A 2019 ALSC Notable Children’s Book The 2019–2020 Lectio Book Award Winner The 2020–2021 Florida Sunshine State Young Readers Award List The 2020 Oklahoma Library Association’s Children’s Sequoyah Book Award Winner The Connecticut Book Award Winner In the tradition of The War That Saved My Life and Stella By Starlight, this poignant novel in verse based on true events tells the story of a boy’s harrowing experience on a lifeboat after surviving a torpedo attack during World War II.With Nazis bombing London every night, it’s time for thirteen-year-old Ken to escape. He suspects his stepmother is glad to see him go, but his dad says he’s one of the lucky ones—one of ninety boys and girls to ship out aboard the SS City of Benares to safety in Canada. Life aboard the luxury ship is grand—nine-course meals, new friends, and a life far from the bombs, rations, and his stepmum’s glare. And after five days at sea, the ship’s officers announce that they’re out of danger. They’re wrong. Late that night, an explosion hurls Ken from his bunk. They’ve been hit. Torpedoed! The Benares is sinking fast. Terrified, Ken scrambles aboard Lifeboat 12 with five other boys. Will they get away? Will they survive? Award-winning author Susan Hood brings this little-known World War II story to life in a riveting novel of courage, hope, and compassion. Based on true events and real people, Lifeboat 12 is about believing in one another, knowing that only by banding together will we have any chance to survive.",
  "genres": [
    "Historical Fiction",
    "Middle Grade",
    "Poetry",
    "Survival",
    "Historical",
    "Adventure",
    "World War II"
  ],
  "author": "Susan Hood",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/40581920-lifeboat-12"
}