{
  "title": "The Lightness",
  "description": "A stylish, stunningly precise, and suspenseful meditation on adolescent desire, female friendship, and the female body that shimmers with rage, wit, and fierce longing—an audacious, darkly observant, and mordantly funny literary debut for fans of Emma Cline, Ottessa Moshfegh, and Jenny Offill.One year ago, the person Olivia adores most in the world, her father, left home for a meditation retreat in the mountains and never returned. Yearning to make sense of his shocking departure and to escape her overbearing mother—a woman as grounded as her father is mercurial—Olivia runs away from home and retraces his path to a place known as the Levitation Center.Once there, she enrolls in their summer program for troubled teens, which Olivia refers to as “Buddhist Boot Camp for Bad Girls”. Soon, she finds herself drawn into the company of a close-knit trio of girls determined to transcend their circumstances, by any means necessary. Led by the elusive and beautiful Serena, and her aloof, secretive acolytes, Janet and Laurel, the girls decide this is the summer they will finally achieve enlightenment—and learn to levitate, to defy the weight of their bodies, to experience ultimate lightness. But as desire and danger intertwine, and Olivia comes ever closer to discovering what a body—and a girl—is capable of, it becomes increasingly clear that this is an advanced and perilous practice, and there’s a chance not all of them will survive. Set over the course of one fateful summer that unfolds like a fever dream, The Lightness juxtaposes fairy tales with quantum physics, cognitive science with religious fervor, and the passions and obsessions of youth with all of these, to explore concepts as complex as faith and as simple as loving people—even though you don’t, and can’t, know them at all.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Dark Academia",
    "Mystery",
    "Adult",
    "Young Adult"
  ],
  "author": "Emily  Temple",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/40581591-the-lightness"
}