{
  "title": "Impeachment: An American History",
  "description": "Four experts on the American presidency review the only three impeachment cases from history--against Andrew Johnson, Richard Nixon, and Bill Clinton--and explore its power and meaning for today.Impeachment is rare, and for good reason. Designed to check tyrants or defend the nation from a commander-in-chief who refuses to do so, the process of impeachment outlined in the Constitution is what Thomas Jefferson called \"the most formidable weapon for the purpose of a dominant faction that was ever contrived.\" It nullifies the will of voters, the basic foundation of legitimacy for all representative democracies. Only three times has a president's conduct led to such political disarray as to warrant his potential removal from office, transforming a political crisis into a constitutional one. None has yet succeeded. Andrew Johnson was impeached in 1868 for failing to kowtow to congressional leaders--and in a large sense, for failing to be Abraham Lincoln--yet survived his Senate trial. Richard Nixon resigned in July of 1974 after the House Judiciary Committee approved three articles of impeachment for lying, obstructing justice, and employing his executive power for personal and political gain. Bill Clinton had an affair with a White House intern, but in 1999 faced trial in the Senate less for that prurient act than for lying under oath about it.In the first book to consider these three presidents alone, and the one thing they have in common, Jeffrey Engel, Jon Meacham, Timothy Naftali, and Peter Baker explain that the basis and process of impeachment is more political than it is a legal verdict. The Constitution states that the president, \"shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misdemeanors,\" leaving room for historical precedent and the temperament of the time to weigh heavily on each case. These three cases highlight factors beyond the president's behavior that impact the likelihood and outcome of an impeachment: the president's relationship with Congress, the power and resilience of the office itself, and the polarization of the moment. This is a realist, rather than hypothetical, view of impeachment that looks to history for clues about its future--with one obvious candidate in mind.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Presidents",
    "Audiobook",
    "Law"
  ],
  "author": "Jeffrey A. Engel",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/40588307-impeachment"
}