{
  "title": "Impeachment: An American History",
  "description": "Four experts on the American presidency examine the three times impeachment has been invoked—against Andrew Johnson, Richard Nixon, and Bill Clinton—and explain what it means today.Impeachment is a double-edged sword. Though it was designed to check tyrants, Thomas Jefferson also called impeachment “the most formidable weapon for the purpose of a dominant faction that was ever contrived.” On the one hand, it nullifies the will of voters, the basic foundation of all representative democracies. On the other, its absence from the Constitution would leave the country vulnerable to despotic leadership. It is rarely used, and with good reason.Only three times has a president’s conduct led to such political disarray as to warrant his potential removal from office, transforming a political crisis into a constitutional one. None has yet succeeded. Andrew Johnson was impeached in 1868 for failing to kowtow to congressional leaders—and, in a large sense, for failing to be Abraham Lincoln—yet survived his Senate trial. Richard Nixon resigned in August 1974 after the House Judiciary Committee approved three articles of impeachment against him for lying, obstructing justice, and employing his executive power for personal and political gain. Bill Clinton had an affair with a White House intern, but in 1999 he faced trial in the Senate less for that prurient act than for lying under oath about it.In the first book to consider these three presidents alone—and the one thing they have in common—Jeffrey A. Engel, Jon Meacham, Timothy Naftali, and Peter Baker explain that the basis and process of impeachment is more political than legal. The Constitution states that the president “shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misdemeanors,” leaving room for historical precedent and the temperament of the time to weigh heavily on each case. This book reveals the complicated motives behind each impeachment—never entirely limited to the question of a president’s guilt—and the risks to all sides. Each case depended on factors beyond the president’s his relationship with Congress, the polarization of the moment, and the power and resilience of the office itself. This is a realist view of impeachment that looks to history for clues about its potential use in the future.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Presidents",
    "Audiobook",
    "Law"
  ],
  "author": "Jeffrey A. Engel",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/40588302-impeachment"
}