{
  "title": "We Are Not Refugees: True Stories of the Displaced",
  "description": "Never in history have so many people been displaced by political and military conflicts at home—more than 65 million globally. Unsparing, outspoken, vital, We Are Not Refugees tells the stories of many of these displaced, who have not been given asylum.For over a decade, human rights journalist Agus Morales has journeyed to the sites of the world's most brutal conflicts and spoken to the victims of violence and displacement. To Syria, Afghanistan, Pakistan, and the Central African Republic. To Central America, the Congo, and the refugee camps of Jordan. To the Tibetan Parliament in exile in northern India.We are living in a time of massive global change, when negative images of refugees undermine the truth of their humiliation and suffering. By bringing us stories that reveal the individual pain and the global scope of the crisis, Morales reminds us of the truth and appeals to our conscience.\"With the keen eye and sharp pen of a reporter, Agus takes us around the world to meet mothers, fathers, [and] children displaced from their homes. Now, more than ever, this is a book that needed to be written and needs to be read.\"—Ali Noraani, Executive Director of the National Immigration Forum and author of There Goes the How Communities Overcome Prejudice and Meet the Challenge of American Immigration\"Morales notes [that] those who live on the margins are not even refugees, often seeking survival without the UNHCR, internally displaced people whose stories we need to hear, whose lives we need to remember. . . a must read.\"   —Dr. Westy Egmont, Professor, Director of the Immigrant Integration Lab, Boston College School of Social Work",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "War",
    "Spanish Literature",
    "Asia",
    "Reportage",
    "Politics"
  ],
  "author": "Agus Morales",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/40585273-we-are-not-refugees"
}