{
  "title": "A Crisis Wasted: Barack Obama's Defining Decisions",
  "description": "This book is the compelling story of the Obama domestic policy decisions which went wrong between September 2008 and his inauguration on January 20, 2009. Unlike all other presidents except Abraham Lincoln—who decided to fight the Civil War before he was sworn in—Barack Obama determined the fate of his presidency before he became president. The policy results ultimately led to the worst person Obama could have imagined taking his place eight years later.During these four months, Obama chose neoliberal policies for restoring the economy, reforming health care, addressing the housing market collapse, and moving to clean power.This book describes how these decisions were made. Obama found himself trapped by the Bush administration’s prioritization of bolstering wall street. Then he made Hillary Clinton’s economic advisors his own and took their counsel. Although the Great Recession could have been much worse, the neoliberal policies led to a drawn out and uneven recovery, unpopular and limited health care reform, and failed energy reform.Based on dozens of interviews with actors in the Obama transition, as well as the author’s personal observations, this book provides unique commentary on the fateful decisions of the winter of 2008-2009. Among those interviewed: David Axelrod, Tom Daschle, Austan Goolsbee, Peter Orszag, Christy Romer, and Larry Summers.The ramifications of the Great Recession are not behind us. The 2016 election has not ended. The same battle between progressivism and neoliberalism still rages in the Democratic Party. As many seek the Presidency in the November 2020 election, all candidates and of course the eventual winner will continue to face decisions similar to those confronted by Barack Obama.Everyone should learn from this critical and little-understood history.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Economics",
    "Finance",
    "The United States Of America",
    "American"
  ],
  "author": "Reed Hundt",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/40593449-a-crisis-wasted"
}