{
  "title": "Rebels: The Complete Series",
  "description": "This bundle includes His Rebel, Her Rebel, and our BRAND NEW story Secret Rebel.  Revisit your old favorites and discover our newest addition to the trio. This dystopian future is full of insta-love, alpha males, and lots of steam in between.  \nCome meet our newest Rebel and stare at this amazing cover. No judgment!\n  Book 1 - His Rebel   Sylvia is part of the rebel group looking to overthrow the Elites. When she’s hired to cause a scene on camera so the rest of the world can watch, she never expects her fist to connect with a man so sexy.  Brad Chalmers is a command leader for the Elites. He thinks his life is supposed to go in one direction until one day a hot little rebel knocks him on his ass. Then his world is turned upside down.  Warning: We don’t get caught up in the details of a dystopian future...so come for the insta-love and stay for the steamy parts! We won’t let you down!   Book 2 - Her Rebel  Minnie is a nurse trained to heal the people who hold her down, and she’s tired of doing nothing. She’s looking for a way to fight back peacefully, but a hulking slice of man has her distracted. He’s familiar and exactly like the man she’s dreamed of, but she needs to focus.  Owen is the leader of the rebels and doesn’t have time for anything else. Except finding the girl he lost long ago. She’s the one person who ever had his heart, and without her, his world will crumble. When he finally finds her again, he’s ready to show her exactly what he needs.  Warning: This dystopian romance doesn’t get caught up in the world around it. Instead, we focus on love and steamy goodness! Travel into the future where there are cherries to pop and babies to be made!  NEW! Book 3 - Secret Rebel  Naomi is known as The Librarian to the Insurgent group. She’s been passing information to the other side for a long time, trying to help when she can. But when a muscled man with dark hair and captivating eyes comes around asking questions, she finds herself all too willing to give up her secrets.  Ryan has been focused on finding his friend and staying under the radar. But the day he goes to question the person who last saw him alive, all of his plans change. Now he’s looking for a way out with her on his arm...and in his bed. There's no way he’s letting her getaway.  Warning: Who couldn’t fall in love with a librarian? All that access to books is enough to heat up the pages. Come roll around in our final book of the Rebel Series and see how their story ends.",
  "genres": [
    "Romance",
    "Novella",
    "Dystopia",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Short Stories"
  ],
  "author": "Alexa Riley",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/40579379-rebels"
}