{
  "title": "Manifesting on Purpose: A 3 Week Guide to Transforming Your Life Through the Law of Attraction",
  "description": "It's time to take manifesting off auto-pilot, get behind the wheel, and start steering your life in the direction you want it to go! Manifesting on Purpose clarifies why we manifest what we do, why we experience the same things over and over again, until we step in and weed out our own mental gardens. Ever wonder how is it that 2 people can start off with the same opportunity, and one will become a massive success, while the other barely scrapes by? What's the defining factor? What do successful people know that we're missing? We've been taught that the harder we work the more money, happiness, and success we'll have in life; but if this was the case successful people would constantly we run ragged, and be bleary eyed from lack of sleep, instead of enjoying lots of free time pursuing their heart's desires. So, what are we missing? The Law of Attraction is always working, even when we're not focused on it. The Law of Attraction states that, \"Like Attracts Like,\" we are all energy, so our thoughts get reflected back to us. Your thoughts create your physical reality. The problem? We're always thinking! Our thoughts, ungoverned, bounce around from idea to idea, and all too often, focus on the immediate problems in our lives, creating a feedback loop. Since we attract back what we think about, if we're focused on our problems, what's going to show up? More problems! Your mind is your most valuable asset. Your thoughts literally create your reality. Your current situation is a reflection of your previous thoughts. Most people, however, do not consciously decide what they want, their subconscious belief systems run everything on auto-pilot; making most people feel as if they are victims of their circumstances. YOU ARE NOT A VICTIM OF CIRCUMSTANCE! You are in the driver’s seat, you simply have to take control of the wheel! Take manifesting off auto-pilot, and create the life you want! \"But I think positive thoughts,\" you say. Your conscious thoughts will always be secondary to your subconscious thoughts in the way of manifestation. Until you change your core beliefs to line up with who you wish to become, and what you wish to do, you cannot break the old cycles. Are you ready to take control? Have abundance in money, love, health, freedom, experiences, and all other areas of your life? Then let's get started!",
  "genres": [],
  "author": "Amanda           Rose",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/40599375-manifesting-on-purpose"
}