{
  "title": "A Class Apart",
  "description": "SHORTLISTED FOR THE IRISH CAP AWARDS 2023'A beautifully written historical novel with characters who linger long after the last page is turned.' Hazel Gaynor, New York Times bestselling author of The Girl Who Came HomeSociety said they shouldn't fall in love...It’s 1828, and Ireland is in turmoil as Irish tenants protest against their upper-class English landlords.Nineteen-year-old Bridget Muldowney is thrilled to return to the estate in Carlow she’ll inherit when she comes of age. But since she left for Dublin seven years earlier, the tomboy has become a refined young lady, engaged to be married to a dashing English gentleman.Cormac McGovern, now a stable hand on the estate, has missed his childhood friend. He and Bridget had once been thick as thieves, running wild around the countryside together.When Bridget and Cormac meet again their friendship begins to rekindle, but it’s different now that they are adults. Bridget’s overbearing mother, determined to enforce the employer-servant boundaries, conspires with Bridget’s fiancé to keep the pair apart.With the odds stacked against them, can Bridget and Cormac’s childhood attachment blossom into something more?A Class Apart is the first book in Susie Murphy's historical fiction series A Matter of Class. The story continues in the second book, A Class Entwined.Praise for A Class Apart:'Susie Murphy writes with intelligence and assurance and has a real talent for capturing an authentic sense of time and place. I look forward to reading more from this bright new voice in historical fiction.' Hazel Gaynor, New York Times bestselling author of The Girl Who Came Home'I am completely blown away by this series...Simply outstanding.' Book Reviews for U, book reviewer'Excellent characters and an interesting plot...The chemistry and romance between the two was well written and believable.' The Lit Bitch, book reviewer'Romance, drama, suspense, and beautiful scenery reign supreme in A Class Apart...The story encompasses the real truths that the people in Ireland had to face in their time, weaving a heartrending tale that's impossible not to read.' Ashley O'Melia, author and freelance writer'A richly detailed, historical tale of love against all odds...As you read this story you will fall deeper and deeper into the history of Ireland at the time, into the characters themselves, and into the emotions that are so vividly described that you cannot help but be caught up in it all too.' Books Of All Kinds, book reviewer'For those of you who like Historical Fiction, you are in for a real treat...I devoured this book.' Coffee, Books and China Cups, book reviewerWhat readers are saying:★★★★★ 'The Irish Downton Abbey! Fabulous.'★★★★★ 'If it was possible to give 100 stars to this book, I would!'★★★★★ 'An absolute page turner.'★★★★★ 'I loved the book from start to finish.'★★★★★ 'A brilliant love story.'★★★★★ 'A hugely satisfying read.'★★★★★ 'Get ready to fall in love!'★★★★★ 'This is going to be a fantastic series of novels.'★★★★★ 'Superbly written.'★★★★★ 'I am already itching to read the next book in the series!'",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Historical Romance",
    "Romance",
    "Fiction",
    "Ireland",
    "Regency"
  ],
  "author": "Susie Murphy",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/40598338-a-class-apart"
}