{
  "title": "Late Bloomers: The Power of Patience in a World Obsessed with Early Achievement",
  "description": "A groundbreaking exploration of how finding one's way later in life can be an advantage to long-term achievement and happiness.\"What Yogi Berra observed about a baseball game--it ain't over till it's over--is true about life, and [Late Bloomers] is the ultimate proof of this. . . . It's a keeper.\"--ForbesWe live in a society where kids and parents are obsessed with early achievement, from getting perfect scores on SATs to getting into Ivy League colleges to landing an amazing job at Google or Facebook--or even better, creating a start-up with the potential to be the next Google or Facebook or Uber. We see software coders become millionaires or billionaires before age thirty and feel we are failing if we are not one of them.Late bloomers, on the other hand, are undervalued in popular culture by educators and employers, and even unwittingly by parents. Yet the fact is, a lot of us - most of us - do not explode out of the gates in life. We have to discover our passions and talents and gifts. That was true for author Rich Karlgaard, who had a mediocre academic career at Stanford (which he got into by a fluke) and, after graduating, worked as a dishwasher and nightwatchman before finally finding the inner motivation and drive that ultimately led him to start up a high-tech magazine in Silicon Valley, and eventually to become the publisher of Forbes magazine.There is a scientific explanation for why so many of us bloom later in life. The executive function of our brains doesn't mature until age twenty-five - and later for some. In fact, our brain's capabilities peak at different ages. We actually experience multiple periods of blooming in our lives. Moreover, late bloomers enjoy hidden strengths due to taking the time to discover their way in life - strengths coveted by many employers and partners, including curiosity, insight, compassion, resilience, and wisdom.Based on years of research, personal experience, interviews with neuroscientists, psychologists, and countless people at different stages of their careers, Late Bloomers reveals how and when we achieve our full potential, and why today's focus on early success is so misguided, and even harmful.Praise for Late Bloomers\"The underlying message that we should 'consider a kinder clock for human development' is a compelling one.\"--\nFinancial Times\n\"Late Bloomers spoke to me deeply as a parent of two millennials and as a coach to many new college grads (the children of my friends and associates). It's a bracing tonic for the anxiety they are swimming through, with a facts-based approach to help us all calm down.\"--Robin Wolaner, founder of Parenting magazine",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Business",
    "Parenting",
    "Education",
    "Personal Development"
  ],
  "author": "Rich Karlgaard",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/40597806-late-bloomers"
}