{
  "title": "A Woman of No Importance: The Untold Story of the American Spy Who Helped Win World War II",
  "description": "The never-before-told story of one woman's heroism that changed the course of the Second World War\nIn 1942, the Gestapo sent out an urgent transmission: \"She is the most dangerous of all Allied spies. We must find and destroy her.\"This spy was Virginia Hall, a young American woman--rejected from the foreign service because of her gender and her prosthetic leg--who talked her way into the spy organization deemed Churchill's \"ministry of ungentlemanly warfare,\" and, before the United States had even entered the war, became the first woman to deploy to occupied France.Virginia Hall was one of the greatest spies in American history, yet her story remains untold. Just as she did in Clementine, Sonia Purnell uncovers the captivating story of a powerful, influential, yet shockingly overlooked heroine of the Second World War. At a time when sending female secret agents into enemy territory was still strictly forbidden, Virginia Hall came to be known as the \"Madonna of the Resistance,\" coordinating a network of spies to blow up bridges, report on German troop movements, arrange equipment drops for Resistance agents, and recruit and train guerilla fighters. Even as her face covered WANTED posters throughout Europe, Virginia refused order after order to evacuate. She finally escaped with her life in a grueling hike over the Pyrenees into Spain, her cover blown, and her associates all imprisoned or executed. But, adamant that she had \"more lives to save,\" she dove back in as soon as she could, organizing forces to sabotage enemy lines and back up Allied forces landing on Normandy beaches. Told with Purnell's signature insight and novelistic flare, A Woman of No Importance is the breathtaking story of how one woman's fierce persistence helped win the war.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Book Club",
    "World War II",
    "Audiobook",
    "War"
  ],
  "author": "Sonia Purnell",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/40595446-a-woman-of-no-importance"
}