{
  "title": "The Serpent's Tale",
  "description": "Ariana Franklin combines the best of modern forensic thrillers with the drama of historical fiction in the enthralling second novel in the Mistress of the Art of Death series, featuring medieval heroine Adelia Aguilar. Rosamund Clifford, the mistress of King Henry II, has died an agonizing death by poison - and the king's estranged queen, Eleanor of Aquitaine, is the prime suspect. Henry suspects that Rosamund's murder is probably the first move in Eleanor's long-simmering plot to overthrow him. If Eleanor is guilty, the result could be civil war. The king must once again summon Adelia Aguilar, mistress of the art of death, to uncover the truth. Adelia is not happy to be called out of retirement. She has been living contentedly in the countryside, caring for her infant daughter, Allie. But Henry's summons cannot be ignored, and Adelia must again join forces with the king's trusted fixer, Rowley Picot, the Bishop of St. Albans, who is also her baby's father. Adelia and Rowley travel to the murdered courtesan's home, in a tower within a walled labyrinth - a strange and sinister place from the outside, but far more so on the inside, where a bizarre and gruesome discovery awaits them. But Adelia's investigation is cut short by the appearance of Rosamund's rival: Queen Eleanor. Adelia, Rowley, and the other members of her small party are taken captive by Eleanor's henchmen and held in the nunnery of Godstow, where Eleanor is holed up for the winter with her band of mercenaries, awaiting the right moment to launch their rebellion. Isolated and trapped inside the nunnery by the snow and cold, Adelia and Rowley watch as dead bodies begin piling up. Adelia knows that there may be more than one killer at work, and she must unveil their true identities before England is once again plunged into civil war . . .",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Medieval",
    "Crime"
  ],
  "author": "Ariana Franklin",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/1232140.The_Serpent_s_Tale"
}