{
  "title": "I Am Enough: Mark Your Mirror And Change Your Life",
  "description": "THREE WORDS THAT CAN CHANGE YOUR LIFEWhen you know that you are enough everyone around you will know that you are enough too. Your life will be so different and so much better when you can resonate your enoughness at a level that positively impacts your career, your relationships and your happiness levels.You can use the power of stating that you are enough, that you always have been and always will be, to achieve success in every key area of your life. When you say it, think it and believe it and make it an automatic and regular part of your life you can expect to see wonderful improvements in your relationships, in your career and in how you feel about yourself.This book is designed to help you massively increase your own sense of self-worth so that you like yourself, feel good about yourself and believe in yourself. Whilst becoming permanently free from self-sabotage and self-destructive thoughts and behaviors. When this happens you are able to live a happy, motivated and confident life, not just sometimes but all the time.I Am Enough has been written in a style that is designed to change you from the inside out. It changes you on a personal level using Marisa Peer’s proven techniques to make a deep and lasting impact on how you feel about you and how others feel about you.Marisa has been a leading therapist for over 30 years and has developed her own method of therapy called Rapid Transformational Therapy that has won numerous awards because of its effectiveness. Many of her most effective techniques and methods are contained within this book. The powerful wording and cutting-edge techniques inside this book, enable you to achieve powerful and recognizable results rapidly and permanently. Marisa is passionate about helping people to change using simple techniques that have powerful results and now you too can use them to change your life.",
  "genres": [],
  "author": "Peer Marisa",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/123214679-i-am-enough"
}