{
  "title": "The Invisible Bond: How to Break Free from Your Sexual Past",
  "description": "Get Untied from Your PastSex is like glue. Super human glue. Inside marriage, God designed it to be a bond that is powerful and unifying. Outside of marriage, the bonds of sex can be devastating. Long after the lover is gone, the bond we’ve created stays with us, negatively impacting our lives and future relationships. Now, through an impressive combination of Scripture and scientific research, Barbara Wilson shows how God designed us to be uniquely bonded through sex. But even more so, she concentrates on the tangible hope that is yours. This book will equip you not only to break those bonds, but to embrace a new, abandoned, wise, and thankful heart.You’ve had sex.But now sex has you.It’s a past that haunts the present. Sabotaged relationships, low self-esteem, sexual dysfunction, an empty spiritual life. Sex will bind you up and tie you down. Why? It’s just sex.But “just sex” means your body, soul, mind, and spirit have become one with another. Released from a past of her own, Barbara Wilson now combines scientific research with Scripture to offer striking new insights about what sexual bonding is, why it is harmful, and how to move freely into your future. Complete with a study guide for group or personal use, The Invisible Bond is your hands-on tool for changing not your past …but your life .“Barb’s honesty and vulnerability will inspire you to let God do in your life what He has done in hers, mine, and millions of other lives. He has set us free from self-defeating guilt and shame, helped us embrace our sexuality rather than fear it, and taught us how to enjoy genuinely healthy, intimate relationships. If that sounds appealing to you, then you hold the right book in your hands.”Shannon EthridgeBestselling author of the Every Woman’s Battle seriesStory Behind the BookAs abstinence director and educator for a Sacramento pregnancy center, Barbara Wilson talks to wounded and bleeding hearts every day. They’ve lost the war on sexual purity and the daily consequences are their reality. All they want is hope—hope that they can be free from the pain and shame that their past drags into their present and future. This book reveals the negative impact of sexual bonding and offers steps to freedom from past sexual and emotional bonds. But even more, it offers new direction for the free heart, and how to embrace an abandoned, overflowing life!",
  "genres": [
    "Christian",
    "Nonfiction"
  ],
  "author": "Barbara  Wilson",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/406151.The_Invisible_Bond"
}