{
  "title": "The Nay Slayer: A Hypnotic Suspense Thriller",
  "description": "The follow up to the debut thriller in The Swinger-Mercy series.A page-turning story chock-full of twists until the last page; The Nay Slayer is fueled with beautiful mystery and delights in the traditions of David Baldacci, Lee Child and Tom Clancy where a monstrous power struggle takes place. A high stakes game between good and evil plays throughout the story; Clear And Present Danger and Absolute Power meet Mission Impossible. Decades after Julian Mercy; a Dissident Party loyalist forever changed the beloved Thirty-Nine States of America; the new government began labeling all Dissidents thought to be associated with the Doomsday on Wednesday plot as R.A.T.S.Alana Basant is a correspondent for the Public Reporting Office; the state's news broadcasting agency. When she stumbles upon the most significant event in the Thirty-Nine's history, on New Year's Eve, she's forced to decide between giving the truth to her viewing public and her livelihood as a PRO journalist. But as she digs deeper into uncovering the mystery, it seems the enigmatic terrorist Julian Mercy might have left something just for her.After a terrible betray, Jerel Kingwood and his best friend Ron Livingston have become Demolishers; a unique duo of private contractor-agents whose singular purpose is to search and exterminate R.A.T.S. - REPUGNANT. AMORAL. They are TRAITORS of the STATE.The pair has a few fundamental obligations; all demolitions must appear caused by nature, and there must never be a body or DNA evidence left after a destruction; because all demolitions, though government-sanctioned, are illegal.And demolishers have a single test of loyalty...Ron's already passed his test of loyalty by committing an act Jerel still perceives as unthinkable, but will his be just as revolting?",
  "genres": [],
  "author": "Sean Bela",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/40607071-the-nay-slayer"
}