{
  "title": "Lonely Planet's Guide to Death, Grief and Rebirth",
  "description": "Lonely Planet explores over 30 customs around death, grief and rebirth in cultures and communities around the world and highlights some of the lessons we can all learn from them. With first-person narratives, locals tell the stories of their culture's customs in their own voices. Photography and illustration brings the fascinating pages to life. Through such topics as the tangihanga mourning tradition of New Zealand's Maori people, Irish wakes and the annual Day of the Dead across Mexico, this book explores what it means to mourn loved ones. It also covers some of the funeral traditions of communities around the world, including Tibetan sky burials, the cremation ghats of Varanasi, India, and Ghana's fantasy coffins. Special focus falls on thought-provoking places to visit, for example catacombs, magnificent cemeteries, and festivals of the dead, with details of how to travel and experience some of these customs.   Inside Lonely Planet's Guide to Death, Grief and - More than 30 in-depth accounts of customs around death, grief and rebirth, including spotlights on key aspects and details of how to witness some of the events- Special spreads on sites around the world to visit- Vibrant illustrations and photography to explain the customs in a respectful manner- First-person accounts of attending New Orleans' jazz funerals, the Day of the Dead and other occasions- Explanations of what insights and lessons readers may gain from some customs Lonely Planet's Guide to Death,Grief and Rebirth is a unique and illuminating book about the rituals and customs people around the world perform in order to come to terms with the inevitable loss of loved ones.    About Lonely Lonely Planet, a Red Ventures Company, is the world’s number one travel guidebook brand. Providing both inspiring and trustworthy information for every kind of traveller since 1973, Lonely Planet reaches hundreds of millions of travellers each year online and in print and helps them unlock amazing experiences. Visit us at lonelyplanet.com and join our community of followers on Facebook (facebook.com/lonelyplanet), Twitter (@lonelyplanet), Instagram (instagram.com/lonelyplanet), and TikTok (@lonelyplanet). 'Lonely Planet. It's on everyone's bookshelves; it's in every traveller's hands. It's on mobile phones. It's on the Internet. It's everywhere, and it's telling entire generations of people how to travel the world.' – Fairfax Media (Australia)",
  "genres": [
    "Nonfiction",
    "Grief",
    "Death",
    "Travel",
    "Cultural"
  ],
  "author": "Lonely Planet",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/123219674-lonely-planet-s-guide-to-death-grief-and-rebirth"
}