{
  "title": "Lost Children Archive",
  "description": "From the two-time NBCC Finalist, a fiercely imaginative novel about a family's summer road trip across America — a journey that, with breathtaking imagery, spare lyricism, and profound humanity, probes the nature of justice and equality in America today.A mother and father set out with their kids from New York to Arizona. In their used Volvo — and with their ten-year-old son trying out his new Polaroid camera — the family is heading for the Apacheria: the region the Apaches once called home, and where the ghosts of Geronimo and Cochise might still linger. The father, a sound documentarist, hopes to gather an \"inventory of echoes\" from this historic, mythic place. The mother, a radio journalist, becomes consumed by the news she hears on the car radio, about the thousands of children trying to reach America but getting stranded in the southern border, held in detention centers, or being sent back to their homelands, to an unknown fate. But as the family drives farther west — through Virginia to Tennessee, across Oklahoma and Texas — we sense they are on the brink of a crisis of their own. A fissure is growing between the parents, one the children can feel beneath their feet. They are led, inexorably, to a grand, unforgettable adventure — both in the harsh desert landscape, and within the chambers of their own imaginations.    Told through the voices of the mother, her son, as well as through a stunning tapestry of collected texts and images — including prior stories of migration and displacement — Lost Children Archive is a story of how we document our experiences, and how we remember the things that matter to us the most. Blending the personal and political with astonishing empathy, it is a powerful, wholly original work of fiction: exquisite, provocative, and deeply moving.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Book Club",
    "Audiobook",
    "Novels",
    "Travel"
  ],
  "author": "Valeria Luiselli",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/40624441-lost-children-archive"
}