{
  "title": "The Tree of Life: An Illustrated Study in Magic",
  "description": "Israel Regardie wrote The Tree of Life, a book many consider his magnum opus, in 1932. It has continued to sell for decades. And no wonder. Up until the time this book was published, very little information about true high magic was available to the public. In this book, Regardie reveals the secrets of real magic. He begins with an explanation of what magic is and, just as importantly, what magic is not. He explains that it is a spiritual study and practice which, along with forms of yoga, forms the two branches of the tree that is mysticism. Magic is not being a medium or a psychic. Then he explains the tools of the magician, what they mean, and how to use them. He explains the techniques of evocation and invocation, skrying, and astral travel. He shows how the Qabalah unites everything. He even gives a description of the secrets of sexual magick. All of this is in a clear, lucid writing style. This book is simply a must for anyone who is, or aspires to be, a real magician. Although Chic and Sandra Tabatha Cicero were friends of Regardie and are Senior Adepts of the Hermetic Order of the Golden Dawn, what changes could they have made to this classic book? Well, they did change the spelling from British style to American. And they did change his transliterations of Hebrew into the more popular style he used in his later books. But nothing vital was changed or removed. Everything else they added was complementary to the text that was there. And what incredible additions they are! Extensive annotations throughout every chapter; over 100 illustrations; more descriptive contents pages; a glossary, a bibliography and an index. They've even added a biographical note on Regardie and the importance of this book to him and to the occult world. This book contains some of the finest occult writing that has ever been produced. And with the new material by the Ciceros, it becomes a must-have for any magician!",
  "genres": [
    "Occult",
    "Magick",
    "Spirituality",
    "Nonfiction",
    "Magic",
    "Philosophy",
    "Religion"
  ],
  "author": "Israel Regardie",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/406212.The_Tree_of_Life"
}