{
  "title": "Black Dawn",
  "description": "War is coming, darker and more terrible than any that have come before. The Hegemony is coming to impose its brutal system of genetic supremacy on the Confederation and the other nations on the Rim, to make its elite Masters the unchallenged rulers of all human habitation in the galaxy. The White Fleet had been an expression of optimism, a grand expedition to explore the vast reaches of the long-dead empire. Tasked to uncover the secrets of the devastating Cataclysm and to seek and recover the advanced ancient technology that humanity had once possessed, it found something else instead. A new enemy. A vast domain, one with advanced technology, massive fleets, and a genetically-ordered society and hierarchy it intends to impose on all humanity everywhere. The Hegemony is like nothing Tyler Barron and his comrades have ever encountered…but the veteran admiral must find a way to fight the far superior enemy, to rally the Confederation’s forces, and those of the other Rim nations, for what may well be the final war. Barron understands his task is herculean, but what he doesn’t know is that the Confederation, far from being ready to face a new enemy, is embroiled in a widening scandal, one threatening to devolve into outright civil war, as the fleets and troops needed to face the enemy square off against each other. Barron and his people will do all they can to prevent the Confederation from slipping into oblivion, and to prepare it to face the new enemy that is coming. They have placed themselves in the breach before, saved the Confederation from disaster more than once, but this will be their greatest test, a struggle like none of them have ever experienced. This time the goal is not victory. It is survival.  Blood on the Stars Series  1 - Duel in the Dark 2- Call to Arms 3 - Ruins of Empire 4 - Echoes of Glory 5 - Cauldron of Fire 6 - Dauntless 7 - The White Fleet 8 - Black Dawn 9 - Invasion (coming)",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Space",
    "Military Fiction",
    "Audiobook"
  ],
  "author": "Jay Allan",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/40636308-black-dawn"
}