{
  "title": "El Norte: The Epic and Forgotten Story of Hispanic North America",
  "description": "Because of our shared English language, as well as the celebrated origin tales of the Mayflower and the rebellion of the British colonies, the United States has prized its Anglo heritage above all others. However, as Carrie Gibson explains with great depth and clarity in El Norte, the nation has much older Spanish roots—ones that have long been unacknowledged or marginalized. The Hispanic past of the United States predates the arrival of the Pilgrims by a century, and has been every bit as important in shaping the nation as it exists today.El Norte chronicles the sweeping and dramatic history of Hispanic North America from the arrival of the Spanish in the early 16th century to the present—from Ponce de Leon’s initial landing in Florida in 1513 to Spanish control of the vast Louisiana territory in 1762 to the Mexican-American War in 1846 and up to the more recent tragedy of post-hurricane Puerto Rico and the ongoing border acrimony with Mexico. Interwoven in this stirring narrative of events and people are cultural issues that have been there from the start but which are unresolved to this day: language, belonging, community, race, and nationality. Seeing them play out over centuries provides vital perspective at a time when it is urgently needed.In 1883, Walt Whitman meditated on his country’s Spanish past: “We Americans have yet to really learn our own antecedents, and sort them, to unify them,” predicting that “to that composite American identity of the future, Spanish character will supply some of the most needed parts.” That future is here, and El Norte, a stirring and eventful history in its own right, will make a powerful impact on our national understanding.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "The United States Of America",
    "Sociology",
    "Politics",
    "United States"
  ],
  "author": "Carrie Gibson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/40626923-el-norte"
}