{
  "title": "Wartime Military Records on Comfort Women: Information War against Korea, United States, and Japan",
  "description": "The Japanese military is accused of abducting 200,000 women, mostly from Korea, and using them as sex slaves. WWII military records provide a completely different perspective. This is a compilation of primary source documents, mostly WWII military records of U.S., Allied, Dutch, Australian and Japanese reports and documents related to comfort women. It also includes and analysis of a diary of a Korean comfort station operator. It provides a true description of the comfort women system based on primary source documents. Archie Miyamoto is a retired U.S. Army infantry officer who spent 29 years on active duty. He served two combat tours in the Korean war and two tours in Vietnam. On his first tour in Vietnam, he commanded a helicopter gunship platoon and was wounded twice. On his second, he served as a U.S. liaison officer to the armored cavalry regiment of the Korean Tiger Division. He served two tours as a military advisor to the Chinese military on Taiwan. On his first tour he introduced helicopters into the Chinese Army, acquiring fifty helicopters from U.S. Army excess inventory. On his second tour in Taiwan, he was the joint operations training advisor to their Ministry of Defense. On his last overseas tour, he served as the joint defense planning coordinator between the armed forces of Japan and the U.S. On his first tour in Japan as lieutenant, he was a platoon leader in the famous 187th Airborne Regimental Combat Team. He has also served in Germany. After retirement from the military spent over two years in the Middle East as a project manager for a U.S. firm. After returning to the U.S., he was asked to join a Japanese corporation in Los Angeles. A few years ago, he retired as its president/chairman, and remained in the capacity of a consultant until last year. He is now completely retired and resides in Los Angeles.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Archie Miyamoto",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/40627959-wartime-military-records-on-comfort-women"
}