{
  "title": "Europe: A Natural History",
  "description": "From internationally bestselling author and celebrated scientist Tim Flannery, a history of Europe unlike any before: an ecological account of the land itself and the forces shaping life on it. In Europe: A Natural History, world-renowned scientist, explorer, and conservationist Tim Flannery applies the eloquent interdisciplinary approach he used in his ecological histories of Australia and North America to the story of Europe. He begins 100 million years ago, when the continents of Asia, North America, and Africa interacted to create an island archipelago that would later become the Europe we know today. It was on these ancient tropical lands that the first distinctly European organisms evolved. Flannery teaches us about Europe's midwife toad, which has endured since the continent's beginning, while elephants, crocodiles, and giant sharks have come and gone. He explores the monumental changes wrought by the devastating comet strike and shows how rapid atmospheric shifts transformed the European archipelago into a single landmass during the Eocene.As the story moves through millions of years of evolutionary history, Flannery eventually turns to our own species, describing the immense impact humans had on the continent's flora and fauna--within 30,000 years of our arrival in Europe, the woolly rhino, the cave bear, and the giant elk, among others, would disappear completely. The story continues right up to the present, as Flannery describes Europe's leading role in wildlife restoration, and then looks ahead to ponder the continent's future: with advancements in gene editing technology, European scientists are working to recreate some of the continent's lost creatures, such as the great ox of Europe's primeval forests and even the woolly mammoth.Written with Flannery's characteristic combination of elegant prose and scientific expertise, Europe: A Natural History narrates the dramatic natural history and dynamic evolution of one of the most influential places on Earth.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Nature",
    "Natural History",
    "Environment",
    "European History"
  ],
  "author": "Tim Flannery",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/40642341-europe"
}