{
  "title": "Henry VIII: And the Men Who Made Him",
  "description": "Henry VIII is best known in history for his tempestuous marriages and the fates of his six wives. However, as acclaimed historian Tracy Borman makes clear in her illuminating new chronicle of Henry's life, his reign and reputation were hugely influenced by the men who surrounded and interacted with him as companions and confidants, servants and ministers, and occasionally as rivals--many of whom have been underplayed in previous biographies. These relationships offer a fresh, often surprising perspective on the legendary king, revealing the contradictions in his beliefs, behavior, and character in a nuanced light. They show him capable of fierce but seldom abiding loyalty, of raising men up only to destroy them later. He loved to be attended by boisterous young men, the likes of his intimate friend Charles Brandon, who shared his passion for sport, but could also be diverted by men of intellect, culture, and wit, as his longstanding interplay with Cardinal Wolsey and his reluctant abandonment of Thomas More attest. Eager to escape the shadow of his father, Henry VII, he was often trusting and easily led by male attendants and advisors early in his reign (his coronation was just shy of his 18th birthday in 1509); in time, though, he matured into a profoundly suspicious and paranoid king whose ruthlessness would be ever more apparent, as Thomas Howard, Duke of Norfolk and uncle to two of Henry's wives, discovered to his great discomfort, and as Eustace Chapuys, the ambassador of Charles V of Spain, often reported.Recounting the great Tudor's life and signal moments through the lens of his male relationships, Tracy Borman's new biography reveals Henry's personality in all its multi-faceted, contradictory glory, and sheds fresh light on his reign for anyone fascinated by the Tudor era and its legacy.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "British Literature",
    "Historical",
    "Adult"
  ],
  "author": "Tracy Borman",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/40642324-henry-viii"
}