{
  "title": "True Refuge: Finding Peace and Freedom in Your Own Awakened Heart",
  "description": "How do you cope when facing life-threatening illness, family conflict, faltering relationships, old trauma, obsessive thinking, overwhelming emotion, or inevitable loss? If you’re like most people, chances are you react with fear and confusion, falling back on timeworn strategies: anger, self-judgment, and addictive behaviors. Though these old, conditioned attempts to control our life may offer fleeting relief, ultimately they leave us feeling isolated and mired in pain.   There is another way. Beneath the turbulence of our thoughts and emotions exists a profound stillness, a silent awareness capable of limitless love. Tara Brach, author of the award-winning Radical Acceptance, calls this awareness our true refuge, because it is available to every one of us, at any moment, no exceptions. In this book, Brach offers a practical guide to finding our inner sanctuary of peace and wisdom in the midst of difficulty.   Based on a fresh interpretation of the three classic Buddhist gateways to freedom—truth, love, and awareness—True Refuge shows us the way not just to heal our suffering, but also to cultivate our capacity for genuine happiness. Through spiritual teachings, guided meditations, and inspirational stories of people who discovered loving presence during times of great struggle, Brach invites us to connect more deeply with our own inner life, one another, and the world around us. True Refuge is essential reading for anyone encountering hardship or crisis, anyone dedicated to a path of spiritual awakening. The book reminds us of our own innate intelligence and goodness, making possible an enduring trust in ourselves and our lives. We realize that what we seek is within us, and regardless of circumstances, “there is always a way to take refuge in a healing and liberating presence.”Advance praise for True Refuge   “Tara Brach writes from the heart to the heart. With candor and calmness, she shares her own and others’ struggles to overcome our deep and constant human dilemmas. Whenever I read Brach, I feel more peaceful and hopeful. I trust myself and the universe more. I feel more connected and grounded in what the Lakota Sioux call Wakan Tanka, The Great Mystery. True Refuge is itself a refuge and I thank the author for it.”—Mary Pipher, Ph.D., New York Times bestselling author of The Green Boat and Reviving Ophelia   “There is something very special about this exquisitely written book—its clarity, beauty, simplicity, and humanity practically sing to you. Inspiring and uplifting to read, it also has eminently practical, implementable, step-by-step guidance to practice and live by. And the fifteen brief, powerful guided meditations offer an easy, gentle entry toward inner peace and wisdom. While turning the pages, I thought of a half dozen people who could really use this book as a friendly, loving reference point—myself included!”—Belleruth Naparstek, author of Invisible Heroes and creator of the Health Journeys guided imagery audio series",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Buddhism",
    "Self Help",
    "Psychology",
    "Mental Health",
    "Philosophy"
  ],
  "author": "Tara Brach",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/40651734-true-refuge"
}