{
  "title": "The Wrong End of the Table: A Mostly Comic Memoir of a Muslim Arab American Woman Just Trying to Fit in",
  "description": "An Immigrant Love-Hate Story of What it Means to Be American . \"A rare voice that is both relatable and unafraid to examine the complexities of her American identity. ” —Reza Aslan, #1 New York Times bestselling author of The Life and Times of Jesus of NazarethYou know that feeling of being at the wrong end of the table? Like you’re at a party but all the good stuff is happening out of earshot (#FOMO)? That’s life—especially for an immigrant.What happens when a shy, awkward Arab girl with a weird name and an unfortunate propensity toward facial hair is uprooted from her comfortable (albeit fascist-regimed) homeland of Iraq and thrust into the cold, alien town of Columbus, Ohio—with its Egg McMuffins, Barbie dolls, and kids playing doctor everywhere you turned?This is Ayser Salman’s story. First comes Emigration, then Naturalization, and finally Assimilation—trying to fit in among her blonde-haired, blue-eyed counterparts, and always feeling left out. On her journey to Americanhood, Ayser sees more naked butts at pre-kindergarten daycare that she would like, breaks one of her parents’ rules (“Thou shalt not participate as an actor in the school musical where a male cast member rests his head in thy lap”), and other things good Muslim Arab girls are not supposed to do. And, after the 9/11 attacks, she experiences the isolation of being a Muslim in her own country. It takes hours of therapy, fifty-five rounds of electrolysis, and some ill-advised romantic dalliances for Ayser to grow into a modern Arab American woman who embraces her cultural differences.Part memoir and part how-not-to guide, The Wrong End of the Table is everything you wanted to know about Arabs but were afraid to ask, with chapters such as “Tattoos and Other National Security Risks,” “You Can’t Blame Everything on Your Period; Sometimes You’re Going to Be a Crazy and Other Advice from Mom,” and even an open letter to Trump. This is the story of every American outsider on a path to find themselves in a country of beautiful diversity.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Humor",
    "Biography",
    "Biography Memoir",
    "Book Club",
    "Comedy"
  ],
  "author": "Ayser Salman",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/40645426-the-wrong-end-of-the-table"
}