{
  "title": "Meet Me in Monaco",
  "description": "You are invited to attend the wedding of the century...Sophie Duval of Grasse, France is a pragmatic young woman and highly respected parfumeur, whom many of the rich and famous of the Riviera have entrusted with the job of creating the perfect scent for them. As the Cannes Film Festival kicks off its ninth year, Sophie prepares to spend the tourist season on the Riviera where the wealthy will grace her shop with their presence, carrying their heavy purses along with them.  However, her summer plans change after one last, very familiar customer slips inside her Cannes boutique. With her blond hair tucked beneath a silk headscarf, the fine nose and large black sunglasses, the porcelain complexion, it’s impossible to not recognize her. It’s America’s darling, Grace Kelly. Miss Kelly, however, hasn’t come in for perfume, but to escape a photographer, hot on her trail. Just as Sophie hides Miss Kelly away in the back of the boutique, the photographer runs into the shop, camera tucked against his chest.Struggling British press photographer, James Henderson, has arrived in Cannes to work the illustrious Film Festival. But in a twist of fate, he spots Grace Kelly strolling casually through a secluded arcade of shops. Seeing an opportunity to get the shot nobody else will have, James follows Miss Kelly into a small perfume boutique. But Grace Kelly is nowhere to be found and the shop owner won’t give anything away. In spite of a brief and fractious exchange, Sophie can’t forget about the handsome photographer, James can’t forget the lovely parfumeur, and Grace Kelly can’t forget about Sophie’s kindness. From that moment on, the fates of Sophie, James, and a Hollywood icon are linked together in a story that will span three decades, tragedy, and love.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "France",
    "Audiobook",
    "Book Club"
  ],
  "author": "Hazel Gaynor",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/40651658-meet-me-in-monaco"
}