{
  "title": "History, Myths, and Sacred Formulas of the Cherokees",
  "description": "Originally published as two separate volumes by the U.S. Bureau of Ethnology, James Mooney's History, Myths, and Sacred Formulas of the Cherokees has enduring significance for both Native Americans and non-Indian people. The book contains the full texts of James Mooney's Myths of the Cherokee (1900) and The Sacred Formulas of the Cherokees (1891), with an exclusive biographical introduction by George Ellison, James Mooney and the Eastern Cherokees. Mooney's exhaustive research preserved essential Cherokee history, lore, and rituals in a time when such knowledge was dying because younger Cherokees were accepting Western education, commerce, and medicine. The first section of this text covers Cherokee history from the time of DeSoto's search for gold in the 1600s to the late 1800s when the tribal consciousness nearly came to an end. The second section reveals the rich Cherokee mythology, detailing how the earth was made, how all \"people\" (both two-and four-footed) came about, and how they could all converse with each other. The third section of the book provides 28 sacred formulas from a mass of over 600 prayers, formulas, and songs. These formulas are centered on such things as medicine, hunting, love, finding lost articles, and frightening away storms. Exclusive to this edition, George Ellison's biographical portrait of James Mooney emphasizes the ethnologist's timeliness and his empathy for the Cherokees and their rich heritage. Completing this book are photographs of many of the chiefs and shamans, a glossary of terms, an index, and an immense section on notes and parallels to the Cherokee myths.",
  "genres": [
    "History",
    "Mythology",
    "Nonfiction",
    "Native American",
    "Native Americans",
    "Indigenous",
    "Religion"
  ],
  "author": "James Mooney",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/406484.History_Myths_and_Sacred_Formulas_of_the_Cherokees"
}