{
  "title": "To Capture a Warrior",
  "description": "War ripped them apart. Fate will bring them back together.A lost love.After losing track of Bridget during the war on the continent, Hunter Crawford has spent two years scouring England to find the only woman he’s ever loved. His search futile, he bitterly, gives up hope and ceases his search for her. One rule. Don’t fall in love with a soldier.Going into war to help her surgeon father on the edges of the Napoleonic battlefields was an easy decision for Bridget Morton. Her father’s only rule? Don't fall in love with a soldier. Dutifully, she nurses hundreds of men back to health with nary a stray eye toward fancies of love. Until her father dies and she meets Hunter. And she learns too quickly how very right her father was. Love in war could only end in tragedy. Heartbroken, she returns to England.What should have stayed in the past… Bridget put the war behind her, and with it, her love for Hunter. She has her hospital in London. She has purpose. But then Hunter walks through her hospital doors. The sparks between them cannot be denied, but will they both find the strength to let go of the past?Join the adventure today! To Capture a Warrior, Logan's Legends tells the second novella-length tale of the guards of the Revelry's Tempest, an enchanting historical regency-era romance by USA Today bestselling author, K.J. The novels in the Logan’s Legends, Revelry's Tempest series by K.J. Jackson are each stand-alone stories and can be read individually in any order. These historical romances are set in the Regency and Victorian eras, and do not shy away from scenes with steamy heat, occasional naughty language, and moments that might possibly make you squirm.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical Fiction",
    "Novella",
    "Historical",
    "Regency",
    "Fiction"
  ],
  "author": "K.J. Jackson",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/40662023-to-capture-a-warrior"
}