{
  "title": "Until the Rising",
  "description": "More than a millennia into the future, the world has been thrust back to a medieval era where men live and die by the sword. The kingdom of Aquila has risen as an epicenter of beauty, culture, and grace; but between wars and its own tribal politics, she is under the perpetual shadow of destruction.Growing up in the Shadowlands and believing most of his family to be dead, young Tristan is in search of his last known relative whom he hopes to find alive. All he has ever wanted is a quiet home and a family to love—but as Tristan grows into manhood, he discovers the price of a peaceful life may prove to be too steep.In this coming-of-age kingdom fantasy, destiny may be calling Tristan to something bigger, if only he has the courage to meet it.Tropes:• Medieval vibes• Brothers ~ strong family relationships• Royal intrigue• Kissing in secret castle alcoves• Secret heirs ~ Possible chosen one• Horses• Lots of pointy, stabby things• Childhood sweethearts to lovers• Classic fantasy/storytelling feelContent warnings: PG-13 for mild profanities, medieval type violence, some low-key spice with fade-to-black marital intimacy.Endorsements:In our modern age where masculinity is seen as toxic, debut author, Amber Kirkpatrick delivers an astounding story filled with strong male characters whose family ties keep them loving, brave, and courageous. Until the Rising is packed with tantalizing secrets, deadly battles and heart-warming moments that show us how romantic love and familial love are both essential in finding where we truly belong. — V. ROMAS BURTON, award-winning, bestselling author of the Heartmaker Trilogy and Fortified.Amber Kirkpatrick has written a masterpiece. With hope and despair, joy and sorrow, strength and weakness, it captures the imagination. In a world so familiar to what we know and yet so different, the Thatcher brothers grab a hold of you and won’t let go. You cheer for their successes and cry in their sorrow. It’s a book that will linger long after you turn the final page. — ANNA AUGUSTINE, author of By Blood and Blade and the Princes of Allura Novella Collection.Until the Rising is an emotional journey through a young man’s pursuit of truth, goodness, and the things that are most worth fighting for in this life. With rich world-building, strong themes of brotherly love, and characters that are more like family, Kirkpatrick beautifully ties together raw realities that make this novel not only a story well-told, but a truth worth unpacking and taking to heart. — ANDREA RENAE, author of Where Darkness Dwells.",
  "genres": [
    "Fantasy",
    "Fiction"
  ],
  "author": "Amber Kirkpatrick",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/123224130-until-the-rising"
}