{
  "title": "Your Fantastic Elastic Brain: A Growth Mindset Book for Kids to Stretch and Shape Their Brains",
  "description": "Learn how much your brain can grow! The perfect introduction to growth mindset, Your Fantastic Elastic Stretch It, Shape It Did you know you can stretch and grow your own brain? Or that making mistakes is one of the best ways your brain learns? Awarded as one of the best growth mindset books for kids, Your Fantastic Elastic Stretch It, Shape It teaches all the ways that the brain can develop with exercise, just like the rest of our bodies. Educator and psychologist Dr. JoAnn Deak offers a fun and engaging introduction to the anatomy and functions of the brain that will empower each young reader to S-T-R-E-T-C-H and grow their fantastic, elastic brain! Looking for award-winning picture books for curious kids? Your Fantastic Elastic Brain is the perfect fit. Dr. Deak shares information in ways that are accessible for parents, teachers, and children alike. Delightful illustrations with accurate details foster motivation to learn and grow in new ways. This book is an excellent companion to Beautiful Oops , The Girl Who Never Made Mistakes , I Can't Do That YET , The Most Magnificent Thing , and Bubble Gum Brain . Awards for Your Fantastic Elastic Brain : Praise for Your Fantastic Elastic Brain : \"Dr. Deak has done a masterful job of creating a book for children, parents, and teachers to learn about the human brain together. The information is accessible and understandable, with illustrations that are engaging, fun, and alive! This is great reading material for everyone and will elicit many expressions of 'Now I get it!' from the adults!\"―Fretta Reitzes, Director, Goldman Center, 92nd Street Y \" Your Fantastic Elastic Brain is a wonderful, engaging book for parents and teachers to read with young children. It presents accurate information about the brain and how it relates to our lives…fostering motivation to learn and grow, consistent with our programs and research led by Carol Dweck, PhD.\"―Eduardo Briceño, Co-Founder & CEO, Mindset Works \"Dr. Deak writes in a clear and interesting way about the complexity of the human brain, enhancing the knowledge of teachers and students. This book is a real contribution to the field of education in the twenty-first century.\"―Joyce S. Pickering, Hum.D., Executive Director Emerita, Shelton School & Evaluation Center",
  "genres": [
    "Picture Books",
    "Science",
    "Nonfiction",
    "Growth Mindset",
    "Childrens",
    "Teaching",
    "Education"
  ],
  "author": "JoAnn Deak",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/10237568-your-fantastic-elastic-brain"
}