{
  "title": "Alien Outcast",
  "description": "She escaped to Kalquor to warn the empire… but did she bring its destruction instead?When a rogue Kalquorian raider snags a Bi’isil cruiser in Empire space, the outlaw crew is hoping for supplies. Instead, they find a Tragoom and an Earther woman with a dire warning: Bi’is is set to unleash a fatal plague on the Kalquorian Empire.Piper Warren, with the help of her friend Ob, has faced death to save the Kalquorians from utter destruction. Instead of help, she stumbles on a ship filled with men who swear no loyalty to anyone but themselves. Can she convince them to set aside their lawless ways to save their people?Captain Nako turned his back on Kalquor after Fleet Command decommissioned his raider. Abandoned by his government, he swears he will never lift a finger to aid them, not even against the traitor Dramok Maf and his fleet. With the new Bi’is threat, if Nako doesn’t do something, the empire will fall and its people will die.Nako’s Nobek clanmate Terig is as fierce as they come. However, his shameful past destroyed a once-promising career, and leading his men into battle can only end in defeat. But how can he refuse when utter annihilation is racing straight to Kalquor?Dual breed Imdiko Ulof is a terror to anyone who crosses him. Leaving broken bodies in his wake, the ex-convict struggles with equally broken dreams. No one can tame him, until a beautiful Earther and an unlikely new friend show that belief has the power to heal all wounds.The survival of Kalquor depends on this unlikely band of misfits. Clan Nako learns that love for an Earther woman can make heroes out of outcasts…until they discover that Piper harbors dark, deadly secrets of her own.Contains adult content. Word count = 86,050",
  "genres": [
    "Menage",
    "Aliens",
    "Science Fiction",
    "BDSM",
    "Fantasy",
    "Romance",
    "M M Romance"
  ],
  "author": "Tracy St. John",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/40669032-alien-outcast"
}