{
  "title": "The Devil in the Duke",
  "description": "A man accustomed to hiding secrets. A woman with a lost past. Love that cannot be denied.A man accustomed to hiding secrets.His dark silver eyes are haunted, and for good reason. Logan Lipinstein lost his wife years ago in the war and has been a living shell of a man ever since, attempting to atone for past sins. Until one fateful day, when she walks past him carrying a basket of bread.A woman with a lost past.Sienna Ponstance lives in the comfort of her grandmother's estate, having long ago put herself on the shelf as a spinster. She has her charcoals, the village that she loves, and peaceful days—even if something has always been missing from her life. Until the day her tranquility is shattered when a strange man accosts her as she is walking home from the village.Love reunited.His wife—dead for ten years—walks along the path in front of Logan. Scarcely believing his eyes, he approaches her and is quickly rewarded with a rebuff that includes the point of a knife. Sienna has no memory of him, thinking him only a ruffian. Now he just has to convince her that he actually is her husband. And that their boundless love can conquer anything—including a past that threatens them at every turn.Join the adventure today! The Devil in the Duke is Logan's story, a favorite recurring character in the Revelry's Tempest series, the enthralling historical regency era romances by USA Today bestselling author, K.J. The novels in the Revelry's Tempest series by K.J. Jackson are each stand-alone stories and can be read individually in any order. These historical romances are set in the Regency and Victorian eras, and do not shy away from scenes with steamy heat, occasional naughty language, and moments that might possibly make you squirm.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Regency",
    "Audiobook",
    "Regency Romance"
  ],
  "author": "K.J. Jackson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/40667886-the-devil-in-the-duke"
}