{
  "title": "A quick view of Global Digital Banking in Just 30 minutes",
  "description": "Who benefits from 30 minutes read on digital Banking e-book? And How can you become \"Digital Banking street-smart\" in just 30 minutes? *As a busy sales person, you are rushing to meet banking customers and you want to relate your knowledge of Banking industry and want to quickly impress your customer *As an employee of any bank or IT company dealing with Banking and financial services segment, you want to impress your boss, colleagues or customers with your high-level thoughts on innovations in banking with global example. *You are a job aspirant appearing for interview in banking sector and you want to impress interviewer, with past, present, future of digital banking. *You are student of Commerce, Banking, Finance, management, and economics etc and want to know quickly about examples of many new generation banking projects from customer as well as CIO perspectives and across many countries in the world. *You are research student and want to see how banks are using technology to its best.* You want to keep track of whats happening in the industry, esp when any corporate make digital investments in new generation era. What's happening recently in the Banking world? : -Banks are going through tremendous challenges of competition from non-banking companies and smaller Fintech companies. Therefore, in order to fight competition and stay ahead of competition in Digital Banking era, it is important for banks to work on not only good web site, social media connect and mobile banking etc; but they also need to innovate with new technology disruptions such as artificial Intelligence, Cognitive science, Block-chain, predictive computing, big data analytics etc.This book gives a quick street-smart view of the examples of 10 different countries from Americas, Europe, Asia Pacific hemisphere.What is covered in 5 segments of this book: -This book is divided into 5 segments to define comprehensive view of Digital spaceSection 1: - Moving from Traditional Banking to New-gen Banking. This segment covers of prior period when tradition banks were moving to Digital banking and why there was a need to become comprehensively digital.Section 2: - Proliferation of Internet Banking, Mobile Banking and \"Direct Banking\" concept. This segment gives example of web based platforms used by banks.Section 3: - Use of Social media in Banking and arrival of Fintech Firms. This segment gives examples of what multiple banks are doing in social media segment to connect with customers such as Facebook, Twitter, Youtube and other channels.Section 4: - Innovative technologies such as artificial intelligence, Internet of Things (IOT), Machine Learnings, Block-chain, Big data etc. This section highlights new fancy innovations in the technology space which is taking the entire banking industry by storm and good to seek experience of Bank of America, JPMC, Ubank, Deutsche Bank, Amzon, Jibun Bank, TD Bank etc Section 5: - Illustrative \"CIO Wishlist\" to complement or enable comprehensive digital Bank. This segment gives example of various technology projects done by CIOs at the front-office, middle-office and back-office to enable comprehensive coverage of digital banking.",
  "genres": [],
  "author": "Shripad Vaidya",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/40676952-a-quick-view-of-global-digital-banking-in-just-30-minutes"
}