{
  "title": "The Lord Peter Wimsey Mysteries Volume Two: The Unpleasantness at the Bellona Club / Strong Poison / The Five Red Herrings  / Have His Carcase",
  "description": "The British aristocrat and sleuth takes on four more puzzling whodunits in this beloved series from “one of the greatest mystery story writers” (Los Angeles Times).   A gentleman needs hobbies. For Lord Peter Wimsey—a Great War veteran with a touch of shell shock—collecting rare books, sampling fine wines, and catching criminals are all most pleasant diversions. In these Golden Age whodunits, “Lord Peter can hardly be spared from the ranks of the great detectives of the printed page” (The New York Times).  The Unpleasantness at the Bellona On Armistice Day, a wealthy general dies in his club, surrounded by fellow veterans—while across town his sister also dies suspiciously, throwing a half-million-pound inheritance into turmoil. Now club member Lord Peter Wimsey must fight an uphill battle to solve the case.  Strong Lord Peter Wimsey comes to the trial of Harriet Vane for a glimpse at one of the most engaging murder cases London has seen in years. There is little doubt the woman will face the hangman. A mildly popular mystery novelist, she stands accused of poisoning her fiancé, a literary author and well-known advocate of free love. But as Lord Peter watches Harriet in the dock, he begins to doubt her guilt—and to fall in love.  The Five Red In the idyllic village of Kirkcudbright on the Scottish coast, every resident and visitor has two things in They either fish or paint (or both), and they all hate Sandy Campbell. So when the painter’s body is found at the bottom of a steep hill, Wimsey suspects someone’s taken a creative approach to the art of murder.  Have His Harriet Vane has gone on vacation to forget her recent murder trial and, more importantly, to forget the man who cleared her name—the dapper, handsome, and maddening Lord Peter Wimsey. But when she finds a dead body on the beach, only the gentleman sleuth can help her solve a murder after all the evidence has washed out to sea.",
  "genres": [
    "Mystery",
    "Classics",
    "Historical Fiction",
    "Mystery Thriller"
  ],
  "author": "Dorothy L. Sayers",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/40667088-the-lord-peter-wimsey-mysteries-volume-two"
}