{
  "title": "The Body Papers",
  "description": "Winner of The Restless Books Prize for New Immigrant Writing, Grace Talusan’s memoir The Body Papers bravely explores her experiences with sexual abuse, depression, cancer, and life as a Filipino immigrant, supplemented with government documents, medical records, and family photos.Born in the Philippines, young Grace Talusan moves with her family to a New England suburb in the 1970s. At school, she confronts racism as one of the few kids with a brown face. At home, the confusion is worse: her grandfather’s nightly visits to her room leave her hurt and terrified, and she learns to build a protective wall of silence that maps onto the larger silence practiced by her Catholic Filipino family. Talusan learns as a teenager that her family’s legal status in the country has always hung by a thread—for a time, they were “illegal.” Family, she’s told, must be put first. The abuse and trauma Talusan suffers as a child affects all her relationships, her mental health, and her relationship with her own body. Later, she learns that her family history is threaded with violence and abuse. And she discovers another devastating family thread: cancer. In her thirties, Talusan must decide whether to undergo preventive surgeries to remove her breasts and ovaries. Despite all this, she finds love, and success as a teacher. On a fellowship, Talusan and her husband return to the Philippines, where she revisits her family’s ancestral home and tries to reclaim a lost piece of herself. Not every family legacy is destructive. From her parents, Talusan has learned to tell stories in order to continue. The generosity of spirit and literary acuity of this debut memoir are a testament to her determination and resilience. In excavating and documenting such abuse and trauma, Talusan gives voice to unspeakable experience, and shines a light of hope into the darkness.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Mental Health",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Feminism"
  ],
  "author": "Grace Talusan",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/40680094-the-body-papers"
}