{
  "title": "Summer by the Tides",
  "description": "From the bestselling author of The Convenient Groom (now a beloved Hallmark Original movie) comes a heartfelt story of family secrets, forgiveness, and unexpected romance. A summer of low tides could expose years of family secrets. . .One of Southern Living's “25 Beach Reads Perfect for Summer” and Woman's World's “Best New Books”When her grandmother goes missing from the family beach house, Maddy and her estranged sisters converge in Sea Haven, North Carolina. Being with uptight Nora and free-spirited Emma in the home where their family broke apart is a struggle Maddy is not in the mood to face, especially since she's recovering from her ex-boyfriend's recent betrayal.As the sisters wait for word of their grandmother, they begin to pack up the family belongings--and unpack memories of the idyllic summers of their childhood. But with those memories come long-buried secrets, and Maddy discovers that all was not as it appeared that last summer in Sea Haven. Meanwhile, Gram's neighbor, Connor Sullivan, seems overly interested in Gram's whereabouts. Maddy is drawn in by his quick smile and steady gaze in spite of herself.Undercurrents of jealousy and resentment threaten to pull the family under again, maybe for good this time. As tensions rise, the sisters must find a way to accept each other for the women they've become—and Maddy must decide if falling in love again is worth the potential heartbreak.Stand-alone novel by a bestselling authorEngaging mix of mystery, drama, and romanceGo-to beach or pool read for summer vacationPraise for Summer by the \"Denise Hunter once again proves she's the queen of romantic drama. Summer by the Tides is both a perfect beach romance and a dramatic story of second chances as sisters unravel secrets that have torn them apart for years. This novel is Hunter at the top of her game. If you like Robyn Carr, you'll love Denise Hunter. I couldn't put it down!\"—Colleen Coble, USA Today bestselling author of the Lavender Tides series\"I have never read a romance by Denise Hunter that didn't sweep me away into a happily ever after. Treat yourself!\"—Robin Lee Hatcher, bestselling author of Who I Am With You",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Romance",
    "Christian",
    "Contemporary",
    "Christian Romance",
    "Contemporary Romance"
  ],
  "author": "Denise Hunter",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/40690148-summer-by-the-tides"
}