{
  "title": "Get 'Er Sideways: A Story About a Muscle Car and its Couple.",
  "description": "New Book featuring mid-sixties muscle cars when they were used as Detroit intended: to tear up the streets.  At the age of 16 years old Mike Banks searched for the fastest car he could find. What he found was a fast car among fast cars; a real deal, tire squalling, big block American Muscle Car. This old car became a part of Banks’ identity and launched an interest which became both a hobby and a business and the car has ultimately become a family heirloom. After marrying and starting a family Banks sold his car. After decades and an extensive search, he was able to get it back.  In Get ‘Er Sideways author Mike Banks explains what it felt like to be a kid with a car so fast that its reputation spread across several counties. The stories in this book all happened in, around, or because of this car. From the hilarious accounts of high school age boys ripping through town in mid-sixties muscle cars to the sweet recounting of meeting and falling in love with his wife, and the emotional tale of losing his beloved car and finding it again, the stories in this book will throw you back in your seat.   FROM THE AUTHOR:  There is nothing like the sound and feeling of two hot cars coming off the line together on a hot summer night, windows down on a narrow two lane road, the sounds of tires squalling and carburetors sucking air, feeling the tires break loose at the shift points. You can pay $100 to watch fuel funny cars and dragsters go over 300 MPH and threaten to break your ear drums, but you can’t buy what I just described. At the age of 16, I went on a hunt for the fastest car I could find. What I found was a 1967 Plymouth GTX with a 440 engine. The stories in this book have this car as a sort of home base. These things happened in, around, and sometimes because of this car. This old car became part of my identity and launched an interest which became both my hobby and my business and ultimately has become a family heirloom.I sold this car as a young man starting a family. Decades later after an extensive search I was miraculously able to find it and get it back.I hope I can portray to you with this book something that cannot be replicated today: what it felt like to own and operate a true American muscle car when they weren’t expensive collectors’ items, but were just being used the way Detroit intended. The impressions that these cars performance made on the people that were there and experienced them is the reason for their popularity today. They have become legends.Just as I used to invite my friends to open the door of the old GTX so I could take them for an adrenaline-filled ride, I now invite you to open the cover of this book and get in.",
  "genres": [],
  "author": "Mike  Banks",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/40696691-get-er-sideways"
}