{
  "title": "All I Want Is You",
  "description": "You met them in DREAM A LITTLE DREAM OF ME. Now prepare to fall in love with THE YOUNGERS, a brand-new series from Iris Morland, full of sexy men, passionate women, and the love stories you can't get enough of.  A brilliant, aloof lawyer, Phin Younger has focused solely on his career and on helping people less fortunate.  Living his life without romance? He’s just fine with that. Phin knows all too well how relationships make life messy and complicated.  Until the day Emily Lassiter begs Phin to help her teenage brother. Beautiful but as fierce as a lioness, Emily is like no other woman he’s met.  Suddenly, all of Phin’s plans to avoid romantic entanglements are thrown out the window the moment he sets eyes on Emily.  A former model, Emily now struggles to make ends meet for herself and for her teenage brother Josh. When Josh commits a crime that could put him behind bars for years, she turns to her brother’s court-appointed lawyer, Phin Younger, for help.  But Emily never expected that her brother’s lawyer would be young and handsome. And she definitely never expected that Phin’s kiss would heat a need inside her that soon transforms into a conflagration.  When these two can no longer deny their feelings for each other, an embittered rival of Phin’s threatens to destroy his career, dragging Emily into the scandal.  Now these star-crossed lovers must overcome the fears that hold them captive—or face a future without the love that could set them both free.   ** This book is a part of the LOVE EVERLASTING series, which is one large series following multiple families and friends. Each book can be read as a standalone (unless otherwise noted), or they can be read in order of publication as one long series. Each book is interconnected, with many of the same characters showing up in multiple books.  LOVE EVERLASTING  THE THORNTONS The Nearness of You The Very Thought of You If I Can’t Have You Dream a Little Dream of Me Someone to Watch Over Me Till There Was You I’ll Be Home for Christmas (A Thorntons Christmas Novella)  THE YOUNGERS Then Came You Taking a Chance on Love All I Want Is You My One and Only",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Amazon"
  ],
  "author": "Iris Morland",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/40694883-all-i-want-is-you"
}