{
  "title": "Sick: The Untold Story of America's Health Care Crisis---and the People Who Pay the Price",
  "description": "America's health care system is unraveling. Every day, millions of hard-working people struggle to find affordable medical treatment for themselves and their families—unable to pay for prescription drugs and regular checkups, let alone hospital visits. Some of these people end up losing money. Others end up losing something even more their health or even their lives. In this powerful work of original reportage, Jonathan Cohn travels across the United States—the only country in the developed world that does not guarantee access to medical care as a right of citizenship—to investigate why this crisis is happening and to see firsthand its impact on ordinary Americans. The stories he brings back are tragic and infuriating. In Boston, a heart attack victim becomes a casualty of emergency room overcrowding when she is turned away from the one hospital that could treat her. In South Central L.A., a security guard loses part of his vision when he can't find affordable treatment for his diabetes. In the middle of the prairie heartland, a retired meatpacker sells his house to pay for the medications that keep him and his aging wife alive. And, in a tiny village tucked into the Catskill mountains, a mother of three young children decides against a costly doctor's visit—and lets a deadly cancer go undetected—because her husband's high-tech job no longer provides health insurance. Passionate, illuminating, and often devastating, Sick interweaves these stories with clear-eyed reporting from Washington and takes us inside the medical industry to chronicle the decline of America's health care system—and lays bare the consequences any one of us could suffer if we don't replace it.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Health",
    "Health Care",
    "Medicine",
    "Economics",
    "Medical"
  ],
  "author": "Jonathan  Cohn",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/406810.Sick"
}