{
  "title": "Rose in Three Quarter Time",
  "description": "Some people marry for love; others marry for music...Rose McNeil is rising the ranks at the Mozarteum in Salzburg as a violinist to watch. Her musical Nova Scotian heritage has loaned an unparalleled technique to her interpretation of some of the most beautiful compositions in the world. The opportunity of a first chair assignment to the Rainer Quartet under the tutelage and baton of Oliver Thorne is a dream come true--- until her student visa expires and the threat of leaving Vienna looms. As much as she grieves the prospect of leaving Vienna and the quartet, it is Oliver—with his dry sense of humour and unexpected charm- she will miss most.British ex-pat Oliver Thorne’s recent appointment as conductor to the Rainer Quartet make him the youngest in the role during its prestigious history. But it wasn’t the path he wanted. A tragic accident years ago forbade him from ever playing his beloved cello again. Now he spends his life conducting for premiere orchestras at the Musikverein. When he first hears Rose McNeil play, all the dreams he left by the wayside are reborn with her unexpected talent. When Rose learns she may have to leave Vienna, Oliver has to come up with a solution. Losing his first violinist is unfortunate, losing her is unimaginable. So he comes up with a crazy idea: A marriage on paper only. She’ll take his name and his citizenship. They’ll split rent money and coin toss to decide who takes the bed or the futon every night. They’ll keep their secret from the orchestra. She’ll play and he’ll conduct and, most importantly...she’ll stay. Unbeknownst to each other, Rose is in love with Oliver and Oliver is in love with Rose. They might even find a happy ending, if only their pesky marriage doesn’t get in the way.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Historical Fiction",
    "Clean Romance",
    "Contemporary Romance",
    "Historical"
  ],
  "author": "Rachel McMillan",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/40710067-rose-in-three-quarter-time"
}