{
  "title": "Surviving Revision: How One Writer Finished What She Started",
  "description": "So, you finished the first draft of your novel. Yay! Now what?Surviving Revision: How One Writer Finished What She Started is a humorous first-hand account of a first-time novelist grappling with how to turn her disheveled vomit draft into a novel someone besides her mother might want to read. Unruly characters, infuriating loglines, wayward settings and haphazard props provide stumbling blocks and “ah-ha” moments like:\t•\tA character’s first impression is a promise you make to your reader.\t•\tJust because you call something a scene doesn’t make it a scene.\t•\tIt’s an author’s job to save her story, not her characters.\t•\tYour main character is not the protagonist in every scene, but…\t•\tEvery scene needs a protagonist (and an antagonist!).\t•\tWallpaper should be hung after the tub is ripped out and replaced.Accidental discoveries, astonishing surprises, and amazing improvements lurk between these pages, and by the end of the book, you will be convinced that you, too, can revise your own work into something you can be proud of!Surviving Revision provides a peek behind the curtain as one writer tackles revision head on so that she can finish what she started. Need a kick in the pants to get your revision efforts off the ground? Purchase Surviving Revision: How One Writer Finished What She Started and get inspired today!K. Kris Loomis is the author of the novel, The Sinking of Bethany Ann Crane and the short story collection, The Monster in the Closet and Other Stories, as well as the humorous travel memoir, Thirty Days In Quito: Two Gringos and a Three-Legged Cat Move to Ecuador. Kris has also written three books about yoga: How to Sneak More Yoga Into Your Life: A Doable Yoga Plan for Busy People, How to Sneak More Meditation Into Your Life: A Doable Meditation Plan for Busy People, and After Namaste: Off-the-Mat Musings of a Modern Yogini! Get a FREE short story at www.kkrisloomis.com! You can find Kris on Facebook, Twitter, and Instagram @kkrisloomis.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "K. Kris Loomis",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/40712560-surviving-revision"
}