{
  "title": "Tokyo Stars",
  "description": "A Yaoi-inspired M/M Gay Romance Rocked by the sudden loss of his parents in a car accident, Seiichi Seigo is hanging by a thread, racing between jobs and his first year in college at a Tokyo University. He’s barely got time to sleep or eat. When he slams into a stunning, (and rude) green-eyed, half-European man on campus, it’s just one more straw in the pile ready to break Seiichi. Arriving home to find an eviction notice on his door doesn’t help either.  Luckily, his best friend, Yukio, has a solution: Seiichi can take over the job Yukio was going to do. Be the personal, live-in assistant to Yukio’s older half-brother, prodigy movie director, Kei Karasawa.  But Seiichi’s troubles aren’t over. He can’t seem to shake the memory of his meeting with the green-eyed man on campus. He even had a steamy dream about him.  When he discovers his new employer and the man in his dream are one and the same, he’s stunned.  Thrust into close contact with the sexy, powerful Kei, Seiichi finds himself desperately attracted and falling for a man who seems to be dating one of the most beautiful actresses in the world and gives every appearance of hating Seiichi.  But appearances can be deceiving...  Author’s note:  Tokyo Stars is a Yaoi-inspired, m/m gay romance @35,000 word novella. Expect a short, sexy read that is pure fantasy, with soft-focus BDSM elements. The novella is a stand-alone with no cliff-hanger that ends in an HEA.  If you like: Yaoi, Dominant/submissive, Crossdressing, May-November, Best friend’s older brother, first-time gay, hurt/comfort, unrequited love, or show business themes, you may like this.  No, I didn’t try to include as many tropes as possible, I just like those elements.",
  "genres": [
    "Yaoi",
    "M M Romance",
    "Contemporary",
    "Romance",
    "Gay",
    "New Adult",
    "College"
  ],
  "author": "Gage Lively",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/40709567-tokyo-stars"
}