{
  "title": "Sea Prayer",
  "description": "**Please note that this will work best on a color device and will appear in a horizontal format**The #1 New York Times-bestselling author of The Kite Runner, A Thousand Splendid Suns, and And the Mountains Echoed responds to the heartbreak of the current refugee crisis with this deeply moving, beautifully illustrated short work of fiction for people of all ages, all over the world. \"Intensely moving. . .Powerfully evocative of the plight in which displaced populations find themselves.\"– Kirkus, STARRED Review \"Hosseini's story, aimed at readers of all ages, does not dwell on nightmarish fates; instead, its emotional power flows from the love of a father for his son.\"– Publishers Weekly, STARRED BOX ReviewA short, powerful, illustrated book written by beloved novelist Khaled Hosseini in response to the current refugee crisis, Sea Prayer is composed in the form of a letter, from a father to his son, on the eve of their journey. Watching over his sleeping son, the father reflects on the dangerous sea-crossing that lies before them. It is also a vivid portrait of their life in Homs, Syria, before the war, and of that city's swift transformation from a home into a deadly war zone. Impelled to write this story by the haunting image of young Alan Kurdi, the three-year-old Syrian boy whose body washed upon the beach in Turkey in September 2015, Hosseini hopes to pay tribute to the millions of families, like Kurdi's, who have been splintered and forced from home by war and persecution, and he will donate author proceeds from this book to the UNHCR (the UN Refugee Agency) and The Khaled Hosseini Foundation to help fund lifesaving relief efforts to help refugees around the globe. Khaled Hosseini is one of the most widely read writers in the world, with more than fifty-five million copies of his novels sold worldwide in more than seventy countries. Hosseini is also a Goodwill Envoy to the UNHCR, and the founder of The Khaled Hosseini Foundation, a nonprofit that provides humanitarian assistance to the people of Afghanistan.",
  "genres": [
    "Poetry",
    "Fiction",
    "Short Stories",
    "Historical Fiction",
    "Graphic Novels",
    "Picture Books",
    "War"
  ],
  "author": "Khaled Hosseini",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/40711952-sea-prayer"
}