{
  "title": "Becoming a Real-World Samurai",
  "description": "Calling all aspiring warriors! Men who crave the difficult task, who are bored senseless and feel wholly unchallenged, who want to be pushed both mentally and physically. Brent C. Magnussen's Becoming a Real-World Samurai is the Massive Action Plan you've been waiting for!  This smart, sharp, no-bull guide is for men who are serious about living life to the fullest and will teach you everything you need to know to take your life to the next level. In twenty-eight days, you can achieve:  - A Samurai mindset through a simple and effective morning routine  - Unbreakable confidence through Brazilian Jiu Jitsu  - Lose fat forever with a new eating lifestyle, not another fad diet  - Give her the most life changing orgasms ever - Cook world class Italian meatballs in less than 30 minutes. - Set and crush your goals effectively and live life on your terms  - Master your 30 second elevator pitch. Own the room and get the girl  - Enhance your mental game through floating. Yes floating  - Speak another language in 28 days. Magnussen's been-there-done-that insight and take-no-prisoners attitude will show how to push the capabilities of your mind and body to the max--to face the suck factor in your life, embrace it, own it, and crush it. Are you in?  Regardless of where you come from, where you're at or where you want to go, this book can be applied. Brent has a great way to convey how this \"Samurai\" mentality can be applied to every walk of life. A fantastic read.\"  Kevin Ross - Former WBC Muay Thai World Champion and Bellator Kickboxing Featherweight World Champion  \" Brent has such a passion for Jiu Jitsu, and goes deep into not just the popular sport BJJ, but the self-defense, philosophy, breathing, and amazing lifestyle that Jiu Jitsu gives us all. He gives you a real world introduction to this unbelievable martial art that has changed my life and my family's life forever. Jiu Jitsu lifestyle brothers. OSS\"!  Luiz Claudio -- 3X Brazilian Jiu Jitsu World Champion and 4th Degree Black Belt under the legendary Rickson Gracie  Brent C. Magnussen is an American author, entrepreneur, public speaker, and US Army veteran. An adventure seeker, and self-proclaimed human test subject for peak social, mental, and physical development, in 2018 Brent released his much-anticipated first book, Becoming a Real-World Samurai. Brent is an avid practitioner of Brazilian Jiu Jitsu, an accomplished cook, a voracious reader, and a yogi. He enjoys traveling the world, learning languages, and enjoying different cultures and their food.",
  "genres": [],
  "author": "Brent C. Magnussen",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/40715839-becoming-a-real-world-samurai"
}