{
  "title": "Our Bodies, Our Crimes: The Policing of Women’s Reproduction in America",
  "description": "Winner of th e 2010 Distinguished Book Award from the American Sociological Association; Sex and Gender Section2009 Choice Outstanding Academic TitleAn important work documenting how the criminal justice system polices women's reproductive capacityThe intense policing of women’s reproductive capacity places women’s health and human rights in great peril. Poor women are pressured to undergo sterilization. Women addicted to illicit drugs risk arrest for carrying their pregnancies to term. Courts, child welfare, and law enforcement agencies fail to recognize the efforts of battered and incarcerated women to care for their children. Pregnant inmates are subject to inhumane practices such as shackling during labor and poor prenatal care. And decades after Roe , the criminalization of certain procedures and regulation of abortion providers still obstruct women’s access to safe and private abortions.In this important work, Jeanne Flavin looks beyond abortion to document how the law and the criminal justice system police women’s rights to conceive, to be pregnant, and to raise their children. Through vivid and disturbing case studies, Flavin shows how the state seeks to establish what a “good woman” and “fit mother” should look like and whose reproduction is valued. With a stirring conclusion that calls for broad-based measures that strengthen women’s economic position , choice-making, autonomy, sexual freedom, and health care, Our Bodies, Our Crimes is a battle cry for all women in their fight to be fully recognized as human beings. At its heart, this book is about the right of a woman to be a healthy and valued member of society independent of how or whether she reproduces.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Politics",
    "Sociology",
    "Womens",
    "Gender",
    "Gender Studies"
  ],
  "author": "Jeanne Flavin",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/4071221-our-bodies-our-crimes"
}