{
  "title": "What You Have Heard Is True: A Memoir of Witness and Resistance",
  "description": "The powerful story of a young poet who becomes an activist through a trial by fireWhat You Have Heard is True is a devastating, lyrical, and visionary memoir about a young woman's brave choice to engage with horror in order to help others. Written by one of the most gifted poets of her generation, this is the story of a woman's radical act of empathy, and her fateful encounter with an intriguing man who changes the course of her life.Carolyn Forché is twenty-seven when the mysterious stranger appears on her doorstep. The relative of a friend, he is a charming polymath with a mind as seemingly disordered as it is brilliant. She's heard rumors from her friend about who he might be: a lone wolf, a communist, a CIA operative, a sharpshooter, a revolutionary, a small coffee farmer, but according to her, no one seemed to know for certain. He has driven from El Salvador to invite Forché to visit and learn about his country. Captivated for reasons she doesn't fully understand, she accepts and becomes enmeshed in something beyond her comprehension.Together they meet with high-ranking military officers, impoverished farm workers, and clergy desperately trying to assist the poor and keep the peace. These encounters are a part of his plan to educate her, but also to learn for himself just how close the country is to war. As priests and farm-workers are murdered and protest marches attacked, he is determined to save his country, and Forché is swept up in his work and in the lives of his friends. Pursued by death squads and sheltering in safe houses, the two forge a rich friendship, as she attempts to make sense of what she's experiencing and establish a moral foothold amidst profound suffering. This is the powerful story of a poet's experience in a country on the verge of war, and a journey toward social conscience in a perilous time.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "History",
    "Poetry",
    "Biography",
    "Politics",
    "War"
  ],
  "author": "Carolyn Forché",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/40712499-what-you-have-heard-is-true"
}