{
  "title": "Springtime for Snowflakes: Social Justice and Its Postmodern Parentage",
  "description": "Springtime for 'Social Justice' and Its Postmodern Parentage is a daring and candid memoir. NYU Professor Michael Rectenwald - the notorious @AntiPCNYUProf - illuminates the obscurity of postmodern theory to track down the ideas and beliefs that spawned the contemporary social justice creed and movement. In fast-paced creative non-fiction, Rectenwald begins by recounting how his Twitter capers and media exposure met with the swift and punitive response of NYU administrators and fellow faculty members. The author explains his evolving political perspective and his growing consternation with social justice developments while panning the treatment he received from academic colleagues and the political left. The memoir is the story of an education, a debriefing, as well as an entertaining and sometimes humorous romp through academia and a few corners of the author s personal life. The memoir includes early autobiographical material to provide context for Rectenwald s academic, political, and personal development and even surprises with an account of his apprenticeship, at age nineteen, with the poet Allen Ginsberg. Unlike many examinations of postmodern theory, Springtime for Snowflakes is a first-person, insider narrative. Likening his testimony to that of an anthropologist who has gone native and returned, the author recalls his graduate education in English departments and his academic career thereafter. In his graduate studies in English and Literary and Cultural Theory/Studies, the author explains, he absorbed the tenets of Marxism, the Frankfurt School of Critical Theory, as well as various esoteric postmodern theories. He connects ideas gleaned there to manifestations in social justice to explain the otherwise inexplicable beliefs and rituals of this religious creed. Altogether, the narrative works to demystify social justice as well as Rectenwald s revolt against it. Proponents of contemporary social justice will find much to hate and opponents much to love in this uncompromising indictment. But social justice advocates should not dismiss this enlightening look into the background of social justice and one of its fiercest critics. This short testimonial could very well convince some to reconsider their approach. For others, Springtime for Snowflakes should clear up much confusion regarding this bewildering contemporary development. The book provides a clear and balanced suggestion for unraveling the tangled twine of social justice ideology that runs through North American educational, corporate, media, and state institutions. Never soft-peddling its criticism, however, Springtime for Snowflakes delivers on the promise of the title by also including appendices that collect Dr. Rectenwald s saltiest tweets and Facebook statuses.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Philosophy",
    "Cultural",
    "Sociology",
    "Education",
    "Social Justice"
  ],
  "author": "Michael Rectenwald",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/40711469-springtime-for-snowflakes"
}