{
  "title": "Love Poems",
  "description": "Explore the Beauty of the Human Heart and Spirit!A collection of romantic Love Poems intermingled with passages of spiritual enlightenment, LOVE POEMS promises to take the reader on a sublime journey of both written imagery and visual artwork by the author, guiding them to the truth behind what LOVE is and how it connects us all ...Dr. Tony Beizaee masterfully entwines the power of heart-felt poetry and striking images to weave a Rumi-esque gem in book form. \"Love Poems\" is a cosmic force to be reckoned with, that will awaken every crease and corner of your soul.-Eva Xanthopoulos, Founder of Poehemian PressDr. Tony Beizaee weaves matters of the heart with human spirituality effortlessly in this compendium of poems that explores love in its many forms. Metaphors sing off the page in these excellent verses. Prepare to be transported to a world of romance and passion.- Lauren Rickard, writer and journalist for EastLondonLinesWhen you read Love Poems, you'll enter Dr. Tony Beizaee's special world of love, connection, and openness. You'll learn how to forgive, explore the all-encompassing nature of love, and feel the touch of someone special in his words. You'll also delight at the heartfelt and touching Artwork illustrations, lovingly created byDr. Tony, himself. Born from author's profound imagination as he searches for answers to the ultimate question, LOVE POEMS is a collection like no other.\"You'll read these verses with your heart as much as your eyes as you touch love, drift in an ocean of ecstasy. Love Poems, by Dr. Tony Beizaee, nurtures blossoming hearts and heals those mourning love lost.- Cornelia Amiri, Romance AuthorThis beautiful book will have a huge impact on your heart. Get ready to be swept away by Dr. Tony!\"His feverous passion runs through each stanza which he has deftly orchestrated to illuminate his profound imagination when it comes to seeking the answers to questions that plague the human psyche.\"- Amelia Vandergast, AuthorWhen you order this fresh and fascinating book of love, you'll discover a wonderful new perspective. You will feel Dr. Tony's passion and absorb his life wisdom in the 25 love poems he shares in this powerful book:  My Love  Your Devoted Loving Hands  The Sea Of Love  My Longing tears  Mother  Love Vows  The Season Of Love  Love Touched Me  The Blanket Of Love  Forgiveness  Your Loving touch  The Attainment  Love enfolds Forgiveness  Vanished into Love  Open thine own heart  The Sunrise Of Love  Heart  The Infinite  Inception Of Love  Secret Place  The Anatomy Of Heart  Loving Souls  Jerusalem &",
  "genres": [],
  "author": "Tony Beizaee",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/40703739-love-poems"
}