{
  "title": "The Municipalists",
  "description": "A novel about an unlikely pair of lonely outsiders--one human, one AI--on an adventure to save the great American city of Metropolis written by \"one of the most exciting new voices in fiction\" (Charles Yu) *Named one of the best books of the month by \nLibrary Journal\n (\"Debut of the Month\"), \nThe Verge\n, \nio9\n, \nAmazon Books\n, Book of the Month Club, \nVol. 1 Brooklyn\n, \nNYLON, \n and \nTor.com\n*In Metropolis, the gleaming city of tomorrow, the dream of the great American city has been achieved. But all that is about to change, unless a neurotic, rule-following bureaucrat and an irreverent, freewheeling artificial intelligence can save the city from a mysterious terrorist plot that threatens its very existence.Henry Thompson has dedicated his life to improving America's infrastructure as a proud employee of the United States Municipal Survey. So when the agency comes under attack, he dutifully accepts his unexpected mission to visit Metropolis looking for answers. But his plans to investigate quietly, quickly, and carefully are interrupted by his new partner: a day-drinking know-it-all named OWEN, who also turns out to be the projected embodiment of the agency's supercomputer. Soon, Henry and OWEN are fighting to save not only their own lives and those of the city's millions of inhabitants, but also the soul of Metropolis. The Municipalists is a thrilling, funny, and touching adventure story, a tour-de-force of imagination that trenchantly explores our relationships to the cities around us and the technologies guiding us into the future.\"A new and irreverent take on both real-world politics and sci-fi history.\"-The Wall Street Journal",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Mystery",
    "Fantasy",
    "Humor",
    "Science Fiction Fantasy"
  ],
  "author": "Seth Fried",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/40711380-the-municipalists"
}