{
  "title": "The Farmer and the Dolphin: How a WWII Navy Vet and a Country Lawyer Whipped the U.S. Government in Court",
  "description": "A SHARP KNOCK AT THE DOOR  At Garden City Beach, S.C., where no one seemed to hurry, the first indication of trouble was the staccato rumble of footsteps on the stairs. A sharp knock at the door came next. And when 86-year-old Betty Mincey opened up she faced law officers wearing guns. Three men, two from the South Carolina Department of Natural Resources and a federal agent from the National Oceanic and Atmospheric Administration, had come to investigate the report of a dead dolphin taken in a net set by her husband in front of the Mincey house that morning, Nov. 3, 2013. After questioning 86-year-old World War II Navy veteran C.P. Mincey, the officers told him he had violated the Marine Mammal Protection Act which cites the illegal taking of a dolphin as a federal offense. The accompanying S.C. DNR officer told him he had also broken state laws in setting and observing the net. Mincey's explanation that he had made no attempt to take the dolphin found dead earlier that morning in his lightweight mesh net did not appear to matter to the officers. They charged the South Carolina farmer with killing a dolphin and his fine was eventually set at $6500. The events at Garden City marked the opening stage of a 15-month-long battle between the Mincey family and the National Oceanic and Atmospheric Administration. Join South Carolina author William Walker for an in-depth, entertaining behind-thescenes account of how Mincey, with the support of Latta S.C., attorneys LaFon LeGette and Alan Berry, won his case in a contentious federal hearing at Georgetown, S.C. William Walker is a South Carolina-born writer with a lifelong interest in the state's Pee Dee region. Walker, from Nichols in Marion County, worked as a reporter and editor in the United States and Europe for more than four decades and has written and edited for newspapers and magazines on assignments in over 50 countries. The Farmer And The Dolphin is Walker's third book since 2014 when he wrote Down The Little Pee Dee, Paddling South Carolina's Legendary Blackwater River.",
  "genres": [],
  "author": "William S. Walker",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/40715840-the-farmer-and-the-dolphin"
}