{
  "title": "Anti-Matter",
  "description": "One of the greatest science fiction thrillers of all time. Some people say that money, bad luck or Karma is the cause of all your problems. But, now we know that it is not money or bad luck or even Karma that is the cause of your fate - it's Anti-Matter. Truth is indeed stranger than Fiction. Anti-Matter is both a love story and a classic Science Fiction story that reveals exactly how our fate is created not by us as individuals, but by how we maneuver through the universe and all of the powerful forces that it creates just to mess with us. The story of the creator of the Anti-Matter Ray gun will astound and amaze you. When the Anti-Matter bomb hits the planet, everything goes topsy-turvy Up is Down. Left is Right and inside is out. We now know that Anti-Matter is made in thunderstorms here on Earth in quantities sufficient to change lives. It is also made inside Black Holes, stars that have become so massive that nothing can escape, not even light and this is why they are Black Holes. Ever since this amazing stuff was discovered floating around in the universe scientists have been struggling to find out what impact anti-matter might be having on our world. In this amazing new Science Fiction adventure, you not only find out how anti-matter works in our world, but also how it may be impacting your life right now at this very moment. When any particle of anti-matter comes into contact with the normal matter that we all take for granted, the air we breathe, our bodies, our cars, our houses, our clothing, etc. the two opposite types of matter annihilate one another instantly. If anti-matter hits your brain, your thinking is going to be severely altered. Your future may be changed as well, since your future is greatly dependent upon what you're thinking at any given time. Every aspect of our thinking, every aspect of our daily lives is powered by the atomic structure of matter. The atoms, as we know, like Carbon, Hydrogen, Oxygen, etc. are the major components of molecules. Molecules are what we are composed of that moves our bodies, helps us breathe, digests our food, allows us to think. In any of these processes, especially when we fall in love, we don't want too much interference from anyone or anything, and we may be able to defend against a lot of things. But we have no defenses against anti-matter. So, when we ourselves come into contact with anti-matter, parts of ourselves vanish, disappear, it is annihilated. How much of this anti-matter/matter annihilation is required before serious damage is done, no one knows. This is a story about a group of people who have more than enough anti-matter in their lives to change their lives drastically several times over. This is the story of the inventor of the anti-matter ray and what happened after his ray gun was introduced to the world. This is the story of the inventor of the Anti-Matter Ray and what happened after his ray gun was introduced to the world. The amazing twists and turns will amaze and entertain and cause great consternation in your life if you have ever encountered an event in your life that you could not explain. Now, you will be able to put it down to Anti-Matter. This story is not meant for the squeamish or the mentally challenged. This is a story that will literally annihilate your present conception of what reality means and it may even help you discover a better universe in which you are meant to live and breathe in. If you thought you knew just about everything regarding what happens in this universe - if you thought you knew just about everything that was going to happen to you in the next twenty-four hours - guess again. Anti-matter is out there, and there's more and more of it sneaking into our world every day. An anti-matter storm rages all around us every day and is causing the greatest chaos this world has ever known. If you have seen that Truth is truly stranger than fiction - then you need to read this book.",
  "genres": [],
  "author": "Michael Mathiesen",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/40703476-anti-matter"
}