{
  "title": "Pushback",
  "description": "A Finalist for the Daphne du Maurier Award for Excellence in Mystery/Suspense, Mainstream Mystery.Dave, an investment counselor with PTSD, survives a blowout that kills his fiancée, Allison.A year later, Dave has found unexpected happiness with Cathy. At Dave's high-school reunion, Dave is stunned that he doesn't recognize anyone there. Cathy, who was previously victimized by a con man, breaks it off. Late that night, Dave gets a text: \"How does it feel to be so quickly forgotten?\" Apparently, someone close to Allison is angry that he has moved on so \"soon.\"Dave's PTSD symptoms make him avoid conflict at almost any cost, so he hopes this will pass. It doesn't. The harassment escalates. And now, someone is trying to kill him.Dave's only choices are to flee or stay and fight. He stays. And before the fight is done, multiple bodies lie in his wake. Someone picked on the wrong guy.Pushback is a finalist for the 2019 Daphne du Maurier Award for Excellence in Mystery/Suspense in the Mainstream Mystery/Suspense category, a finalist for the Book Excellence Award in thrillers, and a finalist for the Colorado Author's League Award in Mystery.\"Some people dream about going to their high-school reunion in their underwear. Dave Barlow goes to his and finds himself worse than naked—unrecognized. A lovely, twisty thriller that moves like a roller coaster—ratcheting up the suspense, then plunging into crisis, or doing a swift loop-the-loop through the flashbacks of PTSD before the climb starts again.\"— Diana Gabaldon, New York Times bestselling author of OutlanderAbout the AuthorJohn E. Stith is the award-winning author of multiple science-fiction novels such as Manhattan Transfer and Redshift Rendezvous, many with a strong mystery component. Deep Quarry, a private eye novel set on a distant planet, won the Colorado Authors' League Top Hand Award. Death Tolls, set on Mars, won another Top Hand Award. His Nick Naught private eye stories from Analog are collected in All for Naught.Stith's work includes best sellers, a Nebula Award finalist, a Seiun Award finalist, a La Tour Eiffel Science Fiction Book Prize finalist, HOMer Award winners, and Science Fiction Book Club selections.His work has also appeared on the New York Public Library Best Books for Young Adults list, Science Fiction Chronicle's List of Year's Best Novels, and the yearly Locus Recommended Reading Lists.",
  "genres": [
    "Mystery"
  ],
  "author": "John E. Stith",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/40698564-pushback"
}