{
  "title": "Animal, Vegetable, Miracle: A Year of Food Life",
  "description": "An edition celebrating the 10th anniversary of Barbara Kingsolver's New York Times bestseller, which describes her family's adventure as they move to a farm in southern Appalachia and realign their lives with the local food chain.Since its publication in 2007, Animal, Vegetable, Miracle has captivated readers with its blend of memoir and journalistic investigation. Newly updated with original pieces from the entire Kingsolver clan, this commemorative volume explores how the family's original project has been carried forward through the years.When Barbara Kingsolver and her family moved from suburban Arizona to rural Appalachia, they took on a new to spend a year on a locally-produced diet, paying close attention to the provenance of all they consume. Concerned about the environmental, social, and physical costs of American food culture, they hoped to recover what Barbara considers our nation's lost appreciation for farms and the natural processes of food production. Since 2007, their scheme has evolved enormously. In this new edition, featuring an afterword composed by the entire Kingsolver family, Barbara's husband, Steven, discusses how the project grew into a farm-to-table restaurant and community development project training young farmers in their area to move into sustainable food production. Camille writes about her decision to move back to a rural area after college, and how she and her husband incorporate their food values in their lives as they begin their new family. Lily, Barbara's youngest daughter, writes about how growing up on a farm, in touch with natural processes and food chains, has shaped her life as a future environmental scientist. And Barbara writes about their sheep, and how they grew into her second vocation as a fiber artist, and reports on the enormous response they've received from other home-growers and local-food devotees.With Americans' ever-growing concern over an agricultural establishment that negatively affects our health and environment, the Kingsolver family's experiences and observations remain just as relevant today as they were ten years ago. Animal, Vegetable, Miracle is a modern classic that will endure for years to come.",
  "genres": [
    "Nonfiction",
    "Food",
    "Memoir",
    "Book Club",
    "Gardening",
    "Health",
    "Environment"
  ],
  "author": "Barbara Kingsolver",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/40725379-animal-vegetable-miracle"
}