{
  "title": "The Magical Beings' Rehabilitation Center: The Complete Series",
  "description": "Werewolves have fleas. Cyclops need glasses. Dark Elves give villain monologues.Maybe the magical paranormal world isn’t quite what we expect?This special boxset contains the complete urban fantasy series the Magical Beings' Rehabilitation Center: Vampires Drink Tomato Juice, Goblins Wear Suits, and The Lost Files of the MBRC.Book 1: Vampires Drink Tomato JuiceMorgan might be losing her sanity. She thought it was a normal day but after witnessing an incident involving a werewolf, a substitute teacher/possible vampire, and a thermos of tomato juice, things get weird.A quick train ride later she finds herself at the Chicago headquarters of all things fantastical: the Magical Beings' Rehabilitation Center.At the MBRC Morgan encounters dragons, vampires, elves, centaurs and even the Pooka, a shape-shifter who is too handsome for his own good.The MBRC strives to rehabilitate and integrate magical beings into human society. It’s also supposed to be a secret, and Morgan’s accidental initiation breaks every rule the place has.Book 2: Goblins Wear SuitsMorgan has settled into a balance between her school work and teaching at the MBRC. But she doesn’t know what she wants after this.Her family and friends, including a certain flirtatious Pooka, all have colleges and future career paths for her to consider. Her choices are made even more difficult when terrorist threats are issued by an anti-human, magic-based organization.And their main target is Morgan.Book 3: The Lost Files of the MBRCWhen Morgan decided to stay employed at the Magical Beings’ Rehabilitation Center, she thought her life would quiet down as she started college and developed her career.She thought wrong.The Lost Files of the MBRC is an anthology of five short stories set in the world of the Magical Beings' Rehabilitation Center series.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Young Adult",
    "Paranormal",
    "Magic",
    "Romance",
    "Vampires"
  ],
  "author": "K.M. Shea",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/40729597-the-magical-beings-rehabilitation-center"
}