{
  "title": "Blood Brothers",
  "description": "\"I'd be damned if I would ever worship their God of unconditional forgiveness. Mine was the Old Testament's God of justice-the God who had exposed the lascivious elders of Babylon plotting the ruin of Susannah, the God who fortified yound David against a giant Philistine. . . . They were flesh and blood, they prized their own worth, and asserted it, even to the point of bloodshed. What God brought out of their revenge for Israel or anyone else was not their concern. Who knows the mind of God? Man's business is to know his own mind, and he sins when he ignores its commands.\" -from Chapter Four In Madrid at the age of 7, Juan Ramon Fuertes witnesses the murder of his parents by two thugs supervised by his father's business partner, Martin Esteban. His identification of the murderers dismissed by the police, the boy vows to avenge his parents. Sustained by his lust for revenge, Juan Ramon endures years of abuse in a Spanish orphanage, where he follows the movements of Esteban in news reports, eventually noticing Esteban's beautiful and pious son, Bernardo. Later, when Bernardo begins training as a monk, Juan Ramon's plan Use the son to get the father. With cool calculation, Juan Ramon begins monastic training, finally entering Bernardo's monastery in Toledo as Father Juan Ramon. Sensing Bernardo's attraction to him, Juan Ramon seduces the young monk to gain access to Esteban. Gradually enthralling the devout, troubled Bernardo, Juan Ramon pursues the two thugs while planning Esteban's murder. But all his schemes for justice hit an unforeseen snag when the fierce avenger falls in love with his tortured protégé. Told from the points of view of both Juan Ramon and Bernardo, Blood Brothers explores the fascinating mixture of lust, love, spirituality, and revenge underlying the mutual seduction of a holy monk and his unholy brother. Michael Schiefelbein has lived in Italy and Washington, D.C., and now resides in Memphis, Tennessee, where he is a professor of writing and literature. He is also the author of Vampire Vow .",
  "genres": [
    "M M Romance",
    "Gay",
    "LGBT"
  ],
  "author": "Michael Schiefelbein",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/407241.Blood_Brothers"
}