{
  "title": "Close to the Sun: The Journey of a Pioneer Heart Surgeon",
  "description": "Taut, elegantly written, and ever-attentive to the patients for whom he was the last best chance, Close to the Sun is an adventurous, riveting account based on the experience of over 40,000 heart surgeries, where everything was on the line every moment in the O.R.Stuart Jamieson has lived two lives. One began in heat and dust. Born to British ex-pats in colonial Africa, Jamieson was sent at the age of eight to a local boarding school, where heartless instructors bullied and tormented their students. In the summers he escaped to fish on crocodile-infested rivers and explore the African bush. As a teenager, an apprenticeship with one of Africa’s most fabled trackers taught Jamieson how to deal with dangerous game and even more dangerous poachers, lessons that would later serve him well in the high-stakes career he chose.  Jamieson’s second life unfolded when he went to London to study medicine during the turbulent 1960s, leaving behind the only home he knew as it descended into revolution. Brilliant and self-assured, Jamieson advanced quickly in the still-new field of open-heart surgery. It was a fraught time. For patients with terminal heart disease, heart transplants were the new hope. But poor outcomes had all but ended the procedure. In 1978 Jamieson came to America and to Stanford—the only cardiac center in the world doing heart transplants successfully. Here, Jamieson’s pioneering work on the anti-rejection drug cyclosporin would help to make heart transplantation a routine life-saving operation, that is still in practice today as he continues to train the next generation of heart surgeons. Stuart Jamieson’s story is the story of four decades of advances in heart surgery.",
  "genres": [
    "Medicine",
    "Nonfiction",
    "Africa",
    "Biography",
    "Memoir"
  ],
  "author": "Stuart Jamieson",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/40744550-close-to-the-sun"
}