{
  "title": "The Burning",
  "description": "'The Burning lights a fire in you - one that makes you want to fight for change and ignite sparks in others so the fire spreads and spreads.' - HOLLY BOURNE A rumour is like a fire. You might think you’ve extinguished it but one creeping, red tendril, one single wisp of smoke is enough to let it leap back into life again. Especially if someone is watching, waiting to fan the flames ...   New school. Tick. New town. Tick. New surname. Tick. Social media profiles? Erased.   There’s nothing to trace Anna back to her old life. Nothing to link her to the ‘incident’.   At least that’s what she thinks … until the whispers start up again. As time begins to run out on her secrets, Anna finds herself irresistibly drawn to the tale of Maggie, a local girl accused of witchcraft centuries earlier. A girl whose story has terrifying parallels to Anna’s own… The compelling YA debut from Laura Bates, founder of the Everyday Sexism Project and bestselling author of Girl Up. PRAISE FOR THE 'This is a book teen girls NEED to read' - Holly Bourne 'Bold, brutal & hugely important' - Abi Elphinstone  'Defiant and inspiring' – Katherine Webber  'Brilliant' – Stylist 'Essential reading for fans of Holly Bourne and Louise O'Neill' - The Observer PRAISE FOR GIRL  ‘A bracing love letter to today's teenage girls’ – Sunday Times 'Essential reading for young women and girls’ –  Morning Star Online 'This no-nonsense guide to being a girl in 2016 is one all teen girls should read’ – Red magazine 'If you have a daughter or a niece or a younger sister or a goddaughter, buy it for them now' --The Pool PRAISE FOR EVERYDAY ‘This is an important book’ –Independent ‘A potent reminder of how far feminism has come and how far it has to go’ - Kirkus Reviews 'A game-changing book, a must-read for every woman' –Cosmopolitan  'Funny and clever' - Telegraph",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Feminism",
    "Fiction",
    "Fantasy",
    "Historical Fiction",
    "Witches"
  ],
  "author": "Laura Bates",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/40745002-the-burning"
}