{
  "title": "The Erie Canal Brides Collection",
  "description": "Seven romance stories take you back to the building of the Erie Canal and the opening of the Midwest to greater development.Completed in 1825, the Erie Canal connected the Great Lakes to the Hudson River, and soon other states like Ohio created canals linking Lake Erie to the Ohio River. Suddenly the Midwest was open to migration, the harvesting of resources, and even tourism. Join seven couples who live through the rise of the canals and the problems the waterways brought to each community, including land grabs, disease, tourists, racism, and competition. Can these couples hang on to their faith and develop love during times of intense change?The Way of a Child by Lauralee BlissLittle Falls, New York 1817Widower David Marshall has no interest in selling his farm to the Erie Canal project presented by agent Ray O’Neil and his daughter Melanie. But his sons Matthew and Luke have taken a peculiar liking to Melanie. What the children reveal paves the way to a surprising future.  Wedding of the Waters by Rita GerlachGoshen Creek, New York. 1819Charlotte Verger, a physician’s niece, is unexpectedly reunited with her first and only love, Blaine McKenna. When word comes that the Erie Canal builders at the Montezuma Swamp, where Blaine is working as a surveyor, are stricken with malaria, Charlotte risks a journey to reach him. Digging for Love by Ramona K. CecilRochester, New York 1822For budding artist Emily Nichols, the coming Erie Canal brings dreams of leaving Rochester for the art markets of New York City. As he builds the canal, Irish laborer Seamus O’Grady is building his American dream in Rochester. When hearts meld, divergent dreams and old prejudices threaten burgeoning love. Return to Sweetwater Cove by Christina MillerSweetwater Cove, New York, 1825Reverend Josiah Wells travels to his hometown to pastor the church and make restitution for his youthful sins. Betsy Bennett wants to honor her late husband’s memory and make sure Sweetwater Cove never discovers the secret she shares with Josiah. Can they leave behind the past and find love beside still waters?Journey of the Heart by Johnnie AlexanderCircleville, Ohio, early 1852Charity Sinclair secretly writes abolitionist pamphlets while thwarting architect Tavish Dunbar’s effort to redesign her father’s post office, a hidden stop on the Underground Railroad. When a slave-hunter captures a runaway, Charity vows to rescue the fugitive. But can she trust Tavish with her secret. . .and with her heart? Pressing On by Rose Allen McCauleyZoar, Ohio, 1856As a child, Amanda Mack loved her life in Zoar, Ohio, where she was born to Separatists. Now an adult, she starts to chafe at its many restrictions. After meeting riverboat captain Daniel Jeremiah, they both must make decisions about their futures. Can she leave or will he convert or…?The Bridge Between Us by Sherri Wilson JohnsonAlbion, New York, 1859John Hawkins steps back into Susannah Higley’s life just in time to save it. Despite her father’s longstanding disdain for John’s family, can Susannah and John settle the family feud and save her father’s struggling sawmill—and their chance for love? Or will the feud continue?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Novella",
    "Christian Fiction",
    "Collections"
  ],
  "author": "Johnnie Alexander",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/40738336-the-erie-canal-brides-collection"
}