{
  "title": "GODLY OBSESSION: How badly does she want her freedom?",
  "description": "I was the daughter of a dirty sheriff and an abused woman. Haedleigh was a small town, which really didn’t have much going on, and it was known for its vintage trains. It was the kind of town where everybody knew everybody, your neighbours were practically family and there was only one college in town. Our bars played amateur music from amateur bands who rehearsed in their garages, there was a gas station where trucks would stop for the night and cheap beer cans littered the streets every Saturday and Sunday morning. Haedleigh was the kind of place where kids weren’t afraid to play in the streets and more often than not, the elderly would gather every morning, gossiping about whose daughter was spotted with whose son.But even with towns as peaceful as Haedleigh, dirty secrets still lay within the rubble of the scrapyard. The swinging decapitated bodies that hung from the Islesbury Bridge, heads placed on spikes on the front lawn of different homes, and the random gunfire you’d hear in the middle of the night as the people of Haedleigh sat near their radios, in silence.It was all his doing. A man by the name of Salvatore Esposito that people whispered in the confines of their homes with the lights off for fear of the curse that his name carried.Quite honestly, I dismissed the whispers and thought that they were simply rumours. Lord knows how those spread around these parts since people didn’t have much to do with their lives, but I suppose I shouldn’t have been so naïve. I mean, papa did refer to his corrupt friends as ‘the devil’. That should have been warning enough I suppose, but my curiosity would be the death of me…literally.Papa’s poker nights with ‘the devil’ were where it all began. 20 years of successfully staying out of papa’s business and the one day I think that I can be sneaky, it all comes crumbling down. ‘The devil’ that papa let into our home was going to do a lot more damage than just take a few hundred thousand dollars from papa during poker night, that was for sure.",
  "genres": [
    "Dark",
    "Dark Romance",
    "Abuse",
    "Interracial Romance",
    "Erotica",
    "Contemporary",
    "Fiction"
  ],
  "author": "ANSA Reads",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/123244650-godly-obsession"
}