{
  "title": "L'Ultima Primavera. Il riflesso segreto dei ricordi: Romanzo",
  "description": "UN SEGRETO DI FAMIGLIA, UNA MISTERIOSA VILLA IN TOSCANA, UN AMORE SENZA TEMPO \"Chi era Flora? Perché non mi avevano mai parlato di lei?... Avrei tanto voluto avere un abito o qualche oggetto che le era appartenuto. Per questo, mi ero già tanto affezionata alla villa. E ora, mi rendevo conto di iniziare ad amare anche il giardino. E il salice piangente sul bordo del laghetto. Emanava da essi un senso dolce di pace, come se un sogno d'amore vivesse tuttora in quel minuscolo angolo di mondo...\" Clemenza è una giovane insegnante; alla morte della nonna, una ex attrice degli anni Quaranta, riceve una strana eredità. Una casa in Toscana, di cui non ha mai saputo l'esistenza, dove aveva vissuto una sua misteriosa antenata, anch'essa sconosciuta. Con il ritrovamento di un manoscritto potrà rievocarne le vicende tornando al 1943, quando la villa è stata costruita, e rivivere il suo grande amore. \"Era come se, in quella casa, mi si fosse svelata una linea di demarcazione tra presente e passato...\" 1943 - \"Non so bene da quale parte cominciare. Ebbene, inizierò col dire che stiamo qui da appena un giorno e che vi rimarremo ben oltre l'estate, credo. Mio padre non fa che ringraziare la Provvidenza per avergli ispirato questa soluzione. Perché alcuni giorni fa è accaduto infine, ciò che lui temeva da tanto. E che molti pensavano, non sarebbe potuto avvenire mai. Roma, la Città Eterna, è stata bombardata...\" 1944 - \"I combattenti. Quando associo questa parola all'uomo che amo, il cuore si fa piccolo piccolo, paventando il pericolo. Darei tutta la vita che mi rimane, per salvare la sua... Mi ha chiesto di aspettarlo; lo aspetterò. Chissà, se riceverò presto sue notizie...\" 1945 - \"Lui si sporse leggermente, e mi baciò. Chiusi gli occhi, nell'incanto di quel bacio, e quando dopo li riaprii ero nel mio letto. Sola. Mentre la luce acerba dell'alba iniziava a rischiarare la mia stanza, sentii il cuore andare in pezzi...\" Un segreto nascosto nel tempo. Un amore struggente sullo sfondo della Seconda guerra mondiale e della lotta partigiana, in una storia che intreccia presente e passato.",
  "genres": [],
  "author": "Giulietta Esthel",
  "average_rating": "4.76",
  "url": "https://www.goodreads.com/book/show/40736243-l-ultima-primavera-il-riflesso-segreto-dei-ricordi"
}