{
  "title": "The Stinky Cheese Man and Other Fairly Stupid Tales",
  "description": "A revisionist storyteller provides his mad, hilarious versions of children's favorite tales in this unique and riotous collection.A long time ago, people used to tell magical stories of wonder and enchantment. Those stories were called Fairy Tales.Those stories are not in this book. The stories in this book are Fairly Stupid Tales.I mean, what else would you call a story like \"Goldilocks and the Three Elephants\"? This girl walking through the woods smells Peanut Porridge Cooking. She decides to break into the Elephants' house, eat the porridge, sit in the chairs, and sleep in the beds. But when she gets in the house she can't climb up on Baby Elephant's chair because it's much too big. And she can't climb on Papa Elephant's chair because it's much much too big. So she goes home. The End.And if you don't think that's fairly stupid, you should read \"Little Red Riding Shorts\" or maybe \"The Stinky Cheese Man.\"In fact, you should definitely go read the stories now, because the rest of this description just kind of goes on and on and doesn't really say anything. I stuck it here so it would fill up the page and make it look like I really knew what I was talking about. So stop now. I mean it. Quit reading this. Open the book. If you read this last sentence, it won't tell you anything.Signed,Jack (Narrator)Up the HillFairy Tale Forest1992\nStory List:\n- Chicken Licken- The Princess and the Bowling Ball- The Really Ugly Duckling- The Other Frog Prince- Little Red Running Shorts- Jack's Bean Problem (including Giant Story / Jack's Story)- Cinderummpelstiltskin (Or The Girl Who Really Blew It)- The Tortoise and the Hair- The Stinky Cheese ManSURGEON GENERAL'S WARNING: It has been determined that these tales are fairly stupid and probably dangerous to your health.Edition MSRP: $17⁹⁹ US (ISBN 0-670-84487-X)",
  "genres": [
    "Picture Books",
    "Childrens",
    "Humor",
    "Fiction",
    "Fantasy",
    "Fairy Tales",
    "Short Stories"
  ],
  "author": "Jon Scieszka",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/407429.The_Stinky_Cheese_Man_and_Other_Fairly_Stupid_Tales"
}