{
  "title": "The Sing-song Girls of Shanghai",
  "description": "Desire, virtue, courtesans (also known as sing-song girls), and the denizens of Shanghai's pleasure quarters are just some of the elements that constitute Han Bangqing's extraordinary novel of late imperial China. Han's richly textured, panoramic view of late-nineteenth-century Shanghai follows a range of characters from beautiful sing-song girls to lower-class prostitutes and from men in positions of social authority to criminals and ambitious young men recently arrived from the country. Considered one of the greatest works of Chinese fiction, The Sing-song Girls of Shanghai is now available for the first time in English.Neither sentimental nor sensationalistic in its portrayal of courtesans and their male patrons, Han's work inquires into the moral and psychological consequences of desire. Han, himself a frequent habitué of Shanghai brothels, reveals a world populated by lonely souls who seek consolation amid the pleasures and decadence of Shanghai's demimonde. He describes the romantic games played by sing-song girls to lure men, as well as the tragic consequences faced by those who unexpectedly fall in love with their customers. Han also tells the stories of male patrons who find themselves emotionally trapped between desire and their sense of propriety.First published in 1892, and made into a film by Hou Hsiao-hsien in 1998, The Sing-song Girls of Shanghai is recognized as a pioneering work of Chinese fiction in its use of psychological realism and its infusion of modernist sensibilities into the traditional genre of courtesan fiction. The novel's stature has grown with the recent discovery of Eileen Chang's previously unknown translation, which was unearthed among her papers at the University of Southern California. Chang, who lived in Shanghai until 1956 when she moved to California and began to write in English, is one of the most acclaimed Chinese writers of the twentieth century.",
  "genres": [
    "China",
    "Fiction",
    "Historical Fiction",
    "Chinese Literature",
    "Classics",
    "Asia",
    "Historical"
  ],
  "author": "Han Bangqing",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/407756.The_Sing_song_Girls_of_Shanghai"
}