{
  "title": "Camille Saint-Saëns: On Music and Musicians",
  "description": "Camille Saint-Saëns is a memorable figure not only for his successes as a composer of choral and orchestral works, and the eternally popular opera Samson et Dalila, but also because he was a keen observer of the musical culture in which he lived. A composer of vast intelligence and erudition, Saint-Saëns was at the same time one of the foremost writers on music in his day. From Wagner, Liszt and Debussy to Milhaud and Stravinsky, Saint-Saëns was at the center of the elite musical and cultural fin de siècle and early 20th-century world. He championed Schumann and Wagner in France at a period when these composers were regarded as dangerous subversives whose music should be kept well away from the impressionable student. Yet Saint-Saëns himself had no aspirations to being a revolutionary, and his appreciation of Wagner the composer was tempered by his reservations over Wagner the philosopher and dramatist, suspicious as he was of what he called \"the Germanic preoccupation with going beyond reality.\" Whether defending Meyerbeer against charges of facility or Berlioz against those who questioned his harmonic grasp, Saint-Saens was always his own man: in both cases, he claimed, it was \"not the absence of faults but the presence of virtues\" that distinguishes the good composer.  Saint-Saëns's writings provide a well-argued counter-discourse to the strong modernist music critics who rallied around Debussy and Ravel during the fin de siècle. And above all, they demonstrate a brilliantly sharp and active brain, expressing itself through prose of a Classical purity and balance, enlivened throughout with flashes of wit and, at times, of sheer malice. In this generously annotated volume, renowned scholar, seasoned translator and radio broadcaster Roger Nichols brings some of the composer's most striking and evocative writings brilliantly to life in English translation, many for the first time. Nichols has carefully chosen these selections for their intrinsic interest as historical documents to create a well-balanced and engaging view of the man, the music, and the age.",
  "genres": [],
  "author": "Roger Nichols",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/4076916-camille-saint-sa-ns"
}