{
  "title": "Women Writers of Traditional China: An Anthology of Poetry and Criticism",
  "description": "This anthology of Chinese women’s poetry in translation brings together representative selections from the work of some 130 poets from the Han dynasty to the early twentieth century. To measure the development of Chinese women’s poetry, one must take into account not only the poems but also the prose writings―prefaces, biographies, theoretical tracts―that framed them and attempted to shape women’s writing as a distinct category of literature. To this end, the anthology contains an extended section of criticism by and about women writers. These poets include empresses, imperial concubines, courtesans, grandmothers, recluses, Buddhist nuns, widows, painters, farm wives, revolutionaries, and adolescent girls thought to be incarnate immortals. Some women wrote out of isolation and despair, finding in words a mastery that otherwise eluded them. Others were recruited into poetry by family members, friends, or sympathetic male advocates. Some dwelt on intimate family matters and cast their poems as addresses to husbands and sons at large in the wide world of men’s affairs. Each woman had her own reasons for poetry and her own ways of appropriating, and often changing, the conventions of both men’s and women’s verse. The primary purpose of this anthology is to put before the English-speaking reader evidence of the poetic talent that flourished, against all odds, among women in premodern China. It is also designed to spur reflection among specialists in Chinese poetry, inspiring new perspectives on both the Chinese poetic tradition and the canon of female poets within that tradition. This partial history both connects with and departs from the established patterns for women’s writing in the West, thus complementing current discussions of “feminine writing.”",
  "genres": [
    "Poetry",
    "China",
    "Anthologies",
    "Nonfiction"
  ],
  "author": "Kang-i Sun Chang",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/407801.Women_Writers_of_Traditional_China"
}