{
  "title": "Self Navigate For Health: How everyone can learn to take charge, and get the most out of their health journey",
  "description": "If you have a medical illness or several, or if you are supporting a loved one, it may be overwhelming. Perhaps you have wondered how to keep up with tests, changes in medications, other doctors to see, and next steps to remember. You may wish you had someone to guide and direct you. In some places, there may be professional nurse navigators who can help with this. The reality though, is that most people do not have access to such navigators. You may ask, “How can I help myself, or my friend or a family member? Are there any helpful tips or suggestions? How can I stay on top of things and make sure I am getting the best out of my journey? How do I make the best of each visit with my physician? How do I know what symptoms to look out for, and when to call my physician?” You may not realize it, but in fact, anyone can learn to be their very own guide, even without medical training. Put simply, anyone can learn to \"self-navigate for health.\" This is a book written by a Hematology and Medical Oncology physician in clinical practice. She writes from her more than 14 year experience in the medical field. She provides helpful pointers to help people be more efficient self-advocates for their health. She also addresses important aspects pitfalls in consulting \"Dr. Google\", and what to do during a medical crisis. What makes the book good? 1. It has a great beginning. Dr. Njiaju starts by explaining what the book is all about and what YOU, the reader, can learn from reading the book. She gives just 9 steps you can take to get started in learning how to self-navigate for health. This first section is sure to have you thinking, \"I can see what this is all about, please tell me more.\" 2. It has specific numbered points in each section, with a detailed description following. This makes it very easy to follow. 3. The reader is motivated to get involved. There are simple actionable steps, and exercises at the ends of some sections. There are worksheets included at the end of the text, that one can use to input their health and related information. After reading the book and completing the exercises, the reader will convinced, confident and better able to take charge of their health journey. Also, the book is great for reference and self-help. The reader is sure to want to share what he or she has learned with others.",
  "genres": [],
  "author": "Uchenna Njiaju",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/40771346-self-navigate-for-health"
}