{
  "title": "Winds of Marque",
  "description": "\"Bennett R. Coles ranks among my go-to list in SF. Entertaining and intelligent storytelling and terrific characters. In Winds of Marque, Coles may well have invented a whole new subgenre that has me scrambling for a description--Steam Space?  Whatever you call it, a blast to read. Here's hoping that many more adventures are in the offing for Blackwood and company.\"  —Steven Erikson, New York Times bestselling authorThe first novel in an exciting science fiction series—Master and Commander in space—a swashbuckling space adventure in which a crew of misfit individuals in the king’s navy are sent to dismantle a dangerous ring of pirate raiders. In a dense star cluster, the solar winds blow fiercely. The star sailing ship HMSS Daring is running at full sheet with a letter of marque allowing them to capture enemy vessels involved in illegal trading. Sailing under a false flag to protect the ship and its mission, Daring’s crew must gather intelligence that will lead them to the pirates’ base.Posing as traders, Daring’s dashing second-in-command Liam Blackwood and brilliant quartermaster Amelia Virtue infiltrate shady civilian merchant networks, believing one will lead them to their quarry.But their mission is threatened from within their own ranks when Daring’s enigmatic captain makes a series of questionable choices, and rumblings of discontent start bubbling up from below decks, putting the crew on edge and destroying morale. On top of it all, Liam and Amelia must grapple with their growing feelings for each other.Facing danger from unexpected quarters that could steer the expedition off course, Blackwood and Virtue must identify the real enemy threat and discover the truth about their commander—and their mission—before Daring falls prey to the very pirates she’s meant to be tracking.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Steampunk",
    "Space Opera",
    "Fantasy",
    "Space",
    "Adventure"
  ],
  "author": "Bennett R. Coles",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/40765445-winds-of-marque"
}