{
  "title": "The Breakaway",
  "description": "From #1 New York Times bestselling author Jennifer Weiner comes a warmhearted and empowering new novel about love, family, friendship, secrets, and the power of a trip to change your life.Thirty-four-year-old Abby Stern has made it to a happy place. True, she still has gig jobs instead of a career, and the apartment where she’s lived since college still looks like she just moved in. But she’s got good friends, she’s got her bike, and her bike club in Philadelphia. She’s at peace with her plus-size body—at least, most of the time—and she’s on track to marry her childhood sweetheart. Abby and Mark met at the weight-loss camp Abby’s perpetually-dieting mother, Eileen, forced her daughter to attend. Fifteen years later, when Abby reconnects with a half-his-size Mark, and finds out that he still adores her, it feels like fate. Yet Abby can’t escape the feeling that something isn’t right…or the memories of one mind-blowing night spent with a man named Sebastian two years ago. So when Abby gets a last minute call to lead a group bike trip from New York City to Niagara Falls, she’s happy to have time away from Mark, and a chance to make up her mind. But on the first day, Abby is shocked when she sees a familiar face in the tour group—Sebastian, the one-night stand she never thought she’d see again. As a serial dater who lives a hundred miles away, Sebastian is far from Mr. Perfect, and Abby is determined to keep her distance, even if their chemistry is undeniable. To make things even worse, there’s a last-minute addition to the trip—Abby’s mother, Eileen, whom Abby blames for a lifetime of body shaming and insecurities she’s still trying to undo. Over the next two weeks, strangers become confidantes, hidden truths come to light, and a teenage girl with a secret will unite all the riders in surprising ways—while all of Abby’s certainties about herself, her mother, and the nature of love are challenged.",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Chick Lit",
    "Contemporary",
    "Adult Fiction",
    "Adult"
  ],
  "author": "Jennifer Weiner",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/123245868-the-breakaway"
}