{
  "title": "Warrior of My Own",
  "description": "My husband pushed back his chair and dropped to his knees in front of me. His head bowed — he spoke in a stream like a prayer.“I die when I am in the past, how dost ye know when tae declare me dead? You could decide it, call me dead, and I canna blame ye for it. Because I am. But I daena want tae be, I want tae live — with ye.” — Magnus 1702There are things left undone. Magnus must go home and Kaitlyn must go with him.Because it’s not enough for her to guide from afar. He needs her voice in his ear. They know now they are stronger together.He raised his eyes to mine and for a second time stood still. My mind said breathlessly, “Yes.” And I swore I could hear him say, inside my head, deep and resonating, “Aye.” — Kaitlyn 2018But Magnus learns there are cruel limits to his protection.Kaitlyn learns how dangerous it is to be responsible for a family.And together they learn that they have been at the mercy of someone far more brutal than they imagined.A contemporary romance with way more 18th century history and a bit more SciFi, Warrior of My Own is the third book in the Kaitlyn and the Highlander series.If you love mysterious, sexy, hunky heroes with desperate hearts and romantic thoughts, heroines with courage who are also very ordinary disasters, and love stories that encompass all time, then you’ll love this romantic series. Read on as Kaitlyn and Magnus begin as a family by picking up a copy of Book 1 today.Book 1 — Kaitlyn and the HighlanderBook 2 — Time and Space Between UsBook 3 — A Warrior of My OwnBook 4 — Begin Where We AreBook 5 — Entangled With YouBook 6 —Magnus and a Love Beyond Words Book 7 — Under the Same SkyBook 8 — Nothing but DustBook 9 — Again my LoveBook 10 — Our Shared Horizon",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Historical",
    "Fiction",
    "Audiobook",
    "Paranormal"
  ],
  "author": "Diana Knightley",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/40771485-warrior-of-my-own"
}