{
  "title": "Turning the Tide on Plastic: How Humanity (And You) Can Make Our Globe Clean Again",
  "description": "Enough plastic is thrown away every year to circle the world 4 times More than 8 million tonnes of plastic enter the oceans each year 300 million tonnes of new plastic is produced every year An estimated 15-51 trillion pieces of plastic now litter the world's oceans 38.5 million plastic bottles are used every day in the UK A million plastic bottles are used per minute around the world 500 million plastic straws are used per year Without big action, at the current rate, pieces of plastic will outnumber fish in the ocean by 2050. That is the legacy we are leaving our children and grandchildren. Plastic flows into our lives from every direction and most of it is not recycled. Instead it is incinerated or ends up in landfill, where it will sit for hundreds of years, or enters the world's seas where it fragments into tiny pieces to become microplastics - the environmental scourge of our times. Many of us had assumed that governments, brands and waste authorities were dealing with plastic on our behalf. But the impact of shows such as Blue Planet along with national beach cleans and high-profile campaigns have resulted in a collective wake-up call. If there were plans and strategies, they have not worked as we imagined. It would be easy to feel despondent but instead we need to turn our anger and emotion into action, starting by making a big dent in our own enormous consumption. Turning the tide on Plastic is here just in time. Journalist, broadcaster and eco lifestyle expert Lucy Siegle provides a powerful call to arms to end the plastic pandemic along with the tools we need to make decisive change. It is a clear-eyed, authoritative and accessible guide to help us to take decisive and effective personal action. Because this matters. When it comes to single-use plastics, we are habitual users, reaching out for plastic water bottles, disposable coffee cups, plastic straws and carrier bags multiple times a day. If only 12 of us adopt Lucy's 'reduce, rethink, refill, refuse' approach, we could potentially ditch 3K-15K single items of plastic in a year. When we consider our power as influencers - whether at school, the hairdressers, at work or on the bus - we suddenly become part of something significant. So now is the time to speak up, take action and demand the change you want to see in the ocean, in the supermarket aisles and on the streets. It's time to turn the tide on plastic, and this book will show you how.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Sustainability",
    "Science",
    "Nature",
    "Climate Change",
    "Self Help"
  ],
  "author": "Lucy Siegle",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/40773359-turning-the-tide-on-plastic"
}