{
  "title": "Along for the Ride",
  "description": "Vanessa Capri hates musicians. She has good reasons to, just not ones she's willing to talk about, even with her best friend, Sandy Thibeault. Vanessa has a long history with rock stars; as the daughter of a famous music producer, she's spent her life around them and knows about the seedy underbelly of the music business. She knows firsthand how the industry ruins lives and families, and she'll do anything in her power to stay away. Until the talent show at The Rosewood Academy for Academic Excellence--her boarding school for the rich and famous--where she sees Willmont Davidson perform. She recognizes his rare talent and knows he needs to audition for her father's new boy band. Except Willmont isn't buying what she's selling and seems to be immune to the lure of the music business. Vanessa is determined to get him on board, though she's also committed to maintaining her distance from the band. Especially when one of the members turns out to be someone from Vanessa's past--someone she's been trying for months to get over. But then her summer plans--relaxing at her house in the Hamptons with Sandy--are threatened when her best friend decides she wants to follow the band on tour. It's a dream come true for her to be the band's exclusive teen vlogger and Vanessa's dad loves the idea to help build buzz, so who is Vanessa to stop her? Sandy wants her to come along, but while Vanessa's not going to stop her friend, there's no way she's going on tour. Despite her efforts to stay away, Vanessa gets caught up in the tour preparations and starts not hating it (or the guys) as much as she would have expected. And then, when things start to go wrong, they don't just want her on tour, they need her. Will Vanessa rise to the challenge? And if she does will she be able to protect her heart from these boys who were built to be heartthrobs? Along for the Ride is the first book in The Rosewoods Rock Star series for readers who love swoony romantic comedies about rock stars and the girls who can't resist them.Note: The Rock Star books are companions to original Rosewoods series, but take place after it, beginning chronologically after Crossing the Line (book 10). There are some spoilers, but each series can be read independently.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Reverse Harem"
  ],
  "author": "Katrina Abbott",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/40791008-along-for-the-ride"
}