{
  "title": "Pinocchio",
  "description": "This award-winning graphic novel re-imagines the story Pinocchio as a noir fairy tale both comic and tragic. In this dark rendition, a greedy Geppetto builds Pinocchio as a metallic weapon of war, while Jiminy Cockroach is a homeless squatter living the good life in Pinocchio's skull. Critically acclaimed, Pinocchio won the Grand Prize at France's Angouleme comics festival in 2009. Exquisite drawings by celebrated cartoonist Winshluss bring to life a rich tale of greedy fools, lust, sadness, redemption, and hope. Teamed with brilliant colorist Cizo, Winshluss creates an epic adventure through a lush world. As we follow Pinocchio along the way, the stories and vinettes intertwine, offering subtle political critiques and send ups of popular culture. We meet seven sleazy dwarves, follow Jiminy's struggles as a novelist, watch a blind tramp find God, and see the innocent, yet powerful Pinocchio encircled by those who would use him for their own ends. Winshluss has perfected the wordless comic. Each page is perfectly composed - not a panel is wasted. The artwork is primarily done in pen and ink, and watercolor but switches to paint for larger splash panels. The art also references a terrific range of illustrative styles and history in the story from late 18th century pen and ink, to early French film pioneer Georges Melies, through early Disney, and underground comix. Born in 1970, Winshluss is the creator of numerous comics and graphic novels that have garnered awards and acclaim across Europe. Winshluss is the pen name of Vincent Parronnaud, perhaps best known as co-director of the animated film Persepolis (with Marjane Satrapi), which won the Jury Prize at Cannes and was nominated for numerous awards, including the Academy Award, Golden Globe and Cannes' Palm d'Or. Currently, he and Satrapi are teaming up again to adapt Satrapi's 2006 book \"Chicken with Plums.\"\"",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Bande Dessinée",
    "Fantasy",
    "Graphic Novels Comics",
    "Fiction",
    "Horror"
  ],
  "author": "Winshluss",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/10238365-pinocchio"
}