{
  "title": "The Paris Husband: How It Really Was Between Ernest and Hadley Hemingway",
  "description": "“A seasoned author and Hemingway scholar, Scott Donaldson brings this remarkable story to life with precision, lending keen new insight into Hemingway’s elusive character. A masterful work and a cracking good read.”—Valerie Hemingway, author of Running With the My Years with the HemingwaysErnest Hemingway was not only one of the most important 20th-century American writers, but also a man whose adventurous and colorful life has become the stuff of legend. War correspondent, ambulance driver, and big-game hunter, he was married four times and his love life was inextricably bound up with his artistic endeavors. His first marriage to Hadley Richardson—with whom he lived in Paris in the early 1920s—has long fascinated readers. Their passionate, complicated, and ultimately “doomed” relationship coincided with Hemingway’s formative years as a member of the so-called Lost Generation, and the failed marriage had a lifelong impact on the man and his writing.In The Paris Husband, author and Hemingway scholar Scott Donaldson deftly separates fact from fiction to present a spellbinding and clear-eyed account of this seminal period in Hemingway’s life. Brilliantly utilizing all essential primary and secondary sources—including the author’s notebooks and drafts—Donaldson breathes new life into this ageless story, providing revelatory insights into Hemingway’s character and exploring the nuances of a magical, yet troubled, love affair.For anyone interested in Hemingway’s development as an artist and why, as an older man, he continued to revisit this transformative and painful episode in his life, The Paris Husband is a lucid, accessible, and compelling narrative that will engage both diehard Hemingway fans, as well as those just discovering this iconic writer. Benefits of reading The Paris Husband: Get a glimpse of Hemingway’s life in Paris during his formative years as a member of the Lost Generation. Understand the passionate, complicated, and ultimately doomed relationship between Hemingway and Richardson. Learn how this failed marriage impacted Hemingway’s writing and his life.What's included in The Paris Husband:Separates fact from fiction to present a spellbinding and clear-eyed account of this seminal period in Hemingway’s life. Provides revelatory insights into Hemingway’s character. Explores the nuances of a magical, yet troubled, love affair. Don't miss out! Buy The Paris Husband now before the price changes!",
  "genres": [
    "Nonfiction"
  ],
  "author": "Scott  Donaldson",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/40805986-the-paris-husband"
}