{
  "title": "Red Queen 4-Book Collection: Books 1-4",
  "description": "Victoria aveyard red queen series 4 books collection set includes titles in this set :- red queen, glass sword, king's cage, war storm [hardcover]. Description:- Red Queen The Reds are commoners, ruled by a Silver elite in possession of god-like superpowers. And to Mare Barrow, a seventeen-year-old Red girl from the poverty-stricken Stilts, it seems like nothing will ever change.That is, until she finds herself working in the Silver Palace. Here, surrounded by the people she hates the most, Mare discovers that, despite her red blood, she possesses a deadly power of her own. One that threatens to destroy the balance of power. Glass Sword If there's one thing Mare Barrow knows, it's that she's different.Mare's blood is red - the colour of common folk - but her Silver ability, the power to control lightning, has turned her into a weapon that the royal court wants to control.Pursued by the vengeful Silver king, Mare sets out to find and recruit other Red-and-Silver fighters to join the rebellion. King's Cage Mare Barrow is a prisoner, powerless without her lightning, tormented by her mistakes. She lives at the mercy of a boy she once loved, a boy made of lies and betrayal.Now a king, Maven continues weaving his web in an attempt to maintain control over his country - and his prisoner.As Mare remains trapped in the palace, the remnants of the Red Rebellion continue organizing and expanding. As they prepare for war, no longer able to linger in the shadows, Cal - the exiled prince with his own claim on Mare's heart - will stop at nothing to bring her back. War Storm Mare Barrow learned this all too well when Cal's betrayal nearly destroyed her. Now determined to protect her heart-and secure freedom for Reds and newbloods like her-Mare resolves to overthrow the kingdom of Norta once and for all.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Dystopia",
    "Romance",
    "Audiobook",
    "Romantasy",
    "Magic"
  ],
  "author": "Victoria Aveyard",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/40814115-red-queen-4-book-collection"
}