{
  "title": "Love's Many Names",
  "description": "Here are truly inspired poems. They breathe a primeval freshness—with metaphysical and spiritual insight articulating perennial wisdom anew. They tell of the holiness of the ages, and in voicing multiple spiritual traditions, pronounce love’s many names. Yet the poet sings also of our own time: of the trauma of the refugee crisis in Europe and the Middle East, the suffering of the dispossessed. His verses are many-layered in their meanings and far-reaching in their range; they are musical yet stark in truth-telling, both playful and profound. These are poems to shape our vision, to commit to memory, to open our hearts to celestial truth and love. We can only be grateful that our age should be gifted with such a poet as Sam Davidson.“Sam Davidson’s first poetry collection, Love’s Many Names, is a passionate consideration of divine love. Writing nimbly in and out of form, Davidson reminds us that religious conviction can, and perhaps must, coexist with doubt, erotic longing, and the widespread evidence of human suffering. At his best, Davidson allows a fluid exploration of rhythm to both complement and extend his poems’ philosophical ambitions. A striking debut.”—JAMES ARTHUR, Johns Hopkins University; author of Charms Against Lightning“These poems by Sam Davidson lead the reader into Biblical types and shadows as they struggle to name the unnameable. Expressive and powerful, the poems continually break into music, played upon the poet’s ‘broken mandolin,’ chanting Kurdish and English songs of sorrow and love and rage. Lyrically despairing and hopeful at once, Davidson’s muse opens to emerging voices of terrible suffering and the potential for redemption.”—STANFORD J. SEARL, author of Quaker Poems: The Heart Opened and Homage to the Lady with the Dirty Feet and other Vermont Poems",
  "genres": [],
  "author": "Sam  Davidson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/40817594-love-s-many-names"
}