{
  "title": "Washington-Rochambeau Revolutionary Route and the Franco-American Alliance",
  "description": "Brings to life the extraordinary story of the crucial wartime alliance between France and America during the American Revolution. Starting in the Palace of Versailles and the coffeehouses of Paris more than a decade before the American Revolution erupted, shadow agents in international intrigue, warriors, statesmen, idealists and traitors all played crucial parts in events more improbable than fiction. Recounted through these lives and world events, the alliance, initiated in pragmatism but fueled by world-changing ideas, caused a world war, brought one government into being, led to the destruction of another, and still has impact today. Up until now, scholarly works on many aspects of the alliance have been written, but this meticulously researched, richly illustrated volume is the first to exquisitely pull the details together to engage and fascinate the general reading public. The major events in North America are linked to an included fold-out map based on the one that French General Rochambeau used for the campaign. Because there is a new National Park Service Historic Trail that retraces the routes the Allies took in their race to Yorktown, points of historical interest for travelers along the 9-state trail are listed with annotations.The President and CEO of Mount Vernon presented the book to President Macron of France and President Trump at the private dinner held at Mount Vernon for the two presidents and their wives. Richly full color illustrations throughout, heavy stock 8.5x11\"AUTHORS: With the encouragement of the Society of the Cincinnati and the American Society of the French Legion of Honor, Donna Passmore and Jan Smulcer researched, wrote, and illustrated the book. The authors are historians and creators of the Why America Is Free Curriculum, the upper elementary, integrated, enrichment curriculum that teaches national founding history and civic ethics in outstanding public and private schools in 15 states.",
  "genres": [],
  "author": "Donna Passmore and Jan Smulcer",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/40799454-washington-rochambeau-revolutionary-route-and-the-franco-american-allian"
}