{
  "title": "From Civil Rights to Human Rights: Martin Luther King, Jr., and the Struggle for Economic Justice",
  "description": "Martin Luther King, Jr., is widely celebrated as an American civil rights hero. Yet King's nonviolent opposition to racism, militarism, and economic injustice had deeper roots and more radical implications than is commonly appreciated, Thomas F. Jackson argues in this searching reinterpretation of King's public ministry. Between the 1940s and the 1960s, King was influenced by and in turn reshaped the political cultures of the black freedom movement and democratic left. His vision of unfettered human rights drew on the diverse tenets of the African American social gospel, socialism, left-New Deal liberalism, Gandhian philosophy, and Popular Front internationalism.King's early leadership reached beyond southern desegregation and voting rights. As the freedom movement of the 1950s and early 1960s confronted poverty and economic reprisals, King championed trade union rights, equal job opportunities, metropolitan integration, and full employment. When the civil rights and antipoverty policies of the Johnson administration failed to deliver on the movement's goals of economic freedom for all, King demanded that the federal government guarantee jobs, income, and local power for poor people. When the Vietnam war stalled domestic liberalism, King called on the nation to abandon imperialism and become a global force for multiracial democracy and economic justice.Drawing widely on published and unpublished archival sources, Jackson explains the contexts and meanings of King's increasingly open call for \"a radical redistribution of political and economic power\" in American cities, the nation, and the world. The mid-1960s ghetto uprisings were in fact revolts against unemployment, powerlessness, police violence, and institutionalized racism, King argued. His final dream, a Poor People's March on Washington, aimed to mobilize Americans across racial and class lines to reverse a national cycle of urban conflict, political backlash, and policy retrenchment. King's vision of economic democracy and international human rights remains a powerful inspiration for those committed to ending racism and poverty in our time.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "The United States Of America",
    "African American",
    "American History"
  ],
  "author": "Thomas F. Jackson",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/408273.From_Civil_Rights_to_Human_Rights"
}