{
  "title": "Capital: Volume 1",
  "description": "It can be said of very few books that the world was changed as a result of its publication - but this is certainly the case of Capital: A Critique of Political Economy by Karl Marx (1818-1883). Volume 1 appeared (in German) in 1867, and the two subsequent volumes appeared at later dates after the author's death - completed from extensive notes left by Marx himself.Marx, famously writing in the Reading Room of the British Museum, set out to draw on theories of labour, money and economics developed by many key figures in previous centuries and then present a vivid picture of the effect of (as he saw it) the vicious exploitation of labour and the power-play and greed of that class of unprincipled businessmen - the capitalists. He starts by considering commodity, value and exchange. In doing so he looks at the basic processes involved in labour productivity and how it turns into excessive surplus value at the expense of the labourer himself. But do not think that that this is a dry analysis of the nuts and bolts of economics. Soon Marx, from extensive research, begins to outline the horrifying effect of the industrial revolution (for all its benefits) on the working man, woman and child, the blighting of their lives and slow, oh so slow, march of correcting Acts of Parliaments through the 19th century. These two threads - exploitation economics and the personal plight of the worker - continue to be developed side by side and intertwine with conclusions to become a truly powerful and emotional polemic.Sometimes it becomes clear that his observations are hugely relevant to our 24 hour life, our gig economy and our international economy, with a frightening percentage of world wealth being held in a few hands. This is not an easy book but, especially in the hands of Derek Le Page, who has incorporated all the relevant footnotes (and they are extensive), it is a compelling listen. Whatever the nightmare of 20th century communism, to ignore this book is misjudge it. Marx said, 'Philosophers have previously tried to explain the world; our task is to change it'. And he meant it.Translation: Samuel Moore and Edward Aveling.Public Domain (P)2018 Ukemi Productions Ltd",
  "genres": [
    "Philosophy",
    "Economics",
    "Politics",
    "Nonfiction",
    "History",
    "Classics",
    "Theory"
  ],
  "author": "Karl Marx",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/40846903-capital"
}