{
  "title": "The Burning of the World: The Great Chicago Fire and the War for a City's Soul",
  "description": "WINNER OF THE MIDLAND AUTHORS AWARD FOR HISTORY • LONGLISTED FOR THE ANDREW CARNEGIE MEDAL FOR EXCELLENCE • A NEW YORKER BEST BOOK OF THE YEAR • The \"illuminating\" (New Yorker) story of the Great Chicago a raging inferno, a harrowing fight for survival, and the struggle for the soul of a city—told with the \"the clarity—and tension—of a well-wrought military narrative\" (Wall Street Journal)In the fall of 1871, Chicagoans knew they were due for the “big one”—a massive, uncontrollable fire that would decimate the city. It had been bone-dry for months, and a recent string of blazes had nearly outstripped the fire department’s already scant resources. Then, on October 8, a minor fire broke out in the barn of Irishwoman Kate Leary. A series of unfortunate mishaps and misunderstandings along with insufficient preparation and a high south-westerly wind combined to set the stage for an unmitigated catastrophe.     The conflagration that spread from the Learys' property quickly overtook the neighborhood, and before long the floating embers had been cast to the far reaches of the city. Nothing to the northeast was safe. Families took to the streets with every possession they could carry. Powerful gusts whipped the flames into a terrifying firestorm. The Chicago River boiled. Over the next forty-eight hours, Chicago fell victim to the largest and most destructive natural disaster the United States had yet endured.     The effects of the Great Fire were devastating. But they were also transforming. Out of the ashes, faster than seemed possible, rose new homes, tenements, hotels, and civic buildings, as well as a new political order. The elite seized the reconstruction to crack down on vice, control the disbursement of vast charitable funds, and rebuild the city in their image. But the city’s working class recognized only a naked power grab that would challenge their traditions, hurt their chances to keep their hard-earned property, and move power out of the hands of elected officials and into private interests. As soon as the battle against the fire ended, another battle for the future of the city erupted between its entrenched business establishment and its poor and immigrant laborers and shopkeepers.     An enrapturing account of the fire’s inexorable march and an eye-opening look at its aftermath, The Burning of the World tells the story of one of the most infamous calamities in history and the new Chicago it precipitated—a disaster that still shapes American cities to this day.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Politics",
    "American History",
    "Adult",
    "American"
  ],
  "author": "Scott W. Berg",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/123258613-the-burning-of-the-world"
}