{
  "title": "All or Nothing",
  "description": "Wurdest du auserwählt?\nSawyer Smith schickt sich an, die Welt zu erobern, und da er nur noch wenige Tage bis zu seinem Abschluss hat, hofft er, seinen hübschen besten Freund und Nachbarn davon überzeugen zu können, ihn zu begleiten. Es gibt nur ein Problem: Draco hat ein Geheimnis, ein großes, schuppiges Geheimnis, und es ist dabei, Sawyers Leben für immer zu verändern.Als drei mysteriöse Männer in das neue Anwesen gegenüber einziehen, stürzt Sawyer in eine fantastische Welt, von deren Existenz er bisher nichts ahnte. Die Entdeckung, dass Draco ein Drachenwandler und Wächter des Auserwählten ist - ein Wesen, das von der Göttin geschickt wurde, um die zerbrochene Magie des Reiches wiederherzustellen - ist nur die Spitze des paranormalen Eisbergs.In diese seltsame neue Welt hineingezogen zu werden, ist schon hart genug, doch dann fühlt sich Sawyer auch noch zu allen Wächtern des Auserwählten hingezogen: nicht nur zu Draco, sondern auch zu dem stillen und grimmigen Vampir Andvari, dem sanften Magier Henry und dem gerissenen Greif Eduard.Und, ach ja, nebenbei stellt sich auch noch heraus, dass nicht alle magischen Kreaturen friedfertig sind. Mächte, die sich gegen den Auserwählten verbündet haben, wollen die Wächter vernichten, damit die Prophezeiung nie erfüllt werden kann.Das größte Problem von allen ist jedoch, dass Sawyer, sobald der Auserwählte gefunden ist, in sein langweiliges Menschenleben zurückkehren muss ... allein.Aber in der paranormalen Welt gibt es keine halben Sachen. Als die Gefahr immer größer wird, muss sich Sawyer entscheiden, ob er die Männer, die ihm ans Herz gewachsen sind, hinter sich lassen oder alles für eine gemeinsame Zukunft riskieren will.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Vampires",
    "Magic"
  ],
  "author": "Macy Blake",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/40850343-all-or-nothing"
}