{
  "title": "Running from Scissors",
  "description": "A runner disappears under mysterious circumstances. Nobody suspects murder, except Lacy. And she knows if-or, more likely, when-the body turns up, all fingers will be pointing at her. How do you outpace a corpse, outwit a scissor-wielding maniac, outrun a handsome detective, and prove not only Whodunit but Howdunit? Let the race begin... Lacy Purdy loves her new town, her new job, and her old cat, Meatball. And she loves to run. This summer, she'll be running for her life. A phantom lurks in the shadows of Run For It, the local running store, terrorizing an unpopular run group leader with an arsenal of sharp, shiny scissors. Lacy can't stand mean-girl Marlene and everybody knows it, so when she mysteriously disappears in the middle of a run, Lacy suspects foul play. Everyone else suspects Lacy. Enter Ruby Maplethorpe, an acerbic senior citizen who befriends Lacy and her feisty friend Stax, an indie bookseller. Ruby warns that someone in their circle is not who they seem, and they'll need her help if they want to stay one stride ahead of both the killer and the law. And she should know about murder, because Ruby is none other than classic mystery novelist Pearl Oakley, who spent a lifetime devising her own intricate plots. Finding herself cast as a character in someone else's story, Ruby's more than happy to accept the challenge. But Lacy isn't sure if Ruby is reading the clues correctly. Is the course they're on rocketing them towards a final solution or a dead(ly) end? Join the running store ladies-Lacy, Ruby, and Stax-in a race against time to unmask a diabolical killer before Lacy becomes the prime suspect. . .or the next victim. Running from Scissors is the first adventure in the deliciously addictive new 'Running Store Mystery' series by T.C. Wescott. If you love funny, juicy, twisty page-turners with cuddly cats, book stores, impossible murders, midnight rambles, and cozy environs brimming with mystery, then you will love Running from Scissors.",
  "genres": [],
  "author": "T.C. Wescott",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/40843837-running-from-scissors"
}