{
  "title": "Fire Master",
  "description": "A journeyman, ill-equipped to be the new fire mage, will need strength and skills to save an increasingly unstable world in this second installment of a YA series.Now that his master is dead, apprentice Loby is the likely candidate to take the role of fire mage. But as he’s never learned the secret of fire, he doesn’t want the responsibility of being one of the five elemental mages. Meanwhile, citizens of the kingdom of Romatica are understandably on edge, as the land is burdened by recurrent earthquakes and unseasonably icy weather. In order for earth mage Myrlo to calm the “distressed” planet, he’ll need to make a volcano—but that would require a fire mage at full power. Loby may find the secret of fire in the atom-sized world of Nanosia, which is populated by the universe’s elementary particles. He’ll also be able to stop Romatica’s despicable King Cestor, who’s in Nanosia to collect the invincible powers an oracle has promised him. Luckily, Loby has help from Prenda, a girl who may share his hankering for romance, as well as Pyck, his half brother, who, after leaving six years ago, has inexplicably returned to Romatica. As in the fantasy series’ first installment, Johnson (Queen of the Quantum Realm, 2017, etc.) aptly incorporates science into her fictional tale. For example, Nanosia resident Higgy (as in the Higgs field), who plans to abandon his duty of providing mass to particles, could destroy the entire universe. But the author is a skilled storyteller in multiple Pyck is especially mysterious, as readers know he’s in Romatica on some sort of “mission.” Furthermore, some scenes play out twice, with alternating points of view. It masterfully adds character While Loby is indisputably sympathetic, Pyck’s perspective makes the protagonist’s plea for help almost sound like babbling (“The earthquake, the cold….See there’s this girl”). The narrative’s speedy pace, from the beginning to the satisfying conclusion, never falters.A thoroughly enjoyable fantasy sequel that should make readers crave yet another visit to Nanosia.--Kirkus",
  "genres": [],
  "author": "Rhonda Denise Johnson",
  "average_rating": "4.93",
  "url": "https://www.goodreads.com/book/show/40865292-fire-master"
}