{
  "title": "Hangover Square",
  "description": "Every season in recent years Random House has had the great good fortune to head its fiction list with a book by a hitherto little-known or emerging author that captured the imagination of the critics and the public. And here we are again! For we believe that Patrick Hamilton's tense novel, Hangover Square, will duplicate the success of The Ox-Bow Incident, What Makes Sammy Run? and Storm—although it is indeed as different from any one of these books as one could possibly imagine.   Hangover Square is an adventure in a rather sinister corner of London in the year immediately preceding the present war. The characters are for the most part blighted young wasters, with just enough money and just enough education to be dangerous to themselves and to society. Among, yet not one of them, is the large inarticulate George Bone, the victim of a strange dual personality, and enslaved to an appalling girl named Netta. This Netta inevitably will remind the reader of Mildred in Of Human Bondage; he will watch with grim fascination the shambling efforts of the ineffectual hero to escape from the spell of this girl and her devious companions, and the inevitable conclusion to his mad affaire.   Hangover Square is an enormous success in England. The conservative New Statesman hailed it as: “A most important book, judged either as a novel of our time or a thriller. It can hardly be overpraised; it is tense, exciting and frightening…Its atmosphere is overpowering!”   As noted above, readers of advance copies in America have unfailingly mentioned Of Human Bondage in their reports. Others have been reminded of An American Tragedy and Before the Fact. It is a dangerous thing to launch a new novel with comparisons such as these, but in the case of Hangover Square the publishers are willing to fling caution to the winds.",
  "genres": [
    "Fiction",
    "Classics",
    "Mystery",
    "Crime",
    "British Literature",
    "Novels",
    "Noir"
  ],
  "author": "Patrick Hamilton",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/40872310-hangover-square"
}