{
  "title": "Female, Recreational II: Kenneled",
  "description": "The second book of the five-book Female, Recreational series, published between January 2017 and January 2021. It deals explicitly with sex and other topics, and is meant for readers over 18. Laura reached into her bathrobe pocket, pulled out two sheets of paper, stapled in the upper corner. It was the contract Hannah had signed on the day she was bought, almost a year ago. Laura slid it across the table to Hannah, and Hannah smoothed it out and glanced over it, remembering the day she’d signed it, her last day waking up in the place they called the stacks before she was brought home, to the Petrosyans. “What does that fourth term say, Hannah?” Laura asked. “Oh,” Hannah said, her stomach knotting around what little food it held. She flipped to the second page of the document, saw where she’d signed it, turned back to the first page. “It says, um, ‘You will take care of yourself physically and mentally, alerting us if you notice anything amiss and accepting any care provided. You will not harm or endanger yourself in any way. Cutting, taking non-prescription narcotics and unnecessary risk-taking are strictly forbidden.’” “What do you think of all that, Hannah?” Laura asked. “I think it makes sense,” Hannah said. “It’s to protect me. And I broke it, and—\" “What does the ninth term say?” “Um, oh, uh, ‘Should you be disobedient, we promise to punish you fairly and consistently. In the event of an infraction, you will receive a clear description of how you have fallen short, and will be given a chance to explain yourself prior to being punished. Punishments may include but not be limited to verbal reprimand, loss of rewards or privileges, additional confinement, additional restraints, corporal punishment, and sale.’” “Would you like to explain yourself?” Laura asked. Hannah looked up into Laura’s eyes, trying to convey all the contrition she felt. “I don’t think I can explain myself,” Hannah said. “I broke a rule. I have no excuse. I did it on purpose.” “You did,” Laura agreed. “How should we punish you?” “Oh,” Hannah said, and her eyes went to the contract, and she saw the word “sale,” and felt her throat close. Was that what this was about? Was Laura going to sell Hannah? For a pill? Or for other reasons, that couldn’t be spoken of out loud? “I don’t think I should be sold,” Hannah said, eyes filling with tears as the terror of the unknown overtook her. “I’m sorry. I won’t do it again. Please. I—” “We’re not going to sell you,” Laura said, and she smiled for the first time. “Thank you, Ma’am.” “But you understand how serious this is.” “I do.” “What do you recommend then?” “Well . . .” Hannah said, wiping her eyes with her fingers, pushing her hair behind her ears and looking at the other consequences in the contract. This was way beyond verbal reprimand, she knew. “Additional confinement?” Hannah offered. “Additional restraints? I could stay in, um, my shackles, in my, um, space, and you could—” “I don’t think that’s enough,” Laura said.",
  "genres": [
    "BDSM"
  ],
  "author": "Badger Therese",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/40868391-female-recreational-ii"
}