{
  "title": "The Four Horsemen: Books 1-3",
  "description": "What's worse than being pursued by the Four Horsemen? Discovering you're the Fifth.\n Dive into this urban fantasy series from USA Today bestselling author LJ Swallow.Prepare to follow the lives of Vee and the Four Horsemen through addictive books filled with action, supernatural suspense and magic. Discover why readers have fallen in love with the books--and the Horsemen!  LEGACYVerity Jameson's day switches from mundane to disastrous when she runs down a stranger with her car. Fortunately for Vee, she can't kill Death. Death, who just happens to be one of the Four Horsemen, and he's looking for her.The Four Horsemen spend life preventing the end of the world, not bringing on an apocalypse. Without their fifth member, the Four Horsemen are losing the battle. Now they've found Verity and what they tell her goes far beyond the conspiracy theories she spends her free time investigating.A new life with four dark, sexy and dangerous men fighting demons, vampires and fae? Not what Vee had planned, but a hell of a lot more interesting than her boring job in tech support.So what happens when the unbreakable bond of the Five takes control in a way none of them expected? BOUNDWhat happens when you discover Truth is a lie?Ewan's shock revelation sends Vee's life further into chaos, and she faces an uncertain future in a secret world she never knew existed.The Four Horsemen now have their missing link and will each do anything to protect and support her, but Vee's determined to show them she can be their equal.When Vee joins the Four Horsemen's hunt for those behind the plot to murder a fae queen, she discovers society faces bigger dangers than she realised. One night changes everything and increases Vee's determination to harness her power and step into her new role. The group are about to find out exactly how powerful Truth is.  \nHUNTED\n \nWho is Vee? Where did she come from? And what is the darkness the fae can see inside her?\n Xander's reaction to these questions drives a bigger wedge between the fae and the Horsemen. His move isn't popular with the others because right now they need fae help more than ever. A bloody message and a series of murders lead to a search for a threat from the past. Instead, the Horsemen encounter something new and dangerous. The race is on to find out what the creatures are and how big a threat they are to an already chaotic world. Vee discovers using her powers has a strange effect on her relationship with the Horsemen. Although this pulls her closer to the guys, the conflict between Vee and Xander continues. But is the greatest conflict within himself? And as the Five search for answers, someone watches. What does he know and can he help? Or does he have an agenda of his own?  The box set contains the first three books in the series: LEGACY, BOUND and HUNTED. The Four Horsemen is an urban fantasy series with a reverse harem twist. The booksslow burn to steamy scenes, have a kickass heroine, and four guys who'll do anything for the girl who's the centre of their world. \nThis is NOT the complete series.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Fiction",
    "Paranormal Romance"
  ],
  "author": "L.J. Swallow",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/40872686-the-four-horsemen"
}