{
  "title": "The Elsinore Sewing Club",
  "description": "NEW PERSPECTIVES ON THE RESCUE OF THE DANISH JEWS The rescue of the Danish Jews from German persecution during World War II remains a small yet very significant chapter in world history, as well as one of the proudest moments in Danish history. 2018 marks the 75th anniversary of the remarkable event where so many Danes spontaneously mobilized to help defy the persecution of the Jews. In this new book, The Elsinore Sewing Club, interesting new perspectives are given on the event. The book tells the inspiring story of the Danish resistance group the Elsinore Sewing Club. During the winter of 1943-44 they played a crucial role in maintaining the connection between occupied Denmark and the free Sweden by daily illegal transports over the narrow strait, the Sound. The bookbinder Erling Kiær defied his seasickness and sailed back and forth, day and night, through the tightly patrolled, ice-cold and mined waters. Illegally transporting refugees, resistance fighters, spies, courier post, weapons and other compromising material.Kiær and the Sewing Club are especially well-known for their efforts in the rescue of the Danish Jews. It is estimated that they transported around 700 Jews to Sweden. For this action alone, the Sewing Club has gained an honorable place in world history - in the Holocaust Museum in Washington DC, you will find one of the three boats they used, exhibited as a symbol of light in this otherwise dark chapter in mankind’s history. Though much has already been written about the rescue of the Danish Jews, the book stands out in two ways. Firstly, it is the first study to closely examine the local infrastructure behind this impressive spontaneous humanitarian action. In the book you get to know the main characters (many of the stories in the book are rendered directly in the voices of the protagonists), get an insight into the group’s work and wide-ranging organization. Secondly, it is a book that also clearly illustrates the high price that many of the helpers had to pay for their efforts - several of them even paid the ultimate price, killed either in action or in concentration camps. In the literature on the rescue of the Danish Jews it is often stated that the Germans were not that vigilant, giving the impression that the rescue operation was without much peril. The story of the Sewing Club gives a more nuanced picture. Though thoroughly researched – with many firsthand interviews and access to many previously unpublished sources – the book is written in a style for all to read. Søren Gulmann & Karina Søby Forlaget fantastiske fortællinger (www.fantastiskefortaellinger.dk)150 pages, 62 illustrations, 2 25$Released on 4 January 2018",
  "genres": [],
  "author": "Søren Gulmann",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/40879601-the-elsinore-sewing-club"
}