{
  "title": "Red Winter: The Complete Trilogy",
  "description": "If Emi is sure of anything, it's that kami—the gods—are good, and yokai—the earth spirits—are evil. But when she saves the life of a fox shapeshifter, the truths of her world start to crumble. And the treachery of the gods runs deep.  Red Winter: The Complete Trilogy includes three breathtaking novels that follow Emi as she grows from an uncertain shrine maiden to a divine warrior who must choose whether to bow to duty or fight for her life.  The trilogy also features 30 full-page illustrations by award-winning artist Brittany Jackson.  \"An enchanting tale of fantastical magic, supernatural creatures, mysterious heroes, and forbidden romance, [set] against a wildly gorgeous and exotic backdrop.\" - Flylef Reviews  \"Red Winter was full of magic, action, romance, a whole lot of intrigue and an amazing set of characters ... honestly one of the books that I will read again and again.\" - Chaotic Reader  Keywords: Contemporary fantasy, romantic fantasy, Asian mythology  -- Red Winter (Book 1):  Emi has spent her entire life hiding from the creatures that hunt her. The savage earth spirits are determined to kill her before she can become the living host of a goddess, so she stays hidden—until the day she saves the life of a kitsune.  Shiro isn't the harmless fox spirit she thought he was. He's mysterious, cunning, unpredictable … and now hers to command. He's sworn to pay his debt to her, but he doesn't know who she is. If he finds out, he'll kill her.  But she can't send him away—not yet. Her future isn't what she thought. The lies surrounding her fate have begun to unravel, and she needs answers before time runs out—answers that lie in the spirit realm. Shiro can take her there … if she dares to trust him.  And only then will she find out how deep the gods' treachery runs.  -- Dark Tempest (Book 2):  Emi has dedicated her life to becoming the perfect vessel for the goddess Amaterasu, but the insidious betrayal of another deity has changed everything. Now Amaterasu has charged Emi with an urgent mission: to find and free the earthly gods before mankind is brought to its knees beneath divine tyranny.  At her side is Shiro, the mysterious fox spirit. When she first saved his life, she could never have imagined that behind his cunning and confidence, he was lost—his power bound by a devastating curse and his memories obscured. His veiled history is somehow tied to the missing gods, but he can't remember how or why.  As their search leads them into the murky depths of the spirit realm, the shadows of Shiro's past begin to emerge. With each brief awakening of his true self, she loses a little more of him. The fate of the heavens and earth rest in her mortal hands, and she must find the missing gods before time runs out for her world—and for Shiro.  -- Immortal Fire (Book 3):  Once, Emi believed the heavenly gods were righteous and wise, while the earthly yokai spirits were bloodthirsty and evil. But with a traitorous deity poised to destroy her world, and the yokai standing as humanity's only defense, the lies of her upbringing have toppled to reveal a far more terrifying reality. ​ Despite the looming threat, Emi can't escape her greatest distraction: Shiro, the fox yokai who has so deftly claimed her heart for his own.",
  "genres": [
    "Fantasy",
    "Romance",
    "Urban Fantasy",
    "Mythology",
    "Young Adult",
    "Audiobook",
    "Fantasy Romance"
  ],
  "author": "Annette Marie",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/40884349-red-winter"
}