{
  "title": "Titan: Kingdom of the Dead",
  "description": "The Gods War Explodes into the Greek Underworld!\n\n*** THE FIRST 3 BOOKS IN THE GODS WAR SERIES WILL ALL BE RELEASED BY JULY 27, 2018! \"My name is Andrus Eaves. Warrior. Fugitive. I have fled the tyranny of the New Greece Theocracy to Tartarus, the Kingdom of the Dead. There I seek to free Hades, God of Death, from the prison the cruel Titans made for him. I travel across a barren, molten land—a nightmare land plagued by ghosts and monsters. I must fight centaurs, harpies, and giants. I must fight myself and the secret heritage that grants me the power of earth magic. If I succeed in my quest, Death will return to the world, the Titans will fall, and their Theocracy crumble. And if I fail, humanity is doomed…\" In this stunning Book 2 in the series, Andrus, Mark, and Hannah must venture deep into the depths of Tartarus to free Hades. But they won't get there without a fight! A lot of them... See our heroes clash with power-mad Titans, Cerberus the three-headed hound of hell, centaurs, harpies, ghosts, giants, cyclopes, and all kinds of gruesome supernatural monsters! Don't miss this thrilling action adventure series from Star Wars: Vengeance and Spider-Man 3 actor Daniel Mignault & USA TODAY bestselling author Jackson Dean Chase. \n*** TITAN is the STUNNING new book BUZZFEED calls “IRRESISTIBLE” and “A HEART-POUNDING STORY FULL OF SUSPENSE, ROMANCE, AND ACTION!” ***\n It's the perfect FAST-PACED THRILLER FOR SERIOUS FANS of Urban Fantasy, Dystopian Fiction, Superheroes, and Greek Mythology. BUY NOW, READ TODAY if you like books by Shayne Silvers, Jim Butcher, Benedict Jacka, Kevin Hearne, Rick Riordan, JK Rowling, Michael Anderle, Orlando A. Sanchez, KF Breene, Shannon Mayer, CN Crawford, Ilona Andrews, or Patricia Briggs. Take Titan: Kingdom of the Dead for a spin. You'll love the magic, mystery, and danger! The Gods War 2018 Release Schedule:  Titan (Book 1) — OUT NOW  Titan: Kingdom of the Dead (Book 2) — OUT NOW  Titan: Gift of Death (Book 3) — July 27  The Gods War eBook categories: \nDark Fantasy  Witches & Wizards   Myths & Legends   Supernatural Thriller   Urban Fantasy Thriller   Dystopian   Coming of Age   Angels & Demons   Science Fiction & Fantasy   Supernatural Mystery and Suspense \n*** Scroll up and tap or click BUY NOW to dive head-first into this EPIC ADVENTURE filled with Gods, Titans, Centaurs, Harpies, Ghosts, and Witches! ***",
  "genres": [],
  "author": "Daniel Mignault",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/40884064-titan"
}