{
  "title": "Emeline",
  "description": "Every town has stories of its past, and Havenwood Falls is no different. And when the town’s residents include a variety of supernatural creatures, those historical tales often become Legends. This is but one . . . \n  Emeline Fairchild couldn’t imagine a more perfect match for herself than Drayan Bishop. Her real-life Prince Charming, a powerful mage, freed her from a curse, and she wakes to a new world in a new century. She finds herself in 1913, in a beautiful town in the Colorado mountains, and with Drayan by her side. With such an enchanted beginning, their union would be nothing short of magical. Their love is full of fire and passion—some might say obsession. But as the much anticipated wedding approaches, Emeline soon finds the magic turning dark.  When tragedy comes to their burgeoning little town, Emeline is forced to ask what lengths Drayan went to in order to break her curse. Emotions and trust unravel, but Emeline’s new art master shows her that light is a far greater power than the dark. But is her light enough to defeat the darkness of a jealous and insane mind? Or is it too late to save the true love of her life?  The Havenwood Falls shared world is a collaborative effort by multiple authors across multiple series all in the paranormal fantasy genre, allowing readers to discover new authors and stories to fall in love with. Each author brings a stand-alone plotline, so they can be read in any order, but there are many crossovers among the stories.  Books in the Legends of Havenwood Falls historical fantasy series: • Lost in Time by Tish Thawer • Dawn of the Witch Hunters by Morgan Wylie • Redemption’s End by Eric Asher • Trapped Within a Wish by Brynn Myers • Blood and Damnation by Belinda Boring (Aug. 2018) • Fated Beginnings by E.J. Fechenda (Sept. 2018) • Emeline by Katie John (Oct. 2018) Coming soon are books by Kallie Ross, Morgan Wylie, and more.  Also look for our signature Havenwood Falls, a New Adult/Adult series, and Havenwood Falls High, a Young Adult series.  Immerse yourself in the world of Havenwood Falls and stay up-to-date on news and announcements at www.HavenwoodFalls.com. Join our reader group, Havenwood Falls Book Club, on Facebook at https://www.facebook.com/groups/Haven...",
  "genres": [],
  "author": "Katie M. John",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/40881862-emeline"
}