{
  "title": "Unsinkable: A Novel",
  "description": "AN INSTANT USA TODAY BESTSELLERThe Titanic was only the beginning. What she survived has become legend. What she survived has become legend. Inspired by true stories of survival and resilience, Unsinkable entwines the lives of two women, one from World War 1 and another from World War 2, as they face adversity and take hold of the second chances given to them.Violet Jessop is Miss Unsinkable.After her mother becomes too ill to work, the responsibility to provide for the family falls to Violet as the oldest of nine. When the world enters the Great War, she serves as a nurse, helping men who could very well be her brothers. Working as a stewardess and wartime nurse, Violet not only survives a shipwreck but also two sinkings, one on the infamous Titanic. No one can understand why she would return to sea, but something keeps drawing Violet back to the tumultuous waters, where she struggles to put the tragedies of her past behind her and pursue a life and love all her own.Daphne has survived calamity of her own.Daphne Chaundanson grows up as an unwanted child after her mother died in a tragedy. She throws herself into education, collecting languages like candy in a desperate attempt to finally earn her father's approval. When the Special Operations Executive invites her to be an agent in France in World War II, her childhood of anonymity and her love of languages make her the perfect fit. She sees it as an opportunity to help the country she loves and live up to her father's expectations. But the dangers of war challenge Daphne in ways she never could have expected, and the secrets from her own past must be faced for her to truly have a future beyond the conflict--if she can survive it.Inspired by true stories of Violet Jessop and the thirty-nine women of the Special Operations Executive. Two unsinkable women. Two stories of survival, family, and finding one's own happiness. One connection that reshapes both their lives forever.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "World War II",
    "Adult",
    "War"
  ],
  "author": "Jenni L. Walsh",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/123266554-unsinkable"
}