{
  "title": "The Boyfriend Game",
  "description": "Fake boyfriends for a week? Yes, please.  Carter Olson never expected he’d get a chance to date his older brother’s best friend, Rip Taylor. Wished for it? Yes. Fantasized about it? Possibly too much. But ever thought it would actually happen? Not in a million years, since Rip is straight. But even if it’s just to try and win a gay game show, having Rip for a boyfriend—even a temporary/pretend one—is still the best thing to happen to Carter in... well, ever. Especially because Rip’s so good at it. Amazingly good, actually. So good that Carter starts to hope that maybe it won’t have to end once the show’s over…  If there are two things Rip Taylor lives for, they’re having fun and being there for his friends, so a trip to Vegas to help surprise his best friend’s girlfriend with a big, flashy proposal sounds awesome. And even more fun? His bestie's plan to try and win some prize money for the wedding by signing the two of them up as contestants on The Boyfriend Game. The game show is sponsored by the gay dating app bLoved, and Rip is all in. He may be straight, but he's never been narrow, and when circumstances (aka a best friend who can't hold his tequila) mean that little Carter Olson gets roped into being Rip's fake boyfriend instead, that’s almost better… because who wouldn’t be able to be a convincing boyfriend to Carter? After all, Carter’s hella sweet. Kind of adorable, actually. And really, really easy to get into character with…  Winning The Boyfriend Game? Rip and Carter have it in the bag.  The Boyfriend Game is a gay romance novel of approximately 75,000 words that contains some confusion about tops and bottoms, a straight guy who realizes he isn’t, an ice cube that melts much too fast, and the kind of luck that can only be found in Vegas. Every Stella Starling romance takes place in the same interconnected, contemporary world. The Boyfriend Game is a standalone book with cameos from other Stella Starling stories, a #boyfriendsbybLoved spinoff that takes place around the time of the epilogue from Ready For Love (Book One of the Semper Fi series).",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "Gay For You",
    "LGBT",
    "Gay"
  ],
  "author": "Stella Starling",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/40891347-the-boyfriend-game"
}