{
  "title": "Stony the Road: Reconstruction, White Supremacy, and the Rise of Jim Crow",
  "description": "\"Stony the Road presents a bracing alternative to Trump-era white nationalism. . . . In our current politics we recognize African-American history--the spot under our country's rug where the terrorism and injustices of white supremacy are habitually swept. Stony the Road lifts the rug. --Nell Irvin Painter, New York Times Book Review A profound new rendering of the struggle by African-Americans for equality after the Civil War and the violent counter-revolution that resubjugated them, as seen through the prism of the war of images and ideas that have left an enduring racist stain on the American mind.The abolition of slavery in the aftermath of the Civil War is a familiar story, as is the civil rights revolution that transformed the nation after World War II. But the century in between remains a mystery: if emancipation sparked a new birth of freedom in Lincoln's America, why was it necessary to march in Martin Luther King, Jr.'s America? In this new book, Henry Louis Gates, Jr., one of our leading chroniclers of the African-American experience, seeks to answer that question in a history that moves from the Reconstruction Era to the nadir of the African-American experience under Jim Crow, through to World War I and the Harlem Renaissance.Through his close reading of the visual culture of this tragic era, Gates reveals the many faces of Jim Crow and how, together, they reinforced a stark color line between white and black Americans. Bringing a lifetime of wisdom to bear as a scholar, filmmaker, and public intellectual, Gates uncovers the roots of structural racism in our own time, while showing how African Americans after slavery combatted it by articulating a vision of a New Negro to force the nation to recognize their humanity and unique contributions to America as it hurtled toward the modern age.The story Gates tells begins with great hope, with the Emancipation Proclamation, Union victory, and the liberation of nearly 4 million enslaved African-Americans. Until 1877, the federal government, goaded by the activism of Frederick Douglass and many others, tried at various turns to sustain their new rights. But the terror unleashed by white paramilitary groups in the former Confederacy, combined with deteriorating economic conditions and a loss of Northern will, restored home rule to the South. The retreat from Reconstruction was followed by one of the most violent periods in our history, with thousands of black people murdered or lynched and many more afflicted by the degrading impositions of Jim Crow segregation.An essential tour through one of America's fundamental historical tragedies, Stony the Road is also a story of heroic resistance, as figures such as W. E. B. Du Bois and Ida B. Wells fought to create a counter-narrative, and culture, inside the lion's mouth. As sobering as this tale is, it also has within it the inspiration that comes with encountering the hopes our ancestors advanced against the longest odds.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "Social Justice",
    "American History",
    "Anti Racist"
  ],
  "author": "Henry Louis Gates Jr.",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/40909438-stony-the-road"
}