{
  "title": "Ghosts of Honolulu: A Japanese Spy, A Japanese American Spy Hunter, and the Untold Story of Pearl Harbor",
  "description": "NEW YORK TIMES BESTSELLER\"A fast-paced debut...Espionage buffs will savor this vibrant account.\" — Publishers WeeklyA U.S. naval counterintelligence officer working to safeguard Pearl Harbor; a Japanese spy ordered to Hawaii to gather information on the American fleet. On December 7, 1941, their hidden stories are exposed by a morning of bloodshed that would change the world forever. Scrutinizing long-buried historical documents, NCIS star Mark Harmon and co-author Leon Carroll, a former NCIS Special Agent, have brought forth a true-life NCIS story of deception, discovery, and danger.Hawaii, 1941. War clouds with Japan are gathering and the islands of Hawaii have become battlegrounds of spies, intelligence agents, and military officials - with the island's residents caught between them. Toiling in the shadows are Douglas Wada, the only Japanese American agent in naval intelligence, and Takeo Yoshikawa, a Japanese spy sent to Pearl Harbor to gather information on the U.S. fleet.Douglas Wada's experiences in his native Honolulu include posing undercover as a newspaper reporter, translating wiretaps on the Japanese Consulate, and interrogating America's first captured POW of World War II, a submarine officer found on the beach. Takeo Yoshikawa is a Japanese spy operating as a junior diplomat with the consulate who is collecting vital information that goes straight to Admiral Yamamoto. Their dueling stories anchor Ghosts of Honolulu's gripping depiction of the world-changing cat and mouse games played between Japanese and US military intelligence agents (and a mercenary Nazi) in Hawaii before the outbreak of the second world war.Also caught in the upheaval are Honolulu's innocent residents - including Douglas Wada's father - who endure the war's anti-Japanese fervor and a cadre of intelligence professionals who must prevent Hawaii from adopting the same destructive mass internments as California.Ghosts of Honolulu depicts the incredible high stakes game of naval intelligence and the need to define what is real and what only appears to be real.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Audiobook",
    "Historical",
    "Military Fiction",
    "War"
  ],
  "author": "Mark    Harmon",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/123266603-ghosts-of-honolulu"
}