{
  "title": "Stolen Magic",
  "description": "With richly imagined characters and compelling stories, New York Times bestselling author M. J. Putney has won dazzling praise from reviewers and readers across the country. Her spellbinding new romantic fantasy will sweep you from Wales’s mysterious forests to the glittering menace of Georgian London–and into a shattering rendezvous with fate.Heir to an ancient title, Simon Malmain, the Earl of Falconer, is well known among the Guardians, humans with magical powers derived from nature. Well known, but not always well loved . . . for those who enforce the law are rarely embraced by those whom they protect–and this is equally true whether the law is magical or mundane. A routine mission to confront a rogue Guardian who has misused his powers turns disastrous when Simon’s quarry, Lord Drayton, captures his pursuer in a transformation spell that can only be released by Drayton–or death. Aid arrives in the form of Meg, a fey young woman who first traps Simon, then frees him.As they flee together, Simon recognizes that Meg is also a victim of Drayton’s evil enchantments, and he restores her nature and innate magic. Though her memory is still clouded, she is freed at last from a shadowy world of fear and lost identity. She agrees to help Simon bring down Drayton. The need for each other’s magic binds them together–and releases the more ancient magic of passion. But desire cannot be satisfied until the rogue mage is stopped. For Drayton has a diabolical plan that will profoundly alter the course of Britain’s future. Even the combined power of Simon and Meg may not be enough to stave off catastrophe. Only a desperate act of love may win back the future–or destroy all they hold dear.From the Hardcover edition.",
  "genres": [
    "Romance",
    "Fantasy",
    "Historical Romance",
    "Paranormal",
    "Historical",
    "Paranormal Romance",
    "Magic"
  ],
  "author": "M.J. Putney",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/409124.Stolen_Magic"
}