{
  "title": "Women's Barracks",
  "description": "Originally published in 1950, this account of life among female Free French soldiers in a London barracks during World War II sold four million copies in the United States alone and many more millions worldwide.The novel is based on the real-life experiences of the author, Tereska Torres, who escaped from occupied France. She arrived as a refugee in London and joined other exiles enlisting in Charles de Gaulle’s army, then stationed in Britain awaiting an invasion of their homeland by Allied forces. But Women’s Barracks is no ordinary war story.As the Blitz rains down over London, taboos are broken, affairs start and stop and hearts are won and lost. Women’s Barracks was banned for obscenity in several states. It was also denounced by the House Select Committee on Current Pornographic Materials in 1952 as an example of how the paperback industry was “promoting moral degeneracy.” But in spite of such efforts—or perhaps, in part, because of them—the novel became a record-breaking bestseller and inspired a whole new genre: lesbian pulp.From the obituary in the New York Times:Tereska Torrès, 92, Writer Of Lesbian Fiction, DiesTereska Torrès, a convent-educated French writer who quite by accident wrote America’s first lesbian pulp novel, died on Thursday at her home in Paris. She was 92……It was not homophobia that caused Ms. Torrès to find her book’s canonical status peculiar. Quite the contrary, she said: because affairs with barracks mates were so much a part of ordinary wartime experience the hoopla seemed simply prurient.“The book spoke very delicately about the few matters of sexual encounters,” Ms. Torrès told Salon.com in 2005. “But so what? I hadn’t invented anything — that’s the way women lived during the war in London.”She added: “I thought I had written a very innocent book. I thought, these Americans, they are easily shocked.”Femmes Fatales restores to print the best of women’s writing in the classic pulp genres of the mid-20th century. From mystery to hard-boiled noir to taboo lesbian romance, these rediscovered queens of pulp offer subversive perspectives on a turbulent era. Enjoy the series: Bedelia; The Blackbirder; Bunny Lake Is Missing; By Cecile; The G-String Murders; The Girls in 3-B; In a Lonely Place; Laura; Mother Finds a Body; Now, Voyager; Skyscraper; Stranger on Lesbos; Women's Barracks.",
  "genres": [
    "LGBT",
    "Fiction",
    "Queer",
    "Historical Fiction",
    "Lesbian",
    "Romance",
    "Classics"
  ],
  "author": "Tereska Torrès",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/409104.Women_s_Barracks"
}