{
  "title": "The Silk Road",
  "description": "Traveling The Silk Road: an interview with author Jane Summer\"\"Adults have forgotten the feel of a teenager's love. For you a teenager will walk through glass doors, stay awake three days in a row, be an angel standing under your window in the rain. So what that we don't know how to order from the butcher or apply foundation or insert a diaphragm? Show us.\"\"So advises Paige Bergman, a high school student who falls in love with housewife Fiona Gallagher in Jane Summer's lyrical debut novel, The Silk Road. Part dark comedy, part suburban epic, the book, set in the 1970s, hitches along with Paige as she explores her obsessions for fast cars, all things morose, and the search for one astonishing true love.\"Lesbianism, self-mutilation, intergenerational relationships, adultery, madness--these are some of the topics you address. Not your typical coming-of-age novel. Were there any roadblocks in getting it published?\"When my agent began shopping \"The Silk Road\" around, many of my straight friends told me to be careful not to become ghettoized. They were warning me against going with a gay and lesbian publisher. Yeah, I agreed, I didn't want the book on some dusty shelf next to \"The Well of Loneliness,\" But more importantly, I didn't want the book to be pegged as a lesbian novel, because it would immediately limit my audience. Why should any serious novel be relegated to the gay and lesbian section of Barnes and Noble because some of the characters are gay? Is \"To the Lighthouse\" filed in Women's Studies? \"Invisible Man\" in African-American Studies? Mainstream publishers turned my agent and me down, most of them saying they liked the book but felt it had a limited audience. \"Don'tbecome ghettoized.\" As if I'd had the choice. But actually this experience turned me around. I get a big kick from the idea of my friends, colleagues, and family having to trek over to the Gay and Lesbian Studies section to find the novel. And I feel even more strongly about supporting the gay community in all spheres.\"Who is the audience you envisioned for the novel? \"Oddly enough, I pictured mostly straight people reading \"The Silk Road,\" because those are larg",
  "genres": [
    "Fiction",
    "Queer",
    "Coming Of Age",
    "Romance",
    "Lesbian"
  ],
  "author": "Jane Summer",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/408963.The_Silk_Road"
}