{
  "title": "The Redwood Revenger",
  "description": "In 2043, Olivia Ermine survives The Great Warming safe in Cascadia, yet a maniacal woolen devil would see her dead. Her blood holds the key to the VanDirks Corporation’s domination of the planet, and they will stop at nothing to get it! Can she beat the rising tide? A genre-bending journey through solarpunk sci-fi and science fantasy awaits.      Things are great! The Great Warming has proceeded apace, Florida is a soggy nub aslither in pythons. The Great Erasure’s come and gone, the black mirror shattered and the Great Autarchy’s Regime with it. The murder2.0 networked smart-toaster surveillance state’s kaput, so are financial markets, digital records, and killer robots. Viva the Quantum Era! The Great Balkanization continues, the West Coast seceded. It calls itself the Cascadian Federation, a military and vertical farming empire powered by the sun. The border’s secure out to the old Highway 15 DMZ, where Cascadia ends and Montanastan begins, home to militias, dust, famines, mass crucifixions, denominational nut-jobbery, and the ravages of paleomegavirus.      Olivia's left her chaotic globetrotting life behind and returned to her ancestral family home in Redwood, a charming Cascadian university town, a safe oasis in a turbulent world. Yet, the transition’s had a few quirks…disturbing dreams and now visions of a scruffy, saucer-eyed rogue-AI with a penchant for levitation and force fields. To make matters worse, she’s stalked by a murderous, straight razor wielding, dandified sock monkey. Meanwhile, VanDirks, a planetary fast-food mega-corp founded in the 1600s, in the slave trade, is after her famous uncle’s artistic legacy and just maybe her uncle too.      In the haze of thunderbud and fog, through time and tide, between land and sea, the earth and the stars, an ancient mystery seeks its revenge.NOTE: The Redwood Revenger is the first book in the trilogy. Red Bush  is the second, and Red Root is the third.",
  "genres": [],
  "author": "Johannes Johns",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/40910838-the-redwood-revenger"
}