{
  "title": "A Tycoon's Jewel",
  "description": "“The perfect, sexy read.” —New York Times and USA Today bestselling author Jessica Clare  “An Avery Laval romance is like a ripe cherry drenched in chocolate—delicious, sexy, and utterly addictive!” —Nina Lane, New York Times and USA Today bestselling author of the Spiral of Bliss Series  Can a man who came from nothing trust a woman who lost everything?  Six years ago, Jenna McCormick lost it all—her parents, her fortune, and her family's jewelry empire. After the shock wore off, Jenna realized she didn't need her fortune to be happy. Today, she has her brother's love and a small apartment. She doesn’t miss the champagne lifestyle she left behind. But she can never forget the day Grant Blakely stole her family's company, placing himself at the helm. She was half in love with Grant, her father's protege, now the youngest black CEO in Las Vegas history. She never wanted to ask him for help. But now she has no choice.  When Jenna asks Grant for a job, he's certain she must be joking. Even Jenna couldn't have burned through her trust fund that fast. She's persuasive, though, and her appeal hasn’t faded. Grant tests Jenna's resolve: he hires her, but as his assistant. She won't be able to put up with the menial tasks and hard hours of a real job. But Grant fails to predict how the sizzling attraction grows between them as he discovers she's not the playgirl she used to be.  Soon, the spark between them reignites. But can Grant trust her? And can Jenna trust the man who took everything from her?  “What a sparkling gem of a story! I loved it—and can’t wait for the rest of this dazzling series!” —USA Today bestselling author Caitlin Crews  “Avery Laval has a flair for writing multi-faceted characters who are refreshingly smart and irresistible. A Tycoon’s Jewel has just the right amount of smoldering chemistry, Vegas glamour, and delightfully fast-paced plot. A story to be devoured.” —Tina Ann Forkner, award-winning author Waking Up Joy and The Real Thing",
  "genres": [
    "Contemporary"
  ],
  "author": "Avery Laval",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/40932104-a-tycoon-s-jewel"
}