{
  "title": "Einstein's Unfinished Revolution: The Search for What Lies Beyond the Quantum",
  "description": "A daring new vision of the quantum universe, and the scandals controversies, and questions that may illuminate our future--from Canada's leading mind on contemporary physics. Quantum physics is the golden child of modern science. It is the basis of our understanding of atoms, radiation, and so much else, from elementary particles and basic forces to the behaviour of materials. But for a century it has also been the problem child of science, plagued by intense disagreements between its intellectual giants, from Albert Einstein to Stephen Hawking, over the strange paradoxes and implications that seem like the stuff of fantasy. Whether it's Schrdinger's cat--a creature that is simultaneously dead and alive--or a belief that the world does not exist independently of our observations of it, quantum theory is what challenges our fundamental assumptions about our reality. In Einstein's Unfinished Revolution, globally renowned theoretical physicist Lee Smolin provocatively argues that the problems which have bedeviled quantum physics since its inception are unsolved for the simple reason that the theory is incomplete. There is more, waiting to be discovered. Our task--if we are to have simple answers to our simple questions about the universe we live in--must be to go beyond it to a description of the world on an atomic scale that makes sense. In this vibrant and accessible book, Smolin takes us on a journey through the basics of quantum physics, introducing the stories of the experiments and figures that have transformed the field, before wrestling with the puzzles and conundrums that they present. Along the way, he illuminates the existing theories about the quantum world that might solve these problems, guiding us toward his own vision that embraces common sense realism",
  "genres": [
    "Science",
    "Physics",
    "Nonfiction",
    "Philosophy",
    "History",
    "Audiobook",
    "Space"
  ],
  "author": "Lee Smolin",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/40917082-einstein-s-unfinished-revolution"
}