{
  "title": "Collected Works",
  "description": "\"The Brontës had their moors, I have my marshes,\" Lorine Niedecker wrote of flood-prone Black Hawk Island in Wisconsin, where she lived most of her life. Her life by water, as she called it, could not have been further removed from the avant-garde poetry scene where she also made a home. Niedecker is one of the most important poets of her generation and an essential member of the Objectivist circle. Her work attracted high praise from her peers--Marianne Moore, William Carlos Williams, Louis Zukofsky, Cid Corman, Clayton Eshleman--with whom she exchanged life-sustaining letters. Niedecker was also a major woman poet who interrogated issues of gender, domesticity, work, marriage, and sexual politics long before the modern feminist movement. Her marginal status, both geographically and as a woman, translates into a major poetry.Niedecker's lyric voice is one of the most subtle and sensuous of the twentieth century. Her ear is constantly alive to sounds of nature, oddities of vernacular speech, textures of vowels and consonants. Often compared to Emily Dickinson, Niedecker writes a poetry of wit and emotion, cosmopolitan experimentation and down-home American speech.This much-anticipated volume presents all of Niedecker's surviving poetry, plays, and creative prose in the sequence of their composition. It includes many poems previously unpublished in book form plus all of Niedecker's surviving 1930s surrealist work and her 1936-46 folk poetry, bringing to light the formative experimental phases of her early career. With an introduction that offers an account of the poet's life and notes that provide detailed textual information, this book will be the definitive reader's and scholar's edition of Niedecker's work.",
  "genres": [
    "Poetry",
    "United States",
    "American",
    "Literature",
    "The United States Of America",
    "20th Century",
    "Feminism"
  ],
  "author": "Lorine Niedecker",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/409241.Collected_Works"
}