{
  "title": "Godzilla and Godzilla Raids Again",
  "description": "The first English translations of the original novellas about the iconic kaijū Godzilla Godzilla emerged from the sea to devastate Tokyo in the now-classic 1954 film, produced by Tōhō Studios and directed by Ishirō Honda, creating a global sensation and launching one of the world’s most successful movie and media franchises. Awakened and transformed by nuclear weapons testing, Godzilla serves as a terrifying metaphor for humanity’s shortsighted destructiveness: this was the intent of Shigeru Kayama, the science fiction writer who drafted the 1954 original film and its first sequel and, in 1955, published these novellas.Although the Godzilla films have been analyzed in detail by cultural historians, film scholars, and generations of fans, Kayama’s two Godzilla novellas—both classics of Japanese young-adult science fiction—have never been available in English. This book finally provides English-speaking fans and critics the original texts with these first-ever English-language translations of Godzilla and Godzilla Raids Again. The novellas reveal valuable insights into Kayama’s vision for the Godzilla story, feature plots that differ from those of the films, and clearly display the author’s strong antinuclear, proenvironmental convictions.Kayama’s fiction depicts Godzilla as engaging in guerrilla-style warfare against humanity, which has allowed the destruction of the natural world through its irresponsible, immoral perversion of science. As human activity continues to cause mass extinctions and rapid climatic change, Godzilla provides a fable for the Anthropocene, powerfully reminding us that nature will fight back against humanity’s onslaught in unpredictable and devastating ways.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Horror",
    "Classics",
    "Japan",
    "Fantasy",
    "Japanese Literature"
  ],
  "author": "Shigeru Kayama",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/123271575-godzilla-and-godzilla-raids-again"
}