{
  "title": "Einstein's Unfinished Revolution: The Search for What Lies Beyond the Quantum",
  "description": "A daring new vision of quantum theory from one of the leading minds of contemporary physicsQuantum physics is the golden child of modern science. It is the basis of our understanding of atoms, radiation, and so much else, from elementary particles and basic forces to the behavior of materials. But for a century it has also been the problem child of it has been plagued by intense disagreements between its inventors, strange paradoxes, and implications that seem like the stuff of fantasy. Whether it's Schrödinger's cat--a creature that is simultaneously dead and alive--or a belief that the world does not exist independently of our observations of it, quantum theory challenges our fundamental assumptions about reality.In Einstein's Unfinished Revolution , theoretical physicist Lee Smolin provocatively argues that the problems which have bedeviled quantum physics since its inception are unsolved and unsolvable, for the simple reason that the theory is incomplete. There is more to quantum physics, waiting to be discovered. Our task--if we are to have simple answers to our simple questions about the universe we live in--must be to go beyond quantum mechanics to a description of the world on an atomic scale that makes sense.In this vibrant and accessible book, Smolin takes us on a journey through the basics of quantum physics, introducing the stories of the experiments and figures that have transformed our understanding of the universe, before wrestling with the puzzles and conundrums that the quantum world presents. Along the way, he illuminates the existing theories that might solve these problems, guiding us towards a vision of the quantum that embraces common sense realism.If we are to have any hope of completing the revolution that Einstein began nearly a century ago, we must go beyond quantum mechanics to find a theory that will give us a complete description of nature. In Einstein's Unfinished Revolution , Lee Smolin brings us a step closer to resolving one of the greatest scientific controversies of our age.",
  "genres": [
    "Science",
    "Physics",
    "Nonfiction",
    "Philosophy",
    "History",
    "Audiobook",
    "Space"
  ],
  "author": "Lee Smolin",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/40922833-einstein-s-unfinished-revolution"
}