{
  "title": "Beyond The Story: 10-Year Record of BTS",
  "description": "THE FIRST EVER OFFICIAL BOOK—Published in celebration of BTS’s 10th Anniversary, stories that go beyond what you already know about BTS, including unreleased photos, QR codes of videos, and all album information.After taking their first step into the world on June 13, 2013, BTS will celebrate the 10th anniversary of their debut in June 2023. They have risen to the peak as an iconic global artist and during this meaningful time, they look back on their footsteps in the first official book. In doing so, BTS nurtures the power to build brighter days and they choose to take another step on a road that no one has gone before.BTS shares personal, behind-the-scenes stories of their journey so far through interviews and more than three years of in-depth coverage by Myeongseok Kang, who has written about K-pop and other Korean pop culture in various media. Presented chronologically in seven chapters from before the debut of BTS to the present, their vivid voices and opinions harmonize to tell a sincere, lively, and deep story. In individual interviews that have been conducted without a camera or makeup, they illuminate their musical journey from multiple angles and discuss its significance.In addition, portrait photos that show BTS as individuals and artists open the book, and throughout there are concept photos, tracklists of all previous albums, and over 330 QR codes. As digital artists, BTS has been communicating with the world through the internet and this book allows readers to immediately access trailers, music videos, and more online to have a rich understanding of all the key moments in BTS history. Complete with a timeline of all major milestones, BEYOND THE STORY is a remarkable archive—truly everything about BTS in one volume.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Music",
    "Audiobook",
    "Autobiography",
    "History"
  ],
  "author": "Myeongseok Kang",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/123274973-beyond-the-story"
}