{
  "title": "The Book of Rapture",
  "description": "The must-read new novel from Nikki Gemmell - as provocative and as deeply felt as her international bestseller THE BRIDE STRIPPED BARE.three children wake up in a basement room. they have been drugged and taken from their beds in the middle of the night. Now they are alone. Where are their parents? Who can they trust? the family has been betrayed to the government and Salt Cottage, their home on a clifftop above the ocean, is no longer safe. their mother's scientific work has put them all in danger. to protect them, she must let them go. She must put her faith in an old family friend - and in her children's own resilience and courage. Searing, provocative and unputdownable, tHE BOOK OF RAPtURE is a novel of our time that's every bit as passionate and driven as tHE BRIDE StRIPPED BARE. It will compel, seduce and haunt you. 'the true dramatic tension of the book is really quite compelling . . . this book will generate discussion' Sydney Morning Herald 'At the heart of A Book of Rapture is a sweet, thoughtful fable about the innocence of children and the power of familial love' the Age 'powerful and heart-rending . . . Nikki Gemmell well knows how to keep readers engaged' Courier Mail 'the Book of Rapture is a haunting, seductive story and challenging, not least because it is so hard to put down' Sunday tasmanian 'Intense' townsville Bulletin 'rapturous passages . . . lovely words push the Book of Rapture up on to another, mysterious level' Weekend Australian 'Nikki Gemmell's haunting new novel challenges readers to question all that they know and believe' Herald Sun 'a gripping read . . . this is a book that challenges beliefs about science, children, marriage and trust' Border Mail 'Haunting, thought-provoking and beautifully written' Marie Claire 'thought-provoking' Weekend Post 'splendidly lyrical and visceral' Sun Herald 'if the strength of a novel lies in its power to haunt a reader well after the last page, this is herculean' West Australian 'A fine novel' Weekend Gold Coast Bulletin",
  "genres": [
    "Fiction",
    "Contemporary"
  ],
  "author": "Nikki Gemmell",
  "average_rating": "2.83",
  "url": "https://www.goodreads.com/book/show/12327540-the-book-of-rapture"
}