{
  "title": "The Silent Sister",
  "description": "‘You don't deserve a sister…’  When Lizzy Beresford discovers a threatening letter addressed to her, the words on the old, tattered paper chill her to the bone. But who sent it? Living in pretty cottage in a quiet country village, Lizzy’s never made any enemies in her life…  Except her sister.  Lizzy hasn’t spoken to Emma in years. Not since the argument which tore their relationship apart. Would her sister really want to cause her harm after all this time?  As Lizzy receives more disturbing messages, she begins to doubt those closest to her – her boyfriend, her best friend, her neighbours.  Because the mystery sender seems to know everything about her. And after a series of malicious incidents, it’s clear they won’t stop until they’ve destroyed her life.  Lizzy knows she must confront her sister. But can she trust her? And will she realise the shocking truth, before it’s too late?  From the bestselling author of The Secret Mother and The Child Next Door, this utterly addictive psychological thriller will have you gasping at every twist and will make you question everyone you know. If you loved Gone Girl, The Girl on the Train and The Sister this book is for you.  What readers are saying about Shalini Boland:  ‘Absolutely addictive and brilliant with an end I didn't see coming. This is one book you have to read and it gets 5 huge stars from me!!!!’ Goodreads Reviewer, 5 stars  ‘Oh my. A captivating unputdownable evocative emotional twisted thriller. Oh that ending... OMG that ending did NOT expect that. It blew me away…’ Read Along With Sue, 5 stars  ‘Wow, wow, wow! What a fantastic book! The book starts with a bang… from page one and believe me, it doesn’t let up throughout the book and keeps you gripped until the very end!’ Stardust Book Reviews, 5 stars  ‘Hooked from the very first page... I was left staring open-mouthed at the last page because I just couldn't believe what I just read… left me both speechless and wanting for more.' It's All About Books, 5 stars  ‘OMG. What a phenomenal book! I read this book in 24 hours because I could not put it down.’ Goodreads Reviewer, 5 stars  ‘WOW... captivating... I could not put it down… worth more than 5 stars and has to be one of the best psychological thrillers I have read so far.' Goodreads Reviewer, 5 stars  ‘5 Brilliant Stars. Wow what an ending! This book pulled me in from the very first paragraph... I just finished this and I am still shock... fabulous from first paragraph to last!' Audio Killed the Bookmark, 5 stars  ‘OMG!!! The story grabbed me from the first chapter, and instantly set my teeth on edge! Don’t forget to read to the very last word though because that ending… WOW, completely unexpected!!<",
  "genres": [
    "Thriller",
    "Mystery",
    "Psychological Thriller",
    "Fiction",
    "Audiobook",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Shalini Boland",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/40946216-the-silent-sister"
}