{
  "title": "Let's Do This",
  "description": "ShawEver since we met two years ago, Eden Burkehammer has made everything better.The big defenseman sets me at ease. He’s a beast on the ice—brutal and physical—but when it’s the two of us, he turns to me with these unexpectedly soft brown eyes. This gravelly laugh that makes my whole body smile. And yeah, I might have thrown a glance his way a time or two in the steamed-up locker room showers—you know, just curious.But he’s my best friend. My teammate. Roommate.I don’t want to mess with that. Just the thought of losing him sends a cold zap the full length of my spine. Besides, I’ve never gone there with a guy, and he’s never given a single hint he has either.Until one morning when I sign for his delivery. An envelope that contains something I never—in my life—would have guessed.And, suddenly, I’m thinking about him in a whole new way.BurkI can’t look at Shaw Keenan for too long. When he leans across my truck console, with that whip-quick smile, I get this catch in my throat and focus on the road. Or when he tips his goalie mask up onto his head, hair askew and a flush of adrenaline on his cheeks, I skate back toward the blue line.I don’t know why. My head’s confused about a lot of stuff. Always has been. But what I do know is that I’ve never thought about anyone the way I think about him.Especially when he steps through my doorway—in nothing but a pair of thin running shorts and that backwards pink ballcap he always wears—holding a package I ordered on a whim.And he’s looking at me in a way he never has before.It’s game over after that.Let’s Do This is a steamy, low-angst, friends-to-lovers college hockey m/m romance with double first times, a flirty goalie, and a gruff defenseman willing to risk it all for a chance with his best friend. It’s a spin-off from Indigo Falls College Series and a standalone.",
  "genres": [
    "M M Romance",
    "Sports",
    "Friends To Lovers",
    "Hockey",
    "Romance",
    "Sports Romance",
    "College"
  ],
  "author": "Loren Leigh",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/123274634-let-s-do-this"
}