{
  "title": "Not So Snow White",
  "description": "When fate places a twisted fairytale about Snow White in her hands, Winter Snow is destined to change her life as she journeys along a sometimes magical and frightening path of discovery. In her heart, one thing is certain. If she can find her dad who has mysteriously disappeared, everything will turn back to normal. Of course, for Winter that means overcoming a few obstacles, like witches and magic, or feeling clueless about where to begin the journey for a lost parent. Complicating matters even more is that odd behavior she possesses, and it seems to be growing stronger every day. Who knew a normal, almost boring teen, the one everybody seems to pick on and call freak, could have psychic power? Adding to the weirdness is a voice invading her mind that belongs to a fairylike muse Winter calls Duane. However, the journey seems to move forward when Winter meets with the mysterious Lucinda Mayhem who reveals a past full of secrets connecting them in ways that both frighten and intrigue Winter. Despite her inner voice warning her to stay away, Winter is drawn even closer to the Mayhems when she meets and falls for Lucinda's nephew, Stephen, who seems to have some secrets of his own. In mesmerizing detail, fantasy meets reality, creating a world of magical discovery along with an ever looming threat of evil as Winter Snow solves the mystery of her true identity. The fairytale's treasures—a mirror, a potion, and a catalyst, are tools that could help Winter succeed, if she can only defeat the evil nemesis who would destroy her father and any chance for true love. Of course, she also has a little help from her friends along with her very devoted and determined magical muse Duane in the journey to find answers and bring her dad home again. NOT SO SNOW WHITE is part of Jennkrist's series of modern fairytales that includes CINDERELLA GEEK. Jennkrist is the pen name for Kathryn Long who also writes mysteries such as WHIPS, CUFFS, AND LITTLE BROWN BOXES.",
  "genres": [
    "Young Adult",
    "Fairy Tales",
    "Retellings",
    "Fantasy"
  ],
  "author": "K. Sean Jennkrist",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/12327408-not-so-snow-white"
}