{
  "title": "Mermaids Are Real: The Mystiq Prong",
  "description": "WARNING: This book is for middle graders and the rare few who have refused to grow up. If you would find yourself sneering at the mention of a mahloowoo (Aqaurien for fish fart) or scoffing at someone telling you about a recent spouting (Aquarien for a dolphin blowing air out of their blowhole up someone’s backside), you might be better off picking up a newspaper and playing sudoku or doing a crossword puzzle. This book is NOT for you.On the other hand, if you love adventure, talking animals, heartache, mystery, mythology, some good ole butt-kickin', AND mermaids/mermen this book IS for youYou’ve made it this far. Here’s your reward:“'Crabs talk?' asked Benji.'Everything in nature speaks. Not everything in nature listens,' said Octavius nodding Topside.\"Benji Fisher has spent the first twelve years of his life growing up in a small fishing town, Topside. He’s gotten used to the gang of dolphins who follow him on his surfboard and the voices he hears under the water; odd things that have, in their repetition, become part of normal everyday life. However, none of that prepares him for the recruitment speech he gets from an octopus named Octavius and three of the dolphins the night before his thirteenth birthday.What would you do if your ‘calling’ in life required you to take a leap of faith? Would you take the plunge?Begin serious side note. (Said with a deep voice)There is a message in the book. It’s pretty loud and clear, but it’s slightly overshadowed by the sheer size of the world you’re about to find yourself exploring. Don’t worry. I completely understand the importance of the message and it’s something I am working on developing over the course of several books.My hope is that you find yourself so unbelievably entranced in the underwater world of Aquari, that you’ll gravitate toward interests in seeing our real world oceans and the creatures who call her home loved, nurtured, and revered. I understand the gravity of what I am dealing with, and I promise to pay the oceans, our mother, the respect she deserves. You have my word.End serious side note.Now…...GO GET WET!!",
  "genres": [
    "Mermaids"
  ],
  "author": "Bo  Wu",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/40966179-mermaids-are-real"
}