{
  "title": "Such a Perfect Wife",
  "description": "In this next installment of New York Times bestselling author Kate White’s Bailey Weggins series, while reporting on a woman gone missing, Bailey comes face to face with a serial killer in her most dangerous case to date.Must be blonde, green-eyed, and a good Catholic girl… Wife and mother of two, Shannon Blaine was strikingly pretty with gorgeous blonde hair and dazzling green-eyes. Just a couple of weeks shy from her 34th birthday, she disappeared after going for a morning jog in her neighborhood of Lake George, New York. The residents in the idyllic lakeside town—which is popular with summer tourists—are stunned. Wasting no time, Shannon’s sister organizes search parties with the police. Though no one says the words, everyone is hoping they aren’t too late and can’t help fearing the worst. Bailey Weggins, now working for the online magazine Crimebeat, is on assignment covering Shannon’s disappearance. It’s a small town so naturally she wonders if the person responsible must be someone close to Shannon: her distraught husband…her bitter sister…a creepy hotel owner who watched her run every morning…the priest who is evasive to Bailey’s questioning. When an anonymous caller reaches out to Bailey and gives her the cryptic clue that Shannon was a “good Catholic girl,” the tip eventually leads Bailey to Shannon and a grisly discovery. As she soon learns, Shannon’s case isn’t an isolated incident. For the killer had targeted young blonde women in the area about a decade before, leaving each of them with stigmata markings. The questions abound. Why has the serial killer chosen this particular calling card and what is the religious significance behind the murders? Other than the similarities in appearance, why were these women targeted? And most disturbing of all, why has this psychopath decided to resume the slayings after so many years? When another reporter who is similarly following the Shannon Blaine story is murdered, Bailey is in a desperate race against time as she goes on the hunt to track down a serial killer, who always seems to be one step ahead….",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Suspense",
    "Mystery Thriller",
    "Adult"
  ],
  "author": "Kate White",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/40967291-such-a-perfect-wife"
}