{
  "title": "Hydranos",
  "description": "*Attained 17th place on the hourly 'Top 100 Amazon Best Sellers - Greco-roman Myth & Legend Fantasy Fiction' list*[IMPORTANT NOTE: Contrary to an algorithmized shelving of the book here on Goodreads, the novel is adult fiction and does not belong to the Young Adult genre.]On Cosmos, death is not everyone's fate. There, where children cannot grow up away from their birth land and humanity is split into four Nations ... are Stones that are not stones.A cadet official of her country’s royal council, Drynoe keeps finding herself torn between who she is and who the world forces her to be. What is more, her scarred past has forced her to believe that being governed by one’s feelings is a weakness that comes with a fatal price.When a most revered, supercentenarian ruler who was unable to die meets his unforeseen end, and Hydranos, the primordial Stone-‘essence’ of water that uncovers even the most hidden of feelings, takes flight, the cosmic balances start to go haywire. Drynoe and her friends end up in the vibrant colony of Helicasteros and on the threshold of life-altering events, like their encounter with the enigmatic master builder Lythes, who constantly challenges anyone that isn’t true to oneself … when he’s not weaving his own impenetrable mist of secrets. Immersed into the oblivion and almost eternal summer of a land where treasure hunters are entitled to sanctuary and no barriers between wishes and real life exist, Drynoe’s resolve is tested more than ever. And the group’s protean hostess Vryx is⸺like Hydranos⸺tenaciously set on unmasking their hearts' deepest desires ... turning them from dreams into reality.Sailing in literary fantasy waters, \nHydranos\n is the first novel in the series The Age of Stones.",
  "genres": [
    "Fantasy",
    "Mythology",
    "Fiction",
    "Politics",
    "Mental Health",
    "Philosophy",
    "Science Fiction Fantasy"
  ],
  "author": "Constantina Maud",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/40958039-hydranos"
}