{
  "title": "Number Go Up: Inside Crypto's Wild Rise and Staggering Fall",
  "description": "In 2021 cryptocurrency went mainstream. Giant investment funds were buying it; celebrities like Tom Brady endorsed it; and TV ads hailed it as the future of money. Hardly anyone knew how it worked—but why bother with the particulars when everyone was making a fortune from Dogecoin, Shiba Inu, or some other bizarrely named “digital asset”?As he observed this frenzy, investigative reporter Zeke Faux had a nagging feeling: Was it all just a confidence game of epic proportions? What started as curiosity—with a dash of FOMO—would morph into a two-year, globe-spanning quest to understand the wizards behind the world’s new financial machinery. Faux’s investigation would lead him to a schlubby, frizzy-haired twenty-nine-year-old named Sam Bankman-Fried (SBF for short) and a host of other crypto scammers, utopians, and overnight billionaires.Faux follows the trail to a luxury resort in the Bahamas, where SBF boldly declares that he will use his crypto fortune to save the world. Faux talks his way onto the yacht of a former child actor turned crypto impresario and gains access to “ApeFest,” an elite party headlined by Snoop Dogg, by purchasing a $20,000 image of a cartoon monkey. In El Salvador, Faux learns what happens when a country wagers its treasury on Bitcoin, and in the Philippines, he stumbles upon a Pokémon knockoff mobile game touted by boosters as a cure for poverty. In an astonishing development, a spam text leads Faux to Cambodia, where he uncovers a crypto-powered human-trafficking ring.When the bubble suddenly bursts in 2022, Faux brings readers inside SBF’s penthouse as the fallen crypto king faces his imminent arrest. Fueled by the absurd details and authoritative reporting that earned Zeke Faux the accolade “our great poet of crime” from Money Stuff columnist Matt Levine, Number Go Up is the essential chronicle, by turns harrowing and uproarious, of a $3 trillion financial delusion.",
  "genres": [
    "Nonfiction",
    "Business",
    "Economics",
    "Finance",
    "Audiobook",
    "Technology",
    "History"
  ],
  "author": "Zeke Faux",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/123276708-number-go-up"
}