{
  "title": "Later Gator",
  "description": "Welcome to Hairy Wart! Home of the SOUTHERN FRIED SASS DETECTIVE AGENCY and the DRAGONETTES - proof that it's not the size of the scales but the SASS in the flames that makes the Guardsma...ahem, I mean, Guardswoman. Where the Tofu is always Southern Fried and the Soul Food is vegetarian, 'cause it just wouldn't be right to eat your neighbors. When the mood strikes and the need for change is too strong to ignore, most people move to the big city or the mountains, heck, some even head to the beach. Not me. No way. That would be way too easy. No L.A., Aspen, or Miami for this Witch.  \nHairy Wart, LA, is where I landed.\n  Not only is it the Southern Fried Tofu capital of the world, but this blink-and-you-miss-it ‘burg with a population of Ninety-nine-point-five, (Do not ask.) and a mayor who happens to be a seven-foot Pink Bunny when the mood strikes, just might be the home of the craftiest chicken-napping, rock-wielding crazy killer I've ever come up against.  To say I have bitten off more than I can chew is like saying the Grand Canyon is a pothole. However, I \nabsolutely\n refuse to admit defeat. Especially not with Sherriff Sexy Pants dogging my every step and making me all hot and bothered. Whoever said a Gator Shifter can’t make a couple yards of denim really, really happy they became a pair of Wranglers never met Beauregard St. Croix. He takes a bite outta crime in an up close and personal kinda way that I’m liking a little more every day.  With a mighty swish of my wand and my sisters by my side, I have made it my mission to rid Hairy Wart of all things nefarious and make the streets safe for everybody – scaled, furry, feathered, or otherwise. No case too small, no lawbreaker too evil. We’re here to help!  Bubble, bubble, are you in trouble? Not to worry, we'll be there on the double. No need to fear. No need to fret. We're Southern Fried Sass, Baby. We'll save the day, and my friends, you should take that bet.",
  "genres": [
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Cozy Mystery",
    "Mystery",
    "Cozy",
    "Witches"
  ],
  "author": "Julia Mills",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/40956945-later-gator"
}