{
  "title": "The Nameless Names: Recovering the Missing ANZACS",
  "description": "Few Australians realise that of the 62,000 Anzac soldiers who died in the Great War, over one-third are still listed as ‘missing’. With no marked graves, the only reminders of their sacrifice are the many names inscribed on ageing war memorials around the world.Bennett deftly tells the story of such missing Anzacs through the personal experience of three sets of brothers — the Reids, Pflaums, and Allens — whose names he selected from the Memorials to the Missing. Bennett traces their paths from small, peaceful towns to three devastating battlefields of the Great War: Gallipoli, Fromelles, and Ypres. He reveals the carnage that led to their disappearance, and their family’s subsequent grief and endless search for elusive facts.Bennett’s unflinching account addresses many painful questions. What circumstances resulted in the disappearance of so many soldiers? Why did the Australian government fail in its solemn pledge to recover the missing? Why were so many families left without answers about the fate of their loved ones — despite the dedicated efforts of Vera Deakin and her co-workers at the Australian Red Cross inquiry bureau, first in Cairo and then in London? Vera, a daughter of Australia’s second prime minister, had had a privileged upbringing, and yet devoted herself tirelessly to seeking answers for the families of the missing.The Nameless Names lays bare the emotional toll inflicted upon families, describing those caught between clinging to hope and letting go, those who felt compelled to journey to distant battlefields for answers, and those who shunned conventional religion and resorted to spiritualism for solace.This moving book delicately reveals the human faces and the devastating stories behind the names listed on the stone memorials.\"This admirable book, superbly researched and insightfully written, illuminates the profound and enduring consequences for so many Australian families whose loved ones were among the missing in World War I.\" - Ross McMullin, author of Farewell, Dear People",
  "genres": [
    "History",
    "World War I",
    "Nonfiction"
  ],
  "author": "Scott    Bennett",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/40983523-the-nameless-names"
}