{
  "title": "Southern Lady Code: Essays",
  "description": "The bestselling author of American Housewife is back with a fiercely funny collection of essays on marriage and manners, thank-you notes and three-ways, ghosts, gunshots, gynecology, and the Calgon-scented, onion-dipped, monogrammed art of living as a Southern Lady.Helen Ellis has a mantra: \"If you don't have something nice to say, say something not-so-nice in a nice way.\" Say \"weathered\" instead of \"she looks like a cake left out in the rain.\" Say \"early-developed\" instead of \"brace face and B cups.\" And for the love of Coke Salad, always say \"Sorry you saw something that offended you\" instead of \"Get that stick out of your butt, Miss Prissy Pants.\" In these twenty-three raucous essays Ellis transforms herself into a dominatrix Donna Reed to save her marriage, inadvertently steals a $795 Burberry trench coat, witnesses a man fake his own death at a party, avoids a neck lift, and finds a black-tie gown that gives her the confidence of a drag queen. While she may have left her home in Alabama, married a New Yorker, forgotten how to drive, and abandoned the puffy headbands of her youth, Helen Ellis is clinging to her Southern accent like mayonnaise to white bread, and offering readers a hilarious, completely singular view on womanhood for both sides of the Mason-Dixon.Making a marriage magically tidy --Topeka three-way --How to stay happily married --Free to be...you and me (and childfree) --Room of one's own (that's full of gay men) --Other woman's Burberry coat --Peggy Sue got marijuana --What every girl should learn from ABC's The bachelor --Ghost experience --Party foul --Today was a good day --Straighten up and fly right. --Halloween people --Tonight we're gonna party like it's 1979 --How to be the best guest --When to write a thank-you note --An Emily Post for the apocalypse --How I watch pornography like a lady --Dumb boobs --Young ladies, listen to me --Seven things I'm doing instead of a neck lift --Serious women --That kind of woman",
  "genres": [
    "Nonfiction",
    "Essays",
    "Humor",
    "Memoir",
    "Audiobook",
    "Short Stories",
    "Southern"
  ],
  "author": "Helen Ellis",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/40983137-southern-lady-code"
}