{
  "title": "The Best of Robert E. Howard: Grim Lands",
  "description": "“[Behind Howard’s stories] lurks a dark poetry and the timeless truth of dreams.”–Robert Bloch“Howard’s writing seems so highly charged with energy that it nearly gives off sparks.”–Stephen KingThe classic pulp magazines of the early twentieth century are long gone, but their action-packed tales live on through the work of legendary storyteller Robert E. Howard. From his fecund imagination sprang an army of larger-than-life heroes–including the iconic Conan the Cimmerian, King Kull of Atlantis, Solomon Kane, and Bran Mak Morn–as well as adventures that would define a genre for generations. Now comes the second volume of this author’s breathtaking short fiction, which runs the gamut from sword and sorcery, historical epic, and seafaring pirate adventure to two-fisted crime and intrigue, ghoulish horror, and rip-roaring western.Kull reigns supreme in “By This Axe I Rule!” and “The Mirrors of Tuzan Thune”; Conan conquers in one of his most popular exploits, “The Tower of the Elephant”; Solomon Kane battles demons deep in Africa in “Wings in the Night”; and itinerant boxer Steve Costigan puts up his dukes of steel inside and outside the ring in “The Bulldog Breed.” In between, warrior kings, daring knights, sinister masterminds, grizzled frontiersmen–even Howard’s stunning heroine, Red Sonya–tear up the pages in stories built to thrill by their masterly creator.And in such epic poems as “Echoes from an Anvil,” “Black Harps in the Hills,” and “The Grim Land,” the author blends his classic characters and visceral imagery with a lyricism as haunting as traditional folk balladry. Lavishly illustrated by Jim and Ruth Keegan, here is a Robert E. Howard collection as indispensable as it is unforgettable.“Howard had a gritty, vibrant style–broadsword writing that cut its way to the heart, with heroes who are truly larger than life.”–David Gemmell“For stark, living fear . . . What other writer is even in the running with Robert E. Howard?”–H. P. Lovecraft",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Pulp",
    "Adventure",
    "Fiction",
    "Horror",
    "Sword and Sorcery"
  ],
  "author": "Robert E. Howard",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/409765.The_Best_of_Robert_E_Howard"
}