{
  "title": "Our Lady of Greenwich Village",
  "description": "In his brilliant second novel, Dermot McEvoy sweeps his readers into the midst of one of the most heated political races in New York City history, where an unlikely player decides to make her presence known. First it hits the papers that the Virgin Mary has appeared to Jackie Swift, an affable G.O.P. congressman with a couple of nasty habits. She then appears in a dream to Wolfe Tone O’Rourke, a liberal political consultant who is still haunted by the ghost of Bobby Kennedy, whose death he feels responsible for.Swift uses the Virgin, soon styled “Our Lady of Greenwich Village,” to put a strong anti-abortion spin on his current run for office, which immediately polarizes Greenwich Village. O’Rourke, beset by his many demons, sees something familiar in the Virgin’s dancing eyes and the line of her smile and decides to run against Swift with the campaign slogan “NO MORE BULLSHIT.” With help from unlikely characters like Cyclops Reilly, a one-eyed newspaper columnist for the Daily News, and Simone “Sam” McGuire, O’Rourke’s pretty, no-nonsense assistant, Tone is sent on a transcontinental journey that forces him to confront his own ghosts and dig deep into his family history, all to answer one burning What does Our Lady of Greenwich Village really want him to do?Skyhorse Publishing, as well as our Arcade, Yucca, and Good Books imprints, are proud to publish a broad range of books for readers interested in fiction—novels, novellas, political and medical thrillers, comedy, satire, historical fiction, romance, erotic and love stories, mystery, classic literature, folklore and mythology, literary classics including Shakespeare, Dumas, Wilde, Cather, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "New York",
    "Religion",
    "Fiction"
  ],
  "author": "Dermot McEvoy",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/4097296-our-lady-of-greenwich-village"
}