{
  "title": "Crossfire Hurricane: Inside Donald Trump's War on the FBI",
  "description": "CROSSFIRE HURRICANE DELIVERS THE DEFINITIVE ROAD MAP TO IMPEACHMENT, a history of how we got from 2016 to today.“A must-read indictment of the ‘mob boss’ in the White House.” — The Guardian“An indispensable and riveting insider’s account of one of the most dramatic and controversial periods in the history of the FBI. Crossfire Hurricane is a must-read for all Americans.” —Daniel Silva, New York Times bestselling author“Campbell speaks both from the heart and experience. A dynamite read.” —Dan Rather, former anchor of CBS Evening News and bestselling author of What Unites UsIt is January 6, 2017, two weeks before the inauguration. Only a handful of people know about the Steele dossier, and the nation is bitterly divided by the election results. As rumors begin to circulate that something might be brewing with the newly elected president and Russia, FBI special agent Josh Campbell joins the heads of the US intelligence community on a briefing visit to Trump Tower in New York City. He does not yet know that this meeting will eventually lead to the firing of his boss, James Comey, or that within weeks his former boss Robert Mueller will be appointed to investigate collusion and obstruction of justice at the highest level. He does not yet know that the FBI will come under years of sustained attacks from the commander in chief of the very nation its agents have sworn to protect. But, from his unique position within the FBI, he will watch it occur.In this gripping fly-on-the-wall narrative, Campbell takes readers behind the scenes of the earliest days of the Russia investigation— Crossfire Hurricane—up to the present. Using both firsthand experience and reporting, he reveals fresh details about this tumultuous period; explains how the FBI goes about its work and its historic independence from partisan forces; and describes the increasing dismay inside the bureau as the president and his allies escalate their attacks on the agency. Appalled by Trump’s assault on the bureau’s credibility, Campbell left the FBI in 2018 to sound the alarm about unfair political attacks on the institutions that keep America safe.Smart, clear, passionate,  Crossfire Hurricane  will captivate readers struggling to make sense of a news cycle careening out of control.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "American History",
    "Crime",
    "Government"
  ],
  "author": "Josh Campbell",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/40974301-crossfire-hurricane"
}