{
  "title": "Full Catastrophe Living: Using the Wisdom of Your Body and Mind to Face Stress, Pain, and Illness",
  "description": "The landmark work on mindfulness, meditation, and healing, now completely revised and updated after twenty-five years  Stress. It can sap our energy, undermine  our health if we let it, even shorten our lives. It makes us more vulnerable to anxiety and depression, disconnection and disease. Based on Jon Kabat-Zinn’s renowned mindfulness-based stress reduction program, this classic, groundbreaking work—which gave rise to a whole new field in medicine and psychology—shows you how to use medically proven mind-body approaches derived from meditation and yoga to counteract stress, establish greater balance of body and mind, and stimulate well-being and healing. By engaging in these mindfulness practices and integrating them into your life from moment to moment and from day to day, you can learn to manage chronic pain, promote optimal healing, reduce anxiety and feelings of panic, and improve the overall quality of your life, relationships, and social networks. This second edition features the results of recent studies of the science of mindfulness, a new Introduction, up-to-date statistics, and an extensive updated reading list. Full Catastrophe Living is a book for the young and the old, the well, the ill, and anyone trying to live a healthier and saner life in our fast-paced world.  Praise for Full Catastrophe Living\n \n “One of the great classics of mind/body medicine . . . More than any other, Full Catastrophe Living is the book that enabled Americans to discover the inner life. This book has brought peace of mind to hundreds and thousands of people and healed countless lives. This is your chance to let it heal yours.”—Rachel Naomi Remen, M.D., author of Kitchen Table Wisdom   “A wonderful guidebook for those of us who choose life and healing . . . I hope you all make that choice and read the book.”—Bernie S. Siegel, M.D., author of Love, Medicine & Miracles   “Dr. Jon Kabat-Zinn eloquently explains the power of paying attention and increasing awareness. I strongly recommend this book for everyone who wants to begin healing their life.”—Dean Ornish, M.D., author of Dr. Dean Ornish’s Program for Reversing Heart Disease",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Health",
    "Spirituality",
    "Buddhism",
    "Mental Health"
  ],
  "author": "Jon Kabat-Zinn",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/41016873-full-catastrophe-living"
}