{
  "title": "Joseph W. Taylor: Born To Bird",
  "description": "Joseph W. Taylor BORN TO BIRD is a biography of the foremost North American amateur ornithologist and conservationist in the mid-twentieth century.  BORN TO BIRD examines Joe Taylor's life path as a journey toward his true self. This transformation came slowly. He was born to economic and social privilege, yet an unanticipated destiny with birds awaited him.Birdwatching began for Joe at age eight. Early on, he conformed to a traditional pattern of education and employment. Nevertheless, beneath this apparent comfort lay a developing obsession with birds. His skill with bird identification blossomed, as did his curiosity about birds and their habitats. By the time he was an adult, Joe had become a serious birder. In the late 1940s, he began to visit wildlife refuges. Often in solitude away from the pressures of family and commercial obligations, he created plans for bolstering the national pursuit of birdwatching. At the same time, he began to compile a list of the numerous bird species which he had personally identified. He joined the life listing \"600 Club,\" an elite group dedicated to the identification of bird species. At the close of his life, he had seen over 729 individual species. As his awareness about ecological problems grew, Joe made a pivotal decision to break with all traditional expectations and begin a new life. In his mid-fifties, he abruptly retired from business and began wholeheartedly to embrace naturalist pursuits. His significant contributions to the study of birds, his tenure on many conservation boards, twenty-six-years as president of Hawk Mountain Sanctuary in Pennsylvania and his collaborative formation of the American Birding Association are evidence of his dedication. The manifest transformation of his life was complete. This monomythical journey is something we all have the potential to realize. Are we living out our dreams, choosing our true passion over safe decisions or expected demands? One's life contains infinite choices, some planned, others circumstantial. A life transformed from expectation into passionate dedication is an inspiration, not only for birders but also for us all.",
  "genres": [],
  "author": "Ann          Taylor",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/123282158-joseph-w-taylor"
}