{
  "title": "Dreamland",
  "description": "Kevin Baker's Dreamland is the kind of novel that begins with a two-page list of characters and ends with a nine-page glossary. In between, this vast, sprawling carnival of a book takes in Coney Island and the Lower East Side, midgets and gangsters, Bowery bars and opium dens, even Sigmund Freud and Carl Jung. It is, in short, a novel as big, lively, and ambitious as Gotham itself, and if you can stomach some of the more garish local color, it's every bit as much fun. Set at the turn of the century, in a New York as polyglot as any city on earth, Dreamland opens with an act of misplaced--and very stupid--compassion. Eastern European immigrant Kid Twist intervenes when villainous gangster Gyp the Blood is on the verge of murdering a young newsboy for sport. But surprise: that's no street urchin--that's Trick the Dwarf, self-proclaimed Mayor of Little City and a Coney Island tout, who dresses up as a boy, he says, as \"a way I had of leaving myself behind.\" Trick hides Kid Twist in the hind parts of the Tin Elephant Hotel; Kid Twist meets Esther Abramowitz, impoverished seamstress and labor agitator, then falls in love; Trick woos Mad Carlotta, a three-foot beauty who thinks she's the Empress of Mexico; and Freud and Jung sail for America, where they squabble about psychoanalysis. There are also a few subplots involving police corruption, Tammany Hall, and the Triangle Shirtwaist Fire--but who's counting? Suffice to say that it all really does come together in the end, and you won't be bored for one step of the way. Baker served as chief historical researcher for Harold Evans's The American Century, and it's clear that he put his time there to good use; Dreamland is full of vivid historical detail, from Lower East Side slang to the lyrics of popular songs. If this is middlebrow entertainment, it's middlebrow in the same way as Dickens: extravagantly plotted, elegantly written, and compassionate to the core. --Mary Park",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "New York",
    "Historical",
    "Novels",
    "Contemporary",
    "Jewish"
  ],
  "author": "Kevin Baker",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/41014778-dreamland"
}