{
  "title": "Compassionate Superintelligence AI 5.0: AI with Blockchain, BMI, Drone, IoT, and Biometric Technologies",
  "description": "The book defines the concept of Compassionate Artificial Superintelligence AI 5.0. The book explains the need and urgency to develop the compassionate AI systems in today’s world threatened with nuclear warfare, terrorism, corruption, rogue states and monster governments. Now the primary requirement of  AI based system is that not only it should serve humanity but also should not do any harm to the human liberty, society, environment and the humanity at large. Moreover, AI should act morally, socially, responsibly and compassionately.  The book proposes a novel framework for compassionate superintelligence. It explains the five core technologies of compassionate superintelligence AI 5.0 are: artificial intelligence, quantum computing, cellular reprogramming, brain-computer interface, and IoT.  It also explains the five characteristics of AI 5.0 are: Super-Intelligence, Super-Connectivity, Super-Compassion, Super-Creativity and Super-Consciousness. To achieve this aim the Dr. Ray proposes RayDeepCompassion framework and algorithms. It explains the design and behavioral principles of compassionate AI.  The book also discusses six modules of computational artificial consciousness.Humans and AI systems are co-evolving. Gradually they are becoming co-dependent. The gaps between human and AI systems are reducing. Establishing heart to heart communication is a must. Tomorrow's AI based systems must be able to understand humans from its depth and not just fulfill the surface level requirements. Sensitivity towards human pain, mistakes, and sufferings must be the part of the evolving new AI systems.Serving humanity intelligently is held up as the “gold standard” of AI based systems. But, with the emergence of new technologies and AI systems with bio-metric data storage, surveillance, tracking and big data analysis, humanity and the society is facing a threat today from evilly designed AI systems in the hands of monster governments and irresponsible people. Humanity is on the verge of digital slavery. The real challenge is how to digitize and incorporate the human values like compassion, forgiveness, bravery, morality, love and creativity in AI based systems. In this book Dr. Ray explains compassionate artificial intelligence in depth. The book provides the blueprint, directions, frameworks and strategies to develop such compassionate artificial superintelligent systems in coming days.",
  "genres": [
    "Artificial Intelligence",
    "Inspirational",
    "Science"
  ],
  "author": "Amit Ray",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/41028993-compassionate-superintelligence-ai-5-0"
}