{
  "title": "Prehistoric Crisis",
  "description": "Live among the dinosaurs in this Dinosaur Horror/Fantasy GameLit book. Mixes the expansive open world of DinoRule with the Dungeon Core world of the seven elemental temple.  Stephen is your average young adult from the UK who just happens to like risky adventures and dinosaurs. When he gets invited to South Africa by an old school friend, he is excited to take the trip. When he arrives, he sneaks off to the southern border of the known territories of South Africa. During his jaywalk, he bumps into a mythical universe where he spots dinosaurs living and these are not genetically engineered either. However, this is a secret that he has to keep to himself.  Stephen is surprised when his best friend, Matthew knows about the living dinosaurs. They plan to go visit the mythical land until the dinosaurs pay a visit to their camping grounds and begin to wreak havoc on the real world. Stephen finds a sacred shrine where he finds a legendary blade and shield. That is when he finds out that he's the legendary hero of the mythical land of DinoRule.  As the hero of DinoRule, he must stop an evil sage known as Aries from taking over DinoRule and using the dinosaurs to take over not only DInoRule but also the motherearth.  Can this young adult conquer the different trials as he enters a world where dinosaurs and humans live in harmony. He'll learn how to use different elemental spells, conquer the different elemental temples in DinoRule, and even raise his own dinosaur pets. This is more than just your regular adventure as he'll meet friends, traitors, dinosaurs that will ally themselves with him, and a world that has the same feeling as our Earth.  Can Stephen keep DinoRule a dinosaur paradise or will it be consumed by evil? More importantly, will he ever leave DinoRule or will he make a new life amongst the dinosaurs?",
  "genres": [],
  "author": "Angel Ramon",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/41017905-prehistoric-crisis"
}