{
  "title": "Miss MacIntosh, My Darling",
  "description": "This novel is one of the most ambitious and remarkable literary achievements of our time. It is a picaresque, psychological novel--a novel of the road, a journey or voyage of the human spirit in its search for reality in a world of illusion and nightmare. It is an epic of what might be called the Arabian Nights of American life. Marguerite Young's method is poetic, imagistic, incantatory; in prose of extraordinary richness she tests the nature of her characters--and the nature of reality. Miss MacIntosh, My Darling is written with oceanic music moving at many levels of consciousness and perception; but the toughly fibred realistic fabric is always there, in the happenings of the narrative, the humor, the precise details, the definitions of the characters. Miss MacIntosh herself, who hails from What Cheer, Iowa, and seems downright and normal, with an incorruptible sense of humor and the desire to put an end to phantoms; Catherine Cartwheel, the opium lady, a recluse who is shut away in a great New England seaside house and entertains imaginary guests; Mr. Spitzer, the lawyer, musical composer and mystical space traveler, a gentle man, wholly unsure of himself and of reality; his twin brother Peron, the gay and raffish gambler and virtuoso in the world of sports; Cousin Hannah, the horsewoman, balloonist, mountain-climber and militant Boston feminist, known as Al Hamad through all the seraglios of the East; Titus Bonebreaker of Chicago, wild man of God dreaming of a heavenly crown; the very efficient Christian hangman, Mr. Weed of the Wabash River Valley; a featherweight champion who meets his equal in a graveyard--these are a few who live with phantasmagorical vividness in the pages of Miss MacIntosh, My Darling. The novel touches on many aspects of life--drug addiction, woman's suffrage, murder, suicide, pregnancy both real and imaginary, schizophrenia, many strange loves, the psychology of gambling, perfectionism; but the profusion of this huge book serves always to intensify the force of the central question: \"What shall we do when, fleeing from illusion, we are confronted by illusion?\" What is real, what is dream? Is the calendar of the human heart the same as that kept by the earth? Is it possible that one may live a secondary life of which one does not know? In every aspect, Miss MacIntosh, My Darling stands by itself--in the lyric beauty of its prose, its imaginative vitality and cumulative emotional power. It is the work of a writer of genius.\"This is a search for reality through a maze of illusions and fantasy and dreams, ultimately asserting in the words of Calderon: 'Life is a dream.'\" - Anais Nin\"Marguerite Young is unquestionably a genius.\" - Kurt Vonnegut\"A work of stunning magnitude and beauty. . . . The book's mysterious readability is effected through enchantment and hypnosis. Its force is cumulative; its method is amassment, as in the great styles of Joyce or Hermann Broch or Melville or Faulkner. . . . One of the most arresting literary achievements in our last 20 years. . . . It is a masterwork.\" - William Goyen, New York Times Book Review, 9/12/65\"An extraordinary book by a woman possessed of a breathtaking verbal virtuosity. She also has quality of heart. . . . There are times when her pages surge and beat on the heart and imagination like great music; other times when it shimmers motionless like an ancient Hindu painting.\" - Lillian Smith, Chicago Tribune\"The prose is lyric, striking and memorable.\" - Michael Dirda, Washington Post Book World, 3/21/93This encyclopedic novel addresses the question of illusion, as Young--whose epic vision and exquisite prose are truly awesome--dissects the essence of reality and ruminates on where it can be found.\" - L.A. Reader, 2/93\"[A]n ambitious work of gorgeous fiction, written in wanes of lush, imagistic, even humorous language. . . . This is a work of genius.\" - Belles Lettres, Winter 1993",
  "genres": [
    "Fiction",
    "Classics",
    "Literature",
    "Novels",
    "20th Century",
    "Literary Fiction",
    "American"
  ],
  "author": "Marguerite Young",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/4101908-miss-macintosh-my-darling"
}