{
  "title": "Moving Foreword: Real Introductions to Totally Made-Up Books",
  "description": "A great foreword is more than just a few pages of self-indulgent frippery that comes before a book. A great foreword adds zest. It sets the stage for the page turner you’re about to open, and perhaps even puts you in the locked room where a mystery happens or in the high-button shoes of a year gone by.A great foreword—sometimes—is even better than the book it precedes.So why not skip the boring actual-book part?Moving Foreword is a collection of introductions to imaginary books, written by real celebrities, comedians, musicians, and other writers with something to say. With a real foreword by Rainn Wilson, this book offers a no-holds-barred cacophony of laugh-out-loud funny, poignant, and thought-provoking writing that tackles everything from politics to pop culture, true crime to trout fishing, and Star Wars to skin flicks.Highlights include:Bustin' Through: Confessions of the Kool-Aid ManForeword by “Pop Candy” columnist Whitney MathesonSock Puppet Mozart: The Life and Gruesome Death of Randy MastersonForeword by actor Thomas LennonStephen Hawking's Why We Keep Making the Same MistakesForeword by recording artist MobyThe Lure of the Flies: On the Art of Fly FishingForeword by Adam West, the late, the great, the BatmanKeep Your Gaze on Me: The Murder of Persia SadsashayForeword by Shirley Manson, lead vocalist of GarbageI'll Be There for You: The True Story of the Central Perk MurdersForeword by Simeon Goodson, Brooklyn-bred stand-up comedianPizzaz: The Life and Death of Darrell HammondForeword by Saturday Night Live alumnus Darrell HammondBlank PagesForeword by rock and roll hall of famer John OatesNip-Slips: An Illustrated HistoryFore(skin)word by Mr. SkinEverything You Need to Know About Massachusetts Fish and Wildlife RegulationsForeword by New Kids on the Block member Jonathan KnightFly Ball: How the New York Yankees Have Changed LivesForeword by talk show host Jerry SpringerTerrible Band Names: A ChronologyForeword by John Ondrasik, also known as Five for Fighting. . . any many more!",
  "genres": [
    "Humor",
    "Short Stories",
    "Books About Books",
    "Fiction"
  ],
  "author": "Jon Chattman",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/41029292-moving-foreword"
}