{
  "title": "The Night I Met Father Christmas",
  "description": "‘A sheer delight for all kids both big AND small’ Ruth Jones 'Bubbles with warmth and mischievous humour . . . irresistible' Alexander Armstrong'Wonderful, funny, magical' Chris Evans on How I Became a Dog Called MidnightEnter a world of wonder with this heartfelt Christmas classic from bestselling children's author Ben Miller.Jackson knows all about the flying reindeer, he knows about the elves and the secret North Pole workshop, he knows about the magic that allows Father Christmas to deliver presents around the world in just one night, but there's one thing he doesn't know . . . how did Father Christmas become Father Christmas?That all changes when, one Christmas Eve, Jackson meets Father Christmas and hears his incredible story.    So begins an enchanting fairy-tale into a magical snowy landscape, where Torvil, a mean-spirited and miserly elf, is about to discover the true meaning of Christmas. This might not have been the story Jackson was expecting but, as Father Christmas tells him, no good story ever is... With beautiful illustrations throughout from Daniela Jaglenka Terrazzini and warm, funny words from Ben Miller, this book will remind everyone of the true spirit of Christmas and prove once and for all that Father Christmas really does exist! \nPraise for Ben Miller\n'A magical adventure' Sunday Express on The Day I Fell Into a Fairytale'Great for reading aloud' The Week Junior on The Day I Fell Into a Fairytale'A fire-side gem of a story' Abi Elphinstone on The Night I Met Father Christmas'Fabulous' Sunday Express on The Boy Who Made the World Disappear'Enchanting, funny and intriguing in equal measure' Philip Ardagh on The Night I Met Father Christmas'Each of [Ben’s] five books is joyous and thoughtful' Red Magazine",
  "genres": [
    "Christmas",
    "Middle Grade",
    "Fantasy",
    "Childrens",
    "Fiction",
    "Audiobook",
    "Retellings"
  ],
  "author": "Ben     Miller",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/41027816-the-night-i-met-father-christmas"
}