{
  "title": "Icing the Omega",
  "description": "Ready to pass the puck… He was supposed to be a star hockey player with a wife, and kids and a future. Instead, Brooks sank into depression after an injury ended his career. Life slipped by, and now, Brooks is in a dead-end job, single, childless, and on the wrong side of forty. After moving to Half Moon Island for a fresh start, he finds himself drawn to the local hockey league. It’s immediately clear he’s too rusty to play and too old to keep up, but Brooks can’t bring himself to quit, not after he meets Carrick…  Heading to the box… It’s almost time for Carrick to leave town for a year, before the humans around him notice he never ages. In preparation, he has been slowly distancing himself from the other players on his hockey team. Carrick knows he’s losing friends and the game he loves but supposes it’s a fair price to pay for immortality. Just when Carrick thinks he’s ready to say goodbye, Brooks joins the team, and Carrick knows he has met his true mate at last.  Ready to face off… When Carrick is attacked one night after practice, Brooks refuses to leave his side, even when his friend changes into a wolf before his eyes. If that wasn’t hard enough to believe, Carrick offers him the chance to become a wolf as well, with all the perks that go along with it, including eternal youth and a soulmate. Brooks is tempted but can’t shake the feeling that it sounds too good to be true. He’s leaning heavily toward no, and it will take something drastic to change his mind…  Icing the Omega is a 60k novella about love of the ice, getting a second chance, and what happens when you put two adrenaline-fueled true mates together. You’ll find two tough guys, yummy icing, and a knotty alpha ready to defend the net and his mate. M/M Alpha/Omega Shifters Mpreg.",
  "genres": [
    "Omegaverse",
    "Shapeshifters",
    "Sports",
    "M M Romance",
    "Fantasy",
    "M M Paranormal",
    "Friends To Lovers"
  ],
  "author": "Harper B. Cole",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/41025429-icing-the-omega"
}