{
  "title": "Smoke and Mirrors",
  "description": "It’s a fight to love each other, but it’s a love worth fighting for.\n  Tori’s life had been defined by loss. The loss of her father.  The loss of her innocence. And finally, the loss of her vision.  She prides herself on always rising above anything life throws at her, but losing the man she loves would ruin her.   Tori has always ferociously guarded her fragile heart, but she’s trying hard to let Scott inside her fortress. As her walls begin to crumble the shadows of her past begin to haunt her. Can she trust that Scott will still love her once he sees what lies within?  Tori longs to escape from the pain of her past and reclaim the art that is screaming inside her soul. But is her artistic career yet another loss she'll never regain?  While Tori wrestles with her inner demons, Scott wages a war against his controlling nature; confronting his own fear of loss.  Scott wants Tori to promise her life to him. The problem is Tori’s unpredictable. Some days she’s a hurricane and other days she’s a light breeze. He walks a tightrope between protecting her and letting go, struggling to gain trust of her tattered heart.  Dear Readers:Smoke and Mirrors is book two in the Fire and Fury series. It continues the tale of Scott and Tori’s epic love story. Scott and Tori’s books must be read in order. You can read part part one in Chasing Fire part two in Smoke and Mirrors and part three in Burn for You. All novels are full-length books with a HFN ending, featuring a hot-as-hell alpha and a sexy artist who both have filthy mouths. Intended for a mature audience.  \nFIRE AND FURY SERIES: \n  NOW AVAILABLE…  Chasing Fire (1) (Scott and Tori Part 1, Novel) Smoke and Mirrors (2) (Scott and Tori Part 2, Novel) Burn for You (3) (Scott and Tori Part 3, Novel) Dream by the Fire (Scott and Tori Bonus Christmas Novella)  COMING SOON:  Fighting the Blaze (4) (Blaze and Brandi, Novel)",
  "genres": [],
  "author": "Avery Kingston",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/41033348-smoke-and-mirrors"
}