{
  "title": "World's Greatest Truly Offensive Jokes 2018",
  "description": "St. Peter stood at the Pearly Gates, waiting for the incoming, and he needed to use the restroom. He saw Jesus walking by and caught his attention. \"Jesus, could you mind the gate while I go take a leak?\" \"Sure,\" replied Jesus. \"What do I have to do?\" \"Just find out about the people who arrive. Ask about their background, their family, and their lives. Then decide if they deserve entry into Heaven.\" \"Sounds easy enough,\" Jesus shrugged. So Jesus waited at the gates while St. Peter went off on his errand. The first person to approach the gates was a wrinkled old man. Jesus summoned him to a chair in front of a Heavenly desk and sat across from him. Jesus peered at the old man and asked, \"What was it you did for a living?\" The old man replied, \"I was a carpenter.\" Jesus remembered his own earthly existence and leaned forward. \"Did you have any family?\" he asked. \"Yes, I had a son,” the old man nodded, “but I lost him.\" Jesus leaned forward some more. \"You lost your son? Can you tell me about him?\" \"Well, he had holes in his hands and feet,” the old man said tearfully. Jesus leaned forward even more and whispered, \"Father?\" The old man leaned forward and whispered, \"Pinocchio?\" This collection of raunchy, offensive, nasty jokes is sure to shock and offend nearly everyone. \"Five stars! I don't know if you can legally tell a joke where Donald Trump has his way with Sasha and Malia Obama, but this is the book to find it!\" Funniest Ever Weekly \"This book makes fun of blacks and whites, Christians and Muslims, women and transexuals, and everyone in between in a series of the funniest, dirtiest jokes ever. Just don't get caught reading it!\" Comics Forever A black guy walks into a country bar in Alabama and orders a white wine. Everybody sitting around the bar looks up, surprised, and the bartender looks around and \"You ain't from around here, are ya? Where ya from, boy?” The black guy says, \"I'm from Iowa.\" The bartender asks, \"What th' hell you do in Iowa?\" The black guy responds, \"I'm a taxidermist. \" The bartender asks, \"A taxidermist... now just what th' hell is a taxidermist? \" The black guy says, \"I mount animals.\" The bartender grins and shouts out to the whole bar, \"It's OK, boys, he's one of us!\"",
  "genres": [],
  "author": "mad comedy",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/41041409-world-s-greatest-truly-offensive-jokes-2018"
}