{
  "title": "A Slight Indiscretion",
  "description": "When his older brother and father die in quick succession, Fitzwilliam ‘Will’ Lancaster finds himself Marquess of Henshaw. It is a role he has secretly coveted and spent his entire life preparing for. Unlike his predecessors, he has determined that his name be one worthy of respect, one with no shameful shadow, not even the faintest hint of anything scandalous. And then Miss Selina Darling crashes into his life. Miss Darling mixes in artistic circles, her friends are poets and painters and writers, and glamorous characters who are not entirely respectable. Miss Darling also has the unfortunate habit of saying exactly what she thinks, without thinking about what she’s saying. The only man in her life who adores her without reservation is her scandalous father, Mr ‘Bertie’ Darling, beloved of opera singers and pretty bits of muslin throughout London. When the Marquess does the gentlemanly thing and rescues Selina from a tricky situation, things go quickly awry. The only way to avoid being the scandal of the century is to marry the wretched creature though it’s the last thing he wants. Before he knows what’s hit him, Will discovers himself married to a girl without an ounce of propriety and a penchant for embarrassing him in public with her dreadful friend. Try as she might, Selina cannot stay out of trouble nor find any way of pleasing her dour and determined, joyless husband. Yet she’s sure there is another man hiding beneath his impeccably tailored clothes, just itching to get out … if only she could reach him.  ***NOTE: This book and series contains mild swearing and mildly graphic and descriptive sex scenes - NOT erotica***",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Regency Romance",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Emma V. Leech",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/41031945-a-slight-indiscretion"
}