{
  "title": "Reyanna's Prophecy",
  "description": "Reyanna is a woman with a secret. A human raised among the noble and wise Weya, she had passed all the tests and become a Ranger, as adept with bow and dagger as any of the elf-like people who trained alongside her. But she has a frightening power deep within, and it’s growing. When a vision strikes out of nowhere, a powerful prophecy that brings her to her knees, she is thrust headlong into a perilous journeyThe war with the vile sorcerer, Mordak, ended over twenty years ago, and the land is peaceful. The Jidaan-wielding Guardians who survived have gone their separate ways, settling into more quiet lives. The power in the short-handled, long-bladed spears has slumbered, no longer needed. When the same vision overcomes the Guardians, they know the time has come to awaken the Jidaan once more.Gart, wielder of the Jidaan of Storms, and the most powerful of the Guardians, sets out on a dangerous quest that will either reunite him with his love or destroy the world. Three evil sorcerers have their own plans for Gart, and they will stop at nothing to get what they want. And all the while, Reyanna’s power struggles for release.\nCan Reyanna and the Guardians solve the riddle of the prophecy in time? Or will Gart’s obsession bring about the end of all things?\nIt’s a fast-paced, exciting epic fantasy adventure set in the world of the Fire of the Jidaan trilogy!\n\nPacked full of action and adventure, The Forge Born Duology is perfect for fans of Dennis L. McKiernan’s Mithgar series, Simon R. Green’s Forest Kingdom tales, or Raymond Feist’s Riftwar Saga.\n\n Interview with the Author \nQ - So, what makes books of your world so special?\nA – This epic fantasy series came about because years ago, I read a couple of books from a series that was new to me…and I hated them! I wanted a certain kind of sword and sorcery tale that had noble heroes, evil villains, and lots of action and adventure! Frustrated, I figured it was time I wrote the story I wanted to read.A lifelong martial artist (I now own and run a martial arts school), I also wanted to add a certain ‘kung fu flavor’ to the tale. I integrated certain martial arts concepts into the story. I’ve always been a fan of long-bladed Chinese weapons, and they inspired the magickal spears that are central to the story. I actually had one made, and I love how it moves! See it here: https://www.youtube.com/watch?v=ShR8A...The Forge Born Duology and its predecessor, the Fire of the Jidaan Trilogy, both give you solid fantasy tales set in a familiar, exciting, and occasionally astonishing world of blades, magick, and monsters: fun stuff!\nQ – Will there be more books set in the same world?\nA – Yes! I’ve already begun notes on a story (a couple, actually) that happens not long after the events of the Duology. I keep ‘seeing’ scenes in that world that make me ask questions. The only way I can answer those questions is to write the danged story!Q - So, why should readers give these books a try?A – Let’s let the readers answer that!\n“All the characters are vividly described and draw you in the story more than you could imagine. In a market saturated with fantasy fiction now, this is one story that will leave you wanting more and looking forward to the future books.”\n\n“All in all it is storytelling done right and I can't wait to read the next installment.",
  "genres": [
    "Fantasy"
  ],
  "author": "Whit McClendon",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/41065049-reyanna-s-prophecy"
}