{
  "title": "The Harbinger",
  "description": "The rules of the Second, a list by Faith Blackwell.  One: technology doesn’t work. The Second doesn’t need electricity when it has magic. Two: don’t trust anyone. The Second’s races—the Elven, the Malus, the Ulen and the Dracon—are way too pretty to trust. Three: when someone tells you you’re the new Harbinger, believe them. Bad things happen if you don’t.  Back in the sixties, the last Harbinger permanently opened the gateways between Earth and the Second. Humanity grew accordingly. Faith is in her fifth year at the Academy, with her sight set on joining the Division, the branch of government that enforces what most law enforcement can’t, like smuggling goods between worlds. Following her mother’s footsteps has always been the plan.  Of course, she doesn’t want to follow them to a T. Her mother had awful luck with men, as did her grandma. Faith wouldn’t mind finding out what’s so special about a man that it has her quirky grandma swearing at them constantly. A field trip to the Second is just what she needs.  Being the first female Harbinger in the Second’s history and having to face down the realm’s most dangerous Dracon, also known as the ridiculously-named Dread King? Not what she needs.  Faith isn’t a hero. That sort of responsibility is not what she wants. The perks that come with it—like a sexy but infuriating Elf, a flirty Malus, and a quiet and pensive Ulen—well, maybe for them she’ll make an exception to her grandma’s no-man rule.  Maybe she’ll have them all.  The Harbinger is the first in a slow-burn, reverse harem fantasy series. Expect eventual hot and steamy scenes, coupled with the Chosen One trope, and a heroine who will reluctantly try to save a world that isn’t hers.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Young Adult",
    "Paranormal",
    "Urban Fantasy",
    "Paranormal Romance"
  ],
  "author": "Candace Wondrak",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/41070074-the-harbinger"
}