{
  "title": "Sevin",
  "description": "Sevin\n Being the son of a wolf pack leader means nothing when your mother is a human. Cast out of his pack because of his impure blood, Sevin’s misfortune takes a turn for the better when he’s literally adopted off the street by two otherworldly males.  That’s where his good luck ends. Destined to be mateless because wolf-shifter females find him repulsive and human women can’t know of his existence, one-night stands become a staple for this affection-starved canine.  Despite being sheltered in the protection of his new family, Sevin continues to be relentlessly hounded by the younger males in his former pack. When he’s grievously injured by their endless pursuits, he finds himself rescued off the streets for a second time.  \nJanie\n Plain Janie has never been a blip on men’s radars until she stumbles upon a sinfully sexy stranger in an alley. Naked and injured, the nurse in her rushes to his aid while the woman in her fights to control her scorching attraction.  But her mysterious stranger proves to be more than meets the eye. When she secretly learns he’s more than human, an overwhelming protectiveness flares to life as she skirts the edge of illicit activity to safeguard his species from discovery.  Finally giving into her carnal desires, Janie isn't prepared for what Sevin has to offer. His anatomy being nothing like a man’s sets her body on fire while his irresistible charm captures her heart and soul.    Gladly setting aside his whoring days for a woman who quenches his every desire, Sevin is unaware rival wolf-shifters are encroaching on his former pack’s territory. When those who already caused him harm add insult to injury by involving Janie in their melee, Sevin will do anything to get her back. Even teaming up with his enemies to do it.",
  "genres": [
    "Paranormal",
    "Suspense",
    "Demons",
    "Angels",
    "Paranormal Romance"
  ],
  "author": "L.S. Anders",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/41067001-sevin"
}