{
  "title": "Red Clay, Blue Cadillac: Stories of Twelve Southern Women",
  "description": "Twelve short stories of all the wrong women.The author of First Lady and Handling Sin has given us a page turning collection of short stories, with a central theme in each of which the main character is a belle of the South whose talents include a penchant for deceit, betrayal, seduction and sometimes murder. Written in the author's wry and masterful voice, these evocative stories are infused with all the peculiar customs, ironies and humor so special to the South.The twelve stories in this collection include \"Red Clay,\" which won an Edgar Allen Poe Award, in which a local girl from Thermopylae becomes a movie star who moves back to her sleepy North Carolina home town and is tried for murdering her unfaithful husband. Her trial causes the town and one man in particular to look back with longing and nostalgia at this exquisite Southern belle who captivated-and sometimes manipulated-every man she met.\"Fast Love,\" the recipient of an O. Henry Award, is the story of a man who chases down his future wife after seeing her jog past. As he gets closer to his quarry, he also gains the courage to stand up for what he wants and to champion what he believes.In \"Blue Cadillac,\" Marie, blonde and beautiful, shares dinner and her love of Elvis with a high-tech sales rep on his way home to Memphis. Along the way and on the road, they have exquisite sex and decide to part, Marie in her blue Cadillac. As he rings the bell at his mother's house, the young man discovers that he has been robbed of his wallet and his whole life on cards.Self-contained masterpieces, each of these short stories has the impact and power of a full-length novel.Stella : red clay --Marie : blue Cadillac --Precious : winners and losers --Charmain : white trash noir --Lucy : maniac loose --Flonnie : the rising of the South and Flonnie Rogers --Patty : love and other crimes --Meredith : fast love --Angie : the power --Mona : Miss mona's bank --Betty : a deer on the lawn --Mattie : invitation to the ball",
  "genres": [
    "Short Stories",
    "Fiction",
    "Southern",
    "Mystery"
  ],
  "author": "Michael Malone",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/410612.Red_Clay_Blue_Cadillac"
}