{
  "title": "Abdication",
  "description": "From critically acclaimed historian Juliet Nicolson comes a glorious debut novel set in 1936 London about secrecy, tumultuous love, and a king and his subjects torn between public duty and private desire.England, 1936.The year began with the death of a beloved king and the ascension of a charismatic young monarch, sympathetic to the needs of the working class, glamorous and single. By year’s end, the world would be stunned as it witnessed that new leader give up his throne in the name of love, just as the unrest and violence that would result in a Second World War were becoming impossible to ignore.During the tumultuous intervening months, amidst the whirl of social and political upheaval, wise-beyond-her-nineteen-years May Thomas will take the first, faltering steps toward creating a new life for herself. Just disembarked at Liverpool after a long journey from her home on a struggling sugar plantation in Barbados, she secures a position as secretary and driver to Sir Philip Blunt, a job that will open her eyes to the activities of the uppermost echelons of British society, and her heart to a man seemingly beyond her reach.Outwardly affable spinster Evangeline Nettlefold is a girlhood friend to the American socialite Wallis Simpson, a goddaughter to Lady Joan Blunt and a new arrival to London from Baltimore. She will be generously welcomed into society’s most glittering circles, where one’s daily worth is determined by one’s proximity to a certain H.R.H. and his married mistress. But as the resentment she feels toward Wallis grows in magnitude, so too does the likelihood of disastrous consequences.Young, idealistic Julian Richardson’s Oxford degree and his close friendship with Rupert Blunt have catapulted him from excruciating hours in his mother’s middle-class parlor to long holidays spent at stately homes and luxurious dinners in the company of a king. But even as he enjoys his time in this privileged world, his head cannot forget the struggles of those who live outside its gilded gates, and his uneasy heart cannot put aside his undeclared affection for May.May, Evangeline and Julian will all become embroiled in the hidden truths, undeclared loves, unspoken sympathies and covert complicities that define the year chronicled in Abdication . In pitch-perfect prose, Juliet Nicolson has captured an era in which duty and pleasure, tradition and novelty, and order and chaos all battled for supremacy in the hearts and minds of king and commoner alike. As addictive as Downton Abbey, as poignant as The Remains of the Day, Abdication is a breathtaking story inspired by a love affair that shook the world at a time when the world was on the brink of war.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "British Literature",
    "Audiobook",
    "Book Club",
    "Adult Fiction"
  ],
  "author": "Juliet Nicolson",
  "average_rating": "2.95",
  "url": "https://www.goodreads.com/book/show/12331573-abdication"
}