{
  "title": "Learn German with stories and audios as workbook. German language course for beginners and advanced learners.: German made simple. (Sprauch 1)",
  "description": "I am from Austria. Therefore all the scenes in this book play in Austria. Learn German with 12 random stories? Is it really that easy? Well, probably not the way you think it works. You won´t learn grammar here. But you will get a feeling for the structure of the foreign language. Tons of vocabularies in the context of stories. Learning with stories. Listen to them and read simultaneously. Immersion is key to this course. Have fun! ★★★★★★★★★★★★★★★★ This course is not meant to include all aspects of the foreign language. I want to encourage you to travel, try Duolingo (the App), and listen and read and watch movies in the foreign language. Of course traveling always is great. ★★★★★★★★★★★★★★★★ This course, if you can call this book so, shall put its benefits on the market for you. It gives you 12 stories, with whom you will be able to deepen your language knowledge. To get started have a look at the table of content. ★★★★★★★★★★★★★★★★ Content This book is structured in 12 stories. Every story is structured in 3 pieces. ➤ 1: the English story ➤ 2: the Word to Word (WtW) translation from English to German ➤ 3: the German story ★★★★★★★★★★★★★★★★ Besides, you find the mp3´s (in the table of content and with every chapter title). ➤ @ mp3 German+mp3 German slow, ➤ @ mp3 Sentence for Sentence, ➤ @ mp3 English) ➤ Just learn the things you want to do first. ➤ Understanding the language through listening and reading ➤ Talking through talking with the recordings ➤ Writing through writing This course is not meant to be a complete course for the foreign language. I want you to check out other courses as well. And traveling and other texts and mp3´s. ◆◆◆ Persons These persons exist in the G/: Gerhard, the father of the family U/: Ulrike, the mother of the family T/: Thomas, the eldest son A/: Anton, the middle son M/: Markus, the youngest son J/: Julia-the girlfriend of Markus B/: Server in the restaurant W/: Wolfgang, a friend L/: Laura, a friend ◆◆◆◆◆ Good learning Anton Hager",
  "genres": [],
  "author": "Anton Hager",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/41079141-learn-german-with-stories-and-audios-as-workbook-german-language-course"
}