{
  "title": "Lost: A N’arth Chronicle",
  "description": "Hi, I’m Shannon Mackay, Shazz to my friends.I love singing, sword fighting and fantasy books, games, cosplay, movies, TV series... When I’m not singing, fighting, reading, watching or engaged in something fantasy I’m imagining it. I even dream fantasy.That’s why, one night when this huge ball of lightning rolls over me and, next minute, I’m someplace (N’arth) and sometime else (2000 years in my future), I’m convinced I’m dreaming. One of my classic duel dreams where I fight the baddy and I win!When I can’t sing, lose the duel, and don’t wake up after a really hard fall, I start to believe this old guy, Nuselmir.He’s the one who brought me to N’arth. He says he’s a scientist from an advanced planet, destroyed by his brother Fircule, and now Fircule’s trying to destroy N’arth. He’s convinced that only one person can save this world, Princess Raylene. Big problem, some childhood trauma caused her to become mute and withdrawn. In desperation, Nuselmir put her genetic markers in a device called a Dron and used it to locate someone who looks like her and could impersonate her‒me and then swaps us. Oh, yeah, my Mum and Dad will love that.So, he drags me to this other place, where toilet paper hasn’t been invented yet and expects me to be her. No way! Not my monkey! That is until I learn of Fircule’s Big Plan to Destroy the Universe. N’arth is just the beginning, Earth is next on his list. The sooner I do what I have to do, the sooner I can get back to Earth and warn it of Fircule’s plan.The fantasy becomes reality but it’s not that easy. Nuselmir hasn’t got a plan. Just impersonate Raylene. Great. And there’s so much he doesn’t tell me, like why nobody likes Raylene. Not only have I been transported to a new place I’ve got no friends and I can’t sing. It’s tough, really tough. Except for the training with the sword, that I do pretty well at. BTW, Sword Master is not impressed when I searched the armoury and choose the king’s boyhood sword.Things go from tough to unbearable when my ‘father’ King Alexander visits Nuselmir’s island keep and tries to get me killed—twice. Oh, and thanks Nuselmir but, if I die on N’arth that’s it. I’m dead. The king leaves the keep believing I’m dead and this is the thing that changes everybody’s mind about me. So, I don’t actually have friends, but I do have respect and loyalty from the servants and soldiers and this inspires me to look out for them.If the king finds out I’m still alive...I search maps and plans and eventually find a place for us all to escape to, a cave accessed through a secret passage that starts in my room. We barely get away before the king’s assassins strike.Five of us. Me, of course. Yannah, my maid and Raylene’s childhood friend. Dieter, a bastard kitchen hand. Brghyn a humanoid alien. And an unconscious Nuselmir.We can’t do anything to rouse Nuselmir and decide to find the Red One, a reclusive healer who might live near the Ridge, where Brghyn’s race live. It’s my idea to disguise ourselves and hopefully avoid detection on the road by the king’s soldiers.The journey is fraught with danger and deprivation, but we eventually make it to the city of Pleth, where I meet a really old guy called Sim. In a soundproof room, he teaches me the Last Song, embeds a clear crystal in my sword, and dies.Fircule must have heard the singing—which isn’t surprising because he’s the one who used a Dron to stop singing in the first place. He sends his mate Herlon to grab me, only I’m with Yannah this time, and takes us to Herlon’s Nodal Mines. We are three months in the mines where the task of killing the life source of N’arth nearly kills me.Why do I obey Herlon?How do we escape?Do Brghyn, Dieter and Nuselmir find the Red One.What happened to the real Raylene?Why me?Who saves N’arth?Read The Lost to join me on my adventure and find the answers to these questions.",
  "genres": [
    "Fantasy"
  ],
  "author": "Val   Clark",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/41084310-lost"
}