{
  "title": "Krol's Goddess",
  "description": "Krol doesn't trust females. His brother's Queen tried to kill their son, and killed him when Krol escaped with the baby. Then she caught up with him and beat him almost to death, leaving him scarred and maimed. But Krol survived, and has been raising his nephew by himself in hiding for three years. Unlike the rest of his kind, Krol can see Bonding for what it really is, nothing more than a way for selfish, unscrupulous females to enslave the men around them. He is determined that will never happen to him, nor to his nephew, Ryll, who is the only thing keeping him from losing what's left of his mind out in the wilds.  Naomi is a Scout leader, so she's not too worried when she finds herself in a strange jungle. She knows how to survive. What she doesn't know is where she is or how she got there. Nevertheless, she's determined to put a brave face on things, until she discovers Krol and Ryll, who she thinks are Bigfoot! A misunderstanding leads Krol to attack her, but when torrential rain hits the area, they are forced to take shelter together in the same cave. Begrudgingly, they learn to trust each other, until they become each other's only friend in a sometimes beautiful, sometimes deadly world.  Staying together after the weeks of rain, they eventually stumble upon Ruth and Moira, two human women who are living with the 'Bigfoot' and can finally give Naomi the answers she needs about what's happened to her. Ruth and Moira have both settled down with the locals, and Ruth even has a baby with one of them, and Moira is pregnant! With their eyes opened to the possibilities, Naomi and Krol are forced to see each other in a new light, and wonder if maybe they could be more than friends, and finally make a real home in this alien land.",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction",
    "Science Fiction Romance",
    "Fantasy",
    "M F Romance",
    "Paranormal Romance"
  ],
  "author": "V.C. Lancaster",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/41085656-krol-s-goddess"
}