{
  "title": "The Suspect: An Olympic Bombing, the FBI, the Media, and Richard Jewell, the Man Caught in the Middle",
  "description": "A contributing source for the Warner Bros.’ film Richard Jewell starring Sam Rockwell, Kathy Bates, Jon Hamm, Olivia Wilde and Paul Walter Hauser.The masterful true-crime account of the 1996 Centennial Olympic Park bombing that captured the world's attention, and the heroic security guard-turned-suspect at the heart of it all On July 27, 1996, a hapless former cop turned hypervigilant security guard named Richard Jewell spotted a suspicious bag in Atlanta’s Centennial Olympic Park, the town square of the 1996 Summer Games. Inside was a bomb, the largest of its kind in FBI and ATF history. Minutes later, the bomb detonated amid a crowd of fifty thousand people. But thanks to Jewell, it only wounded 111 and killed two, not the untold scores who would have otherwise died. With the eyes of the world on Atlanta, the Games continued. But the pressure to find the bomber was intense. Within seventy-two hours, Jewell went from the hero to the FBI’s main suspect. The news leaked and the intense focus on the guard forever changed his life. The worst part: It let the true bomber roam free to strike again.  What really happened that evening during the Olympic Games? The attack left a mark on American history, but most of what we remember is wrong. In a triumph of reporting and access in the tradition of the best investigative journalism, former U.S. Attorney Kent Alexander and former Wall Street Journal reporter Kevin Salwen reconstruct all the events leading up to, during, and after the Olympic bombing from mountains of law enforcement evidence and the extensive personal records of key players, including Richard himself.The Suspect, the culmination of more than five years of reporting, is a gripping story of the rise of domestic terrorism in America, the advent of the 24/7 news cycle, and an innocent man’s fight to clear his name.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Crime",
    "Audiobook",
    "Biography",
    "Terrorism"
  ],
  "author": "Kent Alexander",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/41104144-the-suspect"
}