{
  "title": "The Waiting Mortuary",
  "description": "Welcome to The Waiting Mortuary where embalming is free whether you're dead or alive. Bash Trawler wants to find an easy summer job so he can get back to partying with his friends. When he discovers an advertisement in the local paper for night watch at a nearby funeral home he jumps at the chance to make quick money. But staying up all night watching corpses for an eccentric war vet turns into something out of his worst nightmares.Casey McClair wants to make the tennis team. Popularity has never come easily to her and she’s willing to practice into the late evening and follow all the rules of the game if it means she’ll finally find acceptance. But when she's kidnapped, she'll have to fight to survive a harrowing ordeal with a cold and calculated serial killer.Serial Killer X knows about pain. He's been through the worst of what humans do to each other. The thrill is in the fight and he'll make sure his victims know it.Three stories intertwine to tell the sickening tale of what goes on inside THE WAITING MORTUARY.What readers are ★★★★★ \"Sick, twisted, thrilling, engrossing. I was unable to put it down! I loved it...especially the twist at the end!\"★★★★★ \"The Waiting Mortuary has a lot of twists & turns & just when you think it's over...it grabs you again.\"★★★★★ \"My heart was racing for the entire last half of the book and it still didn't slow down for quite a while after I finished.\"★★★★★ \"All 3 characters are brought together with their own stories to tell in this intriguing book. It all comes together in a fast-paced story.\"★★★★★ \"One of my new favorites. Tense and well-paced, it's definitely something I would suggest to others.\"★★★★★ \"I loved this book. I was guessing until the end and the implications of the final pages chilled me to the bone! I look forward to more from this author!\"",
  "genres": [
    "Horror",
    "Serial Killer",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "L.V. Pires",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/41092425-the-waiting-mortuary"
}