{
  "title": "The Spy Among Us",
  "description": "The Spy Among Us  by Thomas J. NicholsThe Spy Among Us  is the third novel in the trilogy of FBI Special Agent Christie Cole. Set in Moscow, the reader follows a plot similar to the real-life intelligence hacking seen in contemporary news reports.A wife and mother, Christie's assignment to the International Joint Terrorism Task Force takes her to the heart of espionage and murder. Working with fellow agents in the cover of a German travel agency, Christie assumes the persona of a Russian accountant, Eva Durov. As the lead agent, she is torn by agency data breaches that have lead to the assassination of Task Force agents, and her true character as a wife and mother.Her dual roles are conflicted by her relationship with Russian Army Colonel Pytor Popov. Whether as a spy or a loving wife and mother, she walks a thin line between spies and counterspies, her heartfelt love for her husband and child, and the masculine companionship on the Russian officer.This final episode follows Christi Cole's other assignments in  Voices in the Fog , and  The Arrows of Allah .ABOUT THE AUTHOR Chief Thomas J. Nichols' law enforcement career began in the Tucson, Arizona, Police Department. He retired as Deputy Chief from that department to accept the position as Chief of Police of the Lubbock, Texas, Police Department. Chief Nichols later retired from municipal policing to accept the challenges of a rapidly changing society by establishing the Lubbock School District Police Department.During his nearly fifty-year police career, Chief Nichols held numerous assignments on local and state boards and commissions that address the issue of crime and violence. He has published local, regional, state and national articles and journals on policing techniques and school safety, and has penned an award winning novel which has been optioned to become a major Hollywood film. His recent novel,  The Arrows of Allah , was named the 2018 winner for \"Most Realistic Novel,\" by the Texas Authors Assoc.A graduate of the University of Arizona, magna cum laude, the chief also graduated from the FBI National Academy, the FBI Executive Development Program, the Senior Management Institute for Police, and many other training programs on organized crime, narcotic and dangerous drug investigations, and executive protection. Married and a father of two grown children, the chief resides on the Llano Estacado of Texas.",
  "genres": [],
  "author": "Thomas J.  Nichols",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/41113499-the-spy-among-us"
}