{
  "title": "Pimps Up, Ho's Down: Hip Hop's Hold on Young Black Women",
  "description": "Untangles the intricately knotted issues around hip-hop culture and its treatment of young black womenPimps Up, Ho’s Down pulls at the threads of the intricately knotted issues surrounding young black women and hip hop culture. What unravels for Tracy D. Sharpley-Whiting is a new, and problematic, politics of gender. In this fascinating and forceful book, Sharpley-Whiting, a feminist writer who is a member of the hip hop generation, interrogates the complexities of young black women's engagement with a culture that is masculinist, misogynistic, and frequently mystifying.Beyond their portrayal in rap lyrics, the display of black women in music videos, television, film, fashion, and on the Internet is indispensable to the mass media engineered appeal of hip hop culture, the author argues. And the commercial trafficking in the images and behaviors associated with hip hop has made them appear normal, acceptable, and entertaining - both in the U.S. and around the world.Sharpley-Whiting questions the impacts of hip hop's increasing alliance with the sex industry, the rise of groupie culture in the hip hop world, the impact of hip hop's compulsory heterosexual culture on young black women, and the permeation of the hip hop ethos into young black women's conceptions of love and romance.The author knows her subject from the inside. Coming of age in the midst of hip hop's evolution in the late 1980s, she mixed her graduate studies with work as a runway and print model in the 1990s. Her book features interviews with exotic dancers, black hip hop groupies, and hip hop generation members Jacklyn “Diva” Bush, rapper Trina, and filmmaker Aishah Simmons, along with the voices of many “everyday” young women.Pimps Up, Ho’s Down turns down the volume and amplifies the substance of discussions about hip hop culture and to provide a space for young black women to be heard.2007 Popular Culture Association/American Culture Association Emily Toth Award",
  "genres": [
    "Nonfiction",
    "Music",
    "Feminism",
    "Sociology",
    "Gender",
    "Womens",
    "African American"
  ],
  "author": "T. Denean Sharpley-Whiting",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/410952.Pimps_Up_Ho_s_Down"
}