{
  "title": "Stepping Out Of Eden",
  "description": "Science has manipulated DNA, mapped the human genome, and cloned both plants and animals. They estimate that humans share 99 percent of their DNA with chimps, but the 1 percent difference enables humans to create art, literature and religion. We often wonder, what makes humans innately human? Is it our biological differences, our lack of body hair, the size of our brains, opposable thumbs or our ability to walk upright? What was the catalyst that spurred the transition from tree-dweller to an upright, tool-making being able to travel to the moon? The evolution of man has adherents in multiple disciplines. Some hold firm to religious doctrine, while others believe evolution is nothing more than survival of the fittest and that humans are still developing. Other factions believe that humans were genetically engineered by extraterrestrials and are the result of an infusion of alien DNA. Dr. Rita's new book, Stepping Out Of Eden , offers a new theory that will leave readers questioning and contemplating the implications long after they've turned the last page. It incorporates perspectives from a variety of disciplines ranging from psychology, behaviorism, anthropology and science to religion, spiritualism and mythology. Through logical investigation into the mythic records, archeological finds and theological sources, she arrives at clear and concise conclusions. The book offers a broader view that questions many of humanity's most dearly held beliefs about itself and answers many of the questions that people have, but are told not to ask. About The Author Bestselling author, Dr. Rita Louise is a consummate researcher who passionately explores topics such as ancient mysteries, Ufology, mythology, health and healing, ghosts, intuition, and the paranormal. She is the author of 5 books and the producer of a number of feature length and film shorts, which have been viewed on YouTube over 5 million times. A public speaker in high demand, Dr. Louise has appeared on radio, television and on film and has spoken at conferences around the United States. Her writings have appeared in books, magazines and newsletters around the world. Author Endorsements Dr. Rita Louise asks important questions about our very existence as a species. Strap yourself in for quite a ride! - Jim Willis, author of Ancient Lost Histories A new mystery unfolds on every page. The book reads like a detective story which leads us to most surprising conclusions. - Stanislaw Kapuscinski, author of Delusions",
  "genres": [],
  "author": "Rita Louise",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/41110989-stepping-out-of-eden"
}