{
  "title": "Elven Psychology: Understanding the Elfin Psyche and the Evolutionary and Esoteric Purpose of Mental Disorders",
  "description": "ELVEN PSYCHOLOGY: Understanding the Elfin Psyche and the Evolutionary and Esoteric Purpose of Mental Disorders expands the realms of modern psychology, which has never before included the elves and otherkin population as being real. If one says that they are an elf, most psychologists today will still hold you in suspect of having a delusionary disorder and try to evaluate you further. We explain in Elven Psychology why from a standard psychological point of view that believing you are an elf does not in itself constitute a disorder even in traditional psychology, and then we go much further and explore the disorders and psychological struggles that we observe in our modern society in both normal folk and elves/otherkin. This book is written from a unique elven perspective about the present day human condition, which includes an exploration of the psyche of both normal folk and elfae. We elves are elven by spirit, so our entrance into humanity is the addition of a new spiritual race, not a new physical race, and elves have been born in these modern times into all physical races, as well as most cultures and religions throughout the world. In fact, there are many who are following esoteric Ancient Wisdom Traditions, as well as some Tolkienists, who through the process of benevolent evolution, see 'elf as the new normal' or majority of humankind in the not so distant future. So, it is important to update many areas of academia that explore, express, and explain human life; psychology being one of these. In modern times, we Elves and otherkin have reincarnated in human form and thus the human population today has become even more diverse due to our presence. And since elves and otherkin are constantly growing in our own diversity and variations (we are an ever diversifying people), the human populous of which we are now a part is also becoming more varied by the day. This may sound like fiction to the 'normal folk,' but just ask thousands around the world who understand thems'elves to be elves or otherkin, including all manner of faerie folk, and they will tell you with certainty that it is real. We look toward the future of humankind with our elven souls and know that we must all learn to unite, normal folk and elfae alike, to accept each other for all our uniqueness and beautiful variations. Both authors, Zardoa and Silver Flame, who write under the pen name The Silver Elves, have advanced graduate degrees in Depth Psychology and Art Therapy. We have used our academic and clinical backgrounds as well as life experiences living and sharing the Elven Way for over 40 years to identify a new way of perceiving the struggles of elves and otherkin living in the stressful modern world that sometimes results in psychological discomforts, as well as identifying the disorders of normal folk that have yet to be written about in modern psychology. While these are not the disorders you would find in the Diagnostic and Statistical Manual of Mental Disorders (DSM) that is published by the American Psychiatric Association as a standard criteria for the classification of mental disorders, in our opinion they need to be included to begin updating clinical psychology to include the existence of elven and faerie folk and our perspective. While we do not really support the use of categories like in the DSM to describe mental discomfort (people are far more complex than to limit our understanding of them by psychological classifications), we are adding the elven perspective and new classifications as a way of updating this important discipline. Since both of us had a number of graduate classes in the study of the DSM required for various clinical psychology degrees, we have long had many discussions together on how the elven perspective has been left out of the DSM. So here in Elven Psychology we share them with you in an often tongue in cheek fashion. If the elves were to write their own DSM, this book would be a good start!",
  "genres": [
    "Psychology",
    "Spirituality",
    "Self Help",
    "Nonfiction"
  ],
  "author": "The Silver Elves",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/41113067-elven-psychology"
}