{
  "title": "Long Hard Truckers",
  "description": "Eighteen wheels, four rough hands, and two big… stick-shifts. These two hard-driving, filthy-talking truckers are ready to ride all night. And one sassy sorority girl is about to find out they’ve got more than just a big rig for her to ride…  The two of us? We’ve seen our share of hell. But after we left the Marines, all we wanted was our big rig truck, our own rules, and the freedom of the open road.  But when we see her - a pretty little thing in daisy dukes and cowgirl boots at the roughest truck stop around, there ain’t no way we’re not stepping in when trouble comes knocking.  Blonde, blue-eyed, and oozing innocence and temptation. Sierra McCree comes crashing into our world with trouble on her heels. She’s more than we ever bargained for – and more than we ever thought two roughnecks like us would ever find. And once we’ve got the teasing little sorority girl on our rig, she’s gonna be in it for the long haul.  Two big hard men like us should stay away from a flirty little tease like Sierra. Especially with the truck full of contraband we’re hauling for some very not nice people. But one teasing glimpse of her soft curves, and one taste of that bratty mouth, and we’re both addicted – obsessed, and driven to make her ours.  Cause the two of us? Well we share everything. Including her.  And out here?  Well, it ain't just the road that's long and hard...   Let’s be blunt: if two rough, wild, completely over-the-top growly alpha heroes stopping at nothing to claim their heroine isn’t your cup of tea, you probably want to give this book a pass. But if it is your thing?  ….well then, you’re in for a treat ;).  Buckle up, get those motors running, and get ready for one wild ride. This mfm romance is all about her - no m/m. As with all my books, this standalone novella is safe, with no cheating, and a HEA guaranteed.",
  "genres": [
    "Romance",
    "Erotica",
    "M F M",
    "Contemporary Romance",
    "Erotic Romance",
    "Novella",
    "Reverse Harem"
  ],
  "author": "Madison Faye",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/41127635-long-hard-truckers"
}