{
  "title": "The Book of the Underdog: The Manual to Rise To The Top, Win Over The Competition and Crush Your Boss",
  "description": "Max Cantor, the Pitbull of Wall Street, brings out of the shadows the winning tactics employed by the influencers, the elites, the C-suite, the moneybags.Business is war goes the old cliché.  The Book of the Underdog  is a manual for the underdog. This is a handbook is for the underappreciated, the least favored, the unwelcomed, the rejected.  The Book of the Underdog  is a study in career warfare.The Book of the Underdog  is a guide in the methods of ascension.You'll -Why you didn't get that job ( you weren't part of the two \"Tribes\") -90%+ of online Resumes get trashed and it's not even your fault -What is absolutely essential to scale up your career -How to wrestle the power away from your boss -How CEOs play the game of power -How to use anger to your advantage -Why fear is not an emotion !!! -CEOs and politicians have the largest number of psychopaths among them -Is there a \" Psychopath School\"? -How to find out what people want most and use it to your advantage -Why the path to the corner office is not what you see on TV and Conference talks -How the Underdog forges alliances -What it is to be awe-inspiring at C-Suite level-How to capture from low-level to high-level-How to shun a competitor who is better than youBefore defeating your boss, you need to elevate your game to the next level. You will learn the ins-and-outs of boss survivorship methods. Unmasking your rivals is not enough; it is necessary to bring yourself up. Learn to apply the two most important top boss traits. See yourself to the top of the food chain.Do you want to be more confident? Included and discussed in the Book of the Underdog are the three factors your confidence depends on. The Underdog will master those.You're not going to give your boss any more breaks after reading this book.From  The Book of the Underdog :\" Don't just read through the book though. I want you to actively take notes, match it to your situation, jot down on your pad or notes \" What I must do when I see my boss. How I will act next time I see my manager.\"  -Max CantorMax Cantor's mission is to have the Underdog defeat his make it mission accomplished.These are the ground rule tactics everyone needs to rise in their careers.  The Book of the Underdog  is a must read for anybody in highly competitive law, finance, technology, sales, publishing, government and public relations and entrepreneurship.",
  "genres": [],
  "author": "Max Cantor",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/41127876-the-book-of-the-underdog"
}