{
  "title": "Silent Warriors: Submarine Warfare in the Pacific",
  "description": "The year is 1941. Shortly after the United States declares war on Japan in response to Pearl Harbor, Japan’s Tripartite Treaty allies, Germany and Italy, declare war on America. The United States finds itself in a two-theater war. President Franklin Roosevelt sets as America’s first priority the defeat of Nazi Germany, electing to wage a more-or-less holding war in the Pacific. In the beginning, the only force opposing the Japanese onslaught in the Pacific is the U.S. Submarine Service. Jake Lawlor begins his war as executive officer aboard USS S-49, an aged S-class submarine, with orders to conduct unrestricted warfare against the enemy in the Pacific. When a freak mid-sea grounding causes the loss S-49, Jake assumes command of another boat, USS Orca, a new Gato-class submarine, under construction in Groton, CT. As Jake prepares a new boat and a freshly-assembled crew for war, the conflict in the Pacific is going badly for the Allies. This is the story of Captain Lawlor’s eleven war patrols, including an ongoing conflict with Imperial Japanese Navy Captain Hiriake Ito of the destroyer Atsukaze. The crew of the Orca is made up of grizzled veterans and wet-behind-the-ears youngsters, all working together for a single to bring an implacable enemy to its knees. Along the way, friendships are forged, and love affairs and marriages are created—and destroyed. Pour yourself a favorite libation, grab a comfortable chair, and enjoy a tale that’s sure to hold your interest in Silent Warriors by Gene Masters. PRAISE FOR SILENT WARRIORS “It would be impossible for one book to adequately tell the individual stories of the nearly 16,000 submariners who battled in the Pacific theater during World War II. Collectively, they served on 263 submarines and made 1,472 war patrols while taking that fight to the Japanese. They paid a high 52 lost boats and 3,482 dead submariners. Silent Warriors effectively uses the fictional exploits of one such submariner—Jake Lawlor—to encapsulate their angst, bravery, commitment, and dedication. Over . . . 44 months, Jake introduces us to fascinating characters—both real and fictional—and chronicles their heroic actions. Silent Warriors has something for every reader . . . daring deeds to quicken the pulse of the adventurous . . . battle and campaign details aplenty. Submariners and ‘Old Salts’ can be transported back by the tactical and technical depictions. Even romantics will find a love story that surfaces among the chaos of submarine warfare and endures in the changed world that emerges from the carnage that was World War II.” —JOE DOYLE, a career submariner, 13 years enlisted, 14 years an officer. Duty stations included six submarines and a variety of submarine support shore assignments in Atlantic and Pacific theaters. ABOUT THE AUTHOR Gene Masters is a retired consulting engineer living in East Tennessee with his wife, Ruth. They have two grown daughters, and two grandchildren. He is the author of several technical treatises, including his doctoral dissertation, but Silent Warriors is his first serious attempt at fiction. Masters received a commission in the U.S. Navy on graduation from college, and his first tour of duty was aboard a transport in the Western Pacific. His second tour was aboard a recommissioned and updated diesel-electric submarine, the USS Angler. Angler was originally commissioned in 1943, and made seven war patrols in the Pacific before being decommissioned. Her updating to an SSK-class boat in the 1950s fitted her for operation against cold war submarine adversaries with advanced soundproofing and sonar. Masters left Angler and active duty after a Mediterranean tour.",
  "genres": [],
  "author": "Gene  Masters",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/41124217-silent-warriors"
}