{
  "title": "Forty Signs of Rain",
  "description": "The bestselling author of the classic Mars trilogy and The Years of Rice and Salt returns with a riveting new trilogy of cutting-edge science, international politics, and the real-life ramifications of global warming as they are played out in our nation’s capital—and in the daily lives of those at the center of the action. Hauntingly realistic, here is a novel of the near future that is inspired by scientific facts already making headlines.When the Arctic ice pack was first measured in the 1950s, it averaged thirty feet thick in midwinter. By the end of the century it was down to fifteen. One August the ice broke. The next year the breakup started in July. The third year it began in May. That was last year.It’s an increasingly steamy summer in the nation’s capital as Senate environmental staffer Charlie Quibler cares for his young son and deals with the frustrating politics of global warming. Charlie must find a way to get a skeptical administration to act before it’s too late—and his progeny find themselves living in Swamp World. But the political climate poses almost as great a challenge as the environmental crisis when it comes to putting the public good ahead of private gain. While Charlie struggles to play politics, his wife, Anna, takes a more rational approach to the looming crisis in her work at the National Science Foundation. There a proposal has come in for a revolutionary process that could solve the problem of global warming—if it can be recognized in time. But when a race to control the budding technology begins, the stakes only get higher. As these everyday heroes fight to align the awesome forces of nature with the extraordinary march of modern science, they are unaware that fate is about to put an unusual twist on their work—one that will place them at the heart of an unavoidable storm. With style, wit, and rare insight into our past, present, and possible future, this captivating novel propels us into a world on the verge of unprecedented change—in a time quite like our own. Here is Kim Stanley Robinson at his visionary best, offering a gripping cautionary tale of progress—and its price—as only he can tell it.From the Hardcover edition.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "Climate Change Fiction",
    "Climate Change",
    "Environment"
  ],
  "author": "Kim Stanley Robinson",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/41129.Forty_Signs_of_Rain"
}