{
  "title": "The Devil to Pay",
  "description": "When it comes to talented new recruits at the Federal Underworld Agency, Nora Jacobs is only half the story… The Devil to Pay is the first book in Jackie May’s companion series to Nora Jacobs, set in the same urban fantasy Detroit, sharing several supporting characters (hello, Nick Gorgeous), but with a new main character, Shayne Davies. This series can be enjoyed on its own, but readers of the Nora Jacobs books will be more familiar with the world and its characters. As a fox shifter, Shayne Davies gets no respect in an underworld run by the fearsome and powerful—werewolves and vampires, sorcerers, demons, and mythical faerie creatures. Even at home, Shayne is still treated like the brat of the pack. Her mom constantly nags; her intended (but unwanted) mate ensures plenty of awkward silences, and Shayne is even expected to act submissive to the pack’s future alpha…a six year old. Yeah. Time for Plan B. All Shayne wants is to prove that she’s got what it takes to run with the big dogs, which is why she is constantly hounding Nick Gorgeous to make her an agent at the “Double D”, the Detroit Division of the FUA. That’s an easy “No” for Gorgeous, who keeps a strict “No Shayne Davies” policy. Well, never say never. When mysterious underworld criminals steal a load of bomb materials, the FUA picks up a messy case nobody wants to touch. It’s bad enough that a demon horde is involved, but now the annoying FBI has sent out an agent to babysit the investigation. To make matters worse, the notoriously uncooperative master vampire Henry Stadther has control over what may be the only key to breaking the a handsome human detective. The whole thing’s a hopeless disaster. So guess what, Shayne? You’re hired!",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Shapeshifters",
    "Fae",
    "Demons",
    "Magic"
  ],
  "author": "Jackie May",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/41123059-the-devil-to-pay"
}