{
  "title": "Hellfire and Kittens",
  "description": "As I passed by the small kitchen table that had come with the place, I noticed him sitting right in the center, blinking his yellow eyes at me. \n  Hell is just a place on earth, right?  For Lucy, this couldn't be any closer to the truth. Stuck working in another dead-end job in another unremarkable city, Lucy’s adapted to life on the run by arming herself with a smokescreen of snarky humor. Sometimes though, her filter-less sasses land her in hot water, especially when it comes to triggering her unruly magic. But, still haunted by the memory of her parents’ deaths, she does her best to scrape by under the radar. Little does she know, however, mysterious forces at work have other plans for her.  \nI knew I hadn’t left anything on it since what little mail I got, which was mostly bills and junk, littered the top my coffee table. \n  After a trip to the pound, where a small, scrappy black cat befriends her, a rapid series of events thrusts Lucy—literally—into the complicated world of Hell. Caught up in the politics for the scramble to secure Lucifer’s throne, Lucy’s birthright is challenged when a nefarious plot arises, threatening the stability of not only Hell, but the relationships she's worked to build after years of mistrust.  \nI cautiously closed the distance to the table, while he flung himself back into the floor.\n  Lucy will need to learn to rely on others and use the help offered to her by an alluring demon and a ragtag team of misfits in order to save Hell before it’s ripped apart by all manners of depraved, ruthless enemies.  \nExpertly hand penned across the front in fancy calligraphy was my name. My entire name.  Lucinda Kenna Melek.\n   Hellfire and Kittens is the first full-length reverse harem novel in a five-part Paranormal Romance series. That means Lucy won’t have to choose! Full of action, interesting creatures, hot guys, and a sassy independent heroine who is thrown into a strange world that she must learn to navigate while discovering that true love really does exist. Even if it is a bit unexpected and unconventional. **This series contains explicit language and adult situations. ***Trigger warning info—This book contains situations of grief and loss.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance",
    "Magic",
    "Demons",
    "Romance"
  ],
  "author": "Rhiannon Lee",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/41120728-hellfire-and-kittens"
}