{
  "title": "Kingdom of Lies: Unnerving Adventures in the World of Cybercrime",
  "description": "\"Kingdom of Lies is a brilliant and bold debut, as full of suspense as the best crime thrillers.\" --Linda Fairstein, New York Times bestselling author of Blood Oath In the tradition of Michael Lewis and Tom Wolfe, a fascinating and frightening behind-the-scenes look at the interconnected cultures of hackers, security specialists, and law enforcementA 19-year-old Romanian student stumbles into a criminal ransomware ring in her village. Soon she is extorting Silicon Valley billionaires for millions--without knowing the first thing about computers.A veteran cybersecurity specialist has built a deep network of top notch hackers in one of the world's largest banks. But then the bank brings in a cadre of ex-military personnel to \"help.\"A cynical Russian only leaves his tiny New Jersey apartment to hack sports cars at a high performance shop in Newark. But he opens his door to a consultant who needs his help.A hotel doorman in China once served in the People's Army, stealing intellectual property from American companies. Now he uses his skills to build up a private side-business selling the data he takes from travelers to Shanghai's commercial center.Kingdom of Lies follows the intertwined stories of cybercriminals and ethical hackers as they jump from criminal trend to criminal trend, crisis to crisis. A cybersecurity professional turned journalist, Kate Fazzini illuminates the many lies companies and governments tell us about our security, the lies criminals tell to get ahead, and the lies security leaders tell to make us think they are better at their jobs than they are.Like Traffic set in the cybercrime world,  Kingdom of Lies is as entertaining as it is eye opening.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "Science",
    "Audiobook",
    "Technology",
    "Business"
  ],
  "author": "Kate Fazzini",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/41150475-kingdom-of-lies"
}