{
  "title": "The Day the World Came to Town: 9/11 in Gander, Newfoundland",
  "description": "\"For the better part of a week, nearly every man, woman, and child in Gander and the surrounding smaller towns stopped what they were doing so they could help. They placed their lives on hold for a group of strangers and asked for nothing in return. They affirmed the basic goodness of man at a time when it was easy to doubt such humanity still existed.\"When thirty-eight jetliners bound for the United States were forced to land in Gander, Newfoundland, on September 11, 2001, due to the closing of United States airspace, the citizens of this small community were called upon to come to the aid of more than six thousand displaced travelers.Roxanne and Clarke Loper were excited to be on their way home from a lengthy and exhausting trip to Kazakhstan, where they had adopted a daughter, when their plane suddenly changed course and they found themselves in Newfoundland. Hannah and Dennis O'Rourke, who had been on vacation in Ireland, were forced to receive updates by telephone on the search for their son Kevin, who was among the firefighters missing at the World Trade Center. George Vitale, a New York state trooper and head of the governor's security detail in New York City who was returning from a trip to Dublin, struggled to locate his sister Patty, who worked in the Twin Towers. A family of Russian immigrants, on their way to the Seattle area to begin a new life, dealt with the uncertainty of conditions in their future home.The people of Gander were asked to aid and care for these distraught travelers, as well as for thousands more, and their response was truly extraordinary. Oz Fudge, the town constable, searched all over Gander for a flight-crew member so that he could give her a hug as a favor to her sister, a fellow law enforcement officer who managed to reach him by phone. Eithne Smith, an elementary-school teacher, helped the passengers staying at her school put together letters to family members all over the world, which she then faxed. Bonnie Harris, Vi Tucker, and Linda Humby, members of a local animal protection agency, crawled into the jets' cargo holds to feed and care for all of the animals on the flights. Hundreds of people put their names on a list to take passengers into their homes and give them a chance to get cleaned up and relax.The Day the World Came to Town is a positively heartwarming account of the citizens of Gander and its surrounding communities and the unexpected guests who were welcomed with exemplary kindness.",
  "genres": [
    "Nonfiction",
    "History",
    "Book Club",
    "Audiobook",
    "Canada",
    "Historical",
    "Adult"
  ],
  "author": "Jim DeFede",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/12334359-the-day-the-world-came-to-town"
}