{
  "title": "The Paris Diversion",
  "description": "From the New York Times bestselling author of The Expats. Kate Moore is back in a pulse-pounding thriller to discover that a massive terror attack across Paris is not what it seems - and that it involves her familyAmerican expat Kate Moore drops her kids at the international school, makes her shopping rounds, and meets her husband Dexter at their regular cafe a leisurely start to a normal day, St-Germain-des-Pres.Across the Seine, tech CEO Hunter Forsyth stands on his balcony, perplexed that his police escort just departed, and frustrated that his cell service has cut out; Hunter has important calls to make, not all of them technically legal.And on the nearby rue de Rivoli, Mahmoud Khalid climbs out of an electrician's van, and elbows his way into the crowded courtyard of the world's largest museum, in the epicenter of Western civilization. He sets down his metal briefcase, and removes his windbreaker.That's when people start to scream.Everyone has big plans for the day. Dexter is going to make a small fortune, finally digging himself out of a deep financial hole, via an extremely risky investment. Hunter is going to make a huge fortune, with a major corporate acquisition that will send his company's stock soaring. Kate has less ambitious plans: preparations for tonight's dinner party--one of those homemaker obligations she still hasn't embraced, even after a half-decade of this life--and an uneventful workday at the Paris Substation, the clandestine cadre of operatives that she's been running, not entirely successfully, increasingly convinced that every day could be the last of her career. But every day is also a fresh chance to prove her own relevance, never more so than during today's momentous events.And Mahmoud? He is planning to die today. And he won't be the only one.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Suspense",
    "Mystery Thriller",
    "France",
    "Audiobook"
  ],
  "author": "Chris  Pavone",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/41145585-the-paris-diversion"
}