{
  "title": "Joseph Kearney and the Hunt for Rommel: The Life of a Newfoundland Commando",
  "description": "This is the fascinating story of a young Newfoundlander’s journey to hunt the infamous General Erwin Rommel, the “Desert Fox,” at his headquarters in the Libyan Desert in North Africa. Included are excerpts from numerous letters to his parents back home, which give great insight into his life as a soldier and prisoner of war.Joseph Francis Kearney of St. John’s was eighteen when he enlisted in the First Royal Artillery Contingent during World War II and deployed to England. After the arrival of two other contingents, they became the 57th (Newfoundland) Heavy Regiment, Royal Artillery. Kearney then applied and was accepted into the elite 11th (Scottish) Commando, the brainchild of Sir Winston Churchill. The Scottish Commando merged into “C” Battalion Layforce under the command of Lieutenant Colonel Robert Laycock.Kearney first saw action with this unit in June 1941, when he went ashore on the coast of Syria to reclaim a bridge on the Litani River from the Vichy French. Despite the unit’s sustaining heavy losses, Kearney and four other Newfoundlanders played a major role in the success of the mission.After Layforce disbanded, Kearney was the only Newfoundlander who stayed with the 11th (Scottish) Commando. He played a key role with the unit in the secret mission to kill or capture Rommel in November 1941. The raid was unsuccessful, but Kearney and six others escaped. They were eventually picked up by the Italians, allies of the Germans.From 1941 to 1945, Joseph Kearney was in and out of prisoner of war camps in North Africa, Italy, and Austria. After repeated attempts to escape, he finally succeeded. His fortunes improved when he intercepted American troops chasing the retreating German armies.He returned home to a hero’s welcome in Newfoundland.",
  "genres": [],
  "author": "Frank Galgay",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/41152532-joseph-kearney-and-the-hunt-for-rommel"
}