{
  "title": "The Last Time I Saw You",
  "description": "The internationally bestselling author of The Last Mrs. Parrish follows that success with an addictive novel filled with shocking twists about the aftermath of a brutal high-society murder.Dr. Kate English has it all. Not only is she the heiress to a large fortune; she has a gorgeous husband and daughter, a high-flying career, and a beautiful home anyone would envy.But all that changes the night Kate’s mother, Lily, is found dead, brutally murdered in her own home. Heartbroken and distraught, Kate reaches out to her estranged best friend, Blaire Barrington, who rushes to her side for the funeral, where the years of distance between them are forgotten in a moment.That evening, Kate’s grief turns to horror when she receives an anonymous text: You think you’re sad now, just wait. By the time I’m finished with you, you’ll wish you had been buried today. More than ever, Kate needs her old friend’s help.Once Blaire decides to take the investigation into her own hands, it becomes clear that all is not as it seems in Baltimore high society. As infidelity, lies, and betrayals come to light, and tensions rise to a boiling point, she begins to alienate Kate’s friends and relatives with her relentless, accusatory questions, as she tries to find Lily’s killer. The murderer could be anyone—friend, neighbor, loved one. But whoever it is, it’s clear that Kate is next on their list. . .In The Last Time I Saw You, Liv Constantine takes the lightning pace of The Last Mrs. Parrish and raises the stakes, creating an exquisitely tension-filled and absorbing tale of psychological suspense in which innocent lives—and one woman’s sanity—hang in the balance.",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Audiobook",
    "Mystery Thriller",
    "Suspense",
    "Psychological Thriller"
  ],
  "author": "Liv Constantine",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/41154320-the-last-time-i-saw-you"
}