{
  "title": "Nose Down, Eyes Up",
  "description": "At forty-seven, Gil has reached a relatively happy period in his life as the world’s oldest twenty-two-year-old man. In exchange for doing the odd carpentry and construction job, he gets paid to live rent-free in Los Angeles at the glorious summerhouse of rich retirees who are never there. It’s a world of solitary splendor spent mainly in the company of his four dogs, Cheney, Fruity, Dinky, and Jimmy, the alpha and the only one of the four that Gil has raised from a pup.Because Gil is the kind of guy who understands his dogs far better than he understands any of the people in his life–including his girlfriend, Sara, who is an “animal communicator” (albeit one that the dogs make fun of)–he is not particularly surprised when he stumbles upon Jimmy delivering lectures on canine manipulative techniques to the rest of the dogs in the neighborhood. (For example, the always effective “Nose down, eyes up” is a surefire path to permission to sleep on the bed.) Soon Gil begins to see dollar signs in the idea of turning Jimmy and his advice into a “brand” that he can merchandise on the Internet.Their collaboration has barely begun when Jimmy makes a shocking He’s adopted. And not only is Gil not his real father, they’re not even the same species. In the identity crisis that ensues, Gil hears the last thing he wants his favorite dog to that Jimmy wants to be reunited with his birth mother, a bitch owned by the woman who emptied Gil’s bank account, his pension plan, and his plans for the future–Gil’s sexy and still seductive ex-wife, Eden, now remarried, wealthy, and living in Malibu.When the rich retirees who own Gil’s house return for an indefinite period, Gil must decide what to risk a new relationship disaster by trying to live in a tiny house with his good-hearted on-again, off-again girlfriend, Sara, or relive an old relationship disaster by getting reinvolved with his flirtatious ex-wife, with her new husband, Jimmy’s birth mother, and their Malibu guesthouse.In this hilarious new novel, Merrill Markoe offers uncanny insight into the bonds between hounds and humans, as well as their respective ideas of the way that love and family are supposed to work. Nose Down, Eyes Up is a revealing examination of the interspecies power of love, sex, family, and real estate and why everyone–on two legs or four–deserves to have his or her day.",
  "genres": [
    "Fiction",
    "Animals",
    "Dogs",
    "Humor",
    "Adult Fiction",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Merrill Markoe",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/4116612-nose-down-eyes-up"
}