{
  "title": "On Leopard Rock",
  "description": "The first ever memoir from the Number One global bestselling adventure authorWilbur Smith has lived an incredible life of adventure, and now he shares the extraordinary true stories that have inspired his fiction. I've been writing novels for over fifty years. I was lucky enough to miss the big wars and not get shot, but lucky enough to grow up among the heroes who had served in them and learn from their example. I have lucked into things continuously. I have done things which have seemed appalling at the time,disastrous even, but out of them have come another story or a deeper knowledge of human character and the ability to express myself better on paper, write books which people enjoy reading. Along the way, I have lived a life that I could never have imagined. I have been privileged to meet people from all corners of the globe, I have been wherever my heart has desired and in the process my books have taken readers to many, many places. I always say I've started wars, I've burned down cities, and I've killed hundreds of thousands of people - but only in my imagination! From being attacked by lions to close encounters with deadly reef sharks, from getting lost in the African bush without water to crawling the precarious tunnels of gold mines, from marlin fishing with Lee Marvin to near death from crash-landing a Cessna airplane, from brutal schooldays to redemption through writing and falling in love, Wilbur Smith tells us the intimate stories of his life that have been the raw material for his fiction. Always candid, sometimes hilarious, and never less than thrillingly entertaining, On Leopard Rock is testament to a writer whose life is as rich and eventful as his novels are compellingly unputdownable.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Africa",
    "Adventure",
    "Autobiography",
    "Biography Memoir",
    "Memoir"
  ],
  "author": "Wilbur Smith",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/41160896-on-leopard-rock"
}