{
  "title": "The Essential Path: Making the Daring Decision to Be Who You Truly Are",
  "description": "“Deep inside you know Who You Truly Are. We all do. It's not a question of discovering it, it's a question of claiming it. Being it. And that's actually easier done than said. We're all just one decision away from The Essential Path. It's a path that could change a world that deeply yearns for a new direction.” ― Neale Donald Walsch, author, The Essential PathOur modern era is plagued by increasing alienation―we are seeing an “us against them” world. Everywhere we turn, we find ourselves divided from each other as never before across political, economic, social, and spiritual lines. As humanity is being torn apart right before our eyes―separating many of us from our friends and even our loved ones, from our hopes and dreams, from the natural world, and from so much that gives meaning and value to our lives―people are blaming everyone and everything around them for the collective problems that we have created ourselves. We are turning against each other, rather than to each other, just when we need each other the most.Bestselling author of Conversations with God Neale Donald Walsch offers a radical solution to the growing problem of humanity’s alienation. He invites us to question our basic assumptions about ourselves, about each other, about life and how it works, and about God, and to rethink the very definition of humanity. The Essential Path challenges every human to make a Daring Decision―to look at who we are and how we can choose to be, in a planet-altering new way.With insight and spiritual perceptivity, Walsch peers into the heart of a broken, divided society, prompting us to ask the critical questions that have the power to transform our world.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Inspirational"
  ],
  "author": "Neale Donald Walsch",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/41150516-the-essential-path"
}