{
  "title": "Unspoken",
  "description": "Set in a kingdom of warring lands, demon curses, and hidden magic, UNSPOKEN is a fantasy for fans of Maggie Stiefvater's Mercy Falls Series and Sarah J Maas’ Throne of Glass.\"You are unbroken.\"Princess Isabelle of The New Kingdom has lived her entire life in the confines of her palace. She spends her time hunting for the poverty-stricken Voiceless-people of the Old Kingdom who warred with her kingdom and ultimately lost-and dreaming of a world beyond the walls of her home. As the only remaining child of the king and queen, she is to be married off by her eighteenth birthday.\"My father said that magic died long ago. It was evil, cursed, and wicked. My father is a liar.\"When Izzy witnesses the use of forbidden magic in the woods outside the palace, she is attacked, and saved by an unknown man. Soon after she discovers her rescuer is a Voiceless servant in the castle named Fray, she befriends him to seek out the magic users who tried to kill her. Fray agrees to help, but not before Isabelle discovers the servant boy harbors a secret the king has tried to bury-that he is a Gwylis, people of the old Kingdom who made a pact with the demons of the underworld for the power to transform into giant ferocious wolves. But to shift into a beast, Fray must be able to speak the words to do so. If he is to thwart the attackers from killing her entire family, Izzy needs to cure the ailment that took away his voice.\"Sometimes one action-one death-can spur a movement, sway the cosmos, and move the stars.\"But curing Fray holds more danger than she ever thought possible. The lies of her parents and the risk of putting her own life on the line deems as destructive as falling for the servant boy. If Isabelle is to save herself and Fray, she’ll need to face enemy Gwylis, cross paths with usurper kings and princes, and decide what side she is on-human or wolf-or lose her kingdom forever.\"I am fearless.\"",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal",
    "Werewolves",
    "Magic",
    "Fiction"
  ],
  "author": "Celia McMahon",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/41180912-unspoken"
}