{
  "title": "Hero in the Shadows",
  "description": "For years, David Gemmell has been the best kept secret in fantasy fiction on this side of the Atlantic. A perennial London Times bestselling author in his native England, Gemmell combines fast-paced, powerful storytelling with vivid, unforgettable characters; he pits world-weary heroes challenged in profound new ways against bloodthirsty foes as dark as night. Now Gemmell returns to the savage lands of his acclaimed Drenai saga in an action-packed tale of malevolent ancient sorceries reborn--and the brave men and women who dare to stand against them.THE HERO IN THE SHADOWSThe ruined city of Kuan Hador reeks of dark mystery. Shunned by brigands and merchants alike, it is home to fearsome wild things and legends that freeze the blood--tales that speak of a time thousands of years past, when Kuan Hador was the capital of a vast empire ruled by evil sorcerers. These mages were able to meld beasts and men into unholy Joinings--foot soldiers of a ruthless demonic army. When the forces of men finally did prevail, the sorcerers and their half-human slaves escaped through a magical doorway . . . only to find themselves trapped in another world. The doorway sealed behind them, locked with an enchantment too powerful to break. Or so the legends say.But at the heart of every legend lies a glimmer of truth, and truth can kill. Especially when it comes in the form of slavering white beasts who possess an insatiable appetite for death and destruction. Millennia have passed, and the spell of imprisonment has begun to fade. The sorcerers and their foul minions will soon be free to wreak a horrible vengeance against all that lives.This time, no army waits to oppose them--only a rag-tag group of unlikely Kysumu, the rajnee swordsman; Yu Yu Liang, a humble ditch digger with dreams of glory; Taliana, a warrior woman as fierce as she is beautiful. Leading them is the mysterious Gray Man, an enigmatic figure hated and envied for his fabulous wealth. A man with a blood-drenched past, who has killed for principle and for payment. A man of destiny known throughout the lands of the Drenai as Waylander the Slayer.Now, to defeat a timeless evil, an ancient riddle must be solved . . . and Waylander, the prince of assassins, must kill a man who cannot die.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Heroic Fantasy",
    "High Fantasy",
    "Audiobook",
    "Sword and Sorcery"
  ],
  "author": "David Gemmell",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/411776.Hero_in_the_Shadows"
}