{
  "title": "Millenneagram: The Enneagram Guide for Discovering Your Truest, Baddest Self",
  "description": "Buckle up, folks. It’s time to jump in, embrace your inner self, and release the things that are holding you back from wholeness. Enter the Millenneagram.The Enneagram is an ancient personality typing system that has a sneaky way of revealing who we are and why we do the things we do. Using nine types, it gets to the root of our fears and motivations, unveiling our inner-most selves.Millenneagram reinvigorates the Enneagram by putting a modern spin on the classic nine types. Hannah Paasch, creator of the popular #millenneagream threads on Twitter, reveals how this system acts as a map toward our authentic selves. For Hannah, the Enneagram is not about changing who we are, but rather nurturing and loving our whole selves, even the pain in the ass qualities. “Only from this position of wholeness, rootedness in who we are, what we believe, and what kind of story we are writing, will we be able to act bravely for the sake of justice and humanity – to approach our f*cked-up world with the grounded courage it asks of us.”With her trademark irreverent humor and empowering affirmations, Millenneagram reframes the classic Enneagram types with a fresh perspective and new names that cut right to the chase:#1 The Machine “I’m an Enneagram 1 and I Can Fix This!”#2 The Parent “I’m an Enneagram 2 and Can I Get You a Refill?”#3 The Winner “I’m an Enneagram 3 and All I Do Is Win.”#4 The Tortured Artist “I’m an Enneagram 4 and I’m Deeper Than You.”#5 The Detective “I’m an Enneagram 5 and I Read an Article About That.”#6 The Oracle “I’m an Enneagram 6 and I’m Loyal as Fuck.”#7 The Party “I’m an Enneagram 7 so This Might Be Vodka In My Mug.”#8 The Dragon “I’m an Enneagram 8 so Nice Try, Bitch.”#9 The Wallflower “I’m an Enneagram 9 so Let’s Just All Chill Out, Dude.”A powerful tool for self-discovery (that doesn’t take itself too seriously), Millenneagram is an invitation for introspection and growth. Hannah’s revamped Enneagram goes beyond simply identifying with a type: it gives us permission to be our truest, enough-as-is, bad-ass selves.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Audiobook",
    "Spirituality",
    "Adult",
    "Unfinished"
  ],
  "author": "Hannah Paasch",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/41180664-millenneagram"
}