{
  "title": "God, the Evolver: A Secular Approach to the Divine",
  "description": "God The A Secular Approach to the DivineToo Evolved To Believe In God? Discover The Spiritual Successor To “The Origin Of Species”.Religion and science have been fighting an undeclared war for centuries. Ever since we stepped out of the dark ages and modern science started taking its first baby steps, people have been debating the connection between metaphysics and physics. And human evolution is one of the most controversial issues. Until now. This eye- opening book will offer you an in-depth understanding of evolution from a religio-scientific point of view.God The Evolver – Bridging The Gap Between Metaphysics & Science!If you are a serious free thinker without any religious or scientific prejudices, then this book is for you. If you are not afraid to step into spiritual no-man’s land and test your knowledge, then this book will offer you a game-changing perspective. By combining religion, philosophy and science, author Faiz King has created a comprehensive guide to the struggle of religion and science.What Makes The Human Mind So Special? Back To Metaphysics.By the end of this book you will be able to understand the debate and realize that higher-order religious processes (e.g. Metaphysics) are necessary to realize the full extent of the rational and abstract properties of our human mind. And that’s exactly what sets us apart from the rest of the creatures that live on this planet.God’s Plan – How To Understand Centuries Of Evolution.After over 20 years of meticulous research, Faiz King has created the definitive successor to Charles Darwin’s “The Origin Of Species” that is not afraid to take on this science giant and prove that Metaphysics (and subsequently God) is behind the development of modern science as we know it.Are You Ready To Embark On A Unique Spiritual Adventure Through Human Evolution?",
  "genres": [
    "Nonfiction",
    "Religion",
    "Philosophy",
    "Spirituality"
  ],
  "author": "Faiz King",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/41176626-god-the-evolver"
}