{
  "title": "Hollywood Divorces",
  "description": "In her most scandalously titillating novel since the #1 bestselling Hollywood Wives, internationally renowned author Jackie Collins once again takes her readers behind the scenes and into the bedrooms of Hollywood's glamorous world of superstardom, where narcissism is a virtue, and fidelity means not sleeping with anyone less attractive than your spouse. Leaving her readers to guess which real celebrities she has used as models for her fabulous characters, Collins uses her insider's knowledge of the Hollywood scene to bring life to their stories of lust, scandal, and sweet revenge. Principal among the characters that make Hollywood Divorces so compulsively readable are three strong, unforgettable women who find themselves walking the treacherous pathway that inevitably leads to divorce. These are classic Jackie Collins women -- beautiful, sexy, and determined to get things done their way -- succeeding in spite of the odds.Shelby Cheney, 32. The raven-haired beautiful Shelby -- a talented film actress -- is married to Linc Blackwood, a macho movie star with a yen for hard booze, nights out with the guys, and plenty of other women. Shelby continues to put up with his infidelities, because only she knows the tragic secrets of his past.Lola Sanchez, 24. A sexy Latina superstar, Lola climbed to the top the hard way. As an unknown, Lola encountered Linc Blackwood at a party and spent the night with him. Now that she is a superstar, he fails to remember their long and steamy night together, infuriating Lola, who has revenge on her mind. Currently she is married to Matt Seel, a tennis pro who she wed on the recommendation of her advisers in an effort to distance herself from the real love of her life, Tony Alvarez, a brilliant Latino movie director with a drug habit he can't seem to break.Cat Harrison, 19. Blond, independent, a hot writer/director with a wild-child past, she has a hit movie, a rock star husband, and an amorous and powerful studio mogul determined to make her do things his way or not at all. But Cat is not a girl to be pushed around, and Cat has big plans of her own -- plans that will surprise and shock everyone.Divorce -- Hollywood style -- has never been more fascinating, for no one has ever before offered so revealing a look. The result is delicious fun.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Drama",
    "Womens Fiction",
    "Adult"
  ],
  "author": "Jackie Collins",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/411853.Hollywood_Divorces"
}