{
  "title": "Witcher Series 6 Books Set Collection",
  "description": "Alternate cover edition for ISBN 912359795X / 9789123597956For previous cover edition see hereWitcher Series Andrzej Sapkowski Collection 6 Books Bundle includes titles in this collection :- The Tower of the Swallow, Time of Contempt, Blood of Elves, Baptism of Fire, The Last Wish, Sword of Destiny. Description:- The Tower of the Swallow The world has fallen into war. Ciri, the child of prophecy, has vanished. Hunted by friends and foes alike, she has taken on the guise of a petty bandit and lives free for the first time in her life. Time of Contempt Geralt the Witcher has fought monsters and demons across the land, but even he may not be prepared for what is happening to his world. Blood of Elves For more than a hundred years, humans, dwarves, gnomes and elves lived together in relative peace. But times have changed, the uneasy peace is over and now the races once again fight each other - and themselves: dwarves are killing their kinsmen, and elves are murdering humans and elves, at least those elves who are friendly to humans ... Baptism of Fire The Wizards Guild has been shattered by a coup and, in the uproar, Geralt was seriously injured. The Witcher is supposed to be a guardian of the innocent, a protector of those in need, a defender against powerful and dangerous monsters that prey on men in dark times. The Last Wish This book is a sheer delight. It is beautifully written, full of vitality and endlessly inventive: its format, with half a dozen episodes and intervening rest periods for both the hero and the reader, allows for a huge range of characters, scenarios and action. Sword of Destiny Geralt is a witcher, a man whose magic powers, enhanced by long training and a mysterious elixir, have made him a brilliant fighter and a merciless assassin.",
  "genres": [
    "Fantasy",
    "Fiction",
    "High Fantasy",
    "Epic Fantasy",
    "Novels",
    "Adventure",
    "Adult"
  ],
  "author": "Andrzej Sapkowski",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/41187016-witcher-series-6-books-set-collection"
}