{
  "title": "Eric Hobsbawm: A Life in History",
  "description": "Eric Hobsbawm's works have had a nearly incalculable effect across generations of readers and students, influencing more than the practice of history but also the perception of it. Born in Alexandria, Egypt, of second-generation British parents, Hobsbawm was orphaned at age fourteen in 1931. Living with an uncle in Berlin, he experienced the full force of world economic depression, and in the charged reaction to it in Germany was forced to choose between Nazism and Communism, which was no choice at all. Hobsbawm's lifelong allegiance to Communism inspired his pioneering work in social history, particularly the trilogy for which he is most famous-- The Age of Revolution , The Age of Capital , and The Age of Empire --covering what he termed \"the long nineteenth century\" in Europe. Selling in the millions of copies, these held sway among generations of readers, some of whom went on to have prominent careers in politics and business.In this comprehensive biography of Hobsbawm, acclaimed historian Richard Evans (author of The Third Reich Trilogy , among other works) offers both a living portrait and vital insight into one of the most influential intellectual figures of the twentieth century. Using exclusive and unrestricted access to the unpublished material, Evans places Hobsbawm's writings within their historical and political context. Hobsbawm's Marxism made him a controversial figure but also, uniquely and universally, someone who commanded respect even among those who did not share-or who even outright rejected-his political beliefs. Eric Hobsbawm: A Life in History gives us one of the 20th century's most colorful and intellectually compelling figures. It is an intellectual life of the century itself.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Collections",
    "European History",
    "Politics"
  ],
  "author": "Richard J. Evans",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/41180995-eric-hobsbawm"
}