{
  "title": "Before We Lost the Lake: A Natural and Human History of Sumas Valley",
  "description": "For thousands of years, the broad expanse between Sumas and Vedder Mountains east of Vancouver lay under water, forming the bed of Sumas Lake. As recently as a century ago, the lake’s shores stood four miles across and six miles long. During yearly high water, the lake spilled onto the surrounding prairies; during high flood years, it reached from Chilliwack into Washington State. Then, through the 1920s, a network of dykes, canals, dams and pumphouses was erected and the lake drained—“reclaimed” in the words of projects supporters. A new landscape was created, a seemingly ‘natural’ prairie carved up into productive farmland.Today, few people are aware that Sumas Lake ever existed. The only reminder is a plaque erected on the old lakeshore, at a rest-stop along the Trans-Canada Highway just east of Whatcom Road, on the historic trail blazed to BC’s gold fields. Yet for millenniums, Sumas Lake was a dynamic, integral part of the region’s natural and human landscape.In his new book, BEFORE WE LOST THE LAKE, Chad Reimer sets out to truly reclaim Sumas Lake, to restore it to its proper place in the history of the Fraser Valley, BC and the Northwest Coast. Drawing on extensive primary material, Reimer reconstructs the life history of Sumas Lake from the glacial age through the lake’s demise and after. BEFORE WE LOST THE LAKE examines the lake’s natural history and ecology, its occupation and use by the Sema:th and other First Nations, its colonization by White immigrants, the environmental changes brought about by introduced plants and animals, and the campaign to drain it. Drainage proponents had their way and gradually the promised benefits were realized. But these benefits came at a heavy cost to the environment and for the Sema:th, whose traditional way of life was irretrievably lost.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Chad Reimer",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/41188070-before-we-lost-the-lake"
}