{
  "title": "How the Dead Lie",
  "description": "A necromancer in a butcher shop. What could possibly go wrong?Haunted by a horrifying past, Octavia Hollows has lived her life on the move. Like all supernatural beings, when she crosses into Havenwood Falls, she sets off the town’s protective wards. Unlike with most, the officials take immediate action, recognizing her as the powerful necromancer who, as a child, raised the dead in a gruesome public spectacle.Still, they give Octavia a chance. Ninety days probation. No dark magic. Achieve that, and she will be granted residency. They even secure employment for her at Pyntz’s Butcher Shoppe. A necromancer working in a butcher shop. What could possibly go wrong? Just when she settles in and begins opening up to the possibility of a forever home, Octavia discovers a dead body stuffed in the shop’s meat freezer. He’s nude. He looks like a cover model. And now, thanks to Octavia momentarily losing control of her abilities, he’s alive … again. Fearing someone would go so far as to kill to drive her out of Havenwood Falls, Octavia teams up with Willie, the resurrected hottie, to solve the mystery of his murder. They must work fast, though, before more corpses appear. Otherwise, Octavia could find herself booted from town along with an army of raised undead.Welcome to the secluded mountain town of Havenwood Falls, home to sexy men, strong women, and neighbors who bite. Discover supernatural mystery, thrills, and romance in a place where everyone has a deep, dark, and often deadly secret.This is a stand-alone paranormal murder mystery in the world of Havenwood Falls, a collaborative series in the fantasy genre featuring a variety of supernatural creatures. Each author writes a stand-alone story, so they can be read in any order.You might also enjoy these books in the main Havenwood Falls The Winged & the Wicked by T.V. Hahn & Kristie CookTragic Ink by Heather HildenbrandFrom the Embers by Amy MilesThe Lurkers Within by Danielle BannisterThe Awakening by Kristie Cook, R.K. Ryals, Belinda Boring & Nadirah FoxxBooks released on a monthly basis.Look for Havenwood Falls High, a Young Adult series; Legends of Havenwood Falls, a historical fantasy series; and Havenwood Falls Sin & Silk, the darker, sexier side of town.Immerse yourself in the world of Havenwood Falls and stay up to date on news and announcements at www.HavenwoodFalls.com. Join our reader group, Havenwood Falls Book Club, on Facebook at",
  "genres": [],
  "author": "Stacey Rourke",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/41190335-how-the-dead-lie"
}