{
  "title": "Cancer: The Metabolic Disease Unravelled",
  "description": "The official position of the cancer establishment is that cancer is a genetic disease involving genetically-mutated cells which seek to overwhelm and kill the patient. This ideology is routinely taught to doctors, nurses and to the public as if it were fact, yet no scientific evidence has ever suggested it is true. The prevailing cancer mythology that I like to call ‘the terrorist cancer cell’ is how the use of knives, poisons and deadly ionizing radiation are justified as treatments - and if it were ever acknowledged this theory was mistaken, the entire cancer industry would crumble.Featuring over 1900 scientific and clinical references, Cancer: The Metabolic Disease Unravelled is the antidote to a disease that has plagued humanity for centuries. My mother died of cancer when I was 12 years old, and my purpose in life is to ensure that no child has to go through what I did, ever again.Groundbreaking cancer research has shown that cancer cells are not the murderous villains that they were once believed to be. The many breakthrough scientific discoveries presented in this book will reveal exactly what a cancer cell is, what causes tumors to form and how to reverse cancer cells back to normal, healthy cells. The cancer Industry maintains an un-scientific approach to diagnosing and treating cancer. Any research that interferes with its ‘official’ position and the profits that it generates is pushed aside and ignored. It’s time to reveal the truth to the public once and for all so that humanity can end the disease of cancer forever.Prepare to say goodbye to your fear of cancer and say hello to the confidence in knowing:EXACTLY what a tumor isEXACTLY what causes one to form andEXACTLY how to simply and inexpensively heal on your ownThank you again for supporting my work. I hope you find this book valuable and that it helps revolutionize the the world’s understanding of the disease of cancer and ultimately puts an end to what Dr. Siddhartha Mukherjee has called the emperor of all maladies.-Links to the book on Amazon-Kindle Edition: https://amzn.to/2PfW64L",
  "genres": [
    "Health",
    "Nonfiction",
    "Science"
  ],
  "author": "Mark     Sloan",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/41187009-cancer"
}