{
  "title": "Parkland: Birth of a Movement",
  "description": "On the first anniversary of the events at Parkland, the acclaimed, New York Times bestselling author of Columbine offers an intimate, deeply moving account of the extraordinary teenage survivors who became activists and pushed back against the NRA and feckless Congressional leaders--inspiring millions of Americans to join their grassroots #neveragain movement.Nineteen years ago, Dave Cullen was among the first to arrive at Columbine High, even before most of the SWAT teams went in. While writing his acclaimed account of the tragedy, he suffered two bouts of secondary PTSD. He covered all the later tragedies from a distance, working with a cadre of experts cultivated from academia and the FBI, but swore he would never return to the scene of a ghastly crime.But in March 2018, Cullen went to Marjory Stoneman Douglas High School because something radically different was happening. In nearly twenty years witnessing the mass shootings epidemic escalate, he was stunned and awed by the courage, anger, and conviction of the high school's students. Refusing to allow adults and the media to shape their story, these remarkable adolescents took control, using their grief as a catalyst for change, transforming tragedy into a movement of astonishing hope that has galvanized a nation.Cullen unfolds the story of Parkland through the voices of key participants whose diverse personalities and outlooks comprise every facet of the movement. Instead of taking us into the minds of the killer, he takes us into the hearts of the Douglas students as they cope with the common concerns of high school students everywhere--awaiting college acceptance letters, studying for mid-term exams, competing against their athletic rivals, putting together the yearbook, staging the musical Spring Awakening, enjoying prom and graduation--while moving forward from a horrific event that has altered them forever.Deeply researched and beautifully told, Parkland is an in-depth examination of this pivotal moment in American culture--and an up-close portrait that reveals what these extraordinary young people are like as kids. As it celebrates the passion of these astonishing students who are making history, this spellbinding book is an inspiring call to action for lasting change.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Politics",
    "History",
    "Audiobook",
    "Crime",
    "Social Justice"
  ],
  "author": "Dave Cullen",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/41197720-parkland"
}