{
  "title": "What Goes Down: The End of an Eating Disorder",
  "description": "A shockingly honest, humorous, and powerful story of a woman’s twenty-year struggle with anorexia, binge-eating, and bulimia that offers a comedic “been there” voice to help others recover.“I’m starving! Let’s pop in here and get a burger,” your friend says to you, which immediately makes her no longer your friend, because, unbeknownst to her, you have an eating disorder. You can’t just eat. A burger. What goes down, in a disorderly mind?A burger, are you insane?Do you know how many grams of fat are in there?How many grams of fat are in there?And it comes on a bun. Bread?! Please!Why don’t they make those lettuce-wrapped knockoffs anymore?Does the bathroom there lock? Crap, no!Maybe just a few fries. Mostly with ketchup.Ketchup’s a vegetable, right?Why’s this gotta be so hard?!It doesn’t. But if you want to beat it, it can be just a little absurdly funny. Humor is seductive that way. While a sad, skinny you—clutching a bowl of tears, blood, and vomit—is in no way funny (or seductive for that matter) my guess is if you’ve heard this mental soundtrack before it’s because you, too, have an eating disorder that either has or will soon become full-blown bulimia. I’ll bet you’re also a high-performing, Type A person who hides stress well and has a lot of responsibility—corporate, domestic, dangerous, lucrative, or otherwise. Part of the reason you got to that point is because you’re incredibly hard on yourself. It’s also the reason you’re a little too good at being bulimic.But, is it doing anything good for you? Are you impressing anyone with your iron will and disgusting, unproductive routine? No. It’s like volunteering to be Sisyphus but without arms. “I’ll push the rock with my face and teeth, thank you.” Because that’s what you’re doing.I hope something shifted in your brain just then and you finally saw (as I did, after twenty long years) that starving, stuffing, and punishing your body in an effort try to look and feel good is just a joke. My goal is to expose the disease—its roots and progression, its pervasiveness, and its preposterous yet exceptionally-stubborn justifications—and give you the long-overdue perspective you need to overcome it, too.So, let’s dig in. I need a big Tupperware tub and a spoon. You?What … too soon?ABOUT THE Callie is bold. She is also healed and inspired to help others kick the shit out of this disease, just as she did. She is you and she is also me. Callie is the name I published under as she was brave and bold enough to tell this story, to put it out there to reach and impact others. While I was not ready to become—to the rest of my professional and public world—the new face of bulimia, Callie was. And I will be forever grateful. She truly feels like a person of my past. Someone I abused and tormented for years, but she, being me, is also strong and resilient and has forgiven me.I hope her story will empower you. If so, please share it. And please let Callie know.callie.bowld@gmail.com",
  "genres": [
    "Nonfiction"
  ],
  "author": "Callie Bowld",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/41209241-what-goes-down"
}