{
  "title": "The Little Sisters of Eluria",
  "description": "Enter once more the world of Roland Deschain—and the world of the Dark Tower...presented in a stunning graphic novel form that will unlock the doorways to terrifying secrets and bold storytelling as part of the dark fantasy masterwork and magnum opus from #1 New York Times bestselling author Stephen King.“The man in black fled across the desert, and the gunslinger followed.” With these unforgettable words, millions of readers were introduced to Stephen King’s iconic character Roland Deschain of Gilead. Roland is the last of his kind, a “gunslinger” charged with protecting whatever goodness and light remains in his world—a world that “moved on,” as they say. In this desolate reality—a dangerous land filled with ancient technology and deadly magic, and yet one that mirrors our own in frightening ways—Roland is on a spellbinding and soul-shattering quest to locate and somehow save the mystical nexus of all worlds, all universes: the Dark Tower. Now, in the graphic novel series adaptation Stephen King's The Dark Tower: The Gunslinger, originally published by Marvel Comics in single-issue form and creatively overseen by Stephen King himself, the full story of Roland's troubled past and ongoing saga is revealed. Sumptuously drawn by Richard Isanove, Sean Phillips, Luke Ross, and Michael Lark, plotted by longtime Stephen King expert Robin Furth, and scripted by New York Times bestselling author Peter David, The Gunslinger adaptation is an extraordinary and terrifying journey—ultimately serving as the perfect introduction for new readers to Stephen King’s modern literary classic The Dark Tower, while giving longtime fans thrilling adventures transformed from his blockbuster novels.Now near death following a vicious attack by the Slow Mutants, Roland Deschain is taken in by a group of nuns who specialize in anything but the healing arts. These hideous, corpse-like creatures—the Little Sisters of Eluria—have murder on their twisted minds. And in his current condition, there’s almost nothing that the last gunslinger can do to prevent their tender mercies from taking hold….",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Fantasy",
    "Horror",
    "Westerns",
    "Fiction",
    "Science Fiction"
  ],
  "author": "Robin Furth",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/41223940-the-little-sisters-of-eluria"
}