{
  "title": "The Man They Wanted Me to Be: Toxic Masculinity and a Crisis of Our Own Making",
  "description": "Based on the provocative and popular  New York Times  op-ed, this memoir alternates between the examination of a working-class upbringing and a cultural analysis of the historical, psychological, and sociological sources that make up the roots of toxic masculinity and its impact on society. As progressivism changes American society, and globalism shifts labor away from traditional manufacturing, the roles that have been prescribed to men since the Industrial Revolution have been rendered obsolete. Donald Trump's campaign successfully leveraged male resentment and entitlement, and now, with Trump as president and the rise of the #MeToo movement, it’s clear that our current definitions of masculinity are outdated and even dangerous. Deeply personal and thoroughly researched, the author of  The People Are Going to Rise Like the Waters Upon Your Shore  has turned his keen eye to our current crisis of masculinity using his upbringing in rural Indiana to examine the personal and societal dangers of the patriarchy. The Man They Wanted Me to Be  examines how we teach boys what’s expected of men in America, and the long-term effects of that socialization―which include depression, shorter lives, misogyny, and suicide. Sexton turns his keen eye to the establishment of the racist patriarchal structure which has favored white men, and investigates the personal and societal dangers of such outdated definitions of manhood. \"By carefully and soberly examining his own story, Sexton deconstructs American life and gives many examples of how pervasive toxic masculinity is in our culture.\" ―Henry Rollins,  Los Angeles Times \"This book is critically important to our historical moment . . . Crackles with intensity and absolutely refuses to allow the reader to look away for even a moment from the blight that toxic masculinity in America has wrought.\" ―Nicholas Cannariato, NPR",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Memoir",
    "Gender",
    "Psychology",
    "Biography",
    "Sociology"
  ],
  "author": "Jared Yates Sexton",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/41213801-the-man-they-wanted-me-to-be"
}