{
  "title": "A Berry Home Catastrophe",
  "description": "Welcome to The Berry Home: where the food is to-die-for!\nLife is sweet for Kylie Berry: rebranding Sarah’s Eatery into her very own The Berry Home, tackling new recipes one step at a time, juggling two gorgeous suitors, and surviving near-death experiences by the skin of her teeth!   \"Winters will have you giggling into your book!\"  When another murder mystery lands smack dab on Kylie’s doorstep—in the most literal way—she swears off her sleuthing in favor of safer pursuits. But then her gorgeous suitor Brad comes calling with a highly unusual request: “I need you to investigate Hank’s murder.”  Brad’s sister, Samantha, is the prime suspect for the murder of her longtime boyfriend Hank Harrison. Out to prove her innocence at all costs, Brad entreats Kylie and her best friend Zoey to do the legwork that the Camden Falls police won’t…  But who wanted to see Hunky Hank dead? A fitness nut and purveyor of fine exercise equipment, Hank was well-liked within the tiny community—at first glance, anyway.  But what about the jealous glares from men envious of his physique? The heated glances from young women he trained with at the gym? Did his business partner stand to make a fortune from Hank’s death? And did Samantha actually have something to gain from her boyfriend’s demise…?  With tech genius Zoey and police offer Brad by her side, Kylie dives headfirst into the mystery of who killed Hank Harrison—and fingers crossed, she’ll make it back to the café before the dinner rush!   Praise for A.R. Winters:  \"The perfect balance of being lighthearted, but still a serious page-turning mystery.\" - Jaycie D, Amazon.com   \"A fun cozy mystery with engaging and entertaining characters\" - lq, Amazon.com  \"For fans of Janet Evanovich, Rhys Bowen and Jana DeLeon, this is a funny, clean mystery.\" - Clara B, Amazon.com  A Berry Home Catastrophe is the fifth book in the Kylie Berry Mystery Series. Though it can be read as a standalone, it's best read in series order.  This is a humorous cozy mystery featuring a strong female protagonist, some unusual friends and family, and a mystery that needs solving! It has no graphic gore, bad language or sex. Genre: humorous culinary cozy mysteries, cat cozy mystery series, women amateur sleuths",
  "genres": [
    "Cozy Mystery"
  ],
  "author": "A.R. Winters",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/41223240-a-berry-home-catastrophe"
}