{
  "title": "El nervio principal",
  "description": "Un hombre de treinta y tres años lleva un largo tiempo postrado en cama, sin salir de su departamento. Desde allí intenta recomponer su vida al escribirla, atando los recuerdos en torno al nudo que marcaría para siempre su existencia: la partida de su madre, en el verano de 1994, cuando él era apenas un niño, para unirse al levantamiento zapatista que convulsionara al país. La entonces misteriosa huida se ve agravada por el hermetismo de un padre torpe, que no sabe cómo lidiar con la responsabilidad de quedarse a cargo del protagonista y su hermana adolescente, y por las erráticas pesquisas que el niño emprende para desvelar los motivos de la madre.\tEl abandono lo sume en un angustiante mundo paralelo: buscará, sin mucho éxito, refugiarse en la realización compulsiva de figuras de origami, o en una Cápsula de luminosidad cero en la que se encierra durante largos ratos con la intención de borrar su existencia. Finalmente, con la ayuda del Rata —delincuente juvenil en ciernes—, emprenderá un viaje iniciático más allá de los confines de la colonia Educación para conocer el rostro de la crueldad gratuita, aunque también la desinteresada amabilidad de los extraños.\tCon El nervio principal, su segunda novela, Daniel Saldaña París ha recreado con escalofriante exactitud la fantasmagoría de una infancia hipersensible, marcada por un evento que habrá de repetirse, distorsionado, en las volubles capas de la memoria del protagonista. Para ello se ha valido de una prosa elegante, que construye con delicadeza la mirada compasiva que el narrador le dirige a ese niño con el que ya no guarda ningún vínculo, más allá de una inquietante pulsión de simetría y el temor a descubrir la verdad de su pasado.",
  "genres": [
    "Fiction",
    "Literature",
    "Novels",
    "Contemporary",
    "Latin American",
    "Book Club",
    "Spanish Literature"
  ],
  "author": "Daniel Saldaña París",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/41290764-el-nervio-principal"
}