{
  "title": "The Clash of Civilizations and the Remaking of World Order",
  "description": "\"Sam Huntington, one of the West's most eminent political scientists, presents a challenging framework for understanding the realities of global politics in the next century. The Clash of Civilizations and the Remaking of World Order is one of the most important books to have emerged since the end of the Cold War.\" --HENRY A. KISSINGERBased on the author's seminal article in Foreign Affairs, Samuel P. Huntington's The Clash of Civilizations and the Remaking of World Order is a provocative and prescient analysis of the state of world politics after the fall of communism. In this incisive work, the renowned political scientist explains how \"civilizations\" have replaced nations and ideologies as the driving force in global politics today and offers a brilliant analysis of the current climate and future possibilities of our world's volatile political culture.\"An intellectual tour de force: bold, imaginative, and provocative. A seminal work that will revolutionize our understanding of international affairs.\" --ZBIGNIEW BRZEZINSKI\"The book is studded with insights, flashes of rare brilliance, great learning, and in particular, an ability to see the familiar in a new and provocative way.\" --MICHAEL ELLIOTT, THE WASHINGTON POST BOOK WORLD\"A benchmark for informed speculation on those always fascinating questions: Just where are we in history? What hidden hand is controlling our destiny?...A searching reflection on our global state.\" --RICHARD BERNSTEIN, THE NEW YORK TIMES\"This is what is so stunning about The Clash of Civilizations: It is not just about the future, but may actually help to shape it.\" --WANG GUNGWU, THE NATIONAL INTEREST",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "International Relations",
    "Political Science",
    "Philosophy",
    "Sociology"
  ],
  "author": "Samuel P. Huntington",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/413179.The_Clash_of_Civilizations_and_the_Remaking_of_World_Order"
}