{
  "title": "The Eggnog Chronicles",
  "description": "THEY VE MADE THEIR LISTS... As the celeb obituary writer for the New York Herald, Jane Conner can sum up a person's life in three hundred words. She could sum up her love life in even less: Great sex=great time. Commitment=annoyance overload. Maybe it has something to do with being \"overly critical,\" as her boss, the short-sighted idiot, put it. Being \"discerning\" has at least kept Jane from making the same relationship mistakes as her sister Ricki and best friend Emma. Hasn't it? Now, with the holidays bearing down like a freight train from You Screwed Up-ville, Jane's about to get a second chance she never expected......CHECKED 'EM TWICE... Ricki Conner has run her life on signs from the universe, and right now, she's looking for guidance about her boyfriend, Nate, a.k.a Mr. Mixed Signals. He keeps reassuring her that his divorce will be final by Christmas. So why is there still no ring on Ricki's finger? ...BUT WHO SAYS \"NAUGHTY\" CAN'T BE NICE? When the pregnancy test turns pink, it's a good sign...unless you've had wild ex-sex with your former boyfriend while the current one was out of town. This is not exactly the holiday gift Emma Dee had hoped for. It's bad enough that her career track at the bank has been derailed. Now, she gets to spend the season ladling eggnog to her friends and saying, oh by the way, I'm pregnant with another man's baby -- drink up, everybody! Oh well, at least things can't get any worse...right?Christmas. It's a time for going into debt, neuroses-gone-wild, dates from hell, seriously spiked eggnog, and maybe even a miracle or two. And for three women on the verge of what seems like certain holiday disaster, it just may be the season to toast the best times of their lives...",
  "genres": [
    "Romance",
    "Christmas",
    "Chick Lit",
    "Fiction",
    "Holiday"
  ],
  "author": "Carly Alexander",
  "average_rating": "3.03",
  "url": "https://www.goodreads.com/book/show/412955.The_Eggnog_Chronicles"
}