{
  "title": "If I Am Missing or Dead: A Sister's Story of Love, Murder, and Liberation",
  "description": "In April 2002, Janine Latus's youngest sister, Amy, wrote a note and taped it to the inside of her desk drawer. Today Ron Ball and I are romantically involved, it read, but I fear I have placed myself at risk in a variety of ways. Based on his criminal past, writing this out just seems like the smart thing to do. If I am missing or dead this obviously has not protected me... That same spring Janine Latus was struggling to leave her marriage -- a marriage to a handsome and successful man. A marriage others emulated. A marriage in which she felt she could do nothing right and everything wrong. A marriage in which she felt afraid, controlled, inadequate, and trapped. Ten weeks later, Janine Latus had left her marriage. She was on a business trip to the East Coast, savoring her freedom, attending a work conference, when she received a call from her sister Jane asking if she'd heard from Amy. Immediately, Janine's blood ran cold. Amy was missing. Helicopters went up and search dogs went out. Coworkers and neighbors and family members plastered missing posters with Amy's picture across the county. It took more than two weeks to find Amy's body, wrapped in a tarpaulin and buried at a building site. It took nearly two years before her killer, her former boyfriend Ron Ball, was sentenced for her murder. Amy died in silent fear and pain. Haunted by this, Janine Latus turned her journalistic eye inward. How, she wondered, did two seemingly well-adjusted, successful women end up in strings of physically or emotionally abusive relationships with men? If I Am Missing or Dead is a heart-wrenching journey of discovery as Janine Latus traces the roots of her own -- and her sister's -- victimization with unflinching candor. This beautifully written memoir will move readers from the first to the last page. At once a confession, a call to break the cycle of abuse, and a deeply felt love letter to her baby sister, Amy Lynne Latus, If I Am Missing or Dead is an unforgettable read.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "True Crime",
    "Biography",
    "Crime",
    "Book Club",
    "Biography Memoir"
  ],
  "author": "Janine Latus",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/413965.If_I_Am_Missing_or_Dead"
}