{
  "title": "The Mexico Diaries: A Sustainable Adventure",
  "description": "Essential reading for anyone interested in Mexico or hankering for an outrageous, real-life adventure!In 2005 Dan Gair and his wife Holly Hunter went to Mexico in search of a bungalow near the beach to escape New England winters. After a chance encounter with someone desperate to sell a one hundred acre tract of land, Dan & Holly signed on to what would become a life-altering adventure. Now, more than a dozen years later comes 'The Mexico Diaries', a lively romp through the Mexican underbrush. In this humorous, fast-paced memoir, the reader meets eccentric travelers, corrupt cops, dangerous animals, narco henchmen, colorful locals, and even a dash of Voodoo, all while experiencing sustainability boot camp, and the joys and sorrows of ranch life in Mexico. Considering Traveling, Homesteading, or Retiring in Mexico?Through a wealth of entertaining anecdotes, The Mexico Diaries explores life at the intersection of Americano and Mexican culture. The book will provide valuable insight for those considering Mexico as a destination, and will also serve as both encouragement to go, and cautionary tale. Finally, The Mexico Diaries is the perfect primer for anyone interested in pursuing an alternative, sustainable lifestyle on foreign soil. Advance Praise For The Mexico Diaries'“As lively and engaging an account of resettling in Mexico as you’ll encounter, replete with goat wrangling, narcos, scorpions, and a rollicking cast of characters. As Dan and Holly, fleeing their stress-filled US lives, struggle to set up an eco-friendly community along Mexico’s west coast, fiascos and triumphs mark their journey.” - Tony Cohan, author of the best-selling memoir, On Mexican Time. \"A whirlwind Mexican journey to sustainability and beyond\" - SurvivingMexico.com / Book Reviews Dan Gair’s writing style in his book, “The Mexico Diaries,” brought me right into his and Holly’s very personal version of their own “Robinson Crusoe” life. I was pulled quickly into his narrative, reading deep into the night, not wanting to put the book down. I thoroughly enjoyed his adventures, his sense of humor, and his outlook, particularly with the many challenges. A well written and most enjoyable narrative. - Vidda Chan, retired editor and ex-pat.“This is a wonderful memoir for a number of reasons, not the least of which is it presents the tale of an ex-pat couple who relocate to another country for the purpose of becoming acculturated as well as contributing to the health of the planet and its beings. Impressive and inspiring. Gair is a compassionate, observant, humorous, and insightful narrator, and his writing is vivid and moving. You’re gonna love this book!” - Lynn Gray, author of the memoir Longing for the Wild and nine novels. By Purchasing or Gifting a Copy of The Mexico Diaries You Are Also Helping the Environment!(The author will donate 50% of all profit to The Environmental Defense Fund! Buy now and support your biosphere!)",
  "genres": [],
  "author": "Daniel Theodore Gair",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/41396722-the-mexico-diaries"
}