{
  "title": "National Park Architecture Sourcebook",
  "description": "For more than a century, the National Park Service, private individuals, and small businesses have constructed a variety ofstructures on America's national parklands. Some were guided by the architectural style of the day, while others looked to the surrounding landscape for inspiration. In The National Park Architecture Sourcebook , architect and longtime preservation advocate Harvey H. Kaiser takes readers on an architectural tour of the remarkable variety of man-made structures that dot the landscapes of these spectacular mountains, valleys, deserts, and coastlines. Organized by region, The National Park Architecture Sourcebook is unique and comprehensive guidebook to America's most significant historic park-based architectural treasures. Kaiser leads readers beyond the rustic lodges ofYellowstone and Yosemite found in typical guide books to those special places where history, form, and natural beautyhave combined to create moments of architectural magic or enduring symbols of patriotism and heroic action such as theStatue of Liberty, Mount Rushmore, the Lincoln Memorial, Fort Sumter, and the USS Arizona. Blending facts, anecdotes,and personal observations based on many thousands of miles of travel, Kaiser evokes the spirit of these places while offering a solid understanding of why national park architecture occupies a significant and unique place in American history. In one accessible, engaging, and easy-to-use volume, readers can find historical context, directions, factual information, and succinct architectural descriptions for more than two hundred places of interest across the U.S. Designed in a convenient paperback format, this guidebook is an invaluable resource for the traveler, design professional, student, or anyone interested in learning more about the historic architectural treasures of our national park system.",
  "genres": [],
  "author": "Harvey H. Kaiser",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/4137307-national-park-architecture-sourcebook"
}