{
  "title": "When You Look at Me",
  "description": "An unexpected mother-to-be A romance-leery composer And a forgotten melody from the past that holds the keys to their futures When Julia Jenkins' great aunt dies and leaves her a Victorian mansion with decades of secrets, Julia never expects to unearth a World War 2 espionage mystery. Struggling with her own past since an assault left her pregnant, her future as a solo parent leaves her dreams uncertain. The inheritance from her great aunt gives Julia the ability to take a step back into her future, but also sends her into the discovery of a love story she’d never anticipated. As she goes through her aunt's treasured possessions, Julia uncovers some oddly written piano music with a musical code she can’t decipher on her own. Not to worry, introverted Englishman and composer, Henry Wright, is thrust on the scene by a pair of homespun matchmakers who know the ‘right’ man for Julia’s wounded heart. Henry arrives in Pleasant Gap with the task of composing the soundtrack for his best mate’s newest film. The Jenkins’ family’s southern welcome and gregarious personalities set his reticent nature on edge, but he’s inexplicably drawn to his gentle and music-loving hostess, Julia. Uncertain how to build a friendship with the wounded woman, and rather hopeless in communicating well through words, the bond of music becomes a bridge between her uncertainty and his awkwardness. But her broken past and his families’ expectations build a wall much greater than the cultures that separate them. As they work together to solve a musical mystery from the grave, will an unlikely romance from the past inspire their hearts to trust in a God who’s written the perfect melody for their lives?",
  "genres": [
    "Contemporary",
    "Romance",
    "Christian Fiction",
    "Contemporary Romance",
    "Fiction",
    "Christian",
    "Clean Romance"
  ],
  "author": "Pepper Basham",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/41394085-when-you-look-at-me"
}