{
  "title": "The Real Lives of Strong Black Women: Transcending Myths, Reclaiming Joy",
  "description": "In this warm, sensitive and straightforward self-help guide for African American women, Toby Thompkins explores the triumphs, struggles and lessons necessary to transcend the stereotypes and overcome the consequences of being a \"strong black woman.\" Culled from interviews with both black women and black men from all walks of life, the personal stories Thompkins uses to illustrate his ideas and communicate his healing message illustrate the costs involved in measuring up to this archetypal image, one of the most powerful and enduring in American society. In reality, as Thompkins demonstrates, despite the almost universal respect and deference afforded the strong black women ideal, it can be more limiting than it is empowering. Too often, women of color feel compelled to become \"chronic caregivers,\" sacrificing their ability to become truly free and fulfilled individuals-at great emotional and physical cost. Through the wisdom culled from the stories of these different women's experiences and his own compassionate, insightful analysis, Thompkins makes the case for the need to supplant the myth of the strong black woman, particularly so that women can better understand and respond to their urgent need to care for themselves. He offers effective strategies by which women of any color can reclaim themselves and create lives characterized by new dimensions of fulfillment, love and joy. Toby Thompkins has spent 20 years working for and consulting with Fortune 100 companies on leadership, leveraging human capital and managing success. In addition, he works as a life coach and professional speaker on the topics of personal growth, relationships, and cultural and social healing. He was formerly a columnist for the self-help magazine Miracle Journeys and has conducted self-help workshops in several major cities with The Whole Life Expo. He lives in New York City.",
  "genres": [],
  "author": "Toby Thompkins",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/1233860.The_Real_Lives_of_Strong_Black_Women"
}