{
  "title": "The Russian Girl",
  "description": "“Elegant prose at the hand of an experienced story-teller.” —Rhys Bowen, New York Times best-selling author of the Royal Spyness and Molly Murphy Mysteries as well as the #1 Kindle bestsellers \"In Farleigh Field\" and \"The Tuscan Child.\"  THE RUSSIAN GIRL is based on the true story of a woman who escapes from a high security nursing home during the hottest day of the year. The thermometer reads 115⸰ and she is dehydrated, lost, slogging through the burning sands of a New Mexico desert, constantly craving an ice cold Coke.  Her delirium reveals a harrowing story of a young immigrant Russian girl forced to come to America in the early 1900s. Her turbulent life is filled with upheaval, lost love, and activism in a crushing, brutal 20th century journey.   Minna Goldmich’s mind wanders, remembering her childhood as a peasant girl in Russia—the youngest in a line of Jewish healers. Her family only survived being butchered by marauding Cossacks because of her and her mother’s unique ability to heal cows.  The twelve-year-old Russian girl’s life is forever changed when she is almost raped. While defending herself, she accidentally kills her Jew-hating attacker and is forced to flee from the only life she’s ever known.  Alone and traumatized, her mother sends her to America to live. There, she not only joins the great melting pot of people from all over the world, she meets the love of her life and becomes a visiting nurse on the streets of Harlem. But her chaotic life is always overtaken by violent historical events that continue to reshape not only her life, but the world around her.  REVIEWS  “Intense, harrowing and oh so real, Bette Lamb's family history is brought vividly to life in elegant prose at the hand of an experienced story-teller.” —Rhys Bowen, New York Times best-selling author of the Royal Spyness and Molly Murphy Mysteries as well as the #1 Kindle bestsellers \"In Farleigh Field\" and \"The Tuscan Child.\"  “A sweeping, soaring saga of history, family, the magic of healing, and the mysteries of love, all wrapped up in a page-turning thriller ranging from the Russian Revolution to the 1980s. Fair warning: you won't be able to stop reading 'The Russian Girl'!” —Kelli Stanley, author of \"City Of Sharks\"  \"The history of a turbulent century across two continents is set inside an exquisite depiction of the end of one small life. And the brutal, sometimes harrowing, realities of that life are touched by magic in a way that feels utterly believable and satisfying. The Russian Girl combines a sharp eye, a big heart, and an irresistible page-turner of a story. Thoroughly recommended.\" —Catriona McPherson, bestselling and multi-award-winning author of the Dandy Gilver series and \"Go To My Grave\"  \"A beautiful, very thoughtful piece of writing, from the heart.\" —Rita Lakin, author of \"The Only Woman In The Room\"  FROM THE AUTHOR:  I am an RN, and yes, an ex-Bronxite. So listening to me talk (hands flying) can be a funny experience. I love to write crime novels and multi-task because I'm also an artist that plays with clay in my studio in my little home in the West (Marin County, CA.).",
  "genres": [],
  "author": "Bette Golden Lamb",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/41349282-the-russian-girl"
}