{
  "title": "The Witchery",
  "description": "New York Times bestselling author James Reese has been praised for his lush and evocative prose, his bold exploration of illicit sexuality, his deft handling of historical settings, and his extraordinary rendering of the supernatural. His novels are sumptuous trips back in time to an era filled with unforgettable characters, human strife, and emotions that transcend time. Now, in his most imaginative book to date, Reese takes the witch Herculine on a voyage that will test her in every way, elevating her from the depths of despair to triumph.In the middle decades of the nineteenth century, Herculine is summoned from self-imposed exile by her teacher, the witch Sebastiana d'Azur, and told to sail from the Florida territory to Havana. There she is to search out one Queverdo Brù—a cruel and demonic man whose house holds terrible secrets—to learn of a certain \"surprise.\" But lies and truths conspire to separate Herculine from those she loves, and she finds herself alone with Brù, who sees in her something he has long sought, and now seeks to use, harshly, as he practices that most ancient of arts: alchemy.Escaping Brù, Herculine sails from Havana, knowing Sebastiana is near. In the Florida Keys, she reunites with her and meets her \"surprise\"—the shocking product of a forbidden encounter ten years prior. Surviving an Indian attack on a sparsely settled key, Herculine and family decamp to Key West. There they set out to make their fortune—by means magical or otherwise—as Herculine is tested at every turn by the harsh landscape and haunted by thoughts of her own demise.With The Witchery, James Reese brings to a close a remarkable trilogy—a story told by a character who \"invades our consciousness\" (Tampa Tribune) and set in \"the heady atmosphere of a bygone era brought deftly to life\" (Eric Van Lustbader). Spanning decades ravaged by war, disease, and ideals that tore a nation apart, Herculine's ultimately triumphant struggle is both a universal one—marked by love, loss, fear, and regret—and yet quite particular, as told by one of the most inventive novelists working today.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Witches",
    "Supernatural",
    "Fiction",
    "Historical Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "James Reese",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/414327.The_Witchery"
}