{
  "title": "TWEETS FROM THE TRENCHES: Little True Stories of Life and Death On The Western Front",
  "description": "Follow Carmichael's odyssey deep into the dugouts of World War I military history ... 'A post-modern collage of poetry, tweets, historical documents, and photographs ... Carmichael explores the horror and the heartbreak of World War I in a creative and deeply personal way, exploring the stories of the heroes--both sung and unsung--the soldiers, the nurses, and the families who bore the weight of the traumatized vets' behaviours when they came home. like all good art, this book is potently human and uplifting.\" - Derek Hanebury, author/'Nocturnal Tonglen' 'A genre-bending look at one of the most significant periods of world history ... It's an innovative mind that can re-think such possibilities for history, and Carmichael's is a project brimming with vibrancy.' - Wayde Compton, The Writers Studio, Simon Fraser University/Author, 'The Outer Harbour' 'This is a kind of poetry paired with journalism. history with metaphor. technology set in a real world we barely can imagine now. thankfully, Carmichael can and we follow her, with curiosity and awe, into that bloody past, learn of women who hid their identities so they could fight, men who hid their fighting so they could continue to live.' - Yvonne Blomer, City of Victoria poet laureate/author/'Sugar Ride' 'A brilliant and beautiful gift ... the compelling journey is both educational and riveting.' - Gary Poignant/The Nelson Star 'Carmichael's creative fieldwork combined with personal letters forges a profound archival work that will resonate with all Canadians.' - Susan Stenson/author of 'Nobody Move' 'Wildly creative ... respected journalist Jacqueline Carmichael brings the reality of world war to a generation raised on reality tv and social media. gorgeously designed, engaging, and dynamic, tweets from the trenches makes real the sacrifices of young people in WWI.' - Theresa Tag Goulet, founder/FabJob Publishing 'A brilliant body of work, poetic and beautiful amidst ruin.' - Emily Olsen, founder/The Connection Project 'An astonishing book ... through vivid imagery, first-hand accounts and photographs, Jacqueline Carmichael tells of the hard flint of death, and gives the reader a keener appreciation for the simple echo of mortal moments.' - Jude Neale, author/'Splendid in Its Silence' 'In Tweets from the Trenches, author Jacqueline Carmichael presents a marvellously inventive look at the First World War experiences of her grandfather ... A remarkable voice from 100 years ago speaking to us today with exceptional power and emotion. \"I look like a loose button on an overcoat,\" says Black Jack after four years of war. \"Most of the boys I came with are gone.\" His words are at times mingled with those of the author who displays her own poetic talents as she explores the impact of the war on Black Jack and his family. ' - Graham Thomson, Columnist/Edmonton Journal",
  "genres": [],
  "author": "Jacqueline Carmichael",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/41399913-tweets-from-the-trenches"
}