{
  "title": "A Knight's Exile",
  "description": "A knight exiled to a frozen wasteland, and the one man who can save him from himself...  Andrion Denlas was a knight until he rebelled against the usurper king who poisoned the prince and seized the throne. The sentence for Andrion's rebellion is exile. He's banished through a portal to the frozen wasteland of the Steppe, a land where only the hardiest creatures have any hope of survival. Alone and freezing to death in a blizzard, Andrion is saved by a huge ice bear, a bear that turns out to be a skinshifter named Tauras. The strange man is amazingly strong but surprisingly kind...and handsome as well. Fighting his attraction to Tauras grows increasingly difficult as the man heals him, shelters him, and teaches him how to survive in the wastes. But how can he risk losing his heart when he's vowed to return to his homeland and kill the usurper king...or die trying? Because the more Andrion comes to know him, the more he yearns to stay in the ice and snow with Taurus to keep him warm...  Tauras Zarna has lived alone in the icy wastes for nearly all his life, choosing the path of the moon goddess who has given him the ability to skinshift—to change his form into that of any animal, large or small. But when he saves the life of a stranger from a far off land, he finds himself fascinated with the fierce, driven knight. The man has lost touch with his heart and with his desires, but Tauras intends to bring balance and pleasure to his life once more. Yet Andrion is determined to cross the icy plains, kill the false king, and avenge the prince. Nothing, not even love, seems enough to stop him. But Tauras refuses to give up hope. After all, there is magic in the world, and sometimes a kiss can change everything forever...  Reader note: contains m/m fantasy romance themes including male male love",
  "genres": [
    "M M Romance",
    "Romance",
    "Historical",
    "Fantasy",
    "Shapeshifters"
  ],
  "author": "Xander Tracy",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/41445525-a-knight-s-exile"
}