{
  "title": "The Eager to Play",
  "description": "“A vicious monster came from nowhere and kicked the car sideways” is the most favorite line of a grade 2 student.SHORT BUT EXCITING READ - Our novel is a total of 148 pages, making for the perfect size read to keep you locked in and engaged while also allowing you to finish in a few sittings!STIMULATING FOR THE IMAGINATION - Our novel is packed with exciting action and carries the ability to introduce new readers to fantasy and science fiction!GREAT COVER ART DISPLAY - Our book displays a great piece of cover art which is perfect for display on your bookshelf, center coffee table, hall shelf or even your own bedside table!MALE AND FEMALE PROTAGONIST - Our novel helps teach new readers the importance of equality and team work while also keeping them excited and engaged with the storyline!SATISFACTION GUARANTEED - We take great pride in developing an exciting and thoughtful new world for our new and loyal readers!Gaming is what everybody is excited about. People, robots, clones, dragons and monsters are playing. These are 5 chapters from the novel Blazing Night written for young audience in 2004. The text was edited by Robert H. Byers, born February 1931 died March 2018, Bob edited Blazing Night and the first chapter of Blue Earth. According to him, lots of corrections were needed on every page. He not only marked these, but read the text loud and made sure it sounded great. For him J. M. K. Walkow is \"the Canadian Conrad\". Joseph Conrad, born Józef Teodor Konrad Korzeniowski, was a Polish-British writer regarded as one of the greatest novelists to write in the English language. J. M. K. Walkow wrote The Eager to Play in one month. \"I was looking for work while my sons were going to French immersion school. We spent hours in the public library, and I was reading some books and helping them with their French and one day I just started writing,\" he said. Later the five chapters became the part of the classic naturalistic fantasy tale Blazing Night.The author is funding independent innovation in artificial intelligence, cyber security, robo-advisor, oncology, mathematics, fine art, literature and photography. Jmk Walkow is a pen name for Jacek Walkowicz.The Eager To Play, Adventure Book, Science Fiction - The Eager To Play By J.M.K. Walkow - 148 Pages, Engaging Action And Adventure, Stimulates The Imagination, Paperback Cover, Cover Art Display",
  "genres": [],
  "author": "J.M.K. Walkow",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/41448875-the-eager-to-play"
}