{
  "title": "Looking for Trouble",
  "description": "Trouble seems to follow Jesse Morgan.No matter how many times he tries to clean up his act, drinking and fighting and picking pockets are about the only things that make him feel good. All he wants when he boards a train heading for Nevada is a fresh start. He just needs a little change, a little adventure, a chance to shake off the dark cloud he seems to be stuck under.Will Kaplan isn't part of that plan. When the tall, handsome cowboy pulls him out of a jam five minutes after he steps off the train, Jesse's not sure if he's grateful or embarrassed. He's never met anyone like the quiet, no-nonsense stranger who offers him a temporary job and a place to stay.Will's stern with lots of strict rules-- and threats of childish consequences that surely must be a bluff. But he's patient and fair like no one's ever been with him, and he makes Jesse crave things he's never thought about. Makes him want to cause trouble just to see what might happen. Will makes him want to do all kinds of things that he definitely shouldn't be thinking about.Will Kaplan couldn't care less about people.Everyone he's ever loved is gone, and he's perfectly happy on his farm with his animals and just enough to get by-- alone. He only heads into town when he has to, and sure never expected to come back home with a mouthy stranger who seems dead set on driving him crazy.Will doesn't need a farmhand. He definitely doesn't need one who's stubborn and reckless and has an ugly temper. But something about the scowling, fiery outsider made him step in and save him from himself.Just because Jesse is good company when he isn't being irritating, and nice to look at even when he is, it doesn't mean Will is interested in having another person in his life for more than a week or two. Excitement and disruption are not things he's fond of. Just like he's not fond of this sullen city boy who seems determined to cause trouble, almost like he's begging for a firm hand...Looking for Trouble is historical western Daddy kink romance between a stern, reclusive cowboy and a rowdy, troublemaking stranger who don't realize they want the same things. It includes cozy forced proximity with lots of domestic scenes, a slow burn with epic tension and serious pining, a ten year age gap, spanking, first times, kink exploration, a woodshed, and an HEA.",
  "genres": [
    "Historical",
    "M M Romance",
    "BDSM",
    "Romance",
    "Westerns",
    "Historical Fiction",
    "Historical Romance"
  ],
  "author": "Misha Horne",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/41451001-looking-for-trouble"
}