{
  "title": "American Cipher: Bowe Bergdahl and the U.S. Tragedy in Afghanistan",
  "description": "The explosive narrative of the life, captivity, and trial of Bowe Bergdahl, the soldier who was abducted by the Taliban and whose story has served as a symbol for America's foundering war in Afghanistan” An unsettling and riveting book filled with the mysteries of human nature.” — KirkusPrivate First Class Bowe Bergdahl left his platoon's base in eastern Afghanistan in the early hours of June 30, 2009. Since that day, easy answers to the many questions surrounding his case—why did he leave his post? What kinds of efforts were made to recover him from the Taliban? And why, facing a court martial, did he plead guilty to the serious charges against him?—have proved elusive.Taut in its pacing but sweeping in its scope, American Cipher is the riveting and deeply sourced account of the nearly decade-old Bergdahl quagmire—which, as journalists Matt Farwell and Michael Ames persuasively argue, is as illuminating an episode as we have as we seek the larger truths of how the United States lost its way in Afghanistan. The book tells the parallel stories of a young man's halting coming of age and a nation stalled in an unwinnable war, revealing the fallout that ensued when the two collided: a fumbling recovery effort that suppressed intelligence on Bergdahl's true location and bungled multiple opportunities to bring him back sooner; a homecoming that served to deepen the nation's already-vast political fissure; a trial that cast judgment on not only the defendant, but most everyone involved. The book's beating heart is Bergdahl himself—an idealistic, misguided soldier onto whom a nation projected the political and emotional complications of service.Based on years of exclusive reporting drawing on dozens of sources throughout the military, government, and Bergdahl's family, friends, and fellow soldiers, American Cipher is at once a meticulous investigation of government dysfunction and political posturing, a blistering commentary on America's presence in Afghanistan, and a heartbreaking story of a naïve young man who thought he could fix the world and wound up the tool of forces far beyond his understanding.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "War",
    "Military Fiction",
    "Biography",
    "Journalism"
  ],
  "author": "Matt Farwell",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/41452176-american-cipher"
}