{
  "title": "Kiran: The Warrior's Daughter",
  "description": "Librarian's note: This is an Alternate Cover Edition for ASIN: B07GGYH8PL.A space opera romance by the 'Fantasy writer of the year 2017' that cannot be missed Kiran's story is a mixture of The Hunger Games with sparkling humor and a little bit of sci-fi. Flirtatious space cadet, Kiran is planning to become one of the most successful starship captains ever. Her life is all about organizing illicit races and gambling. After being kidnapped she is sent to her home planet. Later Kiran is forced to marry the mightiest warrior by the right of the strongest. Many girls have dreamt, at least once of being, a princess, but being a princess of Eeristan, the khassarat of Aygor, is a big deal. This is not about fancy dresses, diamond tiaras and palaces. Eeristan is the land of men - the land of a strong patriarchal society where women have no rights at all. She will never accept this. Kiran will run away back to her freedom and lifestyle. Her restless soul won't abide either her cruel father or her potential husband. No matter how difficult it might be to confront the whole planet. They might be stronger physically but she is a cadet, after all, and cadets never surrender! Too bad that Eeristan might not survive the changes that she desires strongly. *** Kiran: The Warrior's Daughter is the first book of the Rights of The Strong series by Ellen Stellar. Ellen is one of the most popular Russian and international fantasy and romance writers, a winner of multiple award. In 2017 she won the 'Fantasy writer of the year-2017' award. She mixes up breathtaking narrative consisting of fourteen stories, full of humor, adventures, wit and grit. This is a sci-fi space opera tale with a strong female-leader as the main character in a universe where you can be a captain of a spaceship and a princess of an outdated patriarchal tribe at the same time. Take a deep breath and dive in!",
  "genres": [
    "Science Fiction",
    "Young Adult"
  ],
  "author": "Ellen Stellar",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/41441651-kiran"
}