{
  "title": "Och, Ness!",
  "description": "Grayson Cole is stuck: stuck with writer’s block, stuck with no love life, and stuck in a place he no longer feels is home. In an effort to free himself—and discover the mysterious reason he’s so drawn to his mother’s hometown—Gray travels to Scotland, hoping that the wild, beautiful scenery will relight his lost spark.Upon arrival at a picturesque Loch-side village, Gray quickly realises that the scenery isn’t the only beautiful thing the Highlands has to offer. Hamish Macleod, the fiery young Scotsman who runs the local museum is refreshingly blunt and as sarcastic as they come, and Gray refuses to ignore their instant chemistry . . . even if the lad is an avid believer in the Loch Ness Monster.They indulge in a no-strings holiday fling, but a series of increasingly vivid dreams—and some life-changing late night encounters—have Gray questioning everything he thought he knew about Loch Ness and its mythical beastie. He's forced to admit that Hamish was right about the creature’s existence, but it turns out, the lad is hiding an even bigger secret, and when Gray finds out the truth, he’s in for a wild ride.In more ways than one.OCH, NESS! is a standalone MM monster romance with size difference, Scottish dialect, and soulmates. It involves an introverted English writer who embarks on a path of self-discovery and a cheeky, red-headed Scotsman who is much more than what he seems. OCH, NESS! is part of the WET ’N’ WILD series, where each novella follows a different human/water creature pairing and storyline.This novella contains explicit full-shift monster/human scenes. If you want to know more about what to expect with this story, visit my website for a full, in-depth content list.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Monsters",
    "Novella"
  ],
  "author": "Eryn Hawk",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/123410430-och-ness"
}