{
  "title": "Miracle in the Cave: The 12 Lost Boys, Their Coach, and the Heroes Who Rescued Them",
  "description": "Featuring never-before-reported details and exclusive interviews with the boys and their coach, the inspiring true story of how twelve members of the Wild Boar Academy Football Club and their coach survived nine days in a labyrinthine cave in Northern Thailand, and of the incredible men and women who pulled off one of the greatest rescues of all time.For nine days twelve young soccer players and their coach were confined in the dark by rising waters in the caverns of Tham Luang in Chang Rai, Thailand. With no food or drinking water except the condensation found on the cave walls, their survival seemed unlikely. Yet against the odds, a team of determined divers traversed monsoon floodwaters and narrow passageways to find Coach Ek, a stateless orphan devoted to Buddhism, and his young players alive and hopeful.Liam Cochrane spent more than two weeks on the scene, and was stationed outside of the cave entrance in daily contact with divers and other key members of the rescue team, reporting the story for the Australian Broadcast Corporation. In this mesmerizing and inspiring book, he recounts this ultimate race-against-the-clock event. Filled with never-before-reported details based on exclusive access to both the rescue team, Coach Ek, and members of the soccer team and their families, Daring to Hope chronicles the Wild Boars’ ordeal in the cave, and the rescue plan that unfolded outside—including the contentious political negotiations, the early misadventure that halted the operation for crucial hours, and the death of Thai Navy SEAL diver Saman Kunan.Going deep inside the area between the Thai and Myanmar border, better known for methamphetamines and illegal wildlife trade, Cochrane guides us through every aspect of the adventure-turned-nightmare-turned miracle: the team’s agonizing wait in the darkness; the rescuers’ battle against the forces of nature; the work of international experts who pooled their skills to help. Chochrane evokes the rollercoaster of emotions every step of the way—the terror, optimism, sadness, and joy of this indelible experience.Filled with a spirit of true grit, Daring to Hope is a courageous tale of perseverance and a celebration of an inspiring moment when the world came together in hope.",
  "genres": [
    "Nonfiction",
    "Historical",
    "History",
    "Biography",
    "Survival"
  ],
  "author": "Liam Cochrane",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/41454088-miracle-in-the-cave"
}