{
  "title": "Into the Storm",
  "description": "Bestselling author Suzanne Brockmann blends high adventure, harrowing drama, and heart-racing passion into thrilling novels of suspense. Whether tackling danger or wrestling with desire, her elite heroes and heroines never fail to give their all, in stories that soar above and beyond expectations. Now, in this electrifying novel, Brockmann takes us Into the Storm.In a remote, frozen corner of New Hampshire, a Navy SEAL team and the elite security experts of Troubleshooters, Incorporated are going head-to-head as fierce but friendly rivals in a raid-and-rescue training exercise. Despite the frigid winter temperatures, tension smolders between veteran SEAL Petty Officer Mark “Jenk” Jenkins and former cop turned Troubleshooter Lindsey Fontaine after an impulsive night goes awry. And then, suddenly, Tracy Shapiro, the Troubleshooters’ new receptionist, vanishes while playing the role of hostage during a mock rescue operation.Teaming up with the FBI to launch a manhunt in the treacherous wilderness, Jenk and Lindsey must put aside their feelings as a record snowstorm approaches, dramatically reducing any hope of finding Tracy alive. The trail is colder than the biting New England climate until a lucky break leads to a horrifying discovery– a brutally murdered young woman wearing the jacket Tracy wore when she disappeared. Suddenly there is a chilling certainty that Tracy has fallen prey to a serial killer– one who knows the backwoods terrain and who doesn’t play by the rules of engagement.In a race against time, a raging blizzard, and a cunning opponent, Jenk and Lindsey are put to the ultimate test. Rising everything, they must finally come together in a desperate attempt to save Tracy–and each other.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Military Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Suzanne Brockmann",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/414643.Into_the_Storm"
}