{
  "title": "The Chocolate Maker's Wife",
  "description": "Australian bestselling novelist Karen Brooks rewrites women back into history with this breathtaking novel set in 17th century London—a lush, fascinating story of the beautiful woman who is drawn into a world of riches, power, intrigue…and chocolate.Damnation has never been so sweet...Rosamund Tomkins, the illegitimate daughter of a nobleman, spends most of her young life in drudgery at a country inn. To her, the Restoration under Charles II, is but a distant threat as she works under the watchful eye of her brutal, abusive stepfather . . . until the day she is nearly run over by the coach of Sir Everard Blithman.Sir Everard, a canny merchant, offers Rosamund an “opportunity like no other,” allowing her to escape into a very different life, becoming the linchpin that will drive the success of his fledgling business: a luxurious London chocolate house where wealthy and well-connected men come to see and be seen, to gossip and plot, while indulging in the sweet and heady drink.Rosamund adapts and thrives in her new surroundings, quickly becoming the most talked-about woman in society, desired and respected in equal measure.But Sir Everard’s plans for Rosamund and the chocolate house involve family secrets that span the Atlantic Ocean, and which have already brought death and dishonor to the Blithman name. Rosamund knows nothing of the mortal peril that comes with her new title, nor of the forces spinning a web of conspiracy buried in the past, until she meets a man whose return tightens their grip upon her, threatening to destroy everything she loves and damn her to a dire fate.As she fights for her life and those she loves through the ravages of the Plague and London’s Great Fire, Rosamund’s breathtaking tale is one marked by cruelty and revenge; passion and redemption—and the sinfully sweet temptation of chocolate.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "British Literature",
    "Audiobook",
    "Mystery"
  ],
  "author": "Karen  Brooks",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/41454034-the-chocolate-maker-s-wife"
}