{
  "title": "Talent",
  "description": "One of the Most Anticipated Books of the Year -- LitHub, The Millions, Thrillist, Entertainment Weekly.In this \"deliciously funny, sharp, and sincere\" debut (Helen Oyeyemi), a young graduate student writing about -- and desperately searching for -- inspiration stumbles upon it in the unlikeliest of places.Anna Brisker is a twenty-nine-year-old graduate student in English at Collegiate University who can't seem to finish her dissertation. Her an intellectual history of inspiration. And yet, for the first time, Anna has found herself utterly uninspired. Rather than work on her thesis, she spends her days eating Pop-Tarts and walking the gritty streets of New Harbor, Connecticut.As Anna's adviser is quick to remind her, time is running out. She needs the perfect case study to anchor her thesis, and she needs it now. Amid this mounting pressure, Anna strikes up a tenuous friendship with the niece of famous author Frederick Langley. Freddy wrote three successful books as a young man, then published exactly nothing for the rest of his wayward, hermetic life. Critics believe Freddy suffered from an acute case of writer's block, but his niece tells Anna that there's more to the When he died, he was at work on something new.With exclusive access to the notebooks of an author who was inspired, uninspired, and potentially re-inspired, Anna knows she's found the perfect case study. But as fascination with Freddy blooms into obsession, Anna is drawn irrevocably into the criminal machinations of his sole living heir.A modern twist on the Parable of the Talents, Lapidos's debut is a many-layered labyrinth of possible truths that reveal at each turn the danger of interpreting another person's intentions -- literary or otherwise.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Novels",
    "Audiobook",
    "Campus",
    "Modern"
  ],
  "author": "Juliet Lapidos",
  "average_rating": "3.07",
  "url": "https://www.goodreads.com/book/show/41457765-talent"
}