{
  "title": "Breaking Point",
  "description": "Uncommon valor in the line of duty and unconditional devotion in the name of love are the salient qualities of the daring men and women who risk it all in the heart-pounding thrillers of New York Times bestselling author Suzanne Brockmann. Crafted with precision and power, her characters come alive with a depth of emotion few writers have achieved. Now, with Breaking Point, Brockmann breaks even further through the pack and delivers a stunning payload.As commander of the nation's most elite FBI counterterrorism unit, agent Max Bhagat leads by hard-driving example: pushing himself to the limit and beyond, taking no excuses, and putting absolutely nothing ahead of his work. That includes his deep feelings for Gina Vitagliano, the woman who won his admiration and his heart with her courage under fire. But when the shocking news reaches him that Gina has been killed in a terrorist bombing, nothing can keep Max from making a full investigation-and retribution-his top priority.At the scene of the attack, however, Max gets an even bigger shock. Gina is still very much alive-but facing a fate even worse than death. Along with Molly Anderson, a fellow overseas relief worker, Gina has fallen into the hands of a killer who is bent on using both women to bait a deadly trap. His quarry? Grady Morant, a.k.a \"Jones,\" a notorious ex-Special Forces operative turned smuggler who made some very deadly enemies in the jungles of Southeast Asia . . . and has been running ever since. But with Molly's life on the line, Jones is willing to forfeit his own to save the woman he loves.Together with Max's top agent Jules Cassidy as their only backup, the unlikely allies plunge into a global hot zone of violence and corruption to make a deal with the devil. Not even Jones knows which ghosts from his past want him dead. But there's one thing he's sure of-there's very little his bloodthirsty enemies aren't willing to do.Count on the intense action and raw honesty that Suzanne Brockmann consistently delivers, as she goes for broke in Breaking Point-and never looks back.From the Hardcover edition.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Military Fiction",
    "Contemporary",
    "Fiction",
    "Contemporary Romance"
  ],
  "author": "Suzanne Brockmann",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/414646.Breaking_Point"
}