{
  "title": "A Fan's Notes",
  "description": "Frederick Exley's inimitable \"fictional memoir\" A Fan's Notes has assumed the status of a classic since its first publication in 1968. Mordantly and poignantly, Exley describes the profound failures of his life; professional, sexual, and personal. His attempts to find a place for himself in an unaccommodating world take him from the University of Southern California to Chicago, where he meets the dangerously seductive, lovely, Bunny Sue Allorgee, to New York City's Greenwich Village saloons, and back to Watertown, his hometown in upstate New York, where he spends months on his mother's living room davenport watching television before undergoing shock treatment at Avalon Valley hospital. Between bars, women and jobs, Exley exercises his obsession with the New York Giants and their great halfback Frank Gifford, until he at last realizes his life's ambition: writing A Fan's Notes, an Institute of Arts and Letters' Rosenthal Award for \"that work which...is a considerable literary achievement.\" It was described by Robert Penn Warren as \"a moving and memorable book,\" by Michael Crichton as \"a devastating novel,\" and by William Gass as \"an instructive, powerful and bruising experience.\" In Newsweek, Jack Kroll wrote that the novel is \"a welcome reminder of what the basic business of literature and of living really is. All fans of life and art should read it.\" This Modern Library edition includes an Introduction by Frederick Exley's biographer, Washington Post book critic and columnist Jonathan Yardley. A Fan's Notes was nominated for a National Book Award, won the William Faulkner Award for \"the year's most notable first novel,\" and was awarded the National Academy...",
  "genres": [
    "Fiction",
    "Sports",
    "Literature",
    "Novels",
    "Literary Fiction",
    "American",
    "Football"
  ],
  "author": "Frederick Exley",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/41518.A_Fan_s_Notes"
}