{
  "title": "Nighttime Is My Time",
  "description": "\"The definition of an owl had always pleased him: a night bird of prey...sharp talons and soft plumage which permits noiseless flight...applied figuratively to a person of nocturnal habits. 'I am The Owl,' he would whisper to himself after he had selected his prey, 'and nighttime is my time.'\"  Jean Sheridan, a college dean and prominent historian, sets out to her hometown in Cornwall-on- Hudson, New York, to attend the twenty-year reunion of alumni of Stonecroft Academy, where she is to be honored along with six other members of her class. There is, however, something uneasy in the air: one woman in the group about to be feted, Alison Kendall, a beautiful, high-powered Hollywood agent, died just a few days before, drowned in her pool during an early- morning swim, the fifth woman in the class whose life has come to a sudden, mysterious end.  Also adding to Jean's sense of unease is a taunting, anonymous fax she has just received, referring to her daughter, Lily, a child she had given up for adoption twenty years ago, the offspring of a romance between her and a West Point cadet killed in an accident a week before graduation. She had always kept the child's existence a secret, so who has found out? And why the implied threat now?  Struggling to conceal her fears, Jean arrives at the hotel where the reunion is being held. One by one she sees the other honorees, including Laura Wilcox, the class beauty, whose dazzling exterior belies the fact that her television career is sinking, and the four men who, like Jean, had spent four bitterly unhappy years at Stonecroft: Carter (formerly Howie) Stewart, an acerbic and successful playwright, once the class nerd; renowned child psychiatrist and talk-show celebrity Mark Fleischman, who has never been able to resolve the pain of his own adolescence; Gordon Amory, a media mogul, hardly recognizable as the awkward boy who was the butt of cruel jokes; Robby Brent, a popular comedian, whose caustic humor emanates from a childhood of rejection. Omnipresent is an old classmate, Jack Emerson, the chairman of the reunion, whose reasons for spearheading the event may be motivated by something other than class spirit.  At the award dinner, Jean is introduced to Sam Deegan, a detective obsessed for years by the unsolved murder of a young woman in Cornwall, who may also hold the key to the identity of the Stonecroft killer and the source of the anonymous threat to her child. She does not suspect that among the distinguished people she is greeting is The Owl, a murderer nearing the countdown on his mission of vengeance against the Stonecroft women who had mocked and humiliated him, with Jean his final intended victim.  In Nighttime Is My Time, Mary Higgins Clark creates a riveting novel of psychological suspense, penetrating behind the pervading façade of status and respectability to depict the mind of a killer.",
  "genres": [
    "Mystery",
    "Fiction",
    "Suspense",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Audiobook"
  ],
  "author": "Mary Higgins Clark",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/41492.Nighttime_Is_My_Time"
}