{
  "title": "High Roller",
  "description": "Tiffany Lang hit the jackpot when she married her college sweetheart. For seven years, she had it all; a successful husband, beautiful home, and an adorable son. But her winning streak came to a heartbreaking end when she discovered her husband balls-deep in another woman. Nine months later, Tiffany is divorced and adjusting to life as a single parent under the ever-flashing lights of Las Vegas. With her son now spending half his time at her ex’s, she longs for something to keep her busy. At the suggestion of her best friend, she takes a job as a cocktail waitress at one of Sin City's hottest establishments: Azul Cielo Casino.  Carter Jackson, a prominent entertainment lawyer from LA, is known as a high roller at Azul Cielo Casino, hosting private poker nights for his colleagues and sparing no expense. A last-minute staffing change puts Tiffany front and center at one of these gatherings, where she meets Carter. Their attraction to one another is instant and palpable, yet Tiffany vows to keep things between them professional. Carter’s charming persistence eventually wears her down and she agrees to meet for coffee. A harmless enough first date, right? Wrong. The line between ‘professional’ and ‘personal’ is quickly erased.  Life with a high roller is anything but boring - lavish parties, wild, unhinged sex. But then, something changes, raising the stakes in their relationship. And while Carter’s going all-in, willing to take the biggest of gambles on true love, Tiffany is hesitant. The sting of betrayal from her cheating ex is still there, holding her back. But the bet’s on her now. Will Tiffany call to see if Carter’s bluffing, and take a chance on love again? Or, will she fold and walk away from the table with nothing?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "M.L.  Preston",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/41512641-high-roller"
}