{
  "title": "Territorio final",
  "description": "El territorio al que se refiere esta novela de Colombres es un espacio, Tucumán, peno también puede ser un tiempo: el de las primeras décadas de este siglo, con proyecciones hacia el siglo anterior, del que nos llegan, en cl viento suave de la memoria, los ecos de algunas glorias militares e inofensivos espectros. Es, sí, el producto de una nostalgia, una minuciosa y poética descripción de un mundo que se apaga, que huye como el día, lenta pero inexorablemente. Sin embargo, no todo es moriencia, reflujo, oscilación final. Hay también cantares y floraciones, y fuegos que estallan como signos del nuevo tiempo, acelerando la decadencia del antiguo. Novela mosaico en la que se enfrentan las distintas clases sociales de esa provincia, y en la que confluyen todas sus vertientes culturales. Los personajes están tratados con dignidad: palpamos su vida real y las razones que los llevan a hundirse en un drama a la postre pasajero, porque las sombras del paraíso mitigan pronto las heridas, cubren todo vacío con su hojarasca, y por otra parte la historia no se detiene a llorar a sus muertos. El nivel de su lenguaje y el poder de síntesis que refleja nos permite leerla como una sinfonía de seis Movimientos, en la que las secuencias de gran agilidad narrativa sólo apuntan a destacar la escritura morosa que marca el tono predominante, ávida de objetos y matices, como si no quisiera dejar nada sin nombrar en esa despedida.Adolfo Colombres nació en Tucumán, en 1944. Vivió y editó en varios países, recibiendo premios en el orden nacional e internacional por su obra literaria. Entre sus novelas podemos citar Caranday de las muertes (1972), Los citas imposibles (1973), El oficio de militante (1974), Viejo camino del malz (1979) y Sol que regresa (1981). En 1984 publicó Portal del paraíso, que corresponde también al ciclo de Tucumán. Es conocido asimismo por sus ensayos antropológicos.",
  "genres": [],
  "author": "Adolfo Colombres",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/4153133-territorio-final"
}