{
  "title": "Silent Night: The Remarkable Christmas Truce of 1914",
  "description": "It was one of history's most powerful,yet forgotten,Christmas stories. It took place in the improbable setting of the mud, cold rain and senseless killing of the trenches of World War I. It happened in spite of orders to the contrary by superiors; it happened in spite of language barriers. And it still stands as the only time in history that peace spontaneously arose from the lower ranks in a major conflict, bubbling up to the officers and temporarily turning sworn enemies into friends. Silent Night, by renowned military historian Stanley Weintraub, magically restores the 1914 Christmas Truce to history. It had been lost in the tide of horror that filled the battlefields of Europe for months and years afterward. Yet in December 1914 the Great War was still young, and the men who suddenly threw down their arms and came together across the front lines to sing carols, exchange gifts and letters, eat and drink and even play friendly games of soccer naively hoped that the war would be short-lived, and that they were fraternizing with future friends.  It began when German soldiers lit candles on small Christmas trees, and British, French, Belgian and German troops serenaded each other on Christmas Eve. Soon they were gathering and burying the dead, in an age-old custom of truces. But as the power of Christmas grew among them, they broke bread, exchanged addresses and letters and expressed deep admiration for one another. When angry superiors ordered them to recommence the shooting, many men aimed harmlessly high overhead.  Sometimes the greatest beauty emerges from deep tragedy. Surely the forgotten Christmas Truce was one of history's most beautiful moments, made all the more beautiful in light of the carnage that followed it. Stanley Weintraub's moving re-creation demonstrates that peace can be more fragile than war, but also that ordinary men can bond with one another despite all efforts of politicians and generals to the contrary.",
  "genres": [
    "History",
    "Nonfiction",
    "Christmas",
    "Mystery",
    "World War I",
    "War",
    "Holiday"
  ],
  "author": "Stanley Weintraub",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/41491.Silent_Night"
}