{
  "title": "The Bartender and the Babies",
  "description": "alternate cover edition of ASIN B07GX92KHDA Friends to Lovers Romance. KURT I faked being happy for years as a high-powered stock broker. Faking a relationship for a week can’t be that much harder.  Course, pretending money and success was all I needed led directly to my breakdown, and lying on my mom’s couch is all I’ve been good at ever since. Maybe ‘faking it til I make it’ isn’t a skill I should be putting on my resume. Assuming I ever get back to sending those out.  But one existential crisis at a time. First I need to survive my sister’s wedding with my sanity intact. And since that I fended off my mom’s matchmaking with claims of a nonexistent boyfriend…I need one of those.  It should probably surprise me how easily my mind turns to Evan, the gorgeous omega owner of the bar I like to drown my sorrows in. Or how easy he is to sell on the idea. Mostly, it just seems right.  There’s a loneliness that clings to him like a shadow only I can see. Makes me think we’re kindred spirits. Maybe we can be lonely together.  Maybe we can even be something more.  I should’ve expected he has problems of his own. That a screw-up is the last person who should be trying to save someone else.  But I didn’t, and now I just hope we can save each other.  Or else my fake relationship will end with very real consequences for us both.  EVAN I don’t know what drives me to keep my brother’s bar open after he dies. It was never my dream. And I’ve got no one left to prove anything to.  But its the last piece I have of him, and I’m not ready to let go. Move on. Maybe that’s why I fight it when Kurt shakes up the Limbo I’ve spent so long living in.  Its not like this relationship was supposed to be real. Yet I can tell he wants more. Trying to help with the bar. Wanting to be my rock. A new foundation.  But I can’t let him. Because I can’t deal with losing my foundation again.  If that means I have to be alone, so be it. My mind isn’t changed just because I end up pregnant.  So why do I still hope Kurt finds a way to change it?  This 50,000 word novel about lives lost and loves found features mpreg, mental health issues and a whole lot of sexual healing. Be eighteen and up when reading!",
  "genres": [
    "M M Romance",
    "Romance",
    "Omegaverse",
    "Audiobook",
    "LGBT",
    "Family",
    "Gay"
  ],
  "author": "Aiden Bates",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/41554420-the-bartender-and-the-babies"
}