{
  "title": "The Sleep-Over Artist: Fiction",
  "description": "\"In the same way Salinger carved out the niche of male adolescence ....Beller approaches that mutable boy-to-man territory.\"― San Francisco Chronicle Writing with the sparkling wit and insight of his highly praised debut, Seduction Theory (\"Brilliantly captures the great expectations and recurring ambivalence of youth.\"― The New York Times ), Thomas Beller continues to plumb the adventures of his hero, Alex Fader, a youthful existentialist and sensualist with an insatiable appetite for trouble. The Sleep-Over Artist is an account of critical stages in Alex's life, mapping his progress from youthful delinquent to filmmaker whose career begins when he makes a documentary film exposing the prep school from which he has been expelled. Alex longs for the taste of family life that the early death of his father has denied him. As a young boy he sleeps over at his friends' houses and ingratiates himself with their families; as a young man he extends his sleep-overs to the lives of women, culminating in the ultimate sleep-over―an affair in England with a glamorous, slightly older woman, the mother of a young boy. Beller has a pitch-perfect ear for emotional nuance and a microscopic eye for rendering the wordless moments when a relationship catches fire and all too often begins to falter. The high-wire tension that electrifies The Sleep-Over Artist is Beller's ingenious portrait of a young man who longs to disappear and belong all at the same time.\"Hilarious....captures perfectly the myriad stages of fear, discovery and elation that mark one's first sexual experience.\"― The New York Times Book Review , Katherine Dieckmann, 16 July 2000 \"[W]ell-crafted stories recall the witty phrasing of Updike, the poignant nostalgia of Cheever, the earnest but confused innocence of Salinger.\"― Library Journal \"Featuring a New York that, like Kundera's Prague, is a vast hive of seductions....A moving portrait.\"― Publishers Weekly , 17 April 2000  \"The gentle humor and delicacy of Sleep-Over Artist remind me of the stories of another young cosmopolite, F. Scott Fitzgerald.\"―Stewart O'Nan, author of A Prayer for the Dying \"Fresh, sophisticated and most of all utterly readable...strikes a perfect balance between timely ironies and perennial emotional truths.\"―Eva Hoffman \"Tom Beller is gifted with a wry, dry appreciation of life's sweet and unlikely subtleties.\"―Elizabeth Wurtzel, author of Prozac Nation and Bitch \"A fine novel of Manhattan manners.\"― New York Observer",
  "genres": [
    "Fiction"
  ],
  "author": "Thomas Beller",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/415447.The_Sleep_Over_Artist"
}