{
  "title": "The Cynical Expat’s Guide to Provoking Street Revolutions in Central Asia",
  "description": "The former Soviet Republic of Kajbezistan is known for many things, notably: the statues of Stalin that still feature prominently in towns throughout the country, the use of a large cauldron to slowly simmer dissidents alive, a violent forced beard-shaving campaign, the noble tradition of bride kidnapping, a very poisonous Canadian gold mine, and an international airport designed in the shape of an eagle but built instead in the outline of a vulture. This ancient Eurasian nation is home to many other wonders, from the snow-capped peaks and land-mined valleys of the Opasno-Badakhshyan region to the radioactive antelope herds that roam the nuclear wastelands of the Quasipalatinsk steppe, as well as an underground rubbish fire in the Black Sands desert that has been burning since Soviet times.  The Kajbez people themselves also have a rich history, dating all the way back to 1924 when Josef Stalin decided to forcibly create the Kajbez nation where one had never existed before. The Kajbez tribes came together along the socialist path, united by their leisurely dedication to Sufi Islam, their confused indifference to communism, and their love of vodka. All of this is now lovingly ruled over with a scrap-metal fist by Gulganberdybacha Islambaev, Kajbezistan’s octogenarian president-for-life who was recently honored at Islambaev University with the inauguration of the Islambaev Studies Master’s Degree Program. The president has help, of course, from his large family of village idiots turned international money launderers, particularly his serial rapist son Rizvon who first gained fame for leading a massacre of striking oil field workers and supervising the torture of the survivors.  Unfortunately for the lucky citizens of Kajbezistan, an expat named Rupert – who is a leading candidate for Kajbezistan’s worst, drunkest and most perverted foreign guest – is on an unintentional collision course with the wise leadership of this stable state. Rupert, known as 'Rupert the Racist' to his fellow alcoholic members of a vaguely British running club in Kajbezistan's capital city Chorshanbe, has recently been fired as sub-regional project manager of the Presbyterian Aid Services NGO for trading women’s empowerment grants for sexual favors. He is left unemployed with six months remaining on his visa, and a pocket full of undistributed humanitarian aid money that he embezzled from his employer.  With time and money on his hands, Rupert flees the capital city and sets out to explore Kajbezistan with Muhammadjoon (AKA “Johnny”), his completely trustworthy local guide who doubles as prostitution consultant and recreational drug buyer. Along the way they meet various Kajbezistani eccentrics, US State Department imbeciles, United Nations sex fiends, KGB dimwits, Russian “tourists,” underground Islamists, aboveground Islamists, mentally ill expats, greedy shamans, clueless backpackers, anarcho-syndicalist European PhD students, and various others who will help to shape Rupert’s view of the world as liveable only for nihilistic drunks.  In hot pursuit of Rupert are two of Kajbezistan's ugliest and greediest KGB officers, out to do their patriotic duty and grab Rupert's bag of embezzled cash for themselves. Not so shockingly, things end up going terribly wrong for everybody involved…",
  "genres": [],
  "author": "Christian Hale",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/41552628-the-cynical-expat-s-guide-to-provoking-street-revolutions-in-central-asi"
}