{
  "title": "Genesis",
  "description": "Genesis is the first in a series of fifteen books charting the adventures of one Captain Harry Travers: Travers is an airline captain, with over twelve years’ flying experience, flying the Airbus A320 for JaguAir, but who ends up deciding to try his hand at Private Investigating, as a side line, when he begins to investigate the disappearance of an uncle he didn't know he had until he is informed of his being the beneficiary in the man's will, which amounted to a sizeable piece of real estate in Tennessee. He quickly begins to believe, once he starts to deal with his late uncle's lawyer, Anton Jeffries, that there is more to the man's demise than meets the eye and along with one of his uncle's friends, Tommy Shearen, they investigate leading Harry and Tommy getting involved in car chases, fist fights, shootouts and even an aerial dogfight. In this first book we see how Travers learns the initial, valuable skills to aid and abet him during further investigations and the subsequent cases he takes on to gain valuable experience, including finding a missing dog, which leads him into discovering a dog fighting ring and helping the brother of a work colleague, Sheila Wallace, who Harry has strong feelings for and finds a love reciprocated, and has lost heavily at cards in Nero's Casino in rather dubious circumstances. The latter case ends up with Harry and Sheila participating in a high stakes Texas Holdem Poker game. Future books will see Harry add to his experience levels eventually becoming a kind of Philip Marlowe type character, but he discovers in Genesis a much darker side to his persona when having to deal with less than salubrious characters and an acceptance that danger will lurk around every corner: if it ever came down to him or them, and he could prove their guilt beyond all reasonable doubt, Travers has no compunction to use all means, legal or illegal, to bring them to justice.Harry though ultimately finds himself changed by the experiences of being a private detective for which he knows there can be no turning back: this is how his life will be from now on, good or bad, and he embraces it all with open arms.",
  "genres": [],
  "author": "Edward Johns",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/41552568-genesis"
}