{
  "title": "Triple Deception",
  "description": "Massive murders occur in Baghdad from MEASS (Middle East Alliance of Sunnis and Shiites), a terrorist group formed after the fall of ISIS. Iraq is determined to thwart the terrorists. Arif Yildiz, the deputy national intelligence director, presents a scheme to Iraq’s International Intelligence Service to acquire a new US military weapon. With this weapon, they can obliterate MEASS, but they need it NOW. The plan will be approved and implemented by the spy branch of the Iraq government, the Tariq'Allah, the Shining Star of Allah.It starts with the kidnapping of two wives of military intelligence officers, Paul Remmich and Eric Miller. Threatened with their spouses’ deaths, they are forced to go to Istanbul. Hoping to soften the men’s animosity and gain their willing assistance, the Iraqis plan a lavish distraction. Unfortunately, the trip to a Mediterranean resort with their wives doesn’t quite work out as the spy organization hoped. The CIA slips into the picture, determined to save the women’s lives and get them out of Turkey.Forced to adjust their plan, the Tariq'Allah selects Paul Remmich to negotiate for the weapon in Washington, DC. When the officer presents the demand for the weapon, its rejection places his and Miller's life squarely in danger.Upon Remmich's return to Turkey, he finds the failure angers and humiliates the Iraqis, and more time passes as they consider their options. When the only recourse appears to be the death of the Americans, the CIA again attempts a rescue with a clever scheme. Enraged by the attempt, Tariq'Allah follows the escape path, and a gunfight ensues. The final showdown will determine whether the Iraqis achieve the weapon they so desperately need and whether or not the American officers return home in one piece or in body bags.",
  "genres": [
    "Fiction"
  ],
  "author": "Karl Braungart",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/123425153-triple-deception"
}