{
  "title": "Star Wars Meets the Eras of Feminism: Weighing All the Galaxy’s Women Great and Small",
  "description": "Star Wars defined popular, big-screen science fiction. Still, what many viewers best recall is assertive, hilarious Leia, the diminutive princess with a giant blaster who had to save them all. As the 1977 film arrived, women were marching for equality and demanding equal pay, with few onscreen role models. Leia echoed their struggle and showed them what they could be. Two more films joined in, though by the early eighties, post-feminism was pushing back and shoving the tough heroine into her pornographic gold bikini. After a sixteen-year gap, the prequels catered to a far different audience. Queen Amidala's decoy power originates in how dominated she is by her massive royal gowns. This obsession with fashion but also costuming as a girly superpower fits well with the heroines of the time. The third wavers filled the screens with glamorous, mighty girls - strong but not too strong, like the idealistic teen Ahsoka of Clone Wars. However, space colonialism, abusive romance, and sacrifice left these characters a work in progress. Finally, the sequel era has introduced many more women to fill the galaxy: Rey, Jyn, Rose, Maz, Qi'ra, Val, L3-37, Captain Phasma, Admiral Holdo, and of course General Leia. Making women the central warriors and leaders while keeping them powerful and nonsexualized emphasizes that they can share in the franchise instead of supporting male Jedi. There's also more diversity, though it's still imperfect. Hera and Sabine on the spinoff cartoon Rebels and the many girls in the new franchise Forces of Destiny round out the era, along with toys, picture books, and other hallmarks of a new, more feminist fourth wave for the franchise.",
  "genres": [
    "Feminism",
    "Star Wars",
    "Nonfiction"
  ],
  "author": "Valerie Estelle Frankel",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/41545665-star-wars-meets-the-eras-of-feminism"
}