{
  "title": "Lone Wolf's Omega",
  "description": "Damian thinks it's just one night. Salem thinks Damian's just another customer. They're both wrong.  Damien grew up so poor even dirt was richer. So when the government approached him with a devil's deal, he leaped at a chance to provide for his parents and the rest of his family. All he had to give up was everything--his history, his pack, even his name. In return, his family would get his military pension, paid out as if he'd served his twenty. It had seemed like a good deal at the time.  Now, nameless, packless and essentially friendless, he's not so sure. Lone wolves are lonely, but his pack thinks he's dead, and so he finds himself at the doors of the notorious brothels of Nevada Ashes, looking for a little make believe, a little taste of home.  Salem wasn't the prettiest omega in Nevada Ashes, but when an omega was in heat, that didn't matter. The humans lined up for an hour of his time, and he and the pack raked in that sweet, sweet human money. Only a year and a half into his career and already at the top of the pay structure, he's determined to be no alpha's trophy. When he decides to mate, he wants to choose the alpha, not be chosen by one.  Until a 'date' like no other proves his undoing, leaving Salem with a baby on the way and no idea who the sire is--a shifter who smelled like a human. With no alpha in sight, Salem's got some hard choices to make, choices that could very well destroy the future he dreamed of for himself.  But Damian still remembers the omega who showed him kindness just when he most needed it. Remembers, and craves. When he learns of the baby, he risks it all to return to Salem and claim the omega for his own. But can Salem forgive the deception, or will Damian be forever a Lone Wolf?",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Military Fiction",
    "LGBT"
  ],
  "author": "Ann-Katrin Byrde",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/41554246-lone-wolf-s-omega"
}