{
  "title": "Sand & Steel: The D-Day Invasions and the Liberation of France",
  "description": "Peter Caddick-Adams's account of the Allied invasion of France in June 1944 matches the monumental achievement of his book on the Battle of the Bulge, Snow and Steel , which Richard Overy has called the \"standard history of this climactic confrontation in the West.\" Sand and Steel gives us D-Day, arguably the greatest and most consequential military operation of modern times, beginning with the years of painstaking and costly preparation, through to the pitched battles fought along France's northern coast, from Omaha Beach to the Falaise and the push east to Strasbourg.In addition to covering the build-up to the invasion, including the elaborate and lavish campaigns to deceive Germans as to where and when the invasion would take place, Caddick-Adams gives a full and detailed account of the German the formidable Atlantikwall and Field Marshal Erwin Rommel's plans to make Europe impregnable-plans not completed by June 6. Sand and Steel reveals precisely what lay in wait for the Allies. But the heart of the book is Caddick-Adams' narratives of the five beaches where the terrible drama played out-- Utah , Omaha , Gold , Juno , and Sword , and the attempt by American, British, and Canadian soldiers to gain a foothold in Europe.The Allied invasion of Europe involved mind-boggling logistics, including orchestrating the largest flotilla of ships ever assembled. Its strategic and psychological demands stretched the Allies to their limits, testing the strengths of the bonds of Anglo-American leadership. Drawing on first-hand battlefield research, personal testimony and interviews, and a commanding grasp of all the archives and literature, Caddick-Adams's gripping book, published on the 75th anniversary of the events, does Operations Overlord and Neptune full justice.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Military History",
    "War",
    "European History",
    "American History"
  ],
  "author": "Peter Caddick-Adams",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/41551661-sand-steel"
}