{
  "title": "Long Rider to Rome: 1,400 Miles by Pilgrim Horse from Canterbury",
  "description": "'Another corner, another surprise on the other side: a photographer standing at the roadside with a bride and groom, he in a dark suit, she in a floaty dress as pristine as the snows of Mont Blanc and cut extremely low. They're delighted to see us and it seems we've turned up right on cue: 'Madame, may we photograph your horse with us?' 'No problem,' I say. Leo strides suavely up to the bride and buries his nose in her cleavage, snuffling lasciviously… The camera is clicking as I haul him back, and the reason for his over-familiar behaviour is clenched in his teeth -- the bride's corsage of white roses. I yank them out of his mouth and hand back some tattered stalks, and luckily she sees the funny side. All the same, it would probably be politic to remove him before she also notices the green slobber trickling down her dress.'Still hooked on adventure after their long pilgrimage to Santiago de Compostela, a few years later Mefo Phillips and her spotted horse Leo set off again from Canterbury, this time heading for Rome, with Mefo's husband Peter once more trying to keep track of them in Bessie the Bedford horsebox. Turning her back on the main route of the Via Francigena through France and Switzerland, she opted instead for the road less travelled, a secondary pilgrim route that climbed directly over the French border pass at Mont Cenis into Italy. Their journey turned out to be far more challenging than the previous one, with no signage between Canterbury and Italy, no pilgrim infrastructure, incomprehensible maps, even a heartstopping fall down a ravine; and the weather was frequently terrible, ranging from violent storms in the Alps to days of desiccating heat in the Po River valley. But it was a journey of great highs as well as lows: the unexpected view of the Mont Blanc massif drenched in snow; crossing the Col de l'Iseran through ghostly clouds at 9000 feet; catching sight of the Mediterranean Sea for the first time as she and Leo came down from the Apennines above La Spezia; and the wonderful jumble of hospitable humanity they met as they followed tortuous paths across Europe. Although the backbone of 'Long Rider to Rome' is the amazing experience of travelling with a much-loved horse, there was another reason for this pilgrimage: Mefo's writer and rider mother had died from Alzheimer's disease, and she rode in aid of the Alzheimer's Society and to make an equine journey she believed her mother would have loved to do herself. Memories of her are woven into the narrative, triggered by Mefo's own experiences as she rode along; she was determined to get to Rome, and 108 days after leaving Canterbury she and Peter walked with Leo along the banks of the Tiber, and cut across the city's teeming streets to arrive finally in St Peter's Square.",
  "genres": [],
  "author": "Mefo Phillips",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/41557650-long-rider-to-rome"
}