{
  "title": "Toby's Story: A Puppy Tale",
  "description": "Meet Toby ― a very special dog with a very important purpose ― featured in A Dog's Journey , the basis for the major motion picture! Young readers will love this story in the popular A Dog's Purpose Puppy Tales series by bestselling author W. Bruce Cameron.Toby is a beagle who doesn’t seem to have a purpose. While all of his littermates are adopted right away, Toby is left behind because he's not as energetic as they are. But because he is so quiet, he is adopted by a girl named Mona and her mother, who works at a nursing home. As Toby comforts the residents of the home, he discovers that his purpose may be the most important of all!Toby’s Story is another uplifting tale of the bond that exists between humans and their cherished animal companions. Young fans of Ellie’s Story , Bailey’s Story , Molly’s Story , and Max’s Story will welcome this new addition to the bestselling series. Includes heartwarming illustrations by Richard Cowdrey and a reading and discussion guide at the end of the book.More Tales from Bruce Cameron!FROM THE PUPPY TALES Ellie's Story / Bailey's Story / Molly's Story / Max's Story / Lily's Story / Shelby's Story / Toby's Story / Bella's Story / Cooper's Story / Lacey's StoryTHE LILY TO THE RESCUE Lily to the Rescue / Lily to the Two Little Piggies / Lily to the The Not-So-Stinky Skunk / Lily to the Dog Dog Goose / Lily to the Lost Little Leopard / Lily to the The Misfit Donkey / Lily to the Foxes in a Fix / Lily to the The Three BearsFROM THE DOG'S PURPOSE A Dog's Purpose / A Dog's Journey / A Dog's PromiseTHE DOG'S WAY HOME A Dog's Way Home / A Dog's CourageOTHER TITLES FROM Love, Diary of a Good DogA Dog's Perfect ChristmasThe Dogs of ChristmasThe Dog MasterEmory's GiftTHE RUDDY MCCAN The Midnight Plan of the Repo Man / Repo Madness / The Midnight Dog of the Repo Man",
  "genres": [
    "Fiction",
    "Dogs",
    "Middle Grade",
    "Childrens",
    "Animals",
    "School",
    "Animal Fiction"
  ],
  "author": "W. Bruce Cameron",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/41555953-toby-s-story"
}