{
  "title": "Stolen Wishes",
  "description": "After being gone for several decades, Gabriel Doyle feels drawn to his former hometown in Colorado. His memories are vague and blurry, but he can’t resist the urge to go, especially when the woman in his dreams begins to appear in real life. What he’s not so sure about is what he faces on his return—leading the Lilith Nest vampires.  Needing a fresh start, Alina Anand takes a nanny job for a mage family in Havenwood Falls. At first, life is great. She loves her charges and finds the town quaint and welcoming, but everything changes when her employers steal her amulet—and take control of her wish-granting powers. Bound to them by tradition, she has no choice but to serve them.  When their destinies collide, Gabriel and Alina discover a connection that goes beyond their undeniable passion. But to save Alina, Gabriel must decide whether to pick up the dark life of bloodshed and revenge he’d left behind, or to ask for help from those who demand sacrifice. Nothing in life is free. The star-crossed lovers must fight for what they desire most—to be who they are, love who they want, and escape the bonds of their pasts in a town that forgives little and forgets nothing.  \nWelcome to the darker, sexier side of Havenwood Falls that many residents never speak of publicly, but most likely enjoy in secret. Venture into the SIN MC, the VIP rooms of Silk nightclub, and behind other closed doors, where you’ll discover passion, unusual penchants, and just how far some will go for love. Hold on to your panties, because it’s time to ride.\n  This is a stand-alone steamy paranormal romance in the Havenwood Falls shared world. A collaborative effort by multiple authors across multiple series all in the paranormal fantasy genre, Havenwood Falls allows readers to discover new authors and stories to fall in love with. Each author brings a stand-alone plotline, so they can be read in any order.",
  "genres": [],
  "author": "Victoria Flynn",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/41574308-stolen-wishes"
}