{
  "title": "The Heartbeat of Wounded Knee: Native America from 1890 to the Present",
  "description": "A sweeping history--and counter-narrative--of Native American life from the Wounded Knee massacre to the present.The received idea of Native American history--as promulgated by books like Dee Brown's mega-bestselling 1970 Bury My Heart at Wounded Knee--has been that American Indian history essentially ended with the 1890 massacre at Wounded Knee. Not only did one hundred fifty Sioux die at the hands of the U. S. Cavalry, the sense was, but Native civilization did as well. Growing up Ojibwe on a reservation in Minnesota, training as an anthropologist, and researching Native life past and present for his nonfiction and novels, David Treuer has uncovered a different narrative. Because they did not disappear--and not despite but rather because of their intense struggles to preserve their language, their traditions, their families, and their very existence--the story of American Indians since the end of the nineteenth century to the present is one of unprecedented resourcefulness and reinvention. In The Heartbeat of Wounded Knee, Treuer melds history with reportage and memoir. Tracing the tribes' distinctive cultures from first contact, he explores how the depredations of each era spawned new modes of survival. The devastating seizures of land gave rise to increasingly sophisticated legal and political maneuvering that put the lie to the myth that Indians don't know or care about property. The forced assimilation of their children at government-run boarding schools incubated a unifying Native identity. Conscription in the US military and the pull of urban life brought Indians into the mainstream and modern times, even as it steered the emerging shape of self-rule and spawned a new generation of resistance. The Heartbeat of Wounded Knee is the essential, intimate story of a resilient people in a transformative era.",
  "genres": [
    "History",
    "Nonfiction",
    "Native American",
    "Indigenous",
    "Politics",
    "American History",
    "Race"
  ],
  "author": "David Treuer",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/41574287-the-heartbeat-of-wounded-knee"
}