{
  "title": "Titan: Gift of Death: An Epic Novel of Urban Fantasy and Greek Mythology",
  "description": "Hunted, haunted... Heroes on the run!Love Percy Jackson but ready for something more intense and adult?In this thrilling third adventure, Andrus Eaves and his friends, Mark and Hannah, are pursued through the Greek underworld by Cronus' monster army. Things go from bad to worse when Mark is wounded and the heroes are forced to hide in Murder Town, the City of Ghosts. When Cronus' army surrounds the city, Andrus is forced to make a terrible decision—a decision that will haunt him more than any ghost. Will our heroes escape the horrors of the underworld and return to Earth? Find out when you read this jaw-dropping urban fantasy.*** GIFT OF DEATH CONTINUES THE STORY BUZZFEED CALLS \"IRRESISTIBLE\" AND \"A HEART-POUNDING STORY FULL OF SUSPENSE, ROMANCE, AND ACTION!” ***Everything you loved about Titan and Kingdom of the Dead is back times a thousand in this insanely epic Book 3. Don't miss this amazing binge-worthy series from Daniel Mignault & USA TODAY bestselling author Jackson Dean Chase.What is The Gods War series like?It's a fast-paced adventure filled with magic and mystery. It comes off like a darker, grittier Percy Jackson written for adults and teens mixed with Divergent, The Hunger Games, and The Maze Runner. The series contains graphic violence, some romance, and minimal cursing. It has a fun Clash of the Titans vibe with exciting monsters in every book! You'll meet centaurs, Cerberus, cyclopes, ghosts, giants, harpies, the living dead, Greek Gods, and more... even the Titans themselves!Want a FREE SAMPLE? Click \"Look Inside\" to read in your browser or \"Send a Free Sample\" to download it directly to your device.Who will enjoy it?Fans of Dystopian FictionFans of Urban FantasyFans of Greek Mythology looking for a Fresh, Modern Take on Ancient Greece and Greek MythFans of Superhero Fiction (Book 1 is the \"origin\" story and Andrus continues to develop his powers throughout the series, as do the other heroes)Fans of Young Adult FictionFans of Vibrant Character-Driven Novels with Incredible World-BuildingWho are the main heroes?Andrus is an athletic, handsome loner more interested in his hobbies than people. He comes from a wealthy family—a family who risk losing everything if their son's magic is revealed.The shy but brilliant Mark is a priest-in-training and classmate of Andrus. He comes from the poor side of town and has had to fight for what little position he has. Fate forces him to unite with Andrus against a mutual enemy.Hannah is a half-human witch, a mysterious outlaw on a secret mission from the Gods of Mount Olympus. She needs to recruit Andrus to help her defeat the Titans so the Gods can return to Earth. Hannah is a strong female character Andrus and Mark come to rely on.Who are the main villains?Gyges, an immortal giant with fifty heads and a hundred hands who leads Cronus' monster army.Nessus, a vicious human-hating centaur who wants revenge on the heroes for humiliating him.Cronus, King of the Titans, ruler of Earth and slayer of Gods. While Hades remains imprisoned, he rules the Greek underworld unchallenged.",
  "genres": [],
  "author": "Daniel Mignault",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/41569508-titan"
}