{
  "title": "The Prisoner",
  "description": "\"No one knows for certain why the ground of the mountain moves or why it speaks. What we do know is that where it moves, it speaks and where it speaks, it moves.\" - Orook, First Engineer of Pegasea  ------------------------------------------ Maria is an American graduate student lured to the planet of Olrona by the naverkoo, a mysterious entity with a nearly limitless power to create and transform life. In what she believes to be a dream, she walks onto an inter-planetary transport ship and is taken to the secluded mountain city of Pegasea on the planet of Olrona.  The highly evolved people of Pegasea struggle to maintain their population despite a dire shortage of Pegasean women. In order to avoid social strife as they face inevitable extinction, they live under a strict set of social rules known as the Pegasean Rules of Order and Etiquette (or \"PROEs”), which quickly become the bane of Maria’s existence as she tries to adapt to life in this alien city.  Long before Maria arrived on Olrona, human women from Earth were initially brought to Pegasea with the hope that cross-breeding would be possible. When such efforts proved fruitless, the women from Earth were incorporated into Pegasean society in such a way which allows them to live in peace and comfort, but with few legal rights. Believed to be ill-suited for life on their own, they are assigned to Pegasean \"keepers\" who are responsible for caring for them and keeping them out of trouble.  Shortly after arriving in Pegasea, Maria is matched with a Pegasean man named \"Orook,\" the city's First Engineer. Orook is cold, rigid, and has little use for, or interest in, human women. However, like all Pegasean men, he is cordial and dutiful. After Maria prevents a vengeful vocunine from trapping him in a cave, Orook confides in Maria, expressing his longing to know his son, whom he is not permitted to meet until the child comes of age. This connection, however, is fleeting as Orook continues to mostly ignore Maria, who is still haunted in her dreams by the naverkoo. Bored and lonely, Maria trespasses into the Pegasean nursery, which is strictly off limits to unauthorized personnel, and especially to humans. As Maria's keeper, Orook is held responsible for Maria's transgressions. As punishment, he is suspended from work for two weeks and ordered to spend this time helping his companion become oriented to the ways of the city. Over time, Orook and Maria form a tentative bond. Despite his relentless arrogance, Maria finds comfort in Orook’s confident and commanding presence and admires his intellect and integrity.  While the Pegaseans suffer from a multitude of emotional voids, the deepest of these is the one left by the vocunine, a lupine species which abandoned them over a 1,000 years ago. When a formidable species of predator invades the valley, the First Sociologist, Pullmoo, orchestrates a plan to reconnect the mountain vocunine with the people of Pegasea. As her plan unfolds, Maria receives an unexpected summons, requesting that she accompany the First Guardsman into the Eye of Olrona. Orook is skeptical of their motives and concerned for Maria’s safety, but leaves the decision to Maria. Ultimately, Maria agrees to go into the mountain, where she at last comes fact-to-face with the naverkoo. The naverkoo makes an unexpected request of Maria and offers Maria an unexpected gift in exchange.",
  "genres": [
    "Science Fiction",
    "Fiction"
  ],
  "author": "Sara Allyn",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/41573847-the-prisoner"
}