{
  "title": "Michelle: A Biography",
  "description": "She can be funny and sharp-tongued, warm and blunt, empathic and demanding. Who is the woman Barack Obama calls \"the boss\"? In Michelle, Washington Post writer Liza Mundy paints a revealing and intimate portrait, taking us inside the marriage of the most dynamic couple in politics today. She shows how well they complement each other: Michelle, the highly organized, sometimes intimidating, list-making pragmatist; Barack, the introspective political charmer who won't pick up his socks but shoots for the stars. Their relationship, like those of many couples with two careers and two children, has been so strained at times that he has had to persuade her to support his climb up the political ladder. And you can't blame her for occasionally regretting it: In this campaign, it is Michelle who has absorbed much of the skepticism from voters about Obama. One conservative magazine put her on the cover under the headline \"Mrs. Grievance.\"Michelle's story carries with it all the extraordinary achievements and lingering pain of America in the post-civil rights era. She grew up on the south side of Chicago, the daughter of a city worker and a stay-at-home mom in a neighborhood rocked by white flight. She was admitted to Princeton amid an angry debate about affirmative action and went on to Harvard Law School, where she was more comfortable doing pro-bono work for the poor than gunning for awards with the rest of her peers. She became a corporate lawyer, then left to train community leaders. She is modern in her tastes but likes to watch reruns of The Dick Van Dyke Show and The Brady Bunch.In this carefully reported biography, drawing upon interviews with more than one hundred people, including one with Michelle herself, Mundy captures the complexity of this remarkable woman and the remarkable life she has lived.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Politics",
    "Womens",
    "Presidents",
    "Adult"
  ],
  "author": "Liza Mundy",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/4158039-michelle"
}