{
  "title": "A Time Apart",
  "description": "They say, in time, true love comes to us all. But in what time, you just can never be sure.  It was the vacation from Hell. Dylan Foster was a middle-class Atlanta suburbanite vacationing with his family on Florida’s scenic Gulf Coast for a week. Only thing was, since they’d been there, they’d been trapped inside their beach house for four solid days by monsoon-like weather. And after four days in close quarters, Dylan needed to get out, if for nothing else, to get a coffee and donuts. For the truth was, despite all appearances, Dylan’s marriage to his wife Gina was slowly falling apart, as an extramarital affair, years of indifference and inability to compromise slowly ate away at the foundation. Being shut in with each other in such a claustrophobic situation only reminded them of the charade they were living. It was so bad he was willing to strike out in the midst of a drenching deluge to escape the discomfort.  But this storm was no ordinary storm, and its violent intensity soon had him regretting his decision. After an almost apocalyptic crash of lightning sent a mysterious jolt of energy coursing through him, he quickly sought shelter at the first place he came to, a run-down souvenir store on a strangely unfamiliar stretch of the beach. If that wasn’t peculiar enough, what he found really made him scratch his head. Like a VW microbus in the parking lot straight out of Woodstock. Or the fact that the inventory inside looked like it hadn’t been updated since Nixon was president. Even the beautiful young lady who owned the place looked like she’d just stepped off the screen of a campy 70’s sitcom.  But any port in a storm, right? And the young lady, Sadie had hot coffee and dry clothes, not to mention an infectious personality that made riding out the storm with her a lot quite pleasant. But as the afternoon fades to evening and the storm rages on, two become comfortable and more at ease. An inevitable attraction begins to develop between two very lonely people. And before the night is over, choices will be made that will ripple across both time and space with far-reaching consequences.  A Time Apart isn’t a sci-fi story. It’s a love story, first and foremost, with just the right twist of sci-fi to flavor it perfectly. Not too much and just enough to enjoy. Pop a top on one today and taste for yourself.",
  "genres": [],
  "author": "J. Morgan Woodall",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/41578709-a-time-apart"
}