{
  "title": "WYRD: The Wild & Weird Adventures of A + B, Part 1: Japan",
  "description": "A Real Life Fairy Tale for Grown ChildrenJoin Aleks & Boris on their magical journey around the world, as they meet interesting characters, get into crazy situations, and learn a little more about themselves and everything around them along the way.Excerpt. © Reprinted by permission. All rights reserved.WYRD: The Wild & Weird Adventures of A+BPart 1: Japan -1-\"Okay, this is it. No turning back now.\" Boris slowly tucked his iPhone back into his front, jean pocket. \"I ordered the Uber, he'll be here in six minutes.\" As we moved our backpacks towards the doorway, we did something that we both separately did growing up--took a seat before leaving on a trip. I always just wrote it off like any other kooky, Moldovan superstition, like not giving anyone a kiss over a threshold or not whistling inside the house, you know the normal stuff. But as I got older, I realized that, maybe, there was something more to it. Maybe, when we force our bodies into rest, it allows the mind to relax and jogs any forgotten memory (such as the iPhone charger or something less vital, like a passport). We took a long, deep breath in. Slow exhale.\"Okay, he's here.\" \"I can't believe this is happening, are you ready?\" \"Ready as I'll ever be.\" I remember the exact moment that I found out. I almost shattered the tempered-glass mug from four stories onto the Brooklyn asphalt. Here we were, having our ritual morning tea and wake-and-bake one hitter on the balcony of his one-bedroom, when he unloaded this bomb on me. Traveling was in my blood. It was my passion. It took nearly all of my mom's sly efforts and half-desperate attempts to keep me from escaping the confines of my comfy, New Jersey existence. I always had new fantasies of where to move or travel next. Every year, it would get farther and farther away. Less than a year before meeting Boris and I was already researching immigration policies in Singapore. Enough said. \"Hellooo? Are you there?\" \"Yeah, sorry, I zoned out.\" I had a way of daydreaming mid-conversation, a coping mechanism turned bad habit I picked up in childhood. \"You were saying.\" \"So, on that flight back from LA, as we were landing in JFK, the pilot, without warning, changed directions and we skyrocketed back into the air. Everyone was screaming, it was crazy. And ever since then, I can't fly.\" If he hadn't been him, it would've been a deal breaker for sure. Luckily, I had hope. And that hope led us here. Almost two years of marriage later and we would finally have our very first flight together. I could hardly wait. Boris, on the other hand...",
  "genres": [],
  "author": "Sasha Borya",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/41588650-wyrd"
}