{
  "title": "A Fistful of Shells: West Africa from the Rise of the Slave Trade to the Age of Revolution",
  "description": "By the time the “Scramble for Africa” among European colonial powers began in the late nineteenth century, Africa had already been globally connected for centuries. Its gold had fueled the economies of Europe and the Islamic world for nearly a millennium, and the sophisticated kingdoms spanning its west coast had traded with Europeans since the fifteenth century. Until at least 1650, this was a trade of equals, using a variety of currencies—most importantly, cowrie shells imported from the Maldives and nzimbu shells imported from Brazil. But, as the slave trade grew, African kingdoms began to lose prominence in the growing global economy. We have been living with the effects of this shift ever since. With A Fistful of Shells, Toby Green transforms our view of West and West-Central Africa by reconstructing the world of these kingdoms, which revolved around trade, diplomacy, complex religious beliefs, and the production of art. Green shows how the slave trade led to economic disparities that caused African kingdoms to lose relative political and economic power. The concentration of money in the hands of Atlantic elites in and outside these kingdoms brought about a revolutionary nineteenth century in Africa, parallel to the upheavals then taking place in Europe and America. Yet political fragmentation following the fall of African aristocracies produced radically different results as European colonization took hold.Drawing not just on written histories, but on archival research in nine countries, art, oral history, archaeology, and letters, Green lays bare the transformations that have shaped world politics and the global economy since the fifteenth century and paints a new and masterful portrait of West Africa, past and present.",
  "genres": [
    "History",
    "Africa",
    "Nonfiction",
    "Economics",
    "Politics",
    "Western Africa",
    "World History"
  ],
  "author": "Toby Green",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/41591019-a-fistful-of-shells"
}