{
  "title": "Stories of Elders: What the Greatest Generation Knows about Technology that You Don't",
  "description": "14th Annual National Indie Excellence® Awards Winner 2020 International Book Awards Finalist America’s Greatest Generation (born before 1945) witnessed incredible changes in technology and social progress. From simple improvements in entertainment to life-changing medical advances, technology changed the way they live, work, and identify. Sadly, with each passing year, fewer members of the Greatest Generation remain alive to share their wisdom as the last Americans to grow up before the digital revolution. In 2015, Millennial author and cultural anthropologist Veronica Kirin drove 12,000 miles across more than 40 states to interview the last living members of the Greatest Generation. Stories of Elders is the result of her years of work to capture and share their perspective for generations to come. Stories of Elders preserves the wisdom, thoughts, humor, knowledge, and advice of the people who make up one of America’s finest generations, including the Silent Generation. Their stories include the devastation that came from major events in U.S. history like World War I, the Dust Bowl, the Great Depression, and World War II. The Greatest Generation (many of whom are now centenarians) saw the routine use of airplanes, cars, microwave ovens, telephones, radios, electricity, and the Internet come to fruition in their lifetimes. Their childhoods were simple, relying on outdoors games and their imagination for fun. How they went to school, pursued their careers, and raised their kids was radically different than the way we live today. By chronicling more than 8,000 years of life lived during the most transitional time in American history, Stories of Elders offers old-fashioned wisdom and insight for America’s future generations. Chapter 1. Communication 2. War 3. Politics 4. Rights 5. Transportation 6. Energy & Amenities 7. Work 8. Medicine 9. Relationships 10. Food 11. Money 12. Poverty 13. Safety 14. Community 15. Generational Proximity 16. Family 17. Child Development 18. Religion & Integrity",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Veronica Kirin",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/41592628-stories-of-elders"
}