{
  "title": "Tell Your Children: The Truth About Marijuana, Mental Illness, and Violence",
  "description": "In “a brilliant antidote to all the…false narratives about pot” (American Thinker), an award-winning author and former New York Times reporter reveals the link between teenage marijuana use and mental illness, and a hidden epidemic of violence caused by the drug—facts the media have ignored as the United States rushes to legalize cannabis.Recreational marijuana is now legal in nine states. Advocates argue cannabis can help everyone from veterans to cancer sufferers. But legalization has been built on myths—that marijuana arrests fill prisons; that most doctors want to use cannabis as medicine; that it can somehow stem the opiate epidemic; that it is beneficial for mental health. In this meticulously reported book, Alex Berenson, a former New York Times reporter, explodes those myths, explaining that almost no one is in prison for marijuana; a tiny fraction of doctors write most authorizations for medical marijuana, mostly for people who have already used; and marijuana use is linked to opiate and cocaine use. Most of all, THC—the chemical in marijuana responsible for the drug’s high—can cause psychotic episodes. “Alex Berenson has a reporter’s tenacity, a novelist’s imagination, and an outsider’s knack for asking intemperate questions” (Malcolm Gladwell, The New Yorker), as he ranges from the London institute that is home to the scientists who helped prove the cannabis-psychosis link to the Colorado prison where a man now serves a thirty-year sentence after eating a THC-laced candy bar and killing his wife. He sticks to the facts, and they are devastating. With the US already gripped by one drug epidemic, Tell Your Children is a “well-written treatise” (Publishers Weekly) that “takes a sledgehammer to the promised benefits of marijuana legalization, and cannabis enthusiasts are not going to like it one bit” (Mother Jones).",
  "genres": [
    "Nonfiction",
    "Science",
    "Health",
    "Politics",
    "Parenting",
    "Medical",
    "Cultural"
  ],
  "author": "Alex Berenson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/41593468-tell-your-children"
}