{
  "title": "Pierce Me",
  "description": "I don’t fall to my death: I jump.There are these defying moments in everyone’s lives, those intense few seconds, or even less, when you have to make a decision with your heart, quicker than your brain is able to process things.And in those milliseconds, your heart makes up your mind for you.Your heart knows.Well, it always has known, it’s just that now you know too.Your stupid, stupid brain catches up.The day my father died, that was the day that my heart stopped believing in God.Two years later, when I was almost eighteen, the girl I had given my heart to, left me without a word of warning or explanation. That was the day that my heart stopped beating.And now, four years after that, this is what my heart does: It tells me to jump.I am standing on the edge of a cliff, in one of the most beautiful places in the world. But my heart is racing, my stomach is churning and cold sweat drenches the back of my neck. I look down. Ten meters or more of solid, jagged-sharp rocks and then a glittering emerald pool of water at the bottom.And also, she. She is at the bottom, in the water. In danger.She.The girl whose name I can’t even mention in my own private thoughts, or it will destroy me, the girl who ripped out my heart and ruined my life.That girl.In the water. Ten meters below the cliffs. And that’s when I know it.My body hits the cold, freezing water. It’s hard and solid like cement, and pain shoots up my entire body as the breath catches in my throat.And then there’s nothing.The pop idol. Everyone knows my name. Everyone knows my story, how I started from nothing and shot to stardom within the past year. I sell our stadiums within hours after announcing a new tour. I have everything, or so people think. What they don’t know is that everything is fake. My music, my success, my smiles. Even my name. I had to change it four years ago, when a girl broke my heart and ruined my life.I am starting a new tour in a few months, and I need at least five new songs. Problem is? I can’t write a single note. I am blocked.The hired help. I met her when we were both sad teens, each lost in our own tragedies. But with her, I came alive. We forged a bond that I thought would last a lifetime. I used to look at her and think that I could never stop. Then, one day, she told me she never wanted to see me again. And now, four years later? My team of assistants (ex-assistants, I should say, as they will all be fired soon) have hired an English lit student to help me out of my creative block. She is good, they say, she has won awards for her poetry. A genius of her generation.But when I see her? It’s her. The girl who destroyed me.The girl who stopped loving me on a whim and disappeared, taking my dreams with her.It’s four years later, and it’s four years too soon to be seeing her again.She pierced my heart.She ruined my life.I hate her.But when I look at her, she’s not the girl I hate: She is the girl who used to be my reason for existing.Pierce Me is a second-chance angsty romance about a pop idol and the girl who destroyed him. Prepare to be destroyed. The darkness will be off the charts with this one -but so will the hope be. So will the heat. And so will the love.Pierce Me is hate-to-love complete stand-alone. It’s an angsty rom com filled to the brim with darkness, romance and hopeTropes: pop idol romance, K pop idols, enemies to lovers, tortured boys, found family, Jane Austen retelling, Peter Pan angst, cute dog. CW for a lot of darkness and traumatic childhood events, but all of it lit up brightly by hope. Contact the author for a detailed list.Pierce Me has a HAE and no cliffhangers.",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "M.C. Frank",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/123453806-pierce-me"
}