{
  "title": "The First Wave: The D-Day Warriors Who Led the Way to Victory in World War II",
  "description": "The New York Times bestselling author of The Liberator and Avenue of Spies returns with an utterly immersive, adrenaline-driven account of D-Day combat. \"Meet the assaulters: Pathfinders plunging from the black, coxswains plowing the whitecaps, bareknuckle Rangers scaling sheer rock... Fast-paced and up-close, this is history's greatest story reinvigorated as only Alex Kershaw can.\"--Adam Makos, New York Times bestselling author of Spearhead and A Higher Call Beginning in the predawn darkness of June 6, 1944, The First Wave follows the remarkable men who carried out D-Day's most perilous missions. The charismatic, unforgettable cast includes the first American paratrooper to touch down on Normandy soil; the glider pilot who braved antiaircraft fire to crash-land mere yards from the vital Pegasus Bridge; the brothers who led their troops onto Juno Beach under withering fire; as well as a French commando, returning to his native land, who fought to destroy German strongholds on Sword Beach and beyond. Readers will experience the sheer grit of the Rangers who scaled Pointe du Hoc and the astonishing courage of the airborne soldiers who captured the Merville Gun Battery in the face of devastating enemy counterattacks. The first to fight when the stakes were highest and the odds longest, these men would determine the fate of the invasion of Hitler's Fortress Europe--and the very history of the twentieth century.The result is an epic of close combat and extraordinary heroism. It is the capstone Alex Kershaw's remarkable career, built on his close friendships with D-Day survivors and his intimate understanding of the Normandy battlefield. For the seventy-fifth anniversary, here is a fresh take on World War II's longest day.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military Fiction",
    "Military History",
    "American History"
  ],
  "author": "Alex Kershaw",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/41642753-the-first-wave"
}