{
  "title": "The Wizard of Menlo Park: How Thomas Alva Edison Invented the Modern World",
  "description": "At the height of his fame Thomas Alva Edison was hailed as “the Napoleon of invention” and blazed in the public imagination as a virtual demigod. Newspapers proclaimed his genius in glowing personal profiles and quipped that “the doctor has been called” because the great man “has not invented anything since breakfast.” Starting with the first public demonstrations of the phonograph in 1878 and extending through the development of incandescent light, a power generation and distribution system to sustain it, and the first motion picture cameras—all achievements more astonishing in their time than we can easily grasp today—Edison’s name became emblematic of all the wonder and promise of the emerging age of technological marvels.But as Randall Stross makes clear in this critical biography of the man who is arguably the most globally famous of all Americans, Thomas Edison’s greatest invention may have been his own celebrity. Edison was certainly a technical genius, but Stross excavates the man from layers of myth-making and separates his true achievements from his almost equally colossal failures. How much credit should Edison receive for the various inventions that have popularly been attributed to him—and how many of them resulted from both the inspiration and the perspiration of his rivals and even his own assistants? How much of Edison’s technical skill helped him overcome a lack of business acumen and feel for consumers’ wants and needs?This bold reassessment of Edison’s life and career answers these and many other important questions while telling the story of how he came upon his most famous inventions as a young man and spent the remainder of his long life trying to conjure similar success. We also meet his partners and competitors, presidents and entertainers, his close friend Henry Ford, the wives who competed with his work for his attention, and the children who tried to thrive in his shadow—all providing a fuller view of Edison’s life and times than has ever been offered before. The Wizard of Menlo Park reveals not only how Edison worked, but how he managed his own fame, becoming the first great celebrity of the modern age.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Business",
    "Science",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Randall E. Stross",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/416422.The_Wizard_of_Menlo_Park"
}