{
  "title": "Estimate, Guess, or Promise?",
  "description": "Estimate, Guess, or Promise? by Douglas R. AllenA construction operation is like a three-legged stool. The three legs - getting the work, doing the job, and keeping score - are of equal importance and if each perform the stool functions. If these three concepts work in harmony within a construction company, then success is on the horizon! The \"getting the work\" leg offers the most significant challenge because without it, the other two legs don't happen.Estimate, Guess, or Promise? outlines a proven process for preparing estimates and proposals that win, reduce bidding stress, and prepare the contractor for the next step of doing the work. The step-by-step process utilizes the resources of your team, identifies and addresses risk, assists in developing a competitive advantage, and ends those moments of insecurity about what might not have made it on the bid. You no longer have merely an \"estimate,\" but rather a professional process that ensures accuracy and increases your chances significantly!About the AuthorDouglas Ray Allen is a former contractor with just shy of twenty years of experience in contracting. In early 2000, he started out on his own winning his first government contract with the United States Air Force. He has owned and operated multiple businesses including a contracting firm out of Las Vegas, Nevada that performed construction projects all over the United States for the Department of Defense and other government agencies. In 2016, he sold his interest in this operation and now serves as a forensic accountant working with sureties on bonded construction projects.Douglas is a Certified Management Accountant holding both an undergraduate and graduate degree in accounting from Saint Leo University just outside of Tampa, Fl. He currently resides with his wife and daughter in Tampa, Fl and still consults with small business contractors attempting to procure government contracts.",
  "genres": [],
  "author": "Douglas R Allen",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/41644856-estimate-guess-or-promise"
}