{
  "title": "Intersex",
  "description": "“In Hillman’s world, the surer you become about who you are, the more vulnerable you get.”— The San Francisco Bay Guardian “Hillman’s writing is sexy because it’s smart and refuses to simplify things.”— Fabula Magazine \"Hillman's utterly unabashed memoir...showcases both the personal, embodied realities of intersex, and the social and political milieus that shape them... Intersex, too, is gorgeously written.\"—Women's Review of Books \"It's utterly impossible to not be spellbound by performer-activist Thea Hillman, in person or in print ... A must-read.\"—Curve “There’s nothing else in print like this amazing and courageous book.”—Patrick Califia, author of Sex Changes: The Politics of Transgenderism “An important and wonderfully disarming book. Poetic, political, and deeply personal.”—Beth Lisick, author of Helping Me Help Myself Intersex (For Lack of a Better Word) chronicles one person’s search for self in a world obsessed with normal. What is “intersex”? According to the Intersex Society of North America, the word describes someone born with sex chromosomes, genitalia, or an internal reproductive system that are neither clearly male nor clearly female. In first-person prose as intimate as a diary, Thea Hillman redefines memoir in a series of compelling stories that take a no-holds-barred look at sex, gender, family, and community. Whether she’s pondering quirky family tendencies (“Drag”), reflecting on “queerness” (“Another”), or recounting scintillating adventures in San Francisco’s sex clubs, Hillman’s brave and fierce vision for cultural and societal change shines through. According to a special report by the Traditional Values Coalition entitled “Homosexual Urban Myth,” award-winning writer Thea Hillman is a radical who conducts erotic readings to promote the “homosexual revolution.” Thea offers presentations about sex and gender and performs her work at colleges and festivals around the country. She lives in Oakland, California.",
  "genres": [
    "Memoir",
    "Queer",
    "Nonfiction",
    "LGBT",
    "Gender",
    "Intersex",
    "Biography"
  ],
  "author": "Thea Hillman",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/4166120-intersex"
}