{
  "title": "Sherlock Holmes: A Question of Time",
  "description": "\"A Question of Time\" pays homage to three great Victorian characters of literary fiction: Sir Arthur Conan Doyle’s Sherlock Holmes and Dr. James Watson—with a sly aside to a nefarious criminal—and the Time Traveler of H.G. Wells’ The Time Machine.\"I ask for your pardon. Even now, I hesitate to put pen to paper. During my years chronicling the many amazing adventures of Sherlock Holmes, I have never doubted their veracity. But this time, were it not for the results of my own feeble efforts at detection, I would wholly attribute the events described as phantasms of a fevered dream suffered by Holmes or one of his more elaborate jests.Flipping through my notes from that day leaves me perplexed. Was any of it real? That is for you, the reader, to decide.\" - J. Watson On concluding a long day of house calls, Dr. Watson receives an urgent summons to attend his friend, Sherlock Holmes. He arrives at 221B Baker Street to find Holmes in a state of deep shock and wearing scorched clothing that reeks of excrement. Fearing his friend may have been exposed to a virulent contagion, Watson must race against time to retrace Holmes' movements and discover the source of his debility, a race that leads him to a cesspit amid the ruins of a fire-gutted warehouse, and a mysterious unburned area amid the charred timbers.Back in his apartment, a convalescing Holmes unravels the mystery by relating his encounter in the riverside warehouse with a time traveler, who recounts his amazing exploits in the world's far future. After promising to contact Holmes in two years, the Time Traveler attempts to return to his own time, but his time machine malfunctions, resulting in a fire that eliminates all evidence of his existence. Dazed and in deep shock, Holmes manages to escape the flames and make his way back to his lodgings.While Holmes' recounting of the Time Traveler's adventures at first astonish and excite Watson, the stream of strange events―the Eloi, the Morlocks, the Palace of Green Porcelain, world-wide cataclysms, and a far-flung future devoid of human life―make him doubt the story.With the lack of physical evidence and only Holmes' account of what transpired, Watson―hounded by demons from his own troubled past―must determine if Holmes met an actual time traveler, or if the related events are a fabrication of Holmes' fevered imagination.",
  "genres": [],
  "author": "Glenn Searfoss",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/123454894-sherlock-holmes"
}