{
  "title": "The Death of Politics: How to Heal Our Frayed Republic After Trump",
  "description": "The New York Times opinion writer, media commentator, outspoken Republican and Christian critic of the Trump presidency offers a spirited defense of politics and its virtuous and critical role in maintaining our democracy and what we must do to save it before it is too late. “Any nation that elects Donald Trump to be its president has a remarkably low view of politics.”Frustrated and feeling betrayed, Americans have come to loathe politics with disastrous results, argues Peter Wehner. In this timely manifesto, the veteran of three Republican administrations and man of faith offers a reasoned and persuasive argument for restoring “politics” as a worthy calling to a cynical and disillusioned generation of Americans.Wehner has long been one of the leading conservative critics of Donald Trump and his effect on the Republican Party. In this impassioned book, he makes clear that unless we overcome the despair that has caused citizens to abandon hope in the primary means for improving our world—the political process—we will not only fall victim to despots but hasten the decline of what has truly made America great. Drawing on history and experience, he reminds us of the hard lessons we have learned about how we rule ourselves—why we have checks and balances, why no one is above the law, why we defend the rights of even those we disagree with.Wehner believes we can turn the country around, but only if we abandon our hatred and learn to appreciate and honor the unique and noble American tradition of doing “politics.” If we want the great American experiment to continue and to once again prosper, we must once more take up the responsibility each and every one of us as citizens share.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Audiobook",
    "Political Science",
    "Philosophy"
  ],
  "author": "Peter Wehner",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/41716677-the-death-of-politics"
}