{
  "title": "All Secure: One Delta Force Operator's Fight From the Battlefield to the Homefront",
  "description": "As a senior non-commissioned officer of Delta Force, the most elite and secretive special operations unit in the U.S. military, Command Sergeant Major Tom Satterly fought some of this country's most fearsome enemies. Over the course of twenty years and thousands of missions, he's fought desperately for his life, rescued hostages, killed and captured terrorist leaders, and seen his friends maimed and killed around him.All Secure is in part Tom's journey into a world so dark and dangerous that most Americans can't contemplate its existence. It recounts what it is like to be on the front lines with one of America's most highly trained warriors. As action-packed as any fiction thriller, All Secure is an insider's view of \"The Unit.\"Tom is a legend even among other Tier One special operators. Yet the enemy that cost him three marriages, and ruined his health physically and psychologically, existed in his brain. It nearly led him to kill himself in 2014; but for the lifeline thrown to him by an extraordinary woman it might have ended there. Instead, they took on Satterly's most important mission-saving the lives of his brothers and sisters in arms who are killing themselves at a rate of more than twenty a day.Told through Satterly's firsthand experiences, it also weaves in the reasons-the bloodshed, the deaths, the intense moments of sheer terror, the survivor's guilt, depression, and substance abuse-for his career-long battle against the most insidious enemy of all: Post Traumatic Stress. With the help of his wife, he learned that by admitting his weaknesses and faults he sets an example for other combat veterans struggling to come home.",
  "genres": [
    "Military Fiction",
    "Biography",
    "Memoir",
    "Nonfiction",
    "War",
    "Military History"
  ],
  "author": "Tom Satterly",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/41717514-all-secure"
}