{
  "title": "Coolidge",
  "description": "Calvin Coolidge, who served as president from 1923 to 1929, never rated highly in polls. The shy Vermonter, nicknamed \"Silent Cal,\" has long been dismissed as quiet and passive. History has remembered the decade in which he served as a frivolous, extravagant period predating the Great Depression. Now Amity Shlaes, the author known for her riveting, unexpected portrait of the 1930s, provides a similarly fresh look at the 1920s and its elusive president. Shlaes shows that the mid-1920s was, in fact, a triumphant period that established our modern way of life: the nation electrified, Americans drove their first cars, and the federal deficit was replaced with a surplus. Coolidge is an eye-opening biography of the little-known president behind that era of remarkable growth and national optimism.Although Coolidge was sometimes considered old-fashioned, he was the most modern of presidents, advancing not only the automobile trade but also aviation, through his spirited support of Charles Lindbergh. Coolidge's discipline and composure, Shlaes reveals, represented not weakness but strength. First as governor of Massachusetts then as president, Coolidge proved unafraid to take on the divisive issues of this crucial period: reining in public-sector unions, unrelentingly curtailing spending, and rejecting funding for new interest groups.Perhaps more than any other president, Coolidge understood that doing less could yield more. He reduced the federal budget during his time in office even as the economy grew, wages rose, tax rates fell, and unemployment dropped. As a husband, father, and citizen, the thirtieth president made an equally firm commitment to moderation, shunning lavish parties and special presidential treatment; to him the presidency was not a bully pulpit but a place for humble service. Overcoming private tragedy while in office, including the death of a son, Coolidge showed the nation how to persevere by persevering himself. For a nation looking for a steady hand, he was a welcome pilot.In this illuminating, magisterial biography, AmityShlaes finally captures the remarkable story of Calvin Coolidge and the decade of extraordinary prosperity that grew from his leadership.",
  "genres": [
    "Biography",
    "History",
    "Presidents",
    "Nonfiction",
    "Politics",
    "American History",
    "Us Presidents"
  ],
  "author": "Amity Shlaes",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/12345967-coolidge"
}