{
  "title": "Waiting for Sunrise",
  "description": "Vienna. 1913. It is a fine day in August when Lysander Rief, a young English actor, walks through the city to his first appointment with the eminent psychiatrist, Dr. Bensimon. Sitting in the waiting room he is anxiously pondering the nature of his problem when an extraordinary woman enters. She is clearly in distress, but Lysander is immediately drawn to her strange, hazel eyes and her unusual, intense beauty.Later the same day they meet again, and a more composed Hettie Bull introduces herself as an artist and sculptor, and invites Lysander to a party hosted by her lover, the famous painter Udo Hoff. Compelled to attend and unable to resist her electric charm, they begin a passionate love affair. Life in Vienna becomes tinged with the frisson of excitement for Lysander. He meets Sigmund Freud in a café, begins to write a journal, enjoys secret trysts with Hettie and appears to have been cured.London, 1914. War is stirring, and events in Vienna have caught up with Lysander. Unable to live an ordinary life, he is plunged into the dangerous theatre of wartime intelligence – a world of sex, scandal and spies, where lines of truth and deception blur with every waking day. Lysander must now discover the key to a secret code which is threatening Britain’s safety, and use all his skills to keep the murky world of suspicion and betrayal from invading every corner of his life.Moving from Vienna to London’s west end, the battlefields of France and hotel rooms in Geneva, Waiting for Sunrise is a feverish and mesmerising journey into the human psyche, a beautifully observed portrait of wartime Europe, a plot-twisting thriller and a literary tour de force from the bestselling author of Any Human Heart, Restless and Ordinary Thunderstorms.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Book Club",
    "Thriller",
    "Historical",
    "Espionage"
  ],
  "author": "William  Boyd",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/12345981-waiting-for-sunrise"
}