{
  "title": "How to Love a Country",
  "description": "A new collection from the renowned inaugural poet exploring immigration, gun violence, racism, LGBTQ issues, and more, in accessible and emotive versesAs presidential inaugural poet, memoirist, public speaker, educator, and advocate, Richard Blanco has crisscrossed the nation inviting communities to connect to the heart of human experience and our shared identity as a country. In this new collection of poems, his first in over seven years, Blanco continues to invite a conversation with all Americans. Through an oracular yet intimate and accessible voice, he addresses the complexities and contradictions of our nationhood and the unresolved sociopolitical matters that affect us all.The poems form a mosaic of seemingly varied topics: the Pulse Nightclub massacre; an unexpected encounter on a visit to Cuba; the forced exile of 8,500 Navajos in 1868; a lynching in Alabama; the arrival of a young Chinese woman at Angel Island in 1938; the incarceration of a gifted writer; and the poet's abiding love for his partner, who he is finally allowed to wed as a gay man. But despite each poem's unique concern or occasion, all are fundamentally struggling with the overwhelming question of how to love this country.Seeking answers, Blanco digs deep into the very marrow of our nation through poems that interrogate our past and present, grieve our injustices, and note our flaws, but also remember to celebrate our ideals and cling to our hopes. In the landmark poem \"American Wandersong,\" which forms the center of the book, the poet reveals himself to readers in a disarming and kinetic sequence of stanzas, striving to find his place amid the physical and emotional landscapes of our country.Through this groundbreaking volume, Blanco unravels the very fabric of the American narrative and pursues a resolution to the inherent contradiction of our nation's psyche and mandate: e pluribus unum (out of many, one). Charged with the utopian idea that no single narrative is more important than another, this book asserts that America could and ought someday to be a country where all narratives converge into one, a country we can all be proud to love and where we can all truly thrive.",
  "genres": [
    "Poetry",
    "LGBT",
    "Politics",
    "Nonfiction",
    "History",
    "Queer",
    "Social Justice"
  ],
  "author": "Richard Blanco",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/41709830-how-to-love-a-country"
}