{
  "title": "Come From Away: Welcome to the Rock: An Inside Look at the Hit Musical",
  "description": "Come From Away: Welcome to the Rock - a fully illustrated companion volume to the hit Tony Award-winning Broadway musical, featuring the book and lyrics for the first time in print, backstage stories and the real history behind the show's events, character design sketches, and songs that ended up on the cutting room floor.\n\n\nThe Tony Award-winning Broadway musical Come From Away tells the remarkable true story of a small town that welcomed the world. On September 11, 2001, 38 planes and 6,579 passengers were forced to land in the provincial town of Gander, Newfoundland. The local residents opened their arms to the displaced visitors, offering food, shelter, and friendship. In the days that followed, cultures clashed and nerves ran high, but uneasiness turned into trust, music soared into the night, and gratitude grew into enduring friendships. \n\nCome From Away: Welcome to the Rock is the ultimate companion piece to Irene Sankoff and David Hein's smash-hit musical based on that extraordinary experience. Featuring the complete book and lyrics for the first time in print, a foreword by Canadian Prime Minister Justin Trudeau, and exclusive photos of the company and physical production, this essential companion also includes original interviews with passengers, Gander residents, and the actors who portray them. The narrative by theater historian Laurence Maslon details the events of that memorable and challenging week and also traces the musical's development from the ten-year reunion of residents and airline passengers in Gander, where the idea for the musical was born , to the global phenomenon it is today. \n\nCome From Away: Welcome to the Rock gives an unprecedented look behind the curtain and demonstrates why the story has touched so many so deeply: Because we come from everywhere, we all come from away.",
  "genres": [
    "Nonfiction",
    "Theatre",
    "Music",
    "History",
    "Plays",
    "Musicals",
    "Canada"
  ],
  "author": "Irene Sankoff",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/41716911-come-from-away"
}