{
  "title": "Bitten: The Secret History of Lyme Disease and Biological Warfare",
  "description": "A riveting thriller reminiscent of The Hot Zone, this true story dives into the mystery surrounding one of the most controversial and misdiagnosed conditions of our time-Lyme disease-and of Willy Burgdorfer, the man who discovered the microbe behind it, revealing his secret role in developing bug-borne biological weapons, and raising terrifying questions about the genesis of the epidemic of tick-borne diseases affecting millions of Americans today.While on vacation on Martha's Vineyard, Kris Newby was bitten by an unseen tick. That one bite changed her life forever, pulling her into the abyss of a devastating illness that took ten doctors to diagnose and years to recover: Newby had become one of the 300,000 Americans who are afflicted with Lyme disease each year.As a science writer, she was driven to understand why this disease is so misunderstood, and its patients so mistreated. This quest led her to Willy Burgdorfer, the Lyme microbe's discoverer, who revealed that he had developed bug-borne bioweapons during the Cold War, and believed that the Lyme epidemic was started by a military experiment gone wrong.In a superb, meticulous work of narrative journalism, Bitten takes readers on a journey to investigate these claims, from biological weapons facilities to interviews with biosecurity experts and microbiologists doing cutting-edge research, all the while uncovering darker truths about Willy. It also leads her to uncomfortable questions about why Lyme can be so difficult to both diagnose and treat, and why the government is so reluctant to classify chronic Lyme as a disease.A gripping, infectious page-turner, Bitten will shed a terrifying new light on an epidemic that is exacting an incalculable toll on us, upending much of what we believe we know about it.",
  "genres": [
    "Nonfiction",
    "Science",
    "Health",
    "History",
    "Medical",
    "Medicine",
    "Audiobook"
  ],
  "author": "Kris Newby",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/41716698-bitten"
}