{
  "title": "Modern Disciples: Volume 1",
  "description": "The children of the gods walk among us, and their cold war has just begun.Enter a world where the Greek, Norse, Japanese, Hindu, and many other Pantheons of gods are all real. They would never openly admit it, but they have been having children with mortals despite their pact to withdraw themselves from our world. These children, known as Disciples, have never known their true heritage. When the ancient enemies of the gods escape their prison, the gods call upon their disciples to investigate any activity that may have been orchestrated against the gods and humanity. These investigations very often lead to intrigue and always lead to danger. Fortunately being the child of a god comes with many perks, including supernatural abilities. Unfortunately the gods have been known to bicker. Disagreements have turned to hatred, and rivalries have become deadly. When gods from different pantheons are thrown into the mix, matters only get worse. Disciples are not immune from this. In Volume One, a group of six disciples are brought together to stop an indestructible beast that lives deep within the Florida everglades. They must not only deal with other monsters and an unknown force that is plotting their demise, but their own conflicting personalities. A love triangle will form, convictions will be put to the test, and the bitter truth that even gods and their children have rules, will all create drama and conflict. Never before have all these mythologies been combined in one story. Modern Disciples is an epic tale of six people who are given great privilege and with it a great burden. This dark and gritty, yet often humorous depiction of a world where order struggles against chaos, is sure to tempt you to skip ahead to see how the characters use their wits to escape unimaginable situations. As you see the story unfold from the perspective of one of the characters, you will be drawn in and feel like you are standing next to the characters as they struggle with their responsibilities. You will feel their pain, frustration, joy, and triumph. \nThe epic tale begins.",
  "genres": [
    "Urban Fantasy",
    "Mythology",
    "Fantasy",
    "Fiction"
  ],
  "author": "I.S. Anderson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12346708-modern-disciples"
}