{
  "title": "Fated for You",
  "description": "I hate him.Someone I’ve loved my entire life hurt me deliberately. I never thought it’d be him that would destroy my heart out of all the guys on this planet, but he did. At one time he was one of my best friends. Where his sister was shy he was more like me, and it made things between us easy. From secret forts made out of chairs and blankets to pretending we were pirates on our parents’ yacht, I always thought he’d be the one. We’d grow up and he’d realize how perfect for each other we are. Our pretend weddings still live vibrantly in my mind. Every old notebook has doodles of our names in hearts scribbled on the pages.But then the inevitable happened. We grew up. Things didn’t turn out the way I thought they would. Another girl caught his eye and suddenly I was just his little sister’s best friend. I’ve been trying hard to get his attention ever since. Makeup. Revealing clothes. Hair always perfect. Hook-ups with guys I care nothing about. None of it works. He walks right past me as if I’m just a body occupying space. And to me, he was everything. Even the current version of him—heartbroken.One night over Christmas break everything changed. For the good. For the bad. One night of my existence all of my dreams came true. But just like in the fairytale it came to an end. I was left with nothing but a gaping hole in my chest. It changed me. Then graduation came. My plans changed. You know what they say—to get over someone you get under someone else. That’s what I intend to do.College is here. Destination—Miami. South Beach—here I come. A place where the parties never end and there is never a shortage of hot guys. But the thing about fairytales—they tend to end exactly where you started.Please Fated for You and Fated for Me can be read as a standalone duet within the fate series, but it must be read before any of the following books as bandmate books follow a timeline.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Contemporary"
  ],
  "author": "Charisse Spiers",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/41726774-fated-for-you"
}