{
  "title": "The Price of Happiness",
  "description": "The royal court has always been a realm of intrigue, conspiracy, death and sorrow. You didn’t expect to be spared, did you Lilian? A sinister conspiracy against the King is gaining momentum, with Lilian and her family in the epicenter of this deadly game. Meanwhile Count Jess Earton himself, vigilant and dissatisfied, has arrived at the royal palace. The family reunion Lillian has been dreading has finally arrived. She has had enough time to prepare, to plan and consider all her options. King Edward is on her side, as are the Khangans and the Virmans… So why is her stomach in knots, why are her knees shaking and her heart pounding loud in her chest? On the eve of her meeting with Jess, Lilian's affections from her previous life resurface. Thank Aldonai that at the masquerade, it is easy to cover your personality and feelings with a mask of indifference. “The Price of Happiness” is the fifth but not the final book in the bestselling Medieval Tale series by Lina J. Potter. She has already conquered the hearts of thousands of readers, both male, and female, and has a loyal international fan basis. This volume centres on romance more than previously seen in the Medieval Tale series but nevertheless remains the beloved historical fiction of Countess Lilian and the Kingdom of Ativerna. It is an epic fantasy story about choosing your own path, struggling for happiness and carving an alternative path through history. The story of Lilian’s second chance is at it's peak. Knots will be untangled as she faces the kings, politicians and rivalling entities all warring for power. Until now, every step Lilian has taken has been discreet and with careful measure, but even that was not enough to avoid the attention of several nations. Medieval ages are those of cruelty, a time of chaos and distress. No matter if you are a friend or a foe, a family member or a villain, if you are loved or you are lost, expect no mercy and no sympathy. This is all just a heavy load for strong but kind and compassionate Lily. She can only try to cope with the disastrous consequences of the race for power. After all, she is a medic and saving lives is what she is good at, what she was taught to do, what she swore to do.",
  "genres": [
    "Fantasy",
    "Time Travel",
    "Historical",
    "Medieval",
    "Fiction",
    "Romance",
    "Historical Fiction"
  ],
  "author": "Lina J. Potter",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/41722270-the-price-of-happiness"
}