{
  "title": "After The Benediction",
  "description": "After the Benediction will take you on an extraordinary journey…  Evangelist Jacey Joyner is loved and admired by as many people who envy her. To the untrained eye she appears to have it altogether; a beautiful family, a thriving ministry, and people to fawn over her. However, after the benediction; she struggles immensely with her own reality, to the point that she is haunted by a suicidal presence. Her refusal to forgive her father, former Bishop Jason Loftin for his thoughtless and scandalous acts, sows grave seeds of bitterness within her that threaten to destroy her relationship with God, her family, and her ministry.  Unable to continue carrying the weighty load of people’s expectations, Jacey is on the verge of simply walking away from it all. However, an ordained encounter with a spiritual eye that is capable of seeing beyond her facade and is unmoved by her title and accomplishments, confronts her with truth, love and kindness. Will pride keep Jacey from accepting the truth about her spiritual stagnancy? Or will she have an ear to hear the voice of wisdom and instruction that will rekindle her passion for God and for ministering to his people?  Sherabim Allen is a licensed evangelist in the Church of God in Christ. She is also a motivational speaker, and has been a guest presenter at the Anthem Institute, located in Jersey City NJ, the Y.L.A.C.D Division of the University of Texas at Arlington, The University Charter Academy, Jersey City, NJ, Rutgers University, New Brunswick, NJ Lamba Theta Alpha Sorority, YCS FT Lee Educational Facility, Fort Lee, NJ, and many women and youth empowerment events. She is also the author of, “Heart of a Woman: Motherhood, Marriage, Ministry, and Money”, “Life Won’t Wait”, and co-author of “A Mother’s Love. “After the Benediction”, is her first novel. Her second novel “Mema’s Pretty Little Black Girls” will be released by the end of 2018 along with her first children’s book entitled “Manny and the Magic Keys.”",
  "genres": [],
  "author": "Sherabim Joy",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/41728698-after-the-benediction"
}