{
  "title": "The Lines Between Us: Two Families and a Quest to Cross Baltimore’s Racial Divide",
  "description": "A masterful narrative—with echoes of Evicted and The Color of Law—that brings to life the structures, policies, and beliefs that divide usMark Lange and Nicole Smith have never met, but if they make the moves they are contemplating—Mark, a white suburbanite, to West Baltimore, and Nicole, a black woman from a poor city neighborhood, to a prosperous suburb—it will defy the way the Baltimore region has been programmed for a century. It is one region, but separate worlds. And it was designed to be that way.In this deeply reported, revelatory story, duPont Award–winning journalist Lawrence Lanahan chronicles how the region became so highly segregated and why its fault lines persist today. Mark and Nicole personify the enormous disparities in access to safe housing, educational opportunities, and decent jobs. As they eventually pack up their lives and change places, bold advocates and activists—in the courts and in the streets—struggle to figure out what it will take to save our cities and Put money into poor, segregated neighborhoods? Make it possible for families to move into areas with more opportunity?The Lines Between Us is a riveting narrative that compels reflection on America's entrenched inequality—and on where the rubber meets the road not in the abstract, but in our own backyards. Taking readers from church sermons to community meetings to public hearings to protests to the Supreme Court to the death of Freddie Gray, Lanahan deftly exposes the intricacy of Baltimore's hypersegregation through the stories of ordinary people living it, shaping it, and fighting it, day in and day out.This eye-opening account of how a city creates its black and white places, its rich and poor spaces, reveals that these problems are not intractable; but they are designed to endure until each of us—despite living in separate worlds—understands we have something at stake.",
  "genres": [
    "Nonfiction",
    "Race",
    "History",
    "Book Club",
    "Social Justice",
    "Audiobook",
    "Politics"
  ],
  "author": "Lawrence Lanahan",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/41718285-the-lines-between-us"
}