{
  "title": "The Great Escape from Stalag Luft III: The Full Story of How 76 Allied Officers Carried Out World War II's Most Remarkable Mass Escape",
  "description": "The true story of one of the most heroic feats of World War II...the daring prison camp breakout that inspired the classic film The Great Escape.Stalag Luft III was one of the Germans' \"escape-proof\" prison camps, specially built by Hermann Göring to hold Allied troops. But on March 24, 1944, in a courageous attempt by two hundred prisoners to break out through a series of tunnels, seventy-six Allied officers managed to evade capture—and create havoc behind enemy lines in the months before the Normandy Invasion.This is the incredible story of these brave men who broke free from the supposedly impenetrable barbed wire and watchtowers of Stalag Luft III—and who played an important role in Allied intelligence operations within occupied Europe. The prisoners developed an intricate espionage network, relaying details of military deployment, bombings, and raids. Some of them were involved in other daring escape attempts, including the famous Wooden Horse episode, also turned into a classic film, and the little-known Sachsenhausen breakout, engineered by five Great Escapers sent to die in the notorious concentration camp on Hitler's personal orders. Tragically, fifty of those involved in the Great Escape were murdered by the Gestapo. Others were recaptured; only a few made it all the way to freedom. This dramatic account of personal heroism is a testament to their ingenuity and achievement—a stirring tribute to the men who never gave up fighting.Includes eight pages of photographs and illustrations, excerpts from Göring's testimony during postwar investigations, and a list of the men who escaped.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Military Fiction",
    "Military History",
    "War",
    "20th Century"
  ],
  "author": "Tim Carroll",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1234705.The_Great_Escape_from_Stalag_Luft_III"
}