{
  "title": "The Summer Guests",
  "description": "From the New York Times bestselling author of the Beach House series comes a heartwarming and evocative novel about the bonds and new beginnings that are born from natural disasters and how, even during the worst of circumstances—or perhaps because of them—we discover what is most important in life.Late August is a beautiful time on the Southern coast—the peach trees are ripe, the ocean is warm, and the sweet tea is icy. A perfect time to enjoy the rocking chairs on the porch. But beneath the calm surface bubbles a it’s also peak hurricane season.When a hurricane threatens the coasts of Florida and South Carolina, an eclectic group of evacuees flees for the farm of their friends Grace and Charles Phillips in North the Phillips’s daughter Moira and her rescue dogs, famed equestrian Javier Angel de la Cruz, makeup artist Hannah McLain, horse breeder Gerda Klug and her daughter Elise, and island resident Cara Rutledge. They bring with them only the few treasured possessions they can fit in their vehicles. Strangers to all but the Phillips, they must ride out the storm together.During the course of one of the most challenging weeks of their lives, relationships are put to the test as the evacuees are forced to confront the unresolved issues they have with themselves and with each other. But as the storm passes, they realize that what really matters isn’t what they brought with them to the mountains. Rather, it’s what they’ll take with them once they leave.With Mary Alice Monroe’s “usual resplendent storytelling” (Patti Callahan Henry, New York Times bestselling author), The Summer Guests is a poignant and compelling story of self-discovery, love, and redemption.",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Womens Fiction",
    "Southern",
    "Chick Lit",
    "Contemporary"
  ],
  "author": "Mary Alice Monroe",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/41745643-the-summer-guests"
}