{
  "title": "The Pigeon Has to Go to School",
  "description": "Una aventura del nostre colom preferit! El divertit i famós personatge de Mo Willems s’enfronta a una difícil situació: començar l’escola. Un llibre ple de diversió i enginy per treballar les pors i incerteses dels infants davant situacions desconegudes. - Aquest àlbum ha estat a la llista de best-sellers més venuts del New York Times durant onze setmanes seguides. - El personatge del colom va ser considerat pel New York Times Book Review com “una de les contribucions d'aquesta dècada al panteó dels grans personatges de llibres il·lustrats” Arriba un moment molt important en la vida del colom; començar l’escola, però ell no ho veu gens clar. “Què passa si no m’agrada l’escola?”, “Què passa amb el dinar?”, “Què pensaran de mi els altres ocells?”, “I si hi ha matemàtiques?”, “I si...” Tots els dubtes que té el colom ens seran ben familiars, ja que tots hem experimentat la sensació d’angoixa que acompanya un gran canvi; anar per primera vegada a l’escola, mudar-se a un nou barri o canviar de classe. Aquest àlbum ens ofereix una visió divertida i empàtica d’aquest procés d’acceptació de les pròpies pors i incerteses i com superar-les. L' Mo Willems Després de dedicar-se durant molts anys al sector televisiu dels dibuixos animats, on va guanyar sis premis Emmy mentre treballava a Barri Sèsam, en Mo va decidir dedicar-se més seriosament a la literatura infantil escrivint i il·lustrant llibres que han triomfat arreu del món. Manté una relació molt activa amb els seus lectors mitjançant diversos canals en línia i, durant el confinament de març del 2020, va realitzar i promoure una sèrie anomenada LUNCH DOODLES per estimular la creativitat dels infants sense necessitat de sortir de casa. ¿ Per què llegir aquest llibre? - Una història ideal per a treballar i conversar amb els infants sobre les seves pors davant noves situacions. - Ple d’optimisme i humor; impossible no riure! - Un llibre interactiu en el qual el lector establirà un autèntic diàleg amb el protagonista i es sentirà identificat amb la situació que experimenta.",
  "genres": [
    "Picture Books",
    "School",
    "Childrens",
    "Humor",
    "Animals",
    "Storytime",
    "Back To School"
  ],
  "author": "Mo Willems",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/41735921-the-pigeon-has-to-go-to-school"
}