{
  "title": "Blood and Magic",
  "description": "Meet Gray. Dhampir. Undead. Cursed. \n\n\n With supernatural powers and an insatiable need for blood, her existence is cursed. \n\nWhen Gray awakens from a three-year spell induced coma, she not only discovers her lover as the one responsible, but that he has joined with a dangerous organization known as the Consilium to help them create a new breed of hybrid demons. Humans and Witches are being taken against their will, and fear is growing throughout the covens.Gray never had a choice—forced to become a monster, the Dhampir. Yet after four hundred years, she still yearns for her humanity, like a long-lost echo from another life. She cannot allow the Consilium to do this to anyone else. With a renewed lust for vengeance, and a target on her back, Gray must use the one thing she swore never to in order to stop them—blood magic.Armed with a magical pirate ship, an immortal monk, and a flower plucked from the Underworld, Gray will stop at nothing to start a war. Yet in her quest to track down her enemies, she uncovers a dark family secret that threatens to destroy the last shred of humanity she has left.\"Melissa Sercia packs a punch with her debut novel with its rich world building and unique interpretation of gothic literature. It’s a must read if you’re looking for a fresh take on gothic fantasy.” – Science Fiction Author, Samantha Huewagen ★★★★★ \nAUTHOR INTERVIEW\n\nQ: Why do you write?\nA: When I was a kid, reading was a way for me to escape into magical worlds. I was about twelve years old when I first started writing and making up my own stories. It made me feel like I had a connection to the literary greats. Like I was in some sort of secret magical club. Today, I write to try and capture that magic in hopes to inspire writers and readers alike. To take my readers on a journey. An adventure. An escape. I write to breathe life into characters, to transport readers to fantasy settings, and to hopefully make people believe in magic again. \nQ: What books do you write?\nA: I write Fantasy and Science Fiction and all of its sub-genres. My current series, Blood and Darkness, is adult Urban Fantasy. I love playing with the real world and spinning it on its head, adding magical elements and creatures to it, and creating worlds within worlds. I keep a very long notebook of story ideas filled with everything from Portal Fantasy, Steampunk, and High Fantasy to Dystopian, Hard Sci-Fi, and Space Opera. BLOOD AND DARKNESS \n   BLOOD AND MAGIC (book 1) \n   FLESH AND BONE (book 2) \n   GODS AND DEMONS (book 3)\n\nQ: Why should readers pick up your books?\nA: Blood and Darkness is a fast paced, page turning Urban Fantasy series. If you are a fan of Gothic settings, sexual tension, ancient prophecies, dark magic, and deep rooted mythology, then you will love this series. Ultimately, Blood and Darkness is about love and betrayal, revenge and redemption, and all-out war. From the first page of Blood and Magic to the last, you will not be able to put this series down. These characters will haunt you, their stories will stay with you, and they will leave you wanting more.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Vampires",
    "Paranormal"
  ],
  "author": "Melissa Sercia",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/41750991-blood-and-magic"
}