{
  "title": "عكس الاتجاه",
  "description": "الرواية الفائزة بالمركز الأول لجائزة ساويرس الثقافية 2012*************************************************الرواية تدور أحداثها عن وسط البلد، هذا المجتمع الذي تدور فى محيطه زخم الحياة الثقافية والسياسية. وسط المدينة بأمكنته ومقاهيه وشخوصه وتناقضته هى رحلة يقطعها بطل الرواية العائد من الخارج فى محاولة للبحث عن الذات والوطن والهوية. الرواية تحكي واقع جيل يبحث عن طريق وعن سماء مفتوحة من الطموح والأحلام تدور فى أفق طرقات المدينة المزدحمة ووسط البلد المتشابك التفاصيل والحكايات. الرواية سردية متتالية فى شكل يوميات تدور أحداثها خلال العام الذى سبق الثورة بزخمه وتحاولاته وتنتهي بالأحداث الأولى للثورة. رحلة تمضى عكس الإتجاه. رحلة عودة إلى الوطن وإلى الجذور. رحلة بحث فى حاضر جيل جديد يصارع عصر يعج بالتناقضات. رحلة سير فى إتجاه أخر للبحث عن المعنى الحقيقى وليس المعنى السائد. عاد ليفتش فى ذاكرة الأماكن وليطالع الحاضر الذى ألت إليه الأمور من تناقضات. وسط البلد هو قلب العاصمة الذى يموج بالأحداث ويمتلئ بالشخوص والتناقضات والتاريخ القريب لشكل المدينة الراقى الذى توارى بين طيات التغيرات. رحلة عودة بعد سنوات قضاها بالخارج يعود فيها ليسكن قلب المدينة باحثا عن الذات والهوية. تجتذبه المدينة بكل صراعاتها السياسية والثقافية. يبحث عن الحب فى فريدة شمس الدين وعن أصالة الجيل القديم فى العجوز شاهين بائع الأنتيكات. يبحث فى الأمكنة عن الإتجاهات السائدة والتغيرات الدائرة فى أمكنة وسط البلد ومقاهيها. يصاحبه صديق يحمل ماضى مجهول وشخوص مختلفة تسرد واقع يثير التساؤلات طيلة الوقت.الرواية ترمز لرحلة جيل الشباب وبحثه عن المعاني الحقيقة وعن الوطن، هى رحلة فى وجدان جيل كامل وفى قلب الأحداث التى تشكلت فى العام الذى سبق الثورة.***********************************************مقطع من الرواية***********************************************أنت لست هنا بل هناك، أنت البعيد تطالع ما حولك وكأنه أرض من فراغ أخر.تصفر الرياح معربدة بين البلوكات فى الليل وتدق النوافذ الألمونيوم وكأنها تعلن عن نفسها مالكة لهذه المقاطعة من أرض الصحراء.تترك غطاءا أصفرا من الأتربة على السيارات الرابضة وحيدة فى الساحات الواسعة ما بين البنايات المطلية بلون أصفر باهت فيبدو كل شيء فى هذه المدينة بلون الصحراء.القاهرة الجديدة، ملحق جانبى للمدينة العجوز حيث يبحث البعض عن ملاذ أكثر هدوء أو عن مخرج من متاهة العاصمة القاسية. لم أستطع التعايش مع واقع البلوكات الخرسانية الهادئة أو مع خرطوم الجنينة التى أقوم برشها بعد الظهيرة لعل بعض النجيل يبسق هنا أو هناك فيخفف من جفاء الصحراء الجاف. كيف أعيش هذا الهدوء اليومي المتشابه؟. حتى الصبية القليلون الذين يلعبون الكرة فى الشوارع لعبهم هادئ دون مشاحنات ويمضون معظم الوقت فى ملاحقة الكرة الهاربة فى امتداد الطرقات الواسعة، لا يشبهون أيام طفولتنا عندما كنا نبذل جهودا جما فى ترويض الشارع وأصحاب المحلات حتى نلعب مباراة من نصف دستة ولم تكن أبدا لتكتمل دون خسائر، كم رودنا الشارع المزدحم فعلمنا الشارع مواجهة الحياة. ماذا يفعل هؤلاء هنا سوى مطاردة الفراغ؟!!. هذه ليست القاهرة التى أبحث عنها، هذه ليست المدينة التى عدت أبحث عنها.أجوب متسكعا بملابس البيت الأحياء المتجاورة والمرقمة بأرقام وكأنها عنابر معسكرات إيواء، أشعر وكأنها تمثل خريطة، خريطة مربعات وأرقام وليست خريطة بشرية لمدينة سكانية. فى الجوار تطل المنتجعات الفخمة بأسمائها البارزة على أبوابها، أسماء كلها أجنبية تعكس ثقافة تسويقية هدفها إرضاء غرور الأثرياء الزاحفين لرحابة الأطراف ومروج الجولف ووجاهة البحيرات الصناعية، وطن اصطناعي داخل الوطن، وطن استيطاني كبؤر الاستيطان هناك فى الضفة، وطن أصحاب النفوذ والمصالح والعلاقات!!.التفاوت فى كل مكان فى مصر متلاصق دائما وقريب فى المسافة ببعضه البعض حتى فى المدينة الجديدة تقف بنايات إسكان الشباب المدعمة قبالة المنتجعات الفخمة على الطرف الأخر من الشارع. هم قطعا لم يخططوا لهذا سوى لتكون فراغات صغيرة تضفى شرعية على الخريطة أتأمل كثيرا الوجوه فى المسجد القريب فأشعر أن هناك فيما بينهم قاسم مشترك، الوجوه هنا أكثر هدوءا وأقل فى التفاصيل. مزيج من القاهريين الشباب حديثى الزواج وطلبة البعثات الأسيويين والأفارقة وحتى بعض الأوروبيين. الأحاديث قليلة وكل فئة تتجمع مع بعضها كأنهم جميعهم هنا مغتربين. تستشف إحساس الغربة من الوجوه. تتشابه مع وجوه العمالة الفقيرة فى دبى. من هناك إلى هنا لم تختلف الوجوه كثيرا من حولى. مجتمع جديد يحبو مازال فى طور بدائى يتشكل فى صورة مجموعات لم تندمج بعد لتشكل نسيجا حقيقيا واضح المعالم.أنا لم أعد من أجل هذا. الحنين الدفين ينادينى لوسط المدينة، أصوات المقاهى من طقطقات الشيشة ورميات الزهر. ونداءات باعة الجرائد والروبابيكيا، والشاى بالحليب، وعربة الفول وأرغفة الخبز السمراء، وصوت أم كلثوم الصادر من الراديو فى الأمسيات، وحركة الشوارع الصاخبة الممتدة من الميادين فى كل اتجاه، ومحلات الكتب، وسينمات وسط البلد، وفتارين المحلات، وعلب الكشرى، والأصدقاء والحكايات، والتيارات السياسية والصحفيين والأدباء والشعراء والموسيقيين والمهمشين، وصياحات باعة الأرصفة وملاحقات المتسولين والمتشردين. وسط البلد يمثل بؤرة الأحداث وعالم التحولات.صخب المدينة وهدير الحياة ينادينى، وسط المدينة القديم، وطن الأحداث يناديني كهتاف بعيد صار يعلو ويقترب، فينتشى جزء أصيل منى يهفو للهتاف كلما علا، كلما أقترب.",
  "genres": [],
  "author": "ياسر أحمد",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/12347276"
}