{
  "title": "Madame Fourcade's Secret War: The Daring Young Woman Who Led France's Largest Spy Network Against Hitler",
  "description": "The dramatic true story of Marie-Madeleine Fourcade--codename Hedgehog--the woman who headed the largest spy network in occupied France during World War II, from the New York Times bestselling author of Citizens of London and Those Angry Days.In 1941, a thirty-one-year-old Frenchwoman born to privilege and known for her beauty and glamour became the leader of a vast Resistance organization--the only woman to hold such a role. Brave, independent, and a lifelong rebel against her country's conservative, patriarchal society, Marie-Madeleine Fourcade was temperamentally made for the job. Her group's name was Alliance, but the Gestapo dubbed it Noah's Ark because its agents used the names of animals as their aliases. Marie-Madeleine's codename was Hedgehog.No other French spy network lasted as long or supplied as much crucial intelligence as Alliance--and as a result, the Gestapo pursued them relentlessly, capturing, torturing, and executing hundreds of its three thousand agents, including her own lover and many of her key spies. Fourcade had to move her headquarters every week, constantly changing her hair color, clothing, and identity, yet was still imprisoned twice by the Nazis. Both times she managed to escape, once by stripping naked and forcing her thin body through the bars of her cell. The mother of two young children, Marie-Madeleine hardly saw them during the war, so entirely engaged was she in her spy network, preferring they live far from her and out of harm's way. In Madame Fourcade's Secret War, Lynne Olson tells the tense, fascinating story of Fourcade and Alliance against the background of the developing war that split France in two and forced its citizens to live side by side with their hated German occupiers.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "World War II",
    "France",
    "War",
    "Historical"
  ],
  "author": "Lynne Olson",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/41739312-madame-fourcade-s-secret-war"
}