{
  "title": "Destroy",
  "description": "Destroy is beautiful, strong, charismatic and charming. He is also selfish, shallow, petty and jealous — or is he? One misunderstanding centuries ago resulted in his being labeled as not good enough, untrustworthy, self-serving. To hell with them, he knew who he really was! A strong, dependable, good male of strong character who was very pleasant to be around and even more pleasant to look at. If only he had a female or even friends to notice those things. He’d been alone for so long the bitterness had begun to seep in. Why did no one give him the credit he deserved? Why could no one see him, the real him? Other males had friends, other males had found their females — why not him? It was maddening to watch it and not be able to experience it. Then suddenly, out of the blue, there she was — all he had to do was be himself, allow her to see his magnificence and convince her that she’s not evil. Her gifts are of no consequence to him. Yes, he feels her gift — her radiance, the light pouring from her. But that’s not why he’s drawn to her. It’s because she’s his, his very heart, his soul. Now if he can manage to keep her alive long enough to love him back, while he’s also trying to prove that he’s a male of value to his community, he may have a shot at this mate thing.  Rowan is a young woman plagued since birth with a power so strong it’s uncontrollable. Some would call it a gift — a gift? Hmpf, some gift… her entire family was ostracized from their kumpaniia because of this gift. Most of that kumpaniia struck down, their lives taken from them by this gift. Her own family unable to settle, forced to leave their beloved Romania, constantly moving from one place to another in order to evade those that still hunt her — because of this gift. It’s not a gift, it’s a curse; it’s evil, and it draws evil to her. One day it will end with the destruction of all she would have loved if she’d had the chance. She keeps that part of her locked down tight, refusing to allow the magics that seep from her very pores out into the world. She can’t let anyone in, can’t allow anyone to get close. Not even the oh-so-sexy Gargoyle who fixates on her and declares that she’s his. He just doesn’t understand that it’s not her he’s drawn to, it’s the evil that lives inside her. She’ll have to run far and fast to keep those hunting her from finding her Goyle and the sanctuary he calls home. If giving her life for his is what she’s called on to do, she will, without a second thought. She loves him, even if he’s drawn to her under false pretenses.  A power as old as time, so strong it’s killed to protect the small child it flows from. Locked down for decades, never allowed to ebb and flow as naturally as the elements it’s made from — it simmers on a slow boil, waiting for a chance to be released again. Its very essence draws all manner of creature to the woman the child has grown into — Windigos looking for redemption, Humans warped to the point of insanity hell bent on revenge… Will her refusal to see her gifts as they truly are result in her running headlong into her own blazing death? Or will those who love her be strong enough to save her in spite of herself and force her to accept who she really is? It’s time to stop running from herself. It’s time to put on her big girl panties, take a stand and accept her birthright.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Paranormal Romance",
    "Romance",
    "Magic",
    "Vampires",
    "Monsters"
  ],
  "author": "Sandra R. Neeley",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/41793008-destroy"
}