{
  "title": "Volcanoes, Palm Trees, and Privilege: Essays on Hawai'i",
  "description": "\"A rebuke to cultural appropriation, combined with tribute to a place she loves too much to make her own.\" New York Times Book Review, Top Summer Reads Volcanoes, Palm Trees And Privilege: Essays on Hawai'i explores what it means to be a white tourist in a seemingly paradisiacal land that has been formed, and largely destroyed, by white outsiders. Hawaiian history, pop culture, and contemporary affairs are woven with personal narrative in fifteen essays that examine how the touristic ideal of Hawai'i came to be, and what it \"is,\" at its core. Prato first fell in love with Hawai'i when she was a teenager while her father was building a housing subdivision on Maui. Her relationship with the Islands was cemented into a soul connection when Hawai'i became a place of respite and salvation as Prato suffered the losses of her mother, father, and brother, leaving her bereft of family by the age of forty-four. As she became more aware of how white colonialism ravaged Native Hawaiian society—and that many Native Hawaiians are pushing for sovereignty—Prato found herself asking what it means that her love for the Islands was born out of the thing that destroyed them: a white mainlander buying and developing land. What does it mean that her continued tourism contributes to Native Hawaiians getting further and further from their land, their 'āina? \"Prato's work stays winningly informal and idiosyncratic throughout and . . . coalesces into an intriguing and informative journey through the 50th state.\" —Publishers Weekly\"With her guidance and thoughtfulness, Prato pushes against the surface, locating herself within and the people and landscape of Hawai'i without buying into visitor thinking—this is not a musing on mai tais and hula events.\" —Buzzfeed\"From the perspective of a non-native who has a deep love and long relationship with these islands, Prato shares stories that intertwine facts and personal memories. They will leave you feeling both enchanted and more aware of our place in the world as unconcerned tourists to a place that many call home.\" —Matador Travel Network\"The islands serve as a launch pad for Prato to discuss weighty issues, including race, grief, and capitalism, with introspection and insight.\" —Willamette Week",
  "genres": [
    "Nonfiction",
    "Travel",
    "Essays",
    "Memoir",
    "History"
  ],
  "author": "Liz Prato",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/41766109-volcanoes-palm-trees-and-privilege"
}