{
  "title": "Vintage True Crime Stories Vol I: An Illustrated Anthology of Forgotten Cases of Murder & Mayhem",
  "description": "When it comes to murder, nothing has changed in the last one-hundred years. The cold-blooded killers of today are the same as they were long ago.  To prove this theory, consider the case summaries below that are featured in this book, Vintage True Crime Stories, Volume I.Summary of Chapter One: Twenty years before the 1932 kidnapping and murder of Charles Lindbergh Jr., there was the Marie Smith case of 1910. Her killer was German, spoke with a thick German accent, and his last name was even similar to Hauptmann’s. Both men were entrapped by scientific advancements that were landmarks for future cases. And, in the end, both men were executed in the same electric chair.Summary of Chapter Two: Like a scene in a 21st Century action movie, two hitmen on a motorcycle roar down a Rhode Island road late at night. At the designated location, they stop beside the chauffeur driven automobile of a wealthy doctor who was accompanied by his mistress that night. At nearly point blank range, the assassins emptied their pistols at the two figures in the backseat. They ignored the driver and sped away, disappearing into the darkness. The events of that night lead to a one-of-a-kind murder trial with an outcome that reinforced the duality of American justice for the next one-hundred years.Chapter 7 Summary: (No one has made a movie about this next case, but they should.) During the late hours of January 10, 1895, two burglars break into the parsonage of Rev. William Hinshaw and his wife Thurza. A fight breaks out; Thurza is shot in the head and dies on the steps to the back door. Bravely, William puts up a good fight despite being shot once and stabbed many times. Instead of finishing him off, the two men thought better of it and disappeared down a snow-covered lane.Neighbors, friends, and newspaper editors declare Rev. William Hinshaw a hero. One needed only to look at his many wounds to see that that he battled it out with the two robbers—the ones who never left footprints on the snow covered lanes of Belleville, Indiana.Chapter 11 Summary: On January 1, 1914, the small cabin of a local photographer burns to the ground. Inside, they find his body. Three days later, it happens again. Autopsies prove the men were killed before the fires were set. The evidence leads investigators to an elderly Civil War veteran with a dark past filled with dead bodies.\n\nThese four stories were recently discovered in one of the rarest true crime books known to exist, Enemies of the Underworld: Embracing Sixty-Eight Stories by America's foremost Detectives, by Frank Dalton O’Sullivan.His 700-page tome is a combination manual for new detectives, and true crime book featuring true stories co-authored by senior detectives and police chiefs from across the United States. Self-published in 1917, the book sold for five-dollars, the 2018 equivalent of $108--which might explain why it's nearly impossible to find a copy of it today.With this artifact, Historical Crime Detective Publishing saw it as the perfect foundation to structure a new anthology series simply titled: Vintage True Crime Stories: An Illustrated Anthology of Forgotten Cases of Murder & Mayhem.Volume I contains fifteen stories from O’Sullivan’s book, while the remaining five chapters were selected from Fifty Years a Detective by Thomas Furlong, published in 1912.Mixed in with these twenty stories are sixty-five images, fifty-two footnotes, a dozen epilogues, and ten annotations.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Mystery"
  ],
  "author": "Frank Dalton O'Sullivan",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/41753529-vintage-true-crime-stories-vol-i"
}