{
  "title": "Journey of Hope: Love, Marriage, and Overcoming Infertility at 40",
  "description": "Journey of  Love, Marriage, and  Overcoming Infertility at 40  by Samantha Fitts There are some women who don't have a desire to get married and have children. However, Samantha was not one of them. Many women in their late 30s and early 40s postpone marriage or childbearing to obtain their education, establish their careers, and become financially secure. Unfortunately, this sometimes leads to difficulties in finding Mr. Right or conceiving (or both). This can be an arduous and heartbreaking time of life, when it seems lifelong hopes and dreams of family may not be possible. It can be so easy to lose hope in this situation. However, keeping the faith is crucial if one truly desires a family. Samantha wrote this book inspire the readers through her personal journey. Samantha delayed marriage until the age of 36 after she'd pursued advanced degrees and established her career--not entirely by choice since Mr. Right hadn't entered her life sooner. At times, she wondered if it would ever happen. Once married, she and her husband wanted kids right away, only to suffer a miscarriage and the devastating diagnosis of infertility. In this book, Samantha shares her extraordinary journey of hope. Unmarried and childless, Samantha learned that faith the size of a mustard seed can indeed move mountains and eventually bring her the blessings of a family. You will discover how her faith in God and perseverance led her to the right husband and overcoming infertility to have their first baby at 40. This book will inspire women to keep going, to consider all their options, and to never lose faith in the One who gives us our dreams and who wants us to live in all the abundance of His creation. Don't give up on your dreams, whatever they are. You still have time.",
  "genres": [],
  "author": "Fitts Ed D",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/41800121-journey-of-hope"
}