{
  "title": "War",
  "description": "The eighth and final book in the epic fantasy House War series closes this chapter in a beloved world of magic and political intrigue, where new threats are stirring.When the Sleepers wake. Once, that phrase meant: never. The Sleepers were a myth, part of a story told to children. But in truth, the Sleepers, ancient princes in the court of the Winter Queen, were imprisoned in slumber by the gods themselves—in the cold, dark ruins of the ancient city that lies buried beneath the capitol of the Empire. And that prison is fraying, at last.  They are waking.  The gods no longer walk the world. There is no power that can stand against the princes when they wake—and the city that has been Jewel’s home for her entire life will be destroyed when the Sleepers walk. There is only one person to whom they owe allegiance, only one chance to halt them before they destroy everything in their ancient rage. But that person is the Winter Queen; she is not, and has never been mortal. Jewel carries the last of the surviving saplings that might usher in a new Summer age—but all of the roads that lead to the court of the Queen are closed.  Jewel ATerafin has faced the Oracle’s test. She has control of the prophetic powers that she once considered a curse and a burden. She will find her way to the Winter Queen, and she will ask—or beg—the Winter Queen to intervene to save her kind, her House, and everything she loves. But she is mortal, and time has never been her friend. The demons are waiting to bar her way, bringing battle to the hidden ancient paths on which she must travel. To win, she must face the true meaning of the Oracle’s test, and risk sanity and life to make the choice that has always lurked at the heart of the firstborn’s test. And even then, it might be too late.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Dragons",
    "Demons"
  ],
  "author": "Michelle West",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/41796253-war"
}