{
  "title": "Maelstrom",
  "description": "In a future where the desire for self-preservation is extreme, the greatest soldiers are the ones abducted from the past during the height of the nation’s suicide epidemic.  There is a rogue black hole approaching the Orion Arm of the Milky Way and it should collide with the Solar System by the end of the millennium. The date for the extermination of the human race is set in stone and there’s nothing that anyone can do to prevent it. There is however a way to rescue the people of Earth before it’s too late, but it requires the involvement of someone who’s willing to risk their life in the process. That’s not something anyone’s willing to do in the future because quite frankly, suicidal tendencies and thoughts aren’t a plague of humanity anymore. Hunter leapt from an eighty-foot bridge in 2018 only to find herself suddenly alive in an orbital ship or space station. She and her new friend Mercy are searching for answers from some highly secretive people. They soon discover that they’ve been given the weapons necessary in order to change history and to save the human race. Unfortunately, they may need to sacrifice everything in the process. Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Kepler Moon Alpha, and his newest acclaimed series The Ani Maxima Files. With over 250,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Hope Rising, One Crazy Summer, and Vestige by McElhaney. EDITORIAL  \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [
    "Science Fiction"
  ],
  "author": "Scott McElhaney",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/41773623-maelstrom"
}