{
  "title": "In Fulfillment: The Designer's Journey",
  "description": "When we're aware of where our fulfillment is derived from, we've taken a grand leap toward making meaningful work-work that connects to us as designers (nay, human beings), and to those who will ultimately engage with it. In a field of work largely comprised of impermanence (digital), the contrast is that our decisions can have lasting impact. Understanding this, in tandem with a clear value system, is essential to defining your legacy as a designer.The designer's legacy isn't built upon their choice of tools. The designer's legacy is built upon the choices they make-as macro and micro as that implies. Legacy transcends \"us.\" This is a mindset that takes us from \"me\" to \"we\" as we consider the bigger picture. There is a privilege and responsibility that are inherent in the craft. In communicating. In connecting with people through design.Privilege and responsibility. Those notions are so vital (and evergreen) to our craft, and how we connect with other human beings. Formative, yet intrinsic to what we do. Every decision carries weight, and is bigger than us. We simply cannot foresee under what conditions people will be engaging with what we create. They need to be equitably understood, advocated for, and included along the way.Agnostic of accolades or the tools we're using, the humble connection with those on the receiving end of what we're producing is imperative toward quality and evolution. As soon as we close our minds via an inner monologue of \"knowing it all\", or branding ourselves a \"#thoughtleader\" on social media, the designer we are is our final form. The designer we can be, will never exist.As a designer evolves over the years and course of their career, honest self-assessment toward derivation of self-reward will yield their best sense of personal-and creative-fulfillment. Does continuing to push the quality of their individual hands-on work scratch the itch? Or is a greater sense of being satiated derived via guiding the evolution of others and their work?Leveraging the power of storytelling, this book covers practical, real-world examples and tactics to ensure your fulfillment serves as a guide toward where, what, and why you create.",
  "genres": [
    "Design"
  ],
  "author": "Justin Dauer",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/123486227-in-fulfillment"
}