{
  "title": "An Unkindness of Ghosts",
  "description": "\"The HSS Matilda is a generation ship organized much like the antebellum South. Embroiled in a grudge with a brutal overseer and sowing the seeds of civil war, sharecropper Aster learns there may be a way off the ship if she's willing to fight for it.\"--Publishers Weekly; included in Fall 2017 Adult Announcements, Science Fiction, Fantasy, and Horror\"Immediately immersive and sophisticated...This is a phenomenal piece of work.\"--Lee Child, author of the Jack Reacher series\"An Unkindness of Ghosts marks the debut of a wildly talented writer. Rivers Solomon has put together a heady science-fiction novel that speaks directly to some of the most pressing political and social concerns of the modern day. And yet for all that it remains deeply humane, and it's even quite funny at times. This is a book you'll want to read now so you can tell your friends you read it first.\"--Victor LaValle, author of The Changeling\"Welcome to the Tarlands aboard the space vessel HSS Matilda--home of the poor and rejected--and the setting of Rivers Solomon’s powerful debut novel. Imaginative in the vein of Colson Whitehead, Samuel R. Delany, and Octavia E. Butler, this novel explores the struggles of slum dwellers aboard a spacecraft sadly reminiscent of our own world: rife with poverty, caste, and discrimination as told through the Looking Glass. With outstanding world-building and an unforgettable protagonist in Aster, An Unkindness of Ghosts is a notable debut by an author whose work I look forward to reading for years to come.”--Tananarive Due, author of The Living Blood and Ghost SummerOdd-mannered, obsessive, withdrawn, Aster has little to offer folks in the way of rebuttal when they call her ogre and freak. She's used to the names; she only wishes there was more truth to them. If she were truly a monster, as they accuse, she'd be powerful enough to tear down the walls around her until nothing remained of her world, save for stories told around the cookfire.Aster lives in the low-deck slums of the HSS Matilda, a space vessel organized much like the antebellum South. For generations, the Matilda has ferried the last of humanity to a mythical Promised Land. On its way, the ship's leaders have imposed harsh moral restrictions and deep indignities on dark-skinned sharecroppers like Aster, who they consider to be less than human.When the autopsy of Matilda's sovereign reveals a surprising link between his death and her mother's suicide some quarter-century before, Aster retraces her mother's footsteps. Embroiled in a grudge with a brutal overseer and sewing the seeds of civil war, Aster learns there may be a way off the ship if she's willing to fight for it.An Unkindness of Ghosts will appeal to a broad audience, including fans of books such as The Magicians by Lev Grossman, The Night Circus by Erin Morgenstern, Cold Magic by Kate Elliott, The Golden Compass by Philip Pullman, The Intuitionist by Colson Whitehead, and Station Eleven by Emily St. John Mandel.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Queer",
    "LGBT",
    "Fantasy",
    "Audiobook",
    "Dystopia"
  ],
  "author": "Rivers Solomon",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/41753914-an-unkindness-of-ghosts"
}