{
  "title": "Hoping for Love",
  "description": "Every change has its challenges . . .\n\n \n All her life, Grace Ryan was the \"fat girl.\" Taunted, teased, and ignored by her peers, she tried every diet ever invented to no avail. Desperate to make a change as her twenties slipped away, she decided it was time for drastic measures and had lap-band surgery. More than a year later, she's lost 130 pounds and is venturing into the dating world for the first time. But during a boat trip to Gansett Island with a new guy, Grace refuses to have sex--and finds herself abandoned without a dollar to her name at McCarthy's Gansett Island Marina . . .Home for the summer, awaiting the launch of his debut album, music star-in-the-making Evan McCarthy is performing at the Tiki Bar when he notices Grace looking lost in a sea of happy people. Evan comes to her aid and quickly finds himself smitten. But the last thing Grace needs after all she's been through is a guy who \"doesn't do relationships.\" Will Evan change his ways to win Grace's heart?Gansett Island Reading OrderMaid for Love (Mac & Maddie)Fool for Love (Joe & Janey)Ready for Love (Luke & Sydney)Falling for Love (Grant & Stephanie)Hoping for Love (Evan & Grace)Season for Love (Owen & Laura)Longing for Love (Blaine & Tiffany)Waiting for Love (Adam & Abby)Time for Love (Daisy & David)Meant for Love (Jenny & Alex)Chance for Love, A Gansett Island Novella (Jared & Lizzie)Gansett After Dark (Owen & Laura)Kisses After Dark (Shane & Katie)Love After Dark (Paul & Hope)Celebration After Dark (Big Mac & Linda)Desire After Dark (Slim & Erin)Light After Dark (Mallory & Quinn)Victoria & Shannon (Episode 1)Kevin & Chelsea (Episode 2)A Gansett Island Christmas NovellaMine After Dark (Riley & Nikki)Yours After Dark (Finn & Chloe)Trouble After Dark (Deacon & Julia)Rescue After Dark (Mason & Jordan)",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Fiction",
    "Family",
    "Adult"
  ],
  "author": "Marie Force",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/41799643-hoping-for-love"
}