{
  "title": "Lithium: A Doctor, a Drug, and a Breakthrough",
  "description": "The remarkable untold story of a miracle drug, the forgotten pioneer who discovered it, and the fight to bring lithium to the masses. The DNA double helix, penicillin, the X-ray, insulin―these are routinely cited as some of the most important medical discoveries of the twentieth century. And yet, the 1949 discovery of lithium as a cure for bipolar disorder is perhaps one of the most important―yet largely unsung―breakthroughs of the modern era. In Lithium , Walter Brown, a practicing psychiatrist and professor at Brown, reveals two unlikely success that of John Cade, the physician whose discovery would come to save an untold number of lives and launch a pharmacological revolution, and that of a miraculous metal rescued from decades of stigmatization.From insulin comas and lobotomy to incarceration to exile, Brown chronicles the troubling history of the diagnosis and (often ineffective) treatment of bipolar disorder through the centuries, before the publication of a groundbreaking research paper in 1949. Cade’s “Lithium Salts in the Treatment of Psychotic Excitement” described, for the first time, lithium’s astonishing efficacy at both treating and preventing the recurrence of manic-depressive episodes, and would eventually transform the lives of patients, pharmaceutical researchers, and practicing physicians worldwide. And yet, as Brown shows, it would be decades before lithium would overcome widespread stigmatization as a dangerous substance, and the resistance from the pharmaceutical industry, which had little incentive to promote a naturally occurring drug that could not be patented.With a vivid portrait of the story’s unlikely hero, John Cade, Brown also describes a devoted naturalist who, unlike many modern medical researchers, did not benefit from prestigious research training or big funding sources (Cade’s “laboratory” was the unused pantry of an isolated mental hospital). As Brown shows, however, these humble conditions were the secret to his historic Cade was free to follow his own restless curiosity, rather than answer to an external funding source. As Lithium makes tragically clear, medical research―at least in America―has transformed in such a way that serendipitous discoveries like Cade’s are unlikely to occur ever again.Recently described by the New York Times as the “Cinderella” of psychiatric drugs, lithium has saved countless of lives and billions of dollars in healthcare costs. In this revelatory biography of a drug and the man who fought for its discovery, Brown crafts a captivating picture of modern medical history―revealing just how close we came to passing over this extraordinary cure.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Medicine",
    "Psychology",
    "Mental Health",
    "Mental Illness"
  ],
  "author": "Walter Brown",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/41817514-lithium"
}