{
  "title": "Underland: A Deep Time Journey",
  "description": "From the best-selling, award-winning author of Landmarks and The Old Ways, a haunting voyage into the planet’s past and future.Hailed as \"the great nature writer of this generation\" (Wall Street Journal), Robert Macfarlane is the celebrated author of books about the intersections of the human and the natural realms. In Underland, he delivers his masterpiece: an epic exploration of the Earth’s underworlds as they exist in myth, literature, memory, and the land itself.In this highly anticipated sequel to his international bestseller The Old Ways, Macfarlane takes us on an extraordinary journey into our relationship with darkness, burial, and what lies beneath the surface of both place and mind. Traveling through “deep time”—the dizzying expanses of geologic time that stretch away from the present—he moves from the birth of the universe to a post-human future, from the prehistoric art of Norwegian sea caves to the blue depths of the Greenland ice cap, from Bronze Age funeral chambers to the catacomb labyrinth below Paris, and from the underground fungal networks through which trees communicate to a deep-sunk “hiding place” where nuclear waste will be stored for 100,000 years to come. Woven through Macfarlane’s own travels are the unforgettable stories of descents into the underland made across history by explorers, artists, cavers, divers, mourners, dreamers, and murderers, all of whom have been drawn for different reasons to seek what Cormac McCarthy calls “the awful darkness within the world.”Global in its geography and written with great lyricism and power, Underland speaks powerfully to our present moment. Taking a deep-time view of our planet, Macfarlane here asks a vital and unsettling question: “Are we being good ancestors to the future Earth?” Underland marks a new turn in Macfarlane’s long-term mapping of the relations of landscape and the human heart. From its remarkable opening pages to its deeply moving conclusion, it is a journey into wonder, loss, fear, and hope. At once ancient and urgent, this is a book that will change the way you see the world.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "History",
    "Travel",
    "Audiobook",
    "Environment"
  ],
  "author": "Robert Macfarlane",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/41817481-underland"
}