{
  "title": "The Northern Lights: The True Story of the Man Who Unlocked the Secrets of the Aurora Borealis",
  "description": "Throughout the ages, the lights of the aurora borealis were believed to be messengers of gods, signs of apocalypse, or souls of the dead; even the most sophisticated scientists misapprehended their cause. Now Lucy Jago tells the story of the science--and the romance--behind the Northern Lights as she traces the grand adventure of the life of the visionary Norwegian scientist Kristian Birkeland.At the age of thirty-one, Birkeland set out on a lifelong, increasingly compulsive quest to discover the origins of the aurora borealis. He traveled across some of the most forbidding landscapes on Earth, from the ice mountains of Norway to the deserts of Africa, against a backdrop of war and political upheaval. Along the way, Birkeland made some remarkable discoveries and inventions, such as the idea of hearing aids for deaf patients; of making caviar from cod roe; and of using the force of cathode rays to propel rockets. No country's armed forces ever adopted his electromagnetic cannon, but the technology has since been adapted and extended to make \"railguns\" (electromagnetic mass accelerators) for the American Strategic Defense Initiative--the so-called \"Star Wars\" Defense.Ultimately, Kristian Birkeland's obsession with the workings of the cosmos cost him his health, his happiness, and his sanity--perhaps even his life. He spent his final days in exile in Egypt, and died in 1917 in Japan, under suspicious circumstances, his groundbreaking theories unheralded; he was cheated of the Nobel Prize by a rival. But now Birkeland?s ideas are considered to have been prophetic, and they have furthered our understanding not only of the Northern Lights but also of electromagnetism, comets, and the sun.Exhaustively researched and thrillingly told, the previously unknown story of Kristian Birkeland is an enthralling--and enlightening--saga.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Biography",
    "Nature",
    "Astronomy",
    "Physics"
  ],
  "author": "Lucy Jago",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/418129.The_Northern_Lights"
}