{
  "title": "Every Witch Demon but Mine",
  "description": "There is no such thing as a lightning witch.Elizabeth Norwood has been hiding in the human realm most of her life, filling a niche as a vampire slayer that isn't quite as secret as her magic. Staking demons wasn’t part of the deal. The only way to keep hell from following her hidden family and ruining their happily ever after is to confront the demons from her old life and do what she’s trained for her whole life, defeat the monster.Seems simple enough until she accidentally stabs Prince Daemon in the back. It was the spiked punch, honest! Only wounding the dark demon of her dreams has put him on her scent and the hunt she had planned changes into a chase with nowhere to run. Her sister is busy facing her own demons. Her mother will tear hell apart to save her, even if the rest of their world comes crumbling down in penance. Elizabeth has no choice but to grab the prince by his fangs and cast the biggest illusion her lightning magic ever conjured.Daemon won’t be easily tricked. He has grown up in a dark court full of intrigues and assassins. The thorny path to the throne is strewn with his fiery siblings, blood-harem rights and a little dragon problem that’s got the villagers in an uproar. Now, Elizabeth is attracting interest that a witch with a secret cannot afford. She will need more than a few, sweet kisses to pull Daemon away from it all and under her spell. He is the most dangerous monster she’s faced, a true match to her singular magic in ways she can’t parry without revealing her secrets. They’ll dance until one of them is caught and she is forced into a terrible dilemma.There’s only one rule about slaying that matters.The stake goes in the heart.***Part of the Maeren series. Be prepared for big, unique world-building, a mysterious harem that sneaks up on our heroine and a book that has bite. New cover but this is NOT rewritten. Contains adult situations, language and violence. Reverse Harem.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Magic",
    "Paranormal",
    "Vampires",
    "Paranormal Romance",
    "Demons"
  ],
  "author": "Mercedes Jade",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/41809980-every-witch-demon-but-mine"
}