{
  "title": "The Billionaire's Sham Girlfriend",
  "description": "Gregor Beaumont is in a world of hurt that all the charm in his gorgeous, well-toned body can’t fix. His late grandfather, God rest his soul, wanted to make sure Gregor and his two playboy brothers settle down. He had the brilliant idea of buying up a huge share of the brothers’ engine company and using that as incentive for each brother to find Mrs. Right. Settle down or lose the company to a competitor. Well, that’s just not happening to Gregor, not when life’s so good at the moment. Gregor likes racing fast cars and seducing fast women, and not necessarily in that order. Settle down? Not a chance. Gregor has his own brilliant idea: find some wholesome and desperate girl to pretend to be his girlfriend. No harm. No foul. Unless things start getting a little bit too real.Kara Alerby knows she’s a sucker for blues eyes and a great smile, so when Gregor comes into her theater wanting to hire her to act the part of his adoring girlfriend, she’s already got her defenses on high alert. But Kara’s a practical girl, and Gregor’s offering a boatload of money that would go a long way toward making her dream of creating a fine arts school for gifted kids a reality. She can ignore his smiles, his charisma, and his kiss-me mouth if it means she’ll get her school. All she has to do is remind herself, every second of every day they’re together, that it’s all make believe—even when it doesn’t always feel that way. When Greg’s love of racing puts his life in jeopardy, Kara isn’t ready to watch another person die in front of her like her father did. And Greg isn’t about to stop doing the one thing that makes life worth living. The two are on a collision course, one that could break them apart forever if they don’t change directions…",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Leslie North",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/41808082-the-billionaire-s-sham-girlfriend"
}