{
  "title": "Redemption: The Collective Season Two, Episode 8",
  "description": "RedemptionJennifer:Our city is in flames.Crooked cops and corrupt politicians rule the streets. All it took was the murder of an innocent to ignite a firestorm and set two cities ablaze. While our cities burn, I face the devastation on the streets, saving lives while my marriage falls apart. I once thought Patton and I could survive anything, but we’re not coming out of this unscathed. We’ve lost too much and our love is stretched beyond the breaking point.The choices I make aren’t easy, but at the end of a long and brutal night, I’ll see what remains of both my city and the love of the man I can’t live without. Patton:Overcome with grief, I walked away from the love of my life. Jen is on the streets, doing what she does best. She’s saving lives while I watch the city burn.But, when she goes missing in the middle of the riots, I can no longer ignore the truth. She’s my wife. My love. She's my life. I’ll do whatever it takes to find her and beg for forgiveness.I’m not sure if I’m strong enough or worthy of such redemption, but I will bring my wife home.The Collective Season Two!Are you ready to find out what all the buzz is about?We’ve set the stage, created the characters, and fashioned a world full of twists and turns. Now it’s your turn to sit back and immerse yourself in this incredible series. Each episode weaves the characters and storylines of our standalone novels together to give you an epic crossover series.We’ve left you breadcrumbs, tidbits of information intertwined throughout our stories. Can you find them? Can you collect the clues we’ve left behind? No one is safe as corrupt politicians and dirty cops rule the street. A child’s death puts targets on the backs of those in law enforcement and sets two cities ablaze. When the Police Chief’s daughter is kidnapped amid the chaos, will the Collective rescue her in time?Featured authors in order of appearance-Absolution—B.R. BradleyEnsnared—Leona WindwalkerGravity—J.L. LeslieSwayed—Erin TrejoFlawed—Jade RoyalTrust—Riley EdwardsAngst—Samantha A. ColeRedemption—Ellie Maste",
  "genres": [],
  "author": "Ellie Masters",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/41818717-redemption"
}