{
  "title": "A Bride From Akuse",
  "description": "Teikwor DjinTeikwor is a 19 year old girl from a relatively deprived background. She is mostly called “Yo Teikwor” by her mother because of her composure. Her life has always not been as she wanted it to be so she grew up adopting a habit of often expecting challenges her way. She is a firm risk taker, patient and optimistic. She loved her father so much that her manipulators discovered that and eventually used it against her. She felt defeated but not destroyed. Would she give up on her hopes? We’ve got to wait and see.Mr. And Mrs Djin ( Teikwor’s Parents)These are the type of parents most people would want but later realize that parents that are hard on their children are sometimes the best. Teikwor’s mother is portrayed as a calm woman who talks less and easily accepts decisions without any arguments. Her father is quite a well known foreman of a farm and very dedicated to his work. He is very submissive to his boss and work and even put his life on the line for his work. He loved his daughter more than anyone else but their calm nature prevents him for standing up for her. Could it be that they were calm because they were poor or just naturally humble?Opanin AduOpanin Adu is arguably the most respected and feared character in the novel. This is because of his money and power. He controlled most of the farmlands in the Region and that made him known throughout. When it was time for his nephew to get a wife, he felt he could get anyone he pleased for his heir. He knew where the best things were and how to get them. He just didn’t mind if it was by a ruthless means or not. And certainly didn’t care about how others felt about what he did. Can he break the resolve of his subjects?AdrakieHer role in the story is somewhat flat but very important. A reader might not see her significance but a critical observer might. Adrakie is Teikwor’s only trusted friend and plays as a decoy to the exposure of the happenings in the town of Akuse. Through their conversations, we get to know the realities of a rural girl’s fate in that part of the country. Appiah He is one of the nephews of Opanin Adu. He is the most unlikely hero in the novel. I still do not think he was the hero. Appiah is portrayed as a young man who madly falls in love with a bride from Akuse even before he meets her. Because of where he came from, he did not know that his actions destroyed someone’s future until he finally weds his bride. He represents one of the few men who respects women and would do anything for love. Would you describe a man who supports his wife and doesn’t control her as a weak man?Many other characters help build up this story beautifully. These are but just a few. This novel is due to be released first online this September and then later as a hard copy for an upcoming girl empowerment project. To support or sponsor this project contact me, Ekow Plange on ekowtamoakoatta@gmail.com or +233578884691Here's a taste of what to expect. https://eplangelibrary.wordpress.com/...",
  "genres": [],
  "author": "Ekow Plange",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/41831022-a-bride-from-akuse"
}