{
  "title": "This Book Needs a Laugh",
  "description": "This Book Needs Your Help!Can you wiggle like a worm?Can you yodel?Can you roar like a dinosaur?Can you make up a silly monster?If so, help cheer up this sad book! Use your imagination as the book prompts you do fun things to laugh about.This Book Needs a Laugh is an interactive children's book that addresses emotions and empathy in a fun way.The true star of This Book Needs a Laugh is not the book itself but the child who interacts with it! It will have you and your children laughing and playing throughout. If you liked titles such as The Book With No Pictures or Press Here , check out This Book Needs a Laugh .Teaching children compassion for those who are sad or suffering is at the heart of this little book. Empathy is an important concept for children to learn.Simple ink drawings and colorful page elements add visual interest to this book for 2-8 year olds.Activity ideas are included for parents to teach young children to recognize and discuss emotions.Here is some of the awesome feedback from readers about This Book Needs a Laugh“My 7 year old read the book to his 5 year old sister and 2 year old brother. They absolutely love it! The book resulted in the kids having at ticklefest, laughing and having a great time together…If you have young children who love books that engage them they won't be disappointed with this book. ” – Mary Ann D.“This book is adorable! Both my kids, age 7 and 2 loved it! My daughter thinks the fish face is so funny and has been walking around making the face for two days! We’ve been reading the book at breakfast and our mornings have been a blast!” – Patricia Cordara Crisp“’This Book Needs A Laugh’ by Cyrena Shows is a delightful book on so many levels. Before purchasing, I checked it out using my Kindle Unlimited Subscription, and then promptly bought 4 paperback copies – 1 for myself and each of my grown children and their families.” – Amazon Customer",
  "genres": [],
  "author": "Cyrena Shows",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/41831358-this-book-needs-a-laugh"
}