{
  "title": "Flesh and Bone",
  "description": "Discover Gray. Dhampir. Undead. Cursed.   With the dark power rising within her, she risks losing everything. Three months after the victory at Infitum, Gray’s dark magic has grown stronger and threatens to consume her. She fights against it at every turn. But when her partner Aldric mysteriously disappears, she must use her powers to find him.With zero leads and nothing but a strange drawing to go on, Gray seeks allies in the Hall of Secrets. During her search for Aldric, she discovers a mysterious cult, an ancient curse, and a family secret that is darker than she could ever imagine—an organization deadlier than even the Consilium.In the wake of this new threat to humanity and her kind alike, Gray needs to rely on the one person she distrusts the most—Dragos. As her former lover and recent enemy, he knows more than he lets on. Traveling through the streets of New Orleans to the shores of Scotland, to the Romanian woods, and all the way back to the Underworld, Gray must find new magic and raise an army.With the fate of humanity and Aldric’s life hanging in the balance, Gray shall embrace her dark side once and for all, but in doing so, she may have to make a choice between love and survival of the species—or risk losing both.“Melissa Sercia weaves a tale involving Dhampirs and Witches that keeps you on the edge of your seat and makes you root for the characters. The story is action packed and full of emotional depth that draws the reader in and makes them want more.”   –  Urban Fantasy Author, Sydney Ashcroft  ★★★★★AUTHOR INTERVIEW Why do you write? When I was a kid, reading was a way for me to escape into magical worlds. I was about twelve years old when I first started writing and making up my own stories. It made me feel like I had a connection to the literary greats. Like I was in some sort of secret magical club. Today, I write to try and capture that magic in hopes to inspire writers and readers alike. To take my readers on a journey. An adventure. An escape. I write to breathe life into characters, to transport readers to fantasy settings, and to hopefully make people believe in magic again. What books do you write? I write Fantasy and Science Fiction and all of its sub-genres. My current series, Blood and Darkness, is adult Urban Fantasy. I love playing with the real world and spinning it on its head, adding magical elements and creatures to it, and creating worlds within worlds. I keep a very long notebook of story ideas filled with everything from Portal Fantasy, Steampunk, and High Fantasy to Dystopian, Hard Sci-Fi, and Space Opera.BLOOD AND DARKNESSBLOOD AND MAGIC (book 1) FLESH AND BONE (book 2) GODS AND DEMONS (book 3)  Why should readers pick up your books? Blood and Darkness is a fast paced, page turning Urban Fantasy series. If you are a fan of Gothic settings, sexual tension, ancient prophecies, dark magic, and deep rooted mythology, then you will love this series. Ultimately, Blood and Darkness is about love and betrayal, revenge and redemption, and all-out war. From the first page of Blood and Magic to the last, you will not be able to put this series down.",
  "genres": [
    "Vampires"
  ],
  "author": "Melissa Sercia",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/41820635-flesh-and-bone"
}