{
  "title": "The Shattered Lens: Alcatraz vs. the Evil Librarians",
  "description": "The sci/fi fantasy adventures of Brandon Sanderson--#1 New York Times bestselling author of The Knights of Crystallia and the Mistborn series—have been praised as “genuinely funny” and “an excellent choice” and…and……and you know what? That’s enough. For too long, I’ve been telling you all how fantastic this Brandon Sanderson character is, and I’m just sick of it. Take it from me—I’ve actually met the guy.Now me? I can be impressive. Unfortunately, that’s usually when the trouble starts. But not this time! Honest!I mean, it’s hardly my fault that the kingdom of Mokia was about to fall to the evil forces of the Librarians.And it’s not really my fault if I sort of accidentally led a small force of freedom fighters to the Mokian capital of Tuki Tuki to help save the city and its brave people.And it’s definitely not my fault that the Librarians found out I was there and launched an all-out attack with giant robots and scary weapons that permanently knocked people out and blew huge holes in the ground and kidnapped people and then my Librarian mother showed up and ruined everything as usual while my father was too busy to care even though he’s the one who was going to unleash chaos on the world and my talent for breaking things was getting way out of control and I didn’t know what to do!!!(WHEW!)So…if you want to keep reading and find out what else was totally not—I repeat, NOT—my fault, go right ahead.Just don’t blame me if you can’t stop turning the pages.Praise for the Alcatraz series:“Like Lemony Snicket and superhero comics rolled into one (and then revved up on steroids).”—Publishers Weekly (Starred Review)“An excellent choice to read aloud to the whole family.” —NPR“Those who enjoy their fantasy with a healthy dose of slapstick humor will be delighted.” —School Library Journal“Genuinely funny...plenty here to enjoy.” —Locus“In this original, hysterical homage to fantasy literature, Sanderson’s first novel for youth recalls the best in Artemis Fowl and A Series of Unfortunate Events.” —VOYA",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Middle Grade",
    "Audiobook",
    "Humor",
    "Childrens"
  ],
  "author": "Brandon Sanderson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/41821463-the-shattered-lens"
}