{
  "title": "Blame It on the Shame Part 2",
  "description": "\"Forgive me, Father, for I have sinned.\"I've fallen in love with Lou-Lou.And I'll stop at nothing to keep her away from you.But there's one thing I never counted on...The moment when our 'truths' would turn into lies.I thought Bruno DeLuca was our biggest threat.I was wrong.Because the fire burning between us—would end up destroying us. And killing me. ***People think love conquers all.What they don't know is that for some of us...it comes at a price.The ultimate price.Sometimes, love can end up wrecking you—instead of saving you.Sometimes, love can quickly turn to hate.And sometimes...even after you've killed your demons—there's still one more that comes to the surface.\"There are two sides to every story...this is ours.\" Warning: Due to strong language, some violence, explicit sexual content, and some dark elements, this book is not intended for readers under the age of 18.*Trigger Warning*: Any readers with sensitivity to dark reads should proceed with caution and at their own risk.You've been warned. Author's Note: This is part two of a three-book series. (Blame It on the Shame: Lou-Lou and Ricardo's story.)However, in order to truly enjoy Lou-Lou and Ricardo's story, it is advised you read 'Blame It on the Pain' first as this story will follow the same timeline. The 'official order' is as follows:'Blame It on the Pain' (Jackson & Alyssa's story) which is a full-length standalone novel and is available now.'Blame It on the Shame' series (Ricardo & Lou-Lou's story) which is a 3-part series.Part One of 'Shame' - is considered a 'prequel' and the events take place before the events in 'Blame It on the Pain' do. The standalone book is available now.Part Two of 'Shame' - will follow the same timeline as 'Blame It on the Pain'. NOTE: you MUST read 'Blame It on the Pain' in order to read this book.",
  "genres": [
    "Dark",
    "Romance",
    "Dark Romance",
    "Abuse",
    "Crime",
    "Sports",
    "Contemporary Romance"
  ],
  "author": "Ashley Jade",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/41829041-blame-it-on-the-shame-part-2"
}