{
  "title": "The Wizard",
  "description": "This morning I’m walking down that road again. But this time in the opposite direction. I’m in a really good mood. A week ago I was headed east with no idea who I was or where I was going. Today I’m headed west, toward the west bridge that crosses the river to the north. They say a man there is looking for me.  Well, they say that he’s looking for a man named Joshua, but everyone assumes that it must be me. I expect that it is. He says that he needs to give me something that he’s been looking after for a long time and he wants to be done with it. He says that it belongs to me.  I think he wants to give “the haunted woods” that border Paul’s farm near the village of Bonvale. It’s strange. For some reason I want to be the owner of the woods and I don’t know why. But a week ago I didn’t know my own name. I still don’t know where I came from or how I got here.  I do know that I have a place to live and three beautiful girls who love me. They were all “Nogud”, the untouchable women. What a lie. They are the most beautiful and gracious women alive. But until I discovered the truth, they were shunned and made to wear a hood and a tunic that covered them from head to toe and they weren’t allowed to have a mate or any real happiness. I changed that and I intend to change that for all of them, all of the Nogud.  This morning I’m going to find a man who’s looking for me. Maybe he knows where I came from.  When I get home, I’m going to spend some quality time with Raven, Lark, and Viola. They are all bright and funny and marvelously sexual. I’m looking forward to it.  This is the second book in my story. The Nogud Legacy, Book 2: The Wizard. I’m not really a wizard, but people say what they say.  Warning…or perhaps enticements: The story of The Nogud is filled with mysteries, humor, good friendships, a bit of martial arts, post-apocalyptic fantasy, robots, and later on in the series, horrible monsters… and a lot of sex and casual nudity. The culture where our hero lives has a tradition of having more than one mate, so that’s where the sex comes into it. His story doesn’t shy away from the graphic details of any of it. It’s an adventure story for mature adults. A vicarious romp with heroes, nymphs, and pixies. Maybe you will enjoy it. Writing it was certainly a lot of fun.",
  "genres": [
    "Harem"
  ],
  "author": "Marilyn Foxworthy",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/41837044-the-wizard"
}