{
  "title": "Grandpa Christmas",
  "description": "Renowned children's author Michael Morpurgo teams up with bestselling illustrator Jim Field in this stunning Christmas picture book.Dearest little Mia, This Christmas, instead of a Christmas card youll have plenty of those and instead of a present youll have plenty of those too, I am sending you a letter . . . Every Christmas Mia and her family read a letter which her Grandpa wrote to her. His letter is a warm, impassioned and heartfelt wish for a better world for Mia to live in. He remembers fondly the times they spent in his garden finding frogs and worms and planting seeds.But Grandpa worries that all the things they love so much are in danger . . .His letter is a hopeful plea to Mia (and to all of us) to continue to care for and protect our precious world.Michael Morpurgo frames his powerful message about protecting the environment in this beautiful personal story about a grandpas wish for his granddaughter to live in a better world. This vital and timely story is paired with Jim Fields emotive illustrations in this gorgeous Christmas picture book, perfect for the whole family to share.Michael Morpurgo is a master storyteller who has written over one hundred books and won countless awards. In 1976 Michael and his wife Clare started the charity Farms For City Children, which aims to relieve the poverty of experience of young children from inner city and urban areas. In 1999 they were awarded the MBE for their work in creating these farms and in 2006 Michael received an OBE. His novel War Horse has been adapted into a hugely successful and critically acclaimed West End play as well as a film adaptation directed by Steven Spielberg. Michael is a tireless champion for children's books and was formerly the Children's Laureate.Jim Field is an award-winning illustrator, character designer and animation director",
  "genres": [
    "Christmas",
    "Picture Books",
    "Childrens",
    "Family",
    "Environment",
    "Love",
    "Nature"
  ],
  "author": "Michael Morpurgo",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/41858414-grandpa-christmas"
}