{
  "title": "Laika's Window: The Legacy of a Soviet Space Dog",
  "description": "The unforgettable story of Laika the Soviet space dog, the Cold War, and the Space Race between the United States and the Soviet UnionLaika began her life as a stray dog on the streets of Moscow and died in 1957 aboard the Soviet satellite Sputnik II. Initially the USSR reported that Laika, the first animal to orbit the earth, had survived in space for seven days, providing valuable data that would make future manned space flight possible. People believed that Laika died a painless death as her oxygen ran out. Only in recent decades has the real story become public: Laika died after only a few hours in orbit when her capsule overheated. Laika’s Window positions Laika as a long overdue hero for leading the way to human space exploration.Kurt Caswell examines Laika’s life and death and the speculation surrounding both. Profiling the scientists behind Sputnik II, he studies the political climate driven by the Cold War and the Space Race that expedited the satellite’s development. Through this intimate portrait of Laika, we begin to understand what the dog experienced in the days and hours before the launch, what she likely experienced during her last moments, and what her flight means to history and to humanity. While a few of the other space dog flights rival Laika’s in endurance and technological advancements, Caswell argues that Laika’s flight serves as a tipping point in space exploration “beyond which the dream of exploring nearby and distant planets opened into a kind of fever from which humanity has never recovered.”Examining the depth of human empathy—what we are willing to risk and sacrifice in the name of scientific achievement and our exploration of the cosmos, and how politics and marketing can influence it—Laika’s Window is also about our search to overcome loneliness and the role animals play in our drive to look far beyond the earth for answers.",
  "genres": [
    "History",
    "Nonfiction",
    "Animals",
    "Space",
    "Science",
    "Dogs",
    "Russia"
  ],
  "author": "Kurt Caswell",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/41845346-laika-s-window"
}