{
  "title": "The Great Inflation and Its Aftermath: The Past and Future of American Affluence",
  "description": "It’s a giant gap in our history. The Great Inflation, argues award-winning columnist Robert J. Samuelson in this provocative book, was the worst domestic policy blunder of the postwar era and played a crucial role in transforming American politics, economy, and everyday life–and yet its story is hardly remembered or appreciated. In these uncertain economic times, it is more imperative than ever that we understand what happened in the 1960s and 1970s, lest we be doomed to repeat our mistakes.From 1960 to 1979, inflation rose from barely more than 1 percent to nearly 14 percent. It was the greatest peacetime inflationary spike in this nation’s history, and it had massive repercussions in every area of our lives. The direct consequences included Ronald Reagan’s election to the presidency in 1980, stagnation in living standards, and a growing belief–both in America and abroad–that the great-power status of the United States was ending. The Great Inflation and Its Aftermath traces the origins and rise of double-digit inflation and its fall in the brutal 1981-82 recession, engineered by the Federal Reserve under then-chairman Paul Volcker and with the staunch backing of Reagan.But that is only half the story. The end of high inflation triggered economic and social changes that are still with us. The stock market and housing booms were both direct outcomes; American business became more productive–and also much less protective of workers; and globalization was encouraged.We cannot understand today’s world, Samuelson contends, without understanding the Great Inflation and its aftermath. Nor can we prepare for the future unless we heed its lessons. This incisive and enlightening book will stand as the authoritative account of a watershed event of our times.Praise for The Great Inflation and Its Aftermath\"Newsweek and Washington Post columnist Samuelson is one of the rare journalists who debates politics and economics with a healthy skepticism toward conventional wisdom. Politicians would do well to study [the errors] the past that teach that choosing quick fixes only delays and worsens the inevitable.” – Booklist\"If you want to understand the economic events of the last half century, you should read. . . Robert Samuelson's The Great Inflation and Its -- U.S News & World Report.",
  "genres": [
    "Economics",
    "History",
    "Business",
    "Finance",
    "Nonfiction",
    "Politics"
  ],
  "author": "Robert J. Samuelson",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/4184102-the-great-inflation-and-its-aftermath"
}