{
  "title": "NC-17",
  "description": "A missing Youtube star. A bank heist gone wrong. A mysterious health retreat for celebrities. Too many ex-fiancés. A growing body count. Oh…and possibly Bigfoot.Just another week in the life of Maizie Albright, Star Detective.\nFrom the Wall Street Journal bestselling author, Larissa Reinhart, the third book in the \"sassy, sexy, and fun\" Maizie Albright Star Detective series.“Larissa writes a delightful book. Suspense, romance, and some funny situations. Maizie’s a teen star grown up to new possibilities.” — Sharon Salituro, Fresh Fiction#StillDetectiveing As an ex-star of a hit teen detective show, Maizie Albright gets the youth demographic. Or so she thought. Now that she’s adulting, today’s kids make Maizie feel out of date. At least the teen Youtube stars of Bigfoot Trackers who want to hire her to look into the disappearance and possible murder of their producer. A murder the police find as likely as Bigfoot.Maizie has her own suspicions about the new celebrity retreat where their missing person was last seen. Particularly when she learns her ex-fiancé has been hired to run the Center. Kind of an issue when she thought Oliver was in prison. Kind of an issue when Nash, the man of her dreams, is out of commission. Wait, not man of her dreams. Boss of her fantasies. Professionally speaking, of course.While Maizie’s looking for a missing Youtube star, she’s wrangling her mother’s wedding, assuaging an overzealous probation officer, and struggling to keep Nash Security Solutions solvent. Conspiracy theories collide with real-life catastrophes beginning with murder and possibly ending with Maizie’s life. Books in the Maizie Albright Star Detective series:15 MINUTES (#1)16 MILLIMETERS (#2)A VIEW TO A CHILL (#3)NC-17 (#4)18 CALIBER (#5, 2019)Other mystery series by Larissa Reinhart:A Cherry Tucker Mystery seriesA Finley Goodhart Crime Caper series",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Humor",
    "Contemporary",
    "Chick Lit"
  ],
  "author": "Larissa Reinhart",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/41886927-nc-17"
}