{
  "title": "Diana and Jackie: Maidens, Mothers, Myths",
  "description": "History has seen only a few women so magical, so evanescent, that they captured the spirit and imagination of their times. Diana, Princess of Wales and Jacqueline Kennedy Onassis were two of these rare creatures. They were the most famous women of the twentieth century ~ admired, respected, even adored at times; rebuked, mocked and reviled at others. Separated by nationality and a generation apart, they led two surprisingly similar lives.Both were the daughters of acrimonious divorce. Both wed men twelve years their senior, men who needed \"trophy brides\" to advance their careers. Both married into powerful and domineering families, who tried, unsuccessfully, to tame their willful independence. Both inherited power through marriage and both rebelled within their official roles, forever crushing the archetype. And both revolutionized dynasties.And yet in many ways they were completely different: Jackie lived her life with an English \"stiff upper lip\" ~ never complaining, never explaining in the face of immense public curiosity. Diana lived her life with an American \"quivering lower lip\" ~ with televised tell-alls, exposing her family drama to a world eager for every detail.These two lives have been well documented but never before compared. And never before examined in the context of their times. Jay Mulvaney, author of Kennedy Weddings and Jackie: The Clothes of Camelot, probes the lives of these two twentieth century icons and discovers: The nature of their personalities forged from the cradle by their relationships with their fathers, Black Jack Bouvier and Johnny Spencer.·Their early years, and their early relationships with men.·Their marriages, and the truth behind the lies, the betrayals and the arrangements.·Their greatest achievements: motherhood.·Their prickly relationships with their august mothers-in-law, Rose Fitzgerald Kennedy and Queen Elizabeth II· Their lives as single women, working mothers.· Their roles as icons and archetypes.Graced with never before seen photographs from many private collections, and painstakingly researched, 0Diana and Jackie presents these two remarkable and unique women as they have never been seen before.",
  "genres": [
    "Biography",
    "Nonfiction"
  ],
  "author": "Jay Mulvaney",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/418763.Diana_and_Jackie"
}