{
  "title": "The Lobster Lake Bandits: Mystery at Moosehead",
  "description": "A Maine Mystery\"This book will make you want to visit Maine.\"\"Suspense. Romance. Mystery. This book has it all.\"When Sarah, a travel writer from New York City, gets sent to Maine on assignment, she's reluctant to go. The Moosehead Lake region is a place of only bad memories for her. What she discovers about herself, her family, and a Boston crime is so much larger than a story for a magazine article.Three generations of the Parker family had grown up in the woods near Maine’s Lobster Lake. The Parkers knew the roads, trails, and lakes around their cabin better than anyone, except maybe the local game warden. It was always a peaceful and safe place. That all changed the year the oddly dressed stranger stalked their woods, and the bandits caused some serious trouble.**************************Praise for \"The Lobster Lake Bandits - Mystery at Moosehead\"\"The Lobster Lake Bandits is a real mystery thriller set in the north woods of rural Maine. The story will keep you hooked right up until the end. It indeed is a great read.\" - - John Ford Sr.Retired Maine Game Warden and County SheriffAuthor of Suddenly, the Cider Didn't Taste So Good: Adventures of a Game Warden in Maine.**************************\"Refreshing and beautiful, Tommy Carbone's new book goes back to nature in Maine. He describes the beauty of the natural environment in northern Maine near the Moosehead Lake region.Carbone is a natural storyteller. His descriptions and dialogue make the characters come alive. I loved the whole book and recommend it highly.\" - - Pat Davidson ReefThe Book CornerMaine's Journal Tribune**************************The Lobster Lake Bandits, is a very compelling read. I particularly enjoyed it because the story is set in the woods and on the waters north of Greenville, Maine and Moosehead Lake, a place I know very well.I raced through the book in a weekend eager to find out how the book ended!\"- - George Smith, review in Maine's Bangor Daily NewsMaine Outdoor Writer and former Executive Director for theSportsman's Alliance of Maine",
  "genres": [
    "Fiction"
  ],
  "author": "Tommy Carbone",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/41885431-the-lobster-lake-bandits"
}