{
  "title": "The Undocumented Americans",
  "description": "One of the first undocumented immigrants to graduate from Harvard reveals the hidden lives of her fellow undocumented Americans in this deeply personal and groundbreaking portrait of a nation.Writer Karla Cornejo Villavicencio was on DACA when she decided to write about being undocumented for the first time using her own name. It was right after the election of 2016, the day she realized the story she'd tried to steer clear of was the only one she wanted to tell. So she wrote her immigration lawyer's phone number on her hand in Sharpie and embarked on a trip across the country to tell the stories of her fellow undocumented immigrants--and to find the hidden key to her own.Looking beyond the flashpoints of the border or the activism of the DREAMers, Cornejo Villavicencio explores the lives of the undocumented--and the mysteries of her own life. She finds the nation of singular, effervescent characters often reduced in the media to political pawns or nameless laborers. The stories she tells are not deferential or naively inspirational but show the love, magic, heartbreak, insanity, and vulgarity that infuse the day-to-day lives of her subjects.In New York, we meet the undocumented workers who were recruited into the federally funded Ground Zero cleanup after 9/11. In Miami, we enter the ubiquitous botanicas, which offer medicinal herbs and potions to those whose status blocks them from any other healthcare options. In Flint, Michigan, we learn of demands for state ID in order to receive life-saving clean water. In Connecticut, Cornejo Villavicencio, childless by choice, finds family in two teenage girls whose father is in sanctuary. And through it all we see the author grappling with the biggest questions of love, duty, family, and survival.In her incandescent, relentlessly probing voice, Cornejo Villavicencio combines sensitive reporting and powerful personal narratives to bring to light remarkable stories of resilience, madness, and death. Through these stories we come to understand what it truly means to be a stray. An expendable. A hero. An American.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Audiobook",
    "Social Justice",
    "Race",
    "Essays"
  ],
  "author": "Karla Cornejo Villavicencio",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/41880092-the-undocumented-americans"
}