{
  "title": "Blue Horses Rush In: Poems and Stories (Volume 34)",
  "description": "Wrapped in blankets and looking at the stars, a young Navajo girl listened long ago to stories that would guide her for the rest of her life. \"Such summer evenings were filled with quiet voices, dogs barking far away, the fire crackling, and often we could hear the faint drums and songs of a ceremony somewhere in the distance,\" writes Luci Tapahonso in this compelling collection.Blue Horses Rush In takes its title from a poem about the birth of her granddaughter Chamisa, whose heart \"pounded quickly and we recognized / the sound of horses / the thundering of hooves on the desert floor.\" Through such personal insights, this collection follows the cycle of a woman's life and underlines what it means to be Navajo in the late twentieth century. The book marks a major accomplishment in American literature for its successful blending of Navajo cultural values and forms with the English language, while at the same time retaining the Navajo character. Here, Luci Tapahonso walks slowly through an ancient Hohokam village, recalling stories passed down from generation to generation. Later in the book, she may tell a funny story about a friend, then, within a few pages, describe family rituals like roasting green chiles or baking bread in an outside oven. Throughout, Tapahonso shares with readers her belief in the power of pollen and prayer feathers and sacred songs.Many of these stories were originally told in Navajo, taking no longer than ten minutes in the telling. \"Yet, in recreating them, it is necessary to describe the land, the sky, the light, and other details of time and place,\" writes Tapahonso. \"In this way, I attempt to create and convey the setting for the oral text. In writing, I revisit the place or places concerned and try to bring the reader to them, thereby enabling myself and other Navajos to sojourn mentally and emotionally in our home, Dinétah.\"",
  "genres": [
    "Poetry",
    "Native American",
    "Fiction",
    "Short Stories",
    "Indigenous",
    "Adult",
    "Native Americans"
  ],
  "author": "Luci Tapahonso",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/418715.Blue_Horses_Rush_In"
}