{
  "title": "Lady Chatterly's Lover",
  "description": "Constance, the young Lady Chatterly, is married to a handsome, well-built man. Clifford, her husband, was wounded in the war, and is paralyzed from the waist down. His physical limitations lead him to emotionally neglect Constance, and for comfort, she turns to the gamekeeper, Oliver. In his arms, she finds the passion she needs, even as she struggles with the class differences between the intellectuals and the working class. She realizes that she cannot with the mind alone, but that she also needs her body to be alive.Told in a blunt style, with explicit descriptions of sex, Lady Chatterly's Lover used language largely unseen in print at that time, which resulted in its banning and the author's censorship. Indeed, the book is perhaps most famous for its publication history. First published in 1928, it was printed privately in Italy. It was immediately banned in both the author's home of England and in the USA. Expurgated, abridged editions were published in the 1930s in the English-speaking world. In 1960, the case R v Penguin Books Ltd prosecuted Penguin Books for publishing the novel under the Obscene Publications Act. The jury found for the defendant, usher in the liberalization of British publishing.In the USA, the book was part of a three-book test case (along with Tropic of Cancer and Fanny Hill), to overturn the ban on obscene imported books first enacted in the Smoot-Hawley Tariff Act of 1930. The US Court of Appeals found in favor of the books in 1959, overturning the ban on the grounds that the books had \"redeeming social or literary value.\"Thus, the original, unexpurgated edition (presented here) finally appeared in English for the first time more than thirty years after it was written.About the author:David Herbert Lawrence (1885-1930) was a prolific writer working in a wide range of styles and forms. A major theme in his work is discussion of the dehumanizing effects of modernity and industrialization, confronting issues relating to emotional health and vitality, spontaneity, sexuality, and instinctive behavior. By the time of his death from tuberculosis, he was considered a pornographer who had wasted his talents. Some however, challenged that view. E.M. Forster, writing an obituary of Lawrence, described him as \"the greatest imaginative novelist of our generation.\" Later, critics championed his reputation, noting his artistic integrity and moral seriousness, and assigning his fiction to the \"great tradition\" of the English novel. He is now considered a visionary thinker and a significant representative of modernism in English literature.",
  "genres": [
    "Fiction",
    "Romance",
    "Classics",
    "Literature",
    "Banned Books",
    "Historical Fiction",
    "Novels"
  ],
  "author": "D.H. Lawrence",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/41887005-lady-chatterly-s-lover"
}