{
  "title": "Silence Dogood / The Busy-Body / Early Writings",
  "description": "Note: When first issued, the Library of America edition of Franklin's Writings was collected in one large volume; later, it was published as two separate volumes.Statesman, scientist, philosopher, printer, and civic leader, Benjamin Franklin was also the most powerful writer of his time. From his first appearance in print, in the guise of the eccentric, opinionated, voluble “Silence Dogood” (1722), to his last published article, a searing satire against slavery (1790), he covered every aspect of “the question of America” with radiant clarity, wit, and penetration.This Library of America collection begins with items written by Franklin during his early years in Boston and London (1722–1726), including the complete “Silence Dogood” essay series. The volume also includes the famous “Busy-Body” essays (1728–1729); many of the news articles and essays he penned after he purchased the failing Pennsylvania Gazette (which eventually became the most widely read newspaper in the colonies); and various political satires, pamphlets, and personal correspondence written while he lived in Philadelphia from 1726 to 1757. The book concludes with material he published while a diplomat in London from 1757 to 1775 (including letters to the press, satires, and pamphlets).Controversial in his own time, and the subject of vigorous debate ever since—to Matthew Arnold he exemplified “victorious good sense,” while to D. H. Lawrence he was “the first dummy American”—Franklin emerges in this collection as a figure of extraordinary complexity for readers to discover, consider, and appreciate anew.A companion volume includes Poor Richard’s Almanack, Franklin’s classic Autobiography, and his later writings.",
  "genres": [
    "History",
    "Classics",
    "American History",
    "Literature"
  ],
  "author": "Benjamin Franklin",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/418851.Silence_Dogood_The_Busy_Body_Early_Writings"
}