{
  "title": "Magdalena",
  "description": "Cecilia Manguerra Brainard has written an ambitious novel of forbidden love. Set against the turbulent history of East Asia in the twentieth century and by turns erotic and tragic, Magdalena vividly depicts three generations of strong Filipino women.Aimee Liu , author of Cloud Moutain I have been looking for a good story about the war. N.V.M. Gonzalez, author of The Bread of Salt and Other Stories (upon reading \"Winning Hearts and Minds,\" one chapter of Magdalena.) With her second novel, Magdalena, Cecilia Brainard adds new portraits to the gallery in Philippine literature. She has always had a strong sense of place. Here, she provides an inner landscape as well. Together, these provide the coordinates for the family secrets that bind the characters as securely as bloodlines.Linda Ty-Casper , author of The Stranded Whale In this novel, Brainard blends a series of multiple perspectives to create a polyphony of voices that enacts Philippine society before and during the Second World War. The narrative is a nuanced vision of the workings of culture, social class, obligation and the Filipino personality.Rocio G. Davis , author of Transcultural Asian American and Asian Canadian Short Story Cycles About Brainar's first novel When the Rainbow Goddess Wept -- The strengthening of the national spirit; the loss of innocence in two generations -- these themes are explored by the author, who was born in the Philippines, with persuasive conviction and stark realism.Publishers Weekly A fast-paced, sensitively written first novel about the psychological damage war wreaks, seen through the eyes of an intelligent, resilient young girl . . . Brainard's appealing characters are larger-than-life people who change before our eyes, yet remain utterly convincing.Kirkus Review Stories of war are perhaps most compelling when told through the eyes of children, whose innocence is always so tragically incongruous to the adult madness that rages around them.Los Angeles Times",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Romance"
  ],
  "author": "Cecilia Manguerra Brainard",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/1003158.Magdalena"
}