{
  "title": "Undivided Rights: Women of Color Organizing for Reproductive Justice",
  "description": "“If you have come to help me, please go away. But, if you have come because your liberation is bound up with mine, let us work together.”—Lila Watson, Aboriginal Activist Vibrant. Strong. Fierce. Undivided Rights captures the evolving and largely unknown activist history of women of color organizing for reproductive justice—on their own behalf. Undivided Rights presents a fresh and textured understanding of the reproductive rights movement by placing the experiences, priorities, and activism of women of color in the foreground. Using historical research, original organizational case studies, and personal interviews, the authors illuminate how women of color have led the fight to control their own bodies and reproductive destinies. Undivided Rights shows how women of color—-starting within their own Latina, African American, Native American, and Asian American communities—have resisted coercion of their reproductive abilities. Projected against the backdrop of the mainstream pro-choice movement and radical right agendas, these dynamic case studies feature the groundbreaking work being done by health and reproductive rights organizations led by women-of-color. The book details how and why these women have defined and implemented expansive reproductive health agendas that reject legalistic remedies and seek instead to address the wider needs of their communities. It stresses the urgency for innovative strategies that push beyond the traditional base and goals of the mainstream pro-choice movement—strategies that are broadly inclusive while being specific, strategies that speak to all women by speaking to each woman. While the authors raise tough questions about inclusion, identity politics, and the future of women’s organizing, they also offer a way out of the limiting focus on “choice.” Undivided Rights articulates a holistic vision for reproductive freedom. It refuses to allow our human rights to be divvied up and parceled out into isolated boxes that people are then forced to pick and choose among.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Race",
    "Social Justice",
    "Politics",
    "Gender",
    "History"
  ],
  "author": "Loretta J. Ross",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/419260.Undivided_Rights"
}