{
  "title": "Cards of Love: The Emperor",
  "description": "Fawn Bailey presents The Emperor, a STANDALONE full-length dark romance novel.\nIn Venice, Italy, a world of cursed diamonds, hidden secrets and twisted fantasies awaits a star-crossed couple who were meant to be together. But can they work together to bring down a villain? And will their love survive it all... or break into a thousand pieces?  GINGER I've always been a pawn. That stops now. I'm ready to play. I'm ready to win. My past is catching up with me. I left everything behind twice - first, when my sister killed her twin and our parents, and then again when I walked away from the love of my life, my soulmate, Ryker Marino. Now, both of my worlds are colliding. My sister is coming for me, but not if I find her first. Astor is crazy. Evil. She won't stop until she's killed our entire family. I follow her to the other side of the world - Venice, Italy. Here, a game of cat and mouse draws me further into her trap. Here, one of us will end the other. But what Astor doesn't know... is that I'm ready for a fight.  RYKER I'm The Emperor. L'Imperatore. And I'm going to win my girl back. Ginger disappeared without a trace seven years ago. I uprooted my life because of her. I moved to a different continent. I became obsessed with a cursed diamond that has shaped my family's lives for centuries. But what if the stone isn't to blame for our misfortune? What if everything, including losing Ginger all those years ago, is my fault? I have to face my fears. I have to find Ginger. I have to bring her back. But there is a third player involved in this game of chess... And she's about to beat us both.  Fawn Bailey is the pen name of USA Today bestselling author Isabella Starling. Ryker & Ginger first appear in Fawn's series Gilded Cage.",
  "genres": [
    "Romance",
    "Dark",
    "Contemporary Romance",
    "Contemporary",
    "Dark Romance",
    "Suspense",
    "Erotica"
  ],
  "author": "Fawn Bailey",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/41902803-cards-of-love"
}