{
  "title": "The Man Who Wrote the Book",
  "description": "A hilarious, ingeniously conceived, sexy romp of a novel, The Man Who Wrote the Book is another triumph by novelist Erik Tarloff, author of the critically acclaimed national best-seller Face-Time .Ezra Gordon's life is falling apart. His job as an underpaid literature professor at a small Baptist college in California is in jeopardy because he can't get his act together to write any articles for academic journals, he has a ferocious case of writer's block and hasn't written a poem in years, and he is in a lukewarm relationship with the icily disapproving Carol, daughter of the fearsome college trustee, the  Reverend Dimsdale. And his doctor has just told him that, physically, at the age of 35, it's all downhill from here.  To escape a dreary spring break on campus, Ezra heads to Los Angeles to visit Isaac Schwimmer, an old college friend. There's nothing wrong with Isaac's life -- he's a fabulously successful publisher of pornographic books, his social life is a bachelor's fantasy, and he lives next door to a Penthouse model as smart as she is beautiful (well, almost). When Isaac proposes that Ezra write a dirty book for a little fast cash, Ezra takes him up on the offer. Little does he know that his book, Every Inch a Lady (by \"E.A. Peau\") will radically change his life, and throw the campus into chaos.        The Man Who Wrote the Book, while evoking great academic satires from authors like David Lodge and Kingsley Amis and inviting comparison to Philip Roth's sexy masterpiece Portnoy's Complaint , remains the unique vision of Erik Tarloff. With his singular blend of humor, sharp insight into human relations, and a poignant understanding of the human spirit, Erik has established himself as an engaging, provocative -- and extremely funny -- force in modern American literature.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Novels"
  ],
  "author": "Erik Tarloff",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1235056.The_Man_Who_Wrote_the_Book"
}