{
  "title": "Celebrated Cases Of Judge Dee",
  "description": "Long before Western writers had even conceived the idea of writing detective stories, the Chinese had developed a long tradition of literary works that chronicled the cases of important district magistrates. These judges held a unique position. As \"fathers to the people\" they were at once judge and detective, responsible for all aspects of keeping the peace and for discovering, capturing, and punishing criminals.One of the most celebrated historical magistrates was Judge Dee, who lived in the seventh century A.D. This book, written in the eighteenth century by a person well versed in the Chinese legal code, chronicles three of Judge Dee's most celebrated cases, interwoven to form a novel. A double murder among traveling merchants, the fatal poisoning of a bride on her wedding night, and an unsolved murder in a small town under Judge Dee's jurisdiction — these are the crimes. They take Judge Dee up and down the great silk routes, through clever disguises, into ancient graveyards where he consults the spirits of the dead, and through some clever deduction.After translating Dee Goong An, Robert Van Gulik continued the adventures of Judge Dee in fiction he wrote himself. This, however is the only place where you can find the originals of Judge Dee, the venerable Sergeant Hoong, the treacherous Ma Joong, and the other members of Dee's detective force. As the first publication of Dee Goong An in the United States, this edition makes these cases accessible for the first time.While the cases are superb for reading, they also show the Chinese system of law enforcement and legal proceedings (which are quite different from Western forms). Van Gulik has provided a thorough introduction and appendix with much information on Chinese detective novels, the Chinese system of justice, and particularly relevant aspects of Chinese law that play a part in these stories.",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "China",
    "Crime",
    "Historical",
    "Classics"
  ],
  "author": "Robert van Gulik",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/419389.Celebrated_Cases_Of_Judge_Dee"
}