{
  "title": "The Pop Larkin Chronicles: The Darling Buds of May",
  "description": "These three novellas by H. E. Bates were the inspiration for the popular British television series subsequently imported for American public television. Set in the English countryside in the 1950s, they feature the eccentric Larkin family, whose wholehearted and riotous enjoyment of life has brought pleasure to thousands of British readers since Darling Buds was first published in 1958. From the moment Pop Larkin tells his family that their world is \"perfick,\" H. E. Bates transports the reader into the delights of an England where the larger-than-life Pop and Ma, together with their children, squeeze every drop of enjoyment out of life and never let a cloud darken their days. The Larkins may live in a junkyard in rural England, but they never fail to see beauty all around them, and they bring light into the lives of all who come into contact with them, be they tax inspector, vicar, or lord. The charm, comedy, and warmth of these three Larkin books have captured British audiences for over thirty years. The uninhibited exploits of the boisterous and hilarious family will now enchant American readers. In the title story, a tax collector comes to extract the never-paid taxes on the Larkin farm but is seduced into staying on forever. In A Breath of French Air, the Larkins travel to France in an effort to dispel gray moods. They struggle with everything from the language to the cuisine and return to England with a huge bill but also priceless comic memories. In When the Green Woods Laugh, a couple from London buys a mansion from Pop, and he uses the proceeds to build a swimming pool. Later they take Pop to court, but before long he's christening the pool with a boisterous party and celebrating a victorious court case.",
  "genres": [
    "Fiction",
    "Humor",
    "Classics",
    "British Literature"
  ],
  "author": "H.E. Bates",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/419263.The_Pop_Larkin_Chronicles"
}