{
  "title": "Upheaval",
  "description": "VICTORY IS AT HAND! ALL THEY NEED IS A MIRACLE…The evil Emperor is in our heroine’s sights—all she needs now is a military and cultural miracle.  It’s the dead of winter, and the Terrans hold the line as the Conglomeration is holed-up in a makeshift camp, prickly with nervous excitement, preparing for a massive offensive into wealthy Merriton—the gaudy Conglomerate city in which Sal was enslaved as a child. But the next battle will have to wait. Sometimes, things even more personal than war get in the way—like hormones.   Unimaginably powerful Salryc Luxx, Kaisae of all Iliri and de facto Queen of the Conglomerate forces, is finally brought to her knees—by ovulation. So is Shade, her partbred iliri warrior-sister. To avoid hormonal confusion, and, well, the entire Black Blades from instinctively tearing each other and all other male allies apart with protective rage and sexual prowess, all parties are separated—iliri from humans, men from women, Sal from her pack—stuck in a holding pattern while the battle lines move closer. And nobody is more annoyed by being cooped up with nothing to do than Sal.  When the women finally free themselves from self-imposed quarantine (and reforge their sexual bonds with their mates), it’s back to work. The allies continue to collaborate, this time enacting a meticulously-laid plan to quietly infiltrate Terric’s diamond of a city as spies. Part of the fun in this volume is the detailed unfolding of the riveting military plot, which has all the thrills of a Russian spy novel.  Like all of the Rise of the Iliri novels, this epic fantasy story focuses on loving relationships, platonic and romantic, with a steamy reverse harem theme. Sal’s erotic love scenes with her three male mates are explicit and almost unbearably titillating, although not for all readers—especially those under eighteen.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Science Fiction",
    "Aliens",
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/41951502-upheaval"
}