{
  "title": "Outfox",
  "description": "One man with multiple identitiesEight women who vanished without a traceThe next likely victim…his wife Weston Graham is a chameleon. He has gone by many names, worn many faces, and assumed many personalities. These incarnations have enabled him to bilk wealthy women of their fortunes...and then to disappear along with the women, only to resurface with a new identity and his sights set on another victim. FBI agent Drex Easton is relentlessly driven by a single goal: to outmaneuver the conman once known as Weston Graham. Over the past thirty years, Weston has assumed many names and countless disguises, enabling him to lure eight wealthy women out of their fortunes before they disappeared without a trace. The only common trait among the victims: a new man in their life who also vanished, leaving behind no evidence of his existence. Drex is convinced that these women have been murdered, and that the man he knows as Weston Graham is the sociopath responsible. But each time Drex gets close to catching him, Weston trades one persona for another and disappears again. Now, for the first time in their long game of cat and mouse, Drex has a suspect in sight. Attractive and charming, Jasper Ford is recently married to a successful businesswoman many years his junior, Talia Shafer. Drex insinuates himself into their lives, posing as a new neighbor and setting up surveillance on their house. The closer he gets to the couple, the more convinced he becomes that Jasper is the clever, merciless predator he’s sought-and that his own attraction to Talia threatens to compromise his purpose and integrity. This is Drex’s one chance to outfox his cunning nemisis before he murders again and eludes justice forever. But first he must determine if the desirable Talia is a heartless accomplice . . . or the next victim.",
  "genres": [
    "Romantic Suspense",
    "Mystery",
    "Thriller",
    "Romance",
    "Suspense",
    "Fiction",
    "Audiobook"
  ],
  "author": "Sandra       Brown",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/41964246-outfox"
}