{
  "title": "The Soul of Power",
  "description": "One young woman learns the true nature of power—both her own and others’—in the riveting conclusion to The Waking Land Trilogy.“Bates brilliantly concludes an impressive high fantasy trilogy with this tale of scheming and magic.”—Publishers Weekly (starred review) Sophy Dunbarron—the illegitimate daughter of a king who never was—has always felt like an impostor. Separated from her birth mother, raised by parents mourning the loss of their true daughter, and unacknowledged by her father, Sophy desires only a place and a family to call her own. But fate has other ideas. Caught up in Elanna Valtai’s revolution, Sophy has become the reigning monarch of a once-divided country—a role she has been groomed her whole life to fill. But as she quickly discovers, wearing a crown is quite a different thing from keeping a crown. With an influx of magic-bearing refugees pouring across the border, resources already thinned by war are stretched to the breaking point. Half the nobility in her court want her deposed, and the other half question her every decision. And every third person seems to be spontaneously manifesting magical powers. When Elanna is captured and taken to Paladis, Sophy’s last ally seems to have vanished. Now it is up to her alone to navigate a political maze that becomes more complex and thorny by the day. And worse, Sophy is hiding a huge secret—one that could destroy her tenuous hold on the crown forever.   “Sophy is truly a feminist she embraces equality and justice for all—a theme running throughout the novel—while challenging societal norms.”—Booklist  Don’t miss any of Callie Bates’s magical Waking Land THE WAKING LAND • THE MEMORY OF FIRE • THE SOUL OF POWER",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Romance",
    "Science Fiction Fantasy",
    "Young Adult Fantasy",
    "Fantasy Romance"
  ],
  "author": "Callie Bates",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/41958549-the-soul-of-power"
}