{
  "title": "If the Ice Had Held",
  "description": "\"I gave myself over to this story and felt as though I had inhabited these characters.\"- Benjamin Percy, author of The Dark NetMelanie Henderson's life is a lie. Scandal surrounds her birth, her life, her identity. A scandal that could rock her small, conservative Colorado town. Her birth mother was just 14, unmarried to her father, a local boy who drowned when he tried to take a shortcut across an icy river.Will she learn the truth...?Thirty-five years later, in Denver, Melanie dabbles in affairs with married men while clinging to a corporate job that gives her life order even as her tenuous relationships fall apart. She still hasn't learned that the woman who raised her is actually her aunt--or that her birth mother visits her almost every day. This fiercely-guarded secret bonds the two most important women in her life, who hatched a plan to trade places and give Melanie a life unmarred by shame. Yet, as a forest fire rages through the Rocky Mountains and a car accident shakes the family, Melanie finds herself at the center of an unraveling tangle of tragedy and heartbreak.\"If the Ice Had Held is a stunning novel. From its very first pages, I was captivated by the vivid intimacy of Wendy J. Fox's prose and her generous sense of character. Indelible, insightful, and deeply moving, If the Ice Had Held illustrates the complex bonds of family--the terrible ways we hurt one another, the sacrifices we make to save one other.\" - Jillian Medoff, bestselling author of This Could Hurt\" If the Ice Had Held , at its heart a story about second chances, is both haunting and luminous. Fox has crafted an intricate mosaic shimmering with gorgeous prose.\" - Heather Bell Adams, author of Maranatha Road\"The layering of diverse stories and perceptions, a key feature of the novel, results in nuanced portrayals of characters and circumstances, making it impossible to categorize anyone as purely good or bad. This complexity feels true to life, and it makes for a gratifying read.\"- Small Press Picks",
  "genres": [
    "Fiction",
    "Audiobook",
    "American",
    "Adult Fiction"
  ],
  "author": "Wendy J. Fox",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/41967127-if-the-ice-had-held"
}