{
  "title": "Wisdomkeepers of Stonehenge: The Living Libraries and Healers of Megalithic Culture",
  "description": "Reveals how Stonehenge was an extraordinary astronomical calendar used in the cultivation of ingredients for long-forgotten botanical cures• Explores how Stonehenge and other stone circles were ancient healing sanctuaries and celestial calculators for the preparation of natural medicines• Explains how the megalithic priesthood--and their successors, the Druids--developed astonishing memory techniques to preserve knowledge over generations• Draws upon the very latest discoveries from recent archaeological excavations and overlooked historical source materialStonehenge is just one of thousands of stone circles erected throughout Britain and Ireland for over three millennia from 3,000 BC on. How did this building tradition survive for so long, over such a large area and with such complexity and uniformity, when the people of the British Isles lived in separate, isolated communities and left no evidence of a central leadership or obvious communication network?Graham Phillips argues that these stone circles are evidence of an astonishing system of healthcare and preservation of ancient medical knowledge that held together a society scattered across the British Isles. With stones aligned to the sun, moon, and certain stars, these ancient monuments enabled the precise timings necessary for the cultivation of medicinal plants. He explains how the megalithic priesthood possessed medical knowledge well beyond their time and may even have discovered a cure for cancer. Furthermore, because they had no form of writing, the megalithic people developed phenomenal memory techniques to preserve their knowledge over many generations, resulting in a class of wisdomkeepers that were not only healers but the living libraries of their culture.Drawing upon the latest discoveries from recent archaeological excavations and overlooked historical source material, Phillips reveals that the megalithic culture survived far longer than previously thought and that the people who held it together were an enigmatic shamanic sect ultimately called the Druids. Uncovering the secrets of ancient megalithic culture and the purpose of their enigmatic stone circles, Phillips contends that all the evidence has now been gathered to unlock the secrets encoded in the stones--and perhaps discover remedies for diseases still uncured by modern medicine today.",
  "genres": [
    "Spirituality"
  ],
  "author": "Graham Phillips",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/41953416-wisdomkeepers-of-stonehenge"
}