{
  "title": "The Dark Wood",
  "description": "A young woman trapped in darkness faces a choice--a chance for love or the freedom of light? Stella lives in Noctum, land of eternal night. In Noctum, the stars shine so bright it feels like you can pluck them from the sky, festivals are held for each special moon, and the Northern Lights are worshipped every wintertide. But the darkness hides many sins. Draven, Noctum’s ruthless immortal king, rules behind the protective walls of Caligo. While, outside in Darkwood, Stella and the other forest dwellers live in terror of foul creatures called the Shade. Life in Darkwood is brutal and brief. When her brother, a soldier in the Shadow Guard, is killed, Stella’s hope wanes as the dangers that surround her close in. But stars shine brightest in the deepest dark, and when she witnesses one falling into the black heart of Darkwood, hope arrives in the unlikeliest manner. A stranger named Luc appears speaking of strange, impossible things—of a golden disc called the sun, of lands drenched in light with vivid blue skies, and perhaps most startling of all, he claims that Noctum is under a curse that he has come to lift. To banish the darkness that covers the land, all he has to do is kill Draven. But curses are never easily broken and complications soon arise. Stella finds herself faced with an impossible choice—Luc’s life or the light she so desperately longs for. Because to gain one, she will have to lose the other. ★★★★★ Dangerously alluring, this is a story that will immerse you in its world and leave you wanting more. ★★★★★ This is an unputdownable book. If you love fantasy and world-building and a strong female lead, you will love love love this book. ★★★★★ This book is elegant. That's the best way I can think to describe it, and elegant encompasses the prose, the storytelling, the main character, and the villain. ★★★★★ I could not get enough of this book. Not only is the writing absolutely gorgeous and the characters enticing, the world is fresh, clean, and easy to slip right into. I wish I could turn back time and start reading this book with fresh eyes once again. ★★★★★ Beautifully written love story. I still want to read it even though I finished. It's a book that teaches lessons about life choices within an exciting fantasy world.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Sydney Mann",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/41959728-the-dark-wood"
}