{
  "title": "A Future With Hope",
  "description": "30 Million American are living with diabetes.  An additional 86 million Americans have prediabetes.  Diabetes is a worldwide epidemic, but the good news is we have great therapies that will allow a patient with diabetes to live a full and normal life if... it's \"well managed.\"The author, Carl S. Armato was diagnosed with Type 1 diabetes when he was 18 months old. Doctors told his parents he would go blind by his twenties, and probably not live past thirty. Today he is in his fifties, the President and CEO of Novant Health, one of America's largest and most respected healthcare organizations. He's married with three children, and thriving.Diabetes is a war, and you must fight if you want to survive.  Carl learned early on how to make the best of a bad situation.  He has embraced his disease and works diligently to keep his health under control. Only then, he knows, can he do all of the other things he wants to do in life. Often, people look at a chronic diagnosis one of two  As an excuse to give up, or with denial.With unflinching honesty, the author discusses his challenges amid the desire to live a \"normal\" life.A Future With Hope is a positive and uplifting story of what can go right when the rest of the medical world is telling you what can go wrong. This easy-to-read book is both a practical \"user's manual\" and inspirational, proving that a diagnosis doesn't have to be an end-all, and that you can still live a great life and follow your dreams.If you have a diagnosis of diabetes, this book will inspire and guide you to take ownership of the disease and embrace this new normal.  If a loved one or someone you care about has been diagnosed with diabetes, then this book will teach you how to support that person successfully.Diabetes is a never-ending disease, every hour of every day.  Diabetes never sleeps.",
  "genres": [],
  "author": "Carl S. Armato",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/41958111-a-future-with-hope"
}