{
  "title": "Jesse James and the Lost Templar Treasure: Secret Diaries, Coded Maps, and the Knights of the Golden Circle",
  "description": "An investigation into the lost treasures of Jesse James and the Freemasons and their connections to the Templars, Rosicrucians, and the Founding Fathers• Explains how Jesse James used techniques involving sacred geometry, gematria, and esoteric symbols to hide his treasures and encode maps• Provides instructions for using the encoding template employed by Jesse James and the Freemasons to hide and recover treasure and sacred relics• Shows how the encoding template confirms the existence of treasures on Oak Island and Victorio Peak and can be traced to a 16th-century book containing a secret map of the New World and the “hooked X” of the Knights TemplarJesse James left behind secret diaries and coded treasure maps. Working to decrypt these maps, Daniel J. Duke--the great-great-grandson of Jesse James--reveals hidden treasures yet to be recovered as well as connections between the infamous train robber and Freemasonry, the Knights Templar, the Founding Fathers, and Jewish mysticism.The author explains how Jesse James faked his death and lived out his final years under the name James L. Courtney. He uncovers James’ affiliation with the Knights of the Golden Circle, a secret society that buried Confederate gold across the United States, and shows how the hidden treasures coded into James’ maps were not affiliated with the KGC but with the Freemasons, the Knights Templar, and the treasure of the Temple Mount. Using sacred geometry, gematria, and the Kabbalistic Tree of Life symbol, the author explains the encoded map technique used by the Freemasons to hide and later recover treasures, an esoteric template known as the “Veil”. He shows how the Veil template confirms the locations of Jesse James’ recovered treasures in Texas as well as other suspected treasure locations, such as the Oak Island Money Pit and Victorio Peak in New Mexico.Tracing knowledge of the Veil template back through the centuries, the author reveals the Veil hidden on the cover of a 16th-century book that contains a secret map of the New World and the “hooked X” symbol of the Knights Templar. He shows how the template was used not only to hide treasures but also sacred knowledge and relics, such as within the Bruton Vault, which originally contained secrets tied to Francis Bacon, the Freemasons, the Rosicrucians, and the founding of the United States. Applying the Veil template alongside the esoteric secrets of Poussin’s famous painting, Et In Arcadia Ego , and Cassini’s Celestial Globe, Duke shows how the template reveals other Templar and Freemason treasure sites scattered throughout America and around the world.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Daniel J. Duke",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/41953417-jesse-james-and-the-lost-templar-treasure"
}