{
  "title": "Narcissus and Goldmund",
  "description": "Narcissus & Goldmund is a novel written by the German Swiss author Hermann Hesse first published as Narziß und Goldmund in 1930. At the time it was considered his literary triumph. Bibliographically, it follows Der Steppenwolf. Narcissus & Goldmund tells of a young man, Goldmund, who wanders throughout Medieval Germany upon leaving Catholic monastery school in search of the meaning of life &, thus, meaning for his life. Narcissus, a gifted young teacher at the cloister school, befriends him, as they are only a few years apart & Goldmund is very bright. Goldmund admires Narcissus, & Narcissus has much fondness for him in return. After straying too far in the fields one day on an errand gathering herbs, Goldmund comes across a beautiful woman, who kisses him & invites him to make love. This encounter is an epiphany. He realizes he was never meant to be a monk. He's filled with the desire to experience everything, learn about life & nature in his own hands-on way. With Narcissus' support, he leaves the monastery & wanders around the countryside, setting the scene for a story contrasting the artist with the thinker. It spans many years, detailing specific incidents where Goldmund learns important things. He often muses on these experiences & the ways of life. The influence of Nietzsche's theory of the Apollonian versus Dionysian spirit is evident. The polarization of Narcissus's individualist Apollonian character is contrasted to the passionately zealous disposition of Goldmund. In the spirit of The Birth of Tragedy, Hesse completes the equation by creating Goldmund as an Apollonian artist, highlighting the harmonizing relationship of the main characters. Goldmund develops into a completely rounded character as he comes to embody both Apollonian & Dionysian elements, thus capturing Nietzsche's conception of the ideal tragedy. He embodies the entire spectrum of experience, lusting for the gruesome ecstasy of the Dionysian world yet capturing & representing it thru artistic creativity. Like most of Hesse's works, the main themes are the struggle between human being & nature & the union of polar opposites. Goldmund represents art & nature, the feminine mind, while Narcissus represents science, logic, god & the masculine mind. These feminine & masculine qualities are drawn from Jungian archetypal theory, & are reminiscent of some of his earlier works, especially Demian. Throughout the novel, Goldmund increasingly becomes aware of memories of his own mother, which ultimately results in his desire to return to the Urmutter.",
  "genres": [
    "Literature",
    "Classics",
    "Germany",
    "Fiction",
    "German Literature",
    "20th Century",
    "Literary Fiction"
  ],
  "author": "Hermann Hesse",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/4196.Narcissus_and_Goldmund"
}