{
  "title": "Finding Forever",
  "description": "Jimmy and Izzy are up! Izzy Hart was his from the beginning of time... despite the fact her brothers would kill him for even looking at her.Best friends since birth, Jim and Iz grew up together and knew where their futures were heading; they just didn't tell anyone else their plans, least of all each other.Now Iz is having a baby with another man.Was Jimmy too late to claim his one and only love? Will Izzy find happiness - with him, or with the father of her baby?Come on a roller coaster ride with the Rollin crew; they're guaranteed to keep you on the edge of your seat - Again.What are reviewers saying about Finding Forever? ⭐️⭐️⭐️⭐️⭐️ \"I love this series. Jimmy Kincaid is one of my top book boyfriends of all time. Emilia Finn is a amazing storyteller.\"⭐️⭐️⭐️⭐️⭐️\"This book is about an epic love — and two peoples journey to find their way to where they belong. It’s about forgiveness. It’s about family.\" \"Finding Forever is a beautiful journey about friendship, family, honor and unconditional love. I fell more in love with Ms. Finn’s magic.\"⭐️⭐️⭐️⭐️⭐️ Jimmy Kincaid has easily become my ALL TIME FAVORITE book boyfriend!! This book is unique from all the other romance novels I have read. The way Jimmy loves Izzy is REAL! We can easily put ourselves into their thoughts and experiences. Jimmy's POV either pulls on my heartstrings or has me in tears from laughter. Thank you Emilia Finn for introducing us to the Kincaids!⭐️⭐️⭐️⭐️⭐️I love this series! These people have become my friends. I am 100% invested in their lives and I'm anxiously awaiting book #4!!!! -Mnkyf8s Amazon Review⭐️⭐️⭐️⭐️⭐️This book is such a beautiful love story. It is about romantic love and filial love as well. I love how it showed that even though one can make mistakes in life, there will always be a way out and a way to rectify them. I also love this family and how they stick together and once another special one enters their orbit they are fiercely loyal to each other and have enough love to give and keep giving. I love Izzy and Jim, and Bean. They are perfect together⭐️⭐️⭐️⭐️⭐️Oh Jimmy...he may be the youngest brother but damn is he sexy. He makes a girl just want to swoon when he finally pulls his head out of his behind and lets Iz know how he feels. Emilia pulls out all the stops in this one!! Swoonworthy men, hot sexy time, and a little action thrown in make for an amazing book!!⭐️⭐️⭐️⭐️⭐️ Didn’t think Emilia could top Bobby & Kit but boy was I wrong! This book was amazing! The Kincaids are my new favorite thing! -Peaches Amazon Review",
  "genres": [
    "Romance",
    "Sports",
    "Sports Romance",
    "Friends To Lovers",
    "Contemporary",
    "Mixed Martial Arts",
    "Contemporary Romance"
  ],
  "author": "Emilia Finn",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/42034010-finding-forever"
}