{
  "title": "Possessive Brazilian",
  "description": "Possessive Brazilian will delight fans of Jenika Snow and Alexa Riley  Possessive Brazilian is an understatement.  The first time I heard about machismo, possessiveness, jealousy, and obsession and how prevalent it can be in Latin romance, I thought it was just an exaggeration.  But when I have my first hands-on, unwanted experience the first time my company sends me to Brazil I see that it’s no exaggeration at all.  And neither is the bulge in the Speedo of the older man who comes to my rescue and tells the younger man my age “hands off” before taking matters into his own hands.  Violence isn’t my thing, but neither are grabby guys. And when that older man throws out the pervy perpetrator for not knowing how to treat a lady I have to admit I’m really relieved…and totally turned on by this possessive alpha male.  And when this possessive Brazilian tells me right away that I’m his I’m not sure it’s a case of déjà vu and I should grab my luggage and run right back to the airport, or grab him and for the first time in my life tell this real man that he’s mine too.  And the more I see that he’s a real man who knows what he wants, and what he wants is me, I realize for the first time I’m ready to give him what I’ve been saving up all these years for one man and one man only.  But I didn’t come down here looking for a Brazilian romance. I came here for work, and to look for another man that doesn’t even know I exist. My dad.  But can I find my father while my possessive Brazilian is telling me he wants to be the father of my children? Or will my attempts turn futile when my possessive alpha male wonders why this younger woman is looking for another older man when he thought all along that we only had eyes for each other?  *Possessive Brazilian is an insta-everything standalone instalove romance with an HEA, no cheating, and no cliffhanger.",
  "genres": [
    "Romance",
    "Mixed Martial Arts",
    "Contemporary Romance"
  ],
  "author": "Flora Ferrari",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/41975848-possessive-brazilian"
}