{
  "title": "Season of the Witch: Enchantment, Terror and Deliverance in the City of Love",
  "description": "In a kaleidoscopic narrative, bestselling David Talbot recounts the gripping story of San Francisco in the turbulent years between 1967 & 1982—& of the extraordinary persons who led to the city’s ultimate rebirth & triumph. Season of the Witch is the first book to fully capture the dark magic of San Francisco in this breathtaking period, when the city radically changed itself & then revolutionized the world. The cool gray city of love was the epicenter of the 60s cultural revolution. But by the early 70s, San Francisco’s ecstatic experiment came crashing down from its starry heights. The city was rocked by savage murder sprees, mysterious terror campaigns, political assassinations, street riots & finally a terrifying sexual epidemic. No other city endured so many calamities in such a short time span. Talbot goes deep into the riveting story of his city’s ascent, decline & heroic recovery. He draws intimate portraits of San Francisco’s legendary demons & saviors: Charles Manson, Patty Hearst & the Symbionese Liberation Army, Jerry Garcia, Janis Joplin, Bill Graham, Herb Caen, the Cockettes, Harvey Milk, Jim Jones & the Peoples Temple, Joe Montana & the Super Bowl 49ers. He reveals how the city emerged from the trials of this period with a new brand of “San Francisco values,” including gay marriage, medical marijuana, immigration sanctuary, universal health care, recycling, renewable energy, consumer safety & a living wage mandate. Considered radical when they were first introduced, these ideas have become the bedrock of decent society in many parts of the country & exemplify the ways that the city now inspires a live-and-let-live tolerance, a shared sense of humanity & an openness to change. As a new generation of activists & dreamers seeks its own path to a more enlightened future, Season of the Witch—with its epic tale of the wild & bloody birth of San Francisco values—offers both inspiration & cautionary wisdom.",
  "genres": [
    "History",
    "Nonfiction",
    "Book Club",
    "True Crime",
    "American History",
    "Politics",
    "Audiobook"
  ],
  "author": "David Talbot",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/12352452-season-of-the-witch"
}