{
  "title": "A Searing Wind",
  "description": "“An irresistibly intriguing story line that brings the past vividly to life. . . . Nobody does Native Americana better than the Gears.” — BooklistIn the eagerly awaited third installment of the Battle for America saga, New York Times bestselling authors W. Michael and Kathleen O’Neal Gear richly portray a clash of cultures and a native peoples’ struggle to protect their world. Set against the tragic war sparked by Hernando de Soto’s brutal invasion of the American South, A Searing Wind heightens the historical action in this series hailed as “magnificent” (Andrew M. Greeley) and “exciting, skillfully crafted, and fast-paced” ( Publishers Weekly ).Black Shell is an exile, banished by his people for his cowardice in battle. To his fearsome patron spirit, Horned Serpent, however, he is imbued with the courage and keenness to stop the Kristiano onslaught. He and his beautiful wife Pearl Hand have fought them from the Florida Peninsula through the very heart of native America. A trader by profession, Black Shell now dedicates his soul to destroying the invaders, with their impenetrable armor, their swift, enormous cabayos , and their flashing, razor-sharp swords.Black Shell and Pearl Hand have seen the shackled, naked, starving slaves, heard the broken promises—and learned de Soto’s plans. While the battle of Mabila cost many Kristianos life and limb, the marauder does not retreat. Now he heads for Chicaza and the people from which Black Shell was once exiled.Wounded and pursued by memories and visions, Black Shell is obsessed with setting the perfect trap. To do so, he must use the Chicaza and their stockpiles of food and supplies. And he must gamble everything on his people’s pride, traditions, and failings. As winter sets in, new dangers abound for the pair—that of a family’s shame, a woman’s anger, and a betrayal that may force Black Shell to forfeit his last chance to save their world from utter destruction. But, worst of all, he and Pearl Hand must walk boldly into de Soto’s camp and engage the cunning monster in a desperate game of wits that will decide the fate of a continent.Powerful and pulsing with authenticity, A Searing Wind is an unforgettable tale of humanity and cruelty, passion and ignorance—and of historical events burned into America’s history and soul.",
  "genres": [
    "Historical Fiction",
    "Native American",
    "Historical",
    "Fiction",
    "Native Americans"
  ],
  "author": "W. Michael Gear",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/12352360-a-searing-wind"
}