{
  "title": "Our Bruises Kept Singing Purple",
  "description": "In Our Bruises Keep Singing Purple, Afro-Jamaican-Boricua poet, Malcolm Friend, has gifted us with a collection that is politically charged and culturally woke. Crafted in rhythmseasoned Latinx dialect, emerging from ancestral roots, replanted in the urban spectrum of hip-hop and rap, Friend's voice is heart-inspired, soul-empowered, new-wave griot, a fearless weapon forged from South End Seattle, Puerto Rico, and Pittsburgh. Friend creates personal and family stories that connect communal tragedies and national consciousness in expressions of rage, affirmation and self-determination, confronting the brutal realities of being Black and young while caught in the colonial grip of America, enlisting the vibrations of sound masters like Ismael Rivera, Cheo Feliciano, Tato Laviera and Bob Marley. Friend chases ghosts that emerge from living scars and painful realizations experienced by people of color happening in the barbershop, the bar, the dining table, college, on the 7, in between a mofongo of jazz, blues, calypso, rumba, bomba, plena and dembow celebrations, where his heart is. --Sandra María Esteves In Our Bruises Kept Singing Purple, Malcolm Friend coasts the curvature of the blue note, revealing in his brooding, songful, and formally masterful verse heritages that pull from the ancestral into the vibrancy and violence of this moment. He guides us carefully through the intricacies of his landscape and identity as Afro-Latino, all while flexing his linguistic and literary dexterity. The balance of beauty and punch is maintained in English and Spanish with meaning and metaphorical integrity upheld. From the haunting resonance of Orpheus' lament to the allure of the sultry bolero, from the soul that soothes a man when his mother fears the robbing of his blood far from home to the tension of bomba and blues in the bones, here are the poems that bring us back to the purity of sound in their careful and studied composition. Friend shows us the terrible, delicate, beloved, ever-shifting truths; he guides us to hear beyond the stopping of our own ears. --Raina J. León, PhD author of (dis)locate and founding editor of The Acentos Review Blues and Bomba bless the pages of this unique collection. They embody those nagging voices of doubt, of \"no\" and defiance, and of the dozens. They're born of English and Spanish, of Seattle, of transiency, of trash-talking and singing, and betweenness. And--do I have to say it? Yesterday's hurts and today's bruises. Li-Young Lee once described poetry as a kind of homesickness. Malcolm's poems--nostalgic and tender--evoke this feeling. These poems are startling and affirming. They hold their own. They know where they come from. --Yona Harvey author of Hemming the Water",
  "genres": [
    "Poetry"
  ],
  "author": "Malcolm Friend",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/42048811-our-bruises-kept-singing-purple"
}