{
  "title": "Adventures in Ayr: A New World",
  "description": "Life was simple at the orphanage. Cade and his younger brother Dee arrived under difficult circumstances. The caretakers brought in a puppy to cheer them up. A Saint Bernard named Bigsby. He too was an orphan, and together they forged a family. Spending their days climbing trees and picking honeysuckles that grew along the fence-line, they had the best childhood that was possible. But in Cade’s mind, something was missing. From an early age, Cade prepared to leave the orphanage and find his purpose out there. Dee being a rambunctious kid, was up for the adventure. Cade had it all planned out. But all of that was about to change with a simple walk into the forest. Come Adventuring With Us!Ayr is a magical place. Follow the adventures of Cade and Dee, two brothers that wander into the forest and wind up in a new world full of mystique and wonder. Along with their pet Saint Bernard, they journey through Ayr, searching for a way home. Follow the adventures of Cade, Dee, and Bigsby as they fight carnivorous Gnomes of the forest, trash Goblins, the Crystal Spider, the Frozen Kingdom of Merah, and the Water Dragon. What's Ayr?Ayr is a magical world that is incredibly old and ancient, but also much more advanced than anything on Earth. It's a blend of Eternia, Middle Earth, the Land of Ooo, Zelda, the Neverending Story, Narnia, and some Blade Runner sprinkled in. There are monsters, mystique, villains, huge cities, vile cursed swamps, secrets, ruins, robots, dragons, goblins, assassins, and anything else imaginable, it is found in Ayr. Book one barely scratches the surface to the fantasy elements in Ayr. Cade, Dee, and Bigsby's New Found PowerAt first they didn't notice it, but in time; Cade, Dee, and Bigsby are blessed with super strength, speed, and toughness. Plus, some unique powers that only they possess. First, Bigsby could talk and in time... Dee's prowess will grow as an elite fighter, and Cade is predisposed to learn the metaphysical realm of Ayr.",
  "genres": [],
  "author": "Richard  Gregory",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/42063857-adventures-in-ayr"
}