{
  "title": "Improv for Writers: 10 Secrets to Help Novelists and Screenwriters Bypass Writer's Block and Generate Infinite Ideas",
  "description": "Free yourself from writer's block and inner critics with the creative power of improv! \"Jorjeana Marie's generous, joyful, and oh-so-useful book shows writers--both seasoned and new--how to unleash their creativity and find their best story.\"--Gayle Forman, New York Times bestselling author of If I Stay and I Have Lost My Way Improv instructor and writer Jorjeana Marie reveals a new way to generate idea after brilliant idea. Applying the rules of improv to fiction writing, Marie presents fun games and exercises you can do from the comfort of your desk at home.Surprise yourself with new plots, infinite characters and settings, and a supreme confidence in your own process. Armed with the power of improv--and liberating exercises like Ad Agency, Raise the Stakes, and Family Portraits--you'll soon be an idea machine. With Improv for Writers, your creative storytelling well will never run dry again.Advance praise for \nImprov for Writers\n\n\"Here's a secret. Many authors started out as drama geeks and later found that theatrical skills like deep-diving into character and improvising on the fly were essential tools for writing fiction. Jorjeana Marie's generous, joyful and oh-so useful book applies the principles of improv to writing and though a series of targeted, fun exercises shows writers--both the seasoned and the new--how to unleash their creativity and find their best story.\"--Gayle Forman, New York Times bestselling author of If I Stay and I Have Lost My Way\"Part practical, part playful, part encouraging and affirming, Jorjeana Marie's Improv for Writers is a certain antidote to writing blocks--and writer's block! This book is a necessary and vital tool for authors and storytellers everywhere.\"--Karma Brown, bestselling author of The Life Lucy Knew\"Thank you, Jorjeana Marie for infusing joy and play and experimentation in the often-arduous act of writing fiction. I'll be turning to these exercises whenever I need to jump-start my writing session and will be recommending many of my writing students to do the same.\"--Nina LaCour, Michael L. Printz Award-winning author of We Are Okay, Hold Still, The Disenchantments,  and Everything Leads to You; and You Know Me Well, a novel written in collaboration with David Levithan.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Crafts",
    "Art"
  ],
  "author": "Jorjeana Marie",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/42040556-improv-for-writers"
}