{
  "title": "Paradise Island, Heavenly Journey",
  "description": "Dr. Kate Hartig writes \"In his recently published first book From Barren Rocks to Living Stones Jon Magee recounts his teenage years living in Aden, Yemen, during the mid 1960s. In Paradise Island Jon travels back to an earlier period of his childhood. He reflects on his life as a young boy living with his family in Singapore during the 1950's. He discusses the trials and joy of British military family life living in what was once part of the British Empire. But like Jon's memoirs of Aden, the 1950s in Singapore was also a period of considerable change as Britain was forced to accept the ending of its colonial powers in far away 'exotic' places. But for Jon, it was an ideal childhood full of adventure and new experiences, from new foods to strange plants and significantly new friends that cut across cultural barriers. Today, Singapore presents itself as a modern, bustling cosmopolitan city. With the kampongs (villages) and jungle areas now replaced by high- rise residential apartments and manicured parklands the perception of Singapore as a ''paradise island'' is possibly difficult to comprehend. But Jon's memories brings back an earlier time when life was perhaps not so much simpler but different. So different that it was life changing. This story is set within the context of many journeys, Jon's journey through early childhood, the family's journeys between Singapore and Britain and most significantly his parents' profound spiritual journey back to their saviour and God.\" Dr Kate Hartig (PhD) Jon Magee continues to reveal the wealth of story telling that is based upon life experiences within the world. This book, following on fom the action of Aden (Yemen),now details the search for truth, peace and sense of purpose lived out in Singapore in the 1950's.",
  "genres": [],
  "author": "Jon Magee",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/12352820-paradise-island-heavenly-journey"
}