{
  "title": "His Curvy Rejected Mate",
  "description": "He had his chance. He blew it, and I’m out of here.FloraI’m at the bottom of the pack. I’m female, I have no family left, and everywhere a shifter is supposed to be hard, I’m soft and round. There’s one bright spot in my days—Alec Cameron.He’s hard in every way—so distant that he’s ice cold—but once in a while, he gives me a nod, and we sneak off to the woods. He’s not cold then. Not at all.I used to dream that Fate would make it official, but after so many years, I’ve given up hope. Then, at a pack run, heat strikes. Alec Cameron is my mate.In front of everyone, he turns his back on me.I didn’t know how cold he could be, but I do now, and I’ve got a choice to make. Do I hang around and deal with this messed up pack like I always do? Or do I take my new wolf, break free, and forge a new path of our own?AlecThis pack is falling apart. Literally. I spend my days patching together buildings that are inches from sliding down the mountain. In my free time, I have to compete with the other two males vying for Salt Mountain alpha, the world’s worst job.I’m constantly holding everything together, and until the night of the last full moon run, there was at least one bright spot in my days.Then Flora Ritchie goes into heat at the worst possible time and place, and in all the chaos and revelations, I lose my grip. And my temper.In the blink of an eye, my mate is gone.I know how to fix things, not feelings, but if I don’t figure it out, and quickly, I’m going to lose it all.His Curvy Rejected Mate is the fourth novel in The Five Packs series, but it can be read as a standalone. No cheating. HEA guaranteed. Intended for adult readers only.",
  "genres": [
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Paranormal Romance",
    "Fantasy",
    "Omegaverse",
    "Werewolves"
  ],
  "author": "Cate C. Wells",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/123532707-his-curvy-rejected-mate"
}