{
  "title": "The Vogels: On All Fronts",
  "description": "Jana Petken presents Volume 2 of the multi-award-winning Half-Bloods Series. “The Vogels are fighting on all fronts in this compelling story of intrigue and betrayal in a world at war.” European citizens feel the full force of German injustice, but not all are willing to bend the knee. From France to Poland, Resistance groups fight from the shadows to thwart Nazi rule and hinder their goal to exterminate Jews. In Russia, Wilmot Vogel struggles to survive the ravages of a frigid winter, compounded by the German army’s lack of progress. Hit by a surprise Russian attack on the front lines, however, he finds himself facing an even greater challenge than the freezing weather and Soviet bullets. In Łódź, Poland, an idealistic doctor is resolved to oppose the Third Reich, but is he willing to betray his country? Will a Gestapo major find the answers he’s looking for? Can a ghetto Jew avoid transportation to a Nazi extermination camp? Can two spies rekindle their friendship, or will past betrayals become hurdles too great to surmount? Can Britain’s MI6 maintain the upper hand in a contest against the German Abwehr? Who wins when one man fights for British interests whilst the other seeks to undermine them? In the darkest days of war, love flourishes. Two women with very different paths are led to one man who changes the course of their lives forever – but only one will win his heart. Editorial Review From Readers' Favourite The On All Fronts by author Jana Petken is a story of love, loss, life and the ties which bind or divide us. The continuation of the Half-Bloods Series, this episode takes place during the horrors of the Second World War as race, nationality and the desire for bloodshed separate neighbors, friends and lovers. Wilmot Vogel is a central figure, desperately trying to survive on the frozen battlefields of Russia, and he is only one of many figures spread across Europe, trying to bring about their own results during the world, for good or ill. Amidst all this, romance blossoms, but not for everyone despite how hard they try. Author Jana Petken presents a sweeping narrative that really does feel like you’re travelling through the world at war as it rages on. The different scenes taking place were superbly well described and attained a real sense of history throughout, but I was also impressed by the distinct differences in culture from country to country which were also accurately done. The emotive story lines of both light and dark characters really unpick the unspeakable things that had to be done in order to survive in these times, but there are also moments of exciting espionage, hopeful idealistic romance and proud bravery even during the darkest moments Europe has ever faced. The three Vogel boys grow into men as the tale expands, building on the previous family of book one with new and unexpected complications. Overall, The On All Fronts is a highly recommended read for fans of expansive historical drama.",
  "genres": [
    "Historical Fiction",
    "World War II"
  ],
  "author": "Jana Petken",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/42073789-the-vogels"
}