{
  "title": "Addicted to the Monkey Mind: Change the Programming That Sabotages Your Life",
  "description": "In his book, J.F. Benoist—a visionary thought leader in the fields of addiction treatment and personal development—uses the journeys of two relatable characters to teach you how to develop a powerful new mindset and finally break the pattern of negative self-talk.Addicted to the Monkey Mind offers a toolbox of practical skills to shift self-sabotaging, programmed ways of thinking and learn actionable steps to:• Overcome addiction & debilitating habits• Resolve relationship issues• Replace burnout with passion• Sustain an abiding joy“‘Addicted to the Monkey Mind’ is one of the most concrete, practical self-help books I have ever read. As I read these compelling real-life stories, I could feel my inner landscape shifting. J.F. Benoist offers a profound approach to overcoming our self-sabotaging conditioning. A must-read!” — Jennifer Read Hawthorne, coauthor, #1 New York Times best sellers “Chicken Soup for the Woman’s Soul” and “Chicken Soup for the Mother’s Soul”“J.F. Benoist has given us a book of insight and clarity. Both psychotherapists and their clients will greatly benefit. The author’s use of vignettes and suggested exercises is informative, instructive and holds the reader’s interest. I highly recommend this book.” — Teni Garrett-Johnson, Ph.D., Licensed Clinical Psychologist“J.F. goes straight to the core of human dysfunction in a most unique way. From page one to the very end, as we follow people on their healing journeys, we feel what they feel, and can then explore our own inner process. I hold this book as a potent, personal therapeutic tool. Excellent!” — Bill Kauth, co-founder of The ManKind Project, author of “A Circle of Men”, and coauthor of “We Need Each Other: Building Gift Community” with Zoe Alowan",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Spirituality",
    "Audiobook",
    "Health",
    "Philosophy"
  ],
  "author": "J.F. Benoist",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/42076361-addicted-to-the-monkey-mind"
}