{
  "title": "Wrong Planet - Searching for your Tribe",
  "description": "The most unexpected and revealing book of our time. A rallying cry for the elusive spirit of these time. A cry for those who want to change the world!Karl Wiggins has a powerful and potent knack for expression which has completely escaped restraint and self-control. Too much writing nowadays is watered-down garbage. The world is looking for something new, and in this book, Wiggins has created many ‘worth-pondering-over’ ideas!We are experiencing the same intensity of energy in diminished and more concise time periods, which is why more and more Wrong Planet tribes are gatheringKarl Wiggins informed me, when I agreed to write the forward for this book, that his goal was for those he calls Carefree Scamps to finish the book slightly punch-drunk. And I admit that with me he’s managed it remarkably. If you don’t believe that a limited number of astute, dedicated human beings can change the world, or simply just call attention to its imperfections and vulnerabilities, this book is going to change your mind. But before you get there, in the first third of the book Karl introduces us to a number of famous eccentrics who just didn’t (or don’t) ‘fit in’ He discusses the erratic, the bizarre and the downright kooky. People such as David Bowie, Marilyn Monroe, Janice Joplin, Jimi Hendrix, Keith Moon, Arthur Rimbaud, François Villon (the Medieval Beatnik), Bessie Stringfield, Sixteen-String Jack Rann, Anne Bonny & Mary Read (the Lesbian Pirates), Frida Kahlo, the Beat Generation poets and a whole host of dropouts, misfits, pranksters, bohemians, court jesters, comedians, crackpots and Gypsies.The reader will love reading about these swashbuckling daredevils, headcases and artists who changed their world, and even more so when Wiggins goes on to blend some of them with those from his own tribe. He identifies Wrong Planet people clearly, drops hints on how we can spot them, and finally instructs us in how to discover our own ‘tribe’ if we haven’t already found them This book will shake your perceptions ….. and it’s lovely!",
  "genres": [
    "Philosophy",
    "Psychology",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Karl Wiggins",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/42084933-wrong-planet---searching-for-your-tribe"
}