{
  "title": "The Lady by His Side",
  "description": "A marquess in need of the right bride. An earl’s daughter in search of a purpose. A betrayal that ends in murder and balloons into a threat to the realm.Sebastian Cynster knows time is running out. If he doesn’t choose a wife soon, his female relatives will line up to assist him. Yet the current debutantes do not appeal. Where is he to find the right lady to be his marchioness? Then Drake Varisey, eldest son of the Duke of Wolverstone, asks for Sebastian’s aid.Having assumed his father’s mantle in protecting queen and country, Drake must go to Ireland in pursuit of a dangerous plot. But he’s received an urgent missive from Lord Ennis, an Irish peer—Ennis has heard something Drake needs to know. Ennis insists Drake attends an upcoming house party at Ennis’s Kent estate so Ennis can reveal his information face-to-face.Sebastian has assisted Drake before and, long ago, had a liaison with Lady Ennis. Drake insists Sebastian is just the man to be Drake’s surrogate at the house party—the guests will imagine all manner of possibilities and be blind to Sebastian’s true purpose.Unsurprisingly, Sebastian is reluctant, but Drake’s need is real. With only more debutantes on his horizon, Sebastian allows himself to be persuaded.His first task is to inveigle Antonia Rawlings, a lady he has known all her life, to include him as her escort to the house party. Although he’s seen little of Antonia in recent years, Sebastian is confident of gaining her support.Eldest daughter of the Earl of Chillingworth, Antonia has abandoned the search for a husband and plans to use the week of the house party to decide what to do with her life. There has to be some purpose, some role, she can claim for her own.Consequently, on hearing Sebastian’s request and an explanation of what lies behind it, she seizes on the call to action. Suppressing her senses’ idiotic reaction to Sebastian’s nearness, she agrees to be his partner-in-intrigue.But while joining the house party proves easy, the gathering is thrown into chaos when Lord Ennis is murdered—just before he was to speak with Sebastian. Worse, Ennis’s last words, gasped to Sebastian, are: Gunpowder. Here.Gunpowder? And here, where?With a killer continuing to stalk the halls, side by side, Sebastian and Antonia search for answers and, all the while, the childhood connection that had always existed between them strengthens and blooms…into something so much more.First volume in a trilogy. A historical romance with gothic overtones layered over a continuing intrigue. A full length novel of 99,000 words.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Audiobook",
    "Historical Fiction",
    "Mystery",
    "Regency"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/42091500-the-lady-by-his-side"
}