{
  "title": "The Bloody Ground",
  "description": "Nathaniel Starbuck, the northern preacher's son who fights for the Confederate South, is plunged into the most desperate battle of America's Civil War, the fight at Antietam, in this, the fourth novel in the Starbuck Chronicles.It is late summer, 1862, and after beating off repeated northern attacks the Confederacy is at last invading the United States of America. The invasion is a gamble, pitting a small army against a huge one, and for its success Robert Lee will need every veteran soldier he can muster. Nathaniel Starbuck is one of those veterans, but instead of marching as the head of the Faulconer Legion, he has been given command of a Punishment Battalion, a unit composed of failures and cowards. Starbuck's enemies expect the appointment to be his ruin, and if he is to stand any chance of further success he must prove those enemies wrong by leading his ramshackle unit against the northern garrison at Harper's Ferry and then across the frontier to the bank of the Antietam Creek. There Starbuck will fight in what will prove to be the bloodiest day in American history.Starbuck is not only fighting the Yankees. Unknown to him one of his best friends is doing all he can to betray the South, a betrayal that will place Lee's army in a desperate trap, while in his new battalion Starbuck has enemies every bit as dangerous as those who wear the norther blue. In Antietam's cornfield, where twelve thousand men died in three terrible hours, Starbuck is caught in a crossfire of hate, envy, murder and ambition. To win is simply to survive.The Starbuck Chronicles are fast becoming as well established as Bernard Cornwell's hugely successful series of novels about the Peninsular War rifleman, Richard Sharpe. Nobody can bring alive the intricacies of history with more energy or clarity than Bernard Cornwell, and his descriptions of black-powder battle are equally beyond compare. 'The Bloody Ground' will leave his army of fans well satisfied and looking forward to further adventures.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Civil War",
    "Historical",
    "War",
    "American Civil War",
    "Military Fiction"
  ],
  "author": "Bernard Cornwell",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/420788.The_Bloody_Ground"
}