{
  "title": "Wedding at Mistletoe Chalet",
  "description": "Eager for a home-style Christmas while she considers a career shift, Kristen Benz leaps on the temporary job at Mistletoe Chalet. Soon she’s wrapping presents, trimming the tree, and helping her new boss’s tween daughter plan a Christmas Eve vow renewal for her parents. The holiday is imbued with a magical glow—especially when Kristen’s high school sweetheart appears on the doorstep. After years of medical school, Finn Garrett has promised his parents he’ll be home for the holidays. His detour to see his first love is supposed to provide closure, not rekindle their long-ago romance. Can a matchmaking tween and the magic of Mistletoe Chalet spark the happily ever after that eluded them in the past? Readers are loving Wedding at Mistletoe  “This actually reminded me of a Hallmark Christmas movie which, from me, is high praise indeed. I’ll definitely be looking up this author’s backlist. I highly recommend!” - Reading with Cats, Goodreads reviewer “WEDDING AT MISTLETOE CHALET is a sweet reunion romance. Author Dani Collins brought this beautifully written tale of family, relationships, Christmas magic and ultimately the magic of love to life on the pages. Highly recommended for all readers of romance.” - Goodreads reviewer \"If you are looking for a sweet beautiful romance and a Christmas story then this is the book you should pick up…\" - Helen, Goodreads reviewer “Such was Ms. Collin’s descriptive style of writing, I really felt as though I was transported to a beautiful chalet in the mountains. A beautiful love story full of hopes and dreams that certainly got me in the holiday spirit.” - Erin Lewis, Goodreads reviewer “I loved this book. It was well written and proceeded at a nice pace. The story was sweet and free from sex and vulgarity. It was the perfect holiday romance.” - Sonya, Goodreads reviewer",
  "genres": [
    "Christmas",
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Dani Collins",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/42081702-wedding-at-mistletoe-chalet"
}