{
  "title": "The Balance Equation: Find Your Formula for Living Your Best Life",
  "description": "Struggling to Live Your Best Life?This breakthrough book shows those who feel overwhelmed of just unable to find balance how to move closer to this elusive and vitally important goal.Virtually everyone struggles to stay balanced and carve out time for the things that are most important to them, a task that is increasingly difficult in today's frenetic world.In The Balance Find Your Formula for Living Your Best Life, authors, Rob Fiance and Stuart Rosenblum, offer a simple but comprehensive program for balancing the four life categories of self, health, relationships, and money. Their proprietary concept called Micro-movesTM - making small changes that immediatley begin addressing problem areas - helps readers achieve their priorites and begin living their best lives without a huge distuption or drain of time.Complete with exercises and case studies, The Balance EquationTM helps those who are ready to live their best lives take action and develop their own personal formula for doing exactly that.American Foundation for Suicide Prevention will receive a portion of the proceeds of each book.I've already embraced the concept of \"micro-moves,\" tiny activities that take almost no time at all. Such as, \"meditate for one minute.\" I'm not a meditating-type person, but for only one minute? Yeah, I can do that! - Julie Mayerson Brown, author of top-selling contemporary women's fiction novels.I have just read “The Balance Equation” and I realized how the principles outlined would have been so useful to me when I was high ranking executive at a major movie studio. In that kind of position it was almost necessary to be consumed by my job and therefore sacrificing and short changing so many other aspects of my life. The ideas put forth in the book would have helped my live in a much more healthy, happy and self satisfying manner! -Barry London, Vice Chairman of Paramount Pictures (retired)Our limited definition of success has created a culture of rudderless ambition. The Balance Equation is an invaluable resource; a paradigm shift that trades antiquated notions of success and guides us to truly examine our lives so we can discover new definitions that include not only greater wealth, but also optimum health, peace of mind, meaning, purpose, and service to others. -Alan Watt - founder of L.A. Writers' Lab and bestselling author of The 90-Day Novel",
  "genres": [],
  "author": "Rob Fiance",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/123538092-the-balance-equation"
}