{
  "title": "The Love Prison Made and Unmade: My Story",
  "description": "With echoes of Just Mercy and An American Marriage, a remarkable memoir of a woman who falls in love with an incarcerated man—a poignant story of hope and disappointment that lays bare the toll prison takes not only on those behind bars, but on their families and relationships.Ebony’s parents were high school sweethearts and married young. By the time Ebony was born, the marriage was disintegrating. As a little girl she witnessed her parents’ brutal verbal and physical fights, fueled by her father’s alcoholism. Then her father tried to kill her mother.Those experiences drastically affected the way Ebony viewed love and set the pattern for her future romantic relationships. Despite being an educated and strong-minded woman determined not to repeat the mistakes of her parents—she would have a fairytale love—Ebony found herself drawn to bad-boys: men who cheated; men who verbally abused her; men who disappointed her. Fed up, she swore to wait for the partner God chose for her.Then she met Shaka Senghor. Though she felt an intense spiritual connection, Ebony struggled with the idea that this man behind bars for murder could be the good love God had for her. Through letters and visits, she and Shaka fell deeply in love.Once Shaka came home, Ebony thought the worst was behind them. But Shaka’s release was the beginning of the end.The Love Prison Made and Unmade is heartfelt. It reveals powerful lessons about love, sacrifice, courage, and forgiveness; of living your highest principles and learning not to judge someone by their worst acts. Ultimately, it is a stark reminder of the emotional cost of American justice on human lives—the partners, wives, children, and friends—beyond the prison walls.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "African American Literature",
    "Autobiography",
    "Audiobook"
  ],
  "author": "Ebony Roberts",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/42079232-the-love-prison-made-and-unmade"
}