{
  "title": "Ryker",
  "description": "This New Adult book is the first in the Owatonna U Series, a spin-off from the best selling Harrisburg Railers Hockey Series. Ryker is hockey royalty, Jacob is a poor country boy. Can two vastly different people find common ground and become the men they want to be? Ryker comes from a long line of championship-winning hockey players. Playing college hockey to develop his game is his only focus, and nothing will stand in the way of him working to become the best player. He has no room for relationships, people who point out his flaws, or anyone who calls him on his dreams. He certainly has no place for love, and meeting Jacob is nothing but a useful distraction on the side. After all trying to get his Owatonna Eagles teammate into bed is less work and more play. When tragedy rocks his family, his charmed life crumbles, and the only person he can turn to is the same one who claims to hate him. Jacob Benson has only known hard work and stifling conservative values his whole life. Born and raised in the small rural community of Eden Crossing, Minnesota, he’s the only son of a hard-working but struggling dairy farming family. Jacob is using his skills in hockey to finance his way to an agricultural science degree. These four years at Owatonna U. will probably be the only time he has to enjoy life, gain acceptance about his sexuality, and live openly before his inevitable return to the farm. Running into a pretty rich boy like Ryker Madsen is putting a damper on his enjoyment of life away from home. Ryker’s flip, conceited, carefree attitude grates on Jacob’s every nerve. So why, if Ryker is everything he dislikes, does he want nothing more than to explore the sinful dreams that his annoying teammate stars in every night?",
  "genres": [
    "M M Romance",
    "Sports",
    "Romance",
    "Hockey",
    "Contemporary",
    "College",
    "New Adult"
  ],
  "author": "R.J. Scott",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/42082137-ryker"
}