{
  "title": "Jordan Dare and the Kidnapped Ghost",
  "description": "Since the age of thirteen, Jordan Dare led a complicated life. It was then he realized he was gay --- that alone caused complications. But when he started seeing things which no one else could see, being gay seemed like a minor problem. Jordan started seeing ghosts, but only the ghosts of newly departed gay men and teenagers. Some had suffered accidents, some had been murdered, but all brought a raft of complications to young Jordan’s life. He couldn’t touch them without suffering injury, but he could talk with them, listen to their troubles and make their death experience a little easier. He helped most of them accept their demise and move on. In some cases, however, he was able to help solve their murders. As he grew to manhood, he earned a doctorate in science education and began work as a physics and chemistry teacher at a prestigious private school in Daytona Beach. In his late twenties, he finally fell in love with Andrew Lawson, a similar-aged Episcopal priest who gave every indication he too was gay. Just as Jordan was about to reveal his true nature and feelings to Andrew, his friend showed up one night as a ghost himself, breaking Jordan’s heart. For a number of years, the two could be together in spirit only, for Jordan was unable to touch, or be touched, by the man he loved more than life itself. They shared love the best they could, knowing that someday Jordan’s time would come and they could finally be together. But one day a fifteen-year-old gay street kid showed up in Jordan’s classroom bearing ghastly wounds. He had just been kidnapped and then murdered by a gang of child traffickers. The boy, Freddie Kant, told Jordan there were six other children held by the murderers and time might be running out to save them from being sold or killed. Jordan now faced the greatest complication of his life. He, Freddie, Andrew and Kim Nguyen, another ghost whose murder Jordan had once solved, began the search for the missing children hidden away somewhere in the vicinity of Daytona Beach, Florida. For a unique and thrilling tale, join Jordan and his ghostly associates as they try to accomplish the impossible before time runs out. This is the first of three novels featuring Jordan Dare and his complicated life.",
  "genres": [],
  "author": "Cameron DeCessna",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/42080680-jordan-dare-and-the-kidnapped-ghost"
}