{
  "title": "Emperors of the Deep: Sharks--The Ocean's Most Mysterious, Most Misunderstood, and Most Important Guardians",
  "description": "In this remarkable groundbreaking book, a documentarian and conservationist, determined to dispel misplaced fear and correct common misconceptions, explores in-depth the secret lives of sharks—magnificent creatures who play an integral part in maintaining the health of the world’s oceans and ultimately the planet.From the Jaws blockbusters to Shark Week, we are conditioned to see sharks as terrifying cold-blooded underwater predators. But as Ocean Guardian founder William McKeever reveals, sharks are evolutionary marvels essential to maintaining a balanced ecosystem. We can learn much from sharks, he argues, and our knowledge about them continues to grow. The first book to reveal in full the hidden lives of sharks, Emperors of the Deep examines four species—Mako, Tiger, Hammerhead, and Great White—as never before, and includes fascinating details such as:Sharks are 50-million years older than trees;Sharks have survived five extinction level events, including the one that killed off the dinosaurs;Sharks have electroreception, a sixth-sense that lets them pick up on electric fields generated by living things;Sharks can dive 4,000 feet below the surface;Sharks account for only 6 human fatalities per year, while humans kill 100 million sharks per year.McKeever goes back through time to probe the shark’s pre-historic secrets and how it has become the world’s most feared and most misunderstood predator, and takes us on a pulse-pounding tour around the world and deep under the water’s surface, from the frigid waters of the Arctic Circle to the coral reefs of the tropical Central Pacific, to see sharks up close in their natural habitat. He also interviews ecologists, conservationists, and world-renowned shark experts, including the founders of Greenpeace’s Rainbow Warrior, the head of the Massachusetts Shark Research Program, and the self-professed “last great shark hunter.”At once a deep-dive into the misunderstood world of sharks and an urgent call to protect them, Emperors of the Deep celebrates this wild species that hold the key to unlocking the mysteries of the ocean—if we can prevent their extinction from climate change and human hunters.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Animals",
    "Biology",
    "Audiobook",
    "Environment"
  ],
  "author": "William McKeever",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/42079235-emperors-of-the-deep"
}