{
  "title": "Jordan Dare and the Tolchester Ghost",
  "description": "Jordan Dare and the Tolchester Ghost --- When Jordan Dare turned thirteen, he discovered he was gay but an even bigger complication arose. He started seeing things that no one else could see. For some unknown reason, young Jordan started seeing the ghosts of recently departed gay men and boys. Some had died due to accidents, but a few had been murdered. He couldn’t touch them without suffering painful injury, but he could talk with them, listen to their troubles and help make their death experience a little easier so they could move on. In some cases, he was able to help solve their murders. A he grew older, a few of the ghosts decided to stay and help him with his unique work. In the first book in this series, Jordan Dare and the Kidnapped Ghost, Jordan and several of his ghostly companions save a number of young children kidnapped by a ring of child traffickers, but the ringleader gets away. In this second entry in the Dare Trilogy, while following the leader’s trail to the western mountains of Maryland, Jordan and his ghost posse bring the man to justice, but that is only a part of what they discover while there. A new mystery develops when they meet several ghosts from the seventeen hundreds who have been patiently waiting for someone like Jordan to come along, listen to their troubles and help solve a two-hundred, thirty-year-old-mystery. Two British/American soldiers were charged with sodomy and put to death in 1755 by a jealous British colonel at Fort Cumberland, in the English colony of Maryland. He also stole one man’s family fortune. Colonel Tolchester also murdered a twelve-year-old drummer boy who failed in an attempt to free the two men before their hanging. He collected the fortune and buried it somewhere beneath a venerable old church in Cumberland after the fort later became a city. Now Jordan and his crew must help the three soldiers locate and recover the gold and set right the sins of the old colonel. Trouble is, his ghost has also remained and now he battles to thwart Jordan and his team of ghostly companions. Can Jordan use his unique abilities and that of his spiritual buddies to vanquish the mad ghost and locate the Tolchester treasure?",
  "genres": [],
  "author": "Cameron DeCessna",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42101991-jordan-dare-and-the-tolchester-ghost"
}