{
  "title": "Fleishman Is in Trouble",
  "description": "If you could do it all over again, would you? Should you? One man finds out in this finely observed, compulsively readable, and occasionally raunchy novel of marriage, sex, and dating for readers of Jonathan Franzen, Lauren Groff, and Tom Perrotta.Dr. Toby Fleishman wakes up each morning surrounded by women. Women who are self-actualized and independent and know what they want - and, against all odds, what they want is Toby. Who knew what kind of life awaited him once he finally extracted himself from his nightmare of a marriage? Who knew that there were women out there who would actually look at him with softness and desire? But just as the winds of his optimism are beginning to pick up, they're quickly dampened, and then extinguished, when his ex-wife, Rachel, suddenly disappears.Toby thought he knew what to expect when he moved out: weekends and every other holiday with the kids, some residual bitterness, tense co-parenting negotiations. He never thought that one day, Rachel would just drop their children off at his place and never come back. As Toby tries to figure out what happened and what it means, all while juggling his patients at the hospital, his never-ending parental duties and his new, app-assisted sexual popularity, his tidy narrative of a spurned husband is his sole consolation. But if Toby ever wants to really understand where Rachel went and what really happened to his marriage, he is going to have to consider that he might not have seen it all that clearly in the first place.A searing, funny, and electric debut from one of the most exciting writers working today, Fleishman Is In Trouble is an exploration of a culture trying to navigate the fault lines of an institution that has proven to be worthy of both our great wariness and our great optimism.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Literary Fiction",
    "Novels",
    "New York"
  ],
  "author": "Taffy Brodesser-Akner",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/42103980-fleishman-is-in-trouble"
}