{
  "title": "Lorelei of the Red Mist",
  "description": "Lorelei of the Red Mist by Leigh Brackett and Ray BradburyA thief makes the biggest score of all time and then dies trying to escape. His dying mind is transferred into the body of a warrior who is being used by a sorceress to destroy her enemies.Lorelei Of The Red Mist (1946)by Leigh Brackett & Ray BradburyHe died—and then awakened in a new body. He found himself on a world of bizarre loveliness, a powerful, rich man. He took pleasure in his turn of good luck . . . until he discovered that his new body was hated by all on this strange planet, that his soul was owned by Rann, devil-goddess of Falga, who was using him for her own gain.The Million Year Picnic (1946)by Ray BradburyThey were supposed to be starting on a picnic, a wonderful day of fun. But there was a gun in the boat, and too much food and equipment. And just behind the veil of vacation—instead of the soft face of laughter——there was something hard and bony and terrifying.__________________In 1944, Leigh Brackett (1915-1978) had published a hard boiled detective novel, No Good From A Corpse, very much in the tone and tradition of Raymond Chandler. In 1946, Warner Brothers was producing Chandler’s The Big Sleep directed by Howard Hawks and starring Humphrey Bogart and Lauren Bacall. William Faulkner was writing the screenplay but having trouble with the adaptation. Hawks told his secretary to call “this Brackett guy” to help out.At the time that Warner Brothers contacted her, Brackett was in the middle of writing Lorelei of the Red Mist. She and her husband Edmond Hamilton were living in Los Angeles near their good friend Ray Bradbury. When Brackett was called to Hollywood, Bradbury (1920-2012) stepped in and finished “Lorelei”.At around the same time that Brackett was writing “Lorelei”, Ray Bradbury was writing The Million Year Picnic. “Picnic” was one of the earliest of the two dozen or so stories that Bradbury wove into The Martian Chronicles.Lorelei of the Red Mist and The Million Year Picnic were both published in the Summer, 1946 issue of Planet Stories.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Leigh Brackett",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/42101971-lorelei-of-the-red-mist"
}