{
  "title": "Predestined",
  "description": "In the wake of her abruptly ended engagement, Kayla has traveled to the beautiful island of Hawaii to be a bridesmaid at her best friend’s wedding. As soon as she arrives on the island, she catches the attention of the best man, a dominant who will stop at nothing to make the prim and proper bridesmaid acquiesce to him. Will Kayla give in to her hidden desires, or will she be able to resist the enigmatic Ryan Harper?  Good bye cold and snowy Chicago, hello white sandy beach and tropical heat. Sayonara deadlines, eighty-hour work weeks, and never-ending demands. Hello freedom. Sweet, sweet freedom. An entire week to do whatever I want, whenever I want. My best friend’s wedding couldn’t be happening at a better time or a better location. Here I don’t have to justify to anyone why I’ve ended my engagement. Here I don’t have to be perfect and proper every second of every day. Here, I am free. Here, I can be… me. But who exactly is that? And why does it feel like Ryan, the best man, might have the answer to that question?  I may be the son of a housekeeper and admittedly have some seriously sharp edges, but that has never held me back from achieving what I want in life. I can turn any disadvantage into strength. I turn that strength into supremacy. If I see something I want, I make it mine, plain and simple. I wanted wealth and power, and I have amassed more than one man could ever need. Still yet, companionship eludes me. For a man with my fortune, it’s impossible to find a woman who truly wants me for me. I’ve all but given up trying to find a woman who is as interested in me as she is my bank account. But the moment I lay eyes on the beautiful, prim and proper Kayla Bauer-Smith, I’m determined to make her mine. While Kayla’s timid reserve is entirely opposite of Ryan’s virile sexual demeaner, she can’t help feeling an inexplicable attraction to him. His intense, domineering personality draws her in like a magnet. Will Kayla allow herself to give in to her deepest, most guarded physical desires? Will Ryan’s manner of dominance prove to be too much for the cautious and conservative Kayla? And why are Kayla and Ryan so sure this isn’t the first time they’ve met? If you enjoy a white hot, forbidden second chance love story, grab your copy of Predestined now!",
  "genres": [],
  "author": "Sasha  Hart",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42104659-predestined"
}