{
  "title": "America Before: The Key to Earth's Lost Civilization",
  "description": "***THE SUNDAY TIMES TOP TEN BESTSELLER***'Hancock's books provide a fascinating, alternative version of prehistory. America Before, detailed and wide-ranging, turns what was myth and legend into a new story of the past.' Daily MailWas an advanced civilization lost to history in the global cataclysm that ended the last Ice Age? Graham Hancock, the internationally bestselling author and television presenter, has made it his life's work to find out -- and in America Before, he draws on the latest archaeological and DNA evidence to bring his quest to a stunning conclusion.We've been taught that North and South America were empty of humans until around 13,000 years ago - amongst the last great landmasses on earth to have been settled by our ancestors. But new discoveries have radically reshaped this long-established picture and we know now that the Americas were first peopled more than 130,000 years ago - many tens of thousands of years before human settlements became established elsewhere.Hancock's research takes us on a series of journeys and encounters with the scientists responsible for the recent extraordinary breakthroughs. In the process, from the Mississippi Valley to the Amazon rainforest, he reveals that ancient 'New World' cultures share a legacy of advanced scientific knowledge and sophisticated spiritual beliefs with supposedly unconnected 'Old World' cultures. Have archaeologists focussed for too long only on the 'Old World' in their search for the origins of civilization while failing to consider the revolutionary possibility that those origins might in fact be found in the 'New World'?America The Key to Earth's Lost Civilisation is the culmination of everything that millions of readers have loved in Hancock's body of work over the past decades, namely a mind-dilating exploration of the mysteries of the past, amazing archaeological discoveries and profound implications for how we lead our lives today.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Anthropology",
    "Audiobook",
    "Archaeology",
    "Ancient History"
  ],
  "author": "Graham Hancock",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/42111547-america-before"
}