{
  "title": "Once Upon a Scandal",
  "description": "Once upon a time, a nobody met a prince. Then she met his best friend, a second prince. Then she learned they like to share, and that’s when things got interesting. That’s when things got downright scandalous.  My life has never been a fairytale. Absent parents, a grandmother gone too soon, and a job working the kitchens for the most heinous b**ch in the Kingdom of Bandiff.  But that’s before I sneak into the hottest royal ball on the planet. That’s before I waltz right into them.  The McDermott Princes. Princes, plural. There’s two of them – both gorgeous beyond belief, alpha as hell, and more tempting than sin. Both with their eyes on me and both with that look that says that I’m theirs.  Two princes, one baker. This might sound like too many cooks in the kitchen, but they say they like to share. They say they’ll tear their whole kingdom down to make me theirs. They say they want to make me their Queen.  Pretty soon, breaking into a royal ball is the least of my problems.  This is a disaster waiting to happen. It’s filthy, and oh-so-wrong. It’s a royal scandal of epic proportions, and I’m right in the middle of it.  …I’m right in the middle of them.  Maybe this is a fairytale after all. Ever heard of the cook who found a crown? How about two crowns? Two big, dominant, mouthwatering, pulse-quickening crowns.  I’ve never found a happy ever after. Now, I think I’m about to find two of them.   This is a standalone story. The books in the Royally Screwed series can be read in any order.  Steamy as all get-out, ridiculously over the top, and more growly alpha yumminess than you can shake a tiara at. Seriously - reality got left at the door with this one. But something tells me, you're going to love it ;). Get ready to have your cake and eat it two too!  This mfm romance is all about her - no m/m. As with all my books, this standalone novella is safe, with no cheating, and a HEA guaranteed.",
  "genres": [],
  "author": "Madison Faye",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/42104893-once-upon-a-scandal"
}