{
  "title": "Sensuous Knowledge: A Black Feminist Approach for Everyone",
  "description": "The creator of the internationally popular, multiple award-winning blog MsAfropolitan applies an Africa-centered feminist sensibility to issues of racism and sexism, challenging our illusions about oppression and liberation and daring women to embrace their power.Sensuous Knowledge is a collection of thought provoking essays that explore questions central to how we see ourselves, our history, and our world.What does it mean to be oppressed? What does it mean to be liberated? Why do women choose to follow authority even when they can be autonomous? What is the cost of compromising one’s true self? What narratives particularly subjugate women and people of African heritage? What kind of narrative can heal and empower?As she considers these questions, Salami offers fresh insights on key cultural issues that impact women’s lives, including power, beauty, and knowledge. She also examines larger subjects, such as Afrofuturism, radical Black feminism, and gender politics, all with a historical outlook that is also future oriented. Combining a storyteller’s narrative playfulness and a social critic’s intellectual rigor, Salami draws upon a range of traditions and ideologies, feminist theory, popular culture—including insights from Ms. Lauryn Hill, Beyoncé, Audre Lorde, Toni Morrison, and others—science, philosophy, African myths and origin stories, and her own bold personal narrative to establish a language for change and self-liberation.Sensuous Knowledge inspires reflection and challenge us to formulate or own views. Using ancestral knowledge to steer us toward freedom, Salami reveals the ways that women have protested over the years in large and small ways—models that inspire and empower us to define our own sense of womanhood today.In this riveting meditation, Salami ask women to break free of the prison made by ingrained male centric biases, and build a house themselves—a home that can nurture us all.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Race",
    "Social Justice",
    "History",
    "Politics"
  ],
  "author": "Minna Salami",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/42117327-sensuous-knowledge"
}