{
  "title": "You Are Worth It: Building a Life Worth Fighting For",
  "description": "The youngest living Medal of Honor recipient delivers an unforgettable memoir that \"will inspire every reader” (Jim Mattis)NATIONAL BESTSELLER | A Marine Commandant's Reading List selectionOn November 21, 2010, U.S. Marine Lance Corporal Kyle Carpenter was posted atop a building in violent Helmand Province, Afghanistan, when an enemy grenade skittered toward Kyle and fellow Marine Nick Eufrazio. Without hesitation, Kyle chose a path of selfless heroism that few can imagine. He jumped on the grenade, saving Nick but sacrificing his own body.  Kyle Carpenter’s heart flatlined three times while being evacuated off the battlefield in Afghanistan. Yet his spirit was unbroken. Severely wounded from head to toe, Kyle lost his right eye as well as most of his jaw. It would take dozens of surgeries and almost three years in and out of the hospital  to reconstruct his body. From there, he began the process of rebuilding his life. What he has accomplished in the last nine years is he’s come back a stronger, better, wiser person.In 2014, Kyle was awarded the nation’s highest military decoration, the Medal of Honor, for his “singular act of courage” on that rooftop in Afghanistan, an action which had been reviewed exhaustively by the military. Kyle became the youngest living recipient of the award–and only the second living Marine so honored since Vietnam.Kyle’s remarkable memoir reveals a central truth that will inspire every  Life is worth everything we’ve got. It is the story of how one man became a so-called hero who willingly laid down his life for his brother-in-arms—and equally, it is a story of rebirth, of how Kyle battled back from the gravest challenge to forge a life of joyful purpose.You Are Worth It is a memoir about the war in Afghanistan and Kyle’s heroics, and it is also a manual for living. Organized around the credos that have guided Kyle’s life (from “Don’t Hide Your Scars” to “Call Your Mom”), the book encourages us to become our best selves in the time we’ve been given on earth. Above all, it’s about finding purpose, regardless of the hurdles that may block our way. Moving and unforgettable, You Are Worth It is an astonishing memoir from one of our most extraordinary young leaders.",
  "genres": [
    "Nonfiction",
    "Military Fiction",
    "Memoir",
    "War",
    "Biography",
    "Leadership",
    "Self Help"
  ],
  "author": "Kyle Carpenter",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/42117336-you-are-worth-it"
}