{
  "title": "Possessive Boston Irish American MMA Fighter",
  "description": "My brother’s best friend is a Boston Irish American older man.  He possesses an undefeated record as an MMA fighter, but the moment he lays eyes on me he tells me the only thing he’s interested in possessing now is me.  And when this younger woman witnesses him take part in a fight for the first time the barbaric violence shouldn’t turn me on, but it does. He’s a real man amongst boys in and out of the octagon, and I’m ready to be his woman, and for the first time in my life I know I’m ready for another kind of first time…with him.  But before my brother’s best friend is able to tell my brother about what’s going on between us, he finds out the hard way, making him feel like he’s been sucker punched by his best friend.  Can my possessive Boston Irish American older man prove to my brother that what we have is real and that this MMA fighter will fight harder than he ever has inside the octagon, outside of it…for me?  Or will my brother do his best to make sure my brother’s best friend’s beautiful Irish eyes aren’t smiling by threatening him with violence of his own, causing me to get caught in the middle of two possessive older men…one my flesh and blood family and the other I want nothing more than to start my own family with knowing what we have will last forever.  But how can I bring myself to come between my brother and my brother’s best friend? Will I be forced into a split decision of my own…choosing between them with my choice causing heartache one way or the other…forever?  *Possessive Boston Irish American MMA Fighter is an insta-everything standalone instalove romance with an HEA, no cheating, and no cliffhanger.",
  "genres": [
    "Romance",
    "Mixed Martial Arts",
    "New Adult",
    "Contemporary",
    "Sports Romance",
    "Short Stories",
    "Sports"
  ],
  "author": "Flora Ferrari",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/42121659-possessive-boston-irish-american-mma-fighter"
}