{
  "title": "The Rulers of Russia and the Russian Farmers",
  "description": "I repeatedly promised Saint Peter that if I ever got the chance, I would teach the truth about his Master in the way he and his successors, the Roman Pontiffs, wanted it done. That is what I have striven to do and am doing.”— Fr. Denis FaheyFr. Fahey’s life work was the promotion of the Catholic social doctrine of Christ the King. He firmly believed that “the world must conform to Our Divine Lord, not He to it.” He always defended the Mystical Body of Christ without compromise. He called the social doctrine “Our Lord’s Program for Order.”This is the second book Father Fahey wrote exposing Communism as it was actually practised in Russia. The first book, The Rulers of Russia was published ten years earlier and was widely appreciated for its exposure of the truth about those who brought about the ‘birth’ of Communism.“See to it, Venerable Brethren, that the faithful do not allow themselves to be deceived! Communism is intrinsically wrong.”— Pius XI, Divini Redemptoris, on Atheistic Communism “When in Rome I began to realize more fully the real significance of the history of the world, as the account of the acceptance and rejection of Our Lord’s Program for Order. I used to ask permission to remain at the Confession of St. Peter, while the other scholastics went round the basilica.“I spent the time there going over the history of the world, and I repeatedly promised Saint Peter that if I ever got the chance, I would teach the truth about his Master in the way he and his successors, the Roman Pontiffs, wanted it done.That is what I have striven to do and am doing.”Father Fahey not only clarified, explained, taught, and defended ‘Our Lord’s Program for Order’ in the world, he also actively fought and exposed the persons who were the enemies of that order. Because he did so, he has often been called ‘negative’ or ‘anti-Semitic’, or ‘much too concerned with Masonic conspiracies’. These are the pathetic terms of opprobrium hurled with such energy by those enemies of Christ whose plans he has effectively opposed. But in this he was in good company with St. Louis Marie de Montfort and Our Lady, who appears ‘terrible as an army set in battle array’ to the enemies of her divine son.Listen to the words of St. Louis Marie as he stresses the two functions of our Blessed Mother, the positive one of making Our Lord known, and the negative one of making war upon His enemies. Mary must be manifested more than ever by her mercy, her power and her grace in these latter times; by her mercy, bringing back and lovingly welcoming the poor strayed sinners who will be converted and will return to the Catholic Church; by her power, against the enemies of God, idolaters, schismatics, Mohammedans, Jews, and men hardened in impiety, who will rise in terrible revolt to seduce all those who oppose them and to make them fall by promises and threats; she must also be made manifest by her grace animating and sustaining the valiant soldiers and faithful servants of Jesus Christ, who shall battle for His interests.And lastly, Mary must be terrible to the devil and his ministers, as an army in battle array, principally in these latter times, because the devil knowing that he has but little time, and now less than ever, to damn souls, will every day redouble his efforts and his combats. He will before long raise up cruel persecutions and will lay terrible snares for the faithful servants and true children of Mary.",
  "genres": [
    "Russia",
    "Philosophy"
  ],
  "author": "Denis Fahey",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/42116537-the-rulers-of-russia-and-the-russian-farmers"
}