{
  "title": "Piety & Power: Mike Pence and the Taking of the White House",
  "description": "A revealing, in-depth biography of Mike Pence, the most secretive and ingratiating vice president in modern history, from a reporter with remarkable access No journalist has covered Mike Pence for as long or as closely as Tom LoBianco. The seasoned political reporter was at the first campaign rally governor Pence held in his hometown of Columbus, Indiana. He was there when Pence returned to Washington as Donald Trump’s vice president. Drawing on his deep ties both within the Beltway and in Indiana state politics, as well as reams of research and deep access to the vice president and his staff, LoBianco offers a revealing portrait of the devout Christian who shocked many of his closest followers when he joined the campaign and became one of the strongest champions of Donald Trump. He also explores the rumors—much debated inside the Beltway and among pundits in the media—surrounding the Vice President’s ambitions to succeed and even \"overthrow\" Trump.LoBianco dissects Pence’s entire political life, from his detours in the ’90s, to his rapid ascension through the first decade of the twenty-first century, to the White House, and provides an inside account of how Pence nearly crashed and burned his career while governor, only to miraculously rise from the ashes thanks to the unlikely election of Trump. He also gives a rare look inside the \"shadow government\" Pence has built—a conservative machine at Trump’s call for now, but one that could just as easily step in if Trump is removed from office.Piety & Power cuts to the core of the nation’s most enigmatic politician, and unearths new, important, and fascinating anecdotes about Pence’s faith, his marriage to Karen Pence, his bizarre, obsequious relationship with Trump, his deeply buried personality, his ascent to power under John Boehner, and his presidential aspirations and plans for America’s future.From the explosive revelations of the Russia investigation to the sea change affecting the Republican party and its direction under Trump, it is vital that Americans know more about the man who could ascend to the Oval Office. Piety & Power provides insights and answers as it sheds light on this ambitious Midwestern politician, his past, and his possible future.",
  "genres": [
    "Politics",
    "Biography",
    "Nonfiction",
    "History",
    "Government"
  ],
  "author": "Tom Lobianco",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/42116177-piety-power"
}