{
  "title": "Plenty: One Man, One Woman, and a Raucous Year of Eating Locally",
  "description": "Like many great adventures, the 100-mile diet began with a memorable feast. Stranded in their off-the-grid summer cottage in the Canadian wilderness with unexpected guests, Alisa Smith and J.B. MacKinnon turned to the land around them. They caught a trout, picked mushrooms, and mulled apples from an abandoned orchard with rose hips in wine. The meal was truly satisfying; every ingredient had a story, a direct line they could trace from the soil to their forks. The experience raised a question: Was it possible to eat this way in their everyday lives?Back in the city, they began to research the origins of the items that stocked the shelves of their local supermarket. They were shocked to discover that a typical ingredient in a North American meal travels roughly the distance between Boulder, Colorado, and New York City before it reaches the plate. Like so many people, Smith and MacKinnon were trying to live more lightly on the planet; meanwhile, their “SUV diet” was producing greenhouse gases and smog at an unparalleled rate. So they decided on an experiment: For one year they would eat only food produced within 100 miles of their Vancouver home.It wouldn’t be easy. Stepping outside the industrial food system, Smith and MacKinnon found themselves relying on World War II–era cookbooks and maverick farmers who refused to play by the rules of a global economy. What began as a struggle slowly transformed into one of the deepest pleasures of their lives. For the first time they felt connected to the people and the places that sustain them.For Smith and MacKinnon, the 100-mile diet became a journey whose destination was, simply, home. From the satisfaction of pulling their own crop of garlic out of the earth to pitched battles over canning tomatoes, Plenty is about eating locally and thinking globally.The authors’ food-focused experiment questions globalization, monoculture, the oil economy, environmental collapse, and the tattering threads of community. Thought-provoking and inspiring, Plenty offers more than a way of eating. In the end, it’s a new way of looking at the world.",
  "genres": [
    "Food",
    "Nonfiction",
    "Memoir",
    "Sustainability",
    "Environment",
    "Health",
    "Cooking"
  ],
  "author": "Alisa Smith",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/421393.Plenty"
}