{
  "title": "Inside the Minds of Serial Killers: Why They Kill",
  "description": "There are many cultural myths about serial killers, often propagated even by mental health professionals. Many assume there is a profile of a serial killer, that serial killers always go for the same victim type or always use the same MO, that they are more clever than ordinary people, and that they are inevitably charming and attractive. The truth is not as simple as that. There are different types of serial killers and while there are many books that discuss the serial killer phenomenon especially in relationship to victim types or context, researchers have not yet been able to come up with a definition, or type, that covers the broad spectrum of serial killers and their complex psychological dynamics. Ramsland looks at serial killer types, illustrating that it is difficult to accurately depict these elusive, intriguing, and dangerous killers. This book examines a variety of serial killers, from sexual predators to psychotic killers, from murder teams to odd eccentric stalkers, in order to present the distinct psychological dynamics that set serial killers apart from other violent murderers. Among the motives addressed are lust, control, glory, profit, thrill, delusions, rage, the desire for company, the need to please a partner, and even murder as an intellectual exercise. Serial killers live double lives, hiding their violence even from those who live with them, so along with a study of motives are chapters devoted to how close associates have described killers, including parents, siblings, co-workers, lovers, and survivors. There is no profile of a serial killer, and this book establishes that in vivid and frightening detail.",
  "genres": [
    "True Crime",
    "Psychology",
    "Nonfiction",
    "Crime",
    "Serial Killer"
  ],
  "author": "Katherine Ramsland",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/421369.Inside_the_Minds_of_Serial_Killers"
}