{
  "title": "Black Creek Crossing",
  "description": "The dark history and dire secrets of a peaceful small town are summoned from the shadows of the past. Unholy forces are stirred from long slumber to monstrous new life. And two young misfits discover the chilling art of turning persecution into retribution. With these eerie ingredients, bestselling master John Saul once again works his unique brand of sinister magic to conjure an unforgettable tale of unspeakable terror.For most of her young life, fifteen-year-old Angel Sullivan has been on the outside looking in, enduring the taunts of cruel schoolmates and the angry abuse of a bitter father. Then Angel’s family moves to the quaint town of Roundtree, Massachusetts—where a charming home is available, a promising job awaits Angel’s unemployed father, and most of all, the chance to make a new start beckons to the shy, hopeful teenager. But when she is shunned by her new classmates, Angel falls deeper into despair. Until she meets Seth Baker, a fellow outcast—and a fateful kinship is forged. It’s Seth who tells Angel the unspoken truth about the legacy of murder that hangs over her family’s home—and the whispered rumors that something supernatural still dwells there. Uncertain whether the stories are true, and desperate to escape the torment of their daily lives, Angel and Seth devote themselves to contacting whatever restless soul haunts the dark recesses of Black Creek Crossing. But once they have begun, there is no turning back. Guided by an anguished and vengeful spirit, they uncover the shocking events and centuries-old horrors that lay buried beneath the placid veneer of Roundtree. And along with the ghastly revelations comes a terrifying power—one that feeds upon the rage of the victimized, turning the basest impulses and most dangerous desires into devastating weapons. Now, the closer Angel and Seth are pushed toward the edge by their tormentors, the deeper they descend into the maelstrom of dark forces they’ve unleashed . . . and the more unspeakable the hour of reckoning will be.",
  "genres": [
    "Horror",
    "Fiction",
    "Mystery",
    "Thriller",
    "Paranormal",
    "Supernatural",
    "Suspense"
  ],
  "author": "John Saul",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/421416.Black_Creek_Crossing"
}