{
  "title": "Hello Darling",
  "description": "Millions of women all over the world would drop their knickers for British movie star Evan Hunter. Now he’s falling for the one American woman who won’t…Yet.Everyone on Main Street has been talking about Evan Hunter, the British movie star who’ll be filming on location in our small Pacific Northwest town for a couple of months, and all I have to say about that “Who?”When he shows up two weeks early to escape the London paparazzi after breaking up with some starlet, all I want to know “So?”When he walks into the gym that I manage for my dad and brothers, to start training for the action scenes in his movie, I’ll admit I do say to “Hmmm…”But he’s not my type. I’ll take a fireman or a lumberjack over a pretty actor any day—I don’t care how blue his eyes are, how chiseled his features or how crackling our chemistry has been from the first “hello.”Okay, so it turns out Mr. Charming and Sophisticated isn’t quite the polite English gentleman when we’re alone together in private. He may, in fact, be a filthy-mouthed sex god. He may, impossibly, have his sights set on me.Obviously, there’s only one way for me to prove to him that I’m immune to this British actor nonsense. I’m going to prove it to him so hard.But I have rules for flings with out-of-towners and I will continue to enforce them, even with ridiculously beautiful international film stars. Even though he gets along so well with my family. Even though we somehow seem to understand each other in ways that no one else ever could. Even if he makes me wonder what it’s like out there in the world outside of this coastal paradise I’ve always called home.I’m staying right where I am, no matter where he claims to want to take me with him when he leaves. Every time he says “Hello Darling,” all I hear “goodbye heart.”",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Audiobook",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Kayley Loring",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/42152934-hello-darling"
}