{
  "title": "In the Dark of the Night",
  "description": "Summer vacation becomes a season in hell for an ordinary family who unwittingly stir something invisible, insidious, and insatiable from its secret slumber–unleashing a wave of horror only the darkest evil could create, that only a master of spine-tingling terror like John Saul could orchestrate. For deep in the shadows in the dark of the night lurks something as big as life . . . and as real as death.It has waited seven years for someone to come back to the rambling lakeside house called Pinecrest, which has stood empty since its last owner went missing. For upscale Chicago couple Dan and Merrill Brewster, the old midwestern manse is an ideal retreat, and for their kids, Eric and Marci, it’s the perfect place to spend a lazy summer exploring. Which is how Eric and his teenage friends discover the curious cache of discarded objects stowed in a hidden room of Pinecrest’s carriage house. The bladeless hacksaws, shadeless lamps, tables with missing legs, headless axe handle, and other unremarkable items add up to a pile of junk. Yet someone took the trouble to inventory each worthless relic in a cryptic ledger. It has all the makings of a great mystery–whispering, coaxing, demanding to be solved.But the more the boys devote themselves to restoring the forgotten possessions and piecing together the puzzle behind them, the more their fascination deepens into obsession. Soon their days are consumed with tending the strange, secret collection–while their nights become plagued by ever more ghastly dreams, nightmares that soon seep into reality. And when a horrifying discovery surfaces, so does the chilling truth–about the terrifying events that rocked the town seven years before, the mysterious disappearance of Pinecrest’s last resident, and a twisted legacy with a malevolent life of its own . . . and a bottomless hunger for new victims.",
  "genres": [
    "Horror",
    "Fiction",
    "Mystery",
    "Thriller",
    "Paranormal",
    "Supernatural",
    "Suspense"
  ],
  "author": "John Saul",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/421415.In_the_Dark_of_the_Night"
}