{
  "title": "Haunting Paris",
  "description": "A timeless story of love and loss is transformed when a bereaved pianist discovers a mysterious letter among her late lover's possessions, launching her headlong into a decades-old search for a child who vanished in the turbulence of wartime Paris. \nIn the summer of 1989, while all of Paris is poised to celebrate the bicentennial of the French Revolution, Sylvie mourns the loss of her lover, Julien, and is unable to find solace in the music that has always been her refuge. But when she accidentally dislodges an envelope hidden in Julien's desk, she finds an enigmatic note from a stranger and feels compelled to meet this woman who might hold the key to Julien's past and to the story of the missing child he could not find in his lifetime. Julien's sister and one of her daughters perished in the Holocaust; but Julien held out hope that the other daughter managed to escape. Julien had secretly devoted years to tracking his niece, and now Sylvie picks up where he left off. With only the scant clue of an unnumbered street, Sylvie sets out on her quest for knowledge, unaware that she is watched over by Julien's ghost, whose love for her is powerful enough to draw him back, though he is doomed to remain a silent observer in the afterlife. Sylvie's journey leads her deep into the secrets of Julien's past and she finally learns the devastating reason for Julien's reticence about a tragedy both personal and historic, shedding new light on the dark days of Nazi-held Paris and on the man Sylvie loved.  Mamta Chaudhry's gorgeously written and profoundly moving debut novel explores the grief of mourning a partner, the protective conspiracies of family secrets, and the undeniable power of memory. Weaving a narrative rich in vivid imagery and historical resonance, Haunting Paris matches emotional intensity with lyrical storytelling to bring a long-buried secret to light, capturing a relationship, a family, and a city in breathtaking new ways.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "France",
    "World War II",
    "Historical",
    "Literary Fiction"
  ],
  "author": "Mamta Chaudhry",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/42179737-haunting-paris"
}