{
  "title": "From the Ground Up: A Journey to Reimagine the Promise of America",
  "description": "NEW YORK TIMES BESTSELLER • From the longtime CEO and chairman of Starbucks, a bold, dramatic work about the new responsibilities that leaders, businesses, and citizens share in American society today—as viewed through the intimate lens of one man’s life and work.  What do we owe one another? How do we channel our drive, ingenuity, even our pain, into something more meaningful than individual success? And what is our duty in the places where we live, work, and play? These questions are at the heart of the American journey. They are also ones that Howard Schultz has grappled with personally since growing up in the Brooklyn housing projects and while building Starbucks from eleven stores into one of the world’s most iconic brands. In From the Ground Up, Schultz looks for answers in two interwoven narratives. One story shows how his conflicted boyhood—including experiences he has never before revealed—motivated Schultz to become the first in his family to graduate from college, then to build the kind of company his father, a working-class laborer, never had a chance to work a business that tries to balance profit and human dignity. A parallel story offers a behind-the-scenes look at Schultz’s unconventional efforts to challenge old notions about the role of business in society. From health insurance and free college tuition for part-time baristas to controversial initiatives about race and refugees, Schultz and his team tackled societal issues with the same creativity and rigor they applied to changing how the world consumes coffee. Throughout the book, Schultz introduces a cross-section of Americans transforming common struggles into shared successes. In these pages, lost youth find first jobs, aspiring college students overcome the yoke of debt, post-9/11 warriors replace lost limbs with indomitable spirit, former coal miners and opioid addicts pave fresh paths, entrepreneurs jump-start dreams, and better angels emerge from all corners of the country. From the Ground Up is part candid memoir, part uplifting blueprint of mutual responsibility, and part proof that ordinary people can do extraordinary things. At its heart, it’s an optimistic, inspiring account of what happens when we stand up, speak out, and come together for purposes bigger than ourselves. Here is a new vision of what can be when we try our best to lead lives through the lens of humanity. “Howard Schultz’s story is a clear reminder that success is not achieved through individual determination alone, but through partnership and community. Howard’s commitment to both have helped him build one of the world’s most recognized brands. It will be exciting to see what he accomplishes next.”—Bill Gates",
  "genres": [
    "Biography",
    "Business",
    "Nonfiction",
    "Politics",
    "Leadership",
    "Memoir",
    "History"
  ],
  "author": "Howard Schultz",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/42176907-from-the-ground-up"
}