{
  "title": "Nein!: Standing up to Hitler 1935–1944",
  "description": "From the bestselling and prize-winning author Paddy Ashdown, a revelatory new history of German opposition to Hitler from 1935 – 1944In his last days, Adolf Hitler raged in his bunker that he had been betrayed by his own people, defeated from the inside. In part, he was right. By 1945, his armies were being crushed on all fronts, his regime collapsing with many fleeing retribution for their crimes. Yet, even before the war started, there were Germans very high in Hitler’s command committed to bringing about his death and defeat.Paddy Ashdown tells, for the first time, the story of those at the very top of Hitler’s Germany who tried first to prevent the Second World War and then to deny Hitler victory. Based on newly released files, the repeated attempts of the plotters to warn the Allies about Hitler’s plans are revealed. Key strands to the book’s narrative lie with the actions of Abwehr head Admiral Wilhelm Canaris to frustrate Hitler’s policies once the war had started; the plots to kill Hitler and, finally the systematic passage of key German military secrets to London, Washington and Moscow through MI6, the OSS (fore-runner to the CIA) and the “Lucy Ring” Russian spy network based in Switzerland. From 1943 onwards, concerted efforts were made to strike a separate peace with the West to shorten the war and prevent eastern Europe falling under the Soviet yoke.What is revealed is that the anti-Hitler bomb plots, which have received so much attention are, in fact only a small part of a much wider story; one in which those at the highest levels of the German state used every means possible – conspiracy, assassination, espionage – to ensure that, for the sake of the long-term reputation of their country and the survival of liberal and democratic values, Hitler could not be allowed to win the war. It is a matter of record that the European Union we have today and the nature and central position of Germany within it, is, in very large measure, the future envisaged by the plotters and for which they gave their lives.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Germany",
    "Historical",
    "European History"
  ],
  "author": "Paddy Ashdown",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/42179796-nein"
}