{
  "title": "Sexual Consent",
  "description": "An introduction to issues of sexual consent, covering key strands of feminist thought, how sexual consent is negotiated in practice, the influence of popular culture, and more. The #MeToo movement has focused public attention on the issue of sexual consent. People of all genders, from all walks of life, have stepped forward to tell their stories of sexual harassment and violation. In a predictable backlash, others have taken to mass media to inquire plaintively if “flirting” is now forbidden. This volume in the MIT Press Essential Knowledge series offers a nuanced introduction to sexual consent by a writer who is both a scholar and an activist on this issue. It has become clear from discussions of the recent high-profile cases of Harvey Weinstein, Bill Cosby, and others that there is no clear agreement over what constitutes consent or non-consent and how they are expressed and perceived in sexual situations. This book presents key strands of feminist thought on the subject of sexual consent from across academic and activist communities and covers the history of research on consent in such fields as psychology and feminist legal studies. It discusses how sexual consent is negotiated in practice, from “No means no” to “Yes means yes,” and describes what factors might limit individual agency in such negotiations. It examines how popular culture, including pornography, romance fiction, and sex advice manuals, shapes our ideas of consent; explores the communities at the forefront of consent activism; and considers what meaningful social change in this area might look like. Going beyond the conventional cisgender, heterosexual norm, the book lists additional resources for those seeking to improve their practice of consent, survivors of sexual violence, and readers who want to understand contemporary debates on this issue in more depth.",
  "genres": [
    "Nonfiction",
    "Sexuality",
    "Feminism",
    "Relationships",
    "Society"
  ],
  "author": "Milena Popova",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/42179007-sexual-consent"
}