{
  "title": "Xavier: Angelbound Worlds, Book 1",
  "description": "\"Anyone into fantasy and other worldly experiences would enjoy these books. I am officially addicted!\" - Rachely, GoodreadsI am the archangel Xavier,General of the Angelic Army.My life began at the dawn of time,And in all the long eons since I have only known war, never love.Until HER.Enter the Angelbound Worlds, a new series of novellas that take place within different areas and eras of the after-realms (Heaven, Hell, Purgatory, the Dark Lands, and Antrum). Don’t miss Book 1 in the Angelbound Worlds series, in which the archangel Xavier shares how he finally fell in love.Suggested to read after Angelbound Origins Book 1.\"SUCH interesting stories!! I love the characters, the plot, the writing style. Unique, beautiful, not sappy with the romance, but steamy enough to keep my interest. DEFINITELY recommend!\" - Keri, GoodreadsPublisher's Note: Christina Bauer is a non-linear thinker who came up with ARMAGEDDON and then went back and wrote some earlier books. This is why you'll see ARMAGEDDON (Book 7) and the Offspring series available before THE BRUTAL TIME (Book 6). We've told her to stop this practice, but she keeps giving us lewd hand gestures in response. Apologies in advance for any inconvenience. Don't Miss These Series From Christina Bauer- Fairy Tales of the Magicorum, a series of modern fairy tales with sass, action, and romance- Beholder, where a medieval farm girl discovers necromancy and true love - Dimension Drift,  a dystopian adventure with science, snark, and hot aliens- Angelbound, about a quasi (part human and part demon) girl who loves to kick butt in Purgatory’s Arena as outlined below...Angelbound OriginsIn which Myla Lewis kicks ass and takes names. Nuff said..5 Duty Bound - a prequel from Prince Lincoln1. Angelbound1.5 Lincoln - the events of Angelbound as told by Prince Lincoln 2. Scala  3. Acca  4. Thrax  5. The Dark Lands  6. The Brutal Time (Fall 2019) 7. Armageddon (already here, long story!) Angelbound OffspringThe next generation takes on Heaven, Hell, and everything in between1. Maxon 2. Portia3. Zinnia (Summer 2019)4. Kaps (Summer 2020)5. Huntress (Summer 2021) Angelbound WorldsInside stories about your fav characters1. Xavier (Spring 2020)2. Cissy (Spring 2021)Get your FREE copy of Christina’s novella, BEVERLY HILLS VAMPIRE, when you sign up for her personal newsletter: https://tinyurl.com/bauersbooks ***Not available in stores***",
  "genres": [],
  "author": "Christina Bauer",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/42194687-xavier"
}