{
  "title": "V.Q.E",
  "description": "RATED # 1 in New Releases on AMAZONWas Great Britain of the 1980’s a welcoming place for a young man hailing from its former colony? How did the National Health Service exploit the vulnerable physicians from a newly independent and struggling India to fulfill its needs? What were the flaming hoops that a foreign physician had to jump through to further his professional career in the UK en route to a final destination in the United States? Read about all this in a gripping, event filled narrative- VQE- an acronym for the dreaded Visa Qualifying Exam, a grueling 2-day test that all foreign physicians had to pass to practice medicine in the United States.This dazzlingly original book does not subscribe to any set genre. It is a unique chronicle that weaves the current events of those times with the memoir of a young foreign physician in an alien land to produce a piece of work that is informative, touching at times and entertaining in parts. It captures the despair, the hopes, trepidations and travails of this young man from a financially indigent India of the 1980’s as he charts his way through the land of his colonial masters and the innumerable challenges of this tumultuous period of his life: professional setbacks in the form of exam failures, joblessness as he moves from one part of Britain to another changing cities sometimes every two weeks in search of work; a cataplexic agoraphobia as he tries to come to terms with British racism on the streets. Meanwhile in the background a host of remarkable events are being played out- Lady Diana’s wedding, inter-racial riots and the British-Argentina war over the Falkland Islands.The author graduated from a prestigious medical school in India and has practiced medicine in 3 countries-India, UK and US. He holds numerous postgraduate qualifications- he is a Member of the Royal College of Physicians of Ireland (MRCP-I), a Diplomate of the American Board of Internal Medicine and Gastroenterology and has a degree in Health Care management from Harvard UniversityThis book will be an interesting and compelling read for everyone in general and physicians in particular.",
  "genres": [],
  "author": "Vivek Gumaste",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/42197483-v-q-e"
}