{
  "title": "Carl Van Doren: A Man of Ideas",
  "description": "2019 NATIONAL INDIE EXCELLENCE AWARDS FINALIST.Carl Van Doren (1885-1950), biographer, historian, essayist, and literary critic, wrote during the golden era of literary and cultural criticism that flourished across the 1920s, ‘30s, and ‘40s. One of the nation’s most prolific literacy critics, Van Doren covered everybody who was anybody; he was in many ways The Man Who Knew Everybody. His personal and professional correspondence with the likes of Sinclair Lewis, Robert Frost, Elinor Wylie, and H. L. Mencken bring to life America’s literary and intellectual landscape across the first half of the twentieth century. The Pulitzer Prize winning Van Doren was, most simply, a man of ideas, a public intellectual in an age when the Intellectual was itself an esteemed vocation. Arriving in New York City with the wave of urban modernism that would brand Manhattan simply as: The City, Van Doren began his career writing for The Nation and quickly moved on to include Scribner’s, Century, Atlantic Monthly, The New Republic, the Saturday Review, and Good Housekeeping. He was the author of many books of American and literary history, was editor of the Literary Guild of America and the Readers Club, and won the Pulitzer Prize for his work on Benjamin Franklin. A self-described \"lone hyena\", he also suffered more than his share of personal tragedy, including the breakup of two marriages.In this work, historian Robin Foster follows a literary career, and discovers a modern American life.Review from Publishers Weekly/Booklife: In this admiring and enthusiastic biography, historian Foster (The Age of Sail in the Age of Aquarius) examines the life and work of critic Carl Van Doren (1885–1950). She carefully traces Van Doren’s Illinois upbringing and his early desire to move to New York City, where he would go on to study, and later teach, at Columbia University. Drawing deeply on Van Doren’s correspondence with writers including Mary Hunter Austin, Theodore Dreiser, and Sinclair Lewis, Foster reveals his intense engagement with the literary culture of early and mid-20th-century America. These contributions included a steady stream of essays and book reviews for periodicals such as Century, the Nation, and the Saturday Review of Literature; presiding over selections for one of the first monthly book clubs, the Literary Guild of America; and writing the Pulitzer-winning biography Benjamin Franklin. Foster finds Van Doren “at his most brilliant” as a critic in his introductory essay for Carl Van Doren: The Viking Portable Library, which contained the ringing declaration that “American literature is the only important literature in the world that is younger than the art of printing.” Foster’s in-depth study of Van Doren as an exemplar of an “era when the Man of Ideas was itself a calling” should stand for many years to come. (BookLife)",
  "genres": [],
  "author": "Robin Foster",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/42198385-carl-van-doren"
}