{
  "title": "Lincoln's Spies: Their Secret War to Save a Nation",
  "description": "A major addition to the history of the Civil War, Lincoln’s Spies is a riveting account of the secret battles waged by Union agents to save a nation. Filled with espionage, sabotage, and intrigue, it is also a striking portrait of a shrewd president who valued what his operatives uncovered. Veteran journalist Douglas Waller, who has written ground-breaking intelligence histories, turns his sights on the shadow war of four secret agents for the North—three men and one woman. From the tense days before Abraham Lincoln’s inauguration in 1861 to the surrender at Appomattox four years later, Waller delivers a fast-paced narrative of the heroes—and scoundrels—who informed Lincoln’s generals on the enemy positions for crucial battles and busted up clandestine Rebel networks.Famed detective Allan Pinkerton mounted a successful covert operation to slip Lincoln through Baltimore before his inauguration to foil an assassination attempt. But he failed as General George McClellan’s spymaster, delivering faulty intelligence reports that overestimated Confederate strength.George Sharpe, an erudite New York lawyer, succeeded Pinkerton as spymaster for the Union’s Army of the Potomac. Recruiting skilled operatives, some of whom dressed in Rebel uniforms, Sharpe ran highly successful intelligence operations that outpaced anything the enemy could field.Elizabeth Van Lew, a Virginia heiress who hated slavery and disapproved of secession, was one of Sharpe’s most successful agents. She ran a Union spy ring in Richmond out of her mansion, with dozens of agents feeding her military and political secrets she funneled to General Ulysses S. Grant as his army closed in on the Confederate capital. Van Lew became one of the unsung heroes of the war.Lafayette Baker was a handsome Union officer with a controversial past, whose agents clashed with Pinkerton’s operatives. The unscrupulous Baker assembled a retinue of disreputable spies, thieves, and prostitutes to root out traitors in Washington, D.C. But he failed at his most important mission: uncovering the threat to Lincoln from John Wilkes Booth and his gang.Behind these secret operatives was a president, one of our greatest, who was an avid consumer of intelligence and a ruthless aficionado of clandestine warfare, willing to take chances to win the war. Lincoln’s Spies, as Waller vividly depicts in his excellent new book, set the template for the dark arts the CIA would practice in the future.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "Espionage",
    "American History",
    "Military Fiction",
    "American Civil War"
  ],
  "author": "Douglas C. Waller",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/42201436-lincoln-s-spies"
}