{
  "title": "Dahlia Black",
  "description": "For fans of World War Z and the Southern Reach Trilogy, a suspenseful oral history commemorating the five-year anniversary of the Pulse—the alien code that hacked the DNA of Earth’s population—and the response team who faced the world-changing phenomenon. Voyager 1 was a message in a bottle. Our way of letting the galaxy know we existed. That we were out here if anyone wanted to find us.Over the next forty years, the probe flew past Jupiter and Saturn before it drifted into the void, swallowed up by a silent universe. Or so we thought…Truth is, our message didn’t go unheard.  Discovered by Dr. Dahlia Black, the mysterious Pulse was sent by a highly intelligent intergalactic species that called themselves the Ascendants. It soon becomes clear this alien race isn’t just interested in communication—they are capable of rewriting human DNA, in an astonishing process they call the Elevation. Five years after the Pulse, acclaimed journalist Keith Thomas sets out to make sense of the event that altered the world. Thomas travels across the country to interview members of the task force who grappled to decode the Pulse and later disseminated its exact nature to worried citizens. He interviews the astronomers who initially doubted Black’s discovery of the Pulse—an error that critics say led to the world’s quick demise. Thomas also hears from witnesses of the Elevation and people whose loved ones vanished in the Finality, an event that, to this day, continues to puzzle Pulse researchers, even though theories abound about the Ascendants’ motivation. Including never-before-published transcripts from task force meetings, diary entries from Black, and candid interviews with Ballard, Thomas also shows in Dahlia Black how a select few led their country in its darkest hours, toward a new level of humanity.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Aliens",
    "Dystopia",
    "Horror",
    "Adult",
    "Apocalyptic"
  ],
  "author": "Keith  Thomas",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/42201397-dahlia-black"
}