{
  "title": "The Year's Best Military & Adventure SF Volume 5",
  "description": "The Year's Best Military & Adventure SF series enters its fifth year! Selected from the top print and online markets, these stories represent the best in modern military sf, space opera, and adventure sf.The Year's Best Military and Adventure SF series roars into its fifth year, with more stories of derring-do, military combat, and edge of your seat suspense. Thrilling tales of grand science fiction adventure and military action. Selected from the top print and digital markets, these stories are guaranteed to challenge, provoke, and entertain. Plus, you be the judge! INTERACTIVE READER VOTING. One story from this anthology will be chosen via proctored online voting for The Best Military and Adventure Science Fiction Reader's Choice Award, presented at DragonCon in Summer 2019. For more information, go to Baen.com.About The Year’s Best Military and Adventure Science Fiction 2015: “Baen’s fan-guided anthology series roars into its second year with a collection of stories just as eclectic as the first. . . . Afsharirad has put together a refreshing military and SF anthology that will be enjoyed by a wide range of readers.”—Publishers Weekly (starred review)About The Year's Best Military SF and Space Opera Volume 1: “This intriguing anthology explores the human race’s violent potential [but] also bends toward exploration and the triumph of the human spirit, with brave tales [that] take the reader on a fascinating, thought-provoking, enjoyable journey . . . ”—Publishers Weekly (starred review) “[A] nice eclectic mix of magazines—hardcopy and digital—and original anthologies. Afsharirad seems to have cast his nets admirably wide. . . . The variety of styles and topics and themes, and the high level of craft in this assemblage, prove that this subgenre is flourishing. . . . [The collection] should be welcome by raw recruits and veterans alike.”—Locus",
  "genres": [
    "Science Fiction"
  ],
  "author": "David Afsharirad",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/42201643-the-year-s-best-military-adventure-sf-volume-5"
}