{
  "title": "To Sir, with Love: An Unofficial Legend of The Secret World",
  "description": "When the world ends, the fog rolls into Solomon Island and the dead start to rise. Innsmouth Academy senior Blodwedd Mallory fights to save her school from the destruction. But can she uncover secrets of the Academy’s dark history in time to stop Mal'un the Accursed from destroying the headmaster and preventing her graduation and initiation as a Templar?It’s Samhaintide, and things are tough right now at Innsmouth Academy. The aftermath of the mysterious fog has left most of the faculty dead and the students running around the Academy grounds as zombies. Only a few remain safely behind the protective wards of the Academy’s Administration Office. Wedd and her best friend Gypcie spend their time scavenging the campus for supplies and charging the anima wards that keep the marauding zombies out of Innsmouth Academy and the mighty magical tomes of the Academy’s library in. They have mastered the art of doing that while dodging an unruly herd of dangerous familiars, cut loose from the control of the now-dead students who made them. However, one wrong step or misfired spell could mean disaster. To make matters worse, an old skeleton in the headmaster’s closet reveals itself, and a powerful demon wants vengeance for the unpaid blood debt. When Mal’un the Accursed trespasses the failing Academy wards to collect on the debt, it’s only a matter of time until blood is spilled. With the support of Gypcie and the other Academy survivors, Wedd must figure out how to exorcize the infernal wraith without sacrificing the headmaster’s life. Not only must she vanquish the wraith, but Wedd still needs to prove her blood magic skills and get her math homework done so she can graduate and join the Templars in London in the spring. That may be one more task than she can manage. So far, the prognosis isn’t looking good. Dark days aren’t coming for Wedd and the Innsmouth Academy…they’re already here.",
  "genres": [],
  "author": "Blodwedd Mallory",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/42203182-to-sir-with-love"
}