{
  "title": "A Place to Belong",
  "description": "A Japanese-American family, reeling from their ill treatment in the Japanese internment camps, gives up their American citizenship to move back to Hiroshima, unaware of the devastation wreaked by the atomic bomb in this piercing look at the aftermath of World War II by Newbery Medalist Cynthia Kadohata.World War II has ended, but while America has won the war, twelve-year-old Hanako feels lost. To her, the world, and her world, seems irrevocably broken. America, the only home she’s ever known, imprisoned then rejected her and her family—and thousands of other innocent Americans—because of their Japanese heritage, because Japan had bombed Pearl Harbor, Hawaii. Japan, the country they’ve been forced to move to, the country they hope will be the family’s saving grace, where they were supposed to start new and better lives, is in shambles because America dropped bombs of their own—one on Hiroshima unlike any other in history. And Hanako’s grandparents live in a small village just outside the ravaged city. The country is starving, the black markets run rampant, and countless orphans beg for food on the streets, but how can Hanako help them when there is not even enough food for her own brother? Hanako feels she could crack under the pressure, but just because something is broken doesn’t mean it can’t be fixed. Cracks can make room for gold, her grandfather explains when he tells her about the tradition of kintsukuroi—fixing broken objects with gold lacquer, making them stronger and more beautiful than ever. As she struggles to adjust to find her place in a new world, Hanako will find that the gold can come in many forms, and family may be hers.",
  "genres": [
    "Historical Fiction",
    "Middle Grade",
    "Fiction",
    "Historical",
    "Japan",
    "Young Adult",
    "Audiobook"
  ],
  "author": "Cynthia Kadohata",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/42201440-a-place-to-belong"
}