{
  "title": "Fantastic Fungi: How Mushrooms Can Heal, Shift Consciousness, and Save the Planet",
  "description": "Companion to the film Fantastic Fungi. Contributions from Michael Pollan, Andrew Weil, Eugenia Bone, and many more experts make Fantastic Fungi an awe-inspiring visual journey through the exotic, little-known realm of fungi and its amazing potential to positively influence our lives.An all-star team of professional and amateur mycologists, artists, foodies, ecologists, doctors, and explorers joined forces with time-lapse master Louie Schwartzberg to create Fantastic Fungi, the life-affirming, mind-bending film about mushrooms and their mysterious interwoven rootlike filaments called mycelium. What this team reveals will blow your mind and possibly save the planet. This visually compelling companion book of the same name, edited by preeminent mycologist Paul Stamets, will expand upon the film in every way through extended transcripts, new essays and interviews, and additional facts about the fantastic realm of fungi.Fantastic Fungi is at the forefront of a mycological revolution that is quickly going mainstream. In this book, learn about the incredible communication network of mycelium under our feet, which has the proven ability to restore the planet’s ecosystems, repair our health, and resurrect our symbiotic relationship with nature. Fantastic Fungi aspires to educate and inspire the reader in three critical areas: First, the text showcases research that reveals mushrooms as a viable alternative to Western pharmacology. Second, it explores studies pointing to mycelium as a solution to our gravest environmental challenges. And, finally, it details fungi’s marvelous proven ability to shift consciousness. Motivating both the visually stunning film and this follow-up book is an urgent mission to change human consciousness and restore our planet.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Science",
    "Biology",
    "Environment",
    "Health",
    "Psychology"
  ],
  "author": "Paul Stamets",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/42201782-fantastic-fungi"
}