{
  "title": "Dragon Soul",
  "description": "Dragon Soul the first book of the fantasy series Dragons in the Mist. The second book, Dragon rebirth is also on Amazon. Dragon Soul begins in a small village of the Palmir people. A quiet, productive and peaceful clan with an almost forgotten violent history. The Plague from the North—an attack of powerful, evil creatures—virtually annihilated them generations ago. They defeated the Plague, with the help of mystics and dragons - but at great cost. Dragons no longer survive as separate entities; their Souls must reside in the flesh of human hosts. To be a Dragon Host is at once a tremendous honor, and a life sentence. A sentence of many lifetimes, as the Dragon Host’s life span becomes longer than normal humans; they usually outlive their human families by many years. Dragon Hosts have magnified senses and abilities. To Host a dragon is to the see the world in entirely different ways - forever. Hosting of Dragon Souls is not the only special calling of the Palmir people. Some are called to be Healers, a blending of practical and mystical powers. A rare few are Prophets. One Prophet has a vision that takes shape in a physical form and warns the Palmir people of an ominous event. Was it a just a reminder of the hellish past, or a harbinger of things to come?What if the Plague returns? There are so few Dragon Souls. Could they defeat the monsters again? And what of real dragons? Will they ever again exist in their own form? From a peaceful and uncomplicated world, with only the little frustrations that human characters inflict on one another, events thrust the reader into epic battles between dragons and the creatures seeking to destroy human and dragon alike. Proceedings propel humans into the middle of dragon-sized events. The world of the people is so rich, yet simple and comfortable, it's heart-breaking to leave it for the battlefront. Nevertheless, the Palmir people, like the dragons, go willingly in defense of their families. And in these stories, the families of humans and dragons, are one.Dragon Soul, can be read on two levels, on one we take it deeper into human experience and the human/dragon bond. They fight for survival together and each must make sacrifices. The dragon isn't just a big, flying lizard -- it's a metaphor for larger-than-life desires we all have, and larger-than-life fears that go with them. In Dragon Soul, we see how these can meld to work together for the benefit of everyone.The other level is an epic about Thol, a goat herder at Vedicville. Thol never imagined he would start his day as a human and end up as a dragon. Who would? Granted, he lived in a village where Dragon Hosts are mentored , but there are usually indications that a person is Host to a Dragon Soul. The first indication for Thol, was when his hands began to elongate and turn into talons. At Thol's Scholla they taught that Dragon Souls are intelligent and giving. Not so, with his Dragon Soul—Rasdor—he is almost simple in his thoughts. Food, play and sleep are all that cross his mind, avaricious to please only himself... Unless he is dwelling on his wrath at his perceived ill treatment when he first Transformed, then he is full of a destructive rage verging on madness.Brief excerpt:Kuaric's mouth fills with an acrid tang. His human body stretches and elongates. Clothes dissolve into his skin. Claws, complete with talons, erupt from his hands and feet. His neck lengthens, with each vertical undulation becoming more serpentine. His head slightly flattens, becoming triangular in shape, silver maned, with flaming red eyes. Sharp black scales erupt to cover his entire body. A dorsal crest bursts through his back. A tail grows behind and he becomes a dragon of gargantuan size. Kuaric —now Maru his Dragon Soul— screams with the pain of Transformation. Soon the change is complete. Maru - a powerful, predominately black-bodied dragon with silver mane, ridges and wings stands where a moment before was a mortal man150,000 words",
  "genres": [
    "Dragons",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "B.J. Whittington",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/12356903-dragon-soul"
}