{
  "title": "Silver, Sword, and Stone: Three Crucibles in the Latin American Story",
  "description": "Winner, American Library Association Booklist’s Top of the List, 2019 Adult NonfictionLonglisted for the 2020 Andrew Carnegie Medals for ExcellenceAgainst the background of a thousand years of vivid history, acclaimed writer Marie Arana tells the timely and timeless stories of three contemporary Latin Americans whose lives represent three driving forces that have shaped the character of the region : exploitation (silver), violence (sword), and religion (stone).Leonor Gonzales lives in a tiny community perched 18,000 feet above sea level in the Andean cordillera of Peru, the highest human habitation on earth. Like her late husband, she works the gold mines much as the Indians were forced to do at the time of the Spanish Conquest. Illiteracy, malnutrition, and disease reign as they did five hundred years ago. And now, just as then, a miner’s survival depends on a vast global market whose fluctuations are controlled in faraway places.Carlos Buergos is a Cuban who fought in the civil war in Angola and now lives in a quiet community outside New Orleans. He was among hundreds of criminals Cuba expelled to the US in 1980. His story echoes the violence that has coursed through the Americas since before Columbus to the crushing savagery of the Spanish Conquest, and from 19th- and 20th-century wars and revolutions to the military crackdowns that convulse Latin America to this day.Xavier Albó is a Jesuit priest from Barcelona who emigrated to Bolivia, where he works among the indigenous people. He considers himself an Indian in head and heart and, for this, is well known in his adopted country. Although his aim is to learn rather than proselytize, he is an inheritor of a checkered past, where priests marched alongside conquistadors, converting the natives to Christianity, often forcibly, in the effort to win the New World. Ever since, the Catholic Church has played a central role in the political life of Latin America—sometimes for good, sometimes not.In Silver, Sword, and Stone Marie Arana seamlessly weaves these stories with the history of the past millennium to explain three enduring themes that have defined Latin America since pre-Columbian the foreign greed for its mineral riches, an ingrained propensity to violence, and the abiding power of religion. What emerges is a vibrant portrait of a people whose lives are increasingly intertwined with our own.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "World History",
    "Travel",
    "Audiobook",
    "Bolivia"
  ],
  "author": "Marie Arana",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/42201445-silver-sword-and-stone"
}