{
  "title": "Tyger Burning",
  "description": "WAR WILL COME. WILL EARTH BE READY? Humanity had just begun its first tentative steps towards conquering the Solar System when the aliens came and took it all away. Then they disappeared, leaving only wreckage in their wake. They have given us 100 years to get ready for the next phase of their invasion. They expect us to fight fair. But if one man can learn to control his combat implants, humanity might just have a hope for a free future…WAR WILL COMEMaung is used to being hunted. As the last “dream warrior,” a member of a Burmese military unit whose brains are more machine than grey matter, everyone wants him dead—punished for the multiple atrocities his unit committed during war.But when an alien race makes its presence known on Earth and threatens to annihilate mankind, it gives Maung a chance to escape. Maung travels to the farthest reaches of the Solar System, where he finds love—but also discovers his fellow Burmese countrymen exiled to labor on a prison asteroid and the horrors of a war long since finished.Maung uncovers a lost secret weapon system that may help his people redeem themselves—and may just prove the salvation of the human race.WILL EARTH BE READY?About Tyger “Fans of space opera will enjoy this first book of what promises to be an epic series, as Maung battles human enemies on Earth and alien invaders from the stars.”—Arlan AndrewsAbout T.C. \"McCarthy perfectly catches the attitudes of veterans among themselves and toward civilians—laymen, better—when they get back to the World.\"—David Drake''Compelling . . . Recalling the work of Remarque, Willi Heinrich, and especially Michael Herr, McCarthy's delirious narrative avoids cliche and raises intriguing questions about what it means to be human.''— Publishers Weekly (starred review) on Germline\"It's not just good . . .it's the mil-sf book I wish I could send back in time to beat out Forever War for a Hugo. I never would have guessed McCarthy was an analyst . . . I was sure he'd been on the pointy end for a long time.\"—Ernest Lilley, SF Revu''The highly detailed, brutal depiction of futuristic warfare brilliantly complements the intimate narrative, which examines the insanity of war and those personally affected by it. Breathtaking and heartrending, this is the future of military science fiction.''— Publishers Weekly (starred review)\"A well written novel that makes you consider the costs of war in very personal terms.\"— SF Signal",
  "genres": [
    "Science Fiction"
  ],
  "author": "T.C. McCarthy",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/42201620-tyger-burning"
}