{
  "title": "The Sailor Who Washed Ashore",
  "description": "It's June of 1947 and the Spanish moss is twirling in the sea breeze beneath the limbs of a massive live oak somewhere in Daytona Beach, the World's Most Famous... And Tom Jarrell is having a hard time coping with each day. He's recently been made a widower, having lost his wife and daughter (Sarah and Missy) in an accident out on the DeLand Highway back in April. Fortunately, his good friend, Ronnie Grisham, is keeping an eye on his ole pal, making sure he eats and deposits the insurance checks in the bank when they come in. And, thanks to Sarah's foresight, two or three have shown up in the mail. Finally, Tom manages to get himself together and takes the train north to visit his grieving in-laws and check into a sanitarium in Wisconsin to get help with his profound sense of loss and the fact that he's turned to drink to help numb the pain. Six weeks later, Tom is back. He feels like a new man. And, on the advice of his friend, Ronnie, he decides to open up an office on Beach Street in downtown Daytona and put out his shingle as a lawyer. One day, as Tom is dictating another letter to Allied Southern Insurance up in Nashville, Howie Kirkpatrick walks in the door. The kid, who is probably 21, if that, looks like he's been through the ringer. He's sunburned, needs a shave, and has a problem he hopes Tom Jarrell can help him with. He's not sure, but he thinks he just might have killed his best friend, Skipper Johnson, out in the middle of the Atlantic Ocean. Howie's arrival is like a pebble that starts an avalanche. Dark secrets in sunny Daytona Beach are about to be revealed and who knows what might happen when they are. * * * Where Perry Mason meets Flamingo Road with a gay twist! Set in the sultry south and by the beach, the Daytona Beach series of novels are about Tom Jarrell, an attorney who's just starting his own private practice, and Ronnie Grisham, Tom's private eye, long-term friend, and new-found lover. These stories begin with Tom and Ronnie finding each other after a devastating loss and continue as the two men bring together a kind of family that neither of them could have ever imagined having. Come take a stroll along the World's Most Famous Beach right after the Second World War. Truman is president, the men are home from Europe and the Pacific, and the Red Scare is just getting started. It's a time and a place that no longer exists. Take a dive in and see if you might wanna stay for a while.",
  "genres": [
    "Historical",
    "Mystery",
    "M M Romance",
    "Historical Fiction",
    "Gay",
    "Crime",
    "LGBT"
  ],
  "author": "Frank W. Butterfield",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/42221044-the-sailor-who-washed-ashore"
}