{
  "title": "A Holiday Promise",
  "description": "In Mistletoe by Tammy L. Bailey Incredible circumstances leads Grace Evans to Mistletoe, Washington where she finds herself at the mercy of the town's number one bachelor, Ayden McCabe. While Grace needs help finding her sister, Ayden is looking for a fake girlfriend for the holidays. When they strike up a deal to help each other out, the last thing they expect is to fall in love. The Christmas Tree Wars by Robin WeaverIn the town's Christmas Tree Contest, Suzette wants to beat high-profile socialite, Katarina Snodgrass. Spence James has returned to Merryvale, and she'll need his help to win. As they work together, their attraction begins to sizzle. But Suzette's promise of a tinsel bright holiday turns to coal when Spence's NYC girlfriend arrives unannounced. Suzette is determined to ignore her broken heart and beat Katarina. Even if it means collaborating with a man who now seems more like Santa's nemesis than a Christmas angel.A Kiss Under the Christmas Lights by Peggy JaegerGia San Valentino longs for a husband and bambini she can love and spoil. At her parish's Christmas Festival she meets a guy who has all her requirements for perfect-man status: tall, sweet, good looking, and from a big Italian family. A miscommunication has her believing he's the new parish priest, though, and her happily-ever-after hopes evaporate because he's the proverbial forbidden fruit. Or is he?Christmas in Kissinger by Misty SimonABSOLUTELY NO RETURNS OR EXCHANGES when going home to Kissinger for a wedding. But Jocelyn Moreland has no idea Sam Locke will turn her life upside down.Logan West has DESIGNS ON A DAME and her name is Adele. When she catches the bouquet and he the garter, he discovers a holiday wedding is the perfect place for a first date. And Mason Nottingham may have messed up his life. But MAYBE THIS TIME, he'll get his Christmas wish and show Paige he's ready to make amends.Christmas at the Rekindle Inn by Lori WatersSeven days in December at a lovely Vermont inn sounds like the perfect Christmas present to Mary until she finds out her soon to be ex husband will be there too. The Rekindle Inn is the last place JT wants to spend his Christmas vacation but a battle of wills has him on a plane to Santaville faster than the time it takes to unwrap a candy cane. Breakfast with Santa by Carol HenryMark Logan-aka Santa—can't keep his eyes off Katelyn Sullivan in her sexy elf outfit, which brings back feelings better left hidden. After all, he only returned to Lobster Cove to keep his two-year-old son safe from kidnappers, not to rekindle an old romance. Katelyn Sullivan, conflicted with her renewed feelings for Mark, flies to Norway to reaffirm her feelings for her fiancé. But will uncovered secrets be the key to their happiness, or their heartache?",
  "genres": [],
  "author": "Peggy Jaeger",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42256514-a-holiday-promise"
}