{
  "title": "Bathhouse Confessions",
  "description": "Welcome to the bathhouse, a place where your wildest fantasies can come true. Leave your hang-ups and inhibitions at the door because this is a place where anything goes.  Themes include: college hunks, daddies, bears, twinks, older/younger, group sex, ménage, double penetration, prostate massage, hands-free orgasm, sex toys, medical speculum play, BDSM, restraint, spanking, domination/submission, and so much more! This sizzling collection features three gay romance short stories. Each entry is approximately 40 pages of heat; just the right length for an exciting bedtime story.   BOOK 1: BEAR HUNTING  Meet Ty, a cocky young fitness guru on the prowl on a balmy summer night. Ty is handsome, talented, and fearless, but he's about to meet his match.  There's a mysterious new man in the bathhouse, known simply as Bear. Other guys have been sharing stories about him, saying he has \"magic powers\" that enable him to take his partners to pleasurable heights they've never experienced before.  Ty is determined to hook up with Bear, but he will soon learn the beefy stranger with smoldering eyes is not that easy to win over. Ty will have to prove himself worthy and surrender to Bear's domination if he wants to take a ride to paradise.  Is Ty up for the challenge?   BOOK 2: SENSORY DEPRIVATION  Meet Trevor, a gay college student with a daring secret wish. Ever since he saw an adult film about a man's twenty load weekend, he's been curious about having a similar experience with a group. Now he's finally worked up the courage to pursue it at the bathhouse.  To add to the intensity, he's going to do it with his wrists bound behind his back, a blindfold wrapped around his head, and earbuds playing an EDM mix so he can't hear anything. Relying only on his sense of touch, taste, and smell, he'll be at the mercy of anything random strangers want to do to him.  How much stimulation can Trevor endure before he reaches his limit? And what happens when you relinquish all control in the bathhouse?   BOOK 3: PROSTATE POUNDER  Meet Adam, a closeted gay college student who's about to experience a bathhouse for the first time. Adam has so many secret desires he's kept under lock and key. Tonight is the night he plans to let go of fear and set his heart free.  Elsewhere in the city, there's a man who goes by the nickname Prostate Pounder. His talent is self-explanatory. His conquests are legendary. It's been said that he can make any man experience the greatest climax of their life completely hands-free.  A case of mistaken identity is about to bring Adam and the Prostate Pounder crashing into each other's worlds. Then a tantalizing opportunity will present itself.  What will happen when Adam breaks all the rules and does something truly ruthless?",
  "genres": [
    "M M Romance",
    "Erotica",
    "Anthologies",
    "Romance",
    "Contemporary",
    "Gay",
    "LGBT"
  ],
  "author": "Nathan Bay",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/42248407-bathhouse-confessions"
}