{
  "title": "It Sucked and Then I Cried: How I Had a Baby, a Breakdown, and a Much Needed Margarita",
  "description": "An irreverent and captivating memoir about the unexpected joys and glaring indignities of pregnancy, childbirth, and parenthood - from the beloved creator of the most popular personal blog on the web, dooce.comHeather Armstrong gave up a lot of things when she and her husband, Jon, decided to have a baby: beer, small boobs, free time -- and antidepressants. The eighteen months that followed were filled with anxiety, constipation, nacho cheese Doritos, and an unconditional love that threatened to make her heart explode. Still, as baby Leta grew and her husband, Jon, returned to work, Heather faced lonely days, sleepless nights, and endless screaming that sometimes made her wish she'd never become a mother. Just as she was poised to throw another gallon of milk at her husband's head, she committed herself for a short stay in a mental hospital -- the best decision she ever made for her family.To the dedicated millions who can't get enough of Heather's unforgettably unique style and hilarious stories on her hugely popular blog, there's little she won't share about her daily life as a recovering Mormon, liberal daughter of Republicans, wife of a charming geek, lover of television that exceeds at being really awful, and stay-at-home mom to five-year-old Leta and two willful dogs.In It Sucked and Then I Cried, Heather tells, with trademark wit, the heartfelt, unrelentingly honest story of her battle with postpartum depression and all the other minor details of pregnancy and motherhood that no one cares to mention. Like how boring it can be to care for someone whose primary means of communication is through her bowels. And how long it can possibly take to reconvene the procedure that got you into this whole parenthood mess in the first place. And how you sometimes think you can't possibly go five more minutes without breathing in that utterly irresistible and totally redeemable fresh baby smell.It Sucked and Then I Cried is a brave cautionary tale about crossing over that invisible line to the other side (the parenting side), where everything changes and it only gets worse. But most of all, it's a celebration of a love so big it can break your heart into a million pieces.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Parenting",
    "Humor",
    "Biography Memoir",
    "Biography",
    "Adult"
  ],
  "author": "Heather B. Armstrong",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/4222360-it-sucked-and-then-i-cried"
}