{
  "title": "Lawfully Dashing",
  "description": "TAKING LOVE AND LAW SERIOUSLY...  Police Officer Brooke Patterson is dedicated to her calling to help others, despite having to deal with the difficulties of being female in a male-dominated profession. To help her de-stress from her job, Brooke's friends talk her into taking a vacation the weekend before Christmas. The trio head to Clear Mountain Resort to ski, spend time at the spa, and relax. When they arrive and their suite isn't ready, the front desk clerk suggests they go on a sleigh ride-a new feature of the resort. Little does Brooke know, the last-minute activity will change her life forever.  After a difficult tragedy, Liam Davis left his life in New York City three years ago. He ventured out west to find a new life in a new place, settling in Clear Mountain to start a horse-drawn sleigh company. He enjoys his remote home and job. The simplicity of taking guests on tours of Clear Mountain Resort is the only human contact Liam needs-that is until Brooke Patterson stumbles into his life.  When a blizzard hits and everyone is trapped in the lobby of the resort, Brooke and Liam get to know each other. Their growing friendship is interrupted though when someone steals items from one of the guest's rooms. Brooke is asked by the resort manager to discreetly figure out who did it before everyone finds out and it causes panic that a thief is hiding amongst them.  Through the investigation, the aftermath, and the Christmas holidays, Liam stays by Brooke's side, proving to her not all men find a female officer intimidating. Some men find her appealing.  Can Liam help Brooke to trust again? Can Brooke heal Liam's broken heart? Find out in this epic Christmas romance filled with a mystery, faith, and laughs.  The Lawkeepers is a multi-author series alternating between historical westerns and contemporary westerns featuring law enforcement heroes that span multiple agencies and generations. Join international bestselling authors Jenna Brandt, Lorana Hoopes and many others as they weave captivating, sweet and inspirational stories of romance and suspense between the lawkeepers -- and the women who love them.  The Lawkeepers is a world like no other; a world where lawkeepers and heroes are honored with unforgettable stories, characters, and love.  ** Note: Each book in The Lawkeepers series is a standalone book, a mini-series of sorts, and you can read them in any order.",
  "genres": [
    "Christmas",
    "Romance",
    "Contemporary",
    "Christian Romance"
  ],
  "author": "Jenna Brandt",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/42278873-lawfully-dashing"
}