{
  "title": "The Sexual History of London: From Roman Londinium to the Swinging City—Lust, Vice, and Desire Across the Ages",
  "description": "If Paris is the city of love, then London is the city of lust. From the bath houses of Roman Londinium to the sexual underground of the twentieth century and beyond, this is an entertaining, vibrant chronicle of London and sex through the ages.\n\n\nFor more than a thousand years, England’s capital has been associated with desire, avarice, and the sins of the flesh. Richard of Devises, a monk writing in 1180, warned that “every quarter abounds in great obscenities.” As early as the second century AD, London was notorious for its raucous festivities and disorderly houses, and throughout the centuries the bawdy side of life has taken easy root and flourished. \nIn this book, award-winning popular historian Catharine Arnold turns her gaze to London’s relationship with vice through the ages. London has always traded in the currency of sex. Whether pornographic publishers on Fleet Street, or courtesans parading in Haymarket, its streets have long been witness to colorful sexual behavior. In an accessible, entertaining style, Arnold takes us on a journey through the fleshpots of London from earliest times to present day. Here are buxom strumpets, louche aristocrats, popinjay politicians, and Victorian flagellants—all vying for their place in London’s league of licentiousness. \n            From sexual exuberance to moral panic, the city has seen the pendulum swing from Puritanism to hedonism and back again. With latter chapters looking at Victorian London and the sexual underground of the twentieth century and beyond, this is a fascinating and vibrant chronicle of London at its most raw and ribald.",
  "genres": [
    "History",
    "Nonfiction",
    "Sexuality",
    "Historical",
    "British Literature",
    "Research",
    "Sociology"
  ],
  "author": "Catharine Arnold",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/12358286-the-sexual-history-of-london"
}