{
  "title": "Elysian Fields",
  "description": "Revelation 6:8“And I looked, and behold a pale horse: and his name that sat on him was Death, and Hell followed with him. What if you awakened tomorrow and the world as you knew it had changed?The event happened worldwide on October 31 at 5:55 A.M. People got out of bed to find their loved ones or neighbors had fallen in the middle of their morning routines, or never made it out of bed at all. As the body count began to reach staggering numbers the world stood still. It was at the precipice of the growing panic that the world began to come apart. There were no answers. Was it a disease? Was this actually the end as it was written in the bible? No one knew, but one thing was for sure: It had only just begun.Frank Pearson had seen the worst the world could offer, and had become a monster to survive it. He had served two tours as a ranger, and two as a delta operator. Yet the ghosts had a habit of following you. No matter how far you ran. They always caught up to you. So when Frank had finally had enough he had shuffled out and came back home. Jacobs Ladder, Texas had always been that to him. It was the small town affair that he liked. It was small enough that when his mom had told her neighbor that her son was coming home, the chief was waiting on him. Harry had held out that gold star and never asked for and answer. Frank had been serving and protecting ever since.Felix Cherry had been all about affliction. He had only been a child when he lost the use of his legs to a rare auto-immune disease. He had devoted his life to solving riddles of the universe, and providing the answers that came with them. It had only been a matter of time until he climbed the ladder of leadership at the Center for Disease Control. When the event happened, the powers that be handed him the reins and ran for cover. Felix had always been for adapt and overcome. Yet he wasn’t entirely sure there was an answer to this particular riddle.The world was driven for answers. The social media outlets and internet was a buzz with pictures and stories of people who had lost loved ones. So many likes and comments poured in as the day rolled on. Yet there were no answers. The governments of the world had parlayed their differences to find the culprit, but no blame could be found. There was no answer why. The sun slowly set on that fateful Sunday and that was when the true horror really began.Elysian Fields is a different take on the Zombie apocalypse. This is the story of those that experienced it, and those that came to their aid.",
  "genres": [],
  "author": "J.L. Perrigo",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/42279595-elysian-fields"
}