{
  "title": "The Nickel Boys",
  "description": "Author of The Underground Railroad, Colson Whitehead brilliantly dramatizes another strand of American history through the story of two boys sentenced to a hellish reform school in 1960s Florida.Elwood Curtis has taken the words of Dr Martin Luther King to heart: he is as good as anyone. Abandoned by his parents, brought up by his loving, strict and clear-sighted grandmother, Elwood is about to enroll in the local black college. But given the time and the place, one innocent mistake is enough to destroy his future, and so Elwood arrives at The Nickel Academy, which claims to provide 'physical, intellectual and moral training' which will equip its inmates to become 'honorable and honest men'.In reality, the Nickel Academy is a chamber of horrors, where physical, emotional and sexual abuse is rife, where corrupt officials and tradesmen do a brisk trade in supplies intended for the school, and where any boy who resists is likely to disappear 'out back'. Stunned to find himself in this vicious environment, Elwood tries to hold on to Dr King's ringing assertion, 'Throw us in jail, and we will still love you.' But Elwood's fellow inmate and new friend Turner thinks Elwood is naive and worse; the world is crooked, and the only way to survive is to emulate the cruelty and cynicism of their oppressors.The tension between Elwood's idealism and Turner's skepticism leads to a decision which will have decades-long repercussions.Based on the history of a real reform school in Florida that operated for one hundred and eleven years and warped and destroyed the lives of thousands of children, The Nickel Boys is a devastating, driven narrative by a great American novelist whose work is essential to understanding the current reality of the United States.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Audiobook",
    "Historical",
    "Race",
    "Literary Fiction"
  ],
  "author": "Colson Whitehead",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/42270835-the-nickel-boys"
}