{
  "title": "Rough Rich and Ripped Boxset",
  "description": "Fall in love with these four hard to tame billionaires. Rough Ripped and Rich is a collection of smoking bad boy billionaires. These alphas are incredibly possessive, protective, and willing to do whatever it takes for the woman they love. They will have you begging for more all night long.  Book One: Billionaire Takes All  My father is dying. Now it's a competition between me and my a$$hole brother for the entire King Family fortune. Five. Billion. F*#king dollars. Whoever knocks a girl up first wins everything. That's right. If I want my money, I've got to get a girl pregnant. Lock up your wives, girlfriends, and daughters... The King brothers are coming back to sleepy Caldwell Hope All hell’s about to break loose.  Book Two: Bigger and Badder  I'm a megastar athlete turned ruthless billionaire CEO The media calls me the Grim Reaper of Wall Street. Bigger and Badder than my competition. Investing in Caldwell Hope's football stadium is a bad deal. The only reason I care at all is Judy- she's the one that got away. She has three dates to convince me to save her town from bankruptcy. If I make her mine that means going in on an investment that's doomed to fail. And I never, ever fail. Will she be the first person to make me?  Book Three: Billion Dollar Urge  I've broken every rule except the three I live by- Never kiss on the mouth. Never spend the night. And NEVER... If Nicole's not careful it won't just be those rules, and her bed I break. I'll break her heart too. She was only supposed to be was a hook up. Now to keep her I'll have to risk my family's billion dollar company and a prison sentence. The game is spinning out of control.  Book Four: It's Only Acting  Imagine me naked. Practice makes perfect. It's only acting... Whenever my best friend Olivia got nervous before a play that's what I'd tell her. Growing up I'd lost my family and she was the only one who saved me. Six months to turn eighteen and we had it all figured out. Until, with one sentence, her celebrity a$$hole father ruined everything Six years later I'm one of the most powerful men in the world. And she's the one who needs saving. She can hate me all she wants but we both know... It's only acting.",
  "genres": [],
  "author": "Jackson Kane",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/42278049-rough-rich-and-ripped-boxset"
}