{
  "title": "City of Flickering Light",
  "description": "Juliette Fay—“one of the best authors of women’s fiction” (Library Journal)—transports us back to the Golden Age of Hollywood and the raucous Roaring Twenties, as three friends struggle to earn their places among the stars of the silent screen—perfect for fans of La La Land and Rules of Civility. It’s July 1921, “flickers” are all the rage, and Irene Van Beck has just declared her own independence by jumping off a moving train to escape her fate in a traveling burlesque show. When her friends, fellow dancer Millie Martin and comedian Henry Weiss, leap after her, the trio finds their way to the bright lights of Hollywood with hopes of making it big in the burgeoning silent film industry. At first glance, Hollywood in the 1920s is like no other place on earth—iridescent, scandalous, and utterly exhilarating—and the three friends yearn for a life they could only have dreamed of before. But despite the glamour and seduction of Tinseltown, success doesn’t come easy, and nothing can prepare Irene, Millie, and Henry for the poverty, temptation, and heartbreak that lie ahead. With their ambitions challenged by both the men above them and the prejudice surrounding them, their friendship is the only constant through desperate times, as each struggles to find their true calling in an uncertain world. What begins as a quest for fame and fortune soon becomes a collective search for love, acceptance, and fulfillment as they navigate the backlots and stage sets where the illusions of the silver screen are brought to life. With her “trademark wit and grace” (Randy Susan Meyers, author of The Murderer’s Daughters), Juliette Fay crafts another radiant and fascinating historical novel as thrilling as the bygone era of Hollywood itself.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Chick Lit",
    "Adult Fiction",
    "20th Century"
  ],
  "author": "Juliette Fay",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/42273438-city-of-flickering-light"
}