{
  "title": "One Flew Through the Dragon Heart",
  "description": "A Chinese Legend. \n\n\nA British Secret. \n\n\nStar-Crossed Lovers with Incompatible Magic. \n\n\n\n\nBrixton Flew works as a professor of wielder instruction at Rembrandt Academy, hoping to erase the regrets of his youth along with the resulting debt. But when he comes face to face with his biggest regret—the woman who broke his heart, Adelaide Favan—Brixton soon realizes his troubles have only begun.Unable to control her magic, Adelaide knew leaving Brixton was the only way to protect him when they were younger. Now she discovers he is the key to recovering the Dragon Eyes, a legendary treasure connected to her magic and her family's disgraced legacy—and she knows the risk is great, to both his life and her heart.With others seeking the power of the Dragon Eyes, Brixton and Adelaide must outwit their foes and face down their families to save London from an ancient legend that sleeps beneath the magic portal in their city.But the renewed passion growing between them may prove to be the greater peril ...\nOne Flew Through the Dragon Heart is the first book in a new steampunk series by C.S. Johnson, blending together history, romance, mecha-dragons and magic against the glittering backdrop of 1880’s Victorian London.\n\n\n\n\n\n\n\n\nFROM THE BOOK: \n\n\n\n\n\n\nIt seemed impossible that Brixton could both remember and forget everything about their first kiss as her lips parted under his once more.  \n\nThe same heightened desperation called to him as her softness melted effortlessly against the tautness of his body. He tasted the same soft, malty sweetness of her mouth, feeling the fullness of her lips as they flowered beneath his. Her body curved into his, her fingers gripping his knuckles. He heard her same, muted sigh of pleasure as their joined hands collapsed between them, and he felt the same heady rush as they collided into each other.\n\nBut this time was different, too. He resisted the urge to run his hands down her body, to gather her against him. Before, he had been too intoxicated by the taste of her to wonder if she could handle the full extent of his passion; this time, he was overwhelmed, but he was all too aware of what it was like to lose her.\n\nThe equal power of their magic diminished as he began to be consumed. It could have been years or seconds since their last meeting; he had wanted her then, and he only wanted her more now.\n\nThe engines behind them sparked; the ship began to sink. Brixton felt his own destruction become increasingly inevitable before she reluctantly tore herself away from him.\n\nHis voice was a husky whisper as he stared into the silver seas of Adelaide’s gaze. “I’ve missed you.” \n  \nWHAT READERS ARE SAYING: \n\n\"I've certainly loved every minute of this story, and I can't wait for the next book in this series!\" ~ Pris, Goodreads Reviewer\"An interesting and enjoyable historical, steam-punk story full of magic, dragons, legends, history, friendship, family, loyalty and love.\" ~ Zany Bibliophile Book Blog Review",
  "genres": [
    "Fantasy",
    "Romance",
    "Steampunk",
    "Fiction"
  ],
  "author": "C.S.  Johnson",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/42287931-one-flew-through-the-dragon-heart"
}