{
  "title": "Bury the Bodies",
  "description": "A missing son, a web of lies, a murder covered up.Detective Inspector Solomon Gray is getting closer to finding his son, missing now for over a decade. He’s on the trail of a bent cop, Lewis Strang, who appears connected to the disappearance, all those years ago. But Strang is untouchable, a star of the Metropolitan police force. Once more, Gray must blur the line between right and wrong.When the body of a young black man turns up on a Margate back street it seems to be yet another drug related crime. Margate is currently the focus of a special operation, codenamed Pivot, to take down local suppliers. But Gray discovers there’s more to the case than initially meets the eye.And Gray has his own problems to deal with. First there’s the public investigation into the death of Gray’s ex-boss, DCI Jeff Carslake and then Gray’s estranged daughter, Hope, turns up on his doorstep – she’s pregnant and left the child’s father.As Gray investigates he discovers the truth about Tom and who took him. A truth that is even more shocking than Gray ever expected…Set in the once grand town of Margate in the south of England, the now broken and depressed seaside resort becomes its own character in this dark detective thriller, perfect for fans of Ian Rankin, Stuart MacBride, and Peter James.Bury The Bodies is the fourth book in the series featuring Detective Inspector Solomon Gray. Buy it now to discover if, in this, the final chapter, Gray will finally find out what happened to his long missing son.What Others Say\"Nixon combines his trademark gritty humour with a flawless police procedural.\"M.W. Craven, author of the Washington Poe series\"A compelling murder mystery with a multilayered and engaging new hero. Great read.\"Mason Cross, author of the Carter Blake thriller series\"A dark, uncompromising tale of loss, murder, and revenge. Glorious noir, which takes the police procedural elements and gives them new life. I can't wait to read the next step in Solomon Gray's journey for answers ...\"Luca Veste, author of the Murphy and Rossi crime series\"Be prepared for everything to resolve in dramatic fashion.\"Crime Fiction LoverWhat Readers Say\"I follow a lot of Detective series but this is by far one of the best.\"\"You’ve no idea how glad I am to be back in Gray’s world!\"\"The author has such an amazing talent for telling tales.\"\"Hard to put down and gripping to the very end.\"\"There has to be another installment soon!\"\"Wow, this series just gets better.\"\"Another strong instalment in a thoroughly enjoyable series.\"\"A fantastic read with brilliant characters.\"\"A very entertaining and well executed thriller. \"\"... deeply emotional, a dark rollercoaster ride.\"Ed James, author of bestselling DI Fenchurch series\"A damaged detective, haunted by a tragic past, a young son missing or dead, a man on a quest for redemption. Detective Sergeant Solomon Gray is a fine creation and Dig Two Graves an intriguing, nourish mystery. Keith Nixon is a sparkling crime fiction talent.\"Howard Linskey, author of the Detective Ian Bradshaw crime series",
  "genres": [
    "Crime",
    "Mystery",
    "Detective"
  ],
  "author": "Keith Nixon",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/42286054-bury-the-bodies"
}