{
  "title": "The Coming of the King",
  "description": "The Coming of the King takes us into the world of Merlin, into the bright daylight and the deep shadows of Britain in what we call the Dark Ages. It is a world of warriors in love with slaughter and death, and also of poets and druids, a world of savage cruelty but also of intense natural beauty, of laughter and proud boasting, but also of magic and mysticism.King Arthur sleeps with his warriors, and the invaders he defeated still hold much of the country. But now the kings of Britain have ceased warring with each other and are assembling their forces for the last great battle that will sweep the heathen back into the sea and make Britain free and mighty again. Ahead of their great host goes Merlin, at once child, and man, poet and demi-god, travelling alone to read the runes of the heavens and the oceans and the most intimate places of the earth. For as the warriors march towards their fate it becomes clear that this will be no ordinary battle, but one that will be fought among the elements and between supernatural forces, and that must be won and lost over and over again until the end of time.Nikolai Tolstoy's visionary epic is an extraordinary imaginative tour de force. Through it we enter the minds of our Dark Age forefathers, seeing the world with a perception that is different from, and perhaps profounder than, our own. The Coming of the King has all the narrative excitement of the old tales but under its brilliant surface lie layers of meaning that will stir ancestral memories in all of us. The most powerful evocation of the Arthurian world written in modern times, it will be read, debated and discussed for many years to come.Cover illustration: Kevin Tweddell",
  "genres": [
    "Fantasy",
    "Arthurian",
    "Fiction",
    "Historical Fiction",
    "Mythology",
    "Historical",
    "Classics"
  ],
  "author": "Nikolai Tolstoy",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/4228262-the-coming-of-the-king"
}