{
  "title": "The Devil's Banker",
  "description": "Hailed as “the John Grisham of Wall Street” by the New York Times , Christopher Reich returns to the world he knows so well--the dangerous, dazzling world of high finance and international intrigue. In this ingeniously crafted thriller, the bestselling author of Numbered Account and The First Billion introduces his most complex and engaging hero yet: forensic accountant Adam Chapel--and paints a frightening scenario where terrorism is big business and money is the ultimate weapon of war…The explosion that shatters the smart Parisian apartment reverberates around the globe. In an instant, a suspected terrorist is dead and half a million dollars has vanished. Within days, the CIA is certain it has found a connection between the dead man and a planned terrorist attack on U.S. soil. Determined to avert another 9/11, they have assembled an elite counterterrorist task force, code name: Blood Money. Its mission: to follow the money trail. Its secret weapon: forensic accountant Adam Chapel. A man who trusts numbers more than people, Chapel has his own reasons for wanting to get the job done-- four of his colleagues were killed in the Paris blast. Now Chapel is thrust back into the line of fire when he teams up with British intelligence agent Sarah Churchill. The two are assigned to hunt down a shadowy mastermind who is moving vast sums of money from country to country, from bank to bank, leaving no tracks--as he prepares for an Armaggedon of his own devising.As Chapel follows a disappearing money trail from Paris to Munich to the deserts of Saudi Arabia, Sarah uses her elite training to stalk the “shadow” and his elusive network. Meanwhile, their quarry is auditing their every move, laying a twisting trail of false clues and shocking surprises. With the clock ticking down, soon Chapel and Sarah have only days, hours, minutes to avert disaster as a master terrorist plots to unleash the first strike in a brilliantly orchestrated conspiracy--with an almost unimaginable goal.Hurtling us from the winding alleys of Pakistan to the elite banking houses of Europe, The Devil’s Banker creates an adrenaline-fueled world where following the money has never been more dangerous, and evil has never been harder to unmask.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Espionage",
    "Suspense",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Christopher Reich",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/422831.The_Devil_s_Banker"
}