{
  "title": "Unexpected President",
  "description": "When President James Garfield was shot in 1881, nobody expected Vice President Chester A. Arthur to become a strong and effective president, a courageous anti-corruption reformer, and an early civil rights advocate.Despite his promising start as a young man, by his early fifties Chester A. Arthur was known as the crooked crony of New York machine boss Roscoe Conkling. For years Arthur had been perceived as unfit to govern, not only by critics and the vast majority of his fellow citizens but by his own conscience. As President James A. Garfield struggled for his life, Arthur knew better than his detractors that he failed to meet the high standard a president must uphold.And yet, from the moment President Arthur took office, he proved to be not just honest but brave, going up against the very forces that had controlled him for decades. He surprised everyone -- and gained many enemies -- when he swept house and took on corruption, civil rights for blacks, and issues of land for Native Americans.A mysterious young woman deserves much of the credit for Arthur's remarkable transformation. Julia Sand, a bedridden New Yorker, wrote Arthur nearly two dozen letters urging him to put country over party, to find \"the spark of true nobility\" that lay within him. At a time when women were barred from political life, Sand's letters inspired Arthur to transcend his checkered past--and changed the course of American history.This beautifully written biography tells the dramatic, untold story of a virtually forgotten American president. It is the tale of a machine politician and man-about-town in Gilded Age New York who stumbled into the highest office in the land, only to rediscover his better self when his nation needed him.",
  "genres": [
    "History",
    "Biography",
    "Presidents",
    "Nonfiction",
    "American History",
    "Politics",
    "Us Presidents"
  ],
  "author": "Scott S. Greenberger",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/42283202-unexpected-president"
}