{
  "title": "Heir of Ra",
  "description": "Alyssa signed up to study history, not to rewrite it.  An excavation of the fabled Hall of Records beneath the Sphinx unleashes an ancient disease that leaves her father fighting for his life. As Alyssa races to find a cure, she stumbles onto an impossible artifact that could change history—or destroy our future.  With unexpected help from Oxford student Paul Matthews, Alyssa evades ruthless adversaries set on harnessing the power of the artifact. As a global epidemic looms, they must unravel deep secrets hidden within it and unveil the link between a mythical civilization and the birth of Egyptian mythology, before time runs out.  Compulsively readable, M. Sasinowski’s electrifying debut thriller, Heir of Ra, is filled with action, technology, humor, and a generous dose of “what if” that just might have you question your history books.  What Early Readers are Saying:   “I loved this book! It was everything I want when I read. Adventure, action, mystery. I felt as though I could actually “see” the movie in my mind’s eye as I was reading the book.”  “This story is the embodiment of creativity. This book loops together many broken pieces within the world’s history and formulates a new world all on its own. When you read this book, you will not be disappointed, the danger and mystery will keep you on edge.”  “I absolutely loved Heir of Ra. Action, adventure, thriller, mystery — you name it. It has all the things! It would certainly make for an epic \"The Mummy\" style movie, too. Five stars!”  “…cross between Kane Chronicles and the Da Vinci Code.”  “Could not stop reading this book!”  \"Wonderful historical fiction - suspenseful and intriguing, filled with complex yet relatable characters and incredible imagery. \"  “Heir of Ra is an amazing adventurous story, especially for lovers of Egyptian history. But this book is a great choice for any reader that wants a read that will leave them falling out of their chair with surprise throughout the endless number of twists-and-turns. Action, guns for the guys and even some romance for the girls. A great read for all who are looking to spend their entire day reading because they cannot put it down!”  “A book that rivals Lightning Thief because it has realistic characters with a fantastic plot. I couldn't put it down.”",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Mythology",
    "Science Fiction",
    "Historical Fiction",
    "Thriller",
    "Adventure"
  ],
  "author": "M. Sasinowski",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/42292328-heir-of-ra"
}