{
  "title": "The Whole Okra: A Seed to Stem Celebration",
  "description": "With recipes for gumbos and stews, plus okra pickles, tofu, marshmallow, paper, and more.Chris Smith’s first encounter with okra was of the worst kind: slimy fried okra at a greasy-spoon diner. Despite that dismal introduction, Smith developed a fascination with okra, and as he researched the plant and began to experiment with it in his own kitchen, he discovered an amazing range of delicious ways to cook and eat it, along with ingenious and surprising ways to process the plant from tip-to-tail: pods, leaves, flowers, seeds, and stalks. Smith talked okra with chefs, food historians, university researchers, farmers, homesteaders, and gardeners. The summation of his experimentation and research comes together in The Whole Okra, a lighthearted but information-rich collection of okra history, lore, recipes, craft projects, growing advice, and more.The Whole Okra includes classic recipes such as fried okra pods as well as unexpected delights including okra seed pancakes and okra flower vodka. Some of the South’s best-known chefs shared okra recipes with Smith: Okra Soup by culinary historian Michael Twitty, Limpin’ Susan by chef BJ Dennis, Bhindi Masala by chef Meherwan Irani, and Okra Fries by chef Vivian Howard.Okra has practical uses beyond the edible, and Smith also researched the history of okra as a fiber crop for making paper and the uses of okra mucilage (slime) as a preservative, a hydrating face mask, and a primary ingredient in herbalist Katrina Blair’s recipe for Okra Marshmallow Delight.The Whole Okra is foremost a foodie’s book, but Smith also provides practical tips and techniques for home and market gardeners. He gives directions for saving seed for replanting, for a breeding project, or for a stockpile of seed for making okra oil, okra flour, okra tempeh, and more. Smith has grown over 75 varieties of okra, and he describes the nuanced differences in flavor, texture, and color; the best-tasting varieties; and his personal favorites. Smith’s wry humor and seed-to-stem enthusiasm for his subject infuse every chapter with just the right mix of fabulous recipes and culinary tips, unique projects, and fun facts about this vagabond vegetable with enormous potential.",
  "genres": [
    "Food",
    "Cookbooks",
    "Gardening",
    "Cooking"
  ],
  "author": "Chris         Smith",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/42354036-the-whole-okra"
}