{
  "title": "Enlightenment Now: The Case for Reason, Science, Humanism, and Progress",
  "description": "The follow-up to Pinker's groundbreaking The Better Angels of Our Nature presents the big picture of human progress: people are living longer, healthier, freer, and happier lives, and while our problems are formidable, the solutions lie in the Enlightenment ideal of using reason and science. Is the world really falling apart? Is the ideal of progress obsolete? In this elegant assessment of the human condition in the third millennium, cognitive scientist and public intellectual Steven Pinker urges us to step back from the gory headlines and prophecies of doom, which play to our psychological biases. Instead, follow the data: In seventy-five jaw-dropping graphs, Pinker shows that life, health, prosperity, safety, peace, knowledge, and happiness are on the rise, not just in the West, but worldwide. This progress is not the result of some cosmic force. It is a gift of the Enlightenment: the conviction that reason and science can enhance human flourishing. Far from being a naïve hope, the Enlightenment, we now know, has worked. But more than ever, it needs a vigorous defense. The Enlightenment project swims against currents of human nature--tribalism, authoritarianism, demonization, magical thinking--which demagogues are all too willing to exploit. Many commentators, committed to political, religious, or romantic ideologies, fight a rearguard action against it. The result is a corrosive fatalism and a willingness to wreck the precious institutions of liberal democracy and global cooperation. With intellectual depth and literary flair, Enlightenment Now makes the case for reason, science, and humanism: the ideals we need to confront our problems and continue our progress. Includes a Bonus PDF with charts and graphs.  PLEASE NOTE: When you purchase this title, the accompanying PDF will be available in your Audible Library along with the audio.",
  "genres": [
    "Nonfiction",
    "Science",
    "Philosophy",
    "History",
    "Psychology",
    "Politics",
    "Sociology"
  ],
  "author": "Steven Pinker",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/42340695-enlightenment-now"
}