{
  "title": "The Grounding of Modern Feminism",
  "description": "\"The time has come to define feminism; it is no longer possible to ignore it.\" The Century Magazine, 1914In this landmark addition to scholarship, Nancy F. Cott, author of The Bonds of Womanhood, offers a new interpretation of American feminism during the early decades of this century―a period traditionally viewed as on in which women won the right to vote and then lost interest in feminist issues. Cott argues instead that his period was a time of crisis and transition from the nineteenth-century \"woman movement’ to the beginning of modern feminism. Many of the issues that are central to women today, says Cott, were firmly articulated in the early decades of this century. For example, the problem of defining sexual equality so as to recognize sexual difference between men and women, the ambiguous potential of a movement seeking individual freedoms for women by mobilizing sex solidarity, and the tensions involved in attaining full expression in work and love are all enduring elements of feminism seized upon by women of the 1910s and 1920s.First discussing how feminism was indebted to its predecessors, Cott shows that increasing heterogeneity and diverse loyalties among women in the early twentieth century contradicted the premise of the nineteenth-century \"cause of woman\" (the singular noun symbolizing the unity of the female sex). From this crisis emerged feminism, championing individual variability and refuting the premise that a singular \"woman\" existed.Cott focuses on the suffrage-campaign milieu in which feminism arose, giving particular attention to the character and role of the National Woman’s Party from its militant suffrage days to its advocacy of the equal right amendment in the 1920s. Against prevailing interpretations of the decline of women’s political activities after 1920, Cott counterposes the swelling numbers in women’s voluntary associations and their political efforts. She also analyzes the pitfalls that awaited women who tried for effectiveness in the male-dominated political parties. She sets the controversy over the equal rights amendment in new context, discussing the full dimensions of the conflict as not merely over personalities, tactics, or class loyalties, but as a signal example of the modern problem of capturing sexual equality and sexual difference in law.The book explores the irony-strewn path of women who as aspiring professionals and political actors attempted to put into practice the feminist intent to replace the abstraction \"woman\" with, instead, \"the human sex.\" This history―the story of women who first claimed the name feminists―builds an essential bridge between the presuffrage period and today.",
  "genres": [
    "History",
    "Feminism",
    "Nonfiction",
    "20th Century",
    "Womens Studies",
    "American History",
    "Social Justice"
  ],
  "author": "Nancy F. Cott",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/423222.The_Grounding_of_Modern_Feminism"
}