{
  "title": "Indecent Advances: A Hidden History of True Crime and Prejudice Before Stonewall",
  "description": "A hybrid of true crime and social history that examines how popular culture, the media, and the psychological profession portrayed crimes against gay men in the years leading up to the Stonewall Riots.In his skillful hybrid of true crime and cultural history, James Polchin provides an important look at how popular culture, the media, and the psychological profession forcefully portrayed gay men as the perpetrators of the same violence they suffered. He traces how the press depicted the murder of men by other men from the end of World War I to the Stonewall era, when gay men came to be seen as a class both historically victimized and increasingly visible.Indecent Advances tells the story of how homosexuals were criminalized in the popular imagination—from the sex panics of the 1930s, to Kinsey study of male homosexuality of the 1940s, and the Cold War panic of Communists and homosexuals in government. Polchin illustrates the vital role crime stories played in circulating ideas of normalcy and deviancy, and how those stories were used as tools to discriminate and harm the gay men who were observers and victims of crime. More importantly, Polchin shows how this discrimination was ultimately transformed by activists to help shape the burgeoning gay rights movement in the years leading up to Stonewall Riots of 1968.A cast of noted public figures—Leopold & Loeb, J Edgar Hoover, Alfred Kinsey, Jack Kerouac, William Burroughs, Patricia Highsmith, James Baldwin, and Gore Vidal—is threaded through this complex subject. Politicians, law enforcement officials, and psychologists weigh in to explain the dangerous relationship between homosexuality and violence.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "LGBT",
    "Queer",
    "Gay",
    "Crime"
  ],
  "author": "James Polchin",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/42354188-indecent-advances"
}