{
  "title": "Kalle Blomquist",
  "description": "Sammelband:Kalle Blomquist − MeisterdetektivDie Eltern von Eva-Lotta bekommen Besuch von Frau Lisanders Cousin Einar. Eva-Lotta und ihre Freunde Kalle und Anders können Onkel Einar von Anfang an nicht leiden. Kalle fällt vor allem dessen äußerst nervöses und merkwürdiges Verhalten auf. Er beschattet ihn und nimmt heimlich Einars Fingerabdrücke mithilfe eines Stempelkissens. Kalle findet heraus, dass Einar an einem Juwelenraub beteiligt war und sich mit der Beute vor seinen Komplizen versteckt.Als dann die Komplizen Einar in Kleinköping aufspüren, überschlagen sich die Ereignisse. Kalle, Eva-Lotta und Anders geraten in große Gefahr, als sie versuchen, die Beute des Juwelenraubs vor den Ganoven in Sicherheit zu bringen.Kalle Blomquist lebt gefährlichEin Jahr ist vergangen, seit Kalle Blomquist zur Verhaftung von drei gefährlichen Juwelendieben beigetragen hat. Mittlerweile lachen ihn seine Freunde wieder aus, wenn er den Meisterdetektiv spielt.Doch dann geschieht ein Mord in Kleinköping und ausgerechnet Eva-Lotta findet die Leiche. Auch hat sie als Einzige den vermutlichen Mörder gesehen. Kalle ist dabei die Lust auf Detektivereien vergangen. Als dann aber mit Arsen vergiftete Schokolade den Weg in Lisanders Briefkasten findet, und die drei Freunde in einem verlassenen Haus auf den Mörder treffen, kann er doch wieder entscheidend zur Lösungs des Falles beitragen.Kalle Blomquist, Eva-Lotta und RasmusNach einer nächtlichen Aktion der Weißen Rose müssen Kalle, Anders und Eva-Lotta beobachten, wie Professor Rasmussen, ein bekannter Wissenschaftler, und dessen Sohn Rasmus entführt werden. Eva-Lotta schleicht sich in das Auto der Entführer, während Kalle und Anders sie mit dem Moped des Professors verfolgen. Sie verfolgen die Spur der Entführer bis zu einer kleinen Insel. Dort werden der Professor, Rasmus und Eva-Lotta von Industriespionen gefangen gehalten.",
  "genres": [
    "Childrens",
    "Fiction",
    "Swedish Literature",
    "Scandinavian Literature",
    "Classics",
    "Sweden",
    "Mystery"
  ],
  "author": "Astrid Lindgren",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/42329.Kalle_Blomquist"
}