{
  "title": "The Slab",
  "description": "MARCUS FENIX. WAR HERO. LOYAL SON. TRAITOR. Ten years after Emergence Day, as the Locust Horde advances on humanity’s last defended area—Ephyra—in a bloody war that has seen billions die, Marcus Fenix does the unthinkable: he defies orders and abandons his post during a critical battle in a bid to rescue his father, weapons scientist Adam Fenix. But Adam is buried in the rubble during a ferocious assault on the Fenix mansion, and Ephyra falls to the enemy. Marcus, grieving for a father everyone believes is dead, is court-martialed for dereliction of duty and sentenced to forty years in the Coalition of Ordered Government’s brutal maximum security prison, known simply as the Slab.But Adam is very much alive, snatched from the destruction by the elite Onyx Guard on Chairman Richard Prescott’s orders. He’s now a long way from home and in a prison of his own—a COG doomsday bunker on the tropical island of Azura, a place hidden from the rest of Sera since the Pendulum Wars. His own guilty secret has been exposed: Adam knew the Locust existed deep below the surface of Sera long before Emergence Day, and were being driven from their tunnels by a lethal parasite known as the Lambent. Now he has to find a way to destroy the Lambent while the dwindling COG forces fight to hold back a growing Locust army that’s threatening to overrun the city.As Adam struggles to find redemption in his comfortable island jail, Marcus seeks his own atonement in the squalid, closed world within the Slab’s granite walls. While Dom Santiago and Anya Stroud fight to get him released, ready to make any sacrifice to free him, Marcus gradually finds unexpected kinship among Sera’s most dangerous criminals—and a way to carry on his personal war against the Locust.",
  "genres": [
    "Science Fiction",
    "Video Games",
    "Fiction",
    "Games",
    "Gaming",
    "Novels",
    "Science Fiction Fantasy"
  ],
  "author": "Karen Traviss",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/12359733-the-slab"
}