{
  "title": "Jim Harrison: The Essential Poems",
  "description": "\"An untrammeled renegade genius... Here is a poet talking to you instead of around himself, while doing absolutely brilliant and outrageous things with language.\"--Publishers WeeklyStarred Review in Booklist \"[C]hoices of poems from each of Harrison's books are passionate and sharp... Of special note is a section from Letters to Yesenin, a book-length poem, and the title poem from The Theory and Practice of Rivers , which contains these echoing lines, 'I forgot where I heard that poems / are designed to waken sleeping gods.' Reading this essential volume, one might imagine that the gods are, indeed, staying up late, reading lights on, turning the pages.\"Jim Harrison: The Essential Poems is distilled from fourteen volumes--from visionary lyrics and meditative suites to shape-shifting ghazals and prose-poem letters. Teeming throughout these pages are Harrison's legendary passions and appetites, his meditations, rages, and love-songs to the natural world.The New York Times concluded a review from early in Harrison's career with a provocative quote: \"This is poetry worth loving, hating, and fighting over, a subjective mirror of our American days and needs.\" That sentiment still holds true, as Jim Harrison's essential poems continue to call for our fiercest attention.Also included are full-color images of poem drafts--both typescripts and holographs--as well as the letter Denise Levertov sent to publisher W.W. Norton in the early 1960s, advocating for Harrison's debut collection.In his essay \"Poetry as Survival,\" Jim Harrison wrote, \"Poetry, at its best, is the language your soul would speak if you could teach your soul to speak.\" The Essential Poems is proof positive that Jim Harrison taught his soul to speak.\"In this unforgiving literary moment, we must deal honestly with [Harrison's] life and work, as they are inextricable in a way that is not true of other poets...These poems bear-crawl gorgeously after a genuine connection to being, thrashing in giant leaps through the underbrush to find consolation, purpose, and redemption. In his raw, original keening he ambushes moments of unimaginable beauty, one after another, line after line...The Essential Poems demonstrates perfectly why we should turn to Harrison again. He lived and breathed an American confrontation with the physical earth, married himself to a universe of bodies and stumps and birds, did not try to shuck his grotesque masculinity and stared hard with his one good eye (the left was blinded when he was seven) at the inescapable, beckoning finger of death.\" --Dean Kuipers, LitHub\"The Essential Poems provides a good introduction--or reintroduction--to the work of this singular writer... these pieces illustrate Harrison's range and his ease with various formats, from lyric poems to meditative suites to prose poems. They also spotlight his deep, rugged kinship with rural landscapes and the natural world, where 'the cost of flight is landing.'\" --The Washington Post\"Jim Harrison's latest collection, The Essential Poems, contains...engaging and enlightening poems [that] should be taught, learned, and loved. Remember this.\"--New York Journal of Books\"Had he been a chef, all the other foodies would have talked about how Jim Harrison dealt with big flavors. In his poems, they're all there -- love and death, remorse and longing, the rocket contrails of living. There's not a lot of small talk in The Essential Poems... this book grabs you by the collar and tells you in eleven hundred ways to wake up.\"--John Freeman, Executive Editor, \"Recommended Reading from Lit Hub Staff\"\"Jim Harrison had an appetite. He devoured the natural world with gusto and wrote about it with wild energy and sweetly caustic wit...Harrison was also a prodigious poet, and this thoughtfully curated collection [The Essential Poems] showcases him at his best. Like his fiction, the poems observe the collision between civilization and the wildness outside our cities; they act like geocaches both harrowing and beautiful... Organized chronologically, the material here becomes a time line distilling Harrison's signature concerns.\"--Alta\"It is hard-boiled poetry, some of the best of its kind, and one is not surprised to know that Harrison has written very tough novels... His poetic vision is at the heart of it all.\"--Harper's",
  "genres": [
    "Poetry"
  ],
  "author": "Jim Harrison",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/42372443-jim-harrison"
}