{
  "title": "Fallen Star",
  "description": "Download the latest adventure in Karpov Kinrade's USA Today Bestselling Series, Vampire Girl, and find out why this series is one of the most popular fantasy vampire romances in the world today! ***  I'm a world-renowned archaeologist who happens to have a special gift--I can read artifacts and see their history. It makes me particularly good at my job and has pulled me into the world of paranormal treasure hunting. But I knew about the paranormal long before acquiring my PhDs. The night a monster killed my parents opened up a whole new, awful world to me.  Now, I'm on the hunt for pieces of the artifact they died protecting. When I'm betrayed by my partner and left for dead, I'm forced to team up with the last man on the planet I want anything to do with. Dr. Dean Vane... a monster just like the one who ruined my life. But I need his help to locate the artifact and stop an even greater threat from wreaking havoc on the world, and he needs my help in finding his brother, the King of Inferna, another world I didn't even know existed.  I certainly didn't plan to fall for his lusty charms, but as my own powers grow, I'm more drawn to him than ever. When we get trapped on a world of dragons, I see a side of him I didn't expect and must face my own prejudices.  Surrounded by danger, with my core beliefs challenged and my life hanging in the balance, I must decide who I can trust, and who is really the villain in my story. But in seeking the truth, will I destroy everything in the process?  Scroll up and one-click to find out!  THE VAMPIRE GIRL SERIES Book 1: Vampire Girl (USA Today bestseller, April 2016) Book 2: Midnight Star (USA Today bestseller, May 2016) Book 3: Silver Flame Book 4: Moonlight Prince (USA Today Bestseller, February 2017) Book 5: First Hunter Book 6: Unseen Lord Of Dreams and Dragons (a standalone novel in the VG universe)  Novellas in the Vampire Girl Universe: Copper Snare Crimson Cocktail",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance",
    "Paranormal Romance",
    "Fantasy"
  ],
  "author": "Karpov Kinrade",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/42374647-fallen-star"
}