{
  "title": "Their Bridgewater Brides Boxed Set, Volume One",
  "description": "Their Bridgewater Brides Boxed Set, Volume One includes:> Book #0.5: Their Runaway Bride [The Prequel]> Book #1.0: Their Kidnapped Bride> Book #2.0: Their Wayward BrideWith a Vanessa Vale romance, one cowboy is never enough. Like reverse harem romance? You'll love how these steamy alpha heroes (two or three at a time!) will do anything to claim and protect the women they love.These are all standalone romances in the USA Today bestselling, Bridgewater Ménage series, so get ready for a wild ride! \nBridgewater: Where ménage meets marriage.\n------------------------Book #0.5: Their Runaway Bride [A Prequel]\nRead how it all begins ... \nReturning from Europe, Ann learns she is to marry a man of her father's choosing once they arrive in New York. Refusing, she runs away, although she can't go far on a steam ship. Only as far as the stateroom of a very handsome soldier.There's only one guaranteed way to save a woman from a bad marriage, and that's to marry her himself. Ann is surprised Robert will go to such lengths to protect her, but stunned when she won't just be marrying him, but his fellow soldier, Andrew, as well.Book #1.0: Their Kidnapped BrideEmma James felt secure in her life. Money, social standing and the protection of her step-brother. Or so she thought. When she discovers his dark secrets, he turns on her and sells her to a western brothel to keep her quiet. There, she's forced to work or participate in an auction. A virgin auction...and she's the prize.One look at Emma James and Whitmore Kane and Ian Stewart know she would belong to them. Marriage was the only way to truly claim her...so they bid and bid well. As their bride, they return to the Bridgewater Ranch and teach her the ways to please not one husband, but two. But danger has tracked Ian around the world and threatens their newfound relationship. Together, can they fight the demons of the past while forging a future?This is the first book in the Bridgewater Ménage series, where you'll meet all of the men in Kane and Ian's army regiment and discover their unusual beliefs on marriage. Read the entire series to follow along as the men, two or three at a time, claim their brides.Book #2.0: Their Wayward BrideWhen Laurel Sinclair's uncaring father seeks to pawn her off in marriage as part of a business deal, she seeks to avoid her fate by fleeing. But running away in a Montana blizzard proves to be a terrible mistake.When handsome ranchers Mason and Brody find the stranded redhead next to her injured horse, they take her in and immediately decide to make her theirs, convinced they can convert the beautiful stranger to an unusual arrangement of marrying them both. The Bridgewater way of one woman marrying two husbands is foreign to Laurel, but she soon grows to love the two protective men who awaken her to a world of carnal pleasures she never knew existed. She grows to love them for their guidance and protection. But will her happiness be threatened by the secret she harbours? Will Mason and Brody still love her if they discover who she is? And what will happen when her scheming father and the cruel man he wanted her to marry finally track her down?",
  "genres": [
    "Romance"
  ],
  "author": "Vanessa Vale",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/42377907-their-bridgewater-brides-boxed-set-volume-one"
}