{
  "title": "Their Bridgewater Brides Boxed Set, Volume Three",
  "description": "Their Bridgewater Brides Boxed Set, Volume Three includes:> Book #6.0: Their Reluctant Bride> Book #7.0: Their Stolen Bride> Book #8.0: Their Brazen BrideWith a Vanessa Vale romance, one cowboy is never enough. Like reverse harem romance? You'll love how these steamy alpha heroes (two or three at a time!) will do anything to claim and protect the women they love.These are all standalone romances in the USA Today bestselling, Bridgewater Ménage series, so get ready for a wild ride!\nBridgewater: Where ménage meets marriage.\n------------------------Book 6: Their Reluctant BrideEmily Woodhouse is a penniless, homeless widow thanks to her recently deceased husband. His gambling ways have placed her in a desperate situation. Faced with working off his debt in the basest of ways, she chooses instead to accept Tyler and Xander's unconventional marriage proposal. She won't be marrying one man, but two.Tyler and Xander know instantly that Emily is the one for them. Not only does the widowed young woman rouse their protective natures, she knows of their customs regarding a two husband marriage. Despite the fact that Emily needs the safety they can offer, she isn't eager to remarry. She might be reluctant, but they will show her what it will be like with two men to cherish, protect and possess her. But the past catches up with them in the most dangerous of ways. Only in facing the past can they forge a future together. Book 7: Their Stolen BrideBeing the daughter of a Butte copper king won't buy Mary Millard happiness, especially when she discovers her father's plan to marry her to a cruel man. Desperate, Mary makes an arrangement with a man she meets on a train: pretend to be my intended so I can delay the inevitable. But little does she know it isn't one man who will save her, but two.Parker and Sully know the second they meet a beautiful passenger on the train to Butte that she will be their bride. They expected to court her properly, to acclimate to the unusual custom of being the wife of two men. Instead, she turns to them with an insane scheme to protect herself from a man they know to be anything but kind. But a fiancé won't protect her from a bad marriage. Only a husband can do that. When Mary weds her Bridgewater men, she learns that while she has two big cowboys to protect her from her past, it's possible she has the power to save them right back. Book #8.0: Their Brazen BrideWhen Abigail Carr returns to Bridgewater after long years away at Finishing School, Gabe and Tucker Landry will not be dissuaded from the only woman who’s held their attentions—and affections—for years. They’re done waiting. When Abigail claims she must return to Butte, and to her fiancé, Gabe and Tucker refuse to give up so easily. Since she doesn’t have a wedding band on her finger, nor love in her heart, they consider Abigail free for the taking. And seduce her they do…right home to Bridgewater, where they not only marry her, but claim her body in the most sensual experience of Abigail’s life.But Abigail knows that a future as a wife and mother is not possible, not for her. She only came home to save a friend’s life, and she dare not stay. If she doesn’t return to Butte in the next three days, her best friend will die. And no matter how much Abigail wishes she could stay, and be the wife Gabe and Tucker deserve, she must save her friend. The cruel criminal who threatens her friend will not hesitate to kill anyone important to Abigail, including her new husbands.Abigail will make a hard choice, and save them all…no matter the cost to herself or her heart.",
  "genres": [],
  "author": "Vanessa Vale",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/42377913-their-bridgewater-brides-boxed-set-volume-three"
}