{
  "title": "When They Call Out Your Name...Steve Walsh",
  "description": "Just on the heels of his 4th solo album, Black Butterfly, a new book is out about one of Classic Rock’s most iconic vocalists and keyboard players:When They Call Out Your Name, Steve Walsh is a pictorial trek through his stellar career with stories from Steve himself, his peers, as well as quotes from radio. The foreword is by famed rock photographer Neal Preston, several of his photos are featured - some never before released. More full color photos from the author and other rock photographers.Available at http://www.stevewalshrocks.comThe 70’s provided us with many faceless bands. REO Speedwagon, Journey, Foreigner, Kansas and many more. Because we didn’t associate faces with the band, it always came down to the music, and if it moved you. But the real engine was the vocalist. And if you look back at the guys selling the songs to us, the best of the bunch was the guy in Kansas. I could never remember any of their names, well, maybe Steve Perry, but I always loved the guy’s voice singing \"Dust In the Wind\" and the others. I knew his name was Walsh, because, well, I spent over a decade managing another Walsh…Joe. So then I hear about this book about THAT guy. Steve Walsh. And I read it. Wow, this guy was more than a singer, more than a front guy, more than a keyboard player. He is the real deal. Watching his life soar to upper rock star level, yet staying a humble and down to earth guy, is a story with intrigue, ups, downs and everything in between. I couldn’t put it down. More importantly, I’ll NEVER forget Steve Walsh’s name. He really put a face on one of those faceless bands. - David Spero (Executive at the Rock and Roll Hall of Fame and Museum, personal manager for Dickey Betts and more. Former clients include Joe Walsh, Michael Stanley, Ian Hunter, Harry Nilsson, Nicky Hopkins, Survivor, Billy Bob Thornton, Eric Carmen, Nelson, Cat Stevens and more)\"I managed to get myself an advance copy of the fabulous new book on Steve Walsh and Kansas from Laurie Larson last week, and I honestly couldn't put it down, I read it all in a day. There is so much great behind the scenes information here, I learned even more than what I knew from various documentaries and such. It really humanizes the band and gives you an insight to the major players that brought all this fabulous music to us. Kansas was one of the first rock bands I listened to as I got into rock back in the late 70's and they really colored my own music composition journey in later years as they revealed what was possible. I highly recommend this book.\" - Shawn Gordon (President and Founder of ProgRock Records)\"I first discovered Kansas in the mid-70s, somewhere around the Masque album, just as I was off to college. I was already into Yes and the usual rock scene of the time. What grabbed me immediately were the lyrics and, of course, the sound! Violins, keyboards, guitars, great singing of meaningful lyrics! What’s not to love? So, Kansas almost immediately became one of my favorite bands. At the time, however, I had moved to Moscow, Idaho, where I eventually went on the air as a DJ at KUOI-FM “Radio Free Moscow”. I played a mix of new and old, along with plenty of Kansas. As a side note, what I didn’t know at the time, and only learned recently, was that elementary school kids were listening to my, not-really-family-entertainment (ha!) show and that one of them was Laurie Larson, later to become the author of this book!! What goes around, comes around, I guess. Anyway, out on the Palouse, we only got a few concerts and I was unable to see them until I went home to Tucson for a Christmas vacation. On Dec 29, 1977, I got to see them for the first time, on the tour that would later become the basis for the Two For The Show tour. What a spectacular show! Everything I had hoped for them to be. It was amazing seeing them perform their material live, and with such passion. And while I marveled at Kerry, Rich, Robbie, and of course, Dave and Phil, there was a dynamo that was doing some of the wildest stuff I had seen – Steve Walsh. He provided an enormous wealth of energy and excitement to the show, and is part of an evening I will never forget. It was certainly then, and remains now, one of the very best of the many hundreds of shows I’ve experienced. That it was later released on the live album was an extra bonus. They may not have used the performances from Tucson, but I’m sure that one and all of the rest were worthy, as the band, and Steve, clearly put their life energy fully into the performances.Since then, I’ve seen Kansas quite a number of times, in various configurations and setups, even several times as part of my dream concert lineup, touring with Yes (although the shorter time allowance was a drag). Steve always brought it. Every performance, it seemed he gave his all, and the band always felt strong, even in the not-so-good times. Ironically, I’m writing this shortly after seeing Kansas perform the opening night of the Point of Know Return Anniversary tour, and while Kansas remains a powerhouse band, with an excellent, deep and continuing to grow catalog, it just wasn’t the same without Steve. The band suffered a huge loss with the departure of Kerry so long ago, but Steve’s leaving produces a more noticeable gap in the lineup, notwithstanding excellent performances by Ronnie. Steve’s shoes are pretty much impossible to fill.Laurie’s book “When They Call Out Your Name”, provides an excellent reference to Kansas’ and Steve's catalog and history, and reading his bio in his own words offers a rare and interesting insight into the man. She also managed to track down a huge number of excellent, often not-seen-before photos, provided by Neal Preston, who also writes a forward for the book. Of course, Laurie is an excellent photographer herself and has provided a number of photos from her personal collections. The format is easy to read, in depth without going into the weeds, and is very well produced. Bottom line, if you are interested in Kansas and the history of the band and Steve Walsh’s role and life outside of Kansas, get this book. You will not regret it!\" - Bob Zorich, Deep Nuggets RadioMore about Steve Walsh:Steve Walsh's distinguished place in the music world runs the gamut from being a familiar, friendly voice on commercial radio for decades- to forging into new progressive territory.His distinguished vocals on songs like Carry On Wayward Son and Dust in the Wind have been woven into the soundtrack of now three generations - over 30 million fans - all the while impressing new fans worldwide.His vocals - that remain among Rock and Roll's best - are marked by emotional depth and talent beyond compare. Add a charismatic stage presence and keyboard wizardry into the mix, and it is easy to see why Steve is so respected by fans and his Progressive Rock peers. So much so that progressive rock icons like Steve Hackett of Genesis and Steve Morse of the Dixie Dregs (who would later join Kansas and Deep Purple) asked Steve to play on their albums, as well as a host of other current and legendary progressive performers seeking his expertise. His songwriting has been a step ahead from the beginning, and helped propel Kansas placement on the Billboard Charts with tunes like Point of Know Return (#28) and All I Wanted (#19). He also drove the band he formed, Streets into the top ten with If Love Should Go.Still a chart topper in recent years too, with the documentary that aired repeatedly on VH1 and Palladia, Miracles Out of Nowhere, and his current album Black Butterfly is still receiving world-wide airplay and acclaim. Steve is grabbing the bar Kansas set during their peak and raising it yet another notch. Steve has a truly amazing level of musicianship that can take you to another place…",
  "genres": [],
  "author": "Laurie  Larson",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/42374093-when-they-call-out-your-name-steve-walsh"
}