{
  "title": "Corporate Crap: Lessons Learned from 40 Years in Corporate America",
  "description": "Corporate Lessons Learned from 40 Years in Corporate America takes a humorous look at the business practices that lead employees to look for new employment...like meetings, performance reviews, downsizing, and bosses from hell. And let's not forget the esteem-sapping elements like dress codes, task forces, brainstorming, and engagement surveys; flip charts, org charts, hard stops, and hard-ons. Each chapter includes personal anecdotes, quotes from business experts, and the latest research to answer the burning If companies truly believe employees are their most valuable resource, why do they treat them like crap?In Corporate Crap , readers will  - How companies are trying to shorten meetings by making everyone stand and other forms of torture.- Why the founder of Second City Works calls Tina Fey \"a genius boss.\"- How the author burned his first professional bridge in his first-ever exit interview.- Why 700 million vacation days went unused last year. (What is wrong with you people?)- The roots of \"at the end of the day\" and other common expressions.- Why companies don't call employees \"employees\" anymore - and how it can backfire on them.- How hiring managers are affected by stereotypes - and not always how you'd think.- Why companies' obsession with labeling employees as introverts or extroverts is a complete waste of time.- The biggest problem companies have firing people.- Why the idea that \"no idea is a bad idea\" is a bad idea.- What people really do during conference calls.There are lessons to be learned lessons that will entertain and inform anyone who has ever worked for a large corporation. Lessons learned from 40 years of Corporate Crap!Howard Harrison draws from four decades of corporate experience. After earning a journalism degree from the University of Wisconsin-Madison in 1978, he joined the corporate headquarters of Walgreen Company. In 1980, he was a writer/editor for the Hospital Financial Management Association; he was then hired by Alexander Grant & Company to lead communications for the newly formed Grant Thornton International. In 1982-83, Harrison worked as an editor-at-large for the American Bar Association Press. Late in 1983, he joined Baxter International, creating a new employee magazine that won the Gold Quill Award of Excellence from the International Association of Business Communicators in 1991. Today he provides writing and editorial services through his company Harrison Editorial Inc. and is the author of two previous NOW They Make it Reflections of an Aging Baby Boomer , a 2016 Reviewer's Choice by Midwest Book Review, and The Great Story of the 2016 U.S. Presidential Race .",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "Howard  Harrison",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/42365309-corporate-crap"
}