{
  "title": "ever really hear it",
  "description": "Poetry. Literary Nonfiction. Hybrid Genre. Asian & Asian American Studies. LGBTQIA Studies. Music. Women's Studies. This collection constructs a poetics of pop music moving to embody the audience's desire to be both performer and micro. In EVER REALLY HEAR IT music is an ambient mediator of raced and gendered spaces. The book critiques music's ability to shape culture and the way marginalized bodies experience narrow space while it also honors the desires of women in their own versions of love song. The voices in this book create a mythology foregrounded in close readings of popular music's subtexts across historical consciousness.\"Open your ear to Soham Patel's EVER REALLY HEAR IT, and find a twisted lullaby courting you into a phantasmagoric dream caught some place between the chaos of migration and a garden. Patel, in this astonishing accomplishment, engages a poetic of the toughly textured utterance, 'scratched wood scratch metal'--one that speaks into the mouth of what music might be if it were a body with experience. That's how we hear it, like Tina Turner sings in 'Proud Mary, ' 'See we never do nothing / nice, easy / We always do it nice and rough.' A rock riff, a blues for a broken heart, a limp, ever really hear it situates Soham Patel's poems in a breaking-glass lyric, stripping the soul, and stroking it too, in a way we desperately need now.\"--Dawn Lundy Martin\"Soham Patel writes poems the way I want to be kissed--with fervent challenge, presence, and sensual intelligence. She reminds me that when the instrument breaks, the desire for melody--that longing for a sinuous connection across divides--persists. She takes us nimbly across broken houses, wretched dive bars, sodden river beds, and historical oppressions in pursuit of this tune, not blinking at pain or other glories in the veldt of desire. Have you been held in the cut of Soham's song? It's the softest and to the quick.\"--Sueyeun Juliette Lee",
  "genres": [
    "Poetry"
  ],
  "author": "Soham Patel",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/42362122-ever-really-hear-it"
}