{
  "title": "Dual Citizens",
  "description": "Following The Missing Person and Inside, Alix Ohlin's third novel is a masterful achievement: a joint coming-of-age story and an achingly poignant portrait of the strange, painful, ultimately life-sustaining bonds between sisters.Lark and Robin are half-sisters whose similarities end at being named for birds. While Lark is shy and studious, Robin is wild and artistic. Raised in Montreal by their disinterested single mother, they form a fierce team in childhood despite these differences. As they grow up, Lark excels at school and Robin becomes an extraordinary pianist. At seventeen, Lark flees to America to attend college, where she finds her calling in documentary films, and her sister soon joins her. Later, in New York City, the sisters find themselves tested: Lark struggles with self-doubt, and Robin chafes against the demands of Juilliard. Under pressure, their bond grows strained and ultimately broken, and their paths diverge. Lark leaves New York when she meets Lawrence Wheelock, a renowned filmmaker who becomes both her employer and occasional lover, while Robin returns to Canada. When Wheelock denies Lark what she hopes for most of all--a child--she is forced to re-examine a life marked by unrealized ambitions and thwarted desires. And as she takes charge of her destiny, Lark discovers that despite their complicated, oftentimes painful relationship, there is only one person she can truly rely on: her sister.In this gripping, unforgettable novel about motherhood, sisterhood, desire, and self-knowledge, Alix Ohlin traces the rich and complex path towards fulfillment as an artist and a human being, capturing the peculiar language of sisters and making visible the imperceptible strings that bind us to the ones we love--or have loved--for good.",
  "genres": [
    "Fiction",
    "Canada",
    "Literary Fiction",
    "Book Club",
    "Audiobook",
    "Contemporary",
    "Family"
  ],
  "author": "Alix Ohlin",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/42379023-dual-citizens"
}