{
  "title": "Missing in Action",
  "description": "Ryder Morrison is a man of loyalty. To his country, his family, his team.After joining the Navy, he was secretly recruited to Task Force 779, a specialized unit that infiltrates dangerous situations when no one else can — or will. As the communications expert, it’s his job to clear the way for a smooth mission. He knows where the enemy is hidden at all times and when his team can enter a zone safely.When things go wrong and he’s captured, declared dead before a search can truly begin, Ryder knows that when he makes his way home, his life will be different… better. He’ll live for himself from now on, instead of following where duty takes him.Enter his elusive neighbor… A woman of mystery and fear.Codie Ray is a woman filled with pain. Afraid of life and locked away.She counts to soothe the anxiety. She watches her neighbor because he’s her only lifeline to the outside world. He’s a commitment she doesn’t have to worry will break her. Until the unthinkable happens and her solace is intruded upon.Ryder comes to the rescue and barges his way into her life, pushing past her barriers, causing Codie to rethink her reclusive lifestyle. Slowly being tormented with mind games from an unknown predator, she battles her better judgment and trusts Ryder to do what he does best… hunt down the perpetrator.Their connection is instantaneous. Two broken people yearning to be loved but afraid to reach for it. Codie fears Ryder will leave when he discovers just how damaged she is. Ryder worries Codie will remain locked away in her mind, unable to break free.A surprise mission brings both of their fears to life, and when the walls crumble, Ryder is Missing in Action while Codie is just… missing. Will they find each other again or will they disappear, existing only in a memory?",
  "genres": [
    "Military Fiction",
    "Contemporary",
    "Romance",
    "Romantic Suspense",
    "Mystery Thriller",
    "Military Romance",
    "Mystery"
  ],
  "author": "K.L. Donn",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/42394365-missing-in-action"
}