{
  "title": "All the Wrong Reasons",
  "description": "Adrienne prides herself for being smart, prim and proper. She doesn’t go against the rules of society and refuse to even take a shot of Tequila. In other Conservative. Boring.Instead of having fun and letting her spirit run free, she spent almost all her life trying to gain her mother’s approval, measuring up to her sister’s greatness, and proving herself worthy of her boyfriend’s love and attention. She’s been lying to everybody, including herself, about who she really was.But no matter what she does, she just can’t seem to live up to their expectations. And then she got fed up and decided to let loose. For just one night. She left her eyeglasses, flat shoes, long skirt and knitted sweater behind. In high heels and a dress that accented her long legs and curves, she went to a club by herself and decided to find out what it was like to have a good time. Her night couldn’t even be more perfect when Justin Adams, the city’s most sought after bachelor, a.k.a. most notorious playboy fell prey to the charms she didn’t even know she possessed.Justin was every girl’s dream boat, but he never committed to a woman. He didn't date and didn't do relationships. So, Adrienne thought after that night, she didn’t have to deal with him again. He would forget about her and her secret night of fun was safe with him.But what she did not expect is that Justin isn't about to let her go that easily. And what was supposed to be just a one night stand with the City's most wanted playboy became a full-blown secret affair. In the eyes of her friends and family, she had a boyfriend named Troy. But within the walls of her bedroom, she belonged to Justin.But her new-found bliss would be threatened by the secrets that Justin keeps and the past that her parents kept from her.Soon, she will find out that she's been living her life with all the right intentions... but for all the wrong reasons.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "New Adult",
    "Contemporary",
    "Billionaire Romance",
    "Romantic",
    "Fiction"
  ],
  "author": "Jerilee Kaye",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/42391995-all-the-wrong-reasons"
}