{
  "title": "The Body Never Lies: The Lingering Effects of Cruel Parenting",
  "description": "World-renowned therapist Alice Miller has devoted a lifetime to studying the cruelties inflicted on children. In The Body Never Lies Miller goes further, investigating the long-range consequences of childhood abuse on the adult body. Using numerous case histories gleaned from her practice, as well as examining the biographical stories of celebrated writers such as Marcel Proust, Virginia Woolf, Friedrich Nietzsche, and others, Miller shows how a child's emotional traumas, repressed humiliation, and bottled rage can manifest themselves as serious adult health problems. In discussing the lives of these literary giants, Miller explores the known or, in some cases, unknown traumas that haunted each author's childhood. More important, Miller connects the writers' painful childhoods with their later afflictions, which included depression, anorexia, cancer, and even insanity.While examining everything from parental spanking to sexual abuse and emotional blackmail, Miller exposes the societal pressures that converge to harm children. She explains that we have so many societal mechanisms to prevent us from feeling anger or rage against our parents that we tend never to confront our own feelings. To combat the debilitating effects of such jarring and often contradictory emotions, Miller explores the benefits of using a therapist as an \"Enlightened Witness\" to reaffirm the patient's repressed reactions to a forgotten childhood experience.Miller also discusses how institutionalized religion itself can contribute to the crushing guilt that prevents us from being healthy and conscious adults. She urges society to realize that the Fourth Commandment -\"Honor thy father and thy mother\"- offers immunity to abusive parents. Indeed, she argues, it is healthier not to extend forgiveness to parents whose tyrannical childrearing methods have resulted in unhappy, and often ruined, adult lives.In a stirring rejection of the \"Poisonous Pedagogy\" that pardons even the most brutal parenting, Miller examines the cyclical nature of violence and abuse. Parents and guardians who abuse their children, both physically and mentally, leave them embarrassed and hurt. The inability of most children to properly express such feelings causes them to perpetuate the cycle by lashing out at their family, friends, and, above al1, their own children, who will inevitably do the same.Throughout The Body Never Lies, Miller offers a calm and encouraging voice. Indeed, The Body Never Lies, through its illuminating and provocative insight, affords us a unique understanding of the immense healing powers of the adult self and the body.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Parenting",
    "Mental Health",
    "Health",
    "Personal Development"
  ],
  "author": "Alice Miller",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/423911.The_Body_Never_Lies"
}