{
  "title": "Bloodlines of the Illuminati",
  "description": "The latest edition of Bloodlines of the Illuminati... Direct from the Distrubutor *************************** You've seen pieces of the puzzle, but still you wonder... Bloodlines of the Illuminati is a unique historical genealogical who's-doing-it book, rich in detail, providing a devastating exposé of the people and families who are THE movers and shakers of the United States and the entire world. You will recognize some of the names instantly. Many names have been purposely hidden from mainstream view. From international finance to war, presidents and dictators alike pay heed to these people. \"Influence\" doesn't even come close to describing their power. They have plans for you. Who are they? Author, Fritz Springmeier provides a wealth of material and inside information based on eyewitnesses. His outstanding research provides facts that are not available elsewhere. When you finish reading this book, the pieces of the puzzle will fall into place and you'll see the fascinating big picture. You will know who actually runs the New World Order conspiracy, and who is in the Illuminati. You may discover for yourself why Bloodlines of the Illuminati was a bestseller in Japan, a nation which thrives on detail. IF YOU ENJOYED THE PREVIOUS EDITION OF BLOODLINES, YOU'LL LOVE THE NEW EDITION EVEN MORE... completely revised, the new \"Bloodlines of the Illuminati\" has more info and better photos. The 3rd Edition's large print size (7\" X 10\") makes for easier reading. * Hot new information exposing Wolf Head (a group similar to Skull & Bones). * New genealogy charts, one shows how 25 Presidents are related, another how Prince Charles is related to Count Dracula. * More information on all the bloodlines.",
  "genres": [
    "Conspiracy Theories",
    "Nonfiction",
    "History",
    "Occult",
    "Politics",
    "International",
    "Satanism"
  ],
  "author": "Fritz Springmeier",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/4238.Bloodlines_of_the_Illuminati"
}