{
  "title": "97: The Warloch's Pact",
  "description": "Kindle Your Flame of Adventure in 97, The Warloch’s PactStep into a Tale of a Modern Girl and Boy Mingled with Historical RomanceNewspaper Girl Jane Burrows is a hard-working likeable teen who is satisfied with her small town life far from urban cares. She lives with her mom and beagle on a quiet street in rural Oregon. She has a best friend, wheels, and a smartphone that keeps her in touch with current events. A senior in high school struggling to help her mom, Jane has other things on her mind besides romance.What Could Possibly Go Wrong?Jane’s ordered world changes when a new boy moves in just a few doors down. William McLeod isn’t your typical senior. He has the build of an MMA fighter, the skills of a parkour expert, and can quote Jane Austen’s fiction no problem. He’s also pretty evasive when it comes to the simplest of questions. Where is he from? What does his dad do? Why does he keep following Jane around like a puppy dog in training?William Has a SecretThere is that other thing too. The thing where he keeps dying in battle and resurrecting. William descends from an ancient Warrior race, created to be invincible in battle. It’s kind of a secret, until he’s faced with a life or death situation involving the cute girl he just met.History Repeats ItselfZarastrid is the leader of a powerful group of immortal Warlochs. In ancient times, he and his brothers had a wonderful idea. Create a race of Warriors to fight their battles for them. Zarastrid finds a Christian woman suitable for the task, but quickly discovers he can’t stay away from her. The Warriors created would be deadly, powerful and fearless. There was only one problem; it turned out that their loyalty couldn’t be guaranteed.Zarastrid Wants RevengeThe Warlochs are hunting down every last descendant of the Warrior race. The Lochspawn monsters reign with blood and horror, wreaking devastation wherever they land. A rogue Lochspawn has tracked William to Jane’s small town, and William must make a choice. Preserve one of his last lives in order to save Jane’s frail existence? Or hoard his precious remaining lives and watch his future go up in flames?",
  "genres": [],
  "author": "LoveVickyHolt",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/42412535-97"
}