{
  "title": "Στο χείλος της αβύσσου: Η πλήρης έκδοση του \"Φάμπιαν\"",
  "description": "Όταν, το 1931, κυκλοφόρησε για πρώτη φορά το μυθιστόρημα Φάμπιαν του Έριχ Κέστνερ, η εθνικοσοσιαλιστική εφημερίδα Volkischer Beobachter έσπευσε να το χαρακτηρίσει «εκδοτικό σκουπίδι». Ο κριτικός που υπέγραφε το κείμενο ήταν, φυσικά, ανώνυμος και ο χαρακτηρισμός αποτέλεσε, και αποτελεί μέχρι σήμερα, τίτλο τιμής. Άλλωστε, λίγους μόλις μήνες αργότερα, το βιβλίο είχε πουλήσει πάνω από 30.000 αντίτυπα, σημειώνοντας μεγάλη επιτυχία. Κι όμως, το αριστούργημα του Κέστνερ δεν ευτύχησε να παρουσιαστεί στους αναγνώστες, όπως ακριβώς το έγραψε και το παρέδωσε ο ίδιος ο δημιουργός του. Ο επιμελητής και ο εκδότης προχώρησαν σε μια σειρά αλλαγών. Κι ένα ολόκληρο κεφάλαιο λογοκρίθηκε. Χρειάστηκε να περάσουν δεκαετίες, για να κυκλοφορήσει το βιβλίο για πρώτη φορά πλήρες και χωρίς περικοπές. Η ανά χείρας έκδοση περιλαμβάνει την αρχική μορφή και τον αρχικό τίτλο του μυθιστορήματος, ενώ στο Παράρτημα οι αναγνώστες έχουν την ευκαιρία να παρακολουθήσουν λεπτομερώς την περιπέτεια του βιβλίου.Ο συγγραφέας αφηγείται την ιστορία του Γιάκομπ Φάμπιαν, άνεργου διδάκτορα της φιλολογίας, ο οποίος, στις αρχές της δεκαετίας του ’30, εξερευνά τον βερολινέζικο κόσμο της νύχτας. Γύρω του ακμάζουν τα πορνεία, τα ατελιέ των καλλιτεχνών και τα παράνομα καμπαρέ, η ανεργία μαστίζει την κοινωνία, ο πληθωρισμός καλπάζει, οι ιδεολογικές αντιπαραθέσεις καταλήγουν σε βίαιες συγκρούσεις. Η Δημοκρατία της Βαϊμάρης καταρρέει, η πόλη βρίσκεται σε κατάσταση έκτακτης ανάγκης, οι κάτοικοί της ζουν, ερωτεύονται, πολιτικοποιούνται σαν να μην υπάρχει αύριο, βιώνουν την πνευματική τους παρακμή και βυθίζονται στο αλκοόλ και στις καταχρήσεις, γνωρίζοντας πολύ καλά πως το μέλλον δεν υπόσχεται τίποτα. Και, μέσα στη γενικευμένη ανηθικότητα, ο ήρωας του έργου παλεύει να επιβιώσει, παραμένοντας ένας ηθικός άνθρωπος. Ο Κέστνερ, ένας από τους σημαντικότερους Γερμανούς συγγραφείς, με εντυπωσιακή γλωσσική μαεστρία, προσφέρει στους αναγνώστες ένα εξαιρετικά απολαυστικό μυθιστόρημα και ταυτόχρονα προφητική μαρτυρία για την Ευρώπη του Μεσοπολέμου και την εποχή πριν από την άνοδο του Χίτλερ στην εξουσία.",
  "genres": [
    "Fiction",
    "Classics",
    "German Literature",
    "Germany",
    "Literature",
    "Novels",
    "School"
  ],
  "author": "Erich Kästner",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/42421795"
}