{
  "title": "Rogue Nights",
  "description": "Seven tales of romance, hope, and passion. Even after the roughest night, dawn promises new beginnings. Resisting Desire by Talia HibbertActivist, womanist and journalist Nina Chapman is in love with her brother’s best friend. Oops. When her attempt to seduce calm, reliable James Foster backfires, Nina’s mortified—but as much as she’d like to avoid him, she can’t. No; she literally can’t. Because Nina’s latest article has made her public enemy number one, and now the man who broke her heart just might be her only protection… Dropped Stitches by Annabeth AlbertWhen activist knitter Bea goes to vote, the last person she expects to run into is her high school crush. The two women forge an unlikely election day connection, but can they see a future beyond the victory party?Parking Lot Cowboy by Rebecca CrowleyMargot Dunn has spent months making up an elaborate fantasy about the tall, silent cowboy who serves as her fellow volunteer escort at a family planning clinic in Topeka. Then one morning he speaks, and the complicated reality of ranch-hand Tyler Olsen is better than any story she could make up. Dare to Dream by Hudson LinAfter the 2016 election, Derek Lam kicked his political activism into high gear—it’s what anyone with half a conscious would do. Which is why he doesn’t understand how Diego Ortega, a classmate from law school and a Dreamer, could be so politically disengaged. For Diego, pursuing law had never been about social justice. His priority has always been providing for and protecting his undocumented mother and his kid sister. Getting political did nothing but draw attention his family didn’t need. Working on a class assignment together, Diego and Derek’s mutual attraction bubbles just under the surface. But any potential relationship will have to survive the sparks that fly from their clashing political views.The Coffee Shop Around the Corner by Shae ConnorPolitical discourse is Madeline Maloney’s jam. Social media manager for a progressive mayoral candidate, she finds her interest piqued by an email exchange with a local businessman—but also by the cute guy at the coffee shop where she buys her morning cup. Palmer Harrison spends his mornings smiling at the beautiful woman who orders a caramel latte every day and his off hours emailing with a mystery woman who works for a mayoral campaign. Their parallel relationships intersect on Election Day… Love Your Face by Ainsley BoothFifteen years ago, Fred left the Midwest behind and moved to New York City. Return visits have been rocky, and this Thanksgiving promises more family drama Fred really doesn’t want to deal with it. Her best friend’s surprise appearance smooths over a difficult holiday, but raises new, complicated personal feelings when the very straight Ami confesses she’s not very straight after all.Sacred Son by Robin CovingtonAdam Woodson has dedicated his life to fighting for the rights of Native Americans in court and in the legislature, a career that has kept him too busy to regret the man who got away. Judah Nighthorse is rebuilding his life after prison, fighting to regain custody of his son from a non-Native foster family so he swallows his pride and asks the man he left behind for help. When fighting the good fight together sparks desire they can’t resist, they must decide if their future holds a second chance or a final goodbye.",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary",
    "Contemporary Romance",
    "LGBT",
    "Short Stories",
    "M M Romance"
  ],
  "author": "Talia Hibbert",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/42420719-rogue-nights"
}