{
  "title": "The Privileged Poor: How Elite Colleges Are Failing Disadvantaged Students",
  "description": "Getting in is only half the battle. The Privileged Poor reveals how—and why—disadvantaged students struggle at elite colleges, and explains what schools can do differently if these students are to thrive.The Ivy League looks different than it used to. College presidents and deans of admission have opened their doors—and their coffers—to support a more diverse student body. But is it enough just to admit these students? In The Privileged Poor, Anthony Jack reveals that the struggles of less privileged students continue long after they’ve arrived on campus. Admission, they quickly learn, is not the same as acceptance. This bracing and necessary book documents how university policies and cultures can exacerbate preexisting inequalities and reveals why these policies hit some students harder than others.Despite their lofty aspirations, top colleges hedge their bets by recruiting their new diversity largely from the same old sources, admitting scores of lower-income black, Latino, and white undergraduates from elite private high schools like Exeter and Andover. These students approach campus life very differently from students who attended local, and typically troubled, public high schools and are often left to flounder on their own. Drawing on interviews with dozens of undergraduates at one of America’s most famous colleges and on his own experiences as one of the privileged poor, Jack describes the lives poor students bring with them and shows how powerfully background affects their chances of success.If we truly want our top colleges to be engines of opportunity, university policies and campus cultures will have to change. Jack provides concrete advice to help schools reduce these hidden disadvantages—advice we cannot afford to ignore.",
  "genres": [
    "Education",
    "Nonfiction",
    "Sociology",
    "Social Justice",
    "Race",
    "Politics",
    "Audiobook"
  ],
  "author": "Anthony Abraham Jack",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/42422452-the-privileged-poor"
}