{
  "title": "Tokyo Firewall",
  "description": "A novel of international suspense\nAn outsider in a foreign land. Her ruthless cyberstalker. She’ll fight tooth and nail for her digital privacy. Her life depends on it. \nTokyo, the ‘90s. When Alison Crane quit her environmental law practice and followed her hotshot investment banker boyfriend to Japan, she thought they'd only grow closer. But jobless and broke, Alison sits home alone all day-—and most nights—isolated by culture shock, wobbly language skills, and her boyfriend's ambitions. Desperate for company, she ventures onto the only avenue she has left—the brand-new digital frontier.Inside the confusing web of cyber chat rooms, Alison is approached by a charming Japanese man, and the two regularly meet online. However, her digital safe haven soon becomes a virtual nightmare when a troll who despises foreigners taunts her with escalating threats of violence. As her predator's attacks intensify, Alison must parlay her legal smarts and budding computer skills to stand her ground, or she'll lose her only source of freedom. And maybe her life...Tokyo Firewall is a tech-savvy international romantic suspense novel. If you like tenacious heroines, cyberterrorism thrillers, and fast-paced action, then you’ll love Elizabeth Wilkerson’s '90s-era digital free-for-all. “A captivating, sexy thriller which follows the perilous adventures of a newcomer caught in Tokyo's dark web. Elizabeth Wilkerson's writing is smooth as silk!” – Naomi Hirahara, Edgar Award-winning author of the Mas Arai and Officer Ellie Rush mystery series“Creepy. Thrilling. Sexy. More, please!” – Rachel Howzell Hall, acclaimed author of the Lou Norton series and co-author of The Good Sister with James Patterson\nBuy Tokyo Firewall to log on to an electrifying tale of defiance and self-discovery today!",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller"
  ],
  "author": "Elizabeth Wilkerson",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/42419238-tokyo-firewall"
}