{
  "title": "In Harm’s Way: The Pornography Civil Rights Hearings",
  "description": "This book contains the oral testimony of victims of pornography, spoken on the record for the first time in history.Speaking at hearings on a groundbreaking antipornography civil rights law, women offer eloquent witness to the devastation pornography has caused in their lives. Supported by social science experts and authorities on rape, battery, and prostitution, discounted and opposed by free speech advocates and absolutists, their riveting testimony articulates the centrality of pornography to sexual abuse and inequity today.At issue in these hearings is a law conceived and drafted by Andrea Dworkin and Catharine A. MacKinnon that defines harm done through pornography as a legal injury of sex discrimination warranting civil redress. From the first set of hearings in Minneapolis in 1983 through those before the Massachusetts state legislature in 1992, the witnesses heard here expose the commonplace reality of denigration and sexual subordination due to pornography and refute the widespread notion that pornography is harmless expression that must be protected by the state.Introduced with powerful essays by MacKinnon and Dworkin, these hearings—unabridged and with each word scrupulously verified—constitute a unique record of a conflict over the meaning of democracy itself—a major civil rights struggle for our time and a fundamental crisis in United States constitutional law: Can we sacrifice the lives of women and children to a pornographer's right to free \"speech\"? Can we allow the First Amendment to shield sexual exploitation and predatory sexual violence? These pages contain all the arguments for protecting pornography—and dramatically document its human cost.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Politics",
    "Law",
    "Sexuality",
    "History"
  ],
  "author": "Catherine A. MacKinnon",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/42437.In_Harm_s_Way"
}