{
  "title": "The Irish Princess: Her father's only daughter. Her country's only hope.",
  "description": "Her father's only daughter. Her country's only hope. ________________________________Ireland, 1152The King of Leinster, awaiting news of his newborn child, is disappointed to hear he has a daughter. Diarmait MacMurchada wanted another strapping son to shoulder a spear, wield a sword, and protect his kingdom. But from the moment Diarmait held the newborn Aoife knew she would be his most precious treasure. 1166Forced into exile Aoife and her family find themselves at the mercy of Henry II. Aoife - aware of her beauty but not its power - intrigues and beguiles Henry in equal measure. For Aoife he agrees to help her father, an alliance that leads the MacMurchadas to the charismatic Richard de Clare, a man dissatisfied with his lot and open to new horizons. Diarmit promises Richard Aoife's hand in marriage in return for his aid in Ireland, but Aoife has her own thoughts on the matter. She may be a prize, but she is not a pawn, and she will play the men at their own game. For herself, for her family, and for her country. From the royal halls of scheming kings, to staunch Welsh border fortresses and the wild green kingdoms of Ireland, The Irish Princess is a sumptuous, journey of ambition and desire, love and loss, heartbreak and survival.________________________________Praise for Elizabeth Chadwick'An author who makes history come gloriously alive'The Times 'Stunning . . . Her characters are beguiling, and the story is intriguing'Barbara Erskine 'Picking up an Elizabeth Chadwick novel you know you are in for a sumptuous ride'Daily Telegraph'I rank Elizabeth Chadwick with such historical novelist stars as Dorothy Dunnett and Anya Seton'Sharon Kay Penman'Enjoyable and sensuous'Daily Mail'Meticulous research and strong storytelling'Woman & Home 'A riveting read . . . A glorious adventure not to be missed!'Candis",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Ireland",
    "Fiction",
    "Medieval",
    "Romance",
    "12th Century"
  ],
  "author": "Elizabeth Chadwick",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/42453643-the-irish-princess"
}