{
  "title": "AI Performance: The Art of Live Automation: The ultimate 'how to' guide in creating stunning, technical and revolutionary live shows for any contemporary musical performer",
  "description": "A.I. Performance: The Art of Live Automation takes you through a series of steps for any novice to become technically proficient enough to script and pre-automate live shows which rival the biggest stars. Using equipment you already own (or even suggesting potential new purchases to help you achieve your goals) this book will teach you everything you need to know to control almost every piece of equipment in the venue, without you having to touch it once during the performance.Throughout this guide I will be showing you how you can make readily available technologies work for you, and even go beyond that which it was originally intended in order to make some truly spectacular performances on stage. By utilising this technology you can begin to orchestrate live shows that almost rival the professionals whom have a large technical team behind the scenes, only you won’t necessarily need any of them. Consider the notion of having a robot replace a back-stage technical team and how you’d programme it to control the lighting, smoke machines, stage fans, video projection, broadcasting cameras, social media, backing tracks, FX units, and your entire backline (amplifiers, synths, drum brains etc.,); everything that constitutes the equipment used in a live show.The goal of this guide is simple: to help you make your shows more entertaining. Consider how much packaging affects a consumer's decision to buy on top of the product contained inside, symbolically this is this guide will help you to create. Whilst you might pick up some things along the way which might have 'nerdy' applications for yourself, what I am really hoping for is that you put yourself in your audience's shoes and orchestrate stage performances to 'wow' them with. You will be amazed at how much you can achieve by yourself, and without having to employ anyone to do these things for you.Any and all techniques and methods described in this guide can be utilised in any area of music, not strictly in performance. Perhaps you’re a composer that’s gotten a little too used to loading up VST Instruments and using them ‘as-is’. Perhaps you’re a producer who would like to streamline production without having to consistently re-patch equipment throughout and in between sessions, or perhaps you’d like the ambient lighting of your studio to pulse to the recording metronome. Perhaps you’re a live sound engineer who wants to add more strings to their bows by making their stages more impressive. Perhaps you are a music student that wishes to increase their chances of a higher mark for practical live performance. The fact is that a lot of this technology has existed for decades plus anything new coming to market will likely interface with it, and it’ll be down to how you apply your own flair and creativity in using what you’ll learn here.A.I. Performance will revolutionise how you approach performing which will in turn grow a loyal, enthusiastic fan base for your act.",
  "genres": [],
  "author": "Chris  Frost",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42453481-ai-performance"
}