{
  "title": "The Valancourt Book of ​Victorian Christmas Ghost Stories: Volume Three",
  "description": "A new collection of twenty ghostly tales of Yuletide terror, collected from rare Victorian periodicals\nSeeking to capitalize on the success of Charles Dickens’s A Christmas Carol (1843), Victorian newspapers and magazines frequently featured ghost stories at Christmas time, and reading them by candlelight or the fireside became an annual tradition, a tradition Valancourt Books is pleased to continue with our series of Victorian Christmas ghost stories. This third volume contains twenty tales, most of them never before reprinted. They represent a mix of the diverse styles and themes common to Victorian ghost fiction and include works by once-popular authors like Ellen Wood and Charlotte Riddell as well as contributions from anonymous or wholly forgotten writers. This volume also features a new introduction by Prof. Simon Stern.“Before me, with the sickly light from the lantern shining right down upon it, was—a cloven hoof! Then the awfulness of the compact I had made came to my mind with terrible force ...” — Frederick Manley, “The Ghost of the Cross-Roads”“By the fireplace there was a large hideous pool of blood soaking into the carpet, and leaving ghastly stains around. I am not ashamed to confess that my brain reeled; the mysterious horror overcame me ...” — Lillie Harris, “19, Great Hanover Street”“A fearful white face comes to me; a horrible mask, with features drawn as in agony—ghastly, pale, hideous! Death or approaching death, violent death, written in every line. Every feature distorted. Eyes starting from the head. Thin lips moving and working—lips that are cursing, although I hear no sound.” — Hugh Conway, “A Dead Man’s Face”Contents:Frederick Manley, “The Ghost of the Cross-Roads” • Lillie Harris, “19, Great Hanover Street” • G. B. Burgin, “Sir Hugo’s Prayer” • Mrs. J. H. Riddell, “Walnut-Tree House” • Anonymous, “Haunted Ashchurch” • Anonymous, “The Haunted Tree” • Hugh Conway, “A Dead Man’s Face” • L. F. Austin, “The Ghost’s Double” • E. H. Rebton, “The Haunted Manor” • J. E. Thomas, “The Nameless Village” • Anonymous, “Old Simons’ Ghost!” • J. W. Hollingsworth, “Miriam’s Ghost” • Lucy Farmer, “The Vicar’s Ghost” • Mrs. Henry Wood, “The Ghost of the Hollow Field” • Alice Mary Vince, “The Wicked Editor’s Christmas Dream” • Anonymous, “The Barber’s Ghost” • Andrew Haggard, “A Spirit Bride” • W. L. Blackley, “The Haunted Oven” • Lilian Quiller Couch, “The Devil’s Own” • Anonymous, “A Christmas Ghost Story”",
  "genres": [
    "Horror",
    "Short Stories",
    "Christmas",
    "Classics",
    "Gothic",
    "Ghost Stories",
    "Fiction"
  ],
  "author": "Simon Stern",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/42436228-the-valancourt-book-of-victorian-christmas-ghost-stories"
}