{
  "title": "Presidential Command: Power, Leadership, and the Making of Foreign Policy from Richard Nixon to George W. Bush",
  "description": "A revelatory account from a Washington insider of how modern presidents have succeeded—and failed—in making foreign policy. An important contribution in the wake of recent American experiences abroad, and an essential book for the new administration, here is a fascinating, in-depth look at what actually happens in the Oval Office from a respected expert who has held high-level positions in several governments.Illuminating the qualities of personal leadership—character, focus, determination, persuasiveness, and consistency—that determine a president’s ability to guide his staff, Peter W. Rodman makes clear how these qualities shape policy and determine how this policy is implemented. With telling anecdotes and trenchant analysis, he reminds us of the importance of a president’s vision for the world and of his ability to make this vision a reality.Rodman’s tour through the past forty years recounts both high points and dismal lows. He shows how Nixon’s deep knowledge of the world combined with his personal paranoia to produce great victories (China) and deep failures (the demoralization of State and other departments). He demonstrates how Carter suffered from his own indecisiveness, and how Reagan’s determined focus in dealing with the Soviets contrasted with his lack of attention to the Middle East, which helped lead to the disastrous events in Beirut. And, finally, he illustrates how George W. Bush put too much stock in bureaucratic consensus and, until the surge, failed to push hard enough for new strategies in Iraq.Rodman offers an original and telling survey of modern presidential policy-making, challenging many conventional accounts of events as well as many standard remedies. This is a vivid story of larger-than-life Washington personalities in action, an invaluable guide for our new president, and a deeply insightful primer on executive leadership.",
  "genres": [
    "Politics",
    "History",
    "American History",
    "Nonfiction",
    "Leadership",
    "Government"
  ],
  "author": "Peter W. Rodman",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/4246977-presidential-command"
}