{
  "title": "Infernal",
  "description": "Praise for Cheryl Low's INFERNAL! \"A shipwreck on a haunted island…creepy, suspenseful, and chilling! A real page-turner of blood, guts, and ghouls.\"—Sèphera Girón, author of Captured Souls\"INFERNAL is an exciting horror story with a terrifying twist!\"—Amber Fallon, author of Terminal and The Warblers\"That burning Lovecraftian quest for knowledge, that incendiary drive that propels Science, Religion, and Metaphysics, impels a diverse group of adventurers to explore an island and an ocean avoided by indigenous mainlanders. What they discover is marine and island life amazing in size and nature; but they also discover the converse of the Lovecraftian the Knowledge we uncover may drive us to Madness.\"—The Haunted Reading Room\"Sustained suspense and masterful writing guide the reader through a very dark adventure. Stakes are raised, shocks are bloody, and the horror chilling. The cumulative effect is absolutely apocalyptic.\"—Stuart R. West, author of Ghosts of Gannawayand Twisted Tales from Tornado AlleyShrouded in Mystery The locals call it Isla de los Perdidos.Island of the Lost.According to the legends, those who venture onto the shores of this cursed island never return.Abandoned Valarie DeNola and her sister Julie have chosen to ignore the legends and the warnings. They have been selected to lead a team of explorers to the island to discover the mystery surrounding it. But once ashore, they become cut off from the outside world, and what they discover is something they could never have prepared for.Inhabited by Death Now they must fight against an unknown presence that is picking them off one by one. No one can be trusted, and when even nature rises up against them, all seems lost. Their one hope is the extraction team they know is coming.But will any of them survive to see it arrive?",
  "genres": [
    "Horror"
  ],
  "author": "Cheryl Low",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/42508758-infernal"
}