{
  "title": "Hold On Tight",
  "description": "Jackson Koch had already lost his wife to cancer when the town's coal mines shut down and his job was gone too. So, with a three-year-old daughter to care for and a broken heart to mend, he moved across the country to find a new life in Bridgeport, Ohio. Now he tends bar by night and tries to navigate life as a single dad by day. Luckily, his neighbor is happy to babysit while he works late nights. She's great with little Kate, beautiful, kind ... and lately he's found himself smiling whenever he thinks about her. Dani Brown also knows what it's like to lose a spouse and raise a child on her own. Cleaning houses during the day, and taking online classes at night, she dreams of running her own preschool someday. And, since her fourteen-year-old son Jeremy's baseball team requires a lot of money, she's thrilled to earn some extra cash by watching her handsome neighbor's adorable little girl. But even with two jobs, she's having trouble making ends meet. When Jackson sees Dani running herself ragged for her son's baseball ambitions he decides it's time to get the Bridgeport Social Club involved. Together they cook up a plan. They will run a charity poker tournament to support Jeremy's dream and help out a hardworking single mom. But will Dani be able to accept help from the handsome neighbor she's starting to feel more-than-friendly feelings for? And how far is she ready to let those feelings go? Get ready to fall in love with Shelley Shepard Gray's Bridgeport Social Club again, where a poker night is so much more than a game of cards and an extraordinary community of ordinary men and women come together to offer love, light, and hope to everyone they encounter.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Christian Fiction",
    "Audiobook",
    "Christian Romance",
    "Christian"
  ],
  "author": "Shelley Shepard Gray",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/42454415-hold-on-tight"
}