{
  "title": "Tonight I Said Goodbye",
  "description": "A remarkable debut mystery from the award-winning author of the 2003 St. Martin's Press/Private Eye Writers of America Prize for Best First Private Eye Novel.Michael Koryta's Tonight I Said Goodbye marks the emergence of a stunning new voice in crime fiction. With its edge-of-your-seat pacing, finely drawn characters, and rock-solid prose, Tonight I Said Goodbye would seem to be the work of a grizzled pro; the fact that the author is just twenty-one years old makes it all the more amazing.Investigator Wayne Weston is found dead of an apparent suicide in his home in an upscale Cleveland suburb, and his wife and six-year-old daughter are missing. Weston's father insists that private investigators Lincoln Perry and Joe Pritchard take the case to exonerate his son and find his granddaughter and daughter-in-law. As they begin to work they discover there is much more to the situation than has been described in the prevalent media reports. There are rumors of gambling debts and extortion, and a group of Russians with ties to organized crime who don't appreciate being investigated--a point they make clear with baseball bats.With some assistance from newspaper reporter Amy Ambrose, Perry and Pritchard believe they are making swift progress. But then they are warned off the investigation by a millionaire real estate tycoon and the FBI. Just when they feel they are closing in on a possible source of answers, another murder forces them to change direction in the case.Perry travels to a resort town in South Carolina and there he finds more than one game being played, and all of them are deadly. The stakes quickly become very personal for Perry, and it's clear that there will be no walking away from this case.In a debut that has already garnered praise from some of today's top writers, Michael Koryta immediately establishes himself as a standard bearer for the next generation of crime writers.Tonight I Said Goodbye is a 2005 Edgar Award Nominee for Best First Novel.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Suspense",
    "Audiobook"
  ],
  "author": "Michael Koryta",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/424644.Tonight_I_Said_Goodbye"
}