{
  "title": "Saint Unshamed: A Gay Mormon's Life: Healing from the Shame of Religion, Rape, Conversion Therapy & Cancer",
  "description": "The first paragraph of Kerry Ashton's memoir explains a \" I told this story once as fiction in the 1980s, but this time I tell the truth. I even tell the truth, in #MeToo fashion, about being violently raped by another man when I was 18, with a knife held to my throat--a secret I kept from everyone, including myself, for over 40 years. The rape, like other experiences I endured while a student at Brigham Young University, where I came out in the early 1970s, had a profound impact on my later life. But this story is not so much about my rape or my coming of age at BYU, as it is about the lifelong effects of shame itself, not only about how I internalized and inherited a wounding shame from my Mormon upbringing, but also how I eventually unshamed myself. It is about a lifetime journey of spiritual growth, self-discovery and healing, including many miraculous events along the way that pushed me forward through the darkness toward the light.\" Telling about his experiences during his four years at BYU--the rape, falling in love for the first time, police surveillance, harassment and arrest, while enduring three years of conversion therapy, including two years of electroshock treatments--provide the structure of Kerry Ashton's memoir. But intermittently he shares memories from growing up Mormon in Pocatello, Idaho, and from his adulthood. In one episode, the author talks about his mother's passing, and how he unconsciously blamed himself for her death. In others, Kerry describes some of the battles with his religious father, and how he and his Dad eventually came to forgive each other. These stories, like many others shared in the book, are poignant. Some--like the description that Kerry provides of his rape--are sexually graphic. Some stories are hilarious. And some are dramatic, like those dealing with the domestic violence Kerry endured as a child. The author also shares memories from his professional career as an actor and writer, both in L.A. and NYC, describing his personal encounters with stars like Barbra Streisand, Elizabeth Taylor, Bette Davis and Julie Harris, while sharing his experiences with famed writers Tennessee Williams, James Leo Herlihy (author of MIDNIGHT COWBOY), and John Rechy (author of THE SEXUAL OUTLAW), as well as his brief but profound affair with Steven Sondheim. Lastly, the author talks about the 12 years he spent in therapy, about his 16-year battle with a rare and disabling cancer only recently won, and about his sexual journey that led him through S&M, kinky sex, and the leather scene, to the loving monogamous relationship he now enjoys. All of the stories that Ashton shares from his life deal with shame, either in how the author internalized shame and turned it against himself, or how he later rid himself of most of it to become a SAINT UNSHAMED.",
  "genres": [],
  "author": "Kerry   Ashton",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/42506111-saint-unshamed"
}