{
  "title": "Leaving the Witness: Exiting a Religion and Finding a Life",
  "description": "A riveting memoir of losing faith and finding freedom while a covert missionary in one of the world's most restrictive countries.A third-generation Jehovah's Witness, Amber Scorah had devoted her life to sounding God's warning of impending Armageddon. She volunteered to take the message to China, where the preaching she did was illegal and could result in her expulsion or worse. Here, she had some distance from her community for the first time. Immersion in a foreign language and culture--and a whole new way of thinking--turned her world upside down, and eventually led her to lose all that she had been sure was true.As a proselytizer in Shanghai, using fake names and secret codes to evade the authorities' notice, Scorah discreetly looked for targets in public parks and stores. To support herself, she found work at a Chinese language learning podcast, hiding her real purpose from her coworkers. Now with a creative outlet, getting to know worldly people for the first time, she began to understand that there were other ways of seeing the world and living a fulfilling life. When one of these relationships became an \"escape hatch,\" Scorah's loss of faith culminated in her own personal apocalypse, the only kind of ending possible for a Jehovah's Witness.Shunned by family and friends as an apostate, Scorah was alone in Shanghai and thrown into a world she had only known from the periphery--with no education or support system. A coming of age story of a woman already in her thirties, this unforgettable memoir examines what it's like to start one's life over again with an entirely new identity. It follows Scorah to New York City, where a personal tragedy forces her to look for new ways to find meaning in the absence of religion. With compelling, spare prose, Leaving the Witness traces the bittersweet process of starting over, when everything one's life was built around is gone.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Religion",
    "Audiobook",
    "Biography",
    "Cults",
    "Biography Memoir"
  ],
  "author": "Amber Scorah",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/42506310-leaving-the-witness"
}