{
  "title": "Rare Breed: A Guide to Success for the Defiant, Dangerous, and Different",
  "description": "An unconventional business book for the rebels and misfits—the Rare Breeds—who don’t fit the traditional mold, offering an approach that’s anything but business as usual.What if your biggest weaknesses are actually your greatest strengths?Sunny Bonnell and Ashleigh Hansberger, award-winning brand consultants and founders of Motto, bring their wisdom and insights to this radical “outside the box” business guide written specifically for the mavericks, oddballs, and visionaries they call Rare Breeds. While most advice guides encourage you to change your inherent characteristics to get the job, get the promotion, get the client, Bonnell and Hansberger identify a different approach: instead of trying to conform, march to the beat of your own drum. By following your own path, you’ll find your success.They know this approach works based on their own experience. When these iconoclastic thinkers behind the company acclaimed by the Chicago Tribune and Forbes started their company, they didn’t follow the rules of most leadership books and business school courses. “Instead of doing everything people told us we should be doing—be transactional, be conservative, be nice—we did the opposite. Instead of burying our innate vices—obsessive perfectionism, rebelliousness, weirdness—we made them our selling points.” The result: a flourishing company that is the model for an entirely new approach to success.Rare Breeds don’t get what they want by adapting to the conventional rules: instead, they use the traits often considered shortcomings as tools for creation and growth. Combining examples and practical tools, Bonnell and Hansberger identify seven vices-turned-virtues—Rebellious, Audacious, Obsessed, Hot-Blooded, Weird, Hypnotic, Emotional—to help disruptors and trailblazers discover their inner Rare Breed and tap into them to realize their full potential in work and life. An anti-Tools of Titans that rejects the 7 Habits of Highly Effective People approach, Rare Breeds is a rallying cry for all guerillas and nonconformists.",
  "genres": [
    "Nonfiction",
    "Business",
    "Self Help",
    "Personal Development",
    "Psychology",
    "Leadership",
    "Philosophy"
  ],
  "author": "Sunny Bonnell",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/42462424-rare-breed"
}