{
  "title": "Virtually Yours, Jonathan Newman",
  "description": "It's the future and the government is weak, the powerful are playing dirty, and life is no tea party. Nineteen years ago, the Freedom First Party swept Democrats and Republicans from power in an American election that shocked the world. Corporate libertarianism has dramatically transformed every facet of American government departments, regulations, and programs are gone - \"free\" markets rule. With medical care now beyond the reach of all but a fortunate few, musician Jonathan Newman must find a way to pay his gravely ill son’s hospital bills. In desperation he takes a sales job with QualLab, a global laboratory supply company that offers a generous compensation package. Once there, a web of wires, tubes, and sensors connect him to a table in a secluded cell where he works selling bio-laboratory tests made from human materials - his. Surprisingly, Jonathan turns out to be both a star salesman and an ideal bio-supplier, leading QualLab to begin a campaign to extend his contract. Locked in his tiny chamber, Jonathan is immersed in a thrilling virtual world – part of a clandestine effort to transfer his loyalty from family to Company. \"Virtually Yours, Jonathan Newman\" chronicles a tug-of-war between competing values. Across America, Freedom First has placed corporate power and radical individualism above the shared needs of the broader community, while isolated on his table, Jonathan is lured from all he has held dear and into the seductive self-centeredness and instant gratification of virtual life. It’s family and community against technology and greed, and the outcome is anything but certain. The novel explores the tension between the work we do and our other life priorities, forecasts what a lesser-government America might look like, and considers how the technologies infiltrating every aspect of our lives impact who we are. Over the years since it first appeared, it has proven to be alarmingly prescient.",
  "genres": [],
  "author": "Robert Rosell",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/12363210-virtually-yours-jonathan-newman"
}