{
  "title": "Strange Red Cow: and Other Curious Classified Ads from the Past",
  "description": "Came to my plantation, in Springfield township, Philadelphia county, near Flour-town, the 26th of March 1776, A STRANGE RED COW. The owner may have her again, on proving his property, and paying charges. PHILIP MILLER. —May 1, 1776, The Pennsylvania GazetteTo sift through classifieds from any era is to uncover the practical needs or urgent desires of a community during a particular period of time. By definition, the classified advertisement is released for public consumption, yet often it tells a very private a precious keepsake misplaced, an intimate relationship sought, even a young child kidnapped. At times shocking, often amusing, and always enlightening, these brief notices offer rare glimpses into who we are, what we value, and where we’re going. And yet they have always been the most ephemeral of artifacts, tossed and forgotten without a second thought. Until now.While researching a historical documentary, Sara Bader stumbled upon something that transported her back in an eighteenth-century classified ad about a lost red cow. Authentic and evocative, this discovery inspired a search for more of these vivid scenes from everyday life, past and present. In Strange Red Cow , Bader presents a sampling of ads from as far back as 1704 up through contemporary Internet postings, sorted and assembled thematically. She places these micro messages in a broader context, revealing intimate stories of American history and popular culture.By turns humorous, heartbreaking, and insightful, Strange Red Cow offers a new lens through which to observe our evolution as a nation and a people.From America’s first newspaper classified in 1704 to today’s online postings, Strange Red Cow captures, in colorful detail, scenes of everyday life in the first-ever overview of the nation’s unofficial history the classified ads.“If we strain to identify with those who commuted in horse-drawn carriages and depended on candles to light their corridors, these ads can personally introduce us. They had good days and bad days; they got distracted, disorganized, and like us, left important things be-hind. That our collective ancestors forgot their books in carriages, left their capes on battlefields, and dropped their keys and their cash is oddly reassuring. We are still losing our stuff today, though what we own and wear and carry with us—and what we decide to return and retrieve—inevitably changes over time.” —From Strange Red Cow",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Sara Bader",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/424606.Strange_Red_Cow"
}