{
  "title": "Sidhe's Call",
  "description": "“What do you think it’s like for them… as in… death?” “Death?” The word slithered off the end of her tongue as if it was a filthy sock she held out with the tips of her fingernails. “They’re mortals, Morg.“ [. . .] ”Once you sing a soul to the Otherworld, you’ll see that keening is an important task, but not one with which we should become emotionally involved.” Bound by duty, sixteen-year-old Morgan must begin forewarning human deaths. After all, that’s her job as a newly-appointed Ban Sidhe (banshee), a death caller. Conflicted when the Inner Ring—the elite group of ruling Sidhe—assigns a fifteen-year-old boy, Aidan Tanner, as her first death to keen on her road to adulthood, Morgan must make a critical decision. Will she help end such a young life or follow her instincts and refuse to make the call? And if that isn’t difficult enough, Morgan’s help is needed as the Sidhe and human worlds are about to face a crisis foretold in the Thousand-Year Sidhe Prophecy. With the lingering pain of her mother’s absence and the mystery of her father’s recent disapperarnce, the young Ban Sidhe feels lost. Aided only by her overly-critical twin sisters and an accentric seer, Morgan must confront her weaknesses and make the hardest decision of her life. Alone. Aidan, on the other hand, is a seemingly average human teen who has to deal with his parents’ inexplicable red-eye drive from the Salt Lake Valley to Northern Idaho. While being away from his friends for Spring Break seems like torture enough, it is the recent discovery of his father’s secret that leaves him troubled. While struggling to keep his anger in check, Aidan finds that no matter how hard he tries to hold himself together, his once-simple life is splitting apart. But the more he discovers about his father’s family and history, the quicker he comes to understand that appearances are deceiving. Beyond that, Aidan doesn’t realize that a young Ban Sidhe is seeking to call his death.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Christy G. Thomas",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/12363749-sidhe-s-call"
}