{
  "title": "Dating by the Book",
  "description": "Is love just something you find in books? Six months ago, writer and bookstore owner Maddie Hanson was left at the altar. Since then, she’s had zero interest in romance—despite the fact that she runs a book club full of sexy eligible bachelors. But when her latest novel is panned by an anonymous blogger who goes by the name Silver Fox—and who accuses her of knowing nothing about passion—she decides to prove her nemesis wrong by seeking a romance hero in real life . . .   There’s the smoldering rock musician, the bookish college professor, and her competitive childhood friend who may want to steal her bookstore more than her heart. Even Silver Fox is getting in on the action, sending Maddie alarmingly—and intoxicatingly—flirtatious emails. And that’s not all. Her ex wants her back.   Now Maddie is about to discover that like any good story, life has twists and turns, and love can happen when you least expect it—with the person you least expect . . . “Romance junkies will get a kick out of this fun, self-referential spin on just about every trope in the book.”--Kirkus Reviews\"A uniquely clever exploration of love, literature, and self-discovery, DATING BY THE BOOK is an unexpected, refreshing read.\" —Robinne Lee, author of The Idea of YouPraise for Mary Ann Marlowe’s Some Kind of Magic “Marlowe makes a name for herself in this hilarious and sexy debut.” \n—Booklist\n “Frisky, Flirty Fun!” —Stephanie Evanovich, New York Times bestselling author of The Total Package “Fun, romantic and sexy. . . . This love story will make readers smile!” \n—RT Book Reviews\n “Sexy, engaging and original. . . . An amazing first novel.”  —Sydney Landon, New York Times bestselling author of Wishing for Us",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Adult",
    "Slow Burn"
  ],
  "author": "Mary Ann Marlowe",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/42517000-dating-by-the-book"
}