{
  "title": "The Coilhunter Chronicles - Omnibus Books 1-3",
  "description": "COILHUNTER Welcome to the Wild North, a desolate wasteland where criminals go to hide—if they can outlast the drought and the dangers of the desert. Or the dangers of something else. Meet Nox, the Coilhunter. A mechanic and toymaker by trade, a bounty hunter by circumstance. He isn't in it for the money. He's in it for justice, and there's a lot of justice that needs to be paid. Between each kill, he's looking for someone who has kept out of his crosshairs for quite a while—the person who murdered his wife and children. The trail has long gone cold, but there are changes happening, the kind of changes that uncover footprints and spent bullet casings. Plagued by nightmares, he's made himself into a living one, the kind the criminals and conmen fear. So, welcome, fair folk, to the Wild North. If the land doesn't get you, the Coilhunter will. RUSTKILLER Welcome to the Rust Valley. The Wild North is full of nasty places, but there are some places you just don’t go. One of them is that scrapyard desert known as the Rust Valley. It’s where vehicles go to die. That’s why you don’t go in after them. The bounty hunter Nox made a promise to himself that he’d never be caught dead there. Yet, when a couple of kids end up wandering inside that metal maze, he finds himself with no other choice. He decks himself out in his finest armour. He’ll need it. That land is where the rust-covered Clockwork Commune live, and if they don’t scavenge the metal off you, they’ll scavenge the flesh instead. Nox is used to being called the Coilhunter, but this time he’s saddling up with a new, more fitting the Rustkiller. DUSTRUNNER Nox is a wanted man. While searching for a criminal, the fabled Coilhunter wanders into a tribal village massacre. He didn’t do it, but that doesn’t matter. The clues point to him, and he’s made a lot of enemies over the years. Many would happily see the tables turned. His pleas of innocence fall on deaf ears. No sooner does he try to find the real killers than posters go up across the Wild North—posters with his face and his name. He isn’t the only bounty hunter out there. Dozens assemble to cash him in. Tasked with finding out who’s framed him, Nox must also survive the constant onslaught of frontier law. He’s used to hunting others. He’s not so used to life on the run. For more tales in the same world, check out the discounted Great Iron War series.",
  "genres": [
    "Fantasy",
    "Westerns",
    "Steampunk",
    "Fiction"
  ],
  "author": "Dean F. Wilson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/42516248-the-coilhunter-chronicles---omnibus-books-1-3"
}