{
  "title": "The Invention of Morel and Other Stories",
  "description": "When The Invention of Morel was first published in Argentina, Jorge Luis Borges rejoiced that the author had brought \"a new genre to our land and language.\" This fine translation of Adolfo Bioy Casares' novella demonstrates that it is equally unique when transformed into English. The Invention of Morel won for its author in 1941 the Primer Premio Municipal Award in Buenos Aires. It is joined in this volume by six equally arresting short stories originally published together in a book entitled La trama celeste.The Invention of Morel is the offspring of a fantastic, sometimes perverse, always persuasive imagination. Borges, perhaps Argentina's greatest writer, says in his Prologue to the story that its plot is of such superior quality that \"to classify it as perfect is neither an imprecision nor a hyperbole.\"Bioy Casares' indisputable originality, so apparent in the novella, is equally evident in the six short stories, all of which have a strong affinity with The invention. Each story is an achievement of realism with curious surrealist overtones. In each, as in the novella, the author employs suspense delicately and with mounting tension. In style, narrative technique, and off-beat imaginative insight, they coalesce to make a book which is bound to have a powerful unified impact on the reader.The translator, Ruth L. C. Simms, has traveled extensively in South America and is well acquainted with Spanish and Latin American literature; her sensitive use of the English language has enabled her to transfer these unusual stories into English with their unique qualities unimpaired.This volume is enhanced by drawings by Norah Borges de Torre, sister of Jorge Luis Borges.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Literature",
    "Speculative Fiction",
    "Science Fiction",
    "Latin American",
    "Fantasy"
  ],
  "author": "Adolfo Bioy Casares",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/4253916-the-invention-of-morel-and-other-stories"
}