{
  "title": "Parkcrest View The Love Chronicles - Volume 2",
  "description": "Read- Volume 1 Free! Download on the ParkCrest View website or on Smashwords! pkcview (dot ) com or smashwords (dot)comStep into the view! Grab the total bundle with volumes 1-5 !Readers please This is a Novella of approximately 18,690 words. If you don't enjoy shorter reads...you may want to pass this by!Keep up with the lives of the residents and friends of the ParkCrest View ! Decisions will be made regarding friendships and love for these residents.Will Jazzlyn the beautiful African-American neighbor who seems to have it all finally meet a guy worthy of her trust? When will Tyson the sexy green-eyed ,white not light......newest resident decide to freely welcome new associations into his inner circles? In a circle of close knot friends who gets to \" keep\" the mutual friends.Enjoy the ParkCrest View Novelettes. Volume 2 in a continuing series! The perfect quick reads.Extended Sample Reads of all 3 novelettes are available at : pkcview.com/ . The Official ParkCrest View - The Love Chronicles CommunityParkCrest View Vol.2 Cast Quotes\" What the hell did she just say ? Meet Darien for drinks ? This shit can not be happening. What the hell happened to the damn white dude ! No wonder Darien hasn't returned any of my phone calls today \"- Trevonne\" You know what Trevonne you on some real dumb shit right now !\" Sherica said \" Now I love you like a little sister.....My DUMB little sister.\" - Sherica\" I aint trying to say sh** Tre....I'm saying it. Let's keep it funky. We're amongst friends here. Well except Kita and if she's cool with Sherica she's cool by me . You know damn well you stay with a di** on reserve....Even when the di** don't belong to you! So who you f**king heffa?\"- JazzlynYour ass standing there quick to throw dirt on my character but you the one wasted four years of your life with a man who wasn't sh** ! Let's keep it real baby. Dude wasn't sh** before you found out he was f***ing your best friend\" - Tyson",
  "genres": [],
  "author": "Candace Mumford",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12363705-parkcrest-view-the-love-chronicles---volume-2"
}