{
  "title": "Now Entering Addamsville",
  "description": "Stranger Things meets Buffy the Vampire Slayer in this contemporary novel from the acclaimed author of Eliza and Her Monsters. When Zora Novak is framed for a crime she didn’t commit, she must track down the true culprit and clear her name before it’s too late. But in a small town obsessed with ghosts, getting people to believe the truth might prove to be impossible. Fans of Riverdale and Maureen Johnson’s Truly Devious will devour this eerie murder mystery. Features spot art and a map by the author.Zora Novak has been framed.When someone burns down the home of the school janitor and he dies in the blaze, everyone in Addamsville, Indiana, points a finger at Zora. Never mind that Zora has been on the straight and narrow since her father was thrown in jail. With everyone looking for evidence against her, her only choice is to uncover the identity of the real killer. There’s one big problem—Zora has no leads. No one does. Addamsville has a history of tragedy, and thirty years ago a similar string of fires left several townspeople dead. The arsonist was never caught.Now, Zora must team up with her cousin Artemis—an annoying self-proclaimed Addamsville historian—to clear her name. But with a popular ghost-hunting television show riling up the townspeople, almost no support from her family and friends, and rumors spinning out of control, things aren’t looking good. Zora will have to read between the lines of Addamsville’s ghost stories before she becomes one herself.Acclaimed author Francesca Zappia has a perfectly pitched teen voice that shines in this inventive novel. With a compelling cast of memorable characters, a vivid small-town setting, and elements of a classic whodunit, Now Entering Addamvsille is perfect for fans of Brittany Cavallaro, Victoria Schwab, and The Chilling Adventures of Sabrina. Includes interior spot illustrations from the author.",
  "genres": [
    "Young Adult",
    "Mystery",
    "Paranormal",
    "Fantasy",
    "Contemporary",
    "Horror",
    "Thriller"
  ],
  "author": "Francesca Zappia",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/42519323-now-entering-addamsville"
}