{
  "title": "Druidess",
  "description": "Horrific tales of witchery, necromancy, ghosts, and murder. Joni thought these were myths, preserved by her ancestors in their journals... until the Caplata returned from the grave...We cannot build the future by avenging the past... It is generally the trustful and optimistic people who can afford to retreat. The loveless and faithless ones are compelled by their pessimism to attack.- T.H. White, The Once and Future KingJoni had always been fascinated by the history of her family’s old, antebellum plantation. Her ancestor’s journals were filled with stories, many involving two slave girls, the older of whom was deeply involved in the \"red magic\" of the Bokors. When Messalina returns from the grave on a quest of vengeance, Joni must confront the wickedness of her own family’s past, while also embracing a truth even more ancient—that she is descended from a line of Druids. Joni is the only one who stands between Messalina and her insidious plans. Druidess introduces a new, modern fantasy series, that takes readers on a thrilling journey into the world of Celtic and Native American mythology, Voodoo, and an eternal realm where all magic—good and evil alike—has its origins. Druidess is filled with shocking plot twists, compelling characters, and features a strong female hero. If you liked the way Anne Rice’s Mayfair witches encountered historic evils in The Witching Hour , enjoy stories of ancient demons, mythical characters, wizards, and even zombies then you’ll love Monroe’s debut contemporary fantasy. With a touch of horror, and a compelling journey of discovery into the world of Druid magic, Monroe’s Druidess is sure to keep readers enthralled from start to finish. Pick up Theophilus Monroe’s Druidess today, brew a pot of coffee, and settle in for a long night of reading—you won’t be able to put it down!",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Young Adult"
  ],
  "author": "Theophilus Monroe",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/42514635-druidess"
}