{
  "title": "Black Sunday",
  "description": "Simultaneously unique and universal (NPR), this fiercely original debut novel follows the fate of four siblings over the course of two decades in Nigeria as they search for agency, love, and meaning in a society rife with hypocrisy.\"I like the idea of a god who knows what it's like to be a twin. To have no memory of ever being alone.\"Twin sisters Bibike and Ariyike are enjoying a relatively comfortable life in Lagos in 1996. Then their mother loses her job due to political strife, and the family, facing poverty, becomes drawn into the New Church, an institution led by a charismatic pastor who is not shy about worshipping earthly wealth.Soon Bibike and Ariyike's father wagers the family home on a \"sure bet\" that evaporates like smoke. As their parents' marriage collapses in the aftermath of this gamble, the twin sisters and their two younger siblings, Andrew and Peter, are thrust into the reluctant care of their traditional Yoruba grandmother. Inseparable while they had their parents to care for them, the twins' paths diverge once the household shatters. Each girl is left to locate, guard, and hone her own fragile source of power.Written with astonishing intimacy and wry attention to the fickleness of fate, Tola Rotimi Abraham's Black Sunday takes us into the chaotic heart of family life, tracing a line from the euphoria of kinship to the devastation of estrangement. In the process, it joyfully tells a tale of grace and connection in the midst of daily oppression and the constant incursions of an unremitting patriarchy. This is a novel about two young women slowly finding, over twenty years, in a place rife with hypocrisy but also endless life and love, their own distinct methods of resistance and paths to independence.",
  "genres": [
    "Fiction",
    "Africa",
    "Historical Fiction",
    "Nigeria",
    "Contemporary",
    "Literary Fiction",
    "Audiobook"
  ],
  "author": "Tola Rotimi Abraham",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/42515198-black-sunday"
}