{
  "title": "The Serpent's Mate",
  "description": "When Cass is abducted by aliens and sold to an alien pirate queen who collects female slaves to harvest their pheromones, her first experience with extra-terrestrials quickly turns from surreal into a nightmare, which only grows more terrifying when an alien with a snake-like lower body and a surprisingly handsome face comes to her rescue. But Cass isn't sure she's actually safe with him, because he looks at her with hunger in his eyes. \nNahash has always been a loyal, honourable Iriduan soldier. After distinguishing himself above his peers, the genetically-enhanced warrior volunteered for an experimental program to create a hybrid with powerful psionic abilities, using DNA taken from a giant serpent that decimated one of their outer colonies. Though his body changed into a form beyond the scientists' expectations, his mind became a weapon that could alter the very course of Iriduan civilization, perhaps even saving it from its inevitable ruin. \nAfter such drastic alterations to his biology, scientists told him he was free from the affliction that caused Iriduan males to imprint on a single female, bonding him to her for life. The last thing he expects is to bond instantly to a human female he rescues during a raid on a pirate colony. Now, he's stuck with her, because if he isn't exposed to his mate's scent on a regular basis, he will die. The fact that his body craves her as much as it needs her fills him with resentment, but when he realizes that the Iriduan Empire will do anything to keep her under their control because of what she means to him, he doesn't hesitate to protect his mate - even if it means betraying his people. \nThe rogue test subject and the abducted human make a desperate escape from the Iriduan Empire, but the galaxy proves to be a dangerous place and there are worse things than the Iriduans waiting in the darkness of space. With no one to rely on except for each other, Nahash and Cass might not live long enough to find a home where they can settle down and explore the love that grows between them - love that takes them beyond their physical bond. \nAuthor's Note: 18+ Contains steamy scenes between a human heroine and a very alien hero.",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction",
    "Erotica",
    "Science Fiction Romance",
    "Fantasy",
    "Monsters"
  ],
  "author": "Susan Trombley",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/42585327-the-serpent-s-mate"
}