{
  "title": "Raised in Captivity: Fictional Nonfiction",
  "description": "Microdoses of the straight dope, stories so true they had to be wrapped in fiction for our own protection, from the best-selling author of But What if We're Wrong?A man flying first class discovers a puma in the lavatory. A new coach of a small-town Oklahoma high school football team installs an offense comprised of only one, very special, play. A man explains to the police why he told the employee of his local bodega that his colleague looked like the lead singer of Depeche Mode, a statement that may or may not have led in some way to a violent crime. A college professor discusses with his friend his difficulties with the new generation of students. An obscure power pop band wrestles with its new-found fame when its song \"Blizzard of Summer\" becomes an anthem for white supremacists. A couple considers getting a medical procedure that will transfer the pain of childbirth from the woman to her husband. A woman interviews a hit man about killing her husband but is shocked by the method he proposes. A man is recruited to join a secret government research team investigating why coin flips are no longer exactly 50/50. A man sees a whale struck by lightning, and knows that everything about his life has to change. A lawyer grapples with the unintended side effects of a veterinarian's rabies vaccination.Fair warning: Raised in Captivity does not slot into a smooth preexisting groove. If Saul Steinberg and Italo Calvino had adopted a child from a Romanian orphanage and raised him on Gary Larsen and Thomas Bernhard, he would still be nothing like Chuck Klosterman. They might be good company, though. Funny, wise and weird in equal measure, Raised in Captivity bids fair to be one of the most original and exciting story collections in recent memory, a fever graph of our deepest unvoiced hopes, fears and preoccupations. Ceaselessly inventive, hostile to corniness in all its forms, and mean only to the things that really deserve it, it marks a cosmic leap forward for one of our most consistently interesting writers.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Humor",
    "Audiobook",
    "Contemporary",
    "Essays",
    "Pop Culture"
  ],
  "author": "Chuck Klosterman",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/42585299-raised-in-captivity"
}