{
  "title": "The Golden Key to Discovering Yourself",
  "description": "About This BookFrom the earliest times in human history, across various cultures and civilisations, uniqueness and individuality of each person has been at the centre of health and wellbeing. This concept, called temperament, is found in all healthcare traditions and has been used and applied universally throughout history.The aim of this book is to provide 'The Golden Key' to help unlock the hidden treasures within each of us as individuals. We will be reconnecting with the lost wisdom and knowledge of humanity, our heritage which stretches over the last five millennia. Understanding our own unique, individual temperament will facilitate us to tune into the vast treasures of knowledge within the healthcare traditions of Africa, China, India, Europe and Arabia. This reconnection with sacred knowledge, together with the accumulated experience of humanity, brings us towards wholeness and balance. Understanding temperament helps us to make sense of all of the available information and data, which is meaningless without this framework. This helps us to achieve higher health, wellbeing and enlightenment.About The AuthorHakim M. Salim Khan has practised Tibb: Whole-Person Healthcare & Medicine since 1978. His teachers and inspirations in Tibb include Shabeer Hussain Sahib (ra), Moulana Nisaar Ahmed (ra) and Hakim Nabi Khan Sahib (ra). He trained in herbal medicine and osteopathy with the General Council and Register of Consultant Medical Herbalists (now IRCH). He studied iridology and nutrition with Dr. B. C. Jensen and Farida Sharan. Later, he taught nutrition and iridology at the School of Iridology and Wholistic Healing, Cambridge, England.Hakim Salim is president of: International Register for Consultant Medical Herbalists (IRCH), Guild of Naturopathic Iridologists International (GNI) and International Association of Natural Medicine (IANM). He is a trustee of the World Unani Foundation (WUF). He is the director of Mohsin Health based in Leicester, UK. He is Principal of the College of Medicine and Healing Arts (CoMHA).",
  "genres": [],
  "author": "M. Salim Khan",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/42586063-the-golden-key-to-discovering-yourself"
}