{
  "title": "Come Love a Stranger",
  "description": "Alternate cover and format for Come Love a Stranger by Kathleen E. Woodiwiss - ISBN#:0-380-89300-2 [0380893002] Handsome riverboat captain Ashton Wingate is startled when a cloaked figure on horseback hurtles out of the night, collides with his coach, and is stricken unconscious. Ashton rushes to aid the victim and, when he draws back the hood, is stunned to find it is Lierin, his young wife who had been presumed dead after she was flung overboard during a pirate attack three years before. Joyously he carried her home to his family's Mississippi plantation, only to discover her most alarming injury: the complete loss of her memory.Under Ashton's gentle care her body regains its strength, but her mind remains confused and unsure of her identity. If she truly is Lierin, then where had she been those three long years of Ashton's mourning? How did she come to be riding in the night, wearing only a scanty nightgown under her cloak? And, even more upsetting, did her sudden appearance have anything to do with the nearby insane asylum that went up in flames just minutes before her collision with Ashton? Gradually her doubts melt in the warmth of his commanding embrace and, by now completely in love with him, she accepts Ashton as her husband. But her newfound contentment is shattered when a tall, sandy-haired stranger stalks up to Ashton during a party at the plantation and claims the stunning woman as his kidnapped wife! Malcolm Sinclair insists that she is Lenore, Lierin's twin sister. Moreover, he can prove it, and will kill to regain his own. In terror for Ashton's life, and dismayed that her own shadowy fragments of memory find Malcolm vaguely familiar, she reluctantly accompanies him to his secluded estate.The familiar surroundings awaken more fragmentary glimpses of the past, and she is horrified to recall scenes of dark passion and murder. She suddenly realizes that she is in terrible danger -- and so is her one true husband, the man her mind could not remember, but her heart could not forget.This bold new addition to Kathleen E. Woodiwiss' list of instant best sellers takes romance beyond the boundaries of passion - and into the realm of a woman's very soul.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Regency",
    "Mystery"
  ],
  "author": "Kathleen E. Woodiwiss",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/12364345-come-love-a-stranger"
}