{
  "title": "Eisenhower, Volume #1: Soldier, General of the Army, President-Elect, 1890-1952",
  "description": "Stephen E. Ambrose draws upon extensive sources, an unprecedented degree of scholarship, and numerous interviews with Dwight D. Eisenhower himself to offer the fullest, richest, and most objective rendering yet of the soldier who became president.At various times in his life, Eisenhower was a soldier at wartime, the Chief of Staff, patron to the North American Treaty Organization, president of Columbia University, and the Supreme Commander of the United States. However, he was also a father, son, husband, and friend. This deeply personal biography concerns itself less with the “life and times” of Eisenhower and more on the man himself, his achievements and triumphs, failures and concerns, as well as his relationships with those closest to him.A charismatic leader with a high degree of intelligence, integrity, tremendous energy and a commitment to basic principles that drew soldiers, civilians, and foreigners alike to him, Eisenhower was also ambitious, sensitive to criticism, and avid sportsman who was terribly loyal to his friends and family.Ultimately, Ambrose presents a masterful portrait of Eisenhower that finely delves into his personal life during his presidency, the onset of the Cold war, and as the leader of a rapidly evolving nation struggling with issues as diverse as civil rights, atomic weapons, and a new global role. Ambrose shows what an extraordinary person Eisenhower was and the extent to which many who live in freedom today owe to him. This superb interpretation of Eisenhower's life confirms Stephen Ambrose's position as one of the nation’s finest historians.",
  "genres": [
    "Biography",
    "History",
    "American History",
    "Presidents",
    "Nonfiction",
    "World War II",
    "Military History"
  ],
  "author": "Stephen E. Ambrose",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/42542.Eisenhower_Volume_1"
}