{
  "title": "Why They Marched: Untold Stories of the Women Who Fought for the Right to Vote",
  "description": "Looking beyond the national leadership of the suffrage movement, an acclaimed historian gives voice to the thousands of women from different backgrounds, races, and religions whose local passion and protest resounded throughout the land.For far too long, the history of how American women won the right to vote has been told as the tale of a few iconic leaders, all white and native-born. But Susan Ware uncovered a much broader and more diverse story waiting to be told. Why They Marched is a tribute to the many women who worked tirelessly in communities across the nation, out of the spotlight, protesting, petitioning, and insisting on their right to full citizenship.Ware tells her story through the lives of nineteen activists, most of whom have long been overlooked. We meet Mary Church Terrell, a multilingual African American woman; Rose Schneiderman, a labor activist building coalitions on New York’s Lower East Side; Claiborne Catlin, who toured the Massachusetts countryside on horseback to drum up support for the cause; Mary Johnston, an aristocratic novelist bucking the Southern ruling elite; Emmeline W. Wells, a Mormon woman in a polygamous marriage determined to make her voice heard; and others who helped harness a groundswell of popular support. We also see the many places where the suffrage movement unfolded—in church parlors, meeting rooms, and the halls of Congress, but also on college campuses and even at the top of Mount Rainier. Few corners of the United States were untouched by suffrage activism.Ware’s deeply moving stories provide a fresh account of one of the most significant moments of political mobilization in American history. The dramatic, often joyous experiences of these women resonate powerfully today, as a new generation of young women demands to be heard.",
  "genres": [
    "History",
    "Nonfiction",
    "Feminism",
    "Politics",
    "Historical",
    "American History",
    "Womens"
  ],
  "author": "Susan Ware",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/42585059-why-they-marched"
}