{
  "title": "How to Make Friends with Demons",
  "description": "William Heaney is a man well acquainted with demons. Not his broken family — his wife has left him for a celebrity chef, his snobbish teenaged son despises him, and his daughter's new boyfriend resembles Nosferatu — nor his drinking problem, nor his unfulfilling government job, but real demons. For demons are real, and William has identified one thousand five hundred and sixty-seven smoky figures, dwelling on the shadowy fringes of human life, influencing our decisions with their sweet and poisoned voices.After a series of seemingly unconnected personal encounters — with a beautiful and captivating woman met in the company of an infuriating poet, a troubled and damaged veteran of Desert Storm with demons of his own, and an old school acquaintance with whom he shared a mystical occult ritual — William Heaney's life is thrown into a direction he does not fully comprehend. Past and present collide. Long-dormant choices and forgotten deceptions surface. Secrets threaten to become exposed. To weather the changes, William Heaney must learn one how to make friends with demons.Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Horror",
    "Urban Fantasy",
    "Magical Realism",
    "Demons",
    "Literature"
  ],
  "author": "Graham Joyce",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/4254923-how-to-make-friends-with-demons"
}