{
  "title": "Ode to Odin",
  "description": "I saw a man of grand plan and action, friend and foe, angel and demon, dualistic in nature, representing life in all its facets, both good and bad and at the same time neither. A young British archaeologist makes a deal with the devil, the brilliant but dangerously unpredictable Odin. The two men forge a friendship on the anvil of the deserts of Central Asia as they embark on a search for the homeland of Zoroaster the Prophet, arguably the progenitor of monotheism. Their quest, to audaciously reach out for the cryptic origins of God, is an intellectual pursuit of the highest ambition. Yet no success is guaranteed in a land of violence and corruption, of unforgiving deserts, populated by vodka-soaked and acrimonious Russians, Turkomen, Uzbeks, Kazakhs, Tatars and Karakalpaks. The enterprise largely depends on the charisma and genius of Odin, charming and fierce, handsome and capricious, the embodiment of self-belief, a man who lives as a God even as he pursues the origins of religion. Working with Odin can be a dangerous occupation. A friendship with a man who lives as a deity is subject to the slightest whim. Ode to Odin captures something ineffable, something universal, something beyond time. The episodes in the desert bring an often-hidden part of the world into view: the people and customs of the region, unchanged for centuries, the ram-fights and vodka-drinking and dancing girls, the corrupt officials and the hangover of the Soviet Union still lingering over a land populated by the proud descendants of warrior-nomads. The tale also provides revealing insights into the realities of life on an archaeological expedition, the thrill of the intellectual chase, the excitement of ancient discovery, balanced by the hardships of living beneath the flails of an unforgiving desert sun.",
  "genres": [],
  "author": "Bruce McLaren",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/42609189-ode-to-odin"
}