{
  "title": "Till Death Do Us Part",
  "description": "Five years...It's been five years since the world's entire female population mysteriously changed into shambling, flesh-eating undead. For Esperanza Costales, that means coping with the loss of her mother, surviving in the Tennessee wilderness with her father and brother, and wondering whether or not she's the last living woman on Earth.Esperanza and her family have adapted and learned to count their blessings, but when a group of escaped convicts led by a crazed psychopath named Frankie stumble upon their camp and kidnap her and her father, her new life is thrown into chaos. By taking advantage of a late-night zombie attack, she barely escapes captivity and flees into the forest, alone.Injured, frightened, and separated from her family, Esperanza nearly loses hope until she encounters a group of four men. Jason, Derek, Roland, and Joseph have survived the world's end by putting aside old feelings and embracing their harsh new reality, but their routine is shattered when Esperanza enters their lives and brings into question everything they thought they knew about the Apocalypse.As Esperanza and the men learn more about one another and themselves, will they be able to form a bond strong enough to survive attacks by the undead and pursuit by Frankie's gang? Will Esperanza ever see her family again? And in a world full of zombies and psychos, will a woman and four men be able to find love through despair? This book is a Reverse Harem romance book. This means the main heroine will end up with multiple male partners. It is NOT traditional romance. Please be advised.TRIGGER -No- forced intercourse occurs in this book, but it does contain scenes of said nature which may be intense enough to cause a trigger response in sexual assault survivors.",
  "genres": [
    "Reverse Harem",
    "Zombies",
    "Romance",
    "Science Fiction",
    "Apocalyptic",
    "Post Apocalyptic"
  ],
  "author": "A.J.   Lee",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/42597916-till-death-do-us-part"
}