{
  "title": "Finding Peace",
  "description": "Til death do they part Tina Cooper is a young mom running from a dangerous past. With fresh scars, broken bones, and only the clothes on their backs, she and her daughter escape from a man who’d rather kill them than let them go.Taking refuge in a small town hidden by forest and mountains, they find themselves adopted by a loud and crazy family, and though Tina knows not to trust anyone, somehow, she and her daughter grow to love the amazing women who plant roots so deep in their hearts, it’s hard to consider running again.They’ll run one day. They must. But today isn’t that day.Today, she has a date with Sexy Store Guy and a bunch of lies to unravel before she trips up and puts her daughter at risk.⭐️⭐️⭐️⭐️⭐️Ok, it’s official. Aiden is my fav!!! I thought Jimmy was, but I just fell in love with Aiden!! Emilia does that to you. She makes you fall in love with the characters every time. Then she gives you a little suspense to make your heart skip a few beats. I can’t help myself but to keep going on this Series & then on to the spinoffs!!! ❤️❤️❤️❤️⭐️⭐️⭐️⭐️⭐️Every now and again you find an author that brings all of the elements of an exciting, emotional, suspenseful read that just knocks your socks off, and she does it again and again and again. This author has brought me to my knees, made me cry, laugh, choke, want to lash out, gasp and everything in between. This time she does it with Tina and Aiden. The brooding, quiet, laid back Kincaid, who claims to be his mother's favorite because she has no idea just how dark and dirty her sweet baby is. Yes he hides it well. . . but not from everyone. This time, this woman, this beautiful baby girl that is his heart and soul all wrapped up in sweetness, his Smalls. . . her Biggie. It's no easy feat to bring down a Kincaid man but when they fall they fall hard. For Aiden?!? Hell he may be the quiet one but he is far from the mild mannered, sweet boy his mom thinks him to be. He will do whatever it takes to protect his Smalls and the woman that has restored peace in his heart and soul because there is no option. He will protect them from the horrible past, one that will never destroy what they have or stop their future. . . and in the meantime we will be entertained by this wild and crazy, close and protective clan and their antics⭐️⭐️⭐️⭐️⭐️I love Evie, Tina and Aiden! Nothing is sexier than a big, badass man melting over a little girl and that's exactly what Aiden does. The way he takes to Evie is incredible and I love the way he takes care of Tina. Tina definitely deserved a happy ever after and I could not be happier that she found it with Aiden! This book will make you laugh, cry, curse and hold your breath and it's an incredible journey! I love Emilia and how she makes each character come to life. When you read her books you're not just reading, you're right there living the story with the characters too.⭐️⭐️⭐️⭐️⭐️ Well, I feel like Nelly. Emilia fooled me into thinking Aiden was a quiet, clean cut kinda guy. Wrong, all wrong! Passionate and delightfully dark better describes him. Also, Tina is written so incredibly badass. Calling her a Momma Bear doesn’t do her justice. Loved it, as I do everything in this series and Survivors!",
  "genres": [
    "Romance",
    "Sports",
    "Sports Romance",
    "Contemporary Romance",
    "Contemporary",
    "Mixed Martial Arts",
    "Fighters"
  ],
  "author": "Emilia Finn",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/42597348-finding-peace"
}