{
  "title": "The SEAL's Contract Baby",
  "description": "After an “incident” on his last SEAL mission, Zachary “Z” Raybourn has been relegated to babysitting duty. He’s spent the last six months guarding the daughter of a small foreign nation, a girl so valuable to the US that she apparently can’t buy milk without him trailing along like a lost puppy. He’d joined the military to make a difference and stayed enlisted because of the SEAL team he considers family. Now all he wants is to get back to them ASAP. Esme Hollycombe is her country’s last hope. Her father the King controls a very important port that serves as a naval base for the US. But with her father’s rapidly declining health, and her US-hating cousin next in line for the throne, Esme has been frantically searching for a loophole in her country’s law that says only a man can rule. The only thing she finds is that she can rule in the stead of any male heir she gives birth to. Unmarried and certainly not pregnant, the loophole isn’t of much use to her. Until her attention turns to the hot SEAL protector who has been pacing the palace for the last six months like a caged animal. He’d do anything to get back to his squad; and she’d do anything to keep her cousin off the throne, leaving him unable to evict the US and all their military protection from her country. Esme offers a contract to Z: get her pregnant, marry her so the heir will be legitimate, and he can have his life back. Z eventually agrees. But being the partner of a princess comes with far more action and intrigue than he’d ever dreamed. He also finds that making a baby is an easy way to fall in love. Now, Z will have to choose: the military family he misses, or the nuclear family he’s creating.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Military Romance",
    "Contemporary",
    "Holiday"
  ],
  "author": "Katie Knight",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/42598383-the-seal-s-contract-baby"
}