{
  "title": "The Venn Effect",
  "description": "Entrepreneurs can be made, but this one was born.Bill Rader started his journey at a very young age, building his first standard right of passage business - a yard care service while only ten years old - and grew it to the largest ten-year-old owned and operated business in the community while obtaining his first education in business. These early trials propelled him to his first licensed business at age 16.Refereed to as his first real business, as it had paid employees, licenses, insurance, and government run-ins - Bill grew this company and sold it while in his senior year of high school. He also learned his first and most valuable lesson in business:Do what you love!The Venn Effect holds the promise to be a game changer in entrepreneurship. Entrepreneurs can be born or made, as long as they learn, understand and employ the lessons learned from a life-long entrepreneur.The Venn Effect premise is simple: first do what you love then do what you know lacking either, failure is guaranteed. These are just two of the business lessons that Bill discusses in his popular keynote entitled the Venn Effect and now he is taking the keynote to book form, diving deeper into his world as an entrepreneur with not only lessons but tips on how to get ahead, be noticed and succeed - even if faced with a life-changing disease.Bill is not the kind of speaker or writer that is typical. He has never been a me too person, has always strived for separation by difference through originality. This is displayed through his experiences and success.The Venn Effect is a fast-paced, easy read, providing the reader a desire to turn the page to see whats next. Just like with his speeches, Bill grabs his audience and in a non-threatening way is able to move them along through real-life experiences that can be both funny and thought-provoking.Entrepreneurs will ask - why can t I do this? - and they will employ at least one tip to further their enterprise.Business Students will learn the right and wrong way to create and move a company forward.The general public will say - I can do this even with a disability or challengeThe Venn Effect can be experienced by anyone who has a desire to succeed.Let the Venn be part of your life!",
  "genres": [],
  "author": "W.K. Rader",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42600543-the-venn-effect"
}