{
  "title": "George Marshall: Defender of the Republic",
  "description": "The extraordinary career of George Catlett Marshall—America’s most distinguished soldier–statesman since George Washington—whose selfless leadership and moral character influenced the course of two world wars and helped define the American century. Winston Churchill called him World War II's \"organizer of victory.\" Harry Truman said he was \"the greatest military man that this country ever produced.\" Today, in our era of failed leadership, few lives are more worthy of renewed examination than Marshall and his fifty years of loyal service to the defense of his nation and its values. Even as a young officer he was heralded as a genius, a reputation that grew when in WWI he planned and executed a nighttime movement of more than a half million troops from one battlefield to another that led to the armistice. Between the wars he helped modernize combat training, and re-staffed the U.S. Army's officer corps with the men who would lead in the next decades. But as WWII loomed, it was the role of army chief of staff in which Marshall's intellect and backbone were put to the test, when his blind commitment to duty would run up against the realities of Washington politics. Long seen as a stoic, almost statuesque figure, he emerges in these pages as a man both remarkable and deeply human, thanks to newly discovered sources.Set against the backdrop of five major conflicts—two world wars, Palestine, Korea, and the Cold War—Marshall's education in military, diplomatic, and political power, replete with their nuances and ambiguities, runs parallel with America's emergence as a global superpower. The result is a defining account of one of our most consequential leaders.",
  "genres": [
    "Biography",
    "History",
    "Military Fiction",
    "Nonfiction",
    "World War II",
    "Leadership",
    "American History"
  ],
  "author": "David L. Roll",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/42594738-george-marshall"
}