{
  "title": "The Perfect Wife",
  "description": "Book #1 from the series: A Jessie Hunt Psychological Suspense Thriller🎧Listening Length = 8 hours and 20 minutesSuburbia harbors dark secrets in this suspenseful listen! After moving to a swanky new neighborhood, Jessie, a criminal profiler in training, starts to notice things aren’t quite what they seem. Not to mention that the serial killer she’s studying forces her to confront nightmares from her own hidden past…In THE PERFECT WIFE (A Jessie Hunt Psychological Suspense Thriller—Book 1), Criminal profiler-in-training Jessie Hunt is sure she's finally put the darkness of her childhood behind her. She and her husband, Kyle, just moved from a cramped downtown Los Angeles apartment into a Westport Beach mansion. Kyle's promotion has them swimming in money. And Jessie is on the verge of getting her Master's degree in forensic psychology, the last step in her dream of becoming a criminal profiler.But soon after their arrival, Jessie begins to notice a series of strange developments. The neighbors—and their au pairs—all seem to be hiding secrets. The mysterious yacht club Kyle is desperate to join is rife with cheating spouses, and with troubling rules of its own. And the notorious serial killer being held at the psychiatric hospital where Jessie is completing her degree seems to know more about her life than is normal—or safe.As her world starts to unravel, Jessie begins to question everything around her—including her own sanity. Has she truly uncovered a disturbing conspiracy buried within a sunny, wealthy Southern California beach town? Does the mass murderer she's studying really somehow know the origin of her private nightmares?Or has her tortured past finally come back to claim her?Book #2--\nTHE PERFECT BLOCK/42616441\n--is also now available!A fast-paced psychological suspense thriller with unforgettable characters and heart-pounding suspense, THE PERFECT WIFE is book #1 in a riveting new series that will leave you listening late into the night.",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Crime",
    "Suspense"
  ],
  "author": "Blake Pierce",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/42594568-the-perfect-wife"
}