{
  "title": "The Holy Spirit: Amazing Power for Everyday People",
  "description": "The Holy Spirit - Spiritual Gifts: Book 1 : Amazing Power for Everyday People (Illuminated Bible Study Guides) (2nd Edition)Newly Expanded 2nd Edition - Includes the text of hundreds of Bible VersesAre you ready to venture into deeper waters with God?We sit in our pews. We hear about the awesome power of God the Father. We marvel at the miracles of Jesus. Then off we go, never expecting those living waters of the Holy Spirit to flow through us in the here and now. That's exactly what this author did, until one day she was confronted with a stunning possibility: that wonders of biblical proportions can and do still happen, even in the lives of the humblest among us.The challenge? It meant getting to know the Holy Spirit, that enigmatic Third Person of the Trinity she'd heard so little about in traditional teaching. It meant braving controversy, searching the Scriptures, and venturing into new waters in faith.Let's be honest. Even wading toward the depths of the Holy Spirit may seem scary. It may even sound kind of kooky or off-base. You don't want to get in over your head. You fear drowning in error or emotionalism. Still, you may long to deepen your experience with God. You may be asking:What happened to the power Jesus promised to believers?Why has the Holy Spirit become such a taboo subject?Are modern miracles of biblical proportions still happening?How can I access the extraordinary power of God?Does the Holy Spirit have spiritual gifts for me? Which ones?THE HOLY SPIRIT: Amazing Power for Everyday Peopleis a step-by-step guide for how to grow in dynamic relationship with the Holy Spirit. It explores how even the most ordinary believer can experience the miracle-working power of God in everyday life.This scripturally-referenced \"how to\" book with workbook-style applications is ideal for individual or group Bible study, geared at building a highly accessible, scriptural foundation for the Person and supernatural gifts of the Holy Spirit.Tackling tough questions with straight answers, this book tracks an everyday believer's journey into what may be Christianity's best-kept secret. It dives deep into the oftenmarginalized mysteries of the Holy Spirit, mingling scriptural examples with numerous contemporary anecdotes of the amazing power of God in the lives of everyday believers.CHAPTERS IN THIS BOOK:1 Father, Son, and Holy Who?2 Why I Hadn't Heard This in a Thousand Sermons3 Introducing the Holy Spirit4 Sensing the Spirit without Getting Weird5 Getting Our Feet Wet in God's Powerful River6 Going Deeper without Going over the Deep End7 Passing the Spirit's Torch to You8 Opening Your Spiritual Gifts9 The Word of Wisdom10 The Word of Knowledge11 The Gift of Faith12 Gifts of Healing13 Effecting of Miracles14 Distinguishing of Spirits15 Various Kinds of Tongues16 Interpretation of Tongues17 Prophecy18 Prophetic Visions19 Prophetic Dreams20 Hearing Aids for All God's SheepADDITIONAL DETAILS:Genre: Christian Nonfiction, PneumatologyLength: 394 pagesFormats: Kindle eBook and Paperback EditionsAuthor Photo by Jean-Louis DarvilleThis comprehensive Bible Study is Book 1 of 2 on this subject. Please see Book 2 (ASIN: B06XF2JKQP) for the continuation of this study.",
  "genres": [
    "Christian",
    "Religion",
    "Personal Development",
    "Faith",
    "Christian Non Fiction",
    "Spirituality"
  ],
  "author": "Susan Rohrer",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/12364962-the-holy-spirit"
}