{
  "title": "Liberal In Nature: A Political Satire",
  "description": "This satirical novel by Garrett R. Hall explores the consequences - intended and unintended - of liberalism. Garrett's use of satire and his unique perspective on liberal ideology allows him to address important issues in a hilarious and unique way.When Democrats suffer a crushing political defeat, Andrew, a self-proclaimed liberal, flees society to live in the wilderness and soon discovers that his liberal ideology is perfectly suited to fixing the inequalities and injustices he perceives in nature. He settles in a beautiful, isolated valley that is rich with mountains, streams, animals and lush vegetation.After several months of observing the patterns and cycles of the valley, Andrew notices that nature is not as perfect as he originally thought. He sees squirrels that gather more nuts than others, a bear who dominates and bullies the other animals, a misunderstood wolf who is the victim of prejudice, trees that don’t get as much sunlight as others, salmon who can’t spawn because of oppressive waterfalls, deer who have to work too hard for their food and much more.Andrew takes it upon himself to bring fairness and equality to nature. Applying his liberal ideology, he intercedes on behalf of oppressed and underprivileged organisms as he tries to fundamentally transform the valley. He sees himself as a savior to the valley and he tries to earn the animals’ trust by easing their burdens. His meddling, however, disrupts the balance of nature eventually producing unexpected consequences.Liberal In Nature addresses – directly or indirectly - important social issues such as: abortion, affirmative action, death penalty, economy, education, energy, global warming, gun control, health care, homeland security, immigration, private property, religion and government, social security, taxes, tea party, terrorism, and welfare.Available at: https://www.createspace.com/3623141",
  "genres": [],
  "author": "Garrett R. Hall",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/12365488-liberal-in-nature"
}