{
  "title": "The Wayfarer's Mulligan",
  "description": "“What did she call this? ‘A Mulligan?’ Dare he think it? Had he now fallen backward in his own chronology?‘Say Time travel. That’s what this is! — Panic. Shouldn’t I be panicking? …Yes, I should.’ And so, he began to do just that.”It’s the game’s singular cheat. Synonymous with the “do-over,” its use is forbidden yet so renowned that even those who’ve never taken up a club comprehend the phrase. It is “the Mulligan.”Yet there is one more Mulligan, this which offers a “do-over” of a more seismic dimension—the more fruitful of the two, it is accordingly the more treacherous….Meet Wayfarer #1, Ed Financial Advisor, Neglected Husband, and Time Traveler. With his life in a cat box and marriage hooking into the rough, this hobbyist golfer “takes a Mulligan” of the supernatural kind, wishing himself back in time to replay one of his greatest mistakes. Once returned from the Past, Ed must somehow overcome tremendous hurdles in order to remain in his new path – but will they destroy everything he cherishes in the end?Now, he's not the first… and this is the problem.Who created the Wayfarer's Mulligan, a pint-size statuette with enormous powers over Time and its user? Mysteries abound yet are cloaked in the phenomenon, for each new Mulligan overwrites the last, and anyone who used it can no longer recall having done so. Yet, when each Mulligan unravels the previous, can anyone be sure whom he or she will finally become?Set in the golfer’s paradise of Naples, Florida, The Wayfarer’s Mulligan is the pitch-perfect mix of humor, adventure, suspense, and wonder. As the story follows several Mulligan-takers, the fates spiral as danger lurks ever too near. Is it a cure or a curse? You won’t know unless you tempt fate. Just, ahem, don’t forget to pack your time-leaping caddy.",
  "genres": [],
  "author": "Axel V. Adams",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42622985-the-wayfarer-s-mulligan"
}