{
  "title": "The Devil's Deal",
  "description": "From the winner of the Dog Writer’s Association of America “Best Fiction Book of the Year 2017”award comes this thrilling new installment in the Raine Stockton Dog Mystery series. The annual Hansonville, North Carolina Founder’s Day Festival always draws plenty of locals and tourists alike who are eager to immerse themselves in the Smoky Mountain culture and show their support for local businesses and civic organizations. For dog trainer and Humane Society volunteer Raine Stockton, it’s a perfect opportunity to raise money for the local animal shelter. But when a stranger wanders into her fund-raising booth with his young daughter and their beautiful black Lab, the peaceful country afternoon is turned into chaos. Within moments the man is arrested for murder, his child is placed in foster care, and Raine finds herself the temporary custodian of what may well be the most valuable dog in the world. While Raine’s ex-husband, the newly appointed county investigator Buck Lawson, tries to sort out the tangled threads of a murder case that isn’t even his own, Raine discovers that the man they’ve taken into custody is the world-famous research scientist Dr. Jason Broderick and that the Labrador, Bongo, is one of an elite group of dogs Broderick has bred and trained to detect concealed micro-technology. Raine can’t believe that someone she so admires could be guilty of murder, particularly when she learns that one of his associates is her own fiancé, Miles Young. But is her faith in both men misplaced? It turns out that Bongo has skills that go beyond even those of his fellow scent-detecting canines—skills that are worth billions of dollars to some people, and are worth killing for to others. When the unthinkable happens and an innocent life is placed in jeopardy, Raine is forced to make a terrible one that will shake her to her very core and cause her to question not only herself, but everything she has ever believed.",
  "genres": [
    "Mystery",
    "Dogs",
    "Cozy Mystery"
  ],
  "author": "Donna Ball",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/42622970-the-devil-s-deal"
}