{
  "title": "The Right Side of History: How Reason and Moral Purpose Made the West Great",
  "description": "A #1 NEW YORK TIMES BESTSELLER!Human beings have never had it better than we have it now in the West. So why are we on the verge of throwing it all away?In 2016, New York Times bestselling author Ben Shapiro spoke at the University of California–Berkeley. Hundreds of police officers were required to protect his speech. What was so frightening about Shapiro? He came to argue that Western civilization is in the midst of a crisis of purpose and ideas; that we have let grievances replace our sense of community and political expediency limit our individual rights; that we are teaching our kids that their emotions matter more than rational debate; and that the only meaning in life is arbitrary and subjective.As a society, we are forgetting that almost everything great that has ever happened in history happened because of people who believed in both Judeo-Christian values and in the Greek-born power of reason. In The Right Side of History, Shapiro sprints through more than 3,500 years, dozens of philosophers, and the thicket of modern politics to show how our freedoms are built upon the twin notions that every human being is made in God’s image and that human beings were created with reason capable of exploring God’s world.We can thank these values for the birth of science, the dream of progress, human rights, prosperity, peace, and artistic beauty. Jerusalem and Athens built America, ended slavery, defeated the Nazis and the Communists, lifted billions from poverty, and gave billions more spiritual purpose.Yet we are in the process of abandoning Judeo-Christian values and Greek natural law, watching our civilization collapse into age-old tribalism, individualistic hedonism, and moral subjectivism. We believe we can satisfy ourselves with intersectionality, scientific materialism, progressive politics, authoritarian governance, or nationalistic solidarity.We can’t.The West is special, and in The Right Side of History, Ben Shapiro bravely explains how we have lost sight of the moral purpose that drives each of us to be better, the sacred duty to work together for the greater good,.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Philosophy",
    "Audiobook",
    "Religion",
    "Cultural"
  ],
  "author": "Ben Shapiro",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/42649659-the-right-side-of-history"
}