{
  "title": "How to Make Friends with the Dark",
  "description": "'A BOOK AS FIERCE, TENDER, AND RARE AS ITS APTLY NAMED HEROINE, TIGER.'- Meg Leder, author of Letting Go of GravityIt's the brightest day of summer and it's dark outside. It's dark in your house, dark in your room, and dark in your heart. You feel like the darkness is going to split you apart.Here is what happens when your mother dies.That's how it feels for Tiger. It's always been Tiger and her mother against the world. Then, on a day like any other, Tiger's mother dies. And now it's Tiger, alone.Here is how you learn to make friends with the dark.From the author of the New York Times bestselling novel Girl in Pieces comes a new heartbreaking story about love and loss and learning how to continue when it feels like you're surrounded by darkness.PRAISE FOR HOW TO MAKE FRIENDS WITH THE DARK:'A book as fierce, tender, and rare as its aptly named heroine, Tiger. How to Make Friends with the Dark is a gorgeously nuanced meditation on grief and family, and the incredible love that can pull you through the darkest of times.' - Meg Leder, author of Letting Go of Gravity'Kathleen Glasgow is the rare type of skilled storyteller that knows you have to hurt your characters before putting them back together. I loved every word of this lyrical and devastating novel.' - Kara Thomas, author of The Cheerleaders'In this raw, powerful, and heartbreaking meditation on loss and grief, Glasgow writes with unflinching beauty. We meet Tiger Tolliver at her most broken - at her darkest moment - and yet, somehow, How to Make Friends With the Dark teaches us how to let the light in.' - Julie Buxbaum, NYT bestselling author of Tell Me Three ThingsPRAISE FOR GIRL IN PIECES:'Girl, Interrupted meets Speak.' - Refinery29.com'A dark yet powerful read.' - PasteMagazine.com'One of the most affecting novels we have read.' - Goop.com'Breathtaking and beautifully written.' - Bustle'A haunting, beautiful, and necessary book that will stay with you long after you've read the last page.' - Nicola Yoon, #1 NYT bestselling author of Everything, Everything and The Sun Is Also a Star",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Mental Health",
    "Fiction",
    "Realistic Fiction",
    "Grief",
    "Coming Of Age"
  ],
  "author": "Kathleen Glasgow",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/42643775-how-to-make-friends-with-the-dark"
}