{
  "title": "The Heart of a Soldier: A True Love Story of Love, War, and Sacrifice",
  "description": "The powerful true story of a heroic couple whose love for their country was matched only by their love for each other.  Mike and Kate Blaise fell in love during high school in small-town Macon, Missouri. Sharing a deep sense of patriotism, they both entered the U.S. Army—she as a commissioned officer and he as an enlisted infantry soldier who later became a helicopter pilot with the Air Cavalry. Forced to accept the realities of a military marriage yet determined to stay with her husband, Kate passed up her dream assignment in the United States to be with Mike, who was deployed to Korea. But they never imagined a day like 9/11 or the military aftermath that sent them to Iraq, where Mike would lose his life in combat.  A memoir unlike any other, The Heart of a Soldier captures the human side of war through the eyes of a unique insider. Delivering a candid take on life as a woman in the military as well as the grueling challenges facing all who serve, Kate Blaise takes us from the dreams of her idealistic youth to her final days with Mike, when she served in the battalion that provided support to his unit in Iraq. In vivid scenes, she describes her personal evolution as a female officer and a wife—and the incalculable price she and Mike paid in service to a country they love. Both a tribute and a work of riveting narrative, The Heart of a Soldier puts an unforgettable new face on love and war.  \"Kate Blaise reminds us that every war is, ultimately, a story of sacrifice and human tragedy. Kate's personal story -- and the sacrifice she made in Iraq -- humble us all.” —Andrew Exum, author of THIS MAN’S ARMY: A Soldier’s Story from the Front Lines of the War on Terrorism",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "War",
    "Biography"
  ],
  "author": "Kate Blaise",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/102468.The_Heart_of_a_Soldier"
}