{
  "title": "A Lovely Nightmare",
  "description": "“I’m gonna have a great night. Stick around. Maybe you’ll see how great later!”“Promises, Promises.” Amelia is desperate for normalcy. Plagued by a monster in her closet, she has never really experienced a normal life. After graduation, Amelia is finally leaving town. College is supposed to be her new start. She is supposed to finally enjoy her life. She is supposed to finally have friends without being called a weirdo. Most importantly, the monster in her closet isn’t supposed to come back and haunt her. As she struggles to start anew, her tall, playful, and exceedingly irresistible landlord, Brady, catapults into her life. She is instantly entranced by the undeniable passion that blazes between them. But romance will have to wait because her hopes for a new life ebbs for her monster is back and it no longer hides in the dark. The monster has taken a new form and it follows Amelia wherever she goes, day and night. It watches her every move and its desire for her becomes a craving she knows she can never satisfy and she will have to fight for as hard as she can. Brady knows about Amelia more than he lets on. He knows about her monster and he knows about the risk yet he is more than willing to take it. Brimming with his hot charms and seductive words, Brady is prepared to do everything to win Amelia’s heart.He wants her—always has. But when a string of secrets slowly come to light, and Amelia soon uncovers the kind of man he truly is, all bets are off. No man is worth life in hell. Tempered by unexpected turns and heart-pounding revelations, Wendy Cole delivers the kind of narrative that scares you and makes you fall in love at the same time. Be captivated by the frightening yet beautiful monsters in Amelia’s world. Grab a copy now!",
  "genres": [
    "Fantasy",
    "Paranormal Romance",
    "Supernatural"
  ],
  "author": "Wendy Cole",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/42652163-a-lovely-nightmare"
}