{
  "title": "Lincoln: A Very Short Introduction",
  "description": "Beneath the surface of the apparently untutored and deceptively frank Abraham Lincoln ran private tunnels of self-taught study, a restless philosophical curiosity, and a profound grasp of the fundamentals of democracy. Now, in Lincoln: A Very Short Introduction, the award-winning Lincoln authority Allen C. Guelzo offers a penetrating look into the mind of one of our greatest presidents. If Lincoln was famous for reading aloud from joke books, Guelzo shows that he also plunged deeply into the mainstream of nineteenth-century liberal democratic thought. Guelzo takes us on a wide-ranging exploration of problems that confronted Lincoln and liberal democracy--equality, opportunity, the rule of law, slavery, freedom, peace, and his legacy. The book sets these problems and Lincoln's responses against the larger world of American and trans-Atlantic liberal democracy in the 19th century, comparing Lincoln not just to Andrew Jackson or John Calhoun, but to British thinkers such as Richard Cobden, Jeremy Bentham, and John Bright, and to French observers Alexis de Tocqueville and Fran ois Guizot. The Lincoln we meet here is an Enlightenment figure who struggled to create a common ground between a people focused on individual rights and a society eager to establish a certain moral, philosophical, and intellectual bedrock. Lincoln insisted that liberal democracy had a higher purpose, which was the realization of a morally right political order. But how to interject that sense of moral order into a system that values personal self-satisfaction--\"the pursuit of happiness\"--remains a fundamental dilemma even today. Abraham Lincoln was a man who, according to his friend and biographer William Henry Herndon, \"lived in the mind.\" Guelzo paints a marvelous portrait of this Lincoln--Lincoln the man of ideas--providing new insights into one of the giants of American history.",
  "genres": [
    "History",
    "Biography",
    "American History",
    "Politics",
    "Nonfiction",
    "American Civil War",
    "Biography Memoir"
  ],
  "author": "Allen C. Guelzo",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/4266639-lincoln"
}