{
  "title": "The Lady Doctor",
  "description": "The Lady Doctor is the follow-up companion graphic novel to Ian Williams’s critically acclaimed debut, The Bad Doctor.Dr Lois Pritchard is a salaried partner at Llangandida Health Centre with Drs Iwan James (subject of The Bad Doctor) and Robert Smith. She also works two days a week in the local Genitourinary Medicine (GUM) clinic. She is 40, currently single, despite the attentions of her many admirers, and is, by her own admission, ‘not very good with relationships’. When her estranged mother makes a dramatic appearance on the scene, demanding a liver transplant, Lois has to confront her loyalties and make some hard decisions.From the moment we see Dr Lois nipping out behind the surgery for a fag, we know we are in for a behind-the-scenes warts-and-all comedy drama. We meet a patient who regrets the Pinocchio face he had tattooed on his genitals; a man who resorts to desperate measures after being driven mad by his neighbours’ cats, and a prescription drug addict who plans to sue his previous doctors for failing to refuse him the drugs he demanded. Drugs – prescription, recreational, legal (coffee, alcohol, tobacco) – and behaviours and attitudes surrounding them – are a hot topic at Llangandida Health Centre. Hardening government attitudes towards drugs and addiction, and patients’ demands to benefit from the re emergence of psychedelic therapeutic research, don’t make a doctor’s life any easier, but Williams explores current medical issues and ethics with his trademark lightness of touch and wonderfully sly sense of humour, using his own experience as a practising GP to recreate the lives of both patients and health service practitioners.",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Medicine",
    "Medical",
    "Graphic Novels Comics",
    "Fiction",
    "Health"
  ],
  "author": "Ian      Williams",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/42654636-the-lady-doctor"
}