{
  "title": "EVO",
  "description": "A covert CIA operation that involves genetic engineering.A serial killer nicknamed \"The Hypnotist\".And the most terrifying threat humanity has to face.What if someone could take complete control over your mind?And what if that someone was a serial killer?Langley, Virginia, twenty years earlier:John Blake, a CIA special agent, stumbles upon an illegal genetic experiment within the agency, conducted on unborn babies and officially presented as a fertility program designed to help couples get pregnant. When he realizes that his very own daughter is a product of this sinister plot and that she is in grave danger, he vows to do everything it takes to make sure Maya will be safe and the people behind the experiment will all pay. With their lives.Verona, Italy, present time:Livio Marchiori, a homicide detective with the highest rate of solved cases in Verona, is faced with The Hypnotist, a serial killer the likes of which he’s never seen before. He never touches his victims and he leaves no evidence behind, except for the detailed videos of his murders. And what Marchiori and his team see on those videos is more disturbing than all their other cases combined. Because this one is different. This one defies all rational thinking and borders the impossible.Then The Hypnotist gets personal and threatens to kill Dr. Abby Jones, the chief medical examiner and the woman Marchiori is in love with. Caught in a cat-and-mouse game with the elusive killer, Marchiori knows he is quickly running out of time.So when Captain Victor Miller from Interpol walks into town, Marchiori is more than happy to partner again with the man who two years ago helped him put an entire mafia clan behind bars. But Miller has his own agenda, and Marchiori soon discovers that there is more to these crimes than meets the eye, an entire thread of things way beyond his pay grade - illegal experiments, secret agencies, and the most terrifying threat humanity has to face.A gripping serial killer thriller with a shocking twist. \"He stripped down, threw his clothes in the blue hamper behind the door, and got in the shower. He turned his body away from the faucet and placed his hands on the wall, letting the hot water beat down his back. Doing this usually relaxed him, but now it somehow amplified this weird restlessness, this foreboding feeling he couldn’t shake off. Annoyed at himself, he quickly washed his body, turned off the faucet and reached for the brown towel on the hook. A heavy silence filled his apartment. A few drops of water from the shower head splashed onto the ceramic tiles below, the sound deafening to his ears. His heart started beating faster. All of a sudden he wanted to hear human voices, his neighbours yelling at each other, their baby crying, anything but this dead silence and the rhythmic tapping of the water drops. An icy shiver rippled down his spine and his body started shaking. Unseen walls were sliding down around him, trapping him. Suffocating him.\"",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Suspense",
    "Serial Killer",
    "Detective",
    "Fiction"
  ],
  "author": "Diane  May",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/42653129-evo"
}