{
  "title": "Stealing Jenny",
  "description": "Religious After three heartbreaking miscarriages, Tom and Jenny Callahan are happily anticipating the birth of their sixth child. Their neighbor, however, is secretly hatching a sinister plot which will find Jenny and her unborn baby fighting for their lives.“Stealing Jenny is a gripping novel filled with engaging characters, a compelling mystery and a message which underscores the precious dignity of life. I literally couldn’t put it down and give Stealing Jenny my highest recommendation.” Lisa M. Hendey, Founder of CatholicMom.com and author of A Book of Saints for Catholic Moms“Ellen Gable is a masterful storyteller. Stealing Jenny is a smoothly written, chilling tale of gripping suspense. There are terrifying moments and heart-wrenching moments. Catholic faith and hope are tested. Above all, the sacredness and privilege of precious new life is made indisputably evident. I never wanted it to end!”Therese Heckenkamp, Traditional Catholic Novels.com“Stealing Jenny is my favorite kind of a thought-provoking psychological suspense novel in its own right, with a life-affirming message that adds even more to its depth. Another finely-plotted story and a cast of very real and well-drawn characters which highlight Ellen Gable’s ability to write beautiful Catholic fiction in any genre.” Krisi Keley, author, “On the Soul of a Vampire,” and “Pro Luce Habere\"“Stealing Jenny will keep you on the edge of your seat and probably destroy your sleep pattern as you stay up to find out what happens. But beyond being a great suspense, it’s also an excellent example of morals in action and family life redeemed.\"Sarah Reinhard, author “Welcome Baby Advent and Christmas Reflections for Families”",
  "genres": [
    "Fiction",
    "Mystery",
    "Suspense",
    "Christian Fiction",
    "Thriller",
    "Christian",
    "Amazon"
  ],
  "author": "Ellen Gable",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/12366344-stealing-jenny"
}