{
  "title": "Pediatric Advanced Life Support",
  "description": "Features • Complies with the latest AHA guidelines • Walkthrough of PALS cases and algorithms • In-depth analysis of resuscitation tools • ECG and electrical therapy review • Basic Life Support techniques, and more • Full-page PALS Algorithms, tables, images, and other visual tools • Effective, user-friendly and adapted for Kindle • Review Questions • Save on PALS certification when you certify online through National Health Care Provider Solution. Discount code included in your purchase.  *NEW UPDATES TO PALS PROVIDER HANDBOOK * NHCPS recently released an updated version of their Pediatric Advanced Life Support (PALS) Provider Handbook that includes several constructive improvements to an already exceptional handbook. A few of these key features include: elimination of all formatting/sizing issues, enhanced algorithms, and improved overall quality and content of the information presented throughout. With these updates, NHCPS proudly offers one of the most effective and user-friendly PALS Provider Handbooks on the market.  Pediatric Advanced Life Support (PALS) Provider Handbook, presented by National Health Care Provider Solutions (NHCPS), is a comprehensive resource intended for health care professionals currently enrolled in a Pediatric Advanced Life Support Certification or Recertification Course. It serves as the primary training material for PALS Certification and Recertification courses provided by National Health Care Provider Solutions (www.nhcps.com). Although it is predominantly intended for use during certification courses, the handbook was also created to serve as daily reference material for both health care professionals and non-health care professionals alike.  Information covered in the handbook includes PALS procedures through a variety of emergency situations, in-depth analysis of resuscitation tools, ECG and electrical therapy review, Basic Life Support techniques, and more. Full-page PALS Algorithms, tables, images, and other visual tools are also included within the handbook. All material included in this handbook is delivered in a manner meant to enhance learning in the most comprehensive and convenient way possible.",
  "genres": [],
  "author": "Karl Disque",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/42731558-pediatric-advanced-life-support"
}