{
  "title": "Earned Citizenship",
  "description": "The migration and settlement of 11 million unauthorized immigrants is among the leading political challenges facing the United States today. The majority of unauthorized immigrants in the U.S. have been here for more than five years, and are settling into American communities, working, forming families, and serving in the military, even though they may be detained and deported if they are discovered. An open question remains as to what to do about unauthorized immigrants who are already living in the United States. On one hand it is important that the government sends a message that future violations of immigration law will not be tolerated. On the other sits a deeper ethical dilemma that is the focus of this what do the state and citizens owe to unauthorized immigrants who have served their adopted country?Earned Citizenship argues that long-term unauthorized immigrant residents should be able to earn legalization and a pathway to citizenship through service in their adopted communities. Their service would act as restitution for immigration law violations. Military service in particular would merit naturalization in countries with a strong citizen-soldier tradition, including the United States. The book also considers the civic value of caregiving as a service to citizens and the country, contending that family immigration policies should be expanded to recognize the importance of caregiving duties for dependents. This argument is part of a broader project in political theory and public policy aimed at reconciling civic republicanism with a feminist ethic of care, and its emphasis on dependency work. As a whole, Earned Citizenship provides a non-humanitarian justification for legalizing unauthorized immigrants based on their contributions to citizens and institutions in their adopted nation.",
  "genres": [],
  "author": "Michael J.       Sullivan",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42686885-earned-citizenship"
}