{
  "title": "The Starless Sea",
  "description": "Far beneath the surface of the earth, upon the shores of the Starless Sea, there is a labyrinthine collection of tunnels and rooms filled with stories. The entryways that lead to this sanctuary are often hidden, sometimes on forest floors, sometimes in private homes, sometimes in plain sight. But those who seek will find. Their doors have been waiting for them.Zachary Ezra Rawlins is searching for his door, though he does not know it. He follows a silent siren song, an inexplicable knowledge that he is meant for another place. When he discovers a mysterious book in the stacks of his campus library he begins to read, entranced by tales of lovelorn prisoners, lost cities, and nameless acolytes. Suddenly a turn of the page brings Zachary to a story from his own childhood impossibly written in this book that is older than he is.A bee, a key, and a sword emblazoned on the book lead Zachary to two people who will change the course of his life: Mirabel, a fierce, pink-haired painter, and Dorian, a handsome, barefoot man with shifting alliances. These strangers guide Zachary through masquerade party dances and whispered back room stories to the headquarters of a secret society where doorknobs hang from ribbons, and finally through a door conjured from paint to the place he has always yearned for. Amid twisting tunnels filled with books, gilded ballrooms, and wine-dark shores Zachary falls into an intoxicating world soaked in romance and mystery. But a battle is raging over the fate of this place and though there are those who would willingly sacrifice everything to protect it, there are just as many intent on its destruction. As Zachary, Mirabel, and Dorian venture deeper into the space and its histories and myths, searching for answers and each other, a timeless love story unspools, casting a spell of pirates, painters, lovers, liars, and ships that sail upon a Starless Sea.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magical Realism",
    "Audiobook",
    "Romance",
    "Adult",
    "Dark Academia"
  ],
  "author": "Erin Morgenstern",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/42730332-the-starless-sea"
}