{
  "title": "Claimed",
  "description": "University student Demir Higgs is on the fast-track to graduate with honors and dive straight into medical school. His career plan leaves little time for dating, so after he catches his casual boyfriend cheating, Demir attends an anonymous sex party, determined to finally lose his virginity. He chooses an older alpha in a red mask and the man takes Demir apart piece by glorious piece, worshiping his body in ways Demir never imagined. Too bad he’ll never see the man again.After his bondmate disappeared eleven years ago, Senior Constable Brandt Lars fell into his work and avoided dating, disinterested in relationships. Not until the boy in the blue mask. Introducing the young beta to the wonders of sex was Brandt’s absolute pleasure, and he can’t stop thinking about him—until Brandt comes face to face with Blue in the form of Demir Higgs, the middle son of a work colleague. Demir is equally drawn to Brandt and their chemistry is through the roof. The age difference is an issue, but their attraction is real, and stolen moments turn into a secret relationship they both enjoy…but something is still missing.Years ago, Oliver Strand lost all his memories in a horrible car wreck that left his face scarred and his sense of smell obliterated. But he built a new life for himself and his son, and now he’s visiting Sansbury Province as a guest speaker at a territory-wide anti-sex-trafficking conference. What he does not expect to find at the conference is an alpha he doesn’t know, but who insists Oliver is his missing mate Ollie Lars, who disappeared the same week as Oliver’s accident.Brandt is overjoyed to discover his bondmate is alive, despite Oliver having no memory of his old life in Sansbury, and he’s determined to keep both mate and son in his life. But he’s also in love with Demir and doesn’t want to lose him. Demir is ready to be the bigger person and step aside so the Lars family can be together again—until Demir realizes he and Oliver have unique chemistry of their own. And they’ve also both been claimed by the same alpha.Can a grumpy alpha in love with two men, an omega with no memory of his mate, and a beta determined to chart his own course find a way to navigate the complicated waters of a poly relationship? Or will all three men end up stranded alone with broken hearts?NOTE: This is a non-shifter, M/M/M Omegaverse story with alpha/omega/beta dynamics, heats, knotting, and mpreg. In this world, omegas are second-class citizens, but they are working toward gaining more civil rights and protections under the law. Series warnings for mentions of past physical, emotional, and sexual abuse. Additional warnings for extremely kinky sex, including dirty talk, light spanking, biting, edging, roughhousing, come-swapping, and threesomes. This series is best read in numerical order.",
  "genres": [
    "M M Romance",
    "Omegaverse",
    "Romance",
    "Menage",
    "M M M",
    "LGBT",
    "Polyamory"
  ],
  "author": "A.M. Arthur",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/42751155-claimed"
}