{
  "title": "How Starbucks Saved My Life: A Son of Privilege Learns to Live Like Everyone Else",
  "description": "In his fifties, Michael Gates Gill had it all: a big house in the suburbs, a loving family, and a top job at an ad agency with a six-figure salary. By the time he turned sixty, he had lost everything except his Ivy League education and his sense of entitlement. First, he was downsized at work. Next, an affair ended his twenty-year marriage. Then, he was diagnosed with a slow-growing brain tumor, prognosis undetermined. Around the same time, his girlfriend gave birth to a son. Gill had no money, no health insurance, and no prospects.  One day as Gill sat in a Manhattan Starbucks with his last affordable luxury—a latté—brooding about his misfortune and quickly dwindling list of options, a 28-year-old Starbucks manager named Crystal Thompson approached him, half joking, to offer him a job. With nothing to lose, he took it, and went from drinking coffee in a Brooks Brothers suit to serving it in a green uniform. For the first time in his life, Gill was a minority--the only older white guy working with a team of young African-Americans. He was forced to acknowledge his ingrained prejudices and admit to himself that, far from being beneath him, his new job was hard. And his younger coworkers, despite having half the education and twice the personal difficulties he’d ever faced, were running circles around him.  The other baristas treated Gill with respect and kindness despite his differences, and he began to feel a new emotion: gratitude. Crossing over the Starbucks bar was the beginning of a dramatic transformation that cracked his world wide open. When all of his defenses and the armor of entitlement had been stripped away, a humbler, happier and gentler man remained. One that everyone, especially Michael’s kids, liked a lot better.  The backdrop to Gill's story is a nearly universal cultural phenomenon: the Starbucks experience. In How Starbucks Saved My Life, we step behind the counter of one of the world's best-known companies and discover how it all really works, who the baristas are and what they love (and hate) about their jobs. Inside Starbucks, as Crystal and Mike’s friendship grows, we see what wonders can happen when we reach out across race, class, and age divisions to help a fellow human being.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Business",
    "Book Club",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Michael Gates Gill",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/427475.How_Starbucks_Saved_My_Life"
}