{
  "title": "Met een kwartje de wereld rond",
  "description": "L’histoire commence en France vers la fin du xixe siècle. Armand Lavarède est un jeune journaliste sans le sou et harcelé par ses créanciers, dont le plus féroce est un nommé Bouvreuil. Bouvreuil vient un jour trouver Lavarède avec en main une lettre surprenante : Lavarède est l’héritier potentiel de Monsieur Richard, un riche cousin prêt à lui léguer toute sa fortune. Mais le legs comporte une condition excessivement étrange : pour obtenir l’héritage, Lavarède doit d’abord réussir à faire le tour du monde en ne partant qu’avec cinq sous en poche, le tout en moins de 100 jours ! Lavarède finit par relever le défi. Les deux arbitres du défi sont sir Murlyton et Bouvreuil, qui pourront se partager la fortune de Richard de Marseille si Lavarède échoue. Lavarède bénéficie en revanche du soutien d’une jeune femme, Aurett, la fille de sir Murlyton. Dès lors, Lavarède va devoir multiplier les ruses pour réussir le défi avant d’avoir dépensé le budget incroyablement restreint qui lui a été imposé. Il entame ainsi son voyage par une traversée de l’Atlantique sur le paquebot Lorraine en tant que passager clandestin, et peut bien sûr compter sur l’hostilité de Bouvreuil qui tente de lui mettre des bâtons dans les roues pour empocher l’héritage.Extrait :Même si Lavarède avait connu la biographie del señor José, il n’eût pas été très rassuré. L’individu était, nous l’avons dit, de la race des aventuriers sans patrie qui ne reculent devant aucune indélicatesse.  À Paris, il avait fallu vivre. Une fois mangé le sac de piastres rapporté de là-bas, une fois épuisé le petit crédit que les étrangers obtiennent toujours si aisément chez nous, la série des moyens blâmables avait commencé.  José exploita d’abord le cœur et la pitié des nombreux réfugiés de langue castillane en résidence à Paris. Mais ils ne sont pas riches, et ce filon ne tarda pas à s’épuiser. La parente entrevue aux îles Açores apporta, pendant quelque temps, son contingent d’appui matériel. Mais bientôt elle dut songer à elle-même, afin de ne pas s’enliser dans les boues parisiennes.  Don José s’aboucha alors avec certains exotiques, dont les dossiers ne sont pas assez connus, et pénétra dans des tripots indûment dénommés « cercles », où il exerça diverses industries aussi peu recommandables les unes que les autres. Un peu de tricherie, beaucoup de mendicité, passionnément d’emprunts, pas du tout de probité ; avec ce programme, la pente est glissante. Notre personnage glissa, et bientôt il versa dans l’escroquerie. La victime fut un prêteur à la petite semaine, à proprement parler, un usurier. Mais cet individu n’était que l’homme de paille, le prête-nom d’un autre « spéculateur » qui exploitait les joueurs passionnés et les fils de famille en déveine. Et cet entrepreneur de prêts à taux usuraire n’était autre que le sieur Bouvreuil, un de ces tireurs dont l’arc a tant de cordes. Bouvreuil ne supportait pas aisément qu’on le mît dedans.",
  "genres": [
    "Adventure",
    "France"
  ],
  "author": "Paul d'Ivoi",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/12367708-met-een-kwartje-de-wereld-rond"
}