{
  "title": "The Second Most Powerful Man in the World: The Life of Admiral William D. Leahy, Roosevelt's Chief of Staff",
  "description": "The life of Franklin Roosevelt's most trusted and powerful advisor, Admiral William D. Leahy, Chief of Staff to the Commander-in-Chief“Fascinating… greatly enriches our understanding of Washington wartime power.”—Madeleine AlbrightAside from FDR, no American did more to shape World War II than Admiral William D. Leahy--not Douglas MacArthur, not Dwight Eisenhower, and not even the legendary George Marshall. No man, including Harry Hopkins, was closer to Roosevelt, nor had earned his blind faith, like Leahy. Through the course of the war, constantly at the president's side and advising him on daily decisions, Leahy became the second most powerful man in the world.In a time of titanic personalities, Leahy regularly downplayed his influence, preferring the substance of power to the style. A stern-faced, salty sailor, his U.S. Navy career had begun as a cadet aboard a sailing ship. Four decades later, Admiral Leahy was a trusted friend and advisor to the president and his ambassador to Vichy France until the attack on Pearl Harbor. Needing one person who could help him grapple with the enormous strategic consequences of the war both at home and abroad, Roosevelt made Leahy the first presidential chief of staff--though Leahy's role embodied far more power than the position of today. Leahy's profound power was recognized by figures like Stalin and Churchill, yet historians have largely overlooked his role. In this important biography, historian Phillips Payson O'Brien illuminates the admiral's influence on the most crucial and transformative decisions of WWII and the early Cold War. From the invasions of North Africa, Sicily, and France, to the allocation of resources to fight Japan, O'Brien contends that America's war largely unfolded according to Leahy's vision. Among the author's surprising revelations is that while FDR's health failed, Leahy became almost a de facto president, making decisions while FDR was too ill to work, and that much of his influence carried over to Truman's White House.",
  "genres": [
    "Biography",
    "History",
    "World War II",
    "Nonfiction",
    "Military History",
    "Politics",
    "American History"
  ],
  "author": "Phillips Payson O'Brien",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/42737163-the-second-most-powerful-man-in-the-world"
}