{
  "title": "Wolf des Südens (Die Treppen der Ewigkeit 2)",
  "description": "Mörder, nutze die Treppen der Ewigkeit für eine zweite Chance. Erweist du dich jedoch als unwürdig, vernichten wir deine Seele, als ob du nie existiert hättest.\n\n\nDie Zeichen stehen schlecht für Emilio, den Wolf des Südens und Eternas gefährlichsten Auftragsmörder. Eingekerkert wartet er auf seine Enthauptung, da überraschen ihn die Richter mit einer Alternative — sich in der Vergangenheit ein neues Leben zu schaffen.Emilio nimmt an und findet sich in einem eisigkalten, kriegszerrissenen Königreich der Vorzeit wieder. Es ist ein furchtbarer Ort mit schrecklichen Bewohnern, und Morayn, ihre junge, rotzfreche und jähzornige Königin, scheint die Schlimmste von allen.Widerwillig schließt Emilio sich Morayns verzweifeltem Kampf um ihr Königreich an und erkennt bald, dass die Erfüllung seiner geheimsten Träume zum Greifen nah ist. Aber reichen die Intelligenz und Fähigkeiten eines Mörders aus, um das Land, seine neue Familie und die Frau, die er liebt, zu retten?\n\n\n«Wolf des Südens» ist der erste Band in der neuen magischen Fantasy-Reihe von Isa Day. Die spannende und romantische Geschichte spielt in ihrer eigenen Fantasy-Welt und erzählt von Schuld und Sühne und dem Mut, für das Wohl der Gemeinschaft scheinbar unüberwindbare Gefahren auf sich zu nehmen. Wer Elemente wie eine Mörderzunft, Zeitreisen, Zauberei, Gestaltwandler, Geister, Tiere, ein Geheimnis aus der Frühzeit, Liebe und eine Prise Humor mag sollte auf seine Kosten kommen. Jeder Band der Serie «Die Treppen der Ewigkeit» ist in sich abgeschlossen und kann für sich allein gelesen werden. \n\n\nLänge: 84,780 WörterKategorien: Epic Fantasy, Fantasy Romance, Romantasy, New AdultErhältliche Formate: Kindle, Kindle Unlimited, gedruckte Ausgabe (Taschenbuch)\n\n LESERMEINUNGEN Auszug und Übersetzung aus den Rezensionen der englischen Ausgabe auf Goodreads:\n«Eine unglaublich schöne Geschichte, die von Beginn weg ein Lächeln auf dein Gesicht zaubert und es bis zum Ende und sogar noch länger dort hält.»\n\n«Ich habe jedes Wort in diesem Buch genossen. Es war sehr gut geschrieben und temporeich, und wird durch eine gute Liebesgeschichte abgerundet.»\n\n«Dies ist ein großartiges Buch mit vielen neuen Fantasy-Ideen, das in seiner eigenen Welt spielt. Ich konnte es kaum weglegen. Ich liebte die Figuren, das Rätsel und den Humor und las es in einem Zug.»\n\n«Ich liebe die Ausgangslage dieses Buches und wie dem Attentäter die Wahl zwischen Erlösung und Tod gegeben wird. Die Geschichte ist innovativ und thematisiert, wie die Zivilisation im Grunde gleich bleibt, sogar über sechstausend Jahre hinweg.»\nAuszug und Übersetzung aus den Rezensionen der englischen Ausgabe auf Amazon.de:\n«Ich konnte das Buch nicht weglegen ... als sich die Geschichte vom Wolf des Südens entwickelte, hielt sie mich zutiefst gefangen. Die Rätsel und Wendungen der Geschichte sind gut geplant und einige der Ereignisse überraschend.»\n\n\n\n WEITERE BÜCHER VON ISA DAY Fantasy-Serie «Der Weg des Heilers»Der verletzte Himmel (Ban",
  "genres": [
    "Romance",
    "Fantasy"
  ],
  "author": "Isa Day",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/42736873-wolf-des-s-dens-die-treppen-der-ewigkeit-2"
}