{
  "title": "Murder at Crossways",
  "description": "For fans of HBO’s The Gilded Age, explore the dark side of the alluring world of America’s 19th century elite in this gripping series of riveting mysteries…In late August 1898, reporter Emma Cross attends the final fête of the Newport social season and discovers the party's over for a visiting prince . . .   The days are getting shorter as summer's end approaches, which means it's time for the Harvest Festival, the last big event of the season, held by Mamie Fish, wife of millionaire railroad tycoon Stuyvesant Fish, at their grand \"cottage,\" Crossways. The neocolonial mansion is decked out in artificial autumn splendor, and an extravagant scavenger hunt will be held. But the crowning jewel of the evening will be the guest of honor, Prince Otto of Austria.   As acting editor-in-chief of the Newport Messenger, Emma had hoped to leave her days as a society reporter behind her. But at the last moment, she must fill in and attend the Harvest Festival. With nearly every eligible daughter of Newport high society in attendance, Emma can almost hear romantic dreams shattering like glass slippers when the prince fails to appear. The next morning, he is found dead in the side garden at Crossways, making it clear a murderer crashed the party.   The prince has been stabbed in the same manner as another man, recently found on nearby Bailey's Beach—who strongly resembles Emma's half-brother Brady's father, presumed dead for nearly thirty years after a yachting mishap. As Emma investigates a connection between the two victims, she is joined on the hunt by Mamie Fish herself. But they must hurry—before the killer slips away like the fading summer . . .",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Cozy Mystery",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Cozy"
  ],
  "author": "Alyssa Maxwell",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/42749176-murder-at-crossways"
}