{
  "title": "Enchanted Ink",
  "description": "From beloved romance author, Robin Lynn, comes a hotly-anticipated, fantastical adventure in art, life, and love that you won’t want to miss.This is the original, SPICY VERSION! For a CLEANED-UP version with no adult content, please click the author's name to see more book options!When it comes to transformation, magic only fixes what's skin deep… In a world where an artist's magic brings tattoos to life, ink gone wrong can spell lasting heartache for those unlucky enough to experience it. Jaded and cynical on both life and love, tattoo artist Ashton Andrews is about to find out that even the most deeply-etched scars can be transformed into something beautiful when the right person is holding the pen. Having carried the burden of intentionally-ruined ink on his skin (and the matching scars on his psyche that come with such betrayal), Ashton is understandably reluctant to trust. He’s entirely content to bury his nose in the fantasy worlds created by his favorite author, rather than risk his heart in the real one. …On the other hand, he would like his tattoo fixed. Enter Link magical tattoo artist extraordinaire, devastatingly handsome media darling, and co-owner of the famed tattoo studio, Soul Survivor . Ashton knows that Link has the artistic chops to repair his skin, but is completely unprepared for the charming, persistent, and impossibly understanding man to find a place inside his heart. Through working together, Ashton begins to realize that there’s more to Link than his public persona, the art on his body, and the image he’s created that only goes skin-deep. Link has his own scars to heal, but with a charm or two, a dash of creativity, and equal leaps of faith, perhaps the enchanted ink the two of them create together will be the beginning of something positively magical. ___________________Notes from If you Fantasy, magic, extensive world-building, tattoos and tattoo artists, Hurt/Comfort, profound instant connections, Meet-Cutes, Secret Identities, Celebrities, HEAs, and MLM romances with spice, intimacy, and affection, this is the story for you! Using the art of tattooing as a metaphor for life, “Enchanted Ink” makes it a mission to show even the most cynical and scarred of us that it’s possible to heal, to find love, and that it’s never too late to start all over again.I'm a 36-year-old queer, autistic mom and a disabled former firefighter, paramedic, and registered nurse who writes with the goal of reflecting the queer community in media, because everyone deserves to see relatable, imperfect main character mirrors simply existing and getting their happy endings.",
  "genres": [
    "M M Romance",
    "Urban Fantasy",
    "Romance",
    "Magic"
  ],
  "author": "Robin   Lynn",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/123680355-enchanted-ink"
}