{
  "title": "The Art of Literary Research",
  "description": "Since The Art of Literary Research was first published in 1963, it has been the established guide to the purposes, methods, and pleasures of research in English and American literature. It is the essential companion for courses in bibliography and research techniques and for programs in independent study, advanced composition, and undergraduate honors. For interested readers who have other vocational plans, its authors-experienced researchers themselves-provide an intimate view of the way professional scholars go about their specialized and challenging tasks. This extensively revised Fourth Edition takes full account of recent developments that have virtually revolutionized certain important areas of the discipline. The computer, as newly written pages demonstrate, not only has eliminated much of the drudgery formerly associated with the gathering, storage, and retrieval of raw data but has made possible many analytical and lexical operations that had been beyond human capacity, yet without diminishing the amount of sheer brain work still required to produce a genuine contribution to knowledge. The book also suggests that \"traditional\" literary studies, freshly evaluated, are compatible with the current emphasis on critical theory, not inimical to it. The ongoing revision of the literary canon under the impact of women's studies, African-American studies, and other movements, as well as the intensified scholarly and critical interest in present-day writers, is reflected in the book's hundreds of illustrative examples, extensive lists of several related books and articles, and hands-on exercises. The exercises range from the simple, short answer type that offer practice in the use of secondary materials such as can be found in any college library, to projects that may occupy a number of weeks of research in primary sources and are geared to the extensive holdings of large university libraries. The basic rationale and structure of the book, having proved themselves in previous editions, remain unchanged. The first half outlines the principles underlying the critical examination of evidence and describes in detail the chief branches of literary inquiry. Further chapters offer practical advice on bibliographical procedure and note-taking, particularly as these are made more efficient by electronic aids, and on the writing of scholarly papers (in one of the best discussions of the craft of expository prose t be found in any textbook); guide the student through the great American and British libraries whose stocks of books and manuscripts are indispensable to original literary research; and reviews the rewards, obligations, and ethics of the profession.",
  "genres": [
    "Nonfiction",
    "Research Methods",
    "Grad School",
    "Literary Criticism",
    "American",
    "Reference"
  ],
  "author": "Richard D. Altick",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/427689.The_Art_of_Literary_Research"
}