{
  "title": "The Billionaire's Soccer Harem",
  "description": "English property billionaire, Enoch Nock, invites eleven female soccer players from around the world to his private Asian island for a training camp. Aged between 18 and 24, he has gathered: Two Americans, Samantha and Maggie. English girl, Nancy. Scottish lass, Caroline. From the Philippines, Shanti. Frenchwoman, Vanessa. Swedish girl, Anne-Britt. Christina from Denmark. Jenny from Argentina. Russian, Lila, and Australian, Victoria. After following all the girls’ domestic and romantic lives before and after they receive their invitations, and seeing Enoch going about his life and business in London, they all fly out to the secluded Indonesian island retreat. All the girls have their own reasons for accepting the invitation, but they are united in their admiration for the hunky tycoon. Between football training, all manner of shenanigans take place. Enoch lives out his fantasies with his willing guests. The girls are being well paid, and earn their money, but in the end they see the real Enoch and come to like him as a friend, before the shocking twist at the end.Part Two: Within the same cover, the story is repeated, only this time with the genders of the characters swapped over.English property billionaire, Lulu Khoo, invites eleven male soccer players from around the world to her private Asian island for a training camp. Aged between 18 and 24, she has gathered: Two Americans, Bryan and Badou. English guy, Lee. Scot, Tommy. From the Philippines, Don. Frenchman, Olivier. Swedish guy, Victor. Niklas from Denmark. Mauricio from Argentina. Russian, Nikolai, and Australian, Darren. After following all the guys’ domestic and romantic lives before and after they receive their invitations, and seeing Lulu going about her life and business in London, they all fly out to the secluded Indonesian island retreat. All the guys have their own reasons for accepting the invitation, but they are united in their admiration for the gorgeous tycoon. Between football training, all manner of shenanigans take place. Lulu lives out her fantasies with her willing guests. The guys are being well paid, and earn their money, but in the end they see the real Lulu and come to like her as a friend, before the shocking twist at the end.",
  "genres": [],
  "author": "Hope Ikin",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/42774089-the-billionaire-s-soccer-harem"
}