{
  "title": "Dark Blonde: Poems",
  "description": "Waring has worked as a neo-natal intensive care nurse and as Writer-in-Residence at Children's National Medical Center in Washington D.C. Her first collection of poetry, Refuge, won the Associated Writing Program's Award for Poetry in 1989, the Washington Prize in 1991, and was cited by Publishers Weekly as one of the best books of 1990. Her second collection Dark Blonde received the San Francisco Poetry Center Poetry Prize and the Larry Levis Reading Prize in 1997. It was published by Louisville's Sarabande Books.\"Drawing from her work as a neonatal nurse and from some more common experiences (e.g. nervous breakdowns, incest and poverty), Waring exhibits the street-smart ear and unflinching eye that made her first collection, Refuge, one of PW's Best Books of 1990. The images and headlong rhythms of these new poems exert a wide-ranging, often irresistible pull.\"-Publishers Weekly (starred review)\"Waring creates a voice that we feel we can trust to lead us to the center of an experience, maybe because her language never feels artificial but seems to grow naturally out of the situation it presents. The remarkable range of subjects and characters in Waring's poems leads to an equally remarkable variety of tones and vocabularies.\"-Word House, Baltimore's Literary Calendar\"When Belle Waring reads her poetry, the jazz-inflected words escape her mouth like a Lester Young solo: quietly, melodically, forcefully. . . . she provides weight to each short line, drawing out her words like sensuous kisses. Her work is also punctuated with politics and humor.\"-D.C. City Paper\"Poetry, Robert Frost once said, is a way of taking life by the throat. It is in this tradition that poet and nurse Belle Waring approaches her craft-seizing difficult subjects and holding them in time. . . . \"-SalonWaring has written a collection that doesn't renege on us the promise of her first book and indeed has honed her craft to include a wider range of tonal shifts and allow for a finer lyricism while not losing the syncopated snap and humor of her earlier voice.\"-Indiana Review",
  "genres": [
    "Poetry"
  ],
  "author": "Belle Waring",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/427706.Dark_Blonde"
}