{
  "title": "Forever Across the Marsh",
  "description": "Moms love it, but Dads love it more. Featured by Savannah Morning News, Live 5 WCSC Charleston, and many others, this #1 Amazon Best Seller delivers a NEW & DIFFERENT book for the OPEN and CURIOUS mind. Loved by those who enjoy the works of Mark Twain, Erma Bombeck, and Bill Bryson.\"WOW! What a book! I read about 10 books a month and this one was by far one of the best I have read. I laughed, I cried and even got mad. This is a great read!\"GOOGLE \"Best Southern Fiction\" and you'll likely find this near the top of Amazon's latest list, often before Oprah's Book Club books.The two award-winning narrators couldn’t get through it without breaking down. “I was sobbing and ugly crying by the end. It was an incredibly beautiful story,” - Joe Hempel (Winner of 2018 Listeners Choice Award). “I had to stop and walk away. I couldn’t finish ONE page.”FROM THE AUTHOR: Readers often ask, \"Why did you write this book?\" First, I wanted to contribute something very different to literature, combining wit and depth as part of a powerful story. I chose to intertwine short stories in a way that converges at the end as part of a single story. I know of no books that have done this (and I get both criticism and praise for trying this approach). For sure, the book is like no others. Second, I wrote it at a time when my family was experiencing tragedy. We were also adjusting from military life and trying to raise three young children. In short, it was chaos. It took that experience for me to realize just how many parents live, at times, in total chaos. I was not alone. Humor (sometimes the only medicine) helped us get through our trials—that and treating others with respect and kindness, which is almost always returned. Anyway, that's the short version. I hope you take a chance on this new and different type of story. Best, JeffTHE STORY: It's a tale about the power of hope and the importance of knowing what matters most. But that’s not all. There are dark forces about the marsh. Melvin Scott (a family man) and others can feel their presence. Scott doesn’t realize he’s on a collision course with a long dormant fear. After an unexpected encounter with a bully from his childhood, Scott senses that he must once again face that enemy from his past. But this time, they’re not children anymore.Connect Savannah News & Opinion: \"The magic of the marsh is on full display in Forever Across The Marsh. Truly, the book is unique in that it deftly weaves seemingly separate stories together into one story. Humor is a major part of Forever Across The Marsh, but that’s just one factor. . . .The book also rolls in some deeper meanings. . . .\"While Midnight in the Garden of Good and Evil shines on the city of Savannah, Forever Across The Marsh turns its gaze on the vast, alluring marsh. Simply put, there is nothing like this genre-defying novel. Forever Across The Marsh is an experience.What People Are Saying\"I’ve been a reader my entire life. Couldn't put it down. Bet you can't either. The author has successfully woven an inspiring, relatable, serious and funny tale that makes you NEED to know the outcome. And probably the most successful part of this book is the humor.\" - Mike\"I haven't laughed that much in years and I read this until 5:00 in the morning for I just couldn't stop reading and I am a 87 year OLD woman.\" -  Nan\"I was given this book as a Christmas gift... She said it 'spoke' to her and after reading a few lines she knew she had found my gift. This author has done an amazing job weaving a story that I couldn't put down. He took me on an emotional roller coaster from laughing out loud to someone must have been cutting onions nearby. I LOVED it, incredible fun, and I'm truly grateful to my daughter-in-law and Mr. Pearson for a 5 star gift!\" - Dave",
  "genres": [
    "Fiction",
    "Book Club",
    "Audiobook",
    "Christian Fiction"
  ],
  "author": "Jeff   Pearson",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/42764592-forever-across-the-marsh"
}