{
  "title": "Crescendo: The Story of a Musical Genius Who Forever Changed a Southern Town",
  "description": "A story of mercy, miracles, and melody—and above all else: love.During the Great Depression, Fred Allen is born poor and hungry in the shadow of rural Georgia’s infamous cotton mills. By the time Fred is three years old, he can play hymns on the piano without missing a note. In kindergarten, he amazes adults with Chopin. Terrified that Fred’s genius is proof of a curse, his parents lock away the piano.Cut off from his only source of joy, little Fred sinks into the chasms of neglect, depression, and hunger. Then Eleanor, a woman just released from prison for attempted murder, rents a room in his family’s deteriorating home. Under her fierce eye, Fred is protected, fed, and loved. “You gotta find a way to get out,” Eleanor says. “You were born for so much more than this.”Fred undertakes an arduous but miraculous journey through the Juilliard School in New York City, Union Theological Seminary, Columbia University, and eventually the professional music scene. With the help of a few miracles, he climbs the ladder of success, marries, becomes a father and a scholar, and establishes an enviable reputation as a Grammy-nominated music producer.Then in heartbreaking speed, Fred’s past catches up with him, and his family becomes divided. He must choose either to pursue his dreams of fame and success or love.But miracles aren’t just for those with big-city dreams. In Thomasville, Georgia, amid the wreckage of his history, Fred and his resilient wife, Winnie, reassemble the pieces of their lives and encounter what just might be the greatest miracle yet—not just for them but for the entire town. This inspiring story is sure to encourage anyone who has ever hoped their creative abilities might touch the lives of others.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Music",
    "Book Club",
    "Inspirational",
    "Family"
  ],
  "author": "Allen Cheney",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/42772055-crescendo"
}