{
  "title": "Until You Loved Me: An Interracial, Billionaire Romance",
  "description": "PROLOGUEA dead fiance.A devastating billionaire.A homeless, single mom.All roads lead to love.Billionaire Javelin, aka “Jav,” Montague had never met a woman like Serena Luckett. She intrigued him, he desired her and what Jav Montague wanted, Jav Montague usually got ... until Serena.***The last thing down-on-her-luck, single mom Serena Luckett was in the market for was a relationship -- of any kind, especially with the likes of Jav Montague. She knew his type all too well.At Eastside Prep, the exclusive private school she'd attended years ago, she saw first-hand the arrogance of the rich, especially the boys. They thought they were entitled to whatever and whomever they wanted. They grew up to be men who were used to using women and discarding them when they tired of them. Men like Jav Montague.No thanks! Serena vowed.While she was grateful for what Jav had done for her, she wanted nothing more from him. At least that's what she told herself to keep from falling for him. And the longer she and her daughter remained under his roof, the harder it was to make herself believe.***“This is wrong. Wrong!” Serena screamed. “The only crime I’ve committed is being poor. You can’t take my baby! You can’t do this,” she ended on a desperate whisper, reaching for Kayla again.A struggle ensued and Kayla was finally whisked away from her. Serena's guttural screams competed with her daughter’s more heartbreaking Mommy! Mommy! cries, bringing hundreds of eyes in the station to their little corner, including the cool, slate-grey orbs of billionaire Jav Montague.***It hadn’t even been a year since Keith, her fiancé, had been killed. She had experienced living on the edge of poverty before she met Keith, but she had no idea how quickly things could plunge headlong into it when the financial rug is pulled out from under you.Within six months of his death, she and her daughter found themselves homeless, living in her car.And tonight, but for Jav stepping in, she could have lost her daughter to foster care, possibly forever. Serena couldn't believe he'd done what he did.“Why would you put yourself on the line like that for a perfect stranger?” Serena asked.“To be perfectly honest, I did it for your daughter,” Jav explained. “No child that young should be separated from a loving parent,” he said, Kayla’s screams ringing in his ears once again.Serena clasped Kayla’s hand tighter, his frankness disarming her.“I happen to know something about that,” Jav continued, a flicker of sadness in his eyes.A pang of guilt shot through Serena at her undeniable attraction to her rescuer. She was still grieving one love. How could she be so stirred by another?",
  "genres": [],
  "author": "Yuwanda Black",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/42768225-until-you-loved-me"
}