{
  "title": "Salt in My Soul: An Unfinished Life",
  "description": "The diaries of a remarkable young woman who was determined to live a meaningful and happy life despite her struggle with cystic fibrosis and a rare superbug—from age fifteen to her death at the age of twenty-five“Captures the heartbreaking beauty of being alive.”—Beck Dorey-Stein, New York Times bestselling author of From the Corner of the OvalDiagnosed with cystic fibrosis at the age of three, Mallory Smith grew up to be a determined, talented young woman who inspired others even as she privately raged against her illness. Despite the daily challenges of endless medical treatments and a deep understanding that she’d never lead a normal life, Mallory was determined to “Live Happy,” a mantra she followed until her death. Mallory worked hard to make the most out of the limited time she had, graduating Phi Beta Kappa from Stanford University, becoming a cystic fibrosis advocate well known in the CF community, and embarking on a career as a professional writer. Along the way, she cultivated countless intimate friendships and ultimately found love.For more than ten years, Mallory recorded her thoughts and observations about struggles and feelings too personal to share during her life, leaving instructions for her mother to publish her work posthumously. She hoped that her writing would offer insight to those living with, or loving someone with, chronic illness.What emerges is a powerful and inspiring portrait of a brave young woman and blossoming writer who did not allow herself to be defined by disease. Her words offer comfort and hope to readers, even as she herself was facing death. Salt in My Soul is a beautifully crafted, intimate, and poignant tribute to a short life well lived—and a call for all of us to embrace our own lives as fully as possible.Advance praise for Salt in My Soul“This is a deeply moving book full of wisdom about health, life, and love—and about the importance of finding happiness wherever and whenever we can. It broke my heart but also inspired me to make the most of every day.” —Will Schwalbe, New York Times bestselling author of The End of Your Life Book Club“A beautiful, brave, unsparingly insightful account of a courageous girl who becomes a woman warrior and fights for her life while living it fully.” —Eric Lax, author of The Mold in Dr. Florey’s Coat; x 8.25 inches",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Medical",
    "Medicine",
    "Health",
    "Biography Memoir"
  ],
  "author": "Mallory Smith",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/42790791-salt-in-my-soul"
}