{
  "title": "A nő",
  "description": "Dr. Csernus Imre sajátos munkamódszerei és egyéni stílusa révén megítélése meglehetősen ellentmondásos mind a kollégái, mind páciensei körében. Munkájával kapcsolatban a hitvallása a következő:„Teljesen mindegy, hogy az elégedetlenség, a feszültség kompenzálása alkohollal, gyógyszerrel, droggal, munkába való meneküléssel, játékkal, támaszkodással történik, valójában a realitástól való menekülésről szól a sztorija. Ön dönt, én asszisztálok.”Hogy kinek asszisztál a legújabb könyvében?„Ez a könyv, ha minden összeáll, a NŐ-ről fog szólni, ami a férfiak imádatának a tárgya, az örök és megfoghatatlan csoda, amit már sokan leírtak és megfogalmaztak. Én meg arra vagyok kíváncsi, hogy hogyan lesz valakiből jó Nő! Nehéz téma, de ahogy megfigyeltem, ez mindkét nemet egyformán izgatja.” Szóval igen, Önöknek, kedves nőtársaim és persze, hogy Önöknek is, a teremtés koronáinak, drága férfiak! És miért lesz érdemes elolvasni?„Ami tény, a könyv elolvasása senkit sem fog jobb nővé tenni! Ezt felejtsük el! Kihangsúlyozom: az elolvasása. Az elolvasás lehet, hogy felhívja az emberek – legyenek akár nőneműek vagy hímnemek – figyelmét bizonyos dolgokra, folyamatokra, esetlegesen információtöbbletet ad. De azzal már illik valamit kezdeni a gyakorlatban is, az illető saját életében. Nagyon sok ember olvas el különböző önismereti figyelemfelhívó könyveket, s akkor azt gondolják, így sokkal több pénzt fognak keresni, meg sokkal jobb emberek lesznek. Sajnos, ez nem működik. Az elolvasott és felismert dolgok gyakorlati alkalmazása azt teljesen más.”Csernus Imre bevállalta, és megírta azt a könyvet, amit eddig még senki.Vajon tudjuk-e, hogy mitől nő egy nő, és, vajon mitől jó egy nő? Meg tudjuk élni saját nemiségünk, akár férfiak vagyunk, akár nők? Tudunk-e jó példával szolgálni gyermekeinknek? Jól érezzük-e magunkat a saját bőrünkben? Teszünk inkább valamit azért, hogy jobbak lehessünk, vagy csak az irigykedésre futja?Az elolvasás még egy kicsit várat magára, de addig is próbáljon meg válaszolni ezekre a kérdésekre, és gyakorolja a már felismert dolgokat, mert október végén érkezik az újabb tananyag.Ön bevállalja?",
  "genres": [
    "Psychology",
    "Hungarian Literature",
    "Nonfiction"
  ],
  "author": "Imre Csernus",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/4280593-a-n"
}