{
  "title": "Love and Other Mistakes",
  "description": "Jessica Kate’s heartfelt and romantic debut proves that love always comes in God’s own time. Natalie Groves once had big dreams. But soon after her fiancé, Jeremy Walters, inexplicably broke off their engagement and left town, her father was diagnosed with cancer. Now tasked with keeping her family afloat, Natalie’s grand plans have evaporated . . . and God feels very far away. Fast-forward seven years, and Jeremy is back in Charlottesville with an infant son and years of regrets. When his niece, Lili, lands on his doorstep in need of a place to stay, Jeremy needs help—and fast. An internship opening finally presents Natalie a chance at her dream job, but she needs a second income to work around it—and the only offer available is Jeremy’s. They could be the solutions to one another’s problems, provided they don’t kill each other in the process. When they join forces, sparks fly. But they both know there’s a thin line between love and hate . . . and that love will turn out to be the best decision—or the biggest mistake—of all.  This inspirational contemporary read is a standalone novel, though it also features characters from Jessica Kate’s forthcoming novel, A Girl’s Guide to the Outback (coming January 2020). Book approximately 90,000 words. Includes a reading group guide.  “A stunning debut . . . This tale of love and redemption will stay with you long after you've closed the book. A must-read.” —Rachel Hauck, New York Times bestselling author of The Wedding Dress  “Witty. Charming. Heartfelt. I could go on and on about Jessica Kate’s debut novel. From its highly relatable characters to its pitch-perfect dialogue, Love and Other Mistakes is a delightful, romantic read filled with just the right amount of sass. I lost count of the number of times I laughed out loud as I watched Natalie and Jem navigate their relationships, careers, and faith. Definitely one of the most enjoyable books I've read lately, and I can't wait to see what’s next from Jessica Kate!” —Melissa Tagg, Carol Award–winning author of Now and Then and Always and the Walker Family series  “Love and Other Mistakes wraps a poignant and warm look at relationships within a smart, sly, and knowing comedic voice. Readers of Sally Thorne and Bethany Turner will be immediately at home with an all-too-real heroine who balances whip-smart agency with an endearing vulnerability and whose intersection with long-lost Jeremy helps her forge a path to confidence and discover the woman she was always meant to be. Kate’s unputdownable debut recognizes that all human relationships—familial, friendship, romantic—are worth the keen eye and clever insight of her talented pen.” —Rachel McMillan, author of the Van Buren and DeLuca Mysteries  “If you’re looking for a story with sass on top of style, or a fresh voice pumped full of fun, you need to read Love and Other Mistakes. Then after you’ve enjoyed this—and I’m confident you will—make a date with whatever this exciting new author writes next!” —David Rawlings, author of The Baggage Handler",
  "genres": [
    "Romance",
    "Contemporary",
    "Christian Fiction",
    "Christian",
    "Fiction",
    "Christian Romance",
    "Audiobook"
  ],
  "author": "Jessica Kate",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/42802262-love-and-other-mistakes"
}