{
  "title": "McIntyre Security Bodyguard Series - Box Set 2",
  "description": "The McIntyre Security Bodyguard Series - Box Set 2  Continue to fall in love with the characters of the McIntyre Security Bodyguard series! Find out why so many readers are addicted to this series! Download these three full-length novels at a discounted price. Includes three full-length novels in the McIntyre Security Bodyguard Series:  Shattered (Book 4) Imperfect (Book 5) Ruined (Book 6)!  This box set will be enjoyed more if you've read the first three books in the series (Vulnerable, Fearless, and Broken).    Book 4: Shattered  Beth and Shane's story continues in this new installment of the McIntyre Security Bodyguard series. After the death of Beth's childhood abductor, Howard Kline, Beth and Shane are free to begin their life together. ​ Beth's future is looking bright. She's loving her new job at the bookstore and she has an engagement ring on her finger. Everything is perfect until Shane's former girlfriend, Luciana Morelli, enters the picture determined to ruin Shane's chance at happiness. Luciana will stop at nothing to destroy Shane's future, including threatening the life of the one person he can't live without. Fans of Lia and Jonah (from Broken, book 3), Cooper, Sam, and Jamie will enjoy seeing their favorite characters playing significant roles in this installment as well.    Book 5: Imperfect (can be read standalone)  After illness left me permanently scarred, my husband found solace in another woman's arms. So, I left him to start over. But it seems I'm the only one ready to move on. Not even a restraining order can protect me from my ex. But the sexy former Navy SEAL next door can. Despite my new neighbor's war injuries, he's lethal. And I come to find out I'm not the only one hiding scars.   Series Book 6: Ruined (can be read standalone)  Finally! Sam and Cooper's long-awaited story is here... a second chance gay romance, with a guaranteed HEA.  Sam...  Coming out of the closet was easy. Falling in love with a man twice my age was not. Cooper grew up old-school, hiding his true self. He may be the love of my life, but I can't be his dirty little secret any longer. He needs to man up and claim me if he wants to keep me. Just when I think we're finally making progress, his past comes back to bite him with a vengeance. His old demons might just want to kill him, literally. But not if I have anything to say about it. I'll gladly bleed for him.  ************************************************  MORE BOOKS BY APRIL WILSON McIntyre Security Bodyguard Series 1. Vulnerable 2. Fearless 2.5 Shane (a novella) 3. Broken 4. Shattered 5. Imperfect 6. Ruined 7. Hostage McIntyre Security Protectors Series 1. Redeemed 2. Regret (coming early 2019) ... and lots more. Stay tuned!",
  "genres": [],
  "author": "April  Wilson",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/42791866-mcintyre-security-bodyguard-series---box-set-2"
}