{
  "title": "Hey Girl It's Ok To Swallow",
  "description": "Same book new look!Introduction        \"Hell no! Don't even ASK me anything like that!\", \"I don't go down on men, only sluts do that\", \"You want me to do what? And swallow what?\", \"I've NEVER done that, I Swear!\"     These are just a few of the phrasesused by women who refuse to give their man a blow job. They are convinced that the entire male genital area is gross and therefore must be avoided at all cost when it comes to anything oral. Sadly enough these same women demand that a man not only go down on them butto give multiple comatose orgasms all while swallowing up every bit of the juices they excrete. There are also the women who fall in the opposite of this category. They won't even let a man's face even come near their nether regions for fear that he will ask that the favor bereturned, as he rightly should. And so they have given up that part of sex altogether. I'm here to tell you girl, you are missing out!     Then there are the ones who can suck the skin off of a dick but refuse to admit it to anyone. They even have the nerve to put down other women who talk about their own personal experiences on the subject. And let's not forget the lady who WILL actually go down on her man but she also secretly hates doing it. The only reason she does it is because he wants it. He usually has to ask for it,or should I say beg for it. And this usually results in her bobbing her head up and down like a robot on his member and forgetting every other part of his body. The end result is not a pleasurable experience for either party.     Besides getting 50 of the hottest blow job tipsthat are guaranteed to press every button on your man's body; this series of The Love Den Diaries Volume 2 we will cover issues such some women are experts at the \"craft,\" \"superheads\" if you will, and some are rank amateurs.Getting a better understanding as to why to women even in this day and age still view giving head to a man as taboo.The chapter for the men \"Getting Your Girl To Go Down\" - find out what YOU could be doing fellas to discourage your lady from giving you headTips for the beginners as well as some advanced moves for the seasoned veterans that will have his body exploding with pleasure.How to \"mentally\" and \"physically\" prepare to do the deed.The \"swallowing\" double standard.Exploring the possibility of giving a man oral sex that's gratifying for BOTHparties. As well as picking up on cues and body language that let youknow you're definitely hitting his \"hot spot.\"Learning how to effectively communicate with your partner to create a bond that will last long beyond the bedroom.      So with that being said ladies, I humbly ask you to loosen your jaws and your minds. And prepare to \"blow\" his socks off!Midnite Love GET YOUR MONEY'S WORTH! DON'T BE FOOLED BY \"PAMPHLETS\" ON THE SUBJECT",
  "genres": [
    "Self Help"
  ],
  "author": "Midnite Love",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/12368484-hey-girl-it-s-ok-to-swallow"
}