{
  "title": "Towers of Gold: How One Jewish Immigrant Named Isaias Hellman Created California",
  "description": "Isaias Hellman, a Jewish immigrant, arrived in California in 1859 with very little money in his pocket and his brother Herman by his side. By the time he died, he had effectively transformed Los Angeles into the modern metropolis we see today. In Frances Dinkelspiel's groundbreaking history, the early days of California are seen through the life of a man who started out as a simple store owner only to become California's premier money-man of the late 19th and early 20th century. Growing up as a young immigrant, Hellman quickly learned the use to which \"capital\" could be put, founding LA's Farmers and Merchants Bank, that city's first successful bank, and transforming Wells Fargo into one of the West's biggest financial institutions. He invested money with Henry Huntington to build trolley lines, lent Edward Doheney the funds that led him to discover California's huge oil reserves, and assisted Harrison Gary Otis in acquiring full ownership of the Los Angeles Times. Hellman led the building of Los Angeles' first synagogue, the Wilshire Boulevard Temple, helped start the University of Southern California and served as Regent of the University of California. His influence, however, was not limited to Los Angeles. He controlled the California wine industry for almost twenty years and, after San Francisco's devastating 1906 earthquake and fire, calmed the financial markets there in order to help that great city rise from the ashes. With all of these accomplishments, Isaias Hellman almost single-handedly brought California into modernity. Ripe with great historical events that filled the early days of California such as the Gold Rush and the San Francisco earthquake, Towers of Gold brings to life the transformation of California from a frontier society whose economy was driven by the barter of hides and exchange of gold dust into a vibrant state with the strongest economy in the nation.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Business",
    "American History",
    "Entrepreneurship",
    "Autobiography"
  ],
  "author": "Frances Dinkelspiel",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/4283645-towers-of-gold"
}