{
  "title": "On Caristo's Watch",
  "description": "Tony Caristo was just minding his own business, waiting for his selfish bullet-magnet of a best friend to get out of surgery, when the sexiest nurse he'd ever seen walked right up to him, all luscious figured. All she was missing was a fig leaf and a snake around her shoulders. Rather than offering him the knowledge of the gods, she told him off with an Irish-lilted wit. His interest absolutely piqued, he realised he'd have to do something about her, pretty damn quick. Tony wasn't a man given to waiting around for good things to happen to him. And Lydia was all good, every single, five foot eight, double F-cupped inch of her. When Lydia asks Nick for a favour, Nick reminds him just what a good friend he is by letting Tony handle it. And he can't wait. Lydia Mills hasn't the time for nonsense, especially being in sole charge of her younger brother. All she needs to do is get him into university without getting him killed. She's spent the last month literally trying to kick some sense into her ex-boyfriend so he wouldn't get back at her through her brother. Now, Lydia decides to use a bigger stick to change said ex-boyfriend's mind. Turning to Nick Da Canaveze for help is a last resort, but it was like someone had gifted her with a nuclear weapon. Nick handed over Tony to do the hard work, completely convinced that Lydia would come through her troubles in one piece. If Tony didn't behave himself, there was no telling the same could be said for him. Always the protector and never the protected, Lydia is surprised by just how much she has in common with the Giant. For all his stealth, intelligence and inappropriate wit, Tony is undeniably, irresistibly unforgettable. On Caristo's Watch is a tale featuring characters from Windows, now part of the Italian Knights Collection, showing that behind every criminal mastermind is a woman who will drive him to distraction with a look, a quip and a dress made to start all sorts of trouble.",
  "genres": [
    "Romance",
    "Interracial Romance",
    "Contemporary",
    "Erotica",
    "Humor",
    "Drama",
    "Crime"
  ],
  "author": "Billy London",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/12368569-on-caristo-s-watch"
}