{
  "title": "The Ghost Garden: Inside the Lives of Schizophrenia's Feared and Forgotten",
  "description": "Susan Doherty's book brings us a population of lost souls, ill-served by society, feared, shunted from locked wards to rooming houses to the streets to jail and back again. For the past ten years, some of the people who cycle in and out of the severely ill wards of the Douglas Institute in Montreal, have found a friend in Susan, who volunteers on the ward, and then follows her friends out into the world as they struggle to get through their days.  With their full cooperation, she brings us their stories, which challenge the ways we think about people with mental illness on every page. The spine of the book is the life of Caroline Evans (not her real name), a woman in her early sixties whom Susan has known since she was a bright and sunny school girl. Caroline has given Susan complete access to her medical files and her court records; through her, we experience what living with schizophrenia over time is really like. She has been through it all, including the way the justice system treats the severely mentally ill: at one point, she believed that she could save her roommate from the devil by pouring boiling water into her ear... Susan interleaves Caroline's story with vignettes about her other friends, human stories that reveal their hopes, their circumstances, their personalities, their humanity. She's found that if she can hang in through the first ten to fifteen minutes of every coffee date with someone in the grip of psychosis, then true communication results. Their \"madness\" is not otherworldly: instead it tells us something about how they're surviving their lives and what they've been through.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Biography",
    "Mental Illness",
    "Memoir",
    "Canada"
  ],
  "author": "Susan Doherty",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/42816331-the-ghost-garden"
}