{
  "title": "Witches Brew",
  "description": "Fae are missing all over Boston, and apparently, no one else is suicidal enough to look into it.Good thing Quinn MacKenna - black magic arms dealer and Fae half-breed - has been searching for a way to earn back some of Boston’s goodwill after almost destroying the city...twice. Besides, favors for the Fae usually pay dividends if you play your cards right....As long as the Fae don’t double-cross or otherwise backstab you. But that hardly ever happens....Thankfully, Quinn has Robin Redcap to back her up - between his skill at navigating Fae politics and his penchant for extreme, brutal violence, it’s a match made in Heaven. Or Hell.But the only evidence they have to go on is a crime scene laden with ritualistic ingredients and blood - lots and lots of blood - leading Quinn to suspect witchcraft.Except the witches are a tight-knit community who don’t appreciate Quinn’s intrusion - even when all she wants to do is help. Simply put, what happens in the coven stays in the coven.The situation grows murkier and deadlier by the minute as Quinn finds herself cauldron-deep in a swirl of betrayal, conspiracy, and vengeance.Especially when she discovers who is really stirring the pot, and that it might all stem from an unfulfilled promise made by a certain trigger-happy redhead regarding a certain magic-slinging wizard in St. Louis. And the Fae put pretty big stock in promises and agreements.Double, double, toil and trouble....This little oath-breaker is in big, big trouble.Quinn is the newest antihero in the worldwide best-selling Temple Verse by Shayne Silvers. Join Cameron O’Connell and Shayne at the literary bar to sip a dirty cocktail of feisty Irish brogue - with an unhealthy splash of monsters - today!",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Magic",
    "Urban",
    "Fae",
    "Vampires"
  ],
  "author": "Shayne Silvers",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/42817093-witches-brew"
}