{
  "title": "Beyond Autism: My Life with Lina",
  "description": "A Passionate Memoir about Life with a Teenage Daughter with Severe Autism, Following the Progress of Acclaimed Book, Finding Lina.Like her passionate first book, Finding Lina, about her daughter with severe autism, Helena Hjalmarsson brings an intensity of purpose and love to her second memoir about Lina, Beyond Autism . Lina’s world is one of excruciating challenges. Helena’s world is the same, but with her own insights, indominable spirit, and amazing clarity she sheds light and hope for other parents, siblings and caretakers of children with autism, as well as the children with autism themselves. She unflinchingly examines “the paradoxical nature of autism, the never-ending mystery of who our children are and how they got here, in the middle of this unfathomable hurricane of leaky guts, inflammation, yeast, autoimmune disorders, seizures, sensory breakdown, loss of words, physical freedom, sleep, friends, normal life as we are used to refer to it.”Beyond Autism is one of an increasing number of “you are not alone” literary statements from parents of children with autism forwarded to the people whose lives, similarly, often blocks the view of the larger community. Beyond Autism is intended to be a meeting place, of sorts. A smile of recognition. A reason for a little dark joke amongst parents.What Helena recognizes is that whenever Lina is not in mayhem, she is in heaven. “In those times she seems so free of the burdens of a past and a future, so deeply present and accepting of the moment …Whenever she is not suffering, it seems to me that she is at that enlightened, awakened place that most people struggle for a whole life time to catch a glimpse of.” It’s that glimpse that Helene explores, and shares for all those who want, too, to catch and gain insight into the lives of those with autism and those who love them.",
  "genres": [],
  "author": "Helena Hjalmarsson",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/42833960-beyond-autism"
}