{
  "title": "No Place Like Home: A Black Briton's Journey Through the American South",
  "description": "In 1997 Gary Younge explored the American South by retracing the route of the original Freedom Riders of the 1960s. His road trip was a remarkable socio-cultural adventure for an outsider. He was British, journalistically curious, and black.As he traveled by Greyhound bus through the former Confederate states, he experienced an awakening. He felt culturally tied to this strange yet familiar place. Though a Briton by birth and the child of emigrants from Barbados, he felt culturally alien in his native land. In Dixie, however, he met African Americans whose racial distinctiveness was similar to his own. To local blacks he looked like a brother, while sounding intriguingly foreign. As he assessed their political rise in the South, he noted too how African American tradition seemed static and unchanged. It was a refreshing whiff of “home.”Awakened to his own identity as a black in a predominantly white society and absorbed by a sense of southern myth and racial history, he produced this account, a blend of travel writing, historical research, wit, and social commentary. His probing examination of the Southland gives fresh perspective on race relations in America.Originally published in England, No Place Like Home is “more than a piece of travel writing,” praised the London Evening Standard , “[but] a compelling exploration of racial identity and the problems of growing up clever, black, and angry in small-town Stevenage. . . . Younge is a fine journalist―thoroughgoing, clear-minded, and meticulous, and he writes in a measured, lucid prose. . . . Next, please take a trip around the UK, Gary Younge, and write about it. Your country needs you.”",
  "genres": [
    "Nonfiction",
    "Race",
    "Travel",
    "The United States Of America",
    "Journalism",
    "United States",
    "Politics"
  ],
  "author": "Gary Younge",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/428390.No_Place_Like_Home"
}