{
  "title": "143: Love, loss, and other catastrophes",
  "description": "1,4,3 -- love, loss, and other catastrophes.Cam stumbled up the stairs, drunk again. She tried to drown her doubts in the bottle but she knew she couldn't live inside Lee's, Good Housekeeping inspired picture-of-perfection anymore. When Lee confronts her, she can't deny that her spark for adventure has been reignited and lets her \"143\" walk out the door and out of her life.Growing up as a lesbian with an overly dramatic mother and a father who tried everything to keep his wife happy and their family together taught Cam that sometimes \"I love you\" really isn't enough. Her world changed the moment she met Lee and it never stops changing as she explores the world she never knew before.Follow Cam as she navigates through love, loss, and other catastrophes.Readers all over the globe have gotten lost with Cam and found themselves along the way, and debut author, Alicia Sophia has been nominated for 2 Golden Crown Literary Society Goldie Awards for 1,4,3.Hailed by Tracy Plath, author of Thicker than \"First time author Alicia Sophia's debut novel is a wordy feast that I wanted to slow down and savor reading, but had to speed through and devour in a coffee fueled marathon reading because I could not bear to put it down. It's that delicious. Her prose is at times ground glass in a wound in its raw and biting reality, and at other times sultry as a silken scarf sliding on bare skin. She portrays the escalating chain of events hurtling her main character Cam's descent downward into addiction and betrayal with such naked reality Cam becomes both the train wreck you can't look away from and the glorious and hurting friend you ache to save. The believability of the characters and in the moment perfection of each scene make this book one to remember, and read again, and again.\"",
  "genres": [
    "Literary Fiction",
    "LGBT",
    "Romance"
  ],
  "author": "Alicia Sophia",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/42816758-143"
}