{
  "title": "Once Upon a River",
  "description": "From the instant #1 New York Times bestselling author of the “eerie and fascinating” ( USA TODAY ) The Thirteenth Tale comes a “swift and entrancing, profound and beautiful” (Madeline Miller, internationally bestselling author of Circe ) novel about how we explain the world to ourselves, ourselves to others, and the meaning of our lives in a universe that remains impenetrably mysterious.On a dark midwinter’s night in an ancient inn on the river Thames, an extraordinary event takes place. The regulars are telling stories to while away the dark hours, when the door bursts open on a grievously wounded stranger. In his arms is the lifeless body of a small child. Hours later, the girl stirs, takes a breath and returns to life. Is it a miracle? Is it magic? Or can science provide an explanation? These questions have many answers, some of them quite dark indeed.Those who dwell on the river bank apply all their ingenuity to solving the puzzle of the girl who died and lived again, yet as the days pass the mystery only deepens. The child herself is mute and unable to answer the essential Who is she? Where did she come from? And to whom does she belong? But answers proliferate nonetheless.Three families are keen to claim her. A wealthy young mother knows the girl is her kidnapped daughter, missing for two years. A farming family reeling from the discovery of their son’s secret liaison stand ready to welcome their granddaughter. The parson’s housekeeper, humble and isolated, sees in the child the image of her younger sister. But the return of a lost child is not without complications and no matter how heartbreaking the past losses, no matter how precious the child herself, this girl cannot be everyone’s. Each family has mysteries of its own, and many secrets must be revealed before the girl’s identity can be known.Once Upon a River is a glorious tapestry of a book that combines folklore and science, magic and myth. Suspenseful, romantic, and richly atmospheric, this is “a beguiling tale, full of twists and turns like the river at its heart, and just as rich and intriguing” (M.L. Stedman, #1 New York Times bestselling author of The Light Between Oceans ).",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Magical Realism",
    "Mystery",
    "Book Club",
    "Historical"
  ],
  "author": "Diane Setterfield",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/42816401-once-upon-a-river"
}