{
  "title": "Professor Feelgood",
  "description": "Romântico e atual, o aguardado segundo livro da série de Mr. Romance (Masters of Love) traz o humor e os personagens envolventes característicos de Leisa Rayven.Asha Tate é uma ambiciosa assistente editorial. Romântica ao extremo, ela sonha com um amor que a leve às alturas. O homem ideal deve preencher todos os requisitos de sua longa lista – e talvez seja por isso que ela ainda não o tenha encontrado. Mas o romance fica em segundo plano quando o assunto é carreira, e tudo indica que ela está prestes a ser promovida. No entanto, para conseguir o cargo dos seus sonhos, ela deve achar um best-seller que balance o mercado editorial. Ela só não imagina que será balançada com ele.Em busca do próximo sucesso de vendas da editora Whiplash, Asha acaba entrando em contato com o Instagram do misterioso Professor Feelgood, que tem milhões de seguidores e um grande potencial de vendas. Mais do que apenas fotos sensuais de seu incrível corpo, o Professor posta poemas angustiados que atingem em cheio a sua alma. Mas o homem por trás da página acaba sendo bem diferente do que ela imaginava. Claro, seu corpo é lindo e seu rosto é de morrer, mas ele é intenso, arrogante e parece ter raiva do mundo todo – principalmente dela.Logo, o projeto dos sonhos de Asha parece ter tudo para se tornar um grande pesadelo. Para piorar, a atração que parece queimar entre ela e o Professor não ajuda em nada a manter sua cabeça no lugar.Dividida entre traumas do passado, sua carreira ascendente e sentimentos conflitantes, Asha terá que descobrir como publicar um sucesso editorial, resolver suas questões pessoais e, acima de tudo, lidar com o complexo Professor.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary",
    "Friends To Lovers",
    "Second Chance",
    "Contemporary Romance",
    "New Adult"
  ],
  "author": "Leisa Rayven",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/42816520-professor-feelgood"
}