{
  "title": "Seculosity: How Career, Parenting, Technology, Food, Politics, and Romance Became Our New Religion and What to Do about It",
  "description": "Being enough is a universal longing. Seculosity makes the case that being religious is alive and well in modern society. While American organized religion may be declining, the desire to fill the void with everyday life pursuits is another form of worship. David Zahl describes his life as having one foot in the religious and secular worlds, a claim his biography justifies and states \"the marketplace in replacement religion is booming.\" At the heart of our society lies a universal yearning not to be happy so much as to be enough . To fill the emptiness left by religion, humans look to all sorts of activities -- food, family, relationships, social media, elections, social justice movements -- for identity, purpose, and meaning once provided by organized religion. In our striving, we chase a sense of enoughness. But it remains out of reach. Human effort and striving is causing burn out, depression, and anxiety. Even our leisure activities, such as dating and movie watching, become to-do list items and once accomplished we’ll hope to feel contentment with ourselves. Seculosity takes a thoughtful yet light-hearted tour of \"performancism\" and its cousins. Performancism is \"one of the hallmarks of seculosity,\" affecting how we approach everyday life. It cripples us with anxiety (Am I enough?), shame (Do they think I'm enough?), and guilt (Have I done enough?). Performance-based living while admirable will only leave us worn out because when is enough, enough? Zahl challenges the conventional narrative of religious decline claiming society has become religious about busyness and accomplishments. Zahl unmasks the competing loyalties our lives revolve around in a way that is approachable, personal, and accurate. Eventually, Zahl brings readers to a fresh appreciation for grace -- the grace of God in all its countercultural wonder.",
  "genres": [
    "Nonfiction",
    "Theology",
    "Religion",
    "Christian",
    "Faith",
    "Cultural",
    "Christian Living"
  ],
  "author": "David Zahl",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/42818638-seculosity"
}