{
  "title": "The Ghastling: Book Eight",
  "description": "Book 8 is our seasonal edition compiled especially for Hallowe'en & Samhain. In Damien B. Raphael’s story THE SCULPTURE, an artisan suggests that the flesh of a pumpkin is far more forgiving for this type of work than the more traditional turnip – but what exactly has he been commissioned to carve in his dimly-lit studio? Grinning, hand-carved faces light the town in Catrin Kean’s FOGTIME, as children in bedsheets run from door to door swinging rattling buckets. Dressing up as someone else – or something else – and demanding treats is another odd custom that we’ve grown to accept as part of the season. This too is traced to the Celts, who were said to leave offerings of food and drink to placate the fairies, witches, demons and unfortunate souls who wandered between this world and the next on Samhain. Perhaps it isn’t just the young trick-or-treaters, then, that make Mammy lock the doors and pull the curtains.In Alys Hobbs’ IN WE COME, it’s adults who roam the streets disguised – a troupe of actors, to be exact, searching for an audience for their folk play. “Make room, for in we come! We’ve come a-mumming, three-two-one!” However, this troupe’s antics seem to go beyond mere performance, and it may not just be money or food that they’re looking for in exchange. The Celts believed that the sun began to grow weak during Samhain, and so bonfires were lit not just in honour of the dead, but also to guide them on their journey – and keep them away from the living. So when Jenny watches a constellation of flickering lights appear on Kristy Kerruish’s THE HILL, she should probably keep a safe distance – but Trevor has been gone for a while, and it’s all mumbo-jumbo anyway...isn’t it? Mr Fanner certainly hopes not, as he walks AMONG OCTOBER’S FIELDS with the derelict Riverbrook Home for Boys in his sights. Callum McKelvie’s story begins with whispers: the tragic fire, all the children gone and mysterious sounds across the fields at night. Mr Fanner is searching for inspiration for his next ghost story, but he may wish that he had looked elsewhere. Leaving the restless bonfires of Samhain behind, let’s instead turn to the quietness of the fireside, where storytelling has long been the preferred form of entertainment. At Halloween, the attention of the fireside storyteller unsurprisingly turns to ghosts and the macabre, and so we felt it was important to include a selection of tales that, if not specifically Halloween-themed, were befitting of this seasonal tradition. So read aloud if you dare the DIARY OF A DEADMAN by N. A. Wilson, follow Mark Sadler into the sweltering woods in THE POACHER’S BALL and enter Florence Vincent’s THE TEMPLE to experience foreboding in a foreign land. Then, we suggest you gather friends around the campfire to share HOW SHADOWS FALL, C. L. Hanlon’s fresh take on the legend of the vanishing hitchhiker.",
  "genres": [
    "Horror",
    "Fiction"
  ],
  "author": "Rebecca Parfitt",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/42815560-the-ghastling"
}