{
  "title": "Hermetech",
  "description": "The science of orgasmic energy potential, esp. within fixed unit of or relating to properties of orgasmic energy of Hermes traditionally inventor of magic seal. Tech-Green, an environmental movement with quasi-political powers, is doing its best to repair the damaged circuitry of the global village. The earth is dying and there is little that anyone can do to stop it - some sections of Tech-Green assert that Gaiah would be best left to repair herself without the interference of humanity, that man should move off-world to Sky City At Taler's Bump, a small Naturotech religious site, Ari Famber communes with Isis, a satellite acolyte of the goddess Astrada. But there is little Isis can do about Ari s problems. The daughter of one time Tech-Green wunderkind, Ewan Famber, Ari is the product of a ground-breaking experiment that has left her genetically and sexually confused. Ewan has no answers; he is dead. But in Arcady Tkmmuz Malamute lives on - with memories of creations he d rather forget.Seven years ago, Leila Saatchi, leader of Star Eye, promised Ewan that she would find his daughter when the time was right; protect Ari from those who might misunderstand and misuse her. But the natro group are about to take on something neither they nor the Tech-Greens would have ever imagined possible.HERMETECH is a stunning vision of Earth s near-future, a dramatic prediction of the mingling of science and mysticism, from the creator of the Wraeththu. Storm Constantine is the author of more than twenty novels. The Shades of Time and Memory is the fifth of her Wraeththu series. Recent books include The Wraiths of Will and Pleasure, the Magravandias Chronicles trilogy, Silverheart (co-written with Michael Moorcock), the The Oracle Lips short story anthology, and The Thorn Boy and Other Tales of Dark Desire. Storm is also the author of three non-fiction books, is a practicing Reiki master, and operates her own publishing company in the U.K. She lives in Stafford, England, with her husband Jim Hibbert and eight cats, who think they own the house.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "LGBT"
  ],
  "author": "Storm Constantine",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/428403.Hermetech"
}