{
  "title": "Our Women on the Ground: Essays by Arab Women Reporting from the Arab World",
  "description": "Nineteen Arab women journalists speak out about what it’s like to report on their changing homelands in this first-of-its-kind essay collection, with a foreword by CNN chief international correspondent Christiane Amanpour“A stirring, provocative and well-made new anthology . . . that rewrites the hoary rules of the foreign correspondent playbook, deactivating the old clichés.” —Dwight Garner, The New York TimesA growing number of intrepid Arab and Middle Eastern sahafiyat—female journalists—are working tirelessly to shape nuanced narratives about their changing homelands, often risking their lives on the front lines of war. From sexual harassment on the streets of Cairo to the difficulty of traveling without a male relative in Yemen, their challenges are unique—as are their advantages, such as being able to speak candidly with other women at a Syrian medical clinic or with men on Whatsapp who will go on to become ISIS fighters, rebels, or pro-regime soldiers.  In Our Women on the Ground, nineteen of these women tell us, in their own words, about what it’s like to report on conflicts that (quite literally) hit close to home. Their daring and heartfelt stories, told here for the first time, shatter stereotypes about the region’s women and provide an urgently needed perspective on a part of the world that is frequently misunderstood. INCLUDING ESSAYS Donna Abu-Nasr, Aida Alami, Hannah Allam, Jane Arraf, Lina Attalah, Nada Bakri, Shamael Elnoor, Zaina Erhaim, Asmaa al-Ghoul, Hind Hassan, Eman Helal, Zeina Karam, Roula Khalaf, Nour Malas, Hwaida Saad, Amira Al-Sharif, Heba Shibani, Lina Sinjab, and Natacha Yazbeck",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Journalism",
    "Politics",
    "Memoir",
    "History"
  ],
  "author": "Zahra Fatima Hankir",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/42853221-our-women-on-the-ground"
}