{
  "title": "Society Without God: What the Least Religious Nations Can Tell Us About Contentment",
  "description": "\"Silver\" Winner of the 2008 Foreword Magazine Book of the Year Award, Religion Category. Before he began his recent travels, it seemed to Phil Zuckerman as if humans all over the globe were \"getting religion\"—praising deities, performing holy rites, and soberly defending the world from sin. But most residents of Denmark and Sweden, he found, don't worship any god at all, don't pray, and don't give much credence to religious dogma of any kind. Instead of being bastions of sin and corruption, however, as the Christian Right has suggested a godless society would be, these countries are filled with residents who score at the very top of the \"happiness index\" and enjoy their healthy societies, which boast some of the lowest rates of violent crime in the world (along with some of the lowest levels of corruption), excellent educational systems, strong economies, well-supported arts, free health care, egalitarian social policies, outstanding bike paths, and great beer. Zuckerman formally interviewed nearly 150 Danes and Swedes of all ages and educational backgrounds over the course of fourteen months. He was particularly interested in the worldviews of people who live their lives without religious orientation. How do they think about and cope with death? Are they worried about an afterlife? What he found is that nearly all of his interviewees live their lives without much fear of the Grim Reaper or worries about the hereafter. This led him to wonder how and why it is that certain societies are non-religious in a world that seems to be marked by increasing religiosity. Drawing on prominent sociological theories and his own extensive research, Zuckerman ventures some interesting answers. This fascinating approach directly counters the claims of outspoken, conservative American Christians who argue that a society without God would be hell on earth. It is crucial, Zuckerman believes, for Americans to know that \"society without God is not only possible, but it can be quite civil and pleasant.\"",
  "genres": [
    "Religion",
    "Nonfiction",
    "Atheism",
    "Philosophy",
    "Sociology",
    "Science",
    "Politics"
  ],
  "author": "Phil Zuckerman",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/4286013-society-without-god"
}