{
  "title": "Leading at a Higher Level: Blanchard on Leadership and Creating High Performing Organizations",
  "description": "The definitive “Blanchard on Leadership” 25 years of breakthrough leadership insights in one extraordinary book! From The One Minute Manager® to Raving Fans, Ken Blanchard’s books have helped millions of people unleash their power and the potential of everyone around them. The Ken Blanchard Companies has helped thousands of organizations become more people-oriented, customer-centered, and performance-driven. In Leading at a Higher Level, Blanchard and his colleagues have brought together all they've learned about world-class leadership. You'll discover how to create targets and visions based on the “triple bottom line”...and make sure people know who you are, where you’re going, and the values that will guide your journey. Blanchard extends his breakthrough work on delivering legendary customer service and creating “raving fans.” You’ll find the definitive discussion of the renowned Situational Leadership® II techniques for leading yourself, individuals, teams, and entire organizations. Most importantly, Leading at a Higher Level will help you dig deep within, discover the personal “leadership point of view” all great leaders possess– and apply it throughout your entire life. For everyone who wants to become a better leader... ...in any company, any organization, any area of life Set the right targets, follow the right vision Focus on the “bottom lines” that really matter Serve your customers at a higher level Deliver your ideal customer experience, and create “raving fans” Beyond the way of the servant leader Listen, praise, support, guide, and help your people win Lead at a higher level. Lead your people to greatness as you create high performing organizations that make life better for everyone. This book will guide you, inspire you, provoke you, and be your touchstone. Ken Blanchard (coauthor of The One Minute Manager ®) and his colleagues have spent more than 25 years helping good leaders and organizations become great, and stay great . Now, for the first time, they’ve brought together everything they’ve learned about outstanding leadership. Discover how to... Go beyond the short term and zero in on the right target and vision Deliver legendary, maniacal customer service, and earn raving fans Truly empower your people and unleash their incredible potential Ground your leadership in humility and focus on the greater good For a long time, leaders have relied on Ken Blanchard’s insight, wisdom, and practical techniques. Now, he and his colleagues have delivered the leadership classic for a new Leading at a Higher Level. www.LeadingAtAHigherLevel.com",
  "genres": [
    "Leadership",
    "Business",
    "Nonfiction",
    "Management",
    "Self Help",
    "Personal Development",
    "Buisness"
  ],
  "author": "Kenneth H. Blanchard",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/42861.Leading_at_a_Higher_Level"
}