{
  "title": "Eating Her Christmas Cookies",
  "description": "JackIn my perfect world it would always be winter and never Christmas.I despise the holiday. I hate carols, shopping, and pretending to be a perfect family. I walked away from my family, or rather they walked away from me.My heart is like ice—See it creeping up the walls.Oh, wait, no, that’s royal icing. I never should have allowed the Great Christmas Bake-off to film in my tower.And I never, ever, should have agreed to be a judge. ChloeI love Christmas! I love sparkly window decorations, heartwarming holiday movies, and themed coffee. Most of all I love Christmas baking. Even though his company is sponsoring the bake-off show, billionaire Jack Frost claims he hates sweets. But after he tastes my goods I know he'll come begging for more. And wouldn't you know it, that night Jack Frost asked me to come up to his penthouse and give him a special taste of my Christmas cookies. Against my better judgement I went… I baked him my signature gingerbread cookies and of course he ate them up! It should have been a Christmas miracle, but Jack Frost couldn't have come into my life at a worse time. Not only am I broke, but this was my first Christmas after my oma died. Someone is trying to sabotage me in the Great Christmas Bake-off. I'm being stalked by a mall Santa. Sleeping with one of the judges is a disaster waiting to happen. I needed Jack and his washboard abs about as much as I needed that third sticky bun. But when he says in his deep, sexy voice, \"Can you make me some more cookies?\" well stick a candy cane in me I'm done.Eating Her Christmas Cookies is a standalone novel. This 90,000 word steamy holiday romance novel has no cliffhangers but does have a very happily ever after!",
  "genres": [
    "Christmas",
    "Holiday",
    "Romance",
    "Contemporary",
    "Book Club",
    "Contemporary Romance",
    "Chick Lit"
  ],
  "author": "Alina Jacobs",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/42859236-eating-her-christmas-cookies"
}