{
  "title": "The Sapphire Scythe",
  "description": "An alternative cover edition for this ASIN can be found here.\n\nBorn in battle, my birth brought peace. But peace is boring and so is the warlock I’m betrothed to.\n\n\nReal Name: Aria Emanuele\nCode Name:  \nThe Sapphire Scythe\n \nSupe Status: First vampire/Succubus hybrid. Heir to the Aeternae clan.Military status: Top spy and assassin for the Universal Army.I’ve been running from my duties as the heir to the supe kingdom to marry Cade, my intended, and create more hybrid children for centuries. I’ve been playing soldier, spy, assassin, or whatever takes me close to the action instead. My parents and my people think I just need time to sow my royal oats, but I love this too much to give it up.Humans have brought themselves to World War Three. My mission in the Universal Army is to get close to the dictator who caused it. I already suspect he’s got a supe close to him, but I’m keeping it to myself for now. I want to do this myself. I had a mark close to Zimin, the dictator. My mission was simple. Extract information, then kill him. Something went horribly wrong that night. I wake up in a hotel room with a Lycan, a vamp, and a warlock. All trained assassins like me. Seems my dear parents sent them here.There’s also a little catch in there. According to the men in my hotel, nature has given me three mates instead of one. Nature and my parents expect me to pick. Nature has sick sense of humor and seems to know my horrible taste in men. There’s Ronric, the huge Irish Lycan, Rainer, the dark Egyptian Warlock, and Kalon, the swarthy Bulgarian vampire. I had a lot of fun in all three countries before swearing off men from any of those places and refusing to go back.\nNow, I’ve got 3 beautiful men in front of me with all the qualities I want in a man and I have no idea how I’m supposed to pick. \n\n\n​",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Vampires",
    "Magic",
    "Paranormal",
    "Romance",
    "Shapeshifters"
  ],
  "author": "J.B. Trepagnier",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/42869749-the-sapphire-scythe"
}