{
  "title": "My Different Orient; a memoir: about the good, the bad and the ugly side of a life abroad.",
  "description": "When you see the world, the world sees you.\n Dietmar Vogelmann left his country years ago and took a chance, starting a new life in Vietnam. Luckily, his experience in hotel management got him hired at a 5-star beachside resort, but his initial impression was less than favorable. In fact, he wanted to leave as soon as he arrived. But something made him stay. Maybe it was the friendly native population who welcomed him with open arms, or perhaps the endless business opportunities he could see in this small country brimming with potential. It took years, but Vietnam eventually lived up to its magical reputation and changed his life in more ways than one. Through the success and failure of various business ventures, Dietmar learned how determination, a strong work ethic and the support of a loving family can overcome any challenge and desperation. My Different Orient exposes the good, the bad and the ugly side of a life abroad. \n\n Author Statement\n\n «The goal of my book is to give readers a compelling look at culture shock, entrepreneurship and the all-consuming power of love. My experiences are unique yet universal, because we all have something within us that pushes us to strive for greatness. And when love and determination are our foundations, there’s no telling how far we can go.» - Dietmar Vogelmann ------------------------------------------------------------------------------------------------- \n\nReviews & Testimonials\n\n  I was very invested in your story while reading. It was an adventurous read, but still not too out of this world that people wouldn’t be able to relate or even draw inspiration, or maybe even learn from in some ways. The wealth of knowledge via personal experience that Dietmar put in his book will go over well with readers.  - Dominique Brown, Editor at Proofs and Pencils I believe most people can relate to Dietmar. As usually our youthful tendencies get us caught in unwanted situations, but those same dumb tendencies can also lead to something greater than ourselves. As we read his story, we relate to his mentality of wanting to start his own business, be his own boss. Unfortunately, for most people these are simply dreams and whispers never truly made into statements: for Dietmar, though, it was different. The book progresses smoothly as if it were a novel but keeps us hooked as if it were a thriller. -  Joseph Yeng, Entrepreneur",
  "genres": [],
  "author": "Dietmar Vogelmann",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/42876502-my-different-orient-a-memoir"
}