{
  "title": "The Education of an Idealist: A Memoir",
  "description": "Pulitzer Prize winner Samantha Power, widely known as a relentless advocate for promoting human rights, has been heralded by President Barack Obama as one of America's \"foremost thinkers on foreign policy.\"In her memoir, Power offers an urgent response to the question \"What can one person do?\"—and a call for a clearer eye, a kinder heart, and a more open and civil hand in our politics and daily lives. The Education of an Idealist traces Power’s distinctly American journey from immigrant to war correspondent to presidential Cabinet official. In 2005, her critiques of US foreign policy caught the eye of newly elected senator Barack Obama, who invited her to work with him on Capitol Hill and then on his presidential campaign. After Obama was elected president, Power went from being an activist outsider to a government insider, navigating the halls of power while trying to put her ideals into practice. She served for four years as Obama’s human rights adviser, and in 2013, he named her US Ambassador to the United Nations, the youngest American to assume the role.A Pulitzer Prize–winning writer, Power transports us from her childhood in Dublin to the streets of war-torn Bosnia to the White House Situation Room and the world of high-stakes diplomacy. The Education of an Idealist lays bare the battles and defining moments of her life and shows how she juggled the demands of a 24/7 national security job with the challenge of raising two young children. Along the way, she illuminates the intricacies of politics and geopolitics, reminding us how the United States can lead in the world, and why we each have the opportunity to advance the cause of human dignity.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Biography",
    "History",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Samantha Power",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/42872088-the-education-of-an-idealist"
}