{
  "title": "Wild and Crazy Guys: How the Comedy Mavericks of the '80s Changed Hollywood Forever",
  "description": "The behind-the-scenes story of the iconic funnymen who ruled '80s Hollywood—Bill Murray, Steve Martin, Chevy Chase, John Belushi, Dan Aykroyd, and Eddie Murphy—and the beloved films that made them stars, including Animal House, Caddyshack, and Ghostbusters. NAMED ONE OF THE BEST BOOKS OF THE YEAR BY NEW YORK. \"An enjoyable romp that vividly captures the manic ups and downs of the remarkable group of funny folk who gave us a golden age of small and big screen comedy, from SNL to Groundhog Day.\" —Peter Biskind, author of Easy Riders, Raging Bulls. Wild and Crazy Guys opens in 1978 with Chevy Chase and Bill Murray taking bad-tempered swings at each other backstage at Saturday Night Live, and closes 21 years later with the two doing a skit in the same venue, poking fun at each other, their illustrious careers, triumphs and prat falls. In between, Nick de Semlyen takes us on a trip through the tumultuous '80s, delving behind the scenes of movies such as National Lampoon's Vacation, Beverly Hills Cop, The Blues Brothers, Dirty Rotten Scoundrels, and dozens more. Chronicling the off-screen, larger-than-life antics of Bill Murray, Chevy Chase, Steve Martin, Dan Aykroyd, Eddie Murphy, John Belushi, John Candy, and Rick Moranis, it's got drugs, sex, punch-ups, webbed toes, and Bill Murray being pushed into a swimming pool by Hunter S. Thompson while tied to a lawn chair. What's not to like? Based on candid interviews from many of the stars themselves, as well as those in their immediate orbit, including directors John Landis, Carl Reiner, and Amy Heckerling, Wild and Crazy Guys is a fantastic insider account of the friendships, feuds, triumphs, and disasters experienced by these beloved comedians. Hilarious and revealing, it is both a hidden history of the most fertile period ever for screen comedy and a celebration of some of the most popular films of all time. Praise for Wild and Crazy Guys: \"Eminently readable . . . Children of the 1980s, take note: this is a fond, engrossing look back at the making of movies that became cultural touchstones.\" —Booklist (starred review). \"Nick de Semlyen smartly charts the pinballing career paths of the stars of this new comic wave. . . . His punchy, nonstop narrative . . . tells a [story] where art and commerce smash hard against each other, sometimes causing destruction, but sometimes making sparks fly.\" —The Sunday Times (UK)",
  "genres": [
    "Nonfiction",
    "Comedy",
    "Humor",
    "Biography",
    "Film",
    "History",
    "Audiobook"
  ],
  "author": "Nick de Semlyen",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/42880492-wild-and-crazy-guys"
}