{
  "title": "As Directed",
  "description": "In the shadow of a past fraught with danger and tainted by loss, former pharmaceutical researcher Maggie O’Malley is rebuilding her life, trading test tubes for pill bottles as she embarks on a new career at the corner drugstore. But as she spreads her wings, things begin to go terribly wrong. A customer falls ill in the store. Followed by another. And then more. The specter of poisoning arises, conjuring old grudges, past sins, buried secrets and new suspicions from which no one is immune. As Maggie and her best friend Constantine begin to investigate, they discover that some of the deadliest doses come from the most unexpected places.- - - - - - - - - - - - -AS DIRECTED by Kathleen Valenti | A Henery Press Mystery. If you like one, you’ll probably like them all. Praise for As Directed: “A chilling game of cat and mouse that moves with lightning speed and stunning twists. Lies, secrets and evil spin a deadly web in this gripping tale of malice and deceit.”Liv ConstantineBestselling author of The Last Mrs. ParrishPraise for other books in the Maggie O’Malley Series: Protocol \"An exciting start to a new mystery series, PROTOCOL offers up a fast-paced, suspenseful plot starring complex characters with great heart. Powerful, tense, and satisfying. Valenti grabs you from page one and never lets go.\"Wendy TysonAuthor of Bitter Harvest \"Gutsy and loyal, Maggie O’Malley finds herself plunged into the corrupt and chilling world of big pharmaceuticals where trusting the wrong person could prove as deadly as an experimental drug side effect. With a page-turner debut like Protocol, I can’t wait to see what Valenti cooks up for us next!\" Annette DashofyUSA Today bestselling author of the Zoe Chambers Mysteries\"Medicine and murder come together in Kathleen Valenti's page-turning debut, PROTOCOL, a twisty and breathless exploration of big Pharma and the drugs that can both save...and kill. This one will have you up all night following Maggie O'Malley on her search for the truth. A new heroine in an age of technology and “miracle drugs,” I can't want to see what Maggie has up her sleeve next. If you like a book with smarts, a heart, and flesh-and-blood characters, don't miss PROTOCOL. This one is a winner!\"Maggie BarbieriAuthor of the Murder 101 Series\"A page-turner! Smart, fast-paced and surprising.\"Hank Phillippi RyanMary Higgins Clark Award-Winner, author of Say No More 39 WINKS\"Maggie O’Malley will not be cowered, stopped, or out-smarted as she sets out to prove the innocence of a friend facing a murder charge. Medicine gone terribly wrong, social injustice, and betrayal does not deter her relentless search for the truth. 39 Winks has is all: characters, plot, pace—from the very first line to the spectacular conclusion.\"Patricia GussinNew York Times bestselling author of Come Home\"With twists you won't see coming, Maggie O'Malley and 39 Winks are sure to keep you up all night!\"Julie Mulhern USA Today bestselling author of Shadow Dancing\"39 WINKS is a clever and twisty thriller that will grab you from the first sentence and keep you guessing until the very end.\"Kathleen BarberAuthor of Are You Sleeping",
  "genres": [],
  "author": "Kathleen Valenti",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/42866213-as-directed"
}