{
  "title": "Southland",
  "description": "\"I'm an LA native with a lot of love for LA crime fiction, but instead of preaching to the noir choir about The Long Goodbye , I'd like to gush about Southland by Nina Revoyr. It's a brilliant, ambitious, moving literary crime novel about two families in South Los Angeles and their tangled history between the 1930s and the 1990s. The central mystery is the death of four black boys in a Japanese-American man's store during the Watts Rebellion of 1965. It's a powerful book, one that I think about often, as well as a huge influence on my work. Right up there with Chandler.\"-- Stephanie Cha (of the LARB ) in GQ on \"The Greatest Crime Novelists on Their Favorite Crime Novels Ever\" \"A story about injustice dressed up as a detective novel, Southland reminds us that activism is both an ongoing project and a deeply personal choice.\"-- Vallaire Wallace in Electric Lit on \"The Novel That Shows Us How to Face our Past to Change Our Future\" \"Jackie Ishida's grandfather had a store in Watts where four boys were killed during the riots in 1965, a mystery she attempts to solve.\"-- New York Times Book Review , Ross MacDonald on \"Where Noir Lives in the City of Angels\" \"It is the kind of saga that often epitomizes and shocks LA--friction and violence between races and cultures.\"-- Los Angeles Times , named one of the 20 Essential LA Crime Books \"When I started working on Your House Will Pay , I hoped to write something that was half as smart and affecting as Southland . Revoyr's novel takes place in the Crenshaw district of Los Angeles, following two families--one black, one Japanese--over several decades. It's a character-driven saga with the engine of a crime novel, unravelling a horrific multiple murder that took place in the chaotic days of the Watts Rebellion in 1965.\"-- The Guardian (UK), one of Steph Cha's Top 10 Books About Trouble in Los Angeles \"[A]n absolutely compelling story of family and racial tragedy. Revoyr's novel is honest in detailing southern California's brutal history, and honorable in showing how families survived with love and tenacity and dignity.\"-- Susan Straight, author of Highwire Moon Southland brings us a fascinating story of race, love, murder and history, against the backdrop of an ever-changing Los Angeles. A young Japanese-American woman, Jackie Ishida, is in her last semester of law school when her grandfather, Frank Sakai, dies unexpectedly. While trying to fulfill a request from his will, Jackie discovers that four African-American boys were killed in the store Frank owned during the Watts Riots of 1965. Along with James Lanier, a cousin of one of the victims, Jackie tries to piece together the story of the boys' deaths. In the process, she unearths the long-held secrets of her family's history. Southland depicts a young woman in the process of learning that her own history has bestowed upon her a deep obligation to be engaged in the larger world. And in Frank Sakai and his African-American friends, it presents characters who find significant common ground in their struggles, but who also engage each other across grounds--historical and cultural--that are still very much in dispute. Moving in and out of the past--from the internment camps of World War II, to the barley fields of the Crenshaw District in the 1930s, to the streets of Watts in the 1960s, to the night spots and garment factories of the 1990s-- Southland weaves a tale of Los Angeles in all of its faces and forms.",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Race",
    "Historical",
    "LGBT",
    "Queer"
  ],
  "author": "Nina Revoyr",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/428722.Southland"
}