{
  "title": "Scenic Route",
  "description": "Take the ride to Happily Ever After with Beautiful Biker Spencer Valentine of The Dominion Brotherhood MC.  Best experienced after Detour (Beautiful Biker 1) and Joyride (Beautiful Biker 2) Spencer knows it’s a long and winding road to happily ever after. He’s got baggage. He has a chip on his shoulder. Recent events have woken him up, made him realize he has to get over the past and move forward.  He finds Pippa, the girl he wanted, but who belonged to someone else, bleeding in an alley on a rainy night, hurt at the hands of the man who was supposed to protect her. This changes everything.  Spring brings a time for new beginnings. The beginning of his happily ever after. And he's determined it's going to be with her.  Spencer is possessive, protective, and like his two older brothers, 100% alpha male.  It won’t be an easy journey to take, but he’s determined to keep Pippa safe and give her a reason to trust again. Pippa has always felt the sparks flying between them, but isn’t sure she can get over what she’s been through. That doesn’t matter, though, because Spencer is 100% sure that now that she’s free, she’s his. Spencer has some healing to do, too. And the healing has to take place with drama and danger happening around them both.  Hot, suspenseful, and addictive MC romances with steam, laugh out loud moments, sexy and lovable characters, and a little bit of gritty darkness. Reading these motorcycle romances (each about a different couple but with connected stories) in order will provide the richest reading experience. Warning: This story deals with the aftermath of domestic violence.  This is the third book in the Beautiful Biker series, a contemporary MC romance series with alpha male biker book boyfriends and smokin' hot action-packed pages.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Family",
    "Motorcycle"
  ],
  "author": "D.D. Prince",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/42875584-scenic-route"
}