{
  "title": "Adoption History 101: An Orphan's Research",
  "description": "NO LONGER AVAILABLE. How would you like to be given a new identity to live by and then removed from your sisters and brothers--never to be permitted to ever contact them again--even upon your deathbed? This is just one of many governmental red tape adoptees are forced to contend with because of adoption. Gain a bird's-eye view of the hidden side of the practice here! The findings have been called mind-blowing by adoptees and non-adoptees alike. Discover the history of adoption in a condensed book meant to help you see the topic in an organized manner. This research book has been divided into four short, easy-to-read sections: revealing the making of the system throughout time, starting from Europe, America, Asia, and today finally, in Africa. It is a must-read for academics studying the field and is particularly useful for social workers, counselors, anthropologists, human rights advocates, and adoptee allies. Pick up this book today and be one of the rare few who know more than the professionals profiting from the field. This research book summarizes the inception and expansion of the adoption industry, focusing on its roots and consequences kept from public awareness. For years, facilitators have denied adoptees access to documents that could lead them back to their families. In defense of the rights of adopted people, a true Ethiopian orphan briefly speaks her mind about adoption. Then, going back in time, the attention shifts from African adoptions (what's been trending) to the 1954 Evangelical Baby \"Swoop\" Era, to the 1854 Orphan Train Movement, and finally to the European Child Migration Schemes. Adoption History 101: An Orphan's Research supports those who have ever felt isolated due to the industry's privacy and lack of transparency. Taken children--now adults--are critiquing a global man-made market. This orphan's perspective is meant to inform vulnerable communities against a fierce industry that professes God is on their side. It is only natural for Mother Nature to recover itself. This research is motivated by a Haitian adoptee who died of heart failure after learning that he had been trafficked to France for overseas adoption but was never able to acquire justice due to the public's love affair with the practice. This short book deconstructs the industry and acknowledges the families left behind. Has the global push for adoption exploited mothers worldwide?",
  "genres": [
    "Adoption",
    "Social Issues"
  ],
  "author": "Janine Myung Ja",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/42921836-adoption-history-101"
}