{
  "title": "No Beast So Fierce: The Terrifying True Story of the Champawat Tiger, the Deadliest Man-Eater in History",
  "description": "American Sniper meets Jaws in this gripping true account of the deadliest animal of all time, the Champawat Tiger—responsible for killing more than 400 humans in northern India and Nepal in the first decade of the twentieth century—and the legendary hunter who finally brought it down.At the turn of the twentieth century, in the forested foothills of the Himalayas between India and Nepal, a large Bengal tiger began preying on humans. Between roughly 1900 and 1907, the fearsome beast locals called the Champawat Man-Eater claimed 436 lives. Successfully evading both hunters and soldiers from the Nepalese army and growing bolder with its kills, the tiger—commonly a nocturnal predator—prowled settlements and roadways even in broad daylight. Entire villages were virtually abandoned. Desperate for help, authorities appealed to Jim Corbett, a then-unknown railroad employee of humble origins who had grown up hunting and tracking game through the hills of Kumaon. Like a police detective on the trail of a human killer, Corbett questioned villagers who had encountered the tiger and began tracking its movements in the dense, hilly woodlands—while the animal began to hunt Corbett in return. When the big cat attacked a teenager and dragged her away, he followed the blood trail deep into the forest—a harrowing, dramatic chase that would ultimately end the maneater’s long reign of terror, and turn the young Corbett into a living legend.In this rip-roaring adventure and compelling natural history, Dane Huckelbridge recreates one of the great adventure stories of the twentieth century, bringing into focus a principled, disciplined soldier, hunter, and conservationist—who would later earn fame for his devotion to saving the Bengal tiger and its habitat—and the beautiful, terrifying animal he patiently pursued. Written with the thrilling immediacy of John Vaillant’s The Tiger, Susan Casey’s The Devil’s Teeth, and Nate Blakeslee’s American Wolf, No Beast So Fierce is an enthralling depiction of a classic battle between man and animal, human encroachment and wild nature that resonates today.",
  "genres": [
    "Nonfiction",
    "History",
    "Nature",
    "Animals",
    "Science",
    "India",
    "Audiobook"
  ],
  "author": "Dane Huckelbridge",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/42898575-no-beast-so-fierce"
}