{
  "title": "United States - Vietnam Relations 1945 - 1967 (The Pentagon Papers)",
  "description": "The Pentagon Papers, officially titled \"Report of the Office of the Secretary of Defense Vietnam Task Force\", was commissioned by Secretary of Defense Robert McNamara in 1967. In June of 1971, small portions of the report were leaked to the press and widely distributed. However, the publications of the report that resulted from these leaks were incomplete and suffered from many quality issues. On the 40th anniversary of the leak to the press, the National Archives, along with the Kennedy, Johnson, and Nixon Presidential Libraries, has released the complete report. The 48 boxes in this series contain a complete copy of the 7,000 page report along with numerous copies of different volumes of the report, all declassified. Approximately 34% of the report is available for the first time. What is unique about this, compared to other versions, is * The complete Report is now available with no redactions compared to previous releases * The Report is presented as Leslie Gelb presented it to then Secretary of Defense Clark Clifford on January 15, 1969 * All the supplemental back-documentation is included. In the Gravel Edition, 80% of the documents in Part V.B. were not included. This release includes the complete account of peace negotiations, significant portions of which were not previously available either in the House Armed Services Committee redacted copy of the Report or in the Gravel Edition. This facsimile volume [Part IV. A. 1.] Evolution of the War. NATO and A Comparison [Part IV. A. 2.] Evolution of the War. Aid for France in Indochina, 1950-54 [Part IV. A. 3.] Evolution of the War. U.S. and France's Withdrawal from Vietnam, 1954-56 [Part IV. A. 4.] Evolution of the War. U.S. Training of Vietnamese National Army, 1954-59 [Part IV. A. 5.] Evolution of the War. Origins of the Insurgency",
  "genres": [
    "Banned Books"
  ],
  "author": "Office of the Secretary of Defense",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/12369821-united-states---vietnam-relations-1945---1967-the-pentagon-papers"
}