{
  "title": "Love and Death Among the Cheetahs",
  "description": "Georgie and Darcy are finally on their honeymoon in Kenya's Happy Valley, but murder crashes the party in this all-new installment in the New York Times bestselling series.I was so excited when Darcy announced out of the blue that we were flying to Kenya for our extended honeymoon. Now that we are here, I suspect he has actually been sent to fulfill another secret mission. I am trying very hard not to pick a fight about it, because after all, we are in paradise! Darcy finally confides that there have been robberies in London and Paris. It seems the thief was a member of the aristocracy and may have fled to Kenya. Since we are staying in the Happy Valley--the center of upper-class English life--we are well positioned to hunt for clues and ferret out possible suspects.Now that I am a sophisticated married woman, I am doing my best to sound like one. But crikey! These aristocrats are a thoroughly loathsome sort enjoying a completely decadent lifestyle filled with wild parties and rampant infidelity. And one of the leading lights in the community, Lord Cheriton, has the nerve to make a play for me. While I am on my honeymoon! Of course, I put an end to that right off.When he is found bloodied and lifeless along a lonely stretch of road, it appears he fell victim to a lion. But it seems that the Happy Valley community wants to close the case a bit too quickly. Darcy and I soon discover that there is much more than a simple robbery and an animal attack to contend with here in Kenya. Nearly everyone has a motive to want Lord Cheriton dead and some will go to great lengths to silence anyone who asks too many questions. The hunt is on! I just hope I can survive my honeymoon long enough to catch a killer. . . .",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Cozy Mystery",
    "Historical Mystery",
    "Historical",
    "Audiobook"
  ],
  "author": "Rhys Bowen",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/42919937-love-and-death-among-the-cheetahs"
}