{
  "title": "Supermob: How Sidney Korshak and His Criminal Associates Became America's Hidden Power Brokers",
  "description": "Investigative reporter Russo returns with the remarkable story of the Supermob--a cadre of men who, over the course of decades, secretly influenced nearly every aspect of American society. Presenting startling, never-before-seen revelations about such famous members as Jules Stein, Joe Glaser, Ronald Reagan, Lew Wasserman, David Bazelon & John Jacob Factor--as well as infamous, scrupulously low-profile members--Russo pulls the lid off of a half-century of criminal infiltration into American business, politics & society. At the heart of it is Sidney \"The Fixer\" Korshak, who from the 1940's until his death in the '90s, wasn't only the most powerful lawyer in the world, according to the FBI, but the enigmatic player behind countless 20th century power mergers, political deals & organized crime chicaneries. As the underworld's primary link to the corporate upperworld, his backroom dominance & talent for anonymity will likely never be equaled. As Supermob proves, neither will his story.Cast of charactersPrefaceThe lawyer from LawndaleFrom Lawndale to the Seneca to the underworldBirds of a feather Kaddish for CaliforniaThe future is in real estate\"Hell, that's what you had to do in those days to get by\"Scenes from Hollywood, part 1Jimmy, Bobby & SidneyForty years in the desert The kingmakers: Paul, Lew & Ronnie in CaliforniaThe new frontier Bistro days \"He could never walk away from those people\"Scenes from Hollywood, part 2\"A sunny place for shady people\"Coming under attack From Hoffa to HollywoodFrom Dutch sandwiches to Dutch ReaganAiring dirty laundry & laundering dirty money Pursued by the Fourth Estate The true untouchablesLegacies Appendices: A-Supermob investments/B-Pritzker holdings/C-Ziffren-Greenberg-Genis documentsNotesBibliographyIndex",
  "genres": [
    "History",
    "Biography",
    "Crime",
    "Nonfiction",
    "True Crime",
    "Politics",
    "The United States Of America"
  ],
  "author": "Gus Russo",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/12370.Supermob"
}