{
  "title": "Crack the Code: 10 Proven Secrets that Motivate Healthy Behavior and Inspire Fulfillment in Men Over 50",
  "description": "Crack The Code\n presents an unconventional, motivation-based approach to health for men 50 and over. Ten strategies for creating and maintaining inspiration for a healthy lifestyle are advanced from a platform of survey research, interviews and the author’s personal experiences. Primary audiences for the book are men over 50 and the people that love them; their wives, partners, children and grandchildren. Additional audiences include health care providers, insurers, policy makers, men of all ages who want to find motivation for healthy behavior and anyone who has struggled with their health. Asserting that without motivation no diet, exercise program, technology or other strategy will produce sustained results, \nCrack The Code\n describes how healthy-living men, one of the most health-challenged segments of the American population, exhibit a strong cognitive association between their life’s priorities and their behaviors; a catalytic awareness in which men often integrate their valued relationships into their health behaviors (they take walks with their wife). What the author terms Male Cognitive Behavioral Alignment.The secret sauce of male motivation outlined in the book is derived from a nationwide survey of 1,000 healthy-living men. \nCrack The Code\n translates the findings into strategies and tactics with actionable exercises. Personal stories from interviews and focus groups add practical insights and emotion that engages readers. A discussion of relevant theories from psychology, management science and the fields of decision making and behavior change anchor the model in a context of well-established thinking. \nCrack The Code\n concludes with a call to action for a new culture of men’s health, outlining a confluence of social, economic and political factors in the US and beyond that represent a tipping point where healthy behavior among 50 plus men will become the new norm.\nCrack The Code’s\n focus on motivation and the psycho-social underpinnings of behavior fills a gap in a market dominated by publications on traditional diet and exercise. By digging deeper and using everyday men as a source, \nCrack The Code\n breaks new ground for a burgeoning segment of the baby-boomer population that is in desperate need of help. The potential to influence men of other ages as well as health care providers, insurers and policy makers, creates a tremendously valuable read.",
  "genres": [
    "Self Help"
  ],
  "author": "Louis Bezich",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/42900162-crack-the-code"
}