{
  "title": "Motherland: A Memoir of Love, Loathing, and Longing",
  "description": "“I’m reading this book right now and loving it!”—Cheryl Strayed, #1  New York Times  bestselling author of  WildHow can a mother and daughter who love (but don’t always like) each other coexist without driving each other crazy? “Vibrating with emotion, this deeply honest account strikes a chord.”— People“A wry and moving meditation on aging and the different kinds of love between women.”— The Oprah Magazine After surviving a traumatic childhood in nineteen-seventies New York and young adulthood living in the shadow of her flamboyant mother, Rita, a makeup-addicted former television singer, Elissa Altman has managed to build a very different life, settling in Connecticut with her wife of nearly twenty years. After much time, therapy, and wine, Elissa is at last in a healthy place, still orbiting around her mother but keeping far enough away to preserve the stable, independent world she has built as a writer and editor. Then Elissa is confronted with the Rita, whose days are spent as a flâneur, traversing Manhattan from the Clinique counters at Bergdorf to Bloomingdale’s and back again, suffers an incapacitating fall, leaving her completely dependent upon her daughter.Now Elissa is forced to finally confront their profound differences, Rita’s yearning for beauty and glamour, her view of the world through her days in the spotlight, and the money that has mysteriously disappeared in the name of preserving youth. To sustain their fragile mother-daughter bond, Elissa must navigate the turbulent waters of their shared lives, the practical challenges of caregiving for someone who refuses to accept it, the tentacles of narcissism, and the mutual, frenetic obsession that has defined their relationship.Motherland is a story that touches every home and every life, mapping the ferocity of maternal love, moral obligation, the choices women make about motherhood, and the possibility of healing. Filled with tenderness, wry irreverence, and unforgettable characters, it is an exploration of what it means to escape from the shackles of the past only to have to face them all over again.Praise for Motherland“Rarely has a mother-daughter relationship been excavated with such honesty. Elissa Altman is a beautiful, big-hearted writer who mines her most central her gorgeous, tempestuous, difficult mother, and the terrain of their shared life. The result is a testament to the power of love and family.” —Dani Shapiro, author of Inheritance",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "LGBT",
    "Queer",
    "Biography Memoir",
    "Biography"
  ],
  "author": "Elissa Altman",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/42919824-motherland"
}