{
  "title": "The Inkblots: Hermann Rorschach, His Iconic Test, and the Power of Seeing",
  "description": "An NPR Best Book of the YearA New York Post Best Book of the YearA Times Thought Book of the YearAn Irish Independent Best Book of the YearThe captivating, untold story of Hermann Rorschach and his famous inkblot test In 1917, working alone in a remote Swiss asylum, psychiatrist Hermann Rorschach devised an experiment to probe the human mind: a set of ten carefully designed inkblots. For years he had grappled with the theories of Freud and Jung while also absorbing the aesthetic movements of the day, from Futurism to Dadaism. A visual artist himself, Rorschach had come to believe that who we are is less a matter of what we say, as Freud thought, than what we see.After Rorschach’s early death, his test quickly made its way to America, where it took on a life of its own. Co-opted by the military after Pearl Harbor, it was a fixture at the Nuremberg trials and in the jungles of Vietnam. It became an advertising staple, a cliché in Hollywood and journalism, and an inspiration to everyone from Andy Warhol to Jay Z. The test was also given to millions of defendants, job applicants, parents in custody battles, and people suffering from mental illness or simply trying to understand themselves better. And it is still used today.In this first-ever biography of Rorschach, Damion Searls draws on unpublished letters and diaries and a cache of previously unknown interviews with Rorschach’s family, friends, and colleagues to tell the unlikely story of the test’s creation, its controversial reinvention, and its remarkable endurance—and what it all reveals about the power of perception. Elegant and original, The Inkblots shines a light on the twentieth century’s most visionary synthesis of art and science.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "History",
    "Biography",
    "Science",
    "Art",
    "Audiobook"
  ],
  "author": "Damion Searls",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/42898487-the-inkblots"
}