{
  "title": "Deliberate Deception",
  "description": "***** BOOK CRITIC ACCLAIM ***** “Readers looking for a thriller that grabs hold and doesn't let go will find Deliberate Deception just the ticket for a superior and satisfying blend of psychological detail and suspense.” - D. Donovan, Senior Reviewer, Midwest Book Review “…excellent story…fast paced, action packed…adrenaline pumping and heart-pounding…” - The International Review of Books “Politics, terrorism, and greed together create a story that is filled with unexpected twists and turns…a fast pace and engrossing plot. Once begun, it's nearly impossible to put down.” - D. Donovan, Senior Reviewer, Midwest Book Review “The narrative voice is clean, making the story easy to read and follow. Excellent word choices and visual pros made for an amazing read like I was really there in the midst of the action.” - The International Review of Books “Joe Porrazzo's attention to detail flushes out Alex's personality, motivations, and conundrums to create not just compelling action scenes, but a character who is completely realistic and likeable.” - D. Donovan, Senior Reviewer, Midwest Book Review Following the award-winning mystery thriller, SOLEMNLY SWEAR...Alex Porter is back…and the stakes just got higher! Things are heating up in Tucson, Arizona. A greedy corporation rigs a multi-million dollar raffle creating false hopes for ticket buyers. They're not winning, they’re dying! What comes next will shock the world! DELIBERATE DECEPTION heralds the return of Alex Porter; retired United States Air Force OSI agent turned private investigator, in another heart-pounding Joe Porrazzo suspense thriller. Seven months after leaving New England, Alex, still grieving the tragic deaths of his wife and daughter, gets a call from his friend Joe Prater. Prater’s old army buddy has gone missing from his home in Tucson, and Joe wants Alex to check it out. HEADLINE Tragedy in Tucson While investigating, Alex gets too close to the truth and finds himself caught in the deadly crosshairs. He finds himself teamed with the very person hired to kill him as they race against the clock to prevent a mysterious group from striking in Tucson and shocking the world. Don’t miss the nonstop action. The deception is deliberate. The results are deadly.",
  "genres": [],
  "author": "Joe Porrazzo",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/42881259-deliberate-deception"
}