{
  "title": "Sinatra in Hollywood",
  "description": "Hollywood legend, Academy Award--winning actor, and recipient of the Golden Globe Award for lifetime achievement in film, Frank Sinatra carved out one of the biggest careers in the history of Hollywood, yet paradoxically his screen legacy has been overshadowed by his extraordinary achievements as a singer and recording artist. Until now. With the publication of Sinatra in Hollywood, an analytical yet deeply personal look at the screen legend of Frank Sinatra, Sinatra’s standing as a significant, indeed legendary, screen actor has now been placed in full perspective. Examining each of Sinatra’s seventy film appearances in depth, Tom Santopietro traces the arc of his astonishing six-decade run as a film actor, from his rise to stardom in “boy next door” musical films like Anchors Aweigh and On the Town , through his fall from grace with legendary flops like The Kissing Bandit, to the near-mythic comeback with his Oscar-winning performance in From Here to Eternity. Laced throughout with Sinatra’s own observations on his film work, Sinatra in Hollywood deals head-on with his tumultuous marriages to Ava Gardner and Mia Farrow and directly addresses the rumors of Mob involvement in Sinatra’s Hollywood career. Ranging from the specifics of his controversial acting nickname of One Take Charlie to the iconic Rat Pack film Ocean’s Eleven , from the groundbreaking performance in The Manchurian Candidate to the moving and elegiac late-career roles as tough yet vulnerable detectives, the myths and personal foibles are stripped away, placing the focus squarely on the work. Oftentimes brilliant, occasionally off-kilter, but always compelling, Frank Sinatra, the film icon who registered as nothing less than emblematic of “The American Century,” here receives his full due as the serious artist he was, the actor about whom director Billy Wilder emphatically stated, “Frank Sinatra is beyond talent.”",
  "genres": [
    "Biography",
    "Music",
    "Media Tie In"
  ],
  "author": "Tom Santopietro",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/4289647-sinatra-in-hollywood"
}