{
  "title": "The Plan for Darkness",
  "description": "The Plan for Darkness never rests. It sees through the electronic darkness of the electromagnetic pulse and the Infection's Revenge Plague released by madmen who placed their countries on the butcher block while sticking the butcher in the eye with their filthy pointed actions.The dead rise while the living struggle to live in a world without modern conveniences and an enemy who won't die and stay dead. The survivors struggle against their fears of the unbelievable, the unknown, lack of civil obedience, and time.Since the detonation of the massive warhead over the central United States and every major population center of first world countries, electricity is a thing of the past due to the electromagnetic pulse and the vulnerability of the modern electronic world. Semiconductor technology was convenient, inexpensive, and temporary. The stable supplies which used to be delivered daily now vanish from store shelves through violence and desperation.Within days of the unfelt blast, everything that had been produced for consumption is hoarded, spoiled, traded, stolen, or eaten. The drug dependent population see their medicines dwindle with no hope of replenishment in this new environment. They know their destiny is that of those lurking behind the other side of the locked door.Jimmy listened to the intelligence chatter and thought he was prepared until he hears the old man's familiar dreadful voice delivering a final message of doom, \"There is a swirling, twisting and unconventional ribbon inside all of us; men and beasts alike. It's in every cell, from hair to hoof. It's there from the moment of our conception to the end of our prodigy. We are controlled by it. We are what we are without our consent, without our cooperation, and most importantly without our knowledge. It's a ladder that bridges our generations, or like a deep winding river with dirty secrets. We can't buy it and we can't rid ourselves of it. It is the greatest cause of conflict. How have you survived? It's a carnival trick to you, but my thoughts evaporate...\"The Plan for Darkness follows Tess, a brave young woman determined to survive; Sani, a young man hoping to keep his family safe; Ratner, a man faced with horrors beyond his imagining; and Jimmy, an old man who finds a new lease on life as he fights for those around him. Together, these unlikely allies fight against a menace unleashed on the globe, but can they survive the terrible fallout?",
  "genres": [],
  "author": "Daron Malmborg",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42924956-the-plan-for-darkness"
}