{
  "title": "Pacifism As Pathology: Reflections on the Role of Armed Struggle in North America",
  "description": "\"This extraordinarily important book cuts to the heart of one of the central reasons movements to bring about social and environmental justice always fail. The fundamental question here is violence ever an acceptable tool to help bring about social change? This is probably the most important question of our time, yet so often discussions around it fall into clichés and magical that somehow if we are merely good and nice enough people, the state will stop using its violence to exploit us all. Would that this were true.\"Derrick Jensen, author of Endgame, from the introduction. Pacifism, the ideology of nonviolent political resistance, has been the norm among mainstream North American progressive groups for decades. But to what end? Ward Churchill challenges the pacifist movement’s heralded victoriesGandhi in India, 1960s antiwar activists, even Martin Luther King’s civil rights movementsuggesting that their success was in spite of, rather than because of, their nonviolent tactics. Pacifism as Pathology was written as a response not only to Churchill’s frustration with his own activist experience, but also to a debate raging in the activist and academic communities. He argues that pacifism is in many ways counterrevolutionary; that it defends the status quo, and doesn’t lead to social change. In these times of upheaval and global protest, this is a vital and extremely relevant book. Ward Churchill is a prolific writer and lecturer, having authored, co-authored, or edited over twenty books. He is a member of the leadership council of Colorado AIM (American Indian Movement). In Oakland, California on March 24, 2015 a fire destroyed the AK Press warehouse along with several other businesses. Please consider visiting the AK Press website to learn more about the fundraiser to help them and their neighbors.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Philosophy",
    "Activism",
    "Theory",
    "Social Justice"
  ],
  "author": "Ward Churchill",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/429479.Pacifism_As_Pathology"
}