{
  "title": "INTUITIVELY YOU: Evolve Your Life and Mend the World",
  "description": "More than a self-help book, Intuitively You is your pathway to the intuitive lifestyle that is transforming modern science and culture. Renowned teacher and intuitive Michelle DesPres has created a step-by-step, endlessly entertaining way to capture your fundamental intuitive powers and enhance your life’s journey.  Those seeking personal health, wealth and well-being - as well as the secrets to transforming the world - will find this book invaluable. Also . . . teachers, medical providers, healers, activists and anyone who works with people to enhance their lives will uncover revolutionary tools for expanding your sensibilities and boosting your creativity and effectiveness.  This is the education you never learned in school – but wished you had!  Get ready to tap into those “gut instincts” you’ve always wanted to trust . . . draw from your soul's history . . . and gain a higher perspective. Armed with this knowledge, you will:  • Take control over limiting patterns and behaviors. • Transform your life into your most authentic expression – so you love the life you live. • Unlock the door to world peace once and for ALL!  AUTHOR BIO: Michelle is a certified clairvoyant medium trained under the Berkeley Psychic Institute program for inner development. She is the author of the book The Clairvoyant Path, and most recently, INTUITIVELY YOU, Evolve Your Life and Mend the Word helping others discover personal and collective fulfillment. She has also recently published the Intuitive Ethical Standards (https://michelledespres.com/ethical-s...), establishing guidelines for alternative therapists. Michelle is a frequent speaker and motivational leader. She has been providing individual services and readings to a diversity of clients for 15 years, who treasure her insight, perspective and deeply nurturing guidance. She is the founder of the Intuitive Practitioner Program, teaching students about mind, body and soul integration – and how to hone these skills to build thriving businesses.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Michelle DesPres",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42948661-intuitively-you"
}