{
  "title": "Cape Disappointment",
  "description": "A man and a woman, their coastal getaway interrupted, say goodbye on an isolated landing strip in Washington State. She then calls from the air. And he watches from the base of a lighthouse as the plane, with eleven people on board, plummets into the steely gray sea. The man remembering this tragic event is in a hospital room, the victim of a bombing weeks after the crash. In this extraordinary thriller by award-winning author Earl Emerson, Seattle private eye Thomas Black returns after more than a decade–and he must put together the shattered fragments of his life. His life and his country depend on it.CAPE DISAPPOINTMENTThe bomb that nearly killed Thomas Black went off in a school gymnasium after a Senate candidate had spoken. Amid the carnage, Black nearly bled to death. But he survives–and enters a tunnel of dreams and hallucinations, oblivion and unconnected memories. People come and go from his hospital room. A beautiful woman kisses him. A madman’s rant echoes in his mind. Then, when Black–widower, hero, and private investigator–is released from the hospital, he faces the twin tragedies that have devastated his life, and the fact that his lovely wife Kathy is really gone for good.Or is she? Thomas believes he sees Kathy–as a passenger in a passing truck. Her cell phone, which should be on the bottom of the sea, calls his in the middle of the night. And the explanations investigators give for the plane crash just don’t make sense.Now, step by step, Black is beginning to understand what a paranoid, alcoholic former CIA hit man has been trying to tell him about the plane crash, about the death of a reporter’s husband, about suspicious things that nobody ever gets around to questioning. Suddenly, Black is on the run, chased by mysterious people, caught in a web of personal and political lies and something even a plot that is killing everyone it touches.Brilliantly told and emotionally galvanizing, Cape Disappointment is a political thriller and a gut-wrenching tale of conspiracies–the kind that are too crazy to believe and too deadly to ignore.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller"
  ],
  "author": "Earl Emerson",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/4293573-cape-disappointment"
}