{
  "title": "Limitless Mind: Learn, Lead, and Live Without Barriers",
  "description": "“Boaler is one of those rare and remarkable educators who not only know the secret of great teaching but also know how to give that gift to others.”  — CAROL DWECK, author of Mindset“Jo Boaler is one of the most creative and innovative educators today. Limitless Mind marries cutting-edge brain science with her experience in the classroom, not only proving that each of us has limitless potential but offering strategies for how we can achieve it.”  — LAURENE POWELL JOBS“A courageous freethinker with fresh ideas on learning.”  — BOOKLISTIn this revolutionary book, a professor of education at Stanford University and acclaimed math educator who has spent decades studying the impact of beliefs and bias on education, reveals the six keys to unlocking learning potential, based on the latest scientific findings.From the moment we enter school as children, we are made to feel as if our brains are fixed entities, capable of learning certain things and not others, influenced exclusively by genetics. This notion follows us into adulthood, where we tend to simply accept these established beliefs about our skillsets (i.e. that we don’t have “a math brain” or that we aren’t “the creative type”). These damaging—and as new science has revealed, false—assumptions have influenced all of us at some time, affecting our confidence and willingness to try new things and limiting our choices, and, ultimately, our futures.Stanford University professor, bestselling author, and acclaimed educator Jo Boaler has spent decades studying the impact of beliefs and bias on education. In \nLimitless Mind\n, she explodes these myths and reveals the six keys to unlocking our boundless learning potential. Her research proves that those who achieve at the highest levels do not do so because of a genetic inclination toward any one skill but because of the keys that she reveals in the book. Our brains are not “fixed,” but entirely capable of change, growth, adaptability, and rewiring. Want to be fluent in mathematics? Learn a foreign language? Play the guitar? Write a book? The truth is not only that anyone at any age can learn anything, but the act of learning itself fundamentally changes who we are, and as Boaler argues so elegantly in the pages of this book, what we go on to achieve.",
  "genres": [
    "Nonfiction",
    "Education",
    "Psychology",
    "Self Help",
    "Audiobook",
    "Science",
    "Teaching"
  ],
  "author": "Jo Boaler",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/42940498-limitless-mind"
}