{
  "title": "Charlemagne's Tablecloth: A Piquant History of Feasting",
  "description": "Feasts, banquets, and grand dinners have always played a vital role in our lives. They oil the wheels of diplomacy, smooth the paths of the ambitious, and spread joy at family celebrations. They lift the spirits, involve all our senses and, at times, transport us to other fantastical worlds. Some feasts have give rise to hilarious misunderstandings, at others competitive elements take over. Some are purely for pleasure, some connect uncomfortably with death, but all are interesting. Nichola Fletcher has written a captivating history of feasts throughout the ages that includes the dramatic failures along with the dazzling successes. From a humble meal of potatoes provided by an angel, to the extravagance of the high medieval and Renaissance tables groaning with red deer and wild boar, to the exquisite refinement of the Japanese tea ceremony, Charlemagne’s Tablecloth covers them all. In her gustatory exploration of history’s great feasting tables, Fletcher also answers more than a few riddles such as “Why did Charlemagne use an asbestos tablecloth at his feasts?” and “Where did the current craze for the elegant Japanese Kaiseki meal begin? Fletcher answers these questions and many more while inviting readers to a feasting table that extends all the way from Charlemagne’s castle to her own millennium feast in Scotland. This is an eclectic collection of feasts from the flamboyant to the eccentric, the delicious to the disgusting, and sometimes just the touchingly ordinary. For anyone who has ever sat down at a banquet table and wondered, “Why?” Nichola Fletcher provides the delicious answer in a book that is a feast all its own.",
  "genres": [
    "History",
    "Food",
    "Nonfiction",
    "Food and Drink",
    "Food History",
    "Cookbooks",
    "Medieval"
  ],
  "author": "Nichola Fletcher",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/429296.Charlemagne_s_Tablecloth"
}