{
  "title": "The World Is My Home: A Memoir",
  "description": "Literary legend James A. Michener was “a Renaissance man, adventurous, inquisitive, unpretentious and unassuming, with an encyclopedic mind and a generous heart” ( The New York Times Book Review ). In this exceptional memoir, the man himself tells the story of his remarkable life and describes the people, events, and ideas that shaped it. Moving backward and forward across time, he writes about the many strands of his his passion for travel; his lifelong infatuation with literature, music, and painting; his adventures in politics; and the hard work, headaches, and rewards of the writing life. Here at last is the real James plainspoken, wise, and enormously sympathetic, a man who could truly say, “The world is my home.” Praise for The World Is My Home “Michener’s own life makes one of his most engaging tales—a classic American success story.” — Entertainment Weekly “The Michener saga is as full of twists as any of his monumental works. . . . His output, his political interests, his patriotic service, his diligence, and the breadth of his readership are matched only by the great nineteenth-century writers whose works he devoured as he grew up—Dickens, Balzac, Mark Twain.” — Chicago Tribune “There are splendid yarns about [Michener’s] wartime doings in the South Pacific. There are hilarious cautionary tales about his service on government commissions. There are wonderful inside stories from the publishing business. And always there is Michener himself—analyzing his own character, assessing himself as a writer, chronicling his intellectual life, giving advice to young writers.” — The Plain Dealer “A sweepingly interesting life . . . Whether he’s having an epiphany over a campout in New Guinea with head-hunting cannibals or getting politically charged by the melodrama of great opera, James A. Michener’s world is a place and a time worth reading about.” — The Christian Science Monitor",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "Travel",
    "Biography Memoir",
    "History",
    "Autobiography"
  ],
  "author": "James A. Michener",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/42966.The_World_Is_My_Home"
}