{
  "title": "How to Wear Grunge",
  "description": "\"Ruth Stacey's How to Wear Grunge eschews nostalgia and the self-fulfilling mythology of rock's nearly-famous excesses for a fierce, feminist holler back into the feedback of another place and time, in all its bleached and sticky-carpeted illusions and almost-glory. Between truth or dare narratives that toy with the tension of hard facts - \"Too gloomy, tell me about the prettiness again. / No. Tell me the worst thing\" - these poems are wild and wise, and faultlessly written. There is a beating rock' n' roll heart of riot-grrl rebellion in every line. Stacey is a fearless and utterly compelling writer, whose candid, courageous poetry takes on the prevailing narrative and places women at the very epicentre.\" - Jane Commane \" In How to Wear Grunge , Ruth Stacey has achieved a bittersweet examination of brutal youth and violent love, with expert attention to the timing of acceptance, obsession and revelation. There's almost a contact-high to these poems, an intoxication that has been carefully crafted to provide relief from the horrors of the past and of each other, creating a deceptively fragile romance of a sub-culture that encouraged the dirt and distortion of the fragmented self. However, once we have questioned the lives of the damaged, haunted souls in this cool as hell collection, what burns through is strength and survival, wounds that gush with the language of dark joy, the sweet stink of dope and incense, a promise (to past, present and future selves) tightly rolled into a joint so full of flavour it will leave your mouth watering. How to Wear Grunge is ultimately a kaleidoscopic questionnaire. There are no right or wrong answers. In the end, we all dance to something. We make noise, we hurt each other and, sometimes, we forgive.\" - Bobby Parker",
  "genres": [
    "Poetry"
  ],
  "author": "Ruth Stacey",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/42963886-how-to-wear-grunge"
}