{
  "title": "Christmas Cake",
  "description": "Christmas CakeEzra Grayson sits in his palatial estate and lords over the hamlet of Brooktown. He owns everything. Except her. Adeline Bishop runs Bishop Bakery, one of the last non-Grayson businesses in town. She's sent the mysterious Mr. Grayson one of her signature Christmas cakes--while also refusing all his offers to buy her bakery--for the past 5 years. This year's cake delivery brings their feud to a head. Ezra decides to confront Adeline, but he doesn't expect the curvy baker to be quite so sweet. When naughty meets nice, who will get their just desserts?Christmas CandyOlive had a major crush on Hank in high school. She was the too-smart, slightly chubby girl who gawked as Hank ran track and made all the cheerleaders swoon. After high school, the two went their separate ways. Olive opened a yoga studio and swore off sweets while Hank traveled the world. No problem, right? At least there wasn't a problem until Hank moved back to town and opened a candy shop across the street from Olive's studio. Now, Olive will do everything she can to shut her old crush down. But Hank has other plans, and all of them end with an Olive sundae.A Cowboy for ChristmasI don't need a woman in my business--especially not one with a smart mouth and a curvy body. Molly Gale has been nothing but trouble ever since she showed up at the ranch next door. And now, right before a huge snowstorm hits on Christmas Eve, I have to go to her homestead. Have to see her, have to get another whiff of her strawberry scent. It's enough to drive a man mad. But I'll keep things professional, keep my hands to myself, and do what needs to be done. It's the perfect plan ...Until my horse throws me and I need help from none other than the woman with the fiery tongue and the deliciously thick hips.Yippee ki yay and Merry Christmas to me.A Stepbrother for ChristmasAnnalise dreads seeing her stepbrother at her family's Christmas get-together. Niles had always been so nasty, tormenting her in high school after their parents' had gotten married. British and snobby, Niles did everything he could to hurt Annalise when they were younger. Now, Annalise hasn't seen Niles in three years; he's been away at school in England and Annalise has started her pre-med program in Dallas. When they reconnect, dark memories threaten, sparks fly, and they give true meaning to the \"hard and dirty holidays.\"",
  "genres": [
    "Romance",
    "Christmas",
    "Contemporary",
    "Holiday",
    "Novella",
    "Anthologies",
    "M F Romance"
  ],
  "author": "Celia Aaron",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/42958606-christmas-cake"
}