{
  "title": "Purple Rain - Der Feind in meinem Herzen",
  "description": "Ein Märchen aus Asche & BlutMit dem todbringenden Virus Purple Rain hat sich die Welt der Menschen für immer verändert. Kreaturen treten aus dem Schatten der Nacht hervor, die River bis dahin für einen Mythos hielt. Die Vampire retten die wenigen überlebenden Menschen mit ihrem Blut vor der Pandemie und versklaven sie anschließend. Um nicht im Zuchtprogramm zur Sicherung der Nahrungsquelle zu landen, schlüpft die Sechzehnjährige seit Jahren in die Rolle eines Jungen und träumt von einem freien Leben. Doch sie ist Eigentum des Kingdoms New York, bis sie nach einem Fluchtversuch in den privaten Besitz des hochgestellten Delfoy-Clans fällt und dem Vampir Devon als Blutspender zugeteilt wird. Die Mauern aus Abscheu und Gleichgültigkeit, die die Jugendliche und der Vampir gegenüber dem Schicksal des anderen errichtet haben, bröckeln jedoch bald. Beide müssen erfahren, dass kein Kampf schwerer ist als der gegen das eigene Herz.Leseprobe:Es sind nicht nur ein paar dunkelbrauneHaarsträhnen, die vor mir im Waschbecken liegenund die ich vorsichtig mit den Fingerspitzen berühre. Es istauch ein Teil von mir und ich habe verdrängt, dass ich ihnvermisse. Das Gefühl, das plötzlich in mir hochsteigt, machtmir solche Angst, dass ich versuche, es zu ersticken, indemich leise den Song vor mich hin singe, den Ethan mirgestern vorgespielt hat: »In your head, in your head,Zombie, Zombie, Zombie- e -e -e«»River, beeil dich! Wir müssen gleich los.« Mein Vaterklopft mahnend an die Badezimmertür und seine verhallendenSchritte sagen mir, dass er sich wieder entfernt.Seufzend fahre ich mit den Fingern durch mein extremkurzes Haar und zupfe die spitz zulaufende Ponysträhne inForm, die mir fransig ins Gesicht fällt. So tief, dass sie oftmeine Sicht einschränkt, aber das macht mir nichts aus. Ichhabe mir angewöhnt, nach innen zu schauen und meinenTagträumen nachzuhängen, um der Wirklichkeit zu entfliehen.Seit Purple Rain und dem großen Sterben vor siebenJahren hat sich die Realität in einen Albtraum verwandelt,aus dem niemand erwachen wird.Erneut greife ich nach der Schere auf der Ablage undschneide mir die Wimpern kürzer, die von Natur aus sehrlang sind und schnell nachwachsen. Zu feminin, erklärteDad irgendwann, dem ich nicht männlich genug aussehenkann. Manchmal glaube ich, er würde mir am liebsten auchnoch Testosteron spritzen, um die Illusion perfekt zumachen. So groß ist seine Angst.Wie jeden Tag zwänge ich meinen Oberkörper in einKompressionsunterhemd, das meine Brüste verstecken soll.Seit einem halben Jahr erweist sich das als schwieriger,denn sie haben sichtbar an Umfang zugenommen. Ein Paarzusammengerollte Socken verschwindet vorne in meinerUnterhose und beult sie aus. Großzügig tupfe ich DadsAftershave auf meine Wangen, verteile noch etwas inmeinem Haar und sehe mit ernster Miene in den Spiegel.Ich kann mich zwar darin sehen, die grün-blau gesprenkeltenAugen, das trotzige Kinn und die Handvoll Sommersprossenauf der Nase, aber ich kann mich nicht erkennen.In den vergangenen Jahren habe ich meine wahre Identitätso gut versteckt, dass ich das Gefühl habe, mich in dieserZeit selbst verloren zu haben.»River!« In der Stimme meines Vaters schwingt wie sooft Angst mit.",
  "genres": [
    "Fantasy",
    "Romance"
  ],
  "author": "Sylvie Grohne",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/42961803-purple-rain---der-feind-in-meinem-herzen"
}