{
  "title": "O Jogo do Amor/Ódio",
  "description": "Sally Thorne surge na cena literária apresentando um ambiente de trabalho hilário e sensual em uma comédia sobre aquela conhecida linhazinha tênue entre o amor e o ódio. Lucy Hutton e Joshua Templeman se odeiam. Não é desgostar. Não é tolerar. É odia r. E eles não têm nenhum problema em demonstrar esses sentimentos em uma série de manobras ritualísticas passivo-agressivas enquanto permanecem sentados um diante do outro, trabalhando como assistentes executivos de uma editora. Lucy não consegue ent ender a abordagem apática, rígida e meticulosa que Joshua adota ao realizar seu trabalho. Ele, por sua vez, vive desorientado com as roupas coloridas de Lucy, suas excentricidades e seu jeitinho Poliana de levar a vida. Diante da possibilidade de uma promoção, os dois travam uma guerra de egos e Lucy não recua quando o jogo final pode lhe custar o trabalho de seus sonhos. Enquanto isso, a tensão entre o casal segue fervendo, e agora a moça se dá conta de que talvez não sinta ódio por Joshua. E t alvez ele também não sinta ódio por Lucy. Ou talvez esse seja só mais um jogo. Sobre a autora: Sally Thorne vive em Camberra, na Austrália, e O jogo do amor/ódio é seu primeiro romance.Todo mundo está obcecado por esse livro. Rachel Hollis, doThe Chi c Site considerou O jogo do amor/ódio seu “livro preferido do ano de 2016” e disse a seus mais de 25 mil seguidores: “Eu ri, tive um chilique e imediatamente dei uma cópia para todas as minhas amigas lerem.” Book Riot considerou o livro a melhor publ icação de seu mês de lançamento. O site Brit.co está de acordo: “Os fãs de comédias românticas vão babar pelo livro de estreia de Sally Thorne.” As autoras best-sellers do The New York Times, publicadas no Brasil pela Universo dos Livros – Christina Hobbs e Lauren Billings, conhecidas sob o pseudônimo Christina Lauren – classificaram o livro como “Uma estreia viciante e deslumbrante. É um romance que traz muito amor (e ódio) e coração.” E o RT Book Reviews deu à obra seu “Selo de Excelência",
  "genres": [
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit",
    "Adult"
  ],
  "author": "Sally  Thorne",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/42968529-o-jogo-do-amor-dio"
}