{
  "title": "Bullied Boy",
  "description": "Bullying seems to be an unavoidable part of high school. Self-image, body changes, and social changes chip away at an individual’s self-confidence. Withdrawal and hiding can often seem like the easiest escape. You cannot escape from life.An excellent student, our hero is ripped from his friends and everything he knows when his father is moved across the country for his job. Intent on re-establishing the mother’s employment, the parents appear to withdraw from their high school student as he is dropped into a situation where he knows no one.Everyone experiences physical and emotional problems but our protagonist is ashamed of his body and won’t even talk to his parents who seem oblivious. Wearing baggy clothes, coats, and hoods, it is easy to hide his body and isolate himself since he knows no one. Others assume he is overweight, shy, or has acne problems.The strangely dressed student is a magnet for bullies and everyone else ignores him. Teachers might have gotten involved or pushed him to participate in class, but as an excellent student, grades are not an issue. Life evolves into a strategy to be left alone and survive another day. Because of this, attacks are not reported.An accident at school will expose our protagonist’s secrets to a classmate. How that classmate responds will change our protagonist’s life.There are still bullying and attacks, but with newfound confidence, our hero will deal with things differently. Can this quiet, isolated person evolve into an example and build real friendships while accepting life’s little hurdles? This series of books contain examples of high school life that help the reader to identify and deal with bullying behavior in a high school setting. The books in this series are intended to be safe reading for teens, tweens, and adults.Thank you for reading on.Daring DianeDisclaimer This story is a work of fiction. Names, characters, businesses, places, events, locales, and incidents are either the products of the author’s imagination or used in a fictitious manner. Any resemblance to actual persons, living or dead, or actual events is purely coincidental.",
  "genres": [
    "Young Adult",
    "Transgender"
  ],
  "author": "Daring Diane",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/42970373-bullied-boy"
}