{
  "title": "The Sheriff and the Innocent Housekeeper",
  "description": "The Sheriff and the Innocent HousekeeperHistorical Western Romance/NovellaApproximately 20,000 WordsWhen Becky Hamilton is orphaned at the tender age of fourteen, she comes to live with her aunt in Waco and begins work cooking and cleaning for the town’s brooding young sheriff. Mesmerized immediately with his raw masculinity and sinewy strength, her fascination turns to love as the years pass and his honest integrity is revealed.Jake Cooper manages to ignore his pretty, little orphaned housekeeper for three long years. But when she begins a subtle metamorphosis from girl to woman, he can’t control his consuming need for her any longer. It has been his job to protect the town all these years, but who will protect her from him? clutched the plate to her mid-section, standing as still as a rabbit caught in a predators sight, when she saw the way he stood at the door, watching her. Her hands began the all too familiar shaking, and she heard a roaring sound in her ears and a crashing, splintering noise at her feet. She looked down at the broken plate and in her confusion quickly bent down to retrieve it. A sharp pain in her hand jerked her upright again. The spell was broken when his deep voice intruded on her consciousness. “Goddammit!”Becky stood immobile as he pushed off the door and was quickly upon her. He picked up her hand in his. “Becky, what the hell?”She looked down at his hands holding hers and saw a stream of blood running from a cut on her finger. She realized she had compounded her mistake by cutting her finger. The plate was in shards on the floor. She knew those plates had belonged to his mother. Tears welled in her eyes.“I’m sorry, Sheriff.” He pulled her to the kitchen and his large body crowded her against the counter as he held her hand where it was bleeding. His arms wrapped around her from behind, his chest pressed into her back as he held her bleeding finger in the pail of cold water. The water turned pink as she tried not to faint. His mouth moved to her ear. “You’re more trouble than you’re worth.” He growled the words in her ear. His warm breath caressed her face. “I’m sorry about your m-mother’s china.” Her voice wobbled from the impact of his nearness. He reached around and tugged her chin up and around so he could look into her eyes. “You know this isn’t about the goddamn china, don’t you, Becky?”",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Westerns",
    "Erotica",
    "Novella",
    "Western Romance"
  ],
  "author": "Lynda Chance",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/12371682-the-sheriff-and-the-innocent-housekeeper"
}