{
  "title": "What's Left Between Us: A Pearl Girls Novel",
  "description": "Bay is standing on a stage in Nashville, on the verge of achieving her dream of a record deal, when she learns she may have lost what matters most to her. Scott, her childhood sweetheart, has gone missing in Afghanistan. The news of his capture by the Taliban strips Bay of her voice at the biggest moment of her life, sending her into a tailspin that lands her on her parents’ doorstep for Christmas, for the first time in years.Old wounds between Bay and her mother, Violet, break open as soon as Bay walks in the door. The gulf that’s divided them since Bay’s twin sister, Lillie, drowned at twelve years old, has grown wider as Bay put distance between herself and the family. As Bay tries to reconnect with them, she stumbles over clues that could unravel her mama’s long-held secrets—and tear her the LaFleurs apart. Armed with the truth, Bay finds herself in a fight to bring the people she loves most back home to each other.-----“In the world of the Pearl Girls, family values and true love combine with long-buried secrets to create a place that is distinctly southern. Heron deftly weaves a story of heartbreak, betrayal, sacrifice and ultimately, redemption, into an unforgettable debut that will earn her a spot in readers’ hearts.” - Kristy Woodson Harvey, National Bestselling author of SLIGHTLY SOUTH OF SIMPLE\"In WHAT'S LEFT BETWEEN US, Gina Heron weaves a story that’s as Southern as sweet tea. Fans of romantic southern fiction will adore this vivid and beautifully told tale about how shadows from our past can have a long reach into the present.\" - Kimberly Belle, USA Today and WSJ bestselling author of THE MARRIAGE LIE“From the first, I loved these broken characters in the first novel of the Pearl Girl Series, with their grit and soul. Set amongst the ruins of a family that has suffered the loss of many dreams – one daughter drowned, the other struggling to stay afloat in her survivor’s guilt - and the heartbreak over a missing soldier. The journey home touches a lot of raw nerves as the characters in WHAT'S LEFT BETWEEN US struggle to find faith in one another – and in themselves. I laughed at the bittersweet and brave exchanges between the main character and her mother, cried at the soft visions of a ghostly sister who reveals the truths that hold this family together, and celebrated the hard-won redemption of a soldier who believes he’s lost his soul to trauma. Love wins in this novel. It’s a pearl, for sure.” - Kimberly Brock, author of THE RIVER WITCH\"I'm a sucker for beautiful words that come together as an engrossing story and make it impossible for me to put down a book. Many times those beautiful words create a novel more literary than commercial. Heron's debut novel, WHAT'S LEFT BETWEEN US, manages to be both of these things, magically creating a literary reading experience inside of a page-turning plot. WHAT'S LEFT BETWEEN US is the story of a homecoming, but more than that, it's the story of how we find a sense of home inside ourselves...a brilliant novel that will deeply move your soul. Heron is an author to watch.\" - Suzanne Palmieri, international bestselling author of THE WITCH HOUSE OF PERSIMMON POINTWHAT'S LEFT BETWEEN US is a heart-warming story about when to stay and when to go, the true meaning of family and home, and how childhood friends Bay and Scott begin to blossom. From the beginning, I found myself cheering for them and anxiously turning the pages, which crackle with tension and genuine emotion as Bay and Scott find their way. - Heather Bell Adams, award-winning author of MARANATHA ROAD“With resonant themes of war and homecoming, safety and threat, and tradition and choice, this heartwarming story will appeal to anyone who has struggled with whether the battles thrust upon us should be the ones w",
  "genres": [
    "Fiction"
  ],
  "author": "Gina Heron",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/42974442-what-s-left-between-us"
}