{
  "title": "The House of Brides",
  "description": "Jane Cockram makes her thrilling debut with this page-turning tale of psychological suspense in which a young woman whose life is in tatters flees to the safety of a family estate in England, but instead of comfort finds chilling secrets and lies.Miranda’s life and career has been a roller-coaster ride. Her successful rise to the top of the booming lifestyle industry as a social media influencer led to a humiliating fall after a controversial product she endorsed flopped. Desperate to get away from the hate-spewing trolls shaming her on the internet, she receives a mysterious letter from a young cousin in England that plunges her into a dark family mystery.Miranda’s mother Tessa Summers, a famous author, died when Miranda was a child. The young woman’s only connection to the Summers family is through Tessa’s famous book The House of Brides—a chronicle of the generations of women who married into the infamous Summers family and made their home in the rambling Barnsley House, the family’s estate. From Gertrude Summers, a famed crime novelist, to Miranda’s grandmother Beatrice, who killed herself after setting fire to Barnsley while her children slept, each woman in The House of Brides is more notorious than the next. The house’s current “bride” is the beautiful, effervescent Daphne, her Uncle Max’s wife—a famed celebrity chef who saved Barnsley from ruin turning the estate into an exclusive culinary destination and hotel.Curious about this legendary family she has never met, Miranda arrives at Barnsley posing as a prospective nanny answering an advertisement. She’s greeted by the compelling yet cold housekeeper Mrs. Mins, and meets the children and her Uncle Max—none of whom know her true identity. But Barnsley is not what Miranda expected. The luxury destination and award-winning restaurant is gone, and Daphne is nowhere to be found. Most disturbing, one of the children is in a wheelchair after a mysterious accident. What happened in this house? Where is Daphne? What darkness lies hidden in Barnsley?",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Gothic",
    "Suspense",
    "Adult",
    "Mystery Thriller"
  ],
  "author": "Jane Cockram",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/42980958-the-house-of-brides"
}