{
  "title": "Silent No More: How I Became a Political Prisoner of Mueller's \"Witch Hunt\"",
  "description": "In Silent No More: How I Became a Political Prisoner of Mueller’s \"Witch Hunt\", New York Times bestselling author of Killing the Deep State Jerome R. Corsi, Ph.D. meticulously details the psychological torment he was subjected to in what the media has simply called, “The Mueller Investigation.”In late 2018, in an FBI closed conference room with no windows, Dr. Corsi was confronted for hours upon hours at a time by detailed questioning about events that occurred in 2016. Dr. Corsi’s inquisition was worthy of the Gestapo or KGB, designed to break even the most cooperating witness. Over a period of two months, three of Mueller’s top prosecutors and an army of FBI agents—up to nine government officials at a time—questioned Dr. Corsi with his attorney, David Gray.  Throughout this harrowing ordeal, Dr. Corsi handed over his personal computers, his cell phone, all of his email accounts, his Twitter account, and his Google account. Finding no “smoking gun,” Mueller’s prosecutors blew up the meetings. Dr. Corsi refused to lie to the prosecutors to give them the ammunition they needed to prosecute Roger Stone, and as a result he was told he would be charged with a criminal offense for lying to the FBI and the Special Prosecutor. At seventy-two years of age, Dr. Corsi was subjected to extreme mental anguish, imagining that he may never see his family again as a free man. Rather than conducting an honest investigation, Mueller’s Special Prosecutors reinforced a prefabricated narrative aiming to charge President Trump with Treason. Silent No More: How I Became a Political Prisoner of Mueller’s \"Witch Hunt\" exposes the inner workings of this governmental escapade, and clearly states why Mueller has no case against the President.  Dr. Corsi creates a compelling case indicating that the entire matter is an investigation in search of a crime—to force lying testimony from witnesses if that’s what it takes to achieve Deep State political objectives.",
  "genres": [],
  "author": "Jerome R. Corsi",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/42977215-silent-no-more"
}