{
  "title": "A Wonderful Life",
  "description": "Numerous heartbreaking tragedies have broken Noel Bradford’s spirit. When he finds himself perched on the barrier of a bridge, intending to jump into the icy river, he prays for help. Clarence, a very unusual angel, answers his pleas, and not in ways one would expect. Wise words save Noel’s sanity, offering him a reason to stay alive.Mary Star, the woman who owns a teen shelter in Bedford Falls, is desperately in need of a helping hand, of donations to keep her doors open and to be saved from the neighborhood thugs who force their way in to get at a young girl in her care. Is the handsome stranger who appears at the exact moment of desperation an angel sent in answer to her prayers?Angels with Attitudes SeriesMy Cheeky Angel - Book #1 From shy, lonely tomboy to hotshot businesswoman, baggy jeans to suits and stilettos, this story follows the journey of Annie Hynes. She’s faced with one conflict after another and is forced to cope with life’s challenges. Will she eventually accept true love? Or… is she just too timid.His Devious Angel - Book #2Angels with Attitudes Series Man-hater gets mixed up with a crazy, hotshot soldier when he runs her down with his convertible. Now she's stuck having to accept his help to do her dog-walking job. Just her luck some expensive pets go missing, and her new partner decides the puppy-mill rumor needs to be investigated. Dangerous work - but they have an eccentric angel on their side. Loveable Christmas Angel - Book #3Angels with Attitude Series An unexpected trip to Oahu, a failing aunt who begs Leilani to take over the care of her prickly five-year-old grandson, a forced meeting stuck in the elevator with the luscious owner of an exclusive hotel and Leilani desperately needs the help of her angel.A Wonderful Life - Book #4Numerous heartbreaking tragedies have broken Noel Bradford’s spirit. When he finds himself perched on the barrier of a bridge, intending to jump into the icy river, he prays for help.",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Mimi Barbour",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/42969783-a-wonderful-life"
}