{
  "title": "Lady Venom Takes a Mistress",
  "description": "From international bestselling author Kat Blackthorne comes a haunted and spooky twist on Medusa and Beauty and the Beast. For everyone who needs a sapphic story where the women are lethal and insatiable.To be bid on was to be bought as a wife. To the winning bidder his prize, a maid, a servant, a child-bearer. That would be Poesy Laroche’s life, she realized, as she walked down the aisle to her future husband. He’d promised to break her into submission, and she knew his words were true.In an act of desperation, she takes the reins of her fate and dives into the woods rife with terrors. The screams that come at night become only whispers of stories about the mysterious Lady Venom. Her manor is filled with snakes and horrors. And when Poesy gets lost within her maze, Lady Venom claims her as her own mistress, with no hope to escape.Poesy is locked into a haunted estate where the flowers watch, the ghosts whisper while the snakes slither, and everyone knows the deadliest of them all is their Lady that rules them.But there are secrets to uncover both within the eerie walls and in the riddles atop Lady’s Venom’s forked tongue as she incites more danger and pleasure than Poesy ever thought possible.But will it be enough to keep Poesy from her fate? Or will the hidden truths prove more fateful than a serpent’s bite?Lady Venom is a haunted, spooky, lesbian romance with lethal women and gothic magic. It’s a twist on both Medusa and Beauty and the Beast and features femme dom and captive tropes with off the charts spice. This story is set in The Halloween Boys universe with crossover of lore, but you do not need to read The Halloween Boys before enjoying Lady Venom Takes a Mistress. Please see authors site for content information.",
  "genres": [
    "Lesbian",
    "Fantasy",
    "Romance",
    "Queer",
    "LGBT",
    "Paranormal",
    "Dark Romance"
  ],
  "author": "Kat Blackthorne",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/123719015-lady-venom-takes-a-mistress"
}