{
  "title": "The Shape of Family",
  "description": "\"Deeply involving.... Rings so true.\" (Emma Donoghue, best-selling author of \nRoom\n)From the international best-selling author of \nSecret Daughter\n and \nThe Golden Son \ncomes a poignant, unforgettable novel about a family's growing apart and coming back together in the wake of tragedy. \"\nThe Shape of Family\n is a novel about race and culture, parents and siblings, marriage and love, but most of all, it's about finding hope after darkness. Shilpi Somaya Gowda is a compassionate and wise storyteller who keeps us riveted from beginning to end.\" (Jean Kwok, \nNew York Times\n best-selling author of \nGirl in Translation\n)The Olander family embodies the modern American Dream in a globalized world. Jaya, the cultured daughter of an Indian diplomat and Keith, an ambitious banker from middle-class Philadelphia, meet in a London pub in 1988 and make a life together in suburban California. Their strong marriage is built on shared beliefs and love for their two headstrong teenager Karina and young son Prem, the light of their home.But love and prosperity cannot protect them from sudden, unspeakable tragedy, and the family’s foundation cracks as each member struggles to seek a way forward. Jaya finds solace in spirituality. Keith wagers on his high-powered career. Karina focuses relentlessly on her future and independence. And Prem watches helplessly as his once close-knit family drifts apart.When Karina heads off to college for a fresh start, her search for identity and belonging leads her down a dark path, forcing her and her family to reckon with the past, the secrets they’ve held and the weight of their choices.The Shape of Family is an intimate portrayal of four individuals as they grapple with what it means to be a family and how to move from a painful past into a hopeful future. It is a profoundly moving exploration of the ways we all seek belonging - in our families, our communities and ultimately, within ourselves.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Family",
    "Book Club",
    "Canada",
    "Adult Fiction",
    "Audiobook"
  ],
  "author": "Shilpi Somaya Gowda",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/43000755-the-shape-of-family"
}