{
  "title": "Everybody Died, So I Got a Dog",
  "description": "**As featured on BBC2's Between the Covers**'Glamorous. Heart-breaking. Hilarious. Feminist. Life-changing'Katherine Ryan'I loved this book so much. It's hard to overpraise. So funny and so sad and so hopeful' Neil Gaiman'A wonderful and very special book'Adam Kay, author of This is Going to Hurt'Funny, sparklingly honest and heart-breaking'Bel Mooney, Daily Mail'Heartwarming and heartbreaking all at the same time! Genuinely couldn't put it down'Alan Carr'Incredibly moving, always funny and brilliantly written. I urge everyone to read it'Frank Skinner'LOVELY. Sad and funny and warm and DOGS'Marian Keyes'Very beautiful and poignant . . . it'll make you laugh and cry in equal measure'Giles Paley-Phillips'I read it in one sitting - it's so blinking good'Lorraine Kelly'A book that will leave you smiling but with a lump in your throat'Mail on Sunday, '100 Hottest Summer Books 2019'* * * The funny, heart-breaking, wonderfully told story of love, family and overwhelming loss which led Emily Dean to find hope and healing in the dog she always wanted.Growing up with the Deans was a fabulous training ground for many ignoring unpaid bills, being the most entertaining guest at dinner, deconstructing poetry. It was never home for the dog Emily craved. Emily shared the lively chaos with her beloved older sister Rachael, her rock. Over the years the sisters bond grew ever closer. As Rachael went on to have the cosy family and treasured dog, Giggle, Emily threw herself into unsettled adventure - dog ownership remaining a distant dream. Then, tragically, Rachael is diagnosed with cancer. In just three devastating years Emily loses not only her sister but both her parents as well. This is the funny heart-breaking, wonderfully told story of how Emily discovers that it is possible to overcome the worst that life can throw at you, that it's never too late to make peace with your past, and that the right time is only ever now, as she finally starts again with her very own dog - the adorable Shih-tzu named Raymond.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Grief",
    "Audiobook",
    "Mental Health",
    "Humor"
  ],
  "author": "Emily Dean",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/43019862-everybody-died-so-i-got-a-dog"
}