{
  "title": "In the City by the Lake",
  "description": "When Viktor Mikhailov follows in his father’s footsteps and joins the relatively insignificant Russian mob, he is given an assignment none of his comrades want, yet Viktor cannot help but be secretly pleased. The city is a cesspool of organized crime, with several outfits fighting for a piece of the Prohibition pie, and Viktor’s slice is the openly gay Towertown. Tasked with providing whiskey to the queer clubs he covertly frequents, Viktor gains monetary wealth while finding himself in an unconventional relationship with his top client’s muse, an enigmatic redhead named Calvin Connolly.Calvin—along with throngs of idealists who pack the pansy parlors—believes they stand on the precipice of a revolution, but Viktor is not convinced. A skeptic by both nature and lack of nurture, Viktor questions the conservative culture’s capacity for true change while hoping that broad acceptance is imminent. Perhaps then he could accept the parts of himself he hides.While the repeal of Prohibition leads to financial issues for Viktor, a Depression-era disapproval of the liberal lifestyles of the 1920s initiates a slew of deeper problems. Sensationalized news stories regarding a rash of sex crimes paint homosexuals as depraved monsters and precipitate numerous laws against the queer community. The government’s intent is not only to eradicate pansy parlors—but homosexuality entirely. When an unexpected arrest forces Viktor to arrive at a decision he feels unprepared to make, he struggles with the ramifications.IN THE CITY BY THE LAKE is a work of historical fiction focused on the emotional journey of a twenty-one-year-old closeted mobster living in Chicago during the LGBT emergence of the late 1920s to early 1930s, a period deemed the “Pansy Craze.”",
  "genres": [
    "M M Romance",
    "Historical Fiction",
    "Historical",
    "LGBT",
    "Fiction",
    "Romance"
  ],
  "author": "Taylor  Saracen",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/43000708-in-the-city-by-the-lake"
}