{
  "title": "Only Ever You",
  "description": "He’s the hot-as-sin rocker hiding a secret that would devastate his fans. She’s the only girl he’s ever loved, but keeping her safe means he had to walk away…\nRYDERMy entire life is a lie, propelled by one wrong decision that altered my fate.If fans knew the truth, they’d run away screaming. But all they see is Ryder Stone, moody guitarist and lead singer of Torment, and a potential notch on their bedpost.Only two people know who I really am. My manager has a vested interest in keeping my secret, and the girl I was forced to leave behind doesn’t even know the true extent of my shame.Losing Zeta is both my biggest regret and my proudest moment. But she was the glue keeping me together, and I’m struggling to survive without her. Especially when demons from my past continue to haunt me and the threat of disclosure is ever present.When she reappears in my life, this time, I’m too weak to push her away.Her love has the power to save me. Mine has the power to destroy her.ZETAI’ve worked hard to forget my past. To rise above my messed-up childhood and make something of myself; however, there’s no forgetting him.Ryder’s gorgeous face and drool-worthy body are plastered over tabloids and TV screens, reminding me I’m still in love with the boy who captured my heart in juvie.When he failed me, I thought I’d never again experience such heart-crushing pain. But watching him fall out of clubs with a succession of different girls renews the agony, resurrecting countless unanswered questions.Now my boss has sent me to interview him. It’s a massive scoop for the magazine, and turning it down would kill my career. So, I delude myself into thinking I can handle this.Perhaps this is the closure I need to finally move on.Except I’m terrified nothing has changed and one look into those soulful eyes will suck me in again.Ryder almost destroyed me last time. This time, he could ruin me forever.",
  "genres": [
    "Second Chance",
    "Romance",
    "Second Chance Romance",
    "Music",
    "Contemporary Romance",
    "Friends To Lovers",
    "Contemporary"
  ],
  "author": "Siobhan     Davis",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/43041159-only-ever-you"
}