{
  "title": "Chaos: Charles Manson, the CIA, and the Secret History of the Sixties",
  "description": "A journalist's twenty-year obsession with the Manson murders brings shocking revelations about the most infamous crimes in American history: carelessness from police, misconduct by prosecutors, and even potential surveillance by intelligence agents. What really happened in 1969? In 1999, when Tom O'Neill was assigned a magazine piece about the thirtieth anniversary of the Manson murders, he worried there was nothing new to say. Weren't the facts indisputable? Charles Manson had ordered his teenage followers to commit seven brutal murders, and in his thrall, they'd gladly complied. But when O'Neill began reporting the story, he kept finding holes in the prosecutor Vincent Bugliosi's narrative, long enshrined in the best-selling Helter Skelter. Before long, O'Neill had questions about everything from the motive to the manhunt. Though he'd never considered himself a conspiracy theorist, the Manson murders swallowed the next two decades of his career. He was obsessed. Searching but never speculative, CHAOS follows O'Neill's twenty-year effort to rebut the \"official\" story behind Manson. Who were his real friends in Hollywood, and how far would they go to hide their ties? Why didn't law enforcement act on their many chances to stop him? And how did he turn a group of peaceful hippies into remorseless killers? O'Neill's hunt for answers leads him from reclusive celebrities to seasoned spies, from the Summer of Love to the shadowy sites of the CIA's mind-control experiments, on a trail rife with cover-ups and coincidences. Featuring hundreds of new interviews and dozens of never-before-seen documents from the LAPD, the FBI, and the CIA, CHAOS mounts an argument that could be, according to Los Angeles Deputy District Attorney Stephen Kay, strong enough to overturn the verdicts on the Manson murders. In those two dark nights in Los Angeles, O'Neill finds the story of California in the sixties: when charlatans mixed with prodigies, free love was as possible as brainwashing, and utopia-or dystopia-was just an acid trip away.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Crime",
    "Politics",
    "Audiobook",
    "Conspiracy Theories"
  ],
  "author": "Tom O'Neill",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/43015073-chaos"
}