{
  "title": "AfroSFv3",
  "description": "Space, the astronomical wilderness that has enthralled our minds since we first looked up in wonder. We are ineffably drawn to it, and equally terrified by it. We have created endless mythologies, sciences, and even religions, in the quest to understand it. We know more now than ever before and are taking our first real steps. What will become of Africans out there, will we thrive, how will space change us, how will we change it? AfroSFv3 is going out there, into the great expanse, and with twelve African visions of the future we invite you to sit back, strap in, and enjoy the ride.3 shortlisted for the ASFS Nommo Awards 2019: T. L. Huchu 'Njuzu', Cristy Zinn 'The Girl who stared at Mars', and Biram Mboob 'The Luminal Frontier'.9 nominations for the African Speculative Fiction Society Nommo Awards 2019 for: T. L. Huchu 'Njuzu', Cristy Zinn 'The Girl who stared at Mars', Biram Mboob 'The Luminal Frontier', Gabriella Muwanga 'The Far Side', Wole Talabi 'Drift Flux', Stephen Embleton 'Journal of a DNA Pirate', Masimba Musodza 'The Interplanetary Water Company', Dilman Dila 'Safari Nyota', and Mazi Nwonwu 'Parental Control'.4 nominations for the 2018 British Science Fiction Association Awards for: Cristy Zinn – The Girl Who Stared at Mars, Biram Mboob – The Luminal Frontier, Dilman Dila – Safari Nyota: A Prologue, and Stephen Embleton – Journal of a DNA Pirate.\"The third in this pioneering series with an honour roll of some of African writing's biggest names contributing. Unmissable.\" -- Geoff Ryman, author, awarded the Nebula, two-time Arthur C. Clarke, three-time BSFA, two-time Canadian Sunburst, as well as the Campbell, Philip K. Dick, and James Tiptree Jr., awards.\"The compelling, graceful stories in AfroSFv3 embrace a generous spectrum of places and peoples, eras and objectives. From sophisticated space operas to gritty cyberpunk streets; from day-after-tomorrow beginnings to far-off futures; from familial closeness to alien vastness, these well-wrought tales, infused with all the sharp, bright, enticing flavors of their African origins, show us the commonality of our species across all racial, ethnic and gender lines. Truly, these writers speak the same science fiction tongue as their like-minded cousins from the rest of the planet, with beautiful accents of their native soil.\" -- Paul Di Filippo, author of Cosmocopia, The Steampunk Trilogy, and others.\"With stories ranging from mundane science fiction to distant space opera passing from post-colonial biopunk and new family ties, the latest book of in the AfroSF series shows that inclusivity and multiculturality is the key to the future. As quality storytelling - rooted in every culture and tradition - doesn't belong to a single country or language, these stories prove that the future - as evident as it might sound although not always considered so - does happen everywhere. Excellent reading!\" -- Francesco Verso, author of Nexhuman and editor of Future Fiction.Table of ContentsT. L. Huchu 'Njuzu'Cristy Zinn 'The Girl who stared at Mars'Mandisi Nkomo 'The Emo Hunter'Biram Mboob 'The Luminal Frontier'Gabriella Muwanga 'The Far Side'Wole Talabi 'Drift Flux'Stephen Embleton 'Journal of a DNA Pirate'Masimba Musodza 'The Interplanetary Water Company'Dilman Dila 'Safari Nyota'Mazi Nwonwu 'Parental Control'Andrew C. Dakalira 'Inhabitable'Mame Bougouma Diene 'Ogotemmeli's Song'Edited by Ivor W. Hartmann",
  "genres": [
    "Science Fiction",
    "Anthologies",
    "Short Stories",
    "Fiction",
    "Speculative Fiction",
    "Africa",
    "Science Fiction Fantasy"
  ],
  "author": "Ivor W. Hartmann",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/43080149-afrosfv3"
}