{
  "title": "Z Troop The Marrakech Gamble: A Conner Ryan Series",
  "description": "In the heart-pounding sequel to the Conner Ryan series, \"Z The Marrakech Gamble,\" the stakes have never been higher for ex-SAS soldier Conner Ryan. Blackmailed by the British security services, Conner is thrust back into a world of danger, betrayal, and relentless pursuit.Haunted by the murder of his former SAS Officer, Conner is coerced into rejoining the military, this time as a member of the barbaric penal unit known as Z Troop. Forced to navigate the lawless and blood-soaked streets of a united Ireland, Conner finds himself embroiled in a new brutal civil war. Alongside the Irish Defence Forces, he confronts a fanatical Loyalist terrorist group comprised of ex-British soldiers, driven to extremism by their perceived betrayal by the British Government.But Conner's troubles don't end there. Wrongly accused of the assassination of the notorious Loyalist leader Billy \"Chainsaw\" Black in Catalonia, Conner and his family become prime targets for revenge. Unbeknownst to him, a relentless threat looms on two the vengeful Irish Loyalists and his own estranged brother, Declan O'Malley, now known as Javed Kassem Hanadani, working for Iranian intelligence.As Conner is sent to Kenya for continuation training, he remains oblivious to the imminent danger his wife and children face. The cruel treatment endured at the hands of Z Troop pushes Conner to the brink of desperation, his ability to protect his loved ones waning. It is then that his loyal and resourceful friend, Russian ex-Spetsnaz soldier Alexi Grebenshchikov, emerges from the shadows. Having endured his own trials within Z Troop after escaping the notorious Black Dolphin prison in Russia, Alexi joins forces with SAS/SBS soldiers to embark on a nearly impossible mission in Morocco. Their to confront Hezbollah fighters head-on, risking everything to safeguard Conner's family and eliminate O'Malley once and for all.Dubbed Operation Paperclip, this audacious plan devised by the British security services hinges on the safety of Conner's son, turning the gamble into a race against time. From the vibrant streets of Marrakech, where danger lurks at every corner, to the treacherous battlefields of Ireland, Conner's resolve is tested to its limits. Will the Marrakech gamble pay off, or will Conner be forced to make the ultimate sacrifice to protect those he holds dear?\"Z The Marrakech Gamble\" is an electrifying, adrenaline-fueled thriller that plunges readers into a web of loyalty, betrayal, and the unbreakable bonds of family. Set against the backdrop of war-torn Ireland and exotic international locations, this heart-stopping tale weaves together relentless action, intricate conspiracies, and shocking revelations. Brace yourself for a white-knuckle ride as you join Conner Ryan on his quest for justice, vengeance, and redemption in a world where the line between friend and foe is blurred, and survival is the only option.",
  "genres": [],
  "author": "Anthony McNally",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/43072813-z-troop-the-marrakech-gamble"
}