{
  "title": "The Ethereal Squadron",
  "description": "SOLDIERS, SORCERERS, AND MONSTERS...THIS IS WORLD WAR ONE LIKE YOU’VE NEVER IMAGINED IT.   It’s 1916, and the world is on fire.  The Great War has already consumed much of the globe, but a second, secret war between sorcerers threatens to crack it in two. The ruling families of Germany and Austria-Hungary, those with the chill of magic in their blood, will stop at nothing in their quest for power, and they’ve drawn the entire world into a bloody war because of it.  But Florence Cavell—codename Geist—means to stop them. She had to defy her family, cut her hair, and disguise herself as a man to join the legendary Ethereal Squadron: a joint US-UK division of the allied powers’ mightiest sorcerers. Armed with her powerful specter sorcery, which allows her to “ghost” through bullets and barbed wire alike, Geist fights a tireless battle to end the war once and for all.  But then the Germans unleash the Grave-Maker Gas, a concoction so deadly it destroys everything it touches and transforms even the strongest sorcerers into terrible monsters. Even her ghostly magic can’t resist the gas’s corrosive power, and it costs Geist everything she loves—her team, her friends, even the use of an arm.  This is the new weapon that could end the war—and give the Germans the world.  Now Geist must risk it all to lead a new team deep into hostile territory to discover the source of this terrifying new technology before the enemy sets it loose upon the world. Will she be able to stop the Grave-Maker Gas before it’s too late...or will the secrets of her past finally catch up with her?  Fans of Leviathan by Scott Westerfeld, Airborn by Kenneth Oppel, Shadow Ops: Control Point by Myke Cole, and The Roar by Emma Clayton will love this book.  This book is for anyone who likes reading about:   Strong female protagonists   Military fantasy   Historical fantasy   World War I   Adventure stories",
  "genres": [
    "Fantasy",
    "Magic",
    "Historical",
    "Historical Fiction",
    "Historical Fantasy"
  ],
  "author": "Shami Stovall",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/43074866-the-ethereal-squadron"
}