{
  "title": "Dancer Claws",
  "description": "His shiny bells need jingling...  Bear Buns stripper and grizzly shifter Ryan Rex never took the search for a fated mate seriously. In Fate's opinion, that makes him more than just bad. That makes him Naughty. If this bad boy werebear doesn't claim his mate by Christmas, he's going to lose his shift forever. But, to claim his mate, he's going to need to earn back his mate mark by getting off of The Naughty List. Sounds easy. After all, he's going to have the help of Dancer -- one of Santa Claus' magical flying reindeer. The only problem his, he already wrote the beginning to his own fairytale romance...and it ain't as pretty as his fated mate. In the town of The Wreath, Montana, the only thing more complicated than Fate is Fate mixed up with Christmas magic. Fate's curveballs are even curvier than Ryan's mate.  Will Angelica be Ryan's Christmas angel?  Angelica Smith has never believed in Christmas magic. The curvy baker sees her seasonal job at Bear Claw Bakery as just that -- temp work. A native of Nuthusk, Washington, the BBW's surprised to come face to face with bad boy Ryan rowing across the lake to the bakery. What the heck is the bad boy pie thief doing at The Wreath, Montana? Angelica knows she should hide her pies from the big, bad bear...but does that include her cherry pie?  Can Little Red Riding Hood forgive the big, bad boy bear?  Every year, since they were kids, Ryan stole something from Angelica, something precious. Every year, since they were kids, Ryan had a reason. Will Angelica and Ryan find their fairytale happily-ever-after? And when Angelica sees Ryan dance...will Christmas magic spark between them? There's only one way to find out -- and it's by reading 'Dancer Claws.'  This story, featuring a bad boy werebear and a BBW baker, is loosely based on Little Red Riding Hood.",
  "genres": [
    "Romance",
    "Shapeshifters",
    "Holiday",
    "Paranormal"
  ],
  "author": "Sable Sylvan",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/43082367-dancer-claws"
}