{
  "title": "Your Body's Environmental Chemical Burden",
  "description": "We live in a Tox-Sick World. The chemicals you are being exposed to on a daily basis are slowly shortening your life span and wreaking havoc on your body.They are literally everywhere - furniture, cleaning supplies, make-up, Teflon pans, plastic bottles, storage containers, fuel exhaust, solvents, paints, detergents, photocopiers, fax machines, laser printers, computers, fragrances, dryer sheets, cigarettes, adhesives, moth balls, nail polish, hair dyes, marking pens, art supplies, charcoal fluid, microwaves, disposable cups and plates, Styrofoam, vehicle exhaust, magazines, toothpaste, food, candles, incense, building and renovation materials,  and so much more.The pervasive effects of environment chemicals and the consequences on your health are serious.This book gives you the tools, resources and education you need to eliminate toxins from your body and teaches you how to minimize your exposure to these chemicals and toxins.Scientists found an average of 287 chemicals in the umbilical cord blood of newborns including pesticides, flame retardants, consumer product ingredients, and industrial pollutants. And that's just the beginning. Exposure to contaminants continues thereafter on a daily basis creating a \"body burden\" or, simply put, an accumulated slurry of chemicals stored in our bodies.The author, Cindy Klement, has a Master's degree in Nutrition, is a credentialed Master Health Educator, an Adjunct Professor at a Michigan university, and has been in private practice in functional and integrative health since 1983.  In the six years it took to research chemical contaminants she accumulated over 1,500 studies on the topic of the body's environmental chemical burden. The information was so powerful she decided it needed to be shared with the public, and has published this book.In the U.S. alone, it is estimated that 13% of disease is attributed to the environment from cardiovascular disease, neuropsychiatric disorders, and cancer.  Exposure to environmental chemicals is rarely even mentioned in initiatives to combat chronic diseases.Unfortunately, chemicals are here to stay and we have to learn to co-exist with them.  We can't avoid every one of them, but we can use the tools and resources at our disposal to reduce our exposure.  We can also detoxify the body as best we can with what we know now.Here's some of what you'll learn in this groundbreaking This book is \"The go-to toxin reference for the 21st century - something every home should have!\" - Dr. Deanna Minich, 4x best-selling author. If you're ready to arm yourself against chemical contaminants and take your health in your own hands, hit the BUY NOW button and let's take this journey together.",
  "genres": [
    "Health",
    "Nonfiction"
  ],
  "author": "Cindy Klement",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/43060234-your-body-s-environmental-chemical-burden"
}