{
  "title": "My Smelly Ass: Kids Funny Bedtime Story Picture Book",
  "description": "My Smelly Ass\n\nKids Funny Bedtime Story Picture Book\n‘Henrietta stroked my smelly ass, whilst holding her nose and striking a strange social media sort of pose.It started to tickle, making my ass rear-up and end in a pickle, getting its hind foot stuck in a hole which had been dug by a mole.My ass began to panic, causing methane pressure to build-up inside its hide, making it bulge evermore wide.I said, “You know, my ass is going to blow!”She started to frown and we prepared to drown in a pungent sea of flatulence, whilst I feared the sonic booms might destroy all the rooms in the nearby town.Then, like a thousand football stadiums of flatulent fans all blowing off together in perfect harmony, my ass suffered a major gas leak, leaving us unable to even speak. It was so so loud, but my ass looked so so proud.Unfortunately, at that very moment a passer-by tossed his burning cigarette butt up high, falling into the gas cloud from the sky. His butt detonated a big bang and the whole universe rang, as my ass sent out a shockwave of flaming ass radiation which knocked us off our feet and into the street.Looking up, I felt a little proud that my smelly ass had produced such a huge mushroom cloud.Still in a daze, I got my ass back on its feet in the haze, whilst all around us was now ablaze, as Henrietta screamed, “My ass is on fire!” ….’\n\nCan anyone save Henrietta’s ass? Will my smelly ass ever escape the hole dug by a mole?\n\n\n\nMy Smelly Ass children’s picture book will have you and your children laughing out loud. This read makes a great bedtime story book for any kid. Suitable for both boys and girls, from preschool kids to early school children ages 3, 4, 5, 6 and 7 up to age 8 years old.\n\n\n\nLee Pong Wong has set you a challenge at the end of the book. If you accept the challenge it could make you famous!",
  "genres": [
    "Picture Books"
  ],
  "author": "Lee Pong Wong",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/43066359-my-smelly-ass"
}