{
  "title": "Nothing to Fear: FDR's Inner Circle and the Hundred Days That Created Modern America",
  "description": "A revealing account of the critical first days of FDR’s presidency, during the worst moments of the Great Depression, when he and his inner circle launched the New Deal and presided over the birth of modern America Nothing to Fear brings to life a fulcrum moment in American history—the tense, feverish first one hundred days of FDR’s presidency, when he and his inner circle swept away the old order and reinvented the role of the federal government. When FDR took his oath of office in March 1933, thousands of banks had gone under following the Crash of 1929, a quarter of American workers were unemployed, farmers were in open rebellion, and hungry people descended on garbage dumps and fought over scraps of food. Before the Hundred Days, the federal government was limited in scope and ambition; by the end, it had assumed an active responsibility for the welfare of all of its citizens. Adam Cohen offers an illuminating group portrait of the five members of FDR’s inner circle who played the greatest roles in this unprecedented transformation, revealing in turn what their personal dynamics suggest about FDR’s leadership style. These four men and one woman frequently pushed FDR to embrace more activist programs than he would have otherwise. FDR came to the White House with few firm commitments about how to fight the Great Depression—as a politician he was more pragmatic than ideological, and, perhaps surprising, given his New Deal legacy, by nature a fiscal conservative. To develop his policies, he relied heavily on his advisers, and preferred when they had conflicting views, so that he could choose the best option among them.  For this reason, he kept in close confidence both Frances Perkins—a feminist before her time, and the strongest advocate for social welfare programs—and Lewis Douglas— an entrenched budget cutter who frequently clashed with the other members of FDR’s progressive inner circle. A more ideological president would have surrounded himself with advisors who shared a similar vision, but rather than commit to a single solution or philosophy, FDR favored a policy of “bold, persistent experimentation.” As a result, he presided over the most feverish period of government activity in American history, one that gave birth to modern America.  As Adam Cohen reminds us, the political fault lines of this era—over welfare, government regulation, agriculture policy, and much more—remain with us today. Nothing to Fear is both a riveting narrative account of the personal dynamics that shaped the tumultuous early days of FDR’s presidency, and a character study of one of America’s defining leaders in a moment of crisis.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "American History",
    "Presidents",
    "Audiobook"
  ],
  "author": "Adam Cohen",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/4307227-nothing-to-fear"
}