{
  "title": "Farilane",
  "description": "#1 Epic Fantasy Bestseller in AudiobooksSome truths are dangerous, certain secrets best concealed, and one story never should have been written at all.Being an unwanted twin in the imperial line of succession, Farilane becomes a scholar, an adventurer, and—in a time when reading is forbidden—a hunter of books. Her singular obsession is finding the mythical Book of Brin, a tome not just lost but intentionally buried. Although she is respected and beloved by the Teshlor Knights, not even their legendary skills can protect her, for what she finds is more dangerous than what she sought.From the three-time New York Times best-selling author Michael J. Sullivan, Farilane is the second novel in The Rise and Fall trilogy. This latest set of stories sits snugly between the Legends of the First Empire series and the Riyria books (Revelations and Chronicles). With this tale, Michael continues his tradition of unlikely heroes who must rise to the call when history knocks, demanding to be let in. This series will conclude in the summer of 2023 with the release of Esrahaddon, the final piece in a narrative that began in 2008 and contains nineteen full-length novels spread across four series.What people are saying about the book\"Another Character that I Fell in Love With\"\"Such a great story from beginning to end! I couldn't stop listening! Ten stars!\"\"What an incredible book!\"\"In my opinion, it’s the best book he’s written so far.\"\"SUPERB!\"\"I found myself laughing so hard and so much and I want to be her!!\"\"Sullivan does a masterful job of weaving in elements and creating a story arch that is worth reading and then reading again to find what you've missed.\"\"WOW!\"\"There are no words to prepare you for what comes at the end.\"\"As a huge fan of Michael J Sullivan’s works, this book did not disappoint.\"",
  "genres": [
    "Fantasy",
    "Audiobook",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Adult"
  ],
  "author": "Michael J. Sullivan",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/43087664-farilane"
}