{
  "title": "His Hart's Command",
  "description": "Lennox Freeman (Free) is one of the best hackers in the world which has caused him to spend most of his life on the run. Never able to put down roots, he couldn’t trust anyone not to take advantage of him, even his own family. If it wasn’t for his best friend, Tech, shielding him, Free’s father would’ve sold him and his skills to the highest bidding crime family when he was still a student at MIT. Free owed Tech his life; so when his friend called for him to come to Atlanta to work with him, he couldn’t say no. However, he wasn’t expecting the overprotective group of detectives that made up Atlanta PD’s most notorious task force. And he certainly wasn’t prepared for the large-and-in-charge SWAT Captain that was responsible for their safety.Ivan Hart has lived and bled one creed all of his life: To Serve and Protect. His intense focus and determination in law enforcement has led him to finally commanding his own team. He’d worked hard to put together a squad of badasses capable of backing up a very dangerous team of detectives. Being God and Day’s last line of defense came with a lot of responsibility that he took very seriously.After his divorce was final Hart turned right around and remarried his job. He had his good friends there in the office with him every day, so it was easier to ignore the few quiet hours he spent at home alone each night. He’d settled well into his new routine and was comfortable with it. Then God decided to disrupt everything by hiring another tech specialist for his department. A man whose brains, trendy looks, and voice would leave Hart tongue-tied and captivated at their first introduction.Free quickly awakens a passion in Hart that he long thought was dead. An attraction he didn’t know existed. He couldn’t fathom that the sexy cyber genius could be interested in an over-sized, big-bearded brute that served criminals the bottom line for a living. No matter what his best friend, God said.A future with Hart could be potentially dangerous and often times full of terrifyingly close calls; but little did he know that so could falling for the most hunted hacker in the world. All Lennox Freeman wants in life is security, love and protection… Hart had all that to give and more.This novel is a part of a series and contains previously mentioned characters, but CAN BE read as a standalone. No cliffhangers.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Crime",
    "Gay",
    "LGBT"
  ],
  "author": "A.E. Via",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/43089110-his-hart-s-command"
}