{
  "title": "Dark Agenda: The War to Destroy Christian America",
  "description": "\"Read this disturbing but vital book.\" — Tucker CarlsonFrom the New York Times bestselling Trump Will Smash the Left and Win author and leading conservative thinker comes DARK AGENDA, an extraordinary look into the left’s calculated efforts to create a godless, heathen American society — and how these efforts must be stopped.And it is written by David Horowitz, a Jew.In Dark The War to Destroy Christian America, Horowitz warns that the rising attacks on Christians and their beliefs threaten all Americans — including Jews like himself. The liberal establishment and their radical allies envision a new millennium in which Christianity is banished, Horowitz argues. He says that Judeo-Christian values are at the very root of America’s democracy. Kill off such values and all of our freedoms could perish.Horowitz examines how our elites — increasingly secular and atheist — are pushing a radical How the left trashes Christian doctrines critical to the American Republic, much like radical Islam’s war on “infidel” cultures like ours.Why the left fights to keep prayer and religion out of public schools, and how those efforts fly in the face of Founding Father Thomas Jefferson’s intentions.How fanatical liberals helped create the religious right by targeting evangelicals and believing Catholics and other conservatives.How Barack Obama’s ultra-liberal agenda galvanized the anti-God, anti-religious left.The violent and shocking manifesto of Planned Parenthood founder Margaret Sanger who advocated the use of dynamite to promote “revolutionary solidarity.”Filled with stories that demonstrate the mind-numbing reasons behind the secular Left’s smug disdain for Christianity, Horowitz traces the history of religious liberty from the Founding Fathers to now. He shows how the Founding Fathers put aside their own skepticisms about God and religion to write The Declaration of Independence.Today, he writes Donald Trump’s “genuine love for his country” has galvanized Christians to fight the secular war waged against them — as the president has become a lightning rod for the radical left.David Horowitz’s powerful new book brings vital insights into the war against Christianity and names the global radicals, leftist Democrats, and money-hungry fat cats of Hollywood and Wall Street responsible for it. Finally, a clear and sensible American voice — one that is not Christian but Jewish — stands up to the twisted rantings of those who want to tear down faith and bedrock of American values. David Horowitz delivers an impassioned plea for the restoration of political sanity in America, a perspective that made America great by respecting the faiths of our fathers and mothers.“One of the most intellectually compelling and rational defenses of Christianity’s role in America.\" — Gov Mike HuckabeeThe Best Book on Politics for Christians in 2019 — The Stream",
  "genres": [
    "Politics",
    "Nonfiction",
    "Christian",
    "Religion",
    "History",
    "American",
    "Christianity"
  ],
  "author": "David Horowitz",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/43090444-dark-agenda"
}