{
  "title": "Prancer Claws",
  "description": "He's stuffing her stocking...  Billionaire bear shifter Ethan McLean is a man who's used to getting anything he wants -- all year round, not just at Christmas. He's as grizzly as he is rich, and that's just how this humbug likes it. When Ethan lands himself on The Naughty List for failing to find a fated mate, there's no amount of money that can buy back his mate mark -- or his shift. He's not just going to have to pull Santa Claus' sleigh on Christmas Eve. He's also going to have to claim his fated mate -- after getting himself off The Naughty List. The only problem is, Ethan has no idea how to do any of that without his bank account...or his shift. And his fated mate...well, she ain't that kind of BBW. Can Ethan make his own Christmas miracle come true, and grant some Christmas wishes for others? Maybe -- with a little help from Prancer, Santa Claus' flying reindeer.  Curvy Carol's Christmas list doesn't have an engagement ring on it  Curvy Carol Carter came to The Wreath, Montana for one thing -- work. She has no time to play around like a frikkin' billionaire, and that means that when lumberjack Ethan comes into Bear Claw Bakery and tracks mud all over the place, she's not about to let it slide...even if his bad boy attitude is kinda sexy. Carol's got bigger problems. She has to come up with a theme for the Christmas part of the one and only Santana Claus -- her boss's boss. Will Ethan be an unwanted distraction...or is he just the kind of distraction she needs? When a mysterious reindeer defends her, when the bear fails to, the answer becomes a lot more muddy -- just like Ethan's footprints on the kitchen floor.  Will Ethan claim his curvy Cinderella?  Ethan's never met a woman like Carol, a woman equal parts curvy and sassy, a woman who isn't afraid to call him out on his bullshizz. The only problem is, he's got secrets...like the fact he's a billionaire, the fact he's a werebear-turned-reindeer, and why he's on The Naughty List. Will Ethan find a way to tell Carol the truth? Will Carol get the Cinderella ending she deserves? Find out -- in 'Prancer Claws.'  This story, featuring a bad boy werebear and a BBW baker, is loosely based on Cinderella.",
  "genres": [
    "Christmas",
    "Romance",
    "Shapeshifters",
    "Paranormal"
  ],
  "author": "Sable Sylvan",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/43088709-prancer-claws"
}