{
  "title": "This Crazy Time: Living Our Environmental Challenge",
  "description": "From one of the world's most controversial campaigners, This Crazy Time is the No Logo of the NEW environmental movement, an essential must-read that combines Bill Bryson's personable style and humour with Naomi Klein's hard-hitting activism and research.Passionate, profound, inspiring and funny, Berman is inspiring people from all walks of life to get off the sidelines and fight the good fight--and win. This unique book--part manifesto from a leader, part humorous activist memoir from a soccer mom--offers a wryly honest, behind the scenes, ultimately uplifting look at the state of the planet. For almost 20 years, Tzeporah Berman has been one of our most influential environmentalists. A founder of ForestEthics and PowerUp Canada, she was instrumental in shaping the tactics and concerns of the modern environmental movement.In her early 20s she faced nearly one thousand criminal charges and 6 years in prison for her role organizing blockades in Canada's rainforest. With ForestEthics she took on Victoria's Secret with a photo of a chainsaw-wielding lingerie model, convincing the catalogue manufacturer to stop using paper made from old-growth forests. She then transformed her tactics and sat down with CEOs and political leaders to reshape their policies and practices. She participated in saving over 12 million acres of endangered forests, including Canada's Great Bear Rainforest, and has campaigned against the development of Canada's oil sands. In her new role at Greenpeace International she is fighting the problem of our climate change, including researching the impacts of the Gulf Oil Spill and protesting oil drilling in the Arctic. As a concerned mother, her book is an impassioned plea for a better world.",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "Tzeporah Berman",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/12373142-this-crazy-time"
}