{
  "title": "Relatos de un mundo por conocer",
  "description": "Opiniones de « Diario de un joven aventurero con la frescura de un diario de viaje. Directo, explícito y con un toque de humor. Según vas leyendo, te va enganchando...Quedamos a la espera de la próxima entrega.» « La amenidad. Un relato interesante y distinto ». « ¡Lectura recomendada, libro ameno y divertido! Me encanta ese espíritu aventurero ! Muy buena lectura para empaparse del día a día de los viajes con amigos o en solitario!!! Me ha dado muchas ideas para mis futuros viajes! Lo recomiendo! ». Este libro relata de una manera alegre y cultural dos aventuras sin \"Rondando por Andalucía\", un viaje en bicicleta con dos amigos, Josema y Carlos, con los que llega a experimentar todo tipo de emociones por el Sur de España, y con un propó disfrutar del camino. Y \"Marrakech, el Atlas y el Océano\", relata un viaje a pie por Marruecos, que recorre, palpa y siente a su manera, y junto a su amigo Adriá se sumergerán en todo tipo de aventuras, en un país tan cercano y lejano al mismo tiempo. Lo único que querían era ascender el Jebel Toubkal, la montaña más alta del Norte de África, lo que no sabían es lo que les depararía el camino... Además añade dos apartados donde expone lo que ha aprendido sobre viajar en bicicleta y a pie. Entre el abanico de tópicos que desarrolla el autor, nos presenta herramientas para preparar un viaje, nos habla de alojamientos lowcost para alargar la duración de la aventura y qué presupuesto es necesario para emprender un proyecto de tal magnitud. También da pie a temas como la supervivencia, la orientación y la mejora del rendimiento, temas esenciales para el viajero mundano. «Relatos de un mundo por conocer es una combinación de humor, aventura, naturaleza en estado puro, situaciones inesperadas y personajes únicos. Lo mejor de todo es que no sabes lo que va a pasar».",
  "genres": [],
  "author": "Sergio Cisneros Galea",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43120227-relatos-de-un-mundo-por-conocer"
}