{
  "title": "Seeking Sara Summers",
  "description": "The Best Selling Coming Out Later in Life Lesbian Novel! You'll enjoy this story of courage and transformation. How would your life be different if you were truly yourself? Sara Summers Stanton has raised three children and works as a high school teacher at the same school she attended growing up. Her 25 year marriage is showing cracks in the facade and now she's dealing with breast cancer. In a rare moment of taking care of herself instead of everyone else, Sara takes a sabbatical and goes on the trip to Italy she has always dreamed of taking. This search for a more authentic life leads to Julia, a friend she hasn't seen since they were inseparable as girls, nearly 30 years earlier. They reunite in Florence and their friendship continues where they left off, resulting in an unexpected attraction to one another that threatens to turn Sara's already shaky world upside down. Sara's inner conflict and subsequent choices reveal an unpredictable yet dynamic future for all the characters. Seeking Sara Summers is an emotional and lyrical novel, a timeless story about love, commitment and transformation. What Readers Are Saying About Seeking Sara Summers: \"Gabriel renders Sara's growing attraction and conflict with insight. There is a real sense of what is at stake for all three of these characters: Sara, Julia and Grady. A beautiful and powerful story.\" -- Heather O'Neill, Book Reviewer, afterellen.com \"I started reading Seeking Sara Summers with my breakfast tea and couldn't put it down until I had finished it--even missed my trip to the gym. I laughed and cried and felt warmed by the Tuscan sun.\" -- Ann B., Asheville, NC \"I've read plenty of fiction in my life, everything from junky beach books to classic literature. I loved this book. Gabriel is a clever, funny, profound writer who quickly takes you into the inner world of her characters, while taking you on an external journey that keep you glued to the page. Sara's character jumps from the pages and her transformation has impacted and inspired me.\" -- Jackie W., Loveland, Colorado",
  "genres": [
    "Lesbian",
    "Fiction",
    "Romance",
    "Audiobook",
    "Lesbian Fiction",
    "LGBT",
    "Contemporary"
  ],
  "author": "Susan   Gabriel",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/4313535-seeking-sara-summers"
}