{
  "title": "Next to Nature Art",
  "description": "Next to Nature, Art\n is the fourth novel by Booker Prize winning author Penelope Lively.Run by Toby and Paula, the centre offers ordinary people a chance to learn from professional artists skilled in poetry, sculpture, ceramics, and the like. Artists like Greg, the New England poet, whose works are strangely absent; or Bob the lascivious potter who sells his Toby jugs to department stores. As the latest group of students arrives, tensions begin to run high and artistic temperaments are much on display. In fact much more is learnt about expressing oneself than was ever suggested on the prospectus.'Delightful . . . complex and exquisite. Penelope Lively's prose is beautiful and spare and she is a master of understatement' Daily Telegraph'Her economy and wit are apparent on every page . . . it all leads to a splendid climax . . . wonderful, sensible, funny Penelope Lively' Evening StandardPenelope Lively is the author of many prize-winning novels and short-story collections for both adults and children. She has twice been shortlisted for the Booker Prize: once in 1977 for her first novel, The Road to Lichfield, and again in 1984 for According to Mark. She later won the 1987 Booker Prize for her highly acclaimed novel Moon Tiger. Her other books include Going Back; Judgement Day; Next to Nature, Art; Perfect Happiness; Passing On; City of the Mind; Cleopatra's Sister; Heat Wave; Beyond the Blue Mountains, a collection of short stories; Oleander, Jacaranda, a memoir of her childhood days in Egypt; Spiderweb; her autobiographical work, A House Unlocked; The Photograph; Making It Up; Consequences; Family Album, which was shortlisted for the 2009 Costa Novel Award, and How It All Began. She is a popular writer for children and has won both the Carnegie Medal and the Whitbread Award. She was appointed CBE in the 2001 New Year's Honours List, and DBE in 2012. Penelope Lively lives in London.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "British Literature",
    "Novels",
    "20th Century"
  ],
  "author": "Penelope Lively",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/431514.Next_to_Nature_Art"
}