{
  "title": "Into the Planet: My Life as a Cave Diver",
  "description": "From one of the world’s most renowned cave divers, a firsthand account of exploring the earth’s final frontier: the hidden depths of our oceans and the sunken caves inside our planetMore people have died exploring underwater caves than climbing Mount Everest, and we know more about deep space than we do about the depths of our oceans. From one of the top cave divers working today—and one of the very few women in her field—Into the Planet blends science, adventure, and memoir to bring readers face-to-face with the terror and beauty of earth’s remaining unknowns and the extremes of human capability.Jill Heinerth—the first person in history to dive deep into an Antarctic iceberg and leader of a team that discovered the ancient watery remains of Mayan civilizations—has descended farther into the inner depths of our planet than any other woman. She takes us into the harrowing split-second decisions that determine whether a diver makes it back to safety, the prejudices that prevent women from pursuing careers underwater, and her endeavor to recover a fallen friend’s body from the confines of a cave. But there’s beauty beyond the danger of diving, and while Heinerth swims beneath our feet in the lifeblood of our planet, she works with biologists discovering new species, physicists tracking climate change, and hydrogeologists examining our finite freshwater reserves. Written with hair-raising intensity, Into the Planet is the first book to deliver an intimate account of cave diving, transporting readers deep into inner space, where fear must be reconciled and a mission’s success balances between knowing one’s limits and pushing the envelope of human endurance.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Science",
    "Adventure",
    "Nature",
    "Biography",
    "Audiobook"
  ],
  "author": "Jill Heinerth",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/43131602-into-the-planet"
}