{
  "title": "The Decade of Blind Dates",
  "description": "Peter Bauman, a forty-five-year-old divorced gay painter, plunges into the personal ads just prior to the Internet in his quest for the perfect partner. He dates a colorful cast of characters from a Connecticut physician, a rabid Republican, to a Texas-two-stepping, tattooed punk. Next there's the heavier-than-advertised geek who arrives with a bag of sex toys, but Peter is more serious with a handsome, stern Maine woodsman, followed by a British aristocrat patron who declines further intimacy because of his AIDS.As Peter negotiates his new gay identity, his best friend, Barry, counsels and supports him at every step, especially as Peter deals with a health crisis. During a decade of sex and shenanigans, Peter, encouraged by his ex-wife, daughter, and son, examines his life and, at last, discovers his soul mate.Acclaim for \"The Decade of Blind Dates\"\"SPECTACULARLY WITTY...The Decade of Blind Dates is a brave novel, a remarkable work of social and personal history. It is gay life as so many Americans lived it in the last decades of the last century, an alternately glorious and confounding picaresque of the mind and heart. It is also spectacularly witty-I started writing down lines that made me laugh out loud and soon ran out of paper.\" \"--Richard Stevenson, author of the Donald Strachey series\"\"HILARIOUS...Pre-Internet personals, perseverance, and a strong swimmer's sturdy build all pay off for the narrator of this engaging episodic novel about a rural gay artist's decade-long-search, after coming out at midlife, for heart-connecting love-not just sweaty sex. Alther's word portraits of men met along the way-among them a Nordic-god New Age bodybuilder with a dullblack toupee, a burly Bear with a bagful of erotic toys and a miniscule member, and a reclusive basket-weaver with magisterial forearms-are as humane as they are hilarious in a warm-hearted story.\" \"--Richard Labonte, Books To Watch Out For\"\"The Decade of Blind Dates is refreshing in its realism about what gay men experience-friends who die of AIDS, gay men who marry in an attempt to convince themselves they are straight, only to end up divorced. It's not just about hot sex but rather a very serious novel about dating. Anyone who has suffered through years of dating to find a soul mate will feel empathy and humor over Peter's situation.\" \"--Reader Views\"\"Whether you are gay or straight, Richard Alther exposes the hilarity and challenge of starting over romantically in midlife.\" \"--The Bottom Line, Palm Springs\"",
  "genres": [
    "M M Romance",
    "Gay",
    "Fiction",
    "LGBT",
    "Contemporary"
  ],
  "author": "Richard Alther",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/4313931-the-decade-of-blind-dates"
}