{
  "title": "Intoxicated by My Illness and Other Writings on Life and Death",
  "description": "Anatole Broyard, long-time book critic, book review editor, and essayist for the  New York Times , wants to be remembered. He will be, with this collection of irreverent, humorous essays he wrote concerning the ordeals of life and death—many of which were written during the battle with cancer that led to his death in 1990. A  New York Times  Notable Book of the Year “A heartbreakingly eloquent and unsentimental meditation on mortality . . . Some writing is so rich and well-spoken that commentary is superfluous, even presumptuous. . . . Read this book, and celebrate a cultured spirit made fine, it seems, by the coldest of touches.” — Los Angeles Times“Succeeds brilliantly . . . Anatole Broyard has joined his father but not before leaving behind a legacy rich in wisdom about the written word and the human condition. He has died. But he lives as a writer and we are the wealthier for it.” — The Washington Post Book World“A virtuoso performance . . . The central essays of Intoxicated By My Illness  were written during the last fourteen months of Broyard’s life. They are held in a gracious setting of his previous writings on death in life and literature, including a fictionalized account of his own father’s dying of cancer. The title refers to his reaction to the knowledge that he had a life-threatening illness. His literary sensibility was ignited, his mind flooded with image and metaphor, and he decided to employ these intuitive gifts to light his way into the darkness of his disease and its treatment. . . . Many other people have chronicled their last months . . . Few are as vivid as Broyard, who brilliantly surveys a variety of books on illness and death along the way as he draws us into his writer’s imagination, set free now by what he describes as the deadline of life. . . . [A] remarkable book, a lively man of dense intelligence and flashing wit who lets go and yet at the same time comtains himself in the style through which he remains alive.” — The New York Times Book Review“Despite much pain, Anatole Broyard continued to write until the final days of his life. He used his writing to rage, in the words of Dylan Thomas, against the dying of the light. . . . Shocking, no-holds-barred and utterly exquisite.” — The Baltimore Sun",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Essays",
    "Medicine",
    "Illness",
    "Disability",
    "Philosophy"
  ],
  "author": "Anatole Broyard",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/431604.Intoxicated_by_My_Illness_and_Other_Writings_on_Life_and_Death"
}