{
  "title": "Prayer is not Enough: The Golden Key to Personal Happiness",
  "description": "Are you unhappy with your life and your situation?Is everything going wrong for you? Do you feel it’s been that way for many years? Maybe you’ve lost your job or a lot of money, or maybe your partner left you. Now you feel alone and betrayed by the world. You feel desperate and you have no idea how to improve your life. All this has also happened to me, and in this book I’ll tell you everything in more detail. You know you have to change something, but what are you to do? How can you attract into your life the partner with whom you will really be happy? How can you salvage a relationship that’s being suffocated by stress and everyday life? Should you exercise more, so you can finally feel good in your body? Maybe you want to travel to the most beautiful places in the world, buy a new car or build a great house. What do you have to do to get money, so you can buy everything you dream about?The universe is so wealthy and generous, it will willingly give you all of that and more. But how on earth is that supposed to work? You don’t just have no money. You may also have the feeling you’ll never have enough to be able to live the life you have been dreaming of and really want to live. You may have already read lots of books that promised you the truth about the last, big secret you needed to know, but afterwards you knew only as much as you did before. This book I have written for you is new and completely different. I will describe to you in great detail my real insights, which will help you learn how you can fulfil all your wishes.This is absolutely amazing! If you really want to become successful, if you want to meet the love of your life, and if you want to achieve all this quickly, you should read this book and, above all, do everything I’ve done. It doesn’t matter what your wishes are and what you want from life: You’ll definitely get it. Because the best thing is: It definitely works, always and for every single person on this planet! The universe will take care of you right away and set everything in motion so that your wishes will be fulfilled, absolutely free. It seems incredible, but it’s true. If you implement my real insights, one day you’ll stand in front of the house you always wanted to live in. You will be able to immediately buy it for a real bargain price—or even get it for free. And that great car you’ve dreamed about will also be in front of your door, waiting for you to finally get in and hit the road. I guarantee you that, as true as I’m standing here, I have experienced all of this firsthand. In this book I will tell you my own personal story, which is both new and at the same time as old as humanity. You will witness how I cried, doubted, meditated, radically changed my diet and prayed.Yes, I prayed a lot, but did that get me even a little closer to my wishes and goals? You will get the answer to that question. And in the end you can have a share in my good fortune, which I attracted into my life and turned into reality. Stop dreaming in vain and finally become the captain of your life. Accompany me now on this exciting journey and find the golden key to personal happiness!",
  "genres": [],
  "author": "Nelson Gomez Coelho",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43169229-prayer-is-not-enough"
}