{
  "title": "Obama's Challenge: America's Economic Crisis and the Power of a Transformative Presidency",
  "description": "Barack Obama approaches the Presidency at a critical moment in American history, facing simultaneous crises of war, the environment, health care, but most especially in the economy. If he is able to rise to the moment, he could join the ranks of a small handful of previous presidents who have been truly transformative, succeeding in fundamentally changing our economy, society, and democracy for the better. But this will require imaginative and decisive action as Obama takes office, action bolder than he has promised during his campaign, and will be all the more difficult given the undertow of conventional wisdom in Washington and on Wall Street that resists fundamental change. Decades of regressive politics and political gridlock have left America in its most precarious situation since the onset of the Great Depression. The collapse of the housing bubble continues, as does the financial meltdown it triggered; a revival of 1970s style stagflation threatens; incomes continue to lag behind inflation; our household and international debts pile higher; disastrous climate change looms; energy and food prices continue their escalation; and the ranks of un- and under-insured Americans grow as the health insurance system unravels. Facing their own great challenges, Abraham Lincoln, Franklin Roosevelt, and Lyndon Johnson rallied the American people to overcome deadlocked politics in order to achieve progressive transformations—abolishing slavery, transcending economic depression, and redeeming the promise of civil rights. In his own way, Ronald Reagan oversaw a grand shift in public attitudes and government direction. Each president used exceptional leadership to change the national mood, and then the national policy. By appealing to what was most noble in the American spirit, these presidents energized movements for change, and in turn put pressure on themselves and on the Congress to move far beyond what was deemed conceivable. They generated accelerating momentum for far-reaching reforms that proved politically irresistible. Solutions to our multiple challenges do exist, but they won’t be found in overly cautious or expedient quick fixes. With his exceptional skill at appealing to our better angels, Barack Obama could be the right leader at the right time to re-awaken America to the renewed promise of shared prosperity coupled with responsibility towards future generations and the international community with whom we share the Earth. Invoking America’s greatest leaders, Robert Kuttner explains how Obama must be a transformative president—or a failed one.",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "Robert Kuttner",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/4315825-obama-s-challenge"
}