{
  "title": "The Unwritten Laws of Business",
  "description": "The bestselling business classic that Raytheon CEOWilliam Swanson made famous .Every once in awhile, there is a book with a message so timeless, so universal, that it transcends generations. The Unwritten Laws of Business is such a book. Originally published over 60 years ago as The Unwritten Laws of Engineering , it has sold over 100,000 copies, despite the fact that it has never been available before to general readers. Fully revised for business readers today, here are but a few of the gems you’ll find in this little-known business If you take care of your present job well, the future will take care of itself.The individual who says nothing is usually credited with having nothing to say.Whenever you are performing someone else’s function, you are probably neglecting your own.Martyrdom only rarely makes heroes, and in the business world, such heroes and martyrs often find themselves unemployed.Refreshingly free of the latest business fads and jargon, this is a book that is wise and insightful, capturing and distilling the timeless truths and principles that underlie management and business the world over.The little book with the big history.In the summer of 2005, Business 2.0 published a cover story on Raytheon CEO William Swanson’s self-published pamphlet, Swanson’s Unwritten Rules of Management . Lauded by such chief executives as Jack Welch and Warren Buffett, the booklet becamea quiet phenomenon.As it turned out, much of Swanson’s book drew from a classic of business literature that has been in print for more than sixty years. Now, in a new edition revised and updated for business readers today, we are reissuing the 1944 classic that inspired a number of Swanson’s “rules”: The Unwritten Laws of Business. Filled with sage advice and written in a spare, engaging style, The Unwritten Laws of Business offers insights on working with others, reporting to a boss, organizing a project, running a meeting, advancing your career, and more. Here’s just a sprinkling of the old-fashioned, yet surprisingly relevant, wisdom you’ll find in these If you have no intention of listening to, considering, and perhaps using, someone’s opinion, don’t ask for it.Count any meeting a failure that does not end up with a definite understanding as to what’s going to be done, who’s going to do it, and when.The common belief that everyone can do anything if they just try hard enough is a formula for inefficiency at best and for complete failure at worst.It is natural enough to “look out for Number One first,” but when you do, your associates will be noticeably disinclined to look out for you.Whether you’re a corporate neophyte or seasoned manager, this charming book reveals everything you need to know about the “unwritten” laws of business.",
  "genres": [
    "Business",
    "Nonfiction",
    "Management",
    "Engineering",
    "Leadership",
    "Self Help",
    "Buisness"
  ],
  "author": "W.J.  King",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/431625.The_Unwritten_Laws_of_Business"
}