{
  "title": "End of the Century",
  "description": "At the eve of the new millennium, teenager Alice Fell is alone on the streets of a strange city, friendless and without a pound to her name. She is not sure whether she's losing her mind, or whether she is called by inescapable visions to some special destiny. Along with a strange man named Stillman Waters, a retired occultist and spy – or so he claims – she finds herself pursued by strange creatures, and driven to steal the priceless \"vanishing gem\" that may contain the answers to the mysteries that plague her. A century earlier, consulting detective Sandford Blank, accompanied by his companion Roxanne Bonaventure, is called upon to solve a string of brutal murders on the eve of Queen Victoria's Diamond Jubilee. The police believe that Jack the Ripper is back on the streets, but Blank believes that this is a new killer, one whose motive is not violence or mayhem, but the discovery of the Holy Grail itself. And what of the corpse-white Huntsman and his unearthly hounds, who stalks the gaslit streets of London? And in the sixth century, Galaad, a young man driven by strange dreams of a lady in white and a tower of glass, travels to the court of the high king Artor in Londinium, abandoned stronghold of the Roman Empire in Britain. With Galaad’s bizarre dreams as their only guide, Artor and his loyal captains journey west to the Summerlands, there to face a threat that could spell the end of the new-forged kingdom of Britain. These three adventures—Dark Ages fantasy, gaslit mystery, and modern-day jewel heist—alternate until the barriers between the different times begin to break down, and our heroes confront the secrets that connect the Grail, the Glass Tower, and the vanishing gem. And lurking behind it all, the entity known only as Omega.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "High Fantasy",
    "Arthurian",
    "Time Travel",
    "Mythology"
  ],
  "author": "Chris Roberson",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/4316668-end-of-the-century"
}