{
  "title": "Vixen Claws",
  "description": "His candy cane won't lick itself... Romance novel model Cain Pellichero has been on the cover of countless books with happily-ever-after endings. But, the werebear hasn't even started writing his own love story. Cain Pellichero's rock-hard abs might look Nice, but they just landed him on The Naughty List. If he wants to get his shift back, he's going to have to claim his fated mate. If he wants to get his mate mark back, he's going to have to get off of The Naughty List. Oh -- and he has to pull Santa Claus' sleigh on Christmas Eve. How hard could it be? Well, Cain's about to find out that when Fate and Christmas magic combine, anything can happen. Luckily, he's got an ally -- the one and only Vixen, one of Santa's flying reindeer. Don't judge a romance novel model by his covers... Curvy Candy Cassis knows a few things. Number one. Cain Pellichero is a romance novel model. So, why is he working as a lumberjack on The Wreath, a rural area of Montana, far away from white sand tropical beaches? Number two. His mate mark says 'Naughty,' which makes him a bad boy. Number three. He's just her type. The only problem is, Candy may act sassy, but she's really shy. Will she find a way to open up to Cain before Christmas? The Wreath during Christmas is wilder than Florida during spring break! When Cain meets Candy, she goes straight to the top of his Christmas list. The only thing the werebear wants is to unwrap her underneath his big, thick, uncut...Christmas tree. All he has to do is claim his beauty to earn back his beast. The only problem is, he has no idea how to fill her in on his secret. When Avery uncovers some secrets about Candy, will Candy and Cain get closer than they ever imagine? And will Candy and Cane go together like red and white stripes on a candy cane? There's only one way to find out -- by reading 'Vixen Claws.' This story, featuring a bad boy werebear and a BBW baker, is loosely based on Beauty and the Beast.",
  "genres": [
    "Romance",
    "Shapeshifters",
    "Holiday",
    "Paranormal"
  ],
  "author": "Sable Sylvan",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/43169522-vixen-claws"
}