{
  "title": "Big Things Have Small Beginnings: Learn to Play the Great Game",
  "description": "Small things matter if you want to achieve BIG things. In many businesses that fail, the small things are overlooked; they are the things that are often the easiest to implement, but at the same time they are easy to forget. It’s these small things that have the greatest impact in the long-term.Neglecting small things can be the difference between failure and success.This book is NOT about failing; this book is about preventing, limiting and continually overcoming the small failures and obstacles so that you can achieve great success because when you take care of the small details, the big stuff takes care of itself.Do you find yourself missing the one thing in life that would help you achieve a desired goal, realize a long-held dream, or push you up the ladder to success?Big Things Have Small Beginnings will give you the blueprint you need to achieve those goals and dreams sooner rather than later.Some of what you’ll learn in this book The common characteristic our great leaders had that you must possess; How giving away flowers helped build a $60 million dollar company and go from surviving to thriving; The difference between goals and objectives and which one is more important to your overall success; How to be intelligently flexible so you can make massive progress; Why learning a new language can improve your business aptitude; How to grow a business when you don’t have the capital to do so; The importance of keeping a high integrity business model; And so much more!Wesley Berry started working at his family’s Detroit-based florist shop when he was just a teenager. He quickly demonstrated a strategic style of management that propelled it from a $65K per year business to a $65 million-dollar international business operating in 130 different countries. In 2016, after 40 years in business, he sold it to “retire” and follow other passions.Through the years, he's provided consulting services to over forty businesses and has appeared as a guest on NPR, The Wall Street Journal, The London Times, Entrepreneur and Time magazines, Fox News, Neil Cavuto, Geraldo Rivera, and John Stossel, to name a just few.Ralph Waldo Emerson once said, “The law of nature is, Do the thing, and you shall have the but they who do not the thing have not the power.”If you want the power and the keys to success, click the BUY NOW button and be the one who wins and has the power.",
  "genres": [
    "Business",
    "Productivity",
    "Self Help",
    "Entrepreneurship",
    "Amazon",
    "Nonfiction"
  ],
  "author": "Wes Berry",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/43161169-big-things-have-small-beginnings"
}