{
  "title": "Fantasy Books Box Set: An Epic Young Adult Collection",
  "description": "Get lost in the world of four different epic tales full of rebels, witches, and queens by Laurie Forest, Sasha Alsberg, Lindsay Cummings, Amanda Foody, and Kaitlyn Sage Patterson!THE BLACK WITCHCarnissa Gardner, the last prophesied Black Witch, drove back the enemy forces and saved her people during the Realm War. Now a new evil is on the horizon, and her granddaughter, Elloren, is believed to be Carnissa’s heir—but while she is the absolute image of her famous grandmother, Elloren is utterly devoid of power in a society that prizes magical ability above nearly all else.When she is granted the opportunity to pursue her lifelong dream of becoming an apothecary, Elloren is eager to join her brothers at the prestigious Verpax University and finally embrace a destiny of her own, free from the shadow of her grandmother’s legacy. But she soon realizes that the university is an even more treacherous place for the granddaughter of the Black Witch.ZENITHKnown across the galaxy as the Bloody Baroness, Captain Androma Racella and her motley crew of space-bound privateers roam the Mirabel galaxy on the glass starship Marauder, taking what mercenary work they can find to stay alive.When a routine job goes awry, the Marauder’s crew find themselves placed at the mercy of a dangerous bounty hunter from Andi’s past. Coerced into a life-threatening mission, and straight into the path of a shadowy ruler bent on revenge, Andi and her crew will either restore order to the ship—or start a war that will devour worlds.ACE OF SHADESEnne Salta was raised as a proper young lady, and no lady would willingly visit the City of Sin. But when her mother goes missing, Enne must leave her finishing school behind to follow her mother’s trail to the city where no one survives uncorrupted. Frightened and alone, Enne has only one the name Levi Glaisyer. Their search for clues leads them through glamorous casinos, illicit cabarets and into the clutches of a ruthless Mafia donna. As Enne unearths an impossible secret about her past, Levi’s enemies catch up to them, ensnaring him in a vicious execution game where the players always lose. To save him, Enne will need to surrender herself to the city.THE DIMINISHEDIn the Alskad Empire, nearly all are born with a twin, two halves to form one whole. A rare few are singleborn in each generation, and therefore given the right to rule by the gods and goddesses. Bo Trousillion is one of these few, born into the royal line and destined to rule. But when one twin dies, the other usually follows, unable to face the world without their other half. Those who survive are considered diminished, doomed to succumb to the violent grief that inevitably destroys everyone whose twin has died. Such is the fate of Vi Abernathy, whose twin sister died in infancy. Bo and Vi face very different futures—one a life of luxury as the heir to the throne, the other years of backbreaking work as a temple servant. But a long-held secret and the fate of the empire are destined to bring them together in a way they never could have imagined.Titles originally published in 2017, and 2018.",
  "genres": [],
  "author": "Laurie Forest",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/43162896-fantasy-books-box-set"
}