{
  "title": "Comet Claws",
  "description": "He's taking her on a sleigh ride...Pilot Connor Brian has never found the time to find a fated mate.Well, this werebear's getting grounded for Christmas, because he got his furry butt on The Naughty List.If he doesn't get off The Naughty List and claim his fated mate by Christmas, he'll lose his shift forever.That means he's going to have to work with Comet -- Santa'Claus' flying reindeer -- if he has any hope of keeping his bear.Getting off of The Naughty List should be easy...but it's hard when a curvy bad girl baker keeps distracting Connor from his mission of finding a Nice girl to take back to Nuthusk, Washington for Christmas.Who said Snow White couldn't be a bad girl?Curvy baker Noel Newman knows a few things.She knows how to bake -- good. Real good.She knows her type -- bad. Real bad.Heck, you could even describe her type as Naughty -- and from the mark on Connor's chest, that's just what he is.A bad girl for the bad boy, as classic a combination as eggnog and rum.The only problem is, Connor can't seem to decide whether or not Noel's the woman he wants to unwrap underneath the Christmas tree come Christmas Eve. Will Noel let Connor distract her from her special Christmas charity project for kids, or, will the Naughty shifter end up helping her do something Nice after all?One shifter. Seven women.One BBW. Seven shifters.You do the math.There's one thing Noel knows. She doesn't want to be in a harem.There's one thing Connor knows. He doesn't want to be in a reverse harem.When seven shifter men roll into town, looking for Noel, and seven shifter women come to Nuthusk, looking for Connor, the pair realize that they don't know each other as well as they seem.They don't yet know the full story...but will they both find their happily ever after?This story, featuring a bad boy werebear and a BBW baker, is loosely based on Snow White and the Seven Dwarves.",
  "genres": [
    "Romance",
    "Christmas",
    "Shapeshifters",
    "Holiday",
    "Paranormal"
  ],
  "author": "Sable Sylvan",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/43176785-comet-claws"
}