{
  "title": "Beautifully Broken",
  "description": "Not all love stories are set in stone.Ours had heartache, destruction, and a broken ending.Ethan:Everything about Luna Hawkins made me want to be different. For years, I tried I really did. When I finally broke free of my demons, she planted me firmly in the friend-zone.I'll fight to win her back no matter the cost. With the chemistry we have, I'm not holding back. I'll even play dirty if I have to. My past proves to be more difficult to keep away than I thought. I need to fight the addiction, need to stay focused, because Luna is what matters most.My purpose on this Earth is loving Luna unconditionally and wholeheartedly.My past wasn't full of sunshine and rainbows. It was a living hell. Runaway mother, abusive father, dead brother—yeah my life’s a damn dream. It made me dark and angry. Made me into someone I hated, but Luna made everything better. She made me want to be better. But sometimes, no matter how hard we try, we can't change who we are. My past isn't everything I thought it was. I uncover something which changes everything. Can I make Luna fall in love with me all over again, or is it too late? I may be broken, but together we are beautifully broken.Luna:Ethan Knight, the boy I fell in love with at twelve, is back. His addiction was what tore us apart. He promised he'd change, but he never did. Until now.He somehow got hotter, and even his charms are more dangerous. Putting him in the friend-zone was the right thing to do. I know it won’t last, but a girl needs to try, right?Ethan's life is a mess. Can he really be a different person, be the guy I fell head over heels in love with? Us together was never a good idea, but the spark between us hasn't burned out yet. In fact, it feels stronger, and my heart can only take so much! Daddy always warned me to stay away from Ethan, and it may have been for good reason. Ethan's past is more corrupt than even he thought. Can we really overcome everything? Or will we come crashing down into the beautifully broken mess that awaits us?",
  "genres": [
    "Friends To Lovers",
    "Romance",
    "Second Chance",
    "Contemporary Romance"
  ],
  "author": "Tara  Lee",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/43194728-beautifully-broken"
}