{
  "title": "The Art of Her Life",
  "description": "At nine years old, on her first visit to a museum, Emily fell in love with Breakfast , a painting by Henri Matisse. Now a single mother, she lives in the world of art and can barely find time for her two daughters, much less for Mark, the man she loves. Her days are a jumble—she’s lost the thread of her life—but a contest at the museum where she’s the registrar gives her hope—the chance to see Breakfast again. Matisse’s words and paintings permeate her days and nights, and glancing at a note card of the painting she loves, she sees something she’s never seen before. The Art of Her Life shows the power of art to transform an ordinary life.\"Cynthia Newberry Martin’s new novel is a bold transcendent meditation on desire, memory, motherhood, and the power of art to remake a life. I loved this book. I could not put it down. There’s a spare lyric grace to Martin’s writing, and in this story, she captures the nuances of ordinary life – what we love and fear to risk, what we lose and ache to hold. The Art of Her Life is a rare, exquisite work of fiction.\"—Dawn Tripp, author of Georgia, a novel of Georgia O’Keeffe\"Cynthia Newberry Martin is a deeply gifted writer. The Art of Her Life should be placed on the same shelf as A.S. Byatt's The Matisse Stories . When tragic things happen to the character of Emily, she becomes devoted to a kind of Gospel of Henri Matisse, and she gets lost in the artist's life in order to find her own life again. This is a family story; this is a love story. But the novel combines these in profound and original ways. The splendid prose is tinted with the inimitable melancholy of Matisse's blue.\"—Howard Norman, author of The Ghost Clause\"In The Art of Her Life, Cynthia Newberry Martin tenderly and delicately shows how the unexpected turns of a life can most often only be steadied and moored by what we hold deepest inside. It is told with no punches pulled. No self-interrogation spared. Just a keen and blunt honesty. A lovely and moving novel that celebrates the legacy of the creative spirit, the power and salvation of art, and the challenges in balancing an intellectual life with an emotional life.\"—Adam Braver, author of Rejoice the Head of Paul McCartney\"With grace and clarity, Cynthia Newberry Martin paints in this novel a lasting portrait of love and family, of love and perseverance, of love and beauty and care and heart. Even in the face of loss, every brushstroke of life becomes somehow sacred, a blessing, an abundance. \"—William Lychack, author of Cargill Falls\"The Art of Her Life is a rare book about an adult woman with the full complement of responsibilities—children, job, love, passions—grappling with how to manage and juggle them. Matisse's art, and the painting Breakfast in particular, is a character in this gorgeous book—his use of color and channeling of emotion form lifelines for our protagonist. Matisse accompanies Emily on her journey as she learns that, paradoxically, it is only through surrender that we can feel life's wholeness. I loved this book.\"—Lindsey Mead, editor of On Being Forty(ish)",
  "genres": [
    "Fiction"
  ],
  "author": "Cynthia Newberry Martin",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/123757728-the-art-of-her-life"
}