{
  "title": "L'écrivaine morte",
  "description": "Anna est une écrivaine d’un âge moyen qui a élevé sa fille toute seule. Dans le présent du roman, Berta a grandi et ses doutes aussi : à l’anxiété de connaître son père qu’elle a seulement vu sur une photo vient s’ajouter sa relation fragile avec son fiancé Hans marquée par une crise. Hans, quant à lui, travaille dans une usine. Clara, sa sœur, est une éternelle jeune fille incomprise obsédée par un type qui conduit une moto jaune.Cependant, c’est d’abord l’histoire d’Anna Flieder. Lorsque celle-ci choisit d’entamer l’écriture d’un livre au ton plus biographique, elle est aussitôt touchée par l’inspiration qui prend la forme du même homme qu’elle avait abandonné il y a des années de cela.---Qu’est-ce qui change dans le point de vue du lecteur quand l’écriture est elle-même enjeu romanesque ? L’écriture, devenue sa propre métaphore créative, peut-elle devenir une histoire ? Dans ce roman, les réponses à ces questions se lisent entre deux relations que l’écrivaine, Núria Añó, tisse d’une main de maîtresse qui va très loin dans l’exploration de l’individu contemporain. Cette exploration doit beaucoup à cet attachement au scénique du monde et des êtres : des espaces parcourus, des regards échangés et d’autres inaperçus, des animaux presque humains et des humains brutaux ou désespérés qui restent avec/dans leur corps souffrant ou sont en décalage par rapport à autrui. Un roman qui efface sciemment toutes les nuances nationales et géographiques pour se loger dans cet autre possible méconnu, la province des humains comme dirait Elias Canetti, à la fois province et monde à soi.Ainsi, les personnages du récit : Anna, Hans, Berta et Emil qui ne sont que la trame de relations psychanalytiques complexes entre le désir, l’amour et l’autoréalisation mettent en jeu des rapports de symétrie entre familles, générations et solitudes réelles. En outre, les polarités entre les deux familles de Berta et de Hans ne sont pas tellement tranchées, elles ne signifient pas seulement la polarité entre la bourgeoisie de l’écriture et de la musique (Anna et sa fille) et la classe ouvrière de la cuisine et de la chasse (Hans, son père, sa mère). Le roman donne ainsi lieu à des similarités de solitudes, d’incompréhension et d’incommunication : les tentatives de suicide de l’adolescente Clara/les traumatismes d’Anna ou encore la virilité fuyante de Hans / le machisme manipulateur d’Emil.De l’autre côté, les personnages du roman qui s’écrit en abyme, celui d’Anna (ou de N), femme forte et fragile à la fois qui refuse l’absurdité de sa maternité et d’un amour qui la traumatise depuis des années : M (ou Emil), à la fois narrateur, personnage et chimère du passé qui stimule son écriture tout en l’empêchant de dire oui à la vie au-delà de la fiction, par exemple, cette attirance folle par le fiancé de sa fille, Berta. Dans cet autre roman, celui de l’écrivaine morte qui donne légitimement le titre du livre, on assiste au travail patient et minutieux mais aussi effroyable du monde intérieur de l’écrivain(e).",
  "genres": [
    "Fiction",
    "Spanish Literature",
    "Spain",
    "Novels",
    "Cultural"
  ],
  "author": "Núria Añó",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/43195635-l-crivaine-morte"
}