{
  "title": "A Very Braden Christmas",
  "description": "Discover the magic of New York Times bestseller Melissa Foster's writing and see why millions of readers have fallen in love with the Bradens.  A Braden Christmas celebration!  Family and babies abound during this fun-filled evening of love, laughter, and happily ever afters! Spend the evening catching up with our loving and loyal Bradens in this holiday celebration and fall in love all over again with each of the Bradens at Weston, and their children.  A VERY BRADEN CHRISTMAS is part of the Love in Bloom big-family romance collection. All Love in Bloom stories are filled with family, fun, and the truest, deepest love of all. Characters from each sub-series appear in future books so you never have to leave your favorite characters behind. Readers are kept up to date with engagements, weddings, and births. Visit Melissa's website for LOVE IN BLOOM family trees, series checklists, and more.  Love in Bloom Big-Family Romance Collection:  Snow Sisters The Bradens (at Weston) The Bradens (at Trusty) The Bradens (at Peaceful Harbor) The Bradens & Montgomerys (Pleasant Hill - Oak Falls) The Remingtons The Ryders Seaside Summers Bayside Summers Wild Billionaires After Dark Bad Billionaires After Dark Tru Blue and The Whiskeys Harborside Nights  ~  \"When it comes to contemporary romances with realistic characters, an emotional love story and smokin' hot sex, author Melissa Foster always delivers!\" The Romance Reviews  \"You can always rely on Melissa Foster to deliver a story that's fresh, emotional and entertaining. Make sure you have all night, because once you start you won't want to stop reading. \" New York Times Bestselling Author Brenda Novak  \"With her wonderful characters and resonating emotions, Melissa Foster is a must-read author!\" New York Times Bestseller J. Kenner  \"Melissa Foster is synonymous with sexy, swoony, heartfelt romance!\" New York TimesBestseller Lauren Blakely  \"I highly recommend this book to fans of Nora Roberts (one of my personal faves) and fans of a sweet story filled with heat and heart.\" - Tia Bach, author (on Sisters in Love)  \"Melissa Foster is quickly becoming one of my favorites. Fated For Love was amazing. It kind of reminds me of Jill Shalvis' books and they are my benchmark for contemporary romance awesomeness.\" --Books Like Breathing  \"I highly recommend the Snow Sisters all the Braden and Remington books....They remind me of the McCarthy of Gansett series and The Green Mountain series. I am a huge fan of Marie Force. And now Melissa Foster has joined her ranks....\" - I Love NY, Reviewer  ~ Melissa Foster is a New York Times & USA Today bestselling and award-winning author. She writes sexy and heartwarming contemporary romance, romantic comedy, new adult romance, and women's fiction with emotionally compelling characters that stay with you long after you turn the last page. Melissa's emotional journeys are always family oriented and focus on small town and big city love stories, billionaires and blue-collar workers. Melissa loves to chat with book clubs and readers, invite her to your next event.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Novella",
    "Contemporary",
    "Family",
    "Holiday",
    "Christmas"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/43192687-a-very-braden-christmas"
}