{
  "title": "The Songs of Power: A Northern Tale of Magic",
  "description": "Not so long ago, in the tiny, isolated villages of Finland, where prolonged summer days gave way to endless winter nights, people would pass the time by singing the many adventures of their favorite the mighty, magical men and women of ancient days.They sang of old Vainamoinen, greatest of sages and magicians, who helped create the world but never could find a woman to wed him. They sang of his friend and ally Ilmarinen, first among craftsmen, the blacksmith who forged the dome of the heavens.They sang of Louhi, the ancient lady of Northland, whose crafty wit and magical powers made her a worthy opponent for Vainamoinen himself. And they sang of Aila, Louhi's lovely daughter, who captured the hopes of the two old friends and drew them as rivals to the shores of Northland.And while these songs could still be heard, there came along a rural doctor, a scholar, who gathered and wove them together in a book he called the Kalevala. And so he created for Finns a national epic, and for the rest of the world, a work of wonder.The songs endure, the heroes live. . . .For ages 10 and up. Not illustrated!/////////////////////////////////////////////////Aaron Shepard is the award-winning author of \"The Baker's Dozen,\" \"The Sea King's Daughter,\" \"The Monkey King,\" and many more children's books. His stories have appeared often in Cricket magazine, while his Web site is known internationally as a prime resource for folktales, storytelling, and reader's theater. Once a professional storyteller, Aaron specializes in lively retellings of folktales and other traditional literature, which have won him honors from the American Library Association, the New York Public Library, the Bank Street College of Education, the National Council for the Social Studies, and the American Folklore Society.Cover artist Carol Schwartz is the award-winning illustrator of over 45 picture books./////////////////////////////////////////////////\"Well written and valuable. . . . Shepard's use of free verse allows him more flexibility than the traditional poetic meter. [The text] retains a sense of majestic rhythm and is most effective when read aloud. Supporting information is detailed.\" -- Donna L. Scanlon, School Library Journal, Apr. 1996 (reviewing an older edition)\"Shepard's free verse telling has power and sparkle.\" -- Glenn Giffin, Denver Post, May 12, 1996 (reviewing an older edition)\"The language of Shepard's story, the way [the characters'] magic is performed -- all is bigger than life, as the mythic tale should be. It is a book to read aloud -- to an older child, to an appreciative adult.\" -- Kate Frankel, Storyline, Winter 1997 (reviewing an older edition)\"The [free] verse reads aloud particularly well. -- Notes from the Windowsill, Dec. 15, 1996 (reviewing an older edition)\"The 'Ancient Fantasy' series will take both adults and children into a world of folklore of long ago. These books have taken my grandsons away from their video and DVD games. . . . As my grandsons say, 'This is another five star book.'\" -- Sandra Heptinstall, Whispering Winds Book Reviews, May 9, 2008/////////////////////////////////////////////////SAMPLEVainamoinen chantedand Joukahainen sank in the marshy ground,up to his waist in the swallowing earth.",
  "genres": [
    "Fantasy",
    "Mythology",
    "Fiction",
    "Fairy Tales",
    "Folklore",
    "Picture Books",
    "Cultural"
  ],
  "author": "Aaron Shepard",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/12376040-the-songs-of-power"
}