{
  "title": "Edward Wilson’s Antarctic Notebooks",
  "description": "Dr. Edward A. Wilson (1872-1912) is widely regarded as one of the finest artists ever to have worked in the Antarctic. Sailing with Captain Scott aboard 'Discovery' (1901-1904), he became the last in a long tradition of 'exploration artists' from an age when pencil and water-colour were the main methods of producing accurate scientific records of new lands and animal species. He combined scientific, topographical and landscape techniques to produce accurate and beautiful images of the last unknown continent. Such was the strength of his work that it also helped to found the tradition of modern wildlife painting. In particular Wilson captured the essence of the flight and motion of Southern Ocean sea-birds on paper. Returning with Captain Scott aboard 'Terra Nova' (1910-1913) as Chief of Scientific Staff, he continued to record the continent and its wildlife with extraordinary deftness. Chosen to accompany Captain Scott to the South Pole, his last drawings are from one of the most famous epic journeys in exploration history. Along with his scientific work, Wilson's pencil recorded the finding of Roald Amundsen's tent at the South Pole by Captain Scott. Wilson died, along with the other members of the British Pole Party, during the return journey, in March 1912. Many of the images in this book are rarely seen or are previously unpublished. The drawings and paintings were created at considerable personal cost in the freezing conditions in which Wilson worked. He often suffered severely from the cold whilst sketching and also from snow-blindness, or sunburn of the eye. They provide a remarkable testament to one of the great figures of the heroic age of Antarctic exploration. The book has been produced as a companion volume to 'Edward Wilson's Nature Notebooks' by two of Wilson's great nephews, to mark the centenary of his death.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Adventure"
  ],
  "author": "David M.  Wilson",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/12376051-edward-wilson-s-antarctic-notebooks"
}