{
  "title": "The Virgin Diaries: The Complete Collection",
  "description": "From Wall Street Journal and USA Today bestselling author Lauren Landish comes The Virgin Diaries, a series of take-charge alpha heroes and the sassy, innocent women who bring them to their knees.Satin and Pearls A naughty professor. A sexy student. Connor Daniels is the hottest Professor Daisy has ever seen, but his cocky arrogance and demand for perfection is a thorn in her side. So why can’t she stop thinking about him, about how she wants him to teach her a lot more than just Math? One night changes everything and he + she = a steamy problem. Connor can’t help wanting to learn Daisy’s every detail, but can their love be the solution they’re both looking for?Leather and Lace A demanding boss. A bold intern. Arianna's new boss is Liam Blackstone, the most powerful man in the city. He’s used to getting what he wants and he’s set his sights on Arianna. She makes a deal with devil to learn all about the business, but mixing their professional and personal lives could be more dangerous than either of them thought.Silk and Shadows A bossy jock. A sassy nerd. The nerdy Norma Jean has been tasked with tutoring insufferable football god Zach Knight. Worse yet, no one can know, so she has to pretend to be his girlfriend as a cover story. As if anyone would believe that. But as the line between real and pretend blurs, her snarls become purrs, and her bratty pouts become naughty invitations. When the clock runs out on their fake relationship, will they have found a forever kind of love in the library?Hold on to your kindle and settle in for three deliciously addictive tales. Includes the full Virgin Diaries series. Each book is a different couple with their own happy ever after, no cheating, and absolutely no cliffhangers.",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Lauren Landish",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/43205145-the-virgin-diaries"
}