{
  "title": "Blitzen Claws",
  "description": "He's got a full sack of toys...  Football player Eamonn Costello plays the whole field, but this werebear hasn't scored a touchdown for Fate and found his fated mate. That tossed his furry butt right onto Santa Claus The Naughty List -- and Fate threw a perfect spiral. Now, Eamonn has to claim his fated mate by Christmas, or he'll lose his shift forever. The only problem is, Eamnon has to get off The Naughty List and earn back his mate mark. At least he's got one heck of a coach: Blitzen, one of Santa Claus' eight flying reindeer. Eamonn knows you can't turn back time, but when The Wreath, Montana is transformed into a Regency Christmas wonderland, Eamonn might just learn the true meaning of Christmas...but will he learn the meaning of true love?  Is there any hope...for Hope?  Hope's a BBW, but she isn't a baker -- she's a professor. She's visiting The Wreath for Christmas, but she's not feeling the Christmas spirit. The curvy professor visits The Wreath to check out their Regency Christmas -- but her humbug attitude earns her a bad reputation in town.  When she sees the handsome lumberjack talking to the curvy baker, she decides that, like the Regency literature she studies, he's but a fantasy. But, when that same shifter approaches her, she learns that maybe, some stories are based on the truth.  Christmas magic and demon curses...  When her ex-fiancé enters the picture, will Hope continue to look to the past...or will she learn to love contemporary romances, set in the present? And will Hope end up learning to love Christmas? With a little help from Eamonn, there might just be some hope for Hope. When a demon's curse tackles Hope, only one thing can break the spell. Will Hope wake up and find her happily-ever-after? Or is this Sleeping Beauty destined to stay in a magical Regency realm...forever?  This story, featuring a bad boy werebear and a BBW professor, is loosely based on Sleeping Beauty.",
  "genres": [
    "Shapeshifters",
    "Romance",
    "Christmas",
    "Fantasy",
    "Holiday"
  ],
  "author": "Sable Sylvan",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/43224895-blitzen-claws"
}