{
  "title": "The Glass Woman",
  "description": "Rósa has always dreamed of living a simple life alongside her Mamma in their remote village in Iceland, where she prays to the Christian God aloud during the day, whispering enchantments to the old gods alone at night. But after her father dies abruptly and her Mamma becomes ill, Rósa marries herself off to a visiting trader in exchange for a dowry, despite rumors of mysterious circumstances surrounding his first wife’s death.Rósa follows her new husband, Jón, across the treacherous countryside to his remote home near the sea. There Jón works the field during the day, expecting Rósa to maintain their house in his absence with the deference of a good Christian wife. What Rósa did not anticipate was the fierce loneliness she would feel in her new home, where Jón forbids her from interacting with the locals in the nearby settlement and barely speaks to her himself.Seclusion from the outside world isn’t the only troubling aspect of her new life — Rósa is also forbidden from going into Jón’s. When Rósa begins to hear strange noises from upstairs, she turns to the local woman in an attempt to find solace. But the villager’s words are even more troubling—confirming many of the rumors about Jón’s first wife, Anna, including that he buried her body alone in the middle of the night.Rósa’s isolation begins to play tricks on her mind: What — or who — is in the attic? What happened to Anna? Was she mad, a witch, or just a victim of Jón’s ruthless nature? And when Jón is brutally maimed in an accident a series of events are set in motion that will force Rósa to choose between obedience and defiance — with her own survival and the safety of the ones she loves hanging in the balance.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Gothic",
    "Historical",
    "Thriller",
    "Horror"
  ],
  "author": "Caroline Lea",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/43208989-the-glass-woman"
}