{
  "title": "Donner Claws",
  "description": "He's coming down her chimney...  Werebear forest ranger Kevin Murphy's got mate madness. He's going to turn into a grizzly bear -- forever. Failing to claim his mate hasn't just caused Kevin to fall into mate madness. It's landed his furry butt on Santa Claus' The Naughty List. The only way Kevin can earn back his shift is by claiming his fated mate by Christmas...that is, if he can earn back his mate mark. With a little help from Santana's flying reindeer Donner, will Kevin end up claiming his fated mate? Or, will Kevin lose his shift, and his hope of claiming a mate, forever? There's only one thing more important than saving his shift -- and that's protecting his curvy mate at all costs.  Stella doesn't want a Naughty boy...  BBW Stella Schumaker is looking for a lot of things. Trouble is not on that Christmas list. When handsome lumberjack Kevin gets off of The Naughty List in front of her, her boss clues her in to the secrets of Christmas magic That's why she knows to stay away from Kevin once he comes back. After all, there's only one reason he could've gotten sent back to The Wreath, and it's not a Nice reason...  It takes a bad boy to beat a bad boy...  Curvy baker Stella has a secret -- a future she's running from, which led her to The Wreath. That's why she doesn't expect to face that future for the first time at The Wreath. When she does face it, there's only one man that can protect her -- one shifter. Luckily, his shift is just as Naughty as he is. Can Kevin protect Stella from her future? And will Stella learn to trust Kevin? There's only one book with the answers to those questions -- and it's Donner Claws.  This story, featuring a bad boy werebear and a BBW baker, is loosely based on The Elves and the Shoemaker.",
  "genres": [
    "Christmas",
    "Shapeshifters",
    "Holiday",
    "Romance"
  ],
  "author": "Sable Sylvan",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/43225107-donner-claws"
}