{
  "title": "Seven Devils and a Rose",
  "description": "One girl. Magically transported to another realm. Seven hunky men wearing mysterious masks adorned with ancient symbols and scripts. What could go wrong?  My name is Alfie. A university student. I’m nothing special. Just your average nineteen year old girl doing her best at life. Then that happens.  The unexpected. The impossible. The magic.  When I first set foot on St. James Manor, a charming old house my parents bought and turned into a retreat for writers, I feel a sense of connection with the magical place. One night, while I bathe in the hot spring that is on the estate, I’m inadvertently transported to another realm.  Disorientated and afraid of my new, mysterious, and foreign surroundings, I’m found by two dark warrior lords, who mistake me for a boy because of my short hair and slender frame. They even suspect that I am a member of a loose, violent bandit that is raiding their kingdom and kidnapping the civilians.  Despite having a fun and adventurous soul, I find nothing exciting, as these two gorgeous warriors take me back to their camp and proceed to grill me about my background; especially when one, tsundere Caleb, couldn’t stop staring at me, while the other, gregarious Felix, treats me like his next love interest and pays me his undivided attention at every possible chance he gets. When a group of bandits persues me and I am lost in the wild, dangerous woods, an alluring vision-in-white of a lord appears. His name is Geoffrey, and his enthralling charm fascinates me.  Of course, all that I want is to return home. But little do I know that finding a way home is the least of my worries, because there are four more gorgeous men, as well as a whole new, fantastical kingdom out there, waiting for me.  Seven Devils and a Rose is a reverse-harem fantasy realm-travel (isekai) fairytale-romance where paranormal creatures exist, magical power and technology go hand in hand, and love is a forever thing.  NOTE: This book has overpowered alpha heroes who love their girl to bites, a cute heroine who sometimes does kickass things without realizing it, and of course, steamy action scenes.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal Romance",
    "Magic",
    "Demons",
    "Paranormal",
    "Romance"
  ],
  "author": "Alexia Praks",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/43211776-seven-devils-and-a-rose"
}