{
  "title": "Abandon",
  "description": "From New York Times and USA Today bestselling author Rachel Van Dyken comes a new story in her Seaside Pictures series…It’s not every day you're slapped on stage by two different women you've been dating for the last year.I know what you're thinking. What sort of ballsy woman gets on stage and slaps a rockstar? Does nobody have self-control anymore? It may have been the talk of the Grammy's.Oh, yeah, forgot to mention that. I, Ty Cuban, was taken down by two psychotic women in front of the entire world. Lucky for us the audience thought it was part of the breakup song my band and I had just finished performing. I was thirty-three, hardly ready to settle down.Except now it's getting forced on me. Seaside, Oregon. My band mates were more than happy to settle down, dig their roots into the sand, and start popping out kids. Meanwhile I was still enjoying life.Until now. Until my forced hiatus teaching freaking guitar lessons at the local studio for the next two months. Part of my punishment, do something for the community while I think deep thoughts about all my life choices.Sixty days of hell.It doesn't help that the other volunteer is a past flame that literally looks at me as if I've sold my soul to the devil. She has the voice of an angel and looks to kill—I would know, because she looks ready to kill me every second of every day. I broke her heart when we were on tour together a decade ago.I'm ready to put the past behind us. She's ready to run me over with her car then stand on top of it and strum her guitar with glee.Sixty days. I can do anything for sixty days. Including making the sexy Von Abigail fall for me all over again. This time for good.Damn, maybe there’s something in the water.**Every 1001 Dark Nights novella is a standalone story. For new readers, it’s an introduction to an author’s world. And for fans, it’s a bonus book in the author’s series. We hope you'll enjoy each one as much as we do.**",
  "genres": [
    "Romance",
    "Second Chance Romance",
    "Contemporary",
    "Novella",
    "Music",
    "Second Chance",
    "Enemies To Lovers"
  ],
  "author": "Rachel Van Dyken",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/43208355-abandon"
}