{
  "title": "My Life as an Ice Cream Sandwich",
  "description": "National Book Award-finalist Ibi Zoboi makes her middle-grade debut with an unforgettable character: Ebony-Grace Norfleet, the sci-fi-obsessed granddaughter of one of the first black engineers to integrate NASA. Set in Harlem in the early days of hip-hop, My Life as an Ice Cream Sandwich is a moving and hilarious story of girl finding a place and a voice in a world that's changing at warp speed.In the summer of 1984, 12-year-old Ebony-Grace Norfleet makes the trip from Huntsville, Alabama, to Harlem, where she'll spend a few weeks with her father while her mother deals with some trouble that's arisen for Ebony-Grace's beloved grandfather, Jeremiah. Jeremiah Norfleet is a bit of a celebrity in Huntsville, where he was one of the first black engineers to integrate NASA two decades earlier. And ever since his granddaughter came to live with him when she was little, he's nurtured her love of all things outer space and science fiction--especially Star Wars and Star Trek, both of which she's watched dozens of time on Grandaddady's Betamax machine. So even as Ebony-Grace struggled to make friends among her peers, she could always rely on her grandfather and the imaginary worlds they created together. In Harlem, however, she faces a whole new challenge. Harlem in 1984 is an exciting and terrifying place for a sheltered girl from Hunstville, and her first instinct is to retreat into her imagination. But soon 126th Street begins to reveal that it has more in common with her beloved sci-fi adventures than she ever thought possible, and by summer's end, Ebony-Grace discovers that gritty and graffitied Harlem has a place for a girl whose eyes are always on the stars.Zoboi's middle-grade debut sets an utterly captivating character in a meticulously researched 1980s Harlem for a novel that will delight and inspire.",
  "genres": [
    "Middle Grade",
    "Historical Fiction",
    "Realistic Fiction",
    "Fiction",
    "Audiobook",
    "Historical",
    "Young Adult"
  ],
  "author": "Ibi Zoboi",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/43209402-my-life-as-an-ice-cream-sandwich"
}