{
  "title": "10 Science Fiction Greats Box Set (Special Edition): Space Opera, First Contact, Cyberpunk, Post Apocalyptic",
  "description": "3 Best-Selling Authors, 10 Great Full-Length Science Fiction Novels, One Low Price!Anthology Hyperspace Project (Books 1-3)Alien First Contact Cyberpunk Space Opera⭐️⭐️⭐️⭐️⭐️ “An action-packed, fun and intelligent adventure into the unknown.”He set out to prove a theory. Now he’s racing to save the galaxy from his mistake.Along with his newly found, rag-tag band of alien friends, Nick Bannon battles to keep his devastating technology out of the hands of the biomechanoid race known as the Mok’tu.Nick is flung to a distant world when his hyperspace experiment goes awry. Technology can always be used for good or evil and now his peaceful experiment could become a horrific weapon of a malicious alien race. Every species in the galaxy is in danger of total annihilation and it may take one man’s greatest sacrifice to stop it.Kael Jai (Books 1-4)Alien Superhero Cyberpunk Sci-Fi Series⭐️⭐️⭐️⭐️⭐️ “Great Sci-Fi Adventure!”⭐️⭐️⭐️⭐️⭐️ “First Contact with a twist.”⭐️⭐️⭐️⭐️⭐️ “Fast-Paced, High-Tech Action series. Aliens, genetic engineering, intergalactic war, witches, futuristic ninjas, mystery, who could ask for more?”His name is Kael Jai. An alien hiding among the humans of Earth. Outcast. Sent here for his own protection, having failed in winning the long battle with the madman called Jindom who intended to rule his entire planet. They thought he’d be safe on this backward little planet, so far from the war that raged on his home-world light years away. They were wrong. Jindom discovered Kael’s location and sent a powerful war machine to Earth to kill him. But one was not enough. One was their mistake. Now Kael intends to settle the score, rid the universe of the madman called Jindom, and bring peace to his home-planet of Trinoor.MalevolentAlien Contact Thriller⭐️⭐️⭐️⭐️⭐️ “Alien abduction. It’s a subject that’s been written to death, or so I thought, until encountering this book. E. J. Deen has written one hell of a novel. The pacing is relentless, the characters are believable, and the abductions are chilling.” -TimothyElliott Grey refuses to believe. As a top-notch journalist for a Seattle-based magazine, he is trained to have an open mind. But he simply refuses to believe extraterrestrials actually exist. After a disturbing interview with a man who claims to have been abducted by aliens, Elliott is plagued by nightmares of his own abduction. Terrorized and tortured by entities he cannot understand, Elliot has come face to face with his unbelief.Prototype☢️ Sexy Science Fiction Cyberpunk ThrillerAngelique is running for her life, hiding in plain sight.“Well written, well-paced, and fun to read.”“The heroine, Angelique, is strong, smart and beautiful, a powerful combination.",
  "genres": [],
  "author": "Donald Swan",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/43208725-10-science-fiction-greats-box-set-special-edition"
}