{
  "title": "Ipseity",
  "description": "A simple error leaves Leah with a unique Neural Enhancement Chip and a rapidly evolving AI implanted in her brain. In 'Nascent', she evaded kidnapping by virtual slavers and helped shut down some operations of the virtual crime syndicate that uses mind-controlled players as slaves. In 'Odyssey', she not only found a way to escape but she also uncovered deeper plots being carried out in both the virtual multi-universe and reality. In 'Change', Leah began learning how to use the additional connections her chip has made throughout her body. The Pod facility she opened expanded as she helped others from her neighbourhood. She discovered that the crime syndicate has an even greater presence in the virtual multiverse than she’d imagined. As she begins to unravel some of their secrets, they tarnish her reputation and kidnap.  In 'Rescue' Leah hacked the secure Vault where an AI friend of hers had been archived. She not only managed to retrieve her friend but uncovered a deeper conspiracy she has yet to understand. She succeeded in downloading a secure file she'd stolen from the crime syndicate although she hasn't yet managed to understand what it means. Leah also managed to rescue her mother from the crime syndicate but not before her mother had an AI chip inserted in her brain. She not only discovers that her boyfriend's family controls their own crime syndicate, but he is being controlled virtually by his parents.  In 'Ipseity' Leah discovers that the syndicate inserted a dangerously modified AI chip in her mother, the police are actively investigating her activities, her neural architecture is continuing to change, and her enemies are becoming more numerous and determined. Also, she works to rescue her boyfriend, continue her studies at MIT, understand the broader conspiracy, save her mother, complete quests in three virtual worlds, build her growing business empire, and set her AI free.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Cyberpunk",
    "Vampires",
    "Action",
    "Steampunk",
    "Dragons"
  ],
  "author": "Tony Corden",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/43223620-ipseity"
}