{
  "title": "Barnum: An American Life",
  "description": "“Robert Wilson’s Barnum, the first full-dress biography in twenty years, eschews clichés for a more nuanced story…It is a life for our times, and the biography Barnum deserves.” —The Wall Street JournalP.T. Barnum is the greatest showman the world has ever seen. As a creator of the Barnum & Baily Circus and a champion of wonder, joy, trickery, and “humbug,” he was the founding father of American entertainment—and as Robert Wilson argues, one of the most important figures in American history. Nearly 125 years after his death, the name P.T. Barnum still inspires wonder. Robert Wilson’s vivid new biography captures the full genius, infamy, and allure of the ebullient showman, who, from birth to death, repeatedly reinvented himself. He learned as a young man how to wow crowds, and built a fortune that placed him among the first millionaires in the United States. He also suffered tragedy, bankruptcy, and fires that destroyed his life’s work, yet willed himself to recover and succeed again. As an entertainer, Barnum courted controversy throughout his life—yet he was also a man of strong convictions, guided in his work not by a desire to deceive, but an eagerness to thrill and bring joy to his audiences. He almost certainly never uttered the infamous line, “There’s a sucker born every minute,” instead taking pride in giving crowds their money’s worth and more. Robert Wilson, editor of The American Scholar, tells a gripping story in Barnum, one that’s imbued with the same buoyant spirit as the man himself. In this “engaging, insightful, and richly researched new biography” (New York Journal of Books), Wilson adeptly makes the case for P.T. Barnum’s place among the icons of American history, as a figure who represented, and indeed created, a distinctly American sense of optimism, industriousness, humor, and relentless energy.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Audiobook",
    "American History",
    "Adult"
  ],
  "author": "Robert   Wilson",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/43218138-barnum"
}