{
  "title": "Demon Claws",
  "description": "He's going to Hell to crack some nuts... Krampus is a Christmas demon. That makes him a bad boy. As a bad boy, he breaks the law. He breaks the laws of physics. He breaks the laws of magic. He even breaks the laws of shifting and can turn into nearly any animal. Two laws he can't break are the laws of Time...and Fate. Krampus is a gruff goat shifter who's put off claiming a mate. The clock is up. This weregoat has to find and claim her, as fast as possible. Otherwise, the consequences could be deadly...and if humans can go to Hell, wherever demons go is probably much, much worse. There're laws Krampus doesn't break, because he doesn't know them. Those include the laws of dating. That means this demon goat is going to need dating lessons -- and there's only one BBW baker that's up for the job. Can the Nicest girl Krampus knows...handle his Naughtiness? Curvy Avery may seem cheery and bubbly, but she has secrets. First of all -- she's a Christmas elf, but Krampus already knew that. Secondly -- she has a huge frikkin' crush on the Christmas demon. When Krampus asks Avery to give him dating lessons, he doesn't expect her to say yes. He doesn't expect her to agree to going on three dates with him. He doesn't expect to make it to date three. Well, something usually happens on the third date, and Avery's not one to break any tradition -- Christmas or otherwise... Christmas is about family, and Avery's literally got in-laws from Hell... When Avery randomly gets dragged to Hell, Krampus has to save her, and in order to do that, the Christmas demon is going to have to be Naughtier than he's ever been before. Will 'The Nutcracker' save Avery's body and soul, or, will he crack under the pressure...like a nut? Find out, in 'Demon Claws.' This story, featuring a bad boy Christmas demon weregoat and a BBW Christmas elf, is loosely based on The Nutcracker.",
  "genres": [
    "Fantasy",
    "Shapeshifters",
    "Holiday",
    "Romance"
  ],
  "author": "Sable Sylvan",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/43238892-demon-claws"
}