{
  "title": "El Norte: The Epic and Forgotten Story of Hispanic North America",
  "description": "A sweeping saga of the Spanish history and influence in North America over five centuries, from the acclaimed author of Empire’s Crossroads.Because of our shared English language, as well as the celebrated origin tales of the Mayflower and the rebellion of the British colonies, the United States has prized its Anglo heritage above all others. However, as Carrie Gibson explains with great depth and clarity in El Norte, the nation has much older Spanish roots?ones that have long been unacknowledged or marginalized. The Hispanic past of the United States predates the arrival of the Pilgrims by a century, and has been every bit as important in shaping the nation as it exists today.El Norte chronicles the dramatic history of Hispanic North America from the arrival of the Spanish in the early 16th century to the present?from Ponce de Leon’s initial landing in Florida in 1513 to Spanish control of the vast Louisiana territory in 1762 to the Mexican-American War in 1846 and up to the more recent tragedy of post-hurricane Puerto Rico and the ongoing border acrimony with Mexico. Interwoven in this narrative of events and people are cultural issues that have been there from the start but which are unresolved to this language, belonging, community, race, and nationality. Seeing them play out over centuries provides vital perspective at a time when it is urgently needed.In 1883, Walt Whitman meditated on his country’s Spanish “We Americans have yet to really learn our own antecedents, and sort them, to unify them,” predicting that “to that composite American identity of the future, Spanish character will supply some of the most needed parts.” That future is here, and El Norte, a stirring and eventful history in its own right, will make a powerful impact on our national understanding.“This history debunks the myth of American exceptionalism by revisiting a past that is not British and Protestant but Hispanic and Catholic. Gibson begins with the arrival of Spaniards in La Florida, in 1513, discusses Mexico’s ceding of territory to the U.S., in 1848, and concludes with Trump’s nativist fixations. Along the way, she explains how California came to be named after a fictional island in a book by a Castilian Renaissance writer and asks why we ignore a chapter of our history that began long before the Pilgrims arrived. At a time when the building of walls occupies so much attention, Gibson makes a case for the blurring of boundaries.” —New Yorker“A sweeping and accessible survey of the Hispanic history of the U.S. that illuminates the integral impact of the Spanish and their descendants on the U.S.’s social and cultural development. . . . This unusual and insightful work provides a welcome and thought-provoking angle on the country’s history, and should be widely appreciated.” —Publishers Weekly, starred review, PW Pick",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "The United States Of America",
    "Sociology",
    "Politics",
    "United States"
  ],
  "author": "Carrie Gibson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/43245800-el-norte"
}