{
  "title": "You are now at the crossroads",
  "description": "All that is big, is made from small. If we ignore what is small, we ignore what is fundamental. What are we than left with? In terms of importance, nothing is bigger than the smallest. We tend to forget how important the small parts are. They are at the bottom. The lowest levels. They form the foundations for all structures above them. Imagine you start to dig under your house. One grain of sand at the time. At some point, when we take another grain of sand, the house will collapse. Our lives are made of small parts. We should perhaps care more for what is small, than for what is big. Observe our smallest daily choices. Understand why you decided for one over the other. The people that are small, forgotten, at the low end of life; need us more. They are the smallest building blocks of our society, of our lives; of our future. We cannot afford to give more attention to those that need it less. We should seek to befriend the smallest ones. The ones that are cast away. It is not a job for someone else. In every life, there should exist a humble service to those that the world finds unworthy. To those that are in some social way beneath us. It is our responsibility to lift them. To help them get up. To rise the fallen. And that can only be done by being smaller. By being under their feet, so that they may climb. Who is at the lowest possible level? At the bottom of this hierarchy lies perfection. Lies freedom. The greatest act of a man is serving. We are here to serve. Not so much to those bigger than us, but to those that are smaller. Look at the world. How little of this you will find. The world will convince you to go in the opposite direction. Partake in a race to the top. But the true race is to the bottom. When a king disguises as a peasant, to heal the wounds of the sick and forgotten. This my friend, is the narrow path. This is the crossroads",
  "genres": [],
  "author": "Igor Rački",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/43239554-you-are-now-at-the-crossroads"
}