{
  "title": "Leo quiere a Aries",
  "description": "Leo quiere a Aries. O así sería si el despistadísimo de Leo fuera capaz de verlo. Theo Wallace, un leo perezoso y divertido, necesita encontrar una amistad verdadera, de esas que duran para siempre. Una amistad que le ayude a superar el pasado y a centrarse en un futuro más brillante y prometedor. Jamie Cooper, un aries sensato y entusiasta, podría ser ese amigo. Está hecho tan a su medida que es como si lo suyo estuviera escrito en las estrellas. Es el compañero de piso perfecto. Todo va bien y es muy divertido.Mucho más que divertido.Pero ¿qué significan esas largas miradas que Jamie le dedica a Theo? ¿Y qué son esas mariposas que Theo siente en el estómago? El despistado de leo necesitará de la astucia de aries para descubrirlo. Leo quiere a Aries es una novela con mucho tonteo, con un amor que se cuece a fuego lento entre dos compañeros de piso que van de amigos a amantes (friends-to-lovers). Un romance gay chico-chico con final feliz y esperanzador. Se trata de una historia New Adult que se desarrolla en un entorno universitario y que abre la serie Signos de amor. Todos los libros de la serie Signos de amor son autoconclusivos y pueden leerse de forma independiente.LEO QUIERE A ARIES (bisexualidad recién descubierta, friends-to-lovers, con un protagonista la hostia de despistado)ESCORPIO ODIA A VIRGO (enamorado de mi vecino, un enemies-to-lovers que no se creen ni ellos, confusión de identidad)GÉMINIS SE QUEDA CON CAPRICORNIO (falso noviazgo, friends-to-lovers, amor prohibido) PISCIS PESCA A TAURO (matrimonio de conveniencia, polos opuestos que se atraen, diferencia de edad) CÁNCER SE EMBARCA CON ACUARIO (niñero/canguro, viudo, polos opuestos que se atraen)Rainbow Awards 2017Nominado a mejor libro gay.Nominado a mejor romance contemporáneo gay.",
  "genres": [
    "Romance",
    "M M Romance",
    "Contemporary",
    "Friends To Lovers",
    "LGBT",
    "New Adult",
    "College"
  ],
  "author": "Anyta Sunday",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/43240071-leo-quiere-a-aries"
}