{
  "title": "Compassionate Cuisine: 125 Plant-Based Recipes from Our Vegan Kitchen",
  "description": "Selected as one of PETA's must-have vegan cookbooks of 2019! Vegan recipes and heartwarming stories for animal lovers, from the Catskill Animal Sanctuary.Add love and stir! Written with love and authenticity, Compassionate Cuisine tells the story of one of the country’s oldest and most respected animal sanctuaries through its food. With humor and heart, Chef Linda Soper-Kolton and Chef Sara Boan, Catskill Animal Sanctuary’s vegan chefs, bring the Sanctuary’s culinary program, Compassionate Cuisine, to life through an array of recipes intended to inspire and delight. Their recipes have been savored and devoured by thousands of visitors to the Sanctuary, and they want to share them with the world. Interwoven with the recipes are the animals. Sanctuary founder and director Kathy Stevens writes for the voiceless many for whom the Sanctuary works so fervently to share the good news about how wonderful–and important–it is to consider compassion first when we eat.Find diverse recipes such as:Blueberry Praline French Toast CasseroleHomestead Granola and Vanilla Nut MilkAvocado Tartines with Peach SalsaBuffalo Cauliflower with Blue Cheese DressingChipotle Sweet Potato Stew with Lime Cashew CremaThai Burgers with Spicy Peanut SauceMoroccan Vegetable and Chickpea TagineChocolate Chip Cookie Dough TrufflesAnd many more!Catskill Animal Sanctuary wants the world to go vegan. It’s who they are. It’s what they do. It’s why hundreds of rescued farm animals call their place home. And it’s why they open their gates to thousands of visitors each year. Now, home cooks everywhere can enjoy the same delicious and compassionate cuisine served at the Sanctuary, and read about the people and animals that make the Catskill Animal Sanctuary such a special place.",
  "genres": [
    "Cookbooks",
    "Vegan"
  ],
  "author": "Linda Soper-Kolton",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/43252657-compassionate-cuisine"
}