{
  "title": "WORLD'S DUMBEST CRIMINALS - Adolf Hitler, Joseph Stalin, Vladimir Lenin, Mao Zedong: Pol Pot, Kim Il-sung, Ho Chi Minh, Karl Marx, Leon Trotsky, Kim Jong‑il, Benito Mussolini, Kim Jong-un, & more!",
  "description": "The crimes you are about to read are true. The names have not been changed. These \"World's Dumbest Criminals\" make imprisoned psychopaths seem angelic in comparison. How did the worst racketeers conspire to spread their heinous True Crimes worldwide? Part of that story began in the USA. The USA was the origin of Nazi salutes and Fascist behavior through the work of an American Francis Bellamy, author of the Pledge of Allegiance to the Flag. The American Nazi salute was often performed by public officials in the USA from 1892 through 1942. What happened to old photographs and films of the American Nazi salute performed by federal, state, county, and local officials? Those photos and films are rare because people don't want to know the truth about the government’s past. Public officials in the USA who preceded the German socialist (Hitler) and the Italian socialist (Mussolini) were sources for the stiff-armed salute (and brainwashed chanting) in those countries and other foreign countries influencing the worst reprobates, Joseph Stalin, Vladimir Lenin, Mao Zedong, Adolf Hitler, Pol Pot, Kim Il-sung, Ho Chi Minh, Karl Marx, Leon Trotsky, Kim Jong‑il, Benito Mussolini, Kim Jong-un, Fidel Castro, Che Guevara and more! They showed that Killing socialists is trademark socialism. Millions died. Yet, the \"World's Dumbest Criminals\" escaped justice and many continue to be glorified as \"great leaders.\" Bernie Sanders and Alexandria Ocasio-Cortez (and their fans) self-identify the same way Hitler SOCIALIST. (Hitler and his supporters did not call themselves \"Nazi\" nor \"Fascist\"). \"Socialism\" was touted by the very word in voluminous speeches & writings by the socialists Hitler, Stalin, Mao, Pol Pot, the Kim thugs, etc. Soviet socialism joined German socialism to launch the socialist war (WWII) invading Poland etc. It led to socialism's many genocides. Who was Stalin, Mao, or Hitler? Stalin shares guilt for genocides of Mao, Hitler & himself, and Pol Pot, and the Kim thugs and other socialists. German socialism and Soviet socialism joined to launch the socialist war (WWII), invading Poland and going onward. Stalin assisted Mao. It led to genocide under many other socialists. The importance of this book cannot be overstated. It is a microcosm of the amorality of what remains of world socialism. It shines a floodlight on the ethical vacuum that is collectivism and its overlords. America is following them into that hell. Author Ian Tinny provides eye-popping revelations from the historian Dr. Rex Curry that are undisputed by the New York Times • The Washington Post • Los Angeles Times • San Francisco Chronicle • Tampa Bay Times • Weekly Standard • Vogue • Chicago Tribune • Newsday • The New York Times Book Review • Tampa Tribune • Library Journal • Publishers Weekly • Saint Petersburg Times • History Journal • Scholar's Weekly •",
  "genres": [],
  "author": "Ian Tinny",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/43259680-world-s-dumbest-criminals---adolf-hitler-joseph-stalin-vladimir-lenin"
}