{
  "title": "Mythic Journeys: Retold Myths and Legends",
  "description": "Award-winning editor Paula Guran presents a diverse reprint anthology collecting classic myths and legends, retold by today’s top fantasy writers, including Neil Gaiman and Emma and Peter Straub.The Native American trickster Coyote . . . the snake-haired Greek Gorgon Medusa, whose gaze turned men to stone . . . Kaggen, creator of the San peoples of Africa . . . the Holy Grail of Arthurian legend . . . Freyja, the Norse goddess of love and beauty . . . Ys, the mythical sunken city once built on the coast of France . . . Ragnarok, the myth of a world destroyed and reborn . . . Jason and the Argonauts, sailing in search of the Golden Fleece . . .Myths and legends are the oldest of stories, part of our collective consciousness, and the source from which all fiction flows. Full of magic, supernatural powers, monsters, heroes, epic journeys, strange worlds, and vast imagination, they are fantasies so compelling we want to believe them true.This new anthology compiles some of the best modern short mythic retellings and reinvention of legend from award-winning and bestselling authors, acclaimed storytellers, and exciting new talent, offering readers new ways to interpret and understand the world. Adventure with us on these Mythic Journeys . Stories and authors include “Lost Lake” – Emma Straub and Peter Straub“White Lines on a Green Field” – Catherynne M. Valente“Trickster” – Steven Barnes and Tananarive Due“Our Talons Can Crush Galaxies” – Brooke Bolander“A Memory of Wind” – Rachel Swirsky“Leda” – M. Rickert“Chivalry” – Neil Gaiman“The God of Au” – Ann Leckie“Faint Voices, Increasingly Desperate” – Anya Johanna DeNiro“Ogres of East Africa” – Sofia Samatar“Ys” – Aliette de Bodard“The Gorgon” – Tanith Lee“Merlin Dreams in the Mondream Wood” – Charles de Lint“Calypso in Berlin” – Elizabeth Hand“Seeds” – Lisa L. Hannett and Angela Slatter“Wonder-Worker-of-the-World” – Nisi Shawl“Thesea and Astaurius” – Priya Sharma“Foxfire, Foxfire” – Yoon Ha Lee“Owl vs. the Neighborhood Watch” – Darcie Little Badger“How to Survive an Epic Journey” – Tansy Rayner Roberts“Simargl and the Rowan Tree” – Ekaterina Sedia“The Ten Suns” – Ken Liu“Armless Maidens of the American West” – Genevieve Valentine“Give Her Honey When You Hear Her Scream” – Maria Dahvana Headley“Zhyuin” – John Shirley“Immortal Snake” – Rachel Pollack“A Wolf in Iceland Is the Child of a Lie” – Sonya Taaffe",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Mythology",
    "Fiction",
    "Anthologies",
    "Retellings",
    "Adult"
  ],
  "author": "Paula Guran",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/43252733-mythic-journeys"
}