{
  "title": "The Mammoth Book of Steampunk",
  "description": "The Mammoth Book of Steampunk showcases the very best in the form of stories by Paul Di Filippo, Neil Gaiman, Cherie Priest, and many more.An anthology that looks to the future through the lens of the past, these 30 mash-ups of past and future push the boundaries of steampunk.This is steampunk with a modern, post-colonial sensibility. Contributors include: Jeff VanderMeer, Caitlín Kiernan, Mary Robinette Kowal, Jay Lake, Cherie Priest, Cat Rambo, Catherynne M. Valente, Genevieve Valentine, and many more.Contents:Steampunk : looking to the future through the lens of the past / Ekaterina Sedia --Fixing Hanover / Jeff VanderMeer --The Steam Dancer (1896) / Caitlin R. Kierman --Icebreaker / E. Catherine Tobler --Tom Edison and his amazing telegraphic harpoon / Jay Lake --The Zeppelin Conductors' Society Annual Gentlemen's Ball / Genevieve Valentine Clockwork fairies / Cat Rambo --The mechanical aviary of Emperor Jala-ud-din Muhammad Akbar / Shweta Narayan --Prayers of forges and furnaces / Aliette de Bodard --The effluent engine / N.K. Jemisin --The clockwork goat and the smokestack magi / Peter M. Ball --The armature of flight / Sharon Mock --The anachronist's cookbook / Catherynne M. Valente --Numismatics in the reigns of Naranh and Viu / Alex Dally MacFarlane --Zeppelin City / Eileen Gunn & Michael Swanwick --The people's machine / Tobias S. Buckell --The hands that feed / Matthew Kressel --Machine maid / Margo Lanagan --To follow the waves / Amal El-Mohtar --Clockmaker's requiem / Barth Anderson --Dr Lash remembers / Jeffrey Ford --Lady Witherspoon's solution / James Morrow --Reluctance / Cherie Priest --A serpent in the gears / Margaret Ronald --The celebrated carousel of the Margravine of Blois / Megan Arkenberg --Biographical notes to ''A discourse on the nature of causality, with air-planes'' by Benjamin Rosenbaum / Benjamin Rosenbaum --Clockwork chickadee / Mary Robinette Kowal --Cinderella suicide / Samantha Henderson --Arbeitskraft / Nick Mamatas --To seek her fortune / Nicole Kornher-Stace --The ballad of the last human / Lavie Tidhar.",
  "genres": [
    "Anthologies",
    "Science Fiction",
    "Fiction",
    "Steampunk",
    "Historical Fiction",
    "Short Stories",
    "Alternate History"
  ],
  "author": "Sean Wallace",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/12377549-the-mammoth-book-of-steampunk"
}