{
  "title": "With My Last Breath",
  "description": "Just when Harmonia thought she had saved everyone she loved, the unthinkable happens and her life is shattered… in the space of just one breath. Now, she is left alone to shoulder a challenge, because she alone can fulfill a prophecy and restore Olympus. She knows she can succeed; she is the daughter of gods, after all. But will doing so cause her to lose herself?To find Zeus’ sword, she is forced to return to a place that she knows will cause her pain. But she willingly goes in order to save everyone she loves, because pain alone cannot kill her. Or can it? Critics My Vamp Fiction says this about The Bloodstone “I just have to say this author keeps blowing me away with these books. I’m totally and completely infatuated with them. I’d even go as far as to say that they may just be my favorite series of the year.”The Book Holdup \"Camelot…that is all I think I need to say! How perfect is it that Harmonia is back in the time of knights in shining armor looking for a mystical sword to save Olympus and rescue her soul mate? Magical! Once again Ms. Cole gives the reader quite a ride.\"Tanya Marie on Goodreads \"The Bloodstone Saga is pure literary magic!!!! This is my new literary chocolate -- my new literary gold!!!\" Darcy on Goodreads \"Fabulous! My favorite of the series so far. I cannot wait until the next book comes out.\"Helen on Goodreads \"There has never been a series that has given me as many goosebumps, made me want to scream for joy, and cry for lost ones. In literature world that seems to be filled with vampires and werewolves, this series is fantasically refreshing. I am in awe of how quickly I fell for Harmonia and Cadmus, but am pleased to say that they are now my new favorite fictional characters. This series is a MUST read!\"With My Last Breath is Book 3 in the Bloodstone Saga. (It is preceded by Every Last Kiss and Fated). Book 4 (My Tattered Bonds) is the epic series finale. This novel contains an exciting excerpt from J.L. Bryan's bestselling novel, Jenny Pox. About the Courtney Cole is a YA novelist who loves thunderstorms, cake batter and insane amounts of coffee. She wrote her first story at the age of 9, although thankfully it has remained hidden away in an old cedar chest beneath musty blankets. Her more recent efforts are much better.",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Mythology",
    "Greek Mythology",
    "Paranormal Romance",
    "Romance",
    "Magic"
  ],
  "author": "Courtney Cole",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/12377557-with-my-last-breath"
}