{
  "title": "Google Archipelago: The Digital Gulag and the Simulation of Freedom",
  "description": "Google Archipelago: The Digital Gulag and the Simulation of Freedom begins with familiar cultural politics as points of entry to the book's theme regarding the reach, penetration, and soon the ubiquity of the digital world. In a book about enormous sea changes brought about by digital technology, Google Archipelago begins and ends with the political, in particular with the objectives of the Big Digi­tal conglomerates as global corporate monopoly capitalists or would-be-monopolies.Google Archipelago argues that Big Digital technologies and their principals represent not only economic powerhouses but also new forms of governmental power. The technologies of Big Digital not only amplify, extend, and lend precision to the powers of the state, they may represent elements of a new corporate state power.In contrast to academics who study digital media and bemoan such supposed horrors as digital exploitation, in Google Archipelago, Michael Rectenwald argues that the real danger posed by Big Digital is not digital capitalism as such, but leftist authoritarianism, a political outlook shared by academic leftists, who thus cannot recognize it in their object of study. Thus, while imagining that they are radical critics of Big Digital, academic digital media scholars (whom Rectenwald terms the digitalistas ) actually serve as ideological smokescreens that obscure its real character.Two chapters interrupt the book's genre as non-fiction prose. Part historical science fiction and part memoir, these chapters render the story of a Soviet Gu­lag survivor and defector, and the author's earlier digital self. Google Archipelago intentionally blurs the lines between argument and story, fact and artifact, the real and the imaginary. This is necessary, Rectenwald argues, because one cannot pretend to describe the Google Archipelago as if from without, as something apart from experience. In any case, soon one will no longer go on the Internet. The Internet and cyberspace will be everywhere, while humans and other agents will be digital artifacts within it.The Google Archipelago represents the coextension of digitization and physical social space, the conversion of social space and its inhabitants into digital artifacts, and the potential to control populations to degrees unimagined by the likes of Stalin, Hitler, or Mao.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Technology",
    "Cultural",
    "Education",
    "Sociology"
  ],
  "author": "Michael Rectenwald",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/43254170-google-archipelago"
}