{
  "title": "Slaves of Obsession",
  "description": "The Barnes & Noble ReviewIn Slaves of Obsession, Anne Perry thrusts her returning hero, William Monk, into the midst of the American Civil War. Monk is not choosing sides in this war based on the convictions of the Union or the Confederacy. Instead, he must put aside his principles to get to the bottom of a complex case involving gun smuggling, blackmail, and murder.Slaves of Obsession begins with a dinner party at the home of Daniel and Judith Alberton. William Monk and his wife, Hester, meet not only the host and the hostess at this intimate gathering but also Judith's cousin Robert Casbolt, a Union sympathizer named Lyman Breeland, and the Alberton's 16-year-old daughter, Merritt. Although Breeland is quick to share his convictions, Daniel, Robert, and Judith remain more reticent on the topic of the war and try to change the subject. When an unexpected visitor named Philo Trace, a member of the Confederate army, arrives, their taciturnity regarding the Civil War becomes all too clear. Daniel and Robert deal in arms and have made a previous agreement with Trace to sell him guns for the Confederacy -- guns that Breeland desperately wants for his sacred Union. Having to choose sides in the Civil War is the least of Alberton and Casbolt's problems, however. They soon turn to Monk for help as they are embroiled in a blackmail scheme in which an unknown person wants them to sell their valuable guns to pirates; if they fail to do so, an altruistic secret of theirs will be revealed in such a way that their reputations will be ruined.Monk agrees to aid them, but before he can begin to help, everything spirals out of control: When William and Hester are awakened by a knock on their door, their lives become entangled with murder; a missing daughter whose passions are engaged not only by the war; a Civil War battlefield; and a London courtroom.Anne Perry's Victorian mysteries have always been more than just simple whodunits, and Slaves of Obsession is no exception. At first glance, it seems as though the Civil War is at the center of the turmoil, but there's much more at the heart of this work in which love plays a more crucial role than money or war. Perry's superior sense of adventure and her peerless knowledge of the Victorian era enable her readers to enter her worlds so completely that they keep coming back for more.\n--Jennifer Jarett",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Victorian",
    "Crime"
  ],
  "author": "Anne Perry",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/432518.Slaves_of_Obsession"
}