{
  "title": "Moonlight Duology",
  "description": "Moonlight  Murder and Magic Books 1 and 2 by Yurie KiriYurie Kiri's novel \"Moonlight Beach\" won the 2020 Hollywood Book Festival's award for Genre Fiction is packaged here in the \"Moonlight Duology\" with its sequel \"Moonlight Canyon\". These two books have been described as something like Carlos Castaneda's \"The Teachings of Don Juan...\" combined with Jack Kerouac's \"On the Road\" only more intense.Now \"Moonlight Duology\" has just been selected as the winner in the \"Sequels\" category for the 2023 Los Angeles Book Festival. />Moonlight Murder and Magic Book 1 Dive into the gripping 'Moonlight Duology' - a psychic thriller combination of murder mystery and supernatural intrigue that will keep you on the edge of your seat from the first page to the last.In 'Moonlight Murder and Magic Book 1,' Rancho, California, a once-idyllic coastal haven for the wealthy, transforms into a nightmarish landscape of violence and uncertainty with a series of unfortunate events. Bodies wash up on the shores of Moonlight Beach, shattering the tranquility of the gated community. As the privileged residents grapple with gruesome deaths and mysterious rituals, they are confronted with the terrifying What force is behind this chaos? Could it be the lurking shadows of the supernatural, the sinister schemes of venture capitalists, or something even more sinister? The violence escalates, and the stakes couldn't be higher as the community races against time to decipher the truth before it's too late.\"Moonlight Beach\" was voted as winner of the 2020 Hollywood Book Festivals award for the best \"Genre Fiction\" novel. Now \"Moonlight Duology\" has just been selected as the winner in the \"Sequels\" category for the 2023 Los Angeles Book Festival. />If you are looking for a good modern mystery book series, this serial killer, crime thriller and detective crime fiction would be your best read.Moonlight Murder and Magic Book 2:Continuing the heart-pounding tale in 'Moonlight Murder and Magic Book 2,' the focus shifts to Silver City, a seemingly peaceful retreat marred by brutal killings and unspeakable horrors.As Susan and Anne, once residents of Moonlight Beach, confront the darkness that has engulfed Silver City, they encounter a web of danger that reaches beyond their comprehension. Could drug smugglers led by the ruthless Senor Tito Ocotillo be the culprits for the violence? or is there a more otherworldly explanation for the hidden truth? The enigmatic Tina, a charismatic TV news anchor, joins their cause, leading them down a treacherous path of extraterrestrial theories and ancient Native American rituals. With the clock ticking, the trio must unravel the truth behind the bloodshed and prevent a cataclysmic event that threatens to unleash hell on Earth.Immerse yourself in a spellbinding narrative that weaves together suspense, magic, and supernatural witchcraft.The 'Moonlight Duology' is a classic psychic thriller that will captivate your imagination, leaving you breathless and yearning for more with its series of unfortunate events. A masterful blend of Carlos Castaneda's mystique and Jack Kerouac's raw energy, this series will redefine your understanding of intensity.\"Moonlight Murder and Magic Books 1 and 2 by Yurie Kiri are both awarded in the world of books that are captivating and filled with suspense with a hint of masterful supernatural elements.",
  "genres": [],
  "author": "Yurie Kiri",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/123775275-moonlight-duology"
}