{
  "title": "You Can Prevent a Stroke",
  "description": "Did you know we have 100,000 heartbeats a day? That’s a lot of wear and tear over the years as we age.\nNatural aging leads to artery plaque, high blood pressure, and slower and irregular heartbeats. You can do everything right, and time will still pass. You will still age. While you can influence some aspects of aging on your own, some you cannot—at least not without your doctor’s help.Fortunately, the biology of aging is no longer mysterious. Heart and blood vessel health is knowable, measurable, and manageable.In You Can Prevent a Stroke, Dr. Joshua Yamamoto and Dr. Kristin Thomas help us understand what we can do, and what we can ask of our doctors, to manage the effects of aging on our circulation so that we do not have a stroke. For years, they have approached patients with the fundamentals learned at The Johns Hopkins Hospital: “Take responsibility for your patient’s health, go in-depth, have an unswerving commitment to solving problems, be thorough, thoughtful, and have attention to detail.”There is no one-size-fits-all solution or magical cure for anything. But there are principles that can serve as useful guides for everyone and provide an approach to managing the natural processes that affect us all. Some preventative steps include:Establishing a relationship with a physician Knowing the health of your heart Knowing the health of your arteries Knowing the regularity of your heartbeat Knowing if it’s time to take a medicine to prevent plaque in your arteries, and whether you need a pill to prevent a blood clot Strokes are usually said to be tragic and random. They are certainly tragic, but they are not random. Strokes can be avoided, and You Can Prevent a Stroke will explain how.",
  "genres": [
    "Health",
    "Nonfiction",
    "Science",
    "Medical",
    "Medicine"
  ],
  "author": "Joshua S. Yamamoto",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/43261525-you-can-prevent-a-stroke"
}