{
  "title": "Where do you go to",
  "description": "When the young Marie-Claire wakes up in Rome, she has no idea who she is or how she got there. Her tale of adversity starts in the biting cold, her past unknown and her future uncertain. Our heroine gets adopted from the Marcigliana orphanage by a French diplomat, initiating a journey of self-discovery across post-World War II Europe. In Athens, she discovers a talent for ballet, which gets elevated to greater heights when the family moves to Moscow at the height of the Cold War. Marie-Claire blooms into a social butterfly, joining the high society in Paris and mingling in social circles with the famous singers, writers, and artists who inhabit the City of Light in the early 1960s. Her marvelous travels across Europe include adventurous summer vacations in the French Riviera, weekends at the family country estate in Chantilly and winters in snowy St Moritz. Interspersed with the coming of age tale of her young life, is her attendance of an embassy party in Paris as a young woman in 1965. Now a student at the Sorbonne, Marie-Claire meets up with figures from her past in the Soviet embassy and faces a painful reminder of an event which forever changed her life in Moscow. The epic account of Marie-Claire’s life is an enthralling literary adaptation of Peter Sarstedt’s famous song, celebrating 50 years since he won the 1969 Ivor Novello award for “Where do you go to (my lovely)?” The mystery of her origins is finally uncovered, revealing the tragic time prior to that cold night in Rome, bringing an unexpected end to her persistent nightmares and morning tears.\"The author paints picture after picture of the most stunning cities and landscapes in Europe during the 1950's and 1960's. The far-reaching consequences of World War II and the communist regime are intertwined throughout the story. Author Jean Cerfontaine has skillfully crafted an intriguing historical fictional work in Where Do You Go To. It is an unforgettable book!\" - Readers' Favorite",
  "genres": [
    "Coming Of Age",
    "Historical Fiction"
  ],
  "author": "Jean Cerfontaine",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/43258113-where-do-you-go-to"
}