{
  "title": "The Oxford Book of Humorous Prose: From William Caxton to P.G. Wodehouse",
  "description": "If puritanism is, as H.L. Mencken once said, the haunting fear that someone, somewhere, may be happy, then this glorious, monumental collection by one of England's most popular humorists is a puritan's nightmare. Focusing primarily on the 19th and 20th century, but with material datingback to Columbus, Frank Muir has packed this volume with enough joy and laughter to sink the Mayflower.The range of comic material is amazing--from the gentle, charming comedy of manners, to biting satire, to outrageous parody. There are excerpts from the novels of Jane Austen and P.G. Wodehouse and Mark Twain, complete short stories by O. Henry and Frank O'Connor, classic tall tales fromAustralia (including one by \"Banjo\" Patterson, who also wrote \"Waltzing Matilda\"), passages from Groucho Marx's correspondence with Warner Brothers, newspaper columns written by Art Buchwald and Myles na Gopaleen (the novelist Flann O'Brien), a selection of Samuel Johnson's comic definitions, plus asprinkling of egregious puns, witty sayings, and even the clever names of stores (such as the New York restaurant \"Just for the Halibut\" and the London beauty parlor \"Curl Up and Dye\"). Muir has gathered work from over two hundred writers and from every English-speaking country. Virtually all ofyour favorites are Jonathan Swift, Jane Austen, Charles Dickens, Laurence Sterne, Anita Loos, Ring Lardner, Alexander Woollcott, Robert Benchley, Dorothy Parker, S.J. Perelman, Damon Runyon, Fran Lebowitz, Joseph Heller, Evelyn Waugh, Garrison Keilor, Erma Bombeck, Tom Wolfe, and countlessothers. In addition, there are comic pieces from writers you wouldn't expect to find--such as Thomas Hardy or Lawrence Durrell--and many many writers you may not have discovered yet, such as Jerome K. Jerome or Daisy Ashford (who wrote an unintentionally hysterical novel at age nine, which shepublished in her thirties).Frank Muir is one of Britain's best-loved humorists, the host of a highly popular television show and the prolific author of dozens of hilarious books, including the best-selling The Frank Muir Book . Here he provides not only a painfully funny collection, but also generous introductions toeach writer, which are comic gems in themselves. Except for the occasional puritan, this is a book that everyone will enjoy.",
  "genres": [
    "Humor",
    "Anthologies",
    "Fiction",
    "Short Stories",
    "Reference",
    "Comedy",
    "Books About Books"
  ],
  "author": "Frank  Muir",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/1003198.The_Oxford_Book_of_Humorous_Prose"
}