{
  "title": "The Furies",
  "description": "This page-turning, harrowing debut is the story of a girl trying to fit in, whose obsessive new friends and desperation to belong leads her to places she'd never imagined...dark, dangerous, and possibly even violent. In 1998, a sixteen-year-old girl is found dead.She's posed on a swing on her boarding school's property, dressed all in white, with no known cause of death. Whispers and rumors swirl, with no answers. But there are a few who know what happened; there is one girl who will never forget.One year earlier: a new student, Violet, steps on the campus of Elm Hollow Academy, an all-girl's boarding school on the outskirts of a sleepy coastal town. This is her fresh start, her chance to begin again in the wake of tragedy, leave her demons behind. Bright but a little strange, uncertain and desperate to fit in, she soon finds herself invited to an advanced study group, led by her alluring and mysterious art teacher, Annabel.There, with three other girls--Alex, Grace, and Robin--the five of them delve into the school's long-buried grim history: of Greek and Celtic legends; of the school founder's \"academic\" interest in the occult; of gruesome 17th century witch trials. Annabel does her best to convince the girls that her classes aren't related to ancient rites and rituals, and that they are just history and mythology. But the more she tries to warn the girls off the topic, the more they drawn to it, and the possibility that they can harness magic for themselves.Violet quickly finds herself wrapped up in this heady new world of lawless power--except she is needled by the disappearance of a former member of the group, one with whom Violet shares an uncanny resemblance. As her friends' actions take a turn for the darker and spiral out of control, she begins to wonder who she can trust, all the while becoming more deeply entangled. How far will these young girls go to protect one another...or to destroy one another?",
  "genres": [
    "Dark Academia",
    "Thriller",
    "Young Adult",
    "Fiction",
    "Mystery",
    "Contemporary",
    "Horror"
  ],
  "author": "Katie Lowe",
  "average_rating": "3.01",
  "url": "https://www.goodreads.com/book/show/43263485-the-furies"
}