{
  "title": "Divided We Fall: America's Secession Threat and How to Restore Our Nation",
  "description": "David French warns of the potential dangers to the country―and the world―if we don’t summon the courage to reconcile our political differences.Two decades into the 21st Century, the U.S. is less united than at any time in our history since the Civil War. We are more diverse in our beliefs and culture than ever before. But red and blue states, secular and religious groups, liberal and conservative idealists, and Republican and Democratic representatives all have one thing in each believes their distinct cultures and liberties are being threatened by an escalating violent opposition. This polarized tribalism, espoused by the loudest, angriest fringe extremists on both the left and the right, dismisses dialogue as appeasement; if left unchecked, it could very well lead to secession.An engaging mix of cutting edge research and fair-minded analysis, Divided We Fall is an unblinking look at the true dimensions and dangers of this widening ideological gap, and what could happen if we don't take steps toward bridging it. French reveals chilling, plausible scenarios of how the United States could fracture into regions that will not only weaken the country but destabilize the world.But our future is not written in stone. By implementing James Madison’s vision of pluralism―that all people have the right to form communities representing their personal values―we can prevent oppressive factions from seizing absolute power and instead maintain everyone ’s beliefs and identities across all fifty states.Reestablishing national unity will require the bravery to commit ourselves to embracing qualities of kindness, decency, and grace towards those we disagree with ideologically. French calls on all of us to demonstrate true tolerance so we can heal the American divide. If we want to remain united, we must learn to stand together again.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Sociology",
    "Audiobook",
    "Cultural",
    "Social Issues"
  ],
  "author": "David  French",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/43263151-divided-we-fall"
}