{
  "title": "Models.Behaving.Badly: Why Confusing Illusion with Reality Can Lead to Disaster, on Wall Street and in Life",
  "description": "Emanuel Derman was a quantitative analyst (Quant) at Goldman Sachs, one of the financial engineers whose mathematical models usurped traders' intuition on Wall Street. The reliance traders put on such quantitative analysis was catastrophic for the economy, setting off the series of financial crises that began to erupt in 2007 with the mortgage crisis and from which we're still recovering. Here Derman looks at why people--bankers in particular--still put so much faith in these models, and why it's a terrible mistake to do so.Though financial models imitate the style of physics by using the language of mathematics, ultimately they deal with human beings. Their similarity confuses the fundamental difference between the aims and possible achievements of the phsyics world and that of the financial world. When we make a model involving human beings, we are trying to force the ugly stepsister's foot into Cinderella's pretty glass slipper.  It doesn't fit without cutting off some of the essential parts. Physicists and economists have been too enthusiastic to recognize the limits of their equations in the sphere of human behavior--which of course is what economics is all about.  Models.Behaving.Badly. includes a personal account Derman's childhood encounter with failed models--the utopia of the kibbutz, his experience as a physicist on Wall Street, and a look at the models quants generated: the benefits they brought and the problems they caused. Derman takes a close look at what a model is, and then he highlights the differences between the success of modeling in physics and its relative failure in economics.  Describing the collapse of the subprime mortgage CDO market in 2007, Derman urges us to stop relying on these models where possible, and offers suggestions for mending these models where they might still do some good.  This is a fascinating, lyrical, and very human look behind the curtain at the intersection between mathematics and human nature.",
  "genres": [
    "Finance",
    "Economics",
    "Nonfiction",
    "Science",
    "Philosophy",
    "Business",
    "Mathematics"
  ],
  "author": "Emanuel Derman",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/12378134-models-behaving-badly"
}