{
  "title": "Upon the Flight of the Queen",
  "description": "\"A fast-paced adventure combined with an engrossing mystery, all set in a unique and original fantasy world. I can't wait to find out what happens next!\" --Martha Wells, Hugo Award-winning author on For the Killing of KingsIn this sequel to For the Killing of Kings, Howard Andrew Jones returns to the ring-sworn champions of the Altenerai in Upon the Flight of the Queen to continue this thrilling, imaginative and immersive epic fantasy trilogy.While the savage Naor clans prepare to march on the heart of the Allied Realms, Rylin infiltrates the highest of the enemy ranks to learn their secrets and free hundreds of doomed prisoners. His ailing mentor Varama leads the ever-dwindling Altenerai corps in a series of desperate strikes to cripple the Naor occupiers, hoping for a relief force that may not come in time to save what's left of the city and her charges.Elenai, Kyrkenall, and the kobalin Ortok ride through the storm-wracked Shifting Lands to rekindle an alliance with the ko'aye, the only possible counter to the terrible Naor dragons. Even if they survive the hazardous trek deep through kobalin territory to find the winged lizards, though, the three are unlikely to get a warm reception, for the queen of the five realms refused to aid the ko'aye when their homelands were attacked, and the creatures have long memories.While the Altenerai fight impossible odds to save the realms, their queen delves further and deeper into the magic of the mysterious hearthstones in a frantic attempt to unlock secrets that might just destroy them all.Praised for his skills in drafting modern epic fantasy that engrosses and entertains, Howard Andrew Jones delivers a sequel that expands the amazing world, relationships, and adventure introduced in the first book of this series.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Audiobook",
    "Magic"
  ],
  "author": "Howard Andrew Jones",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/43263411-upon-the-flight-of-the-queen"
}