{
  "title": "Abina and the Important Men: A Graphic History",
  "description": "Abina and the Important Men is a compelling and powerfully illustrated \"graphic history\" based on an 1876 court transcript of a West African woman named Abina, who was wrongfully enslaved and took her case to court. The book is a microhistory that does much more than simply depict an event in the past; it uses the power of illustration to convey important themes in world history and to reveal the processes by which history is made.The story of Abina Mansah--a woman \"without history\" who was wrongfully enslaved, escaped to British-controlled territory, and then took her former master to court--takes place in the complex world of the Gold Coast at the onset of late nineteenth-century colonialism. Slavery becomes a contested ground, as cultural practices collide with an emerging wage economy and British officials turn a blind eye to the presence of underpaid domestic workers in the households of African merchants. The main scenes of the story take place in the courtroom, where Abina strives to convince a series of \"important men\"--a British judge, two Euro-African attorneys, a wealthy African country \"gentleman,\" and a jury of local leaders--that her rights matter. \"Am I free?\" Abina inquires. Throughout both the court case and the flashbacks that dramatically depict her life in servitude, these men strive to \"silence\" Abina and to impose their own understandings and meanings upon her. The story seems to conclude with the short-term success of the \"important men,\" as Abina loses her case. But it doesn't end there: Abina is eventually redeemed. Her testimony is uncovered in the dusty archives by Trevor Getz and, through Liz Clarke's illustrations, becomes a graphic history read by people around the world. In this way, the reader takes an active part in the story along with the illustrator, the author, and Abina herself.Following the graphic history in Part I, Parts II-V provide detailed historical context for the story, a reading guide that reconstructs and deconstructs the methods used to interpret the story, and strategies for using Abina in various classroom settings.",
  "genres": [
    "History",
    "Graphic Novels",
    "Nonfiction",
    "Africa",
    "Comics",
    "School",
    "Read For School"
  ],
  "author": "Trevor R. Getz",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/12378687-abina-and-the-important-men"
}