{
  "title": "Face Food: Discover How Face Lifting Food Can Boost Your Collagen And Take Years Off Your Face Naturally",
  "description": "THE SUCCESS OF FACE FOOD BECAME A GLOBALLY ACCLAIMED TV SHOW SEE VISIBLE CHANGES TO YOUR SKIN IN AS LITTLE AS FIVE DAYS AND MAINTAIN THEM OVER A LIFETIME Gregory Landsman's book, Face Food shows you how you can reduce ﬁne lines and wrinkles; increase collagen and elastin production; ﬂush your face with vitality; change the quality and texture of your skin; increase ﬁrmness; and take years off your face naturally with the power of anti-aging foods. THE MOST POWERFUL ANTI-AGING AND SKIN STRENGTHENING INGREDIENTS CAN BE FOUND IN THE FOODS WE EAT With the right foods you can achieve younger looking skin by supporting the body's natural ability to eliminate and neutralise toxins - or detox and cleanse in other words, which ensures optimal skin functioning and collagen production - the foundation of healthy, youthful looking skin. LEARN HOW TO USE FOOD TO DETOX AND GET YOUNGER, HEALTHIER SKIN AT ANY AGE... Optimise the health of your skin with recipes YOU CAN TRANSFORM YOUR SKIN AT ANY AGE... DID YOU KNOW YOU CAN HELP 'SNAP BACK' SAGGING SKIN, REDUCE WRINKLES AND GET A HEALTHY GLOW WITH THE RIGHT FOODS? DISCOVER 101+ SKIN LIFTING FOOD SECRETS TO CREATE YOUR OWN DAILY YOUTH ENHANCING SKIN RECIPES Knowledge is power. This easy to read book delivers big skin results. The skin boosting shopping list shows you where to find more than 101 everyday food secrets to keep your skin looking its very best at any age. THE SUCCESS OF FACE FOOD BECAME A GLOBALLY ACCLAIMED TV SHOW Best selling author Gregory Landsman developed his TV sensation 'Face Lifting Food' from the book FACE FOOD. The show airs in in more than seventy countries worldwide and sits along side Jamie Oliver, Gordon Ramsay and Master Chef USA. Face Lifting Food is shown in Universities, used in Wellness Centres, endorsed by nutritionists and recommended by doctors. WITH FACE FOOD YOU CAN TRANSFORM THE QUALITY AND TEXTURE OF YOUR SKIN AND TAKE YEARS OFF YOUR FACE NATURALLY AT ANY AGE - SHOP NOW!",
  "genres": [],
  "author": "Dr Gregory Landsman",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/43289481-face-food"
}