{
  "title": "Point of Impact",
  "description": "Surviving the blast is only the beginning... Dakota Sloane, a tough-as-nails former foster kid, has spent her life running from the past. Logan Garcia, a man haunted by secrets, has only one to drink himself into oblivion. They're two strangers in a bar--until the news reports nuclear bombs in New York City and Washington, D.C. Fearing Miami may be next, Dakota's first thought is to grab her little sister--still trapped in the system--and get the hell out of Dodge. Then the world explodes. As buildings collapse and fires rage, utter chaos erupts. Trapped in the burning city, Logan and Dakota have less than ten minutes to seek shelter before the lethal cloud of fallout descends. But Dakota's sister is still out there. To rescue her, Dakota will need Logan's help, but can she trust him? And how far is she willing to go to save the only family she has left? Point of Impact is an apocalyptic survival thriller exploring what could happen if terrorists successfully executed a coordinated nuclear attack on the United States, told from the perspectives of regular people determined to survive. Featuring fast-paced action and strong, complex characters, the Nuclear Dawn series is perfect for fans of Logan Keys, Jacqueline Druga, Mike Kraus, and Boyd Craven. *Rated PG-13. Be aware of spoilers in the reviews if you don't like spoilers.* \"This is one wild rollercoaster ride with all the drama, intrigue, and action-packed, pulse-racing thrills that makes for one electrifying experience.\" -Amazon reviewer \"All the twists and turns along with a few unexpected surprises to keep you riveted to the pages and frozen to your seat. A fascinating read!\"-Goodreads reviewer \"Grabs you right from the start!\" -Amazon reviewer \"I really cared what happened to the characters and couldn't put the book down.\" -Amazon reviewer \"A fast-paced, action-filled story. Five stars.\" -Amazon reviewer \"Jabs at the readers heart fast and furiously like an underdog hell-bent on taking out the champ. Electrifying and Invigorating!\" -Amazon reviewer \"Full of excitement and adventure at every turn.\" -Amazon reviewer \"Grabbed me up at the get-go and never let up.\" -Amazon reviewer \"Strong heroine, mysterious reluctant hero. And lots of secrets to be unearthed. Five stars!\" -Amazon reviewer \"This post-apocalyptic story is filled with gripping thrills and interesting characters, don't be surprised if you have to take a break in order to get your breath back.\" -Amazon reviewer \"Awesome thriller with lots of nuances.\" -Goodreads reviewer",
  "genres": [
    "Post Apocalyptic",
    "Apocalyptic",
    "Dystopia",
    "Audiobook",
    "Survival",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Kyla Stone",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/43288746-point-of-impact"
}