{
  "title": "Nobody's Victim: Fighting Psychos, Stalkers, Pervs, and Trolls",
  "description": "Nobody's Victim is an unflinching look at a hidden world most people don't know exists--one of stalking, blackmail, and sexual violence, online and off--and the incredible story of how one lawyer, determined to fight back, turned her own hell into a revolution.   \"We are all a moment away from having our life overtaken by somebody hell-bent on our destruction.\" That grim reality--gleaned from personal experience and twenty years of trauma work--is a fundamental principle of Carrie Goldberg's cutting-edge victims' rights law firm.Riveting and an essential timely conversation-starter, Nobody's Victim invites readers to join Goldberg on the front lines of the war against sexual violence and privacy violations as she fights for revenge porn and sextortion laws; uncovers major Title IX violations; and sues the hell out of tech companies, schools, and powerful sexual predators. Her battleground is the courtroom; her crusade is to transform clients from victims into warriors.In gripping detail, Goldberg shares the diabolical ways her clients are attacked and how she, through her unique combination of advocacy, badass relentlessness, risk-taking, and client-empowerment, pursues justice for them all. There are stories about a woman whose ex-boyfriend made fake bomb threats in her name and caused a national panic; a fifteen-year-old girl who was sexually assaulted on school grounds and then suspended when she reported the attack; and a man whose ex-boyfriend used a dating app to send more than 1,200 men to ex's home and work for sex. With breathtaking honesty, Goldberg also shares her own shattering story about why she began her work and the uphill battle of building a business.While her clients are a diverse group--from every gender, sexual orientation, age, class, race, religion, occupation, and background--the offenders are not. They are highly predictable. Goldberg offers a taxonomy of the four types of offenders she encounters most often at her firm: assholes, psychos, pervs, and trolls. \"If we recognize the patterns of these perpetrators,\" she explains, \"we know how to fight back.\"Deeply personal yet achingly universal, Nobody's Victim  is a bold and much-needed analysis of victim protection in the internet era. It is an urgent warning of a coming crisis, a predictor of imminent danger, and a weapon to take back control and protect ourselves--both online and off.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "True Crime",
    "Politics",
    "Crime",
    "Psychology",
    "Adult"
  ],
  "author": "Carrie Goldberg",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/43289182-nobody-s-victim"
}