{
  "title": "Christmas at Highclere",
  "description": "Highclere Castle, known as 'the real Downton Abbey', bustles with activity at the best of times, but it is never more alive than at Christmas. Christmas at Highclere is a look behind the scenes at the routines and rituals that make the castle the most magical place to be throughout the festive season.Lady Carnarvon will guide you through Advent, Christmas preparations and Christmas Eve all the way through to the day itself, and beyond. Learn how the castle and grounds are transformed by decorations, including the raising of a twenty-foot tree in the saloon, the gathering of holly and mistletoe from the grounds. All the intricacies of the perfect traditional Christmas are here: from crackers and carol singers. The festive feeling is carried through to Highclere's Boxing Day traditions, the restorative middle days and the New Year's Eve celebrations.This book also tells the story of historic Christmases at Highclere – of distinguished guests warming themselves by the fire after a long journeys home through the snow, unexpected knocks on the door, and, always, the joy of bringing family – and staff – together after a busy year.As well as telling the stories of Highclere Christmases past and present, Lady Carnarvon provides recipes, tips and inspiration from her kitchen so that readers can bring a quintessentially British festive spirit to their own home. Lady Carnarvon divulges the secret to perfectly flakey mince pies, the proper way to wrap presents so that you and your guests are guaranteed a Christmas to remember.Lavish, celebratory and utterly enchanting, Christmas at Highclere is celebration of one of the UK's most beloved historic houses and is the perfect gift for any Downton Abbey fan.",
  "genres": [
    "Christmas",
    "Nonfiction",
    "History",
    "Cookbooks",
    "British Literature",
    "Cooking",
    "Food"
  ],
  "author": "Fiona Carnarvon",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/43268918-christmas-at-highclere"
}