{
  "title": "Face Fitness: The 10 Minute Face Lift - My Proven Facial Yoga Exercises and Massage for a Healthier Younger Face",
  "description": "IT'S NOT WRINKLES THAT CHANGE THE SHAPE OF THE FACE WITH AGE, BUT SAGGING FACIAL MUSCLES AND SKIN Unlike the rest of the body where muscles are attached to bones, facial muscles are attached directly to the skin. This means as muscles weaken, skin sags and the face drops. The only long term solution we have to fight gravity on our faces or our bodies is exercise. EVERY MAJOR MUSCLE ON THE FACE CAN BE SHAPED AND STRENGTHENED This book delivers proven, medically endorsed facial yoga exercises and facial massage techniques that I have shared with thousands of people to strengthen and lift the muscles on the face and take years off the face naturally. These techniques not only address wrinkles and sagging muscles, but work as a means of prevention as well. You are never too old or too young to start Face Fitness. QUICK FACIAL YOGA EXERCISES AND MASSAGE FOR A YOUNGER LOOKING FACE IN JUST 10 MINUTES A DAY! Discover how to strengthen facial muscles - tighten the neck and jawline; plump out forehead worry lines; eliminate and minimise lines around the mouth (lip lines); reduce jowls; tighten and tone cheeks; reduce eye wrinkles; and plump out under eye hollows. FACE FITNESS TECHNIQUES will improve collagen production naturally, increase moisture skin levels, reduce pore size and smooth out fine lines and the texture of the skin. You will also discover how to rub out fine lines as they appear. MY DE-STRESS & AGE LESS METHOD Based on ancient modalities, the techniques in Face Fitness are proven by science and endorsed by doctors. I have been using the Face Fitness techniques in my work with the beauty industry for decades and in my Geneva Treatment room with great results. Dr Jack Zourmaras, Specialist Plastic Surgeon \"In the same way that you exercise to tone your body, targeted exercising of the facial muscles with facial fitness will improve the tone of your face and minimise wrinkling. That's less than 10 minutes a day to improve the tone of your face.\" Sarah Stawell, Supermodel New York - \"I use Gregory Landsman's Face Fitness. Just 10 minutes a day. It's the best!\" Isabella Cowan, Vogue Supermodel - \"I have used Gregory Landsman's treatments and techniques for years. They are 100% natural and they work.\" Mitzi Kanizanec, Head artist, Dior - \"I have used Gregory's method personally and shared it professionally for more than 10 years. It is simple to do and keeps the face looking healthy and vital.\" LOOKING AFTER OUR SKIN IS EASIER THAN WE HAVE BEEN LED TO BELIEVE So regardless of your age, your level of stress or whether you have had a face lift or not, Face Fitness will help you regain and retain strong facial muscles that will support the skin to stay firm and healthy. FACE FITNESS IS QUICK and EFFECTIVE - all it takes is 10 minutes a day to a younger, healthier looking face- BUY NOW",
  "genres": [],
  "author": "Dr Gregory Landsman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43289482-face-fitness"
}