{
  "title": "The Lager Queen of Minnesota",
  "description": "A National Bestseller! \n\"The perfect pick-me-up on a hot summer day.\" --Washington Post \"[A] charmer of a tale. . . Warm, witty and--like any good craft beer--complex, the saga delivers a subtly feminist and wholly life-affirming message.\"\n--People Magazine\n A novel of family, Midwestern values, hard work, fate and the secrets of making a world-class beer, from the bestselling author of Kitchens of the Great MidwestTwo sisters, one farm. A family is split when their father leaves their shared inheritance entirely to Helen, his younger daughter. Despite baking award-winning pies at the local nursing home, her older sister, Edith, struggles to make what most people would call a living. So she can't help wondering what her life would have been like with even a portion of the farm money her sister kept for herself.With the proceeds from the farm, Helen builds one of the most successful light breweries in the country, and makes their company motto ubiquitous: \"Drink lots. It's Blotz.\" Where Edith has a heart as big as Minnesota, Helen's is as rigid as a steel keg. Yet one day, Helen will find she needs some help herself, and she could find a potential savior close to home. . . if it's not too late.Meanwhile, Edith's granddaughter, Diana, grows up knowing that the real world requires a tougher constitution than her grandmother possesses. She earns a shot at learning the IPA business from the ground up--will that change their fortunes forever, and perhaps reunite her splintered family?Here we meet a cast of lovable, funny, quintessentially American characters eager to make their mark in a world that's often stacked against them. In this deeply affecting family saga, resolution can take generations, but when it finally comes, we're surprised, moved, and delighted.",
  "genres": [
    "Fiction",
    "Book Club",
    "Audiobook",
    "Contemporary",
    "Food",
    "Family",
    "Adult Fiction"
  ],
  "author": "J. Ryan Stradal",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/43266426-the-lager-queen-of-minnesota"
}