{
  "title": "The 1933 Chicago World's Fair: A Century of Progress",
  "description": "Chicago's 1933 world's fair set a new direction for international expositions. Earlier fairs had exhibited technological advances, but Chicago's fair organizers used the very idea of progress to buoy national optimism during the Depression's darkest years. Orchestrated by business leaders and engineers, almost all former military men, the fair reflected a business-military-engineering model that envisioned a promising future through science and technology's application to everyday life. Fair organizers, together with corporate leaders, believed that progress rides on the tide of technological innovation and consumerism. But not all those who struggled for a voice at Chicago's 1933 exposition had abandoned the traditional notions of progress that entailed social justice and equality, recognition of ethnic and gender-related accomplishments, and personal freedom and expression. The stark pronouncement of the fair's motto, \"Science Finds, Industry Applies, Man Conforms,\" was challenged by iconoclasts such as Sally Rand, whose provocative fan dance became a persistent symbol of the fair, as well as a handful of others, including African Americans, ethnic populations and foreign nationals, groups of working women, and even well-heeled socialites. They all met obstacles but ultimately introduced personal, social definitions of \"progress\" and thereby influenced the ways the fair took shape. In this engaging social and cultural history, Cheryl R. Ganz examines Chicago's second world's fair through the lenses of technology, ethnicity, and gender. The book also features eighty-six photographs--nearly half of which are full color--of key locations, exhibits, and people, as well as authentic ticket stubs, postcards, pamphlets, posters, and other items. From fan dancers to fan belts,  The 1933 Chicago World's A Century of Progress  offers the compelling, untold stories of fair planners and participants who showcased education, industry, and entertainment to sell optimism during the depths of the Great Depression.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Cheryl R. Ganz",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/4331102-the-1933-chicago-world-s-fair"
}