{
  "title": "A Mutual Addiction",
  "description": "“Emotional, eerie, and delightfully demented, A Mutual Addiction worms its way into your psyche and refuses to relent until the final breathtaking page.” - Meghan O’Flynn, Best-selling author of The Ash Park series.  The doctors called it aphantasia, but Cressida called it slow, torturous emptiness…  It has been 3,684 days since the accident and as many nights since Cressida Dunhill last dreamed. Three years ago she moved to the sleepy coastal town of Silverside, Oregon to escape her bloody past, but now she’s drowning in its tedium. A psychologist specializing in dream analysis, Cressida spends her days pretending to care about the nightmares of fishermen and burnouts in a former mental institution grimly nicknamed “The Mermaid Asylum.” Yet she is condemned to spend her own nights in a dreamless fugue, more like death than sleep.  Until the day she meets Vee, a water nymph of a girl who splashes color into Cressida’s dull life. And that night, after ten years of emptiness, Cressida suddenly dreams again.  But are Cressida’s dreams and Vee’s appearance in her life linked? As Cressida searches for answers to her abrupt recovery, the rigid boundaries that have protected Cressida for so long break down and the women become fast friends. Perhaps too fast. And when Vee shows up to an appointment covered in bruises, Cressida begins to suspect that Vee's two-timing, musician boyfriend, Rex, could pose a threat to both Vee's future and Cressida's future dreams.  Only she can protect them both.  Dark and atmospheric, A Mutual Addiction is a psychological journey that traces the fine line between morbid fascination and dangerous obsession, and offers an unsettling glimpse into the depths of desperation and how far someone is willing to go to protect their dreams. Widdicks’ haunting debut is HBO’s In Treatment meets Patricia Highsmith’s The Talented Mr. Ripley, but with women as both protagonist and villain.  If you’re a fan of suspense masters like Caroline Kepnes and Gillian Flynn, you’ll be dreaming about A Mutual Addiction long after you finish.",
  "genres": [],
  "author": "Mary Widdicks",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/43300232-a-mutual-addiction"
}