{
  "title": "Outcrossing",
  "description": "Enjoy this kind and gentle 1920s historical fantasy romance series set in the magical community of Great Britain.\n\nFerry found freedom as a governess.\nBorn and raised to be an obedient daughter of the upper class, Ferry refused to marry the awful man her parents chose for her. Instead, she took a position as a governess in a country house deep in the New Forest.Now spring has come to England, she can finally spend time in the nearest village and explore the magical, mysterious, and possibly dangerous forest around her chosen home.Rufus has great power and no future.The Great War changed everything for the worse. Rufus came home terrified of being buried alive and without the magical training he desperately needed. Now he's lost all of his family and any hope of building a better life.Rufus is down to his last few coins when he saves one of Ferry's charges from a cranky New Forest pony. She's grateful, but she's also kind, the first kindness he's known in weeks.When a local smuggler offers him a lifechanging amount of money to do just one job, he knows there must be a catch. But it's the only way to have a future, never mind one with Ferry. She comes from a different world, and Rufus has the sense to know it.When the smuggler's demands, interference from the newly returned local lord, and the remaining scars from World War I all tangle together, Rufus and Ferry find themselves in grave danger.Outcrossing is the first novel in the Mysterious Charm series. All of Celia Lake's Albion books exploring the magical community of the British Isles can be read in any order. Full of magical creatures, New Forest ponies, village life, and first love, Outcrossing is a gentle romantic fantasy with a swirl of sex set in 1922 with a happily ever after ending. Enjoy!",
  "genres": [
    "Romance",
    "Fantasy",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Historical Fantasy",
    "Paranormal"
  ],
  "author": "Celia Lake",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/43305239-outcrossing"
}