{
  "title": "It Rains in February: A Wife's Memoir of Love and Loss",
  "description": "On the 24th of February 2007 my husband, Stuart, drowned himself at sea, leaving me widowed with two young daughters aged six and four. I knew it wasn't an accident, even though the medics and police never suspected suicide. Stuart had been talking about ending his life for a year. His most recent suicide attempt had been only three weeks earlier. Afterwards, he explained that day as the most peaceful day of his life. Sitting next to the dam, he smoked his last cigarette. He drank a hundred sleeping pills and did a final check to make sure everything would look like an accident. The last thing he remembered was swimming out into the crystal clear water. He said that he was no longer scared of dying, that there was nothing scary about it. Living was the scary thing.It Rains in February: A Wife's Memoir of Love and Loss is the true story of a husband's depression and obsession, not only with another woman but also with ending his life. In this honest and heartfelt narrative, Leila Summers weaves a compelling tale of the year that led up to Stuart's suicide and the grief, profound loss and self-discovery that followed. Although each suicide is unique, this book gives the reader an insider's view from one perspective by way of authentic letters and email messages.This book deals with the subject matter of extramarital affairs, depression, suicide, death, grief, bereavement, loss and coping with death and young children. It may be helpful to those who have experienced a suicide in the family, the loss of a loved one to suicide, or those who are dealing with depression or the depression of a loved one. It is not meant to offer any form of advice and is based solely upon the author's personal experience.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Psychology",
    "Biography",
    "Autobiography",
    "Mental Illness",
    "Death"
  ],
  "author": "Leila Summers",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/12379256-it-rains-in-february"
}