{
  "title": "Jordan and the Dancing Hippo: Rhyming Picture Book for Beginners and Early Readers",
  "description": "A charming full-spread picture book for children. Suitable for ages 2 to 6 (early readers and pre-schoolers), this book helps improve reading skills. The gorgeous illustrations on each page are truly engaging and will help spark a child’s imagination. The story, told in rhyme, is also fun to read aloud, making it perfect for bedtime. To provide an enhanced reading experience, the paperback and hardcover formats also include essential reading tips for parents, teacher and carers. PLOT It’s the night before Jordan’s birthday and he cannot wait to see his birthday presents. He enters a magical world of daydreams where anything he imagines, he becomes. Together with his friends, he has the most fun playing with toys and building the most sophisticated things. He learns an important lesson when he wakes up and his birthday doesn’t quite turn out the way he expected. ABOUT THE AUTHOR Jo Kusi is a London based author who has been creating stories from the very tender age of eleven. After many years as a management consultant in corporate Britain, Jo now pursues his dream of authoring children’s books. Being born in West Africa, in a home where storytelling was customary, had a lasting impression on Jo who now draws inspiration from the many stories he was told as a child. He has now authored dozens of short pieces, poems and stage plays. His true passion is for children’s books, with ‘Jordan and the Dancing Hippo’ being his debut publication. Having worked with children for years, Jo uses a unique writing style that makes it easy for children to learn to read while stirring up their imagination. When Jo is not writing, he is dreaming up another new exciting story or spending time with his family of three.",
  "genres": [],
  "author": "Jo Kusi",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/43303421-jordan-and-the-dancing-hippo"
}