{
  "title": "Feeling Groovy: How Sensitive People Find Meaning, the Confidence to Express Themselves and Create Fulfilling Lives",
  "description": "Discover how to make a stressful job meaningful and enjoyable, how to manage a difficult boss, how to break free from the restrictions of your current life and free yourself to express who you really are. Here one of the world’s top self-realisation coaches will guide you along the road to a rewarding life by asking you simple, yet revealing questions and telling you stories.Feeling Groovy is a happy and positive sweet spot where you feel constantly relaxed, liberated, chilled out, all is well with the world. You feel cheerful, devil-may-care, reckless even but, at the same time, confident that anything you do will have a good outcome. When you’re Feeling Groovy you have a strong sense of direction. You have a deep inner knowing that what you are doing is meaningful, not just for yourself, but also for other people. You know, at a deep level, how you do it. You have feelings of purpose and certainty.When you’re Feeling Groovy you have unstoppable energy that is seeking an outlet. You want to go out and greet the world, to spread your good feelings to others. You’re just letting it happen for you, in your own way. When you’re Feeling Groovy you challenge the world to give you excitement and stimulation. You’re up for challenges. You know you can win. Think Usain Bolt.“David's coaching was a life changing experience which produced profound effects in both my work and personal life. David understands people very well, particularly the workings of the human mind, and is able to explain your emotions and help you control them whilst giving you the confidence and direction to achieve your goals.” Bob Stark, Commercial Director, PortafinaEveryone who want to enjoy a happy and rewarding life should read this book and keep it on their bookshelf for constant reference.",
  "genres": [],
  "author": "David Ferrers",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/43306030-feeling-groovy"
}