{
  "title": "The Fifth Survivor: Episode 1",
  "description": "ZOMBIES AND BACON RULE! The series where the worlds of Charles Bronson and Resident Evil combine into an episodic book series! Who says old men can't be badass vigilantes? A middle-aged journalist turned vigilante will show he can kick some serious zombie butt and save the friggin world while maintaining his unhealthy bacon obsession. Sign in and see if you survive the nightmare. On July 7th, 2007 the first ever zombie outbreak took place in Brooklyn, NY. Four survivors were able to escape and live through the horrors. These survivors included Angel, Maria, Luis, and Joe. While most literature will say there were four survivors that survived that fateful day, there was one survivor that was never spotted or even mentioned. He will always be known as the unknown survivor of the first outbreak. This survivor is known as George Fisher and he knows the ins and outs of Hybrid. Behind the secret cloak of his job as a janitor, he intends to expose Hybrid for their misdeeds from the inside out. This secret survivor would rather be referenced as the “The Fifth Survivor.” Join George in his survival horror adventure. This is episode 1 in what will be a serial release that will have a new episode every month or so. George learns more about the giant pharmaceutical company, The Hybrid Corporation. With its checkered past, he becomes suspicious about their real intentions when they decide they want to build a substation in his hometown of Cypress Hills. Deciding to make the dangerous decision to probe Hybrid without permission, George will sneak into a construction site, the Hybrid HQ, and sneak into a meeting in the hospital. What he doesn't know is that when he decides to sneak into the hospital meeting, the Raven Hawk virus has already been released. With the hospital infected with zombies and other biohazard creatures, will he escape to continue his probe? Or has he gotten his foot in too deep into a rat trap that threatens mankind? See the New World Order plot through the eyes of the journalist known as, \"The Fish Master\". This is a gamelit set in the real world, so it's all real, even the zombies!",
  "genres": [],
  "author": "Angel Ramon",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/43301626-the-fifth-survivor"
}