{
  "title": "Flashfyre",
  "description": "Flashfyre, a rare Stravin Hybrid, and the Tredecim Empire’s most deadly assassin is infected with a deadly virus by his enemies. It is up to one of the Empire’s Healer’s, Blaise, to cure Flash, before it’s too late. Captain Flashfyre Marrok’s life has been dealing death for more years than he cares to remember. His rare silver eyes allow him to interact deep behind enemy lines with impunity. Suffering from PTSD, he decides to quit the life forced on him through his overinflated feelings of loyalty. On his return from his last mission, he is attacked and contracts a deadly pathogen. With his rare genetic makeup, there is only one man in the Empire that has a chance at curing him. Blaise Verbena is the heir to the House of Healers, and the only virologist that has studied Stravin Hybrids. He is immediately tapped to travel to the front-lines in the Empire’s war with the Stravin to cure the most deadly man in the Empire. Fighting his claustrophobia every step of the way, Blaise is desperate to cure the scary, yet gorgeous assassin. They must both confront the tragedies in their pasts as well as an assassin bent on Flash’s destruction while trapped together on a space station. If the assassin can’t kill Flash, Blaise is the next best target. Welcome to the Tredecim Domos Empire. One Thousand years after fleeing Earth, thirteen houses formed the basis of their government to under a simple principle, \"Thirteen Houses to Protect the Individual Rights of All”. The first in a new epic Science Fiction Series, the Tredecim Domos Empire Series is created on the premise that love is love. It will feature not only LGBT romance stories, but traditional MF pairings as well. Get ready for a trip to the stars that is out of this world. (No literally.) Flashfyre is a 53k word story in the Tredecim Domos Empire Series. It is intended for mature audiences 18+ for sexual content between two consenting males. If this is offensive to you, then please do not purchase this book.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "Military Fiction",
    "Aliens"
  ],
  "author": "Jordan Black",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/43311668-flashfyre"
}