{
  "title": "The Second Home",
  "description": "Some places never leave you...\nAfter a disastrous summer spent at her family’s home on Cape Cod when she is seventeen, Ann Gordon is very happy to never visit Wellfleet again. If only she’d stayed in Wisconsin, she might never have met Anthony Shaw, and she would have held onto the future she’d so carefully planned for herself. Instead, Ann ends up harboring a devastating secret that strains her relationship with her parents, sends her sister Poppy to every corner of the world chasing waves (and her next fling), and leaves her adopted brother Michael estranged from the family. Now, fifteen years later, her parents have died, and Ann and Poppy are left to decide the fate of the beach house that’s been in the Gordon family for generations. For Ann, the once-beloved house is forever tainted with bad memories. And while Poppy loves the old saltbox on Drummer Cove, owning a house means settling, and she’s not sure she’s ready to stay in one place.Just when the sisters decide to sell, Michael re-enters their lives with a legitimate claim to a third of the estate. He wants the house. But more than that, he wants to set the record straight about what happened that long-ago summer that changed all of their lives forever. As the siblings reunite after years apart, their old secrets and lies, longings and losses, are pulled to the surface. Is the house the one thing that can still bring them together––or will it tear them apart, once and for all?Told through the shifting perspectives of Ann, Poppy, and Michael, this assured and affecting debut captures the ache of nostalgia for summers past and the powerful draw of the places we return to again and again. It is about second homes, second families, and second chances. Tender and compassionate, incisive and heartbreaking, Christina Clancy's The Second Home is the story of a family you'll quickly fall in love with, and won't soon forget.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Romance",
    "Family",
    "Audiobook",
    "Literary Fiction",
    "Adult Fiction"
  ],
  "author": "Christina Clancy",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/43312830-the-second-home"
}