{
  "title": "Ball Drop",
  "description": "Young, cocky, and all alpha, he wants the one man he can't have.  Rough around the edges and just a tad aggressive, twenty-year-old Maddox has more testosterone than he knows what to do with. He’s an alpha tiger shifter and the town’s rich, pretty boy with a chip on his shoulder to match. The circle of people he cares for is more of a dot, occupied by a single man, his college track and field coach, Wesley.  Closer to forty than he’d like to admit, Wesley is the gorilla omega who never quite found the one to settle down with. Not for lack of trying on his parent’s part. They can’t stop setting him up. Sometimes, they even try to trap him. Like when they stole his heat suppressors right before a date, hoping it would drive him into the man of their dreams.  But Wesley retreats to the one spot he knows he can be alone over the weekend while he rides out his heat. He sets up camp in his office on campus, ready to endure another torturous heat without relief.  Except, his plan to ride it out alone is ruined when Maddox breaks into the school on his own agenda. That agenda is quickly derailed when he stumbles upon his coach in need. Coach makes Maddox feel like maybe he isn’t just the town’s asshole. He’s an alpha. Wesley’s alpha.  While Maddox strives to be the type of man Wesley would want to obey, his conniving, abusive father has hatched a plan that threatens to ruin everything. With the holidays swirling around them, and the new year looming, finding their kiss at midnight seems impossible but Maddox didn’t work this hard discovering his home in Wesley to give up now.  Ball Drop is the second installment in the Welcome to Morningwood Omegaverse Romance series. It can be read as a standalone, though would be better enjoyed in order. It features themes of a school-based, age gap romance centered in a small town occupied entirely by shifters.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Omegaverse",
    "Fantasy",
    "LGBT"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/43313186-ball-drop"
}