{
  "title": "On Chapel Sands: The Mystery of My Mother's Disappearance as a Child",
  "description": "NOMINATED FOR THE 2019 NATIONAL BOOK CRITICS CIRCLE AWARD FOR AUTOBIOGRAPHY\n \nONE OF NPR'S BEST BOOKS OF THE YEAR\n \nSHORTLISTED FOR THE BAILLIE GIFFORD PRIZE FOR NONFICTION\n \nSHORTLISTED FOR THE RATHBONES FOLIO PRIZE\n \nLONGLISTED FOR THE RSL ONDAATJE PRIZE\n The acclaimed New York Times bestselling author of The Vanishing Velazquez shares a riveting true story “with as many twists and turns as any mystery” (Los Angeles Times) describing her mother’s mysterious kidnapping as a toddler in a small English coastal village—“an incredible and incredibly unusual book about family secrets” (Nick Hornby, The Believer).In the fall of 1929, when Laura Cumming’s mother was three years old, she was kidnapped from a beach on the Lincolnshire coast of England. There were no screams when she was taken, suggesting the culprit was someone familiar to her, and when she turned up again in a nearby village several days later, she was happy and in perfect health. No one was ever accused of a crime. The incident quickly faded from her memory, and her parents never discussed it. To the contrary, they deliberately hid it from her, and she did not learn of it for half a century. This was not the only secret her parents kept from her. For many years, while raising her in draconian isolation and protectiveness, they also hid the fact that she’d been adopted, and that shortly after the kidnapping, her name was changed from Grace to Betty. “Both page-turning and richly absorbing” (The Providence Journal), On Chapel Sands (originally titled Five Days Gone) unspools the tale of Cumming’s mother’s life and unravels the multiple mysteries at its core. Using photographs from the time, historical documents, and works of art, Cumming investigates this case of stolen identity w​ith the toolset of a detective and the unique intimacy of a daughter trying to understand her family’s past and its legacies. “Brilliant” (The Guardian) and “a story told with such depth of feeling and observation and such lyrical writing I couldn’t put it down” (Anna Quindlen), On Chapel Sands is a masterful blend of memoir and history, an extraordinary personal narrative unlike any other.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "True Crime",
    "Mystery",
    "Book Club",
    "Audiobook"
  ],
  "author": "Laura Cumming",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/43320234-on-chapel-sands"
}