{
  "title": "The Overflowing Brain: Information Overload and the Limits of Working Memory",
  "description": "As the pace of technological change accelerates, we are increasingly experiencing a state of information overload. Statistics show that we are interrupted every three minutes during the course of the work day. Multitasking between email, cell-phone, text messages, and four or five websites while listening to an iPod forces the brain to process more and more informaton at greater and greater speeds. And yet the human brain has hardly changed in the last 40,000 years. Are all these high-tech advances overtaxing our Stone-Age brains or is the constant flood of information good for us, giving our brains the daily exercise they seem to crave?In The Overflowing Brain, cognitive scientist Torkel Klingberg takes us on a journey into the limits and possibilities of the brain. He suggests that we should acknowledge and embrace our desire for information and mental challenges, but try to find a balance between demand and capacity. Klingberg explores the cognitive demands, or \"complexity,\" of everyday life and how the brain tries to meet them. He identifies different types of attention, such as stimulus-driven and controlled attention, but focuses chiefly on \"working memory,\" our capacity to keep information in mind for short periods of time. Dr Klingberg asserts that working memory capacity - long thought to be static and hardwired in the brain - can be improved by training, and that the increasing demands on working memory may actually have a constructive effect: as demands on the human brain increase, so does its capacity.The book ends with a discussion of the future of brain development and how we can best handle information overload in our everyday lives. Klingberg suggests how we might find a balance between demand and capacity and move from feeling overwhelmed to deeply engaged.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Neuroscience",
    "Science",
    "Education",
    "Self Help",
    "Brain"
  ],
  "author": "Torkel Klingberg",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/4332210-the-overflowing-brain"
}