{
  "title": "Rain Flower:",
  "description": "Williams was a thirty years aged clever, rich and educated businessman. Something he had seen in their old palace made him lost his mental balance. He became mild mad, just remained staring ahead blankly. He had been admitted in Black Ant Mental Care where he was entrusted to Rose who was the practicing psychiatrist there. Rose could make Williams to come to his senses but he forgot everything that happened before that incident. Rose and her senior Charles strongly opined, forcing Williams to remember either that particular incident he had seen in the old palace or about his past before that incident would have serious damaging consequences to him. Therefore preference has been given only to keep Williams mental balance. During the treatment Rose and Williams fall in love and Rose later became Williams' wife. But Williams was not completely out of his problem. Rose herself knew and warned by her senior Charles also, if ever Williams remembered that particular incident he had seen in their old palace it sure would have very serious effect on him. As there was constant threat of Williams remembering that particular incident at any moment and Williams suffering periodical mental imbalance, Rose sacrificed her career and devoted herself to her husband. As the time gone by, a situation has come that Rose has to make Williams to remember that particular incident and by putting him in deep hypnosis Rose made him to remember it. It made him remembered all of his past also. But as Rose worried, as feared all the while, it had the expected effect on him. But Rose could save her husband, saved his mental balance, saved her marriage and proved herself to be a perfect psychiatrist and a wonderful wife. A spicy Romantic Thriller with 55,851 Words. Ten romantic and suspense thrillers of this author, ‘A Mansion Of Illusions’, ‘Across The River…Under The Bridge…’, ‘Chasing Butterflies’, ‘Rain Flower’, ‘Mystery Behind Suicide’, ‘The Village, Forest And An Old Mansion’ ‘Lovenest’, ‘Moonshine’, ‘Scarecrow’ and ‘Enna’ are available as ebooks on all Amazon websites.",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/43327079-rain-flower"
}