{
  "title": "If Everyone Wrote a Poem: Selected Poems by and for Curious Minds",
  "description": "If Everyone Wrote a Selected Poems by and for Curious Minds is really an amazing collection of simple yet rich poems, all written and illustrated by two eager poets, at the young age of 11 and 6.In this poetry book, tag along with dinosaurs while learning their looks and traits, zoom around in space as you learn the planets, discover the many things that the year brings, imagine what the world would be like if everyone wrote a poem, and much more!Join the poets as they laugh and smile their way through poetry, to discover themselves as well as to seek the world’s greatest core. About the AuthorsHello! We are Sophia Zhang (aged 11) and Collin Zhang (aged 6), two kid poets who love to read and write poetry! We hope you can find your favorite poem(s) in this collection!Sophia ZhangOnce dreaming to become a dolphin trainer, now aspired to become an astrophysicist, this poet is a fan of the book series Harry Potter, The Land of Stories, and The Penderwicks. Feeling impelled to practice Chopin pieces in the dark, Sophia identifies a unique way of redirecting bursts of surplus energy to streams of meaningful creations, such as poetry speed-writing as well as creating fantasy stories and digital artwork. At age 11, Sophia feels so blessed and cheerful that she “figures out” a creative way to discipline her emotions. She once wondered what would happen if everyone wrote a poem -- would each of us feel differently, become more content and forgiving, or simply more gentle or joyous?Collin Zhang LEGO means the WORLD to him! The same as DINOSAURS! A talented young piano performer, Collin enjoys performing Nuvole Bianche and Flood Time for the crowd. This poet dreams to become a paleontologist and then an architect on earth…and…IN SPACE! Loving to read Dr. Seuss, Berenstain Bears, Little Critter, and Laugh-Out-Loud joke collections, at age 6, Collin is two chapters into writing his very own Pokemon chapter book series. Just like playing by ear is how he memorizes long piano pieces, rhyming and writing poetry make him feel in the “zone!”",
  "genres": [
    "Poetry"
  ],
  "author": "Sophia Zhang",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43319278-if-everyone-wrote-a-poem"
}