{
  "title": "Lovenest:",
  "description": "Jasmine was a twenty two years young girl who loved her father Richard and sister Rose a lot. Her acquaintance with Micheal was indeed a very longtime back and her love with him also was not recent. Jasmine loved and liked Micheal also as much as she loved and liked her father and her sister. But when she came to know through her father that Micheal started insulting and torturing her father who was working in their company, Jasmine started disliking Micheal. But when she mistaken that her father got the heart attack and died because of Micheal’s rough treatment, that disliking turned into strong hate and rancor and her love on Micheal was immediately evaporated.From here the testing time was started for Micheal. His insulting and yelling on Jasmine’s father was just impulsive and not intentional at all. Then Micheal with the help of his friend Stuart and Jasmine friend Lucy without the knowledge of Jasmine made her join in a company. Later Jasmine managed her life so happily with her sister until the moment she came to know that Micheal was behind in her getting the job. Then Jasmine immediately resigned to that job and not just came out of that company but from the comfortable living also. Micheal’s attempts to make her join in that job again only made her anger and hate on Micheal just more and more. Micheal indeed had to make more and more efforts to make Jasmine realize the truth.Love won in the end and Micheal and Jasmine were the happiest couple once again. A Romantic Thriller with 50,831 words.Along with this ebook, the other romantic and suspense thrillers of this author, ‘A Mansion Of Illusions’, ‘Across The River…Under The Bridge…’, ‘Chasing Butterflies’, ‘Rain Flower’, ‘Nirupama’, ‘A Village, A Forest And An Old Mansion’ ‘Moonshine’, ‘Scarecrow’ ‘Enna (Her life….her love…..her struggle) ’, 'Sand Dunes (A collection of eight short stories)' ‘Rose Garden’ and ‘Amaswitha’ (Sex, Psychology And Supernatural) along with two non-fiction books ‘Body Mind And You’ and ‘English Grammar Simplifier’ are also available as ebooks only on Amazon.",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/43326660-lovenest"
}