{
  "title": "Nirupama:",
  "description": "Nirupama……. A twenty two years aged girl………… Beautiful, clever, intelligent and student of post-graduation in psychology……… On one day morning found dead by hanging to the ceiling fan in her bedroom which incident made her mother partly mad……….. Post mortem conducted on the body, police investigated the matter and concluded the same as simply suicide……. No love failure, no financial problems, no unbearable diseases, nothing was discovered that could lead a girl like her to commit suicide….. Her father Ranganath firmly believed that there was a strong reason which compelled his daughter to commit suicide and he decided to know the same at any cost and hired the detective Smaran to do that. Detective Smaran and his niece Menaka put themselves whole heartedly into the job to know about the secret that led Nirupama to commit suicide….. But neither Smaran, nor his niece Menaka, nor Ranganath understood the severity of the said secret until it claimed another two lives…. A Suicide Investigation ThrillerThe twenty one romantic and suspense thrillers of this author ‘A Mansion Of Illusions (1,17,731 Words)’, ‘A village, a forest and an old mansion (1,13,049 Words)’, ‘Chasing butterflies (1,11,211 Words)’ ‘Across the river…under the bridge (1,02,739 Words)’, ‘Enna (1,03,119 Words)’ ‘Strawberry (1,11,700 Words)’ ‘Amaswitha (1,51,618 Words)’, ‘Sasikala (1,09,423 Words)’ ‘Just Relax! (1,15,793 Words)’, ‘ House of Delusions (1,18,530 Words)’ ‘Half Opened Doors (1,23,600 words)’ ‘Lovenest (50,565 Words)’, ‘Moonshine (51,427 Words)’ ‘Nirupama (51,675 Words)’, ‘Scarecrow (52,226 Words)’ ‘Rose Garden (62, 284 Words)’, ‘Dusk (53,856 Words)’, ‘Rain Flower (53,139 Words)’ ‘rustle In The leaves (3,52,000 words) and ‘Snow Flower’ (2,15,200 words), Wisps Of Smoke (3,20,500 words) along with a short stories book ‘Sand Dunes (24,973 Words) and two non-fiction books ‘Body, Mind And You (16,533 Words)’ and ‘English Grammar Simplifier (18,436 Words)’ are available as ebooks and paperbacks only on Amazon websites. The total of word count of all these books is more than 25,00,000 (Twenty Five Lakhs words).",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/43327134-nirupama"
}