{
  "title": "Death in Focus",
  "description": "In the start of an all-new mystery series set in pre–World War II Europe, an intrepid young photographer carries her dead lover’s final, world-shattering message into the heart of Berlin as Hitler ascends to power.“Thrilling . . . reminiscent of works by Eric Ambler and Graham Greene.”—The Wall Street Journal On vacation from London on the beautiful Italian coast, twenty-eight-year-old Elena Standish and her older sister, Margot, have finally been able to move on from the lasting trauma of the Great War, in which the newly married Margot lost her husband and the sisters their beloved brother. Touring with her camera in hand, Elena has found new inspiration in the striking Italian landscape, and she’s met an equally striking man named Ian. When Ian has to leave unexpectedly, Elena—usually the more practical of the sisters—finds she’s not ready to part from him, and the two share a spontaneous train trip home to England. But a shocking sequence of events disrupts their itinerary, forcing Elena to personally deliver a message to Berlin on Ian’s behalf, one that could change the fate of Europe. Back home, Elena’s diplomat father and her secretive grandfather—once head of MI6, unbeknownst to his family—are involved in their own international machinations. Worried when Elena still hasn’t returned from Italy, her grandfather starts to connect the dots between her change in plans and an incident in Berlin, where Adolf Hitler and the Third Reich are on the rise. It seems the message Elena delivered has forced her into a dangerous predicament, and her grandfather’s old contacts from MI6 may be the only people who can get her out alive—if Elena can tell the difference between her allies and her enemies. New York Times bestselling author Anne Perry merges family secrets with suspense on the world stage, as darkness bubbles under the surface of a Europe on the brink of change. In these complicated times, Elena emerges as a strong new heroine who learns quickly that when nothing is certain, she can rely only on herself.Praise for Death in Focus   “Masterful! It’s exceedingly rare for an author to have the talent to blend classic elements of a thriller with compelling family dynamics and geopolitical intrigue, but Anne Perry pulls it off like the consummate pro that she is. And, on top of all that, Death in Focus is written in her unique literary voice. I guarantee you’ll love Elena Standish. Brava!” —Jeffery Deaver, author of The Never Game",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical Mystery",
    "Historical",
    "Audiobook",
    "Thriller"
  ],
  "author": "Anne Perry",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/43322948-death-in-focus"
}