{
  "title": "From the Corner of the Oval: A Memoir",
  "description": "NEW YORK TIMES BESTSELLER - \"[This] breezy page turner is essentially Bridget Jones goes to the White House.\"--\nThe New York Times\n \"Obama administration memoirs are rolling in, but in a refreshing twist From the Corner of the Oval swaps policy for good old-fashioned workplace drama.\"--Entertainment WeeklyNAMED ONE OF THE BEST BOOKS OF THE YEAR BY theSkimm - Refinery29 - Bustle In 2012, Beck Dorey-Stein is working five part-time jobs and just scraping by when a posting on Craigslist lands her, improbably, in the Oval Office as one of Barack Obama's stenographers. The ultimate D.C. outsider, she joins the elite team who accompany the president wherever he goes, recorder and mic in hand. On whirlwind trips across time zones, Beck forges friendships with a dynamic group of fellow travelers--young men and women who, like her, leave their real lives behind to hop aboard Air Force One in service of the president.As she learns to navigate White House protocols and more than once runs afoul of the hierarchy, Beck becomes romantically entangled with a consummate D.C. insider, and suddenly the political becomes all too personal.Against the backdrop of glamour, drama, and intrigue, this is the story of a young woman making unlikely friendships, getting her heart broken, learning what truly matters, and, in the process, discovering her voice.Praise for \nFrom the Corner of the Oval\n\"Who knew the West Wing could be so sexy? Beck Dorey-Stein's unparalleled access is obvious on every page, along with her knife-sharp humor. I tore through the entire book on a four-hour flight and loved reading all about the brilliant yet hard-partying people who once surrounded the leader of the free world. Lots of books claim to give real insider glimpses, but this one actually delivers.\"--Lauren Weisberger, author of The Devil Wears Prada\"Dorey-Stein . . . writes with wit and self-deprecating humor.\"--The Wall Street Journal\"Addictively readable . . . Dorey-Stein's spunk and her sparkling, crackling prose had me cheering for her through each adventure. . . . She never loses her starry-eyed optimism, her pinch-me wonderment, her Working Girl pluck.\"--Paul Begala, The New York Times Book Review (Editors' Choice)",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Audiobook",
    "Book Club",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Beck Dorey-Stein",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/43345850-from-the-corner-of-the-oval"
}