{
  "title": "Finding Hope",
  "description": "When a man hits rock bottom, he only has two choices. Professional fighter and undisputed champion of the world, twenty-five-year-old Jack Reilly is back for the final instalment of the Rollin On series.Like many love stories, boy meets girl. Girl grudgingly agrees to a date. Boy sits through cringeworthy sex talk. Boy and girl live happily ever after.For Jack, those were the good old days when life was simple and his biggest hurdle was finding time to study when he’d rather train at his brother’s gym or hang out with his girlfriend.Now Jack’s a man, and Steph is more than a freckle faced teen silenced by shyness.With championship titles to win and endorsement deals to fulfil, this power couple have their whole lives laid out ahead of them.And it looks so promising.Until…Because there’s always an until. There’s only so much pain a man can take in one lifetime.In one single day, a chain reaction set off by another man brings Jack’s end hurtling down on the whole family.A man at the bottom has only two choices; he can stay down and tap out, or he can get up and come out swinging.Finding Hope is the long awaited and eagerly anticipated final chapter of the Rollin On Series.The boy we met five books ago is finally a man.⭐️⭐️⭐️⭐️⭐️ Jack Reilly ... I've been waiting for Funny, sad, gut-wrenching, touching, sweet, joyful, impressive, sexually charged, romantic, exciting, and triumphant. The other books in this series are fabulous reads. Jack's book - the best of the bunch⭐️⭐️⭐️⭐️⭐️ Up and down and up and down again! Emilia brings her A-game with Jacks story! You’ll cry then smile and laugh then cry some more and smile and cheer and laugh again! By far the most emotional of the Rollin’ Crew but what else would you expect from Jack. He’s the baby of the first generation and wouldn’t be Jack without some drama! We love him anyway and cheer for him always! Jack & Bambie are the best ending to the first generation’s stories and are the perfect set up for the Survivor series!⭐️⭐️⭐️⭐️⭐️An emotional rollercoaster you don't want to end. This entire series was amazing but this book is my favorite. So much heart break and devastation only to show you the hope and love that come if you let it. I have never cried so much while reading a book, but it was all worth it in the end. Jack and Bambie are utterly captivating⭐️⭐️⭐️⭐️⭐️What a way to start a book! Holy crap! This book had me crying like a big baby! So friggin good. I need more rollers in my life. This whole series was absolutely amazing and I’ve been recommending it to everybody I know. Amazing",
  "genres": [
    "Romance",
    "Sports",
    "Contemporary Romance",
    "Mixed Martial Arts",
    "Sports Romance",
    "Contemporary",
    "New Adult"
  ],
  "author": "Emilia Finn",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/43335208-finding-hope"
}