{
  "title": "Scarecrow:",
  "description": "Most of them invited by the old woman Lashmotricker and some of them accompanied those who invited by her into that palace. Whoever invited by the old woman were those who got help from her when they were in dire need of it. They were all having very good opinion on the old woman and particularly those who got help from her were adoring her. The warm welcome by the old woman made them even more happy.But once they entered into the palace the trouble started. The unseen nasty creature in the palace started doing atrocities on the women there. They did not know what to do while it was satisfying its desire on one woman after the other in that palace. It was not in their dream. It was not reality either. No trace was left on the bodies of the women or otherwise that something ghastly happened on them. They just could not understand what was happening to them.Anderson Timp the psychologist among them was also in confusion. He too could not know how to take that situation. Even he did not believe in supernatural, he could not understand how that many women were imagining in the same way. Two years back, his friend Peter who also got help from the old woman came to the palace to express his gratitude to her and disappeared. Anderson Timp got some doubts on the old woman and with the hope that he might know something, accompanied his student Stuart Zinca who was invited by the old woman, into the palace. But he could not find any proof that there was hand of Lashmotricker behind the disappearance of his friend. At the same time he could not find any proof that there was Lashmotricker behind the nasty happenings on the women in the palace.On the first day itself when he had seen Jane, he understood that she was suffering psychologically. He did not believe when she said that there was Lashmotricker's hand behind the nasty happenings in the palace. He strongly opined that her listening to the conversation between Lashmotricker and the unseen creature was just her imagination and nothing more.In between the fear and anxiety in that palace, there were love stories also. Mokall and Jane had fallen in love with each other. Stuart and Jasmine started loving each other. By the end of the novel their love had become successful.As the atrocities on the women in the palace were becoming more and more, they had to report the same to the Lashmotricker. Lashmotricker became aghast and she entrusted the responsibility to find out that nasty creature to Anderson Timp but he could not find that out. On the day after Eliza reported at the dining table about the atrocities happened on her and Jane burst out on Lashmotricker accusing her to be the cause of all the atrocities in the palace, Lashmotricker could not bear anymore. She requested all her guests to leave her palace on the coming Monday itself as they wished but not to stay even a day more after that.They felt bad when Lashmotricker died even before that Monday itself. Jane became completely bewildered and dumbfounded when she came to know that Lashmotricker bequeathed all her properties to her. None of them could understand why she bequeathed all her properties to Jane. But for all of them the confusion continued. They just could not understand what type of woman that Lashmotricker was. A steamy hot romantic thriller with 52,226 words.The other romantic and suspense thrillers of this author, ‘A Mansion Of Illusions’, ‘Chasing Butterflies’, ‘Nirupama’, ‘A Village, A Forest And An Old Mansion’ ‘Lovenest’, ‘Moonshine’, ‘Enna (Her life….her love…..her struggle) ’, 'Sand Dunes (A collection of eight short stories)' ‘Amaswitha’ (Psychology And Supernatural), Dusk (Heart beat of old people), Across the river….under the bridge … and ‘Strawberry’ (An apartment-full of romance and suspense) along with two non-fiction books ‘Body Mind And You’ and ‘English Grammar Simplifier’ are also available as ebooks only on Amazon.",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/43360609-scarecrow"
}