{
  "title": "The Outlaw Ocean: Journeys Across the Last Untamed Frontier",
  "description": "A riveting, adrenaline-fueled tour of a vast and lawless world that few have ever seen: the high seas.There are few remaining frontiers on our planet. Perhaps the wildest, and least understood, are the world’s oceans: too big to police, and under no clear international authority, these immense regions of treacherous water play host to rampant criminality and exploitation.Traffickers and smugglers, pirates and mercenaries, wreck thieves and repo men, vigilante conservationists and elusive poachers, seabound abortion providers, clandestine oil dumpers, shackled slaves and cast-adrift stowaways – drawing on five years of perilous and intrepid reporting, often hundreds of miles from shore, Ian Urbina introduces us to the inhabitants of this hidden world. Through their stories of astonishing courage and brutality, survival and tragedy, he uncovers a globe-spanning network of crime and exploitation that emanates from the fishing, oil, and shipping industries, and on which the world’s economies rely.Along the way, Urbina vividly re-creates his own experiences at sea. He recounts a dramatic near-mutiny miles from shore and a tense showdown with the Vietnamese navy, and he captures the squalid conditions of everyday life aboard a ship. Urbina also explores the complex social world of sea workers, where he had to earn the trust of cautious men accustomed to long and profound silences.Both a gripping adventure story and a stunning exposé, this unique work of reportage brings fully into view for the first time the disturbing reality of a floating world that connects us all, a place where anyone can do anything because no one is watching.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Science",
    "Politics",
    "Crime",
    "Nature"
  ],
  "author": "Ian Urbina",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/43345615-the-outlaw-ocean"
}