{
  "title": "Lilith's Children",
  "description": "Join Faline. Bounty-Hunter. Huldra. Wild Woman.\n\nThe battle raging between the Wild Women of Seattle and the Hunters has sparked a war. But will either side survive the new threat that lurks in the shadows?Hunters are doubling down their efforts, putting Faline's coterie on the run. But war waits for no woman, especially not a fugitive... Faline’s plans for a surprise attack on an east coast Hunter complex hit a snag when succubi leader Marie calls in a favor and Faline has no choice but to answer. What Faline uncovers is a hidden Portland underground and an elaborate scheme dripping with Marie's cunning manipulation. Only, Marie isn't the puppet-master and neither are the Hunters. Something darker lurks under the city of Portland—and his appetite is unlikely to be satiated by words alone.That hunger is growing... But Marcus and his renegade friends would rather slit it with their daggers than see it quenched.Between old enemies and potential new, danger lives in every shadow, threatening not only Faline's coterie this time, but everything she knows about her world. And when their biggest allies in the war against the Hunters are captured, the Wild Women are left scrambling for support in the unlikeliest of places.\n \n“Strong characters. Smart writing. The most fun I've had between the pages in a long time! Pudelek is not to be missed!” – New York Times bestselling author, Wendy Higgins ★★★★★\n  \nAUTHOR INTERVIEW\n \nQ: Why do you write?\n A: I write because I'm compelled to create worlds and stories that introduce new kinds of archetypes, men and woman who defy their gender roles to be their authentic selves. I write with the hope that my readers will come away feeling a new sense of empowerment and self-worth. \nQ: What do you write?\n A: I write adult and young adult novels featuring empowered anti-heroines, usually in a paranormal or urban fantasy setting. WILD WOMEN   FREYJA’S DAUGHTER (book 1)   LILITH’S CHILDREN (book 2)   ISHTAR’S LEGACY (book 3)   \nQ: Why should readers pick up your books?\n A: My books are crafted with care to think outside the box of societal norms to include history and \"herstory\" as well as marginalized people, because to me, a tapestry woven with unique and different fabrics is the most beautiful sight to behold.  \nBe sure to scroll up and hit that BUY NOW button to enter a world of harpies, mermaids, and more wild women!",
  "genres": [
    "Paranormal Romance",
    "Fantasy"
  ],
  "author": "Rachel Pudelek",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/43358949-lilith-s-children"
}