{
  "title": "Kitchen Privileges",
  "description": "In her long-awaited memoir, Mary Higgins Clark, America's beloved and bestselling Queen of Suspense, recounts the early experiences that shaped her as a person and influenced her as a writer.Even as a young girl, growing up in the Bronx, Mary Higgins Clark knew she wanted to be a writer. The gift of storytelling was a part of her Irish ancestry, so it followed naturally that she would later use her sharp eye, keen intelligence, and inquisitive nature to create stories about the people and things she observed.Along with all Americans, those who lived in New York City's borough of the Bronx suffered during the Depression. So it followed that when Mary's father died, her mother, deciding to open the family home to boarders, placed a discreet sign next to the front door that read, FURNISHED ROOMS. KITCHEN PRIVILEGES. Very shortly the first in a succession of tenants arrived: a couple dodging bankruptcy who moved in with their wild-eyed boxer; a teacher who wept endlessly over her lost love; a deadbeat who tripped over a lamp while trying to sneak out in the middle of the night...The family's struggle to make ends meet; her days as a scholarship student in an exclusive girls' academy; her after-school employment as a hotel switchboard operator (happily listening in on the guests' conversations); the death of her beloved older brother in World War II; her brief career as a flight attendant for Pan Am (a job taken after a friend who flew with the airline said ever so casually, \"God, it was beastly hot in Calcutta\"); her marriage to Warren Clark, on whom she'd had a crush for many years; sitting at the kitchen table, writing stories, and finally selling the first one for one hundreddollars (after six years and some forty rejections!) -- all these experiences figure into \"Kitchen Privileges,\" as does her husband's untimely death, which left her a widowed mother of five young children.Determined to care for her family and to make a career for herself, she went to work writing scripts for a radio show, but in her spare time she began writing novels. Her first, a biographical novel about the life of George Washington titled \"Aspire to the Heavens,\" found a publisher but disappeared without a trace when the publisher folded. (Recently it was rediscovered by a descendant of the Washington family and was reissued under the title \"Mount Vernon Love Story.)\" The experience, however, gave her the background and the preparation for writing \"Where Are the Children?\" which went on to become an international bestseller. That novel launched her career and was the first of twenty-seven (and still counting!) bestselling books of suspense.As Mary Higgins Clark has said when asked if she might consider giving up writing for a life of leisure, \"Never! To be happy for a year, win the lottery. To be happy for life, love what you do.\"In \"Kitchen Privileges,\" she reflects on the joy that her life as a writer has brought her, and shares with readers the love that she has found.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Biography Memoir",
    "Audiobook",
    "Adult"
  ],
  "author": "Mary Higgins Clark",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/43348.Kitchen_Privileges"
}