{
  "title": "Passion on Park Avenue",
  "description": "From the author of the New York Times bestselling Stiletto and Oxford series, Passion on Park Avenue is the first in a charming new series following the unlikely friendship of three Upper East Side women as they struggle to achieve their dreams and find true love and happiness in the city that never sleeps. They vowed to steer clear of Manhattan's heartbreakers - but when it comes to love, some risks are worth taking...For as long as she can remember, Bronx-born Naomi Powell has had one to prove her worth among the Upper East Side elite. Now, as the strongminded, sassy CEO of one of the biggest jewellery empires in the country, Naomi finally has exactly what she wants - but it's going to take more than just the right address to make Manhattan's upper class accept her. The worst offender is her new neighbour, Oliver Cunningham - the grown son of the family Naomi's mother worked for as a housekeeper. Oliver used to torment Naomi when they were children, and as a ridiculously attractive adult, he's tormenting her in entirely different ways. Let this sexy battle-of-wills commence...'Strong characters and relatable situations elevate Layne's bighearted contemporary... This vivid enemies-to-lovers romance digs into class differences, emotional baggage, and the reality of dealing with aging parents' Publishers WeeklyFilled with charm and heart and plenty of heart and wit, this entertaining series will hook you from the very first page. Look out for the next two titles, Love on Lexington Avenue and Marriage on Madison Avenue. Want more fun, fresh, flirty and very sexy rom-com? Check out Lauren's Oxford series and don't miss her warm, witty and sexy Wedding Belles series and the I Do, I Don't series, as well as the romantic standalones in the Love, Unexpectedly series.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Enemies To Lovers",
    "Adult",
    "Fiction"
  ],
  "author": "Lauren Layne",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/43338955-passion-on-park-avenue"
}