{
  "title": "Chasing My Cure: A Doctor's Race to Turn Hope into Action",
  "description": "The powerful memoir of a young doctor and former college athlete diagnosed with a rare disease who spearheaded the search for a cure--and became a champion for a new approach to medical research.David Fajgenbaum, a former Georgetown quarterback, was nicknamed the Beast in medical school, where he was also known for his unmatched mental stamina. But things changed dramatically when he began suffering from inexplicable fatigue. In a matter of weeks, his organs were failing and he was read his last rites. Doctors were baffled by his condition, which they had yet to even diagnose. Floating in and out of consciousness, Fajgenbaum prayed for a second chance, the equivalent of a dramatic play to second the game into overtime.Miraculously, Fajgenbaum survived--only to endure repeated near-death relapses from what would eventually be identified as a form of Castleman disease, an extremely deadly and rare condition that acts like a cross between cancer and an autoimmune disorder. When he relapsed while on the only drug in development and realized that the medical community was unlikely to make progress in time to save his life, Fajgenbaum turned his desperate hope for a cure into concrete action: Between hospitalizations he studied his own charts and tested his own blood samples, looking for clues that could unlock a new treatment. With the help of family, friends, and mentors, he also reached out to other Castleman disease patients and physicians, and eventually came up with an ambitious plan to crowdsource the most promising research questions and recruit world-class researchers to tackle them. Instead of waiting for the scientific stars to align, he would attempt to align them himself.More than five years later and now married to his college sweetheart, Fajgenbaum has seen his hard work pay off: A treatment he identified has induced a tentative remission and his novel approach to collaborative scientific inquiry has become a blueprint for advancing rare disease research. His incredible story demonstrates the potency of hope, and what can happen when the forces of determination, love, family, faith, and serendipity collide.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Medicine",
    "Medical",
    "Science",
    "Biography",
    "Audiobook"
  ],
  "author": "David Fajgenbaum",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/43355196-chasing-my-cure"
}