{
  "title": "A Republic, If You Can Keep It",
  "description": "Justice Neil Gorsuch reflects on his journey to the Supreme Court, the role of the judge under our Constitution, and the vital responsibility of each American to keep our republic strong. As Benjamin Franklin left the Constitutional Convention, he was reportedly asked what kind of government the founders would propose. He replied, “A republic, if you can keep it.” In this book, Justice Neil Gorsuch shares personal reflections, speeches, and essays that focus on the remarkable gift the framers left us in the Constitution. Justice Gorsuch draws on his thirty-year career as a lawyer, teacher, judge, and justice to explore essential aspects our Constitution, its separation of powers, and the liberties it is designed to protect. He discusses the role of the judge in our constitutional order, and why he believes that originalism and textualism are the surest guides to interpreting our nation’s founding documents and protecting our freedoms. He explains, too, the importance of affordable access to the courts in realizing the promise of equal justice under law—while highlighting some of the challenges we face on this front today. Along the way, Justice Gorsuch reveals some of the events that have shaped his life and outlook, from his upbringing in Colorado to his Supreme Court confirmation process. And he emphasizes the pivotal roles of civic education, civil discourse, and mutual respect in maintaining a healthy republic. A Republic, If You Can Keep It offers compelling insights into Justice Gorsuch’s faith in America and its founding documents, his thoughts on our Constitution’s design and the judge’s place within it, and his beliefs about the responsibility each of us shares to sustain our distinctive republic of, by, and for “We the People.”",
  "genres": [
    "Nonfiction",
    "Politics",
    "Law",
    "History",
    "Biography",
    "Philosophy",
    "Memoir"
  ],
  "author": "Neil Gorsuch",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/43345862-a-republic-if-you-can-keep-it"
}