{
  "title": "Wichita Lineman: Searching in the Sun for the World's Greatest Unfinished Song",
  "description": "'It's just another song to me. I've written 1,000 of them and it's really just another one.' Jimmy Webb 'When I heard it I cried. It made me cry because I was homesick. It's just a masterfully written song.' Glen CampbellThe sound of 'Wichita Lineman' was the sound of ecstatic solitude, but then its hero was the quintessential loner. What a great metaphor he was: a man who needed a woman more than he actually wanted her.Written in 1968 by Jimmy Webb, 'Wichita Lineman' is the first philosophical country song: a heartbreaking torch ballad still celebrated for its mercurial songwriting genius fifty years later. It was recorded by Glen Campbell in LA with a legendary group of musicians known as 'the Wrecking Crew', and something about the song's enigmatic mood seemed to capture the tensions in America at a moment of crisis. Fusing a dribble of bass, searing strings, tremolo guitar and Campbell's plaintive vocals, Webb's paean to the American West describes a telephone lineman's longing for an absent lover, who he hears 'singing in the wire' - and like all good love songs, it's an SOS from the heart.Mixing close-listening, interviews and travelogue, Dylan Jones explores the legacy of a record that has entertained and haunted millions for over half a century. What is it about this song that continues to seduce listeners, and how did the parallel stories of Campbell and Webb - songwriters and recording artists from different ends of the spectrum - unfold in the decades following? Part biography, part work of musicological archaeology, The Wichita Lineman opens a window on to America in the late-twentieth century through the prism of a song that has been covered by myriad artists in the intervening decades.'Americana in the truest sense: evocative and real.' Bob Stanley",
  "genres": [
    "Music",
    "Nonfiction"
  ],
  "author": "Dylan  Jones",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/43345903-wichita-lineman"
}