{
  "title": "Phoenix",
  "description": "Alistair  God...one would think I have everything. I play for stadiums full of people, have more money than I know what to do with, and have the most attractive women eating out of the palm of my hand. But the bad boy persona that I keep tirelessly dipped in sex, drugs and rock &roll is only a bad cover-up for what's inside. Rather, what ISN'T inside. My heart is dead, my soul, dead. I don't know how it happened, but somehow the perfectly normal, perfectly average little sister of my best friend managed to claw her way into my chest and take residence in the empty cavity where my heart used to rest. It's the damnedest thing, but it happened. Only problem? She's the one girl in the world who couldn't care less about my prestige, fame or money. If I want her, I'll have to win her over the hard way, by digging up the charred ashes of my decimated soul and let her into the darkness hiding there. I'm no phoenix. I'm not rising from the ashes unless I crawl my way, bloody and broken, out of them.  Veronica  It's one thing to say life is messy, and a whole other thing to live a messy life. Mine? Mine is messy. Like, Brawny-strength paper towel messy. One messy divorce later I'm living in my rock star brother's apartment in Seattle and house-mates with the most attractive man I've ever laid eyes on. But he's not my type. At all. Smelling of whiskey and pain, the man has demons I can see just hiding behind his emerald eyes. I'm not a psychologist, I can't make his pain go away. He is a beautiful, wounded creature and I am drawn to him like I've got the strongest sort of magnet sewn into my chest. Like I said, messy. Between him and my ex, I'm still somehow trying to be true to myself while navigating life through incredibly uncertain waters. I didn't plan on falling in love with a rock god. I didn't plan on getting involved. And I certainly didn't plan on living this kind of life. It's a good thing I love him so darn much.   *This is a humorous but dramatic romance with scenes and topics that may be uncomfortable or disturbing to certain readers.",
  "genres": [
    "Music",
    "Contemporary Romance"
  ],
  "author": "L.L. Ash",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/43372446-phoenix"
}