{
  "title": "Harvestine: Sieben Jahre und vier Sommer",
  "description": "Was, wenn es nur eine wahre Liebe für dich gibt? Was, wenn deine Herkunft und deine eigene Familie das größte Hindernis sind?Für Emma gab es nie einen anderen als Leon. Schon als junges Mädchen hat sie nur ihn geliebt. Doch Eifersucht und Habgier führen zu einer Tragödie, die beide auseinanderreißt und sie alles verlieren lässt, woran sie glauben.Jahre später begegnen sich Emma und Leon wieder.Er ist zu einem reichen, frauenverachtenden Kotzbrocken geworden. Sie ist schöner denn je aber geheimnisvoll und unnahbar.Ihre Liebe von einst hat sich in Verbitterung und Hass verwandelt. Das glauben die beiden zumindest, bis zu dem Moment, wo sie sich wieder gegenüberstehen. Harvestine ist eine romantische Liebesgeschichte, eine kleine Familiensaga, mit einem Hauch von Krimi und wohl dosierter, aber expliziter Erotik. Es ist ein bisschen traurig, ein bisschen witzig, ein bisschen ironisch und manchmal auch ziemlich unverblümt.*Leseprobe* „Du hast auf mich gewartet? Als wären wir verlobt, oder so? Das ist doch verrückt. Wir haben sieben Jahre lang nichts voneinander gehört. Ich könnte … ich könnte längst verheiratet sein!“ „Ich habe mich nie in einen anderen verliebt.“„Und jetzt bildest du dir wohl ein, wir treten zusammen vor den Altar, oder was?“ Er konnte es nicht verhindern, dass seine Stimme aggressiv und vorwurfsvoll klang, aber er war so wütend. Wütend auf die ganze Welt und noch wütender auf Max und am meisten auf sich selbst. Was stimmte da nicht? Wer hatte damals eigentlich gelogen? Vanessa? Max? Emma? Oder er selbst? Hatte er alles, was er damals gesehen hatte, wirklich so falsch interpretiert?„Nein! Das bilde ich mir nicht ein.“ „Natürlich denkst du das. Lüg mich nicht an. Ich weiß doch, wie du tickst in deinem Kopf, der voll ist mit romantischem Unsinn.“",
  "genres": [
    "Fiction"
  ],
  "author": "Clannon Miller",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/43366931-harvestine"
}