{
  "title": "The Last Odyssey",
  "description": "To save the world and our future, Sigma Force must embark on a dangerous odyssey into an ancient past whose horrors are all too present in this page-turning thriller from #1 New York Times bestselling author James Rollins that combines cutting-edge science, historical mystery, mythology, and pulse-pounding action.For eons, the city of Troy—whose legendary fall was detailed in Homer’s Iliad—was believed to be myth, until archaeologists in the nineteenth century uncovered its ancient walls buried beneath the sands. If Troy was real, how much of Homer’s twin tales of gods and monsters, curses and miracles—The Iliad and The Odyssey—could also be true and awaiting discovery?In the frozen tundra of Greenland, a group of modern-day researchers stumble on a shocking find: a medieval ship buried a half-mile below the ice. The ship’s hold contains a collection of even older artifacts—tools of war—dating back to the Bronze Age. Inside the captain’s cabin is a magnificent treasure that is as priceless as it is miraculous: a clockwork gold map imbedded with an intricate silver astrolabe. The mechanism was crafted by a group of Muslim inventors—the Banū Mūsā brothers—considered by many to be the Da Vincis of the Arab world—brilliant scientists who inspired Leonardo’s own work.Once activated, the moving map traces the path of Odysseus’s famous ship as it sailed away from Troy. But the route detours as the map opens to reveal a fiery river leading to a hidden realm underneath the Mediterranean Sea. It is the subterranean world of Tartarus, the Greek name for Hell. In mythology, Tartarus was where the wicked were punished and the monstrous Titans of old, imprisoned.When word of Tartarus spreads—and of the cache of miraculous weapons said to be hidden there—tensions explode in this volatile region where Turks battle Kurds, terrorists wage war, and civilians suffer untold horrors. The phantasmagoric horrors found in Homer’s tales are all too real—and could be unleashed upon the world. Whoever possesses them can use their awesome power to control the future of humanity.Now, Sigma Force must go where humans fear to tread. To prevent a tyrant from igniting a global war, they must cross the very gates of Hell.",
  "genres": [
    "Thriller",
    "Fiction",
    "Adventure",
    "Action",
    "Science Fiction",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "James Rollins",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/43386047-the-last-odyssey"
}