{
  "title": "The Left Hand of Darkness",
  "description": "Genly Ai is an emissary from the human galaxy to Winter, a lost, stray world. His mission is to bring the planet back into the fold of an evolving galactic civilization, but to do so he must bridge the gulf between his own culture and prejudices and those that he encounters. On a planet where people are of no gender--or both--this is a broad gulf indeed. The inventiveness and delicacy with which Le Guin portrays her alien world are not only unusual and inspiring, they are fundamental to almost all decent science fiction that has been written since. In fact, reading Le Guin again may cause the eye to narrow somewhat disapprovingly at the younger generation: what new ground are they breaking that is not already explored here with greater skill and acumen? It cannot be said, however, that this is a rollicking good story. Le Guin takes a lot of time to explore her characters, the world of her creation, and the philosophical themes that arise. If there were a canon of classic science fiction, The Left Hand of Darkness would be included without debate. Certainly, no science fiction bookshelf may be said to be complete without it. But the real question: is it fun to read? It is science fiction of an earlier time, a time that has not worn particularly well in the genre. The Left Hand of Darkness was a groundbreaking book in 1969, a time when, like the rest of the arts, science fiction was awakening to new dimensions in both society and literature. But the first excursions out of the pulp tradition are sometimes difficult to reread with much enjoyment. Rereading The Left Hand of Darkness, decades after its publication, one feels that those who chose it for the Hugo and Nebula awards were right to do so, for it truly does stand out as one of the great books of that era. It is immensely rich in timeless wisdom and insight. The Left Hand of Darkness is science fiction for the thinking reader, and should be read attentively in order to properly savor the depth of insight and the subtleties of plot and character. It is one of those pleasures that requires a little investment at the beginning, but pays back tenfold with the joy of raw imagination that resonates through the subsequent 30 years of science fiction storytelling. Not only is the bookshelf incomplete without owning it, so is the reader without having read it. --L. Blunt Jackson",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Classics",
    "Book Club",
    "Science Fiction Fantasy",
    "Queer"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/4338325-the-left-hand-of-darkness"
}