{
  "title": "That Scoundrel Emile DuBois: Or the Light of Other Days",
  "description": "A dashing highwayman lying low from the Bow Street runners is bitten by a siren half vampire and joins with a dowager's virtuous companion in a Gothic adventure with vampires and time travel.Young Sophie de Courcy, living as a poor relative with an elderly countesses' family in an isolated mansion on the mountains in North Wales, dreams of romance and adventure.When Sophie's long term hero, the rascally Émile Dubois, comes on a vsiit to his aunt the countess, their sinister neighbours the Kenricks machinations draw him, and Sophie too, into a world of man vampires and time warps.Now Sophie has more adventure than she ever wished for.It is lucky for Sophie that she has a staunch ally in her lady's maid Agnes, who combines common sense with a talent for Tarot reading.Winner of the BRAG medallion for outstanding self-published fiction, this over-the-top Gothic adventure is full of dark humour, romance and derring-do and an affectionate spoof on the themes of classical Gothic.EXTRACT:“You call betimes, Monsieur. I fear Kenrick is out. Would you care for some refreshment? Come to the morning room.” Her voice, with its slight Welsh accent, was caressing. “I note you have heeded my wish in keeping from that detestable garlic.” She smiled suggestively, and he returned her smile. She turned and went up the icy hallway, while shadows shifted at the sides like a threatening mist. Émile had eyes only for Ceridwen Kenrick’s back view, of her full, round, wonderful hips and derrière. Unruly strands of her glossy black hair coiled down the nape of her neck like shiny snakes. It seemed he thought of another full derrière he had lately watched, of another, very different nape with strands of fair hair curling innocently, for he paused, looking wretched. Then he swore in an undertone and went on. She led Émile to the room where Kenrick had entertained him and Lord Rhuddlan. A fire burnt there now, but it was nearly as cold. “Would you care for some refreshment now, Monsieur? Red wine, perhaps?” She fixed eyes glowing with mischief on his, laughing outright, almost as if she knew how as Gilles Long Legs he took a swig of red wine before his dismal breakfast every morning to prime himself for another hateful day. He pulled his eyes from hers, perturbation flickering in their depths. “Don’t trouble, Madame, for I know you have problems with your staff, which I have further depleted in taking Katarina from you.”She came closer. “Yes. So gallant of you! Were the girl not a scrawny child, I might envy her that quixotic rescue at your hands. Speaking of jealousy, how jealous that little girl who is companion to your Aunt was of me, last night. She was almost in tears. Did you not remark it?” She laughed, her black eyes hard, her voice oddly soft. He flinched and muttered. “Does the prissy little thing know you are a ruffian, smuggler and highwayman, Monsieur Gilles Longues Jambes*?” He met her eyes, startled: “Monsieur Gilles Longues Jambes?” He was lost then, for her eyes locked with his and trapped them. She giggled as she watched his jaw drop and his breathing quicken as he struggled to wrench his dilated eyes from hers. His eyes glazed over and he stopped struggling. She said in between delighted laughter, “You are a complete scoundrel, aren’t you? How shocked society would be, if they knew of half the things you have done. But I do not mind. I like it. Come and kiss me, you bloodthirsty ruffian.”",
  "genres": [
    "Paranormal",
    "Historical Fiction",
    "Historical Romance",
    "Vampires",
    "Regency",
    "Gothic"
  ],
  "author": "Lucinda Elliot",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/43372010-that-scoundrel-emile-dubois"
}