{
  "title": "I Am the Immaculate Conception: The Story of Bernadette of Lourdes",
  "description": "Two thousand years ago, Jesus told the parable of the suffering beggar Lazarus and the rich man. Each had died, with Lazarus joining God in heaven for all eternity while the rich man was condemned to the flames of hell. “Send someone to warn my brothers,” the rich man pleaded, “so they won’t end up in this place of torment.” But God said, “They have the prophets to warn them, your brothers can listen to them.” To which the rich man responded, “Then let Lazarus return from the dead that they may believe.” But God said, “They will not believe even if a man should rise from the dead.”Over the last five hundred years we have witnessed a great many Apparitions of the Virgin Mary in places such as Guadalupe, Mexico; Lourdes, France; Fatima, Portugal. Each Apparition has carried a distinct, albeit similar, message. Pray the Rosary every day, sacrifice for the conversion of sinners and stop offending God. To do these things will mean the defeat of Satan and his Godless ways; an end to Communism and its worldly tendencies; and peace and harmony on earth. Regardless of the associated miracles witnessed by thousands, millions of people continue to deny the reality of the Apparitions and decry the message as a joke.This book recounts the historical life of Bernadette Soubirous of Lourdes, France. A rather ordinary nineteenth century life turned upside down at the tender age of fourteen by the miraculous events that occurred in a rock Grotto near the dumping grounds of Massabielle; the many Apparitions of a Woman who identified Herself as The Immaculate Conception; the miraculous cures that were attributed to a spring of common water, the Virgin’s message to mankind; and the extraordinary relevance today for all that care to listen.But as Jesus said, “Even if someone should rise from the dead there would still be unbelievers.” Isn’t it a pity?",
  "genres": [
    "Religion"
  ],
  "author": "Paul F. Caranci",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/43380420-i-am-the-immaculate-conception"
}