{
  "title": "Crash",
  "description": "~Jeremy I've always been satisfied with new girls every so often on the road. My life is too busy to settle down with just one, and honestly, I haven't found someone worth committing to, either. Until her. Beth came storming into my life with an abandon and a sass that I just couldn't turn away from. Everything about her begged for me. Well, except her words. Those told me to get the hell away from her. I guess it's a good thing that no matter how many times she tells me no with her mouth, her body tells me yes. This might just be the only girl in the world worth giving up my bachelor lifestyle for and starting a family with. If only I can be good enough for her. If only I can purge my demons for her. Then I'll be able to earn her love in return.   ~Beth After my disastrous not-quite-together-in-the-first-place breakup, I'm so glad to be back in Georgia where I belong. Brazil was nice, but it was filled with a whole lot of crappy relationships. But unfortunately, my best friend thinks I need some cheering up, and I guess that comes in the form of trying to get into the pants of the guys from a band I've never heard of before. Punk rocker to the core, I can't help but get drawn in by Jeremy. At first it was because of his looks, his cocky attitude, and the drumsticks poking out of his back pocket, but then it was because of his authenticity and depth. Who knew rock stars could be so...normal? Only problem is, Jeremy wants a fling, and I want a ring, so we can only be friends. Just friends. Except, he has other ideas. All I have to decide is if he's worth putting my heart on the line. Again. And just pray that it doesn't get smashed into pieces. Again. Well, not like the heart really gives you a choice, anyway. Mine falls for him before I give it permission, and now I just have to get my brain to give in, too.",
  "genres": [],
  "author": "L.L. Ash",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/43372447-crash"
}