{
  "title": "Rivalry of Runes",
  "description": "*** THOUSANDS OF READERS HAVE FOUND A HOME WITH THE PARANORMAL POLICE DEPARTMENT. GET YOUR BADGE TODAY! ***  \n  Not everyone has the guts to take on rivaling wizards...\n Two powerful wizard clans are on the brink of war. When one of the leaders is assassinated, blame flies in the face of the opposing faction, igniting a flame of accusation that threatens to leave Seattle in ruins.  Savannah Sage and her team work to unmask the real killer and prevent the ravages of magical mayhem, but hundreds of years of rivalry have both clans on edge.  Too bad the assassins aren't finished.  While Sage investigates, more attacks are launched, pushing the adversaries ever closer to mutual destruction.  But there's something more that threatens to split the world, and if Sage and her crew can't shut it down in time, there will be rivers of blood. Unleashing power this great will do more than merely bend the Space Needle, it'll snap the damn thing in half.  Worse, she's closing in a dangerously clever opponent...one she might've encountered before.  If you like Jim Butcher, Michael Anderle, K.F. Breene, Ilona Andrews, Patricia Briggs, or Steve McHugh...you will love this book in the Seattle Paranormal Police Department.  Questions for John P. Logsdon Q: What do you enjoy most about writing the Paranormal Police Department with other authors? A: It's flippin' fun as hell. We work out characters, plots, locations, and so on as a team. Then, the words hit the page and we roll along at breakneck speed because it's just a blast working together in this world!  Q: Why should readers want to jump into the world of the Paranormal Police Department? A: A few reasons, actually. It's high-action, often hilarious, and just plain fun. On top of that, there are multiple precincts in the PPD for readers to enjoy. So, while this series of books covers Bethany Black and the New York PPD, there are different lead characters running the PPD precincts in the Badlands, Las Vegas, the Netherworld, Seattle, Shadow, and Southeast Asia.  That means that readers who crave action and adventure are going to have tons of action-packed, laugh-out-loud stories to consume with a vengeance. We're already over twenty books in and there's a new book releasing every 2-3 weeks in 2018-2019.  Q: Anything else you'd like to leave readers with? A: If you're into naughty humor and high-octane adventures, you need to give the Paranormal Police Department a shot. That's what all the authors in the PPD love to read, which means it's also what we love to write.  Paranormal Police Department categories \n   Dark Comedy \n   Dark Fantasy \n   Urban Fantasy \n   Supernatural Thriller \n   Urban Fantasy Thriller \n   Science Fiction & Fantasy \n   Paranormal and Urban Romance \n   Vampires & Werewolves \n   Supernatural Shifter \n  THOUSANDS OF BOOKS SOLD. MILLIONS OF PAGES READ. DIVE INTO THE WORLD OF THE PARANORMAL POLICE DEPARTMENT AND LET THE FUN BEGIN...",
  "genres": [
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "John P. Logsdon",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/43383092-rivalry-of-runes"
}