{
  "title": "Deadbreak: A Zombie Apocalypse Thriller",
  "description": "Next Generation Indie Books Award WinnerIndie Reader Discovery Awards Winner for Best Action/AdventureCities are in ruins, supplies are scarce, and brains are on the menu. To survive, Jeremiah will need his wits, a little bit of luck, and lots of ammo.Before Deadbreak—the day three years ago when the dead rose from their graves—the idea of spending my days outrunning animated corpses and contemplating how to properly season rodents wasn’t exactly on my radar. But here we are. The world has turned upside down, and I’ve had to learn new skills. Archery. Looting. Melee combat against bandits and the occasional cannibal. Most of the meaningful conversations I have are with my dog. Don’t judge. It sure beats chatting up your neighbor when he’s missing his tongue and cerebellum is his staple food. Somehow, through a combination of blind luck and a strong desire to give the zombie apocalypse the finger, I’ve survived this long. My goal is to make it to the Pacific coast, find my daughter, and create some semblance of a new life. Minus that middle finger. Pretty sure someone’s eaten it by now. _________________________________________________________________________________________________________________ Great Read. Ok so I read ALOT. And while waiting for my very long list of followed authors to pop out my next fix I read suggested material and some features that pop up on here. Some are hit and miss, some I stop 3 chapters in and wonder if it's cliff notes version of a real story. However I found this little gem yesterday and it is THE best thing I've read in a few weeks. Gritty, funny, great characters, zombies, bad guys and more guns and one liners than you can shake a rotten limb at. Highly suggest it. ★★★★★ One of the best zombie books I've read in a long time. I've loved the zombie genre for a long time, but, for me, they have to be about the people, rather than the zombies as the #1 focus. These are disaster stories, and how the people get through them. This had everything I want in a zombie great characters, good dialogue, a story that progresses. Too often they break down to kill zombie, blood everywhere, on to next fight. This has characters who remind me of what one of the best, Mark Tufo, does. ★★★★★ A well written stand alone book. Sure it is post zombie apocalypse, but does that mean one can't find a witty main character with a loyal dog making their way across the country like a couple of pinball trouble magnets on a quest? Well worth the read. ★★★★★",
  "genres": [
    "Horror",
    "Zombies",
    "Fiction",
    "Post Apocalyptic",
    "Audiobook",
    "Dystopia",
    "Science Fiction"
  ],
  "author": "Jorge  Sánchez",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/43387134-deadbreak"
}