{
  "title": "Unequal Protection: The Rise of Corporate Dominance and the Theft of Human Rights",
  "description": "Unequal Protection: The Rise of Corporate Dominance and the Theft of Human RightsWas the Boston Tea Party the first WTO-style protest against transnational corporations? Did Supreme Court sell out America's citizens in the nineteenth century, with consequences lasting to this day? Is there a way for American citizens to recover democracy of, by, and for the people?Thom Hartmann takes on these most difficult questions and tells a startling story that will forever change your understanding of American history. He begins by uncovering an original eyewitness account of the Boston Tea Party and demonstrates that it was provoked not by \"taxation without representation\" as is commonly suggested but by the specific actions of the East India Company, which represented the commericial interests of the British elite.Hartmann then describes the history of the Fourteenth Amendment--created at the end of the Civil War to grant basic rights to freed slaves--and how it has been used by lawyers representing corporate interests to extend additional rights to businesses far more frequently than to freed slaves. Prior to 1886, corporations were referred to in U.S. law as \"artificial persons.\" but in 1886, after a series of cases brought by lawyers representing the expanding railroad interests, the Supreme Court ruled that corporations were \"persons\" and entitled to the same rights granted to people under the Bill of Rights. Since this ruling, America has lost the legal structures that allowed for people to control corporate behavior.As a result, the largest transnational corporations fill a role today that has historically been filled by kings. They control most of the world's wealth and exert power over the lives of most of the world's citizens. Their CEOs are unapproachable and live lives of nearly unimaginable wealth and luxury. They've become the rudder that steers the ship of much human experience, and they're steering it by their prime value--growth and profit and any expense--a value that has become destructive for life on Earth. This new feudalism was not what our Founders--Federalists and Democratic Republicans alike--envisioned for America.It's time for \"we, the people\" to take back our lives. Hartmann proposes specific legal remedies that could truly save the world from political, economic, and ecological disaster.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Economics",
    "Law",
    "Business",
    "Social Issues"
  ],
  "author": "Thom Hartmann",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/433932.Unequal_Protection"
}