{
  "title": "Fortitude: American Resilience in the Era of Outrage",
  "description": "Jordan Peterson's Twelve Rules for Life meets Jocko Willink and Leif Babin's Extreme Ownership in this tough-love leadership book from a Navy SEAL and rising star in Republican politics.In 2012, on his third tour of duty in Afghanistan, a roadside bomb took Dan Crenshaw's right eye. When he learned how to see again, he didn't want anyone's pity. People shouldn't feel sorry for him, he decided, and they shouldn't feel sorry for themselves either. Most people's everyday challenges aren't as extreme as surviving combat or working to regain their sight, but that's just Crenshaw's point: If we can meet life's toughest challenges without resenting our luck or complaining, minor daily obstacles aren't worth our outrage. \"Microaggressions\" and \"triggers\" from mere words mean little to someone who's had bullets fly by their head. That's Crenshaw's simple lesson in FORTITUDE: Lighten up, toughen up, and get to work on what's important (hint: it's not giving into a culture of outrage, playing the victim, and seeking an apology).FORTITUDE is a no-nonsense advice book for a society desperately in need of tough love. With meditations on perseverance, failure, and finding much-needed heroes, the book is the antidote for a prevailing \"safety culture\" of trigger warnings and safe spaces. Interspersed with lessons and advice is Crenshaw's own story of how an average American kid from the Houston suburbs has faced all sorts of unexpected situations -- from war zones to the halls of Congress -- and managed to navigate them all with a few simple tricks: a sense of humor and an even greater sense that, no matter what anyone else around us says or does, we are in control of our own destiny.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Biography",
    "Self Help",
    "Military Fiction",
    "Leadership",
    "Audiobook"
  ],
  "author": "Dan Crenshaw",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/43387496-fortitude"
}