{
  "title": "Put That On Everything",
  "description": "Trevor HoltonHe’s every woman’s dream. Thanks to his humble beginnings, he’s edgy, outspoken and determined to win. Holt is also the highest paid wide receiver in the league and well worth the money he’s paid. Not only is he worth millions but he’s also physical perfection. That alone has every women willing to do any and everything he asks. Well…every woman except one, Sutton Kelly. What man wouldn’t be satisfied with having it all, if that’s what having it all really means? Unfortunately, no matter how far you travel, sometimes the past follows. Trevor can’t seem to erase the darkness, but he refuses to allow it to define him.Sutton KellyShe’s a young Black woman at the top of her game with no room for distractions. She’s witty, brilliant, beautiful and finally being taken seriously in a world dominated by men. Sutton fights daily to be respected as the general manager of a thriving NFL team. Sutton knows the game and is damn good at her job but all the world seems to acknowledge is her father's legacy and her pretty face. Well… everyone except the last person she needs to be distracted by, Trevor Holton. He’s the name and face of her team which deems him off limits, but Sutton finds herself stuck between her attraction for Holt and her need to be respected, which is a dangerous combination.When Trevor and Sutton’s worlds collide will it be a beautiful mistake or a horrible disaster? Either way they are bound to find out because fate keeps intervening. The burning questions is, will they be able to find a happy medium to coexist or will the lines get blurred proving that you can’t fight what’s meant to be?*This book was previously published in 2018**Please check Goodreads for reviews*",
  "genres": [
    "Romance",
    "African American Romance",
    "Sports Romance",
    "Urban",
    "Sports",
    "African American"
  ],
  "author": "K.C. Mills",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/43392586-put-that-on-everything"
}