{
  "title": "A Maverick Traveller Anthology: Mary Jane Walker's first three books - A Maverick Traveller / A Maverick Cuban Way / A Maverick New Zealand Way",
  "description": "BY THE AUTHOR OF A MAVERICK NEW ZEALAND WAY, FINALIST IN TRAVEL AT THE INTERNATIONAL BOOK AWARDS, 2018.\n\n\nA Maverick Traveller begins with a voyage on a Chinese junk named La Dame de Canton, naked and stoned\nMary Jane travels with no real plans and decides where to go and what to see next when she gets there. She always meets locals.\nWhether she was eating dog unintentionally in Indonesia, meeting the rapper 50 Cent before he was famous at a back-packers, seeing Putin in Red Square, being followed around as a suspicious character by intelligence services and police in Russia, Turkey and the USA, or kicking a US nuclear submarine in New Zealand, she shares her unique stories and experiences. \n\n\n\n\n\n\n A Maverick New Zealand Way \n\nis a tour of Mary Jane’s homeland\n\n\nMary Jane shares her love of environmental conservation and volunteering, trekking and adventure in her own country. She suggests sustainable travel tips, alternative places to visit and places to stay that only locals know about, off the beaten track.Learn about native bush and wildlife nestled among a variety of landscapes – glaciers, volcanoes, grassy plains, waterfalls, lakes, vast stretches of ocean and geothermal areas, as well as areas of special significance to Māori, and cityscapes both modern and colonial.\n\n\nWITH 625 photos, maps and other images\n\n\n\n\n\n\n\n\nA Maverick Cuban Way\n\n is a flowing narrative of Cuba after the Castros\nMary Jane went to Cuba on a whim. A solo traveller, she met someone who suggested a casa run by a woman named Mikalena. Mary Jane travelled around the Island on local buses.\n\nHer most memorable experiences are of hiking to Fidel Castro’s hideout from the CIA in the Sierra Maestra with a guide discussing socialism, the Revolution, and every fifteen minutes a different type of plant.\n\nMikalena’s son was a doctor, as one in every 150 people in Cuba are. Mikalena practised voodoo black magic.\n\nMary Jane went to the Cuba’s Guantanamo lookout and took photos of secret photos from inside the American base. Later, she met the son in law of one of the American marines in the photos.\n\nShe danced Salsa in Havana, smoked cigars and hung out in Hemingway’s hangout, the Café Floradita.\n\n\nWith 247 maps, photos and other images.",
  "genres": [],
  "author": "Mary Jane Walker",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43431397-a-maverick-traveller-anthology"
}