{
  "title": "Own Your Self: The Surprising Path beyond Depression, Anxiety, and Fatigue to Reclaiming Your Authenticity, Vitality, and Freedom",
  "description": "New York Times  best-selling author presents a radical alternative to psychotropic discerning the meaning in your symptoms and your struggle as a way to reclaim your health and your self.For years, we've been telling ourselves that our difficult feelings-sadness, rage, shame, intensity, worry-are somehow \"not okay.\" And, all too often, we've relied on the promise of pharmaceuticals to tamp them down. The fact is, though, that these feelings are a vital part of our experience. They are real. And those of us who feel them most strongly are the canaries in the coalmine-sensitive to things that are seriously wrong in the world today. In a book that's both provocative and promising, holistic psychiatrist Kelly Brogan, M.D., author of  A Mind of Your Own , shows us that we don't have to medicate our mental, emotional, and physical pain away-that the best way out is through. She explodes the mistaken belief that our symptoms-from mood changes to irritability to fogginess and fatigue-are evidence that we are sick or broken. Then she charts a new path to get real, get well, and get free. The journey   •  Coming to a new appreciation of the meaning behind symptoms, and whether you are a canary in the coal mine  •  Learning the 2 major risks of medication that most doctors are not trained to disclose  •  Exploring the 5 reversible physical drivers of so-called mental illness  •  Starting the process of radical physical healing with inclusive details of Dr. Brogan's history-making 30-day protocol  •  Taking an emotional inventory of energy drains and toxic relationships  •  Taking a deeper dive into the spiritual awakening and expansion that comes when you reclaim your real self from conventional medicine  •  Identifying the most likely places you have given your power away  •  Understanding what the science has to say about psychedelics as a tool for awakening  •  Navigating health challenges with curiosity and the proper tools  •  Guidance, support, and many Travel Tips shared from the trenches!Our experiences, Dr. Brogan argues, aren't problems or pathologies; they reflect what we need to accept, acknowledge, and transform in order to truly become who we are.  Own Your Self  is a journey of healing, and also something a journey of coming home to ourselves.",
  "genres": [
    "Nonfiction",
    "Health",
    "Self Help",
    "Psychology",
    "Personal Development",
    "Spirituality",
    "Mental Health"
  ],
  "author": "Kelly Brogan MD",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/43418140-own-your-self"
}