{
  "title": "Sincerely Yours",
  "description": "Evan Michaels:  Everyone thinks being a rock-star is glamorous. They couldn’t be more wrong. I’ve been abused, mocked, and ridiculed all in the public eye. I live for weeks on end in a smelly tour bus, my family is the worst, and all I have is my playboy manager, Christian, for company. So, I get bored and sit on social media. No big deal. I don’t think anything of it until this gorgeous, sweet man named Jordan reaches out to me. He consoles me in the sweetest messages I’ve ever received, and says the nicest things I’ve always wanted to hear. I haven’t even met him yet. But one way or another, I’m going to make sure our paths cross.  Jordan Nashton:  I’m not sure what I was thinking reaching out to her on social media. Perhaps it was the unnatural desire I have to protect someone from the thing that harmed my sister. Maybe it’s just because I’m a bored, lonely, broke fanboy with nothing better to do. I didn’t think she’d actually read my messages. When she shows up at my work one day, I can’t believe my eyes. She’s every bit as feisty and beautiful as she seems to be on stage. There’s a connection between us I can’t wait to explore, but love is rarely that simple. Her life is infamous, her manager is harboring a big secret from everyone and I’m not sure if I can handle it all. I’m willing to try though, to see if I have what it takes to make Evan Michaels sincerely mine.   Possible trigger:  Domestic violence is described and discussed, but not shown. Please read cautiously if these are triggering themes for you. The (Lots of Love series is a polyamorous romance. Evan will eventually have multiple consensual love interests, and one of those interests has an interest of his own. While book one has m/f sexy time, the rest of the series may contain threesomes and maybe moresomes, m/m sexy encounters, and naughty language. This series is meant for adults only.)",
  "genres": [
    "Reverse Harem",
    "Contemporary",
    "Romance",
    "M M Romance",
    "Music",
    "LGBT",
    "Contemporary Romance"
  ],
  "author": "Lizzie Fox",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/43415541-sincerely-yours"
}