{
  "title": "How the Brain Lost Its Mind: Sex, Hysteria, and the Riddle of Mental Illness",
  "description": "A noted neurologist challenges the widespread misunderstanding of brain disease and mental illness.How the Brain Lost Its Mind tells the rich and compelling story of two confounding ailments, syphilis and hysteria, and the extraordinary efforts to confront their effects on mental life. How does the mind work? Where does madness lie, in the brain or in the mind? How should it be treated?Throughout the nineteenth century, syphilis--a disease of mad poets, musicians, and artists--swept through the highest and lowest rungs of European society like a plague. Known as \"the Great Imitator,\" it could produce almost any form of mental or physical illness, and it would bring down a host of famous and infamous characters--among them Guy de Maupassant, Vincent van Gogh, the Marquis de Sade, Friedrich Nietzsche, and Al Capone. It was the first truly psychiatric disease and it filled asylums to overflowing. At the same time, an outbreak of bizarre behaviors resembling epilepsy, but with no identifiable source in the body, strained the diagnostic skills of the great neurologists. It was referred to as hysteria.For more than a century, neurosyphilis stood out as the archetype of a brain-based mental illness, fully understood but largely forgotten, and today far from gone. Hysteria, under many different names, remains unexplained and epidemic. These two conditions stand at opposite poles of the current debate over the role of the brain in mental illness. Hysteria led Freud to insert sex into psychology. Neurosyphilis led to the proliferation of mental institutions. The problem of managing the inmates led to the abuse of lobotomy and electroshock therapy, and ultimately the overuse of psychotropic drugs.Today we know that syphilitic madness was a destructive disease of the brain while hysteria and, more broadly, many varieties of mental illness reside solely in the mind. Or do they? Afflictions once written off as \"hysterical\" continue to elude explanation. Addiction, alcoholism, autism, ADHD, Tourette syndrome, depression, and sociopathy, though regarded as brain-based, have not been proven to be so.In these pages, the authors raise a host of philosophical and practical questions. What is the difference between a sick mind and a sick brain? If we understood everything about the brain, would we understand ourselves? By delving into an overlooked history, this book shows how neuroscience and brain scans alone cannot account for a robust mental life, or a deeply disturbed one.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Science",
    "History",
    "Mental Health",
    "Medical",
    "Neuroscience"
  ],
  "author": "Allan H. Ropper",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/43416623-how-the-brain-lost-its-mind"
}