{
  "title": "Procrastination: How To Stop Wasting Your Time And Be More Productive",
  "description": "Use These Powerful Techniques To Stop Wasting Your Time And Be More ProductiveThis book contains proven steps and strategies. It is a simple guide on how to cure laziness, set goals, improve discipline, control your habits, and end procrastinating. Procrastination is quite a menace primarily because it makes you squander time and disregard its importance. The dilemma is that procrastination is something that comes easily to many of us. And it is a problem that does interfere with our routine chores, performance, and productivity. Studies show that about 25% to 75% of college students are prone to procrastination when it comes to doing their academic work. Procrastination is a major reason why, often, PhD students fail to complete their university dissertations on time. While these statistics pertain to only academics, the truth is that procrastination does get in the way of our routine household chores, personal obligations, and even relationships. Many times, we find ourselves preferring to snuggle in bed over meeting a friend or binge-watching movies instead of doing errands. One way or another, procrastination does influence your life and that too, negatively. So how is it that you can get better control of it and learn to overcome this unhealthy habit? Well, that is the focus of this guide. This book gives you a better understanding of the problem at hand, ‘procrastination,’ and provides you with actionable and effective guidelines on how to control your bad habits, inculcate self-discipline, manage your temptations, set meaningful goals and achieve them with utmost focus and determination.Here Is A Preview Of What You Will Learn \n   How Procrastination Sabotages Your Life \n  \n   Build The Intention To Break Procrastination \n  \n   Create An Action Plan To Work Towards Your Goal \n  \n   Reinforce Your Focus To Complete Goals On Time \n  \n   And Much, Much More \n Take action and get this book NOW!",
  "genres": [],
  "author": "George M. Posi",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43426597-procrastination"
}