{
  "title": "Mister Rogers' Neighborhood: A Visual History",
  "description": "A visual celebration of  Mister Rogers’ Neighborhood , America’s most beloved children’s television show, including a foreword by Tom Hanks and a peek at the making of the feature film  A Beautiful Day in the Neighborhood , in theaters Thanksgiving weekend. Go behind the scenes of  Mister Rogers’ Neighborhood  with this unprecedented dive into its storied history. More than fifty years ago, Fred Rogers, a modest television host, revolutionized children’s entertainment with a simple set design, quiet dialogue, and a few hand puppets playing out everyday situations. The effect was  Mister Rogers created a relationship with millions of young viewers, each of whom felt as if they were visiting with a trusted friend. His radical kindness, acceptance, and empathy created a sacred place where everyone felt safe and valued. Featuring exclusive photographs; a guide to the characters, puppets, and episodes; original interviews; and rare ephemera,  Mister Rogers’ A Visual History  reveals how the show came together to have a deep impact on American culture. Discover wonderful anecdotes from Yo-Yo Ma and Wynton Marsalis as well as the actors, directors, art designers, producers, studio musicians, and more who devoted their careers to working with Fred. Chronicling the show's complete timeline—from its humble beginnings on WQED in Pittsburgh to its commemoration on the big screen in the feature film  A Beautiful Day in the Neighborhood , starring Tom Hanks, based on a screenplay written by Micah Fitzerman-Blue and Noah Harpster and directed by Marielle Heller—this incredibly comprehensive book celebrates both Fred Rogers and the wonderful legacy of  Mister Rogers’ Neighborhood .",
  "genres": [
    "Nonfiction",
    "History",
    "Art",
    "Biography",
    "Adult",
    "Tv",
    "Pop Culture"
  ],
  "author": "Fred Rogers Productions",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/43422739-mister-rogers-neighborhood"
}