{
  "title": "The Other Princess",
  "description": "I was eight years old when I found out I had a father. It was the same day I held my dead mother in my arms while praying her life wasn't really over. I was dropped into the middle of a new family not long after that. My dad, his wife, and their two kids to be exact. My new brother was ten years old and my sister was five. It doesn't take a genius to figure out I wasn’t supposed to be there. My family ended up bigger than that though. My dad was a member of the Aces High Motorcycle Club. From the very beginning I was ostracized because of who my mother had been. The daughters of club members were generally known as MC Princesses. My little sister was one. My title was a bit different, and proved that my mom's sins would always be held against me. I was The Other Princess. My family, both by blood and MC ties, did wrong by me so I walked away from them. That was until he came home from the Army. He tried to fix everything. He tried to win an unattainable heart that had shut down years earlier. I would know since it was my heart he was after. He didn't realize it would take a miracle. Secretly, I hoped I could still believe in miracles.  *Note: The Aces High Charleston Series should be read in order. While each book revolves around different members of the Aces High MC Family, they all follow along a timeline that will lead to spoilers if you skip around. They do not have to be read in any particular order with Aces High Books from other chapters (Dakotas, Cedar Falls, etc.)   Book 1: The Other Princess (available now)  Coming in 2019:  Book 2: A Love So Hard  Book 3: The Princess & the Prospect  Book 4: The Killing Ride  Book 5: A Twist of Fate  The Charleston Chapter Series of the Aces High MC Franchise deals heavily with internal family themes, and is not your typical MC against MC with romance thrown in book. This is a family drama. The family just so happens to live and breathe bikes and the MC lifestyle. The only things blown up in this book will be a few hearts. ;) You have been warned!  This is a full length novel at over 80,000 words for the story (not counting preview chapters for the next book).",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Abuse",
    "Audiobook",
    "Dark",
    "Friends To Lovers"
  ],
  "author": "Christine Michelle",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/43418530-the-other-princess"
}