{
  "title": "Split-Level",
  "description": "“Berger excels at showing her characters to be people who were raised in old-fashioned homes who are now confronting unconventional, risky life choices—and dealing with the stresses and absurdities that follow their decisions. A smart, nuanced novel about open marriage . . .”— Kirkus Reviews“Sande Boritz Berger sets a 1970s Jersey housewife on a provocative collision course in Split-Level, a sharp portrait of female empowerment. Through sensitive insights, a woman finds an honest version of herself after realizing that her ideas on the nuclear family have made her erase vital parts of her identity.”— Foreword Reviews (five-star review)In Split-Level , set as the nation recoils from Nixon, Alex Pearl is about to commit the first major transgression of her life. But why shouldn’t she remain an officially contented, soon-to-turn-thirty wife? She’s got a lovely home in an upscale Jersey suburb, two precocious daughters, and a charming husband, Donny. But Alex can no longer deny she craves more—some infusion of passion into the cul-de-sac world she inhabits.After she receives a phone call from her babysitter’s mother reporting that Donny took the teen for a midnight ride, promising he’d teach her how to drive, Alex insists they attend Marriage Mountain, the quintessential 1970s “healing couples sanctuary.” Donny accedes—but soon becomes obsessed with the manifesto A Different Proposition and its vision of how multiple couples can live together in spouse-swapping bliss. At first Alex scoffs, but soon she gives Donny much more than he bargained for. After he targets the perfect couple to collude in his fantasy, Alex discovers her desire for love escalating to new heights—along with a willingness to risk everything. Split-Level evokes a pivotal moment in the story of American matrimony, a time when it seemed as if an open marriage might open hearts as well.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Womens Fiction",
    "Literary Fiction",
    "Adult"
  ],
  "author": "Sande Boritz Berger",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/43427173-split-level"
}