{
  "title": "The Last Two: The Battle to Save the Northern White Rhinos",
  "description": "Meet Najin and Fatu—the last of the northern white rhinos—as well as the scientists, conservationists, and rangers who are fighting for the species’ survival. The last two remaining northern white rhinos, an already functionally extinct species, are kept behind three electrical fences and protected by a squad of rangers at the Ol Pejeta Conservancy in Kenya. Their names are Najin and Fatu. Both are descended from the last male northern white rhino, Sudan. Najin is his daughter, while Fatu is his granddaughter. Along with Sudan and another male named Suni, they were transferred to Kenya in 2009, in the hope that returning them to their natural habitat might help them regain their zest for life and reproduction. Unfortunately, things didn’t go to plan. With the deaths of Sudan and Suni, the northern white rhinos’ destiny is now in the hands of their Kenyan caretakers and a team of scientists at the BioRescue international consortium, which is developing and using several different techniques to resurrect the species, including assisted reproduction and stem cell technologies. The plan is to insert northern white rhino embryos into southern white rhino surrogate mothers as soon as possible. There is a real chance the first “new” northern white rhino baby will be born in late 2023. Will science prevail, or is it too late? Journalists Boštjan Videmšek and Maja Prijatelj Videmšek explore this question by taking readers on a journey through the history of the northern white rhinos. They introduce the rangers, conservationists, and scientists fighting for the future of the northern white rhinos and dissect what led the species to the brink of extinction, from wars and climate change to poaching and the black market. The Last Two offers hope for the future of the environment and the fight to save the many species that call Earth home.",
  "genres": [
    "Nature",
    "Animals"
  ],
  "author": "Boštjan  Videmšek",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/123826860-the-last-two"
}