{
  "title": "THE BROKEN RULES OF ENGAGEMENT",
  "description": "Pinky Thompson, a citizen from Phalaborwa, serving the Executive offices as a High Performance PA in one of the Major Copper Ore Mine, Palabora Mining Company in Limpopo, South Africa.I would like to express myself in a book through bottom up approach, to share with the world especially the entities my perspective based on tacit knowledge, discussions and experiences from my own life and I thought sharing these experiences will assist organizations to grow, make profit, create employment and continue sustaining economies in their countries.The book has been designed for entities as a practical guide to aid in outlining, exploring, and communicating the unfathomable glitches that may prevent many organizations to reach their full potential. “The Broken Rules of Engagement” is not meant to be the ultimate voice on organizational behaviour but rather a contribution to available resources on how entities may reinforce and call in the “Special Forces” to aid their survival. The book entails and exposes corporate flaws and positives Organisations, Management, Trade Unions and what Employees are engaged in on a daily basis. The recent Economic and Social factors propelled me to produce this Manuscript. The book has many benefits and it’s adaptable to any situation, regardless of the field of expertise be it Management or Employees level.The Book's would reap remarkable benefits and empower their Management teams and Employees on purchase of The Broken Rules of Engagement book. The book will also bring cohesion between Management and Employees and cultivate a happier workplace and increased productivity.GET YOURSELF A COPY! Be informed, fully developed and empowered to the point of readiness for you to attract great opportunities and unleash your full potential.Specific outcomes Maximising Human Capital.2. Business continuity & Resiliency planning.3. Optimise and benefit from improved productivity.4. Increased Ethical sensitivity. 5. Sustained cost reduction. 6. Cost-focused lean enterprise.7. Lean Process design.",
  "genres": [
    "Business"
  ],
  "author": "Pinky Thompson",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/43426258-the-broken-rules-of-engagement"
}