{
  "title": "Deliverance: A Novel",
  "description": "In the style of Naomi Novik and her Uprooted and Leigh Bardugo and her Shadow and Bone grishaverse comes The Deliverance Series-- and action packed historical fantasy series that keeps you on the edge of your seat with its twisty plot and rich cultural immersion. Fans of Diana Gabaldon and her Outlander series will appreciate this deep dive into history and culture. There is power in a name. On the Island of Nar, women hold only that power and little else. Though life is oppressive on the carefully controlled, male-dominated isle, it is all they ever known. It does not bother 23-year old Deliverance, as she has all she needs to be content. She, her mother, Catalyst, and her best friend Effie, are comfortable with their status as relative outsiders and walk circles around the patriarchy. Their names, not easily understood, leave them on the outskirts. But for them, independence is all they could ever want...Until one day a choice spirals their world out of control and Deliverance must find the courage to embark on a rescue mission to the perilous, unknown Outside. Not only does she find a world entirely foreign from that which she has imagined but must learn to navigate its treacherous waters, uncovering dark secrets about her world and her own family. In doing so, she learns about the nature of inequality, of misogyny, of tyranny, and most of all, of isolation. An action-packed adventure, Deliverance, tugs at the mind, asking tough questions about the nature of oppression. Through the twists and turns, Deliverance learns while some people support nefarious purposes, others are heroes and family in the making. Join Deliverance as she discovers the true power in a name.\"Unexpected! Surprising plot!\"\"I literally could not put it down!\"\"Masterful!\"\"Beautifully written. Looking forward to the next in the series!\"\"Poses tough questions.\" FantasyHistoric FantasyYA fantasy to adult fantasyMagical realismDystopianFantasy seriesWitchesMagicAdventureSpeculativeBy ordering this book, you are supporting small, disabled veteran owned business. Thank you for your support!",
  "genres": [
    "Fiction"
  ],
  "author": "Samantha Schinder",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/43428831-deliverance"
}