{
  "title": "Truth Eternal",
  "description": "Truth Eternal – The Heartfulness Way Series\nHave you ever wondered about the nature of the soul? And how your heart, mind, physical body and soul are connected? And what happens to the soul at the time of death? Have you wondered about the origin of consciousness? And how it manifests in minerals, plants, animals and human beings? In this philosophical treasure, Lalaji shares some profound insights on these topics, as well as on the creation of the universe, the evolution of human beings, and the pinnacle of human potential. This is yogic science at its most profound, a masterpiece of our time, by one of the great visionaries of the 19th and 20th century, Ram Chandra of Fatehgarh. TRUTH ETERNALis a masterpiece of our time. It illuminates the science of existence itself: shedding new light on consciousness, the mind, the soul, and on Vedic wisdom and our relationship with the Cosmos.This book beautifully describes the origins of the universe and our place in it, challenging our beliefs and ushering in a new era of spiritual enquiry.\nAbout the Author:\nRam Chandra of Fatehgarh was known to many as Lalaji. He was born in 1873 in Fatehgarh, Uttar Pradesh, North India. A great sage and spiritual scientist of the highest calibre, he became the first Heartfulness Guide. He was also a family man of perfect human etiquette and civility. Lalaji rediscovered the ancient art of Pranahuti or Yogic Transmission, which is the speciality of Heartfulness. By doing so, he revolutionized meditation practices so that all interested seekers can reach the highest approach in this lifetime. His discovery defines the modern era of spirituality, and the greatness of his contribution to humanity is yet to be revealed.\nBulk Order Discount.\n \n   Buy 10 or more to avail 15% Discount. \n   Buy 100 or more to avail 25% Discount. \n applied at checkout",
  "genres": [
    "Spirituality"
  ],
  "author": "Ram Chandra",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/43451658-truth-eternal"
}