{
  "title": "Predestined: Born for Greatness",
  "description": "As earth cycles around, numerous people remain in problems. Narcotics, alcohol, addictions, and sin are blamed. Youth is shamed for wrongdoing, when, negativity has overtaken our full attention. The underlining root is lack of understanding purpose. Aimlessly seeking answers, people never discover their full potential. Greatness is within you. Something screams that there is more than just getting by through life. Sadly, many individuals waste their time watching someone else’s life, missing their own mark. Predestined will ignite your inner passion. There is more than what you currently see. As you flip through these pages, you will meet the Author of life. You are not an accident. Indeed, a blueprint has been preset, but are you truly living it out to the fullest? Through personal storytelling and revelation, author Andrey Shapoval presents a Creator in new dimension. He speaks out of experience, and challenges to talk a step forth to discovering your destiny. Can you imagine the beauty of this world with every person functioning in their calling and becoming the person God intended them to be? Your existence on earth is a direct confirmation that God completed your destiny on earth. Your human birth has taken place in the physical realm because God has already finalized your fate in the spiritual realm. He longs for you to become a person after His heart, a person who accomplishes His will and the intentions He destined for your days in this generation. He called you for such a time as this. Andrey Shapoval, a renowned worldwide minister, global evangelist and founder of Flame of Fire Ministry travels to preach the Good News. Since the moment he encountered Jesus supernaturally, he has never been the same. Marked for the Kingdom of God, Andrey leads with a pastoral heart a growing team toward understanding life purpose. Highly influential, he believes we determine what will happen after us. A dreamer who is acting to leave a legacy and captivates listeners to live one life passionately to the fullest. One book can forever change your life. Stop in your busy world, and dive into discovering the truth. Your breath and body are God-given and hold a greater purpose than you even know. Your time is now to realize you are born for greatness.",
  "genres": [],
  "author": "Andrey Shapoval",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/43459110-predestined"
}