{
  "title": "Sapphire Flame",
  "description": "Fall in love with the best wolf in Savage Territory… Before Five Bridges, Grant had always been looking up. The stars had been his world. The stars. His wife. His students. Now he looked down. Down at the earth and the pine forest path as he raced on four paws. Down into a dominance battle sandpit where the females of his pack ran training drills. For six long, lonely years, he’d been looking down. He’d stared down at his wife’s torn-up body when she’d been mauled in the Graveyard. He’d held her as she died. She’d whispered to him to be strong and to watch his temper, that the women of the pack would need his vigilance and his protection if they were to survive. Ryan, his best friend, tried to give him advice. “You need a woman.” Ryan wasn’t wrong, but he wasn’t right either. Any mate he chose would become the target of the pack’s current alpha. Kryder brutalized his pack wolves and if Grant ever took a mate, Kryder would kill her and smile doing it. Ryan stood beside him now, but he’d fallen silent. Grant’s wolf instincts began rumbling. He sensed his friend was holding back. He turned and met Ryan’s dark eyes, they were nearly black as coal, like his hair. “Tell me.” Ryan lowered his voice. “Kryder got to the youngest female before we could. She was scratched and bleeding as all hell when we bundled her into the van. He’d used his claws to hold her in place.” Grant’s rage came to life like a sudden whirlwind. But he had to control his temper. If he lost it, Kryder would take him down for good and the pack would fall completely under his maniacal control. Grant was the only thing that stood between his pack and total destruction… SAPPHIRE FLAME ~ A hard-driving standalone tale of a powerful alpha wolf, wizard magic, a beautiful fae futurist, ghosts that help and bad guys that need to see the hot end of hell… SAPPHIRE FLAME ~ Hotter than a thousand suns, extremely sensual, wicked language, strong violence, 18+ Fall in love with the best wolf in Savage Territory. Alpha Grant is waiting for you…",
  "genres": [
    "Paranormal"
  ],
  "author": "Caris Roane",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/43448738-sapphire-flame"
}