{
  "title": "Night Wolf",
  "description": "Have you ever dreamed of entering a paranormal romance of your very own? In this personalized werewolf romance novel where you can customize the lead roles, a high school senior who's addicted to mystery novels discovers an antique book depicting a real-life series of unsolved crimes. Once she turns the pages, she's immediately swept back in time to 1892 England, landing in the midst of a sadistic criminal's reign of terror. Each full moon, the streets of London belong to an elusive killer who's targeting newcomers to the city. The locals call him 'The Beast', possibly even an inhuman creature—and our modern young woman might be the next victim. Suspecting a Jack the Ripper copycat, our personalized heroine struggles to fit in as a Victorian lady while seeking answers to the crimes. She soon clashes with one of the investigators on the case: a brilliant, sophisticated and somewhat arrogant young detective a la Sherlock Holmes. But this seeming hero is hiding a dark secret, a cursed existence that may prove fatal to himself and our heroine.The detective's secretive nature intrigues our heroine, and they're drawn together by their immediate heated chemistry. But the more he tries to keep his distance, the closer their bond grows. Soon she's nearly as obsessed with solving the riddle of his existence as with capturing the murderer who's stalking the neighborhood.The mysteries collide when our heroine realizes that the trail of clues in the murder investigation leads right to the hero's door. Is the detective's elegant facade hiding a monster? Has our heroine given her heart to a beast?From a glittering opera gala to a creepy Victorian morgue, from wealthy but warped sophisticates to poor but savvy urchins, and from one man's supremely rational mind to the savage desperation of a prowling werewolf... Night Wolf takes you on a sexy, haunting journey. The personalization aspect lets you play the role of our brave, determined heroine, the enigmatic, tortured hero, or the heroine's mysterious yet kind friend. Whichever part you play, you'll find yourself in the thick of this unique romantic thriller.",
  "genres": [
    "Time Travel"
  ],
  "author": "Kira Lerner",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/12383191-night-wolf"
}