{
  "title": "The Association",
  "description": "THE ASSOCIATION IS A NATIONAL INDIE EXCELLENCE AWARDS 2019 FINALIST IN THE LEGAL THRILLER CATEGORY!A YOUNG FEMALE ATTORNEY TAKES ON A POWERFUL HOMEOWNERS ASSOCIATION AND UNCOVERS FRAUD, MYSTERY, AND MURDER!Champaign, Georgia, Davis County: A young attorney and her husband have relocated to the small, idyllic town for his new job, and she’s on an extended hiatus after becoming exhausted and weary of her profession. Yet she knows she needs to get back in the legal game, even though it won’t be easy. Now discouraged and out of practice, she must start fresh, with new determination and new clients.Through an acquaintance, she meets the Wainrights, an older couple living in Covington Commons, a cluster of three neighborhoods advertised as a luxury lakeside community. In truth, though, such a description only applies to one neighborhood in Covington Commons: Eagle’s Nest. Both Mockingbird Heights and Peacock Plains have become sad displays of utter neglect, in awful disrepair after years of inattention. The Wainrights need her help to prove allegations as to the person—or persons—responsible for it. After painstaking research into claim after claim, she soon realizes the obviously guilty party.At the forefront, is the Association—the board and committee members who oversee everything and every decision at Covington Commons. Its members have taken what was once a decent organization and turned it into an operation based entirely on corruption and dishonesty that operates according to the whims and greed of only a privileged few.With prejudicial and biased purveyors of justice at the helm, prior lawsuits against the Association have been routinely dismissed early on. Our attorney heroine must find it within herself to navigate and succeed in a world where grossly confident men grandstand in gold jewelry, private investigators are always listening, and judges are not honorable—a world where people aren’t at all who they seem to be.",
  "genres": [],
  "author": "Sharon Ann Ziegler",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/43453815-the-association"
}