{
  "title": "The Time In Between",
  "description": "In search of love, absolution, or forgiveness, Charles Boatman leaves the Fraser Valley of British Columbia and returns mysteriously to Vietnam, the country where he fought twenty-nine years earlier as a young, reluctant soldier. But his new encounters seem irreconcilable with his memories.When he disappears, his daughter Ada, and her brother, Jon, travel to Vietnam, to the streets of Danang and beyond, to search for him. Their quest takes them into the heart of a country that is at once incomprehensible, impassive, and beautiful. Chasing her father’s shadow for weeks, following slim leads, Ada feels increasingly hopeless. Yet while Jon slips into the urban nightlife to avoid what he most fears, Ada finds herself growing closer to her missing father — and strong enough to forgive him and bear the heartbreaking truth of his long-kept secret.Bergen’s marvellously drawn characters include Lieutenant Dat, the police officer who tries to seduce Ada by withholding information; the boy Yen, an orphan, who follows Ada and claims to be her guide; Jack Gouds, an American expatriate and self-styled missionary; his strong-willed and unhappy wife, Elaine, whose desperate encounters with Charles in the days before his disappearance will always haunt her; and Hoang Vu, the artist and philosopher who will teach Ada about the complexity of love and betrayal. We also come to learn about the reclusive author Dang Tho, whose famous wartime novel pulls at Charles in ways he can’t explain. Moving between father and daughter, the present and the past, The Time in Between is a luminous, unforgettable novel about one family, two cultures, and a profound emotional journey in search of elusive answers.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Canada",
    "Book Club",
    "War",
    "Canadian Literature",
    "Family",
    "Historical Fiction"
  ],
  "author": "David Bergen",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/434755.The_Time_In_Between"
}