{
  "title": "Shakedown: How Our Government is Undermining Democracy in the Name of Human Rights",
  "description": "Winner of the Writer's Trust of Canada / Samara's - Best Canadian Political Book of the Last 25 YearsPart memoir, part investigative journalism, this is a shocking and controversial look at the corruption of Canada’s human rights commissions.“On January 11, 2008, I was summoned to a 90-minute government interrogation. My crime? As the publisher of Western Standard magazine, I had reprinted the Danish cartoons of Mohammed to illustrate a news story. I was charged with the offence of “discrimination,” and made to appear before Alberta’s “human rights commission” for questioning. As crazy as it sounds, I became the only person in the world to face legal sanction for printing those cartoons.”As a result of this highly publicized event, Ezra Levant began investigating other instances in which innocent people have had their freedoms compromised by bureaucrats presuming to protect Canadians’ human rights. He discovered some disturbing and even bizarre cases, such as the tribunal ruling that an employee at a McDonald’ s restaurant in Vancouver did not have to wash her hands at work. And the human rights complaint filed by a Calgary hair stylist against the women at a salon school who called him a “loser.” In another case that seemed stranger than fiction, an emotionally unstable transvestite fought for — and won — the right to counsel female rape victims, despite the anguished pleas of those same traumatized victims. Human rights commissions now monitor political opinions, fine people for expressing politically incorrect viewpoints, censor websites, and even ban people, permanently, from saying certain things.The book is a result of Levant’s ordeal and the research it inspired. It shows how our concept of human rights has morphed into something dangerous and drastically different from its original meaning. Shakedown is a convincing plea to Canadians to reclaim their basic liberties.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Law",
    "History",
    "Canada",
    "Political Science"
  ],
  "author": "Ezra Levant",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/4349004-shakedown"
}