{
  "title": "The Joy of Politics: Surviving Cancer, a Campaign, a Pandemic, an Insurrection, and Life's Other Unexpected Curveballs",
  "description": "An intimate and revelatory memoir—on personal challenges, political turmoil, and the state of American democracy—from one of the most effective voices in politics, Amy Klobuchar.During the past few years, as our country has faced unprecedented challenges, Senator Klobuchar has been in the room where it happens—on the Senate floor for critical votes during the pandemic, at the debate podium during one of the most critical presidential elections in US history, and in the Capitol on January 6, 2021, when insurrectionists stormed the building, interrupting the certification of the electoral college. It was well past midnight when Klobuchar stood beside then-Vice President Pence to officially certify President Biden's victory.In her candid, honest, and at times bitingly funny memoir, the pragmatic senator shares insider stories from these historic moments, while also inviting readers into her personal life. An underdog in the 2020 Democratic presidential primary campaign, she built surprising early momentum--only to suspend her candidacy in order to support Joe Biden. Within weeks of returning to work in the Senate, the sudden onslaught of COVID-19 hit her family directly. Her husband got very sick and spent a week in the hospital on oxygen and a month in isolation. Klobuchar shares her experience facing a cancer diagnosis while watching her beloved father succumb to Alzheimer's. She recounts the dramatic narrative of January 6 and how close we came to losing our democracy. And, with her signature humor, she reveals what it's like to work with some of her more...well, interesting...colleagues.At the crux of these stories is a narrative of resilience – of personal resilience and the resilience of a nation – and, improbably, joy.",
  "genres": [
    "Politics",
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Autobiography",
    "History"
  ],
  "author": "Amy Klobuchar",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/123840382-the-joy-of-politics"
}