{
  "title": "Henry David Thoreau: A Week, Walden, The Maine Woods, Cape Cod",
  "description": "This Library of America edition collects for the first time in one volume the four full-length works in which Henry David Thoreau combined his poetic sensibility, classical learning, philosophical austerity, and Yankee love of practical detail into literary masterpieces on humanity’s communion with nature.A Week on the Concord and Merrimack Rivers is based on a boat trip Thoreau took with his brother in 1839 from Concord, Massachusetts, to Concord, New Hampshire. Ten years in the writing (it was the book he retired to Walden to work on) and incorporating essays, passages from his journal, and some of his best poems, it is a superbly crafted achievement, its texture enriched by the idealism of the Transcendentalists, the delighted wordplay of an imaginative linguist, the individualism of a young America, and the earthiness of a lover of nature.Walden is a personal declaration of independence, a social experiment, and a voyage of spiritual discovery, set within the seasonal cycle of a year’s “Life in the Woods.” “Simplify, simplify” is the beat of its “more distant drummer”—to abandon waste and illusion, to get to the bottom of life’s essential needs, and to practice a new economy for humane living. Its witty and pointed rhetoric brings together language and nature, the human and nonhuman in unusual conjunctions that resonate with symbolic meanings. A manual of self-reliance as well as a masterpiece of style, it is one of the most fervently loved classics of American literature.The Maine Woods is an account of three trips taken by boat and canoe in 1846, 1853, and 1857 through an unexplored interior bypassed by westward expansion. It describes the virgin rivers and forests of Maine, the customs of woodsmen and Indian guides, the hunting of moose, and the effects of the timber industry and encroaching settlement. An early and eloquent plea for conservation by a far-sighted naturalist, its close observation of the American wild becomes an examination of “the motives which carry men into the wilderness.”Cape Cod is the bleakest of Thoreau’s works, resembling Melville’s prose in its vision of the titanic indifference of nature. Cape Cod appears as both ocean and desert, a vast expanse of shipwrecks and barren soil, peopled by hardy, weathered inhabitants who seem survivors from the age of the first Pilgrims. Based upon his own visits and upon accounts from the earliest times, it is an unsentimental study of human endurance in the face of hostile elements, historical change, and natural decay.",
  "genres": [
    "Classics",
    "Philosophy",
    "Nonfiction",
    "Nature",
    "Literature",
    "Essays",
    "Travel"
  ],
  "author": "Henry David Thoreau",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/123840.Henry_David_Thoreau"
}