{
  "title": "The Bedlam Detective",
  "description": "Madmen see monsters – and monsters hide in plain sight From a basement office in London’s notorious Bethlehem Hospital, Sebastian Becker investigates wealthy eccentrics whose dubious mental health may render them unable to manage their own affairs. His interview with rich landowner Sir Owain Lancaster, whose sanity has been in question since a disastrous scientific adventure in the Amazon killed his family and colleagues, coincides with the disappearance of two young local girls. When the children are found slain, Lancaster claims that the same dark forces that devastated his family have followed him home. It is not the first time that children have come to harm in his rural countryside town, though few are willing to speak of incidents from the past. Becker must determine whether this mad nobleman is insane and a murderer, or if some even more sinister agency is at work.   Struggling on his small salary, and with unexpected help from a son who needs special care, Becker and his wife make sacrifices so Becker can stay on the case after an innocent man is convicted of the crime. The answers he seeks may be found with the assistance of the local investigator and a young suffragette who fled Arnmouth, but couldn’t flee the horrors she encountered there.    From dank asylums to the lush and treacherous Amazon, through the makeshift studios of the early film industry and a traveling fair of freaks and illusions, Sebastian Becker’s search for answers brings him face to face with madmen and monsters, both imagined and real. Confronting immense danger in his hunt for the truth, he will explore murder, tragedy, and the tempestuous depths of his own mind.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "Stephen Gallagher",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/12384004-the-bedlam-detective"
}