{
  "title": "Never Sorry Ever Jolly",
  "description": "What do you get when you mix dating with refugee camps, freedom fighters, and a thousand pairs of googly eyes?Collin Uttley’s summer vacation.Honestly, I didn’t set out to be an imposter. I just wanted to meet girls. Why else would an atheist join a church youth group? (It sure wasn’t for the coffee.) And it paid off—I met Shelby Wanderal, the soul mate I never knew existed. When I found out she was spending her summer working with orphans in refugee camps on the Thai-Burma border—guess who joined the outreach team? And you better believe I didn’t let a little thing like the Expected Behavior Guidelines cramp my style. Not even Rule #1: No romantic entanglements allowed. But I gotta admit I didn’t expect a rival—my summer would have gone a whole lot smoother if Twain Abernathy had stayed home.Or if I hadn’t tried the betel nut.Or if I’d listened to the advice of the Freedom Fighters.Or if—nope, you’ll just have to read the story of my crazytown adventure… people say it makes them laugh. I’m just not sure if that means with me or at me.From the author of CARPE DIEM comes another YA romantic comedy adventure set in Southeast Asia, NEVER SORRY EVER JOLLY, based on her own outreach experiences in Thailand and Burma. Praise for Autumn’s first novel:“This is self-confessed travel junkie Autumn Cornwell's first novel—and she's hit one out of the park.”―The Washington Post“Suspenseful and wonderfully detailed, the well-crafted story maintains its page-turning pace while adding small doses of cultural insight and humor.”―School Library Journal, Starred ReviewALL HE WANTED WAS A DATE.In the new YA romantic comedy adventure, NEVER SORRY EVER JOLLY, homeschooled and unchurched seventeen-year-old Collin Uttley moves to SoCal (Southern California) and joins a church youth group out of sheer desperation for a social life. To fit in with the rest of the high schoolers and to increase his odds of scoring a girlfriend, he pretends to be a “believer” and attends every single group activity—even blindfold dodge ball. His tenacity soon pays off when he meets the girl of his dreams, Shelby Wanderal, who shares his enthusiasm for vintage clothing and swing dancing. When Collin finds out Shelby’s going on a summer outreach trip to help refugees on the Thailand-Burma border, he fakes his way onto the team, thinking it’s the perfect opportunity to win her over. However, things don’t go exactly as planned… to say the least.EDITORIAL REVIEWSPraise for Autumn Cornwell’s first YA romantic comedy adventure, CARPE DIEM: \n   “This is self-confessed travel junkie Autumn Cornwell's first novel—and she's hit one out of the park.”―The Washington Post \n   “Suspenseful and wonderfully detailed, the well-crafted story maintains its page-turning pace while adding small doses of cultural insight and humor.”―School Library Journal, Starred Review \n   “Take a traveler as reluctant as Anne Tyler's accidental tourist and add the number of misadventures found in The Out-of-Towners, and you have the recipe for Cornwell's hilarious, adventure-packed first novel….",
  "genres": [
    "Fiction"
  ],
  "author": "Autumn Cornwell",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/43504159-never-sorry-ever-jolly"
}