{
  "title": "The Watchers",
  "description": "Just below the surface among the family of God lives another family tree--one traced in spirit, invisible and ageless, known as the Watchers. For two thousand years they've seen beyond the veil separating this world from the next, passing on their gift through a lineage mostly overlooked. Throughout history they've scouted the borders of the supernatural frontier, but now their survival hangs by a thread. And their fate lies in the hands of a young woman, her would-be killer, and a mystery they must solve.... \"Congratulations. You just reached my own little corner of cyberspace. Who am I? Abby Sherman, that's who. Who are you? And why are you checking me out? Drop me a few pixels, and let's find out!\" With that innocent invitation, Abby Sherman unwittingly steps in the crosshairs of history, and thus begins her harrowing tale--taking her from ocean-front Malibu to the streets of London, the jungles in West Africa, the Temple Mount, Jerusalem, and to the very gates of heaven itself! A sneak preview of eternity becomes her one-way ticket to danger--and discovery…. Two lives collide in a globe-circling adventure involving both peril and Abby, a young woman whose visions of heaven turn her into a Web-celebrity; and Dylan, a troubled young man sent by an ancient foe to silence her. From California beachfronts to Nigerian rain forests to Jerusalem and back again, The Watchers is high-octane blends of action, mystery, and spiritual battle spanning centuries. A woman's awe-inspiring vision launches her on a quest through distant lands and ancient history, face-to-face with eternity and into the arms of a family line on the brink of annihilation... A man who is hired to exterminate her discovers the folly of blind loyalty, then learns how to wage war in a realm he never believed had existed... An extraordinary saga of the unseen war against evil, the reality of the supernatural, and the transforming power of forgiveness",
  "genres": [
    "Christian Fiction",
    "Christian",
    "Fiction",
    "Fantasy",
    "Suspense",
    "Thriller",
    "Spirituality"
  ],
  "author": "Mark Andrew Olsen",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/435126.The_Watchers"
}