{
  "title": "Freak Like Me: Confessions of a 90s pop groupie",
  "description": "In nineties small-town Surrey, watching Top of the Pops was Malcolm's only escape from boredom and the bullies at school... until a phone call from a pop star changed his life forever. Before long, he was getting compliments from Beyoncé, hanging out at award ceremonies with Posh Spice's mum and sneaking onto All Saints' tour bus. Freak Like Me is the true story of one teenage pop fan who, with a group of like-minded outcasts, witnesses the disposable music industry of the late nineties and early noughties first-hand. Tracking down A-lister itineraries, he gets to meet the real personalities behind the Smash Hits posters adorning his bedroom walls.This hilarious memoir is packed with scandalous gossip and poignant memories from the era of Nokia 3310s and dial-up Internet, when chart positions meant everything and, if you wanted to know what your idols were up to off-screen, you had to track them down yourself in real life!\"A hilarious, nostalgic memoir packed full of scandalous gossip. We couldn't put it down!\" Closer magazine\"Pop fans, this one is for you.\" GQ magazine\"Malcolm’s memoir of his time as a teenage superfan around the turn of the millennium offers a fascinating, funny and often unexpected journey through several shifts in pop, as he views the changing world through a life of pop fandom.\" Complete Music Update\"I love this book.\" Jamie East, talkRADIO\"Loved it...if you call yourself a hun, you NEED to read this book.\" Hunsnet\"Hilarious...packed full of gossip.\" Bella magazine\"Devoured it...so, so fun. Brought back so many memories of pop music as an escape as a lonely gay teen. Loved all the insight into how late 90s/00s popstars were with fans.\" Conor Behan, DJ RTÉ 2FM and Popsessed podcast\"Freak Like Me is brilliant...an amazing read!\" Right Back At Ya! (2000s pop music podcast)\"Freak Like Me has you hooked from the opening chapter...a laugh out loud, and endearing coming of age novel about a young teen finding himself, coming out and how the celebrities of the 90s helped him figure out and accept who he was. An absolute must-read, for lovers of 90s and early 00s pop music, and those who have ever wondered what it would be like to meet their idols.\" Fuzzable\"I sat there in bed reading it, bursting out laughing...the way he writes speaks to the young queer kids and outcasts of that era...a must-read for any 90s pop head.\" Aural Fixation podcast",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography"
  ],
  "author": "Malcolm   McLean",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/43494832-freak-like-me"
}