{
  "title": "The Friend",
  "description": "An asexual man meets a male model... and slowly falls in love.   Mark, the model, has not been challenged in his life and is emotionally withdrawn. He returns to Chicago in the hopes of reconnecting with his college friends, but everyone has moved on without him, starting families and growing up.  Chris, the writer, is socially awkward and introverted. He actively tries to be as invisible as possible.  The two men meet one day in Chris' favorite park and strike up a friendship. Since this is written as a romance, you probably have a pretty good idea where the story goes from there.  You'd be wrong. (Well... and kinda right.)  I'm Chris and this is my story. It's not a traditional romance. This is my version of a Happily Ever After, which means Mark and I became great friends... and that's it.  Mark and I end this first installment of my self-portrait in a Queer Platonic Relationship. There was cuddling and emotional closeness, but nothing remotely sexual... at least not to my mind. Mark obviously wanted more and he would eventually get it, but this book, Book One of It's Just Us Here, would have been my perfect, ideal romance.  If you need banging and crazy monkey sex to keep your interest in a story, then jump in at Book Four of this self-portrait (The Lover). Otherwise, come along for the ride and meet the man who would sweep me off my feet, Mark Wolff, one of the top ten most self-absorbed men in the whole world.  [NOTE: This book is a 95,000 word romantic self-portrait featuring the beginnings of a queer relationship. It is the first book of a trilogy, which is itself part of a larger trilogy. Low heat... for now. I don't think we need trigger warnings for this book, but future installments might warrant them. Maybe that can serve as enough of a warning? Warning: this book is full of life.]",
  "genres": [
    "M M Romance",
    "Romance",
    "Asexual",
    "Memoir",
    "Contemporary",
    "LGBT",
    "Nonfiction"
  ],
  "author": "Christopher X. Sullivan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/43517750-the-friend"
}