{
  "title": "Dad Jokes: St. Patrick's Day Gift Book",
  "description": "Ralph Lane is an incredibly funny fellow, and his joke books are cherished by young and old alike. Everyone loves receiving one of Ralph’s hilarious illustrated Dad Jokes books for birthdays and holidays. Now Ralph has created a new gift book for St. Patrick’s Day. The \"Dad Jokes St. Patrick’s Day Gift Book\" includes leprechaun puns, shamrock riddles and Irish knock knock jokes. Your friends and family will love this light-hearted look at all things St. Patrick including some Ralph Lane originals such What does a leprechaun call The Incredible Hulk? A Not-So-Jolly Green Giant You were thrilled by the original \"Dad Jokes Gift Book,\" you celebrated the \"Dad Jokes Christmas Gift Book\" and you fell madly in love with the \"Dad Jokes Valentine’s Day Gift Book.\" Now it’s time to make everyone green with envy when they see that you’re the first in your neighborhood to pick up Ralph Lane’s \"Dad Jokes St. Patrick’s Day Gift Book.\" It’s better than a pot o’ gold at the end of the rainbow. Best of all, you’ll finally be able to answer these important philosophical How did the Irish jig get started? Who was the leprechaun’s favorite super hero? How can Ralph Lane tell if an Irishman likes his dad jokes? When is an Irish potato not an Irish potato? Why did the leprechaun cross the road? Why did St. Patrick drive the snakes out of Ireland? It just wouldn't be a holiday without inviting Ralph Lane into your house for fun and laughter. So when you buy the \"Dad Jokes St. Patrick's Day Gift Book\" for your friends, family and colleagues, don't forget to pick up a copy for yourself. They say the only thing luckier than an Irish four-leaf-clover is having the entire Ralph Lane joke book series sitting on the your bookshelf (or back of your toilet at least). So be a lucky leprechaun and pick up your annual supply of Ralph Lane Dad Jokes books for all the holidays.",
  "genres": [
    "Humor",
    "Jokes",
    "Holiday",
    "Irish Literature",
    "Teen"
  ],
  "author": "Ralph  Lane",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/43514760-dad-jokes"
}