{
  "title": "It's a Mad, Mad, Mad, Mad Trip: On the Road of the Longest Two-Week Family Road Trip in History",
  "description": "Goodreads Top 25 Best Adventure Road Trip Books, Top 150 Best Road Trip Books, 2022. Updated in 2023.There are road trips. And there are road odysseys .Not too long ago, journalist and single dad Kevin Shay took his two kids on the latter, a 17-day adventure across the United States and back in their aging Honda CR-V. On the almost 7,000-mile journey, they visited some of the nation's best attractions, such as the Grand Canyon, Mount Rushmore , and the Corn Palace in South Dakota.But this book is much more than a travelogue on how they managed to drive across the Southwest desert at night without encountering a dead body. The Shays provide answers to some of humanity’s most bewildering mysteries. For one, just how did Billy Graham obtain a Hollywood Walk of Fame star when he has spent much of his life ranting against the alleged sins of Tinseltown?They introduce Mad Trip Tips. “Make sure you control the radio,” advises 13-year-old Preston. “You don't want to listen to some old-fashioned music the whole time.” As her father and brother tour the Pro Football Hall of Fame, 10-year-old McKenna advises, “Bring your iPod, a book, or something else to look at while your brother and Dad are taking too much time here.” You think you can get that from some Fodor's travel guide?The Shays also offer Mad Trip Fun Facts, lending insight into North America's most popular national parks, museums, and theme parks, tallest skyscrapers, deadliest storms, and more. There are important trivial facts, as well as long lists of resources and attractions, from the obvious to hidden gems.As a bonus, the last chapter details another 17-day road odyssey the Shays took through mostly new territory in 2022, proving they still were willing to tackle this type of journey. They were older, but not necessarily wiser.",
  "genres": [],
  "author": "Kevin J. Shay",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/43523973-it-s-a-mad-mad-mad-mad-trip"
}