{
  "title": "Love And Other Battles",
  "description": "'Emotional, compelling' 'Compulsively readable' 'Utterly unputdownable' 'A must-read for all fiction lovers' ...1969: Free-spirited hippie Jess James has no intention of falling for a soldier ... but perhaps some things are not in our power to stop.1989: Jess's daughter, Jamie, dreams of a simple life - marriage, children, stability - then she meets a struggling musician and suddenly the future becomes wilder and complex.2017: When Jamie's daughter, CJ, brings home trouble in the form of the coolest boy at school, the worlds of these three women turn upside down ... and the past returns to haunt them.Spanning the trauma of the Vietnam War to the bright lights of Nashville, the epidemic of teenage self-harm to the tragedy of incurable illness, Love and Other Battles is the heart-wrenching story of three generations of Australian women, who learn that true love is not always where you seek it.If you loved The Notebook, this is a novel for you.PRAISE FOR LOVE AND OTHER BATTLES'Emotional, compelling' Carina Bruce, Herald Sun'A warm and affecting tale about love and family conquering all' Who Weekly'Compulsively readable' Kate Cuthbert, Books + Publishing'Utterly unputdownable, Love and Other Battles is equal parts heartwarming and heart-wrenching. Featuring stunningly real multilayered characters, Tess Woods weaves a bittersweet story of family secrets, epic love and heartache in this absolutely gorgeous new novel' Nicola Moriarty, author'I loved these strong, flawed and totally relatable women. The way their decisions, past and present, hooked in the reader, is a testament to Tess Woods' writing' Melina Marchetta, author'Tess Woods has written a timeless story of love's strength and endurance. A must-read for all fiction lovers' Cheryl Akle, Director, Better Reading'Tess Woods has done it again with emotionally engaging Aussie fiction. Smiling with tears - five stars' Renee Conoulty, Hey Said Renee'This is contemporary fiction at its finest and I am so grateful to Tess Woods for her bravery in writing a novel that takes readers right into the crux of current social and medical issues, things that so many of us are dealing with but keep quiet about for fear of judgment and contempt' Theresa Smith Writes'a writer who is a clear figurehead and spokeswoman of our times' Mrs B's Book Reviews",
  "genres": [
    "Romance",
    "Historical",
    "Historical Fiction",
    "Womens Fiction",
    "Fiction",
    "Contemporary",
    "War"
  ],
  "author": "Tess Woods",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/43518901-love-and-other-battles"
}