{
  "title": "Social Animal",
  "description": "Innocence is a beautiful thing, unless it hinders you from acknowledging the real dangers of an alien and untamed world.  The banda are playful yet dangerous equine creatures native to Cassiopeia. Their natural curiosity has finally negated their timidity or fear of the citizens of the Cepheus colony. A deadly visit was bound to happen one day and that day was finally upon them. These colonists would understandably risk their lives for the people they love and when it comes to a potential banda attack, they'd do that without question! Someone is going to sacrifice what they have for the hero of the Cepheus Colony. Ani Maxima, however, isn’t the sort of person to just accept what's happened. She is going to fight for that hero and demand that the hero fights for her! After all, just like the rodents living under the porch, she’s a social animal. She requires social interaction to survive. Take away her loved ones, and you take away her life. The Ani Maxima Files: Ptolemy’s Child SuperVirus Veiled Sky Enigma Flying in the Rain Silent Lucidity Flesh and Blood Soul Sister Social Animal   The entire Ani Maxima series was voted in the top 10 for \"Best Kindle Space Opera\" and \"Best Amazon Prime Books to Borrow\" by Goodreads!  Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Maelstrom, Endeavor, and Ghosts of Ophidian. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Hope Rising, One Crazy Summer, and Terraformer by McElhaney.   EDITORIAL REVIEWS:   \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review  \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher  Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/43520167-social-animal"
}