{
  "title": "Nestwärme, die Flügel verleiht: Halt geben und Freiheit schenken - wie wir erziehen, ohne zu erziehen",
  "description": "Nestwärme, die Flügel verleiht – Die Beziehung stärkenEin Buch für alle Eltern, die sich wünschen, dass ihre Kinder zu starken und glücklichen Persönlichkeiten heranwachsen.Vom Kleinkindalter bis in die Pubertät: Wie Eltern die Balance zwischen Bindung und Loslassen finden. Wie sie ihren Kindern gleichzeitig Wurzeln und Halt geben und Flügel und Freiheit schenken können.Das Konzept vom „inneren Kind“ angewendet auf die Erziehung – von den zwei erfahrenen Psychologinnen Stefanie Stahl (Das Kind in dir muss Heimat finden, Jeder ist beziehungsfähig) und Julia Tomuschat. Erziehen, ohne zu erziehen – so lässt sich ein wichtiges Anliegen von Nestwärme, die Flügel verleiht auf den Punkt bringen. Weil Eltern heute ohnehin schon unheimlich vielen Pflichten und Ansprüchen genügen müssen, will dieses Buch ihnen nicht noch mehr Erziehungsratschläge aufhalsen, sondern es will sie entlasten. Entlasten, indem es sie dazu bewegt, die Beziehung zu ihren Kindern und sich selbst zu reflektieren. Sich selbst besser verstehen – für die KinderDa es heute kaum noch Großfamilien gibt und sich auch nicht ein ganzes Dorf um ein Kind kümmert, sind Eltern und Kinder in der Kleinfamilie stärker auf sich gestellt, und die Kinder sind den Ecken und Kanten ihrer Eltern oder Bezugspersonen mehr denn je ausgeliefert. Umso wichtiger ist es, als Vater oder Mutter mit sich im Reinen zu sein und sich der eigenen Prägungen und Glaubenssätze bewusst zu werden. So können Eltern ihre Kinder nicht nur durch die Brille der eigenen Ansprüche und Bedürfnisse sehen, sondern sie können erkennen, was ihre Kinder tatsächlich brauchen. Das Buch hilft mit konkreten Fragestellungen und Reflektionen dabei, den Blick auf sich selbst und die Eltern-Kind-Beziehung zu werfen. Je besser Eltern sich selbst im Auge haben, desto leichter können sie durchatmen und ihren Kindern gute, authentische und liebevolle Eltern sein. Es geht weniger darum, etwas zu TUN, als vielmehr bewusster zu SEIN.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "German Literature"
  ],
  "author": "Stefanie Stahl",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/43518318-nestw-rme-die-fl-gel-verleiht"
}