{
  "title": "The Bullet Swallower",
  "description": "A dazzling magical realism western in the vein of Cormac McCarthy meets Gabriel García Márquez, The Bullet Swallower follows a Mexican bandido as he sets off for Texas to save his family, only to encounter a mysterious figure who has come, finally, to collect a cosmic debt generations in the making.In 1895, Antonio Sonoro is the latest in a long line of ruthless men. He’s good with his gun and is drawn to trouble but he’s also out of money and out of options. A drought has ravaged the town of Dorado, Mexico, where he lives with his wife and children, and so when he hears about a train laden with gold and other treasures, he sets off for Houston to rob it—with his younger brother Hugo in tow. But when the heist goes awry and Hugo is killed by the Texas Rangers, Antonio finds himself launched into a quest for revenge that endangers not only his life and his family, but his eternal soul. In 1964, Jaime Sonoro is Mexico’s most renowned actor and singer. But his comfortable life is disrupted when he discovers a book that purports to tell the entire history of his family beginning with Cain and Abel. In its ancient pages, Jaime learns about the multitude of horrific crimes committed by his ancestors. And when the same mysterious figure from Antonio’s timeline shows up in Mexico City, Jaime realizes that he may be the one who has to pay for his ancestors’ crimes, unless he can discover the true story of his grandfather Antonio, the legendary bandido El Tragabalas, The Bullet Swallower. A family saga that’s epic in scope and magical in its blood, and based loosely on the author’s own great-grandfather, The Bullet Swallower tackles border politics, intergenerational trauma, and the legacies of racism and colonialism in a lush setting and stunning prose that asks who pays for the sins of our ancestors, and whether it is possible to be better than our forebears.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Magical Realism",
    "Westerns",
    "Fantasy",
    "Historical",
    "Audiobook"
  ],
  "author": "Elizabeth Gonzalez James",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/123847255-the-bullet-swallower"
}