{
  "title": "Harry Potter and the Goblet of Fire",
  "description": "Dragons! Daring! Danger! The first fully illustrated edition of Harry Potter and the Goblet of Fire is an extraordinary creative achievement by two extraordinary talents. Jim Kay's inspired reimagining of J.K. Rowling's classic series has captured a devoted following worldwide, and the drama just gets bigger as the series progresses. With over 150 illustrations, Jim Kay's unique vision delivers breathtaking scenes and unforgettable characters – including fan favourites Cedric Diggory, Fleur Delacour and Viktor Krum illustrated by Jim Kay for the first time.Fizzing with magic and brimming with humour, this full-colour edition will captivate fans and new readers alike as Harry, now in his fourth year at Hogwarts School of Witchcraft and Wizardry, finds himself competing in the legendary Triwizard Tournament and facing death-defying tasks, dragons and Dark wizards… Making magic in paint, pencil and pixels, this is the Wizarding World as we have never seen it before.“Seeing Jim Kay's illustrations moved me profoundly. I love his interpretation of Harry Potter's world, and I feel honoured and grateful that he has lent his talent to it” – J.K. Rowling“Kay's illustrated edition of Harry Potter and the Philosopher's Stone is a triumph – a book so alive it seems to jump, explode and slither out of your hands as you read” – Telegraph on HARRY POTTER AND THE PHILOSOPHER'S STONE ILLUSTRATED EDITION“It is stunning … with full-colour illustrations throughout from Greenaway Medal winner Kay, who breathes incredible life into these much-loved characters and locations, staying faithful to Rowling's vision but revitalising the story for a new generation” – Bookseller on HARRY POTTER AND THE PHILOSOPHER'S STONE ILLUSTRATED EDITION“One of the greatest literary adventures of modern times” – Sunday Telegraph",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Magic",
    "Childrens",
    "Audiobook",
    "Middle Grade"
  ],
  "author": "J.K. Rowling",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/43522317-harry-potter-and-the-goblet-of-fire"
}