{
  "title": "Mythologica: An Encyclopedia of Gods, Monsters and Mortals from Ancient Greece",
  "description": "An illustrated encyclopedia of Greek mythology like no other, Mythologica features startlingly beautiful and exquisitely otherworldly portraits of mythological characters in eye-popping color from artist Victoria Topping and authoritative text from Classics scholar and Greek mythology expert Dr. Stephen Kershaw. Uncover the colorful lives of 50 powerful gods and goddesses, earth-dwelling mortals, and terrifying monsters as you journey back in time to ancient Greece. From the fearless Athena and her meddlesome ways to the brave and bold Odysseus and his remarkable journey home, discover why these incredible stories are still a part of our culture today. Listed alphabetically, each boldly designed spread presents a figure from the myths, including their name in Greek, their defining attributes, and a summary of their story, along with multiple sidelights that provide additional facts. Interspersed with the profiles are summaries of famous mythological tales and historical events, like the Odyssey, the Trojan War, and the story of the Argonauts.An electrifying visual portrayal of each figure transports you directly into their wild world. Victoria Topping’s artwork is a fusion of technological and traditional techniques that combines photography, painting, and cut-paper collage to perfectly express the blending of human and fantastic traits from which mythical beings are made. The thrilling images and digestible text provide the perfect introduction to the lively world of Greek mythology. Prepare to be amazed as you uncover the epic, heroic, and sometimes terrible lives of mortals, monsters, and gods.",
  "genres": [
    "Mythology",
    "Nonfiction",
    "Middle Grade",
    "Greek Mythology",
    "Picture Books",
    "Childrens",
    "History"
  ],
  "author": "Stephen P. Kershaw",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/43523119-mythologica"
}