{
  "title": "There Are No Accidents",
  "description": "A journalist recounts the surprising history of accidents and reveals how they’ve come to define all that’s wrong with America.We hear it all the time: “Sorry, it was just an accident.” And we’ve been deeply conditioned to just accept that explanation and move on. But as Jessie Singer argues convincingly: There are no such things as accidents. The vast majority of mishaps are not random but predictable and preventable. Singer uncovers just how the term “accident” itself protects those in power and leaves the most vulnerable in harm’s way, preventing investigations, pushing off debts, blaming the victims, diluting anger, and even sparking empathy for the perpetrators.As the rate of accidental death skyrockets in America, the poor and people of color end up bearing the brunt of the violence and blame, while the powerful use the excuse of the “accident” to avoid consequences for their actions. Born of the death of her best friend, and the killer who insisted it was an accident, this book is a moving investigation of the sort of tragedies that are all too common, and all too commonly ignored.In this revelatory book, Singer tracks accidental death in America from turn of the century factories and coal mines to today’s urban highways, rural hospitals, and Superfund sites. Drawing connections between traffic accidents, accidental opioid overdoses, and accidental oil spills, Singer proves that what we call accidents are hardly random. Rather, who lives and dies by an accident in America is defined by money and power. She also presents a variety of actions we can take as individuals and as a society to stem the tide of “accidents”—saving lives and holding the guilty to account.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Urbanism",
    "Urban Planning",
    "History",
    "Audiobook",
    "Sociology"
  ],
  "author": "Jessie Singer",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/43522046-there-are-no-accidents"
}