{
  "title": "Copenhagen",
  "description": "For most people, the principles of nuclear physics are not only incomprehensible but inhuman. The popular image of the men who made the bomb is of dispassionate intellects who number-crunched their way towards a weapon whose devastating power they could not even imagine. But in his Tony Award-winning play Copenhagen, Michael Frayn shows us that these men were passionate, philosophical, and all too human, even though one of the three historical figures in his drama, Werner Heisenberg, was the head of the Nazis' effort to develop a nuclear weapon. The play's other two characters, the Danish physicist Niels Bohr and his wife, Margrethe, are involved with Heisenberg in an after-death analysis of an actual meeting that has long puzzled historians. In 1941, the German scientist visited Bohr, his old mentor and long-time friend, in Copenhagen. After a brief discussion in the Bohrs' home, the two men went for a short walk. What they discussed on that walk, and its implications for both scientists, have long been a mystery, even though both scientists gave (conflicting) accounts in later years. Frayn's cunning conceit is to use the scientific underpinnings of atomic physics, from Schr?dinger's famous cat to the Heisenberg uncertainty principle, to explore how an individual's point of view renders attempts to discover the ultimate truth of any human interaction fundamentally impossible. To Margrethe, Heisenberg was always an untrustworthy student, eager to steal from her husband's knowledge. To Bohr, Heisenberg was a brilliant if irresponsible foster son, whose lack of moral compass was part of his genius. As for Heisenberg, the man who could have built the bomb but somehow failed to, his dilemma is at the heart of the play's conflict. Frayn's clever dramatic structure, which returns repeatedly to particular scenes from different points of view, allows several possible theories as to what his motives could have been. This isn't the first play to successfully merge the world",
  "genres": [
    "Plays",
    "Drama",
    "Science",
    "History",
    "Theatre",
    "Physics",
    "Historical"
  ],
  "author": "Michael Frayn",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/435488.Copenhagen"
}