{
  "title": "Penny Dreadful",
  "description": "Hong Kong. Idyllic beaches. Glitzy cityscapes. What can possibly go wrong? Jasmine Spitfire, Hong Kong’s social counsellor extraordinaire, thought her life would forever consist of the disillusioned, the disgruntled and the mildly depressed. She's wrong. The moment a gruesome murder darkens her doorstep, Spitfire's world teeters on the cusp of paranoia and self-destruction. Why did Piers Blunt, the corporate power-player, die in such a horrific manner? And who could have done this?Jasmine embarks on an investigation that puts in her radar a cast of suspects, making the crowded city even more claustrophobic. Was it Piers' disgruntled wife, Farrah? Was it his colleagues, who were salivating to usurp his position? Was it his beautiful, ambitious mistress, nicknamed Penny the dreadful? But when the clues do not add up while the dead bodies begin to pile up, fiery Spitfire must race against time--and overcome her own demons--to find and stop the real murderer.A suspenseful, psychological, white-knuckle whodunit with Sherlockian wit and intensity set amidst the glittering skyscrapers, dark alleyways, and majestic shorelines of Hong Kong. Penny Dreadful throws you in the front seat of a maddening ride and compels you to keep your eyes, and your heart, wide ”Books like 'Penny Dreadful' are hard to come by. It's rare to see a finely crafted whodunit with soul. It's hard not to like Jasmine Spitfire, because she reminds us of ourselves—a supposedly normal person, albeit with a few quirks, who chooses to do what is right despite all the risks... Much more than a thriller, 'Penny Dreadful' is a scathing commentary on Hong Kong society, woven into an intricate, heart-rending yet uplifting page turner that holds you hostage until the very end... Spellbinding!” - J.B. Lazarte, Carlos Palanca Awardee and author of 'All the Darkness Unseen.' An excellent read! The characters are so well developed here and you feel like you're walking the streets of Hong Kong. The writing is absolutely terrific... I recommend 'Penny Dreadful' to those who love a good whodunit with humour and suspense. It's a thrilling and entertaining ride to the very last page.” - RoseMarie Williams, Books and Stuff blog",
  "genres": [],
  "author": "T.M. Tam",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/43543233-penny-dreadful"
}