{
  "title": "Not Just Yet. Egypt 2011: News - Incidents - Causes",
  "description": "ForewordBeginning in December 2010, a series of revolutions and rebellions rocked the Middle East. Today, this series of events is known as the Arab Spring. In January 2011, these events spread to Egypt, where they sparked the Egyptian revolution. For 18 days, protests rocked Egypt. This is where the story begins. This story will follow the events of one man as told through the digital trails one leaves on using today's technology. His emails, tweets, and blog posts will all be used in order to follow his story both during the actual revolution and in the subsequent year. During this time, the president of Egypt, Hosni Mubarak, was forced to step down from his position. The Supreme Council of the Armed Forces (SCAF), head of the military in Egypt, dissolved parliament and suspended the constitution. SCAF took over the country for six months until elections could be held. Political parties were in chaos; no one knew who could replace Mubarak. The only large organized force was the Muslim Brotherhood, an international group that had existed in Egypt since 1928, and enjoyed relative freedom under Mubarak's rule. Technically, elections had occurred in Egypt for a long time at this point. But Mubarak had ruled for thirty years, due to corruption, coercion, and manipulation of the elections. During his rule, many Egyptians lived well below the poverty level. Corruption was prevalent in the government, which groups opposing Mubarak had already been pointing out well before the revolution. The elections following the revolution were regarded by many as the first true chance for democratic elections within Egypt. It was not only the new president that would be elected in the elections. There would be new parliament members and those who started the uprising Egypt felt like they had a chance to achieve the change they dreamed of from the Parliament. If you’ve read the news about Egypt since the revolution, you know that this is not what happened. Surprisingly, the vast majority of people did not support radical change to a new democracy, and opted instead to support the familiar traditional powers: the old regime and the Muslim Brotherhood. After a brief time in rule, the Muslim Brotherhood's man in presidency was ousted following popular protests, and the head of military was appointed as a president. In many ways, Egypt is back to where it was before.The stories from the revolution are therefore important in that they shed light on the actual events during that critical year that lead to the disappointing outcomes. The book goes beyond the mere narration of events and tries to find the causes of why things went as they did. The causes date back much older than one might imagine.In this story, we look back in time at the struggle for freedom through the eyes of one unnamed man. As you follow his story, keep in mind the events that have happened since, and keep in mind what is yet to come. ---Foreword by Jill Waller.Cover art by Smo Sienkiewicz.",
  "genres": [
    "Egypt"
  ],
  "author": "Mohamed Abdel-Maksoud",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/43537359-not-just-yet-egypt-2011"
}