{
  "title": "Condemned Beast : Fairytales with a Twist",
  "description": "BeastAbandoned on the doorstep of Lumiere, the church that keeps secrets hidden within its walls. That secret is me, Beast. It's the name father Cogsworth gave me when I arrived. The nuns scurry when they see me coming and the priest, he did this to me. He reminded me daily growing up that it was my penance for my family's wrong doings. That I’m the face of evil. And they’re right, when I look in the mirror I see the monster he created. Too bad he didn’t live long enough to see the man I have become.Reading is the only escape to the life I’m trapped into, it’s my safe place away from the horrors that await me outside its doors, until she shows up, her presence makes me feel and the beast doesn’t do feelings. I break everything that I touch but she isn’t scared of me, I should warn her but what fun would that be.I want her fear, I crave it and if she tries to run, I plan to catch her and drag her back. She is my freedom, my ticket out of this hell I live daily.BellaMy name instills fear into people, my father is head of the Amorro clan and a man you can’t say no to, that’s how I’m set to marry Gatson, being a mafia princess I have to do what is expected of me and getting married will bring peace.I’m told to brush up on our family's history and I’m told the answers lie within the library.I feel his eyes follow me, he thinks that I don’t know. I enjoy the chase, I always have. Everyone in this town knows who I am, yet he doesn’t look the other way in fear. The void look in his eye sends chills down my spine and I should run as far away as I can, but I have never been afraid of the monsters under my bed, they raised me.The library holds all the family's secrets within its walls. Ones neither of us intended to uncover. Especially one secret so dark it could send me to my grave.",
  "genres": [
    "Romance",
    "Retellings",
    "Fantasy",
    "Beauty and The Beast",
    "Romantasy",
    "Dark Romance"
  ],
  "author": "Samantha  Barrett",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/123850830-condemned-beast"
}