{
  "title": "Far from My Father's House",
  "description": "The gripping, heartbreaking novel loved and rated 5 stars by real readers‘SUCH a wonderful, captivating read!’ ⭐⭐⭐⭐⭐‘Captivating from the beginning’ ⭐⭐⭐⭐⭐‘Worth a million news reports’ ⭐⭐⭐⭐⭐‘Compelling and beautifully written’ ⭐⭐⭐⭐⭐Layla is just thirteen when the men with the beards and guns burn down her beloved father’s school and begin to terrorise the Swat valley region of Pakistan.She has to flee, exchanging the tranquil beauty of the Himalayas for the squalor of a camp for refugees from the Taliban near Peshawar. With her life torn apart by tragedy, Layla must choose between the old fashioned way of life with her family – or a journey into independence which could threaten her very survival.Trying to find out what lies behind mysterious deaths at the camp is foreign correspondent Ellen Thomas. As a strong woman in a man’s world, Ellen is used to risking her life to uncover the truth. United by the gentle schoolteacher who had risked his life to save books, the paths of Layla and Ellen collide in a common cause.Praise for Jill McGivering’s THE LAST KESTREL :‘A moving, compassionate and impressive first-novel which fans of The Kite Runner will love’ DAILY MAIL‘Disturbing and heartfelt' THE TIMES‘McGivering’s prose is infused with the gritty realism of combat horrors and buoyed by the suspended moments of humanity one finds in war’ PUBLISHERS WEEKLY‘Jill McGivering has produced a deeply compassionate and thoughtful novel, written with the humanity that is a trademark of her reporting’ FERGAL KEANE‘A novel to move you and bring a better understanding about what is happening in Afghanistan…Beautifully written’ WOMAN’S DAY‘With an impeccable BBC pedigree, Jill McGivering is better placed than most other writers to give difficult stories about the realities of war-torn Afghanistan authenticity and immediacy’ YORKSHIRE POST",
  "genres": [],
  "author": "Jill McGivering",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/12384923-far-from-my-father-s-house"
}