{
  "title": "Willow Creek Clearing: Learning to Hear the Land: A Cherokee County Journal",
  "description": "This is the true story of one man's attempts to hear the land he lived on and enter into a relationship with it. After an irrigation pump leaks oil into the creek behind his family's house, he begins to question the sanity of mowing and watering seven acres of lawn and upkeeping two acres of landscaped gardens. As he begins to truly listen to the land, he discovers that the area contains one of the rarest ecosystems in the world and that there are numerous endangered species on his property struggling to survive. He finds an old 1870's survey map that shows the land he is occupying was once a riparian tallgrass prairie and also a rare transition zone of two significant ecosystems. All of this occurs in Cherokee County, Kansas, one of the most ecologically damaged counties in the United States. Knowing nothing about ecology or restoration, he begins the eight-year journey of attempting to recreate the tallgrass prairie and heal the forest bottom inviting as much life back into the property as possible. Slowly he starts to learn how to have a relationship with the Earth. The years of work was documented in a master’s thesis that ultimately led to him being awarded a master’s degree in Ecology, Cosmology, and Consciousness from one of the top environmental colleges in the country. As word spreads of his attempt to recreate the prairie and heal the land, people begin to come from all over to Willow Creek Clearing. The work at Willow Creek Clearing using the creation of sacred space, Goddess, ritual, astrology, creativity, energy work, ecopsychology, systems study, permaculture, and spiritual healing combined with help from numerous scientists, and documented scientific research and applied methods in ecology, restoration, and habitat creation remains one of a kind work. To date, it is the only academically documented attempt to reinvent a tallgrass prairie in existence. This book is a rewriting of the actual master’s thesis.",
  "genres": [],
  "author": "Mark  A. Shryock",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43541784-willow-creek-clearing"
}