{
  "title": "Flashback",
  "description": "A modern-day teenage orphan remembers a millennia-old murder through a connection that had spanned generations.Sarah thinks she is going crazy when she dreams, not realizing that she is watching her ancestor's life through inherited memories. When Sarah discovers she has an instinctive ability to fight thanks to her ancestor, one of the most feared warriors in history, her life drastically changes.A scientific research company offers her a new and better future. With no more group homes or charity bins, she joins a group of teens that have the same unique genes, and Sarah begins to learn to use her inherited advantages.But the project is more than it appears to be. As the body count rises, Sarah finds herself in a battle that may cost her every thought she has ever had.---From the Editor:This engaging sci-fi thriller from debut author T.R. Davis, is a powerful reminder that the small can be mighty and that one ought never to mess with a girl who happens to carry the ancestral memories of one of the most infamous warrior queens in history.Sarah, a girl bouncing around in foster homes, learns she has inherited the memories of her ancestor, Innogen, who had led an uprising against corrupt Roman rule during the first century AD. Sarah’s mind remembers a life she never lived and her muscles remember battles she never fought. She begins to learn and train in a special project at a boarding school far from her old life as an orphan. But all is not as it seems with the beneficent school program and they may want more from Sarah than she will give… not without a fight.---*Some scenes contain incidents of violence and sexual assault written from a character perspective. While historically accurate, some teens may find these scenes upsetting. They are descriptive but not overly graphic in nature, but it is for this reason that this is not appropriate for the young adult audience.",
  "genres": [],
  "author": "T.R. Davis",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/43533046-flashback"
}