{
  "title": "Tell Me No Lies: How to Face the Truth and Build a Loving Marriage",
  "description": "Lying-For Better or WorseEverybody lies. Friends lie to friends. Children lie to their parents. Politicians lie to constituents. And, inevitably, husbands and wives lie to each other.Lies between lovers can be highly electric; they have tremendous potential to both nurture and destroy a relationship. It is easy to underestimate the power that lies-even seemingly harmless lies-can wield in your marriage. Tell Me No Lies explores the complexity of honesty versus deception in marriage.Tell Me No Lies offers a riveting account of the lies we tell our partners (and ourselves) in marriage. Some people lie because they lack the nerve to tell their partners what they feel, while others are so terrified of hearing the truth that they encourage their mates to lie to them, thus falling into \"Lie Invitee\" behavior. This book examines the four marital stages-The Honeymoon, Emerging Differences, Freedom, and Together as Two-and how deception interferes with development in each of the stages. For example, couples in the Honeymoon stage are often under the illusion that they are perfectly content and have everything in common.This book also illustrates how each of these stages can go awry, leading to more dangerous lies such as those The Dark Side of the Honeymoon, when couples refuse to acknowledge any problems; the Stalemate, when couples fight and brutalize each other with exaggerated truths; and Freedom Unhinged, when independence outweighs togetherness and marital anarchy ensues.Offering a new way of thinking about truth and deception, this book will help you understand the dynamics of your marriage in the context of the marital stages. If you can identify your marital stage, you can overcome the barriers to honesty and move on to a happier and more fulfilling marriage!",
  "genres": [
    "Psychology",
    "Relationships",
    "Nonfiction"
  ],
  "author": "Ellyn Bader",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/435565.Tell_Me_No_Lies"
}