{
  "title": "Blood on the Roses",
  "description": "In his fourth and finest novel, Robert Hays writes with the journalist’s careful attention to detail and an exquisite authenticity drawn from his own half-century love affair with the American South. Blood on the Roses is a frank and honest story that does justice to its splendid east Tennessee setting, stunning from beginning to end in its juxtaposition of raw ugliness and beauty and its historical veracity that captures both the engaging qualities of the Southern people and the terrible wrongs of discrimination and outrageous acts of pure racism carried out by a few.In the autumn of 1955, at the height of America’s concern over the murder of a black teenager by white racists in Mississippi and in the wake of the U.S. Supreme Court decision outlawing school segregation, Rachel Feigen’s Baltimore editor sends her South to report on a missing person case. Guy Saillot’s last contact with his family was a postcard from the Tennessee Bend Motel, a seedy establishment situated on scenic Cherokee Lake. But she finds no record that he ever stayed there.Feigen gets a tip that the motel caretaker, a deaf-mute named George, may know something about the missing man. George’s consuming interest is the Tennessee Bend’s arresting rose garden—its only truly positive quality—and she gains his favor by showing her appreciation for his beautiful roses.Feigen quickly finds herself caught up in the bigotry she expected to observe as an outsider when three local extremists decide to teach a lesson to this “uppity jewgirl” from the North who’s poking around in things that are none of her business. Their plan? Kidnap two black men and lock them and Feigen in Room 10 of the Tennessee Bend, complete with its two-way mirror voyeur’s window, and let nature take its course. They’re confident the men’s “jungle instincts” will take over and she’ll get her comeuppance, after which they’ll give the “boys” a good whipping for messing with a white woman. But the two men taken at gunpoint, an Army sergeant just back from Korea and an Urban League attorney from Philadelphia, don’t play the game the way their captors expect.Appalling as it is, her own maltreatment is a mere sidebar to Feigen’s finding Guy Saillot. George’s rose garden holds the key that unlocks the shocking secret and reveals the malevolent extremes to which unfettered intolerance can lead. The author leaves it to Charlie Monroe, the venerable FBI man from Knoxville whose Southern roots run deep, to sum up the pervading evil of this time and “It’s easy to condemn. But prejudice is an unpastured dragon . . . Let it loose, nurture it with a little ignorance and fear, and pretty soon it’s in all the dark places and if we’re not careful we’ll all be devoured in its ugly flame.”",
  "genres": [],
  "author": "Robert Hays",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/12385204-blood-on-the-roses"
}