{
  "title": "Life isn't everything: Mike Nichols, as remembered by 150 of his closest friends.",
  "description": "An up close and personal portrait of a legendary filmmaker, theater director, and comedian, drawing on candid conversations with his closest friends in show business and the arts—from Dustin Hoffman and Meryl Streep to Natalie Portman and Lorne Michaels.The work of Mike Nichols pervades American cultural consciousness—from The Graduate and Who's Afraid of Virginia Woolf? to Angels in America, The Birdcage, Working Girl, and Primary Colors, not to mention his string of hit plays, including Barefoot in the Park and The Odd Couple. If that weren’t enough, he was also one half of the timelessly funny duo Nichols & May, as well as a founding member of the original improv troupe. Over a career that spanned half a century, Mike Nichols changed Hollywood, Broadway, and comedy forever.Most fans, however, know very little of the person behind it all. Since he never wrote his memoirs, and seldom appeared on television, they have very little sense of his searching intellect or his devastating wit. They don't know that Nichols, the great American director, was born Mikail Igor Peschkowsky, in Berlin, and came to this country, speaking no English, to escape the Nazis. They don't know that Nichols was at one time a solitary psychology student, or that a childhood illness caused permanent, life-altering side effects. They don't know that he withdrew into a debilitating depression before he \"finally got it right,\" in his words, by marrying Diane Sawyer.Here, for the first time, Ash Carter and Sam Kashner offer an intimate look behind the scenes of Nichols' life, as told by the stars, moguls, playwrights, producers, comics and crewmembers who stayed loyal to Nichols for years. Life Isn't Everything  is a mosaic portrait of a brilliant and original director known for his uncommon charm, wit, vitality, and genius for friendship, this volume is also a snapshot of what it meant to be living, loving, and making art in the 20th century.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Film",
    "Memoir",
    "Theatre",
    "Oral History",
    "Media Tie In"
  ],
  "author": "Ash  Carter",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/43565319-life-isn-t-everything"
}