{
  "title": "Erosion: Essays of Undoing",
  "description": "Fierce, timely, and unsettling essays from an important and beloved writer and conservationist Terry Tempest Williams's fierce, spirited, and magnificent essays are a howl in the desert. She sizes up the continuing assaults on America's public lands and the erosion of our commitment to the open space of democracy. She asks: \"How do we find the strength to not look away from all that is breaking our hearts?\"We know the elements of erosion: wind, water, and time. They have shaped the spectacular physical landscape of our nation. Here, Williams bravely and brilliantly explores the many forms of erosion we face: of democracy, science, compassion, and trust. She examines the dire cultural and environmental implications of the gutting of Bear Ears National Monument—sacred lands to Native Peoples of the American Southwest; of the undermining of the Endangered Species Act; of the relentless press by the fossil fuel industry that has led to a panorama in which \"oil rigs light up the horizon.\" And she testifies that the climate crisis is not an abstraction, offering as evidence the drought outside her door and, at times, within herself.These essays are Williams's call to action, blazing a way forward through difficult and dispiriting times. We will find new territory—emotional, geographical, communal. The erosion of desert lands exposes the truth of chnage. What has been weathered, worn, and whittled away is as powerful as what remains. Our undoing is also our becoming.Erosion is a book for this moment, political and spiritual at once, written by one of our greatest naturalists, essayists, and defenders of the environment. She reminds us that beauty is its own form of resistance, and that water can crack stone.Preface: The turquoise triangle --Map of Bears Ears and Grand Staircase-Escalante National Monuments --The cutting edge of time: erosion of home --What love looks like: erosion of safety --This moment: erosion of democracy --Boom: erosion of belief --Coda: The liturgy of home",
  "genres": [
    "Essays",
    "Nonfiction",
    "Nature",
    "Environment",
    "Memoir",
    "Science",
    "Politics"
  ],
  "author": "Terry Tempest Williams",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/43565362-erosion"
}