{
  "title": "Memories Forgotten: An Epic Fantasy Reverse Harem",
  "description": "A moment. That's how fast your life can change. I would know because that’s what happened to me. I made a choice and, in less than a second, my comfortable, normal life is turned into a confusing nightmare. And you know what? I wouldn’t change a thing.  I’m Noemi. With no memory of my past, the life I’ve known has been spent in hiding and on the run with my guardian, Mincey. Only few others knew I existed.  Until now.  A power-hungry Dragon Overlord and his generals hunt shifters, stealing their abilities for themselves. Those who would oppose them are scattered across two realms. Only the inability to wield both Light and Dark energies stands in their way.  On Earth, the King of the Western States helps protect the shifters who reside within his borders and, after years of asking to join the effort, I finally convinced Mincey I was ready.  In a single heartbeat, my life changed forever. While Mincey hunts a traitor, I’m stuck with three drool-worthy shifters who make the dark corners of my mind come alive. Forgotten memories start to resurface, I develop abilities that no shifter should have and, while Raiden, Murphy and Kage help me through it all, we discover that I am what the Dragon Overlord both needs and fears the most.  I was the key to The Heart.  Dive into a world of sexy sifters, secrets, and hope as Noemi and her men follow fate’s twisted path on an adventure with no guarantees of survival. When her true destiny is revealed, it will change not just one realm, but all of them.  That is, if it doesn’t kill her first.  Author's note: As the first book in The Heart of Edarus Series, it ends in a cliffhanger (sorry not sorry). This is a medium/slow reverse harem story and includes sexy scenes and mature language. Intended for ages 18 years and older.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Aspen Marks",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/43563972-memories-forgotten"
}