{
  "title": "Administrations of Lunacy: Racism and the Haunting of American Psychiatry at the Milledgeville Asylum",
  "description": "A scathing and original look at the racist origins of psychiatry, through the story of the largest mental institution in the worldToday, 90 percent of psychiatric beds are located in jails and prisons across the United States, institutions that confine disproportionate numbers of African Americans. After more than a decade of research, the celebrated scholar and activist Mab Segrest locates the deep historical roots of this startling fact, turning her sights on a long-forgotten cauldron of racial ideology: the state mental asylum system in which psychiatry was born and whose influences extend into our troubled present.In December 1841, the Georgia State Lunatic, Idiot, and Epileptic Asylum was founded. A hundred years later, it had become the largest insane asylum in the world with over ten thousand patients. Administrations of Lunacy tells the story of this iconic and infamous southern institution, a history that was all but erased from popular memory and within the psychiatric profession.Through riveting accounts of historical characters, Segrest reveals how modern psychiatric practice was forged in the traumas of slavery, the Civil War, Reconstruction, and Jim Crow. Deftly connecting this history to the modern era, Segrest then shows how a single asylum helped set the stage for the eugenics theories of the twentieth century and the persistent racial ideologies of our own times. She also traces the connections to today’s dissident psychiatric practices that offer sanity and create justice.A landmark of scholarship, Administrations of Lunacy restores a vital thread between past and present, revealing the tangled racial roots of psychiatry in America.",
  "genres": [
    "Nonfiction",
    "History",
    "Psychology",
    "Mental Health",
    "Race",
    "Audiobook",
    "Science"
  ],
  "author": "Mab Segrest",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/43561506-administrations-of-lunacy"
}