{
  "title": "Travel Light, Move Fast",
  "description": "From bestselling author Alexandra Fuller, the utterly original story of her father, Tim Fuller, and a deeply felt tribute to a life well livedSix months before he died in Budapest, Tim Fuller turned to his daughter: “Let me tell you the secret to life right now, in case I suddenly give up the ghost.\" Then he lit his pipe and stroked his dog Harry’s head. Harry put his paw on Dad’s lap and they sat there, the two of them, one man and his dog, keepers to the secret of life. “Well?” she said. “Nothing comes to mind, quite honestly, Bobo,” he said, with some surprise. “Now that I think about it, maybe there isn’t a secret to life. It’s just what it is, right under your nose. What do you think, Harry?” Harry gave Dad a look of utter agreement. He was a very superior dog. “Well, there you have it,” Dad said.After her father’s sudden death, Alexandra Fuller realizes that if she is going to weather his loss, she will need to become the parts of him she misses most. So begins Travel Light, Move Fast, the unforgettable story of Tim Fuller, a self-exiled black sheep who moved to Africa to fight in the Rhodesian Bush War before settling as a banana farmer in Zambia. A man who preferred chaos to predictability, to revel in promise rather than wallow in regret, and who was more afraid of becoming bored than of getting lost, he taught his daughters to live as if everything needed to happen all together, all at once—or not at all. Now, in the wake of his death, Fuller internalizes his lessons with clear eyes and celebrates a man who swallowed life whole.A master of time and memory, Fuller moves seamlessly between the days and months following her father’s death, as she and her mother return to his farm with his ashes and contend with his overwhelming absence, and her childhood spent running after him in southern and central Africa. Writing with reverent irreverence of the rollicking grand misadventures of her mother and father, bursting with pandemonium and tragedy, Fuller takes their insatiable appetite for life to heart. Here, in Fuller’s Africa, is a story of joy, resilience, and vitality, from one of our finest writers.",
  "genres": [
    "Memoir",
    "Africa",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "Zambia",
    "Zimbabwe"
  ],
  "author": "Alexandra Fuller",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/43593420-travel-light-move-fast"
}