{
  "title": "Late Bloomer: Finding My Authentic Self at Midlife",
  "description": "\"This is an honest account of the profound ‘awakening’ that stems from an appetite for life and yet also comes at a cost. The writing is just right. It’s straight—from the heart.” — Richard C. Morais, author of The Hundred-Foot Journey“Late Bloomer is an absolutely glorious memoir about a woman coming out, coming into her true self.\" — Amy Ferris, author of Mighty Gorgeous and Marrying George ClooneyMelissa Giberson is a middle-aged suburban wife and mother of two kids, solidly planted in the life she’s always wanted. Yet she longs for something more—something she can’t quite put her finger on until, one day at the Y, she finds herself mesmerized by the sight of a naked woman and asks herself for the first time: Am I gay?This revelation sends Melissa on a head-spinning journey of self-discovery, one that challenges everything she thinks she knows about herself, forces her to decide exactly how much she’s willing to risk for authenticity, and shakes the foundations of the family she’s fiercely determined to shield from the kinds of wounds she sustained during her own childhood. Torn between her desire to be true to herself and her desire to protect her children, she is consumed by fear and conflicting emotions—and when her husband unexpectedly serves her divorce papers, her confusion only deepens.Adrift in uncharted waters, Melissa finds fragments of understanding and peace in unexpected places—in a conference room in Israel, a small fishing village in Cape Cod, and at a yoga retreat center—that help her deconstruct her preconceptions about faith and identity and begin to construct a new framework for her life. Over the course of her ten-year journey, she finds hope, love, and more courage than she ever knew she was capable of, and she gradually assembles the puzzle that is her—the real her.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Melissa Giberson",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/123857911-late-bloomer"
}