{
  "title": "Dumbstruck: A Cultural History of Ventriloquism",
  "description": "Ventriloquism, the art of \"seeming to speak where one is not\", speaks so resonantly to our contemporary technological condition. We now think nothing of hearing voices--our own and others'--propelled over intercoms, cellphones, and answering machines. Yet, why can none of us hear our own recorded voice without wincing? Why is the telephone still full of such spookiness and erotic possibility? And why does the magician's trick of speaking through a dummy entertain as well as disturb us? These are the kind of questions which impel Dumbstruck , Steven Connor's wide-ranging, relentlessly inquisitive history of ventriloquism and the disembodied voice.Connor follows his subject from its early beginnings in ancient Israel and Greece, through the outcries of early Christian writers against the unholy (and, they believed, obscenely produced) practices of pagan divination. Surprisingly, he finds that women like the sibyls of Delphi were the key voices in these male-dominated times. Connor then turns to the aberrations of the voice in mysticism, witchcraft and possession, and the strange cultural obsession with the vagrant figure of the ventriloquist, newly conceived as male rather than female, that flourished during the Enlightenment. He retells the stories of some of the most popular and versatile ventriloquists and polyphonists of the nineteenth century, and investigates the survival of ventriloquial delusions and desires in spiritualism and the 'vocalic uncanny' of technologies like the telephone, radio, film, and the internet.Brimming with anecdote and insight, Dumbstruck is a provocative archeology of a seemingly trivial yet profoundly relevant presence in human history. Its pages overflow with virtuoso philosophical and psychological reflections on the problems and astonishments, the raptures and absurdities of the unhoused voice.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Steven Connor",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/435844.Dumbstruck"
}