{
  "title": "Faith Lifting Prayers: A Celebration of Humanity",
  "description": "Best selling author on beauty and wellness and TV host Gregory Landsman was born in Apartheid South Africa and was beaten, bullied and abused daily for simply being himself. Taking us across the globe from South Africa to India, from Switzerland to Australia, Gregory shares his stories of searching for meaning and his prayers along the way to find fulfilment, self acceptance and a happy life. Faith Lifting Prayers will inspire you to live your best life. It is a book that will make you laugh and cry, as you journey with the author to discover the best of yourself and celebrate the goodness and value you bring to the world and those around you. Faith Lifting Prayers is road map to learning forgiveness and finding true self acceptance and joy. It is a book for anyone who has ever wanted to feel they are loved and valuable for who they are...just as they are. Excerpt from Faith Lifting Prayers ﻿Dear God Grant me the courage to face myself And to give myself the permission to use my voice For so many years My inadequacy has bound my tongue Inhibited my speech And the things that I have wanted to say Have been stuck in my throat Words that needed to be heard Lose their way on my tongue So I swallow the words that are lost And try to find new ones I feel anxiety As people try to complete my sentences Wanting a sentence to slip through my lips But somehow it clings to my teeth My words are drowned out By fear of being judged and laughed at But I have a voice that needs to be heard We all do As my voice finds its way From my heart to my lips And to the ears that are listening May it be nourished and shaped by self-acceptance I give thanks for my ability to speak my truth And even though it isn't as smooth as I would like it to be It is my voice and I own it My words belong to me And I will no longer judge how they leave my mouth But bless them because they belong to me Thank you Amen(Hardcover with dust jacket)",
  "genres": [],
  "author": "Dr Gregory Landsman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43583030-faith-lifting-prayers"
}