{
  "title": "The Voyages of Trueblood Cay",
  "description": "Pelippé Trueblood is on the voyage of a lifetime and hosting a temperamental, half-man half-horse onboard his ship. He just might end up killing his difficult guest. Or kissing him.Trueblood is descended from giants and poised to be one of the world's great mariners. Raised by his father on the mighty ship Cay, he’s chosen at nineteen for a perilous voyage predicted in ancient find the lost Tree of Life and anchor her branches back to the sky. Young and unseasoned, Trueblood fears the gods may have picked the wrong man for the job. Worse, scripture demands he be accompanied by the beautiful, brooding Fen il-Kheir. Nothing in Trueblood's life at sea has prepared him for this dangerous new crew member, nor the feelings he plants in Trueblood's heart.Fen is a kheiron—a creature with the ability to shift between man and horse. With his dark past, his distrust of humans and his contempt for prophecy, Fen proves a reluctant passenger who could jeopardize not only the voyage, but the very future of the world. As the journey progresses, Fen finds himself more and more drawn to the Cay's charismatic commander, bringing the kheiron closer to everything his human nature longs for, and everything the beast in him fears.A feud of the gods. Ships built by giants. Spice that makes the world beautiful. Flying horses. Murder and misery. Belonging and bravery. Sailors, centaurs, warriors, queens, courtesans and storytellers. A tapestry of mythology and human experience,  The Voyages of Trueblood Cay  is both Javier Landes’ fantastical life story, and Suanne Laqueur’s most adventurous love story.Publisher's Gil Rafael is the pen name of Javier Landes, who is a fictional character in Laqueur's  Venery  series.  The Voyages of Trueblood Cay  is the novel Javier is writing throughout the series. This novel-within-a-novel contains subtle references to people and situations in  Venery , however it's not necessary to have read the series beforehand.  Trueblood Cay  can absolutely be enjoyed as a standalone.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "LGBT",
    "Fiction",
    "Abuse",
    "M M Fantasy"
  ],
  "author": "Suanne Laqueur",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/43594543-the-voyages-of-trueblood-cay"
}