{
  "title": "Dungeon Royale",
  "description": "An agent brokenMI6 agent Damon Knight prided himself on always being in control. His missions were executed with cold, calculating precision. His club, The Garden, was run with an equally ordered and detached decadence. But his perfect world was shattered by one bullet, fired from the gun of his former partner. That betrayal almost cost him his life and ruined his career. His handlers want him to retire, threatening to revoke his license to kill if he doesn’t drop his obsession with a shadowy organization called The Collective. To earn their trust, he has to prove himself on a unique assignment with an equally unusual partner.A woman temptedPenelope Cash has spent her whole life wanting more. More passion. More adventure. But duty has forced her to live a quiet life. Her only excitement is watching the agents of MI6 as they save England and the world. Despite her training, she’s only an analyst. The closest she is allowed to danger and intrigue is in her dreams, which are often filled with one Damon Knight. But everything changes when the woman assigned to pose as Damon’s submissive on his latest mission is incapacitated. Penny is suddenly faced with a decision. Stay in her safe little world or risk her life, and her heart, for Queen and country.An enemy revealedWith the McKay-Taggart team at their side, Damon and Penny hunt an international terrorist across the great cities of Northern Europe. Playing the part of her Master, Damon begins to learn that under Penny’s mousy exterior is a passionate submissive, one who just might lay claim to his cold heart. But when Damon’s true enemy is brought out of the shadows, it might be Penny who pays the ultimate price.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary",
    "Erotic Romance",
    "Romantic Suspense",
    "Suspense"
  ],
  "author": "Lexi Blake",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/43594881-dungeon-royale"
}