{
  "title": "A Guest of the Reich: The Story of American Heiress Gertrude Legendre's Dramatic Captivity and Escape from Nazi Germany",
  "description": "\"Thrilling! An intimate spy story, as though a dear friend is taking us along on her misadventure behind Nazi lines.\"--Bill Dedman, author of the #1 New York Times bestseller Empty Mansions From the co-author of The Zhivago Affair, a finalist for the National Books Critics Circle Award, comes the dramatic story of a South Carolina heiress who joined the OSS and became the first American woman in uniform taken prisoner on the Western front--until her escape from Nazi Germany.  Gertrude \"Gertie\" Legendre was a big-game hunter and from a wealthy industrial family who lived a charmed life in Jazz Age America. Her adventurous spirit made her the inspiration for a Broadway play, Holiday,  which became a film starring Katharine Hepburn. When the Japanese attacked Pearl Harbor, Legendre, by then married and a mother of two, joined the OSS, the wartime spy organization that preceded the CIA. First in Washington and then in London, some of the most closely-held United States government secrets passed through her hands. In A Guest of the Reich, Peter Finn tells the gripping story of how in 1944, while on leave in liberated Paris, Legendre was captured by the Germans after accidentally crossing the front lines.Subjected to repeated interrogations, including by the Gestapo, Legendre entered a daring game of lies with her captors. The Nazis treated her as a \"special prisoner\" of the SS and moved her from city to city throughout Germany, where she witnessed the collapse of Hitler's Reich as no other American did. After six months in captivity, Legendre escaped into Switzerland.A Guest of the Reich is a propulsive account of a little-known chapter in the history of World War II, as well as a fascinating portrait of an extraordinary woman.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "World War II",
    "Germany",
    "Historical",
    "War"
  ],
  "author": "Peter Finn",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/43583366-a-guest-of-the-reich"
}