{
  "title": "Four Ever",
  "description": "Surrounded by a group of devoted four-footed and two-winged family members, Zak and Killian have built what should have been a dream life in their countryside farmhouse. But a cruel twist of fate and the re-emergence of old demons has frayed the edges of the men’s seven-year relationship until just one wrong move could end up severing their bond for good.Seemingly content to walk on eggshells around one another, things come to a head when ER nurse Zak brings his work home with him… literally.After being forced to leave their posh Southern California lives, homeless stepbrothers Liam and Noah are slowly losing themselves to the streets they can’t seem to escape. When twenty-one-year-old Liam is beaten up while protecting his younger “brother,” the pair find themselves being welcomed into a home where being a stray is considered a good thing. But Liam and nineteen-year-old Noah have learned the hard way that nothing is given for free and there’s no such thing as the kindness of strangers. Survival means only counting on and trusting in each other.Will Zak and Killian’s offer of a no-strings-attached place to heal end up being more than any of the four men bargained for? Especially when feelings between Liam and Noah begin to crawl to the surface and the truth of what Zak and Killian’s relationship has turned into becomes harder to deny?And what happens when lines begin to blur and needs start to change? Will Zak, Killian, Liam, and Noah end up going their separate ways?Or will they learn that love doesn’t always come in twos?*This is a novel about a foursome relationship, not just a story of two separate couples in physical relationships with one another. Thus, there is no “cheating” in this story. This is a standalone novel.Trigger Warning: The trigger warnings in this book may be considered \"spoilerish\" so they can be found by using the \"Look Inside\" feature or by downloading the sample and going to the section entitled \"Trigger Warning.\"",
  "genres": [
    "M M Romance",
    "Romance",
    "M M M",
    "Menage",
    "Contemporary",
    "Polyamory",
    "LGBT"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/43599239-four-ever"
}