{
  "title": "Bound to the Prince",
  "description": "An elven prince without a throne.A mortal woman without hope, stolen from her own world to fulfill his every desire.A choice of love and death that could bind them together forever.Some people believe that beneath our own world, separated only by a thin veil of human disbelief, there is another one—an ancient land of myths and legends, a place where magical creatures dwell. What would happen if one of them walked the streets of London at night?Once a proud warrior, elven prince Elathan was living in exile, fallen from grace and separated from his own people. He wanted the mortal woman the moment he saw her standing on Blackfriars Bridge, staring down into the darkness with unbearable pain in her eyes. This strangely compelling female also happened to have luscious curves that made his body ache with desire. Naturally, he decided to hunt the woman down, drag her to his lair and command her to become his slave of pleasure. But would her frail human body survive a night of untamed passion in the arms of a Fae?After a devastating breakup with her fiancé, Igraine Chandler was spending her honeymoon in England all by herself, her life utterly bereft of meaning. For who could ever love a plain, slightly overweight nurse from New Jersey with nothing left but a broken heart and her lost dreams of a home and a family? But she never imagined that she would soon set out into a world beyond her wildest dreams, and help a prince reclaim his throne...Set in a medieval fantasy world of noble knights, monsters and magicians, honor, betrayal and revenge, Bound to the Prince is a romance influenced by Celtic mythology and Arthurian legends. But in its heart, it's a story of a woman's inner development to a new, strong, self; uninhibited desire, boundless love, loss and sacrifice.www.deborahcourt.comwww.deborahcourt.blogspot.com",
  "genres": [
    "Fantasy",
    "Paranormal Romance",
    "Fae",
    "Paranormal",
    "Romance",
    "Erotica",
    "Adult"
  ],
  "author": "Deborah   Court",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/12385943-bound-to-the-prince"
}