{
  "title": "Underworld",
  "description": "ADVANCE PRAISE FOR UNDERWORLD\n\"You pick up and travel vith DeLillo anywhere -- the bliss of a baseball game, the meeting of old lovers in a desert. He offers us another history of ourselves, the unofficial underground moments. He smells the music in argument and brag. He throws the unbitten coin of fame back at us. This book is an aria and a wolf-whistle of our half century. It contains multitudes.\" --Michelle Ondaatie, author of The English PatientOur lives, our half century.Nick Shay and Klara Sax knew each other once, intimately, and they meet again in the American desert. He is trying to outdistance the crucial events of his early life, haunted by the hard logic of loss and by the echo of a gunshot in a basement room. She is an artist who has made a blood struggle for independence.Don DeLillo's mesmerizing novel opens with a legendary baseball game played in New York in 1951. The glorious outcome - the home run that wins the game is called the Shot Heard Round the World - shades into the grim news that the Soviet Union has just tested an atomic bomb.The baseball itself, fought over and scuffed, generates the narrative that follows. It takes the reader deeply into the lives of Nick and Klara and into modern memory and the soul of American culture - from Bronx tenements to grand ballrooms to a B-52 bombing raid over Vietnam.A generation's master spirits come and go. Lenny Bruce cracking desperate jokes, Mick Jagger with his devil strut, J. Edgar Hoover in a sexy leather mask. And flashing in the margins of ordinary life are the curiously connected materials of the culture. Condoms, bombs, Chevy Bel Airs, and miracle sites on the Web.Underworld is a story of men and women together and apart, seen in deep clear detail and in stadium-sized panoramas, shadowed throughout by the overarching conflict of the Cold War. It is a novel that accepts every chalenge of these extraordinary times - Don DeLillo's greatest and most powerful work of fiction.\nDon DeDillo is the author of eleven novels, including White Noise, Libra, and Mao II. He has won the National Book Award and the PEN/Faulkner Award for fiction. He is a member of the American Academy of Arts and Letters.",
  "genres": [
    "Fiction",
    "Novels",
    "Literature",
    "Literary Fiction",
    "American",
    "Classics",
    "Historical Fiction"
  ],
  "author": "Don DeLillo",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/436005.Underworld"
}