{
  "title": "Heaven on Earth",
  "description": "For Casey O'Reilly the world was supposed to be an orderly place where you met, married and had children with the man you love. But nothing had gone according to plan. Mr. Right never made an appearance, and now, at 'thirtysomething, ' Casey figured she had a better chance at being struck by lightning than struck by love. . .but then the unthinkable happened. . .There was no time for questions as a man slowly, deliberately, walked closer, as though he had no fear of the lightning or the sandstorm. Casey's voice was stuck in her throat. She wanted to ask him who he was, but only garbled noises emerged from her mouth as she watched him unbutton his dark coat above her. His face was hidden by a wide collar turned up and the cowboy hat pulled low over his brow, but somehow the closer he came the less she feared him.He knelt before her and, without a word, wrapped the edges of the raincoat around her, pulling her to his chest and sheltering her from the sandstorm. She could feel the strength of his arms around her back, and immediately sensed peace as she was gathered into the sanctuary of his body. She felt the strong beat of his heart reverberating against her face. She smelled something citrusy, very earthy, about him, and lifted her hand to cling to his soft shirt.\"You are all right, Casey O'Reilly.\"She almost jumped at the proximity of his voice resonating from his chest and into her ear. The low soothing tone sent shivers throughout her body and she found herself clinging even more tightly to his shirt.\"Who. . .? Who are you?\" she managed to mutter.\"I've come to help,\" he answered, holding her tighter as another crash of thunder made the ground shake violentlybeneath them.\"Thanks heavens.\" She sobbed.Somehow she felt incredibly safe, more so than she had ever felt in her life. Her body was tingling with some strange and powerful energy that was unfamiliar and yet. . .so perfectly wonderful. She felt a renewed strength welling up in her muscles, spreading through her body down to her burning foot. Her chest stopped aching and her headache eased as this man, who had just walked out of a bolt of lightening and into her life.",
  "genres": [
    "Time Travel",
    "Romance",
    "Time Travel Romance",
    "Paranormal"
  ],
  "author": "Constance O'Day-Flannery",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/435964.Heaven_on_Earth"
}