{
  "title": "Embers of the Heart",
  "description": "In the aftermath of America’s bloody Civil War, young Anna Kelley waits for her husband, Darryl, to come home. When he finally returns, he is a changed man who no longer loves her and has become cruel and unforgiving because of his war experiences. Anna decides that, for her own safety, she needs to get away from Darryl. She flees, and she ends up in the wild cow town of Abilene, Kansas, run by Sheriff Nate Foster. Fate draws Nate and Anna closer, but Anna, who desperately longs for the safety and love she finds in Nate’s arms, has not told him she has a husband who is now a dangerous outlaw. Nate and Anna’s love grows beyond their ability to corral the passion and desire stirred in their souls, but Anna’s secret finally comes back to haunt her and nearly destroys the love she has found in Nate’s arms. Nate’s own anger and loss because of the war interfere with his ability to fully love and trust again, and when he finds out about Anna’s lie, he isn’t sure he can fully commit to her. EMBERS OF THE HEART embraces the heartaches and challenges of a Nation torn by war, and those caught up both sides of that war. A “must read,” this book is a “sister story” to Bittner’s book, MONTANA WOMAN, as Anna (from EMBERS OF THE HEART) and Joline (from Bittner’s MONTANA WOMAN) are sisters who ended up separated by the Civil War. “Power, passion, tragedy, and triumph are Rosanne Bittner’s hallmarks. Again and again, she brings readers to tears.” ~Romantic Times “Extraordinary…Bittner’s characters spring to life.” ~Publishers Weekly ABOUT THE Named one of the “Pioneer Authors of Romance” by Romantic Times, Rosanne Bittner is the author of sixty-eight historical romance novels, most set in the American West of the 1800s. .",
  "genres": [
    "Historical Romance",
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Civil War"
  ],
  "author": "Rosanne Bittner",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/43604941-embers-of-the-heart"
}