{
  "title": "Crime & Punishment (collection 1) Five Erotic Stories of Sexual Submission",
  "description": "Crime & Five Erotic Stories of Sexual Submission - This is the first collection in the Crime & Punishment Series. HER EROTIC PUNISHMENT - If Alicia doesn't want to go to jail for stealing, she will have to agree to let the store's owner mete out her punishment instead. But when he makes her strip down naked, Alicia realizes just what type of punishment he has in mind. Now he has her bent over in front of him, her hands tied behind her back and Alicia is wet and ready to take the punishment she deserves, no matter how big or how hard it is. TAKEN BY MIND CONTROL - Valerie always acted distant at work and never let herself go. But after Mark uses his mind control program on her she find that she is no longer in control. Now he has her obeying each of his erotic commands as his hands run along her body, exploring her and making her wet with desire.GETTING BLACKMAILED BY HER BOSS - When Jessica gets caught by her boss playing hooky at the beach, she knows she is in trouble and tells him she will do whatever it takes to keep her job. But when his sensuous kiss takes Jessica by surprise, she realizes he has misunderstood her offer. Now, he has undone the top of her bikini and if she doesn’t want to be fired, Jessica will find there is even more erotic pleasure to come.YES, VERONICA'S FIRST SPANKING - When Veronica is caught cheating she will be expelled unless she proves to Professor Ross that she can learn obedience. But what starts out as a spanking turns into an erotic sexual experience that neither of them could ever have expected.DIRTY LOSING HER CONTROL - When Melissa loses at pool without enough money to cover her bet, she is going to have to pay by obeying every one of Jake’s commands. Soon, he has her stripping naked in front of him while his hands explore her body, teasing her nipples erect and sliding down in between her thighs. Melissa finds she has lost more than the game – she has lost control.For Adults Only - These stories (nearly 19,000 words) are loaded with, hot, graphic sex including oral sex, light bdsm, spanking and more! It is intended only for adults over the age of 18.",
  "genres": [
    "BDSM",
    "Erotica",
    "Anthologies",
    "Short Stories"
  ],
  "author": "V.R. Dunlap",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/12386616-crime-punishment-collection-1-five-erotic-stories-of-sexual-submissi"
}