{
  "title": "The Adventures of Big-Foot Wallace: The Texas Ranger and Hunter",
  "description": "At six foot two inches and two hundred and forty pounds, Big-Foot Wallace cut a formidable figure and certainly made a major impact on the early history of Texas. As a nineteen year old he had heard that one of his brothers had been killed in the Battle of Goliad, an early confrontation in the Texan war of independence with Mexico, and swore to travel West to “take pay of the Mexicans” for his brother’s death. In the following years he fought time and again against the Mexicans for the newly formed Republic of Texas and saw action at Salado Creek, Hondo River and during the Mier Campaign. After returning for the wars in Mexico he abandoned the Texan military and joined the Texas Rangers under the leadership of John Coffee Hays and served for a number of years defending Texans against Native American and border bandits along the frontier. This riotous narrative of the adventures of one of the saltiest and most individualistic pioneer Indian fighters that the state ever produced is told in a leisurely, satirical fashion that reflects a way of life long since lost. Duval's chronicle of one of Texas' greatest adventurers is filled with Wallace's humor and colorful speech. Wallace emerges from the book in all his vigor and robustness, and the reader is transported to a rugged, uncultivated frontier where a few men who were rough enough were carving out a new empire. The flavor and the spirit of early Texas have been captured for countless readers by John C. Duval's Big Foot Wallace. About one-fourth of Big Foot Wallace is devoted to a detailed account of Wallace's experiences in the Mier Expedition. The remainder of the book deals with his adventures on the frontiers of Texas as an Indian fighter, a soldier of fortune, and a member of the first company of Rangers. John C. Duval, the author of Big Foot Wallace, has been called the first man of letters in Texas. Earlier Texans devoted their time to writing about politics and land, but Duval wrote of the frontier and its people with a clarity of perception equaled by few writers in any period. Duval was a man of the camp and range. Civilization did not fit him very well, and he spent much of his time in the wilderness alone. Like his friend and companion, Big Foot Wallace, Duval was an adventurer whose experiences were varied and exciting. In Big Foot Wallace Duval relates a number of his experiences that had been shared with Wallace. Writing late in life, Duval set down memories of events that had mellowed with time. He strove for pictorial and dramatic effects, not historical accuracy. Still Big Foot Wallace has been acclaimed by historians for its amazing accuracy. This book was published in 1870. Duval passed away in 1897 and Wallace in 1899.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Adventure"
  ],
  "author": "John Crittenden Duval",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/43609936-the-adventures-of-big-foot-wallace"
}