{
  "title": "Knox",
  "description": "His voice threaded through her, as if it might be made of rawhide, designed not to break, to weather time and elements, as sturdy as the land he probably worked. Because yes, he wore cowboy like a second skin, the no-nonsense aura of hard work and get ’er done.  About KNOX:  He's not looking for trouble...  Montana rancher Knox Marshall's danger years are behind him. A former bull-rider, he now runs the Marshall family ranch, raising champion bucking bulls for the National Professional Bullrider's Expo (NBR-X). Wealth and success are his, but life is stable, expected, and…ordinary.  But he wants more from life...  But trouble is looking for her...  Kelsey Jones just wants a safe life, a family, a home. Onstage, the beautiful rising star of the Yankee Belles becomes the person she longs to be - vivacious and confident - burying the brokenness she carries from a violent assault. Becoming NBR-X’s next country act is key to outrunning her past and achieving the success and security she craves.  When trouble finds them both...  Knox and Kelsey's paths collide when an explosion at an NBR-X event traps them in the rubble and leaves them reeling. Kelsey’s crippling nightmares return, but for Knox, an obsession to find the bomber is ignited.  What will it cost him to protect her?   When Kelsey’s past threatens Knox’s family, he'll have to choose between saving the Marshall legacy or becoming the protector he's always longed to be.  The explosive first book in the Montana Marshall series!  Action, drama, adventure, flawed individuals and emotional and spiritual challenges are hallmarks of Warren's books. - Christian Library Journal  Warren has a knack for creating captivating and relatable characters that pull the reader deep into the story.  - Radiant Lit  Genre: Inspirational Romantic Suspense Length 320 pages  THE MONTANA MARSHALLS (family series) Book 1: Knox Book 2: Tate (July 2019) Book 3: Ford (September 2019) Book 4: Wyatt (October 2019) Book 5: Ruby Jane (November 2019)  Other books by Susan May Warren:  MONTANA FIRE Book 1: Where There's Smoke (Summer of Fire) Book 2: Playing with Fire (Summer of Fire) Book 3: Burnin' For You (Summer of Fire) Book 4: Oh, The Weather Outside is Frightful (Christmas novella) Book 5: I'll be There (Montana Fire/Deep Haven crossover) Book 6: Light My Fire (Summer of the Burning Sky) Book 7: The Heat is On (Summer of the Burning Sky) Book 8: Some Like it Hot (Summer of the Burning Sky) Book 9: You Don't Have to Be a Star (spin",
  "genres": [
    "Christian Fiction",
    "Romance",
    "Contemporary",
    "Christian",
    "Suspense",
    "Fiction",
    "Christian Romance"
  ],
  "author": "Susan May Warren",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/43595592-knox"
}