{
  "title": "Nine Minutes Later",
  "description": "Cameron has a plan to avenge her sister, and Dusty Roar, The Night Skulls' president's son, is first to taste the hell she's prepared for the motorcycle gang that took her sister.But in the dark, Dusty's pain and secrets...and body do what she's NOT prepared for.Eight months ago, Cameron's fifteen-year-old sister was abducted in the middle of the day by the leader of one of the most notorious and brutal motorcycle gangs in San Francisco. The Night Skulls.From that moment on, Cameron's life changed forever. She dropped out of a college and dedicated all she had to a dangerous, vindictive plan that would get her sister back. She changes her looks and lures Dusty, the son of the gang's leader into a trap. Now that he's her prisoner and leverage, will torturing this bad boy get him to tell her where her sister is? Or will the frightening, rough and violent world he belongs to, where loyalty is the key to survival, stand in the way?Dusty, bulging with muscles and incredibly handsome, has been tricked and taken by a woman half his size, yet all he can think about is kissing her again and protecting her from the evil named Roar. His own father. Somehow, when it comes to Cameron, Dusty doesn't care about his image as the dangerous Night Skull bad boy or The Night Skulls themselves. She becomes his obsession and the one true love of his life.Her desire for him is evident, but when she knows he's the reason behind her sister's abduction and the one who has left her there unprotected, can Cameron forgive him and let him help her get her sister back?Will Cameron get her sister out alive—or get her out at all? Can Cameron and Dusty forgive each other and overcome the darkness their lives forced upon them?Nine Minutes Later, filled with unexpected turns, takes us into the world of motorcycle gangs and inside two hearts that are about to change for life. Curl up under a blanket with this short intense read and find out what happens between Cameron and Dusty in Nine Minutes Later.",
  "genres": [],
  "author": "N.J. Adel",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/43634354-nine-minutes-later"
}