{
  "title": "No Surrender: A Father, a Son, and an Extraordinary Act of Heroism That Continues to Live on Today",
  "description": "Spanning seven decades and  linking a sprawling cast of heroes from every corner of the country, No Surrender  is an unforgettable story of a father’s extraordinary acts of valor in the treacherous final days of World War II and a son’s journey to discover them.\nLike most members of the Greatest Generation, Roddie Edmonds, a humble American soldier from East Tennessee, rarely spoke about his experiences during World War II. Not even his son Chris—who always considered his father a hero—knew the full details of Roddie’s capture at the Battle of the Bulge or his captivity at Stalag IXA, a Nazi POW camp. But when Chris’s daughter was assigned a family history project, Chris reread Roddie’s wartime diaries, which set in motion a series of life-changing events.Called to learn his father’s story with a renewed sense of passion and purpose, Chris embarked on a years-long journey, interviewing surviving POWs under Roddie’s command, and retracing his father’s footsteps, from Fort Jackson, Georgia, where a boyish Roddie transformed into a seasoned leader of men, to the patch of grass near Zeigenhein, Germany, where he stared evil in the eye and dared a Nazi to shoot.Chris Edmonds, along with New York Times bestselling author Douglas Century, takes us to the front lines of this inspiring multigenerational story, revealing in gripping, novelistic detail Roddie’s previously untold heroism—and the lasting effects his bravery had on the lives of thousands, then and now. “What was most remarkable about my journey to discover what my father did during the war,” Chris writes, “was the realization that any one of us has the untapped potential to do something incredibly courageous. We all have the potential to change the world simply by standing up for what’s right.”A quintessential American story of bravery, compassion, and righteousness, No Surrender is a shining example of the transformative and redemptive power of moral courage and a celebration of faith, family, and service, the very characteristics that continue to define us today.",
  "genres": [
    "Nonfiction",
    "History",
    "World War II",
    "War",
    "Biography",
    "Military Fiction",
    "American History"
  ],
  "author": "Christopher  Edmonds",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/43615796-no-surrender"
}