{
  "title": "Never Stop Running",
  "description": "A modern visionary and one of the newest authors to come from America, Dr. Melissa Caudle combines a suspenseful thriller and the search for truth in regard to past lives and reincarnation in this mind-bending novel in the tradition of “This Body: A Novel of Reincarnation” by Laurel Doud, “Journey of Souls,” by Michael Newton, and Past Lives, “Many Masters” by Brian L. Weiss. The result is a masterful original fiction novel as profound as it is awe inspiring. “Never Stop Running” is a page-turning thriller that begs to be read in a single sitting as this mental time travel spanning centuries and numerous past lives through regression hypnotherapy unfolds.Based on a true story of one woman's struggle to recover her memories after a devastating accident left her with retrograde amnesia. This is an astonishing novel from an unforgettable author and is a must read. What happens when the unthinkable occurs? What would you do if your loved one all of sudden woke up and didn't know who you were or for that matter who your family was either? For David and Jackie Hennessey they had the perfect white picket fence life, marriage, family and careers until the unthinkable happened - an accident that left Jackie with no memory. The couple struggled to find the balance between what they once shared and their new life. After David discovered Dr. Grayson, a well-known regression hypnotherapist, he convinced Jackie to seek his services in order to retrieve her subconscious memories. During her sessions, her memories surfaced only to uncover her past lives which crisscross centuries in her mental time travel. Faced with a moral dilemma of believing the dreams were once a reality and twisting her religious convictions on reincarnation, Jackie questioned her sanity and feared for her life after seeing her deaths in her previous lives. She believed she could never stop running as her marriage degrades and falls apart. Based on real events of regression hypnotic sessions of one brave woman, this is a tale of destiny and soul mates not to be missed. The most intriguing book you'll read all year. You don't have to believe in reincarnation to enjoy this tale, but it will get you to thinking about the possibility.",
  "genres": [],
  "author": "Melissa  Caudle",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/43616139-never-stop-running"
}