{
  "title": "The Village",
  "description": "The Village, first published in 1952, begins on the very day the war ended. Two women, who have been firm friends during the war, go as usual to the Red Cross Post. Here they spend the night as they always had done, chatting over a cup of tea. As dawn breaks they lock the door 'but still they lingered, unwilling finally to end this night and the years behind it. \"There's a lot of us will miss it,\" Edith said. \"We've all of us felt at times, you know, how nice it was, like you and me being able to be together and friendly, just as if we were the same sort, if you know what I mean.\" \"I'll miss it a lot too,\" Wendy said. There was no point in her saying that it could go on now, the friendliness and the companionship and the simple human liking of one woman for another. Both knew that this breaking down of social barriers was just one of the things you got out of the war, but it couldn't go on.' The main theme of The Village is that Wendy's attempt to cling on to her old way of life was already under pressure by 1939 and had become even more out-of-date by 1945. It is Edith who is the New Britain, with her prosperous son and her commonsense and indeed kindness. Wendy, with her snobbery and her refusal to change and her uncompromising attitude to her daugher, is the Old. When Labour swept to a landslide victory in 1945 'Attlee's government promised a fairer future for all and no going back to the inequalities of the pre-war world,' writes Juliet Gardiner in her Afterword to this Persephone edition of The Village. When Wendy goes back up the road to Wood View on Priory Hill 'where the gentry lived' and Edith goes downhill on the other side, 'down Station Road among the working classes', they both assume that the values and habits of pre-war Britain will continue. But Britain has already changed a great deal, a change symbolised by Edith's son Roy, a printer with excellent prospects, falling in love with the penniless Margaret, Wendy's daughter. 'The story of the romance between the two of them forms the central narrative of the novel,' Juliet Gardiner continues, 'and the attitude of the other villagers when the news gets out illuminates their understanding - or rejection - of the village's elaborately calibrated social stratification. This is a finely-observed novel about the losses and gains of the Second World War, how hopeless and how isolating it would be to hold onto the past, how illusory was the notion that the war had broken down class barriers, or had managed to save \"deep England\" from the future and how peace, too, would produce its own list of casualties. It is also about the futility of 'keeping up appearances', the boredom of middle-class women with nothing to do, even the realisation that cooking and housework had to be streamlined if theose women were to take their place in society. But above all The Village is an extremely enjoyable and well-written novel evoking an entire community (there is a long cast of characters at the beginning) and a whole way of life, and has one of the most ancient plots in the world - a young couple who fall in love but are forbidden to marry.",
  "genres": [
    "Fiction",
    "Classics",
    "British Literature",
    "Modern Classics",
    "20th Century",
    "Romance",
    "World War II"
  ],
  "author": "Marghanita Laski",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1238734.The_Village"
}