{
  "title": "The Book of Legends/Sefer Ha-Aggadah: Legends from the Talmud and Midrash",
  "description": "The first complete English translation of the Hebrew classic Sefer Ha-Aggadah brings to the English-speaking world the greatest and best-loved anthology of classical Rabbinic literature ever compiled. First published in Odessa in 1908-11, it was recognized immediately as a masterwork in its own right, and reprinted numerous times in Israel.The Hebrew poet Hayim Nahman Bialik and the renowned editor Yehoshua Hana Ravnitzky, the architects of this masterful compendium, selected hundreds of texts from the Talmud and midrashic literature and arranged them thematically, in order to provide their contemporaries with easy access to the national literary heritage of the Jewish people -- the texts of Rabbinic Judaism that remain at the heart of Jewish literacy today.Bialik and Ravnitzky chose Aggadah -- the non-legal portions of the Talmud and Midrash -- for their anthology. Loosely translated as \"legends\", Aggadah includes the genres of biblical exegesis, stories about biblical characters, the lives of the Talmudic era sages and their contemporary history, parables, proverbs, and folklore. A captivating melange of wisdom and piety, fantasy and satire, Aggadah is the expressive medium of the Jewish creative genius.The arrangement of this compendium reflects the theological concerns of the Rabbinic sages: the role of Israel and the nations; God, good and evil; human relations; the world of nature; and the art of healing. Here, the reader who wants to explore traditional Jewish views on a particular subject is treated to a selection of relevant texts at his fingertips but will soon become immersed in a way of thinking, exploring, and questioning that is the hallmark of Jewish inquiry.\"Whatever the imagination can invent is found in the Aggadah,\" wrote the historian Leopold Zunz, \"its purpose always being to teach man the ways of God.\" The Book of Legends/Sefer Ha-Aggadah, now available in William Braude's superbly annotated translation, enables modern Jews to experience firsthand the richness and excitement of their cultural inheritance.",
  "genres": [
    "Judaism",
    "Jewish",
    "Religion",
    "Judaica",
    "Spirituality",
    "Reference",
    "Nonfiction"
  ],
  "author": "William G. Braude",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/436297.The_Book_of_Legends_Sefer_Ha_Aggadah"
}