{
  "title": "The Man on the Mountaintop: An Audible Original Drama",
  "description": "5 hrs and 45 mins\nBacked by original music and straightforward sound effects, Tucci's direct and gentle narration keeps this superb full-cast performance on track and flowing. A rare blend of down-to-earth wisdom mixed with fine acting and an engaging story—what a treat. -  AudioFile Magazine Earphones Award WinnerTake an inspiring philosophical and spiritual journey with this simple but profound tale, which won an Audie Award in 2019. Stanley Tucci (The Devil Wears Prada, Fortitude) and Toby Jones (Infamous, Harry Potter) lead a multitude of voices in a stirring listen that will transport you to a mountaintop retreat—and introduce you to the pilgrims who gather there. Adapted from Susan Trott's best-selling novels, The Holy Man and The Holy Man's Journey, The Man on the Mountaintop tells the story of Holy Man Joe, a humble and unassuming 72-year-old man who lives in a hermitage at the top of a mountain. Thousands of hopefuls line the single-file path leading to his door, seeking his wisdom. The pilgrims bring a multitude of modern-day problems, sorrows, and grievances. From the arrogant and wealthy man intent on cheating his way to the front of the line to the alcoholic who gradually builds the physical and mental strength needed to quit his addiction, The Man on the Mountaintop is an uplifting parable full of life lessons, powerfully told with compassion, wit, and humor.The full cast also features the voices of Alison Dowling, Anne Rosenfeld, Avita Jay, Christophe Hespel, Christopher Ragland, Clare Corbett, David Thorpe, Fran Canals, Hayward B. Morse, Jeff Harding, Lachele Carl, Laurence Bouvard, Liza Ross, Lobo Chan, Martin T. Sherman, Paul Panting, Rachel Atkins, Richard Rees, Sagar Arya, Sheena Bhattessa, Stephen Hogan, and Tim Bentinck.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Philosophy",
    "Spirituality",
    "Self Help",
    "Contemporary",
    "Religion"
  ],
  "author": "Susan Trott",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/43658721-the-man-on-the-mountaintop"
}