{
  "title": "The Big Bad Wolf Romance Compilation",
  "description": "Enjoy Heather Killough-Walden's critically acclaimed, New York Times bestselling Big Bad Wolf series, now combined in one tome of sexual tension, romantic suspense and dark paranormal bliss....The Heat, Book One: Lily St. Claire is a simple Southern girl who has no idea what she is in for when she decides to move back to her home town in Louisiana after a decade of being away. But between the two very different alpha werewolves who instantly begin fighting to claim her as their mate and the serial killer who has her in his sites, she's about to find out.2. The Strip, Book Two: (warning, contains graphic violence)Green-eyed Malcolm Cole is a cursed werewolf, an alpha in the most powerful sense who has given up hope for any kind of happiness or peace in his life. Until he catches wind of Claire.Claire St.James, Charlie among friends, is an amazing young woman with an incredibly special gift. Cole recognizes this at once and swears on the spot to claim Charlie as his mate. Of course, he isn't the only one with such plans. Charlie is too precious to let go without a fight, and one of the most powerful alphas in the world has already staked a claim, whether Charlie - or Cole - like it or not.3. The Spell, Book Three:Dannai, aka the Healer, has begun dreaming of werewolves. She'd always been able to hide the fact that she was a dormant, using her magic to shield her promising scent from the alphas she's been forced to work with. But now that they've invaded her dreams, her world has been turned upside down. For, though every dormant dreams of her intended mate - Dannai is dreaming of two wolves, not one. And neither one of them is good news. One is a notorious killer. The other is Lucas Caige.Lucas Caige is a man with a haunting past. A warlock took his brother from him fifty years ago and he's spent his life outrunning that dark magic. But fate has a way of throwing sand in your gears, and just when Caige thought he could forever leave behind the magic that brought pain to his life, his path crosses that of the Healer. Dannai unwittingly casts her spell over him the moment he lays eyes on her. She's stunning, she's kind, and everything about her wreaks havoc on his senses. She's also magic incarnate. But if Dannai thinks that's going to stop him from doing everything in his power to make her his mate, the little witch has another thing coming.4. The Hunt, Book Four: Byron Caige has been a prisoner for the last fifty years of his supernaturally long life. Just when he gives up hope of ever knowing freedom again, he is unwittingly rescued by the very same woman who only wants to see him dead. Katherine Dare – Kat – is smart, fast, strong and beautiful – but unfortunately she’s a Hunter, and she’s convinced that Byron murdered her father twenty years ago.She’s also Byron’s dormant.As war breaks out amongst the otherworldly of Earth and threatens the existence of entire races, Kat is faced with a terrible decision. Should she give up her cause and believe Caige when he professes his innocence? Or should she fight him and possibly avenge her father’s taken life – even while she forfeits her own?Also catch a tantalizing sneak peak at Heather's upcoming paranormal series, The Lost Angels.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Werewolves",
    "Shapeshifters",
    "Fantasy",
    "Vampires"
  ],
  "author": "Heather Killough-Walden",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/12387975-the-big-bad-wolf-romance-compilation"
}