{
  "title": "Magic of Lust",
  "description": "The rules of magic are changing, and she's going to make sure they work for her.  Mages are always men. Until her. They harvest the power of simple, primitive emotions. Until her. Jaeda is something new, and the best way to protect herself is to make sure the enemy doesn't have a clue.  That's going to be difficult with an Adevian mage about to take her town.  Shahwa has become her home. A haven of pirates, whores, and vagabonds, this desert oasis is a myth to many and a scourge to the rest, but there's something special about it. It's filled with compassion and made up of people who know exactly what it's like to belong nowhere else.  Now, it's her job to protect them. Hopefully, she won't have to do it alone, because the Jackal still hasn't shown up. She thought what they had was special. Now, she's not so sure, even though her heart says he'll still come. Her mind says she'll save herself either way.  But the Jackal promised her everything, and he meant it. One woman, three men, and they're all bound together by magic. He's not about to let that go.  Together, they have a chance to find happiness, yet before any of that is possible, they have to sort out their own issues. If they can figure out how to do that, then these four have something worth fighting for: each other.  Because what they have is more than just the magic of lust.   MAGIC OF LUST is a complete novel with a reverse harem, polyamorous storyline. It is intended for a mature audience due to the presence of consensual sex, group sex, M/M scenes, and plenty of vulgar language - as well as some potentially triggering situations since the bad guys don't always play nice. While this is a love story, it may not be right for all readers.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Magic",
    "Paranormal",
    "Erotica",
    "M M Romance"
  ],
  "author": "Auryn Hadley",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/43681073-magic-of-lust"
}