{
  "title": "The Confessions of Nat Turner",
  "description": "Nat Turner (1800–1831) was known to his local “fellow servants” in Southampton County as “The Prophet.” On the evening of Sunday, August 21, 1831, he met six associates in the woods at Cabin Pond, and about 2:00 a.m. they began to enter local houses and kill the white inhabitants. Over the next 36 hours, they were joined by as many as 60 other slaves and free blacks, and they killed at least 10 men, 14 women, and 31 infants and children. By noon of Tuesday, August 23, the insurgents had been killed, captured, or dispersed by local militia. Nat Turner alone escaped—until October 30, when he was caught in the immediate vicinity, having used several hiding places over the previous 9½ weeks. The next day he was delivered to the county sheriff and lodged in the county jail in Jerusalem (now Courtland), Virginia. There, from November 1 through November 3, he was interviewed by Thomas Ruffin Gray, a 31-year-old lawyer who had previously represented several other defendants charged in the uprising. Gray had witnessed the aftermath of the killings, interviewed other participants, and survivors, and had supplied written accounts to various newspapers. He was familiar with the outlines of Nat Turner’s life and the plot, and he was aware of the intense interest and the commercial possibilities of its originator’s narrative.In the Confessions, Nat Turner appears more a fanatic than a practical liberator. He tells of being spoken to by the Holy Spirit, of seeing visions and signs in the heavens—”that I was ordained for some great purpose in the hands of the Almighty.” In Gray’s view, “He is a complete fanatic, or plays his part most admirably.”On November 5th, Nat Turner was tried and condemned to be executed; on November 9th, he was hanged. On November 10th, Gray registered his copyright for the Confessions, in Washington, D.C. Within a week his pamphlet appeared, and it is estimated over 50,000 copies were sold in the next few months.This electronic online edition is based on the first edition, published at Baltimore, MD, in November 1831.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literature",
    "Historical",
    "African American",
    "Race",
    "Novels"
  ],
  "author": "Nat Turner",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/12388095-the-confessions-of-nat-turner"
}