{
  "title": "The Vagina Bible: The Vulva and the Vagina - Separating the Myth from the Medicine",
  "description": "From Canadian OB/GYN, women's health advocate and \n\nNew York Times\n\n columnist Dr. Jen Gunter: \n\nThe Vagina Bible\n\n is a comprehensive, accessible antidote to the maelstrom of misinformation around female sexual health, and the ultimate guide to everything a person needs to know about the vagina and vulva.\nWe are well into the twenty-first century and have access to more information than ever before, yet many people don’t know that a vagina is self-cleaning, condoms should be used with a lubricant, eating sugar doesn’t cause a yeast infection, and sex shouldn’t be painful. As a physician with twenty-five years of clinical experience, Dr. Jen Gunter is all too familiar with the fears, fallacies and misinformation that abound about vaginal health. On Twitter, she hilariously exposes unscientific wellness advice and debunks potentially harmful and stunningly unnecessary products from “vagina profiteers.” Dr. Gunter knows the questions women (and men) have about female sexual health, and in The Vagina Bible, she answers them all.For:the sixteen-year-old trying to figure out tampons;the twenty-six-year-old wondering how to avoid a UTI;the thirty-six-year-old trans woman navigating her new anatomy;the forty-six-year-old worried about the changing appearance of her vulva;the fifty-six-year-old looking into the HPV vaccine for her daughter (and maybe herself);the sixty-six-year-old experiencing painful sex;The Vagina Bible offers a repository of accurate information based on science, and delivered with wit and wisdom. This is the fact-based, inclusive, and empowering guide you deserve to advocate for your own body.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Science",
    "Health",
    "Audiobook",
    "Womens",
    "Medical"
  ],
  "author": "Jen Gunter",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/43659806-the-vagina-bible"
}