{
  "title": "The Light of Our Yesterdays",
  "description": "As a U.S. Homeland Security investigator becomes ensnared in a thicket of terrorist puzzles and codes unraveling his troubled past, his counterpart in a parallel Earth without Christianity experiences strange visions of our world after meeting a charismatic preacher with a new message of peace and forgiveness. The two men wade through intolerance, hatred and terrorism while struggling with their own skepticism as a growing connection between them unwittingly leads toward destruction, redemption, or both.In our world, Chris Huxley, a former Catholic altar boy who has lost his faith, must decipher a series of clever codes hidden as contacts in a dead Islamic terrorist’s cell phone. The puzzles toy with his past and take him through an odyssey of religious and historical sites as he hunts for the Ghost Leopard, a terrorist who may have a Vatican connection. As one of the terrorists vacillates over the dictates of his Islamic faith, Huxley is also forced to confront his own beliefs in the midst of troubling echoes from the parallel world. In the parallel world dominated by Muslim empires, Tomadus, a prominent Romani technologist and merchant, experiences an intense flash of light when he meets the charismatic preacher, Isa, who has attracted both Islamic and Jewish followers. Trying to follow his inner “creature” and further confused by his ongoing visions, Tomadus befriends a downtrodden and disillusioned democratic terrorist, begins following Isa despite his ongoing disbelief, and seeks help from First Consul of Roma, a powerful mediator of emperors, who encourages him to keep tabs on the new preacher. As Tomadus tries to understand the source and nature of his visions and the world they represent, he becomes increasingly bent on saving his new friends and his world. But in the end, it may be Tomadus who needs saving.",
  "genres": [],
  "author": "Ken  Hansen",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/43672057-the-light-of-our-yesterdays"
}