{
  "title": "The Games Duology",
  "description": "This book contains the complete unabridged versions of Tokyo Games and Osaka Games. Tokyo Games was awarded an \"Honorable Mention\" in a couple of book festivals and Osaka Games won the Genre Fiction award in the 2022 Beach Book Festival.Tokyo Games -- Virtual Reality Has Become All Too Real Keith, wearing VR game glasses, stared through a secret window, horrified as Takafuji, a leading member of the Japanese government, raped and strangled their friend Melinda. \"Stop!\"  \"Stop you fiend!\" Hanako shouted as she began to pound loudly upon the window. \"Stop! Stop!\" She wanted to smash through the window and save her friend. But she could see that Melinda was already dead. She pounded harder in angry frustration. \"We have to get out of here, now!\" Keith urgently whispered, slipping the game glasses into his pocket. \"We can't do anything for Melinda now. He could have us both killed in a thousand different ways and no one would do a thing about it!\" \"What kind of glasses were you wearing?\" \"They're game glasses... for a VR game, you know,” Keith said. \"I wear the glasses and the player sees what I see, like he's there, instead of me...\" \"Why now, tonight? What does the player want?\" \"I don't know,\" he said. \"But I guess he now wants to blackmail Takafuji.\" \"I see, so will you join with me?\" Hanako said, thinking about how to convince him to try the untested technology she'd developed to swap bodies with her. \"Help me take revenge on Takafuji for Melinda? I'd take care of him myself, if I were a large man like you...\" \"Sure! I'll do anything I can to help you,\" he said completely unaware of how much his life was going to change.Osaka Games - The Game Master Has Control, Or Does He?Everything changes when a Game Master witnesses a murder and kidnapping by a wealthy and powerful player. Osaka Games becomes a real nightmare when a billionaire tech executive goes rogue. He’s wreaking havoc, but to what end? Could it be a play for world domination?Digital Chaos Spills Over Into The Real WorldThrow in a few samurai ghosts, gangsters, body-swapping spirits, and brutal Japanese sword fighting, and it’s anyone’s guess who will survive this paranormal vortex of betrayal and bloodshed.Scroll Up And Grab Your Copy Today!",
  "genres": [],
  "author": "Yurie Kiri",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/123886831-the-games-duology"
}