{
  "title": "A Woman Like That: Lesbian And Bisexual Writers Tell Their Coming Out Stories",
  "description": "The act of \"coming out\" has the power to transform every aspect of a woman's life: family, friendships, career, sexuality, spirituality. An essential element of self-realization, it is the unabashed acceptance of one's \"outlaw\" standing in a predominantly heterosexual world.These accounts -- sometimes heart-wrenching, often exhilarating -- encompass a wide breadth of backgrounds and experiences. From a teenager institutionalized for her passion for women to the mother who must come out to her young sons at the risk of losing them -- from the cautious academic to the raucous liberated femme -- each woman represented here tells of forging a unique path toward the difficult but emancipating recognition of herself. Extending from the 1940s to the present day, these intensely personal stories in turn reflect a unique history of the changing social mores that affected each woman's ability to determine the shape of her own life. Together they form an ornate tapestry of lesbian and bisexual experience in the United States over the past half-century. \tThis song is dedicated to the one I love / Bertha Harris --Widows / Judy Grahn --Mad for her / Jill Johnston --First love / Karla Jay --Novelties / Joan Nestle --The secret agent / Jane DeLynn --My debut / Blanche McCrary Boyd --Red light, green light / Beatrix Gates --A vision / Rebecca Brown --Richard Nixon and me / Heather Lewis --Cherry picker / Chrystos --Born queer / Judith Katz --What comes first / Holly Hughes --House of corals / Cheryl Boyce Taylor --Bride of Christ / Mary Beth Caschetta --The coming out of a gay pride child / Elizabeth Lorde-Rollins --Easter Weekend / Minnie Bruce Pratt --Pot luck / Cynthia Bond --A letter to some lesbians who've been out for a long time / Mariana Romo-Carmona --Waking up / Jacquie Bishop --Banditos / Eileen Myles --Coming out--or going more deeply in? / Margaret Randall --Sequins in the mud : a cover girl comes out! / Karin Cook --Mind and body / Wendy W. Fairey --Always coming / Letta Neely --This girl is different / Tristam Taormino --Picture this / Cecilia Tan --Layers of the onion, spokes of the wheel / Pat Calafia --Freedom rings / Kanani Kauka --Together alone / Eva Kollisch --Diary of a mad lesbian / Lesléa Newman.",
  "genres": [
    "LGBT",
    "Nonfiction",
    "Queer",
    "Lesbian",
    "Memoir",
    "Sexuality",
    "Gay"
  ],
  "author": "Joan Larkin",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/436902.A_Woman_Like_That"
}