{
  "title": "An Evening at Almack's",
  "description": "Receiving an invitation to Almack's, the most exclusive ball in London, is every woman's dream come true. Love and marriage are certain to follow.  From the publisher of the USA TODAY bestselling & #1 Amazon bestselling Timeless Romance Anthology series in Regency Romance, comes An Evening at Almack's. Featuring bestselling authors Sally Britton, Elizabeth Johns, and Sarah M. Eden. THE HEART’S CHOICE by Sally BrittonTo keep her family from scandal, Mattie Rayment needs to marry off her flirtatious younger sister before the Season ends. Vouchers for Almack’s are her best hope to secure a suitable match. When the Rayments cross paths with Oliver Bolton, the nephew of their steward, his interest in the younger sister threatens all her plans. It is up to Mattie to steer Oliver away, but before long she finds herself losing her heart to him, unsuitable match or not. MY UNFAIR LADY by Elizabeth JohnsA lost bet. An underestimated country bumpkin. Who will win in this war of wits? Why, love, of course! Rua Postlethwaite has lived a sheltered, content life in the country until she is orphaned and forced to find work or make a hasty marriage. Her neighbors come together to try to help her have a successful Season after she receives an unexpected offer to go to London. Lord Deverell is the quintessential bored aristocrat with too much time, money, and handsomeness. When he loses a wager over a game of billiards, he finds himself doing more than dancing attendance on a nobody from Yorkshire. SIX WISHES by Sarah M. Eden:Felicity Bandbury has come to London with one aim in mind: give her dying sister the Season of her dreams. But it is a tall order for a young lady who knows nothing of Town or Society. She enlists the help of their neighbor and childhood friend, William Carlisle. He’s not been home in years, not since the sudden loss of his parents. Felicity’s request offers him the hope of healing from his own grief as well as a connection to home he desperately needs. Can two grieving souls find room in their hearts for love? An Evening at Almack's is a Timeless Romance Anthology® book  Other books in the Timeless Regency Collections: AUTUMN MASQUERADE A MIDWINTER BALL SPRING IN HYDE PARK SUMMER HOUSE PARTY A COUNTRY CHRISTMAS A HOLIDAY IN BATH FALLING FOR A DUKE A NIGHT IN GROSVENOR SQUARE ROAD TO GRETNA GREEN WEDDING WAGERS AN EVENING AT ALMACK'S  Timeless Romance Anthology® is a registered trademark of Mirror Press, LLC",
  "genres": [
    "Regency",
    "Romance",
    "Historical Fiction",
    "Anthologies",
    "Fiction",
    "Clean Romance",
    "Historical"
  ],
  "author": "Sally Britton",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/43694056-an-evening-at-almack-s"
}