{
  "title": "Saving Stacy: The Untold Story of the Moody Massacre",
  "description": "Stacy was shot in the face – twice – and left to die. The first time the killer thought he had succeeded, and he left Stacy bleeding in her bed. But a few minutes later he must have heard her moaning and returned to her upstairs bedroom. This time he approached the bed, pointed a .22 caliber rifle at her young face, and pulled the trigger again. Then he left.Later that morning, Memorial Day, May 25, 2005, the Logan County Sheriff would declare it a rampage. According to Sheriff Henry, 18-year-old Scott Moody lived on a family farm with his mother and sister; his grandparents lived nearby. The night before his high school graduation something snapped, and Scott went on a shooting spree. He murdered his two grandparents, his mother, a high school classmate who had spent the night after a graduation party, his girlfriend, and then he turned the rifle on himself, committing suicide. He thought he had killed his 15-year-old sister, but she was life-flighted to a hospital in Columbus where she remained in critical condition. Sheriff Henry declared the mystery “It was horribly tragic, a murder/suicide case.”Three days later, Stacy woke up in intensive care. When asked by the county coroner to explain what happened – clearly expecting her to say that her brother, Scott, had shot her – Stacy, in a weak, distressed voice said something else. It was an older man with gray hair, wearing a blue shirt, someone she had never seen before. And then, once again – what everyone suspected but were afraid to publicly talk about – was the Logan County Sheriff’s Office really corrupt?After Stacy was released from the hospital, Detective Jon Stout wanted to interview her in private, away from the influence of her father and stepmother. On a Sunday afternoon he took 15-year-old Stacy in his unmarked cruiser to a shaded parking lot behind the county children services building. It was there he coerced her into taking off her clothes, playfully handcuffing her to the steering wheel, and then forcibly having sex with her. It was only a matter of time before wrongful death actions were filed against Scott’s estate. That’s when Scott’s father, wanting to remove the stigma of his son’s reputation, hired outside experts, who easily refuted the idea that Scott had been the shooter. People in the community knew all along what had happened. The sheriff’s office was corrupt. Underage sex and illicit drugs had finally raised their ugly heads.",
  "genres": [
    "True Crime",
    "Crime",
    "Nonfiction"
  ],
  "author": "Rob St. Clair",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/43702156-saving-stacy"
}