{
  "title": "Open Mind",
  "description": "At twenty-eight, Jamie Gray has realized his dream of becoming a traveling nurse. After years of moving from place to place, he’s met so many new people but hasn’t formed any true connections. Jamie knows it’s time to stop avoiding his life, like he’s been doing since the death of his mother; his only family. Moving to the big city of Powell’s Point to share an apartment with his best friend is exactly what he needs. It feels like the best time to set down some roots and get into a routine...and maybe, just maybe find love. Ronan Kincaid comes from a long line of doctors. Not being one to conform to the desires of his parents or society, his small practice focuses on the people in the BDSM community of Powell’s Point. Often misunderstood, the community needs someone who knows and lives their lifestyle...someone who will take care of them the way they deserve. With his well-respected practice and exceptional bedside manner—coupled with afterhours scenes and kinky house calls—the nickname Dr. Kink takes hold, much to his dismay. Needing to replace his long-time nurse, he hires the best candidate for his growing practice, figuring his mild attraction is of no consequence. But as time passes, he finds it harder and harder to keep his thoughts and hands away from his new nurse. If only Jamie wasn’t so captivating, drawing Ronan to touch. As their mounting attraction becomes impossible to ignore, their secrets are revealed, changing everything between them. Heated glances turn into heated touches, and they find themselves wondering: Is what they have a passing phase of pleasure and kink, or can they both open their minds to the possibility of a forever love? Author’s Note: For those of you that prefer warnings use the “Look Inside” feature to find them within the first several pages. For those of you that prefer to be surprised, ignore them. . . Happy reading!",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Erotica",
    "LGBT"
  ],
  "author": "Luna David",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/43704500-open-mind"
}