{
  "title": "Forgotten",
  "description": "Before he was freed by Neferet, Kalona was imprisoned within the earth for centuries because of the Darkness in his heart. But what happened to the Other World's Kalona? It's as though he's been forgotten, or maybe he never existed at allIn the present, Other Neferet may have left her House of Night, but she has far from given up her goal of immortality and world domination. As she operates in secret to gain access to Old Magick, the new High Priestess, Anastasia Langford, works toward peace and acceptance for the vampyres of the Other World. But just as Other Kevin's broken heart will take time to heal, peace in that world will also take time and work--and not all of the Other World vampyres want peace. After all, why should they return to being shunned by humans, especially when they've had a taste of how it feels to be in power?Meanwhile, Zoey is desperate to help rid the Other World of Neferet once and for all, and not knowing what's going on over there is eating away at her. But, as the Nerd Herd warns, it's far too dangerous to call on Old Magick time and again. As a distraction, she throws herself into her work and attempts to bring the humans and vampyres of Tulsa closer together with the first human-vampyre swim meet in history! It's too bad that something always seems to go wrong whenever the stakes are high.What happens when worlds clash and powers that should be left alone are awakened? Can Other Kevin and his world heal from the wounds Neferet continues to inflict? Can Old Magick ever truly be harnessed and used for good? Or will Darkness extinguish Light and leave our heroes broken, hopeless, and as forgotten as Kalona of the Silver Wings? Don't miss this second to last volume in the House of Night Other World saga!",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Vampires",
    "Paranormal",
    "Romance",
    "Fiction",
    "Magic"
  ],
  "author": "P.C. Cast",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/43704439-forgotten"
}