{
  "title": "The Book of Chaos",
  "description": "\"Follow the Dark and where it's leading you...\"\nVivian Amberville® is a bestselling philosophical fantasy book series about a girl whose imagination can reshape reality.This year, the universe that spanned millions of fans worldwide and captured readers imagination all around the world invites you on an epic journey beyond the fabric of reality.Return to a world where reality can be altered and history can be rewritten, and discover what it really takes to reshape your destiny. ABOUT THE BOOK There is a hard limit to human imagination. This story will take you far beyond that limit, beyond the fabric of reality itself.\"Vivian Amberville - The Book of Chaos\" is the second instalment in the Vivian Amberville fantasy series by international author, Louise Blackwick. It centers on Vivian’s attendance at the “Alarian School of Thought”, a place where students learn the noble and dangerous art of \n“Weaving subtle Threads of influence into the fabric of reality”.\n Joined by friends and challenged by foes, Vivian will have to master her ability to manipulate odds and circumstances, in a world now complicated by war, disease and political strife. SHORT SYNOPSIS Every crevice hides a shadow. Every shadow, a shape. And there are Darkthings sleeping beneath the folds of reality…A book that won’t open. A grey and shadowless place. A mysterious Black Door, with a countdown from eight. And Things without Eyes that await in the Dark.Vivian Amberville is about to unravel it all. Now that she is a student of Weavership at the “Alarian School of Thought”, she is to learn how to twist the fabric of reality to her will.There are answers to be found in Subexistence, the hidden pocket dimension of discarded choices and paths not followed.But the Abyss is a dark and dangerous place, built like a labyrinth. Can she find her way out?THE ONLY WAY OUT IS THROUGH.With the help of a mysterious diary from her past, Vivian must uncover the secret behind her Chaos-Weaving abilities, and learn the truth about her dark and terrible destiny. LONG SYNOPSIS Vivian’s powers over reality have taken a dark turn.Believed to be a Chaos Weaver – a Weaver’s dark twin – Vivian’s powers must be brought under control, lest they consume the substance of creation.Under the looming threat of a mysterious dark presence, Vivian will once again travel beyond the fabric of reality and attend the “Alarian School of Thought”, a place where Weavers are made and Chaos Weavers are notoriously unmade.When the war on Chaos Weavers becomes a war for her soul, Vivian must seek the Abyss to confront the origin of her powers. Aided by a mysterious book from her past, she must learn to navigate Subexistence, a place where history can be rewritten, and Time is both instant and infinite.Is Vivian Amberville’s life a figure-8 loop? Is there such thing as free will? \nThe Dweller on the Threshold\n is bound to answer her questions. And what of the Dark Horror that sleeps in the Abyss of Reality?Her choice is between Heart and Death. On one side, is herself; on the other, reality.Will she make the right choice?GENRE: epic dark fantasy;CATEGORY: new adult, coming of age, adventure, Jungian allegory;SETTING: double-dystopia: futuristic dystopia and fantasy world;SUBJECTS: time travel, complex time loops, parallel universes, mind over matter, matter manipulation;THEMES: free will vs. determinism, order vs. chaos, freedom and responsibility, embracing your shadow, family, friendship, sacrifice;TAGS: post-apocalyptic, time loops, inter-dimensional travel, journey within;",
  "genres": [
    "Epic Fantasy",
    "Fantasy",
    "Young Adult",
    "Coming Of Age",
    "Dark Fantasy",
    "High Fantasy"
  ],
  "author": "Louise Blackwick",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/43705034-the-book-of-chaos"
}