{
  "title": "Kit Carson's Autobiography",
  "description": "Kit Carson is the archetypal hero of the American frontier. \n  We have all read of his actions in dime novels and lionizing biographies.  \nBut who was the real Kit Carson?\n  It is rare that this question can be answered by the subject themselves, but Kit Carson’s Autobiography allows the reader a brilliant view into the story of this remarkable man through his own words.  The autobiography was found by mere chance in the early twentieth century by Mrs. Pierce Butler and Milo Milton Quaife as they were searching through the Ayer Collection of Americana at the Newberry Library, and now with the assistance of Dr. Quaife’s editing can be enjoyed by all.  The book uncovers all the details of Carson’s life on the plains and in the mountains of the Far West in modest, but truthful style.  Beginning with his childhood and escape from dull life in Missouri at the age of sixteen, Carson’s autobiography exposes how he spent the next thirty years of his life as a frontiersman in the wild lands of the west.  The book reveals Carson’s view of life as a trapper, Indian fighter, guide and buffalo hunter, and gives details on his experiences in some of the famous expeditions with Ewing Young and John C. Frémont.  The rough experiences of his life are told in a frank manner that transport the reader to the world of this illiterate frontier legend.  Kit Carson, born Christopher Houston Carson, was an American mountain man, wilderness guide, Indian agents and U. S. Army officer. His understated nature belied confirmed reports of his fearlessness, combat skills, tenacity, and profound effect on the westward expansion of the United States. His autobiography was dictated to a friend in 1856 but was not fully published until the twentieth century. This edition, edited by Milo Milton Quaife, was first published in 1935. Carson passed away in 1868 and Quaife passed away in 1959.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "American History"
  ],
  "author": "Kit Carson",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/43712760-kit-carson-s-autobiography"
}