{
  "title": "Brazil-Maru",
  "description": "From Japanese-American writer a story of Japanese emigration set, like her first novel ( Through the Arc of the Rain Forest , 1990), in Brazil. A range of characters, male and female, tell about a particular group of Japanese who emigrated to Brazil in the first decades of this century. Christian, well-educated, and reasonably affluent, they sought to establish communities where Christian and Japanese values could flourish. The group prospered, though not without cost, and it is this cost that's a major theme here. A secondary theme, suggested by the quotes from the philosopher Rousseau that precede each section, is the nature of education in a new world where emigrants' children often have only 'natural and purely physical knowledge.' Young Emile begins with his recollections of his 1925 arrival in Brazil as a small child; the uncomfortable journey to the settlement where families already there helped them clear land; and the hard work required to become self-sufficient. But even the most idealistic communities have problems, and, successively, Emile, Haru, Kantaro, and Genji, over the years, record the events and personalities that threatened the Kantaro, the visionary and dilettante, whose enterprises from baseball to chicken-farming had unforeseen consequences; the bitter divisions caused by WW I that led to the murder of an original founder; the effects of the enduring passion of Yergo for Haru; and the increased assimilation with neighboring Brazilians. Paradoxically, assimilated Guillerme notes in an epilogue that thousands of unemployed Japanese-Brazilians are currently working in Japan as menial labor. Though often seeming more a work of reportage than a novel, Yamashita's characters are vital, full-bodied creations offering sufficient balance, as well as answers to the questions raised. Informative and timely.- Kirkus",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Brazil",
    "Japan",
    "Historical",
    "Literature"
  ],
  "author": "Karen Tei Yamashita",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/43710.Brazil_Maru"
}