{
  "title": "ستائر العتمة",
  "description": "في وقت (عام 2001 م) أعلنت فيه دولة الظلم والطغيان قرار بمنع التعذيب الجسدي (إلا في حالات خاصة تستلزم استصدار قرار للموافقة عليه)، واستخدام التعذيب النفسي فقط عند التحقيق مع الأبطال القابعين خلف الأسوار في سجون الاحتلال على أرض فلسطين الطاهرة، قدم الأستاذ وليد الهودلي رواية ستائر العتمة، تلك القصة الواقعية التي خرجت من قلب المحنة، وصميم الواقع الأليم؛ قصة الشاب عامر الذي كابد تسعين يوما من المواجهة الملتهبة التي فُرضت عليه وهو يرزح في أغلال الاحتلال البغيض، والذي واجه فيها عدوّا يمتلك كل الإمكانيات، وهو مجرد من كل السلاح سوى سلاح واحد؛ إيمانه بالله وبعدالة قضيته، إيمانه الذي هو الزيت والوقود لانتصاره على عدوه، فأصبحت إرادته وقوته أقوى من كل إمكانياتهم، وأصبح عملاقا يحتفظ برباطة جأشه أمام قزم يرغي ويزبد. تلك الرواية التي كانت سببا في توعية نسبة كبيرة من الشباب الفلسطيني من الوقوع في ألاعيب المخابرات الإسرائيلية وطرقهم في خداع المعتقل الفلسطيني في مرحلة التحقيق، وأمدت الكثير منهم بالعزيمة والإرادة والثبات أمام عدوّهم. جاءت تلك الرواية على خمسة فصول: \tتقلبات زنزانة بعد أن نفّذ برفقة إخوانه إبراهيم ونبيل عملية عسكرية ناجحة ضد المستوطنين على أرض رام الله المحتلة، وجد نفسه يقبع في مربع مظلم لا يكاد يرى جدرانه من شدة العتمة فيه، والذي كان يخيل إليه أحيانا بأن الأكسجين قد نفذ منه، والذي أشبه ما يكون بالقبر، ذلك المكان الذي يسمّى زنزانة في سجون الاحتلال. تركوه بعد الاعتقال أياما عديدة في تلك الزنزانة، في صمت رهيب يتقلب فيها بين أفكاره كمن وقع صريعا لألم أضراسه، وفي بعض الأحيان يدخلون إليه أحد عصافيرهم الذي لعب دور الخائف من العصافير، ليبعد عن نفسه الشكوك والذي اكتشف في النهاية بأنه أغرب وأخبث عصفور رآه في حياته، حيث ذكره بخداعه ومكره بقصة الشيطان الأبيض مع برصيص الراهب. (ملاحظة: العصفور مصطلح يُطلق في السجون الإسرائيلية على العميل، الذي يتعاون مع المخابرات في الوصول إلى اعترافات الأسرى) فقد ظهر في الرواية أساليب المكر والاحتيال التي اتبعها ذلك العصفور الماكر، لإيقاع عامر في فخ الاعتراف، وكيف واجه عامر تلك الأساليب الخبيثة حتى نجا بنفسه من الانزلاق في فخ الاعتراف أمام ذلك العصفور الخبيث (مع الاعتذار لجنس العصافير البريء مما لوثهم به هؤلاء المنافقون). \tمقالب التحقيق بعد ذلك تناوب عليه المحققون واحدا تلو الآخر، أحدهم يساوم، وآخر يهدد، وثالث يتكلم بكلام من الشرق وآخر من الغرب وبمواضيع مختلفة، المهم أن يتكلم، ورابع يجلس معه ساعات فقط ليقدم النكت السمجة مثل سماجتهم، كل منهم له هدف يرمي لتحقيقه، ولكن عامر كان أكثر ذكاء ودهاء، وبعون الله استطاع أن يواجه حيلهم وخدعهم الماكرة، والانتصار عليهم جميعا. \tالزنزانة مرة أخرى مرة أخرى أعادوه إلى ذلك المربع المظلم، ويمضي الوقت على عامر ببطء شديد وهو بين صولات وجولات، بين موجات أسئلته وأفكاره المحيرة، وجولات الذكر التي تطفئ نارها التي تحرق صدره. هددوه باعتقال زوجته وأمه وأخته، وأروه ما يجعله يصدق تهديدهم، وأتوا بصاحبه إبراهيم إلى الزنزانة المجاورة، وبعدها صاحبه نبيل إلى زنزانته، على أمل أن يستطيعوا سحب كلمة مما يريدون معرفته، لكن ذكاء عامر ودهاءه وتوفيق الله له فوّت عليهم الفرصة. \tصفقة مغرية استضافوه مرة أخرى في مكان التحقيق، عرضوا عليه أن يتم اختباره على جهاز كشف الكذب، ساءت حالته الصحية، أضرب عن الطعام حتى يحصل على حقه في العلاج، عرضوا عليه صفقة مغرية، لكن وسائلهم هذه كلها كانت أفلاما محروقة وقديمة لدى عامر، خبرها جيدا من خلال متابعته لهذه الشؤون بكل تفاصيلها. دفعوا إليه أحد أصدقائه من الشباب الثقة، الذي طلبوا منه تحت الضغط أن يعمل عصفورا على صديقه عامر، لكن عامر استطاع إعادته إلى صوابه وقوّى عزيمته وأنقذه من التورط معهم وخيانة الوطن والدين والعرض. أخذوه إلى عسقلان ووجد نفسه في مكتب تحقيق مع وجه جديد من المحققين كان الإجرام يتكلم في هذا الوجه، تناثر الغضب عن وجهه كأمواج صاحبة وصرخ مهددا عامر بما سيلاقيه في ذلك المكان حيث التحقيق الأقسى والأشد مقارنة بما رآه منهم في الأيام السابقة في المسكوبية والذي وصفه بأنه \"لعب عيال\". هددوه وساوموه وحاولوا إسقاطه في مستنقع الرذيلة مع إحدى المحققات، لكنه انتفض بكل إرادة وقوة وخلص نفسه من تلك المؤامرة. عندما يئسوا وباءت كل محاولاتهم السابقة بالفشل، قاموا باستصدار قرار السماح باستخدام التعذيب الجسدي معه، وتم الموافقة على القرار، وواجه ألوانا من العذاب تصدى لها بعزيمته وإرادته وقوته وثباته وتحدّيه واستعانته بمولاه، وصمد أمام تعذيبهم، وكان يصرخ مرددا (أحد .. أحد) كلما اشتد عليه التعذيب فيستصغر الذي يواجهه خاصة عندما تمرّ في مخيلته صورة بلال بن رباح ومشاهد عذابه على رمال الصحراء المستعرة، ويستذكر حديث الذين نشروا بالمناشير ومشطوا بأمشاط الحديد فيزداد صبره وثباته. لكن حالة عامر الصحية لم تسمح لهم بالاستمرار في هذا العنف، وكذلك اصطدامهم العنيف بصخرة عناده، فعادوا أدراجهم للعنف النفسي والحرمان الطويل من النوم ورغي الكلام الثقيل فوق رأسه. وفي النهاية وبعد تسعين يوما من المواجهة الملتهبة رأى دموع الهزيمة وسوء المنقلب تقطر بها عيونهم، رآهم أذلاء رغم جبروت أساليبهم الجهنمية وانتصر عليهم، فلم يحصلوا على ما أرادوه منه، واستسلموا أمامه وقاموا بنقله إلى سجن عسقلان الذي يرقد بجوار مركز التحقيق اللعين. \tفي رحى السجن دخل السجن الذي قضى فيه سابقا عدة سنوات، داعبت أشعة الشمس الربيعية جفونه واستنشق من فضاء واسع يملؤه هواء لذيذ، نظر إلى أعلى فوجد زرقة السماء بصفاء تحتضن قطيعا من الغيوم الصغيرة، تلك المشاهد التي اشتاق لها كثيرا بعد أن حُرم منها لمدة تسعون يوما رأى خلالها ألوان من العذاب والألم والتعب. التقى هناك بصاحبيه نبيل وإبراهيم، وعرف منهما كيف وقعوا في فخ العصافير وأدلوا باعترافاتهم، وقيّموا تجربتهم بهدوء، ووقفوا على أخطاء كل واحد منهم، فقد نجحوا في جوانب وفشلوا في جوانب أخرى، لكن تذكروا بأن مسيرتهم مع أعداءهم طويلة، وقد تعلموا من هذه التجربة الكثير. وعاد عامر ليعدّ الأيام الصخرية في السجن من جديد، على أمل بالفرج القريب من الله. وهكذا تنتهي فصول الرواية، لتكون تجربة عملية، وقصة واقعية، يتعلم منها كل من قد يتعرض لمثل ما تعرض له كل من عامر وصاحبيه، ليكونوا على علم بتلك الأساليب الماكرة الخبيثة الخداعة، ويحترزوا منها، وليكون ذلك الشاب عامر قدوة لهم في ذكاءه ودهاءه وصموده وثباته وقبل كل ذلك استحضاره معيّة الله والاستعانة به والتوكل عليه.عن المؤلف:ولد الأديب وليد الهودلي عام 1960 م في مخيم الجلزون للاجئين الفلسطينيين قضاء رام الله المحتلة في فلسطين، ويرجع أصله إلى العباسية في مدينة يافا المحتلة. أنهى دراسته الابتدائية والإعدادية في مخيم الجلزون، أما دراسته الثانوية فكانت في رام الله المحتلة. تخرج من معهد المعلمين في مدينة رام الله، ليعمل بعدها مدة أربع سنوات كمعلم للرياضيات. قضى أكثر من 15 عاما من عمره في سجون الاحتلال، عمل طيلة فترة اعتقاله في العمل الثقافي داخل السجون، وقضى أغلب فترة سجنه في الكتابة الأدبية، حيث خرج من السجن بثلاث روايات وسبع مجموعات قصصية. بينما قضت زوجته \"عطاف عليان\" أكثر من 10 سنوات في سجون الاحتلال، وكانت لابنتهما عائشة الهودلي النصيب في قضاء أول عامين من عمرها في السجن برفقة أمها. شارك في بعض الأبحاث والدراسات ومراسلات صحفيّة وفي كتابة القصة القصيرة والمقالة السياسية. طبع له حتى الآن روايتان ومجموعتان قصصيتان، بالإضافة إلى مجموعتين للفتيان، وبقية أعماله قيد الطباعة. رئيس تحرير مجلة \"نفحة\" التي تعنى بشؤون الأسرى والمعتقلين. صدر له عام 2004 م كتاب \"منارات\" عن مركز البراق للبحوث والثقافة (البيرة – فلسطين). شارك في جمعيّة أنصار السجين كمتطوع في أنشطة هذه الجمعيّة. مدير مركز بيت المقدس للأدب. حصل على المرتبة الثانية في مسابقة الإعلام والصحة، من خلال كتاباته تحت عنوان \"الصحة والمرض في السجون والمعتقلات\". كان للسجن فعله مع الروائي وليد الهودلي كما يقول، فقد أسهم السجن كثيرا في صناعة وليد الأديب والروائي؛ بدأ ذلك بكتابة نشرات دورية لتعبئة السجناء معنويا وثقافيا، ثم تطور إلى كتابة القصة القصيرة والرواية، ليصدر أول عمل أدبي له سنة 1998 بعنوان: \"مدفن الأحياء\" وهو شواهد حية عن حال المرضى في سجون الاحتلال. كما صدر له في 1999 رواية: \"الشعاع القادم من الجنوب\"، وبعدها صدرت له رواية \"ستائر العتمة\" والتي كان لها دور هام في توعية نسبة كبيرة من الشباب الفلسطيني من الوقوع في ألاعيب المخابرات الإسرائيلية وطرقهم في خداع المعتقل الفلسطيني في مرحلة التحقيق. من مؤلفاته أيضا المجموعة القصصية: \"مجد على أبواب الحرية\" وغيرها العديد من الروايات والقصص والدراسات.خواطر:1.\tرغم أن نهاية الرواية لم تكن واضحة (لم يظهر في الرواية ما هو المصير الذي انتظر عامر وكم من الوقت قضى في السجن) إلا أنني وجدت الفائدة في سرد أحداث الرواية والتي أظهر فيها بكل وضوح الأساليب الماكرة التي تتبع في سجون الاحتلال أثناء التحقيق مع السجناء، ففي سرد تلك التفاصيل وتوضيح تلك الأساليب كان لبّ الفائدة. 2.\tقد يقول البعض من غير الفلسطينيين بأن هذه الرواية ليست لي لكي أقرأها وإنما هي لأبناء فلسطين الذين يعيشون ذلك الواقع. ولهم أقول: بأن أساليب المكر والخديعة في أي مكان وزمان متشابهة سواء في التحقيق أو غيره، وهذه الرواية تبيّن تلك الأساليب الماكرة وتحذّر منها. كما أنها تجعلك تشعر بمعاناة أخوة لك في فلسطين، لتقف إلى جانبهم ولو بالدعاء لهم بالنصر والثبات، وتستمد القوة والعزيمة من أصحاب تلك الإرادة القوية والعزيمة الصلبة أمثال ذلك الشاب الذي دارت أحداث الرواية حول قصته. 3.\tتعلمت منها بأن الثقة لا تلغي الحذر، ورأيت فيها إلى أي حد قد يصل التفنن في أساليب المكر والخداع عند ذوي النفوس الضعيفة للوصول إلى مآربهم وإيقاع الناس في فخ صيدهم، وكيف أن المجرم يمثل دور الضحية. 4. وما تعلمته منها ورأيته فيها فتح عيني وجعلني أكثر وعيا وحذرا في حياتي وتعاملاتي لأحمي نفسي وأنجو بها من شر الكائدين. 5.\tلمست من خلال الرواية مدى التخطيط المحكم والإعداد المسبق من قبل العدوّ لتحقيق أهدافهم التي يريدون الوصول لها مع السجناء، فأين نحن من التخطيط لحياتنا وللنهضة بأنفسنا وبأمتنا؟! ومتى نعود له؟! وهل يغني التخطيط المحكم عن الاستعانة بالله؟ ولابد أن أذكر هنا عبارة لمحمد راتب النابلسي يقول فيها: \"خذ بالأسباب بأعلى درجاتها وكأنه لا يوجد توكل على الله، وتوكل على الله إلى أقصى درجة وكأنه لا يوجد أخذ بالأسباب\".تساؤلات:1.\tمن أين استمدّ الشاب عامر تلك القوة في مواجهة أعداء الله؟ وكيف وصل إلى تلك الدرجة من الحنكة والذكاء حتى استطاع الانتصار عليهم رغم كل الإمكانيات المتاحة لهم؟",
  "genres": [
    "Novels"
  ],
  "author": "وليد الهودلي",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/12389387"
}