{
  "title": "Can't Buy Me Love: The Beatles, Britain, and America",
  "description": "Nearly twenty years in the making, Can’t Buy Me Love is a masterful work of group biography, cultural history, and musical criticism. That the Beatles were an unprecedented phenomenon is a given. In Can’t Buy Me Love, Jonathan Gould seeks to explain why, placing the Fab Four in the broad and tumultuous panorama of their time and place, rooting their story in the social context that girded both their rise and their demise.Beginning with their adolescence in Liverpool, Gould describes the seminal influences––from Elvis Presley and Chuck Berry to The Goon Show and Alice’s Adventures in Wonderland––that shaped the Beatles both as individuals and as a group. In addition to chronicling their growth as singers, songwriters, and instrumentalists, he highlights the advances in recording technology that made their sound both possible and unique, as well as the developments in television and radio that lent an explosive force to their popular success. With a musician’s ear, Gould sensitively evokes the timeless appeal of the Lennon-McCartney collaboration and their emergence as one of the most creative and significant songwriting teams in history. And he sheds new light on the significance of Sgt. Pepper’s Lonely Hearts Club Band as rock’s first concept album, down to its memorable cover art.Behind the scenes Gould explores the pivotal roles played by manager Brian Epstein and producer George Martin, credits the influence on the Beatles’ music of contemporaries like Bob Dylan, Brian Wilson, and Ravi Shankar, and traces the gradual escalation of the fractious internal rivalries that led to the group’s breakup after their final masterpiece, Abbey Road. Most significantly, by chronicling their revolutionary impact on popular culture during the 1960s, Can’t Buy Me Love illuminates the Beatles as a charismatic phenomenon of international proportions, whose anarchic energy and unexpected import was derived from the historic shifts in fortune that transformed the relationship between Britain and America in the decades after World War II.From the Beats in America and the Angry Young Men in England to the shadow of the Profumo Affair and JFK’s assassination, Gould captures the pulse of a time that made the Beatles possible—and even necessary. As seen through the prism of the Beatles and their music, an entire generation’s experience comes astonishingly to life. Beautifully written, consistently insightful, and utterly original, Can’t Buy Me Love is a landmark work about the Beatles, Britain, and America.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "History",
    "Pop Culture",
    "Biography Memoir",
    "British Literature"
  ],
  "author": "Jonathan    Gould",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/437112.Can_t_Buy_Me_Love"
}