{
  "title": "Reproduction",
  "description": "WINNER OF THE SCOTIABANK GILLER PRIZE\nA hilarious, surprising and poignant love story about the way families are invented, told with the savvy of a Zadie Smith and with an inventiveness all Ian Williams' own, Reproduction explores unconventional connections and brilliantly redefines family. \nFelicia and Edgar meet as their mothers are dying. Felicia, a teen from an island nation, and Edgar, the lazy heir of a wealthy German family, come together only because their mothers share a hospital room. When Felicia's mother dies and Edgar's \"Mutter\" does not, Felicia drops out of high school and takes a job as Mutter's caregiver. While Felicia and Edgar don't quite understand each other, and Felicia recognizes that Edgar is selfish, arrogant, and often unkind, they form a bond built on grief (and proximity) that results in the birth of a son Felicia calls Armistice. Or Army, for short.     Some years later, Felicia and Army (now 14) are living in the basement of a home owned by Oliver, a divorced man of Portuguese descent who has two kids--the teenaged Heather and the odd little Hendrix. Along with Felicia and Army, they form an unconventional family, except that Army wants to sleep with Heather, and Oliver wants to kill Army. Then Army's fascination with his absent father--and his absent father's money--begins to grow as odd gifts from Edgar begin to show up. And Felicia feels Edgar's unwelcome shadow looming over them. A brutal assault, a mortal disease, a death, and a birth reshuffle this group of people again to form another version of the family.     Reproduction is a profoundly insightful exploration of the bizarre ways people become bonded that insists that family isn't a matter of blood.",
  "genres": [
    "Fiction",
    "Canada",
    "Book Club",
    "Contemporary",
    "Literary Fiction",
    "Humor",
    "Family"
  ],
  "author": "Ian    Williams",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/43714522-reproduction"
}