{
  "title": "Denisovan Origins: Hybrid Humans, Göbekli Tepe, and the Genesis of the Giants of Ancient America",
  "description": "Reveals the profound influence of the Denisovans and their hybrid descendants upon the flowering of human civilization around the world• Traces the migrations of the sophisticated Denisovans and their interbreeding with Neanderthals and early human populations more than 40,000 years ago• Shows how Denisovan hybrids became the elite of ancient societies, including the Adena mound-building culture• Explores the Denisovans’ extraordinary advances, including precision-machined stone tools and jewelry, tailored clothing, and celestially-aligned architectureIce-age cave artists, the builders at Göbekli Tepe, and the mound-builders of North America all share a common ancestry in the Solutreans, Neanderthal-human hybrids of immense sophistication, who dominated southwest Europe before reaching North America 20,000 years ago. Yet, even before the Solutreans, the American continent was home to a powerful population of enormous stature, giants remembered in Native American legend as the Thunder People. New research shows they were hybrid descendants of an extinct human group known as the Denisovans, whose existence has now been confirmed from fossil remains found in a cave in the Altai region of Siberia.Tracing the migrations of the Denisovans and their interbreeding with Neanderthals and early human populations in Asia, Europe, Australia, and the Americas, Andrew Collins and Greg Little explore how the new mental capabilities of the Denisovan-Neanderthal and Denisovan-human hybrids greatly accelerated the flowering of human civilization over 40,000 years ago. They show how the Denisovans displayed sophisticated advances, including precision-machined stone tools and jewelry, tailored clothing, celestially-aligned architecture, and horse domestication. Examining evidence from ancient America, the authors reveal how Denisovan hybrids became the elite of the Adena mound-building culture, explaining the giant skeletons found in Native American burial mounds. The authors also explore how the Denisovans’ descendants were the creators of a cosmological death journey and viewed the Milky Way as the Path of Souls.Revealing the impact of the Denisovans upon every part of the world, the authors show that, without early man’s hybridization with Denisovans, Neanderthals, and other yet-to-be-discovered hominid populations, the modern world as we know it would not exist.",
  "genres": [
    "Nonfiction",
    "History",
    "Audiobook",
    "Anthropology",
    "Evolution"
  ],
  "author": "Andrew Collins",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/43723480-denisovan-origins"
}