{
  "title": "Lessons Learned from The Path Less Traveled Volume 1: Get motivated & overcome obstacles with courage, confidence & self-discipline",
  "description": "\"NOT EVERYONE WILL UNDERSTAND YOUR JOURNEY. THAT'S FINE. IT'S NOT THEIR JOURNEY TO MAKE SENSE OF. IT'S YOURS.\" - Zero Dean*** THIS BOOK HAS NOT BEEN WATERED DOWN TO APPEAL TO THE MASSES *** It does not use gimmicks or profanity to sound edgy or as a manipulative tactic to get your attention. It does not exist to tell you things that you want to hear. This book does not involve magic or encourage wishful thinking. And it wasn't written for money or fame or to sell a million copies.This book was written to make a positive difference in people's lives. And like the lessons in this book, this book is the direct result of a journey along the path less traveled. This book isn't trying to copy other books' success by following in their footsteps or being just like them. And it is precisely because of all of these things that this book has the potential to help people in ways that other books have not.Lessons Learned from The Path Less Traveled Volume 1 represents nearly a decade of lessons that were all prompted by and learned from actual life experiences along the path less traveled. There is no filler here. From page 1 to page 350, everything in this book was written & included with the potential value it may add to reader's lives in mind. This book is packed with pages of encouragement, food for thought, reminders, and strategies to help readers cope with and overcome life's challenges.EXCERPTS & FOOD FOR THOUGHT:\"Anger and hate dig holes. Love and kindness move mountains. Choose your motivation wisely.\"\"Don't let your life goals fall victim to the allure of comfortable routines.\"\"Every time you change something unique about yourself in order to be just like someone else, a piece of the best part of you dies.\"\"You don't get over the fear of doing something by not doing it.\"\"If you want more kindness in the world, put some there.\"\"Healthy habits harbor happiness.\"LESSONS TO HELP YOU:+ Find motivation & take action.+ Overcome challenges & obstacles.+ Develop discipline.+ Boost your confidence.+ Immunize against criticism.+ Expand your awareness.+ Increase your resilience.+ Manage your time better.+ Deal with discomfort.+ Reduce stress.+ Ensure you are on the right path.+ Discover what makes you happy.+ Live a meaningful life.+ Protect against manipulation.+ Nurture your relationships.+ Face your fears.+ Save your life.WHO THIS BOOK IS FOR...While this book is packed full of potentially life-changing lessons for men & women of all ages, it's not for everyone. This book is for those who are willing to keep an open mind, as well as think critically, while they read. It's for those who believe they can change, are willing to change, and can commit to keep trying to change no matter how difficult the path may appear.Because this book is for those who recognize that anything worth having is worth working for. And it's for those who understand that long-lasting change takes effort and action, not wishful thinking.Ultimately, this book is for those who already know -- or those who are willing to learn -- that the only thing that truly stands between the person they are and the person they want to be is themselves.If this sounds like you -- or like someone you want to be -- then this book will likely be well worth your time and investment.NO FILLER. Find potential value on any page.READ IT YOUR WAY. Lessons can be read in any order from any page.READ A LITTLE OR A LOT. Lessons take anywhere from 5 seconds to 5 minutes to read. Read whenever you want & choose only what you have time for.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Medicine",
    "Productivity",
    "Psychology",
    "Personal Development"
  ],
  "author": "Zero Dean",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/43734911-lessons-learned-from-the-path-less-traveled-volume-1"
}