{
  "title": "Cut Reality",
  "description": "When death washes ashore on reality TV, who's to blame?\n\n\"When I heard the premise of Cut Reality, I almost died...and I wouldn't lie about that.\" - Jonny Fairplay, Survivor NSFWJoin Jason Debord as he seeks clarity following the death of a reality TV co-star and ends up uncovering criminal conspiracy.When Jason returned home from competing on Beached he'd lost weight, couldn't sleep, and felt more alone than ever. But, he expected those changes. Jason had no way to predict that one of his fellow competitors would fling himself from a cliff. Unless he didn't.Jason can't believe it, but the network broadcasts the alleged suicide to the world, so he pushes forward in his own amateur investigation. Met with resistance from the cast and crew, he persists only through the support of his developing romance with Blake, a psychologist who observes alarming similarities between her patient and her partner.Events in Cut Reality have a variety of interpretations. While under the watchful eye of the public, Jason has to is what he uncovers too coincidental to be true, or so hard to accept because it's his new reality.\nBuy Zack Hacker's anticipated debut novel to find out what Jason discovers...\n\n\n\n\n\n \nWhat critics are \n\"On the surface, Cut Reality is a murder mystery; but actually it is much more...Highly recommended for those who like their intrigue steeped in philosophical insights and dilemmas.\" - Midwest Book Review\"[Zack Hacker] makes poignant critiques though subtle plot developments, holding back from judging society at large, but willing to poke holes in some of our accepted values...From the first tension-filled scene...Cut Reality will keep readers guessing, but also leave them with plenty to think about.\" - SPR\"The perfect genre book at the perfect time.\" - San Francisco Book Review\"Cut Reality is the type of thoughtful, provocative work that you don't see much of in the reality TV fanbase anymore. I had a lot of fun reading it.\" - Mario Lanza, author of When It Was Worth Playing For, The Funny 115, and host of Survivor Historians\"★★★★★ I have always loved books that can surprise me - this book did that and more.\" - Readers' Favorite Reviews",
  "genres": [],
  "author": "Zack Hacker",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/43722415-cut-reality"
}