{
  "title": "The Poisoners",
  "description": "‘Miss Bowen’s work is of the exceptional class’ - The Scotsman Paris is gripped by a series of gruesome murders — young and fashionable ladies suddenly become rich, dry-eyed widows. Then a chance remark at a dinner party puts the police on the track of a strange and deadly poison. The trail leads to a ring of Satanists, many of them high-ranking members of the French aristocracy. Behind the brilliant façade of Louis XIV’s flamboyant court at Versailles, the poisoners perform their scandalous Black Masses in fetid cellars, macabre killings — even the sacrifice of new-born babies. The Sun King himself is in deadly danger, completely unaware that one of his mistresses may be furtively plotting his assassination… Praise for Marjorie Bowen ‘A book remarkable alike for its vividness and for its historical perspective’ - Daily Express ‘… one of the most novel features of Miss Bowen’s book is the care she takes to see the point of view of Mary’s lovers. She makes a plausible case for Bothwell and even joins the very select band of those who have something good to say for Darnley’ - Times Literary Supplement ‘Fresh, vivid, exciting and enthralling … This is a fine book’ - The Sphere ‘A book in every way worthwhile … as an individual contribution to the subject, Miss Bowen’s work is of the exceptional class’ - The Scotman Marjorie Bowen was born in 1885 and often wrote under the pseudonym Margaret Gabrielle Vere Campbell Long. She was one of Britain’s most prolific authors of the twentieth century. Writing was more than just a her works were the primary source of financial support for her family. Between 1906 and her death in 1952, Bowen wrote over 150 books, garnering much acclaim for her popular histories and historical and Gothic romances. Alongside masterful descriptions and concise, efficient prose, she deftly rendered larger-than-life subjects in the minds of her readers. To this day, aficionados of the genres covet Bowen’s work. Her other titles include The Sword Decided, Mary Queen of Scots, The Queen’s Caprice, The Governor of England, Mistress Nell Gwynn and Dickon. Endeavour Press is the UK's leading independent digital publisher. For more information on our titles please sign up to our newsletter at www.endeavourpress.com. Each week you will receive updates on free and discounted ebooks. Follow us on @EndeavourPress and on Facebook via We are always interested in hearing from our readers. Endeavour Press believes that the future is now.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "France",
    "Historical",
    "British Literature",
    "Horror"
  ],
  "author": "Marjorie Bowen",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/43723647-the-poisoners"
}