{
  "title": "Seventh Flag",
  "description": "The US and Europe have unraveled since World War II and radicalism has metastasized into every community, tearing away the decency, optimism, and security that shaped those robust democracies for more than eight decades. No place is immune, including the small West Texas town of Dell City, where four generations of an iconic American family and a Syrian Muslim family carve a farming empire out of the unforgiving high desert. These families' partnership is as unlikely as the idea of a United States, and their powerful friendship can be traced back to a bloody knife fight in a Juarez cantina just after World War II. The bond forged that night between Jack Laws, an Irish American who staked his claim in West Texas after the war, and Ali Zarkan, whose great-grandfather sailed from the Middle East to Texas in the mid-1800s as part of President Franklin Pierce's attempt to create the US Army Camel Corps, shapes each generation of the families as they come of age and adapt to shifting paradigms of gender, commerce, patriotism, loyalty, religion, and sexuality. From the beaches of the Western Pacific to the battlefields of the Middle East and from the lawless streets of Juarez to the darkest corners of the Internet, the two families fight real and perceived enemies--journeying, as they do, through the football fields of Texas and West Point, the hippie playgrounds of Asia, the music halls of Austin, the terrorist cells of Europe and the political backrooms where fortunes are gained or lost over the rights to Western water. Underlying their experiences is the basic question of what constitutes identity and citizenship in America, or in Texas, a land over which six flags have flown. The seventh flag, ultimately, is not one of a state or a nation, but of a mosaic of cultures, religions, and people from every corner of the world--all struggling to define what it means to be unified under an ambiguous banner.",
  "genres": [
    "Novels",
    "Fiction",
    "Historical"
  ],
  "author": "Sid Balman",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/43730984-seventh-flag"
}