{
  "title": "Ice",
  "description": "One year ago…Sunny Fairfax, daughter of a former Chicago mayor, had been tops in the marketing game. She’d taken a tiny tattoo parlor, Skull and Bones Ink, and turned it into the most famous studio in California. Then the owner and unrequited love of her life, Atticus “Ice” Eisen, fired her.One year ago…Everyone thought Ice had it all—a privileged Beverly Hills background, a hot ink-slinging studio and a kickass reality TV gig. The truth? He’d hated most of it, especially that frigging show. The only reason he’d stuck with it was because of Sunny. Then shadows from his past closed in, and he’d had a choice—let the one thing he actually gave a damn about get destroyed, or sacrifice everything.The way he saw it, the choice was easy.Now…Sunny’s stunned when Ice walks into her new life in Chicago. He’s the newest tattooist at House Of Payne, and no amount of dodging him works. Wherever she goes, he’s already there, ready to melt her panties with hot glances, hotter words and the hottest kisses she’s ever known. But none of it makes sense. Why had he fired her? And how can she trust him now?The shadows are back, but Ice is a different man now. He’ll protect Sunny from the darkness that’s been dogging his steps every day of his debauched and useless life, and this time he has to destroy it. He has to, because when it comes to convincing Sunny he’s a man she can believe in, he’s on very thin ice. 90,000 words***This standalone contemporary romance contains multiple sex scenes, bad cat puns, lame excuses from an Alpha male unused to making them, and a reverse-cowgirl in front of mirrors. No cheating, no love triangles, no cliffhangers. HEA guaranteed. Due to adult language and sexual content, this book is not intended for people under the age of eighteen***",
  "genres": [
    "Contemporary",
    "Romance",
    "Second Chance",
    "Erotic Romance"
  ],
  "author": "Stacy Gail",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/43783151-ice"
}