{
  "title": "Here We Are: American Dreams, American Nightmares",
  "description": "Comedic female rage meets father-daughter love story in this big-hearted migrant adventure set in Queens, New York. Teenage Aarti wants to go clubbing, hook up with boys and get into Harvard. Her dad – the dating and dancing police – is her archnemesis. When he gets arrested for selling calculators to a drug cartel, the two discover they’re more alike than they think. From NPR correspondent Aarti Shahani, Here We Are is a memoir at once thrilling and grounding, deeply tragic and bursting with hope.“riveting…a bruising critique of colonialism”—NPR (featured on Morning Edition)“heartfelt, galvanizing…a coming-of-age story of an ambitious, whip-smart daughter getting to know herself better as her Old World father comes into clearer view”—San Francisco Chronicle (cover story)\"among the finest memoirs written in recent decades—a heartbreaking, hilarious and tender love letter…a vivid, almost cinematic journey that is both beautiful and unforgettable\"—Guy Raz, co-creator of How I Built This, TED Radio Hour“You know the feeling you get when you read or watch a great story, and then afterwards, at random moments, you feel as if you’re still living in the story? That’s how I’ve felt, ever since reading [this memoir]…I highly recommend!”—Susan Cain, #1 NYT Bestselling Author“Incredible debut…It’s been a while since I’ve read a biography with such breadth, from the intensely personal to a most relevant and infuriating political survey. It’s a story about immigrant experience, being brown in New York City in the golden age of hip-hop, and the ‘multiethnic soul’ of Queens. Turn the page and you’re dropped into the drug war, soon shell shocked by a banality of cruelty and the generational terror of its machinery. Also, kidnapping. And most sincerely, family.”—Ricardo Cortes, Author & Illustrator, #1 Amazon Bestseller Go the F*ck to SleepOn the audiobook: “read exceptionally well by Shahani…including seamlessly shifting between English and the multiple languages her family speaks…gripping”—AudioFile Magazine",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Book Club",
    "India",
    "Biography",
    "Politics",
    "Biography Memoir"
  ],
  "author": "Aarti Namdev Shahani",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/43782398-here-we-are"
}