{
  "title": "On Nietzsche",
  "description": "Hailed by Martin Heidegger as \"one of France's best minds,\" Georges Bataille has become increasingly recognized and respected in the realm of academic and popular intellectual thought. Although Bataille died in 1962, interest in his life and writings have never been as strong as they are today--Barthes, Foucault, Derrida, and Kristeva have all acknowledged their debt to him.In his book, On Nietzsche , as translated by Bruce Boone, Bataille comes as close as he would ever come to formulating his own unique system of philosophy. One could say that reading Nietzsche was something of a revelation to Bataille, and profoundly affected his life. In 1915, in a crisis of guilt after leaving his blind father in the hands of the Germans, Bataille converted to Catholicism. It was Nietzsche's work that lead him to abandon traditional religion for an idiosyncratic form of godless mysticism.In this volume, Bataille becomes, and goes beyond, Nietzsche, assuming Nietzsche's thought where he left off--with God's death. At the heart of this work is Bataille's exploration of how one can have a spiritual life outside religion. On Nietzsche is essentially a journal that brilliantly mixes observations with ruminations in fragments, aphorisms, poems, myths, quotations, and images against the background of World War II and the German occupation. Bataille has a unique way of moving breezily from abstraction to confession, and from theology to eroticism. He skillfully weaves together his own internal experience of anguish with the war and destruction raging outside with arguments against fascist interpretations of Nietzsche and praise for the philosopher as a prophet foretelling \"the crude German fate.\"With an introduction, \"Furiously Nietzschean,\" by Sylvere Lotringer, an Appendix in which Bataille defends himself against Sartre, and an Index, this volume reconfirms Michel Foucault's assertion that Bataille, \"broke with traditional narrative to tell us what has never been told before.\"",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "French Literature",
    "France",
    "Religion",
    "Metaphysics"
  ],
  "author": "Georges Bataille",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/437780.On_Nietzsche"
}