{
  "title": "Spirit Hacking: Shamanic Keys to Reclaim Your Personal Power, Transform Yourself, and Light Up the World",
  "description": "\"This guy does next level stuff. I have worked with him and I have no idea how or why he is able to do some of the things I have witnessed. Science is just catching up with biohacking. It's time to start studying spirit hacking and how Shaman Durek can achieve the tangible results he achieves.\"--Dave Asprey, author of the New York Times bestseller, The Bulletproof Diet, Silicon Valley investor and technology entrepreneur In Spirit Hacking:  Shamanic Keys to Reclaim Your Personal Power, Transform Yourself, and Light Up the World, Shaman Durek, a sixth-generation shaman, shares life altering shamanic keys allowing you to tap into your personal power. Through new information you will banish fear and darkness from your life in favor of light, positivity, and strength.Shaman Durek's bold and sometimes controversial wisdom shakes loose our assumptions about ourselves and the very world around us. He ultimately teaches us how to step fearlessly out of this Blackout (the age of darkness we are currently experiencing) and access a place of fierce empowerment by use of tools and techniques of timeless Shamanic tradition. This transformation is both personal and collective; as individuals step out of darkness and begin to experience the light, we bring our loved ones and communities out of the shadows as well.Shaman Durek inherited a rich legacy of ancient wisdom and now shares this knowledge for a modern context. He advises everyone from celebrities like Gwyneth Paltrow and Nina Dobrev to innovative executives such as Bullet-Proof Coffee founder Dave Asprey.Spirit Hacking shatters readers' complacency, giving them tools to navigate the tumultuous times in which we find ourselves. We will emerge from this period happier, lighter, and more vibrant than ever before.",
  "genres": [
    "Spirituality",
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Philosophy",
    "Audiobook",
    "Psychology"
  ],
  "author": "Shaman Durek",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/43782392-spirit-hacking"
}