{
  "title": "The Incredible Hulk: Stalker from the Stars",
  "description": "\"FAR OUT! Who's this creature Sh'mballah who controls the minds and lives of the people in Crater Falls, North Dakota?SHOCKING! He's not a who--he's a what. He's a tentacle-waving, electrified weirdo exiled from his own planet.BRUTAL! The Hulk thinks Sh'mballah is cruising for a bruising. But can the green goliath marvelman beat the interplanetary baddie?COLOSSAL! General Ross of the Army is doubtful. The Hulk's faithful sidekick is doubtful. But the Incredible Hulk is sure--he won't let Sh'mballah control him. No matter what ol' fettucine-feelers thinks!\"The origin of how Bruce Banner became the Hulk is given its own chapter early in the novel. Rick Jones wanders into the town of Crater Falls looking for Dr. Rudolph Stein, a contemporary of Bruce Banner who is also known for his research into gamma radiation. Rick learns Dr. Stein is missing – he wanders the woods and finds the crater from which the town founded its name.While searching the woods Rick finds a murder victim bathed in green gamma radiation (the identity of the body is a SPOILER and won’t be revealed here). He calls the local sheriff but the body disappears before anyone else can see it.Also, at night the entire citizenship of Crater Falls walk zombie-like from the town into the woods. Rick’s attempts to find out what is going on is rewarded with a thump on the head (at first) and then by his disappearing – just like Dr. Stein!Meanwhile, Bruce Banner is hunted by General Thunderbolt Ross – who finally manages to capture the Hulk! Banner escapes Gamma Base when he hears of Rick’s troubles. Rick’s phone went dead during a conversation with Ross and Rick has not been seen nor heard since. Banner goes to Crater Falls, meets the same citizens Rick did, learns of Stein’s disappearance and investigates.As the title suggests, our green goliath comes in contact with an alien menace that can control the minds of puny humans. The Hulk and his friends must find a way to stop the evil alien Sh-mballah while also fighting off the hypnotized citizens of Crater Falls!This is the second book in the Pocket Marvel series, and is the first Hulk novel ever to appear. It is credited to Len Wein, Marv Wolfman, and Joseph Silva.",
  "genres": [
    "Marvel",
    "Science Fiction",
    "Comics",
    "Fantasy",
    "Novels"
  ],
  "author": "Len Wein",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/4379564-the-incredible-hulk"
}