{
  "title": "Seven Sins",
  "description": "This is the complete trilogy \"Seven Sins\" ready to be devoured  Book 1: Succubus Sins I'm about to make the seven deadly sins my bitch See this tattoo across my stomach? Yeah, the one with seven crazy runes. Ignore the pink one on the far right, that's Sarah. I love her, but she's not one of my four. That was a hard lesson to learn. I tried being loyal to her. Even went to a stinky Succubi Den to get a snack or two just to stay alive. Well, that didn't work out, and now I'm stuck trying to charge some dusty old relic my mother left behind. Turns out there's some crazy destiny tied to my tattoo, which is actually a birthmark and all about the end of the world. Sounds fun, sort of, not really. I've met rune #1, and he wasn't at all what I'd expected. It wasn't love at first sight. Maybe hate at first sight. Pretty sure he hates my guts. But that's okay, maybe rune #2 will bring him around. This end of the world stuff is just getting started, and I have a feeling one of my very own sins is the one stirring the pot. The Incubus King, what sin might he be? Lust... my favorite one. Bring it on. Book 2: Siren Sins Sirens... They Make Sin Look Good I've found my third, and he's definitely the sin of anger. Jet has some damn rage problems, but I guess that's to be expected from a dragon shifter. Am I ready to play with fire? You bet your ass I am. Derek, one of my sins, is making good work on stirring the pot. He's trying to rip open a hole to hell and he's gotten Luke on a leash to do just that. Don't worry, I have a plan. I just hope it doesn't get everybody killed. Meanwhile I hear Sarah's gotten herself into some shit. By the time I get to her (gotta keep those sins in line) I find out that she has a new girlfriend. A muse and a siren sound like trouble to me, and I decide I don't like this Vikki character, even if there's something about her that makes one of my runes itch... Author's Note: This is a fast-burn reverse harem story. It includes explicit language and sexual situations. Intended for audiences 18 years and older. As this is a series, there will be a cliffhanger. Book 3: Vampire Sins My fourth is a freaking vampire?  Xavier is cocky, overzealous, and way too hot for his own good. He’s just what I need to stop my nightmares from coming to fruition, except he's telling me that I'm not supposed to stop the future from happening. I'm supposed to fulfill a dark prophecy. One where I'm the Queen of Hell, turned into a vampire, and I save hell itself from being destroyed.  Hell getting destroyed sounds like a good idea to me, so I'll have to talk some sense into Xavier, but first I need to get my men all in one place. They're stuck all over the world and, well, let's face it, the world's most certainly gone to shit.  Jet, my dragon shifter, has survived the last loyalists to his brother, but they won't accept his rule unless he obtains the Dragon’s Eye. He better not die trying to retrieve it... or trying to get back to me.  Nate, my beloved human, is trapped Hell knows where and with my grandmother of all people. He’s full of surprises though, and he might just be the weakest link in my bond that’ll save the day.  When all seven sins reunite, I'll have power over hell itself. It's up to me what happens next. Author's Note: This is a fast-burn reverse harem story. It includes explicit language and sexual situations.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Demons",
    "Paranormal Romance",
    "Vampires"
  ],
  "author": "J.R. Thorn",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/43786014-seven-sins"
}