{
  "title": "Thirst: 2600 Miles to Home",
  "description": "By age 25, Heather Anderson had hiked what is known as the \"Triple Crown\" of the Appalachian Trail (AT), Pacific Crest Trail (PCT), and Continental Divide Trail (CDT)—a combined distance of 7,900 miles with a vertical gain of more than one million feet. A few years later, she left her job, her marriage, and a dissatisfied life and walked back into those mountains.In her new memoir, 2600 Miles to Home, Heather, whose trail name is \"Anish,\" conveys not only her athleticism and wilderness adventures, but also shares her distinct message of courage--her willingness to turn away from the predictability of a more traditional life in an effort to seek out what most fulfills her. Amid the rigors of the trail--pain, fear, loneliness, and dangers--she discovers the greater rewards of community and of self, conquering her doubts and building confidence. Ultimately, she realizes that records are merely a catalyst, giving her purpose, focus, and a goal to strive toward.Heather is the second woman to complete the “Double Triple Crown of Backpacking,” completing the Appalachian, Pacific Crest, and Continental Divide National Scenic Trails twice each. She holds overall self-supported Fastest Known Times (FKTs) on the Pacific Crest Trail (2013)—hiking it in 60 days, 17 hours, 12 minutes, breaking the previous men’s record by four days and becoming the first women to hold the overall record—and the Arizona Trail (2016), which she completed in 19 days, 17 hours, 9 minutes. She also holds the women’s self-supported FKT on the Appalachian Trail (2015) with a time of 54 days, 7 hours, 48 minutes. Heather has hiked more than twenty thousand miles since 2003, including ten thru-hikes. An ultramarathon runner, she has completed six 100-mile races since August 2011 as well as dozens of 50 km and 50-mile events. She has attempted the infamous Barkley Marathons four times, starting a third loop once. Heather is also an avid mountaineer working on several ascent lists in the US and abroad.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Adventure",
    "Travel",
    "Outdoors",
    "Nature",
    "Audiobook"
  ],
  "author": "Heather Anish Anderson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/43794654-thirst"
}