{
  "title": "Dark Obscurity",
  "description": "“Oh, Allison when would you learn your lesson?” It may be Christmas break, but Allison can the feel the heat. Instead of studying for her finals, she was caught up having sex with her no-good ex-boyfriend, Mark. He is selfish and a non-apologetic serial cheater. The sex was good, but it leaves her hollow afterward when reality has kicked in at the time she’s lost. Allison has a supportive family, and she is looking forward to taking a break away from the University of Columbia and spending the holidays with them. A meek voice catches her attention before she leaves her class, turning to a hot guy – she dubbed as Mr. Tardy – as he either never turns up for class, or if he does it is always very late. He sheepishly introduces himself as Jack Corrode, and ask if she would like to go for a coffee. Over a caramel macchiato, they make small talk, laughing about his ‘chronic tardiness’ – until he gets a phone call that makes him edgy. “I’m not going anywhere.”When Jack ends the call; his demeanor has changed. The easy-going smile is cranked a little tight around his mouth, and there is an edge in his eyes. Allison is disappointed when he mentions that he needs to go – but quickly amends when he asks for her company back to his place. “I sort of have a business that I run, and it pays pretty.”When they head to his super expensive car, Allison’s jaw drops. Something in the back of her head tries to figure out how he could afford such a high-class vehicle when he is only a college student. She can’t help but draw Jack up against Mark – and feels safe enough to slip into the car. “I’m sort of a delivery boy. I pick expensive things up and deliver them.”They pull into an insanely luxurious mansion, stunning Allison once more. No one is around – so there’s plenty of time for some hot and heavy petting. They’ve only known each other for one afternoon, but Jack (literally) rocks her world. It is a thrill she doesn’t want to come down from. Not long after – the phone rings and Jack runs off downstairs and promising to bring back tea with Round Two. Stretching her muscles, Allison spreads back onto the bedsheets and awakes sometime later after falling to a light doze. The place is in darkness – no one is around. Not even Jack. “I am going to tell you this once; you should stay away from Jack Corrode. The only thing he attracts is trouble.”An ominous man startles her with this warning – but Allison is not just a pretty face. She is stubborn to boot, and she isn’t the type of girl that stands and takes orders. Or threats. Jack hasn’t just vanished into thin air; he’s been taken somewhere. Allison does whatever it takes, even going undercover to get answers. It leads her down the seedy road of a Mexican drug cartel, where violence, blood, and money go hand in hand – or hand around the throat. Suddenly, there is a lot to break open about Jack behind the handsome face and good lay. Rotating these circles is a new challenge for Allison, but it soon releases a side of her that craves the danger – and the rewards a good job harbors. When you join a cartel – the only way out of it is through a wooden box. If you’re so lucky. Jack’s end is signed, sealed, and will be delivered if he does not co-operate.Leading to her Dark Obscurity.",
  "genres": [],
  "author": "Bradley Cornish",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/43793279-dark-obscurity"
}