{
  "title": "Nelly's Mail Order Husband",
  "description": "Valentine Silverton has enjoyed comfort and luxury his entire life. Then, all at once, the family fortune vanishes, and he’s a pauper. The only recourse he has is to find a wealthy heiress. But he doesn’t want to just find just any wealthy heiress. He wants to find one he can fall in love with. Since there are no suitable prospects in his area, he takes his friend’s advice and becomes a mail-order husband.Nelly Larson grew up on a farm, and she loves everything about it. She loves the life so much, in fact, that she got her own homestead. The last thing she wants is to be strapped to one of the men in town who think her place is in the kitchen. She’s going to keep her independence, and keeping her independence will require her to avoid marriage at all costs.Nelly’s sisters, however, can’t believe Nelly will truly be happy if she doesn’t get married. Romance, after all, is one of life’s most wonderful experiences. When they come upon Valentine’s ad, they know he’ll be perfect for her. So they take matters into their own hands and answer his ad on Nelly’s behalf.Valentine thinks Nelly is the one answering his ad, and at once, he’s intrigued by her. He has no idea what a homestead is, but he assumes that a young woman who owns land and runs her own business must have lots of money. Excited, he runs off to Omaha to marry her.The day comes when the two meet, and it’s at that time they realize they’ve been set up. Since Valentine has no money, he can’t leave Omaha. He has to marry Nelly. Even if she doesn’t have much, she has a place to live and food to eat. In exchange for marriage, he promises Nelly he won’t hinder her independence. Thankfully, she agrees to marry him.But Valentine kind of likes Nelly, and he’s determined to show her that some things are worth giving up total independence for…and love just happens to be one of them.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Westerns",
    "Marriage"
  ],
  "author": "Ruth Ann Nordin",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/43806499-nelly-s-mail-order-husband"
}