{
  "title": "Einstein Lived Here",
  "description": "Abraham Pais's 'Subtle is the Lord...' is the definitive biography of Albert Einstein. Timothy Ferris, in The New York Times Book Review , called it \"the biography of Einstein he himself would have liked best,\" adding that \"it is a work against which future scientific biographies will bemeasured.\" As a respected physicist himself, Pais was the first biographer to give Einstein's thinking its full due, and as a close friend and associate of Einstein, he could provide an intimate, first-hand account of the life of this great scientist. The result was a national bestseller. Indeed, itwas one of The New York Times 's Best Books of the Year, and the winner of the 1983 American Book Award for Science.Now, Pais turns his attention to the great physicist's life outside of science, with an informal, almost kalaidoscopic portrait of Einstein--his personal life and his public persona (\"my mythical namesake who has made my life so burdensome\"), his scientific contributions, and his thoughts onreligion, philosophy, and politics, on Israel and Zionism, on the rise of Nazism and McCarthyism, and on much more. Pais offers a candid look at Einstein's troubled personal life--his two failed marriages, his first child Lieserl, who was born out of wedlock (and of whom all trace has vanished), hisestranged son Hans Albert, also a scientist, who felt his father had abandoned the family, and his son Eduard, who gradually descended into madness. Of course, any book on Einstein must touch upon science, and Pais includes several illuminating chapters, one of which offers general readers anaccessible explanation of relativity, and another traces the long road to Einstein's Nobel Prize (after being nominated almost every year from 1909 to 1920, he finally won in 1921--not for relativity, but for his work on the photoelectric effect). On the lighter side, Pais includes samples fromEinstein's \"curiosity file,\" in which he kept crank letters, marriage proposals, hate mail (one began \"You are the prince of idiocy, the count of imbecility, the duke of cretinism, the baron of morons\"), and the like. But the heart of the book is the final section, where Pais traces Einstein's lifeas seen through the media. Here we not only meet Einstein the living legend--receiving the keys to New York City from flamboyant Mayor Jimmy Walker, attending the Hollywood premier of City Lights with Charlie Chaplin--but also witness his extensive involvement in the issues of his day. Much of hiscommentary is amazingly prescient. In 1933, he said of \"I cannot understand the passive response of the whole civilized world to this modern barbarism. Does the world not see that Hitler is aiming for war?\"\"I can still see Einstein's smile before me,\" the great physicist Niels Bohr said several years after Einstein's death, \"a very special smile...knowing, humane, and friendly.\" In Einstein Lived Here , this more than anything else is the Einstein we see--knowing, humane, friendly--a world figure ona par with the greats of his age who could still ask \"Why is it that nobody understands me and everybody likes me.\"",
  "genres": [
    "Biography",
    "Physics",
    "Nonfiction",
    "Science",
    "History Of Science"
  ],
  "author": "Abraham Pais",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/1239122.Einstein_Lived_Here"
}