{
  "title": "The Plague Of Liberalism",
  "description": "Liberal, top musician eventually discovers that liberalism is harmful … and changes his views! The Plague Of Liberalism spells out the history and reasons for the moral, ethics and mental health decline in the U.S. in the last 40 years. Statistics are used to confirm this decline. This book also gives solutions to how it can be reversed - both on a societal and a personal level. It shows how liberalism is out of harmony with, and actually harmful to, nature and compassion - both of which it ironically claims to champion. And it shows how its propaganda is not based on truth, and (based on the author’s expertise in addiction) how its most vocal proponents suffer from a psychological disease, which the author calls “freedom addiction”. He says this disease has reached plague proportions.The author is an ex liberal, having been a hippie in San Francisco during the ‘60s and '70s and a member of some very famous music groups – Sly & The Family Stone, The Tokens (famous for The Lion Sleeps Tonight), and The Elvin Bishop Group. He now says, “The responsible and loving thing for the ‘me generation’ to do for the next generations is to reverse the damage they’ve done to the world they’re handing over to them.” But this book isn’t about judging people. Its focus is beauty, harmony and love - showing that the world would be a better place if God and His ways were honored and followed. Whereas statistics and history show that liberalism has been causing a lot of pain for a lot of people.Contained in this • How “global warming” is science fiction and a liberal smoke screen• How liberals have hurt the black communities and life for women• How the APA (American Psychiatric Association) was intimidated in 1972 to change its long standing position that homosexuality is a mental disorder.• Scientific proof that God exists• How evolution is science fiction and how science instead backs creationism• How societies have restored good social statistics and emotional health• Proof that Biblical values are far more effective than liberalism in solving problems• Why drug use has increased under “political correctness”• Why San Francisco became the mecca for liberalism• Why some leading black leaders are against “affirmative action”• How atheism is logically impossible• Why this country isn’t solving its increasing drug problem … and how it can• Proof that Jesus’ resurrection happened - which gives credibility to the Bible• How Secular Humanism IS the “Established” Monopolistic Religion of the Current State (and therefore is in violation of the First Amendment)• How to turn the discussion around when a liberal gets defensive• The specifics of a liberal’s love/hate relationship with nature• How liberalism has led to many tragedies due to its stands on sex• Why marriages fail, and how they can be saved• How the liberal culture is making parenting very difficult• How the ozone layer is closing up and might soon be closed for good• A plan to restore Biblical values in the United States• How to resolve the “separation of church and state” issue• Setting the record straight regarding U.S. history and religion• The 50 state preambles that all honor God• How the holidays (holy-days) were stolen• The 20 approaches to lifestyle and truth that the author went through before becoming a Christian• The cure for depression",
  "genres": [],
  "author": "Dennis J. Marcellino",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/4380867-the-plague-of-liberalism"
}