{
  "title": "Seduction: A History From the Enlightenment to the Present",
  "description": "A brilliantly original history that explores the shifting cultural mores of courtship, told through the lives of remarkable women and men throughout history.If sex has generally been a private matter, seduction has always been of intense public interest. Whether the stuff of front-page tabloid news, the scandal of nineteenth-century American courts, or the stuff of literature across the eras, we are fascinated by stories of seduction and sex. In the first history of its kind, Clement Knox explores seduction in all its historical and cultural incarnations.Moving from the Garden of Eden to the carnivals of eighteenth-century Venice, and from the bawdy world of Georgian London to the saloons and speakeasies of the Jazz Age, this is an exploration of timeless themes of power, desire, and free will. Along the way we meet Mary Wollstonecraft, her daughter Mary Shelley, and her friend Caroline Norton, and reckon with their fight for women’s rights and freedoms. We encounter Jack Johnson, the first black heavyweight champion of the world, who became entangled in America's labyrinthine and racialized seduction laws. We discover how tall tales of predatory vampires, hypnotists, and immigrants were mobilized by Nazis and nativists to help propel them to power. We consider how after seduction seemingly vanished from view during the Sexual Revolution, it exploded back into our lives as The Game became a multi-million bestseller, online dating swept the world, and the ongoing male fascinating with manipulating women was exposed.In a big-thinking cultural history told through an extraordinary range of stories and sources, Knox explores how our ideas about desire and pursuit have developed in step with the modern world. This is a bold, modern charter of seduction, from the birth of the Enlightenment to the explosion of romantic literature and right up to our contemporary moments of reckoning around “incel” culture and #MeToo.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Sexuality",
    "Historical",
    "Audiobook",
    "Science"
  ],
  "author": "Clement Knox",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/43811250-seduction"
}