{
  "title": "Temptation And Seduction",
  "description": "Temptation and SeductionFive tales of Lust, desire TemptationL.M. Mountford, The Lord of Lust, brings you a collection of some of his hottest works. 5 of the sexiest stories ever released on Kindle Ereader...Plus, for the first time ever, read an extract from the long-awaited sequel to his debut - Sweet Temptation: The Boss's DaughterJust Once: A friends to lovers Romance (Just Friends Book 1)They were the very poster children for the boy and girl next door, if a couple of streets apart.Friends for longer than forever. They’d walked to school together. He’d protected her from the bullies when they teased her about her glasses. She’d tended to his cuts and bruises when he fell. He pushed her to try new things. She snuck looks at him when he wasn’t looking.All her life, Faye had loved Terry, but he was oblivious. He's her best friend, her closest friend, but he's oblivious and now he has a Girlfriend. All day long, she has to watch them together and it's killing her. She wants him, all of him, but he's taken. So, instead, she wants one night. Just once, one night, between friends.One night, just once...Valentine MisadventuresThere is one name that can inspire fear all along the East Coast.A lord of the Underworld. A Napoleon of crime.Mr Larry, and his daughter is on the run from him.Sophie has lived all her life in her father's shadow. She's an underworld princess. Her future has already been set up and laid before her and she knows there can be no escape.Then she met Luke.He's everything she ever wanted in a man. Tough, strong, and absolutely devoted to her. There's just one problem. He's her bodyguard, and there's no place for an affair with a scrapper from the hard streets in her future.So when they're caught, they have no choice but to flee.Now they're on the run, hunted by all sides. Can their love survive? Can they survive?Play Time: Extra CreditJames had thought his ordeal was over, but in his school, nothing is ever quite as it seems. Now there is a new succubus on the hunt for young meat, with a thirst for vengeance and her sights set firmly on him...Play Time: Extra Credit is the sequel to Dark Inferno's hit Paranormal Erotica Play Time and is too hot for the weak hearted, but can be read as a one shot.Stepdaddy's Bad GirlEric has a problem. A rebellious stepdaughter whose mother is gone, leaving him her sole legal guardian until she turns 21 next year. And she knows just how to push his buttons.Fortunately, he's got a plan to show her who's in charge...Sweet Temptations: The BabysitterMeet Richard Martin. Tall, dark and handsome; he's well mannered, married to his beautiful university sweetheart, works in a job he can't stand with people who infuriate him, and so sexually frustrated he's about ready to blow like Mount Vesuvius...Enter Rebecca, Scarlet and Samantha, three sirens sent by God to plague and tempt him. Will he be able to do what's right and resist their advances, or will these temptresses lure him to the rocks?In this first volume in Dark Inferno's sizzling new series: Sweet Temptations, A naughty babysitter sets out to seduce her man. No matter what his wife might think, sweet and innocent, but also seductive and sexy, this tempting siren will rock your world while babysitting your kids and she is determined to lure her man into her bed...Included in this collection is an extract from Sweet Temptations: The Babysitter's long-awaited sequel - The Boss's Daughter, expected to be released later this year. Be the first to read this exclusive sneak peak today!*** These stories contain descriptions of sexual content, Violence, BDSM, Paranormal, S Dubious Consent for 18+ Adults only***",
  "genres": [],
  "author": "L.M. Mountford",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/43806620-temptation-and-seduction"
}