{
  "title": "The Emperor of Ice Cream",
  "description": "Growing up on a small dairy farm in upstate New York, Gary lived a few hundred steps from his paternal grandparents. His grandfather (hereafter “Grandpa”) was a perpetually happy man and Gary wondered, in light of the nature of farm work, in light of some of the hardships Grandpa endured, in light of the pace of the town, in light of the way he was chronically frugal, how this could be so. After college, Gary moved to the city and reveled in the cadence and sophistication of the city. And began to see how places came to shape the people who lived in those places. How the way we defy and indulge in a place; how the way we yearn for the notion of somewhere else; how the cadence and influence of a place affects a person. In The Emperor of Ice-Cream, Gary recounts all the little moments - moments he never thought could or would be important - he had with Grandpa to try to understand who Grandpa was. He - with an astonishing blend of his signature humor and a reverence that only comes from a boy who loves his grandfather - then examines how his understanding of those moments has evolved after moving to the big cities for which he had always yearned. Does changing from denim overalls to a Brooks Brothers suit change a person? Should it? Is cow piss really that different from the piss with which the sidewalks of New York City are often soaked?Not surprisingly, Gary discovers that where we are and where we are from has a big effect on who we are. But often not for the reasons we expect. The Emperor of Ice-Cream is an incredible and artfully told story of what we do to find happiness, what memorial means, what it means to be family, and what we do to be authentic in places where authenticity can be a challenge. It’s about the complexities of triumphantly leaving home and then spending decades befuddled by a perpetual and indomitable force luring you back. There is a sad irony about grandparents. When you get to be at the age you want to know about the real people they were, you’re also likely near the age when your grandparents are no longer there. And you are also at the age when you are wondering who you are too. It takes a while – a couple decades really - to realize that your grandparents are people too. When you take your thumbnail, and scratch a little beneath the surface – beneath the myth that surrounds a child’s understanding of his or her grandparents and takes hold of a family – you see that grandparents are people: complex, mercurial, whimsical, authentic people. And that you likely have some of that whimsy and complexity in you.",
  "genres": [],
  "author": "Gary M. Almeter",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/43800465-the-emperor-of-ice-cream"
}