{
  "title": "Typhoon",
  "description": "In this white-knuckled and high-stakes thriller, set in the expansive world of Robert Kirkman’s The Walking Dead series, three different people in China—a rural farmer, an urban military veteran, and an American student—are caught in the typhoon of undead as chaos sweeps over the most populous country in Asia.In the aftermath of a horrifying outbreak, the last remnants of the Chinese government have estimated that one billion walkers (called jiangshi ) are currently roaming the country. Across this desolate landscape, large groups of survivors have clustered together for safety in settlements that have been built to protect against the unceasing wave of jiangshi .In one of these settlements, Beacon of Light, scavengers of vastly different backgrounds struggle to provide supplies for the survival of thousands. Before this devastation, Zhu was one of the millions of poor farmers who left their rural roots for the promise of consistent employment in one of China’s booming factory towns. Elena was an American teaching English in China while on a gap year before beginning law school. Hengyen was a grizzled military officer of some renown, and a passionate believer in his nation’s ability to surmount any obstacle.But with the settlement’s 3,000 mouths to feed and the scavengers having to travel further and further in search of food, Zhu ends up at his home village, where he is shocked to find survivors. Does he force them to join the settlement or keep their existence a secret?Meanwhile, a veritable typhoon of walkers is headed towards the Beacon of Light. When the conniving leader of the Beacon, Secretary Guo, tasks Hengyen with rounding up all survivors in the area for a desperate last stand, the military man sees it for the foolish, futile directive that it is. Ever the patriot, though, he will stand with his compatriots to the very last. But Zhu finds himself caught between his love for Elena, his duty to the Beacon, and his desire to flee with the villagers. With time running out and the stakes higher than ever, these three survivors must figure out how to live with the overwhelming odds against them.",
  "genres": [
    "Horror",
    "Zombies",
    "Fiction",
    "Audiobook",
    "Science Fiction",
    "Fantasy",
    "Post Apocalyptic"
  ],
  "author": "Wesley Chu",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/43822557-typhoon"
}