{
  "title": "Hymns of the Republic: The Story of the Final Year of the American Civil War",
  "description": "From the New York Times bestselling and award-winning author of Empire of the Summer Moon and Rebel Yell comes “a masterwork of history” (Lawrence Wright, author of God Save Texas ), the spellbinding, epic account of the last year of the Civil War.The fourth and final year of the Civil War offers one of the most compelling narratives and one of history’s great turning points. Now, Pulitzer Prize finalist S.C. Gwynne breathes new life into the epic battle between Robert E. Lee and Ulysses S. Grant; the advent of 180,000 black soldiers in the Union army; William Tecumseh Sherman’s March to the Sea; the rise of Clara Barton; the election of 1864 (which Lincoln nearly lost); the wild and violent guerrilla war in Missouri; and the dramatic final events of the war, including Lee’s surrender at Appomattox and the murder of Abraham Lincoln.“A must-read for Civil War enthusiasts” ( Publishers Weekly ), Hymns of the Republic offers many surprising angles and insights. Robert E. Lee, known as a great general and Southern hero, is presented here as a man dealing with frustration, failure, and loss. Ulysses S. Grant is known for his prowess as a field commander, but in the final year of the war he largely fails at that. His most amazing accomplishments actually began the moment he stopped fighting. William Tecumseh Sherman, Gwynne argues, was a lousy general, but probably the single most brilliant man in the war. We also meet a different Clara Barton, one of the greatest and most compelling characters, who redefined the idea of medical care in wartime. And proper attention is paid to the role played by large numbers of black union soldiers—most of them former slaves.Popular history at its best, Hymns of the Republic reveals the creation that arose from destruction in this “engrossing…riveting” ( Kirkus Reviews , starred review) read.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "War",
    "American Civil War",
    "Military History"
  ],
  "author": "S.C. Gwynne",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/43822074-hymns-of-the-republic"
}