{
  "title": "Joy of Cooking",
  "description": "In the nearly ninety years since Irma S. Rombauer self-published the first three thousand copies of Joy of Cooking in 1931, it has become the kitchen bible, with more than 20 million copies in print. This new edition of Joy has been thoroughly revised and expanded by Irma’s great-grandson John Becker and his wife, Megan Scott.John and Megan developed more than six hundred new recipes for this edition, tested and tweaked thousands of classic recipes, and updated every section of every chapter to reflect the latest ingredients and techniques available to today’s home cooks. Their strategy for revising this edition was the same one Irma and Marion employed: Vet, research, and improve Joy’s coverage of legacy recipes while introducing new dishes, modern cooking techniques, and comprehensive information on ingredients now available at farmers’ markets and grocery stores. You will find tried-and-true favorites like Banana Bread Cockaigne, Chocolate Chip Cookies, and Southern Corn Bread—all retested and faithfully improved—as well as new favorites like Chana Masala, Beef Rendang, Megan’s Seeded Olive Oil Granola, and Smoked Pork Shoulder. In addition to a thoroughly modernized vegetable chapter, there are many more vegan and vegetarian recipes, including Caramelized Tamarind Tempeh, Crispy Pan-Fried Tofu, Spicy Chickpea Soup, and Roasted Mushroom Burgers. Joy’s baking chapters now include gram weights for accuracy, along with a refreshed lineup of baked goods like Cannelés de Bordeaux, Rustic No-Knead Sourdough, Ciabatta, Chocolate-Walnut Babka, and Chicago-Style Deep-Dish Pizza, as well as gluten-free recipes for pizza dough and yeast breads. A new chapter on streamlined cooking explains how to economize time, money, and ingredients and avoid waste. You will learn how to use a diverse array of ingredients, from amaranth to za’atar. New techniques include low-temperature and sous vide cooking, fermentation, and cooking with both traditional and electric pressure cookers. Barbecuing, smoking, and other outdoor cooking methods are covered in even greater detail. This new edition of Joy is the perfect combination of classic recipes, new dishes, and indispensable reference information for today’s home cooks. Whether it is the only cookbook on your shelf or one of many, Joy is and has been the essential and trusted guide for home cooks for almost a century. This new edition continues that legacy.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Culinary",
    "Classics"
  ],
  "author": "Irma S. Rombauer",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/43822015-joy-of-cooking"
}