{
  "title": "Life Is Magic: My Inspiring Journey from Tragedy to Self-Discovery",
  "description": "“Jon Dorenbos is a magical person. Life Is Magic shows how we can all choose happiness in the face of overwhelming odds.” —Ellen DeGeneresAn extraordinary and empowering story of resilience, forgiveness, and living a life of purpose in the face of unfathomable obstacles.You might recognize him as an NFL All-Pro or as an elite magician who made the finals of Amer­ica’s Got Talent and regularly appears on The Ellen DeGeneres Show . But Jon Dorenbos says that what he does is not who he is. Who he is is someone forced, at the most tender of ages, to coach himself into turning tragedy to triumph.One morning in August 1992, when Jon was twelve years old and living a seemingly idyllic childhood in suburban Seattle, he woke up for baseball camp. His dad waved good-bye. Later that day, Jon heard the news: his father had murdered his mother in the family’s three-car garage. In an instant, his life had shattered. He’d been essentially orphaned.Thrust into foster care while his father stood trial for murder, Jon struggled. Left to himself, he discovered an unlikely escape performing magic tricks. If you found a way to alter your reality after your dad—your hero—killed your mom, wouldn’t you cling to it too? Then came football, which provided a release for all of Jon’s pent-up anger. Together, magic and football saved him, leading to fourteen NFL seasons on the gridiron and raucous sleight-of-hand perfor­mances to packed houses across the globe.In 2017, after being traded to the New Orleans Saints, Jon was diagnosed with a life-threatening heart condition. He had a choice: break down, or—as he’d long by now taught himself—bounce back. “ Talk to yourself, don’t listen to yourself,” Dorenbos advises for those moments when the inner voice of self-doubt screams.In Life Is Magic , Dorenbos draws a road map for how to shut that voice up by choosing happi­ness. At his darkest times, he writes, he’s learned lessons of love, forgiveness, and perseverance. His story is poignant and powerful, told by a char­ismatic and optimistic man who has overcome life-or-death challenges with grace, persistence, a childlike sense of wonder...and jaw-dropping card tricks.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Inspirational",
    "Sports",
    "Self Help"
  ],
  "author": "Jon Dorenbos",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/43822760-life-is-magic"
}