{
  "title": "Black Indian: A Memoir",
  "description": "Black Indian, searing and raw, is Amy Tan’s The Joy Luck Club and Alice Walker’s The Color Purple meets Leslie Marmon Silko’s Ceremony—only, this isn’t fiction. Beautifully rendered and rippling with family dysfunction, secrets, deaths, drunks, and old resentments, Shonda Buchanan’s memoir is an inspiring story that explores her family’s legacy of being African Americans with American Indian roots and how they dealt with not just society’s ostracization but the consequences of this dual inheritance. Buchanan was raised as a Black woman, who grew up hearing cherished stories of her multi-racial heritage, while simultaneously suffering from everything she (and the rest of her family) didn’t know. Tracing the arduous migration of Mixed Bloods, or Free People of Color, from the Southeast to the Midwest, Buchanan tells the story of her Michigan tribe—a comedic yet manically depressed family of fierce women, who were everything from caretakers and cornbread makers to poets and witches, and men who were either ignored, protected, imprisoned, or maimed—and how their lives collided over love, failure, fights, and prayer despite a stacked deck of challenges, including addiction and abuse. Ultimately, Buchanan’s nomadic people endured a collective identity crisis after years of constantly straddling two, then three, races. The physical, spiritual, and emotional displacement of American Indians who met and married Mixed or Black slaves and indentured servants at America’s early crossroads is where this powerful journey begins. Black Indian doesn’t have answers, nor does it aim to represent every American’s multi-ethnic experience. Instead, it digs as far down into this one family’s history as it can go—sometimes, with a bit of discomfort. But every family has its own truth, and Buchanan’s search for hers will resonate in anyone who has wondered \"maybe there’s more than what I’m being told.\"",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Indigenous",
    "Biography",
    "History",
    "Native American",
    "Race"
  ],
  "author": "Shonda Buchanan",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/43836948-black-indian"
}