{
  "title": "Mobituaries: Great Lives Worth Reliving",
  "description": "From beloved CBS Sunday Morning correspondent and humorist Mo Rocca, an entertaining and rigorously researched book that celebrates the dead people who have long fascinated him.Mo Rocca has always loved obituaries—reading about the remarkable lives of global leaders, Hollywood heavyweights, and innovators who changed the world. But not every notable life has gotten the send-off it deserves. His quest to right that wrong inspired Mobituaries, his #1 hit podcast. Now with Mobituaries , the book, he has gone much further, with all new essays on artists, entertainers, sports stars, political pioneers, founding fathers, and more. Even if you know the names, you’ve never understood why they matter...until now.Take Herbert before he was president, he was the “Great Humanitarian,” the man who saved tens of millions from starvation. But after less than a year in the White House, the stock market crashed, and all the good he had done seemed to be forgotten. Then there’s Marlene Dietrich, well remembered as a screen goddess, less remembered as a great patriot. Alongside American servicemen on the front lines during World War II, she risked her life to help defeat the Nazis of her native Germany. And what about Billy Carter and history’s unruly presidential brothers? Were they ne’er-do-well liabilities…or secret weapons? Plus, Mobits for dead sports teams, dead countries, the dearly departed station wagon, and dragons. Yes, dragons.Rocca is an expert researcher and storyteller. He draws on these skills here. With his dogged reporting and trademark wit, Rocca brings these men and women back to life like no one else can. Mobituaries is an insightful and unconventional account of the people who made life worth living for the rest of us, one that asks us to think about who gets remembered, and why.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Audiobook",
    "Humor",
    "Essays",
    "Biography Memoir"
  ],
  "author": "Mo Rocca",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/43822770-mobituaries"
}