{
  "title": "The Ungrateful Refugee",
  "description": "A Finalist for the 2019 Kirkus Prize in Nonfiction\"Nayeri combines her own experience with those of refugees she meets as an adult, telling their stories with tenderness and reverence.” ―The New York Times Book Review\"Nayeri weaves her empowering personal story with those of the ‘feared swarms’ . . . Her family’s escape from Isfahan to Oklahoma, which involved waiting in Dubai and Italy, is wildly fascinating . . . Using energetic prose, Nayeri is an excellent conduit for these heart-rending stories, eschewing judgment and employing care in threading the stories in with her own . . . This is a memoir laced with stimulus and plenty of heart at a time when the latter has grown elusive.” ―Star-Tribune (Minneapolis)What is it like to be a refugee? It is a question many of us do not give much thought to, and yet there are more than 25 million refugees in the world. To be a refugee is to grapple with your place in society, attempting to reconcile the life you have known with a new, unfamiliar home. All this while bearing the burden of gratitude in your host nation: the expectation that you should be forever thankful for the space you have been allowed.Aged eight, Dina Nayeri fled Iran along with her mother and brother, and lived in the crumbling shell of an Italian hotel-turned–refugee camp. Eventually she was granted asylum in America. She settled in Oklahoma, then made her way to Princeton. In this book, Nayeri weaves together her own vivid story with the stories of other refugees and asylum seekers in recent years, bringing us inside their daily lives and taking us through the different stages of their journeys, from escape to asylum to resettlement. In these pages, a couple falls in love over the phone, and women gather to prepare the noodles that remind them of home. A closeted queer man tries to make his case truthfully as he seeks asylum, and a translator attempts to help new arrivals present their stories to officials.Nothing here is flattened; nothing is simplistic. Nayeri offers a new understanding of refugee life, confronting dangers from the metaphor of the swarm to the notion of “good” immigrants. She calls attention to the harmful way in which Western governments privilege certain dangers over others. With surprising and provocative questions, The Ungrateful Refugee recalibrates the conversation around the refugee experience. Here are the real human stories of what it is like to be forced to flee your home, and to journey across borders in the hope of starting afresh.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Biography",
    "Audiobook",
    "Iran",
    "Biography Memoir"
  ],
  "author": "Dina Nayeri",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/43835469-the-ungrateful-refugee"
}