{
  "title": "Vicksburg: Grant's Campaign That Broke the Confederacy",
  "description": "The astonishing story of the longest and most decisive military campaign of the Civil War in Vicksburg, Mississippi, which opened the Mississippi River, split the Confederacy, freed tens of thousands of slaves, and made Ulysses S. Grant the most important general of the war.Vicksburg, Mississippi, was the last stronghold of the Confederacy on the Mississippi River. It prevented the Union from using the river for shipping between the Union-controlled Midwest and New Orleans and the Gulf of Mexico. The Union navy tried to take Vicksburg, which sat on a high bluff overlooking the river, but couldn’t do it. General Grant moved his army south and joined forces with Admiral Porter, but even together they could not come up with a successful plan. At one point Grant even tried to build a canal so that the river could be diverted away from Vicksburg.In Vicksburg, Donald L. Miller tells the full story of this year-long campaign to win the city. He brings to life all the drama, characters, and significance of Vicksburg, a historic moment that rivals any war story in history. Grant’s efforts repeatedly failed until he found a way to lay siege and force the city to capitulate. In the course of the campaign, tens of thousands of slaves fled to the Union lines, where more than twenty thousand became soldiers, while others seized the plantations they had been forced to work on, destroying the economy of a large part of Mississippi and creating a social revolution.Ultimately, Vicksburg was the battle that solidified Grant’s reputation as the Union’s most capable general. Today no general would ever be permitted to fail as often as Grant did, but in the end he succeeded in what he himself called the most important battle of the war, the one that all but sealed the fate of the Confederacy.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "Military Fiction",
    "American Civil War",
    "Military History"
  ],
  "author": "Donald L. Miller",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/43822830-vicksburg"
}