{
  "title": "Flatbreads  Flavors",
  "description": "\"Two people caught in the grip of wanderlust,\" as Alford and Duguid describe themselves, this American- Canadian pair has traveled for nearly two decades, singly and together, throughout Asia, Europe, the Mediterranean, North Africa, and North America. As they have pursued their passions for travel photography and culinary research, they have found around the world a shared and nourishing element of culture and cuisine: flatbreads, the simplest, oldest, and most marvelously varied form of bread known to humankind. Immersing themselves in local cultures-from the Malaysian island of Penang and the high Himalayan passes of Tibet to the market stalls of Provence and the pueblos of New Mexico -- Adford and Duguid have studied bread baking and cooking with local bakers, in family kitchens, with street vendors, and at neighborhood restaurants and cafes.In Flatbreads and Flavors they share more than sixty recipes for flatbreads of every origin and description: tortillas from Mexico, pita from the Middle East, naan from Afghanistan, chapatti from India, pizza from Italy, and French fougasse. As well within the eight regional chapters of the book, they provide 150 exuberant recipes for traditional accompaniments to the breads. These include chutneys and curries, salsas and stews, rich samplings of the Mediterranean mezze table and the Scandinavian smorgasbord, and such delectable pairings as Chinese Spicy Cumin Kebabs wrapped in Uighur nan or Lentils with Garlic, Onion, and Tomato spooned onto chapatti.Oven-baked, grilled, fried, skillet-baked, steamed, or even baked beneath the desert sand, flatbreads are a fascinating, satisfying, and simple form that brings wholesome grains into our diet. They can be made from every grain imaginable: wheat, rye, corn, oats, millet, sorghum, teff, rice, buckwheat. They can be unleavened or leavened. They can be made so thin that they become transparent, or they can be two inches thick and sliceable.But Flatbreads and Flavors is not only a book about the original life-sustaining food served around the world since time began, it is also a book about people and places, with vivid images and shared experiences captured in brief prose essays and in Alford and Duguid's own acclaimed photographs. Redolent with the tastes and aromas of the world's hearths, it maps a course through cultures old and intriguing. With clear and patient recipes and special sections defining techniques, ingredients, and equipment, Flatbreads and Flavors makes accessible to the novice and experienced baker alike the simple and satisfying bread baker's art.Flatbreads and Flavors has 8 maps and 16 pages of full-color photographs of breads and their accompaniments. It is a Main Selection of HomeStyle Books a division of Book-of-the-Month Club.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Travel",
    "Food and Drink",
    "Reference"
  ],
  "author": "Jeffrey Alford",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/438252.Flatbreads_Flavors"
}