{
  "title": "Seduced by Moonlight",
  "description": "I am Meredith Gentry, P.I. and Princess Merry, heir to the throne of Fairie.Now there are those among me who whisper I am more.They fear me even as they protect me. And who can blame them?I’ve awakened the dazzling magic that’s slumbered in them forthousands of years. But the thing is, I can’t figure out why.My aunt, the Queen of Air and Darkness, is no longer distracted by her usual sadistic hobbies. Her obsession has turned unwaveringly to me. The mission to get me pregnant and beat my cousin Prince Cel to the crown is taking longer than expected. Even though I spend each night with the Queen’s Ravens, my immortal guards, no child has come of our decadent pleasures. But something else is happening. My magic courses through me uncontrollably. And as I lock my half-mortal body with their full-Sidhe blooded ones, the power surges like never before.It all began with the chalice. I dreamed of it, and it appeared, cool and hard, beside me when I awoke. My guards know the ancient relic well—its disappearance ages ago stripped them of their vital powers. But it is here with us now. My touch resonates with its force, and they’re consumed with it, their Sidhe essences lit up by it. But even as they cherish me for this unexpected gift, there are those who loathe me for it. Me, a mongrel, only half fey and part mortal. The Unseelie court has suffered for so long, and there are some who would not have it weakened further by an impure queen. My enemies grow in number every day. But they do not know what I am capable of. Nor, for that matter, do I. . . .In Seduced by Moonlight , Laurell K. Hamilton brings the dark, erotic reign of the immortal fey to a startling new depth. Full of sensuality and the consuming anticipation of latent powers unleashed, this world of gods, shapeshifters, and immortal souls is unveiled in all of its supreme magnificence and its treacherous deceits.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Fae",
    "Fiction"
  ],
  "author": "Laurell K. Hamilton",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1239234.Seduced_by_Moonlight"
}