{
  "title": "The Son & His Hope",
  "description": "The unofficial ending to The USA TODAY BESTSELLING & MULTIPLE BLOG AWARD WINNING, The Ribbon Duet. The Son & His Hope is the standalone romance of Ren and Della's son. It grants solace to those wishing to remain in Cherry River for a little longer with cameos from all the beloved characters from The Boy & His Ribbon.\"Things you should know about me from the very beginning:I was born to true love, witnessed the destruction it causes, and vowed never to let such agony happen to me. I am not a story-teller like my father. I am not a writer like my mother. I am just a son--their son.I am happy being alone.And that is all I ever want to be.\"JACOBThe day he was born, Jacob learned his hardest and longest lesson.It wasn't a lesson a boy should learn so young, but from his earliest memories he knew where happiness lives, so does tragedy. Where love exists, so does heartbreak. And where hope resides, so does sorrow.That lesson carved him from the kid to the teen to the man.And nothing and no one could change his mind.HOPEI first met him when he was fourteen at a movie premiere of all places. A movie based on his parent's life.He was stoic, strong, suspicious, and secretive.I was only ten, but I felt something for him. A strange kind of heartbreak that made me want to hug and heal him.I was the daughter of the actor hired to play his father.We shared similarities.I recognised parts of him because they were parts of me.But no matter how many times we met. No matter how many times I tried.He stayed true to his vow to never fall.A sweeping standalone romance for lovers of star-crossed soulmates, hearts that need healing, and a love story set amongst the fields and horses of Cherry River.",
  "genres": [
    "Romance",
    "Contemporary",
    "New Adult",
    "Contemporary Romance",
    "Slow Burn",
    "Enemies To Lovers",
    "Friends To Lovers"
  ],
  "author": "Pepper Winters",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/43863794-the-son-his-hope"
}