{
  "title": "The Cunnilinguist: How to Give and Receive Great Oral Sex: Top Tips from Both Ends of the Tongue",
  "description": "Going down. Eating out. Rug-munching. Speaking in tongues. No matter what you call cunnilingus, talking about it is sometimes uncomfortable and awkward—Until now. The Cunnilinguist is a refreshingly modern guide to oral sex with a sense of humor. Written by a woman with experience at both ends of the tongue, this guide will build your confidence in giving —or receiving— oral sex. Valentine's month launch heavily discounted during February 2019!!! Did you know that lesbians report more orgasms than straight women and receiving oral sex can double a woman's chance of orgasm? Those are two findings from a large research study into the differences in orgasm frequency among gay, lesbian, bisexual, and heterosexual men and women. However, fear not; The Cunnilinguist has you covered. You'll learn tested tips, tricks and techniques that any giver or receiver can try. The How To Give And Receive Great Oral Sex has insights and tips for readers from beginner to advanced, single to married, and regardless of gender or sexual orientation. And you'll learn what not to do! The Cunnilinguist includes the latest scientific research alongside firsthand advice from a woman with experience on both ends of the tongue. Selected excerpts What this book has turned out to be is even more exciting that I had ever hoped. Working closely with Alex to craft a guidebook that could be used by anyone who wants to learn to give or receive good cunnilingus, regardless of gender, has been an adventure. I especially loved that this book focuses on the experience of oral sex for both the giver and the receiver. I love that with The Cunnilinguist, Alex has chosen to open up the discussion to anyone who wants to give oral sex to someone with a vulva, and anyone with a vulva who wants to receive. There's such a need for writing about sex that recognizes trans, nonbinary, and intersex people, and I think this book does an elegant (and fun) job of broadening the conversation beyond cisgender bodies. The Cunnilinguist is the kind of book I wish I'd had available to my Sociology of Sexuality students. It manages to be both informative and well-researched while also being a fun, irreverent frolic. The description of the vaginal / vulvar / clitoral anatomy is worth the cover price alone, given how many people who possess these structures don't know what they're called or how they work. This refreshingly modern guide takes the business of giving and receiving pleasure seriously, but never takes itself too seriously. It's full of orgasm-inducing tips and techniques for both giver and receiver, presented with equal doses of good humor and practical, usable information. —Susan Harper PhD Could this be the ultimate gift for your partner? Regardless of gender, sexuality or relationship status, if you're someone who would like to improve your experience of giving or (and?!) receiving cunnilingus this \"refreshingly modern guide\" might just be the pleasure-inducing gift you're looking for! Read it, gift it and have fun using it! :) #TheCunnilinguist",
  "genres": [
    "Sexuality",
    "Audiobook",
    "Relationships"
  ],
  "author": "Alex B. Porter",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/43854426-the-cunnilinguist"
}