{
  "title": "Heart of Stone",
  "description": "\"Heart of Stone\" is a a standalone novel, and the second story in the collaborative, multi-author, sci fi series, \nKhargals of Duras.\n *-*Her winged savior was no angel.When death nearly claims Brianna at the tender age of eight, a being that shouldn’t exist saves her. Twenty years later, she becomes an architect specialized in historic buildings, still searching for evidence that the one who saved her—the one who haunts her increasingly wild dreams—truly exists. When a mystery man hires her for a major project in the catacombs of an old church turned exclusive, gothic nightclub, Brianna believes she may just have her chance at long last. Alkor has grown weary of this era. Forced to hide in plain sight, forbidden from ever claiming the only woman to have stirred his mating instincts, he considers going back into hibernation rather than pining for her from afar. But the sudden activation of the beacon changes everything. Rescue is on the way! With his only means of reaching the rendezvous point trapped in the catacombs, Alkor hires Brianna to help recover his treasure. However, his lost sigil isn’t the only thing he intends to take back home with him.Time is running out, and the evil forces conspiring to capture him and will stop at nothing to achieve their goal, even using Brianna. Did Alkor save his true mate only to lose her now that they might have a chance at a future together?** -------------- **Khargals of DurasA thousand years ago, a Khargal scouting party left Duras, only to crash on a planet called Earth.Injured and outnumbered, the stranded Khargals hid among stone effigies and observed the slow evolution of the planet’s primitive inhabitants. With no means of returning to Duras, they watched from their shadowy perches and faded into legend, becoming the mythical gargoyles. Until today. Long after any hope for rescue had died, the distress signal has finally been answered. It's time to go home.** -------------- **Don't miss out on the full series!Khargals of Duras. Book 1: Gravel and Grit by Stacy JonesBook 2: Hard as Rock by Stephanie WestBook 3: Heart of Stone by Regine AbelBook 4: Sticks and Stones by Tamsin LeyBook 5: Etched in Stone by Abigail MystBook 6: Taken for Granite by Nancey CummingsBook 7: Rock My World by Zara Zenia",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Science Fiction Romance",
    "Paranormal",
    "Paranormal Romance",
    "Suspense"
  ],
  "author": "Regine Abel",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/43849116-heart-of-stone"
}