{
  "title": "Another Man's Freedom Fighter",
  "description": "He tried to hide in plain sight.It worked. For a while.But then the war forcedan impossible decision on him. In the near The leaders of Europe sleepwalk into a catastrophe that sparks a new war between Russia and the West.Warsaw falls on the first day. NATO, more divided and indecisive than ever, leaves Poland to fend for itself.A small guerrilla army valiantly fights behind enemy lines. The covert Stay-Behind Units of the Territorial Defense Forces are determined to raise hell for the occupation troops. They evade the merciless manhunters of Spetsnaz GRU best they can.But will they last long enough? Will allied reinforcements arrive in time?Security consultant Mark Sanders lives a quiet, peaceful family life in Berlin, or so it seems… A dark secret from his past comes back to haunt him and he is forced to make an impossible Should he go off the grid and try to keep his family safe… Or should he join the mysterious hacker Mlada and expose the devious plot of the Russian regime?If you love pulse-pounding, page-turning spy thrillers populated with richly rendered characters, you will love Another Man’s Freedom Fighter.Don’t miss this action-packed read, get your copy now! Dear I hope my debut thriller will take you on a ride filled with edge-of-your-seat excitement as you immerse yourself into the action, a feeling of deep compassion and true camaraderie as you fight alongside brave Polish stay-behind fighters, and... Well, let’s make it I hope you will really enjoy the book.As an author (and thriller addict) I was very much influenced by Tom Clancy’s Jack Ryan series, Lee Child’s Jack Reacher, Philip Kerr’s Bernie Gunther, Robert Ludlum’s Jason Bourne, Ian Fleming’s James Bond (of course!) and also the books by Mark Greaney, Olen Steinhauer, Len Deighton, John le Carré, Anthony Horowitz, Stieg Larsson, Jussi Adler-Olsen, and Volker Kutscher.Some readers have compared my writing to the styles of Brad Thor, Vince Flynn, David Baldacci, and Daniel Silva.Reviewers have commented very positively on the complexity of my characters, the realism of the scenario, the research I put into bringing alive the world of espionage, hybrid warfare, and geo-politics.I would be very happy to also hear from you here, on my Facebook page, on Bookbub, or on Goodreads.Thank you for your consideration,Joseph",
  "genres": [],
  "author": "Joseph   Carter",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/43861689-another-man-s-freedom-fighter"
}