{
  "title": "Clueless in the Kitchen: A Cookbook for Teens and other Beginners",
  "description": "You're young, you're hungry, you're clueless The kitchen looms before you like something from a bad horror film. There's food in there, but then what? It'll have to be cooked... or at least peeled. Probably both . It's enough to scare even the foolhardy, but then so is a diet of macaroni and cheese. And you can't afford to keep ordering pizza. Aaarghh! Relax! You're not alone. Author Evelyn Raab (mom to two teenage sons) understands that the kitchen is alien territory, and she is going to teach you everything you need to know to produce something deliciously edible out of actual ingredients -- in other words, cook -- and live to tell the tale. Incredibly thorough, never condescending, and with a dash of humor, Clueless in the Kitchen leads culinary neophytes through the entire range of kitchen experience -- from cleaning a stove and outfitting a first kitchen (cheaply), to unplugging a drain and identifying that stuff in the bulk-food bins. Two hundred easy-to-follow recipes show how to make all kinds of simple and scrumptious dishes for every meal and occasion, beginning with \" A Cruel Joke\" and ending with Snacks and Munchies.\" There's even a chapter devoted exclusively to the \"Vehemently Vegetarian.\" And there's more! Each recipe is coded with an icon symbolizing vegetarian meals, cheap eats, couch potato, mom, or family food, food to impress, and snacks and munchies. And useful menu planners will help you tailor the perfect meal to every guest, whether that guest is your shallow but fun boy/girlfriend, your aunt Gladys, or (gasp!) your entire family. Whether you're living on your own for the very first time or you're just on your own for dinner, Clueless in the Kitchen will be the first and -- hopefully -- only guide you will ever need. You may never eat macaroni and cheese again!",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food"
  ],
  "author": "Evelyn Raab",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/438709.Clueless_in_the_Kitchen"
}