{
  "title": "Iran Rising: The Survival and Future of the Islamic Republic",
  "description": "On the fortieth anniversary of the 1978–79 Iranian revolution, a definitive political picture of the Islamic RepublicWhen Iranians overthrew their monarchy, rejecting a pro-Western shah in favor of an Islamic regime, many observers predicted that revolutionary turmoil would paralyze the country for decades to come. Yet forty years after the 1978–79 revolution, Iran has emerged as a critical player in the Middle East and the wider world, as demonstrated in part by the 2015 international nuclear agreement. In Iran Rising, renowned Iran specialist Amin Saikal describes how the country has managed to survive despite ongoing domestic struggles, Western sanctions, and countless other serious challenges.Saikal explores Iran’s recent history, beginning with the revolution, which set in motion a number of developments, including war with Iraq, precarious relations with Arab neighbors, and hostilities with Israel and the United States. He highlights the regime’s agility as it navigated a complex relationship with Afghanistan during the Soviet invasion, survived the Gulf wars, and handled fallout from the Iraqi and Syrian crises. Such success, Saikal maintains, stems from a distinctive political order, comprising both a supreme Islamic leader and an elected president and national assembly, which can fuse religious and nationalist assertiveness with pragmatic policy actions at home and abroad.But Iran’s accomplishments, including its nuclear development and ability to fight ISIS, have cost its people, who are desperately pressuring the ruling clerics for economic and social reforms—changes that might in turn influence the country’s foreign policy. Amid heightened global anxiety over alliances, terrorism, and nuclear threats, Iran Rising offers essential reading for understanding a country that, more than ever, is a force to watch.",
  "genres": [
    "Iran",
    "History",
    "Nonfiction",
    "Politics",
    "Audiobook"
  ],
  "author": "Amin Saikal",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/43854335-iran-rising"
}