{
  "title": "Jordan",
  "description": "Jordan is the fast-paced, riveting story that answers the question - how would human nature react to a modern-day miracle in a viral social media world?\"Victoria Landis has written a compelling, exciting but tragic tale of a gift of good in the world and how it is corrupted by the machine of greed and ambition. Please read this!\" - Andrew Gross, #1 New York Times Bestselling Author of Button Man, Saboteur, and The One Man\"A compelling story that reveals the many sides of human nature.\" - NY Times Best Seller Charles Todd\"We call it a page turner!\" - \nThe Conch Republic Coconut Telegraph\nWhen Petra Simmons and her brother, Andy, help a seemingly homeless woman, it immediately changes their lives forever. Within days, it's clear the woman, Jordan Crissman, possesses an amazing ability - perhaps the most miraculous ability of all.They realize in the current world of viral social media, they must be careful. How best to employ the miracle without causing havoc? They plot a strategy. Despite their plans, word gets out too fast, and the world comes running - invading and overwhelming South Florida - along with serious danger.Television talking heads pontificate. Pundits opine. Some claim she's a messiah. Others insist she's the devil. Massive crowds gather, demanding to see Jordan. Everyone wants her. There seems to be nowhere to hide. Horrible rumors take hold. Protest groups march and riot. Mass hysteria reigns - and people are dying.\"In Jordan, Victoria Landis takes her skill for developing characters and relationships to a new level. This work portrays a new view of an age-old question. How do people react when confronted with things they don't understand? A compelling story that reveals the many sides of human nature, told in Victoria Landis' talented manner.\" - Charles Todd, Mary Higgins Clark Award Winner and NY Times Best Selling Author\"We say it's a page turner! The characters are so real, you feel as if you know them personally. The setting is opulent Boca Raton, where the rich get richer, and there seems to be nothing that money can't buy. It's love vs. greed, who will succeed? I couldn't put it down and can't wait for the sequel!\" - \nThe Conch Republic Coconut Telelgraph\n\"Once you begin reading this story, you won't be able to put it down.\" - Nancy J. Cohen, Agatha Award Nominee & Author of the Bestselling Bad Hair Day Mysteries\"Victoria Landis has masterfully combined great elements into a highly-charged, compelling story with an explosive ending. Read Jordan! It's good for what ails you.\" - Don Bruns, \nUSA Today\nBest Selling Author\"What would happen if a young woman appeared with mysterious healing powers, a woman intent on using her newfound talents to improve the world? How would the public react? What about the media, the government? Would both welcome her with open arms? Or, would there be slanderous articles and broadcasts speculating on the source of her powers, perhaps accusing her of witchcraft or being Satan's offspring? Jordan lives these questions and many more.",
  "genres": [],
  "author": "Victoria  Landis",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/43851186-jordan"
}