{
  "title": "Bright of the Moon",
  "description": "Alternate cover edition of ASIN B08LC6CLCL Wrath consumes him as the dark does the night… Until she rises. But can she chase away his darkness?   Most would say the “sweet” and “quiet” Signorina Arabella Belmonte has lived a quiet life as a young noblewoman in her family’s castello. But little do they know she pens treatises criticizing the realm’s warmongers… and now there’s a price on her head. As she struggles to hide her seditious activities, a chance encounter with a unicorn leaves her with four hooves and a horn of her own--and a form she can’t control. The dark-elf queen has offered her a chance to acquire that control… if Bella can find the unicorn who turned her.  Prince Dhuro of Nightbloom has never met a problem he couldn’t solve with his fists--that is, until he fought his sister for a place in army’s elite forces and lost. When the light-elves defeated them and his father was executed, Dhuro’s inner demons laid claim to the whole of him. Now Immortal beasts are growing in power and threatening his people.  Dhuro has a chance to help his people win, but his mother, the queen, sends him on a fool’s errand instead--helping a human newly turned unicorn find her sire, and asking the impossible: whether the Elder of the pacifistic unicorns will stand with them against the beasts ravaging his people. Making things worse, Bella challenges his every decision, argues with him, infuriates him… until beneath the full moon, she shifts to her human form... and enchants him.  A war is raging, Dhuro must marry for political advantage, and only Bella’s sire can help her... And when the bounty hunters hunting her find them, Dhuro and Bella’s worldviews collide like life and death. But can he be the answer to helping her control her form, and can she chase away his darkness? Can they find a way to be together and fight the war threatening to devour the land… or will it swallow them too?",
  "genres": [
    "Fantasy",
    "Romance",
    "Fae",
    "Fantasy Romance",
    "Elves",
    "Enemies To Lovers",
    "Magic"
  ],
  "author": "Miranda Honfleur",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/43853979-bright-of-the-moon"
}