{
  "title": "Arranged Love",
  "description": "Liliana Ricci Growing up in Boston as the daughter of the mafia's leader has its perks. I never grew up wanting anything with monetary value, never went hungry or thirsty and always had a bed to sleep in. What I craved was companionship, love, freedom. My father arranged my marriage to one of the most ruthless in the Mob, Antonio Moretti, notorious for being cold and calculating. He is the newest Don of the mafia's Outfit in Chicago due to the death of his father. The Outfit is weakened from the Bratva and my father thinks this marriage will help our ties. I'm nothing more than a business deal. I've heard rumors and stories of Antonio Moretti that frighten me to my very core. I'm not ready to give up my innocence, I'm not ready to be forced into a loveless marriage like all women unfortunate enough to be born into this life.Antonio MorettiThe Bratva slaughtered my father along with eighteen others on a mission. A mission I should have been on with my younger brother. Now I am the rightful Don of the Outfit. This isn't the first time within the past few months that the Bratva has attacked and slaughtered my soldiers, there has to be a rat. The only way to get my revenge is if I have help from Boston. Marco Ricci offers a good majority of his men in exchange that I marry his nineteen-year-old daughter, Liliana. I never once saw myself as the married type or the father type, but I know the job description and what is expected of me. I agree with the marriage because I need the men.One look into her blue eyes and already I feel...strange. She is captivating, she is innocent, but she is unlike any of the other women I have met. She is feisty and reserved and not flinging herself at me like I'm used to. I refuse to get close to her. Closeness is a weakness.This book has adult situations and language and is recommended for readers eighteen and older.",
  "genres": [
    "Mafia Romance",
    "Romance",
    "Contemporary",
    "Dark Romance",
    "Crime",
    "Enemies To Lovers",
    "Adult"
  ],
  "author": "E.M. Courier",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/43845526-arranged-love"
}