{
  "title": "The Art of Hunting Humans: A radical and confronting explanation of the human mind",
  "description": "The Art of Hunting Humans is a 2019 Readers' Favorite Silver Medal Winner!***Imagine there was an evil alien society that had this bizarre interest in hunting humans for leisure.Now, imagine they prepared a full guide to teach their own kind how we think, socialize, and most of all, how to spot our weaknesses.Finally, imagine that you got your hands on a copy of one of those guides. Wouldn’t you want to read it to understand if there really is a threat? If there was, wouldn’t you want to learn what the aliens know about us to better prepare to defend yourself and those you love?--The Art of Hunting Humans presents key aspects of the human mind. With straightforward language, weird metaphors and practical examples, it enables readers to understand human behaviour and evaluate their lives from an outsider’s perspective.Designed to challenge rather than comfort, The Art of Hunting Humans sets itself apart from anything else written in its field. The result is a sceptical, radical explanation of the mind that provides extraordinary insights into the inner worlds of human beings.BOOK BLURB:The age-old art of human hunting is one you must orchestrate with care. In The Art of Hunting Humans, you’ll learn essential facts about Earth’s smartest primate and discover mistakes that are common among hunters while in pursuit of their prey. Whether you are an experienced hunter or a novice, this guide is essential reading. In it, you’ll learn the major steps for a hunt — from correct observation and selection of your prey to choosing the tastiest bait. It will reveal how to leverage humans’ self-ignorance and strange behaviours and expose flaws of which they are oblivious. At the end of the book, you will have the opportunity to meet the SUPERIORS — creatures like no other. You’d better be ready!Even if you’re a seasoned hunter, The Art of Hunting Humans provides extraordinary insights into human behaviour as well as tips that will blow your mind.Almost everything in this book is a trap. Enjoy!",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Social Science",
    "Audiobook",
    "Humor",
    "Science",
    "Philosophy"
  ],
  "author": "Sidney Mazzi",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/43881074-the-art-of-hunting-humans"
}