{
  "title": "Jetty Beach Series Box Set 1-4",
  "description": "Sexy. Sweet. Romantic. Fall in love with the swoony heroes and sassy heroines of Jetty Beach.   A brooding photographer with a secret. A playboy billionaire who doesn’t want to be tamed. A swoony small-town doctor looking for love. A retired Marine who’ll stop at nothing to win back the love of his life.  You’ll find them all in this collection of four full-length novels in the Jetty Beach Romance series.  This collection includes: Must Be Love Must Be Crazy Must Be Fate Must Be Home  Must Be Love Ryan comes into Nicole’s life at precisely the wrong time. But she can’t get him out of her mind—or stay out of his bed. He makes her feel things she never imagined, but his sweet, sad eyes are hiding a secret that could tear them apart. It’s either a huge mistake, or it must be love.  Must Be Crazy Melissa Simon was in a rut—until she met Jackson Bennett. A wealthy bachelor with a playboy reputation, his cocky attitude should not make her hot. But damn, it does. He wants to whisk her away for one crazy week. No strings. No expectations. It isn’t supposed to mean anything… Until it does.  Must Be Fate When Clover meets Cody, she knows fate led her to Jetty Beach. Their chemistry is undeniable. But to a man like him—mature and put together—she’s a wild breeze who throws him off kilter. And to a woman like her—who never lets anyone in—he might want more than she can give. He might want everything.  Must Be Home Hunter left Emma ten years ago, disappearing without a goodbye. Now they’re both back in town and Hunter knows one thing with certainty—he’s going to get her back. But second chances don’t come easy, and no matter how relentlessly he pursues her, she’s afraid of losing her heart to him again.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Claire Kingsley",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/43885056-jetty-beach-series-box-set-1-4"
}