{
  "title": "The Other Windsor Girl: A Novel of Princess Margaret, Royal Rebel",
  "description": "In a historical debut evoking the style of The Crown, the daughter of an impoverished noble is swept into the fame and notoriety of the royal family and Princess Margaret's fast-living friends when she is appointed as Margaret's second Lady-in-Waiting.Diana, Catherine, Meghan…glamorous Princess Margaret outdid them all. Springing into post-World War II society, and quite naughty and haughty, she lived in a whirlwind of fame and notoriety. Georgie Blalock captures the fascinating, fast-living princess and her “set” as seen through the eyes of one of her ladies-in-waiting. In dreary, post-war Britain, Princess Margaret captivates everyone with her cutting edge fashion sense and biting quips. The royal socialite, cigarette holder in one hand, cocktail in the other, sparkles in the company of her glittering entourage of wealthy young aristocrats known as the Margaret Set, but her outrageous lifestyle conflicts with her place as Queen Elizabeth’s younger sister. Can she be a dutiful princess while still dazzling the world on her own terms?Post-war Britain isn’t glamorous for The Honorable Vera Strathmore. While writing scandalous novels, she dreams of living and working in New York, and regaining the happiness she enjoyed before her fiancé was killed in the war. A chance meeting with the Princess changes her life forever. Vera amuses the princess, and what—or who—Margaret wants, Margaret gets. Soon, Vera gains Margaret’s confidence and the privileged position of second lady-in-waiting to the Princess. Thrust into the center of Margaret’s social and royal life, Vera watches the princess’s love affair with dashing Captain Peter Townsend unfurl.But while Margaret, as a member of the Royal Family, is not free to act on her desires, Vera soon wants the freedom to pursue her own dreams. As time and Princess Margaret’s scandalous behavior progress, both women will be forced to choose between status, duty, and love…",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Romance",
    "British Literature",
    "Chick Lit"
  ],
  "author": "Georgie Blalock",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/43884183-the-other-windsor-girl"
}