{
  "title": "Radical: The Science, Culture, and History of Breast Cancer in America",
  "description": "The science, culture and history of breast cancer as told by a reporter who survived itAs a health-care journalist, Kate Pickert knew the emotional highs and lows of medical treatment well -- but always from a distance, through the stories of her subjects. That is, until she was unexpectedly diagnosed with an aggressive type of breast cancer at the age of 35. As she underwent more than a year of treatment, Pickert realized that the popular understanding of breast care in America bears little resemblance to the experiences of today's patients and the rapidly changing science designed to save their lives. After using her journalistic skills to navigate her own care, Pickert embarked on a quest to understand the cultural, scientific and historical forces shaping the lives of breast-cancer patients in the modern age.Breast cancer is one of history's most prolific killers. Despite billions spent on research and treatments, it remains one of the deadliest diseases facing women today. From the forests of the Pacific Northwest to an operating suite in Los Angeles to the epicenter of pink-ribbon advocacy in Dallas, Pickert reports on the turning points and people responsible for the progress that has been made against breast cancer and documents the challenges of defeating a disease that strikes one in eight American women and has helped shape the country's medical culture.Drawing on interviews with doctors, economists, researchers, advocates and patients, as well as on journal entries and recordings collected over the author's treatment, Radical puts the story of breast cancer into context, and shows how modern treatments represent a long overdue shift in the way doctors approach cancer -- and disease -- itself.",
  "genres": [
    "Nonfiction",
    "Science",
    "Health",
    "History",
    "Medical",
    "Medicine",
    "Audiobook"
  ],
  "author": "Kate Pickert",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/43885028-radical"
}