{
  "title": "Disgraceland: Musicians Getting Away with Murder and Behaving Very Badly",
  "description": "From the creator of the popular rock 'n' roll true crime podcast, DISGRACELAND comes an off-kilter, hysterical, at times macabre book of stories from the highly entertaining underbelly of music history.\n\nYou may know Jerry Lee Lewis married his thirteen-year-old cousin but did you know he shot his bass player in the chest with a shotgun or that a couple of his wives died under extremely mysterious circumstances? Or that Sam Cooke was shot dead in a seedy motel after barging into the manager's office naked to attack her? Maybe not. Would it change your view of him if you knew that, or would your love for his music triumph?Real rock stars do truly insane thing and invite truly insane things to happen to them; murder, drug trafficking, rape, cannibalism and the occult. We allow this behavior. We are complicit because a rock star behaving badly is what's expected. It's baked into the cake. Deep down, way down, past all of our self-righteous notions of justice and right and wrong, when it comes down to it, we want our rock stars to be bad. We know the music industry is full of demons, ones that drove Elvis Presley, Phil Spector, Sid Vicious and that consumed the Norwegian Black Metal scene. We want to believe in the myths because they're so damn entertaining.DISGRACELAND is a collection of the best of these stories about some of the music world's most beloved stars and their crimes. It will mix all-new, untold stories with expanded stories from the first two seasons of the Disgraceland podcast. Using figures we already recognize, DISGRACELAND shines a light into the dark corners of their fame revealing the fine line that separates heroes and villains as well as the danger Americans seek out in their news cycles, tabloids, reality shows and soap operas. At the center of this collection of stories is the ever-fascinating music industry--a glittery stage populated by gangsters, drug dealers, pimps, groupies with violence, scandal and pure unadulterated rock 'n' roll entertainment.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Music",
    "History",
    "Biography",
    "Crime",
    "Audiobook"
  ],
  "author": "Jake Brennan",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/43886021-disgraceland"
}