{
  "title": "Carolina Connections Box Set: Books 1-3",
  "description": "Get to know the hilarious and sexy Carolina crew in this home-town series of hot romantic comedies. Your next addiction starts  The Fix - Book 1 (Laney and Nate) The Spark - Book 2 (Fiona and Mark) The Lucky One - Book 3 (Bailey and Jake) THE FIX My life is a friggin’ fairytale—just not the kind any single girl would ever want to star in. Like any good heroine, I have challenges to face. Getting my son to wear pants is one; dealing with my snooze-fest of a job is another. Then there’s the Beast, my freeloading brother who’s worn a permanent dent in the couch at my new place. And no fairytale would be complete without a smoking hot prince, of course. Too bad he’s a complete ass. My instincts scream at me to steer clear of Nate Murphy. Because, if life has taught me anything, there is no such thing as happily ever after. I may not be a superhero, but I do my best to come to the rescue when I’m needed. And, hey, I just moved halfway across the country after a single phone call from my mom. But being back home and taking on the responsibilities involved makes me a bit cranky at times. Unfortunately, the one time I completely lose my cool is in front of the hottest girl I’ve ever met. I’ve got my work cut out for me if I’m going to fix this. But I will fix this. I’ll be anything Laney Monroe needs me to be … a superhero, a prince, or just a guy she might take a chance on. THE SPARK Mark Beckett is the most annoying, patronizing, arrogant jerk on the face of the earth. So, naturally, I can’t get the damn man out of my head. Like the old saying goes, I’m a jill of all trades but a master of none. What I lack in skill, however, I make up for in enthusiasm—something certain people (ahem) find irritating. But I have my reasons for living my life the way I do, for diving into one project after another and trying to make a difference. And if Mark Beckett doesn’t like it, he knows where to find the door. I don’t need his approval … or his panty-melting kisses. I enjoy the simple things in a job well done, a cold beer, a hot woman … you get the idea. But there’s nothing simple about the mess I just found myself in. The last thing I need is a pint-sized princess sticking her nose in my business and pushing every damn one of my buttons like it’s her job. But Fiona Pierce may be the only one with the tools to solve my problems—and the power to change everything. THE LUCKY ONE Luck is no lady… in fact, she can be a downright bitch. Coming home was supposed to be my shot at redemption. Instead, I’m finding myself chasing after an irresistible blonde whose mercurial behavior could give Jekyll and Hyde a run for their money. I’ve got too much on my plate to get tied up in knots over a girl who wants nothing to do with me. But Bailey Murphy may hold the key to my redemption, and I’m not giving up on either without a fight. “Irish” might play with a poker face, but I’m about to call her bluff … and I hope like hell I’ve got luck on my side. Let’s get one thing straight. I am not your typical girl. Sure, I’ve got all the parts, but I’ve been a stubborn, irreverent tomboy since the womb. Which makes it particularly ironic that my heart is so damn girlie.",
  "genres": [],
  "author": "Sylvie Stewart",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/43880399-carolina-connections-box-set"
}