{
  "title": "Strange Days",
  "description": "AT THE EDGE OF CHAOS, ONE GEEK STANDS TALL.Five years ago, dateless dork Bill Ryder managed to save the world, banishing magic and monsters to the shadows. He thought it was over, that he was finished with that life. Turns out he was dead wrong, meaning shit’s about to get surreal again.Now the impossible has happened. His goddaughter is conjuring fireballs from thin air and two vampires have shown up at his doorstep looking to kick his ass.A deranged group of ex-wizards are intent on tearing open the door between worlds, once more unleashing nightmarish horrors upon humanity, and only Bill and his friends stand in their way.Join him in this sidesplitting tale of a world teetering on the brink of anarchy and the unlikely hero who’s not afraid to look the madness in the eye and flip it both middle fingers.----------Strange Days is the thrilling continuation of The Tome of Bill, the vampire comedy series that's left readers thirsting for more. If you enjoy Shayne Silvers, Steve McHugh, or Hunter Blain, then buckle up for an unforgettable ride with Bill of the Dead!Grab your copy of Strange Days today and immerse yourself into the captivating world of Bill The Vampire, where one ordinary geek battles extraordinary odds!Click BUY NOW or READ FOR FREE and get ready to die laughing with this horror comedy series!And if you haven’t already, be sure to sink your teeth into the complete Tome of Bill the Vampire (book 1)Night Stalker (series adventure)Scary Dead Things (book 2)The Mourning Woods (book 3)Holier Than Thou (book 4)Sunset Strip (series adventure)Goddamned Freaky Monsters (book 5)Half A Prayer (book 6)The Wicked Dead (book 7)Shining Fury (series adventure)The Last Coven (book 8)",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Horror",
    "Audiobook",
    "Humor",
    "Vampires",
    "Paranormal"
  ],
  "author": "Rick Gualtieri",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/43893078-strange-days"
}