{
  "title": "Le Roi Du Sang",
  "description": "Alexandre has everything he desires except for that which he wants most of His Blood Queen.Amidst the backdrop of the Hundred Year War, Alexandre Marseille, a centuries-old vampire, seeks his fated mate. Having established his empire in New York City, he is living an opulent life and running a successful law firm. But his ultimate goal is to find her. Once he sets eyes on Venus Anderson, he will stop at nothing to get her, and the relentless, sensual pursuit begins.Venus Margaret Anderson remembers vividly what it was like to be human. To smell the yellow Jessamine flowers and feel the warm sun on her flesh in the South Carolina heat. But being human sometimes meant she wasn’t treated humanely at all, for Venus once lived as a slave on a plantation owned by a cruel master. Now a Professor of Art History, she runs from her true self. Until she is hunted and found by Alexandre.The two twisted soulmates are bitten from the same bloody cloth, but it will take all the demons of Hell and all the prayers in Heaven to convince Venus that Alexandre is not always the ruthless monster he appears to be. Separate, they are forces to be reckoned with; together, they are an explosive power couple destined to leave an indelible, blood-stained mark upon the world. But, with all good things, there are those who wait in the shadows, working their black magic to drain and destroy this love at the onset, casket officially closed.From USA Today bestselling author Tiana Laveen comes a dark and twisted dystopian romantic rollercoaster, packed with suspense, vengeance and passion. Le Roi Du Sang is a dark paranormal, steamy romance. This book includes mature themes and content that may not be suitable for all audiences; reader discretion is advised. Please look inside under “Trigger Warnings” for possible topics that may be deemed personally objectionable.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Interracial Romance"
  ],
  "author": "Tiana Laveen",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/43893471-le-roi-du-sang"
}