{
  "title": "Warrior",
  "description": "Lexi was just a typical Midwest college student, trying to find her way in the world. After meeting two odd brothers at a bar one night and allowing them to drive her home, Lexi is immediately confused by their bizarre behavior and intentions. One brother acts like a creepy stalker, while the other is exceptionally charming. After a confusing night, she decides to forget them both, but they won't leave her alone, and they both have a different story to tell.Amid her confusion, she is suddenly haunted by daunting nightmares that seem more real than a simple dream. As the truth finally begins to unfold, she learns the strange brothers are much more than two attractive locals. When the peculiar situation with the brothers only grows worse, Lexi travels across the country to seek safety. On her journey across the United States, Lexi learns she is much more than a simple college student. In her new world, she is overcome with tragedy, loss and betrayal, and she is forced to grow up overnight. But through it all, she learns new truths about herself and her true identity. She finds friends and a new family within her new safe haven. Lexi fights for her life and for her new friends, as she becomes a Warrior.Warrior is the first novel in an enchanting supernatural series. Be sure to read the second book \"Supremacy\" and the third book \"The Omega\" in the thrilling Superhumans series.\"Before I could grasp what was happening, a tall, skinny girl with short spiky blond hair had me pinned to the ground. She began to repeatedly punch my face. Her fist was like a hammer beating into my nose, while agony shot through my body. As blood squirt from my nose, I was forced to taste the metallic liquid as I nearly choked on my own vital fluid. I tried to get her off of me, but she was much too strong. Just when I thought I couldn’t tolerate another moment of her pain, Nathen threw her off of me and leaned down to help me up. It was no use. Before I could even get on my own two feet, she knocked me back into the gravel and began beating at my face.For the second time, Nathen threw her off of me. To my dismay, this girl was as quick as lightning and ridiculously stubborn. She tossed my blond haired friend away from me, and with a loud crash, he slammed into the ground.“Alexander! Help!” I screamed. Nathen and I could not take down this powerful woman alone.Our leader was still fighting the huge man with black hair, but when he heard me scream his name, he grabbed the man by his neck and wound his body around. Accordingly, his neck broke with a vicious sound. As Nathen tried again to pull the beastly woman off of me, I watched as Alexander tossed the dead superhuman to the ground and dashed towards us. In a single move, our leader tore the blond woman away from me.Just as Nathen helped me off the ground, I heard a shrill from behind me. It was Allison. Two brown-haired brutes were attacking her; they were shorter than the others but still huge! Screaming and crying, my sister was trying her hardest to keep the men off of her, but Allison was the weakest of us all; the men were going to kill her. Before I could interfere, Maria ran to her side, trying to pull the beasts away, but it was no use. Now Maria was in danger too. Hence, I knew I had to do something, or Maria and my sister would be brutally slaughtered in front of me.I shut my eyes and let me hateful emotions charge into my fingertips. Then, I reached out my hands, and with as much strength as I could, I released all my force, only thinking of the evil superhuman’s faces. With my eyelids still closed, I heard a crashing noise like a roll of thunder as the ground shook like an earthquake. The two men were thrown away from Maria and Allison, but it wasn’t over yet.\"",
  "genres": [],
  "author": "Kelsey Schaeffer",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/43898823-warrior"
}