{
  "title": "So Enchanting",
  "description": "The cynic and the enchantress…Lord Greyson Sheffield does not believe in magic or love. He has devoted his life to exposing frauds who scam innocents by preying on their hunger to believe. Only one woman ever tempted him to surrender his cynicism—Francesca Walcott, the stunning young beauty who took society by storm with her supernatural skills. But Grey is forced to bare her secrets as well, shattering her world and forcing her to flee London forever.When Grey travels to the Scottish Highlands to investigate reports of a young witch in the eccentric village of Little Firkin, he is stunned to discover the girl’s sensible companion is none other than the same Francesca Walcott who so enchanted him all those years ago. Francesca is now a ravishing woman fully equipped to challenge his cynicism with her beguiling wit.The stern yet striking nobleman has haunted Francesca’s dreams for years. Determined to protect both her young companion and the one secret Grey must never discover, Fanny does her best to resist his undeniable charms. But as passion sparks and danger swirls around them, they both discover that no one can resist the most powerful enchantment of all—the magic of true love…“Exceptionally entertaining characters, a wildly original plot, and delicious humorous writing.”— Chicago Tribune“With its deliciously clever writing and captivating plot, this wicked romance will cast a bewitching spell.”— Booklist“If it’s smart, sexy, and impossible to put down, it’s a book by Connie Brockway!”—Christina Dodd, New York Times bestselling author“If you’re looking for passion, tenderness, wit, and warmth, you need look no further. Connie Brockway is simply the best.”—Teresa Medeiros, New York Times bestselling author“Connie Brockway’s work belongs on every reader’s shelf!”— Romantic Times“Connie Brockway delivers romance with strength, wit, and intelligence.”—Tami Hoag, New York Times bestselling author",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Paranormal",
    "Regency",
    "Fiction"
  ],
  "author": "Connie Brockway",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/43901121-so-enchanting"
}