{
  "title": "Please Read This Leaflet Carefully",
  "description": "Written in first person and following a reverse chronology which subverts the typical illness story, Please Read This Leaflet Carefully follows Laura Fjellstad in her struggles to live a normal life. Having been diagnosed with severe endometriosis in her twenties, she believes that the only way to survive her painful and debilitating illness is to be completely self reliant. In between doctors’ appointments and in and out of hospitals, Laura confronts single parenting after her divorce, leading a life her own teenage self would be in awe of.To be devoured intensely in one sitting, Please Read This Leaflet Carefully is a heart warming debut novel with bracing emotional insights and piercing descriptions of pain that linger in one’s mind long after the last page. It is also a beguiling meditation on relationships, motherhood, menopause, sexuality, pain and a woman’s life journey to come to terms with her own body.“It dares you be nosy, to eavesdrop and listen in to a stoic young woman whom no one noticed until she began to disappear – a burning triumph.”– Paul Beatty, Man Booker Prize 2016“Karen Havelin writes with astounding sensitivity and grace of the vulnerability of the body, that abject and essential container within which we live our entire lives. Havelin’s debut is a revelation.”– Alexandra Kleeman, You Too Can Have a Body Like Mine“Karen Havelin’s first novel is a powerful report on the body in crisis, on a life removed from comfort and community. It is beautifully done. Havelin’s writing stresses tactility and sensuality, physical touch and sensation and isolation, making illness an occasion for empathy, trust, and connection between writer and reader.”– Donald Antrim, the Hundred Brothers",
  "genres": [
    "Fiction",
    "Contemporary",
    "Disability",
    "Literary Fiction",
    "Feminism",
    "Queer",
    "Lesbian"
  ],
  "author": "Karen Havelin",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/43905561-please-read-this-leaflet-carefully"
}