{
  "title": "Drawing Power: Women's Stories of Sexual Violence, Harassment, and Survival",
  "description": "More than 60 female comics creators share their personal experiences with sexual violence and harassment through new and original comics Inspired by the global #MeToo Movement, Drawing Women’s Stories of Sexual Violence, Harassment, and Survival is a collection of original, nonfiction comics drawn by more than 60 female cartoonists from around the world. Featuring such noted creators as Emil Ferris, Aline Kominsky-Crumb, MariNaomi, Liana Finck, and Ebony Flowers the anthology’s contributors comprise a diverse group of many ages, sexual orientations, and races—and their personal stories convey the wide spectrum of sexual harassment and abuse that is still all too commonplace. With a percentage of profits going to RAINN, Drawing Power is an anthology that stokes the fires of progressive social upheaval, in the fight for a better, safer world.Full list of Rachel Ang, Zoe Belsinger, Jennifer Camper, Caitlin Cass, Tyler Cohen, Marguerite Dabaie, Soumya Dhulekar, Wallis Eates, Trinidad Escobar, Kat Fajardo, Joyce Farmer, Emil Ferris, Liana Finck, Sarah Firth, Mary Fleener, Ebony Flowers, Claire Folkman, Noel FranklinKatie Fricas, Siobhán Gallagher, Joamette Gil, J. Gonzalez-Blitz, Georgiana Goodwin, Roberta Gregory, Marian Henley, Soizick JaffreAvy Jetter, Sabba Khan, Kendra Josie Kirkpatrick, Aline Kominsky-Crumb, Nina Laden, Miss Lasko-Gross, Carol Lay, Miriam LibickiSarah Lightman, LubaDalu, Ajuan Mance, MariNaomi, Lee Marrs, Liz Mayorga, Lena Merhej, Bridget Meyne, Carta Monir, Hila NoamDiane Noomin, Breena Nuñez, Meg O’Shea, Corinne Pearlman, Cathrin Peterslund, Minnie Phan, Kelly Phillips, Powerpaola, Sarah Allen Reed, Kaylee Rowena, Ariel Schrag, M. Louise Stanley, Maria Stoian, Nicola Streeten, Marcela Trujillo, Carol Tyler, Una, Lenora Yerkes, Ilana Zeffren",
  "genres": [
    "Graphic Novels",
    "Nonfiction",
    "Feminism",
    "Comics",
    "Memoir",
    "Anthologies",
    "Graphic Novels Comics"
  ],
  "author": "Diane Noomin",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/43908942-drawing-power"
}