{
  "title": "Family Lore",
  "description": "From bestselling, National Book Award–winning author Elizabeth Acevedo comes her first novel for adults, the story of one Dominican-American family told through the voices of its women as they await a gathering that will forever change their lives.Flor has a gift: she can predict, to the day, when someone will die. So when she decides she wants a living wake—a party to bring her family and community together to celebrate the long life she’s led—her sisters are surprised. Has Flor forseen her own death, or someone else’s? Does she have other motives? She refuses to tell her sisters, Matilde, Pastora, and Camila.But Flor isn’t the only person with secrets. Matilde has tried for decades to cover the extent of her husband’s infidelity, but she must now confront the true state of her marriage. Pastora is typically the most reserved sister, but Flor’s wake motivates this driven woman to solve her sibling’s problems. Camila is the youngest sibling, and often the forgotten one, but she’s decided she no longer wants to be taken for granted.And the next generation, cousins Ona and Yadi, face tumult of their own: Yadi is reuniting with her first love, who was imprisoned when they were both still kids; Ona is married for years and attempting to conceive. Ona must decide whether it’s worth it to keep trying—to have a child, and the anthropology research that’s begun to feel lackluster.Spanning the three days prior to the wake, Family Lore traces the lives of each of the Marte women, weaving together past and present, Santo Domingo and New York City. Told with Elizabeth Acevedo’s inimitable and incandescent voice, this is an indelible portrait of sisters and cousins, aunts and nieces—one family’s journey through their history, helping them better navigate all that is to come.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Contemporary",
    "Audiobook",
    "Fantasy",
    "Literary Fiction",
    "Adult"
  ],
  "author": "Elizabeth Acevedo",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/43911487-family-lore"
}