{
  "title": "Straight as a Wheel: Smoke Valley MC",
  "description": "“Your secret’s safe with me, Leo Heller. Whatever happens here, nobody will know. Ever. Do you understand?”Zolt. Gay. Player. Predator. Fetish: Straight guysLeo. Straight. Biker. Prey. Fetish: True loveZolt knows what he wants from life--cold hard cash so that he can enjoy an early retirement in the Carribean as rent boys serve him drinks on the beach. Meanwhile, he’s got his pawn shop as a front for illegal operations, and a baseball bat to deal with troublemakers.When it comes to men, Zolt loves the chase, and his favorite, most elusive prey is curious straight guys. He goes out of his way to seduce and devour them. If he can be their first, all the better.His next mark? A biker. And not just any. An outlaw, Leo Heller.Leo’s got his future all figured out. A wife, two to four kids, maybe a dog. If love was as easy as others make it seem, Leo would have been married already.A string of failed relationships leads him to the one person he shouldn’t be crushing on, shouldn’t be admiring, and most definitely shouldn’t be touching. Because a man like Zolt Andorai won’t give Leo the family he wants. Hell, Zolt doesn’t even do boyfriends. But what Zolt does offer is no-strings-attached experimentation, and Leo is only human.After all, if no one ever finds out Leo’s secret, it’s as if it doesn’t exist.One kiss leads to another, lines blur, and before Leo knows it, he’s in over his head.In love.Helpless.POSSIBLE SPOILERS:Themes: Outlaw motorcycle club, organized crime, homophobia, hurt/comfort, forced proximity, coming out, seduction, forbidden attraction, first love, greed, player, family tiesGenre: M/M romance, suspenseLength: ~110,000 words (Standalone novel)Steam level: Scorching hot, emotional, explicit scenesWARNING: This story contains scenes of violence, offensive language and morally ambiguous characters.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Gay For You",
    "LGBT",
    "Crime",
    "Dark"
  ],
  "author": "K.A. Merikan",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/43908251-straight-as-a-wheel"
}