{
  "title": "Fifty-One: Provenance",
  "description": "\"Like the best of Heinlein.\" Joe Crubagh\"A good mixture of sci-fi thriller and paranormal romance...\" Sara Miller\"I found an exciting, engaging science fiction book that I ripped through in one night.\" Kenneth MooreIt started as a short scene, written for his wife on Valentines, and has evolved into a mysterious, erotic, action packed adventure. The original risqué and romantic remains, then erupts into a fast paced story that will leave you searching for a sequel.***::decrypted communication intercepted near Groom Lake, my name is Kate. I was in the CIA, but now I'm owned by the Men in Black. They own my boyfriend too. Well I guess you could call him my boyfriend. What can I say, it's a complicated relationship.He is beautiful, I love him to death, and he is half alien. That's okay, I'll give you a second to absorb that information. I mean you wouldn't know it by looking at him. He doesn't have antennae or horns growing out of his head. He does have some unusual, interesting, even challenging physical attributes, but like I said, you wouldn't know it to look at him.Life has been a bit of a whirlwind since we met. I've learned a lot of things I wish I could unlearn. Like who really controls things on the earth and how dangerous it can be for those who find out. My life expectancy has probably decreased exponentially since Adam and I met, but I wouldn't trade the time we've had for anything in this world. Or any other world for that matter.Adam doesn't have much of a choice, and since I love him neither do I. Fighting back is what he was created to do. I'm going to do everything I can to make sure he lives through it, and hope I do too.***\"It's just the right balance of sci-fi, sex, action, sex, humor & oh yeah...sex.\"\"Fifty One is a very enjoyable, fun and thought-provoking adventure...\"",
  "genres": [],
  "author": "Pax Rolfe",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/12394580-fifty-one"
}