{
  "title": "The Omnidoxy",
  "description": "The Omnidoxy, solely authored by the philosopher Cometan, is the founding treatise over one million words in total length forming the conceptual, orientational, and structural foundations of Astronism. Partitioned into twelve disquisitions, each of which are further divided into hundreds of discourses, which are themselves titled by those which are known as rubrals, The Omnidoxy has been codified according to a unique writing structure known as insentence. The Omnidoxy not only forms the foundations of Astronism, but it remains the primary contributor to the wider Astronic philosophical tradition which encompasses the philosophy of Astronism. Introducing brand new philosophical concepts such as cosmocentricity, reascensionism, transcensionism, and sentientism, The Omnidoxy remains the principal signifier of a new era in philosophy. The Omnidoxy births hundreds of new belief orientations, schools of thought, neologisms, disciplines of study, theories, and concepts which, when combined and considered collectively, have formed the basis of Astronism. The authorship of The Omnidoxy rests with the single individual philosopher, Cometan, which is the mononym for the author of The Original Jesse Millette Series who began writing The Omnidoxy at the age of seventeen driven by what he terms as personal inspiration. The historical origination of The Omnidoxy rests in its authorship by Brandon Taylorian during early 21st century England, specifically in the northern county of Lancashire. Like in all textual criticism, the timing and location of the codification of The Omnidoxy is integral to understanding why and how it was written, especially by considering the influential factors impacting Taylorian during his construction of the text, particularly the cultural, political, religious, and social contexts of Taylorian's personal life and of wider society at the time. This forms an important branch of study within omnidoxicology known as omnidoxical criticism, or omnidoxical exegesis in which scholars study and investigate The Omnidoxy in order to discern conclusive judgements inspired by how, where, why, by whom, for whom, and in what circumstances The Omnidoxy was written.",
  "genres": [],
  "author": "Cometan",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/43919864-the-omnidoxy"
}