{
  "title": "Connected in Code",
  "description": "A small job. That's all it's supposed to be.Get in. Get the information. Get out unseen.Simple, right? Not this time.Hacker. Thief. Rebel. Lethal. At least that's what people say about me and they're right.Holding other's lives in the palm of my hand is an incredible power. One necessary to keep order and control.The walls around me are built strong, but not strong enough for one man. A man who was a friend then turned into a lover. Someone I should've never tangled my life with.Wrong Way is a member of the Ravage Motorcycle Club Rebellion chapter, known throughout the town as ruthless, all alpha bad boy biker and my next job. Therefore, strictly forbidden, but especially so now because we're enemies.He's arrogant, brash and keen, knowledgeable about everything around him. Flying under his radar isn't easy. Therefore, hacking the MC's system takes finesse.If my client doesn't get the information, my best friend will die. If I succeed and leave even a single trace of a digital footprint, Wrong Way will find it and with their family loyalty, the Ravage MC will kill me.Every way, I run through the scenario, someone is going to lose. This time the power is out of my control and I have to find some way to stop it. Praise for the Rebellion Series:~ ... sexy, intense, suspenseful, dangerous, twisted, gritty, raw, passionate, undeniable, and completely unforgettable ... -Brianna~ ... angst, heartache, secrets, action, some really hot scenes, and enough suspense to keep you right on the edge of your seat wondering what will happen next. -Janna~ ... it had suspense, drama, action and twists. The book will keep you on the edge of your seat. The connection and chemistry between the couple was strong and sexy. -Dani~Ravage Rebellion had a real Kristen Ashley feel to me. -PGsky~Oh how I wish I could give this book more than 5 stars! This book left my emotions raw and a book hangover that just won't quit! -Stephanie--Ravage MC Series reading order:Ravage Me (Cruz & Princess)Seduce Me (GT & Casey)Consume Me (Tug & Blaze)Inflame Me (Rhys & Tanner)Captivate Me (Buzz & Bella - Breaker & Shania)Ride with Me (co-written with Chelsea Camaron)The Ravage MC Novella Collection (Satisfy Me, Rattle Me, Final Ravage MC Epilogue)Ravage MC Bound Series (Second Generation) reading order:Bound by Family (Cooper & Bristyl)Bound by Desire (Deke & Rylie)Bound by Vengeance (Ryker & Austyn)Bound by Affliction (Green & Leah)Bound by Destiny (Emery & Jacks & Micah)Bound by Wreckage (Nox & Carsyn)Bound by Destruction (Coming Soon)Ravage MC Rebellion Series reading order:Connected in Pain (Crow & Rylynn)Fueled in Fire (Crow & Rylynn)Sealed in Strength (Crow & Rylynn)&lt",
  "genres": [
    "Romance",
    "Contemporary",
    "Audiobook",
    "Contemporary Romance",
    "Erotica",
    "Suspense"
  ],
  "author": "Ryan Michele",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/43919514-connected-in-code"
}