{
  "title": "The King of the Internet",
  "description": "This contemporary novel contains both humorous and tragic parts as it follows the exploits of a war veteran-writer, who finds some relief from September 11th and Gulf War guilt by becoming a masked dating guru. At times, it lampoons institutions such as Hollywood, U.S. politics, relationships, sex, and marriage. Then the narrative tackles matters like dealing with loss, guilt, and intense political divisiveness in a more serious vein. Cam and Greta Williams married young in a New Jersey town. They get divorced but reunite years later by living in the same house with their three teens. Mostly without the kids knowing, they maintain outside relationships, getting into sticky situations in the process.Cam, a writer who served in the Gulf War, carries guilt for years not only about his war experiences, but from leaving some firefighters who die in the World Trade Center during the 2001 terrorist attacks. He has a recurring nightmare and loses his job, but later writes a novel about the lives of the firefighters that becomes a movie. While that helps him financially and emotionally, he develops a dating system and becomes a masked, underground relationship guru called \"The King of the Internet.\" The crowd worshiping makes him feel alive and forget his guilt in a way nothing else has.Greta, an advertising executive, watches after the kids more and gets jealous of Cam being out late. She sometimes brings dates home late when she thinks the kids are sleeping. She meets Cam's agent and eventually marries him. Cam falls for a woman, but tragedy strikes. He decides to end the guru gig. While unmasking himself, he learns about a potential plot against the U.S. president, who he finds disgusting. Will he succumb to bitter inertia or risk his life for someone he personally considers repulsive? His decision has far-reaching consequences not just for the soul of the country and the world, but for his own redemption.",
  "genres": [],
  "author": "Jackson Thoreau",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/43926047-the-king-of-the-internet"
}