{
  "title": "Mission: Her Defense",
  "description": "One former special forces Marine. One tall, handsome police detective who pushes all her buttons. One dangerous investigation that forces them to work together.  Blair Mason is badass to the bone. She’s no stranger to loss and barely survived the mission that ended her military career. Now, as part of Team 52, she never shies away from a fight to ensure pieces of powerful ancient technology don’t fall into the wrong hands. Unfortunately, she’s often forced to “liaise” with the team’s contact at the Las Vegas Metropolitan Police. The tall, hard-bodied detective ignites her temper quicker than any man she’s ever known…and after a terrible massacre, she’s horrified to find that she and MacKade are being ordered to work together.  Detective Luke MacKade was born a protector. He takes care of his family, and as a dedicated homicide detective, he protects his city. He is less thrilled with his job of cleaning up after Team 52 after they tear through Vegas on a mission. Blair is a woman who sets him off just by breathing, but even he can’t deny the powerful attraction he feels to her strength and skill. When several cursed samurai swords are stolen in a bloody attack, it is up to Luke and Blair to get them back…before more blood is shed.  But others are after the swords and their hidden powers. As Luke and Blair’s dangerous investigation intensifies, they face danger at every turn. Luke battles his intense need to protect the woman he’s falling for, a woman who neither wants or needs his protection. But as their desire burns white-hot, Luke will learn that the toughest defenses are the ones around Blair’s heart.  Includes a preview of Undiscovered (Treasure Hunter Security #1)  Team 52 Mission: Her Protection (Lachlan and Rowan’s story) Mission: Her Rescue (Seth and January’ story) Mission: Her Security (Smith and Kinsey’s story) Mission: Her Defense (Blair and Luke’s story) Mission: Her Safety (Coming soon)  The Team 52 Romantic Suspense Series: Action Adventure Romance, Romantic Suspense, Military Romance, Contemporary Romance",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Military Fiction",
    "Contemporary",
    "Paranormal",
    "Action",
    "Contemporary Romance"
  ],
  "author": "Anna Hackett",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/43923128-mission"
}