{
  "title": "Muggles and Magic: An Unofficial Guide to J.K. Rowling and the Harry Potter Phenomenon",
  "description": "\"Muggles and Magic\" is the first general interest book, resource guide, and reference work for Rowling's millions of fans. Organized in six sections appendices, this 400-page book is a treasure trove of information and trivia about Harry Potter, Rowling's most famous literary creation, and the phenomenon that surrounds him. The Real World of J.K. Rowling provides an in-depth look at Rowling herself: a chronology, a biography, a guide to Rowling's England and Scotland, FAQs, a concordance, Harry Potter illustrators, Rowling-related charities, a Harry Potter convention, and more. A Writer's Life is jam-packed with information for aspiring word wizards, with time-tested advice on getting your book published, the craft of writing, cafes to fuel your creativity, Harry Potter and censorship, and more.Harry Potter-Screen Magic is an in-depth look at the two movie adaptations, with reviews, cast listings, notable quotes by the cast, and more.Books offers a book-by-book look at the five Potter novels plus other official, and unofficial, books. A fictional concordance for Muggles and a trivia quiz round out this in-depth section.Harry Potter Merchandise looks at the numerous tie-in products licensed by Warner Bros., from action figures to wizard cards.Harry Potter Websites discussess the best that the World Wide Web offers, with capsule reviews, screenshots, and addresses.The Appendices provide detailed information on Rowling's book editions in the U.S. and the U.K., a list of available films and DVDs, and key collectibles with prices.Each section features dozens of quotes by and about J.K. Rowling.Packed with articles, profiles, synopses, and sidebars, \"Muggles and Magic\" is profusely illustrated with photographys and illustrations, including a special 16-page color photo album with little-seen photos of Rowling and England.",
  "genres": [
    "Nonfiction",
    "Reference",
    "Biography",
    "Books About Books",
    "Media Tie In",
    "Childrens"
  ],
  "author": "George Beahm",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/439222.Muggles_and_Magic"
}