{
  "title": "The Handyman's History",
  "description": "It's a new beginning for Ed and Rick.Handyman Ed Stephens and his partner, Rick Benton have begun their new life as the masters of Penfield Manor. After the first big event in their new home, Rick’s sister’s wedding, they hope for a long stretch of peace of quiet.Instead, Ed and Rick both find themselves involved in new activities. As Rick's boss, Realtor Vince Cummings, becomes aware of the opportunities available in the sudden expansion of Porterfield, he and Rick become guiding forces for a major redevelopment project. Meanwhile, Ed's innocent suggestions regarding the revival of a local festival lead him to become a member of the Porterfield Days Association, and the acceptance of additional responsibilities.It's Rick's discovery of a tombstone in a disused town cemetery that sparks Ed's curiosity about the background of his father's family. Ed begins to question the relationship he had with his deceased father and hopes to learn some of the Stephens family secrets will enable him to make peace with his unresolved feelings.The usual cast of suspects is back to both enrich and complicate Ed's His sharp-tongued but supportive mother Norma, his sister Laurie, and housekeeper Effie Maude, who maintains her position at Penfield Manor, and provides amusement for Ed and Rick with her observations and pronouncements. Their best bud Gordy is on the scene as well, struggling to build a relationship in the early years of AIDS. Even Ed gets a taste of the hostility becoming more common as fear of the disease spreads.As Ed deals with the realities of being a gay man in a small town in 1985, he unexpectedly finds support from two unlikely sources, a visually impaired client, and a clergyman new to the town. THE HANDYMAN'S HISTORY, with its soundtrack of classic oldies, will take its readers both forward and backward in the continuing saga of Ed and Rick, as their relationship strengthens, matures, and endures.",
  "genres": [],
  "author": "Nick Poff",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/43974570-the-handyman-s-history"
}