{
  "title": "Griots: A Sword and Soul Anthology",
  "description": "Magic. Myth. Warfare. Wonder. Beauty. Bravery. Glamour. Gore. Sorcery. Sensuality. These and many more elements of fantasy await you in the pages of Griots, which brings you the latest stories of the new genre called Sword and Soul.The tales told in Griots are the annals of the Africa that was, as well as Africas that never were, may have been, or should have been. They are the legends of a continent and people emerging from shadows thrust upon them in the past. They are the sagas sung by the modern heirs of the African story-tellers known by many names - including griots.Here, you will meet mighty warriors, seductive sorceresses, ambitious monarchs, and cunning courtesans. Here, you will journey through the vast variety of settings Africa offers, and inspires. Here, you will savor what the writings of the modern-day griots have to offer: journeys through limitless vistas of the imagination, with a touch of color and a taste of soul. Contents:The Soul in the Sword • essay by Charles R. SaundersA Gathering at the Meeting Tree • essay by Milton J. DavisMrembo Aliyenaswa (Captured Beauty) • shortfiction by Milton J. Davis [as by Milton Davis ]Awakening • shortfiction by Valjeanne JeffersLost Son • shortfiction by Maurice BroaddusIn the Wake of Mist • shortfiction by Kirk A. JohnsonSkin Magic • shortfiction by Djeli A. ClarkThe Demon in the Wall • shortfiction by Stafford L. BattleThe Belly of the Crocodile • shortfiction by Minister FaustChangeling • shortfiction by Carole McDonnellThe General's Daughter • shortfiction by Anthony Nana KwamuSekadi's Koan • shortfiction by Geoffrey ThorneThe Queen, the Demon and the Mercenary • shortfiction by Ronald T. JonesIcewitch • shortfiction by Rebecca McFarland KyleThe Leopard Walks Alone • shortfiction by Melvin CarterThe Three-Faced One • shortfiction by Charles R. SaundersGriots Bios • essay by uncredited",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Sword and Sorcery",
    "Anthologies",
    "Fiction",
    "African Literature",
    "Science Fiction"
  ],
  "author": "Milton J. Davis",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/12394951-griots"
}