{
  "title": "The Pearl Brooch",
  "description": "This brooch saga begins July 14, 1789, the day French revolutionaries stormed the Bastille!  \n  And America’s Ambassador to France, Thomas Jefferson, comes to Sophia Orsini's rescue...\nSophia Orsini, a time-traveling Italian artist, believes she understands how the pearl brooch magic works, but when it abandons her in the middle of an 18th century Paris mob, she realizes she was wrong. America’s Ambassador to France, Thomas Jefferson, comes to Sophia’s rescue, but that meeting leads her down a path she otherwise wouldn’t have chosen.Kevin Fraser and his pregnant wife, JL, fly in his Cessna to enjoy a weekend at Mallory Plantation in Virginia, but wind shear turns Kevin's textbook landing into a disaster and the plane through a chain-link fence, injuring JL and sending her into premature labor. Pete Parrino, VP of Global Security for MacKlenna Corporation, is in Florence on business when he stumbles upon Sophia Orsini’s art studio. Sophia is the love of Pete’s life, and he hasn’t seen or heard from her in twenty years. When he discovers she hasn’t returned from her annual two-week holiday, he breaks into her studio and finds evidence that she’s a time traveler.When the clan discovers where she is, Pete, Matt Kelly, and Jack Mallory must decide how much of America’s history they’re willing to change in order to bring Sophia back to the future. ˃˃˃ The Celtic Brooch Series THE RUBY BROOCH (Book 1): Time Travel Romance - Oregon Trail 1852.THE LAST MACKLENNA (Book 2): Contemporary Romance.THE SAPPHIRE BROOCH (Book 3): Time Travel Romance - Civil War, 1864-1865.THE EMERALD BROOCH (Book 4): Time Travel Romance - World War II, London, June 1944.THE BROKEN BROOCH (Book 5): Contemporary Romance.THE THREE BROOCHES (Book 6): Time Travel Romance - Napa and San Francisco, 1881.THE DIAMOND BROOCH (Book 7): Time Travel Romance - New York City, 1909.THE AMBER BROOCH (Book 8): Time Travel Romance - Colorado, 1878.\nScroll up and grab a copy today.",
  "genres": [
    "Time Travel",
    "Romance",
    "Audiobook",
    "Historical Romance",
    "Historical Fiction",
    "Fantasy",
    "Fiction"
  ],
  "author": "Katherine Lowry Logan",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/43985511-the-pearl-brooch"
}