{
  "title": "Edison",
  "description": "From Pulitzer Prize-winning author Edmund Morris comes a revelatory new biography of Thomas Alva Edison, the most prolific genius in American history.Although Thomas Alva Edison was the most famous American of his time, and remains an international name today, he is mostly remembered only for the gift of universal electric light. His invention of the first practical incandescent lamp 140 years ago so dazzled the world--already reeling from his invention of the phonograph and dozens of other revolutionary devices--that it cast a shadow over his later achievements. In all, this near-deaf genius (\"I haven't heard a bird sing since I was twelve years old\") patented 1,093 inventions, not including others, such as the X-ray fluoroscope, that he left unlicensed for the benefit of medicine.One of the achievements of this staggering new biography, the first major life of Edison in more than twenty years, is that it portrays the unknown Edison--the philosopher, the futurist, the chemist, the botanist, the wartime defense adviser, the founder of nearly 250 companies--as fully as it deconstructs the Edison of mythological memory. Edmund Morris, winner of the Pulitzer Prize and the National Book Award, brings to the task all the interpretive acuity and literary elegance that distinguished his previous biographies of Theodore Roosevelt, Ronald Reagan, and Ludwig van Beethoven. A trained musician, Morris is especially well equipped to recount Edison's fifty-year obsession with recording technology and his pioneering advances in the synchronization of movies and sound. Morris sweeps aside conspiratorial theories positing an enmity between Edison and Nikola Tesla and presents proof of their mutually admiring, if wary, relationship.Enlightened by seven years of research among the five million pages of original documents preserved in Edison's huge laboratory at West Orange, New Jersey, and privileged access to family papers still held in trust, Morris is also able to bring his subject to life on the page--the adored yet autocratic and often neglectful husband of two wives and father of six children. If the great man who emerges from it is less a sentimental hero than an overwhelming force of nature, driven onward by compulsive creativity, then Edison is at last getting his biographical due.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Science",
    "Business",
    "American History",
    "Biography Memoir"
  ],
  "author": "Edmund Morris",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/43984882-edison"
}