{
  "title": "Bridge of Clay",
  "description": "From the author of the no.1 New York Times bestselling novel The Book Thief .\"An amazing talent in Australian literature\" Sunday TelegraphThe Dunbar boys bring each other up in a house run by their own rules. A family of ramshackle tragedy - their mother is dead, their father has fled - they love and fight, and learn to reckon with the adult world.It is Clay, the quiet one, who will build a bridge; for his family, for his past, for his sins. He builds a bridge to transcend humanness. To survive.A miracle and nothing less.WINNER INDIE BOOK AWARD FOR FICTION 2019SHORTLISTED FOR THE ABIA BOOK OF THE YEAR 2019LONGLISTED FOR THE DUBLIN LITERARY AWARD 2020PRAISE FOR BRIDGE OF CLAY\"I am pleased to recommend...Markus Zusak's extraordinary novel Bridge of Clay , which I suspect I'll reread many times. It's a sprawling, challenging, and endlessly rewarding book. But it also has the raw and real and unironized emotion that courses through all of Zusak's books. I'm in awe of him.\" John Green, author of The Fault in Our Stars and Looking for Alaska\"Exquisitely written multigenerational family saga...With heft and historical scope, Zusak creates a sensitively rendered tale of loss, grief, and guilt's manifestations.\" Publishers Weekly\"An evocative, compassionate and exquisitely composed coming-of-age story about family, love, tragedy and forgiveness. Zusak's prose is astute, witty, exquisitely rhythmic, and utterly engrossing.\" Australian Books+Publishing Magazine\"Zusak is a writer of extraordinary empathy and he excels in his understanding of adolescent boys...in his portrayal of the gently traumatised Clay he has created a memorable character to savour... in Bridge of Clay , as earlier in The Book Thief , Zusak has succeeded in creating a story so vibrant and so real that the reader feels enveloped by it.\" The Australian\"This vast novel is a feast of language and irony. It is such a compassionate book that it is hard not to fall a bit in love with it yourself. Bridge of Clay shares with Zusak's The Book Thief an underlying sense of the possibility of joy and human dignity even in dehumanising situations.\" Sydney Morning Herald\"A complex, big-hearted, multi-generational Australian epic, highly evocative and rich in idiom that sprawls across 580 pages, much in the manner of Colleen McCullough, or Tim Winton's Cloudstreet.\" Good Weekend Magazine\"In 2005, the Australian writer dazzled readers and secured a perch on bestseller lists with The Book Thief ...this book too is a stunner. Devastating, demanding and deeply moving, Bridge of Clay unspools like a kind of magic act in reverse, with feats of narrative legerdemain concealed by misdirection that all make sense only when the elements of the trick are finally laid out. In words that seem to ache with emotion, or perhaps, more aptly, with the suppression of it, Mr. Zusak moves us in and out of time. Grief and sacrifice lie at the heart of things, and we can feel it through Mr. Zusak's writing even before we understand the story's real contours.\" Wall Street Journal\"What truly stands out about Bridge of Clay is the intensity of the prose - the potency of the heartbreak. The depth of grief and loss is so palpable you can all but feel the blood, sweat, and tears that went into crafting the story.\" Entertainment Weekly\"As with The Book Thief , much of the appeal of the novel lies in Zusak's heartfelt love for his characters and for language. The book sings in short musical sentences like poetry, and words stop you in your tracks.\" Herald Sun",
  "genres": [
    "Fiction",
    "Young Adult",
    "Contemporary",
    "Book Club",
    "Historical Fiction",
    "Audiobook",
    "Australia"
  ],
  "author": "Markus Zusak",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/44007279-bridge-of-clay"
}