{
  "title": "Biting Time",
  "description": "Two Tabasco Sauce Hot Werewolf Shifters, One Curvy, Sexy Woman   Dr. Celestia Richard’s rock star husband hasn’t made love to her in months. Since she’s gained weight, he no longer finds her desirable. When her marriage hits its lowest point, she kicks him out and files for divorce. Afterwards, Celestia decides she wants to explore a fantasy she’s always had. Jaded by her profession, she desires something other than conventional monogamy. As a relationship counselor, she advises patients with broken hearts. They typically come to her upon discovering their spouse is having an affair. If the husband is faithful, the wife isn’t and vice versa. She secretly wonders if monogamy is even possible.   She’s heard all the rumors about sexy shifters and their desire for full-figured women. Ready to discover them for herself, upon the urging of her beautiful cousin, Nita Islas, she visits Gerri Wilder at the Paranormal Dating Agency. The matchmaker extraordinaire introduces her to two Tabasco Sauce Hot shifters. Bronson Young is the billionaire owner of the wildly successful Sonic Beats headphones. Drake Preston is a no-nonsense police detective with a soft heart. Both are from the Silver Moon Werewolf Pack. The shifters are searching for a mate they can share for life.   When her husband comes crawling back, Celestia must decide if she’ll mend her marriage or choose Bronson and Drake, who’ve introduced her to a world of hot sex and fantasies fulfilled. But when Celestia goes missing, the shifters will have to use their super powers to unravel the mystery. With no shortage of suspects and a puzzle without any obvious pieces, will the shifters have to band with Celestia’s husband to solve it?  Come along for a ride on a Hot Shifter Ménage Romance Where You'll Find:  Two Hot Heroes -- These guys are TSH -- Tabasco Sauce Hot! A Curvy, Sexy Female Looking for Love & A Happily Ever After If you love to indulge in over-the-top heroes who always save the day and get romantically swept away in an insta-love romance -- grab some chocolates, wrap yourself in cashmere, and get swept away by love.",
  "genres": [],
  "author": "Rose Smith",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/44009755-biting-time"
}