{
  "title": "Horsepower & Medicine",
  "description": "Yirah Green has been working in a hidden arroyo on the Kikimi rez, secretly rebuilding an old dirt bike that belonged to her late Uncle Jimmy. Her best friend, Santana Corn Eyes, knows about the project, as does a ghost who visits her, silently urging her on. Yirah says the spirit is that of her departed uncle, but Santana is worried. Why would a ghost be crossing over to this world? Maybe it’s not such a good idea to get a a dead man’s motorbike running again. And if Yirah does succeed, will she be patient enough to learn how to safely handle it?   Set in the Painted Hills near Santo del Vado Viejo, this original short story is loosely connected to de Lint’s acclaimed novel, The Wind in His Heart.  “One of the most original fantasy writers currently working.”—Booklist  “Charles de Lint is the modern master of urban fantasy. Folktale, myth, fairy tale, dreams, urban legend—all of it adds up to pure magic in de Lint’s vivid, original world. No one does it better.”—Alice Hoffman  “De Lint creates an entirely organic mythology that seems as real as the folklore from which it draws.”—Publishers Weekly, starred review  “De Lint is a romantic; he believes in the great things, faith, hope, and charity (especially if love is included in that last), but he also believes in the power of magic—or at least the magic of fiction—to open our eyes to a larger world.”—Edmonton Journal  “It’s hard not to feel encouraged to be a better person after reading a book by Ottawa’s Charles de Lint.”—Halifax Chronicle Herald  “If Ottawa-area author Charles de Lint didn't create the contemporary fantasy, he certainly defined it. …writer-musician-artist-folklorist de Lint has lifted our accepted reality and tipped it just enough sideways to show the possibilities that lie beneath the surface… Unlike most fantasy writers who deal with battles between ultimate good and evil, de Lint concentrates on smaller, very personal conflicts. Perhaps this is what makes him accessible to the non-fantasy audience as well as the hard-core fans. Perhaps it's just damned fine writing.” —Quill & Quire  “In de Lint's capable hands, modern fantasy becomes something other than escapism. It becomes folk song, the stuff of urban myth.” ―The Phoenix Gazette",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magical Realism",
    "Short Stories",
    "Urban Fantasy"
  ],
  "author": "Charles de Lint",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/44008034-horsepower-medicine"
}