{
  "title": "Ama Dios",
  "description": "Ama Dios, 4 AoL Consciousness Books Combined.Applying Quantum Physics to manifestation of Consciousness researching Ancient Psychological aspects of Alchemy & Chinese, Greek, Hindu Philosophers, the compilation of 9 AoL books: 2 fiction and 7 non-fiction explore Symbols, Mysticism, Arts, Creativity, Consciousness & Beauty:1. A-Ma by Nataša Pantovič, Historical Fiction set in 17th Century China. A Mystical Journey of Portuguese, Chinese Consciousness Researchers, set in the Age of Enlightenment during the Dutch attack to Macao in 1622, the Reform of Chinese Calendar in 1630-s, with Father Adam Schall's appointment to the Chinese Board of Mathematicians during 1650-s, the witch hunt of a Shaman's African Goddess incarnated in China as Ama and her father Ottavio, a Portuguese Alchemist. Size: 244 pg, 6x9”2. Tree of Life with Spiritual Poetry. A Novel by Nataša Pantović is set in Findhorn, UK as a Journey into the Field of Dreams that In various religious interpretations, within myths, and as a mystical concept represents the inter-connection of all life on our beautiful planet. The story becomes a true adoption story venturing into Africa, Ethiopia, Kenia, within the magic of four elements, four directions, four stages of Life. Size: 264 pg 6\" x 9” 3. Conscious Creativity: Mindfulness Meditations by Nuit, Developing both Left and Right Brain could be essential for Creative Thinkers of our Future. To purify mind we start with the consciousness that energy follows thoughts and we use Quantum Physics Logic within Consciousness Research of Taoism following Yin and Yang Universe Manifestations to enter Creative Flow. Year: 2017 Size: 96 pages, 6\" x 9\"4. Spiritual Symbols with Their Meaning by Nuit. Our Holographic Universe resonates with the most amazing precision creating Realities of our Choice. Using the sound (Aum, Amin, Allah) resonance to mediate, today & in the past our artists use symbols to enter higher states of consciousness. From Neolithic wisdom of Ancient Temples' carvings of spirals, Pythagoras numbers, Leonardo da Vinci's paintings, ancient wisdom of magic, mysticism, occult travels to our worlds giving us conscious / subconscious gift from Greek Philosophers, Neolithic Temples Goddesses, Alchemy Size 152 pg 6\" x 9\"",
  "genres": [
    "Philosophy",
    "Spirituality",
    "Adult"
  ],
  "author": "Nataša Pantović",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/44015366-ama-dios"
}