{
  "title": "Our History Has Always Been Contraband: In Defense of Black Studies",
  "description": "\"The centuries-long attack on Black history represents a strike against our very worth, brilliance, and value. We’re ready to fight back. And when we fight, we win.\" —Colin KaepernickSince its founding as a discipline, Black Studies has been under relentless attack by social and political forces seeking to discredit and neutralize it.  Our History Has Always Been Contraband  was born out of an urgent need to respond to the latest efforts to remove content from an AP African American Studies course being piloted in high schools across the United States. Edited by Colin Kaepernick, Robin D. G. Kelley, and Keeanga-Yamahtta Taylor,  Our History Has Always Been Contraband  brings together canonical texts and authors in Black Studies, including those excised from or not included in the AP curriculum.Featuring writings David Walker, Frederick Douglass, Anna Julia Cooper, Zora Neale Hurston, W. E. B. Du Bois, C. L. R. James, James Baldwin, June Jordan, Angela Y. Davis, Robert Allen, Barbara Smith, Toni Cade Bambara, bell hooks, Barbara Christian, Patricia Hill Collins, Cathy J. Cohen, Kimberlé Crenshaw, Saidiya Hartman, Khalil Gibran Muhammad, and many others.Our History Has Always Been Contraband  excerpts readings that cut across and between literature, political theory, law, psychology, sociology, gender and sexuality studies, queer and feminist theory, and history. This volume also includes original essays by editors Kaepernick, Kelley, and Taylor, elucidating how we got here, and pieces by Brea Baker, Marlon Williams-Clark, and Roderick A. Ferguson detailing how we can fight back.To read  Our History Has Always Been Contraband  is to be an outlaw for liberation. These writings illuminate the ways we can collectively work toward freedom for all—through abolition, feminism, racial justice, economic empowerment, self-determination, desegregation, decolonization, reparations, queer liberation, cultural and artistic expression, and beyond.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "Essays",
    "Social Justice",
    "Education"
  ],
  "author": "Colin Kaepernick",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/123957806-our-history-has-always-been-contraband"
}