{
  "title": "Subramanya Upanishad - In Tamil and English",
  "description": "ஸ்ரீ சுப்ரமண்ய உபநிஷத், தமிழிலும் ஆங்கிலத்திலும் - முதல் முறையாக இணை மொழிபெயர்ப்புடன்.ஓம்காரத்தைப் பற்றி மூலத்திலிருந்து தெரிந்துகொள்ளுங்கள். அதன் மகிமையினால் கர்மம் கரைந்து பரமானந்தம் பிறக்கட்டும்.Sri Subramanya Upanishad, in Tamil and English - for the first time with parallel translations.Learn about Om from the very source. May you conquer Karma and attain true happiness with this knowledge.ॐபுத்தகத்திலிருந்து ஒரு சிறிய பகுதி - A small section from the book. . .போட்டி விவரங்கள் கிடைத்தபின் முருகனும் கணேசனும் விடைபெற்று தத்தம் அறைகளுக்குச் சென்று வெற்றி பெற புத்திசாலித்தனமான திட்டங்களை வகுக்க முயன்றனர்.இவர்களில் முருகன், உலகை வென்றுக்கொண்டே யோசித்தால் நேரத்தை சேமிக்கலாமே என நினைத்தான்.ஆகையால், உடனே வெளியில் ஓடி தனது நம்பகமான மயில் மீது ஏறிக்கொண்டான்.விண்ணை நோக்கிப் பறந்தான் மண்ணை வெல்ல.எப்படியும், உலகை வெல்வதை விடச் சிறந்த திட்டம் ஒன்று இருந்து அதை அவன் காணவந்தால் உடனே திரும்பி வந்து திட்டத்தை மாற்றிக்கொள்ளலாமே என்று நினைத்தான்.சரிதான்.ஆனால் ஓய்வற்று உலகை வென்றுக்கொண்டிருந்ததால் அதைத்தவிர வேறொன்றைப் பற்றியும் அவனுக்கு சிந்திக்க நேரம் கிடைக்கவில்லை. அதை விட சிறந்த திட்டத்தையும் காணவில்லை.ஆகையால் முருகன் உலகை மட்டும்தான் வென்றான்.. . .[ பக்கம் 13-14 ]ॐ. . .Having got their assignments, Muruga and Ganesha retreated to their quarters to ponder and devise good and original strategies to win the contest.Muruga decided that if he were to think of a good strategy while he was already conquering the world, he could save a lot of time.He rushed out and got on his trusted peacock. And away he flew into the sky to conquer the world. After all, he thought, if there was a better plan than conquering the world and he happened to find it, he figured he could always return and change plans at that time.Fair enough. But because he was busy conquering the world, he never got a chance to think about anything else. Therefore, he didn't find a better plan.So Muruga only ended up conquering the world.. . .[ page 74-75 ]ॐஓம்காரமே வெளியுலகம்ஓம்காரமே உள்ளுலகம்ஓம்காரமே ஆன்மாஓம்காரமே பரமானந்தம்சச்சித்தானந்தம்ॐOm is the outside worldOm is the inside worldOm is the SelfOm is blissBeing, Truth and Blissॐ",
  "genres": [],
  "author": "Om - ஓம் - ॐ",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/44017942-subramanya-upanishad---in-tamil-and-english"
}