{
  "title": "Beneath the Roots",
  "description": "“Beneath the Roots has a dreamlike quality that reminds me of some early 20th century fantasy writers I used to read—William Morris and Lord Dunsany, to name two.” -Allister ThompsonMerisande is foraging near a gorge when she chances upon a winged fae prince. Gandel is from Thorsault, a hidden kingdom located across the gorge and beyond a cursed wood. Having run out of stories to placate the trees, he crossed the gorge out of desperation. In return for Merisande’s stories, he gives her a summoning stone she can use to call him if she ever needs help.Nine years later, Merisande is happily unwed, helping her father care for her mentally disabled brother, Jan. Her life changes when Jan’s obsession with a neighbor’s bull leads him to unlock its pen. The bull charges, causing damage to a lord’s flock. The lord sends her father a letter, offering to set aside the damages if Merisande will marry his son, Sir Avry.Despite Avry's deep love for Merisande, she despises him. Years ago, he and his brother attacked Jan when they found him in a tree on their property. The memory of that violence has stayed with her, and she decides it would be best to remove herself from the knight’s reach, at least for a while. Merisande summons Prince Gandel, meets him at the ravine and begs him to take her to his land, Thorsault.But the fae kingdom turns out to be a dreadful place. The only humans living there are mute, sickly slaves who labor all day for their fae masters. Though Merisande is under the protection of Prince Gandel, she does not feel safe. Then, by chance, she encounters Sir Avry, who has followed her into the kingdom. Avry had nothing to do with the letter his father sent and refuses to marry a woman against her will. Merisande realizes that she may have prejudged him. But this problem is greatly overshadowed by much bigger ones: Gandel is unable persuade his father to free Avry, and the slaves are dying from a terrible plague. With no one to replace them, the fae king prepares to harvest more, and his target is none other than Merisande and Avry’s own people. Can they escape and warn their country before the unimaginable happens?",
  "genres": [
    "Fantasy",
    "Audiobook",
    "Adult",
    "Fae",
    "Fiction",
    "Epic Fantasy",
    "Young Adult"
  ],
  "author": "W.K. Greyling",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/44018292-beneath-the-roots"
}