{
  "title": "The Lady and the Highwayman",
  "description": "Elizabeth Black is the headmistress of a girls school in 1865s Victorian London. She is also a well-respected author of silver-fork novels, stories written both for and about the upper-class ladies of Victorian society. But by night, she writes very different kinds of stories--the Penny Dreadfuls that are all the rage among the working-class men. Under the pseudonym Charles King, Elizabeth has written about dashing heroes fighting supernatural threats, intelligent detectives solving grisly murders, and dangerous outlaws romancing helpless women. They contain all the adventure and mystery that her real life lacks. Fletcher Walker began life as a street urchin, but is now the most successful author in the Penny Dreadful market, that is until Charles King started taking all of his readers. No one knows who King is, including Fletcher s fellow members of the Dread Penny Society, a fraternity of  authors dedicated to secretly fighting for the social and political causes of their working-class readers. The group knows King could be an asset with his obvious monetary success, or he could be the group s undoing as King s readership continues to cut into their profits. Determined to find the elusive Mr. King, Fletcher approaches Miss Black. As a fellow-author, she is well-known among the high-class writers; perhaps she could be persuaded to make some inquiries as to Mr. King s whereabouts? Elizabeth agrees to help Fletcher, if only to insure her secret identity is never discovered. What neither author anticipated was the instant attraction, even though their social positions dictate the impossibility of a relationship. For the first time Elizabeth experiences the thrill of a cat-and-mouse adventure reminiscent of one of her own novels as she tries to throw Fletcher off her scent. But the more time they spend together, the more she loses her heart. Its upper-class against working-class, author against author where readers, reputations, and romance are all on the line.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Mystery",
    "Historical",
    "Fiction",
    "Audiobook"
  ],
  "author": "Sarah M. Eden",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/44025141-the-lady-and-the-highwayman"
}