{
  "title": "Say I'm the One",
  "description": "I’m head over heels in love with my best friend. Although, I can’t pinpoint exactly when Reeve Lancaster became my entire world. Was it when we were little kids, practically brought up together, after Reeve’s mom died during childbirth and his dad subsequently fell apart? Or when I doodled his name in my school journal at age ten? Maybe it was when we became boyfriend and girlfriend at fourteen or when we shed our virginity at sixteen, pledging our forever? I was there as his star ascended—like I’d always known it would—and there wasn’t a prouder person on the planet. As the only child of Hollywood’s golden couple, I’ve lived my life in the spotlight enough to know it wasn’t what I wanted for my future. But I sacrificed my own desires, because Reeve’s happiness meant everything to me.Until he crushed my heart into itty-bitty pieces, forcing me to fly halfway around the world just to escape the gut-wrenching pain.The opportunity to study at Trinity College Dublin came at the perfect moment, and I jumped at the chance without hesitation. If I’d known fate was meddling in my life, perhaps I would have chosen differently, but my future was cemented the instant I laid eyes on him.Dillon O’Donoghue was Reeve’s polar opposite in every way, and perhaps, that’s why I felt drawn to him. He was the dark to my light. The thorn in my side, irritating me with his cold disdain, wild recklessness, and a burning rage hidden deep inside him that spoke to a silent part within me. Yet Dillon showed me what it was like to truly live, opening my eyes to endless possibilities. What happened next was inevitable, and I only have myself to blame. He warned me, and I knew my reprieve was temporary, because there is only so far I can run.Especially when fate hasn’t finished messing with me yet.This is a full-length 168K-word second-chance romance novel that is book one of two. It cannot be read as a stand-alone, and it ends on a cliff-hanger. Recommended to readers aged eighteen and older.",
  "genres": [
    "Romance",
    "Second Chance",
    "Contemporary",
    "Friends To Lovers",
    "Contemporary Romance",
    "New Adult",
    "College"
  ],
  "author": "Siobhan     Davis",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/44024465-say-i-m-the-one"
}