{
  "title": "The Girl of the Tower",
  "description": "A dark and epic Rapunzel retelling for the fans of Eragon, Throne of Glass and Red Queen\n A BROKEN-HEARTED GIRL who finds her strength.A NOT VERY HEROIC PRINCE who can’t decide between two sisters.A KING WHO HAS BEEN LYING TO HIS PEOPLE and will do everything in his power to keep the magic in the world.A GRUMPY WIZARD with mysterious reasons to partner up with a GOOD-HEARTED WARRIOR to go against the king and change a millennial tradition.ALLIANCES EMERGE AND ENEMY SIDES CLASH when for the first time magic is gone and the fate of Tornnis lies in the hands of the winner. For ten years, Sophie has been confined on the Island of the Tower.For as long as she can remember, she has patiently accepted her isolation, though she craves freedom. She serves a greater purpose and her yearning for freedom will soon be satisfied. At least that is what Dorian tells her — her only visitor, whom she loves deeply and trusts blindly. In a few days she will turn seventeen and, on this day, she will finally leave the Tower to achieve something great.However, when she learns that her fate will be much crueler than what Dorian made her believe, Sophie realizes that he is not the Prince Charming from the fairy-tales she has been reading. Even worse, Sophie seemingly can do nothing to change her bleak future, as the tremendous powers trapping her on the Island are far too strong for her to break through.Believing everything is lost, Sophie’s hope is reignited when two mysterious men manage to reach her in her beautiful prison, just a few days before her Last Day. To them she is an integral part of a greater plan. To her, they are a way to escape, so Sophie agrees to flee with them to Tornnis, the magical lands across the sea.On her journey, Sophie will have to run from a tyrant king and his massive army of soldiers and wizards while discovering a frightening yet amazing new world, brand new feelings, and powers she never imagined possessing. Allied with a band of outcasts she equally admires and despises, Sophie will struggle to become the hero they expect her to be. After all, saving Tornnis won’t be easy when it means loving a family member she has no memory of, as well as giving up on the only person she ever loved.The Girl of the Tower is an epic adventure loosely inspired by the Rapunzel fairy tale, full of magic, romance, battles, drama and thrilling escapes, perfect for those who like YA high fantasy series such as Eragon, The Remnant Chronicles, Falling Kingdoms, Throne of Glass and Red Queen.",
  "genres": [],
  "author": "Paula Ottoni",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/44031170-the-girl-of-the-tower"
}