{
  "title": "Bad Mommy Stay Mommy",
  "description": "\"What strikes me most at the core of Elisabeth Horan's Bad Mommy / Stay Mommy is the generosity of its voice. These poems share fears, criticisms, confessions, shortcomings, wounds, and hopes in full, honest throat because the poet trusts us to hear her. No matter how close these poems get to giving up, they face fault and self-loathing like a sandblast, coming away less diminished than polished by it. There's pain, yes, and even unraveling. But there is also redemption in this telling, and even hope. Horan's poems teem with the complexities of life. They sing even when the song hurts. Most of all, they are necessary because, as she writes, \"Saying I'm sorry is not enough.\" -Jack B. Bedell, author of No Brother, This Storm, Poet Laureate, State of Louisiana, 2017-2019“I cower I cackle I burn”—and, yes, the riveting mother does just this in Elisabeth Horan’s heartbreakingly raw Bad Mommy / Stay Mommy. The notes of Sylvia Plath ring through the telling fingers of Horan’s sharp lines, deeply rooted in the body.Horan adeptly takes us on the mental health tour, pulling no punches, describing the ride of postpartum depression after birthing her second son, “red and writhing a salamander underfoot,” unflinchingly. She bravely depicts the out-at-sea drift of antidepressants. One of the most amazing and gut-wrenching poems in the collection, “Basement Mother,” finds her brutally locking herself away: “dragging a stained placenta / Surviv[ing] on its nutrients, for years / in chains, with rats, eating shit / my own eyes, yellow slits, / my vagina locked, breasts defiled.” Bad Mommy evokes her suicides and calls them close: Plath and Woolf, naming herself as the third in the pack. But Horan is not quite ready to give into the pocket of rocks, the trauma of rape, the absent father—a trilogy quite terrifying in its own right. Stay Mommy enters just in time and claims, though tenuous, her place and her children. This collection exists to destigmatize the space where mothers are still shamed for postpartum depression and mental illness. Through her wild and wondrous voice, Horan allows so many of us to speak. And to survive.\"- Jen Rouse",
  "genres": [],
  "author": "Elisabeth Horan",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/44048999-bad-mommy-stay-mommy"
}