{
  "title": "A History of My Brief Body",
  "description": "In this stunning essay-collection-cum-prose-poem-cycle, Belcourt meditates on the difficulty and necessity of finding joy as a queer NDN in a country that denies that joy all too often. Out of the 'ruins of the museum of political depression' springs a 'tomorrow free of the rhetorical trickery of colonizers everywhere.' Happiness, this beautiful book says, is the ultimate act of resistance. --Michelle Hart, O, The Oprah MagazineThe youngest ever winner of the Griffin Prize mines his personal history in a brilliant new essay collection seeking to reconcile the world he was born into with the world that could be.For readers of Ocean Vuong and Maggie Nelson and fans of Heart Berries by Terese Marie Mailhot, A History of My Brief Body is a brave, raw, and fiercely intelligent collection of essays and vignettes on grief, colonial violence, joy, love, and queerness.Billy-Ray Belcourt's debut memoir opens with a tender letter to his kokum and memories of his early life in the hamlet of Joussard, Alberta, and on the Driftpile First Nation. Piece by piece, Billy-Ray's writings invite us to unpack and explore the big and broken world he inhabits every day, in all its complexity and a legacy of colonial violence and the joy that flourishes in spite of it; first loves and first loves lost; sexual exploration and intimacy; the act of writing as a survival instinct and a way to grieve. What emerges is not only a profound meditation on memory, gender, anger, shame, and ecstasy, but also the outline of a way forward. With startling honesty, and in a voice distinctly and assuredly his own, Belcourt situates his life experiences within a constellation of seminal queer texts, among which this book is sure to earn its place. Eye-opening, intensely emotional, and excessively quotable, A History of My Brief Body demonstrates over and over again the power of words to both devastate and console us.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Queer",
    "Poetry",
    "Indigenous",
    "Essays",
    "LGBT"
  ],
  "author": "Billy-Ray Belcourt",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/44049371-a-history-of-my-brief-body"
}