{
  "title": "Every Man a Hero",
  "description": "Timed to the seventy-fifth anniversary of the Normandy invasion, an extraordinary first-hand account of D-Day by a decorated U.S. Army medic who landed with the first wave on June 6, 1944, and saved dozens of his fellow American soldiers on Omaha Beach, despite having his back broken and being wounded at least three times.D-Day. June 6, 1944. At five a.m., U.S. Army Staff Sergeant Ray Lambert worked his way through a throng of nervous soldiers to a wind-swept deck on a troopship off the coast of France. Within moments, a familiar voice cut through the wind and rumble of the ship’s diesels. “Ray!” called his brother, Bill. The two men ducked into a corner away from the wind. Ray, head of a medical team for the First Division’s famed 16th Infantry Regiment, had already won a silver star for running through German lines to rescue trapped men in Africa, one of countless rescues he’d made in Tunisia and Sicily. Bill, himself a former medic, was now a company first sergeant tasked to clear the most difficult defenses on shore.“This is going to be the worst yet,” Ray told his brother.“If I don’t make it,” said Bill. “Take care of my family.”“I will,” said Ray. He thought a moment about his wife and son, born two years before – a boy he had yet to see. “Same for me.” The words was barely out of Ray’s mouth when there was a shout below.To the landing craft!The men parted as they always did, without hugs, without another word. Their destinies lay nine miles away, on the bloodiest rocks of Normandy, a plot of Omaha Beach ironically code named “Easy Red.”Less than five hours later, after saving dozens of lives and being wounded at least three separate times, Ray would lose consciousness in the shallow water of the beach under heavy fire. He would wake on the deck of a landing ship to find his battered brother clinging to life next to him.This is the unforgettable story not only of what happened in the incredible and desperate hours on Omaha Beach in between, but of the bravery courage that preceded them, from the vast sands and green hills of Africa, through the treacherous mountain passes of Sicily, and beyond to the greatest military victory the world has ever known.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Memoir",
    "War",
    "Military Fiction",
    "Biography"
  ],
  "author": "Ray Lambert",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/44049682-every-man-a-hero"
}