{
  "title": "A Twist in the Tail",
  "description": "FROM THE AWARD-WINNING AUTHOR OF THE USA TODAY BESTSELLING MYSTIC NOTCH SERIES…  ‘Talk about inconvenient. Not only did I have a dilapidated mansion and no money to repair it with, two cats I had no idea how to care for and a room full of cranky guests waiting for their breakfast, I also had a dead body on my hands.’  Josie Waters has to admit she may have acted a bit hastily when she agreed to purchase the Oyster Cove Guesthouse – a charmingly gabled Victorian mansion on the breathtaking Maine coast – from elderly family friend Millie Sullivan. But Josie was desperate to flee Ohio and in particular her ex-husband, a chef who loved his job so much he left her for it. And anyway, how hard can running a guesthouse be?  The truth is, Oyster Cove Guesthouse is a mouldering money pit with falling-in roof and a cohort of regular guests who are as mischievous as a litter of kittens. And Millie keeps dropping by to dispense unasked-for advice. And Josie might have made a mistake in promising to adopt Oyster Cove’s two resident cats Nero and Marlowe, and treat them in the manner to which they’ve become accustomed. Josie has never had a cat before… let alone two feisty felines who think they own the place.  Ok, it’s not going well. At least it can’t get any worse, Josie thinks. Until her first guest ends up dead.  A joy to read, with a twist you’ll never guess! A page-turning new mystery series from a bestselling author, purrfect for murder mystery fans, cat lovers and everyone in between.   Readers can’t get enough of Leighann Dobbs!  ⭐⭐⭐⭐⭐‘A cozy reader can never go wrong with a Leighann Dobbs book! … The characters are fun and quirky. There are numerous feline sleuths… Move over Cat Who books there is another series to steal your thunder!’ Goodreads reviewer  ⭐⭐⭐⭐⭐‘Mystery, books, cats! Ups and downs, twists and turns make this a must read, especially if you love cats and books! Keep the series coming!’ Goodreads reviewer  ⭐⭐⭐⭐⭐‘I do love a good cozy mystery! I should add that is especially if they involve cats, and this one has a great band of cat characters I know I'll fall in love with… Five stars.’ Goodreads reviewer  ⭐⭐⭐⭐⭐‘Good read, fun and gripping excitement. I really enjoyed it. Recommended for light reading especially on a cozy, rainy day with your cat curled up beside you.’ Goodreads reviewer  ⭐⭐⭐⭐⭐‘This was such a fun book. I just loved all the characters, human and feline. It’s always a thrill when you find a story where you can picture yourself walking down the streets and fitting in with the characters... I will definitely be reading more of this series.’ Goodreads reviewer  ⭐⭐⭐⭐⭐‘Thoroughly enjoyable! A great cozy mystery… Can't wait to read the whole series! Highly recommend this to anyone who enjoys an intelligent story full of lively characters that you might like to have in your neighbourhood!’ Goodreads reviewer  ⭐⭐⭐⭐⭐‘Cats who are smarter than most of the people in the town was very entertaining.",
  "genres": [
    "Cozy Mystery",
    "Mystery",
    "Cozy",
    "Fiction",
    "Cats",
    "Crime",
    "Fantasy"
  ],
  "author": "Leighann Dobbs",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/44054797-a-twist-in-the-tail"
}