{
  "title": "Omegas Unchained",
  "description": "Two omegas with the same radical idea – breaking free from their constraints and taking charge of their own destinies!  Shy, brutalized Ryan has a simple goal of carving the best life for himself and his pup that he can. Being accepted into the Rogue Pack has given him that chance. He also harbors the hope of mating with Griffin, the beta he has loved for longer than he should. If only he can make the man see that they are perfect for each other. Putting aside his natural reticence, Ryan has concocted a plan of seduction.  Griffin knows that he is lucky to have found a new home with the Rogue Pack. More importantly, so has Ryan. For the first time, Griffin no longer has to worry about the sweet omega’s safety. That should be enough, and yet some stupid part of the beta dares to covet Ryan and dream of making him is own. He knows that Ryan deserves more than a low-level beta as his next mate. He tries to keep his distance, but the omega is making that hard. Is Ryan trying to drive him crazy?  Ethan has become used to living with the shame of being a barren omega. Banished by his mate, he has returned to the pack of his birth with his tail between his legs. But he refuses to let anyone see how he feels. This gathering with the Rogue and Strongblood Packs is meant to be a distraction. He was not prepared, however, for just how much of one Alpha Graydon is proving to be. While he knows he should resist the lure of the man, he cannot help but want to recapture some of the fun of being mated. Where is the harm in a little flirtation and sexual gratification? It is not as if he can breed.  Graydon understands the value of making alliances and bringing his pack further into modern living. The gathering is a practical step for him to take as the new leader of the Strongbloods. He never expected to stumble upon his fated mate. His people know the old ways, and when the Gods present the omega destined for him, he does not hesitate to embrace his future. Ethan may be looking for temporary pleasure, but Graydon knows they have been set on a path with only one acceptable outcome. He will make Ethan his.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Romance",
    "Paranormal",
    "Omegaverse",
    "Werewolves",
    "Contemporary"
  ],
  "author": "Samantha Cayto",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/44048223-omegas-unchained"
}