{
  "title": "Blue Lady's Mission Under Fire",
  "description": "It's all about the search for love and life purpose...Blue Lady's MISSION under FIRE i s Book 3 in the Angelica Mason Series. (There are four books in the series.) Book 5, Blue Lady's SEARCH for LOVE will be available in the Spring of 2023). The books revolve around a common theme-- the search for love and life purpose.Which is more important or are they interrelated?With nowhere to run and nowhere to hide, what can she do to survive?The MISSION changed. Her COVER is blown.In Blue Lady's MISSION under FIRE, Angelica Mason (aka,The Blue Lady) along with her faithful sidekick Jonathan C. Jarewski, face new challenges and stare down old demons.When Angelica is fired by her ex-boss, Mayor of her home town Smoothville, Georgia, she eagerly accepts her mentor's offer to serve as his project manager on a controversial federally funded demonstration project.Angelica confronts her first challenge on Day 1 when she arrives in Washington, D.C. and learns that the feds cut the funding for her promised position. She is now one of six hand-picked street organizers who will be working uncover in Upstate New York.When smooth talking private investigator Dez Cooke makes himself quite at home in the first project team meeting and knows more about the planned project than she does, Angelica realizes she is face to face with challenge number two.By the end of the first official briefing session, Angelica learns that a new murder case has been added to the growing list of homicides in the upstate community. This time, two teenagers are killed. Instead of celebrating the 4th of July, another community vigil is held to celebrate the dead. Challenge three.Community leaders call another meeting. But no one has any answers. Challenge four.It starts with a round of tequila shots and a hip swiveling line dance. Did Angelica hear the shots before she felt the shove? Was it an accident? Or was she the target?In the third book in USA Today bestselling author Stephany Tullis’ Angelica Mason Series, political operatives Angelica Mason and Jonathan Jarewski find themselves in a MISSION under FIRE.",
  "genres": [],
  "author": "Stephany Tullis",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/44034558-blue-lady-s-mission-under-fire"
}