{
  "title": "Mate",
  "description": "Spitfire Disgrace Matthieu Boudreaux has one wish: to age out of the Pedigree he despises, then destroy it. With one year left before he achieves the first step of his goal, Matthieu finally has some hope for an independent future… until a surly Amethyst dragon by the name of Geoffrey Drake and his entourage show up at Matthieu’s cloister and inform him he’s been selected to be part of an ‘experiment.’  Geoffrey Drake, proud and stuffy legal counsel for the Amethyst clan, has been charged with ruining his own life. His mission? Deliver a potential mate to the son of the Amethyst clan’s most despised enemy—and the man he’s loved in secret for the last hundred years—Topaz dragon Ian Brand. Refusal is impossible. Dragons don’t consort with dragons, and should Geoffrey decline, he risks exposing them both.  Ian Brand, charming black sheep of the Topaz clan, is trapped between his forbidden love for an Amethyst dragon centuries his senior and his duty to his family. Chosen by his unhinged father to be the Topaz candidate for the mating experiment, Ian is faced with a terrible choice: run away with the man he loves and face the deadly consequences, or accept his fate with a broken heart.  But dragon magic, as Matthieu, Geoffrey, and Ian soon discover, works in mysterious ways. When an unforeseeable circumstance draws them all together and puts their futures at risk, they have no choice but to set their differences aside and work together to prove a new, startling truth…  What the dragon world knows about mates has been wrong all along, and it will be up to the three of them to prove it.  Mate is a 103,000 word steamy omegaverse mpreg-ish romance that will leave you in stitches. It contains an experiment gone awry, five eccentric peacocks, an unusually large number of whelps, an ancient Viking Daddy dragon, and science! For maximum enjoyment, Mate is best read following the events of Clutch and Bond.",
  "genres": [
    "M M Romance",
    "Omegaverse",
    "Dragons",
    "Paranormal",
    "M M M",
    "Fantasy",
    "Romance"
  ],
  "author": "Piper Scott",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/44044028-mate"
}