{
  "title": "What You Do Is Who You Are: How to Create Your Business Culture",
  "description": "Ben Horowitz, a leading venture capitalist, modern management expert, and New York Times bestselling author, combines lessons both from history and from modern organizational practice with practical and often surprising advice to help executives build cultures that can weather both good and bad times. Ben Horowitz has long been fascinated by history, and particularly by how people behave differently than you’d expect. The time and circumstances in which they were raised often shapes them—yet a few leaders have managed to shape their times. In What You Do Is Who You Are, he turns his attention to a question crucial to every organization: how do you create and sustain the culture you want?To Horowitz, culture is how a company makes decisions. It is the set of assumptions employees use to resolve everyday problems: should I stay at the Red Roof Inn, or the Four Seasons? Should we discuss the color of this product for five minutes or thirty hours? If culture is not purposeful, it will be an accident or a mistake.What You Do Is Who You Are explains how to make your culture purposeful by spotlighting four models of leadership and culture-building—the leader of the only successful slave revolt, Haiti’s Toussaint Louverture; the Samurai, who ruled Japan for seven hundred years and shaped modern Japanese culture; Genghis Khan, who built the world’s largest empire; and Shaka Senghor, a man convicted of murder who ran the most formidable prison gang in the yard and ultimately transformed prison culture.Horowitz connects these leadership examples to modern case-studies, including how Louverture’s cultural techniques were applied (or should have been) by Reed Hastings at Netflix, Travis Kalanick at Uber, and Hillary Clinton, and how Genghis Khan’s vision of cultural inclusiveness has parallels in the work of Don Thompson, the first African-American CEO of McDonalds, and of Maggie Wilderotter, the CEO who led Frontier Communications. Horowitz then offers guidance to help any company understand its own strategy and build a successful culture.What You Do Is Who You Are is a journey through culture, from ancient to modern. Along the way, it answers a question fundamental to any organization: who are we? How do people talk about us when we’re not around? How do we treat our customers? Are we there for people in a pinch? Can we be trusted?Who you are is not the values you list on the wall. It’s not what you say in company-wide meeting. It’s not your marketing campaign. It’s not even what you believe. Who you are is what you do. This book aims to help you do the things you need to become the kind of leader you want to be—and others want to follow.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Management",
    "Entrepreneurship",
    "Cultural",
    "Self Help"
  ],
  "author": "Ben Horowitz",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/44063692-what-you-do-is-who-you-are"
}