{
  "title": "Karma",
  "description": "Wouldn't it be nice to have hot, funny, rule-breaking Angels protecting and fighting your corner, keeping an eye on those who slip through law enforcement's fingers? Well here you go... the Fallen. You're welcome :-)The Fallen Unit continue their fight to protect Erthfolk. But when new Warlords surface, truths and lies unfold, passions cause problems and criminals refuse to learn, Amy finds herself making the decision of her life.  Fun-loving career girl Amy Fox is a new Angel, but for how long? Avenging personal scores, lusting after her partner, dishing out tough karma on evil ex's, bullies, trolls, abusers, traffickers, animal hunters, drug dealers, violent crime gangs and competing hell Warlords... will have her thrown below ground! At the age of four, Amy was taken…She survived. A week later, another little girl was taken…She didn't. Angry that a bad man has gotten away with murder, feisty young Amy makes a deal with God. When she dies, if she’s been a good girl, would he let her sit on a cloud for a while, invisible, to get the bad people who slip through his fingers? Her deal and God long forgotten, Amy mysteriously dies. Her lifeless body is found beneath a London underground commuter train. She awakens in the afterlife to discover an international network of like-minded souls who’ve all made the same deal. A sophisticated MI5-esque justice machine sits in the skies, protecting, righting wrongs, tracking criminals, and working within strict rules of play… all against time. Each country's Unit shares intelligence, surveillance, and resources to deactivate dangerous situations. The only evidence they leave behind during their earthly visits is a small white feather sashaying to the ground. In a chaotic world, powerful adversaries try to close her Unit down. A complex SAS vigilante has been assigned to work as her partner, but with his jealous violent ex on her heels and with her own vendetta to settle, Amy has never worked so hard in her entire earthly life. She has to wonder if making a deal with God was a mistake. ABOUT S C Cunningham Author of 'The Penance List', 'Unfinished Business' and 'Karma' Cunningham creates psychological thrillers and paranormal crime with a skilled mix of fueled tension, dark humor, and pulsating passion. Having worked in the industries she writes about, her novels offer a fresh level of sincerity and authority, rare in fiction. An ex-model, British born of Irish roots, she married a rock musician and has worked in the exciting worlds of music, film, sports, celebrity management and as a Crime Investigator for the British Police (Wanted & Absconder Unit, Major Crime Team, Intelligence Analyst, Investigations Hub). As respite from crime she writes educational children's picture books, 'The Ginormous Series'.REVIEWS - THE FALLEN ANGEL SERIESThe Deal & Karma & The Calling (in progress)'Wow ! Great book. Make a great film'. 'You are a very gifted writer and have created a rich, complex, believable world and characters. My senses have rarely been engaged so viscerally while reading.' “The Deal is blissfully raw and absolutely perfect. 5★ for days.” “Completely different from anything I have ever read; it is an outstanding book.”“It got me! It's been a very long time since I have read a book that I, A. Couldn't put down and B. I didn't want it to end!\" \"Plots intertwine twist and turn, it's addictive.” \"Hard to put down - a must read that keeps you guessing.\" “Could not put this down - enjoy reading all her work. Am now desperately waiting for the next one in the series..'",
  "genres": [
    "Fantasy",
    "Angels",
    "Suspense",
    "Supernatural",
    "Romance",
    "Paranormal"
  ],
  "author": "S.C.  Cunningham",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/44059114-karma"
}