{
  "title": "A Match for Mr. Write",
  "description": "Get ready for ten weeks of romance in the Bahamas with a new series brought to you by some of the best authors in the inspirational and sweet romance genres… Ten delightful - and standalone - novellas linked by one matchmaking week. You’ll want to devour each one! It’s Matchmaking Week at an all-inclusive resort on a private island in the Bahamas. Each guest has been expertly paired and is here to enjoy one full week with their match. While there’s no money-back guarantee on the paid trip, the participants are guaranteed to find love!This is A Match for Mr. Write...Magazine editor Gemma Carmichael has been secretly in love with her co-worker Blade for 5 years and when he suddenly breaks off his engagement, Gemma decides this is her chance to woo her man. He signs up for a matchmaking getaway and she decides to do it too, positive they're a match. But to her surprise, she's matched with Sawyer Bennett, a brooding romance author who only came on the island to write and who doesn't even believe in love. (Obviously the Sterling sisters have no idea what they're doing!) Romance author, Sawyer Bennett, did not sign up for this. He thought his travel agent cousin was sending him on a nice, normal vacation in the Bahamas, not to bad reality TV recreation. The only romance he's interested in is the one between his characters. After all, family history has shown him that true love is just fiction, which is why he's so good at writing it. But now, he's stuck in a romance book situation, with contracts that can't be broken and matched to the pretty but kooky redhead, Gemma. (Obviously, the Sterling sisters have no idea what they're doing!) However, the magazine Gemma works for would provide great publicity for his next release, so he agrees to help her win her true love in exchange for her putting his book on the reviewer's upcoming list. Seems like an easy enough way to pass the week. Sawyer still doubts the existence of true love but by the end of the week, he can’t help but wonder if he could finally have found the write woman for him after all.Find all the Resort to Romance novellas at Amazon or visit the authors’s websites!A Messed-Up Match by Jessica R. PatchA Meddled Match by Jill KemererMet Her Match by Susan L. TuttleMoonlight Match by Kristina KnightUnexpected Match by Constance PhillipsMatch Me If You Can by Krista PhillipsMismatched Melody by Jodie BaileyRematched by Julie Jarnagin Match You Like Crazy by Johnnie Alexander",
  "genres": [
    "Romance",
    "Humor",
    "Contemporary",
    "Romantic Comedy",
    "Novella",
    "Contemporary Romance",
    "Clean Romance"
  ],
  "author": "Jennifer Shirk",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/44065183-a-match-for-mr-write"
}