{
  "title": "The Last Human?",
  "description": "Meet Rick. He's the Last Human. He's rich, he's famous, and he hates his life. The year 2056, WW3 has come and gone, and machines have transformed the Earth and its people. Some might say for the better. Not Rick. Rick is the last human, kept and paraded around as a reminder of the inferiority of the ape-like humans. Rick wants out. But he’s not getting away so easily, the Agency is not letting its puppet go. Follow Rick as he tries to sober up long enough to escape from his lavish lifestyle only to end up entangled in interplanetary intrigue. In a world of super-cyborgs and mutants, Rick will show them the meaning of humanity as he travels far and wide testing the fabric of society in an attempt to find himself or whatever it is he’s looking for. Warning, adult content. Do not read if easily offended. This book contains coarse language, sex, drugs and violence. All the good stuff. Head over to my blog and read some more of my nonsense there. The first post is about writing and the second editing, maybe you’ll find them interesting, educational or even funny, maybe not. If you want to find out about why I write and my process head over to Bio T.F.R. LeBoomington resides between London and France. When he’s not working on some mad project he's out researching his books and studying humans in their natural drinking environments. Throughout the years he's worked in marketing, video production, gaming, smart homes and more. His passion for technology and knowledge of the tech industry is geeky. He's been writing since he was kid, but never attempted to publish anything until 10 years ago when he tried and failed miserably. (See Why I Write Blog Post) A couple of years ago he decided to start writing again, on the side. The result is The Last Human Saga. It's a product of his love of 80s and 90s pop culture mixed with his love of futurism and science-fiction, filtered through his life experience. That being said he is insane and so is his writing. Thankfully his editor is a physicist and savage critic.",
  "genres": [
    "Science Fiction"
  ],
  "author": "T.F.R. LeBoomington",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/44065285-the-last-human"
}