{
  "title": "Dominion: The Making of the Western Mind",
  "description": "Christianity is the most enduring and influential legacy of the ancient world, and its emergence the single most transformative development in Western history. Even the increasing number in the West today who have abandoned the faith of their forebears, and dismiss all religion as pointless superstition, remain recognisably its heirs. Seen close-up, the division between a sceptic and a believer may seem unbridgeable. Widen the focus, though, and Christianity's enduring impact upon the West can be seen in the emergence of much that has traditionally been cast as its nemesis: in science, in secularism, and yes, even in atheism. That is why Dominion will place the story of how we came to be what we are, and how we think the way that we do, in the broadest historical context. Ranging in time from the Persian invasion of Greece in 480 BC to the on-going migration crisis in Europe today, and from Nebuchadnezzar to the Beatles, it will explore just what it was that made Christianity so revolutionary and disruptive; how completely it came to saturate the mind-set of Latin Christendom; and why, in a West that has become increasingly doubtful of religion's claims, so many of its instincts remain irredeemably Christian. The aim is twofold: to make the reader appreciate just how novel and uncanny were Christian teachings when they first appeared in the world; and to make ourselves, and all that we take for granted, appear similarly strange in consequence. We stand at the end-point of an extraordinary transformation in the understanding of what it is to be human: one that can only be fully appreciated by tracing the arc of its parabola over millennia.",
  "genres": [
    "History",
    "Nonfiction",
    "Christianity",
    "Philosophy",
    "Christian",
    "Theology",
    "Church History"
  ],
  "author": "Tom Holland",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/44064306-dominion"
}