{
  "title": "Hellmira: The Union’s Most Infamous Civil War Prison Camp - Elmira, NY",
  "description": "Long called by some the \"Andersonville of the North,\" the prisoner of war camp in Elmira, New York, is remembered as the most notorious of all Union-run POW camps. It existed for only a year--from the summer of 1864 to July 1865--but in that time, and for long after, it became darkly emblematic of man's inhumanity to man.Confederate prisoners called it \"Hellmira.\"Hastily constructed, poorly planned, and overcrowded, prisoner of war camps North and South were dumping grounds for the refuse of war. An unfortunate necessity, both sides regarded the camps as temporary inconveniences--and distractions from the important task of winning the war. There was no need, they believed, to construct expensive shelters or provide better rations. They needed only to sustain life long enough for the war to be won. Victory would deliver prisoners from their conditions.As a result, conditions in the prisoner of war camps amounted to a great humanitarian crisis, the extent of which could hardly be understood even after the blood stopped flowing on the battlefields.In the years after the war, as Reconstruction became increasingly bitter, the North pointed to Camp Sumter--better known as the Andersonville POW camp in Americus, Georgia--as evidence of the cruelty and barbarity of the Confederacy. The South, in turn, cited the camp in Elmira as a place where Union authorities withheld adequate food and shelter and purposefully caused thousands to suffer in the bitter cold. This finger-pointing by both sides would go on for over a century.And as it did, the legend of Hellmira grew.In Hellmira: The Union's Most Infamous POW Camp of the Civil War, Derek Maxfield contextualizes the rise of prison camps during the Civil War, explores the failed exchange of prisoners, and tells the tale of the creation and evolution of the prison camp in Elmira. In the end, Maxfield suggests that it is time to move on from the blame game and see prisoner of war camps--North and South--as a great humanitarian failure.",
  "genres": [
    "History",
    "American Civil War"
  ],
  "author": "Derek Maxfield",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/44059520-hellmira"
}