{
  "title": "Ashes",
  "description": "Cordelia has never known anything but the safety of her fathers guarded compound where she’s lived her entire life. A life that, as the alphas daughter, has always been a privileged one, albeit an incredibly sheltered one. Until one night, life as she knows it, is flipped entirely upside down when she’s promised to another alpha in order to buy safety for her father’s pack. This doesn’t exactly sit well for Cordelia seeing as she has different plans for her life, even if she doesn’t know what those plans are just yet. Out of fear of what she doesn’t want her life to become, she does the unthinkable and tells her father the one thing he’ll never tolerate from anyone in his pack, especially not his daughter. She tells him no. As a result, Cordelia learns just what kind of depraved man and alpha her father is and is left a broken, bleeding mess because of it.  After finding kindness and compassion from two strange men who show up at the compound and help her when she is no longer capable of helping herself, Cordelia does the only thing she thinks she can do in order to survive and not be stuck in a world of abuse and misery. She runs. Unfortunately for Cordelia, she doesn’t make it very far before she finds herself in trouble again and at the mercy of another male with alpha tendencies. This alpha also comes with a brother by blood and one by choice. The problem is, Cordelia’s not so sure she could ever find a place in a pack again after everything she’s survived. She won’t have long to figure it out though because, no matter the cost, her father is determined to find her and bring her home.  Warning - Due to certain sensitive sexual subject matter and abusive situations, this book may contain triggers for some people. It’s also a Reverse Harem book.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Shapeshifters",
    "Dark",
    "Fantasy",
    "Paranormal Romance",
    "Menage"
  ],
  "author": "Mary Martel",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/44064087-ashes"
}