{
  "title": "Bent But Not Broken",
  "description": "Bent But Not Broken is an unflinchingly honest memoir about the onset of Peyronie’s disease, a painful and sexually limiting condition that is estimated to affect more than 5% of the worldwide adult male population. Don Cummings writes humorously about the emotional and collateral damage brought on by a suddenly curved penis as he struggles to maintain his sense of sex and self. He openly details the doctor visits, the excruciating treatments, and the acute anxiety over the state of his long-term relationship with a man who is supportive but often helpless in the face of nature’s whims. Discordant domestic life, a harrowing kidnapping by a handsome stranger, and reminiscences of a hyper-active sexual past are woven into the single-minded quest to minimize the effects of this deforming disorder. Brace yourself for a daring, heartfelt and beautifully twisted story of love and survival. “Cummings’ prose is effortlessly clever, finding the entertaining medium between lyricism and sass. The frankness with which he discusses his problem, the treatment, and his sex life makes for an oddly shocking book—one rarely reads quite so much about penises, as central as they often are to literature. He manages to demystify and destigmatize Peyronie’s, which though obscure is not completely uncommon. More than that, he makes the most of an undignified opportunity to examine his own masculinity.” —Kirkus Reviews \"Cummings’s book (dubbed a “phallic memoir” by Permanent Midnight author Jerry Stahl) joins the ranks of other great gay medical memoirs (think Augusten Burroughs’s).” —The Advocate “To the world-class pantheon of memoirists like David Sedaris, Augusten Burroughs and Jonathan Ames, let us now add Don Cummings, who has single-handedly invented a new the phallic memoir. Like all great personal essayists, the author mines his private torments — and tormented privates — transforming them, with wit, grace and weirdness, into a riveting, original story of triumph and transcendence.” —Jerry Stahl, Author of Permanent Midnight and Bad Sex on Speed “Daring, funny, candid, tender, Bent But Not Broken reveals the paradoxical truth about our strength as men is our weakness, and vice versa. Don Cummings is a witty, insightful writer, and this book is a marvel.” —John Sedgwick, author of In My Six Generations of Madness and Desire in an American Family “Bent But Not Broken is a hilarious and deeply moving memoir about a penis and its owner. But more than that it’s about the nature of love, the flux of relationships, and how bodies betray us all. Cummings is a stunning writer and excellent travel guide for this journey through his life.” —Maggie Rowe, Author of Sin Bravely and writer on Arrested Development “Like his penis, Cummings gets bent out of shape, and not only on account of his also just by being human, a man, a gay man who wants what he wants, as most of us love, intimacy, sex, money, fame, and sex. Cummings can’t help but be funny, but he also can’t stop being honest, and his writing achieves real poignancy that will grab you by the heart and penetrate deep into your soul, if you’re the soulful type. If not, your mind, and definitely your memory. It’s an unforgettable, beautiful book.” —Rick Whitaker, Author of Assuming the Position and An Honest Ghost",
  "genres": [
    "Romance",
    "Disability",
    "Memoir",
    "Health",
    "LGBT"
  ],
  "author": "Don   Cummings",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/44064393-bent-but-not-broken"
}