{
  "title": "Ode To Death",
  "description": "“ODE TO DEATH is a celebration of good, old fashioned storytelling and creeping dread. I couldn’t stop turning the pages and you won’t be able to either. I had a great time with this collection.” — Richard Chizmar From author Andrew Lennon comes a new collection of eighteen titles, including short stories, drabbles and poetry. This versatile collection will have you fearing those noises coming from the attic, questioning whether you should enter that haunted house at the fairground, thinking twice before you stay in a motel on a desert-stricken highway. It will touch you emotionally when you witness a person’s struggles, their discovery of new friends, how they can triumph and live to see another day, raising their heads to create their own Ode to Death.ContentsMy Ode to Death House of Illusion Lunchtime Ghost Story No Sleep Caravan Buried Santa Claus Comes at Night Dog Race Trying to Write a Horror Story Hide Behind a Smile Visiting Time Stress Blanket Red Shoes New Beginning The Secret Life of my Imaginary Friend Lover One Night In Hotel “Andrew Lennon is a rising star of horror” - Iain Rob Wright, author of the Hell on Earth series “Lennon harkens back to the glory days of horror, where nothing is what it seems and everything is terrifying!” – Ryan C. Thomas, author of The Summer I Died \"Andrew Lennon is definitely not for the faint of heart – his writing takes a chilly dip into the pitch blackness of the human psyche.\" - Sam West, author of Djinn \"Lennon's words scream resoundingly from every page and make you read with the lights on!\" --Christopher Motz, author of Pine Lakes \"Andrew Lennon brings his unique brand of no-nonsense horror to his latest collection, smartly keeping the focus right where it should telling a great story.\" - Evans Light, author of Tales of Terror “I’ve thoroughly enjoyed everything I’ve read by Lennon. I can never wait to see what he does next.” - Kevin J Kennedy, creator of Collected Horror Shorts. \"The best horror writers have the ability to make you believe the words on the page could happen in reality. ODE TO DEATH is full of these moments and cements Andrew Lennon as one of the rising stars in the horror fiction genre.\" - Michael Bray, author of Whisper “Deliciously dark, brutal and thoroughly entertaining. If Andrew Lennon isn’t already on your radar then he should be.” - Peter McKeirnon, author of Death in a Northern Town",
  "genres": [
    "Horror"
  ],
  "author": "Andrew Lennon",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/44079268-ode-to-death"
}