{
  "title": "The Inmates Are Running the Asylum: Why High Tech Products Drive Us Crazy and How to Restore the Sanity",
  "description": "In this book about the darker side of technology's impact on our lives, Alan Cooper begins by explaining that unlike other devices throughout history, computers have a \"meta function\": an unwanted, unforeseen option that users may accidentally invoke with what they thought was a normal keystroke. Cooper details many of these meta functions to explain his central thesis: programmers need to seriously re-evaluate the many user-hostile concepts deeply embedded within the software development process. Rather than provide users with a straightforward set of options, programmers often pile on the bells and whistles and ignore or de-prioritise lingering bugs. For the average user, increased functionality is a great burden, adding to the recurrent chorus that plays: \"computers are hard, mysterious, unwieldy things.\" (An average user, Cooper asserts, who doesn't think that way or who has memorised all the esoteric commands and now lords it over others, has simply been desensitised by too many years of badly designed software.) Cooper's writing style is often overblown, with a pantheon of cutesy terminology (i.e. \"dancing bearware\") and insider back-patting. (When presenting software to Bill Gates, he reports that Gates replied: \"How did you do that?\" to which he writes: \"I love stumping Bill!\") More seriously, he is also unable to see beyond software development's importance--a sin he accuses programmers of throughout the book. Even with that in mind, the central questions Cooper asks are too important to ignore: Are we making users happier? Are we improving the process by which they get work done? Are we making their work hours more effective? Cooper looks to programmers, business managers and what he calls \"interaction designers\" to question current assumptions and mindsets. Plainly, he asserts that the goal of computer usage should be \"not to make anyone feel stupid.\" Our distance from that goal reinforces the need to rethink entrenched priorities in software planning. -- Jennifer Buckendorff, Amazon.com",
  "genres": [
    "Design",
    "Nonfiction",
    "Business",
    "Technology",
    "Programming",
    "Usability",
    "Software"
  ],
  "author": "Alan Cooper",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/44098.The_Inmates_Are_Running_the_Asylum"
}