{
  "title": "Sister Rise: Ani Maxima Salvation #3",
  "description": "Someone from Earth is still reaching out through hyperspace with messages of warning. This time, the message demands an offensive attack! The Ch-khana are planning one last effort to kill off the population of Cassiopeia and this time, there’s going to be no way to ward off the attack. The only way to survive would be to stage an offensive attack on the Ch-khana from Earth. Bree is a Ch-khana from Earth who has been sending those secret messages through hyperspace. Her only request in exchange for the information is that she and her family be granted asylum on Cassiopeia. After all, the information she’s shared has ensured the survival of almost everyone in the Cepheus colony. Unfortunately, she has evidence that one of the sisters is going to die. This is the final installment in the trilogy “Ani Maxima Salvation”, told from the viewpoint of Ani Maxima.  The entire Ani Maxima series was voted in the top 10 for \"Best Kindle Space Opera\" and \"Best Amazon Prime Books to Borrow\" by Goodreads! Ani Maxima Salvation (the final trilogy): Nevermore (Aegis’ story) Paper Doll (Raven’s story) Sister Rise (Ani’s story) The Ani Maxima Files (the first series): Ptolemy’s Child SuperVirus Veiled Sky Enigma Flying in the Rain Silent Lucidity Flesh and Blood Soul Sister Social Animal Brought to you by the international bestselling author of the Mystic Saga, Beyond the Event Horizon, Maelstrom, Endeavor, and Ghosts of Ophidian. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Hope Rising, One Crazy Summer, and Terraformer by McElhaney. EDITORIAL  \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/44089322-sister-rise"
}