{
  "title": "A Shadow Beyond: A thrilling and beautiful timeslip novel set during the Great Plague.",
  "description": "For fans of Kate Morton and Barbara Erskine, comes a thrilling and beautiful dual-time novel, set in the present and during 1665 – 1666, when plague broke out in the Peak District village of Eyam. A Shadow Beyond is a heart-rending and chilling tale of sacrifice, love, obsession and tragedy.  Lost in the folds of time, behind one village's brave sacrifice, is the tragic and chilling secret of Thornycroft Hall....  Locked away in the top quarters of Thornycroft, a large house on the edge of the historic village of Eyam, is a centuries old secret.  Escaping the chaos of a complicated break up, Kate Saunders travels to the Peak District to stay with her Great Aunt Edie who has suffered a fall. Thornycroft is the perfect bolthole for Kate, peaceful and providing plenty of distance from her obsessive ex.  But when Kate stumbles across a diary and an ancient bogwood jewellery box in the top of the house, the tranquillity she had expected is shattered. She is shocked to discover that Edie has been tampering with the supernatural and as Kate reads the contents of the diary, the shadows of Thornycroft’s past begin to stir.  Kate becomes fascinated by the history of the house and the legacy of the villagers who made a brave yet devastating decision during the outbreak of plague. The more she discovers, the more she realises that, hidden behind Eyam’s tragic story, is a dreadful family secret.  Stalked by her ex and restless spirits who harbour a dark secret, Kate realises she’s in danger - not only from the living, but from the dead.  As the haunting intensifies and layers of time peel away, Kate starts to uncover a chilling truth that has remained buried for centuries…",
  "genres": [
    "Historical Fiction",
    "Historical"
  ],
  "author": "Emma-Nicole Lewis",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/44097944-a-shadow-beyond"
}