{
  "title": "If This Is the Age We End Discovery",
  "description": "2019 Alice James Award WinnerFinalist for the 2021 National Jewish Book AwardBooklist, Starred Review: “The disciplines of poetry and physics might seem far afield from one another, but Ben-Oni draws on the odd properties of supersymmetry to create a dexterous collection of electric lyrics that defies conventions of science and syllabics alike. In fragments of text that float and swirl in staccato arrangements, Ben-Oni grapples with otherwise abstract principles made intimate in their idiosyncratic imagining: “They are not elegant. // I mean. My vibra- tions, my math. In particular. // The math holding me together is particularly faulty.” Projected outward, the poet’s vision captures relationships with breathtaking imagery, as when a poem slowly disentangles the speak- er’s connection with her father-in-law: “The air is grey. & osseous. Sheds soft down. My eyes water.” A series of “Poet Wrestling” poems define the book’s structure, and “Poet Wrestling with the Brxght Brxght Xyxs” recalls Ben-Oni’s previous collection, turn around, BRXGHT XYXS (2019), creating a multifaceted, intertextualverse} String Theory” invokes Hebrew gematria and the 11 dimensions hypothesized by string theory with equal ease, and serves as a cypher through which to understand preceding passages. An astonishing wverse} String Theory” invokes Hebrew gematria and the 11 dimensions hypothesized by string theory with equal ease, and serves as a cypher through which to understand preceding passages. An astonishing work for adventurous readers intrigued by science and literature.”Publisher's Weekly: \"The powerful and provocative second collection from Ben-Oni tackles major existential issues—creation, nullification, personal experience, objective truth—with grace, humor, and linguistic flair. A persistent refrain is the poet wrestling with scientific theories about the nature of reality as she applies her own poetic spin to creation. “Efes,” a Hebrew concept meaning “to nullify,” becomes the focus of these poems as they struggle to conceive of a universe possibly spiraling into nothingness: “Hallo I’m pretty sure my God thinks I’ve lost/ my way when I sing my ears {are} full/ of Dark Energy Efes/ & all these planets/ running away. Our universe/ on the run. & savage.” Here, there exists the profound and terrifying possibility that “One day, soon, there will be no more science fiction.” Yet, while the poet struggles with the big questions, she also makes room for a playful and wishful hope that the creative act can offer humanity a fresh perspective: “So place your bets/ that advanced civilizations don’t always/ not annihilate themselves. Woah./ Let’s try this again./ Reset.” This ruminative collection blends poetry and science to make the unknown sing.” “Through these breathtakingly elegant poems, Rosebud Ben-Oni proves once and for all that poetry and science are sisters. If This is the Age We End Discovery maps, like a series of carefully wrought equations, the physics of connection and loss. What does a love song echo against when it spins into space? What symmetries and risks are woven into our very code? How do we live wired for uncertainty, in the yawn of the universe we can’t control? Readers will find it impossible to escape this collection’s unparalleled gravitational pull.” —Jennifer Militello, author of A Camouflage of Specimens and Garments“Rosebud Ben-Oni's poetry is exquisite and astounding. This is a poet who is going places.” —Noelle Kocot\"I experience much boredom these days with the world and its predictable cruelties or poetry and its predictable safeties. This phenomenon of a book launches me with its wonder into space and the multiverse and then somehow discovers compassion where we might expect to find only absence of heat or light. Ben-Oni rides with and wrestles the horse of theory to the event horizon's brink, and at the point that empirical proof can take her no further, love transmutes undoing into possibility unimagined.\" —Kyle Dargan, author of Anagnorisis",
  "genres": [
    "Poetry",
    "Nonfiction"
  ],
  "author": "Rosebud Ben-Oni",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/44089386-if-this-is-the-age-we-end-discovery"
}