{
  "title": "Ani Maxima Salvation: The Complete Trilogy",
  "description": "Here, for the first time, you can own the complete trilogy that ends the Ani Maxima Saga which began all the way back with Ptolemy’s Child! These three books tell the story of when the Ch-khana have returned to Cassiopeia, but this time, they’re not coming in search of host bodies, nor do they wish to kidnap Ani Maxima. This time, they’ve come to punish and annihilate. The Ch-khana had once traced a ‘mission success’ signal to the Eta Cassiopeia system. Eleven years ago, they arrived in massive ships intent on taking the planet and it was there that they discovered a girl with supernatural powers named Ani Maxima. And it was there that the Ch-khana fell. It was there that the bounty was issued on Ani Maxima. Eleven years later, the Ch-khana have returned, only this time, it isn’t the Ch-khana from the planet Earth. These ships have come directly from the enemy home-world in the Andromeda Galaxy and they’ve somehow managed to blind Ani Maxima. But what the Ch-khana didn’t realize is that Ani Maxima isn’t alone anymore. Ten years ago, Ani was joined by two others. Now, there are three sisters. There are three who now stand between the Ch-khana and the destruction of all they know and love.  The entire Ani Maxima series was voted in the top 10 for \"Best Kindle Space Opera\" and \"Best Amazon Prime Books to Borrow\" by Goodreads! The Ani Maxima Files (the first series): Ptolemy’s Child SuperVirus Veiled Sky Enigma Flying in the Rain Silent Lucidity Flesh and Blood Soul Sister Social Animal Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Maelstrom, Endeavor, and Ghosts of Ophidian. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Hope Rising, One Crazy Summer, and Terraformer by McElhaney. EDITORIAL  \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/44089886-ani-maxima-salvation"
}