{
  "title": "Celestial Harmonies",
  "description": "Harmonia Caelestis is the product of a decade of labour: a monumental, part-autobiographical family history. If Helping Verbs of the Heart was an homage to his mother, then this is a memorial to his father. It is actually two works in one. Book 1, \"Numbered Sentences from the Life of the Esterházy Family\", comprises 371 paragraphs, some elusively succinct, others pages long, that amount to a gloriously kaleidoscopic romp through the centuries that lie behind this European dynasty. Not that the name Esterházy is ever uttered: the main protagonist of each episode is invariably identified as \"my father\", whether he is an anti-Habsburg Kuruc insurrectionist or a Habsburg-loyal Labanc, a hammer of the Ottomans, a dying old man, a prisoner of war, a lord charming enough to enchant Goethe himself, or a childless man, to mention but a few of \"my fathers\", all evoked through the language and literature proper to each persona. This strategy of anonymity allows Esterházy to extend his typically vast net of quotations to sources that originally have no family connotations whatsoever, thereby lending broader significance to the particulars of this one family, however grand, and, vice versa, appropriating the general (European) experience to the family's specific circumstances. The baroquely exuberant proliferation of anecdotal gleanings and fragments of real and fictional history, drawing on a gamut of written genres, from maxims to parables, from confessional autobiography to the account books and chronicles, is ultimately threaded together by an unobtrusive, profoundly witty and wise philosophical vein.Book 2, subtitled \"Confessions of an Esterházy family\", is ostensibly a more conventional family novel. Its very subtitle alludes to an earlier Hungarian masterpiece of the genre, Confessions of a Bourgeois, 1934-35 by Sándor Márai. It consists of a series of snapshots of key events in the lives of the author's great-grandfather, grandfather, father and the young Esterházy himself. These are built up, over two hundred numbered passages, into a more or less chronological portrait of a century-and-a-half of steady decline of the family's fortunes. After 1945 the Esterházys suffered an almost catastrophic repeat of the confiscations and curtailment of liberties that befell them during the short-lived Commune of 1919 one that not only stripped them of their former rank and privileges but threatened their very subsistence. Largely anecdotal and often absurd in tone, much of this is recounted with great gusto from the author's personal perspective, not least the stories of his own childhood, such as being accidentally dropped into the baptismal font; the trek to a godforsaken village in July 1950 when an official deportation order resulted in the family being dumped in one of two rooms in a peasant couple's house; schooldays and trips to matches with his football-mad father. For all the vicissitudes and uncertainties it describes, the tone of his writing throughout is one of blithely upbeat humour and harmony, without a hint of reproach, regret or complaint.\"A captivatingly rich novel in terms of both its form and its stance. Certainly it is the most striking work of the fifty-year-old author's career to date, and I would evenventure to call it an epitome of the Esterházy oeuvre. Given its formal richness, however, it is in a way also a compendium of two to three centuries of Hungarianprose.\" -Péter Dérczy, Élet és Irodalom\"This new novel is no less constructed of fragments than his earlier novels, and those are no less whole, but this has the widest span of any Esterházy composition to date: it is a sweeping, baroque work.\" -József Tamás Reményi, Népszabadság",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Hungary",
    "Hungarian Literature",
    "Historical",
    "Literary Fiction",
    "Literature"
  ],
  "author": "Péter Esterházy",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/441142.Celestial_Harmonies"
}