{
  "title": "Stronger than Death: How Annalena Tonelli Defied Terror and Tuberculosis in the Horn of Africa",
  "description": "Somalia's Mother Teresa chose love over fear. Amid a volatile mix of disease, war, and religious fundamentalism in the Horn of Africa, what difference could one woman make? Annalena Tonelli left behind career, family, and homeland anyway, moving to a remote Muslim village in northern Kenya to live among its outcasts - desert nomads dying of tuberculosis, history's deadliest disease.\"I am nobody,\" she always insisted. Yet by the time she was killed for her work three decades later she had not only developed an effective cure for tuberculosis among nomadic peoples but also exposed a massacre, established homes and schools for the deaf, advocated against female genital mutilation, and secured treatment for ostracized AIDS patients.Months after winning the Nansen Refugee Award from the UN in 2003, Annalena Tonelli was assassinated at one of the tuberculosis hospitals she founded. Rachel Pieh Jones, an American writer, was living a few doors down, having moved to Somaliland with her husband and two children just months before. Annalena's death would alter the course of her life.No one who encounters Annalena in these pages will leave unchanged. Her confounding, larger-than-life example challenges our assumptions about aid and development, Christian-Muslim relations, and what it means to put one's faith into practice. Brought vividly back to life through Jones's meticulous reporting and her own letters, Annalena presents us with a new measure of success and commitment. But she also leaves us a gift: the secret to overcoming the fear that pervades our society and our hearts - fear of disease and death, fear of terrorism and war, fear of others, and fear of failure.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Africa",
    "History",
    "Historical",
    "Christian"
  ],
  "author": "Rachel Pieh Jones",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/44141220-stronger-than-death"
}