{
  "title": "Prince of Persuasion",
  "description": "Get Book Two in the bestselling Sins and Scoundrels Series - an illegitimate son bent on revenge is swept up in an unexpected affair with an unexpected lady...  The gossips say his soul is as black as his cravats.  Handsome, enigmatic Duncan Kirkwood is the prince of London’s most exclusive—and wicked—gaming club. He founded his empire upon one goal: gaining vengeance against the man who sired him and abandoned his mother.  To society, Lady Frederica Isling is a quiet, proper duke’s daughter and wallflower. No one suspects she harbors a secret desire to become a renowned novelist. She’ll go to any lengths to conduct research for her manuscript, including infiltrating Kirkwood’s notorious club disguised as her brother.  It doesn’t take long for Duncan to realize the oddly garbed stranger penning notes at his hazard table is not who she pretends to be. When he discovers her identity holds the key to the revenge he’s been waiting for, he can’t believe his good fortune. But there’s something about Lady Frederica that stirs more than his desire for retribution.  Frederica finds herself drawn to the charming Mr. Kirkwood and curious about the darker side of the world she never knew existed. She knows she should stay far away from him and his life of sin, and yet she keeps returning for more.  As Duncan and Frederica become hopelessly entangled in each other’s lives, passion blossoms. With reprisal within his grasp at last, Duncan must make the impossible choice between gaining his revenge and persuading the woman who owns his heart to take the biggest gamble of all.  Read for FREE in Kindle Unlimited!  Book One: Duke of Depravity Book Two: Prince of Persuasion",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Historical Fiction",
    "Regency Romance",
    "Fiction"
  ],
  "author": "Scarlett Scott",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/44146774-prince-of-persuasion"
}