{
  "title": "Antisocial: Online Extremists, Techno-Utopians, and the Hijacking of the American Conversation",
  "description": "From a rising star at \n\nThe New Yorker\n\n, a deeply immersive chronicle of how the optimistic entrepreneurs of Silicon Valley set out to create a free and democratic internet—and how the cynical propagandists of the alt-right exploited that freedom to propel the extreme into the mainstream. \nFor several years, Andrew Marantz, a New Yorker staff writer, has been embedded in two worlds. The first is the world of social-media entrepreneurs, who, acting out of naïvete and reckless ambition, upended all traditional means of receiving and transmitting information. The second is the world of the people he calls \"the gate crashers\"—the conspiracists, white supremacists, and nihilist trolls who have become experts at using social media to advance their corrosive agenda. Antisocial ranges broadly—from the first mass-printed books to the trending hashtags of the present; from secret gatherings of neo-Fascists to the White House press briefing room—and traces how the unthinkable becomes thinkable, and then how it becomes reality. Combining the keen narrative detail of Bill Buford's Among the Thugs and the sweep of George Packer's The Unwinding,  Antisocial reveals how the boundaries between technology, media, and politics have been erased, resulting in a deeply broken informational landscape—the landscape in which we all now live. Marantz shows how alienated young people are led down the rabbit hole of online radicalization, and how fringe ideas spread—from anonymous corners of social media to cable TV to the President's Twitter feed. Marantz also sits with the creators of social media as they start to reckon with the forces they've unleashed. Will they be able to solve the communication crisis they helped bring about, or are their interventions too little too late?",
  "genres": [
    "Nonfiction",
    "Politics",
    "Technology",
    "Sociology",
    "History",
    "Audiobook",
    "Journalism"
  ],
  "author": "Andrew Marantz",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/44139381-antisocial"
}