{
  "title": "Never Fall in Love with a Rockstar",
  "description": "My name is Clover Calloway and I’ve lived two separate lives.  The first, I like to call “my past.” I never talk about it. I try not to think about it. My rockstar days of playing in one of the hottest bands on the planet are over. Along with the most volatile, beautiful, tragic love story of all time.  Over the past five years, I’ve settled into my second life. My “normal life.” The one where I work a normal job, hang out with normal people and fall in love with a normal, but wonderful guy. The life where I’m admittedly a little bored, but also safe.  My past wasn’t boring. But my past broke my heart into a million, unfixable pieces. So, I’m determined to keep it where it belongs—behind me.  And the man responsible for the shattering of me? Malachi Porter, lead singer and mastermind of Bright Tragedy, should stay there too. Far away from me and this idyllic life I’ve carved out for myself.  But what happens when my two lives collide?  When Malachi comes crashing into my perfectly normal world, he threatens to destroy it, promises to annihilate everything I’ve replaced him with.  He upends everything I thought I wanted and forces me to question the reasons I left Bright Tragedy all those years ago.  But I didn’t walk away five years ago, I ran. As fast as I could go. And while my heart is whispering that it’s different this time—that he’s different—my brain is screaming for me to run again.  Malachi Porter isn’t a normal guy. And he doesn’t belong in my “normal life.” But, nevertheless, he’s bound and determined to make a place for himself here.  I just hope my heart can survive him, that we don’t burn into another bright tragedy.",
  "genres": [
    "Romance",
    "Contemporary",
    "Second Chance",
    "Music",
    "Contemporary Romance",
    "Audiobook",
    "Musicians"
  ],
  "author": "Rachel Higginson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/44147839-never-fall-in-love-with-a-rockstar"
}