{
  "title": "Before the Pharaohs: Egypt's Mysterious Prehistory",
  "description": "Presents conclusive evidence that ancient Egypt was originally the remnant of an earlier, highly sophisticated civilization• Supports earlier speculations based on myth and esoteric sources with scientific proof from the fields of genetics, engineering, and geology• Provides further proof of the connection between the Mayans and ancient Egyptians• Links the mystery of Cro-Magnon man to the rise and fall of this ancient civilizationIn the late nineteenth century, French explorer Augustus Le Plongeon, after years of research in Mexico’s Yucatán Peninsula, concluded that the Mayan and Egyptian civilizations were related--as remnants of a once greater and highly sophisticated culture. The discoveries of modern researchers over the last two decades now support this once derided speculation with evidence revealing that the Sphinx is thousands of years older than Egyptologists have claimed, that the pyramids were not tombs but geomechanical power plants, and that the megaliths of the Nabta Playa reveal complex astronomical star maps that existed 4,000 years before conventional historians deemed such knowledge possible.Much of the past support for prehistoric civilization has relied on esoteric traditions and mythic narrative. Using hard scientific evidence from the fields of archaeology, genetics, engineering, and geology, as well as sacred and religious texts, Malkowski shows that these mythic narratives are based on actual events and that a highly sophisticated civilization did once exist prior to those of Egypt and Sumer. Tying its cataclysmic fall to the mysterious disappearance of Cro-Magnon culture, Before the Pharaohs offers a compelling new view of humanity’s past.",
  "genres": [
    "History",
    "Egypt",
    "Nonfiction",
    "Alternate History"
  ],
  "author": "Edward F. Malkowski",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/441336.Before_the_Pharaohs"
}