{
  "title": "The Great Pivot: Creating Meaningful Work to Build a Sustainable Future",
  "description": "American society currently faces a crisis in the world of work between outsourcing, automation, the gig economy, and low levels of employee engagement. At the same time, our transportation systems and means for producing energy, materials, and food are degrading life support systems on Earth. The solution, however, is we must abandon “business as usual” and draw up a blueprint for creating meaningful jobs that will also dramatically reduce waste and restore the natural world.The Great Pivot is that blueprint. It details 30 projects for developing advanced energy communities, low-carbon mobility systems, a circular economy, a rejuvenated food production system, and restoring nature. It starts, of course, with people. Americans want work that gives their lives purpose and meaning. First, however, we must ensure that everyone has shelter, food, and access to affordable healthcare and childcare, especially those lower on the socioeconomic ladder. By doing so, those securing meaningful work for the first time will be able to pull themselves up financially, while those currently working disappointingly unfulfilling jobs will jump to more meaningful employment, whether starting their own business or joining an existing team.The financial sector also wants more sustainability projects to invest in. By harnessing Silicon Valley’s startup culture of disrupting lumbering, inefficient industries, the Great Pivot will create both more effective and efficient jobs and manifold investment opportunities. Make no the investment needed to kickstart a sustainable future is considerable, but this money will go directly into the pockets of the millions of people doing this meaningful work, thereby providing the necessities of a stable, middle class life.With this bold vision we will not only save the environment, but in the process of creating millions of meaningful jobs, we will save ourselves. A sustainable future needs us to envision it, and it needs us to make it happen. It’s time to make the Great Pivot.",
  "genres": [
    "Nonfiction",
    "Sustainability"
  ],
  "author": "Justine Burt",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/44149495-the-great-pivot"
}