{
  "title": "Intellectual Property Law: A Practical Guide to Copyrights, Patents, Trademarks and Trade Secrets",
  "description": "This book is intended as both a primer on intellectual property law and as a general reference for authors, artists, musicians, librarians, entrepreneurs and others interested in learning about intellectual property law and the processes for obtaining copyrights, trademarks and patents in the U.S. and through international agreements. The main text provides a brief orientation on the relevant law and on the process and cost of applying for patents and trademarks through the U.S. Patent and Trademark Office and copyrights through the U.S. Copyright Office. In order to make this book as useful as possible as a one-stop reference resource, I have collected and included selective statutory materials, sample forms, and other useful resources in appendices to provide greater depth and context for the material presented in the main text. This book is intended as a general reference guide that will provide you with timely, useful information and direct you to additional sources of information both in its comprehensive appendices and online that are available free of charge from a variety of sources. It does not offer legal advice. Only an attorney can provide you with legal advice tailored to your specific needs, and neither this book nor any of the self-help guides or readily available document preparation services is a substitute for the advice of an experienced lawyer.For more information about the author and his published books, law-related textbooks, scholarly articles and blogs, you can visit: http://www.victordlopez.com.This book is available directly through CreateSpace at https://www.createspace.com/3646606 in a soft cover edition and at Amazon.com in both soft cover and Kindle editions.",
  "genres": [],
  "author": "Victor D. Lopez",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/12399394-intellectual-property-law"
}