{
  "title": "Blackout",
  "description": "What happens when the lights go out in the city that never sleeps?Games of chance, unexpected situations, and hours of sin!Thirteen bestselling and award-winning authors are turning up the heat in an anthology featuring brand-new show-stopping stories set in Las Vegas. Roll the dice and get ready to feel the heat!Close Encounter by \nStephanie St. Klaire\n:The day started with a quick screw, a couple of quirky two-bit cons and ended with a diabolical serial killer. What do you do when the lights go out? Run.The Do-Over by \nChristi Barth\n:The best way to move on after being dumped? A hot fling. An even better way? Revenge sex and the chance to turn the tables on the guy who dumped you... Night & Day by \nBethany Lopez\n:One explosive weekend together nearly ruined them. But, there's no way Simone and Micah can ignore their chemistry when they're alone in the dark.Night Games by \nT.K. Leigh\n: Note to self: Never agree to play an innocent dice game during a blackout in Vegas. I should have known it wouldn’t remain innocent, not in the city of sin.Absolutely Mine by \nTerri E. Laine\n:I made a promise to stay away from my best friend’s little sister. But it’s Vegas and that’s one promise I’m probably going to break.Just Us by \nJ.H. Croix\n:Ellie asks me to promise her one thing. We can’t tell her brother about us. Small problem though. One night will never be enough.Blind Faith by \nLauren Runow\n: I never expected to be locked out of my room basically naked in a total blackout. Thinking that would be the biggest shock of my night was my first mistake.Dirty Thoughts by \nC.A. Harms\n:He was the crush I never thought I’d see again. Yet here we were in Vegas, during a total blackout. I figure why not explore all the possibilities, or more like let him explore me?Going Down by \nLisa Shelby\n: She’s the only person I’ve ever loved and I’m the last person she wants to see. She’d hoped to avoid me as much as possible in Vegas, but when we get stuck alone in an elevator, not even she can deny that our chemistry still runs hot.Hard Luck by \nK.A. Ware\n:Ellis James is my kryptonite, the only person who could drag me back to Vegas after I promised myself I was done with that life. I'd bleed for her, I'd die for her, but can I save her?Becoming His by \nK.I. Lynn\n:When I slammed into Hollywood heartthrob Reid Gallagher, I never imagined it would turn into a first date I’d never forget. After all, what happens in Vegas, stays in Vegas...right?Honeymoon Hideaway by \nCary Hart\n:What’s worse than being locked in a room with a vibrating bed and your sworn enemy? Waking up next to him… naked! Did I mention he’s also my boss? Oops.Free Bird by \nLeddy Harper\n:She's a Vegas showgirl. He's a British rugby player.They have nothing in common ... until the lights go out.",
  "genres": [],
  "author": "Bethany Lopez",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/44152567-blackout"
}