{
  "title": "I’m in a Leadership Role, Now What?: A Concise, Practical, No Nonsense Guide to How College Students can Strengthen Their Leadership",
  "description": "Have you ever been thrust into a leadership role, and then thought \"Now What?\" If you took on a leadership role, right now, would you know where to start? Have you been told \"You need to take on a leadership position so you can put it on your resume,\" but then are never sure what to do once you're in that role?In this concise and easy-to-read book, Chris Molina answers these questions (and more) in a very practical way explaining how to strengthen your leadership skills.Today there are more people going to college than ever before, and the advice that college students are receiving is \"you need to differentiate yourself.\" Decades ago, simply going to college was enough to set one apart from everyone else--but not anymore. When today's college student asks how to differentiate themselves, the response is often to \"seek leadership opportunities\" or \"get a leadership position.\" Luckily, this book has been designed to address the common issues that new leaders encounter. This book will provide practical, no-nonsense, proven leadership advice that will accelerate your journey to becoming a trusted leader among your peers and will help you stand out.\"I'm in a Leadership Role, Now What?\" is different from other books on Leadership. Many other books are replete will fluff and lengthy stories that are only partially related to leadership traits & principles that will help you be a better leader. Not this book. Chris Molina employs brevity and it's clear that he chose the words in this book deliberately for you.Chris is also has a love for all-things that deal with leadership, and he's been able to practice leadership during his seven years of active duty in the Marine Corps, his four years at Purdue University as a Student Leader, his six months as a Government Contractor, and his three years as a Supply-Chain Specialist in the manufacturing/corporate industries.Following \"I'm in a Leadership Position, Now What?\", chapter by chapter, you will become a better leader through:  Understanding a commonly used formula which describes the optimal sources of learning, according to successful leaders.    Simple ways to overcome your limiting beliefs.  10 tried, true, proven and foundational leadership traits/principles that all solid leaders understand.    What people are getting wrong about their communication style.    Tips/hacks on how to be an effective communicator.  If you read this book, trust the process, and start applying it to your life then you will not only be a better leader, but you will stand out among your peers in your future endeavors.What's stopping you from fulfilling your potential and becoming an incredible leader? Are you ready to take a leap & start your leadership journey?Scroll to the top and click the \"buy now\" button.",
  "genres": [],
  "author": "Chris  Molina",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/44160764-i-m-in-a-leadership-role-now-what"
}