{
  "title": "How to Fight Anti-Semitism",
  "description": "The prescient New York Times writer delivers an urgent wake-up call to all Americans exposing the alarming rise of anti-Semitism in this country—and explains what we can do to defeat it. “Stunning . . . Bari Weiss is heroic, fearless, brilliant and big-hearted. Most importantly, she is right.”—Lisa Taddeo, #1 New York Times bestselling author of Three Women On October 27, 2018, eleven Jews were gunned down as they prayed at their synagogue in Pittsburgh. It was the deadliest attack on Jews in American history. For most Americans, the massacre at Tree of Life, the synagogue where Bari Weiss became a bat mitzvah, came as a total shock. But anti-Semitism is the oldest hatred, commonplace across the Middle East and on the rise for years in Europe. So that terrible morning in Pittsburgh raised a question Americans can no longer avoid: Could it happen here? This book is Weiss’s answer. Like many, Weiss long believed this country could escape the rising tide of anti-Semitism. But now the luckiest Jews in history are beginning to face a three-headed dragon known all too well to Jews of other times and places: the physical fear of violent assault, the moral fear of ideological vilification, and the political fear of resurgent fascism and populism. No longer the exclusive province of the far right, the far left, and assorted religious bigots, anti-Semitism now finds a home in identity politics and the reaction against identity politics, in the renewal of America First isolationism and the rise of one-world socialism, and in the spread of Islamist ideas into unlikely places. A hatred that was, until recently, reliably taboo, anti-Semitism is migrating toward the mainstream, amplified by social media and a culture of conspiracy that threatens us all. Weiss’s cri de couer is an unnerving reminder that Jews must never lose their hard-won instinct for danger, and a powerful case for renewing Jewish and American values in uncertain times from one of our most provocative writers. Not just for the sake of America’s Jews, but for the sake of America.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Jewish",
    "Judaism",
    "History",
    "Religion",
    "Antisemitism"
  ],
  "author": "Bari Weiss",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/44153249-how-to-fight-anti-semitism"
}