{
  "title": "The Complete Marriage Raffle Series",
  "description": "Alternate edition of ASIN B07P9TL842In the New Republic, every woman must marry five men. It’s the law. Welcome to the apocalypse.   Theirs to Protect  Nix never put his name in the marriage raffle for a reason. He doesn’t need a woman. There aren’t that many to go around anyway after a genetically engineered virus wiped out 90% of the female population. He has his job as head of the Security Squadron and it’s all he needs. He looks out for the township. He protects the few women there are left.  But when his name is called to be one of the five husbands to the woman rescued from the badlands, he doesn’t speak up to correct the error. Because Audrey’s like no one he’s ever met before. Fiesty. That’s the name for her. Not like so many of the women they’ve brought back before. She’s not broken. She might be just the woman to handle a rough, brutal man like him.  Theirs to Pleasure  Shay came into the township knowing she’d be a lottery bride. So she’d have to marry five men. She wasn’t the naïve girl she’d been eight years ago. She’d learned the lessons that had been beaten into her and she’d learned them well. So yes, so she’d share her body with her new husbands. But her secrets were still her own.  The men are different than she expected, though. They each had their own reasons for entering the lottery. There’s Charlie, who’s so sweet and kind. Rafe, who’s a light-hearted jokester during the day but dark and demanding in bed. Then Jonas and Henry and Gabriel, each bringing their own damage and beauty to the clan until, day by day, they begin to feel like a real family.  There’s just one little problem with the happy new family clan.  One of them isn’t who he appears to be. He is a spy for the enemy. Will Shay and the township be doomed before she and her husbands have a chance at lasting happiness?  Their Bride  All Vanessa ever wanted was to be loved. Okay, strike that—all she wanted was not to die at the hands of the homicidal maniac who was obsessed with hunting her down—and to be loved. Was that too much to ask?  The plan was simple: Go to Jacob’s Well. Enter herself in the Marriage Raffle. After years of barely surviving, finally get her happily ever after.  But nothing’s ever that simple, is it? Turns out she’ll have to fight tooth and nail for her fairytale ending. The prize has never been more worth it, though—Five men who love and adore her, and at long last, a home and a family. … if she survives to tell the tale.  Theirs to Defy  Drea was completely lost except for Eric’s hands cupping her face. Eric’s blue eyes piercing hers.  “This isn’t a marriage where each of us get a sliver of you. No, baby, that’s not how this is gonna work.  You have to give every one of us all of you. Pour it all out. Every single drop of yourself and trust that we’ll fill you back up.”  His stare only grew more intense. “We will never leave you. Never forsake you.  We are yours until the end of time.  And baby, you are ours.”  She defies them at every turn.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Post Apocalyptic",
    "Dystopia",
    "Audiobook",
    "Erotica",
    "Science Fiction Romance"
  ],
  "author": "Stasia Black",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/44150966-the-complete-marriage-raffle-series"
}