{
  "title": "The Wild Impossibility",
  "description": "A neonatal ICU nurse, consumed with grief over the losses of both her mother and newborn daughter, begins to suffer from a series of disturbingly vivid visions. A teenage girl is swept up in a doomed love affair with a young man interned at Manzanar, one of America's notorious concentration camps for Japanese-Americans during World War II. Though decades--and worlds--apart, the lives of these two women are indelibly intertwined, and the actions of one will have profound and lasting implications on the other.In Cheryl A. Ossola's dazzling debut, The Wild Impossibility, Kira Esposito comes to know her deceased grandmother, Maddalena, through a series of troubling dreams and daytime visions. She buries herself in her work, but even her grueling shifts in the NICU prove futile in keeping the frightening episodes at bay. Realizing her marriage, her job, and even her own life are at risk, she decides to discover the truth behind her visions--seeking answers to long-buried family mysteries.Chasing her family's story across California and into the desert of Owens Valley, home of the Manzanar internment camp, Kira uncovers startling secrets about the grandmother she never knew. Maddalena, an extraordinary young woman, had defied the demands of her family and the expectations of her community as she followed her heart to Manzanar, and into the arms of an imprisoned Japanese-American man. Despite the objections and disapproval of those both inside and outside of its walls, she returned again and again--and the consequences of her affair would impact generations to come.At once a powerful coming-of-age novel, a heartbreaking love story, and a harrowing tale of suspense, The Wild Impossibility masterfully illuminates the resilience of love in the face of tragedy, and the power of family to endure despite distance, time, and heartbreak.",
  "genres": [
    "Fiction"
  ],
  "author": "Cheryl A. Ossola",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/44160672-the-wild-impossibility"
}