{
  "title": "As You Desire",
  "description": "A rake in tarnished armor…Desdemona Carlisle has spent most of her young life dreaming of a knight in shining armor. When a dashing figure in midnight-black riding a snow-white steed comes to rescue her from the ruffians who have kidnapped her, she believes her destiny has finally arrived. She surrenders herself to the masked stranger’s embrace only to discover her rescuer is none other than Harry Braxton, the scoundrel who stole her heart when she was just a girl, adding it to his collection of exotic treasures as if it were just another trinket.Harry Braxton doesn’t want to be any woman’s knight-errant. He plays the role of notorious rake to hide the dangerous secret that has kept him from offering Desdemona his own heart. But his tarnished armor soon begins to crumple beneath the irresistible assault of Desdemona’s sparkling wit, her dazzling beauty, her teasing and tender touch. As a legendary treasure hunter, he never dreamed he’d be forced to give up the most priceless treasure of all.When Lord Ravenscroft, Harry’s aristocratic cousin, comes courting, Desdemona makes a startling discovery. She might yearn for a hero, but what she really needs is a man—the only man who can fulfill all of her desires…“Connie Brockway’s work brims with warmth, wit, sensuality and intelligence.”—Amanda Quick, New York Times bestselling author“If it’s smart, sexy, and impossible to put down, it’s a book by Connie Brockway!”—Christina Dodd, New York Times bestselling author“If you’re looking for passion, tenderness, wit, and warmth, you need look no further. Connie Brockway is simply the best.”—Teresa Medeiros, New York Times bestselling author“Connie Brockway’s work belongs on every reader’s shelf!”—Romantic Times“Connie Brockway delivers romance with strength, wit, and intelligence.”—Tami Hoag, New York Times bestselling author“Brockway’s lush, lyrical writing style is a perfect match for her vivid characters, beautiful atmospheric setting, and sensuous love scenes.” — Library Journal",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Friends To Lovers",
    "Egypt",
    "Victorian"
  ],
  "author": "Connie Brockway",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/44179169-as-you-desire"
}