{
  "title": "Sam Houston and the Alamo Avengers: The Texas Victory That Changed American History",
  "description": "The heart-stopping story of the fight for Texas by The New York Times bestselling author of George Washington's Secret Six and Thomas Jefferson and the Tripoli Pirates.In his now-trademark style, Brian Kilmeade brings alive one of the most pivotal moments in American history, this time telling the heart-stopping story of America's fight for Texas. While the story of the Alamo is familiar to most, few remember how Sam Houston led Texians after a crushing loss to a shocking victory that secured their freedom and paved the way for America's growth.In March 1836, the Mexican army led by General Santa Anna massacred more than two hundred Texians who had been trapped in a tiny adobe mission in San Antonio for thirteen days. American legends Jim Bowie and Davey Crockett died there, along with other Americans who had moved to Texas looking for a fresh start.The defeat galvanized the surviving Texians. Under General Sam Houston, a maverick with a rocky past, the tiny army of settlers rallied--only to retreat time and time again. Having learned from the bloody battles that characterized his past, Houston knew it was poor strategy to aggressively retaliate. He held off until just one month after the massacre, when he and his army of underdog Texians soundly defeated Santa Anna's troops in under eighteen minutes at the Battle of San Jacinto, and in doing so won the independence for which so many had died.Sam Houston and the Alamo Avengers recaptures this pivotal war that changed America forever, and sheds light on the tightrope all war heroes walk between courage and calculation. Thanks to Kilmeade's storytelling, a new generation of readers will remember the Alamo--and recognize the lesser-known heroes who snatched victory from the jaws of defeat.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Historical",
    "Military Fiction",
    "Military History"
  ],
  "author": "Brian Kilmeade",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/44177375-sam-houston-and-the-alamo-avengers"
}