{
  "title": "Duke of Shadows",
  "description": "A heartbroken belle. A missing suitor. A heroic duke in disguise. Unmask Duke of Shadows and let the highwayman-duke steal your heart!England, 1817. Lady Portia Tennesley has always dreamed of marrying for love. When the suitor who seemed her perfect match disappears at the height of the Season, she’s heartbroken. Eventually she consents to an arranged marriage with an eccentric duke she barely knows, a wealthy recluse who seems more interested in science than spending time with his new fiancée. But before Portia walks down the aisle to her grand, loveless match, she turns to the only man who can uncover her former beau’s fate—the mysterious outlaw known as Silversmoke.Lucas Wakeford, the Duke of Fountainhurst, leads a double life that leaves him little time for romance. After his parents died at the hands of brigands as a lad, he found his true passion in standing up for the powerless as his masked alter ego, the heroic highwayman, Silversmoke. As the duke, however—his charade as a scholarly quiz aside—Luke knows he must eventually marry. Besides, having a wife around could help him blend in with his fellow noblemen. Elegant and highborn Lady Portia Tennesley seems perfect for the sort of duchess Luke needs. A fashionable belle preoccupied with high society, she’s sure to keep her nose out of his secret life fighting crime in London’s underworld.But when the lady herself ventures into Silversmoke’s lair, begging for the famed highwayman’s help, Luke is astonished—and realizes he has seriously underestimated his future bride. Yet as Silversmoke, he can’t deny a damsel in distress, so he agrees to find her missing suitor. Tangled in a web of secrets and hidden identities, will Luke and Portia’s growing attraction be strong enough to survive the truth, or will their love steal away into the night?Duke of Shadows is the fourth standalone novel in the Moonlight Square regency historical romance series. If you like alpha males in disguise, scintillating chemistry, and a double dose of mystery, you’ll love New York Times bestselling author Gaelen Foley’s tale of undercover romance.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "British Literature",
    "Regency Romance"
  ],
  "author": "Gaelen Foley",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/44170123-duke-of-shadows"
}