{
  "title": "Freedom's Battle: The Origins of Humanitarian Intervention",
  "description": "Why do we sometimes let evil happen to others and sometimes rally to stop it? Whose lives matter to us? These are the key questions posed in this important and perceptive study of the largely forgotten nineteenth-century “atrocitarians”—some of the world’s first human rights activists. Wildly romantic, eccentrically educated, and full of bizarre enthusiasms, they were also morally serious people on the vanguard of a new political consciousness. And their legacy has much to teach us about the human rights crises of today.Gary Bass shatters the myth that the history of humanitarian intervention began with Bill Clinton, or even Woodrow Wilson, and shows, instead, that there is a tangled international tradition, reaching back more than two hundred years, of confronting the suffering of innocent foreigners. Bass describes the political and cultural landscapes out of which these activists arose, as an emergent free press exposed Europeans and Americans to atrocities taking place beyond their shores and galvanized them to act. He brings alive a century of passionate advocacy in Britain, France, Russia, and the United the fight the British waged against the oppression of the Greeks in the 1820s, the huge uproar against a notorious massacre in Bulgaria in the 1870s, and the American campaign to stop the Armenian genocide in 1915. He tells the gripping stories of the activists Byron, Bentham, Madison, Gladstone, Dostoevsky, and Theodore Roosevelt among them.Military missions in the name of human rights have always been dangerous undertakings. There has invariably been the risk of radical destabilization and the threatening blurring of imperial and humanitarian intentions. Yet Bass demonstrates that even in the imperialistic heyday of the nineteenth century, humanitarian ideals could play a significant role in shaping world politics. He argues that the failure of today’s leading democracies to shoulder such responsibilities has led to catastrophes such as those in Rwanda and Darfur—catastrophes that he maintains are neither inevitable nor traditional.Timely and illuminating, Freedom’s Battle challenges our assumptions about the history of morally motivated foreign policy and sets out a path for reclaiming that inheritance with greater modesty and wisdom.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "World History"
  ],
  "author": "Gary J. Bass",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/4416673-freedom-s-battle"
}