{
  "title": "The Collaborator",
  "description": "Is he a hero or a traitor? Based on astonishing true events set in the darkest days of World War II in Budapest, this is an enthralling story of heroism, vengeance, passion, and betrayal. It is also the story of three women linked by a secret that threatens to destroy their lives. For readers of The Tattooist of Auschwitz , All That I Am and Schindler's Ark (List).An act of heroism, the taint of collaboration, a doomed love affair, and an Australian woman who travels across the world to discover the truth...It is 1944 in Budapest and the Germans have invaded. Jewish journalist Miklos Nagy risks his life and confronts the dreaded Adolf Eichmann in an attempt to save thousands of Hungarian Jews from the death camps. But no one could have foreseen the consequences...It is 2005 in Sydney, and Annika Barnett sets out on a journey that takes her to Budapest and Tel Aviv to discover the truth about the mysterious man who rescued her grandmother in 1944.By the time her odyssey is over, history has been turned on its head, past and present collide, and the secret that has poisoned the lives of three generations is finally revealed in a shocking climax that holds the key to their redemption.PRAISE FOR DIANE ARMSTRONG'S FICTION'A cleverly crafted mystery... a good story, well told. Armstrong's skill in weaving an elaborate fabric out of her characters and subject matter stand her in good stead...the bleak wintry landscapes of the Polish countryside are vividly captured.' - Andrew Riemer, Sydney Morning Herald'Like Geraldine Brooks, Diane Armstrong's historical research is expertly woven into the fabric of a fictional tale, providing an engrossing `faction' of heroism and resilience which will appeal to both fans of fictional dramatic/romantic sagas, as well as lovers of insightful history' - Australian Bookseller & Publisher",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "Holocaust",
    "War",
    "Audiobook"
  ],
  "author": "Diane Armstrong",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/44231381-the-collaborator"
}