{
  "title": "You're the Cream in My Coffee",
  "description": "In 1928, Chicago rocks to the rhythm of the Jazz Age, and Prohibition is in full swing. Small-town girl Marjorie Corrigan, visiting the city for the first time, has sworn that coffee's the strongest drink that will pass her lips. But her quiet, orderly life turns topsy-turvy when she spots her high school sweetheart--presumed killed in the Great War--alive and well in a train station. Suddenly everything is up for grabs.  Although the stranger insists he's not who she thinks he is, Marjorie becomes obsessed with finding out the truth. To the dismay of her fiancé and family, she moves to the city and takes a job at a department store so she can spy on him. Meanwhile, the glittering world of her roommate, Dot, begins to look awfully enticing--especially when the object of her obsession seems to be part of that world. Is it really so terrible to bob her hair and shorten her skirt? To visit a speakeasy? Just for a cup of coffee, of course.  But what about her scruples? What about the successful young doctor to whom she's engaged, who keeps begging her to come back home where she belongs? And what, exactly, is going on at the store's loading dock so late at night?  Amid a whirlwind of trials and temptations, Marjorie must make a choice. Will the mystery man prove to be the cream in her coffee—the missing ingredient to the life she yearns for? Or will he leave only bitterness in her heart?  Written for the General Market (G) (I): Contains little or no; sexual dialogue or situations, violence, or strong language. May also contain some content of an inspirational/religious nature. Similar romance novels in this genre may be categorized as: christian romance, inspirational romance, christian fiction, and clean, wholesome romance. Carol Awards Winner Grace Awards Winner Selah Awards Nominee",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Christian Fiction",
    "Historical",
    "Christian",
    "Historical Romance",
    "20th Century"
  ],
  "author": "Jennifer Lamont Leo",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/44181837-you-re-the-cream-in-my-coffee"
}