{
  "title": "Ayat-Ayat Semesta: Sisi-Sisi Al Quran yang Terlupakan",
  "description": "”Penulis buku ini menjelaskan mata rantai antara Al-Quran sebagai wahyu Allah, dan ilmu pengetahuan sebagai olah pikir rasio manusia.” —Prof. Dr. Ir. Djoko Santoso Rektor ITB ”Sebuah karya penting yang mencoba menafsirkan ayat-ayat kauniyah Al-Quran dari perspektif sains modern. Patut dibaca semua kalangan.” —Prof. Dr. Mulyadhi Kartanegara Guru Besar Filsafat Islam UIN Jakarta *** Jika Einstein yang meyakini unifikasi 4 gaya di alam (gravitasi, nuklir lemah, nuklir kuat, elektromagnetik) berdasarkan fakta empiris, maka Abdul Salam, ilmuwan Muslim pemenang nobel fisika, meyakininya berdasarkan prinsip tauhid, yakni bahwa segala sesuatu adalah manifestasi dari Al-Ahad (Yang Satu). Jadi, di balik teori fisika yang sama, terdapat perbedaan keyakinan: empirisme vs tauhid. Al-Quran memerintah manusia untuk merenungi kejadian-kejadian di alam semesta. Perenungan itu di satu sisi akan mengantarkannya kepada pengenalan yang semakin baik akan keagungan Sang Pencipta dan di sisi lain, kepada penguasaan ilmu dan teknologi bagi kesejahteraan dan kelestarian manusia di bumi. Pengarang-seorang doktor fisika teoretis dan pengkaji-serius Al-Quran-mengajak kaum Muslim untuk merenungkan kembali ayat-ayat kauniyah yang terdapat di dalam Al-Quran. Ajakan ini lahir dari keprihatinan sang penulis betapa sebagian (besar) kaum Muslim dewasa ini melupakan ayat-ayat kauniyah dalam Al-Quran yang melukiskan fenomena-fenomena alam ini, dan sebaliknya, lebih berfokus pada ayat-ayat seputar keyakinan dan praktik ritual keagamaan (akidah dan fikih). Dengan mengumpulkan dan mengklasifikan 800 ayat Al-Quran serta menjadikannya sebagai inspirasi bagi pembentukan dan pengembangan ilmu pengetahuan, sang penulis ingin sekali memberikan kontribusi bagi upaya konstruksi sains yang bersemangat Qurani. Sebuah buku yang wajib dibaca bagi para pengkajian dan pencinta Al-Quran dan ilmu pengetahuan. *** “Dalam buku ini, Agus Purwanto ingin mengajak kaum Muslim untuk menaruh perhatian kepada sains sebagai panggilan Ilahi. Dia menunjukkan dengan sangat fasih bukan saja perhatian Al-Quran pada sains, tetapi juga perintah tegas Allah Swt. kepada umat Islam untuk mengembangkan sains dan teknologi. Bagi Agus Purwanto, yang terlibat dalam fisika sebagai missi sucinya, melakukan riset ilmiah adalah ibadah yang lebih utama daripada salat tahajud.” —Prof. Dr. Jalaluddin Rakhmat ”Penulis buku ini berimajinasi akan adanya sains matematika, astronomi, fisika, kimia dan biologi yang sejak awal dibangun dari kitab suci Al-Quran Al-Karim. Karena itu, buku ini wajib dibaca oleh mereka yang memimpikan bangkitnya kembali peradaban Islam. Peradaban masa depan bertumpu pada sains; tanpa sains, tidak ada masa depan.” —Dr. Freddy Permana Zen Fisikawan, ITB; penerima Habibie Award untuk Ilmu Dasar, Tahun 2006 ”Sebuah buku yang unik dan menarik yang pertama kali ditulis fisikawan partikel teori Indonesia. Buku ini patut dibaca oleh siapa saja yang ingin mengetahui pertemuan antara alam logika bebas dan alam wahyu ilahiah, dilihat dari sisi fisika.” —Dr. Terry Mart Fisikawan, UI; penerima Habibie Award untuk Ilmu Dasar, Tahun 2001 “Membaca Ayat-Ayat Semesta karangan Agus Purwanto ini benar-benar mencerahkan. Kita bukan hanya dihadapkan dengan kesejajaran antara konsep-konsep teori dan fakta sains modern dengan ayat-ayat Al-Quran, seperti yang dirintis oleh Maurice Bucaille yang melakukan interpretasi ilmiah Kitab Suci Al-Quran, tetapi menjadikan Kitab itu sebagai sumber hipotesis-hipotesis ilmiah yang bisa diuji secara eksperimen, langsung atau tak langsung, seperti yang dilakukan oleh Ibnu Sina dan para ilmuwan Muslim di zaman kejayaan peradaban Islam kurun pertama. Itulah sebabnya buku ini wajib dibaca dan dimiliki oleh para ilmuwan Muslim terutama pada kompilasi lebih dari 800 ayat yang berkaitan dengan alam semesta beserta indeksnya yang komprehensif sehingga memudahkan untuk mengambil inspirasi ilmiah yang cukup banyak.\" —Drs. Armahedi Mahzar, M.Sc. Fisikawan dan filsuf “Al-Quran berbicara banyak tentang alam semesta. Buku ini membantu para pembaca untuk mengetahui dengan mudah bagaimana pandangan Islam tentang alam semesta.” —K.H. Dr. Miftah Faridl “Buku ini semakin membuktikkan bahwa Al-Quran, sebagai mukjizat, memberi porsi yang besar terhadap alam semesta dalam berbagai aspeknya, dan ‘penafsiran’ yang diberikan oleh penulis buku ini (yang memang ahli di bidangnya) semakin mempertegas kehebatan Al-Quran.” —Prof. Dr. Afif Muhammad Direktur Pascasarjana UIN Sunana Gunung Djati, Bandung ”Penulis yang doktor fisika partikel juga melakukan rekonstruksi sains Islam dengan ontologi aksiologi dan epistemologi yang khas Islam melalui contoh-contoh lugas dan gamblang.” —K.H. Mujammil Hasba Pimpinan Pondok Pesantren Teropong Bintang Al-Hassan Jember Jatim",
  "genres": [
    "Science",
    "Nonfiction",
    "Islam",
    "Indonesian Literature"
  ],
  "author": "Agus Purwanto",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/4421536-ayat-ayat-semesta"
}