{
  "title": "Killer High: A History of War in Six Drugs",
  "description": "There is growing alarm over how drugs increasingly empower terrorists, insurgents, traffickers, and gangs. But by looking back not just years and decades but centuries, Peter Andreas reveals that the drugs-conflict nexus is actually an old story, and that powerful states have been its biggest beneficiaries.In his path-breaking Killer High, Andreas shows how six psychoactive drugs--ranging from old to relatively new, mild to potent, licit to illicit, natural to synthetic--have proven to be particularly important war ingredients. This sweeping history tells the story of war from antiquity to the modern age through the lens of alcohol, tobacco, caffeine, opium, amphetamines, and cocaine. Beer and wine drenched ancient and medieval battlefields, and the distilling revolution lubricated the conquest and ethnic cleansing of the New World. Tobacco became globalized through soldiering, with soldiers hooked on smoking and governments hooked on taxing it. Caffeine and opium fueled imperial expansion and warfare. The commercialization of amphetamines in the twentieth century energized soldiers to fight harder, longer, and faster, while cocaine stimulated an increasingly militarized drug war that produced casualty numbers surpassing most civil wars. As Andreas demonstrates, armed conflict has become progressively more \"drugged\" with the introduction, mass production, and global spread of mind-altering substances. As a result, we cannot understand the history of war without including drugs, and we similarly cannot understand the history of drugs without including war. From ancient brews and battles to meth and modern warfare, drugs and war have grown up together and become addicted to each other.",
  "genres": [
    "Nonfiction",
    "History",
    "War",
    "Politics",
    "Crime",
    "Psychology"
  ],
  "author": "Peter Andreas",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/44244922-killer-high"
}