{
  "title": "Kid Food: The Challenge of Feeding Children in a Highly Processed World",
  "description": "Most parents start out wanting to raise healthy eaters. Then the world intervenes.In Kid Food, nationally recognized writer and food advocate Bettina Elias Siegel explores one of the fundamental challenges of modern parenting: trying to raise healthy eaters in a society intent on pushing children in the opposite direction. Siegel dives deep into the many influences that make feeding children healthfully so difficult-from the prevailing belief that kids will only eat highly processed \"kid food\" to the near-constant barrage of \"special treats.\"Written in the same engaging, relatable voice that has made Siegel's web site The Lunch Tray a trusted resource for almost a decade, Kid Food combines original reporting with the hard-won experiences of a mom to give parents a deeper understanding of the most common obstacles to feeding children well:- How the notion of \"picky eating\" undermines kids' diets from an early age-and how parents' anxieties about pickiness are stoked and exploited by industry marketing- Why school meals can still look like fast food, even after well-publicized federal reforms- Fact-twisting nutrition claims on grocery products, including how statements like \"made with real fruit\" can actually mean a product is less healthy- The aggressive marketing of junk food to even the youngest children, often through sophisticated digital techniques meant to bypass parents' oversight- Children's menus that teach kids all the wrong lessons about what \"their\" food looks like- The troubling ways adults exploit kids' love of junk food-including to cover shortfalls in school budgets, control classroom behavior, and secure children's loveWith expert advice, time-tested advocacy tips, and a trove of useful resources, Kid Food gives parents both the knowledge and the tools to navigate their children's unhealthy food landscape-and change it for the better.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Food",
    "Health",
    "Nutrition",
    "Adult",
    "Childrens"
  ],
  "author": "Bettina Elias Siegel",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/44244947-kid-food"
}