{
  "title": "The Sting of The Scorpio",
  "description": "In Scorpio Rising, Monique Domovitch presented a compelling tale filled with colorful characters and the manipulation of power, ambition, and greed. Now she gives us its spellbinding sequel, The Sting of the Scorpio, where Alexander Ivanov returns to New York with his new bride, Brigitte. The real estate industry is ripe with opportunity. Blessed with irresistible charm, ambition, and the single-minded obsession to succeed, Alex plots and manipulates his way to almost mystical success. Everything he touches turns to gold, but it’s never enough. When a hostile takeover bid leaves him struggling to save his beloved company, he suspects those closest to him of plotting his downfall. Brigitte, the beautiful redhead who abandoned her country and her career to become his wife, feels alone. In return, Alex has betrayed her time and again, each indiscretion cutting deeper into her soul. Brigitte’s son, David yearns to be an artist, but Alex’s plans leave no room for such frivolous goals. He grooms a reluctant David to become the heir apparent until a devastating tragedy attracts the attention of another young man. The Sting of the Scorpio is a rich tale of a man at the mercy of his own greed and a woman bound by her need for love. Reviewed by Anne B. for Readers Favorite The Sting of the Scorpio by Monique Domovitch is the second book in her Scorpio Series and takes up where the first book ended. I always like to keep up with a series and sometimes I notice that the sequels can be a little less powerful than the first book. Not so with this sequel. It is as much a powerful drama as the first book. It has all the drama one could want, scheming, betrayal, infidelity, cheating and plotting, regardless of what it does to friends. In Sting of the Scorpio, Domovitch brings back the same cast of characters we met in book one along with new ones. This, as with the first book was impossible to put down, The turbulence and emotions played out through the novel are such that one has to continue reading to find out what is going to happen, right up to a surprise ending. This is a strong and powerful book with a lesson that shows no matter what, the mighty will eventually fall. All though I feel the book can be read as a standalone, to get the full impact you should read the first book in the series. I will be waiting patiently to see if the author comes out with another book in this series. Highly recommended. Alexander Ivanov returns to New York with his beautiful bride, Brigitte Dartois, and begins his dizzying climb to success. To attain his goals, Alex plots his way, betraying friends and creating enemies. When Power Properties becomes the victim of a hostile takeover attempt, Alex struggles to keep his beloved company, wondering who among those closest to him has turned on him.",
  "genres": [],
  "author": "Monique Domovitch",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/12401066-the-sting-of-the-scorpio"
}