{
  "title": "There's a Murder Afoot",
  "description": "Just in time for Sherlock Holmes's 166th birthday, the fifth installment in national bestselling author Vicki Delany's Sherlock Holmes Bookshop mystery takes Sherlockania to the max with a Holmes convention and historic 221 Baker Street.Gemma Doyle and her friends travel to London for a Sherlock Holmes convention--but will Gemma's father take the fall for a felonious forger's fatality? The 6th of January is Sherlock Holmes's birthday, and lucky for Gemma Doyle, January is also the slowest time of the year at both the Sherlock Holmes Bookshop and Emporium, and Mrs. Hudson's Tea Room. It's a good time for Gemma and her friends to travel to England for a Holmes Convention. For Gemma, the trip provides an opportunity to visit her parents, Jayne Wilson is excited about seeing all the sites London has to offer, and Ryan Ashburton just wants to spend some time with Gemma. But the trip is immediately derailed when Gemma's father Henry recognizes his brother-in-law Randolph Manning, who disappeared more than thirty years ago on the night he stole a valuable painting from his own parents. Henry, a retired detective with Scotland Yard, has been keeping tabs on the man's career as a forger of Old Masters and he warns Randy to stay away from his family. Randy is at the conference selling his own art, a series of sketches inspired by the Holmes Canon. The ever-observant Gemma notes that he isn't exactly popular with some of the other conference attendees, but when Randy is found dead after the banquet with a dazed and confused Henry Doyle standing over him, the police leap to assume his guilt. It's up to Gemma, with the help of her friends, to plunge into the \"lowest and vilest alleys\" of London to save her father from prison.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Audiobook",
    "Contemporary",
    "Books About Books"
  ],
  "author": "Vicki Delany",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/44240426-there-s-a-murder-afoot"
}