{
  "title": "Recognition",
  "description": "Departure - Book One of the Recognition Saga The worst possibilities faced by western civilization have come to pass. In the midst of chaos, who will govern, by what rules of law, and to what ends? Dr. Ezra Randall knows the answers because he was there, two hundred years before, helping to pick up the pieces. Unfortunately, the Guardian came to rule the world and Ezra’s legacy – de facto immortality – was corrupted in the process. Now Ezra’s grandson is about to be Recognized, a rite of passage that will allow authorities to monitor and control the boy’s every move. Desperate to save Myles, Ezra emerges from hiding, seizes his grandson, and takes him to the one place where he might be off-world. Orientation - Book Two of the Recognition Saga After Ezra Randall flees Earth with his grandson Myles in tow, they face danger on the surface of Mars and within Liberty First itself. Decades in the making, Liberty First's first-ever free elections promise a new period of freedom, but the nascent democracy is threatened when an old rivalry springs up. Can the colony hold together long enough for its fledgling political system to establish itself? Quickly making both friends and enemies, Myles finds working in a cohort more challenging than he'd ever imagined. Worse, not everyone on Mars is willing to play - or fight - fair. Meanwhile, the Guardianship, for decades to sole force of government for all of civilized Earth, is forced to fight a new kind of battle for as powerful external agents work against the dictatorship by targeting some of its most important members, including the Guardian himself. For decades the Guardianship has squelched rebellion with the stick of its military and the carrot of longevity, the end game of Recognition. Has that long-standing combination run its course? Accommodation - Book 3 of the Recognition Saga Impeached Ezra Randall has to deal with being exiled while his grandson Myles begins to realize what his potential is and what sacrifices will be required to reach it. On Earth, the Guardian finds that absolute power - his for decades - is never quite absolute after all. Men willing to risk their lives always have the final right to rebel. Now Sandra Anichi, one of the Seven Lords of the Guardianship has renounced her throne and left chaos in the wake of her departure. As tensions rise within two governments on separate worlds, Liberty First agents on Earth ramp up two very different plans to strike at the Guardianship, one to re-unite Liberty First's lost members with the rest of the group and the other to start a dirty war with the Guardianship itself by attacking its most central Recognition itself. When Ezra Randall returns to Earth to face the consequences of his betrayal two centuries earlier, a battle for supremacy and independence begins in earnest. Denouement Book 4 of the Recognition Saga. After Myles Randall's girlfriend Mary Hendrix is badly Injured by a bomb intended for him, he can't dwell on their faltering relationship for long. Liberty First's one chance to escape the Guardianship depends on his team, an incredible burden for such a young man to carry while trying to navigate tricky political waters with his adult team members. Kim Nguyen's Underground Railroad delivers Sandra Anichi, the Guardianship's disgraced North American Director, and Tonya Morgan, the femme fatale daughter of Celine Morgan, a well-known longevity researcher. Sandra finds few friends on Mars, but she knows the Guardianship is about the strike hard at Liberty First and how to stop them.",
  "genres": [],
  "author": "Marc  Moore",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/12402082-recognition"
}