{
  "title": "Our Better Angels: Seven Simple Virtues That Will Change Your Life and the World",
  "description": "This program includes an introduction read by President Jimmy Carter.Inspiring and insightful, Our Better Angels: Seven Simple Virtues That Will Change Your Life and the World celebrates the shared principles that unite and enable us to overcome life’s challenges together.\n“When the waters rise, so do our better angels.”—President Jimmy Carter\nJonathan Reckford, the CEO of Habitat for Humanity, has seen time and again the powerful benefits that arise when people from all walks of life work together to help one another. In this uplifting audiobook, he shares true stories of people involved with Habitat as volunteers and future homeowners who embody seven timeless virtues—kindness, community, empowerment, joy, respect, generosity, and service—and shows how we can all practice these to improve the quality of our own lives as well as those around us.A Vietnam veteran finds peace where he was once engaged in war. An impoverished single mother offers her family’s time and energy to enrich their neighbors’ lives. A Zambian family of nine living in a makeshift tent makes room to shelter even more. A teenager grieving for his mother honors her love and memory by ensuring other people have a place to call home. A former president of the United States leads by example with a determined work ethic that motivates everyone around him to be the best version of themselves.These stories, and many others, illustrate how virtues become values, how cooperation becomes connection, and how even the smallest act of compassion can encourage actions that transform the world around us. Here are tales that will make readers laugh and cry and embrace with passion the calling of our better angels to change the way we take care of ourselves, our families, our communities, and the world.Praise for Our Better Angels:\"Our Better Angels brings to light the basic virtues of kindness, generosity, respect, empowerment, community, joy, and service that we all have within us...This book is for humanity: Read it whether you’re a kid, a grandparent, or anyone in between. It will spark an instant realization of how even the smallest acts of kindness or respect can fundamentally change someone’s path for the better.” — Drew and Jonathan Scott, The Property Brothers“It has been our honor to work with Habitat for Humanity and see these seven virtues in practice. When we look outside of ourselves, we experience a glimpse of who we can be. Jonathan’s book reminds us to love one another. Amazing things happen when we do!” — Trisha Yearwood and Garth Brooks",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Spirituality",
    "Audiobook"
  ],
  "author": "Jonathan Reckford",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/44281073-our-better-angels"
}