{
  "title": "Feminine Masculine Balance: A Paradigm Shift for a Peaceful and Abundant Society",
  "description": "A vision for a Safer, Healthier, More Peaceful and Abundant World?We’re well into the twenty-first century, yet we continue to struggle with the same problems that have plagued us for centuries. Violence. Poverty. Inequality. Toxic relationships.As hopeless as it seems, however, real change is possible.The first step is to understand the driving force behind all the turmoil in the masculine and feminine energies are unbalanced on a global scale. Masculine attributes like competitiveness, rationality and detachment, while beneficial for all genders, grow dangerous when they dominate our value systems and to heal this, Jacqueline McLeod has devised a Feminine Masculine Balance table, which is the basis of her book.With compassion and humour, Jacqueline demonstrates how women and men alike can become better versions of themselves by valuing and respecting their feminine energies to the same level as their masculine energies.It’s past time for humanity to wake up. Jacqueline’s insights into our out-of-whack society—and her vision of a world in balance—will open your eyes to a new way of being.In a world of Feminine Masculine Balance (FMB) changes Negotiating disagreements peacefully thus eliminating war and domestic violence.Rejoicing in abundance and diversity in all areas of life and taking responsibility for healing the planetBeing healthier by integrating medicine with healing practices including understanding the need for a balance between activities (work and play) and stillness (sleep and meditation etc.).Parents collaborating with one another in assisting their children to reach their full potential on all levels of their being including young men no longer thinking they have to be the opposite of their mothers and young women learning about the balanced masculine from their fathers resulting in neither being stuck in claustrophobic stereotypes but rather being true to themselves.Choosing true power instead of power-over, including politicians collaborating with one another leading to true democracy and religions (particularly religious texts) being revised to be relevant to all genders and the modern world.Order your paperback or e-book copy today to become a better version of yourself by applying the knowledge from this book. Click Amazon's \"look inside\" feature to check out Feminine Masculine Balance before you buy.",
  "genres": [],
  "author": "Jacqueline McLeod",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/44291729-feminine-masculine-balance"
}