{
  "title": "Nothing More Dangerous",
  "description": "In a small town where loyalty to family and to “your people” carries the weight of a sacred oath, defying those unspoken rules can be a deadly proposition.After fifteen years of growing up in the Ozark hills with his widowed mother, high-school freshman Boady Sanden is beyond ready to move on. He dreams of glass towers and cityscapes, driven by his desire to be anywhere other than Jessup, Missouri. The new kid at St. Ignatius High School, if he isn’t being pushed around, he is being completely ignored. Even his beloved woods, his playground as a child and his sanctuary as he grew older, seem to be closing in on him, suffocating him.Then Thomas Elgin moves in across the road, and Boady’s life begins to twist and turn. Coming to know the Elgins--a black family settling into a community where notions of “us” and “them” carry the weight of history--forces Boady to rethink his understanding of the world he’s taken for granted. Secrets hidden in plain sight begin to unfold: the mother who wraps herself in the loss of her husband, the neighbor who carries the wounds of a mysterious past that he holds close, the quiet boss who is fighting his own hidden battle.But the biggest secret of all is the disappearance of Lida Poe, the African-American woman who keeps the books at the local plastics factory. Word has it that Ms. Poe left town, along with a hundred thousand dollars of company money. Although Boady has never met the missing woman, he discovers that the threads of her life are woven into the deepest fabric of his world.As the mystery of her fate plays out, Boady begins to see the stark lines of race and class that both bind and divide this small town, and he is forced to choose sides.",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Coming Of Age",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Allen Eskens",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/44284637-nothing-more-dangerous"
}