{
  "title": "Regarding the Duke",
  "description": "She married him for love. He married her for money. Can a marriage that started with lies turn into a ravishing love story for all time?  For the eight years of their marriage, sweet, innocent Gabriella Garrity has adored her powerful and darkly handsome husband Adam, whose moneylending empire has earned him the moniker of Duke of the City. Her domestic bliss is shattered when Adam suffers a traumatic accident. Although his life is saved, he loses his memory. Gabby dedicates herself to nursing him back to health…until devastating revelations destroy her illusions about their marriage.  From the moment he met lovely redheaded Gabriella, Adam knew that she would make him the perfect wife. Guileless, biddable, and sweetly unaware of her own charms, she also holds the key to his secret plot for vengeance. A self-made man who rose from the darkest streets of London, he values control above all and will stop at nothing to gain his justice—until an accident robs him of his memory. As he fights to remember his past, he comes to a stunning whoever he is, he is passionately in love with his own wife.  One by one, dark secrets emerge from Adam’s past as well as Gabby’s. The lovers struggle to steer a relationship gone off course…only to discover steamy marital adventures they never expected to find. All the while, a deadly villain lies in wait. Will husband and wife find the courage to trust one another and their love—before time runs out?  Find out in this scorching, long-awaited love story featuring anti-hero Adam Garrity and his beloved Gabby!   Full-length novel Heat This is a hot historical romance with sizzling love scenes.  Regarding the Duke is the 3rd book in the Game of Dukes series, which features hot, sexy romance, fun and feel-good happily ever afters, and intriguing mystery and adventure. This book can be enjoyed as a stand-alone novel and is also part of a series. The chronological order for Grace's series follows  Game of Dukes series (hot Victorian romance): Book 1: The Duke Identity (Harry &Tessa) Book 2: Enter the Duke (Ransom & Maggie) Book 3: Regarding the Duke (Garrity & Gabby, Preorder now!)",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Adult",
    "Second Chance"
  ],
  "author": "Grace Callaway",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/44283247-regarding-the-duke"
}