{
  "title": "Covert Narcissism: Signs of a Covert Narcissist, Ways to Protect Yourself from Their Manipulation and How to Deal with Their Narcissism",
  "description": "Covert narcissism is a hidden and concealed form of narcissism, making it all the more difficult for the abuser to be confronted or 'outed' for their behavior. Covert narcissism is a passive-aggressive, hostile and toxic form of abuse that makes victims feel hopeless, unheard, hurt and confused by the abusers behavior.  When you think of a narcissistic personality, it's likely you think of a loud, grandiose and 'look at me' type of character. A lot of people don't realize that there is a much stealthier, more introverted form of narcissism, and therefore covert narcissists can often get away with their toxic behavior without being found out.  I was in a relationship with a covert narcissist. I know the frustration, disappointment, anger and humiliation a covert narc can make you feel. I understand the helplessness you feel when you're in a relationship that has such an invisible toxicity that you think no one would believe you if you told them about it.  This book, driven by my desire to help and connect with other victims of narcissistic abuse, aims to give you the knowledge you need to stand up to covert narcissistic abuse. The chapters include:  - What is a Covert Narcissist? The Six Giveaway Signs of a Covert Narcissist  - Can a Covert Narcissist Love?  - Confusing Conversations With a Covert Narcissist  - The Effects Covert Narcissism Has on You  - Setting Boundaries and Interacting With a Covert Narcissist  - Looking After You - Ways to Leave a Vulnerable Narcissist  I've been through a decade of narcissism and abuse, and I strive to support those who are / have been through this kind of emotional abuse. I hope this book can someway in helping you understand the dynamics of a narcissistic relationship, but most of all, I hope it helps you find the strength to relinquish your role as a source of narcissistic supply to your abuser.",
  "genres": [],
  "author": "Louisa Cox",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/44291102-covert-narcissism"
}