{
  "title": "Listen, Whitey!: The Sounds of Black Power, 1965-1975",
  "description": "Noted music producer and scholar Pat Thomas spent five years in Oakland, CA researching Listen, Whitey! The Sounds of Black Power 1965-1975. While befriending members of the Black Panther Party, Thomas discovered rare recordings of speeches, interviews, and music by noted activists Huey Newton, Bobby Seale, Eldridge Cleaver, Elaine Brown, The Lumpen and many others that form the framework of this definitive retrospective. Listen, Whitey! also chronicles the forgotten history of Motown Records.From 1970 to 1973, Motown’s Black Power subsidiary label, Black Forum, released politically charged albums by Stokely Carmichael, Amiri Baraka, Langston Hughes, Bill Cosby Ossie Davis, and many others, all represented. Also explored are the musical connections between Bob Dylan, John Lennon, Graham Nash, the Partridge Family (!?!) and the Black Power movement. Obscure recordings produced by SNCC, Ron Karenga’s US, the Tribe and other African-American sociopolitical organizations of the late 1960s and early ’70s are examined along with the Isley Brothers, Nina Simone, Archie Shepp, Art Ensemble of Chicago, Clifford Thornton, Watts Prophets, Last Poets, Gene McDaniels, Roland Kirk, Horace Silver, Angela Davis, H. Rap Brown, Stanley Crouch, and others that spoke out against oppression.Other sections focus on Black Consciousness poetry (from the likes of Jayne Cortez, wife of Ornette Coleman), inspired religious recordings that infused god and Black Nationalism, obscure regional and privately pressed Black Power 7-inch soul singles from across America. 90,000 words of text are accompanied by over 250 large sized, full-color reproductions of album covers and 45 rpm singles — most of which readers will have never seen before.",
  "genres": [
    "Music",
    "History",
    "Politics",
    "Poetry",
    "African American"
  ],
  "author": "Pat   Thomas",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/12402123-listen-whitey"
}