{
  "title": "Fearless",
  "description": "THE WULFRITHS. IT ALL BEGAN WITH A WOMAN.A battle. A crown. The conqueror. The conquered. Medieval England—forever changed by the Battle of Hastings. And the rise of the formidable Wulfriths.A CAPTIVE NORMANSir Guarin D’Argent knew the danger of allowing a woman to turn him from his purpose, and yet he answered her cry across a bloody battlefield. Now he finds himself the lady’s captive among vengeful Saxons, weeks becoming months while his liege, Duke William of Normandy, subdues his new English subjects. Biding his time, Guarin plots an escape dependent on captivating his captor, a formidable quest with one more a warrior than a lady. But when his compassion is roused by the suffering of her people under Norman rule, the question of escape is jeopardized by the answer to who, exactly, is captivated—and in a conquered country, what hope there is for enemies beyond a kiss.A DEFIANT SAXONHer husband and young son slain by invaders, Lady Hawisa lives only for protecting her people. And revenge. While outwardly bending the knee to the usurper, she amasses rebels to send the conquerors back across the sea, along with the silver-haired warrior she never intended to take captive. Now that Guarin D’Argent has cause to wreak vengeance of his own and knows his captor is a Wulfrith, she dare not release him—just as she dare not succumb to his efforts to turn her from her purpose. But all changes when she is betrayed by one of her own. Will the struggle between the English resistance and the Normans find the two on opposite sides of the battlefield? Or might the Lord have other plans for them?From a fateful encounter on the battlefield of Hastings, to a rebel camp deep in the wood, to the threshold of the Harrying of the North, Sir Guarin and Lady Hawisa’s tale unfolds in the second book in the AGE OF CONQUEST series that reveals the origins of the Wulfriths of the bestselling AGE OF FAITH series. Watch for NAMELESS: Book Three releasing Autumn 2019.",
  "genres": [
    "Medieval",
    "Historical",
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Fiction",
    "Christian Fiction"
  ],
  "author": "Tamara Leigh",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/44282781-fearless"
}