{
  "title": "Sag Harbor",
  "description": "The warm, funny, and supremely original new novel from one of the most acclaimed writers in AmericaThe year is 1985. Benji Cooper is one of the only black students at an elite prep school in Manhattan. He spends his falls and winters going to roller-disco bar mitzvahs, playing too much Dungeons and Dragons, and trying to catch glimpses of nudity on late-night cable TV. After a tragic mishap on his first day of high school—when Benji reveals his deep enthusiasm for the horror movie magazine Fangoria—his social doom is sealed for the next four years.But every summer, Benji escapes to the Hamptons, to Sag Harbor, where a small community of African American professionals have built a world of their own. Because their parents come out only on weekends, he and his friends are left to their own devices for three glorious months. And although he’s just as confused about this all-black refuge as he is about the white world he negotiates the rest of the year, he thinks that maybe this summer things will be different. If all goes according to plan, that is.There will be trials and tribulations, of course. There will be complicated new handshakes to fumble through, and state-of-the-art profanity to master. He will be tested by contests big and small, by his misshapen haircut (which seems to have a will of its own), by the New Coke Tragedy of ’85, and by his secret Lite FM addiction. But maybe, with a little luck, things will turn out differently this summer.In this deeply affectionate and fiercely funny coming-of-age novel, Whitehead—using the perpetual mortification of teenage existence and the desperate quest for reinvention—lithely probes the elusive nature of identity, both personal and communal.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Coming Of Age",
    "Book Club",
    "Audiobook",
    "African American",
    "Literary Fiction"
  ],
  "author": "Colson Whitehead",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/4428988-sag-harbor"
}