{
  "title": "The Everlasting",
  "description": "\"Only Katy Simpson Smith could have written a novel of such elegance, emotional power, and grace. The Everlasting, a quadruple love story spanning two millennia, is no less than the story of love itself—its frustrations and thrills, its blunders and transcendent glories. Meraviglioso.\"—Nathaniel Rich, author of King ZenoFrom a supremely talented author comes this brilliant and inventive literary work of historical fiction, set in Rome in four different centuries, that explores love in all its various incarnations and ponders elemental questions of good and evil, obedience and free will that connect four unforgettable lives .Spanning two thousand years, The Everlasting follows four characters whose struggles resonate across the an early Christian child martyr; a medieval monk on crypt duty in a church; a Medici princess of Moorish descent; and a contemporary field biologist conducting an illicit affair.Outsiders to a city layered and dense with history, this quartet separated by time grapple with the physicality of bodies, the necessity for sacrifice, and the power of love to sustain and challenge faith. Their small rebellions are witnessed and provoked by an omniscient, time-traveling Satan who, though incorporeal, nonetheless suffers from a heart in search of repair.As their dramas unfold amid the brick, marble, and ghosts of Rome, they each must decide what it means to be good. Twelve-year old Prisca defiles the scrolls of her father’s library. Felix, a holy man, watches his friend’s body decay and is reminded of the first boy he loved passionately. Giulia de’ Medici, a beauty with dark skin and limitless wealth, wants to deliver herself from her unborn child. Tom, an American biologist studying the lives of the smallest creatures, cannot pinpoint when his own marriage began to die. As each of these conflicted people struggles with forces they cannot control, their circumstances raise a profound and timeless question at the heart of What is our duty to each other, and what will God forgive?Moving back through time from today (The Wilderness) to the Renaissance (The City) to the Middle Ages (The Grave) and finally to Rome under Marcus Aurelius (The Paradise), Tom, Guilia, Felix, and Prisca search and suffer for love in the eternal city, made vivid and familiar as they reappear in each century.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Italy",
    "Contemporary",
    "Literary Fiction",
    "Book Club"
  ],
  "author": "Katy Simpson Smith",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/44285782-the-everlasting"
}