{
  "title": "Right after the Weather",
  "description": "“This timely novel takes on friendship, desire, fear, and vulnerability in one incisive, witty, and powerful package.” —People “Astonishes with the force of its unexpected beauty.” —The New York Times Book Review The author of the “graceful and compassionate” (People) New York Times bestseller Carry the One presents a new and long-awaited novel exploring what happens when untested people are put to a hard test, and in its aftermath, find themselves in a newly uncertain world. It’s the fall of 2016. Cate, a set designer in her early forties, lives and works in Chicago’s theater community. She has stayed too long at the fair and knows it’s time to get past her prolonged adolescence and stop taking handouts from her parents. She has a firm plan to get solvent and settled in a serious relationship. She has tentatively started something new even as she’s haunted by an old, going-nowhere affair. Her ex-husband, recently booted from his most recent marriage, is currently camped out in Cate’s spare bedroom, in thrall to online conspiracy theories, and she’s not sure how to help him. Her best friend Neale, a yoga instructor, lives nearby with her son and is Cate’s model for what serious adulthood looks like. Only a few blocks away, but in a parallel universe we find Nathan and Irene—casual sociopaths, drug addicts, and small-time criminals. Their world and Cate’s intersect the day she comes into Neale’s kitchen to find these strangers assaulting her friend. Forced to take fast, spontaneous action, Cate does something she’s never even considered. She now also knows the violence she is capable of, as does everyone else in her life, and overnight, their world has changed. Anshaw’s flawed, sympathetic, and uncannily familiar characters grapple with their altered relationships and identities against the backdrop of the new Trump presidency and a country waking to a different understanding of itself. Eloquent, moving, and beautifully observed, Right after the Weather is the work of a master of exquisite prose and a wry and compassionate student of the human condition writing at the height of her considerable powers.",
  "genres": [
    "Fiction",
    "LGBT",
    "Contemporary",
    "Novels",
    "Audiobook",
    "Literary Fiction",
    "Adult Fiction"
  ],
  "author": "Carol Anshaw",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/44284646-right-after-the-weather"
}