{
  "title": "Greek Island Vampires: Erotic Vampire Love Story",
  "description": "The sexy, vampire love-story that destroyed all the ancient myths. Modern science tells us that blood sugars are released, along with endorphins, on the climaxing of both males and females. Governments worldwide tell us that vampires do not really exist.Because of the subject matter of the book, some adult themes are explored including those of a sexual nature so readership is limited to those over eighteen.The facts revealed in this book, told separately by Maria and by Jeffrey, tell us that sweet-blood lapping by vampires, after puncture, is tied into sex as much as canine tooth growth is tied into the climax. Night-time walking and the fear of the dawn, garlic and crucifixes are discarded to the Hollywood film bin as you read and learn not to drink alcohol to excess on your next foreign holiday.Maria, a small-island, seventeen-year-old virgin, dreams of a life on her neighbouring larger islands. Her move sees her willing to convert to being a vampire in her search for love from Jeffrey, and her female employers in this uplifting tale. The unknown government compiler that translated, from the Greek, Maria’s papers, allowing this author to merge them, time-wise, into Jeffrey’s English journal is to be commended as, without that work, Maria’s story may never have been told. The true story of vampire life may never have been revealed. “Explicit and erotic but without the usual swear words, which made this an enlightening, uplit, holiday read. ”“My heart went out to Maria, wishing she’d make the right choices at every turn.” “My thoughts leapt back to the early seventies, to my raucous, drunken behaviour on holiday with the girls, and how I could have easily become a victim.”Please do not read if upset by girl on girl or girl on boy relationships.",
  "genres": [],
  "author": "Stephenson Holt",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/44289796-greek-island-vampires"
}