{
  "title": "To Feel the Music",
  "description": "Neil Young took on the music industry so that fans could hear his music—all music—the way it was meant to be heard. Today, most of the music fans listen to is streamed via online services and highly compressed. It’s convenient, but, frustratingly, this comes at the cost of quality. Gone are the days when it was technologically necessary to compress music into the smallest possible file size, yet this remains the industry standard. The result is music that is robbed of its original quality—muddy and flat in sound compared to the rich, warm sound artists hear in the studio. It doesn’t have to be this way, but the record and technology companies have incorrectly assumed that most listeners are satisfied with these low-quality tracks. Neil Young is challenging the assault on audio quality—and working to free music lovers from the flat and lifeless status quo. To Feel the Music is the true story of Neil’s quest to bring high-quality audio back to music lovers—which he considers the most important undertaking of his career. Inside, follow Neil as he discovers the step by step deterioration of recorded sound as analog is methodically replaced by digital CDs, MP3s, and low-price, low-quality streaming; gathers others committed to his goal of delivering music the way artists intend for it to sound; and eventually develops the Neil Young Archives, a high-res streaming site that gives users unprecedented access to all of Neil’s music—in the best quality their devices can handle—videos, photos, and more. Neil’s efforts to bring quality audio to his fans garnered media attention when his Kickstarter campaign for his Pono player—a revolutionary music player that would combine the highest quality possible with the portability, simplicity and affordability modern listeners crave—became the third-most successful Kickstarter campaign in the website’s history. It had raised more than $6M in pledges in 40 days. Encouraged by the enthusiastic response, Neil still had a long road ahead, and his Pono music player would not have the commercial success he’d imagined. But he remained committed to his mission, and faced with the rise of streaming services that used even lower quality audio, he was determined to rise to the challenge. An eye-opening read for all fans of Neil Young and all fans of great music, as well as readers interesting in going behind the scenes of product creation, To Feel the Music has an inspiring story at its One determined artist with a groundbreaking vision and the absolute refusal to give up, despite setbacks, naysayers, and skeptics.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography"
  ],
  "author": "Neil Young",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/44303827-to-feel-the-music"
}