{
  "title": "Summer Reading",
  "description": "Can reading change your life? Following her acclaimed novel The Doctor's Daughter, award-winning author Hilma Wolitzer has now written a stirring tale about friendship, romance, inspiration, longing, and, especially, the love of good books. Summer Reading offers a seductive glimpse into the intersecting lives of three very different women. Summer in the Hamptons means crowded beaches during the day and lavish parties in the evening, but Angela Graves, a retired English professor, prefers the company of Gabriel Garcia Marquez and Charlotte Bronte. Her only steady social contacts are with the women in the reading groups she leads, among them, is wealthy Lissy Snyder, a beautiful newlywed who hosts the twice-monthly meetings of the Page Turners and takes pains to hide a reading disability and her emotional neediness. Hamptons local Michelle Cutty, Lissy's housecleaner, eavesdrops on the group's discussions-of books and gossip-when she's not snooping through Lissy's closets. All three women secretly struggle with troubling personal issues that threaten the tenuous balance of their lives: Lissy, abandoned by her father in childhood, is now the unwilling stepmother of her husband's hostile children; Michelle, resentful of the moneyed arrogance of the jet-setting, seasonal \"invaders,\" can't secure a commitment from her fisherman boyfriend; and solitary, bookish Angela still bears the shameful memory of a disastrous love affair that took place long ago. As Angela encourages the Page Turners to identify with the literary heroines of Trollope and Flaubert, the books-in fact, the act of reading itself-will influence the tough choices the women must make. Stunningly evocative and richly imagined, Summer Reading explores the meaning and consequences of living an authentic life. \"From the Hardcover edition.\"",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Womens",
    "Books About Books",
    "Womens Fiction",
    "Relationships",
    "Romance"
  ],
  "author": "Hilma Wolitzer",
  "average_rating": "2.77",
  "url": "https://www.goodreads.com/book/show/44308.Summer_Reading"
}