{
  "title": "No Woman's Land",
  "description": "*** Winner of the 2019 International Book Awards Contest Readers' Favorite in the Historical Fiction category *** “It was very dangerous for him, and he knew it. But his love for me was stronger than fear.” - Ilse Stein This novel is based on the inspiring and moving love story of Ilse Stein, a German Jew, and Willy Schultz, a Luftwaffe Captain in the Minsk ghetto, who risked his life to save the one he loved the most. When the last of the Jews’ rights are stripped in 1941, Ilse’s family is deported to a Minsk ghetto. Confined to a Sonderghetto and unable to speak the locals’ language, Ilse struggles to support the surviving members of her family. Befriended by a local underground member Rivka, Ilse partakes in small acts of resistance and sabotage to help her fellow Jews escape to the partisans. A few months later, after losing almost his entire brigade of workers to one of the bloodiest massacres conducted by the SS, a local administrative officer Willy Schultz summons the survivors to form a new brigade. Ilse’s good looks immediately catch his eye, and he makes her a leader of the new unit and later, an office worker. Soon, an unlikely romance blossoms amid death and gore, moving a Nazi officer to go to great risks to protect not only Ilse but as many others as possible and allowing a Jewish girl to open her heart to the former enemy. Knowing that the ghetto would soon be liquidated, Willy Schultz swears to save Ilse, even if the cost would be his own life. “We live together, or we die together,” - an ultimate oath of love in the most harrowing setting. Dark, haunting, but full of hope, “No Woman’s Land” is a testament to the love that is stronger than fear and death itself.Book two in \"Women and the Holocaust\" series. Also in the same \"Emilia\" (book 1)\"Auschwitz Syndrome (book 3)",
  "genres": [
    "Historical Fiction",
    "Holocaust",
    "Historical",
    "World War II",
    "Romance",
    "Fiction",
    "War"
  ],
  "author": "Ellie Midwood",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/44299861-no-woman-s-land"
}