{
  "title": "The Pale-Faced Lie",
  "description": "A violent ex-con forces his son to commit crimes in this riveting new memoir\n\nGrowing up on the Navajo Indian Reservation, David Crow and his three siblings idolized their dad. Tall, strong, smart, and brave, the self-taught Cherokee regaled his family with stories of his World War II feats. But as time passed, David discovered the other side of Thurston Crow, the ex-con with a code of ethics that justified cruelty, violence, lies—even murder.A shrewd con artist with a genius IQ, Thurston intimidated David with beatings to coerce him into doing his criminal bidding. David’s mom, too mentally ill to care for her children, couldn’t protect him. One day, Thurston packed up the house and took the kids, leaving her with nothing. Soon he remarried, and David learned that his stepmother was just as vicious and abusive as his father.Through sheer determination, and with the help of a few angels along the way, David managed to get into college and achieve professional success. When he finally found the courage to stop helping his father with his criminal activities, he unwittingly triggered a plot of revenge that would force him into a showdown with Thurston Crow. With lives at stake, including his own, David would have only twenty-four hours to outsmart his father—the brilliant, psychotic man who bragged that the three years he spent in the notorious San Quentin State Prison had been the easiest time of his life.The Pale-Faced Lie is a searing, raw, palpable memoir that reminds us what an important role our parents play in our lives. Most of all, it’s an inspirational story about the power of forgiveness and the ability of the human spirit to rise above adversity, no matter the cost.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "True Crime",
    "Biography",
    "Book Club",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "David   Crow",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/44323024-the-pale-faced-lie"
}