{
  "title": "بر الخيتعور",
  "description": "النيل والفرات:\"فرّ طلباً للأهوية الندية التي تجود بها الأرض، وتنفس بها الحقول المروية في الأمسيات. في الخارج أزاح اللثام عن أنفه وشفتيه، وابتلع الهواء بشهقة إنسان يحتضر. شهق مرة، مرتين، ثلاثاً، ولكن الصدر لم يستعر من الهواء أنفاساً، فاشتد الخناق. اشتد الاختناق، وشلّه وهن، فكيف يستعين على موت الهواء في الهواء؟ سرت في الأطراف رجفة، ونزّ من البدن عرق، وأصاب الرأس دوار. انهار أرضاً، واستلقى على تراث بثّ فيه الليل برداً لذيذاّ. ودس اليدين والقدمين في جوف التراب، ولاحق في الفراغ أنواء. امتصّ التراب الحمّى، ووهبته الأنواء عزاءً خفيفاً، ففكر في العدالة. استعاد \"ايمري\" الآخر، \"ايمري\" الغاض، فحاوره عن العدالة. قال أنه أراد أن ينصف عزيز القوم، ويرحم شيخوخة صاحب ملك ذلّ، فاختار ألين قصاص، ولكن الخفاء جعله قصاصاً أسواً من كل قصاص، فوجد نفسه يقترف جرماً اشمأزت منه الأرض قبل أن تتبرأ منه السماء: إنكار الإحسان! لم ينكر إحساناً فحسب، ولكنه وهب لنفسه حقاً تنصل من وزره الحكماء، فنصب نفسه حكماً قضى بإخراج تائه من \"واو\" فاستعار حق الإله عندما أمات، فهل يشفع حسن النوايا في إنزال عقوبة الموت بمخلوق حتى ولو لم يكن من أهل البراءة؟ أيحق لإنسان أن يدين الإنسان؟ أيحق لأكابر الواحدة أن يدينوا وليّ أمرهم، وهم يعلمون أنهم يتشدقون بعدالة لا وجود لها في وطن العطب والفساد؟ لماذا ينقلب كل أمر سماوي إلى ضدّه، ما إن يهبط الأسافل ويقع بين يدي الأنام؟ ما نفع الحياة بلا عدالة، وما نفع عدالة تتحول مسخاً ما إن يتداولها الناس؟ أيقنع بما يقال ويبرئ نفسه من الإثم بالإيمان الذي ينفي وجود العدالة تحت قبة السماء؟\"... همّ بأن يتساءل، ولكنه قفز من الأرجوحة.. خرج إلى الدغل، وعبر الأحراش، واجتاز حقول الزرع، وترجل حتى بل البرّ، اكتأبت الأرض، وعبس العراء، وفرشت له الصحراء السبيل حجارة وسراباً. قطع مسافة، التفت إلى الوراء، فرأى نسيجاً لامعاً، كثيفاً أبدعه الخيتعور، يتعلق بفراغ يخيم فوق واحدة بلا اسم\". نمطية روائية توحي بتمرد على المألوف، وتشي بأن الإنسان ابن بيئته حتى لو أراد إبداع الغريب. إنه إبراهيم الكوني المقتحم وبكل ثقة وجرأة مناخي الرواية والصحراء، يشكلها معاً بشكل لا يدع للقارئ فرصة للالتفات خارج حدود الرواية وسطورها، يأخذه في رحلة عبر صحراء أبدعها الخيال بخيوط الواقع، يسترسل القارئ مع الكوني ويضحي ضمن مناخ كوني يشبع الخيال بسرديات الجن والكائنات الصحراوية، ويلطف الذاكرة بالأساطير المسنوجة من وحي الصحراء المسكونة بهواجس وأطياف أشبعت خيال إبراهيم الكوني وأترعته بجمالات وبصور تتراءى حية أمام ناظر القارئ. إلا أن الكوني لم يكن ذاك الروائي المسطح، إذ أنه، ومن وحي الواقع، استلهم أفكاراً تعبر عن معاناة الإنسان في وجوده \"العدالة، الموت، الحياة، المسميات...\". أفكار تداخلت في عمق الفلسفة الإنسانية طرحها الكوني ضمن مناخات صحراوية رائعة، لا يسع القارئ إلا أن يتماهى معها ويسكن فيها وإليها.",
  "genres": [
    "Novels"
  ],
  "author": "إبراهيم الكوني",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/4432415"
}