{
  "title": "Ethan and Ava",
  "description": "New Adult 69K words Ethan Jackson has had a thing for Ava Anderson longer than he cares to remember. But her brother is one of his best friends and there are rules and crap about stuff like that. But she's always there, right in front of his eyes and the wanting is only getting worse as the days go by. What, exactly, is a guy supposed to do? Excerpt: Ava quickly walked through the house and barricaded herself in the bathroom. Hearing the door slam shut, Ethan felt his temper rise as he followed her into the hallway and leaned against the wall, waiting for her to come out. The longer she ignored him, the more his fury grew. She finally came out of the bathroom, still ignoring him completely. He was hot on her heels as she went inside her bedroom. He gave her no choice, he followed her inside and shut the door, leaning against it with his arms crossed. She watched him with both anger and what looked like a tiny hint of trepidation. Shit if that didn't soothe him somewhat. But then she opened her mouth and his ire came roaring back to life. \"Get out,\" she ordered flatly. He shook his head, it was all he could manage without snapping at her. Her shoulders stiffened. \"Ethan. Get the hell out of my room.\" Other than fisting his hands, he remained perfectly still. He felt a burning itch to move across the room to impose on her personal space, but he knew that idea would be utter insanity. He soothed himself with a biting question. \"What the hell was in your head when you decided to go there tonight?\" Her eyes sharpened as her mouth flattened into a grim line. \"Nothing. None of your business. Get out.\" He sucked in oxygen through his teeth as he tried to calm down. \"Ava. Listen to me. Ty was past irresponsible when he took y'all there—“ She cut him off with unbridled anger. \"Bullshit. It was only a party.\" Well hell, she wanted to cuss at him? \"Bullshit? Bullshit?\" he bit out. She glared at him from across the room and he felt his temperature kick up another notch as he slammed her with his opinion. \"You didn't need to be there tonight. You took advantage of the fact that your parents are out of town—“ She interrupted him, the pretty lines of her face drawn into a scowl. \"This doesn't concern you at all. Who the hell do you think you are to lecture me?\" Her anger only pissed him off further. \"Ava—\" he growled. \"You're nobody, that's who you are. Nobody who will ever have any say-so over me.\" \"Nobody?\" She stared at him in belligerent silence, her nostrils flaring. He pushed off the door with a booted foot and took a single step forward, mounting rage mixing with never ending hunger making a volatile shitstorm of emotion damn near overflow. He contained it to one cutting comment. \"Your brother is worthless when it comes to protecting you--\" She cut him off. \"I don't need his stupid protection and I damn sure don’t need your protection and I repeat—it’s not your business.\" Although her anger was palpable, Ethan's gaze was drawn to her chest, which was rising and falling in agitation. Forcing himself to get a grip, he looked into eyes that were shooting daggers at him. \"I've known you since you were a little kid and if Ty won't take care of this bullshit, then you can bet your ass I will.\" She clenched her teeth, looking as if she wanted to punch him. \"I don't need another brother. You're not my damn brother, Ethan.\" He tried to rein it in but her answer set him off. He felt a jolt of adrenaline and lowered his tone to a firmly modulated threat. \"Oh, you got that goddamn straight. I'm not your brother.",
  "genres": [
    "Contemporary Romance",
    "High School",
    "Romance",
    "College",
    "Young Adult",
    "Sports",
    "New Adult"
  ],
  "author": "Lynda Chance",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/44331617-ethan-and-ava"
}