{
  "title": "Der Bücherdieb",
  "description": "La doppia vita di Daniel Brodin, giovane poeta parigino col vizio di rubare libri, sospeso tra il mondo dell'alta letteratura e i bassifondi della piccola criminalità.Un romanzo d'avventure dove si fondono esistenza boehemienne, umorismo e tragedia.“Il ladro di libri” racconta le avventure di Daniel Brodin, giovane poeta nella Parigi del dopoguerra, che conduce una doppia vita tra il mondo della letteratura alta e una sgangherata avanguardia artistica i cui confini si confondono con quelli della criminalità parigina. I due mondi si incontreranno con esiti disastrosi per la vita del protagonista. Un ritratto della giovinezza francese del dopoguerra, all'ombra dell'esistenzialismo, tra boheme, alcol, droga e i continui espedienti per non essere integrati nella vita \"normale\".Parigi, 1953. Daniel Brodin, giovane poeta sconosciuto diventa una stella della scena letteraria parigina in seguito a un plagio. Il suo segreto è però scoperto da un singolare aristocratico che decide, almeno per il momento, di tenerlo nascosto. Il plagio non è l'unico vizio di Daniel Brodin: il giovane ruba infatti compulsivamente nelle librerie della capitale, finché, fuggendo da un libraio inferocito, si imbatte in Gilles e Linda, membri di una sedicente avanguardia artistica legata al sottobosco criminale parigino. Daniel comincerà una vera e propria doppia vita tra la Parigi letteraria e un mondo a lui sconosciuto fatto di alcol, personaggi bizzarri e piccoli crimini, fin quando la situazione diventerà ingestibile e sarà costretto ad abbandonare la città dopo un furto in un appartamento che finisce in tragedia.“Il ladro di libri” è un romanzo d'avventure, in cui umorismo e dramma si fondono. È il ritratto di un'epoca che annuncia la nostra, e di una giovinezza contestataria che da lì a poco sfocerà nella protesta del Maggio '68.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Fiction",
    "Historical Fiction",
    "Graphic Novels Comics",
    "Historical",
    "France"
  ],
  "author": "Alessandro Tota",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/44320456-der-b-cherdieb"
}