{
  "title": "Sack of Gold",
  "description": "Dusty’s the town clown. Joseph is the uptight Sheriff. Sparks fly when these opposites collide.  Sheriff Joseph has kept a controlled eye on the quiet shifter community of Morningwood. As an alpha lion, he watches his town like he would his pride. Most days are peaceful, and that’s how he likes it. So, when Clydesdale shifter—and budding bad boy—Dusty starts pulling pranks, Joseph is quick to shut down his antics. Except, with each event, it becomes clear to Joseph that Dusty might be something more than just a thorn in his side.  Though they are in college, Dusty’s friends have all begun finding their mates, leaving him bored and lonely. Instead of sowing his wild oats, he’s left alone with his worries. His whole life he’s assumed he was an alpha, had lied to his friends claiming he was, but really, he doesn’t know. And won’t until he can find someone to be his first. Not so easy in a small, secluded town. He knows who he wishes would volunteer—his crush on the sheriff has grown to embarrassing proportions. Sheriff Joseph has all the emotions of a statue, and there is nothing Dusty would love more than to crack that cool facade. If only the Sheriff felt the same way.  When a new shifter comes to town, sniffing around Dusty and offering him a wild, carefree life, Joseph can’t ignore his attraction. He won’t let his fear of the town finding out, or Dusty’s age to dissuade him. He has to claim his mate or lose him forever. But can someone like him be the alpha Dusty needs?  Sack of Gold is the fourth book in the Welcome to Morningwood Omegaverse series and can be read as a standalone. It’s a steamy, fun romp that may or may not include sexy leprechauns. Hint: It definitely does.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Omegaverse",
    "Fantasy",
    "LGBT"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/44328455-sack-of-gold"
}