{
  "title": "The Palestinian Delusion: The Catastrophic History of the Middle East Peace Process",
  "description": "Every negotiated settlement between the State of Israel and its Palestinian adversaries has failed to establish a stable and lasting peace. This is the history of what was attempted, why those failures were inevitable, and what must be done instead.Every new American President has a plan to bring about peace between the Israelis and the Palestinians, and every one fails.Every “peace process” has failed in its primary to establish a stable and lasting accord between the two parties, such that they can live together side-by-side in friendship rather than enmity.But why? And what can be done instead?While this failure is a consistent pattern stretching back decades, there is virtually no public discussion or even basic understanding of the primary reason for this failure.The Palestinian Delusion is unique in situating the Israeli/Palestinian conflict within the context of the global jihad that has found renewed impetus in the latter portion of the twentieth century and the beginning of the twenty-first. Briskly recounting the tumultuous history of the “peace process,” Robert Spencer demonstrates that the determination of diplomats, policymakers, and negotiators to ignore this aspect of the conflict has led the Israelis, the Palestinians, and the world down numerous blind alleys. This has often only exacerbated, rather than healed, this conflict.The Palestinian Delusion offers a general overview of the Zionist settlement of Palestine, the establishment of the State of Israel, and the Arab Muslim reaction to these events. It explores the dramatic and little-known history of the various peace efforts—showing how and why they invariably broke down or failed to be implemented fully. The Palestinian Delusion also provides shocking evidence from the Palestinian media, as well as statements from the Palestinian leadership, showing that negotiations between Israel and the Palestinians will never work.But there is still cause for hope. Spencer delineates a realistic, viable alternative to the endless and futile “peace process,” that shows how the Jewish State and the Palestinian Arabs can truly coexist in peace—without illusions or unrealistic expectations.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Israel",
    "Islam",
    "Audiobook",
    "Judaism"
  ],
  "author": "Robert Spencer",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/44321367-the-palestinian-delusion"
}