{
  "title": "Risk: Living on the Edge",
  "description": "Risk-taker Michael E. Tennenbaum has contributed mightily to American financial institutions, business, and society. A financier, adventurer, and philanthropist, in his debut book, RISK: Living on the Edge, he delivers intriguing insider details on how “impossible” deals are completed, along with an inspiring guide to applying risk-taking successfully to your business and personal life.Tennenbaum takes us behind the scenes at Bear Stearns, illuminating the end of that great American success story as never before disclosed. He imparts insights from investment banking, risk arbitrage, and options; how he employed risk to achieve competitive advantage after leaving Bear Stearns and starting his own firms; the inner machinations of his high-stakes deals; and the backstory to innovations he created.A daredevil who feeds sharks and swims with humpback whales, who has lifted off from an aircraft carrier, descended in a nuclear submarine, trained with the Navy SEALs, and taken the Olympic bobsled run in Innsbruck, and driven an elephant in the Mekong River, Tennenbaum describes his theory of risk as the compelling force of some people’s lives, and the trait that drives visionary pioneers toward their unending accomplishments.He shares strategies on applying boldness and challenging the status quo to seize opportunities, face struggles that pay off, manage mistakes, and give back to one’s community. Reading RISK, you get to walk in the shoes of an unpredictable, very successful self-made man who follows his own path. Applying personal tales of pushing limits and his experiences with Boys & Girls Clubs of America, the Smithsonian Institution, Harvard Business School, and the Joffrey Ballet, among other firms and cultural institutions, he demonstrates how to reach greater heights of performance, achievement, and contentment.RISK is a fascinating look at financial industry management, non-profits and how to help them grow, civic projects and how to combat inertia, and one man’s craving to move the needle of social progress.",
  "genres": [
    "Finance",
    "Nonfiction",
    "Business"
  ],
  "author": "Michael E. Tennenbaum",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/44321487-risk"
}