{
  "title": "Quest For The Scepter",
  "description": "A STOLEN SCEPTER, A WORLD IN PERILWhen the arch druid Faolukan stole the Scepter of Elyon, he plunged the medieval Celtic world called Erde into a Dark Age. But the prince who was prophesied to steal it back has been killed, and now nothing can stop the coming darkness.ONLY ONE CAN BRING IT BACKOrphaned Tristan slaves at his uncle’s forge and longs to erase the dishonor his wastrel father and harlot mother bequeathed him. When a squire discovers that Tristan is the prince’s exact double, the fate of Erde weighs heavily upon him. Reluctantly, Tristan agrees to masquerade as the savior prince, lead a chosen Company of nobles, and seek the Scepter across the sea.Before riding from his forest village, Tristan tells his life-long friend Caitir she must stay behind. But this intrepid lass has other ideas. She stows aboard the departing ship. AHEAD — A DANGEROUS TREKCryptic texts hint that the Scepter lies hidden beyond the Fell Bogs, haunt of mesmerizing marsh spirits. It’s even more distant than the oppressive dark forest of the Waldreich, reign of misshapen wolves and the treacherous, treetop-dwelling Naz. Into such dangers, Tristan’s Company must follow a trail of ancient clues.ONE LAD AGAINST A POWERFUL SORCERERIn service to the Deamhan Lord, Faolukan pledges to stop the group with all the magic, sorcery, and monsters at his command, including Tristan’s worst fear—a dark, subterranean cavern where stalks the creature of shadows, the barghest whose name is Thrag.But how can a mere blacksmith’s nephew and a cooper’s daughter ever hope to defeat the most powerful sorcerer the world has ever known? How can anyone stop the coming darkness?IN THE GREAT HIGH FANTASY TRADITIONThe Scepter and Tower Trilogy strives to continue the epic high fantasy tradition of J.R.R. Tolkien’s Lord Of The Rings, David Farland’s The Rune Lords, and Robert Jordan’s The Wheel Of Time series.",
  "genres": [
    "Fantasy"
  ],
  "author": "Mark E. Fisher",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/44333130-quest-for-the-scepter"
}