{
  "title": "Love's Fragile Flame",
  "description": "A different world. A different time. 16th Century England. When heretics were burned. When true love and faith were tested. But it was their time. Their love. Derick. Rose. Follow the twists and turns in this historical romance of a love stronger than fear during the dramatic turbulence of Renaissance England as Rose seeks to find meaning to her life. This work is considered to be Phyllis Caggiano’s masterpiece.Here is the opening for Chapter BEFORE ROSE blamed God for what happened, she blamed nature. It had been the rain to begin with, she decided. If only there had been less rain. Then, if the sun had not come out on that particular day. . .The summer of the year of our Lord, 1555, had been the wettest Rose could remember. Even the old graybeards who sat wagging their tongues and warming their bones in the smithy had reckoned that this was the worst summer England had known in fifty years. Water stood a foot deep at the crossroads in the center of the village. Stunted corn lay rotting in the nearby fields. Each morning Derick would slog through the mud to the smithy, stoke his fire, and do what little work there was while Rose stayed in the cottage. Her main household duty throughout the summer seemed to be catching the stream of soot-streaked rainwater as it ran from the smoke hole in the roof, down a rafter, and into a jar. The rushes, newly strewn upon the floor last spring, were now blackened with mildew.On the last morning of August, as Rose emptied the jar of rainwater, her brain seemed fuzzy with mildew. She carefully replaced the empty jar under the stream of water and sat down by the hearth-fire, conscious of her swelling abdomen.“Ah me, another cruel trick of nature,” she said wistfully. Her first child, a son, was stillborn last winter. She had hoped not to conceive again until the next autumn so that the child would be born in a fair and pleasant month when fresh food would be plenteous and her milk would be rich and wholesome. Now this one would be born near Christmas. She opened the oak chest near the hearth and pulled out a tiny blanket of lamb’s wool. She held it to her cheek, then folded it and rocked it in the crook of her arm. “Bye, baby bunting,” she crooned softly. The babe within her kicked vigorously. “You will live,” she told the child. “You’ll be a lusty son, I know it,” she said. “And then we shall be a complete family, you and Derick and I—and what more could a woman ask in the whole of this world?”Suddenly the polished trestle table began to glow, and then the entire room brightened. Rose stood up, laughing at herself. “Sunshine! I had almost forgotten what it looks like.” She went outside and lifted her face toward the sun, letting it draw out all the oppressive cold that the constant rain had brought. She had come out without her cap, and the sunshine made golden glints in her light brown hair.“Catch those sunbeams in a jar, and we will have them for the next rainy day,” Derick called to her. He was standing outside the smithy, his dark, handsome face flushed from the heat of the forge.Wedded four years and my heart still catches at the sight of him, thought Rose. She lifted up her skirts and walked over to him, carefully avoiding the puddles. The sun, coming out in strength now, drew steam from the stone fence which divided their garden from Widow Terrel’s. An insistent wind swept the crumbled clouds across the sky.“Dearling, do you think they will return?” Rose asked as she watched the departing clouds.“Shield God!” exclaimed Derick. “I’ve mended the last hoe that was hidden in the farthest corner of the smithy. If the weather stays not fair and farmers do not bring their oxen to be shod, we’ll not eat.”Rose clasped his hand and looked up into his gray-green eyes. “ ‘Tis market day in Saffron Walden and we do need to buy a cradle—” she began.“And please will I take you to market?” Derick finished. “In truth, Rose Haler, you are more interested in a fair pretty tha",
  "genres": [],
  "author": "Phyllis Caggiano",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/4436485-love-s-fragile-flame"
}