{
  "title": "\"I Am a Man\": Chief Standing Bear's Journey for Justice",
  "description": "In 1877, Chief Standing Bear’s Ponca Indian tribe was forcibly removed from their Nebraska homeland and marched to what was then known as Indian Territory (now Oklahoma), in what became the tribe’s own Trail of Tears. “I Am a Man” chronicles what happened when Standing Bear set off on a six-hundred-mile walk to return the body of his only son to their traditional burial ground. Along the way, it examines the complex relationship between the United States government and the small, peaceful tribe and the legal consequences of land swaps and broken treaties, while never losing sight of the heartbreaking journey the Ponca endured. It is a story of survival---of a people left for dead who arose from the ashes of injustice, disease, neglect, starvation, humiliation, and termination. On another level, it is a story of life and death, despair and fortitude, freedom and patriotism. A story of Christian kindness and bureaucratic evil. And it is a story of hope---of a people still among us today, painstakingly preserving a cultural identity that had sustained them for centuries before their encounter with Lewis and Clark in the fall of 1804. Before it ends, Standing Bear’s long journey home also explores fundamental issues of citizenship, constitutional protection, cultural identity, and the nature of democracy---issues that continue to resonate loudly in twenty-first-century America. It is a story that questions whether native sovereignty, tribal-based societies, and cultural survival are compatible with American democracy. Standing Bear successfully used habeas corpus, the only liberty included in the original text of the Constitution, to gain access to a federal court and ultimately his freedom. This account aptly illuminates how the nation’s delicate system of checks and balances worked almost exactly as the Founding Fathers envisioned, a system arguably out of whack and under siege today. Joe Starita’s well-researched and insightful account reads like historical fiction as his careful characterizations and vivid descriptions bring this piece of American history brilliantly to life.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Book Club",
    "Native American",
    "Audiobook",
    "Historical"
  ],
  "author": "Joe Starita",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/4435775-i-am-a-man"
}