{
  "title": "The Vampire of Ropraz",
  "description": "“Silky prose in this harrowing account of crime and punishment.”— Kirkus Reviews “Using spare, effective prose, Chessex brilliantly renders both the inhospitable winter landscape of the mountains and the harshness of a society that makes monsters of its victims.’— London Review of Books “A superb novel, hard as a winter in these landscapes of dark forests, where an atmosphere of prejudice and violence envelops the reader.”— L’Express “It’s beautiful; it’s pure, like a blue sky over a black forest. Giono without garlic and olives.”— Le Point “Far from just telling us a simple story Chessex has had the intelligence to integrate a dose of poetry, of the aesthetics of sin, and of the metaphysics of the monster.”— Lire Jacques Chessex, winner of the prestigious Goncourt prize, takes a true story and weaves it into a lyrical tale of fear and cruelty. 1903, Ropraz, a small village near the Jura Mountains of Switzerland. On a howling December day, a lone walker discovers a recently opened tomb, the body of a young woman violated, her left hand cut off, genitals mutilated, and heart carved out. There is horror in the nearby the return of atavistic superstitions and mutual suspicions. Then two more bodies are violated. A suspect must be found. Favez, a stableboy with bloodshot eyes, is arrested and placed in psychiatric care. He escapes, enlists in the Foreign Legion as the First World War begins, and is sent into battle in the trenches of the Somme. Jacques Chessex , born in 1934, won the Prix Goncourt, France’s most prestigious literary prize for his novel A Father’s Love . He is considered one of Switzerland’s greatest living authors. He lives in Ropraz.",
  "genres": [
    "Horror",
    "Fiction",
    "France",
    "Historical Fiction",
    "Vampires",
    "Crime",
    "Novella"
  ],
  "author": "Jacques Chessex",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/4438553-the-vampire-of-ropraz"
}