{
  "title": "Collier",
  "description": "Another great series from top selling author Elizabeth Loraine!!!From the author of Royal Blood Chronicles comes her paranormal series Phantom Lives!!After the sudden death of her parents Abigail Black decides to take her life back from her abusive boyfriend, Dallas, and start over. She is drawn south from her childhood home in Memphis into a world she thought only existed in her dreams. Ones that she has had since she was a small child, of a place so real, she could describe everything and everyone in minute detail. And there's Bill, a man who has her cautiously believing in love again.Suddenly she discovers that the place in her dreams really exists and it is calling to her.. Why?Another page turning romance adventure from Elizabeth Loraine. Phantom Lives intertwines the modern world with the post Civil War world of Collier, a plantation Abigail has had dreams about her entire life. Now she is about to find out why. It's a fantasy world of spirits and immortals built in a way which fans of Ms Loraine’s will again thoroughly enjoy. Find out who Abigail was in the past, and how it changes everything.˃˃˃ Excerpts of E Loraine’s other works are also included for your reading pleasure. Look for Book Two of Phantom Lives, Phantom Lives Power, along with other books books written by Elizabeth Loraine, in her fantasy series,Royal Blood Chronicles...Katrina, the Beginning, The Protectors, The Dark Prince, Cain the Quest, Bloodline, Legacy, Redemption, Destiny and this fall book nine!˃˃˃ I loved the writers creativity. Vampires and such get old after a while and this was very refreshing. I loved every moment reading this book, I never wanted to put it down. I cannot wait to read the other books in this series! Adie˃˃˃ I don't read too many book in this genre but I must say I loved this book. It was exciting and kept me on the edge on my seat wanting to know what happens next. Its about a woman who after losing her parents is taken advantage of by something very evil and has to find a way to get her life back. In her struggle for freedom she discovers she has a important destiny in life and will do everything in her power to fulfill it. Its got paranormal romance and drama all rolled in to one its a definite must read. Scroll up and grab a copy today.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Ghosts",
    "Fiction",
    "Romance"
  ],
  "author": "Elizabeth Loraine",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/12405329-collier"
}