{
  "title": "A People Betrayed: A History of Corruption, Political Incompetence and Social Division in Modern Spain",
  "description": "From the foremost historian of 20th century Spain, A People Betrayed is the story of the devastating betrayal of Spain by its political class, its military and its Church. In 1898 Spain was in a state of despair and unrest. They had lost the war with America and with it the last of their major colonies: Cuba, Guam, Puerto Rico and the Philippines. The catastrophe stoked Spain’s internal conflicts, and the country saw a succession of collapsing dictatorships and democracies that, with mounting anguish, culminated in all-out civil war and nearly four decades of hard dictatorship. When Spain recovered its democracy in the 1970s, the pattern seemed broken. The country was back in good health, and held up as a model for other nations transitioning to democracy in Eastern Europe and Latin America.But the spectacular boom seen in Spain’s first years of membership in the European Economic Community masked a rotten core. The country’s underlying issues had not been fully resolved and the present crisis facing Spain is the result of an incomplete transition.A People Betrayed covers the lives of the individuals, heroes and villains who made a huge difference – the dictators Primo de Rivera and Franco, the mass murders of the civil war, and important statesman such as Manuel Azaña, Juan Negrín and Ramon Serrano Suñer, and rise and subsequent discrediting of the monarchy of King Juan Carlos and the extremists of right and left.Paul Preston, a specialist in Spanish History at the LSE, tells a sweeping history of modern Spain – and points to a curious pattern that leads the country repeatedly into tumult: a disconnect between the social reality and the political powers ruling over it.",
  "genres": [
    "History",
    "Spain",
    "Nonfiction",
    "Politics",
    "Spanish Civil War",
    "Spanish Literature",
    "Audiobook"
  ],
  "author": "Paul Preston",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/44428155-a-people-betrayed"
}