{
  "title": "Lions of the Sky",
  "description": "In the world of fighter pilots, the most alpha of the alpha, competition is everything and the stakes are impossibly high. A Top Gun for the new millennium, LIONS OF THE SKY propels us into a realm in which friendship, loyalty, and skill are tested, battles won and lost in an instant, and lives irrevocably changed in the time it takes to plug in your afterburners.Sam Richardson is a fighter pilot’s pilot, a reluctant legend with a gut-eating secret. He is in the last span of his tour as an instructor, yearning to get back to the real action of the Fleet, when he is ordered to take on one last class—a class that will force him to confront his carefully quarantined demons.Brash, carefree, and naturally gifted, Keely Silvers is the embodiment of all that grates on him. After years of single-minded dedication, she and her classmates can see the finish line. They are months away from achieving their life-long dream, flying Navy F/A-18 fighters. They are smart and hard-working, but they’re just kids with expensive new toys. They’re eager to rush through training and escape to the freedom of the world beyond, a world they view as a playground full of fast jets and exotic locales.But Sam knows there is a darker side to the profession he loves. There is trouble brewing in the East with global implications. If they make it past him they will be cast into a dangerous world where enemy planes cruise the skies over the South China Sea like sharks, loaded with real weapons and hidden intentions.Early Praise for Lions of the Sky \"Gripping, fast paced, and authentic. If you want a real, edge of the envelope thriller, look no further!\" — Brandon Webb former Navy SEAL, pilot and New York Times bestselling author \"A humdinger of a book...\" ...a terrific window into a world very few people see. —The Honorable Ray Mabus, 75th United States Secretary of the Navy \"An intense, and personal, and thrilling. A must read!\" —Lea Gabrielle. Journalist and F/A-18 Naval Aviator \"Francesco “Paco” Chierici made flying some of the U.S. Navy’s most treacherous fighters look easy. His eye for detail, salty irreverence, and skill as both an aviator and a writer, make this fictional work very real. Strap in for an unforgettable ride.\" — Dave Hirschman, Author of Hijacked – The True Story of the Heroes of Flight 705, and AOPA Pilot Editor at Large \"An experienced fighter pilot, Chierici knows what he’s writing about here. Fans of military fiction, strap into your favorite ejection seat and get ready for a high speed, G-pulling, missile-shooting thrill ride.\" — Ward Carroll, author of Punk’s War, Punk’s Wing, and Punk’s Fight \"Chierici’s debut novel is an unforgettable story of pride, lust, loss, betrayal and redemption...set today in a carrier-based fighter squadron in combat!\" — Kevin Miller, bestselling author of the ‘Raven One’ trilogy \"A high-octane blend of seawater, adrenaline, and human drama. LIONS OF THE SKY comes off the deck with afterburners roaring and never lets up.\" — Jeff Edwards, bestselling author of ‘Sea of Shadows’ and ‘Steel Wind’",
  "genres": [
    "Fiction",
    "Aviation",
    "Military Fiction",
    "Thriller",
    "War"
  ],
  "author": "Paco Chierici",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/44419266-lions-of-the-sky"
}