{
  "title": "The Elements of Cooking: Translating the Chef's Craft for Every Kitchen",
  "description": "Americans are on a roll in the kitchen—we've never been better or smarter about cooking. But how does a beginning cook become good, a good cook great?Modeled on Strunk and White's The Elements of Style , The Elements of Cooking is an opinionated volume by Michael Ruhlman—the award-winning and bestselling author of The Making of a Chef and coauthor of The French Laundry Cookbook —that pares the essentials of good cooking into a slim, easy-to-take-anywhere book. It will also stand alongside a handful of classics of the kitchen, just as Strunk and White's book sits on the desk of every writer and every English student.Not only does this book deconstruct the essential knowledge of the kitchen, it also takes what every professional chef knows instinctively after years of training and experience and offers it up cleanly and brilliantly to the home cook.With hundreds of entries from acid to zester, here is all the information—no more and no less—you need to cook, as well as countless tips (including only one recipe in the entire book, for the “magic elixir of the kitchen”) and no-nonsense advice on how to be a great cook. You'll learn to cook everything, as the entries cover all the key moves you need to make in the kitchen and teach you, for example, not only what goes into a great sauce but how to think about it to make it great.Eight short, beautifully written essays outline what it takes not merely to cook but to cook understanding heat, using the right tools (there are only five of them), cooking with eggs, making stock, making sauce, salting food, what a cook should read, and exploring the elusive, most important skill to have in the kitchen, finesse.",
  "genres": [
    "Food",
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Reference",
    "Culinary",
    "Science"
  ],
  "author": "Michael Ruhlman",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/444055.The_Elements_of_Cooking"
}