{
  "title": "Rival",
  "description": "Want to know what a girl’s best friend is? Revenge.Hey b*tches, my name’s Kiera. You might know me as The Cat, famous cat burglar/thief.No? Well, let me give you a little insight into my life as of late.I was going about, minding my own damn business when the mob boss who runs most of the Reno underground sent an assassin after me. Crazy, yeah? Anyway, six months later the previously mentioned assassin is now my partner in crime when we get a job from the local motorcycle club, The Aces. All good and dandy, right? Wrong. They’re 1%ers, all three officers unbelievably attractive. Oh, yeah, the Vice President of the MC? That’s my asshole step-brother and let’s not even get started on the club’s suspicious Enforcer or the President who’s dripping in sexual swagger.With four sexy as f*ck men at my back, can I get the job done or will our explosive personalities cause us to be at each other’s throats? Oh, damn! Almost forgot in the thought of all the ruggedly attractive men, muscles, and tattoos that the rival MC, The Alloy Kings are moving in and seem intent to take me down with the Aces. F*cking bastards.But I’m not the thief who became famous at 15 years old and survived the mob’s hell in my past just to lay down and take that, they won’t know what hit them.I’m The Cat, and soon enough, they’ll learn that I’ve got claws.Book 1 of The Aces TrilogyThe Aces Series is a WhyChoose/Reverse Harem trilogy featuring MFMMM meaning the female main character doesn't have to choose between her love interests. Please note, future books will contain M/M contact.This book contains references involving PTSD, sexual assault recollections, abuse, and other themes that some readers may find triggering.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Contemporary",
    "Dark",
    "Dark Romance",
    "Crime",
    "Contemporary Romance"
  ],
  "author": "A.J. Macey",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/44415394-rival"
}