{
  "title": "Blitzkrieg to Desert Storm: The Evolution of Operational Warfare",
  "description": "When Germany launched its blitzkrieg invasion of France in 1940, it forever changed the way the world waged war. Although the Wehrmacht ultimately succumbed to superior Allied firepower in a two-front war, its stunning operational achievement left a lasting impression on military commanders throughout the world, even if their own operations were rarely executed as effectively. Robert Citino analyzes military campaigns from the second half of the twentieth century to further demonstrate the difficulty of achieving decisive results at the operational level. Offering detailed operational analyses of actual campaigns, Citino describes how UN forces in Korea enjoyed technological and air superiority but found the enemy unbeatable; provides analyses of Israeli operational victories in successive wars until the Arab states finally grasped the realities of operational-level warfare in 1973; and tells how the Vietnam debacle continued to shape U.S. doctrine in surprising ways. Looking beyond major-power conflicts, he also reveals the lessons of India's blitzkrieg-like drive into Pakistan in 1971 and of the senseless bloodletting of the Iran-Iraq War. Citino especially considers the evolution of U.S. doctrine and assesses the success of Desert Storm in dismantling an entrenched defending force with virtually no friendly casualties. He also provides one of the first scholarly analyses of Operation Iraqi Freedom, showing that its plan was curiously divorced from the realities of military history, grounded instead on nebulous theories about expected enemy behavior. Throughout Citino points to the importance of mobility--especially mobilized armor--in modern operational warfare and assesses the respective roles of firepower, training, doctrine, and command and control mechanisms. Brimming with new insights, Citino's study shows why technical superiority is no guarantee of victory and why a thorough grounding in the history of past campaigns is essential to anyone who wishes to understand modern warfare. \"Blitzkrieg to Desert Storm\" provides that grounding as it addresses the future of operational-level warfare in the post-9/11 era.",
  "genres": [
    "History",
    "Military History",
    "Military Fiction",
    "War",
    "World War II",
    "Nonfiction"
  ],
  "author": "Robert M. Citino",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/444211.Blitzkrieg_to_Desert_Storm"
}