{
  "title": "The Omega Project",
  "description": "THE POWER TO DESTROY CONTINENTS WITHIN REACHPresident John Dawkins has earned a break.After two successful terms—despite a series of political maelstroms—this humble Southern gentleman united the country behind a common purpose, strengthened America’s standing throughout the world, and kept his nation safe.So, when Dawkins retires to his cabin in the Georgia woods, about the only excitement he’s looking for involves romantic dinners with his girlfriend and the occasional cold beer while watching his Atlanta Falcons.Unfortunately, powerful past enemies he didn’t even know he made have been waiting—waiting for their chance to exact revenge for a series of vile grudges and dubious grievances. And despite his world-class security, they’ve tracked Dawkins down. They drug him, kidnap him, and stash the former president all the way across the country. And they pin the crime on former secret-agent-turned archeologist Sean Wyatt, one of the former president’s closest friends.The news media, the feds, local cops—it seems everyone is hunting Sean, and he barely escapes the dragnet as he races to save his old friend. But this will be no mere rescue mission. The kidnappers, hungry for power as well as for retribution, order Sean to find them perhaps the world’s deadliest secret weapon, the most lethal force in antiquity, hidden by the nations of the world for fear of its awe-inspiring destructive power. To solve the riddle and save the former president, the kidnappers give Sean just one week—an impossible task to evade a nationwide manhunt and solve the most dangerous mystery of his life. In The Omega Project, USA Today best-selling author Ernest Dempsey is at his most impressive.This stark, evocative puzzle, this dark thriller, is capstone storytelling. With nerve-shredding action and the precision of a master craftsman, Dempsey reminds us that, sometimes, the greatest dangers are those we think we’ve put behind us. This archaeological thriller is sure to keep you burning through the pages late into the night. Get into some of the best adventure fiction kindle unlimited has to offer.",
  "genres": [
    "Adventure",
    "Thriller",
    "Fiction",
    "Fantasy",
    "Action"
  ],
  "author": "Ernest  Dempsey",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/44423211-the-omega-project"
}