{
  "title": "Chastise",
  "description": "A brand new history of the Dambusters raid from best-selling and critically acclaimed military historian, Max Hastings.Operation Chastise, the destruction of the Mohne and Eder dams in north-west Germany by the RAF’s 617 Squadron on the night of 16/17 May 1943, was an epic that has passed into Britain’s national legend.Max Hastings grew up embracing the story, the classic 1955 movie and the memory of Guy Gibson, the 24-year-old wing-commander who led the raid. In the 21st Century, however, he urges that we should see the dambusters in much more complex shades. The aircrew’s heroism was entirely real, as was the brilliance of Barnes Wallis, inventor of the ‘bouncing bombs’. But commanders who promised their young fliers that success could shorten the war fantasised as ruthlessly as they did about the entire bomber offensive. Some 1,400 civilians perished in the biblical floods that swept through the Mohne valley, more than half of them Russian and Polish women, slave labourers.Hastings vividly describes the evolution of Wallis’ bomb, and of the squadron which broke the dams. But he also portrays in harrowing detail those swept away by the torrents. He argues that what modern Germans call the Mohnekatastrophe imposed on the Nazi war machine temporary disruption, rather than a crippling blow. Ironically, Air Marshal Sir Arthur ‘Bomber’ Harris gained much of the public credit, though he bitterly opposed Chastise as a distraction from his city-burning blitz. Harris also made perhaps the operation’s biggest mistake – failure to launch a conventional attack on the huge post-raid repair operation which could have transformed the impact of the dam breaches on Ruhr industry.Here once again is a dramatic retake on familiar history by a master of the art. Hastings sets the Dams Raid in the big picture of the bomber offensive and of the Second World War, with moving portraits of the young airmen, so many of whom died; of Barnes Wallis; the monstrous Harris; the tragic Guy Gibson, together with superb narrative of the action of one of the most extraordinary episodes in British history.",
  "genres": [
    "History",
    "Nonfiction",
    "Military History",
    "War",
    "World War II",
    "Military Fiction",
    "Aviation"
  ],
  "author": "Max Hastings",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/44428165-chastise"
}