{
  "title": "Arbiter of Worlds: A Primer for Gamemasters",
  "description": "Arbiter of Worlds is the definite guide to building and running fantasy role-playing game campaigns. This primer will teach you how to build living, breathing worlds for your players to explore; how to host game and manage game sessions; and how to create powerful experiences of adventure that your players will talk about for years to come. Learn the secret to becoming a judge, an adversary, a worldbuilder, and a storyteller and become an arbiter of worlds! \"Every Macris campaign starts with a rich, open world; the edge of a massive map; and the ability to find adventure in any direction. After playing in a dozen of his campaigns, I can assure you that Macris is the best prepared, most thorough GM on the prime material plane. He balances “deadly adversary” and “the party’s greatest supporter” perfectly. I’ve been lucky to contribute to some renowned video game worlds, and to discus world design with some of the most accomplished writers alive. And I’m honestly not sure there’s been someone more thorough at and passionate for world building than Macris since ... maybe Tolkien? (Okay, maybe G.R.R. Martin, but he’s not as organized or efficient.) It takes organization, creativity, and careful technique to build a massive world efficiently and deliver it effectively, and Macris can show you how he does it.” - Dr. Michael Capps, award-winning videogame executive, writer, designer (*Gears of War*, *Fortnite*, *Unreal Tournament, Unreal Championship*) “Armed with decades of experience as both a player and a designer, Macris cuts to the marrow with razor sharp insights inan unapologetic and often painfully insightful analysis of every imaginable facet of being a Game Master. From implicationof play inherent in a game’s design, to world building, to the often delicate nature of unspoken social contracts inherentin the hobby, the guidance found in Arbiter of Worlds is a much-needed breath of fresh air to veterans of the hobby and aforged-in-the-fire bootcamp for those taking their first steps behind the screen.” - James M. Spahn, Ennie and Origins Award Winning RPG Designer “A superb read. He makes his points the way you would expect a Harvard-trained lawyer to do. If you read this book, you aregoing to come out knowing real things you did not know before that will help you run games at the table…” - Courtney Campbell, Hack & Slash",
  "genres": [
    "Gaming",
    "Role Playing Games",
    "Nonfiction"
  ],
  "author": "Alexander Macris",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/44432784-arbiter-of-worlds"
}