{
  "title": "Blood of Bones",
  "description": "Super Spells aren’t supposed to be real....\n Averil Anderson intends to test that theory on the city of Seattle. It’s up to Savannah Sage to stop him.  To uncover his plot, she’ll need to circumvent her chief, rely on the dubious help of a clan wizard, save an innocent boy from a horrible fate, and soothe her werewolf’s daddy issues.  While Anderson is shipping mysterious packages around the city, mercenary hyenas set out to capture the Great Bone, the Seattle Pack’s most powerful artifact and the key to Anderson’s plans.  With blood on the line, it'll take a healthy dose of subterfuge to thwart his dastardly plans.  Good thing Savannah Sage commands the perfect team for the job.  If you like Judith Barens, Al K. Line, Orlando Sanchez, Stephanie Foxe, J.P. Rice, or T S Paul...you will love this book in the Seattle Paranormal Police Department.  Questions for John P. Logsdon Q: What do you enjoy most about writing the Paranormal Police Department with other authors? A: It's flippin' fun as hell. We work out characters, plots, locations, and so on as a team. Then, the words hit the page and we roll along at breakneck speed because it's just a blast working together in this world!  Q: Why should readers want to jump into the world of the Paranormal Police Department? A: A few reasons, actually. It's high-action, often hilarious, and just plain fun. On top of that, there are multiple precincts in the PPD for readers to enjoy. So, while this series of books covers Bethany Black and the New York PPD, there are different lead characters running the PPD precincts in the Badlands, Las Vegas, the Netherworld, Seattle, Shadow, and Southeast Asia.  That means that readers who crave action and adventure are going to have tons of action-packed, laugh-out-loud stories to consume with a vengeance. We're already over twenty books in and there are a lot more coming in 2019.  Q: Anything else you'd like to leave readers with? A: If you're into naughty humor and high-octane adventures, you need to give the Paranormal Police Department a shot. That's what all the authors in the PPD love to read, which means it's also what we love to write.  Paranormal Police Department categories \n   Dark Comedy \n   Dark Fantasy \n   Urban Fantasy \n   Supernatural Thriller \n   Urban Fantasy Thriller \n   Science Fiction & Fantasy \n   Paranormal and Urban Romance \n   Vampires & Werewolves \n   Supernatural Shifter \n  THOUSANDS OF BOOKS SOLD. MILLIONS OF PAGES READ. DIVE INTO THE WORLD OF THE PARANORMAL POLICE DEPARTMENT AND LET THE FUN BEGIN...",
  "genres": [],
  "author": "John P. Logsdon",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/44430779-blood-of-bones"
}