{
  "title": "Fallen: The inside story of the secret trial and conviction of Cardinal George Pell",
  "description": "'Gripping and insightful' - Chrissie Foster, AM There was an eerie silence in the packed courtroom as everyone looked towards the foreman of the jury. 'Guilty' he pronounced five times. The third most senior Catholic cleric in the world had been found guilty of sex crimes against children, bringing shame to the Church on a scale never seen before in its history. Investigative journalist Lucie Morris-Marr was the first to break the story that Cardinal George Pell was being investigated by the police. In this riveting dispatch, she recounts how the cleric was trailed by a cloud of scandal as he rose to the most senior ranks of the church in Australia, all the way to his appointment by Pope Francis to the position of treasurer in the Vatican.Despite anger and accusations, it seemed nothing could stop George Pell. Yet in 2017 he was charged by detectives, returning to Australia to face trial.Take a front row seat in court with the author as she reveals the many intriguing developments in the secret legal proceedings which the media could not report at the time. Fallen reveals the full story of the brutal battle waged by the prince of the church as he fought to clear his name, including a ferocious bid to be freed from jail. The author also shares her own compelling personal journey investigating the biggest story of her career and the frequent attacks she endured from powerful Pell supporters. This book also charts how Pell's shocking conviction plunged the Vatican into an unprecedented global crisis after decades of clergy abuse cases. It is a vitally important story that will fascinate anyone interested in the failure of the Catholic Church to address the canker in its heart.",
  "genres": [
    "Nonfiction",
    "Crime",
    "Politics",
    "Australia",
    "Religion"
  ],
  "author": "Lucie Morris-Marr",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/44435604-fallen"
}