{
  "title": "The Portable Dorothy Parker",
  "description": "The second revision in sixty years, this sublime collection ranges over the verse, stories, essays, and journalism of one of the twentieth century's most quotable authors.For this new twenty-first-century edition, devoted admirers can be sure to find their favorite verse and stories. But a variety of fresh material has also been added to create a fuller, more authentic picture of her life's work. There are some stories new to the Portable, \"Such a Pretty Little Picture,\" along with a selection of articles written for such disparate publications as Vogue, McCall's, House & Garden, and New Masses. Two of these pieces concern home decorating, a subject not usually associated with Mrs. Parker. At the heart of her serious work lies her political writings—racial, labor, international—and so \"Soldiers of the Republic\" is joined by reprints of \"Not Enough\" and \"Sophisticated Poetry—And the Hell With It,\" both of which first appeared in New Masses. \"A Dorothy Parker Sampler\" blends the sublime and the silly with the terrifying, a sort of tasting menu of verse, stories, essays, political journalism, a speech on writing, plus a catchy off-the-cuff rhyme she never thought to write down.The introduction of two new sections is intended to provide the richest possible sense of Parker herself. \"Self-Portrait\" reprints an interview she did in 1956 with The Paris Review, part of a famed ongoing series of conversations (\"Writers at Work\") that the literary journal conducted with the best of twentieth-century writers. What makes the interviews so interesting is that they were permitted to edit their transcripts before publication, resulting in miniature autobiographies.\"Letters: 1905-1962,\" which might be subtitled \"Mrs. Parker Completely Uncensored,\" presents correspondence written over the period of a half century, beginning in 1905 when twelve-year-old Dottie wrote her father during a summer vacation on Long Island, and concluding with a 1962 missive from Hollywood describing her fondness for Marilyn Monroe.A Penguin Classics Deluxe Edition with French flaps, rough front, and luxurious packaging. Features an introduction from Marion Meade and cover illustrations by renowned graphic artist Seth, creator of the comic series Palooka-ville.",
  "genres": [
    "Poetry",
    "Short Stories",
    "Fiction",
    "Classics",
    "Humor",
    "Essays",
    "Literature"
  ],
  "author": "Dorothy Parker",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/44450.The_Portable_Dorothy_Parker"
}