{
  "title": "Cooking for Mr. Latte: A Food Lover's Courtship, with Recipes",
  "description": "\"Tender, wry, passionate, truthful. To read Hesser's prose is to hunger for more.\"—Nigella LawsonCooking for Mr. Latte is a delightfully modern dating story, recipes included. It's the true story of the courtship between Amanda Hesser, a food writer for The New York Times and author of the award-winning cookbook The Cook and the Gardener, and writer Tad Friend, the titular Mr. Latte. Most of the book was written in installments for the New York Times Magazine, but fans of Hesser's writing will be happy to know that there are plenty of new stories and recipes to justify picking up the book version. Her tale ends happily ever after, but has enough ups and downs to keep it interesting. And it's not all about Mr. Latte. Ever wonder what it's like to eat out with foodie guru Jeffrey Steingarten? Chances are you guessed wrong. Food is an important aspect of Hesser's life (though it wasn't for Mr. Latte when they met, making for some of the downs in the ups and downs), but it's not until you notice how seamlessly Hesser weaves her meals into her story that you realize how much of our lives and our memories revolve around food. By the time you get to the recipes, you've already salivated over the dishes and become emotionally attached to them. From her mother's Chocolate Dump-It Cake to the Ginger Duck her future mother-in-law made the first time they met, you'll love that Hesser pays such close attention and generously shares the recipes. Filled with everything from old-fashioned treats from her grandmother's kitchen to dishes from some of New York's hottest dining spots, this is one entertaining read that is sure to end up in your kitchen. --Leora Y. Bloom",
  "genres": [
    "Food",
    "Nonfiction",
    "Memoir",
    "Cookbooks",
    "Food Writing",
    "Foodie",
    "Cooking"
  ],
  "author": "Amanda Hesser",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/44449.Cooking_for_Mr_Latte"
}