{
  "title": "The Mastermind: Drugs. Empire. Murder. Betrayal.",
  "description": "The incredible true story of the decade-long quest to bring down Paul Le Roux—the creator of a frighteningly powerful Internet-enabled cartel who merged the ruthlessness of a drug lord with the technological savvy of a Silicon Valley entrepreneurIt all started as an online prescription drug network, supplying hundreds of millions of dollars' worth of painkillers to American customers. It would not stop there. Before long, the business had turned into a sprawling multinational conglomerate engaged in almost every conceivable aspect of criminal mayhem. Yachts carrying $100 million in cocaine. Safe houses in Hong Kong filled with gold bars. Shipments of methamphetamine from North Korea. Weapons deals with Iran. Mercenary armies in Somalia. Teams of hitmen in the Philippines. Encryption programs so advanced that the government could not break them.The man behind it all, pulling the strings from a laptop in Manila, was Paul Calder Le Roux—a reclusive programmer turned criminal genius who could only exist in the networked world of the twenty-first century, and the kind of self-made crime boss that American law enforcement had never imagined.For half a decade, DEA agents played a global game of cat-and-mouse with Le Roux as he left terror and chaos in his wake. Each time they came close, he would slip away. It would take relentless investigative work, and a shocking betrayal from within his organization, to catch him. And when he was finally caught, the story turned again, as Le Roux struck a deal to bring down his own organization and the people he had once employed.Award-winning investigative journalist Evan Ratliff spent four years piecing together this intricate puzzle, chasing LeRoux's empire and his shadowy henchmen around the world, conducting hundreds of interviews and uncovering thousands of documents. The result is a riveting, unprecedented account of a crime boss built by and for the digital age.Advance praise for The Mastermind“As directors, we spend countless hours imagining heightened plots and memorable characters that will leave a lasting impression on audiences. The true tale of obsession, genius, intrigue, and vengeance detailed in The Mastermind is as gripping and cinematic as anything we could endeavor to conjure up.”—Joe and Anthony Russo, directors of Captain America: The Winter Soldier, Captain America: Civil War, and Avengers: Infinity War“With his relentless and fearless reporting, Evan Ratliff has pried open a hidden world filled with high-tech gangsters and drug kingpins and double-crossers and stone-cold hitmen. The story is as fascinating as it is terrifying, and it is one that will hold you in its grip.”—David Grann, author of Killers of the Flower Moon“If truth is stranger than fiction, then The Mastermind is the truest book you’ll read this year. The only thing predictable about it is how quickly you’ll turn the pages.”—Noah Hawley, author of Before the Fall and creator of the TV series Fargo “This is a mesmerizing, absolutely bonkers story about a man as brilliant as he is villainous. You’ll find yourself sucked in, freaked out, and ultimately blown away by Ratliff's storytelling and tireless reporting. The Mastermind is a masterpiece.”—Nick Thompson, editor-in-chief, Wired",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "History",
    "Biography",
    "Audiobook",
    "Book Club"
  ],
  "author": "Evan Ratliff",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/44438128-the-mastermind"
}