{
  "title": "Journey 2022: Resolving Digital Dilemmas",
  "description": "In 2014 we looked ahead to 2018 in describing the 3rd Digital Revolution which would bring both “Agility and Fragility”. Today’s world is clearly demonstrating this anticipated duality. In 2016 we proposed an analogy of “Digital Shockwaves” to model the disruptions in business and technology that we expect by 2020. These originate from four different sources: new “Business models”, new “Ways of working”, “Disruptive technologies” and “Evolving challenges”.The digital revolution that has already transformed our lives as consumers, has begun to deeply transform our business world in all sectors. However, the resulting impact will be greater because it affects the very nature of the business processes which we have used for decades. At the same time, it is giving a predominant role to data for the insights it brings to all kinds of business moments.Significant breakthroughs over the last two years in areas such as artificial intelligence (AI), the Internet of Things (IoT), edge computing, additive manufacturing and quantum computing, will present significant opportunity choices to businesses by 2022. But we increasingly see questions being raised by consumers and society regarding certain technologies, business models, and approaches to data privacy. These will lead to what we describe as Digital Dilemmas.Digital technologies and their adoption will be progressively influenced by their interactions with the physical world, and business outcomes will be shaped by the balancing of tensions that we describe as Insights, Inertia and Inequality. Digital insights reveal both opportunities and challenges for real-world business models; digital business models will experience both restraining and sustaining inertia through the responses they draw from society at large and the potential inequalities arising from technologies like AI and automation could have far reaching implications. We see a further balancing force, characterized by Ideals, that defines the boundary of acceptability and trust for technology and business model adoption.At a time when “wait and see” cannot be a viable option for digital transformation, we propose to help you to understand the implications of rapidly developing business and technology environments, by identifying digital dilemmas and resolving them in ways that ensures appropriate decisions are made.This document contains our future vision as well as descriptions of some specific areas of disruption and business potential. I am sure you will find this an essential guide to resolving the Digital Dilemmas that you will encounter in your particular areas of operation as you journey toward 2022.",
  "genres": [],
  "author": "Atos Scientific Community",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/44440408-journey-2022"
}