{
  "title": "Enervadas",
  "description": "A escritora Chrysanthème (1870-1948), pseudônimo de Maria Cecília Bandeira de Melo Vasconcelos, é uma das preciosidades mais bem guardadas da literatura brasileira. Um dos nomes da escrita de mulheres no início do século XX, e pioneira das causas feministas, a autora publicou mais de vinte livros, e ao que se sabe nenhum deles foi reeditado. Enervadas é um romance de 1922 que contém passagens de críticas veementes contra a submissão e os limites à liberdade reservados às mulheres, além de ser uma divertida crônica sobre as classes abastadas do Rio de Janeiro na República Velha. Moderna e dona de “um temperamento inimigo da fixidez e da banalidade”, a protagonista Lúcia é taxativa em seu retrato dos papéis de gênero de sua época. Comenta a propósito das leis de separações de casais: “Ao homem, tudo é perdoado, explicado, permitido; à criatura do sexo feminino, uma vez infeliz na escolha do companheiro da existência, tem diante de si o isolamento, a tristeza, a calúnia, a maldição… As nossas leis esquecem o progresso do mundo e o novo papel da mulher na sociedade e no universo, papel em que ela se mostrou mais corajosa, mais inteligente e mais útil do que os homens.” Vale lembrar que o voto feminino só seria adotado parcialmente no Brasil em 1932. É com esse espírito rebelde que Lúcia recebe, no primeiro capítulo do livro, o diagnóstico médico de que é uma “enervada”, categoria em que a ciência da época reunia uma ampla gama de mulheres insatisfeitas. O plural do título se refere também às amigas de Lúcia, que considera suas semelhantes. A protagonista, no entanto, questiona o diagnóstico: ser “enervada” significaria apenas ter desejo de beijar esse médico, a quem confessa seus “gostos, sonhos e temperamentos”? “Certamente que não”, diz ela. “Isso é ser-se humano e mais nada.”O romance recua, em forma de diário, à vida amorosa da protagonista curiosa e sexualmente livre. Atraída pelos dotes de dançarino de um funcionário do Ministério do Exterior, casa-se com ele, mas logo se entendia e, ao ver-se explorada, segue-se a inevitável separação. Ao longo da narrativa, sucedem-se flertes e romances, entremeados por uma vida social intensa e algum consumo de morfina. Lúcia compartilha dúvidas e insatisfações com amigas fiéis: Maria Helena, lésbica; Laura, namoradeira em série; Magdalena, cocainômana; e Margarida, satisfeita mãe de muitos filhos. O romance se encaminha para uma conclusão talvez desconcertante frente às expectativas criadas pela primeira metade da narrativa.Chrysantème é hoje uma escritora quase esquecida. O original usado para a edição da Carambaia foi encontrado no Real Gabinete Português de Leitura, no Rio – até o exemplar catalogado na Biblioteca Nacional está desaparecido. A autora é uma representante daquilo que Beatriz Resende – professora titularde Literatura Comparada da Universidade Federal do Rio de Janeiro (UFRJ) e autora do posfácio – qualifica de literatura art-déco, um filão obscurecido pelo modernismo. Não teriam sido o estilo algo convencional e antiquado os motivos desse ostracismo, mas, nas palavras de Beatriz Resende, “todo um conservadorismo em torno dos costumes que dominou sobretudo o literariamente ousado e sexualmente casto modernismo, em especial o paulista”.Em sua época, no entanto, Chrysantème foi uma figura pública, em especial por suas crônicas na imprensa. Seu pioneirismo na escrita de mulheres no Brasil foi precedido pela mãe, Emília Moncorvo Bandeira de Melo, que assumiu, em O Paiz, sob o pseudônimo de Carmen Dolores, a coluna de crônicas de Machado de Assis. O pseudônimo Chrysanthème, que às vezes se apresentava como Madame Chrysantème, veio do popular romance homônimo do francês Pierre Loti, que ironicamente descrevia o amor de uma submissa gueixa. Entre seus livros está A infante Carlota Joaquina (1937), no qual procura contestar o retrato tradicional da rainha luso-brasileira como uma megera. Casou-se aos 19 anos, teve um filho e enviuvou aos 38, em 1907, quando, inspirada pela mãe, deu impulso a sua carreira literária.A edição da Carambaia tem projeto gráfico e ilustrações de Luciana Facchini e Pedro Alencar, com ênfase em flores, presença constante na narrativa e no próprio pseudônimo da escritora. Linhas retas ou irregulares formam nervuras que aludem à suposta doença da protagonista e à instabilidade do papel das mulheres nas primeiras décadas do século XX.",
  "genres": [
    "Brazil"
  ],
  "author": "Chrysanthème",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/44437828-enervadas"
}