{
  "title": "The New Testament in Its World: An Introduction to the History, Literature, and Theology of the First Christians",
  "description": "Finally: an introduction that captures the excitement of the early Christians, helping today's readers to think like a first-century believer while reading the text responsibly for today.The New Testament in Its World is your passageway from the twenty-first century to the era of Jesus and the first Christians. A highly-readable, one-volume introduction placing the entire New Testament and early Christianity in its original context, it is the only such work by distinguished scholar and author N. T. (Tom) Wright.An ideal guide for students, The New Testament in Its World addresses the many difficult questions faced by those studying early Christianity. Both large and small, these questions include:What is the purpose of the New Testament?What was the first-century understanding of the kingdom?What is the real meaning of the resurrection in its original context?What really were the Gospels?Who was Paul and why are his letters so controversial?As twenty-first-century people, how do we recover the excitement of what it was like to live as Christians in the first or second centuries?In short, The New Testament in Its World brings together decades of ground-breaking research, writing, and teaching into one volume that will open readers' eyes to the larger world of the New Testament. It presents the New Testament books as historical, literary, and social phenomena located in the world of Second Temple Judaism, amidst Greco-Roman politics and culture, and within early Christianity. Written for both classroom and personal use, the benefits of The New Testament in Its World include:A distillation of the life work of N. T. Wright on the New Testament with input from Michael BirdHistorical context that situates Jesus and the early church within the history, culture, and religion of Second Temple Judaism and the Greco-Roman worldMajor sections on the historical Jesus, the resurrection of Jesus, and Paul's chronology and theologySurveys of each New Testament book that discuss their significance, critical topics like authorship and date, and that provide commentary on contents along with implications for the Christian lifeUp-to-date discussions of textual criticism and the canonization of the New TestamentA concluding chapter dedicated to living the story of the New TestamentAvailable Video and Workbook companion resources to enhance learning and experience the world of the New TestamentIllustrated with visually rich pictures, maps, charts, diagrams, and artwork; plentiful sidebars provide additional explanations and insights",
  "genres": [
    "Theology",
    "History",
    "Religion",
    "Christian",
    "Christianity",
    "Nonfiction",
    "Faith"
  ],
  "author": "N.T. Wright",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/44441888-the-new-testament-in-its-world"
}