{
  "title": "El libro de Gabriel",
  "description": "Después de salvar la vida de la cazadora, Gabriel es reclamado por los dioses para que tome su lugar en el Asgard. Ahora, convertido en einherjar, un guerrero inmortal de Odín, pasa su tiempo entranándose en el Valhalla, preparándose para el ragnarök y recibiendo todo tipo de cuidados de las valkyrias. Sin embargo, el tiempo de preparación ha llegado a su fin. Tres de los objetos más poderosos de los dioses han sido robados para traer el caos a la Tierra y provocar un final de los tiempos adelantado. Gabriel será enviad como líder de los einherjar para alertar a todos los guerreros, unificar los clanes y salvar a una raza humana a la que ya nadie le une. Y mientras intenta lograr sus objetivos, esperará encontrarse no sólo con sus amigas más queridas, sino, con la vaniria que lo obsesionó hasta la muerte: Danna McKenna. Pero esa obsesión puede hacer que nunca reconozca a la mujer que en realidad lo ama...No es fácil ser una valkyria como Gúnnr. Ella es distinta al resto, no tiene ni los poderes ni la furia ni el temperamiento que caracteriza a las de su raza, todas la ven como \"la dulce e inofensiva Gúnnr\". Pir eso se sorprende tanto cuando el alma de un guerrero de cara de ángel, el esperado por los dioses, la reclama para que cuide de él. Y así lo hará religiosamente hasta que un error nacido de su repentina pasión provocará que el Engel se distancie de ella, pero no por mucho tiempo. Odín y Freyja les han reclamado para que juntos y, de manera indivisible, desciendan a la Tierra para recuperar uno de los objetos desaparecidos: el martillo de Thor. Gúnnr luchará al lado de Gabriel y se enzarzará en la mayor de las batallas de todas: la de enseñarle al guerrero de cara de ángel que, por cegarse con una mujer, se está perdiendo el resto del desfile.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Urban Fantasy",
    "Vampires",
    "Erotic Romance"
  ],
  "author": "Lena Valenti",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/12407402-el-libro-de-gabriel"
}