{
  "title": "Promised Land",
  "description": "Bestselling author Robert Whitlow explores the meaning of family and home—and how faith forms the identity of both—in this breathtaking sequel to Chosen People.\nDespite their Israeli citizenship, Hana and Daud cannot safely return to their homeland because a dangerous terrorist ring is threatening Daud. Hana is perfectly fine remaining in the United States, working for a law firm in Atlanta, especially when she learns she’s pregnant. But Daud can’t shake the draw to return home to Israel, even if it makes him a walking target.Hana is helping her boss plan a huge summit in Atlanta when Jakob Brodsky, her old friend and former co-litigator, asks for her help with a case. His client is attempting to recover ancient artifacts stolen from his Jewish great-grandfather at the end of World War II. Because the case crosses several national borders, he needs Hana’s knowledge and skill to get to the bottom of what happened to these precious artifacts.Meanwhile, Daud is called in to help a US intelligence agency extract a Ukrainian doctor from a dangerous situation in Egypt. While overseas, he can’t resist the call of Jerusalem and thus sets off a series of events that puts thousands of people in danger, including his wife and unborn child.With historical mysteries, religious intrigue, and political danger, Promised Land asks one momentous question: What if your calling puts you—and your family—in the crosshairs?Praise for \nPromised Land\n:“Promised Land is a book about coming home. Of becoming settled in your spirit and your relationships. With layers of intensity, thanks to international intrigue, moments of legal wrangling, and pages of sweet relationships, this book is rich and complex. A wonderful read.” —Cara Putman, author of Flight RiskSecond and final book in the Chosen People seriesFull-length, Christian fiction novel",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Suspense",
    "Audiobook",
    "Christian",
    "Mystery",
    "Thriller"
  ],
  "author": "Robert Whitlow",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/44441960-promised-land"
}