{
  "title": "The Meaning of Night",
  "description": "“After killing the red-haired man, I took myself off to Quinn’s for an oyster supper.”So begins an extraordinary story of betrayal and treachery, of delusion and deceit narrated by Edward Glyver. Glyver may be a bibliophile, but he is no bookworm. Employed “in a private capacity” by one of Victorian London’s top lawyers, he knows his Macrobius from his First Folio, but he has the street-smarts and ruthlessness of a Philip Marlowe. And just as it is with many a contemporary detective, one can’t always be sure whether Glyver is acting on the side of right or wrong.As the novel begins, Glyver silently stabs a stranger from behind, killing him apparently at random. But though he has committed a callous and brutal crime, Glyver soon reveals himself to be a sympathetic and seductively charming narrator. In fact, Edward Glyver keeps the reader spellbound for 600 riveting pages full of betrayal, twists, lies, and obsession.Glyver has an unforgettable story to tell. Raised in straitened circumstances by his novelist mother, he attended Eton thanks to the munificence of a mysterious benefactor. After his mother’s death, Glyver is not sure what path to take in life. Should he explore the new art of photography, take a job at the British Museum, continue his travels in Europe with his friend Le Grice? But then, going through his mother’s papers, he discovers something that seems the woman who raised him was not his mother at all. He is actually the son of Lord Tansor, one of the richest and most powerful men in England.Naturally, Glyver sets out to prove his case. But he lacks evidence, and while trying to find it under the alias “Edward Glapthorn,” he discovers that one person stands between him and his his old schoolmate and rival Phoebus Rainsford Daunt, a popular poet (and secret criminal) whom Lord Tansor has taken a decidedly paternal interest in after the death of his only son.Glyver’s mission to regain his patrimony takes him from the heights of society to its lowest depths, from brothels and opium dens to Cambridge colleges and the idylls of Evenwood, the Tansor family’s ancestral home. Glyver is tough and resourceful, but Daunt always seems to be a step ahead, at least until Glyver meets the beguilingly beautiful Emily Carteret, daughter of Lord Tansor’s secretary.But nothing is as it seems in this accomplished, suspenseful novel. Glyver’s employer Tredgold warns him to trust no Is his enigmatic neighbour Fordyce Jukes spying on him? Is the brutal murderer Josiah Pluckthorn on his trail? And is Glyver himself, driven half-mad by the desire for revenge, telling us the whole truth in his candid, but very artful, “confession”?A global phenomenon, The Meaning of Night is an addictive, darkly funny, and completely captivating novel. Meticulously researched and utterly gripping, it draws its readers relentlessly forward until its compelling narrator’s final revelations.From the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "Gothic",
    "Victorian",
    "Thriller"
  ],
  "author": "Michael Cox",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/444550.The_Meaning_of_Night"
}