{
  "title": "CHINA: Portrait of a People",
  "description": "From the subtropical jungles of Yunnan to the frozen wastes of Heilongjiang; across the scalding deserts of Xinjiang and beneath Hong Kong's neon blur. Tramping through China by train, bus, boat, motorcycle, mule or hitching on the back of anything that moved. On a budget so scant that he drew sympathetic stares from peasants. Backpacking photographer Tom Carter somehow succeeded in circumnavigating over 35,000 miles (56,000 kilometers) across all 33 provinces in China during a 2-year period, the first foreigner on record ever to do so.What Carter found along the way, and what his photographs ultimately reveal, is that China is not just one place one people, but 33 distinct geographical regions populated by 56 different ethnicities, each with their own languages, customs and lifestyles.Despite increased tourism and surging foreign investment, the cultural distances between China and the West remain as vast as the oceans that separate them. Carter's book, CHINA: Portrait of a People, was published as a means to visually introduce China to the world by providing a glimpse into the daily lives of the ordinary people who don't make international headlines yet whom are invariably the heart and soul of this country.MEDIA REVIEWS\"One of China's most extraordinary explorers.\" --The World of Chinese\"Part of the strength of this book is its independent spirit. It's not a travel guide showing China dressed in its Sunday best, or a photojournalistic approach documenting the underbelly of the country, but rather a peek at the sights Carter has seen and a corrective to both the glowing promotional images and negative media shots that we are all familiar with.\" -- China Daily\"Tom Carter is an extraordinary photographer whose powerful work captures the heart and soul of the Chinese people.\" -- Anchee Min, author of Red Azalea\"Tom Carter's photo book is an honest and objective record of the Chinese and our way of life... his camera leads us through 33 wide-sweeping scenes of the real and the surreal.\" -- Mian Mian, author of Candy\"Capturing the diversity of [China's] 56 ethnic groups is a remarkable achievement ... There are a number of shots in this book that could easily grace the pages of National Geographic ... Unless you want to undertake your own two-year trek through some of the mainland's most difficult terrain to take your own shots, this is a study well worth having on your bookshelf.\" -- South China Morning Post\"In these 900 images, Carter shows just how diverse the Chinese really are, with their different facial features, skin hues, lifestyles, cultures and occupations. What ensues is an engaging and enlightening photo essay of 1.3 billion people.\" -- Asian Geographic Passport\"A striking, kaleidoscopic vision of China's lands and people.\" -- The Beijinger\"Through Carter's journey of self-discovery, we end up discovering a little more about ourselves -- and a land so vast, so disparate, that 638 pages of photos barely manage to scratch the surface. Still, CHINA: Portrait of a People is a very good place to start peeling back the layers.\" -- Time Out Hong Kong\"Travel photos taken by a stranger seldom fascinate. But 800 color images captured by Tom Carter as he spent two years on the road, traveling 56,000 kilometers through all of China's 33 provinces, make a dramatic exception ... Carter's weighty book takes an effort to carry home from a store. But anyone interested in China should love owning it.\" -- Cairns Media Magazine\"Getting a full picture of China - a vast country with an enormous population, a place that is experiencing sweeping cultural and economic changes - is, of course, impossible. But Tom Carter comes close. ... It's a remarkable book, compact yet bursting with images that display the diversity of a nation of 56 ethnic groups.\" -- San Francisco Chronicle\"In China: Portrait of a People, Tom Carter shows us that there are actually dozens of Chinas. The American photojournalist spent two years traveling 35,000 miles through every province of China by bus, boat, train, mule, motorcycle, and on foot.\" -- Christian Science Monitor",
  "genres": [
    "China",
    "Travel",
    "Photography",
    "Nonfiction",
    "Art",
    "History",
    "Cultural"
  ],
  "author": "Tom  Carter",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/4447653-china"
}