{
  "title": "The Bet",
  "description": "“He was my best friend…” I say more to myself than her. “Yeah, so was I but you seem to have forgotten that part of your life.”  The bet was simple. You draw a name from the hat. That’s the girl you have to seduce. The girl you have to make fall head over heels in love with you.  It wasn’t hard for me to do, in fact, it was something I did all the time. I was known for breaking hearts. Sex was just that, sex. And it didn’t take me very long to get a woman on her back.  And then I drew her name: Jules Peterson.  My former best friend. My first kiss. My first love. She shattered my heart into a million pieces three years ago. She left me right when I needed her most.  And as fate who have it, she had entered my life once again, at almost the perfect time.  She was a transfer, fresh meat, and she had just put a target on her back. It was my turn to make her pay. It was my turn to break her heart.  Holding onto that hate, that anger, that f*cking heartbreak. It does something to you. It breaks you, and it broke me, it tainted me, just like I would do to Jules.  She used to be my everything, but now she was nothing but The Bet.    **The Bet is book one in the North Woods University series. It is a full length, standalone, novel. It contains adult themes, and content not suitable for all readers. It is NOT a young adult novel.**Dear Reader, We're so happy that you are thinking about reading our newest book The Bet. We hope you enjoy it to your fullest and we cannot wait to read your reviews on it. However, we wanted to leave a little note to warn readers with sensitivity to dubious content, sexual themes, and verbal abuse. For those readers, this book may not be a good read for them. We also would like to say that while the book is entirely fiction we know that abuse, sexual, physical, and verbal is a very real thing in our world and that we do NOT condone any behavior of that nature nor do we think that it's okay to treat someone that way. Just like the makers of gory horror movies dont actually want people to be brutally murdered, we do not want anyone to be bullied or abused in any way.Again, this is fiction and while we don't always agree with the things our fictional characters do, sometimes it works for a story line. As writers, it is our job to draw out real emotions. Sometimes we will make you fall in love with a character and other times we might have you yelling at the book. With love, J.L. Beck & C. Hallman",
  "genres": [
    "Romance",
    "College",
    "Enemies To Lovers",
    "New Adult",
    "Dark Romance",
    "Second Chance",
    "Contemporary"
  ],
  "author": "J.L. Beck",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/44483951-the-bet"
}