{
  "title": "The Handyman's Dream",
  "description": "\"Ed couldn't help it. In the days that followed, he couldn't get the new mailman out of his mind. From the time he had broken up with Cathy Carroll after high school graduation and had devoted himself exclusively to the pursuit of those whose body parts matched his own, Ed had had an image in his mind, a full-blown mental picture of the perfect guy. That first day, when the new mailman dropped a handful of bills into Ed's mailbox, Ed knew he had found him.\" Told with warmth, humor, and optimism, The Handyman's Dream is a story for everyone who has ever had a fantasy about the perfect mate. Ed Stephens is a small town handyman. He also happens to be gay and lonely. Ed is practical enough to realize that finding a man in Porterfield, Indiana -- population nine thousand -- is unlikely, so he's shocked and amazed when the man of his dreams suddenly begins delivering his mail each day. Suspecting Fate has lent him a helping hand, Ed schemes to meet the mailman, Rick Benton -- hard-working and responsible -- who has moved to Porterfield to lend a helping hand to his sister, a single parent. Rick, it turns out, is gay and lonely as well. When Ed and Rick meet the attraction is spontaneous and mutual, and soon loneliness is forgotten in the joy of falling in love. As their relationship grows and deepens, they find themselves dealing with the same situations every couple the reactions of friends and families, job responsibilities, and whether their love is a strong enough foundation for a long-term relationship. Ed and Rick, though, have another problem to cope with as well -- whether a small, Indiana town is the best place for two men to build a life together in the early 1980's. With a soundtrack of timeless pop classics, the story of Ed and Rick is a heart-warming journey from that special first kiss to the golden moment when one couple realizes their love is strong enough to endure any and all hardships. Gay or straight, you'll enjoy the ride",
  "genres": [
    "M M Romance",
    "Gay"
  ],
  "author": "Nick Poff",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/445002.The_Handyman_s_Dream"
}