{
  "title": "The Collected Dorothy Parker",
  "description": "Dorothy Parker, more than any of her contemporaries, captured the spirit of the Jazz Age in her poetry and prose, and The Collected Dorothy Parker includes an introduction by Brendan Gill in Penguin Modern Classics.Dorothy Parker was the most talked-about woman of her day, notorious as the hard-drinking bad girl with a talent for stinging repartee and endlessly quotable one-liners. The decadent 1920s and 1930s in New York were a time of great experiment and daring for women. For the rich, life seemed a continual party, but the excesses took their emotional toll. In the bitingly witty poems and stories collected here, along with her articles and reviews, she brilliantly captures the spirit of the decadent Jazz Age in New York, exposing both the dazzle and the darkness. But beneath the sharp perceptions and acidic humour, much of her work poignantly expresses the deep vulnerability of a troubled, self-destructive woman who, in the words of philosopher Irwin Edman, was 'a Sappho who could combine a heartbreak with a wisecrack'.Dorothy Parker (1893-1967) was born in West End, New Jersey, and grew up in New York. In 1916 she sold some of her poetry to the editor of Vogue, and was subsequently given an editorial position on the magazine. She then became drama critic of Vanity Fair and the central figure of the celebrated Algonquin Round Table, whose members included George S. Kaufman and Harpo Marx. Her collections of poems included Enough Rope (1926) and Not So Deep as a Well (1936), and her collections of stories included Here Lies (1939); in addition, she collaborated on and wrote screenplays including the Oscar-winning A Star is Born (1937), and Alfred Hitchcock's Saboteur (1942).If you enjoyed The Collected Dorothy Parker, you might like Truman Capote's The Complete Stories, also available in Penguin Modern Classics.'She managed to express her real feelings in stanzas which snap and glitter like a Chanel handbag'Peter Ackroyd, The Times",
  "genres": [
    "Poetry",
    "Short Stories",
    "Fiction",
    "Classics",
    "Humor",
    "American",
    "Modern Classics"
  ],
  "author": "Dorothy Parker",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/44458.The_Collected_Dorothy_Parker"
}