{
  "title": "Life Changing: How Humans are Shaping the Course of Evolution",
  "description": "In this post-natural history guide, Helen Pilcher invites us to meet key species that have been sculpted by humanity.We are now living through the post-natural phase, where the fate of all living things is irrevocably intertwined with our own. We domesticated animals to suit our needs, and altered their DNA--wolves became dogs to help us hunt, junglefowl became chickens to provide us with eggs, wildebeest were transformed through breeding into golden gnus so rifle-clad tourists had something to shoot. And this was only the beginning. As our knowledge grew we found new ways to tailor the DNA of animals more precisely; we've now cloned police dogs and created a little glow-in-the-dark fish--the world's first genetically modified pet. The breakthroughs continue.Through climate change, humans have now affected even the most remote environments and their inhabitants, and studies suggest that through our actions we are forcing some animals to evolve at breakneck speed to survive. Whilst some are thriving, others are on the brink of extinction, and for others the only option is life in captivity. Today, it's not just the fittest that survive; sometimes it's the ones we decide to let live.According to the Bible, Noah built the original ark to save the world's creatures from imminent floods. Now the world is warming, the ice caps are melting and sea levels are rising. With nowhere \"wild\" left to go, Helen Pilcher proposes a New Ark. In this entertaining and thought-provoking book, she considers the many ways that we've shaped the DNA of the animal kingdom and in so doing, altered the fate of life on earth. In her post-natural history guide, she invites us to meet key species that have been sculpted by humanity, as well as the researchers and conservationists who create, manage and tend to these post-natural creations.",
  "genres": [
    "Nonfiction",
    "Science",
    "Animals",
    "Environment",
    "Evolution",
    "Biology",
    "History"
  ],
  "author": "Helen Pilcher",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/44452969-life-changing"
}