{
  "title": "If the Broom Fits",
  "description": "It’s one thing to talk to your cat. It’s an entirely other thing when it answers you.  Brighton Longfield is kinda bad at life. She’s divorced, childless, and she just got fired… again…  With dwindling savings and few prospects, she packs her possessions into a U-Haul and sets out for the little town of Coventry where she inherited a dilapidated old house from her Great Aunt “Mad” Maude Tuttlesmith.  Coventry is supposed to be a stop in the road for Brighton. The plan is to fix up the house, sell it, and then figure out what to do with her life.  You know what they say about the best-laid plans…  Coventry isn’t your typical small town. At one time, it was home to two powerful families of witches. But, the Skeenbauer and Tuttlesmith families couldn’t put their differences aside, and eventually, the feuding drove the Tuttlesmith witches out of town.  The matriarch of the Skeenbauer family isn’t pleased to have a descendant of the Tuttlesmith witches return. The thing is, the Tuttlesmiths stopped practicing magic when they left Coventry, and Brighton has no idea she’s a witch. She’s about to get a big surprise.  Oh, and there’s also a dead guy in an alley behind the diner. Brighton finds his body one night after stopping in for a stack of pancakes, and of course, the town’s hunky sheriff starts to give her the side eye. But, a lot of people wanted the victim dead, and that only complicates the investigation.  There’s a murderer on the loose in Coventry, and Brighton’s got to learn to harness her powers to avoid the killer’s snare. If the Broom Fits is the first book in the Wicked Witches of Coventry cozy mystery series. It is a humorous and clean read with no swearing, violence, or adult content.",
  "genres": [
    "Mystery",
    "Paranormal",
    "Fantasy",
    "Cozy Mystery",
    "Audiobook",
    "Fiction",
    "Magic"
  ],
  "author": "Sara Bourgeois",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/44526372-if-the-broom-fits"
}