{
  "title": "A Wandering Heart",
  "description": "All the stars come out in Cape Light... New York Times bestselling authors Thomas Kinkade and Katherine Spencer continue their Angel Island series with a sparkling new tale set in Cape Light. Celebrity has landed on Angel Island, but it's new love that steals the show. Welcome to Angel Island. . . .Its captivating spirit can be felt from the shores of its windswept beaches to the heights of its spectacular Angel Wings Cliffs. The island is said to harbor angels who help guide the lost, delivering them from despair and darkness into the golden light of love and faith. A movie crew arrives to shoot a film in Cape Light and Angel Island provides a perfect backdrop. Offering good food and a place to rest, Liza's Inn welcomes the cast and crew, including the famous actress Charlotte Miller. Charlotte is surprisingly down to earth and is totally charmed by the island, especially the Inn, where she chooses to stay instead of more lavish accommodations. But one day, along the water's edge, Charlotte is swept into the sea, only to have her life saved by local fisherman, Colin Doyle. Their attraction is instant and undeniable-even though they come from completely different worlds. As Charlotte spends more time on the island, the relationship seems meant to be. They keep meeting up, by accident at first, then on purpose. But Colin believes he has little to offer this celebrated beauty. He doesn't realize that Charlotte would give up her glamorous life, for him and Angel Island, if only she knew his true feelings. For he alone knows her secret and accepts her completely. It seems only a miracle could bring them together. Then again, with faith and love on their side, Angel Island is just the sort of place where miracles can happen...",
  "genres": [
    "Fiction",
    "Romance",
    "Christian Fiction",
    "Christian",
    "Christian Romance",
    "Contemporary"
  ],
  "author": "Thomas Kinkade",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/12408733-a-wandering-heart"
}