{
  "title": "The Scientific Revolution",
  "description": "\"There was no such thing as the Scientific Revolution, and this is a book about it.\" With this provocative and apparently paradoxical claim, Steven Shapin begins his bold vibrant exploration of the origins of the modern scientific worldview.\"Shapin's account is informed, nuanced, and articulated with clarity. . . . This is not to attack or devalue science but to reveal its richness as the human endeavor that it most surely is. . . .Shapin's book is an impressive achievement.\"—David C. Lindberg, Science\"Shapin has used the crucial 17th century as a platform for presenting the power of science-studies approaches. At the same time, he has presented the period in fresh perspective.\"— Chronicle of Higher Education\"Timely and highly readable . . . A book which every scientist curious about our predecessors should read.\"—Trevor Pinch, New Scientist\"It's hard to believe that there could be a more accessible, informed or concise account of how it [the scientific revolution], and we have come to this. The Scientific Revolution should be a set text in all the disciplines. And in all the indisciplines, too.\"—Adam Phillips, London Review of Books\"Shapin's treatise on the currents that engendered modern science is a combination of history and philosophy of science for the interested and educated layperson.\"— Publishers Weekly\"Superlative, accessible, and engaging. . . . Absolute must-reading.\"—Robert S. Frey, Bridges\"This vibrant historical exploration of the origins of modern science argues that in the 1600s science emerged from a variety of beliefs, practices, and influences. . . . This history reminds us that diversity is part of any intellectual endeavor.\"— Choice\"Most readers will conclude that there was indeed something dramatic enough to be called the Scientific Revolution going on, and that this is an excellent book about it.\"—Anthony Gottlieb, The New York Times Book Review",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "History Of Science",
    "Philosophy",
    "European History",
    "School"
  ],
  "author": "Steven Shapin",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/445121.The_Scientific_Revolution"
}