{
  "title": "An Underground Guide to Sewers: or: Down, Through and Out in Paris, London, New York, &c.",
  "description": "A global guide to sewers that celebrates the magnificently designed and engineered structures beneath the world's great cities. The sewer, in all its murkiness, filthiness, and subterranean seclusion, has been an evocative (and redolent) literary device, appearing in works by writers ranging from Charles Dickens to Graham Greene. This entertaining and erudite book provides the story behind, or beneath, these stories, offering a global guide to sewers that celebrates the magnificently designed and engineered structures that lie underneath the world's great cities. Historian Stephen Halliday leads readers on an expedition through the execrable evolution of waste management—the open sewers, the cesspools, the nightsoil men, the scourge of waterborne diseases, the networks of underground piping, the activated sludge, the fetid fatbergs, and the sublime super sewers. Halliday begins with sanitation in the ancient cities of Mesopotamia, Greece, and Imperial Rome, and continues with medieval waterways (also known as “sewage in the street”); the civil engineers and urban planners of the industrial age, as seen in Liverpool, Boston, Paris, London, and Hamburg; and, finally, the biochemical transformations of the modern city. The narrative is illustrated generously with photographs, both old and new, and by archival plans, blueprints, and color maps tracing the development of complex sewage systems in twenty cities. The photographs document construction feats, various heroics and disasters, and ingenious innovations; new photography from an urban exploration collective offers edgy takes on subterranean networks in cities including Montreal, Paris, London, Berlin, and Prague.",
  "genres": [
    "Nonfiction",
    "History",
    "Engineering",
    "Cities",
    "Architecture",
    "Environment",
    "Design"
  ],
  "author": "Stephen Halliday",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/44512581-an-underground-guide-to-sewers"
}