{
  "title": "Walk the Wild With Me",
  "description": "In this new historical fantasy, a young man must use the power granted by a goddess to infiltrate the realm of Faery and save a kidnapped victim before the door is sealed once again.Orphaned when still a toddler, Nicholas Withybeck knows no other home than Locksley Abbey outside Nottingham, England. He works in the scriptorium embellishing illuminated manuscripts with hidden faces of the Wild Folk and whimsical creatures that he sees every time he ventures into the woods and fields. His curiosity leads him into forbidden nooks and crannies both inside and outside the abbey, and he becomes adept at hiding to stay out of trouble.On one of these forays Nick slips into the crypt beneath the abbey. There he finds an altar older than the abbey’s foundations, ancient when the Romans occupied England. Behind the bricks around the altar, he finds a palm-sized silver cup. The cup is embellished with the three figures of Elena, the Celtic goddess of crossroads, sorcery, and cemeteries.He carries the cup with him always, listening as the goddess whispers wisdom in the back of his mind. With Elena’s cup in his pocket, Nick can see that the masked dancers at the May Day celebration in the local village are actually the creatures of the The Green Man—known to mortals as Little John—and Robin Goodfellow, Herne the Huntsman, dryads, trolls, and water sprites. Theirs are the faces he’s seen and drawn into his illuminations.Guided by Elena along secret forest paths, Nick learns that Little John’s love has been kidnapped by Queen Mab of the Faeries. The door to the Faery mound will only open when the moons of the two realms align. That time is fast approaching. Nick must release Elena so that she can use sorcery to unlock that door, allowing Nick’s band of friends to try to rescue the girl. Will he have the courage to release her as his predecessor did not?",
  "genres": [
    "Fantasy",
    "Fiction",
    "Historical Fiction",
    "Retellings",
    "Fae",
    "Fairy Tales",
    "Audiobook"
  ],
  "author": "Rachel Atwood",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/44525191-walk-the-wild-with-me"
}