{
  "title": "The Ride of a Lifetime: Lessons Learned from 15 Years as CEO of the Walt Disney Company",
  "description": "A grand vision defined: The CEO of The Walt Disney Company shares the ideas and values he has used to reinvent one of the most beloved companies in the world, and inspire the people who bring the magic to life.In 2005, Robert Iger became CEO of The Walt Disney Company during a difficult time. Morale had deteriorated, competition was more intense, and technology was changing faster than at any time in the company's history. \"I knew there was nothing to be gained from arguing over the past,\" Iger writes. \"The only thing that mattered was the future, and I believed I had a clear idea of the direction Disney needed to go.\" It came down to three clear ideas: 1) Create the highest quality content Disney could produce. 2) Embrace and adopt technology instead of fighting it. And 3) Think bigger--think global--and turn Disney into a stronger brand in international markets.Twelve years later, Disney is the largest, most respected media company in the world counting Pixar, Marvel, Lucasfilm and 21st Century Fox among its properties. Its value is nearly five times what it was when Iger took over, and Iger is recognized as one of the most innovative and successful CEOs of our time.Now, he's sharing the lessons he's learned while running Disney and leading its 200,000 employees--taking big risks in the face of historic disruption; learning to inspire the people who work for you; leading with fairness and communicating principles clearly. This book is about the relentless curiosity that has driven Iger for forty-five years, since the day he started as a studio supervisor at ABC. It's also about thoughtfulness and respect, and a decency-over-dollars approach that has become the bedrock of every project and partnership Iger pursues, from a deep friendship with Steve Jobs in his final years to an abiding love of the evolving Star Wars myth.\"Over the past fourteen years, I think I've learned so much about what real leadership is,\" Iger writes. \"But I couldn't have articulated all of this until I lived it. You can't fake it--and that's one of the key lessons in this book.\"Librarian Note: This is an Advance Reader Copy issued with ISBN 9780399592096. That ISBN has been moved to the final published copy, found here",
  "genres": [
    "Business",
    "Biography",
    "Nonfiction",
    "Leadership",
    "Memoir",
    "Audiobook",
    "Management"
  ],
  "author": "Robert Iger",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/44525305-the-ride-of-a-lifetime"
}