{
  "title": "How The Other Half Learns: Equality, Excellence, and the Battle Over School Choice",
  "description": "An inside look at America's most controversial charter schools, and the moral and political questions around public education and school choice.The promise of public education is excellence for all. But that promise has seldom been kept for low-income children of color in America. In How the Other Half Learns , teacher and education journalist Robert Pondiscio focuses on Success Academy, the network of controversial charter schools in New York City founded by Eva Moskowitz, who has created something unprecedented in American education: a way for large numbers of engaged and ambitious low-income families of color to get an education for their children that equals and even exceeds what wealthy families take for granted. Her results are astonishing, her methods unorthodox.Decades of well-intended efforts to improve our schools and close the \"achievement gap\" have set equity and excellence at war with each other: If you are wealthy, with the means to pay private school tuition or move to an affluent community, you can get your child into an excellent school. But if you are poor and black or brown, you have to settle for \"equity\" and a lecture--about fairness. About the need to be patient. And about how school choice for you only damages public schools for everyone else. Thousands of parents have chosen Success Academy, and thousands more sit on waiting lists to get in. But Moskowitz herself admits Success Academy \"is not for everyone,\" and this raises uncomfortable questions we'd rather not ask, let alone answer: What if the price of giving a first-rate education to children least likely to receive it means acknowledging that you can't do it for everyone? What if some problems are just too hard for schools alone to solve?",
  "genres": [
    "Education",
    "Nonfiction",
    "Teaching",
    "Parenting",
    "Politics",
    "Society",
    "Sociology"
  ],
  "author": "Robert Pondiscio",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/44525550-how-the-other-half-learns"
}