{
  "title": "Prizes",
  "description": "Erich Segal, bestselling author of Love Story and Doctors, now brings his extraordinary storytelling gifts to the elite arena of the world's most remarkable physicians and scientists. In Prizes, Segal brings vividly to life three very different and memorable characters in a story brimming with love and loss, discoveries and betrayals, life and death.Adam Coopersmith. He is that rare a brilliant physician who truly cares for his patients. But his marriage to Antonia, an ambitious lawyer, has lost its early passion. It's not until Adam meets Anya Avilova, a Russian émigré who has tried desperately to have a child, that he falls in love for the first time...only to have his career nearly destroyed by scandal and his life endangered by something unforeseen--and far more perilous....Sandy Raven. A researcher on the cutting edge, Sandy's devotion is matched only by his genius. Yet at the moment of his greatest discovery, he will experience his most profound betrayal. Suddenly, the family life Sandy cherishes will hang in the balance. Will he choose to live a lie or abandon his dream to seek new, more worldly prizes?...Isabel da Costa. A child prodigy, Isabel owes all her success to her father, who pushed her to reach for the stars. Though she becomes a brilliant physicist, all the adulation in the world can't give Isabel another childhood. In the end, she will be torn between the father who has given her everything and the young man who holds the key to her happiness--until a shocking revelation explodes her world and threatens her very life....Adam. Sandy. Isabel. For each, the Nobel Prize casts its seductive promise over their work. Two will be selected for this highest honor; one of them will not live to receive it. But as they pursue the secrets of nature, they will also discover the secrets in their own hearts. Their stories make Prizes a gripping, emotionally charged experience, a novel that proves once again that Erich Segal is the unsurpassed master of laughter and tears, tragedy, and triumph.",
  "genres": [
    "Fiction",
    "Romance",
    "Drama",
    "Contemporary",
    "Indonesian Literature",
    "Thriller",
    "Russia"
  ],
  "author": "Erich Segal",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1241048.Prizes"
}