{
  "title": "Influence Starts with “I”: A Woman’s Guide for Unleashing the Power of Leading from Within and Effecting Change Around You",
  "description": "Influence is power.  What does a woman need to lead well in today's competitive work environment? If you think it's a coercive, \"power over\" style of leadership, think again. Influence Starts with \"I\": A Woman's Guide for Unleashing the Power of Leading from Within and Effecting Change Around You outlines how to be a more effective leader by tapping into the authentic \"I\" within you to cultivate \"power with\" others and effect change around you. Influence skills are important ingredients to effective leadership in today's complex organizations and institutions. In her latest title, author and leadership coach Jeanne Porter King provides a guide for developing the personal side of leadership. This guide helps you to -Identify your leadership purpose -Develop an influence mindset  -Use your power strategically  -Negotiate gender barriers  -Build your support system, and more Reflective exercises and questions allow you to readily apply what you've learned and build your plan for growth. Every existing and emerging woman leader needs to carve out the space and time to do the inner work on their leadership. Whether you work in a corporate setting or a nonprofit organization, you have what it takes to lead from within and influence positive change around you. \"Dr. Jeanne Porter King leverages her deep knowledge of business processes and effective leadership to guide the reader through understanding the power of influence and providing a path to achieve it.\" --Connie Lindsey, Executive Vice President,Northern Trust \"Jeanne Porter King shows women leaders how to lead from within to make a positive impact on others, so they can shape positive changes and gain commitment. I highly recommend Jeanne's book to anyone who wants to learn how to amass the interpersonal and social capital needed to achieve success. Take this book on a personal retreat and carve out the time to do the inner work on your leadership!\" --Laura Stack, Founder & CEO, Leadership USA, INC. Jeanne Porter King is an author, consultant, and inspirational speaker who specializes in developing women leaders. The founder and president of TransPorter Group Inc., Jeanne has trained, coached, and mentored leaders in corporate, community, and faith-based organizations. Through TransPorter she provides tools and resources to move people and systems to higher levels of effectiveness.",
  "genres": [],
  "author": "Jeanne Porter King",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/44554197-influence-starts-with-i"
}