{
  "title": "Task Force Baum",
  "description": "In the tradition of Saving Private Ryan and Bridge Over the River Kwai, bestselling author James D. Shipman delivers a powerful, action-packed novel that illustrates the long-buried secrets and unending costs of war--based on the true story of General Patton's clandestine unauthorized raid on a World War II POW camp.    March, 1945. Allied forces are battle-worn but wearily optimistic. Russia's Red Army is advancing hard on Germany from the east, bolstering Allied troops moving in from the west and north. Soon, surely, Axis forces must accept defeat. Yet for Captain Jim Curtis, each day is a reminder of how unpredictable and uncertain warfare can be.Captured during the Battle of the Bulge after the Germans launched a devastating surprise attack, Curtis is imprisoned at a POW camp in Hammelburg, Bavaria. Conditions are grim. Inmates and guards alike are freezing and starving, with rations dwindling day by day. But whispers say General Patton's troops are on the way, and the camp may soon be liberated.Indeed, fifty miles away, a task force of three hundred men is preparing to cross into Germany. With camps up and down the line, what makes Hammelburg so special they don't know, but orders are orders. Yet their hopes of evading the enemy quickly evaporate. Wracked by poor judgment, insufficient arms, and bad luck, the raid unravels with shattering losses. The liberation inmates hoped for becomes a struggle for survival marked by a stark choice: stay, or risk escaping into danger--while leaving some behind.For Curtis, the decision is an even more personal test of loyalty, friendship, and the values for which one will die or kill. It will be another twenty years before the unsanctioned mission's secret motivation becomes public knowledge, creating a controversy that will forever color Patton's legacy and linger on in the lives of those who made it home at last--and the loved ones of those who did not.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "War",
    "Military Fiction",
    "World War II",
    "Historical",
    "Novels"
  ],
  "author": "James D. Shipman",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/44543991-task-force-baum"
}