{
  "title": "Jon's Downright Ridiculous Shooting Case",
  "description": "A psychic without an anchor. A student in trouble. A shooter on the loose.  I’m Jonathan Bane, a licensed psychic who consults for the police. I routinely help the police put the bad guys away and, for that reason, the criminal world doesn’t like me much. People like to take a swing at me, or go stabbity, or try for a gun. It makes for interesting times. My psychic ability prevents me from handling anything electronic—and I do mean ANYTHING, I fry it in seconds—so calling for help isn’t always a possibility.  I need an anchor, a partner, but I’m resigned: it’s just wishful thinking.  At least, I thought so until he walked through the door.  Donovan Havili looks like a thug and has the soul of a superhero. He shines so bright in my vision it’s like watching a supernova. He definitely has the right mindset and skills for this crazy job. But asking anyone to take me on long-term is a bit much. And now we’ve got multiple cases to handle, a Chinese exchange student falsely accused who needs our help, and someone taking random shots at me. It’s a bit much for any new guy to handle and I’m half-afraid that my new partner will run for the door.  But in Donovan Havili, the criminal world has met its match. And maybe, just maybe, I have as well.   Trigger Warnings: Your average cop show violence and criminals.  Tags: Companionable snark, Flirting, Kissing, Jon needs a hug, Donovan gives the best hugs, Getting together, Self-esteem issues, Explicit content, Anal Sex, Romantic Sex, Random shooting, Which Donovan isn’t happy about, Donovan is a gentleman, Sort of, Jon just makes it REALLY REALLY HARD Okay?, Bisexual character, Public displays of affection, Muscles, Communication, Healthy relationships, The fluff might kill you, Supernatural elements, Modern with Magic, Feels, All the Feels, Mostly accurate medical stuff, Multiple electronics died in the creation of this story, blame Jon.",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Mystery",
    "Romance",
    "Fantasy",
    "Contemporary",
    "Urban Fantasy"
  ],
  "author": "A.J. Sherwood",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/44577241-jon-s-downright-ridiculous-shooting-case"
}