{
  "title": "Gryphon's Pride",
  "description": "Alternate cover edition of ASIN B07PQBCX8ZNot your typical reverse harem...Gryphon shifter Gesa Lionheart isn’t your typical heroine. Screwed over by her family—a stunningly medieval gryphon clan that is supposed to value loyalty and truth—the former bodyguard sets out on her own to a remote city growing in the Michigan wilderness. With little in the way of life skills outside her clan training, and no one to depend on, she becomes a bounty hunter—chasing down low-level supernatural criminals for the local human police department. Gesa knew life would be hard outside the clan, but she had no way of predicting just how strange her life would become, all thanks to a beautiful but dangerous male fae and a simple missing person’s case. Now she’s over her head in a world that isn’t what it seems, where humans can almost see the truth, rich supe philanthropists make people disappear with ease, and harem lion prides aren’t just for males….Gryphon’s Pride is a reverse harem romance novella with an urban fantasy feel. Starts as a medium burn romance in this first book (ie: fewer sex scenes), and increases from there. Suitable for mature readers (and those with a sense of humor) only. If swearing, sex, or talk of past trauma are offensive to you, this might not be your thing. \nAuthor’s Note\nI was tired of reading the same old thing over and over again in reverse harem. Sick of all alpha male and fainting female all the time—and desperate to be able to tell the male characters apart—I tried to infuse some variety into my story. Gesa might not be your cup of tea, and that’s okay—she doesn’t care. Her lovers are as varied in physicality and personality as they are in supernatural race. And the characters all have their own definition of sexuality. I know reverse harem is all about the fantasy, and my fantasy is a bit outside the norm. You’ve been warned. * Gesa’s Menagerie books are novellas of between 30,000-40,000 words.* This is a series. There will be unresolved plot threads at times/ occasional cliff hangers.* Do NOT read this series if you are easily offended. Contains: mentions of past trauma/rape, adult language (that’s cursing kids, lots of it), and sexual content (including male/female, male/male, female/female, male/male/female, female/female/male and any other combination you can think of. Oh, and probably some tentacles and diphallia).",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Urban Fantasy",
    "Shapeshifters",
    "Fae"
  ],
  "author": "Kaye Draper",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/44575704-gryphon-s-pride"
}