{
  "title": "Super Pumped: The Battle for Uber",
  "description": "New York Times and Wall Street Journal BestsellerA New York Times technology correspondent presents the dramatic story of Uber, the Silicon Valley startup at the center of one of the great venture capital power struggles of our time. In June 2017, Travis Kalanick, the hard-charging CEO of Uber, was ousted in a boardroom coup that capped a brutal year for the transportation giant. Uber had catapulted to the top of the tech world, yet for many came to symbolize everything wrong with Silicon Valley. Award-winning New York Times technology correspondent Mike Isaac’s Super Pumped presents the dramatic rise and fall of Uber, set against an era of rapid upheaval in Silicon Valley. Backed by billions in venture capital dollars and led by a brash and ambitious founder, Uber promised to revolutionize the way we move people and goods through the world. A near instant “unicorn,” Uber seemed poised to take its place next to Amazon, Apple, and Google as a technology giant. What followed would become a corporate cautionary tale about the perils of startup culture and a vivid example of how blind worship of startup founders can go wildly wrong. Isaac recounts Uber’s pitched battles with taxi unions and drivers, the company’s toxic internal culture, and the bare-knuckle tactics it devised to overcome obstacles in its quest for dominance. With billions of dollars at stake, Isaac shows how venture capitalists asserted their power and seized control of the startup as it fought its way toward its fateful IPO. Based on hundreds of interviews with current and former Uber employees, along with previously unpublished documents, Super Pumped is a page-turning story of ambition and deception, obscene wealth, and bad behavior that explores how blistering technological and financial innovation culminated in one of the most catastrophic twelve-month periods in American corporate history.",
  "genres": [
    "Business",
    "Nonfiction",
    "Technology",
    "Audiobook",
    "Biography",
    "History",
    "Economics"
  ],
  "author": "Mike Isaac",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/44573628-super-pumped"
}