{
  "title": "How I Pitched the First Curve",
  "description": "In 1908, William Arthur “Candy” Cummings wrote an article for Baseball Magazine called “How I Pitched the First Curve.” The two-page article tells the story of how Cummings invented baseball’s first breaking pitch, the curveball, after years of experimentation. While the game was still in its relative infancy when Cummings threw the first curveball in 1867, the pitch revolutionized the sport. Perhaps due to its status as America’s pastime, baseball has often been said to have many of the traits that have characterized the United States as a country. Because the sport and the country are so interconnected, baseball presents a microcosm of America’s social and cultural struggles throughout their shared history. To make these issues more explicit, to show them as inseparable from the game, just as inseparable as the game is from American culture, one must dig beneath this surface; one must see it as a curve rather than a straight line. In How I Pitched the First Curve, Ryan Clark has written ten different homophonic translations of Cummings’ article. As the book progresses in the style of a baseball game, complete with nine innings and a seventh-inning stretch, each translation investigates a different social issue imbedded within the sport, including racism, labor conflicts, steroid use, Cummings' disputed claim to the curveball, and more.This process of homophonic translation becomes a process of sifting through excess signification, of bubbling over our domesticated understanding of America's pastime with new, multiple meanings. Through this method, Clark demonstrates the ways in which the curve might help us to better read and understand the world around us.Like any sufficiently advanced science, this book manages an impossible magic (and music) that explores the borders of possibility and belief. Through a deft phonetic procedure of his own invention, Ryan Clark transmutes the relatively straightforward language of an obscure sports article into a series of eloquently braided poetic narratives. From direct personal experience to socio-political commentary, the lines of this story dart and swerve across the history of baseball and America itself. Here are the hidden intersections of sport, race, sex and money laid bare and finally lyricized for all to see, hear and eventually sing.-Travis Macdonald, author of The O Mission RepoI’m ashamed to say the following in blurb, because this isn’t hyperbole and is thus inappropriate for the genre, but this is truly one of the most exquisite books I’ve ever read. Where most homophonic translations are whimsical, comic, madcap, anomic, and, frankly, purposeless, Clark’s here are not. Examining the monstrous within our personal and communal lives, this book is not merely linguistically ingenious, it is emotionally moving, poignant, and psychologically insightful, and it rolls out of the alphabet with a shocking political and ethical force. Ryan Clark is a masterful poet.-Gabriel Gudding, author of Literature for Nonhumans and Rhode Island Notebook",
  "genres": [],
  "author": "Ryan  Clark",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/44575707-how-i-pitched-the-first-curve"
}