{
  "title": "Sacred Gifts, Profane Pleasures: A History of Tobacco and Chocolate in the Atlantic World",
  "description": "Before Columbus's fateful voyage in 1492, no European had ever seen, much less tasted, tobacco or chocolate. Initially dismissed as dry leaves and an odd Indian drink, these two commodities came to conquer Europe on a scale unsurpassed by any other American resource or product. A fascinating story of contact, exploration, and exchange in the Atlantic world, Sacred Gifts, Profane Pleasures traces the ways in which these two goods of the Americas both changed and were changed by Europe. Focusing on the Spanish Empire, Marcy Norton investigates how tobacco and chocolate became material and symbolic links to the pre-Hispanic past for colonized Indians and colonizing Europeans alike. Botanical ambassadors of the American continent, they also profoundly affected Europe. Tobacco, once condemned as proof of Indian diabolism, became the constant companion of clergymen and the single largest source of state revenue in Spain. Before coffee or tea became popular in Europe, chocolate was the drink that energized the fatigued and uplifted the depressed. However, no one could quite forget the pagan past of tobacco and chocolate, despite their apparent Europeanization: physicians relied on Mesoamerican medical systems for their understanding of tobacco; theologians looked to Aztec precedent to decide whether chocolate drinking violated Lenten fasts. The struggle of scientists, theologians, and aficionados alike to reconcile notions of European superiority with the fact of American influence shaped key modern developments ranging from natural history to secularization. Norton considers the material, social, and cultural interaction between Europe and the Americas with historical depth and insight that goes beyond the portrayal of Columbian exchange simply as a matter of exploitation, infection, and conquest.",
  "genres": [
    "History",
    "Nonfiction",
    "School",
    "Food",
    "Academic",
    "World History",
    "Cultural"
  ],
  "author": "Marcy Norton",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/4458016-sacred-gifts-profane-pleasures"
}