{
  "title": "Surrender the Rain",
  "description": "She was never allowed to cry. He was never allowed to love.There hasn't been a drop of rain in Kiowa territory for many moons. The drought dried the crops, the rivers and pushed the bison far to the south.After the death of her abusive mama, Sadie stands in a dead corn field the last survivor of their settlement, wanting to die.Fire Eyes, a Kiowa warrior, secretly watches the distraught woman talking to the sky. Her tears fall like rain as she attempts to take her life. When the sky unfolds and unleashes a tempest, he rushes to save her, forever binding her to him. They can't be together--she's a witch. Talks to the Sky can summon the rain with her tears and now Kiowa enemies want to wage war for the woman. Fire Eyes knows the Pawnee will painfully torture Talks to the Sky to make the rain. They will destroy her to bring home the bison and the grass.Fire Eyes will risk everything for the woman who sets his heart and body on fire. Only, she has to cry, and he has to love.Dear Reader, The Fire on the Plains Romance © 2019 EMis a planned series of novellas, ranging from 80 to 110 pages that are perfect when you want a satisfying story but don't have the time to invest in the lengthy novel. These stories move quick with engaging characters, fast plots and timeless American west settings. The heat levels range from warm to smoldering. These are the pocket romances you snuck from your mama, your grandma or aunt. (We all did.)You can keep track of all the FOTPR romances atElleMarlow.Blogspot.com and simply look for the page with the FOTPR heading. Enjoy! And don't be afraid to share your thoughts with me. I love hearing from readers. ~EM Not for the under 18 reader due to graphic sexual descriptions. This series do go in order from book 1 - 3 they are not stand-alones. Book 2, Surrender the Wind due on Amazon July 2019.",
  "genres": [],
  "author": "Elle Marlow",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/44568614-surrender-the-rain"
}