{
  "title": "Rock & Roll Homicide",
  "description": "Just as the rock band, Dobermans Stub, was about to reach stadium tour status, its leader was brutally murdered when his headphones exploded during a recording session. The widow, who inherits $5 million, is the San Diego Police Departments number one suspect. She hires Jason Duffy, a 27-year-old PI and former musician, in his first year of private practice.  Jason learns that the victim was in the middle of an acrimonious renegotiation with the record company at the time of his death. He also finds that the record company has a very unhealthy tie to the Russian Mafia. As an inexperienced detective, Jason does not yet have the contacts within the police department to gather vital information. He is forced to mend fences with his estranged father, an opinionated ex-SDPD detective.  While Jason investigates the record company, he also takes a close look at the three surviving members of the victims band. One is an alcoholic/drug addict drummer, on the verge of being kicked out of the group. The second is a bass player who camouflages his rock star status by living in an ordinary house in a lower middle-class neighborhood. Third is a lead guitarist and writer of half of the bands songs, who lives well beyond his means. Jason has not yet become hardened to the very real dangers of his new profession. We experience his inner conflict as his girlfriend, staff, and family are drawn into the danger zone. After Jasons part-time employee is severely beaten during a stakeout, he sells the story of the Russian Mafias involvement in the record business to a tabloid journalism TV show in a misguided effort to protect his employer and coworker. This serves to drive the case to new heights of danger and suspense. Jason goes behind the industry veneer of sex & drugs & hedonistic lifestyles. He shows us how the 21st Century world of downloads, file sharing, and image demographics need to be considered in a case of Rock & Roll Homicide.",
  "genres": [
    "Mystery",
    "Music",
    "M M Romance",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Rock N Roll"
  ],
  "author": "R.J. McDonnell",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/4457883-rock-roll-homicide"
}