{
  "title": "Going All City: Struggle and Survival in LA's Graffiti Subculture",
  "description": "\" We could have been called a lot of brazen vandals, scared kids, threats to social order, self-obsessed egomaniacs, marginalized youth, outsider artists, trend setters, and thrill seekers. But, to me, we were just regular kids growing up hard in America and making the city our own. Being 'writers' gave us something to live for and 'going all city' gave us something to strive for; and for some of my friends it was something to die for.\" In the age of Banksy, trendy street art, and commissioned wall murals, it's easy to forget graffiti's complicated and often violent past in the United States. Though graffiti has become one of the most influential art forms of the twenty-first century, cities across the United States waged a war against it from the late 1970s to the early 2000s, complete with brutal police task forces. Who were the much-maligned taggers they targeted? Teenagers, usually, from low-income neighborhoods with little to their names except a few spray cans and a desperate need to be seen--to mark their presence on city walls and buildings even as their cities turned a blind eye to them. Going All City is the mesmerizing and painful story of these young graffiti writers, told by one of their own. Prolific LA writer Stefano Bloch came of age in the late 1990s amid constant violence, poverty, and vulnerability. He recounts vicious interactions with police; debating whether to take injured friends with gunshot wounds to the hospital; coping with his mother's heroin addiction; instability and homelessness; and his dread that his stepfather would get out of jail and tip his unstable life into full-blown chaos. But he also recalls moments of peace and marking a fresh tag; the thrill of running with his crew at night; exploring the secret landscape of LA; the dream and success of going all city. Bloch holds nothing back in this fierce, poignant memoir. Going All City is an unflinching portrait of a deeply maligned subculture and an unforgettable account of what writing on city walls means to the most vulnerable people living within them.",
  "genres": [
    "Nonfiction",
    "Urban Studies",
    "Memoir",
    "Cities",
    "Art"
  ],
  "author": "Stefano Bloch",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/44579906-going-all-city"
}