{
  "title": "2016 Presidential Election 120",
  "description": "The Confederate States of America returns to the United States to protest a Blue Party or DRats Party victory in the United States Supreme Court. The Red Party or Government of the Racist (G. O. P.) Party candidate is demanding a victory after a close election in November of 2016. President Nero establishes the Confederate States of America and lives in the White Supremacist House while he orders the new laws to benefit conservatives and the rich one percent. All of the United States armed forces side with the Confederacy. New laws pass in the Confederacy to build a wall around the blue states to keep out the liberals after a civil war ends. The Confederacy becomes isolationist and abandons the United Nations (U. N.) and North Atlantic Treaty Organization (N. A. T. O.). President Nero is calling for the creation of the Freedom Camps a euphemism for Muslim concentration camps to house all of the Muslims in America. The Union Underground Movement springs into action to fight against the insidious Confederacy in order to unite the country.  A group of characters now must deal with the consequences of the civil war in the United States. Each of them will struggle to survive and unite the country into one. Ingrid is a seventeen-year-old teen girl who lives with Nathan her annoying father who does not want her to join the armed forces. Naty is accused of a murder now only a mysterious man offering her a job with the Union Underground Movement can get her out of jail. Ben is a professional video gamer who is cheating in order to allow his college team to advance in the Selective Service Online Game tournament. Brigham constantly lies to hide his secret relationship with a girlfriend during his proselytizing mission. Ahmed is planning to do some community service to film a video for a future campaign commercial. Nathan thinks that some illegal immigrants killed his wife. Luis has trouble talking to women and asks for the advice of his friend. Renee is a prison guard who is in love with one of the female prisoners at work. Ensley is a female prisoner who is making an escape plan with her cellmate.  (Word Count 60,467)",
  "genres": [],
  "author": "I.D. Oro",
  "average_rating": "4.93",
  "url": "https://www.goodreads.com/book/show/44571915-2016-presidential-election-120"
}