{
  "title": "Liberty",
  "description": "\"Explosive!\"\"Whoa, I did not see that coming!\"\"This one might be even better than the last!\"For fans of The Sky in the Deep by Adrienne Young comes the second in the historical fantasy series, The Deliverance Series. Full of twists and turns you will not expect!Deliverance and her family return as they are hot on the trail of a nefarious human trafficking ring. Jack is determined to root out the evil in Arcanton and enlists the aid of John Asher and Catalyst to do it. Meanwhile, Eleanor, all grown up and graduated from medical school has achieved a fame status from her early medical exploits on Nar. Questions arise, though, causing Eleanor to doubt herself. She decides, in a brave move, to take up an ambassadorial exchange physician program to the closed-off colony of the Westlands, an enigmatic place on the other side of the planet where Arcanton has been losing its foothold for decades. Rumors abound about the region, closed off from most outsiders, and shrouded in magic. Eleanor is determined to help heal their overabundance of magical malady cases and see the place for herself.Meanwhile, on the far reaches of the icy tundra, 16-year-old Liberty Fields struggles to survive in the Gulak, a Rusky mercenary factory where she has lived since childhood because of her wild, unpredictable magic gift. She ferociously carves out her life there until one day she is plucked out of the Gulak by a mysterious Westlander, Doctor Thomas Lawrence. Life does not cease to be difficult for Liberty, however, as she finds herself struggling at the Westlands Junior Military Academy to curb her violent impulses and learn how to become part of a team. Will she be able to meet the demands of her new life?When dark secrets begin to unravel, Deliverance’s clan must decide where their loyalties lie. They must wrestle with the what is the cost of liberty?Historical FantasyColonial FantasyMagical RealismAlternate RealityWitchesYA FantasyAdult FantasyDystopianBy ordering this book, you are supporting small, disabled veteran owned business. Thank you for your support!",
  "genres": [],
  "author": "Samantha Schinder",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/44569312-liberty"
}