{
  "title": "Ce que le jour doit à la nuit",
  "description": "Alors que Younes n’a que neuf ans, son père, paysan ruiné par un spéculateur autochtone, perd ses terres ancestrales. Accablé, l’homme doit se résoudre à confier son enfant à son frère, un pharmacien parfaitement intégré à la communauté pied-noir d’une petite ville de l’Oranais. Le sacrifice est immense. En abandonnant son fils, l’homme perd du même coup le respect de lui-même.Mais les yeux bleus de Younes et son physique d’ange l’aident à se faire accepter par cette communauté aisée de province. Rebaptisé Jonas, il grandit parmi de jeunes colons dont il devient l’inséparable camarade. Il découvre avec eux les joies de l’existence et partage leurs rêves d’adolescents privilégiés que ni la Seconde Guerre Mondiale ni les convulsions d’un nationalisme arabe en pleine expansion ne perturbent. Jusqu’au jour où revient au village Émilie, une jeune fille splendide qui va devenir la vestale de nos jeunes gens. Naîtra ainsi une grande histoire d’amour qui mettra à rude épreuve la complicité fraternelle des quatre garçons, écartelés entre la loyauté, l’égoïsme et la rancune que la guerre d’Indépendance va aggraver. La révolte algérienne sera, pour Younes-Jonas, sanglante et fratricide. Il refusera de laisser détruire l’amitié exceptionnelle qui l’unit à ces jeunes pieds-noirs ; il ne pourra tourner le dos à cet oncle et à cette tante qui lui ont offert une vie meilleure ; mais jamais il n’acceptera non plus de renoncer aux valeurs inculquées par son père : la fierté, la déférence envers ses ancêtres et les coutumes de son peuple, le respect absolu de la parole donnée, et, ce, quitte à mettre en péril l’amour déchirant qu’il a pour Émilie.Avec la verve romanesque qu’on lui connaît, Yasmina Khadra éclaire d’un nouveau jour ce conflit ayant opposé deux peuples amoureux d’un même pays. La grande originalité de cette saga qui se déroule de 1930 à nos jours repose sur une courageuse défense de cette double culture franco-algérienne que l’Histoire a, de part et d’autre, trop souvent cherché à renier.",
  "genres": [
    "Fiction",
    "Algeria",
    "France",
    "Historical Fiction",
    "Romance",
    "Africa",
    "Roman"
  ],
  "author": "Yasmina Khadra",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/4459330-ce-que-le-jour-doit-la-nuit"
}