{
  "title": "Crossings",
  "description": "SHORTLISTED FOR THE VOSS LITERARY AWARD 2020LONGLISTED FOR THE INDIE BOOK AWARD FOR DEBUT FICTION 2020I didn't write this book. I stole it...A Parisian bookbinder stumbles across a manuscript containing three stories, each as unlikely as the other.The first, 'The Education of a Monster', is a letter penned by the poet Charles Baudelaire to an illiterate girl. The second, 'City of Ghosts', is a noir romance set in Paris in 1940 as the Germans are invading. The third, 'Tales of the Albatross', is the strangest of the the autobiography of a deathless enchantress. Together, they tell the tale of two lost souls peregrinating through time.An unforgettable tour de force with echoes of Roberto Bolaño, David Mitchell and Umberto Eco, Crossings is a novel in three parts, designed to be read in two different directions, spanning a hundred and fifty years and seven lifetimes.PRAISE FOR CROSSINGS'The style is in the tradition of storytelling of old, where tales are told rather than shown, and somewhat like Scheherazade (who is referenced in the book) the reader is seduced by the telling.' Readings'[An] elegant and unusual début' Australian Book Review'Just as the dolls fit into one another, Crossings all makes sense at the end, neatly and satisfactorily resolving its multiple narrative threads and possibilities with grace, attention to detail and emotional acuity. No matter which narrative path a reader takes, there is no sense of confusion or dissatisfaction, just a little sadness at having to farewell such a fine book.' Sydney Morning Herald'Romance, mystery, history, and magical invention dance across centuries in an impressive debut novel. Landragin layers historical fiction, metafiction, mystery, fantasy, myth, and romance in a way that might remind readers of such books as Cloud Atlas , Life After Life , The Time Traveler's Wife -or even Dan Brown's conspiracy-based adventures, albeit with more elegant prose Landragin carries off the whole handsomely written enterprise with panache. This novel intrigues and delights with an assured orchestration of historical research and imaginative flights.' Kirkus Reviews'This novel is outstanding for its sheer inventiveness. The alternative ordering of chapters creates a tension that heightens the awareness of the interlocking aspects of time and space, while deft writing seduces the reader in a complex tale of pursuit, denial, and retribution moving from past to future. Highly recommended.' Library Journal",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Magical Realism",
    "Historical",
    "Romance",
    "Book Club"
  ],
  "author": "Alex Landragin",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/44596827-crossings"
}