{
  "title": "Answers in the Attic",
  "description": "A heartwarming cozy mystery series about losing everything, taking a chance, and starting again. After suffering a personal tragedy Abby Sullivan buys a huge old seaside mansion she has never even seen, packs up her life in San Francisco, and moves to Holiday Bay Maine, where she is adopted, quite against her will, by a huge Maine Coon Cat named Rufus, a drifter with her own tragic past named Georgia, and a giant dog with an inferiority complex named Ramos. What Abby thought she needed was alone time to heal. What she ended up with was, an inn she never knew she wanted, a cat she couldn't seem to convince to leave, and a new family she'd never be able to live without.In book 4 in the series, the remodel is almost complete and Abby and Georgia are planning a huge grand opening. The only thing left for Abby to do before Lonnie can wrap things up is to go through the items left in the attic by prior residents. Abby is just about to get started when a woman named Trinity Roswell shows up claiming to be the great, great, great, niece of Abagail Chesterton, the wife of the man who built the house, Chamberlain Westminster. Trinity, a woman in her thirties, is doing a family history and has questions about Abagail. Abby only knows what she has been told by others but invites the woman to help her dig through the contents in the attic. They figure that if Abagail did leave anything behind then the attic is where it would be stored. While Abby and Trinity seek out the last of the secrets the house once held, Colt is busy remodeling his own new home, Tanner has a new litter of puppies, Nikki is dating a man Georgia doesn't like and doesn't trust, and Annie notifies Abby about a death in the family.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Romance",
    "Adult",
    "Animals"
  ],
  "author": "Kathi Daley",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/44597003-answers-in-the-attic"
}