{
  "title": "How Quickly She Disappears",
  "description": "The Dry meets Silence of the Lambs in this intoxicating tale of literary suspense set in the relentless Alaskan landscape about madness and obsession, loneliness and grief, and the ferocious bonds of family …It’s 1941 in small-town Alaska and Elisabeth Pfautz is alone. She’s living far from home, struggling through an unhappy marriage, and she spends her days tutoring her precocious young daughter. Elisabeth’s twin sister disappeared without a trace twenty years earlier, and Elisabeth’s life has never recovered. Cryptic visions of her sister haunt her dreams, and Elisabeth’s crushing loneliness grows more intense by the day. But through it all, she clings to one belief: That her sister is still alive, and that they’ll be reunited one day.And that day may be coming soon. Elisabeth’s world is upended when Alfred Seidel — an enigmatic German bush pilot — arrives in town and murders a local man in cold blood. Sitting in his cell in the wake of his crime, Alfred refuses to speak to anyone except for Elisabeth. He has something to tell her: He knows exactly what happened to her long-missing sister, but he’ll reveal this truth only if Elisabeth fulfills three requests.Increasingly isolated from her neighbors and imprisoned by the bitter cold and her own obsession, Elisabeth lets herself slip deeper into Alfred’s web. A tenuous friendship forms between them, even as Elisabeth struggles to understand Alfred’s game and what he’s after.But if it means she’ll get answers, she’s willing to play by his rules. She’s ready to sacrifice whatever it takes to be reunited with her sister, even if it means putting herself — and her family — in mortal danger.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Historical Fiction",
    "Mystery Thriller",
    "Suspense",
    "Adult"
  ],
  "author": "Raymond Fleischmann",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/44596140-how-quickly-she-disappears"
}