{
  "title": "Atlantis The Antedeluvian World",
  "description": "At the center of Donnelly's thesis are similarities between widely separated cultures. This he interpreted as evidence that all civilization diffused outward from a central point: a now sunken continent in the mid-Atlantic. He cites mythological, linguistic, ethnographic & other evidence for his theory, which at the time seemed to add up to an airtight case. He proposes a literal interpretation of Plato's Atlantis account. He also ties it into the global flood myth-complex. These, until recently, have been two of the most compelling unsolved puzzles of history. What was Plato writing about when he described the prehistoric civilization which disappeared overnight in a great catastrophe? Was this an historical account or a philosophical fable? Why do widely separated cultures on every continent have a similar myth of a flood from which only a few survived to restart civilization? It's only in the past half century that proposals based in scientific fact have been proposed to solve these conundrums. It now appears that these two problems may actually be totally unrelated altho both have a spectacular origin related to catastrophes of geological scale.Publisher's Preface1 The History Of AtlantisThe Purpose Of The BookPlato's History Of AtlantisThe Probabilities Of Plato's StoryWas Such A Catastrophe Possible?The Testimony Of The SeaThe Testimony Of The Flora & Fauna2 The DelugeThe Destruction Of Atlantis Described In The Deluge LegendsThe Deluge Of The BibleThe Deluge Of The ChaldeansThe Deluge Legends Of Other NationsThe Deluge Legends Of AmericaSome Consideration Of The Deluge Legends3 The Civilization Of The Old World & New ComparedCivilization An InheritanceThe Identity Of The Civilizations Of The Old World & The NewAmerican Evidences Of Intercourse With Europe Or AtlantisCorroborating CircumstancesThe Question Of ComplexionGenesis Contains A History Of AtlantisThe Origin Of Our AlphabetThe Bronze Age In EuropeArtificial Deformation Of The Skull4 Mythologies Of The Old World A Recollection Of AtlantisTraditions Of AtlantisThe Kings Of Atlantis Become The Gods Of The GreeksThe Gods Of The Phoenicians Also Kings Of AtlantisThe God Odin, Woden or WotanThe Pyramid, The Cross & The Garden Of EdenGold & Silver The Sacred Metals Of Atlantis5 The Colonies Of AtlantisThe Central American & Mexican ColoniesThe Egyptian ColonyThe Colonies Of The Mississippi ValleyThe Iberian Colonies Of AtlantisThe Peruvian ColonyThe African ColoniesThe Irish Colonies From AtlantisThe Oldest Son Of NoahThe Antiquity of Some of Our Great InventionsThe Aryan Colonies From AtlantisAtlantis Reconstructed",
  "genres": [
    "History",
    "Nonfiction",
    "Mythology",
    "Classics",
    "Occult",
    "Ancient History",
    "Audiobook"
  ],
  "author": "Ignatius L. Donnelly",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/10252765-atlantis-the-antedeluvian-world"
}