{
  "title": "Their Bounty",
  "description": "--- Taken. Prized. Possessed. Loved. ---Clover is an orphan and has led a tough and chaotic life. No stability. No money. No friends. He trusts no one. His already miserable life takes a nosedive when he ends up in the hands of a human trafficking gang. Someone has placed a request for a young albino man, and Clover is to become the property of a mysterious buyer who will stop at nothing to satisfy their depraved desire. Clover’s fate seems sealed until four bounty hunters appear to take out his captors and accidentally save him. The four mercenaries want to move on, but when Clover pleads for protection, they offer it to him at a price. In the beginning, the arrangement is all kinds of shady, but as he gets to know the four men who’ve taken him on a wild ride, his developing feelings might become as dangerous as the elusive buyer.  But can a relationship with four such different men even work? Men who kill for a living? Men so full of contradictions? Tank. The massive ex-soldier eager to be Clover’s Daddy.Pyro. Wild, tattooed, with a filthy mouth and an itch for violence.Boar. Ginger, bearded, a big teddy bear who can turn into a grizzly.Drake. Dark and dangerous, with a tongue as sharp as his knives. Can these men provide him with the love and security he craves? Or has Clover made the worst mistake of his life?*THEIR BOUNTY is a dark gay harem contemporary romance, book 1 in the “Four Mercenaries” trilogy. The story contains scenes of explicit violence, offensive language, morally ambiguous characters and lots of scorching hot, emotional, explicit scenes.POSSIBLE SPOILERS:Themes: abduction, polyamory, mercenaries, bounty hunters, albinism, commitment issues, indecent proposal, dark past, male bonding, human trafficking, size difference, enemies to lovers, danger, alpha male, found family, size difference, distrust, shared, victim and protectorLength: ~92,000 words",
  "genres": [
    "M M Romance",
    "BDSM",
    "Dark",
    "Romance",
    "M M M",
    "Menage",
    "Erotica"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/44600123-their-bounty"
}