{
  "title": "Touched",
  "description": "\"A fantastic new vampire series!\"--Morgan Rice, #1 Bestselling author of THE VAMPIRE JOURNALSIn TOUCHED (BOOK #2 OF THE SHADOW VAMPIRES), Keira Blaine is on the run with her new love, Cooper. Having just finished vanquishing the first wave of Shadow Vampires, the small town of Everstock is no longer a safe place for them. They have to flee, and search for a safe haven together. Keira can’t return home anyway, especially after running away from her parents to be with Cooper.As they embark on their journey together, Cooper tells Keira about his long-lost mother and her tribe, The Torches, a race of positive vampires, rival enemies to the Shadow Vampires. Separated from her at birth, Cooper is determined to find his mother, and to follow the clues—and his magical ring—that will lead him to her.Keira is determined to find out more about who she is becoming, too, and where her new powers are coming from—mysterious powers that are growing by the day. Is she a vampire, too? Where is her strength coming from? What is her destiny?Keira and Cooper continue on their fantastical journey to mysterious islands in Lake Michigan. They manage to find Cooper’s mother and her tribe—but once there, Keira has to confront a beautiful young Torch woman, Tua, who falls in love with Cooper and is determined to make him her own. Keira is forced to face danger alone at a club in Chicago, and to go back home and face her family and her old high school—where she realizes that she is no longer welcome. Worse, the Shadow Vampires won’t let them rest. They hunt them down, and enlist their most gorgeous soldier—the teenage Percy—to seduce Keira’s sister, Amanda, and have her lead them to her. Amanda, despite herself, falls deeply in love, and Percy finds himself feeling unexpected feelings of his own. Will he have to betray his tribe?Keira and Cooper, too, are falling more deeply in love with each other—but life circumstances seem determined to pry them apart. Will their love withstand the test? Will Keira find out who she really is? And will the Shadows hunt them down before they can each fulfill their mission?TOUCHED is Book #2 of the Shadow Vampires (following SAVED), and yet it also stands alone as a self-contained novel. Book #3 will be published soon!The first book in Allegra's new fantasy series, CHARLOTTE TWEED AND THE SCHOOL FOR ORPHANED DRAGONS, is now also available!",
  "genres": [
    "Romance",
    "Paranormal",
    "Vampires",
    "Young Adult",
    "Fantasy",
    "Teen",
    "Fiction"
  ],
  "author": "Allegra Skye",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/12411689-touched"
}