{
  "title": "Race for Profit: How Banks and the Real Estate Industry Undermined Black Homeownership",
  "description": "By the late 1960s and early 1970s, reeling from a wave of urban uprisings, politicians finally worked to end the practice of redlining. Reasoning that the turbulence could be calmed by turning Black city-dwellers into homeowners, they passed the Housing and Urban Development Act of 1968, and set about establishing policies to induce mortgage lenders and the real estate industry to treat Black homebuyers equally. The disaster that ensued revealed that racist exclusion had not been eradicated, but rather transmuted into a new phenomenon of predatory inclusion. Race for Profit uncovers how exploitative real estate practices continued well after housing discrimination was banned. The same racist structures and individuals remained intact after redlining's end, and close relationships between regulators and the industry created incentives to ignore improprieties. Meanwhile, new policies meant to encourage low-income homeownership created new methods to exploit Black homeowners. The federal government guaranteed urban mortgages in an attempt to overcome resistance to lending to Black buyers - as if unprofitability, rather than racism, was the cause of housing segregation. Bankers, investors, and real estate agents took advantage of the perverse incentives, targeting the Black women most likely to fail to keep up their home payments and slip into foreclosure, multiplying their profits. As a result, by the end of the 1970s, the nation's first programs to encourage Black homeownership ended with tens of thousands of foreclosures in Black communities across the country. The push to uplift Black homeownership had descended into a goldmine for realtors and mortgage lenders, and a ready-made cudgel for the champions of deregulation to wield against government intervention of any kind. Narrating the story of a sea-change in housing policy and its dire impact on African Americans, Race for Profit reveals how the urban core was transformed into a new frontier of cynical extraction.",
  "genres": [
    "Nonfiction",
    "History",
    "Race",
    "Politics",
    "Economics",
    "Social Justice",
    "Anti Racist"
  ],
  "author": "Keeanga-Yamahtta Taylor",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/44601366-race-for-profit"
}