{
  "title": "Testament of Flamel: and Other Works Being a Collection on the Sacred Art and Science of Alchemy",
  "description": "Thank you for checking out this book by Theophania Publishing. We appreciate your business and look forward to serving you soon. We have thousands of titles available, and we invite you to search for us by name, contact us via our website, or download our most recent catalogues. I, Nicholas Flamel, a scrivener of Paris, in the year 1414, in the reign of our gracious Prince Charles the VIth, whom God preserve; and after the death of my faithful partner Perenelle, am seized with a desire and a delight, in remembrance of her, and in your behalf, dear nephew, to write out the whole magistery of the secret of the Powder of Projection, or the Philosophical Tincture, which God hath willed to impart to his very insignificant servant, and which I have found out, as thou also wilt find out in working as I shall declare unto you. And for this cause do not forget to pray to God to bestow on thee the understanding of the reason of the truth of nature, which thou wilt see in this book, wherein I have written the secrets word for word, sheet by sheet, and also as I have done and wrought with thy dear aunt Perenelle, whom I very much regret. Take heed before thou workest, to seek the right way as a man of understanding. The reason of nature is Mercury, Sun and Moon, as I have said in my book, in which are those figures which thou seest under the arches of the Innocents at Paris. But I erred greatly upwards of 23 years and a half, in labouring without being able to marry the Moon, that is quicksilver, to the Sun, and to extract from them the seminal dung, which is a deadly poison; for I was then ignorant of the agent or medium, in order to fortify the for without this agent, Mercury is as common water.",
  "genres": [
    "Alchemy"
  ],
  "author": "Nicholas Flamel",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/12411865-testament-of-flamel"
}