{
  "title": "Beyond the Four Kingdoms Box Set One",
  "description": "The first three interconnected stand-alone fairy tale retellings from the Beyond the Four Kingdoms series Book 1 - A Dance of Silver and A Retelling of The Twelve Dancing Princesses When Princess Liliana and her twin sister set sail for new lands, she hopes to find adventure and romance. But the people of Marin live under the shadow of a curse—one powerful enough to destroy entire kingdoms. To protect them all, Lily and eleven other princesses are forced to participate in a mysterious and secret tournament. Lily spends her nights competing in a magical underground realm and her days unraveling the dangers of this new court. Although she needs the help of the Marinese prince, Lily knows she can't let herself grow too close to him. There's no time for romance when the duchy is about to fall to the encroaching darkness and the winner of the tournament faces a terrible fate. But Lily and her twin have a secret advantage. And Lily grows increasingly determined to use their magical bond to defeat the tournament, save the princesses, and free Marin. Except she might have to sacrifice true love to do it. In this reimagining of the classic fairy tale, The Twelve Dancing Princesses, there's a lot more at stake than worn out dancing slippers. Book 2 - A Tale of Beauty and A Retelling of Beauty and the Beast Princess Sophia has helped Lily save the duchy of Marin. But now Sophie faces an even greater threat when she sets out to free the cursed kingdom of Palinar from its beastly prince. Alone, and with danger on every side, Sophie must navigate a magical castle and its even more mysterious master to discover the secret to breaking the curse. Except the more time she spends with Prince Dominic, the more she starts to question who exactly she's supposed to be saving. With time running out for the trapped inhabitants, and the reappearance of an old enemy, Sophie may have to choose between saving the kingdom and following her heart. In this reimagining of the classic fairy tale, Beauty and the Beast, Beauty will have to use all of her strength and intelligence if she is to outwit her enemies, break a curse and find true love. Book 3 - A Crown of Snow and A Retelling of The Snow Queen An unexpected gift from her godmother will give Celine enough fire to take on an entire kingdom of snow and ice. But first she needs to melt one frozen prince. Rumors have long swirled about the strange kingdom of Eldon. The only thing more frozen than its mountains are the inhabitants themselves. But Princess Celine has never backed away from a challenge, so she eagerly accepts an invitation to visit. Yet the situation in Eldon is even worse than Celine feared. And if the kingdom is to have any hope of freedom or a future, she's going to have to call on new skills and new allies—including the crown prince, Oliver. But against an enemy stronger and colder than ice, all her fire may not be enough. In this reimagining of the classic fairy tale, The Snow Queen, one princess is ready to burn down everything in her path to save those she loves and their kingdom with them. If you enjoy clean romance, adventure, and intrigue, then try the books in the Beyond the Four Kingdoms series now! These interconnected fairy tale retellings each feature a different princess who has to fight for her happily ever after. Beyond the Four Kingdoms reading A Dance of Silver and A Retelling of The Twelve Dancing Princesses A Tale of",
  "genres": [
    "Fantasy",
    "Romance",
    "Audiobook",
    "Fairy Tales",
    "Fairy Tale Retellings",
    "Fiction",
    "Clean Romance"
  ],
  "author": "Melanie Cellier",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/44643598-beyond-the-four-kingdoms-box-set-one"
}