{
  "title": "Heavy Metal Thunder",
  "description": "“The Invader has taken everything from us… except our free will.”- Admiral Franks, “Transmissions from Black Heaven”Remember the Choose Your Own Adventure books? Remember playing the lead role, making choices and influencing the story, and either surviving or dying based on your choices? Solo-gaming books used to be everywhere – and then they disappeared for no good reason.Now, they’re back.In Heavy Metal Thunder, our solar system has been overrun by extraterrestrial invaders. You play as a soldier in the human resistance. While cut off from your unit, you find out that your allies in the resistance are being tracked down by the alien invaders and will be ruthlessly crushed… unless you can find them and warn them before it’s too late.On your journey you’ll meet the wild dregs of the solar system, and it will be up to you to choose how to deal with them. Do you help out those who have given up the fight against the invaders, or do you take shortcuts and gun down anyone in your way? As you learn how to fight the invaders you’ll gain levels and new skills, but limited resources will make it impossible to save everyone.Heavy Metal Thunder is the first book in an epic series that chronicles your role in humanity’s war against the mysterious and overpowering invaders. In later installments you can lead other soldiers, join an elite special forces unit, and even command your own battleship. All sections are hyperlinked, so you won’t have to worry about flipping through dozens of sections after making a choice. No dice are required, but you can keep track of your stats and equipment if you’re down with RPGs and nerd culture.For more info on Heavy Metal Thunder, check out Heavy Metal Thunder series.",
  "genres": [
    "Science Fiction",
    "Gamebooks",
    "Choose Your Own Adventure",
    "Games",
    "Fiction"
  ],
  "author": "Kyle B. Stiff",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/12411815-heavy-metal-thunder"
}