{
  "title": "Principle-Centered Leadership",
  "description": "Según el propio autor de este libro, el aclamado Stephen R. Covey, la gente ineficaz trata de administrar su tiempo basándose en prioridades, mientras que la gente eficaz organiza su vida y sus relaciones basándose en principios, es decir, en leyes naturales y normas que tienen validez universal. El liderazgo es la habilidad de aplicar estos principios a los problemas, lo que se traduce en calidad, productividad y relaciones fructíferas para todos. Así, en esta obra -que promete guiarnos hacia la realización personal y el éxito profesional a través del \"liderazgo centrado en principios\"-, el autor del best-seller Los siete habitos de la gente altamente efectiva (publicado también por Paidós) invita a los lectores a centrar su vida y su liderazgo en principios intemporales. Y para ello, demuestra que ninguna persona u organización puede sentirse satisfecha sólo con mantenerse en el punto al que ha llegado, es decir que las metas de excelencia y calidad total expresan una necesidad innata del ser humano de progresar en el terreno personal, interpersonal y laboral. Basándose en sus veinticinco años de experiencia como docente y asesor, Covey explica cuáles son las seis condiciones de la eficacia y los métodos para lograr la excelencia en una organización. En este sentido, afirma por ejemplo que no hay nada que tienda tanto al fracaso como el propio éxito, y que es necesario comprender las posibilidades de la gente y no únicamente su conducta. Con la integridad, sensibilidad e intuiciones que hicieron de Los siete habitos de la gente altamente efectiva un extraordinario éxito de ventas, El liderazgo centrado en principios demuestra que el aprendizaje permanente es lo único capaz de fortalecer las relaciones humanas tanto en el trabajo como en el hogar.",
  "genres": [
    "Leadership",
    "Business",
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Management",
    "Psychology"
  ],
  "author": "Stephen R. Covey",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/44644.Principle_Centered_Leadership"
}