{
  "title": "Forbidden Baby Daddy",
  "description": "A Secret Baby RomanceHe took my breath, took my innocence and left me carrying his baby - longing for more. There are so many reasons to stay away from Ash Thorne…and I’m about to ignore every one.  I’m the bad boy from the wrong part of town. Dangerous. Disreputable. Devilish. I live my life hard, fast and rough - and that’s exactly how I like it. Until she walks into it, like a breath of fresh air I didn’t know I needed. Adorable, sweet and oh-so-innocent. With an enthusiasm for life I hadn't realized I’d lost. Gorgeous curves, the cutest spattering of freckles and that sparkle in her eyes... She’s never even felt a man’s touch. She doesn’t belong here - but how can I resist? I take her home and show her everything she’s been missing out on…the kind of night she’ll never forget.  I don’t expect to see her again. She knows better than to get involved with a guy like me. But then she surprises me in more ways than one. When she does come back around? She’s carrying my baby. I’m going to be a f*cking Daddy!  She’s terrified, of course. Her parents are ultra-conservative and she doesn’t have a plan. I don’t give a f*ck about any of that - her assh*le father doesn’t intimidate me. But I have a past she knows nothing about - and the people coming after me? They’re something else entirely. There’s a reason pure, sweet Chloe should never have gotten involved with me. This baby is a complication neither of us can afford…but the moment she tells me, none of that matters. For the first time, I find myself wanting something else. Another life. A family. With her.  And when my past comes back to haunt me? I’ll fight for it with everything I have.  Forbidden Baby Daddy is a full, standalone romance with a roguish bad boy hero and a fiery heroine who's determined to start living a little. No cheating or cliffhangers, and a Happily Ever After guaranteed.",
  "genres": [
    "Contemporary",
    "Romance"
  ],
  "author": "Lara Swann",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/44600140-forbidden-baby-daddy"
}