{
  "title": "Down River",
  "description": "Everything that shaped him happened near that river...Now its banks are filled with lies and greed, shame, and murder... John Hart's debut,  The King of Lies, was compelling and lyrical, with Janet Maslin of The New York Times declaring, \"There hasn't been a thriller as showily literate since  Scott Turow came along.\" Now, in Down River, Hart makes a scorching return to Rowan County, where he drives his characters to the edge, explores the dark side of human nature, and questions the fundamental power of forgiveness.Adam Chase has a violent streak, and not without reason. As a boy, he saw things that no child should see, suffered wounds that cut to the core and scarred thin. The trauma left him passionate and misunderstood---a fighter. After being narrowly acquitted of a murder charge, Adam is hounded out of the only home he's ever known, exiled for a sin he did not commit. For five long years he disappears, fades into the faceless gray of New York City. Now he's back and nobody knows why, not his family or the cops, not the enemies he left behind.But Adam has his reasons.Within hours of his return, he is beaten and accosted, confronted by his family and the women he still holds dear. No one knows what to make of Adam's return, but when bodies start turning up, the small town rises against him and Adam again finds himself embroiled in the fight of his life, not just to prove his own innocence, but to reclaim the only life he's ever wanted.Bestselling author  John Hart holds nothing back as he strips his characters bare. Secrets explode, emotions tear, and more than one person crosses the brink into deadly behavior as he examines the lengths to which people will go for money, family, and revenge.A powerful, heart-pounding thriller, Down River will haunt your thoughts long after the last page is turned.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Crime",
    "Book Club"
  ],
  "author": "John Hart",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/446038.Down_River"
}