{
  "title": "Dear Girls: Intimate Tales, Untold Secrets, and Advice for Living Your Best Life",
  "description": "NEW YORK TIMES BESTSELLER • Heartfelt and hilarious essays from the Emmy and Golden Globe Award–winning actress, star of the Netflix original series Beef, and two-time member of Time’s 100 Most Influential People of the Year list “A collection of letters to her baby girls that are barn-burning reflections on being a working mom, marriage, sex, and more. If you’ve ever wanted to have Ali Wong’s signature voice in your head for 200-plus pages, now’s your chance.”—GlamourONE OF THE BEST BOOKS OF THE Time, Variety, Chicago Tribune, Glamour, New York In her hit Netflix comedy special Baby Cobra, an eight-month pregnant Ali Wong resonated so strongly that she even became a popular Halloween costume. Wong told the world her remarkably unfiltered thoughts on marriage, sex, Asian culture, working women, and why you never see new mom comics on stage but you sure see plenty of new dads. The sharp insights and humor are even more personal in this completely original collection. She shares the wisdom she’s learned from a life in comedy and reveals stories from her life off stage, including the brutal single life in New York (i.e. the inevitable confrontation with erectile dysfunction), reconnecting with her roots (and drinking snake blood) in Vietnam, tales of being a wild child growing up in San Francisco, and parenting war stories. Though addressed to her daughters, Ali Wong’s letters are absurdly funny, surprisingly moving, and enlightening (and gross) for all.Praise for Dear Girls“Fierce, feminist, and packed with funny anecdotes.”—Entertainment Weekly “[Wong] spins a volume whose pages simultaneously shock and satisfy. . . . Dear Girls is not so much a real-talk handbook as it is a myth-puncturing manifesto.”—Vogue",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Humor",
    "Biography",
    "Comedy",
    "Autobiography"
  ],
  "author": "Ali Wong",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/44641310-dear-girls"
}