{
  "title": "Offbeat Crimes Box Set: Part One",
  "description": "Lime Gelatin and Other Monsters Kyle Monroe, his irritating new partner and their fellow freaks at the 77th Precinct must learn to work together to stop a vicious murderer that might not even be human. Kyle Monroe’s encounter with a strange, gelatinous creature in an alley leaves him scarred and forever changed, revealing odd abilities he wishes he didn’t have and earning him reassignment to a precinct where all the cops have defective paranormal abilities. Just as he’s starting to adjust to his fellow misfit squad mates, Kyle’s new partner arrives. Tall, physically perfect, reserved and claiming he has no broken psychic talents, Vikash Soren irritates Kyle in every way. But as much as he’d like to hate Vikash, Kyle finds himself oddly drawn to him, their non-abilities meshing in unexpected ways. If they can learn to work together, they might be able to stop the mysterious killer who has been leaving mutilated bodies along the banks of the Schuylkill. The Pill Bugs of Time Relationship and communication issues plague Officer Vikash Soren, but those are nothing compared to facing stick-throwing tumbleweeds, pill bugs and…time travel? Vikash Soren, the perfect police officer except for his odd paranormal ability, never seems to lose his temper. Always serene and competent, he’s taken on the role of mediator in a squad room full of misfits. But on the inside, he’s a mess. Unable to tell his police partner that he loves him, Vikash struggles silently, terrified of losing Kyle as a lover, partner and friend. But life in the 77th Precinct doesn’t leave much room for internal reflection. A confrontation with a stick-throwing tumbleweed in Fairmount Park leads to bizarre consequences involving pill bugs, statues and…time travel? If Vikash manages to survive the week and stay in one point in time, he might be able to address normal things like relationship problems. He just needs Kyle to have a little more patience. Maybe a few centuries’ worth.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance"
  ],
  "author": "Angel  Martinez",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/44675130-offbeat-crimes-box-set"
}