{
  "title": "Halcyon - The Complete Steampunk Fantasy Trilogy",
  "description": "All three novels in the Halcyon trilogy of steampunk thrillers:Book 1: The Burning SkyWhen a mysterious explosion destroys an airship, four strangers come together to uncover a vast conspiracy to plunge the nation of Marrakesh into a devastating war. Taziri Ohana, inventor of the experimental airship Halcyon, leads the investigation across the length of the country. With the aid of a brutal detective, a holy swordsman, and an exiled princess, she discovers clandestine meetings, deadly beasts, horrific experiments, and bizarre machines that reveal a far-reaching plot against the royal family and her countrymen. Book 2: The Broken SwordMaster swordsman Lorenzo Quesada believes he can peacefully restore his country's prosperity and honor using the legendary Skyfire Stone. But Salvator Fabris, the most feared fencer and assassin in Italy, also wants this holy relic.And then famed inventor Taziri Ohana arrives on Lorenzo's doorstep with a tale of a horrible plane crash and three frightened passengers: a scholar, a politician, and a scowling Italian chemist named Dante. Unwilling to abandon strangers in need, Lorenzo takes them with him across the wintry wastes into the mountains, where they encounter creatures far more terrifying than mere assassins.Book 3: The Bound SoulIn her darkest hour, exiled princess Qhora Yupanqui allies herself with both strangers and enemies to find her husband's killer and free his immortal soul from eternal bondage.From the soaring skies of Marrakesh to the perilous streets of Alexandria, Qhora tracks the murderer to a strange temple where men forge mystical swords and where immortal youths called Anubis and Bast wield god-like powers. But she also finds two new friends: a gunslinging Spartan dwarf and a vicious harpy eagle from her homeland.",
  "genres": [
    "Steampunk"
  ],
  "author": "Joseph Robert Lewis",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/12412735-halcyon---the-complete-steampunk-fantasy-trilogy"
}