{
  "title": "The Rise of Nazil",
  "description": "Before Nazil’s rise ...came its destruction . The liberation of a world ignited the Zon’tul demon’s hunger to consume it. The battles fought in The Rise of Nazil were the presage of an impending war. A war not for land, wealth, or power, but for the fate of the mortal world which hung tethered to a brittle filament, separating the Nether from the mortal. As the gods continued to weaken, the demons began their rise. What began with Mah’saahc’s awakening in Seed of Scorn , crept across Faélondul, devouring and possessing the souls of men, seeking the Blood of Oisin needed to breach the threshold between realms.The sacrifices and bonds that once held the Benoists’ together could be the catalyst which tears them apart. The darkness is coming, and once the sides are chosen, neither can win...without dying. If you love the intrigue and treachery of George R.R. Martin, the epic battles and characterization of R.A. Salvatore, and the exceptional world-building, politics, and magical systems of Robert Jordan and Brandon Sanderson, The Rise of Nazil trilogy will captivate you from start to finish. Step away from the ordinary and immerse yourself in a unique and enthralling diverse epic fantasy. “The Rise of Nazil is an epic fantasy that should be shelved next to the works of R.A. Salvatore and J. R. R. Tolkien . This book was the best read of 2015.” -Mudville Dames “The Rise of Nazil is a complex work, with the violence, intricate treacheries, and modern sensibilities of The Game of Thrones .” -Amazon “This is the best epic fantasy trilogy I’ve read in over a decade . The plot twists, deep characters, amazing prose, superb dialogue, and worldbuilding are mere elements in the vast tapestry Hall creates. This trilogy defies categorization.” -Amazon “This is a complex plot at its best . The character development is perfect .” -Readers’ FavoriteBooks by Aaron-Michael Hall Gritty Epic “Desire, ambition, greed, each masterfully manifested in a host of vividly rendered characters that make for a riveting read whilst neatly sidestepping the pitfalls of predictability . \" Crafted like a mound of gems picked from the best in genre , The Rise of Nazil makes for a scintillating read.” -BookViral “The intricacy of the plot and the superb imaginative musing of its author. He has created fabulous fantasy worlds and a complex geo political structure which breathes a refreshing breath of authenticity into a genre which too often than not has become trite and predictable.” -Goodreads aaronmichaelhall.com*Some graphic scenes. Intended for mature readers.*",
  "genres": [
    "Fantasy",
    "Fiction",
    "Book Club",
    "Contemporary"
  ],
  "author": "Aaron-Michael Hall",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/44679025-the-rise-of-nazil"
}