{
  "title": "The Crayons' Christmas",
  "description": "A brand-new Crayons book from the #1 \n\nNew York Times\n\n best-selling duo Drew Daywalt and Oliver Jeffers, just in time for the holidays. This special book has letters, games, ornaments, a poster, and even a pop-up Christmas tree! \n'Tis the season for all of us to write our holiday wishlists. But everyone--even the crayons--know the best presents are the ones that you give. In this unique book, readers get to see how Duncan, the crayons, and their families celebrate the holidays. With real, folded letters from the Crayons that you can pull from their envelopes and read, games, punch-out ornaments, a poster, and a pop-up tree, this book is the perfect gift for fans of The Day the Crayons Quit and The Day the Crayons Came Home.Praise for \nThe Day the Crayons Came Home \nWinner of the Goodreads Choice Award for Best Picture Book of 2015!A Wall Street Journal Best Book of 2015!One of Parents Magazine's Ten Best Children's Books of 2015!A Publishers Weekly Best Book of the Year! \"Funnier than the creators' original blockbuster.\"--Parents Magazine\"Mr. Daywalt's text blends with Mr. Jeffers's illustrations to make a picture book that will have children clamoring for more crayon adventures.\"--The Wall Street Journal \"Continues its predecessor's pleasing, goofy conceit...Once again, both Daywalt's text and Jeffers' illustrations are endearing.\"--New York Times Book Review\"By telling stories from the points of view of crayons, giving voices to the small and ignored, Daywalt and Jeffers have created two books that offer plenty of charm and fun, but also make children feel deeply understood.\"--The Boston Globe* \"A masterwork of humor and design . . . Sure to be as popular as The Day the Crayons Quit.\"--Booklist, starred review * \"A brilliant, colorful tale that begs to be read aloud and a must-have for all collections.\"--School Library Journal, starred review * \"Once again, Daywalt and Jeffers create rich emotional lives and personalities for their colorful cast, and it's hard to imagine a reader who won't be delighted.\"--Publishers Weekly, starred review\"Not only stands on its own merit, but may be even more colorful than the original.\"--Huffington Post\"Drew Daywalt and Oliver Jeffers once again offer perceptive and frequently hilarious insights...The Day the Crayons Came Home will have readers of all ages chuckling--and will inspire kids' empathy and imagination in equal measure.\"--BookPage Praise for \nThe Day the Crayons Quit\nThe #1 New York Times bestselling phenomenon--over two years on the bestseller list!Winner of the E.B. White Read-Aloud AwardAmazon's 2013 Best Picture Book of the YearA Barnes & Noble Best Book of 2013Goodreads' 2013 Best Picture Book of the Year * \"Hilarious . . . Move over, Click, Clack, Moo; we've got a new contender for the most successful picture-book strike.\" -BCCB, starred review \"Jeffers . . . elevates crayon drawing to remarkable heights.\" -Booklist\"Fresh and funny.\" -The Wall Street Journal\"This book will have children asking to have it read again and again.\" -Library Media Connection* \"This colorful title should make for an uproarious storytime.\" -School Library Journal, starred review * \"These memorable personalities will leave readers glancing apprehensively at their own crayon boxes.\" -Publishers Weekly, starred review \"Utterly original.\" -San Francisco Chronicle",
  "genres": [
    "Picture Books",
    "Christmas",
    "Childrens",
    "Holiday",
    "Fiction",
    "Art",
    "Humor"
  ],
  "author": "Drew Daywalt",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/44672346-the-crayons-christmas"
}