{
  "title": "Wildfire",
  "description": "Into the Wild meets The Serpent King in this story about Annie and Pete, two best friends on a dangerous and emotional trek through the woods.Annie and Pete have been best friends since they were little. They know each other better than anyone, and they've been on more adventures than they can count--they even have a notebook filled with all the times they've almost died. But they always survive, because together, they're invincible.And they've always been just friends. But lately, Annie has been thinking that maybe friendship is just the beginning, and she's been mentally replaying all the times they were almost something more.Now they're heading out on their next great a ten-day backpacking trip through the mountains of Washington State, ending at Fire Camp, where they'll learn to fight the area's growing wildfire problem. The woods spark with the promise of adventure, but a freak climbing accident interrupts their progress, and as the wildfires close in and smoke envelops them, Annie and Pete wander farther from the trail. Carrie Mac's gripping story of the power of unrequited love and the danger of the elements is harrowing, beautiful, and unforgettable.A Globe and Mail Best Book of the Year\"Mac is as comfortable writing about the wilderness as she is exploring the internal world of a teenage girl, and the combination of the two is enthralling and devastating.\"-- Quill and Quire , Starred review\"At turns heartbreaking, joyful, and frightening. An affecting combination of wilderness adventure and poignant teen angst.\"-- Kirkus\"For a novel so introspective, the pace is remarkably quick...Recommend to fans of John Green, Adam Silvera, or Sarah Dessen. Advise readers to have tissues on hand for this riveting tale of friendship, grief, and survival.\"-- SLJ",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Fiction",
    "Young Adult Contemporary",
    "Adventure",
    "Nature"
  ],
  "author": "Carrie Mac",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/44679404-wildfire"
}