{
  "title": "Imagining Argentina",
  "description": "“Remarkable . . . deeply  inventive . . . Thorton has imagined Argentina truly; his  inspired fable troubles and feeds our own intriguing imagining.”— Los Angeles TimesImagining Argentina is set in the dark days of the late 1970's, when thousands of Argentineans disappeared without a trace into the general's prison cells and torture chambers. When Carlos Ruweda's wife is suddenly taken from him, he discovers a magical In waking dreams, he had clear visions of the fates of “the disappeared.” But he cannot “imagine” what has happened to his own wife. Driven to near madness, his mind cannot be taken imagination, stories, and the mystical secrets of the human spirit.Praise for Imagining Argentina“A harrowing, brilliant  novel.” — The New Yorker“A  powerful new novel . . . Thorton seems to have wedded  his study of such writers as Borges and Marquez with thy his own instinctive gift for metaphor, and  in doing so, created his own brand of magical realism”— The New York Times“ Imagining Argentina  is a slim volume filled with beautiful writing. It is an exciting adventure story. It is a haunting love story. And it is a story for all  time.” — Detroit Free Press“The writing is crystalline, the  metaphors compelling . . . Its central theme is universal.” — The Philadelphia Inquirer“In a time when much North American fiction is contained by crabbed realism, Thorton takes for his material one of the bleaker recent instances of human cruelty, sees in it the enduring nobility of the human spirit and imagines a book that celebrates that spirit.” — The Washington Post Book World “A powerful first  novel and a manifesto for the memorializing power of literature.” — The New York Times Book Review“A  profoundly hopeful book.” — The Cleveland Plain Dealer",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Magical Realism",
    "Novels",
    "School",
    "Literary Fiction",
    "Literature"
  ],
  "author": "Lawrence Thornton",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/44762.Imagining_Argentina"
}