{
  "title": "That Familiar Touch",
  "description": "The beloved Matrix of Destiny series continues with the exciting tale of the beautiful feline shapeshifter Soosha. The Familiar woman yearns for exotic adventure, and must defy her king's orders to stay planetside. She sets off on a secret escapade to discover new worlds. Soon, her journey leads her to a mysterious land -- and a very compelling stranger named Daxan. Soosha tried to catch her breath as she looked up into the face of her decisive captor. She confronted masculine features of perfect angles and hardened edges. Golden, serious eyes framed by thick, ebony lashes. And firm lips tilted by sensual secrets that begged to be bitten into release. Soosha's own lips parted in breathless response. The man's hair fell far below his shoulders; the strands were twisted from scalp to ends into long, handsome locks that were woven-bound throughout with black leather laces. Beaded coils hung at the ends. His hair color matched his eyes; yet, its true tone was difficult to tell in the weave of his hair. She suspected the strong sun of lightening some of the strands; for the golden color shaded from dark to light.He was magnificient.And since she came from a race that produced males of staggering beauty that was saying much.His golden eyes -- quite breathtaking, really, though they were both the same color -- sharpened into hard slivers of disapproval.Soosha rather liked that. To a cat such as she, such a stern expression could only be an invitation to come and play.Before the night is through, their passionate encounter will make Daxan beg for more of THAT FAMILIAR TOUCH. . .But his uncontrollable desire for the Familiar girl will shortly be put to the test when the fearsome Charl warrior known as Traed, along with her enraged, snarling brother show up on his doorstep to hunt Soosha down and bring her home.",
  "genres": [
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Fantasy Romance",
    "Science Fiction",
    "Science Fiction Romance"
  ],
  "author": "Dara Joy",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/447032.That_Familiar_Touch"
}