{
  "title": "Idols of Perversity: Fantasies of Feminine Evil in Fin-de-Siècle Culture",
  "description": "At the turn of the century, an unprecedented attack on women erupted in virtually every aspect of culture: literary, artistic, scientific, and philosophic. Throughout Europe and America, artists and intellectuals banded together to portray women as static and unindividuated beings who functioned solely in a sexual and reproductive capacity, thus formulating many of the anti-feminine platitudes that today still constrain women's potential. Bram Dijkstra's Idols of Perversity explores the nature and development of turn-of-the-century misogyny in the works of hundreds of writers, artists, and scientists, including Zola, Strindberg, Wedekind, Henry James, Rossetti, Renoir, Moreau, Klimt, Darwin, and Spencer. Dijkstra demonstrates that the most prejudicial aspects of Evolutionary Theory helped to justify this wave of anti-feminine sentiment. The theory claimed that the female of the species could not participate in the great evolutionary process that would guide the intellectual male to his ultimate, predestined role as a disembodied spiritual essence. Darwinists argued that women hindered this process by their willingness to lure men back to a sham paradise of erotic materialism. To protect the male's continued evolution, artists and intellectuals produced a flood of pseudo-scientific tracts, novels, and paintings which warned the world's males of the evils lying beneath the surface elegance of woman's tempting skin. Reproducing hundreds of pictures from the period and including in-depth discussions of such key works as Dracula and Venus in Furs, this fascinating book not only exposes the crucial links between misogyny then and now, but also connects it to the racism and anti-semitism that led to catastrophic genocidal delusions in the first half of the twentieth century. Crossing the conventional boundaries of art history, sociology, the history of scientific theory, and literary analysis, Dijkstra unveils a startling view of a grim and largely one-sided war on women still being fought today.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "Feminism",
    "Art History",
    "Gender",
    "Sociology"
  ],
  "author": "Bram Dijkstra",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/447578.Idols_of_Perversity"
}