{
  "title": "The Lost Girl of Neverland",
  "description": "Peter Pan is an arrogant little wanker\n\nSorry, not sorry, you’d say it too if you’d ever been to Neverland. I know the big story is that Wendy Darling is the first girl to end up on Neverland because girls are too smart to fall out of their prams. I’m living proof that’s a lie. Wendy was just the first time Peter actually asked permission before he took a girl to Neverland to be his mother. I guess he learned his lesson from me. He kidnapped me from my bed while I was sleeping and just expected me to be his mother. I’d rather be a Lost Boy than his mother. Peter eventually gave up on me. He lost a mother and two Lost Boys that day that left with me.I’ve been living away from Peter Pan. Me and my Lost Boys are now the Wildlings. We even have a fairy with us named Coale, who is a blacksmith fairy, but prefers making explosives. Coale and Blaize get along marvelously as Blaize loves to play with fire.But we’ve committed the one crime on Neverland Peter won’t forgive. An instant death sentence for anyone on Neverland no matter how close to Peter you are. We already have one strike against us leaving him. We’ve now committed the ultimate Neverland sin. We woke up one morning and we’ve all grown up.There is a legend on Neverland, someone Peter hates. Someone no one knows where to find. Someone everyone on Neverland only knows as the hook nosed hag. If she’s an old woman on Neverland, then she either predates Peter or she survived his culling. We have to stay out of Peter’s way and find this mysterious hag. We find some old villains who end up not being villains. Captain Hook is not dead and may have information on the hag.\n\nWe only have three days before Peter’s Spring Cleaning is over and he returns Wendy’s descendant back home. After that, he will be on the hunt for our blood. We don’t even know if the hag survived Peter’s culling. If not, everyone who has grown up on Neverland has died by Peter’s blade.",
  "genres": [
    "Reverse Harem",
    "Retellings",
    "Paranormal",
    "M M Romance",
    "Paranormal Romance",
    "Fairy Tale Retellings",
    "Adult"
  ],
  "author": "J.B. Trepagnier",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/44706196-the-lost-girl-of-neverland"
}