{
  "title": "Days of the Dead",
  "description": "The New York Times hails Barbara Hambly’s novels featuring Benjamin January as “masterly,” “ravishing,” and “haunting.” The Chicago Tribune crowns them “dazzling…January is a wonderfully rich and complex character.” Now the bestselling author returns with a story that leads January from the dangerously sensual milieu of New Orleans into a world seething with superstition and dark spirits, where one man’s freedom turns on a case of murder and blood vengeance.Days of the DeadMexico City in the autumn of 1835 is a lawless place, teeming with bandits and beggars. But an urgent letter from a desperate friend draws Benjamin January and his new bride Rose from New Orleans to this newly free province. Here they pray they’ll find Hannibal Sefton alive--and not hanging from the end of a rope.Sefton stands accused of murdering the only son of prominent landowner Don Prospero de Castellon. But when Benjamin and Rose arrive at Hacienda Mictlán, they encounter a murky tangle of family relations, and more than one suspect in young Fernando’s murder.While the evidence against Hannibal is damning, Benjamin is certain that his consumptive, peace-loving fellow musician isn’t capable of murder. Their only allies are the dead boy’s half sister, who happens to be Hannibal’s latest inamorata, and the mentally unstable Castellon himself, who awaits Mexico’s holy Days of the Dead, when he believes his slain son will himself reveal the identity of his killer.The search for the truth will lead Benjamin and Rose down a path that winds from the mazes of the capital’s back streets and barrios to the legendary pyramids of Mictlán and, finally, to a place where spirits walk and the dead cry out for justice. But before they can lay to rest the ghosts of the past, Benjamin and Rose will have to stop a flesh-and-blood murderer who’s determined to escape the day of reckoning and add Benjamin and Rose to the swelling ranks of the dead.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Historical Mystery",
    "19th Century",
    "Crime"
  ],
  "author": "Barbara Hambly",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1241309.Days_of_the_Dead"
}