{
  "title": "Blowout: Corrupted Democracy, Rogue State Russia, and the Richest, Most Destructive Industry on Earth",
  "description": "In 2010, the words “earthquake swarm” entered the lexicon in Oklahoma. That same year, a trove of Michael Jackson memorabilia—including his iconic crystal-encrusted white glove—was sold at auction for over $1 million to a guy who was, officially, just the lowly forestry minister of the tiny nation of Equatorial Guinea. And in 2014, Ukrainian revolutionaries raided the palace of their ousted president and found a zoo of peacocks, gilded toilets, and a floating restaurant modeled after a Spanish galleon. Unlikely as it might seem, there is a thread connecting these events, and Rachel Maddow follows it to its crooked source: the unimaginably lucrative and equally corrupting oil and gas industry. With her trademark black humor, Maddow takes us on a switchback journey around the globe, revealing the greed and incompetence of Big Oil and Gas along the way, and drawing a surprising conclusion about why the Russian government hacked the 2016 U.S. election. She deftly shows how Russia’s rich reserves of crude have, paradoxically, stunted its growth, forcing Putin to maintain his power by spreading Russia’s rot into its rivals, its neighbors, the West’s most important alliances, and the United States. Chevron, BP, and a host of other industry players get their star turn, most notably ExxonMobil and the deceptively well-behaved Rex Tillerson. The oil and gas industry has weakened democracies in developed and developing countries, fouled oceans and rivers, and propped up authoritarian thieves and killers. But being outraged at it is, according to Maddow, “like being indignant when a lion takes down and eats a gazelle. You can’t really blame the lion. It’s in her nature.”  Blowout is a call to contain the lion: to stop subsidizing the wealthiest businesses on earth, to fight for transparency, and to check the influence of the world’s most destructive industry and its enablers. The stakes have never been higher. As Maddow writes, “Democracy either wins this one or disappears.”",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Audiobook",
    "Economics",
    "Russia",
    "Business"
  ],
  "author": "Rachel Maddow",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/44767265-blowout"
}