{
  "title": "10 Minutes 38 Seconds in this Strange World",
  "description": "SHORTLISTED FOR THE BOOKER PRIZE 2019 'Expect vibrant, vivid and eye-opening descriptions of Middle Eastern life propelled by a tender storyline, all in Shafak's haunting, beautiful and considered prose' Vanity Fair'Incredibly sensuous and poetic and evocative' Pandora Sykes, The High Low'Richly uplifting... truly beautiful writing' Nicola Sturgeon'In the first minute following her death, Tequila Leila's consciousness began to ebb, slowly and steadily, like a tide receding from the shore...'For Leila, each minute after her death recalls a sensuous memory: spiced goat stew, sacrificed by her father to celebrate the birth of a yearned-for son; bubbling vats of lemon and sugar to wax women's legs while men are at prayer; the cardamom coffee she shares with a handsome student in the brothel where she works. Each fading memory brings back the friends she made in her bittersweet life - friends who are now desperately trying to find her . . .'Simply magnificent, a truly captivating work of immense power and beauty, on the essence of life and its end' Philippe Sands\n\n'A vivid carnival of life and death, cruelty and kindness, love, politics and deep humanity. Brilliant!' Helena Kennedy'Elif Shafak brings into the written realm what so many others want to leave outside. Spend more than ten minutes and 38 seconds in this world of the estranged. Shafak makes a new home for us in words' Colum McCann \n'\nElif Shafak's extraordinary 10 Minutes, 38 Seconds in this Strange World is a work of brutal beauty and consummate tenderness' Simon Schama'A rich, sensual novel... This is a novel that gives voice to the invisible, the untouchable, the abused and the damaged, weaving their painful songs into a thing of beauty.' Financial Times\n\n\n\n'One of the best writers in the world today' Hanif Kureishi 'Haunting, moving, beautifully written - and based by an extraordinary cast of characters who capture the diversity of modern Turkey. A masterpiece' Peter Frankopan 'Extraordinary' Guardian'Life-affirming' Stylist",
  "genres": [
    "Fiction",
    "Contemporary",
    "Historical Fiction",
    "Literary Fiction",
    "Book Club",
    "Audiobook",
    "Novels"
  ],
  "author": "Elif Shafak",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/44778171-10-minutes-38-seconds-in-this-strange-world"
}