{
  "title": "Race Man: Selected Works, 1960-2015",
  "description": "Newsweek, Lit Hub, The Philadelphia Inquirer, and The Atlanta Journal Constitution pick Race Man by Julian Bond as one of their Most-Anticipated Books of 2020! \"This compilation of works by social activist and civil rights leader Julian Bond should be required reading in 2020. \" —Juliana Rose Pignataro, Newsweek \"Bond's essays, speeches and interviews were powerful weapons in his lifelong fight for civil rights.\"— The New York Times \"Justice and equality was the mission that spanned his life. Julian Bond helped change this country for the better. And what better way to be remembered than that.\" —President Barack Obama An inspiring, historic collection of writings from one of America's most important civil rights leaders. No one in the United States did more to advance the legacy of Martin Luther King Jr. than Julian Bond. Race Man— a collection of his speeches, articles, interviews, and letters—constitutes an unrivaled history of the life and times of one of America’s most trusted freedom fighters, offering unfiltered access to his prophetic voice on a wide variety of social issues, including police brutality, abortion, and same-sex marriage. A man who broke race barriers and set precedents throughout his life in politics; co-founder of the Southern Poverty Law Center and long-time chair of the NAACP; Julian Bond was a leader and a visionary who built bridges between the black civil rights movement and other freedom movements—especially for LGBTQ and women's rights. As we enter the third decade of the twenty-first century, there is no better time to return to Bond's works and words, many of them published here for the first time. \"Endlessly grateful for this collection of work that shows the expansive nature of Julian Bond's ideas of black liberation, and how those ideas are woven into the fabric of both resistance and uplift. Race Man is the map of a journey that was not only struggle and not only triumph.\"— Hanif Abdurraqib, author of They Can't Kill Us Until They Kill Essays \" Race Man is the essential collection of Julian Bond's wisdom—and required reading for the organizers and leaders who follow in his footsteps today.\" —Marian Wright Edelman, President Emerita, Children's Defense Fund \" Race Man is a staggering collection that offers a genealogy of Bond's freedom-oriented politics and soul work as captured in his written words. Race Man is a book that looks back and speaks forward. It is a timely example of what movement building can look like when servant leaders refuse to leave the most vulnerable out of their visions for Black freedom. We need that reminder, like never before, today.\" —Darnell L. Moore, author of No Ashes in the Coming of Age Black & Free in America \" [An] essential volume that will appeal to a broad audience of readers interested in the civil rights movement and human rights overall . . .\"— Library Journal , Starred Review \"Bond's years as an activist also offer a guide through the intellectual and political history of the left in the second half of the 20th century . . . Bond's essays capture the intellectual world that inspired him and that he helped inspire in turn.\"— Robert Greene II, The Nation",
  "genres": [
    "Essays",
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "African American"
  ],
  "author": "Julian Bond",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/44768382-race-man"
}