{
  "title": "Flames of Truth",
  "description": "I was lost in midst of an eerie silence. It was cold, and darkness was all around me. My hair floated lightly in the air. No, not in the air, in water. I was immersed in water. Icy water that burned in my lungs. I was drowning and couldn’t breathe.Desperately, I kicked my legs and moved my arms, but I could never reach the surface. Little by little I felt my strength ebbing away. It was too dark and I was so tired—but I couldn’t give up.I didn’t want to die.I tried to push off with my feet, hoping to feel something solid beneath me, but there was nothing but the fluctuating darkness. It was swallowing me and I didn’t know what to do. The two things that had always scared me the most were water and darkness, so I wondered how the hell I’d ended up there. Why couldn’t I have an instantaneous, painless death?The lack of oxygen was making my head spin. I kept fighting, though every cell in my body was screaming at me to give up. I had to breathe. Opening my mouth, I inhaled desperately. Water flooded my lungs, but it didn’t hurt anymore. My body became heavy and rigid and the darkness devoured me.I awoke with a start.My name is Emma Jones. I'm a typical seventeen-year-old . . . except that I can see the future. Or, at least, what might happen in the future.I’ve never revealed my secret to anyone. I’ve always tried to fly under the radar and not attract anyone’s attention. But this year there are some new boys at school. There’s something different about them.I have a feeling things are going to change for me this year.Flames of Truth is the first book of the saga The Lost Fae, a steamy reverse-harem paranormal romance series, intended for audiences 18 years and older.",
  "genres": [
    "Reverse Harem",
    "Fae",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Dragons",
    "Shapeshifters"
  ],
  "author": "A.C. Pontone",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/44790941-flames-of-truth"
}