{
  "title": "Myths and Legends of the World 1ed -anglais-",
  "description": "Bold reader - open your mystical map and get ready to travel through time with 21 dazzling stories of daring and deceit, reward and punishment. Meet gods, goddesses and demigods, serpents, coyotes, talking fish and clever spiders, and cavort with sea nymphs, mystical women, terrifying beasts and volcano people - as you discover different tales of how the world began.These powerful, fascinating myths and legends will transport you to every corner of the globe. You'll journey from ancient to modern times, from hot climates to freezing temperatures, from mountaintops to seafloors.The stories in this book link you to past generations; these tales have been passed down through a long line of oral traditions. The souls of ancestors, the lives of heroes and the fates of mortals are waiting to be discovered.Myths and legends are retold by Alli Brydon and beautifully illustrated by Julia Iredale.Myths from Africa include:'The Creation of the World' from the Kuba people of the Democratic Republic of Congo 'The Tale of the Ghosts and the Flutes' from the Beba people of Cameroon 'Anansi and the Box of Stories' from the Ashanti people of present-day Ghana Myths from Europe include:The Selkies from(more...)0206Get ready to travel through time with 21 dazzling stories of daring and deceit, reward and punishment. Meet gods and goddesses, serpents, coyotes, talking fish and clever spiders, and discover different versions of how the world began. This beautifully illustrated book features vibrant myths and epic legends told in countries around the world.99CN0403069781788683074.jpgLonely Planet Kids01Lonely PlanetIE042019100101ROW03AG AI AR AW BB BL BM BO BR BS BZ CA CL CO CR CU DM DO EC FK GD GF GL GP GT GY HN HT JM KN KY LC MF MQ MS MX NI PA PE PM PR PY SR SV TC TT US UY VC VE VG VI01275mm02237mm0318.3mm081.1kg20240930Grantham Book ServicesAD AE AF AL AM AO AT AX AZ BA BD BE BF BG BH BI BJ BN BT BW BY CC CD CF CG CH CI CM CN CV CX CY CZ DE DJ DK DZ EE EG EH ER ES ET FI FO FR GA GB GE GG GH GI GM GN GQ GR GW HK HR HU ID IE IL IM IN IO IQ IR IS IT JE JO JP KE KG KH KM KP KR KW KZ LA LB LI LK LR LS LT LU LV LY MA MC MD ME MG MK ML MM MN MO MR MT MU MV MW MY MZ NA NE NG NL NO NP OM PH PK PL PS PT QA RE RO RS RU RW SA SC SD SE SG SH SI SJ SK SL SM SN SO SS ST SY SZ TD TG TH TJ TL TM TN TR TW TZ UA UG UZ VA VN YE YT ZA ZM ZW202019101160114.99GBP",
  "genres": [
    "Mythology",
    "Nonfiction",
    "Middle Grade",
    "Childrens",
    "Picture Books"
  ],
  "author": "Alli Brydon",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/44788836-myths-and-legends-of-the-world-1ed--anglais-"
}