{
  "title": "The War-Time Journal of a Georgia Girl, 1864-1865",
  "description": "War-Time Journal of a Georgia Girl, 1864-1865 is one of the truly important published diaries of the Civil War southern home front. Eliza Frances Andrews, more commonly known as Fanny, was born in 1840 to world of pre-Civil War southern privilege; her father was a prominent judge in the region who owned two hundred slaves and a cotton plantation. Georgia’s secession from the Union provoked many disagreements within Fanny’s family, as it did with many others across the South. Her father firmly opposed secession, fearing it would be lead to the destruction of their way of life, while Fanny and the rest of family supported the Rebel cause, indeed three of her brothers went on to fight for the Confederacy. Fanny did not record the first three years of the conflict, but as she began to be increasingly surrounded by death and destruction she decided to begin records the events that she witnessed. John Inscoe, editor of the New Georgia Encyclopedia, found the book particularly notable for the account of Sherman’s devastating March to the Sea and “her harrowing retreat from her home in Washington; as [Sherman’s] Union forces approached, she moved across ravaged areas to find refuge at her sister’s plantation in the southwestern part of the state.” Fanny describes in brilliant detail the collapse of the traditional agrarian world of the South and how members of the old ruling class were forced to become refugees in their own state. “a rich source of insight into the southern home front of the Civil War.” Kim Kleinman, A Journal of the History of Science Society “Andrews was a product of the Old South but a woman who became self-sufficient and independent as her world changed.” Charlotte A. Ford, The Georgia Historical Quarterly “With an insider’s view, she proved a talented writer and astute observer. … The diary is filled with Andrews’s fiery, spirited persona” Saporta Report Eliza Frances Andrews was a popular Southern writer of the Gilded Age. Andrews's published works, notably her Wartime Journal of a Georgia Girl along with her novels and numerous articles, give a glimpse into bitterness, dissatisfaction, and confusion in the post-Civil War South. The War-Time Journal of a Georgian Girl, 1864-1865 was first published in 1908 and she passed away in 1931.",
  "genres": [
    "History",
    "Civil War",
    "Memoir",
    "Biography",
    "Nonfiction",
    "American Civil War",
    "American History"
  ],
  "author": "Eliza Frances Andrews",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/44794184-the-war-time-journal-of-a-georgia-girl-1864-1865"
}