{
  "title": "Tales from Toonopolis Volume One",
  "description": "Toonopolis is a cartoon city that is home to the thoughts and ideas of all sentient beings in the universe. As the center of the Tooniverse, it acts as an other-worldly rest stop for these creations.In this collection, you will find short stories and novellas telling side-stories and adventures from minor characters met in the Toonopolis Files novels. From Candemons to antiheroes to demonic toasters to steampunk heroines, there is a wide range of tales within these pages!Delve into the infinite world of Toonopolis and see how diverse and wild the cartoon universe can be. Even if you've never read the Toonopolis Files novels, you can still read and enjoy these stories as your first taste of Toonopolis! List Of Stories\"Where Do Our Ideas Go?\": flash fiction introducing the concept of creation impermanence inside the Tooniverse.\"The Legend of the Chucacabra\": campfire-style short story telling the legend of the Chucacabra in the Westoria section of the cartoon city.\"How To Create A Villain or Let Sleeping Candemons Lie\": a sweet sixteen party goes wrong when Roy G. Biv invites the Candemon to the party... and he is less than welcome!Anchihiiroo - Origin of an Antihero: In Animetown, there exists an antihero like none other. This novella tells the story of Yoshi of Higeki, who would become Anchihiiroo and one of the rogues Gemini faced in Toonopolis: Gemini.\"The Grave Little Toaster\": a short-story in the Suburbia section of Toonopolis, wherein a bumbling suburban couple summons a demon to kill their neighbors... from inside a toaster.Misanthrope Beechworth & The Dustwaste Wellspring: In this novella set in the Steamport section of the city, learn how a simple toymaker's daughter turns a routine scavenging mission into the biggest adventure Steamport has seen in a decade!",
  "genres": [],
  "author": "Jeremy Rodden",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/44791056-tales-from-toonopolis-volume-one"
}