{
  "title": "Nobody Move",
  "description": "Winner: Best First Novel, CWC Awards for Excellence in Canadian Crime Writing\"Elliott has a real feel for comedic noir in the Elmore Leonard vein, and his debut novel screams cult classic\"—BooklistEddie Vegas made a terrible mistake. Now he has to pay the price. After a botched debt collection turned double murder, Eddie splits, desperate to avoid his employer, notorious L.A. crime boss Saul Benedict, and his men (and Eddie's ex-partners), Floyd and Sawyer, as well as the police. Soon he becomes entangled with the clever and beautiful Dakota, a Native American woman fresh in the City of Angels to find her missing friend--someone Eddie might know something about. Meanwhile in Texas, ex-assassin Rufus, seeking vengeance for his murdered brother, takes up his beloved daggers one final time and begins the long drive to L.A. When the bodies begin to mount, Detective Alison Lockley's hunt for the killer becomes increasingly urgent. As paths cross, confusion ensues, and no one's entirely sure who's after who. But one thing is clear: They're not all getting out of this alive.Praise\"A multifaceted series opener by a promising new voice in hard-boiled crime fiction. Fans of Elmore Leonard and Jim Thompson will find much to savor.\"\n—Kirkus Reviews\n\"A new spin on the crime thriller genre.\"\n—San Francisco Book Review\n\"Sharp, stylish and well-written. It makes reading fun again.\"\n—US Review of Books\n\"Impossible to put down.\"—Kevin Wilson, NYT bestselling author of Nothing to See Here\"Fast-paced and chock full of interesting characters and chillingly delicious evil.\"\n—IndieReader\n\"First class neo-noir.\"\n—Murder, Mayhem & More\n\"Not a single dull moment.\"\n—Online Book Club\n“If you love LA crime novels that don’t hold back, this one’s for you.” —Wyborn Senna, author of Porter’s Fortune\"Like Tarantino on the page . . . rushes at you from page one.\"—Dietrich Kalteis, author of Cradle of the Deep\"Elliott has a gift for upholding momentum that never slows.\"\n—The Prairies Book Review",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Crime",
    "Audiobook",
    "Suspense"
  ],
  "author": "Philip  Elliott",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/44780015-nobody-move"
}