{
  "title": "My Soul Looks Back in Wonder: Voices of the Civil Rights Experience",
  "description": "Juan Williams's timely, compelling, and critically acclaimed book about the civil rights movement is now available in paperback, with a special, extended readers' group guide.Published in collaboration with the AARP.58,000 copies sold!Deeply personal in tone, and powerful in the extreme, My Soul Looks Back in Wonder presents stirring eyewitness accounts from people who played active roles in the civil rights movement over the past 50 years. All the narratives are drawn from AARP's Voices of Civil Rights project, and they present a wide-ranging picture of the struggle.This new and helpful readers' group guide includes a clear and succinct introduction especially directed to those studying the book; thought-provoking questions for discussion; praise for the author; and a brief author biography.Juan Williams doesn't merely retell familiar tales about this tumultuous he showcases stories of personal transformation that bring a pivotal moment in American history profoundly alive. And it isn't just about the the vivid language and intimate experiences that unfold on every page reveal just how much the civil rights revolution remains a vital force today. Every speaker makes clear that the fight for equality must continue now, and into the future.\"David Halberstam provides an excellent overview...the combination of analysis and intimacy with powerful documentary photos makes for gripping narrative. Best of all are the connections with contemporary struggles for equality...Marion Wright Edelman's final impassioned essay speaks for the millions of all races who continue to be 'left behind in our land of plenty.'\"-- Booklist\"Individual transformation is the organizing theme...The stories seem fresh because events played out differently for each contributor.\"-- Washington Post",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "African American",
    "American History"
  ],
  "author": "Juan Williams",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/448180.My_Soul_Looks_Back_in_Wonder"
}