{
  "title": "David Tung Can't Have a Girlfriend Unless He Gets Into an Ivy League College",
  "description": "“You’re not allowed to have a girlfriend until college,” my mother warned. “And you’d better get into an Ivy League school!”David Tung is a Chinese American high-school student who works in his family’s restaurant, competes for top rank at his upscale, Asian-majority, suburban New Jersey high school, and hangs with his “real” friends at weekend Chinese school in NYC’s working-class Chinatown. When popular girl Christina Tau asks David to the high school Dame’s Dance, David’s tightly regimented life gets thrown into a tailspin. He soon realizes that he actually has feelings for Betty, the smartest girl at Chinese school. But, as his mother reminds him, he’s not allowed to have a girlfriend! Should he defy his mother and go to the dance, or defy Cristina’s wishes and spend Saturday night studying for the MCATs? Ed Lin’s YA-debut explores coming-of-age in the Asian diaspora while navigating relationships through race, class, young love, and the confusing expectations of immigrant parental pressure. Praise for David Tung Can’t Have A Girlfriend Until He Gets Into An Ivy League College“David Tung is a nerd-hero readers will cheer on to the end.”— MARIE MYUNG-OK LEE, author of Finding My Voice\"You'll laugh, you'll cry, you'll get straight A's.\"— CHRIS L. TERRY, author of Black Card and Zero Fade\"You’ll fall hard for David Tung, a high-achieving teen with a heart of gold. Lin writeswith a keen sense of character; even the most minor characters spring alive off the page.\"— SHEBA KARIM, author of That Thing Called a Heart and Mariam Sharma Hits the Road\"With tender and hilarious insight, Ed Lin offers an irresistible tale of first love,complete with swooning crushes, tongue-tied blunders, overbearing-but-well-meaning parents, and an outrageous cast of supporting characters only New York and New Jersey can produce.\"— JJ STRONG, author of Us Kids Know“A beautifully observed, hilariously truthful, uplifting coming-of-age story thatcaptures the heart and humanity of a Chinese American male teenager. I am impressed and inspired by Ed Lin’s achievement and wish I could’ve read this book when I was in high school.\"— DAVID HENRY HWANG, playwright of FOB and M. Butterfly\"I cringed, I cheered, I wished this book had been there for me as a teen.\"— JUNG KIM, Teacher-educator and Associate Professor of Literacy at Lewis University",
  "genres": [
    "Young Adult",
    "Fiction",
    "Asian Literature",
    "High School",
    "Contemporary",
    "Romance",
    "Family"
  ],
  "author": "Ed Lin",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/44824554-david-tung-can-t-have-a-girlfriend-unless-he-gets-into-an-ivy-league-col"
}