{
  "title": "Five",
  "description": "Rayla Tate’s life is about to turn vertical…again. As if it wasn’t bad enough her mother disappeared under questionable circumstances leaving Rayla to be raised by her aunt in a horrendously small town. Her overprotective guardian is determined to ruin Rayla’s life. She refuses to let Rayla out of her sight or out of the state. Provincial living might be what her aunt demands of her purposely sheltered niece; but, Rayla has other ideas. In a desperate attempt to follow her dreams she flees the safety of her home and runs away to college with her best friend toward a bright future in the art world. However, excitement over her newfound freedom turns into terror when she is chased by a mysterious stranger on her way to school. When his motorcycle suddenly morphs into a fire-breathing pegasus, Rayla questions her sanity. Worse, the man riding next to her stirs a burning desire in her soul she has never known or could have ever imagined. Using all the will she owns, she manages to resist the compulsion she feels; yet, as he disappears into the night, she is certain he hasn't gone far. Rayla quickly dismisses the encounter to her overactive imagination. She is determined to settle into her new life, yet the images and feelings of that night still haunt her. To make matters worse, her aunt seems to be in on the act, insisting that Rayla will soon be hunted by a pack of fae lords for a power over the elements she never knew she possessed—a power that could change the world. Quicker than she ever thought possible, she finds herself surrounded by stunning men that all seem determined to win her heart. Why does she feel drawn to each one of them? More importantly, what dark power do they hold over her? Rayla must quickly learn to fend off these beautiful and seductive pursuers using whatever means necessary or find herself lost to the fae world forever.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Fae",
    "Romance",
    "Paranormal Romance",
    "Magic"
  ],
  "author": "Christie L. Rich",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/12415584-five"
}