{
  "title": "A House in the Mountains: The Women Who Liberated Italy from Fascism",
  "description": "The acclaimed author of A Train in Winter returns with the \"moving finale\" (The Economist) of her Resistance Quartet—the powerful and inspiring true story of the women of the partisan resistance who fought against Italy’s fascist regime during World War II.In the late summer of 1943, when Italy broke with the Germans and joined the Allies after suffering catastrophic military losses, an Italian Resistance was born. Four young Piedmontese women—Ada, Frida, Silvia and Bianca—living secretly in the mountains surrounding Turin, risked their lives to overthrow Italy’s authoritarian government. They were among the thousands of Italians who joined the Partisan effort to help the Allies liberate their country from the German invaders and their Fascist collaborators. What made this partisan war all the more extraordinary was the number of women—like this brave quartet—who swelled its ranks.The bloody civil war that ensued pitted neighbor against neighbor, and revealed the best and worst in Italian society. The courage shown by the partisans was exemplary, and eventually bound them together into a coherent fighting force. But the death rattle of Mussolini’s two decades of Fascist rule—with its corruption, greed, and anti-Semitism—was unrelentingly violent and brutal.Drawing on a rich cache of previously untranslated sources, prize-winning historian Caroline Moorehead illuminates the experiences of Ada, Frida, Silvia, and Bianca to tell the little-known story of the women of the Italian partisan movement fighting for freedom against fascism in all its forms, while Europe collapsed in smoldering ruins around them.",
  "genres": [
    "History",
    "Nonfiction",
    "Italy",
    "World War II",
    "Historical",
    "Feminism",
    "War"
  ],
  "author": "Caroline Moorehead",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/44890011-a-house-in-the-mountains"
}