{
  "title": "Disunited Nations: The Scramble for Power in an Ungoverned World",
  "description": "The future of nations, by New York Times Bestselling Author of  The End of the World is Just the Mapping the Collapse of Globalization.In  Disunited Nations , geopolitical strategist Peter Zeihan presents a series of counterintuitive arguments about the future of a world where trade is coming apart and international institutions are losing their power. Germany will decline as the most powerful country in Europe, with France taking its place. Every country should prepare for the collapse of China, not North Korea. We are already seeing, as Zeihan predicted, Russian military action in Europe beginning with the invasion of Ukraine.The world has gotten so accustomed to the \"normal\" of an American-dominated order that we have all forgotten the historical several smaller, competing powers and economic systems throughout Europe and Asia. America isn't the only nation stepping back from the international system. From Brazil to Great Britain to Russia, leaders are deciding that even if plenty of countries lose in the growing disunited chaos, their nations will benefit. The world isn't falling apart - it's being pushed apart. The countries and businesses prepared for this new every-country-for-itself ethic are those that will prevail; those shackled to the status quo will find themselves lost in the new world disorder. Smart, interesting, and essential reading,  Disunited Nations  is a sure-to-be-controversial guidebook that analyzes the emerging shifts and resulting problems that will arise in the next two decades. We are entering a period of chaos, and no political or corporate leader can ignore Zeihan's insights or his message if they want to survive and thrive in this uncertain new time.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Economics",
    "Audiobook",
    "International Relations",
    "Geography"
  ],
  "author": "Peter Zeihan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/44890069-disunited-nations"
}