{
  "title": "The Selected Poetry",
  "description": "In 1938 Random House published The Selected Poetry of Robinson Jeffers , a volume that would remain in print for more than fifty years. For decades it drew enough poets, students, and general readers to keep Jeffers—in spite of the almost total academic neglect that followed his fame in the 1920s and 1930s—a force in American poetry. Now scholars are at last beginning to recognize that he created a significant alternative to the High Modernism of Pound, Eliot, and Stevens. Similarly, contemporary poets who have returned to the narrative poem acknowledge Jeffers to be a major poet, while those exploring California and the American West as literary regions have found in him a foundational figure. Moreover, Jeffers stands as a crucial precursor to contemporary attempts to rethink our practical, ethical, and spiritual obligations to the natural world and the environment. These developments underscore the need for a new selected edition that would, like the 1938 volume, include the long narratives that were to Jeffers his major work, along with the more easily anthologized shorter poems. This new selected edition differs from its predecessor in several ways. When Jeffers shaped the 1938 Selected Poetry , he drew from his most productive period (1917-37), but his career was not over yet. In the quarter century that followed, four more volumes of his poetry were published. This new selected edition draws from these later volumes, and it includes a sampling of the poems Jeffers left unpublished, along with several prose pieces in which he reflects on his poetry and poetics. This edition also adopts the texts of the recently completed The Collected Poetry of Robinson Jeffers (five volumes, Stanford, 1988-2000). When the poems were originally published, copy editors and typesetters adjusted Jeffers's punctuation, often obscuring the rhythm and pacing of what he actually wrote, and at points even obscuring meaning and nuance. This new selected edition, then, is a much broader, more accurate representation of Jeffers's career than the previous Selected Poetry . Reviews of volumes in The Collected Poetry of Robinson Jeffers \"A masterful job of contemporary scholarly editing, this book begins an edition intended to clarify a 'Jeffers canon,' establishing for times to come the verse legacy of a poet who looked on all things with the eyes of eternity.\"— San Francisco Chronicle \"This edition will be standard . . . a tribute and justice to a poet whose independent strength has survived to challenge personal and public canons.\"— Virginia Quarterly Review \"Jeffers is the last of the major poets of his generation—Frost, Stevens, Williams, Pound, Moore, Eliot—to get his collected poems. Now that the job is at hand, it is done very well. . . . Tim Hunt has been painstaking in his editorial preparation and judicious in his presentation. . . . A great poet is ready for his due.\"— Philadelphia Inquirer \"Few American poets are treated as well by publishers as Jeffers is by Stanford University Press. . . . These poems represent a distinctive voice in the American canon, and it is good to have them so wonderfully set forth.\"— Christian Century",
  "genres": [
    "Poetry",
    "American",
    "Literature",
    "Fiction",
    "Classics",
    "The United States Of America"
  ],
  "author": "Robinson Jeffers",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/448944.The_Selected_Poetry"
}