{
  "title": "Big Wonderful Thing: A History of Texas",
  "description": "The story of Texas is the story of struggle and triumph in a land of extremes. It is a story of drought and flood, invasion and war, boom and bust, and the myriad peoples who, over centuries of conflict, gave rise to a place that has helped shape the identity of the United States and the destiny of the world.\"I couldn't believe Texas was real,\" the painter Georgia O'Keeffe remembered of her first encounter with the Lone Star State. It was, for her, \"the same big wonderful thing that oceans and the highest mountains are.\"Big Wonderful Thing invites us to walk in the footsteps of ancient as well as modern people along the path of Texas's evolution. Blending action and atmosphere with impeccable research, New York Times best-selling author Stephen Harrigan brings to life with novelistic immediacy the generations of driven men and women who shaped Texas, including Spanish explorers, American filibusters, Comanche warriors, wildcatters, Tejano activists, and spellbinding artists--all of them taking their part in the creation of a place that became not just a nation, not just a state, but an indelible idea.Written in fast-paced prose, rich with personal observation and a passionate sense of place, Big Wonderful Thing calls to mind the literary spirit of Robert Hughes writing about Australia or Shelby Foote about the Civil War. Like those volumes, it is a big book about a big subject, a book that dares to tell the whole glorious, gruesome, epically sprawling story of Texas.\"Harrigan, surveying thousands of years of history that lead to the banh mi restaurants of Houston and the juke joints of Austin, remembering the forgotten as well as the famous, delivers an exhilarating blend of the base and the ignoble, a very human story indeed. [Big Wonderful Thing is] as good a state history as has ever been written and a must-read for Texas aficionados.\"--Kirkus, Starred Review",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "American",
    "Biography",
    "The United States Of America",
    "Audiobook"
  ],
  "author": "Stephen Harrigan",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/44890882-big-wonderful-thing"
}