{
  "title": "What Kind of Girl",
  "description": "\"Both timely and timeless, a powerful exploration of abuse in its many forms, as well as the strength it takes to rise up and speak your truth.\"—AMBER SMITH, New York Times bestselling author of The Way I Used to Be\n\nFrom New York Times bestselling author Alyssa Sheinmel comes an unflinching exploration of the labels society puts on girls and women—and the strength it takes to rise above it all to claim your worth and declare your truth.\nThe girls at North Bay Academy are taking sides. It all started when Mike Parker's girlfriend showed up with a bruise on her face. Or, more specifically, when she walked into the principal's office and said Mike hit her. But her classmates have questions. Why did she go to the principal and not the police? Why did she stay with Mike if he was hurting her? Obviously, if it's true, Mike should face the consequences. But is it true?Some girls want to rally for Mike’s expulsion—and some want to rally around Mike. As rumors about what really happened spread, the students at North Bay Academy will question what it means to be guilty or innocent, right or wrong.\nPraise for What Kind of Girl:\n\"A poignant, thought-provoking novel that will resonate deeply.\"—Kirkus\"A rallying cry.\"—Booklist\"I immediately saw myself in this book, which so thoroughly explains the thought process when coming to terms with victimhood and survivorship. I felt understood.\"—Chessy Prout, author of I Have the Right To\"Important, raw, timely, and ultimately hopeful…demands readers discuss the trauma of teen dating violence and how girls are so often taught—even expected—to internalize their victimization.\"—Shannon M. Parker, author of The Girl Who Fell and The Rattled Bones",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Mental Health",
    "Fiction",
    "Feminism",
    "Realistic Fiction",
    "LGBT"
  ],
  "author": "Alyssa B. Sheinmel",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/44901351-what-kind-of-girl"
}