{
  "title": "Eat for Life: The Breakthrough Nutrient-Rich Program for Longevity, Disease Reversal, and Sustained Weight Loss",
  "description": "Add years to your life and life to your years with #1 New York Times bestselling author Dr. Joel Fuhrman no-nonsense, results-driven nutrition plan that will help you look and feel your best inside and out.Eat for Life is the first book to showcase Dr. Joel Fuhrman’s Nutritarian Diet in full—the most practical, balanced, and focused way to eat, lose weight, and live longer. Emphasizing high-nutrient, whole plant foods that supply abundant amounts of micronutrients, it can broken down into a simple equation: H = N/C. Or, Health= Nutrient intake per Calorie consumed. Most Americans are deficient in micronutrients (vitamins and minerals) and consume too many macronutrients (calories). Natural, colorful plant foods contain the largest assortment of micronutrients, including anti-cancer phytochemicals. When consumed in large quantities every day, these plant foods are proven to decrease cravings, reverse the symptoms of nearly every disease, and maintain ideal weight. The Nutrarian Diet helps you shed more pounds, reach lower cholesterol and blood pressure levels, reverse diabetes better, and reduce hunger and cravings more than any other program available.Combining Dr. Fuhrman’s wise food and lifestyle advice with his famously straightforward, practical recipes, Eat for Life is a daily guide to eating well, a healthy cookbook and meal plan, and a blunt kick-in-the-butt to help you take control of your health destiny. All people—sick or healthy, overweight or slim, young or old—can benefit from this plan. Eat for Life will help our bodies to thrive and experience a modern miracle: a long, disease-free life without heart disease, strokes, dementia, or even cancer.”",
  "genres": [
    "Health",
    "Nonfiction",
    "Nutrition",
    "Self Help",
    "Cookbooks",
    "Food",
    "Science"
  ],
  "author": "Joel Fuhrman",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/44889922-eat-for-life"
}