{
  "title": "The Ghastling: Book Nine",
  "description": "Step Right Up And Get Your Tickets at Christopher Long’s TERMINUS, a decrepit old bus station that you’ll do well to leave. Our first act is a musical one, a catchy little number that you may have heard before. But isn’t midnight a little late for buskers? And why does everyone else at the station seem to be whistling the same tune? Family Fun is found in Damien B. Raphael’s story RUPERT’S LITTLE BROTHER. The Wynfords are stupefied by grief following a recent family tragedy, but one nanny won’t let the rumours ruin her chances of working at Weston Manor. Eleanor’s heard the talk about Weston, but she won’t be going anywhere – especially not because of any silly old ghost stories. And she’s already passed the first test of her nerves, having met the strange barefoot boy on the gravel path. See Wild Animals beneath the waves in Dan Mitchell’s DRIFT. Under the surface of the water everything changes. Dive down and leave the sounds, stresses and worries of the world above behind. Just watch out for those ghost nets still searching for their catch! Supernatural Illusions abound in Chip Limeburner’s A FORK IN THE WOODS, where a ride home through the trees is halted by an otherworldly intervention. Others might shrink from the prospect of riding the road through the woods alone at night, but not Sir Jonathan. It’s a path he’s often travelled after enjoying Sir Walter’s hospitality, and truth be told he relishes the ride through the cool night air. That is, until he is confronted by a portrait of terror, and something glinting among the leaves. For One Night Only see DILYS finally take centre stage. Josie Turner’s wardrobe mistress is more comfortable amongst the shadows of the workshops beneath the boards, but this evening she’ll threaten to steal the show – much to the distress of an aging actress who isn’t used to supporting roles. Stand Spellbound by the mould stain with no odour in Annie Greene’s WATER DAMAGE. A feature that’s baffled for years – it never gets bigger! What Is It? To find out the truth, you’ll need to spend some time alone with this freakish blemish. Just make sure you lock the door… Feel The Magic Up Close in ON THE MOUNTAIN, as Nia Morais takes us on a journey across the arctic-like Ben Macdui, the second highest peak on the island of Great Britain. Taller than Braeriach, wilder than Ben Nevis – the summit of Ben Macdui is said to be haunted by the wraith-like Old Grey Man. But don’t let that stop you from following us up there! Hot and Cold Refreshments! Ice cream. Cotton candy. Hotdogs. Popcorn. Or perhaps you’ll fancy a spoonful of something sinister from THE PICKLING JAR. Gaynor’s been working hard on perfecting her culinary creation in Lucie McKnight Hardy’s tale, testing out different recipes and tweaking the ingredients each time. Now it’s finally ready to be judged, but do you dare take a taste?",
  "genres": [
    "Horror"
  ],
  "author": "Rebecca Parfitt",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/44910039-the-ghastling"
}