{
  "title": "Yes, My Darling Daughter",
  "description": "Every once in a blue moon, a masterful writer dives into gothic waters and emerges with a novel that—like Daphne du Maurier’s Rebecca, Minette Walters’s The Breaker, and Donna Tartt’s The Little Friend—simultaneously celebrates and transcends the tradition. Welcome Margaret Leroy to the clan.What’s the matter with Sylvie? Such a pretty girl. Four years old; well loved by her young mother, Grace. But there’s something . . . “off ” about the child. Her deathly fear of water; her night terrors; most of all, her fixation with a photo of an Irish seaside town called Coldharbour.“Sylvie, tell me about your picture. Why’s it so special, sweetheart?” My heart is racing, but I try to make my voice quite calm.“That’s my seaside, Grace.” Very matter-of-fact, as though this should be obvious. “I lived there, Grace. Before.”Grace doesn’t know what to do with this revelation—she’s barely scraping by as it is. A single mother with no family, Grace works full-time at a London flower shop to support herself and Sylvie. Overwhelmed by her inability to help her daughter, she turns to Adam Winters, a dashing psychology professor with some unusual theories about what might be troubling the child. Together, they travel to seemingly idyllic Coldharbour, hoping to understand Sylvie’s mysterious connection to the place. Impossible as it may seem, Grace has to accept that her daughter may be remembering a past life. And not only that: the danger bedeviling Sylvie from her past life is still very much a threat to her in this one.Margaret Leroy has been celebrated for writing “like a dream,” and her previous novels have been praised for their “hypnotic prose” and “sensuously ethereal, subtly electric drama.” Now, in Yes, My Darling Daughter, Leroy offers a novel both haunted and haunting—a wonderfully original, deliciously suspenseful story that enthralls from the first page to the very last.",
  "genres": [
    "Fiction",
    "Mystery",
    "Paranormal",
    "Book Club",
    "Supernatural",
    "Fantasy",
    "Irish Literature"
  ],
  "author": "Margaret Leroy",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/4492399-yes-my-darling-daughter"
}