{
  "title": "The Secret Glory",
  "description": "Sewn hardback printed and bound by Antony Rowe in green wibalin cloth stamped in gold,with yellow and green head and tailband. 500 copies. Out of print.Description: Contains all six chapters of the novel together for the first time. It is probable that all through those early years Ambrose's father had been charming his son's heart, drawing him forth from the gehenna-valley of this life into which he had fallen, as one draws forth a beast that has fallen into some deep and dreadful place. Various are the methods recommended. There is the way of what is called moral teaching, the way of physiology and the way of a masterly silence; but Mr. Meyrick's was the strange way of incantation. He had, in a certain manner, drawn the boy aside from that evil traffic of the valley, from the stench of the turmoil, from the blows and the black lechery, from the ugly fight in the poisonous smoke, from all the amazing and hideous folly that practical men call life, and had set him in that endless procession that forever and forever sings its litanies in the mountains, going from height to height on its great quest. Ambrose's soul had been caught in the sweet thickets of the woods; it had been bathed in the pure water of blessed fountains; it had knelt before the altars of the old saints, till all the earth was become a sanctuary, all life was a rite and ceremony, the end of which was the attainment of the mystic sanctity -- the achieving of the Graal. For this -- for what else? -- were all things made. It was this that the little bird sang of in the bush, piping a few feeble, plaintive notes of dusky evenings, as if his tiny heart were sad that it could utter nothing better than such sorry praises. This also celebrated the awe of the white morning on the hills, the breath of the woods at dawn. This was figured in the red ceremony of sunset, when flames shone over the dome of the great mountain, and roses blossomed in the far plains of the sky. This was the secret of the dark places in the heart of the woods. This the mystery of the sunlight on the height; and every little flower, every delicate fern, and every reed and rush was entrusted with the hidden declaration of this sacrament. For this end, final and perfect rites had been given to men to execute; and these were all the arts, all the far-lifted splendor of the great cathedral; all rich carven work and all glowing colors; all magical utterance of word and tones: all these things were the witnesses that consented in the One Offering, in the high service of the Graal.",
  "genres": [
    "Fiction",
    "Classics",
    "Horror",
    "Fantasy",
    "Gothic",
    "Weird Fiction",
    "British Literature"
  ],
  "author": "Arthur Machen",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/4494811-the-secret-glory"
}