{
  "title": "Radiation Nation: Complete Guide to EMF Protection & Safety - The Proven Health Risks of EMF Radiation & What You Can Do to Protect Yourself & Family",
  "description": "AN INVISIBLE DANGER ON THE RISEYou eat organic and non-GMO food. You only drink purified water. You take care of yourself and your family's health. But could there be a silent, invisible danger causing potential harm to you and your loved ones? There could. And it's called electromagnetic frequency (EMF) radiation and its one of fastest growing health issues facing our society. EMF radiation produced by modern technology such as cell phones, tablets, laptops, Wi-Fi, and smart meters is an emerging health threat, and we are all guinea pigs in a giant experiment with many unknown consequences.BUT AREN'T THESE TECHNOLOGIES REGULATED AND SAFE?Surely the government and other regulatory agencies make sure these technologies are completely safe before they are approved for wide-spread use, right? Think again. Ninety-five percent of American adults use cell phones regularly. Most households have Wi-Fi. And even schools are increasingly becoming dependent on wireless devices. And yet none of these technologies have been proven safe to humans for long-term exposure.In fact, science confirms that the EMF emitted from common electronic devices can cause definite biological changes in the body, and mounting research has already shown it can lead to a long list of health concerns - some of which can be pretty serious.The explosive use of mobile devices only occurred over the last twenty years, yet we have only scratched the surface of what technology is yet to come. Children born today will be exposed to much higher doses of EMF radiation than those born just ten years ago. What are the ramifications and what can we do now to minimize the fallout?IN 'RADIATION NATION' YOU WILL LEARN:⁍What EMF radiation is and how it affects the body biologically⁍The major health risks including fertility issues for both men and women, DNA damage, cell mutation, cancer and other serious health risks⁍The latest scientific studies broken down by disease or condition ⁍How EMF radiation specifically affects children and those suffering with electromagnetic hypersensitivity⁍Why the current safety standards for EMF are insufficient and need to be rewritten⁍The EMF sources of greatest concern⁍The most practical precautions to protect yourself and your loved ones from EMF radiation⁍What is 5G and what are the possible health risks?⁍Do stickers, diodes, harmonizers and other products marketing as protection have any grounding in science?IS THERE A SOLUTION? Fortunately, there are simple and effective steps you can take to minimize the risks. Education is key. Wish a foreword by Bulletproof's Dave Asprey, 'RADIATION NATION' is info-packed with all the essential education you need to make smart choices to stay safe when it comes to technology.RUNNING TIME ➪ 2hrs. and 55mins.©2017 Daniel T. DeBaun and Ryan P. DeBaun (P)2017 Daniel T. DeBaun and Ryan P. DeBaun",
  "genres": [
    "Health",
    "Science",
    "Nonfiction",
    "Technology",
    "Conspiracy Theories",
    "Medical"
  ],
  "author": "Ryan P. DeBaun",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/45015028-radiation-nation"
}