{
  "title": "The Celtic Cowboy",
  "description": "Adeline MurphyIn Texas, two things are gospel - football and rodeos. Growing up as the daughter of a football legend made me practically royalty, but it’s not a crown I’m interested in. Football life isn’t for me, no matter how hard my family pressures me with their motto of “If you can’t be them, marry them.” Living in the shadow of my football star brothers was exhausting and I eventually became invisible all together. I bide my time working at my family’s car dealership until I gather up the nerve to tell them that I’m living life on my own terms. I have my own dreams and they don’t include marrying a football player or a cowboy. My resolve was strong, until a cocky Celtic cowboy sauntered into my life. Ryan Kearney might not wear a football jersey, but wearing a cowboy hat and chaps was just as lethal. Devilish good looks with a mouth that could even charm the panties off a nun, I knew I was in trouble when he set his sights on me.A roll in the hay with a playboy cowboy is the last thing I need… especially when I’m already falling for him. Ryan KearneyAs an up and coming bull rider, I’ve learned that rodeo life is grueling, but it’s the life I’ve chosen. The pounding of your heart and the thunder of applause that rings in your ears when that buzzer calls out the end of the eight seconds is a sound like no other. My dream to be a professional bull rider in the American Pro Rodeo Circuit is finally becoming a reality when my brother and I leave Ireland to compete for our shot at Nationals in Las Vegas. If I want the title of the best bull rider in the world, being mediocre isn’t enough. To be the best, you have to beat the best, which requires me living, breathing and sleeping rodeos. Being in a committed relationship isn’t even on my radar. So I do casual relationships and it seems my notoriety as the Playboy Cowboy preceded me to America. What can I say? The ladies love cowboys and I love the ladies.Charming them into bed is my second favorite pastime, so when the warm brown eyes of Adeline Murphy lock on mine and burn with yearning, I know I have her right where I want her. Except I don’t. The sexy spitfire seems immune to my charm and makes me work hard for her attention. The chase has become a game - one that I’m determined to win and to make her mine. I wasn’t looking for forever, but I can’t imagine my life without her.",
  "genres": [
    "Romance",
    "Novella",
    "Contemporary",
    "Westerns",
    "Contemporary Romance"
  ],
  "author": "Jessica Marin",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/45012718-the-celtic-cowboy"
}