{
  "title": "Parental Alienation Syndrome: Child Brainwashing Hacks Used by Narcissists (in 30 minutes)",
  "description": "Many people are in the midst of a high conflict court and custody battle with a narcissist. They begin to experience the narcissist’s gaslighting and wrath in many ways. Not only do they experience this, however. They find that their child is the victim of gaslighting an d brainwashing also. The narcissist doesn’t realize that the other parent brainwashes the child and triangulates the child against them. Eventually, the child begins to detest and hate the non-narcissistic parent. All the while, the non-narcissistic parent never knows what they did wrong to deserve their own child hating them the way they do. There is a name for this type of hatred that narcissist breeds in a child toward the non-narcissistic parent. It is called Parental Alienation Syndrome. The child will start to have symptoms of ADHD, Autism, Oppositional Defiant Disorder, and Pathological Demand Avoidance. They will not respect the non-narcissistic parent at all. They align with the narcissistic parent because they see that the narcissist often gets that they want out of life by lying, cheating, stealing, bullying and pushing the boundaries of others. If you are in the midst of a high conflict divorce or custody battle with a narcissist, you need to read J.B. Snow’s divorce court series. In the other books, we show you how to be likeable in court so that you can gain a better edge in the battle against the narcissist. We show you how to negotiate and work with attorneys. We show you how to game the system and survive the battle emotionally so that you won’t fall into a ball of dribbling misery while you are navigating the contentious divorce and custody environment that your ex has created. In book 14, we discuss the hacks and tools that the narcissist will use in divorce court and custody battles to throw you off kilter. This book talks about how the narcissist throws his children off-kilter. He gaslights them to the point that they don’t know what is real and what is not real. He disorients his children and pushes their boundaries. He blurs the lines for them between what is healthy and unhealthy. The children seek approval naturally from their parent, but they are left with a parent who has no ability to attune to them or guide them to adulthood in any meaningful way. www.abuserescue.com",
  "genres": [],
  "author": "J.B. Snow",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/45005005-parental-alienation-syndrome"
}