{
  "title": "American Conspiracies and Cover-ups: JFK, 9/11, the Fed, Rigged Elections, Suppressed Cancer Cures, and the Greatest Conspiracies of Our Time",
  "description": "Interviews with bestselling authors and conspiracy experts Jim Marrs, Noam Chomsky, G. Edward Griffin, and Others​ “Those intrepid souls seeking to peer deeper into America's greatest conspiracies should start with Douglas Cirignano's voluminous book American Conspiracies And Cover-ups. From the foreknowledge of the attacks of Pearl Harbor and September, 11, 2001 to the truth behind the assassinations of John F; Kennedy and Dr. Martin Luther King Jr., no conspiracy is left behind. Pick your favorite conspiracy---is the Federal Reserve System unconstitutional? Was the IRS created to bail out Big banks? Are cancer cures and cheap alternative energy being suppressed? Are elections made fraudulent by hacked voting machines?---Cirignano has them all. Incisive interviews with knowledgeable experts. Don't miss this tour de force.”—Jim Marrs, journalist and New York Times bestselling author of Rule by Secrecy; The Rise of the Fourth Reich; The Trillion-Dollar Conspiracy; and Population How Corporate Owners Are Killing Us. American Conspiracies and Cover-ups brings together interviews with the bestselling and brightest minds in the alternative history world to create the definitive guide to our country’s biggest secrets. Interviews Marrs on the New World OrderNoam Chomsky on mainstream mediaThe JFK assassination with LBJ’s lawyerVeteran and author Robert B. Stinnet on Pearl HarborG. Edward Griffin on the Federal Reserve BankDr. William F. Pepper on MLK's assassinationProfessor David Ray Griffin on 9/11and more!Author Douglas Cirignano brings together the foremost experts in the field to answer these questions once and for all, and proves that mainstream histories don’t tell the real story.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Politics",
    "Conspiracy Theories"
  ],
  "author": "Douglas Cirignano",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/45011796-american-conspiracies-and-cover-ups"
}