{
  "title": "Twelve Days of Terror: A Definitive Investigation of the 1916 New Jersey Shark Attacks",
  "description": "An account of the 1916 New Jersey shark attacks that inspired Peter Benchley's Jaws chronicles the twelve-day period during which four swimmers were killed and a fifth seriously injured, examining clues and evidence to consider what actually took place.Review:\"Beginning July 1, 1916, a spate of shark attacks off the Jersey shore befuddled maritime experts and terrified the public. In the first incident, an unsuspecting vacationer's thigh was bitten off; he eventually died. Over the next 12 days, three more people were killed and another seriously injured. These two books by New Jersey authors re-create differing theories as to who, and what, was responsible for the carnage, a subject that scientists still debate today. Philadelphia Inquirer journalist Capuzzo (nominated four times for a Pulitzer) unwaveringly adheres to the most popular theory (that a single, juvenile great white shark was responsible for all the carnage), but his book's strength lies in its lively reconstruction of the age and its consciousness, in which a new leisure class was emerging, with many of its members venturing into the ocean for the first time. (He also recounts the shark's movements and supposed feelings from an omniscient, third-person perspective to strained, unintentionally comical and inevitably misleading effect.) The encounters between people and sharks make for some tense and gruesome reading, and the rest of the book is equally page-turning: the zeal to find the \"Jersey man-eater,\" the sensational \"feeding frenzy\" of the press and the befuddlement of a scientific community, which then devoutly believed that sharks did not bite humans. On that last front, Fernicola, a physician specializing in post-stroke and post-injury recovery, adds to his own investigation of this episode an exhaustive review of shark science today and theories of shark aggression toward humans, including possible environmental factors (heat, changes in human bathing habits, even bathing suit styles), speculations on the perpetrator's exact species, and well-reasoned arguments and conclusions. Fernicola is a recognized authority on the 1916 attacks (his work has provided the basis for Discovery Channel and History Channel documentaries on the subject), but he marshals so much data that his book fails to live up to its lurid title, giving its looming competitor the edge. (May; Capuzzo on-sale: May 8) Forecast: With bathing suit season just around the corner, these books are well timed. Fernicola's, which will be the subject of an upcoming spread in USA Today and is scheduled for coverage on Good Day New York, will provide grist to shark enthusiasts and fans of the Jaws films. Lyons Press has high hopes for its book and has committed to an unprecedented (for this house) 50,000 first printing. Capuzzo will tour six major cities on both coasts, along with stops on Cape Cod and, of course, the Jersey shore. His compulsive potboiler just may be the hot read on the beach this summer.\" - Publishers Weekly",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Animals",
    "Science",
    "Historical",
    "Nature"
  ],
  "author": "Richard G. Fernicola",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/449939.Twelve_Days_of_Terror"
}