{
  "title": "The Fifth Survivor: Episode 4",
  "description": "The bacon-loving zombie busting hero, George finds himself behind bars after being betrayed by a police chief and his assistant. No matter, George and his new partner plan to escape imprisonment. However, are Hybrid's little monsters waiting for them? The Gamelit survival horror adventure continues! After being interrogated by the rogue chief and his assistant, George realizes that the zombie outbreak in the mall was an entrapment scheme set-up by the Hybrid Corporation. After his partner, Dawn is kidnapped and taken by the dirty police chief, George takes matters into his own hands and escapes the clutches of a police officer. What he doesn't realize is that Hybrid has spread the Raven Hawk virus into the police station.Armed with only a police baton, George has to fight his way through the new zombie outbreak and obtain his weapons again. As he explores the police station and tries to rescue his partner, he finds out that the chief is not what he claims to be. In fact, the police chief that took him in is living a sinister double life. It's a double life that inculdes resurrecting a devilish cult.Could it be that Hybrid is trying to finance a cult or is the Raven Hawk infection a result of a deal gone bad? In this episode, George will trek the dark side of the police station, literally and figuratively. George will have to fight through creatures, zombies, underground mazes, and even labyrinths to give it that dungeon core feeling. Lurking in the depth of the police station, George will find there is a much more sinister plot hiding behind the closet and it's worst than just skeletons. This place will be so sinister and deadly that even a can of Bacon Flavored Cola might not be enough to save the bacon-loving heroine. Can the middle-aged vigilante escape the trap with his life or will he be heading to bacon heaven to be with the other pigs up in the sky? By the end of this adventure, George might just be the literal meaning of pigs flying.",
  "genres": [],
  "author": "Angel Ramon",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/44994941-the-fifth-survivor"
}