{
  "title": "Tainted Doves Trilogy, Girls, Guns, Grit and Grace",
  "description": "Travel back to the rough and rowdy days of the Arizona Territory and to the women who blazed their own trails. Three tales of romance and ruckus are put together in one edition for your enjoyment. Romances and adventures of various heat levels. Not for the under 18 reader. The Gambler's Passion Tawdry Summers is the daughter of a dying stage actress. Their search for a physician lands them in Prescott. When Tawdry is left on her own, she is desperate to make ends meet. Inside Bare Backed Belle's saloon, Tawdry discovers not everyone is as they claim to be. She's not one to gamble on her heart, but the mysterious and charming gambler, Ace Mc Conaha has eyes that draw more than a good hand. He might just win her heart for life. Heat Mild The Dust Garden Temptation lives in forgotten cabin on the outskirts of nowhere. With only the graves of her dead children for company, she's not prepared when she finds a cowboy shot-up outside. Afraid to trust a stranger, Temptation has to fight her fears or else risk his life. Just when the man named Fallon earns her trust and her heart, she learns he's not who he says he is and she's not so far away from home and a past that she thought forgot about her. Heat Hot Whiskey's Women When three widows learn about the death of their husband, Whiskey Logan, they each travel to Tombstone to claim his corpse. Only, they had no idea of each other's existence. When they meet over his dead body, they form a hilarious un-holy alliance. They might hate each other's guts, but they want revenge, and they won't stop until they take that last shot for Whiskey. Heat Warm with some violence. Dear Readers. How I love these old stories. These are the early works. The stories that began it all. I hope you enjoy the Trilogy and visit me on my blog at www.ElleMarlow.Blogspot.com",
  "genres": [],
  "author": "Elle Marlow",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/45006607-tainted-doves-trilogy-girls-guns-grit-and-grace"
}