{
  "title": "Where the Angels Lived: One Family's Story of Exile, Loss, and Return",
  "description": "The moment she discovers the existence of Richard, a long-lost relative, at Israel’s Holocaust Museum, Margaret McMullan begins an unexpected journey of revelation and connectivity as she tirelessly researches the history of her ancestors, the Engel de Jánosis. Propelled by a Fulbright cultural exchange that sends her to teach at a Hungarian University, Margaret, her husband and teenage son all eagerly travel to Pécs, the land of her mother’s Jewish lineage. After reaching Pécs, a Hungarian town both small and primarily Christian, Margaret realizes right then and there how difficult her mission is going to be. Heart-wrenching, passionate and insightful, Where the Angels Lived by Margaret McMullan beautifully documents the relentless determination of a woman picking up the pieces of her family’s fragmented history throughout the Hungarian Holocaust. “The destruction of the Jews in the country districts of Hungary was a simple business. The Germans made good use of their experience gained annihilating between three to four million Polish, German and Austrian Jews.” In Where the Angels Lived , Margaret quickly discovers just how distinguished and influential her relatives appear to have been before the Holocaust. However, no one seems to recall the man whose name she saw that day in Richard Engel de Jánosi. With the help of students, strangers, and long-lost relatives, Margaret slowly pieces together bits of information about Richard’s past she never would have found without venturing to her family’s homeland. While Margaret’s research starts to reap its own rewards, the road to discovery still comes at a price. Back in the United States, Margaret’s father is sick and her mother is looking frailer every time they Skype. Despite her parents’ deteriorating health, there is much more work to be done abroad. “Remembering the dead, especially family members is important. I know this.” As Margaret struggles to discover why Richard’s existence is wiped from Pécs history, her journey soon becomes her mother’s journey, a nation’s journey, and even perhaps, all of our journeys to reconnect with an inexplicable past. “Sitting there in the pew carved of Moravian oak, I start to shake. I curse every last Hungarian who deported or murdered my family. See? Look at me. My mother got out and she had me and I had a son. You didn’t end us.” Historical, authentic and family-oriented, Where the Angels Lived tells the tale of a somewhat parallel universe that exists even in the 21st century—dealings with Soviet-style bureaucracy; skepticism; anti-Semitism; and ironically the same sort of isolation and rejection Margaret’s Jewish Hungarian family experienced in 1944 before they were forced into concentration camps. Straddling memoir and reportage, past and present, this story reminds us all that we can escape a country, but we can never escape history.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Margaret McMullan",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/45032314-where-the-angels-lived"
}