{
  "title": "להתראות, אללה",
  "description": "\"...אני מתרוממת ופותחת בריצה אמיתית. בגבולות העיר הזאת חיים אנשים רבים עם האשליה שאם רק ירוצו באמת, הכדורים לא ישיגו אותם. אני אחת מהם, כי בלי האשליה הזו אין טעם לברוח.\" מעצר לילי שהשתבש מעורר את חשדה של אריאל, חיילת צעירה בגדוד חי\"ר. כאשר היא מגלה שיחידת מסתערבים סודית הפועלת בגדוד החליטה לגייס אותה לשורותיה, כבר מאוחר מכדי לסרב. אריאל יודעת דבר או שניים על התחזות, וגם מילה או שתיים בערבית; זה מהבית. לא מדברים על זה. זה גם לא יכשיר אותה לחיים החדשים שנכונו לה בלב העיר הפלסטינית הסמוכה, לצד סגן כהנא השחצן והשתקן - גם הוא יודע דבר או שניים, מילה או שתיים.משימתם היא להעמיד פני אחים ולהפוך לחבריו הקרובים של טארק, מפקדם הצעיר והכריזמטי של לוחמי החמאס המקומיים. אסור לדבר מילה בעברית, אסור לחשוב בעברית, אסור לחלום בעברית.אריאל הופכת לג'יהאן. הקורא כמעט ושוכח יחד איתה שהיתה פעם מישהי אחרת. בתהליך סוחף ודרמטי אריאל וכהנא נשאבים עמוק יותר אל חייהם המושאלים, אמונותיהם הבדויות וחברותם הכפויה עם מבוקש אכזר. המצב הקיצוני שבו שרויים השניים מייצר קשר ארוטי טעון, מכאיב והרסני בעוצמתו. בו בזמן, יחסיהם הקרובים עם טארק הולכים ומסתבכים. רגשות עזים צפים בין שלושת הצעירים הללו שחיים על הקצה, איש־איש וסיבותיו, בעיר שהורגים ומתים בה בשם האל, אך שום אל לא מראה בה את פניו. השעון מתקתק לקראת פעולה שתגבה קורבנות רבים ולקראת ההתנגשות הבלתי נמנעת בין זהויות. אריאל יודעת שעליה לעשות משהו, אך בשם מי? ונגד מי?זהו טקסט לופת, חושני, מורכב ונועז שלא נראה כמוהו בספרות העברית. לי־אור אמיר מסכנת את חיי הגיבורה שלה ואת שאננותם של קוראיה כדי למצוא מענה לשאלות הרות גורל, ולא מפחדת מהתשובות, גם כשהן מעוררות אי־נחת. לי־אור אמיר נולדה בחיפה ב־1987, ואת שירותה הצבאי עשתה ביהודה ושומרון. היא בעלת תואר ראשון בלימודי המזרח התיכון ובחשבונאות. את כתיבת הספר החלה מעט לאחר סיום השירות הצבאי. אף שהעלילה בדיונית, חלק מהאירועים בה מבוססים על חוויות אמיתיות לחלוטין. \"להתראות אללה\", ספרה הראשון של לי־אור אמיר יצא לאור בסיוע קרן יצחק לייב ורחל גולדברג – קרן קיימת לישראל.",
  "genres": [],
  "author": "Li-Or Amir",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/45026553"
}