{
  "title": "First Marathons: Personal Encounters With the 26.2-Mile Monster",
  "description": "Introduction by Gail Waesche Kislevitz \"If you have the passion, you have the power.\" I had already been pounding pavement for twenty-four years when I made the decision to run my first marathon. Growing up in the late sixties when women's sports was called cheerleading, I had no formal training in running techniques. I just ran, pure and simple. I ran for the joy of it, the thrill of it, the escape of it. During college, I played lacrosse because there wasn't a women's track team and it seemed like the next best thing to do. But I still remained faithful to my daily run. I ran through the bitter-cold winters of Michigan during graduate school, through two pregnancies and countless other miles that seem to blend into one long life's run. I don't know when I made the transformation from running as a sport to running as part of my life. I can't separate the two. When I run, my mind and body fuse together, creating an energy source that empowers me. It is my private time, my therapy, my religion.Ultimately I had to test myself, to see just how far I could go. I wanted to train correctly, so I bought running books filled with important training routines, nutrition guides, stretching techniques, injury prevention, speed work, pace and performance guidelines. Everything I needed to know about the technical aspects of running a marathon, except the most important thing to me-its soul. No book took on the task of describing the feeling, the heart, the core of a marathon. What would it be like? What would I feel out there? Would I hit the mythical wall? Could the last six miles be so difficult? This was the information I craved. I spoke with friends (and strangers) who had run marathons. They answered my questions with such passion, such fever and excitement for the event that I was mesmerized. I inhaled their stories as they captured every moment of the the lows of utter despair and pain, the highs of inner strength. They became my role models.That was the beginning of this book. I am going to let runners speak for themselves-famous runners, unknowns, fast and slow, old and young. Through their experiences, you will feel the pain and the glory of running the marathon. Their lives h",
  "genres": [
    "Nonfiction",
    "Sports",
    "Memoir"
  ],
  "author": "Gail Kislevitz",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1241871.First_Marathons"
}