{
  "title": "Hop On",
  "description": "An overweight omega puts his life in the hands of a battered and bruised alpha...  Captain Aries did not escape his last mission unscathed. His work with the Elite Force is always dangerous—it’s not easy protecting an entire town of trusting shifters from outside threats—but Aries blames himself for the danger he put his team in. To make certain that will never happen again, he decides to resign after one last mission: to protect a VIP named Arthur on his way to Morningwood. Aries failed as a Captain, he won’t fail as a bodyguard.  Arthur has lived his life alone and on the run. Hiding from his sadistic twin, Arthur keeps a low profile. Overweight and afraid, he cloaks himself in clothes and never engages with shifters, despite being one himself. His evil brother taught him that shifters only bring danger. But when a ruggedly handsome Captain from Morningwood shows up at his house to escort him to the shifter community, for the first time, Arthur wants to believe he could be safe. Arthur isn’t just concerned with himself though. He has his adopted daughter, Harlow, to care for. At two, she should be years away from her first shift, which makes her ability to spontaneously turn into a tiny bunny strange. Not to mention the troubles it causes around bath time.  Aries is drawn to Arthur from the first moment, but who would want a battered alpha like him? He has no right to put a claim on Arthur. Aries knows the single father is perfect just the way he is and deserves perfection in return. But when a rival alpha approaches Arthur and offers him the safe life he craves, will Aries stand back and watch his future family be whisked away?  Hop On: Welcome to Morningwood Book Five is a full-length omegaverse romance with equal parts heart, angst, humor, and steam. It can be read as a standalone or in order and has a definite, you don’t gotta worry ‘bout it HEA.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Omegaverse",
    "Fantasy",
    "LGBT"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/45018970-hop-on"
}