{
  "title": "The White Girl",
  "description": "\"A profound allegory of good and evil, and a deep exploration of human interaction, black and white, alternately beautiful and tender, cruel and unsettling.\"--GuardianAustralia's leading indigenous storyteller makes his American debut with this immersive and deeply resonant novel, set in the 1960s, that explores the lengths we'll go to save the people we love--an unforgettable story of one native Australian family and the racist government that threatens to separate them.Odette Brown has lived her entire life on the fringes of Deane, a small Australian country town. Dark secrets simmer beneath the surface of Deane--secrets that could explain why Odette's daughter, Lila, left her one-year-old daughter, Sissy, and never came back, or why Sissy has white skin when her family is Aboriginal.For thirteen years, Odette has quietly raised her granddaughter without drawing notice from welfare authorities who remove fair-skinned Aboriginal children from their families. But the arrival of a new policeman with cruel eyes and a rigid by-the-book attitude throws the Brown women's lives off-kilter. It will take all of Odette's courage and cunning to save Sissy from the authorities, and maybe even lead her to find her daughter.Bolstered by love, smarts, and the strength of their ancestors, Odette and Sissy are an indomitable force, handling threats to their family and their own identities with grace and ingenuity, while never losing hope for themselves and their future.In The White Girl,  Miles Franklin Award-nominated author Tony Birch illuminates Australia's devastating post-colonial past--notably the government's racist policy of separating Indigenous children from their families, known today as the Stolen Generations--and introduces a tight-knit group of charming, inspiring characters who remind us of our shared humanity, and that kindness, hope, and love have no limits.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Australia",
    "Book Club",
    "Indigenous",
    "Audiobook",
    "Historical"
  ],
  "author": "Tony Birch",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/45020150-the-white-girl"
}