{
  "title": "The Whispering Dwapara : The Rise of Maharathis",
  "description": "# Featured as “Amazon India’s #1 Bestseller” #Words from prominent readers:“The concept is lovely and intriguing, and so is the story.” ~Sharmishtha Shenoy, Bestselling author of ‘Vikram Rana series’“A good debut novel with an interesting world for a series.” ~Jay Puranik, Bestselling author of ‘Letters of a Bloodline’“Excellent writing style, very interesting. Kudos to the writer.” ~Rajeev Patel, an Amazon top 1000 reviewerSummary:Vedgarh, an ancient home of purebred Aryans, is a secret world in modern times where the chants of Vedic Mantras mingle with Acoustics and Applied Physics, the Maharathi warriors fight alongside Indian Army Veterans, and Ancient Daivi Astras join hands with modern Sonic Weapons. Gurukul, Vedgarh’s school, is the sole protector and preacher of sacred Vedic scriptures and Celestial powers. It is due to these powers that Vedgarh is the only corner of the universe where Dwapara Yuga persists even today. Vedgarh is in a continuous state of war with the rising dark powers of Kaliyuga: The Asuras. If Vedgarh falls, the Universe will drown in the darkness of Kaliyuga forever. Sitting on the verge of yet another war with Asuras, Vedgarh is suffering from a lack of warriors. Seeing no promising talents in the Gurukul, Vedgarh opens its gates for modern science and selects a few from the contemporary world to work on a grand mission: a mission to harmonize ancient Vedic powers with modern scientific miracles, to prepare an army of warriors equipped with ancient and modern techniques of fighting, and to invoke Daivi Astras (celestial weapons of Gods) using light and compact modern Sonic weapons. Get ready to witness Vedic Scholars, Physicists, Professors, Sacred Gurus, Ancient warriors, and Indian Army soldiers preparing for the greatest upcoming war of Daivi Astras in the history of mankind.",
  "genres": [
    "Mythology"
  ],
  "author": "Rishi Shrivastava",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/45025067-the-whispering-dwapara"
}