{
  "title": "The Wolf Duke",
  "description": "A lady set on vengeance. A cold duke with secrets of his own. Wills clash when she falls into his life and sparks fly. Can they learn to trust each other before it's too late?\nA lady set on vengeance.Fiery death took her brother and with him, her chance for a normal life with a well-suited match. Now Lady Sloane Ruddington is determined to make the man responsible for the fire pay for his sins—Reiner Doran, a cold-hearted duke with nothing more than acquiring land and filling his coffers in his soul.A cold duke with secrets of his own.When the Duke of Wolfbridge stumbles upon a woman unconscious on his lands, Reiner has little choice but to hold her captive in his household. He has enemies afoot, and she could very well be another spy sent to destroy him. The last thing he should do is trust her. But when the beguiling Scottish beauty awakens with no memory of why she is at Wolfbridge, he has to keep her close—for both of their sakes.Can a fiery lass melt a frigid heart?Reiner soon discovers her enthusiasm for life is exactly what is missing in his household—for his niece—and him. As an undeniable fire between them sparks to life, there becomes only one thing that can tear them apart—her memories. Can they learn to trust each other before it is too late?Join the adventure today! You’ll love The Wolf Duke, the second in the Valor of Vinehill series and a can’t-miss enthralling regency romance by USA Today bestselling author, K.J. Jackson.Note: The novels in the Valor of Vinehill series by K.J. Jackson are each stand-alone stories and can be read individually in any order. These historical romances are set in the Regency and Victorian eras, and do not shy away from scenes with steamy heat, occasional naughty language, and moments that might possibly make you squirm.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Enemies To Lovers",
    "Suspense",
    "Regency Romance"
  ],
  "author": "K.J. Jackson",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/45017918-the-wolf-duke"
}