{
  "title": "Tales from the Beach House",
  "description": "Tales from The Beach House is a satiric work of fiction that sharply captures the “Man-Bites-Dog” world of contemporary South Florida. The Beach House, a crumbling old motel, is home to a collection of eccentric residents. Amongst their ranks; are a tennis pro at the end of his game, a mortuary scientist whose love life has flat-lined, a paparazzo photographer searching for scoops, a bawdy duo fronting an improbable Ponzi enterprise, a beauty from “The Islands” with a dark secret, a fried-out TV weather man who claims to channel God, a middle school principal with a soft spot for Crack, a Rod Stewart cover artist searching for redemption, and a waitress serving a side order of erotic fiction. Each member of this cohort is in search of something – fast money, an easy hustle, fleeting romance, enduring love, fame, power, dignity, happiness… a place they can call home. As well as facing their own tender, tragic, and often hilarious personal circumstances, this eclectic gang is compelled by necessity to band together when a sinister developer threatens the very existence of The Beach House.  Tales from The Beach House is carefully crafted in the spirit of Carl Hiaasen’s career-long deconstruction of South Florida. Each chapter focuses on one of The Beach House’s individual apartments. These standalone stories possess interwoven subplots reminiscent of Chaucer’s The Canterbury Tales, Paul Theroux’s Hotel Honolulu, and Thornton Wilder’s classic novel The Bridge of San Luis Rey. Tales from The Beach House is written in a fast-paced tabloid style, reflecting both the author’s transatlantic sensibilities and his two-decade career in the rough and tumble trenches of celebrity journalism.  James Aylott was previously a Hollywood paparazzo photographer and staffer at an American supermarket tabloid. This is the author’s first work of fiction, although he was often creative in his career of entertainment newsgathering and hated letting the truth interfere with a good story. A prior resident of Berkeley, California, he is currently embedded in St. Louis, Missouri researching his follow-up novel: Tales of Whiskey Tango from Misery Towers. 1st Place Winner at the Midwestern Book Awards (MIPA) Gold Medal Winner at the Royal Palm Literary Awards (Florida Writer's Association) Honorable mention at the 2020 Readers Favorite Book Awards.",
  "genres": [],
  "author": "James Aylott",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/45037430-tales-from-the-beach-house"
}