{
  "title": "The Origin of Species",
  "description": "The crater held a circle of stars above them as if they were closed up in a snow globe, a private cosmos. He thought of Darwin sleeping out on the pampas during his Beagle trip, a middle-class white kid traveling the world, the first of the backpackers. It was only afterwards, really, that he had made any sense of what he had seen. Alex wondered what, in the fullness of time, he himself would make sense of, what small, crucial detail might be lodging itself in his brain that would shake his life to its foundations. (p 286)Montreal during the turbulent mid-1980’s: Chernobyl has set geiger counters thrumming across the globe, HIV/AIDS is cutting a deadly swath through the gay population worldwide, and locally, tempers are flaring over the language laws of Bill 101. Hiding out in a seedy apartment near the Concordia campus is Alex Fratarcangeli (“Don’t worry… I can’t even pronounce it myself”), a somewhat oafish 30-something grad student. Though tender and generous at heart, Alex leads a life devoid of healthy relationships, ashamed in particular of the damage he has done to the women with whom he has been romantically entangled. Plagued by the sensation that his entire life is a fraud, Alex attends daily sessions with a lackluster psychoanalyst in an attempt to shake off the demon of depression (and the cigarette-tinged voice of Peter Gzowski in his ear). Scarred by a distant father and a dangerous relationship with his ex Liz, and consumed by a floundering dissertation linking Darwin’s theory of evolution with the history of human narrative, Alex has come to view love and other human emotions as “evolutionary surplus, haphazard neural responses that nature had latched onto for its own insidious purposes.” Then a convergence of brave souls enter Alex’s life, forcing him to recognize the possibility of meaningful connections. There is his neighbour Esther, whose multiple sclerosis is progressing rapidly, yet who gamely attacks every day she has left. There is the elegant Félix, an older gay man whose own health status is in question yet who remains resolutely generous,and María, returning to fight for human rights in her native El Salvador, knowing she will face certain peril. Along the way Alex meets others whose struggles with their own demons are not so successful, and sometimes tragic. When he receives a letter from Ingrid, the beautiful woman he knew years ago in Sweden, notifying him of the existence of his five year old son. Alex is gripped by a paralytic terror.Whenever Alex’s thoughts grow darkest, he is compelled to recall Desmond, the British professor with dubious credentials whom he met years ago in the Galapagos. Treacherous and despicable, wearing his ignominy like his rumpled jacket, Desmond nonetheless caught Alex in his thrall and led him to some life-altering truths during their weeks exploring Darwin’s islands together. It is only now that Alex can begin to comprehend these unlikely life lessons, and see a glimmer of hope shining through what he had thought was meaninglessness.Funny, poignant and visceral, Nino Ricci’s most recent masterpiece The Origin of Species will remind you of the wonder of life, the beauty of existence and the great gift that is our connection to the universe and all that is.",
  "genres": [
    "Fiction",
    "Canada",
    "Literary Fiction",
    "Contemporary",
    "Novels",
    "Unfinished",
    "Literature"
  ],
  "author": "Nino Ricci",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/4503300-the-origin-of-species"
}