{
  "title": "Rebirding: Rewilding Britain and its Birds",
  "description": "Rebirding takes the long view of Britain’s wildlife decline, from the early taming of our landscape and its long-lost elephants and rhinos, to fenland drainage, the removal of cornerstone species such as wild cattle, horses, beavers and boar – and forward in time to the intensification of our modern landscapes and the collapse of invertebrate populations.It looks at key reasons why species are vanishing, as our landscapes become ever more tamed and less diverse, with wildlife trapped in tiny pockets of habitat. It explores how Britain has, uniquely, relied on modifying farmland, rather than restoring ecosystems, in a failing attempt to halt wildlife decline.  The irony is that 94% of Britain is not built upon at all. And with more nature-loving voices than any European country, we should in fact have the best, not the most impoverished, wildlife on our continent.  Especially when the rural economics of our game estates, and upland farms, are among the worst in Europe.Britain is blessed with all the space it needs for an epic wildlife recovery. The deer estates of the Scottish Highlands are twice the size of Yellowstone National Park. Snowdonia is larger than the Maasai Mara. The problem in Britain is not a lack of space. It is that our precious space is uniquely wasted – not only for wildlife, but for people’s jobs and rural futures too.Rebirding maps out how we might finally turn things around: rewilding our national parks, restoring natural ecosystems and allowing our wildlife a far richer future.  In doing so, an entirely new sector of rural jobs would be created; finally bringing Britain’s dying rural landscapes and failing economies back to life.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Birds",
    "Ecology",
    "Environment",
    "Science",
    "Natural History"
  ],
  "author": "Benedict Macdonald",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/45035612-rebirding"
}