{
  "title": "The Worst Wedding Date",
  "description": "He’s a tattooed shirtless bad boy. My best friend’s brother. And the jerk on the other side of my bed.I didn’t know bridesmaid was code for babysitter for the bride’s brother , but if that’s what my best friend needs of me for her dream wedding to go off without a hitch, that’s what I’ll do.Even if Theo Monroe has been a pain in my rear since third grade.Even if he should be responsible enough to not wreak havoc at his sister’s destination wedding.Even if it means we have to share a hotel room in Hawaii, which might be the final duty that breaks me.Not only does Theo know exactly how to push my buttons, but he never wears clothes, he’s hiding a litter of kittens in his room, and he keeps showing up with fresh-baked cookies that seemingly come from nowhere.Also?I have no idea what’s up with the tension between him and the groom.Or why he’s so proud of the world’s strangest wedding gift.Or why I suddenly want to know what makes him tick. The story behind his tattoos. How he can afford to rent a convertible in Hawaii. And if maybe all of that utter frustration and irritation I’ve felt for him for years is suppressed attraction that a good girl like me isn’t supposed to feel for the biggest bad boy of Snaggletooth Creek.But I do know one thing.When I find out his biggest secret and the answer to all of my questions, it will change everything .The Worst Wedding Date is a frolicking good time of a destination wedding enemies-to-lovers romcom, complete with a good girl bridesmaid, her best friend’s troublemaking but secretly big-hearted brother, and more than one hitch on the way to happily ever after. It stands alone, has no cheating, and comes complete with ooey gooey goodness.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary",
    "Contemporary Romance",
    "Forced Proximity",
    "Audiobook",
    "Adult"
  ],
  "author": "Pippa Grant",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/124197923-the-worst-wedding-date"
}