{
  "title": "What God Is Honored Here?: Writings on Miscarriage and Infant Loss by and for Native Women and Women of Color",
  "description": "Native women and women of color poignantly share their pain, revelations, and hope after experiencing the traumas of miscarriage and infant loss  What God Is Honored Here? is the first book of its kind—and urgently necessary. This is a literary collection of voices of Indigenous women and women of color who have undergone miscarriage and infant loss, experiences that disproportionately affect women who have often been cast toward the margins in the United States of America.  From the story of dashed cultural expectations in an interracial marriage to poems that speak of loss across generations, from harrowing accounts of misdiagnoses, ectopic pregnancies, and late-term stillbirths to the poignant chronicles of miscarriages and mysterious infant deaths, What God Is Honored Here? brings women together to speak to one another about the traumas and tragedies of womanhood. In its heartbreaking beauty, this book offers an integral perspective on how culture and religion, spirit and body, unite in the reproductive lives of women of color and Indigenous women as they bear witness to loss, search for what is not there, and claim for themselves and others their fundamental humanity. Powerfully and with brutal honesty, they write about what it means to reclaim life in the face of death. Editors Shannon Gibney and Kao Kalia Yang acknowledge “who we had been could not have prepared us for who we would become in the wake of these words,” yet the writings collected here offer insight, comfort, and, finally, hope for all those who, like the women gathered here, have found grief a lonely place. Jennifer Baker, Michelle Borok, Lucille Clifton, Sidney Clifton, Taiyon J. Coleman, Arfah Daud, Rona Fernandez, Sarah Agaton Howes, Honorée Fanonne Jeffers, Soniah Kamal, Diana Le-Cabrera, Janet Lee-Ortiz, Maria Elena Mahler, Chue Moua, Jami Nakamura Lin, Jen Palmares Meadows, Dania Rajendra, Marcie Rendon, Seema Reza, 신 선 영 Sun Yung Shin, Kari Smalkoski, Catherine R. Squires, Elsa Valmidiano.",
  "genres": [
    "Nonfiction",
    "Grief",
    "Memoir",
    "Anthologies",
    "Indigenous",
    "Feminism",
    "Race"
  ],
  "author": "Shannon Gibney",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/45038313-what-god-is-honored-here"
}