{
  "title": "Light Changes Everything",
  "description": "“I adored stepping back into to the world of the Prines through tough-as-rawhide Mary Pearl. Light Changes Everything is a novel as gritty and authentic as the women of the Arizona Territory. Nancy E. Turner brings the west and its people fully to life.” –Lisa Wingate, #1 New York Times bestselling author of Before We Were Yours Bestselling author Nancy E. Turner returns to the world of Sarah Agnes Prine through the wide-eyes of her irrepressible young niece, Mary Pearl.It’s the summer of 1907 and the sun is scorching down on Mary Pearl in the Arizona Territory. Mary Pearl and her sister Esther take their minds off the heat by sneaking banned Jane Austen novels from Aunt Sarah Elliot’s lively bookshelf. Whispered read alouds preoccupy their nights, and reveries of getting hitched to their own Mr. Darcy à la Pride and Prejudice swirl through their day dreams.In walks old-fashioned old-money suitor Aubrey Hanna, here to whisk seventeen year old Mary Pearl off her feet with a forbidden kiss and hasty engagement. With the promise of high society outings and a rich estate, Aubrey’s lustful courtship quickly creates petty tension among the three generations of Prine women.As autumn approaches all too quickly, Mary Pearl’s Wheaton College acceptance counters quick marriage preparations. Days of travel by horse and by train carry her deep into a sophisticated new world of Northern girls’ schooling. Seeking friendship but finding foes, Mary Pearl not only learns how to write, read, and draw, but also how to act, dress, and be a woman.Light Changes Everything is the story of a resilient young feminist a century ahead of her time. Full of gumption and spirit, Mary Pearl’s evocative coming of age is destined to be the next American classic.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Westerns",
    "Book Club",
    "Adult"
  ],
  "author": "Nancy E. Turner",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/45046531-light-changes-everything"
}