{
  "title": "The World by Design: The Story of a Global Architecture Firm",
  "description": "\"Name any city that has seen explosive growth in the past century—Tokyo, Hong Kong, Shanghai, Singapore, Jakarta, Bangkok, Seoul, Kuala Lumpur—and he's had a hand in the making of its skyline. Name any 'old world' financial metropolis—New York, London, Frankfurt—and he's had a hand in designing its skyline, too.” ( Juan Sebastian Pinto for Forbes.com)In a series of fascinating tales, Gene Kohn explains how he helped build one of the most successful architecture firms in the world, offering inspiring lessons on business leadership and design innovation that can be applied to many fields.Founded on July 4, 1976, Kohn Pedersen Fox quickly became a darling of the architectural press with groundbreaking buildings such as the headquarters for the American Broadcasting Company (ABC) on Manhattan’s Upper West Side, 333 Wacker Drive in Chicago, the Procter & Gamble headquarters in Cincinnati, and the World Bank Headquarters in Washington, DC.By the early 1990s, when most architecture firms in the U.S. were struggling to survive a major recession, KPF was busy with significant buildings in London, Germany, Canada, Japan, Korea, and Indonesia—pioneering a model of global practice that has influenced architecture, design, and creative-services firms ever since. Like any other business, though, KPF has stumbled along the way and wrestled with crises. But through it all, it has remained innovative in a field that changes all the time and often favors the newest star on the horizon.Now in its fifth decade, the firm has shaped skylines and cities around the world with iconic buildings such as the World Financial Center in Shanghai, Roppongi Hills in Tokyo, the International Commerce Centre in Hong Kong, the DZ Bank Tower in Frankfurt, the Heron Tower in London, and Hudson Yards in New York.Forthright and engaging, Kohn examines both award-winning achievements and missteps in his 50-year career in architecture. In the process, he shows how his firm, KPF, has helped change the buildings and cities where we live, work, learn, and play.",
  "genres": [
    "Architecture",
    "Nonfiction",
    "Business",
    "Design"
  ],
  "author": "A. Eugene Kohn",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/45045892-the-world-by-design"
}