{
  "title": "Soil Not Oil: Environmental Justice in an Age of Climate Crisis",
  "description": "With Soil Not Oil, Vandana Shiva connects the dots between industrial agriculture and climate change. Shiva shows that a world beyond dependence on fossil fuels and globalization is both possible and necessary.Condemning industrial agriculture as a recipe for ecological and economic disaster, Shiva’s champion is the small, independent farm: their greater productivity, their greater potential for social justice as they put more resources into the hands of the poor, and the biodiversity that is inherent to the traditional farming practiced in small-scale agriculture. What we need most in a time of changing climates and millions hungry, she argues, is sustainable, biologically diverse farms that are more resistant to disease, drought, and flood. In her trademark style, she draws solutions to our world’s most pressing problems on the head of a pin: “The solution to climate change,” she observes, “and the solution to poverty are the same.”Using Shiva’s organization Navdanya—praised by Barbara Kingsolver as “a small, green Eden framed against the startling blue backdrop of the Himalayas”—as a model, Soil Not Oil lays out principles for feeding the planet that are socially just and environmentally sound. Shiva then expands her analysis to broader issues of globalization and climate change, arguing that a healthy environment and a just world go hand in hand. Unwavering and truly visionary, Soil Not Oil proposes a solution based on self-organization, sustainability, and community rather than corporate power and profits.A world-renowned environmental leader and thinker, Vandana Shiva is the author of many books, including Earth Democracy, Water Wars, and Staying Alive. She is the editor of Manifestos on the Future of Food and Seed.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Politics",
    "Ecology",
    "Climate Change",
    "Food",
    "Science"
  ],
  "author": "Vandana Shiva",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/4503959-soil-not-oil"
}