{
  "title": "One Degree Revolution: How Small Shifts Can Lead to Big Changes",
  "description": "Innovative, accessible, and easily implemented, One Degree Revolution is acclaimed yoga educator and leadership coach Coby Kozlowski's holistic program for self-inquiry and personal transformation. Her philosophy is deeply connected to living yoga--not just doing yoga. In fact, readers don't need to have ever attended a yoga class to dive into this book: her thoughtful teachings are for anybody interested in learning to navigate the waves of life more skillfully and gracefully.Imagine sailing a boat with a course set for a lifetime. If that route changes by just one navigational degree, what would happen to the journey? How far from the original trajectory would we be in one year? Five years? Ten years? Twenty years? Well, we would end up in a totally different place. In much the same way, we can change the course of our life by making a one degree shift. In other words, we don't have to change everything about ourselves or our world to make a difference.Coby inspires readers to dig deep, to ask powerful questions and to dive into the insights, experiments, and inquiries of living yoga: how can I best be with life? How can the teachings of yoga direct us to see the most aligned choices, let go of past hurts, and discover deep and meaningful connections? And what are the most skillful ways we can learn to savor all that life presents? These yoga philosophies are infused with practical strategies for creating the life you truly want and having a positive impact on the world.One Degree Revolution will guide readers to: -access infinite personal possibilities-celebrate their authentic selves and start listening to their calling-find meaning and purpose-learn to let go and trust the unfolding of life-value taking a pause and making a fresh start when needed-challenge long-held beliefs and foster transformational change-get comfortable with being uncomfortable, and-develop their communityOne degree at a time.",
  "genres": [
    "Nonfiction",
    "Spirituality",
    "Business",
    "Self Help"
  ],
  "author": "Coby Kozlowski",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/45046818-one-degree-revolution"
}