{
  "title": "The Myth of Chinese Capitalism: The Worker, the Factory, and the Future of the World",
  "description": "The untold story of how restrictive policies are preventing China from becoming the world’s largest economyDexter Roberts lived in Beijing for two decades working as a reporter on economics, business and politics for Bloomberg Businessweek . In The Myth of Chinese Capitalism , Roberts explores the reality behind today’s financially-ascendant China and pulls the curtain back on how the Chinese manufacturing machine is actually powered.He focuses on two the village of Binghuacun in the province of Guizhou, one of China’s poorest regions that sends the highest proportion of its youth away to become migrants; and Dongguan, China’s most infamous factory town located in Guangdong, home to both the largest number of migrant workers and the country’s biggest manufacturing base. Within these two towns and the people that move between them, Roberts focuses on the story of the Mo family, former farmers-turned-migrant-workers who are struggling to make a living in a fast-changing country that relegates one-half of its people to second-class status via household registration, land tenure policies and inequality in education and health care systems.In The Myth of Chinese Capitalism , Dexter Roberts brings to life the problems that China and its people face today as they attempt to overcome a divisive system that poses a serious challenge to the country’s future development. In so doing, Roberts paints a boot-on-the-ground cautionary picture of China for a world now held in its financial thrall.Dexter Roberts is an award-winning journalist and a regular commentator on the U.S.-China trade and political relationship. His prior speaking engagements include traditional news media outlets (NPR, Fox News, CNN International) as well as universities and institutes (George Washington University, Council on Foreign Relations, and the Overseas Press Club).He is available for virtual classroom visits to courses that adopt The Myth of Chinese Capitalism. Please contact academic@macmillan.com for more information.",
  "genres": [
    "China",
    "Economics",
    "Nonfiction",
    "Politics",
    "Business",
    "Asia",
    "History"
  ],
  "author": "Dexter Tiff Roberts",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/45046730-the-myth-of-chinese-capitalism"
}