{
  "title": "The Last Voyage of the Andrea Doria: The Sinking of the World's Most Glamorous Ship",
  "description": "In the tradition of Erik Larson's Dead Wake comes The Last Voyage of the Andrea Doria , about the sinking of the glamorous Italian ocean liner, including never-before-seen photos of the wreck today.In 1956, a stunned world watched as the famous Italian ocean liner Andrea Doria sank after being struck by a Swedish vessel off the coast of Nantucket. Unlike the tragedy of the Titanic , this sinking played out in real time across radios and televisions, the first disaster of the modern age. Audiences witnessed everything that ensued after the unthinkable collision of two modern vessels equipped with radar: perilous hours of uncertainty; the heroic rescue of passengers; and the final gasp as the pride of the Italian fleet slipped beneath the Atlantic, taking some fifty lives with her. Her loss signaled the end of the golden age of ocean liner travel.Now, Greg King and Penny Wilson offer a fresh look at this legendary liner and her tragic fate. Andrea Doria represented the romance of travel, the possibility of new lives in the new world, and the glamour of 1950s art, culture, and life. Set against a glorious backdrop of celebrity and La Dolce Vita, Andrea Doria 's last voyage comes vividly to life in a narrative tightly focused on her passengers – Cary Grant's wife; Philadelphia's flamboyant mayor; the heiress to the Marshall Field fortune; and many brave Italian emigrants – who found themselves plunged into a desperate struggle to survive. The Last Voyage of the Andrea Doria follows the effect this trauma had on their lives, and brings the story up-to-date with the latest expeditions to the wreck.Drawing on in-depth research, interviews with survivors, and never-before-seen photos of the wreck as it is today, The Last Voyage of the Andrea Doria is a vibrant story of fatal errors, shattered lives, and the triumph of the human spirit.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Adventure",
    "World History",
    "Maritime",
    "Memoir"
  ],
  "author": "Greg King",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/45046696-the-last-voyage-of-the-andrea-doria"
}