{
  "title": "The Complete Sagas of Icelanders, including 49 Tales",
  "description": "The Sagas of Icelanders are forty narratives of adventure and conflict, set in the Viking Age but written down in the vernacular by anonymous authors in Iceland several hundred years later, during the 13th and 14th centuries. Their action spans the whole world known to the Vikings, but the stories mainly center on the unique society they founded in Icleand, depicting the men and women who settled there and their descendants. For sheer narrative artistry and skill of characterization, the fiest Sagas rank with the world's greatest literary treasuresas epic as Homer, as deep in tragedy as Sophocles, as engagingly human as Shakespeare. The Sagas of the Icelanders form a unique literary genre and have served as a source of inspiration for many outstanding writers of later timessuch diverse authors as Walter Scott, Jorge Lius Borges and W.H. Auden.Deeply rooted in the real world of their day, concise and straightforward in style, the Sagas explore perennial human problems and conflucts: love and hate, fate and freedom, honor and feud, crime and punishment, travel and exile. In saga narrative we may identify the budding of a literary technique that, centuries later, would develop into the great European novel. While steeped in the spirit of Viking age oral tradition, the Sagas tell of the lives and deeds of Icelanders during the decades immediately before and after the year 1000, when they abandoned the Germanic gods such as Odin and Thor and adopted Christianity. In this period, too, Icelanders ventured farther westwards, to explore and settle Greenland; the culmination of this venture was Leif Eiriksson's voyage to North America.Despite their traditional origins, the Sagas are first and foremost works of consciously created literary art. They are also, in a sense, frontier literature, in which the descendants of settlers reflect on their writers, the origins, identity, legends and myths, whilst grappling with troublesome contemporary realitites, not least a 13th century civil war. For the saga writers, the settlement period was something of a Golden Age, the era of a unique commonwealth of free chieftains with no king, dominated by Viking traditions of honor and blood vengeance.The Sagas of the Icelanders are not typical heroic literature, but rather stories of flesh-and-blood humans burdened with a heroic legacy. These were steely-minded men and domineering women in search of worldly wealth and power, fame and love. Typically, a feud could start with a minor slight to a man's honor and escalate into a chain of revenge and counter-revenge, culminating in a major battle or in the heroic death of a great champion. For the modern Saga reader, it is the psychological intensity and depth of the characters as much as the codes of honor and ethics which capture the imagination. And though strong men dominate teh Saga stage, it is often clever and beautiful women who manipulate the course of events behind the scenes and outspokenly voice their opinions on the players involved in it.The horizons of the saga writers extended to the limits of the Viking world: westward to Greenland and Vinland, east to Russia and north to Lappland, south and east to Constantinople and Jerusalem. Iclenaders and other Vikings sailed to the shores of Ireland, upriver to the cities of Rouen and London, all along the Baltic coast. Everywhere we see that the world lies at the feet of saga heroes: witty poets become the companions of kings and earls, fierce and successful fighters never lack the attentions of noble ladies. But though these champions reign victorious on foreign shores they almost always turn their backs on the honors heaped upon them, in order to return home to their Icelandic farms nestled under towering mountains in lonly fjords and valleys.If the Sagas can be compared to novels, the Tales are the medieval equivalent of short stories. Their narrative may have a smaller scale, but there is no loss of dramatic force, humor or deftness of character protrayal. Preserved either as independent narratives or as parts of larger works, most Tales tell of young Icelanders journeying abroad where they have a variety of encounters with men of power and influence. Their journeys represent a kind of rite of passage which tests the mettle of a potential hero. Tales range from brief anecdotes, sketched with a few masterful narrative strokes and terse dialogue, to light-hearted comedies in which royalty is gently mocked.In The Complete Sagas of the Icelanders, the Sagas and Tales have been grouped on broad thematic principles and divided accordingly among the five volumes of the set. Although overlapping is inevitable in a genre of such diversity, a central distinction can be established between Biogrpahies and Sagas of Feuds. The Biographies tell of exceptional individualspoets, outlaws and championsand the stories spotlight these \"odd men out\" as they pit their strength against a society they stand out from and defy. At the heart of the Sagas of Feuds are wealth, power, regional status, and the inevitable conflicts that result from life in a singular society which sets its own laws and metes out a hard justice. Each of the five volumes, then, is thematically self-contained and offers a particular angle of approach for exploring and navigating the vast and fascinating world of the sagas.",
  "genres": [
    "Mythology",
    "Fiction",
    "Literature"
  ],
  "author": "Viðar Hreinsson",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/102538.The_Complete_Sagas_of_Icelanders_including_49_Tales"
}