{
  "title": "The Founding Fortunes: How the Wealthy Paid for and Profited from America's Revolution",
  "description": "In The Founding Fortunes , h istorian Tom Shachtman reveals the ways in which a dozen notable Revolutionaries deeply affected the finances and birth of the new country while making and losing their fortunes.While history teaches that successful revolutions depend on participation by the common man, the establishment of a stable and independent United States first required wealthy colonials uniting to disrupt the very system that had enriched them, and then funding a very long war. While some fortunes were made during the war at the expense of the poor, many of the wealthy embraced the goal of obtaining for their poorer countrymen an unprecedented equality of opportunity, along with independence.In addition to nuanced views of the well-known wealthy such as Robert Morris and John Hancock, and of the less wealthy but influential Alexander Hamilton, The Founding Fortunes offers insight into the contributions of those often overlooked by popular Henry Laurens, the plantation owner who replaced Hancock as President of Congress; pioneering businessmen William Bingham, Jeremiah Wadsworth, and Stephen Girard; privateer magnate Elias Hasket Derby; and Hamilton’s successors at Treasury, Oliver Wolcott, Jr. and Albert Gallatin.The Founders dealt with tariffs, taxes on the wealthy, the national debt, regional disparities, the census as it affected finances, and how much of what America needs should be manufactured at home in ways that remain startlingly relevant. Revelatory and insightful, The Founding Fortunes provides a riveting history of economic patriotism that still resonates today.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography",
    "American Revolution",
    "Military History",
    "American"
  ],
  "author": "Tom Shachtman",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/45046797-the-founding-fortunes"
}