{
  "title": "Reconnecting to The Source: The New Science of Spiritual Experience, How It Can Change You, and How It Can Transform the World",
  "description": "Renowned authority on science and philosophy Dr. Ervin Laszlo explores the implications of the new quantum sciences to move beyond the of limits of reality as we know it--and find our way again in our \"in-formed,\" purposively evolving universe.Reconnecting to the Source is a powerful new book on the science of spiritual experience by Dr. Ervin Laszlo. A well-known figure in the fields of new science, consciousness, and spirituality, Dr. Laszlo has inspired some of today's most important figures in science and philosophy. In Reconnecting to the Source he unpacks the science behind spiritual experience, investigating the ways in which we can access realms of experience beyond the everyday. It is in these moments, when our conscious minds are in contact or perhaps even overridden by our unconscious selves, that we can explore the depths of spiritual meaning.In addition to a foreword by Deepak Chopra, the book includes new, never before published contributions from a long list of well-known writers and public figures--including Jane Goodall, Barbara Marx Hubbard, Zhi-Gang Sha, Gregg Braden, and many more. Each contributor has written about a unique spiritual experience of their own, sharing moments in their lives that are outside of the boundaries of the usual and reflecting on the importance of these moments.This revolutionary and powerful book will challenge you to reconsider the boundaries of our own experience and change how we look at the world around us. It is a unique, never before available resource for people who want to know how they can consciously align with the forces and \"attractors\" that governs the universe, and brought us, living, conscious people on the scene in the great processes of evolution that unfold here on Earth.",
  "genres": [
    "Spirituality",
    "Science",
    "Audiobook",
    "Nonfiction"
  ],
  "author": "Ervin Laszlo",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/45046718-reconnecting-to-the-source"
}