{
  "title": "The Unexpected Spy: From the CIA to the FBI, My Secret Life Taking Down Some of the World's Most Notorious Terrorists",
  "description": "A highly entertaining account of a young woman who went straight from her college sorority to the CIA, where she hunted terrorists and WMDs\"A thrilling tale...Walder’s fast-paced and intense narrative opens a window into life in two of America’s major intelligence agencies.\" (Publishers Weekly, starred review) When Tracy Walder enrolled at the University of Southern California, she never thought that one day she would offer her pink beanbag chair in the Delta Gamma house to a CIA recruiter, or that she’d fly to the Middle East under an alias identity.The Unexpected Spy is the riveting story of Walder's tenure in the CIA and, later, the FBI. In high-security, steel-walled rooms in Virginia, Walder watched al-Qaeda members with drones as President Bush looked over her shoulder and CIA Director George Tenet brought her donuts. She tracked chemical terrorists and searched the world for weapons of mass destruction. She created a chemical terror chart that someone in the White House altered to convey information she did not have or believe, leading to the Iraq invasion. Driven to stop terrorism, Walder debriefed terrorists - men who swore they’d never speak to a woman - until they gave her leads. She followed trails through North Africa, Europe, and the Middle East, shutting down multiple chemical attacks. Then Walder moved to the FBI, where she worked in counterintelligence. In a single year, she helped take down one of the most notorious foreign spies ever caught on American soil. Catching the bad guys wasn’t a problem in the FBI, but rampant sexism was. Walder left the FBI to teach young women, encouraging them to find a place in the FBI, CIA, State Department or the Senate - and thus change the world. Length: 8 hrs and 10 mins",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Espionage",
    "Politics",
    "History"
  ],
  "author": "Tracy Walder",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/45046678-the-unexpected-spy"
}