{
  "title": "Let the People Pick the President: The Case for Abolishing the Electoral College",
  "description": "\"The Electoral College is a disaster for a democracy.\" —Donald TrumpThe framers of the Constitution battled over it. Lawmakers have tried to amend or abolish it more than 700 times. To this day, millions of voters, and even members of Congress, misunderstand how it works. It deepens our national divide and distorts the core democratic principles of political equality and majority rule. How can we tolerate the Electoral College when every vote does not count the same, and the candidate who gets the most votes can lose?Twice in the last five elections, the Electoral College has overridden the popular vote, calling the integrity of the entire system into question—and creating a false picture of a country divided into bright red and blue blocks when in fact we are purple from coast to coast. Even when the popular-vote winner becomes president, tens of millions of Americans—Republicans and Democrats alike—find that their votes didn't matter. And, with statewide winner-take-all rules, only a handful of battleground states ultimately decide who will become president.Now, as political passions reach a boiling point at the dawn of the 2020 race, the message from the American people is clear: The way we vote for the only official whose job it is to represent all Americans is neither fair nor just. Major reform is needed—now. Isn't it time to let the people pick the president?In this thoroughly researched and engaging call to arms, Supreme Court journalist and New York Times editorial board member Jesse Wegman draws upon the history of the founding era, as well as information gleaned from campaign managers, field directors, and other officials from twenty-first-century Democratic and Republican presidential campaigns, to make a powerful case for abolishing the antiquated and antidemocratic Electoral College. In Let the People Pick the President he shows how we can at long last make every vote in the United States count—and restore belief in our democratic system.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Audiobook",
    "American History",
    "Social Justice",
    "Political Science"
  ],
  "author": "Jesse Wegman",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/45046725-let-the-people-pick-the-president"
}