{
  "title": "Getting Started with English Language Learners: How Educators Can Meet the Challenge",
  "description": "\"It's been six months, and I STILL can't get my English language learners to participate in class!\" \"How can I help my newcomers feel more comfortable around other students?\" \"Am I doing enough to help my English language learners succeed?\" Have you had these thoughts? Take heart, you are not alone. As schools and districts swell with growing numbers of English language learners, and as administrators and teachers wrestle with federal guidelines for educating these students, many educators are faced with these same challenges and much more. To meet these challenges, it is imperative for educators to learn about and use the theories and teaching strategies that will help English language learners succeed in the classroom. In Getting Started with English Language Learners: How Educators Can Meet the Challenge , Judie Haynes provides a practical resource to help educators who are new to the field of English as a Second Language understand the needs of English language learners. From learning how students acquire a second language to differentiating instruction to exploring practical strategies for teaching newcomers, this book will help educators learn how to create effective learning environments for English language learners. Real-life scenarios from actual classrooms are presented throughout the book. The book also includes a brief overview of different types of ESL programs used in the United States and a helpful glossary of common ESL terminology. New teachers, veteran educators working with English language learners for the first time, and administrators can all use this book to increase their knowledge, improve their practice, and, most importantly, effectively educate and inspire English language learners.",
  "genres": [
    "Teaching",
    "Nonfiction",
    "Education"
  ],
  "author": "Judie Haynes",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/451246.Getting_Started_with_English_Language_Learners"
}