{
  "title": "Shaman's Crossing",
  "description": "Nevare Burvelle is the second son of a second son, destined from birth to carry a sword. The wealthy young noble will follow his father—newly made a lord by the King of Gernia—into the cavalry, training in the military arts at the elite King's Cavella Academy in the capital city of Old Thares. Bright and well-educated, an excellent horseman with an advantageous engagement, Nevare's future appears golden. But as his Academy instruction progresses, Nevare begins to realize that the road before him is far from straight. The old aristocracy looks down on him as the son of a \"new noble\" and, unprepared for the political and social maneuvering of the deeply competitive school and city, the young man finds himself entangled in a web of injustice, discrimination, and foul play. In addition, he is disquieted by his unconventional girl-cousin Epiny—who challenges his heretofore unwavering world view—and by the bizarre dreams that haunt his nights. For twenty years the King's cavalry has pushed across the grasslands, subduing and settling its nomads and claiming the territory in Gernia's name. Now they have driven as far as the Barrier Mountains, home to the Speck people, a quiet, forest-dwelling folk who retain the last vestiges of magic in a world that is rapidly becoming modernized. From childhood Nevare has been taught that the Specks are a primitive people to be pitied for their backward ways—and feared for their indigenous diseases, including the deadly Speck plague, which has ravaged the frontier towns and military outposts. The Dark Evening brings the carnival to Old Thares, and with it an unknown magic, and the first Specks Nevare has ever seen . . .",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Audiobook",
    "Magic"
  ],
  "author": "Robin Hobb",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/45111.Shaman_s_Crossing"
}