{
  "title": "Fauci: The Bernie Madoff of Science and the HIV Ponzi Scheme that Concealed the Chronic Fatigue Syndrome Epidemic",
  "description": "This was the first book, the very first, to issue a warning about the biggest crisis in science and public health. The author began sounding the alarm as a newspaper publisher in the 80s. Robert F. Kennedy Jr. brought the book to the world's attention when he recommended it to his 600,000 followers on his Instagram account in April, 2020. America is now listening.This little book is a chapter from The Chronic Fatigue Syndrome Epidemic Cover-up Volume Two, a book that combines the history of AIDS and Chronic Fatigue Syndrome with a trenchant political analysis of the science and scientists that got everything terribly wrong.,In his bestseller, The Real Anthony Fauci , Robert F. Kennedy Jr. called Charles Ortleb, \"Dr. Fauci's perennial Boswell.\" As the publisher and editor-in-chief of New York Native , he was the first person to devote a newspaper to the coverage of AIDS, Chronic Fatigue Syndrome, and the careers of Robert Gallo and Anthony Fauci. Randy Shilts praised his newspaper's pioneering AIDS reporting in And the Band Played On . In Rolling Stone , David Black said New York Native deserved a Pulitzer Prize for its coverage of the epidemic.This book is the first book to conceptualize the medical and scientific corruption of the last four decades as a medical and scientific Ponzi scheme. It is a radical new way of looking at medical and scientific fraud that has been promoted and enabled for decades. These are ten elements that the author has identified in a medical and scientific Ponzi scheme that have hidden the Chronic Fatigue Syndrome 1. Nosological fraud. (That’s the branch of medicine dealing with the classification of disease. It is ground zero for public health fraud.)2. Epidemiological fraud.3. Virological fraud.4. Treatment fraud. (Treatments that harm more than they heal or conceal more than they reveal.)5. Public health policy fraud.6. Concealment of negative scientific data and paradigm-challenging anomalies.7. Use of an elite network of \"old boys\" and pseudo-activist provocateurs to censor critics and whistleblowers.8. Chronic obscurantism.9. If necessary, vigilantism and witch-hunts against any intellectuals, scientists, or citizens who constitute any form of resistance to the medical and scientific Ponzi scheme.10. A subservient scientific press that is used as a conveyor belt for the medical and scientific Ponzi scheme's propaganda.",
  "genres": [
    "Health",
    "Politics",
    "Nonfiction"
  ],
  "author": "Charles Ortleb",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/45069570-fauci"
}