{
  "title": "The Censored War: American Visual Experience During World War Two",
  "description": "Early in World War II censors placed all photographs of dead and badly wounded Americans in a secret Pentagon file known to officials as the Chamber of Horrors. Later, as government leaders became concerned about public complacency brought on by Allied victories, they released some of these photographs of war's brutality. But to the war's end and after, they continued to censor photographs of mutilated or emotionally distressed American soldiers, of racial conflicts at American bases, and other visual evidence of disunity or disorder. In this book George H. Roeder, Jr., tells the intriguing story of how American opinions about World War II were manipulated both by the wartime images that citizens were allowed to see and by the images that were suppressed. His text is amplified by arresting visual essays that include many previously unpublished photographs from the army's censored files.Examining news photographs, movies, newsreels, posters, and advertisements, Roeder explores the different ways that civilian and military leaders used visual imagery to control the nation's perception of the war and to understate the war's complexities. He reveals how image makers tried to give minorities a sense of equal participation in the war while not alarming others who clung to the traditions of separate races, classes, and gender roles. He argues that the most pervasive feature of wartime visual imagery was its polarized depiction of the world as good or bad, and he discusses individuals―Margaret Bourke-White, Bill Mauldin, Elmer Davis, and others―who fought against these limitations. He shows that the polarized ways of viewing encouraged by World War II influenced American responses to political issues for decades to follow, particularly in the simplistic way that the Vietnam War was depicted by both official and antiwar forces.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "American History",
    "Photography"
  ],
  "author": "George Roeder",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/451390.The_Censored_War"
}