{
  "title": "How Rory Thorne Destroyed the Multiverse",
  "description": "Rory Thorne è una principessa, e nel giorno del suo battesimo ha ricevuto tredici doni dalle fate. Il più importante e controverso è un talento infallibile nel riconoscere l’adulazione e le bugie di chi la circonda. In qualità di primogenita, Rory si aspetta di ereditare il trono e regnare sul Consorzio Interplanetario di Thorne, ma poi il padre viene assassinato, la madre dà alla luce un figlio maschio e Rory viene inviata in un mondo lontano per convolare a nozze con il suo principe. Come se non bastasse, la ragazza scopre un infido complotto per spodestare il fidanzato e usurparne il un ministro senza scrupoli ha cospirato per divenire Reggente del giovane principe dall’aria poco sveglia. Così, Rory si ritrova al centro di un intrigo interplanetario, a poter contare unicamente sul suo ingegno e su una piccola squadra di alleati. Per fortuna, anche se ha solo sedici anni, ha già capito piuttosto bene la teoria del multiverso ed è stata istruita nell’ la scienza che manipola i principi matematici alla base di ogni cosa. Quindi, sa che tutto è possibile (se non probabile), persino tentare di battere il Reggente e salvare il principe.  A metà tra Bottondoro e la principessa Leila, Rory Thorne è la protagonista di una storia di formazione dal sapore nuovo, in cui basta la giusta dose di piccoli gesti di ribellione perché una damigella in pericolo possa salvarsi da sola, rovesciare un governo e persino cambiare il destino del multiverso. Il romanzo di Eason ha ricevuto recensioni entusiastiche da “School Library Journal”, “Kirkus”, e “Booklist” ed è stato inserito nelle liste “Best of” di “Bookish”, “Hey Alma” e del “Sci-Fi & Fantasy Blog” di Barnes & Noble’s.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Audiobook",
    "Space Opera",
    "Adult"
  ],
  "author": "K. Eason",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/45154546-how-rory-thorne-destroyed-the-multiverse"
}