{
  "title": "The Art of Falling In Love",
  "description": "Praise for The Art of Falling in \"An unforgettable summer romance with surprising depth. Brimming with family drama, young love, and a sand sculpting competition, this YA read should not be missed!\"-Kristin Smith, best-selling author of the Deception Game series\"Ripe with summer sun, ocean waves, and some lively competition, this sweet romance tugs at your heart, and its emotional twists hit you right in the gut. Through it all, you can't help rooting for this couple, despite all the obstacles, and relishing every heart-thumping moment as you fall in love along with them. YA romancers, get ready for a treat!\"-Brandy Woods Snow, author of YA contemporary romances MEANT TO BE BROKEN and AS MUCH AS I EVER COULDSeventeen-year-old Claire Haynes always spends summer vacation at her family's beach house in Florida, sketching and dreaming of art school with her biggest fan-her Opa. But when Opa dies right before summer break, all Claire has left besides her memories is a sand-sculpting contest application with her name on it and the lingering question of why Opa filled it out in the first place. Claire has never even made a decent sandcastle, but she reluctantly turns in the entry forms, hoping the contest will help her navigate the grieving process by honoring one of Opa's last wishes. When she meets Foster, a teenage boy with a talent for turning recyclables into abstract sculptures, the two join forces to win the contest and salvage the Summer of Art. They spend the humid summer days shoveling sand, devouring ice cream, and exploring Florida's art scene. Just like Opa, Foster understands Claire and her overwhelming need to create, but he has a secret that threatens to ruin he's homeless and hiding from an abusive brother who would have him believe family trumps all. When Claire's parents find out about Foster's homelessness, they offer him a home along with their hearts. But even picture-perfect families like Claire's can harbor an ugly side, especially in the aftermath of Opa's death. When someone close to Claire spills Foster's secret, they're both forced to choose between love and familial obligation. If Claire can't break through long-held beliefs and prove family is more than shared DNA, she could permanently lose Foster and a chance at the sand contest to honor Opa.",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary"
  ],
  "author": "Haleigh Wenger",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/45141735-the-art-of-falling-in-love"
}