{
  "title": "Ben Robertson: South Carolina Journalist and Author",
  "description": "In Ben South Carolina Journalist and Author , Jodie Peeler tells the story of a man consumed with a need to see the world but whose heart never really left home. Drawing heavily on Robertson's writings and personal papers, Peeler describes his active career as a journalist, which took him to Hawaii, Australia, Europe, Java, New York, and Washington, D.C.The early years of Robertson's career were spent as a reporter for the New York Herald-Tribune . After several years as a freelance writer, he became a World War II correspondent covering England for the New York newspaper PM . While Robertson's wartime dispatches drew attention and praise, they represented but one aspect of the man's wide-ranging works and career, for the Ben Robertson who witnessed destruction and heroism in the fires of London was also a proud son of South Carolina.In addition to his work as a journalist. Robertson wrote three books. Travelers' Rest , a fictionalized account of his ancestors' settling in South Carolina, ruffled southern feathers. In I Saw England he presents a firsthand account of the Battle of Britain and advocates for the United States to intervene in World War II. His heartfelt memoir, Red Hills and Cotton , which recalls his boyhood days in Pickens County and calls for the South to look to the future, became a southern classic. In 1943, while en route to his new job as London bureau chief for the New York Herald-Tribune , Robertson lost his life in a plane crash.Throughout his decidedly brief but adventurous life, Robertson never stopped being what one friend described as \"a sentimental South Carolinian who carried his dreams on the tip of his tongue.\" And over time he evolved into a progressive voice calling on the South to reevaluate its attitudes on race and economics. This is the story of that proud South Carolinian, from the dreams that propelled him around the world to the sentiment that always called him home.",
  "genres": [
    "History"
  ],
  "author": "Jodie Peeler",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/45145154-ben-robertson"
}