{
  "title": "Crazy for Loving You",
  "description": "Is there anything hotter than a growly, overprotective Marine cradling a baby? My melted ovaries don’t think so.When you work hard and have the bank account to prove it, you’re entitled to play hard. I’ve seen some crazy things. I’ve caused some crazy scenes. And there’s no shame in my game.But I’m still knocked off my stilettos when an insane chain of events leads to me inheriting a baby. The craziest part? The baby comes with a by-the-books, no-nonsense retired Marine who's so regimented that I wouldn't be surprised if he irons his boxer shorts.Parenting? Bring it on. I don’t need sleep—I once started my day with business meetings in Cairo and ended it three days later at a club in Melbourne. Changing diapers? Please. It can't be any more challenging than changing out of Spanx on the back of a moving motorcycle. Training the little guy to run the family’s real estate empire? He’ll be all our bosses by the time he’s four.But living with my new co-guardian? The gruff, muscled, tattooed former military man who manages to check all my boxes while trying to sneak under my skin?He needs to go.Because the longer he stays, the more layers he’s peeling off my heart.But love isn’t something that’s ever diluted my gene pool, and I like my life just fine without it. I have awesome friends, this adorable baby and an obscene amount of money. Who needs love?Turns out…maybe me.Crazy for Loving You is a larger-than life ride through accidental parenthood featuring a fun-loving billionaire playgirl, a crusty Marine with a gooey center, a horny dolphin, the world’s most obscene pool, and all the fun you’d expect from a world built by Lucy Score, Claire Kingsley, Kathryn Nolan, and Pippa Grant.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Humor",
    "Military Fiction",
    "Audiobook",
    "Fiction"
  ],
  "author": "Pippa Grant",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/45149049-crazy-for-loving-you"
}