{
  "title": "Marina",
  "description": "Quince años mas tarde, la memoria de aquel dia ha vuelto a mi. He visto a aquel muchacho vagando entre las brumas de la estacion de Francia y el nombre de Marina se ha encendido de nuevo como una herida fresca. Todos tenemos un secreto encerrado bajo llave en el atico del alma. este es el mio.En la Barcelona de 1980 Oscar Drai suena despierto, deslumbrado por los placeres mocernistas cercanos al internado en el que estudia. En una de sus escapadas conoce a Marina, una chica audaz que comparte con oscar la aventura de adentrarse en un enigma doloroso del pasado de la ciudad. Un misterioso personaje de la posguerra se propuso el mayor desafio imaginable, pero su ambicion lo arrastro por sendas siniestras cucyas consecuencias debe pagar alguien todavia hoy. -----------------------------------------------------------------------------------------------From the bestselling author of The Shadow of the Wind comes the intriguing mystery that started it all...\"We all have a secret buried under lock and key in the attic of our soul. This is mine.\"Fifteen-year-old Oscar Drai meets the strange Marina while he's exploring an old quarter of Barcelona. She leads Oscar to a cemetery, where they watch a macabre ritual that occurs on the last Sunday of each month. At exactly ten o'clock in the morning, a woman shrouded in a black velvet cloak descends from her carriage to place a single rose on an unmarked grave.When Oscar and Marina decide to follow her, they begin a journey that transports them to a forgotten postwar Barcelona--a world of aristocrats and actresses, inventors and tycoons--an reveals a dark secret that lies waiting in the mysterious labyrinth beneath the city streets.Carlos Ruiz Zafon's haunting Marina has long been a cult classic in Spain and is now an international bestseller.",
  "genres": [
    "Fiction",
    "Mystery",
    "Fantasy",
    "Young Adult",
    "Horror",
    "Gothic",
    "Historical Fiction"
  ],
  "author": "Carlos Ruiz Zafón",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/4516.Marina"
}