{
  "title": "True Haunting",
  "description": "This is the story of a true haunting. It was the first ever filmed and televised by NBC in 1971. A young couple purchases a building that was built and occupied by a single family that refused to relinquish their hold, even after death. Investigated and verified by experts, this residence brought chaos to the lives of those who chose to reside there. Unlike a horror novel, this chronicles what a real ghostly experience would resemble. Long before the laws of disclosure, a young couple winds up in the midst of strange occurrences prior to the term ‘paranormal’ becoming a common description.  Only a little known organization came to their aid. Author Tom Valentine, brought in a nationally known psychic, Joseph DeLouise, who then asked assistance of an exorcist from England, Reverend William Derl-Davis. Together, they gave their best effort at exorcising the multiple spirits inhabiting the building and disrupting the lives of the living. Events were filmed by NBC, who sent their most prominent Chicago journalist, Carole Simpson, to cover the event.  Follow a young couple with a newborn as they attempt to cope with inexplicable events, experience denial, plead for help from their Church, and step into the world of the paranormal. Understand why ghosts cannot be exorcised and a true example of their strong sense of domain, even after death. Learn what experts and gifted people did in a failed attempt to assist this desperate couple.  Learn many of the various manifestations that can be common in haunting. Ghosts can be seen and heard. They can propel objects and interrupt utilities. They can affect your moods and feed off of your emotions. They can appear as solid as you and me. They can react and become hostile if threatened or violated. There are certain subtle occurrences you may find the most frightening, because you just might relate and recognize them. If so, guess what? You may have a ghost!",
  "genres": [
    "Horror",
    "Paranormal",
    "Nonfiction",
    "Supernatural",
    "Memoir",
    "Ghosts"
  ],
  "author": "Edwin F. Becker",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/12424746-true-haunting"
}