{
  "title": "House of War",
  "description": "The brand-new thriller from the #1 bestseller.‘A gripping tale that will have you turning the pages well into the night’ MARK DAWSONA DEADLY TERROR PLOT. A RACE AGAINST THE CLOCK. WILL EVIL PREVAIL?Following a chance encounter with a terrified young woman in the streets of Paris, former SAS soldier Ben Hope finds himself hurled into a violent new mission involving murder, international terrorism and stolen historic artifacts. A mission made even more perilous by the reappearance of an old enemy from Ben’s military past. A man he knew and fought years ago. A man he thought was dead.Teaming up with the enigmatic ex-Delta Force warrior Tyler Roth, Ben travels from the seedy underworld of Paris to the islands of the Caribbean in his quest to piece together the puzzle.As the death toll quickly mounts, he unmasks a vicious terror plot that could bring about the slaughter of millions of innocent people. Mass destruction seems just a hair’s breadth away … and only Ben Hope can prevent the unthinkable.‘Thrilling. Scott Mariani is at the top of his game’ ANDY MCDERMOTT‘A high level of realism … the action scenes come thick and fast. Like the father of the modern thriller, Frederick Forsyth, Mariani has a knack for embedding his plots in the fears and preoccupations of their time’ SHOTS MAGAZINE‘House of War has it all – history, action, devious scheming and eye-opening detail. Mariani delivers a twisting storyline and raises the terrifying question: how would we survive if this really happened?’ DAVID LEADBEATERA gripping must-read for fans of the Jack Reacher and John Milton books.Whilst the Ben Hope thrillers can be read in any order, this is the twentieth book in the series.",
  "genres": [
    "Thriller",
    "Adventure",
    "Fiction",
    "Action",
    "Mystery Thriller",
    "Historical Fiction"
  ],
  "author": "Scott Mariani",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/45168998-house-of-war"
}