{
  "title": "The Karma Book Club",
  "description": "When did I truly fall in love with Logan? It all began with a banana costume and a princess dress. And I wore the banana suit! \n   Escape into the hilarious, feel-good rom-com that will leave you smiling until the very end. \n\"Kayley Wood mastered comedy romance in The Karma Book Club.\" - Jo Jo Maxson - 5 Stars\"This book had me laughing out loud, along with experiencing many heartfelt emotions throughout this grand slam of a story!\" - Chick Lit Café - 5 Stars“Phenomenal. I laughed a lot with this one.\" - that1girl - 5 Stars“I just want to gush on how much I loved The Karma book club by Kayley Wood... If you are a fan of R. S. Grey you definitely need to get it!” - Kari Valdez - 5 Stars\n   Sweet. Funny. Heartfelt. \nMia never felt the need to speak up for herself. Not with three protective sisters, an assertive boyfriend, and a bestie who has no problem stealing the attention for herself. With a nervous bladder (which strikes at the worst possible times) and a terrible fear of public speaking, Mia is comfortable with the way things are.That is, until she comes home to find her things packed by the door and faces the news that her boyfriend and best friend have fallen in love.Now homeless and anything but comfortable, Mia’s sisters come to the rescue (as usual) by helping her land the perfect apartment—but a colossal mishap lands gorgeous bad boy Logan Miller on her doorstep with a key and a lease contract of his own.In exchange for a free month's stay, Logan agrees to help Mia find the voice and confidence she now desperately craves. The goal? To finally stand up for herself and give her exes what they deserve.It’s not revenge. It’s Karma.Mia's one rule: No matter how charming, funny, and sexy Logan is, she cannot fall in love with him.Logan's one rule: No matter how adorable, sweet, and sexy she is, Mia is off limits.Are some rules made to be broken, or will Logan turn out to be exactly what everyone warns her he is—a player who will only break her heart in the end?THE KARMA BOOK CLUB is the endearing, yet hilarious second installment in the Club Series. A page-turning New Adult Romantic Comedy full of lol moments, lovable characters, and redemption at its finest. Told in dual points of view.\nPerfect for fans of Becky Monson, R.S. Grey, and rom-coms that leave you with an overall happy feeling.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Contemporary Romance",
    "Humor"
  ],
  "author": "Kayley Wood",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/45170845-the-karma-book-club"
}