{
  "title": "Swimming in the Dark",
  "description": "Set in early 1980s Poland against the violent decline of communism, a tender and passionate story of first love between two young men who eventually find themselves on opposite sides of the political divide—a stunningly poetic and heartrending literary debut for fans of Andre Aciman, Garth Greenwell, and Alan Hollinghurst.When university student Ludwik meets Janusz at a summer agricultural camp, he is fascinated yet wary of this handsome, carefree stranger. But a chance meeting by the river soon becomes an intense, exhilarating, and all-consuming affair. After their camp duties are fulfilled, the pair spend a dreamlike few weeks camping in the countryside, bonding over an illicit copy of James Baldwin’s Giovanni’s Room. Inhabiting a beautiful natural world removed from society and its constraints, Ludwik and Janusz fall deeply in love. But in their repressive communist and Catholic society, the passion they share is utterly unthinkable.Once they return to Warsaw, the charismatic Janusz quickly rises in the political ranks of the party and is rewarded with a highly-coveted position in the ministry. Ludwik is drawn toward impulsive acts of protest, unable to ignore rising food prices and the stark economic disparity around them. Their secret love and personal and political differences slowly begin to tear them apart as both men struggle to survive in a regime on the brink of collapse.Shifting from the intoxication of first love to the quiet melancholy of growing up and growing apart, Swimming in the Dark is a potent blend of romance, post-war politics, intrigue, and history. Lyrical and sensual, immersive and intense, Tomasz Jedrowski has crafted an indelible and thought-provoking literary debut that explores freedom and love in all its incarnations.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "LGBT",
    "Queer",
    "Romance",
    "Historical",
    "Gay"
  ],
  "author": "Tomasz Jedrowski",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/45169231-swimming-in-the-dark"
}