{
  "title": "Lesath",
  "description": "Locked in his dark cell, Greg lay awake in bed, fidgeting with the small cassette recorder, pressing the rewind and stop buttons to listen to the heavy click and spring-loaded clank that initiated and punctuated the faint whirring mechanics. He knew well enough no one was going to come looking for him―not while he was in between jobs, living in a four-door pickup truck, and had traveled to an undisclosed location without telling anyone. What brought him here were rumors of an abandoned building that was said to be part of a black site―rumors that were circulated amongst truckers and drifters: some exaggerated the sinister aspect of the place, detailing with morbid relish the methods of enhanced interrogation that were being developed or deployed there, while others assumed the contrarian position and downplayed the horrors, if not downright dismissed the whole story as hyperbole. Questionable as the lead was, the story seemed too good for an amateur journalist like Greg to pass up. All the same, he did not expect there would be some truth to those rumors, that the building is not quite derelict as he had imagined. And that, thanks to a case of mistaken identity, he was now incarcerated there as an inmate.Greg stopped the rewinding mechanism when he detected rustling and soft thumps coming through the ceiling vent―or thought he did, since the quirky nature of unidentified noise is that it usually ceases whenever one stops to listen. Like a living body, no running building is without its small, unaccountable bumps and muffled clanks; yet even if they’re mostly benign noise, at night, they’re magnified by the ever-present hush, and their unfamiliarity never fails to inflame the imagination of the sleepless newcomer. LESATH is a psychological horror that pays tribute to gothic fiction.",
  "genres": [
    "Horror",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Adult",
    "Mystery"
  ],
  "author": "A.M. Kherbash",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/45173036-lesath"
}