{
  "title": "ESCAPE",
  "description": "The alien ships arrived several generations back, and they came for only one To kill any and all humans who refused to submit to having a digital symbiotic device implanted onto their upper spine. So ultimately, all of mankind was either slaughtered or used for host bodies for the alien’s eternal digital souls… well, maybe not quite all of mankind… Abenir Stall was an infant when his mother found him lying in the rubble of a burning building. Knowing that this infant was of culling age, she smuggled him home and raised him as one of her own. The thing was, she was one of the Ch-khana, an alien who occupied a human host body. Abenir was a human. When she’s called upon to fight for her species, Abenir is left on his own as a little child. Years later, he is sixteen and still hiding out all alone on Earth. He can sneak into the Ch-khana cities and steal what he needs because he looks like one of them and he even speaks that alien language. It isn’t until a secret human militia finds him that he discovers just how many enemies he currently might have. After all, he speaks and reads the language of the enemy, yet he claims to be an ordinary human in hiding. To make matters worse, it’s soon very clear that Abenir has devoted his life to finding the woman he loves more than anyone – the woman who abandoned him as a child – a Ch-khana woman who most likely is fighting his own people at the moment. He needs to pick a side and fight for what’s right. Is his devotion to the Ch-khana or to the humans who need him?  The entire Ani Maxima series by Scott McElhaney was voted in the top 10 for \"Best Kindle Space Opera\" and \"Best Amazon Prime Books to Borrow\" by Goodreads! Mommy’s Choice, his first novel, was voted #1 in “Christian Books Free on Amazon Prime” by Goodreads! Brought to you by the international bestselling author of the Mystic Saga, Beyond the Event Horizon, Maelstrom, Endeavor, and Ghosts of Ophidian. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Hope Rising, One Crazy Summer, and Terraformer by McElhaney. EDITORIAL  \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review \"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael Gallagher Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [],
  "author": "Scott McElhaney",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/45172125-escape"
}