{
  "title": "No Feelings Involved",
  "description": "Can this skeptical player let down his guard long enough to let love into his life, or is this forbidden romance a train wreck in the making?   Ryan James doesn’t believe in love.  It’s a truth he learned early in life. A truth he carried with him into adulthood. He broke his golden rule one time, but Myndi trampled all over his heart, cementing his belief that love is a lie and not worth the effort.  Now he’s returned to his cynical views and promiscuous lifestyle, racking up more notches on his bedpost than he can count.  Until Summer Petersen comes crashing into his world, threatening to knock down his walls with her tempting body and sunny, sweet personality.  Summer is determined to lose her V-card before she starts freshman year of college, and the hot, older guy with the cute dimples, dazzling smile, and rippling biceps is just the man for the job. Ryan doesn’t take much persuading, and he rocks her world, giving her a night to remember.  When they walk away, there’s an unspoken agreement it was a one-time thing. Ryan doesn’t do feelings, and Summer doesn’t want to be tied down at eighteen.  But when she moves into her brother Austin’s apartment, she’s shocked to discover her new roomie is the guy who recently popped her cherry.  Ryan can’t believe he slept with Austin’s baby sister, and if he finds out, he’ll literally kill him. Keeping their hook up a secret is nonnegotiable. Keeping his thoughts, and his hands, off Summer, less so. Because the longer he’s around her, the more he finds himself catching feelings for the gorgeous brunette.  Summer doesn’t want to care for her older brother’s best friend, but Ryan makes her feel things she’s never felt before, and she’s slowly falling under his spell.  Embarking on an illicit affair behind Austin’s back has train wreck written all over it, but provided they keep their feelings in check, they can end this before he ever finds out.  It’s not like either of them is in love.  Right?    This is a full length STANDALONE new adult romance. Not recommended for readers under the age of eighteen due to mature content.",
  "genres": [
    "Romance",
    "Contemporary",
    "College",
    "New Adult",
    "Contemporary Romance",
    "Friends To Lovers",
    "Second Chance"
  ],
  "author": "Siobhan     Davis",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/45177108-no-feelings-involved"
}