{
  "title": "With You",
  "description": "Not all rock stars a narcissistic a**holes…For rocker Jack McBride, it’s all about the music and the fans. He’s not into all the celebrity BS.Now that he’s had some distance from his messy breakup, he realizes his ex may have been more attracted to his fame, and what it could do for her, than she was to him. He’d have done anything for her. And he did. But it was never enough. After enjoying the perks of no-strings sex for a few months, Jack’s sick of meaningless one-nighters. With their concerts selling out across the globe, he focuses all his energy on the band, their music, and the fans. After Emily catches her fiancé cheating, her well-planned future crumbles, and with it her chance at happily ever after. Feeling adrift, she needs to figure out what went wrong before she can move on. If she can move on. When they meet, their chemistry is explosive, but she’s not interested in dating anyone, let alone a rock star. But Jack’s not a stereotypical bad boy musician. Their attraction demands satisfaction, so she offers him one night. With mere hours to convince Emily their chemistry goes beyond sexual, can he convince her to give him, to give them, a chance? Jack and Emily’s story continues in books 2 and 3 of the Rocked in Love series, No More Yesterdays and All Your Tomorrows.With You, book 1 in Jack and Emily's trilogy, features a determined, overprotective hero who doesn’t know the meaning of the word quit and a stubborn, fiercely independent heroine who thinks she has to handle everything on her own.~ Perfect for fans of intense, emotional stories with a side of humor and suspense, and friends who are family. ~Steam Level: IncendiarySuspense: Nerve-wrackingFeels: All of themTissues: Tears of joy, laughter, and ugly cryingHEA: Work in progressAll my current books are connected by found family. For the best experience, the reading order is as follows:With You (Rocked in Love – Jack and Emily Book 1)No More Yesterdays (Rocked in Love – Jack and Emily Book 2)All Your Tomorrows (Rocked in Love – Jack and Emily Book 3)Night and Day (Found Family – Eddie and Sheryl Book 1) Content Warning: Deals with heavy sh*tNight and Day: Ever After (Found Family – Eddie and Sheryl Book 2) Content Warning: Deals with heavy sh*t",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Music",
    "Contemporary",
    "M F Romance"
  ],
  "author": "Jessica Marlowe",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/45188176-with-you"
}