{
  "title": "Lord Byron's Novel: The Evening Land",
  "description": "One of the most accomplished literary artists of our time, John Crowley has given us fiction that illuminates and astounds -- from the wonder and whimsy of Little, Big to the poignancy and lyrical beauty of The Translator . Now he turns his unique genius in a different direction to imagine the novel the great, haunted, and enigmatic Romanticpoet Lord Byron never penned ... but very well might have. Documents discovered in a rotting old trunk in an English storage room prove that the manuscript of a novel by Byron once existed, and that it was saved from destruction, read, and annotated by Ada, Countess of Lovelace, a brilliant mathematician and Byron's abandoned daughter, during the final, agonizing months of her young life. While the curious mystery of what became of the manuscript itself is explored, we are permitted to read it -- the whole of Byron's only novel -- beginning to end. And what a novel it is -- a thrilling romance chock-full of treacheries and deceits, loves and fortunes gloriously gained and tragically lost; a tale of blood, vengeance, and mystery, of thrilling escapes and ruthless murder. Yet in the story of Ali -- the bastard son of the demonic Lord Sane, torn from his life in high Albania to be raised a proper, if penniless, English gentleman -- Ada finds gripping revelations of its author's hidden character, and glimpses into the secrets of his soul. John Crowley's masterly creation is, in itself, a stunning and unprecedented act of literary impersonation. But Lord Byron's Novel is much more, weaving strands from different centuries into an extraordinary tapestry of loss and discovery, and the powerful, invisible threads that eternally bind parent to child. It is the story of a dying daughter's poignant attempt to understand the famous absent father she longed for to her last day, and the contemporary tale of the determined young woman who, by learning the secret of Byron's manuscript and Ada's devotion, reconnects with her own father, who was driven from her life by a crime as terrible as any Byron was accused of. John Crowley's novel is a wonder -- a modern masterwork that moves, enlightens, and satisfies on every level.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Gothic",
    "Historical",
    "Books About Books",
    "Novels"
  ],
  "author": "John Crowley",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/1242515.Lord_Byron_s_Novel"
}