{
  "title": "Stay Alive, My Son",
  "description": "On April 17, 1975, the Khmer Rouge entered Phnom Penh to open a new and appalling chapter in the story of the twentieth century. On that day, Pin Yathay was a qualified engineer in the Ministry of Public Works. Successful and highly educated, he had been critical of the corrupt Lon Nol regime and hoped that the Khmer Rouge would be the patriotic saviors of Cambodia. In Stay Alive, My Son , Pin Yathay provides an unforgettable testament of the horror that ensued and a gripping account of personal courage, sacrifice and survival. Documenting the 27 months from the arrival of the Khmer Rouge in Phnom Penh to his escape into Thailand, Pin Yathay's story is a powerful and haunting memoir of Cambodia's killing fields. With seventeen members of his family, Pin Yathay were evacuated by the Khmer Rouge from Phnom Penh, taking with them whatever they might need for the three days before they would be allowed to return to their home. Instead, they were moved on from camp to camp, their possessions confiscated or abandoned. As days became weeks and weeks became months, they became the \"New People,\" displaced urban dwellers compelled to live and work as peasants, their days were filled with forced manual labor and their survival dependent on ever more meager communal rations. The body count mounted, first as malnutrition bred rampant disease and then as the Khmer Rouge singled out the dissidents for sudden death in the darkness. Eventually, Pin Yathay's family was reduced to just himself, his wife, and their one remaining son, Nawath. Wracked with pain and disease, robbed of all they had owned, living on the very edge of dying, they faced a future of escalating horror. With Nawath too ill to travel, Pin Yathay and his wife, Any, had to make the heart-breaking decision whether to leave him to the care of a Cambodian hospital in order to make a desperate break for freedom. \"Stay alive, my son,\" he tells Nawath before embarking on a nightmarish escape to the Thai border. First published in 1987, the Cornell edition of Stay Alive, My Son includes an updated preface and epilogue by Pin Yathay and a new foreword by David Chandler, a world-renowned historian of Cambodia, who attests to the continuing value and urgency of Pin Yathay's message.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Asia",
    "Biography",
    "War",
    "Biography Memoir"
  ],
  "author": "Pin Yathay",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/452206.Stay_Alive_My_Son"
}