{
  "title": "The Ox: The Last of the Great Rock Stars: The Authorised Biography of The Who's John Entwistle",
  "description": "The definitive no-holds-barred biography of John Entwistle, The Who's legendary bass guitaristIt is an unequivocal fact that in terms of rock bands, the Beatles, the Rolling Stones and the Who represent Year Zero; the beginning of all things, ground-breakers all. To that end, John Entwistle - the Who's beloved bassist - is also without question one of the most important and influential figures in the annals of rock. He is also among an even more rarefied few by virtue of his being such a fascinating, transfixing and gloriously oversized character. However, Entwistle has not been the subject of a major biography. Likely, this was due to no-one being able to gain close access to the subject the still in many other respects enigmatic Entwistle's enduring legacy has been carefully guarded by his surviving family. With the full co-operation of the Entwistle family, The Ox will correct this oversight and in doing so, shine a long overdue light on one of the single greatest, and most impactful figures in rock history.Drawing on his own notes for an unfinished autobiography that he started before his death in 2002 (and which will be quoted from extensively), as well as his personal archives and interviews with his family and friends, The Ox will give readers a never-before-seen glimpse into the two very distinct poles of John Entwistle. On the one hand, he was the rock star incarnate, being larger than life, self-obsessed to a fault, and proudly and almost defiantly so. Extravagant with money, he famously shipped two vintage American cars across the Atlantic without having so much as a driver's license, built exponentially bigger and grandiose bars into every home he owned, and amassed an extraordinary collection of possessions, from arachnids, armor, and weaponry, to his patented Cuban-heeled boots. But beneath this fame and flutter, he was also a man of simple tastes and traditional opinions. He was a devoted father and family man who loved nothing more than to wake up to a full English breakfast, or to have a supper of fish, chips, and a pint at his local pub.After his untimely death, many of these stories were shuttered away into the memories of his family, friends, and loved ones, but now, for the first time, The Ox will introduce us to the man behind the myth-the iconic and inimitable John Entwistle.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction"
  ],
  "author": "Paul Rees",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/45277054-the-ox"
}