{
  "title": "A Frozen Hell: The Russo-Finnish Winter War of 1939-40",
  "description": "This is a book of battles--savagely fought, often with great heroism on both sides, under brutal, subarctic conditions. Guerrillas on skis, heroic single-handed attacks on tanks, unfathomable endurance, and the charismatic leadership of one of this century's true military geniuses--these were the elements of Finland's short-lived victory.For all the epic resistance of the Finns, the outcome was foreordained. Belatedly the Russians realized that an expected easy triumph over a vastly outnumbered foe had become a slaughterhouse. Incompetent commanders were replaced, more and better troops were moved into position, and orders were given to overwhelm and crush the Finns by the sheer weight of massed numbers. But even though they lost on the battlefield, the Finns's pointed resistance kept the Iron Curtain from drawing closed around their land and allowed Finland to remain free, even as other countries fell one by one.Trotter's love for the Finns, his clear, evocative prose, and his deep knowledge of his subject combine to resurrect a fight that will never again be forgotten.William R. Trotter was raised in Charlotte, North Carolina, and educated at Davidson College, where he earned a B.A. in European History. He has worked as a regional music critic, a book reviewer, and a freelance historian and feature writer.Trotter has published twelve books as well as many articles--in The Independent (North Carolina), Spectator Magazine, the American Record Magazine, Film Culture, Military History Monthly, and dozens of other magazines. Since 1987, he has been a senior writer for PC Gamer Magazine.In 1995, Trotter won the Finlandia Foundation's Arts and Letters Prize for A Frozen Hell, and the book is required reading for the 2nd Marine Division. In addition, his biography of Mitropoulos, Priest of Music: The Life and Times of Dimitri Mitropoulos, was selected as one of the \"ten best 'arts' books of the year\" by National Public Radio, and one of his novellas has been nominated for a Bram Stoker Award.William Trotter lives with his wife and their youngest son in Greensboro, North Carolina.",
  "genres": [
    "History",
    "Nonfiction",
    "Russia",
    "Military History",
    "War",
    "World War II",
    "Military Fiction"
  ],
  "author": "William R. Trotter",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/1242614.A_Frozen_Hell"
}