{
  "title": "Cause Celeb",
  "description": "Available for the first time in the United States, Cause Celeb is the hilarious debut novel by British literary sensation Helen Fielding. With the same wit and candor that shot \nBridget Jones's Diary\n and \nBridget Jones: The Edge of Reason\n to the top of bestseller lists and forever altered the vocabulary of dating, Fielding executes a remarkable spoof on the altruistic endeavors of commoners and celebrities alike as they unite to combat the horror of famine and neglect in Africa. Populated by larger-than-life characters from London's West End and the unsung heroes toiling anonymously on the Continent, Cause Celeb is a cunning and poignant tale that discloses the romantic underpinnings of life and love in the 21st century.Rosie Richardson, a frothy young woman trapped in the cauldron of the publishing world, finds herself involved in a dysfunctional relationship with TV personality Oliver Marchant, a Teflon-coated Romeo who slips in and out of her life with greater frequency than she'd like. Disenchanted with their glamorous lifestyle, Rosie packs her bags and (quite literally) heads for the hills, embarking on a personal odyssey through the majestic deserts of Africa to the fictional state of Nambula, where each day's sunrise brings a daunting challenge. Upon arrival in the sparse refugee camp, Rosie immediately gets a sense of just how eccentric some of her new neighbors are. Muhammed, a local go-between with a flair for melodrama, the burly Irish doctor O'Rourke, and two seasoned nurses are all catalysts for the story who keep spirits alive and send emotions on a roller-coaster ride. When a carpet of locusts wreaks havoc among vestiges of the season's last crops, disease and starvation become a palpable threat that plagues the proud refugees of Nambula with fear. But stubborn government regimes turn a blind eye to the dangers facing the village, the relief workers' pleas for food and assistance are ignored, and fever and calamity run rampant, forcing Rosie to return to London and enlist the help of her former lover and the motley crew of friends they once shared. In a final, inspired act of desperation, the former publicity flak miraculously pulls off an international appeal with results that far surpass anything she had imagined. With a winning combination of pathos and humor, Fielding suggests that the real voyage of discovery is not simply in the quest for new landscapes, but in having new eyes to view them with. Ultimately, Rosie does find the peace of mind and passion she so desperately sought, and the success of her cause adds substance to her life and a depth to her character she had never suspected. Like the Bridget Jones novels, Cause Celeb is an easy, enjoyable read. But despite its seeming frivolity, the book paints an insightful and sanguine portrait of modern-day philanthropy. It's just that in the world according to Helen Fielding, even saving lives can be cause for merriment.\n\n--Lauren Foster",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Africa",
    "Romance",
    "Humor",
    "Contemporary",
    "Adult Fiction"
  ],
  "author": "Helen Fielding",
  "average_rating": "3.04",
  "url": "https://www.goodreads.com/book/show/4529.Cause_Celeb"
}