{
  "title": "Dancing with the Single Dad",
  "description": "Hanging up your dance shoes isn't so easy when you can't let go of your former dance partner.Welcome to Seattle, the Emerald City and home to The Single Dads of Seattle. Ten sexy single fathers who play poker every Saturday night, have each other's backs, love their children without quarter, and hope to one day find love again.This is Adam's story ...Single Dad of Seattle, Adam Eastwood, knows that dance school is just the thing for his precocious daughter, Mira. She already spends most days twirling around the house in a tutu and tiara, why not pay a professional to teach her how to do it properly? Only Adam didn't account for that professional to be the Violet Benson from a very famous New York ballet company. Not only is Violet a natural beauty who floats more than she dances, but she's the kind of woman Adam's been searching for all his life.Grieving the loss of her dance partner and boyfriend, Violet is done with performing on stage. How can she go on when the love of her life is no longer there to catch her? Deciding a change is best, she moves back home to Seattle, determined to fulfill their dream of opening up a dance school. It's not until she's asked to dance for Art in the Park that she realizes maybe she's not quite ready to hang up her dance shoes. Would it be wrong to take the stage one last time? It must be wrong to feel what she feels when she's dancing with Mira's handsome father.Adam's wounds are still fresh from his divorce, and Violet's dealing with a loss of her own, but somehow they keep winding up in each other's arms with neither of them willing to let go. But it's never easy to conquer the past.Will Violet let fear and grief keep her from her dreams? Or will Adam convince her that the show must go on and dancing with the single dad might just be the way for her to find her happily ever after?**Note: This book can be read as a standalone. It includes lots of steamy scenes, cursing, and of course as with all my books, this has an HEA and no cliffhanger or cheating. If you like single dads who take charge, this book is for you.",
  "genres": [
    "Romance",
    "Contemporary",
    "Audiobook",
    "Contemporary Romance",
    "Small Town Romance",
    "Amazon",
    "Erotic Romance"
  ],
  "author": "Whitley Cox",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/45284957-dancing-with-the-single-dad"
}