{
  "title": "Kleptopia: How Dirty Money is Conquering the World",
  "description": "A Washington Post Notable Book of the Year • An Economist Book of the Year“A must-read for anyone wanting to better understand what has already happened here in America and what lies ahead if Trump is reelected in November…. A magisterial account of the money and violence behind the world’s most powerful dictatorships.” –Washington PostIn this shocking, meticulously reported work of narrative nonfiction, an award-winning investigative journalist exposes “capitalism’s monster”—global kleptocracy—and reveals how it is corrupting the world around us.They are everywhere, the thieves and their people. Masters of secrecy. Until now we have detected their presence only by what they leave behind. A body in a burned-out Audi. Workers riddled with bullets in the Kazakh Desert. A rigged election in Zimbabwe. A British banker silenced and humiliated for trying to expose the truth about the City of London.They have amassed more money than most countries. But what they are really stealing is power.In this real-life thriller packed with jaw-dropping revelations, award-winning investigative journalist Tom Burgis weaves together four stories that reveal a terrifying global web of the troublemaker from Basingstoke who stumbles on the secrets of a Swiss bank, the ex-Soviet billionaire constructing a private empire, the righteous Canadian lawyer with a mysterious client, and the Brooklyn crook protected by the CIA.Glimpses of this shadowy world have emerged over the years. In Kleptopia, Burgis connects the dots. He follows the dirty money that is flooding the global economy, emboldening dictators, and poisoning democracies. From the Kremlin to Beijing, Harare to Riyadh, Paris to the White House, the trail shows something even more the thieves are uniting. And the human cost will be great.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Economics",
    "History",
    "Business",
    "Finance",
    "Crime"
  ],
  "author": "Tom Burgis",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/45306313-kleptopia"
}