{
  "title": "Samuel Adams: A Life",
  "description": "In this stirring biography, Samuel Adams joins the first tier of founding fathers, a rank he has long deserved. With eloquence equal to that of Thomas Jefferson and Tom Paine, and with a passionate love of God, Adams helped ignite the flame of liberty and made sure it glowed even during the Revolution's darkest hours. He was, as Jefferson later observed, \"truly the man of the Revolution.\"In a role that many Americans have not fully appreciated until now, Adams played a pivotal role in the events leading up to the bloody confrontation with the British. Believing that God had willed a free American nation, he was among the first patriot leaders to call for independence from England. He was ever the man of He saw the opportunity to stir things up after the Boston Massacre and helped plan and instigate the Boston Tea Party, though he did not actually participate in it. A fiery newspaper editor, he railed ceaselessly against \"taxation without representation.\"In a relentless blizzard of articles and speeches, Adams, a man of New England, argued the urgency of revolution. When the top British general in America, Thomas Gage, offered a general amnesty in June 1775 to all revolutionaries who would lay down their arms, he excepted only two men, John Hancock and Samuel These two were destined for the gallows. It was this pair, author Ira Stoll argues, whom the British were pursuing in their fateful march on Lexington and Concord.In the tradition of David McCullough's John Adams , Joseph Ellis's The Founding Brothers , and Walter Isaacson's Benjamin Franklin , Ira Stoll's Samuel Adams vividly re-creates a world of ideas and action, reminding us that none of these men of courage knew what we know that they would prevail and make history anew.The idea that especially inspired Adams was religious in He believed that God had intervened on behalf of the United States and would do so as long asits citizens maintained civic virtue. \"We shall never be abandoned by Heaven while we act worthy of its aid and protection,\" Adams insisted. A central thesis of this biography is that religion in large part motivated the founding of America.A gifted young historian and newspaperman, Ira Stoll has written a gripping story about the man who was the revolution's moral conscience. Sure to be discussed widely, this book reminds us who Samuel Adams was, why he has been slighted by history, and why he must be remembered.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "American Revolution",
    "Politics",
    "Biography Memoir"
  ],
  "author": "Ira Stoll",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/4529814-samuel-adams"
}