{
  "title": "The Last Leonardo: The Secret Lives of the World's Most Expensive Painting",
  "description": "An epic quest exposes hidden truths about Leonardo da Vinci's Salvator Mundi, the recently discovered masterpiece that sold for $450 million—and might not be the real thing.For two centuries, art dealers and historians searched in vain for the Holy Grail of art history: a portrait of Christ as the Salvator Mundi (\"Savior of the World\") by Leonardo da Vinci. At last, in 2005 a compelling candidate was discovered by a small-time Old Masters dealer at a second-rate auction house in New Orleans. After a six-year restoration, an exhibition at the National Gallery in London, and the help of canny Swiss art dealer Yves Bouvier, the painting was sold to the news-making Russian oligarch Dmitry Rybolovlev. After the very-public fallout between Rybolovlev and Bouvier, the painting went on to make headlines again in 2017 as the most expensive painting ever sold when a proxy of Saudi Crown Prince Mohammed bin Salman won the masterwork at a Christie's auction for $450 million. But controversy still surrounds the artwork: Did the auction house—and the art dealers, curators, and art historians behind this find—actually have the right painting, or is there another? Did Leonardo even paint a Salvator Mundi? Some scholars argue he was only occasionally painting at the time the work is dated. Was the painting restored to such an extent that it became a Leonardo, though it was in fact the work of his apprentices? In short: Is it the genuine artifact, the result of a frenzied marketing genius—or perhaps a little of both?In a thriller-like pursuit of the truth, Ben Lewis examines the five-hundred-year Cinderella-story of this painting and, astonishingly, turns up the smoking guns, including the burnt initials of ownership by an English king on a different Salvator Mundi and the identity of the American family who owned the painting for some of its missing decades. Through this journey, we come to see how the global art market evolved to what it is today, and we are left to ask ourselves what art means to humanity, both past and present.",
  "genres": [
    "Nonfiction",
    "Art",
    "History",
    "Art History",
    "Audiobook",
    "Historical",
    "Mystery"
  ],
  "author": "Ben Lewis",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/45319160-the-last-leonardo"
}