{
  "title": "Champlain's Dream",
  "description": "In this sweeping, enthralling biography, acclaimed historian David Hackett Fischer brings to life the remarkable Samuel de Champlain -- soldier, spy, master mariner, explorer, cartographer, artist, and Father of New France.Born on France's Atlantic coast, Champlain grew to manhood in a country riven by religious warfare. The historical record is unclear on whether Champlain was baptized Protestant or Catholic, but he fought in France's religious wars for the man who would become Henri IV, one of France's greatest kings, and like Henri, he was religiously tolerant in an age of murderous sectarianism. Champlain was also a brilliant navigator. He went to sea as a boy and over time acquired the skills that allowed him to make twenty-seven Atlantic crossings without losing a ship.But we remember Champlain mainly as a great explorer. On foot and by ship and canoe, he traveled through what are now six Canadian provinces and five American states. Over more than thirty years he founded, colonized, and administered French settlements in North America. Sailing frequently between France and Canada, he maneuvered through court intrigue in Paris and negotiated among more than a dozen Indian nations in North America to establish New France. Champlain had early support from Henri IV and later Louis XIII, but the Queen Regent Marie de Medici and Cardinal Richelieu opposed his efforts. Despite much resistance and many defeats, Champlain, by his astonishing dedication and stamina, finally established France's New World colony. He tried constantly to maintain peace among Indian nations that were sometimes at war with one another, but when he had to, he took up arms and forcefully imposed a new balance of power, proving himself a formidable strategist and warrior.Throughout his three decades in North America, Champlain remained committed to a remarkable vision, a Grand Design for France's colony. He encouraged intermarriage among the French colonists and the natives, and he insisted on tolerance for Protestants. He was a visionary leader, especially when compared to his English and Spanish contemporaries -- a man who dreamed of humanity and peace in a world of cruelty and violence.This superb biography, the first in decades, is as dramatic and exciting as the life it portrays. Deeply researched, it is illustrated throughout with many contemporary images and maps, including several drawn by Champlain himself.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Canada",
    "American History",
    "France",
    "World History"
  ],
  "author": "David Hackett Fischer",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/4531763-champlain-s-dream"
}