{
  "title": "The Boys' Club",
  "description": "Sweetbitter meets The Firm in this buzzy, page-turning debut novel—already optioned to Netflix—about sex and power in the halls of corporate America.Alex Vogel has always been a high achiever who lived her life by the book—star student and athlete in high school, prelaw whiz in college, Harvard Law School degree. Accepting a dream offer at the prestigious Manhattan law firm of Klasko & Fitch, she promises her sweet and supportive longtime boyfriend that the job won’t change her. Yet Alex is seduced by the firm’s money and energy . . . and by her cocksure male colleagues, who quickly take notice of the new girl. She’s never felt so confident and powerful—even the innuendo-laced banter with clients feels fun. In the firm’s most profitable and competitive division, Mergers and Acquisitions, Alex works around the clock, racking up billable hours and entertaining clients late into the evening. While the job is punishing, it has its perks, like a weekend trip to Miami, a ride in a client’s private jet, and more expense-account meals than she can count. But as her clients’ expectations and demands on her increase, and Alex finds herself magnetically drawn to a handsome coworker despite her loving relationship at home, she begins to question everything—including herself. She knows the corporate world isn’t black and white, and that to reach the top means playing by different rules. But who made those rules? And what if the system rigged so that women can’t win, anyway? When something happens that reveals the dark reality of the firm, Alex comes to understand the ways women like her are told—explicitly and implicitly—how they need to behave to succeed in the workplace. Now, she can no longer stand by silently—even if doing what’s right means putting everything on the line to expose the shocking truth.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Thriller",
    "Book Club",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "Erica Katz",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/45306332-the-boys-club"
}