{
  "title": "Lord of the Wilderness",
  "description": "International Book Award winning author Elizabeth St. Michel returns to her action and adventure historical romance roots with this passionate redemptive story, a probing tale that reminds us that love and sacrifice can shape even the most broken among us into a perfect and stunning masterpiece. ~ ~ ~ While the Revolutionary War rages on the eastern coast, Patriot spy, Lord Joshua Rutland, gathers information from the new frontier for General George Washington. Posing as a trapper, Joshua travels the territories collecting intelligence—but also searching for the man who killed his beloved betrothed. His need for vengeance drives him almost as much as his need to help the colonists build the new life they are struggling to forge. Amid the breathtaking scenery of the wilderness, Joshua finds a red-haired beauty who tempts him to open his hardened heart. Lady Juliet Faulkner has been sold into indenture by a cruel baron, sent to America where she slaves on a wild outpost. Nearly starved and constantly fighting off advances by her lecherous master—not to mention the fear of Indian attacks—Juliet never expected to find a hero in a mysterious buckskin-clad warrior who saves her from rape. In this man, Juliet sees someone she could build a life with if he would only stay, but a dark guilt from his past eats at his soul and he’s vowed to never love again, despite the undeniable attraction between them. But Juliet will not give up, believing he could be as passionate about love as he is about his country. This heart jolting historical romance blends the dangerous world of espionage and patriotism with the threat of death and the promise of a brave new future together. ~ ~ ~ Full of action and adventure, mystery and suspense, and humor with a love and passion as powerful and beautiful as the wilderness. St. Michel’s Duke of Rutland Series IV is captivatingly fresh, and unblinkingly gritty, balancing war and hardship with amusing, romantic, and vivid characters you will long remember.",
  "genres": [
    "Historical Romance",
    "Historical"
  ],
  "author": "Elizabeth St. Michel",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/45318134-lord-of-the-wilderness"
}