{
  "title": "Not So Long Ago, Not So Far Away",
  "description": "When her best friend ran away ...... Erika promised to keep all of their secrets safe.But how long can she keep lying?The summer of 1977 is shaping up to be the worst experience of Erika's life. Everybody knows she was the last person to see Cassie before the teen beauty queen disappeared into the night. Now Erika is making false statements to the police, hiding from Cassie's father, and mourning the loss of the only person who ever filled her days with light.She's certain her life can't get any worse. Then the bullying starts.Why is everyone taunting her with accusations she doesn't understand? She can't even go to the bathroom in peace.Under the weight of it all, Erika struggles just to breathe.Until a new movie transforms her lonely existence with A New Hope.For Erika, Star Wars changes everything. Safe in the cocoon of a darkened movie theater, she can escape to a galaxy far, far away from her current nightmare. But she can't hide forever. And someone thinks she knows too many of Cassie's secrets.Have you ever felt like an outsider? Or a sidekick in your own fantasies? Erika's fangirl journey toward creativity, empowerment, and self-esteem will have you cheering. Because who doesn't love a geeky underdog?Fans of Rainbow Rowell or John Green will enjoy this quirky page-turner.Grab your copy today.Praise for Not So Long Ago, Not So Far Away'...a wonderful romping story with an underlying mystery''This coming-of-age novel is compelling and charmingly quirky.''I loved this book! It made me nostalgic, it made me laugh and it made me cry.''... readers aged 13 to 100 will enjoy.'Note: This is a second edition of the novel with a new cover, new editing, and a new publisher. Do not buy this book if you already own the first edition published in 2013 by Deeds Publishing (ISBN 978-1937565589).",
  "genres": [
    "Young Adult"
  ],
  "author": "Trisha Slay",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/45313080-not-so-long-ago-not-so-far-away"
}