{
  "title": "The RSS: A Menace To India",
  "description": "India is battling for its very soul.The Rashtriya Swayamsevak Sangh (RSS) is the most powerful organisation in India today; complete with a private army of its own, unquestionably obeying its leader who functions on fascist lines on the Fuehrer principle. Two of its pracharaks (active preachers) have gone on to become prime ministers of India. In 1951 it set up a political front, the Bharatiya Jana Sangh, which merged into the Janata Party in 1977 only to walk out of it in 1980. In issue was its superior loyalty to its parent and mentor, the RSS; not the Janata Party. Within months of its defection, the Jana Sangh reemerged; not with the name under which it had functioned for nearly three decades, but as the Bharatiya Janata Party, deceptively to claim a respectable lineage.The RSS is at war with India’s past. It belittles three of the greatest builders of the Indian State – Ashoka, the Buddhist; Akbar, the Muslim; and Nehru, a civilised Enlightened Hindu. It would wipe out centuries of achievement for which the world has acclaimed India and replace that with its own narrow, divisive ideology.This book is a magisterial study of the RSS, from its formation in 1925 to the present day. With scrupulous and voluminous evidence, one of India’s leading constitutional experts and political analysts, A.G. Noorani, builds a watertight case to show how the RSS is much more than a threat to communal amity. It poses a wider challenge. It is a threat to democratic governance and, even worse, a menace to India. It threatens the very soul of India.And yet, despite its reach and seemingly overwhelming political influence, the author shows that the RSS can be defeated. The soul of India can be rescued.A. G. Noorani is a lawyer, historian and author. He has practised as an advocate in the Supreme Court of India and in the Bombay High Court. He is one of the few remaining experts on the Constitution of India from his generation. His columns have appeared in various publications, including Hindustan Times, The Hindu, Frontline, Economic and Political Weekly and Dainik Bhaskar. He is the author of a number of books, including The Kashmir Dispute, The Destruction of Hyderabad, The Babri Masjid Question and, for LeftWord, The RSS and the BJP: A Division of Labour (2000), Islam and Jihad (2002) and Savarkar and Hindutva: The Godse Connection (2002).",
  "genres": [
    "India",
    "History",
    "Politics",
    "Nonfiction",
    "Religion",
    "Asia"
  ],
  "author": "A.G. Noorani",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/45320765-the-rss"
}