{
  "title": "Clifford: A Memoir, A Fiction, A Fantasy, A Thought Experiment",
  "description": "I open my eyes in the darkness, laying on my side, half my vision is of the earth and shadows; the other is of the sky, treetops, and stars. I should write Clifford’s story. The thought emerges fully formed . . . The thought dissipates. I close my eyes and the earth and the sky disappear. The warmth of my sleeping bag wraps around me and sleep pulls me under into that half-world where reality and fantasy mingle in a place where coherent thoughts disintegrate.When Harold Johnson returns to his childhood home in a northern Saskatchewan Indigenous community for his brother Clifford’s funeral, the first thing his eyes fall on is a chair. It stands on three legs, the fourth broken off and missing. So begins a journey through the past, a retrieval of recollections that have too long sat dormant. Moving from the old family home to the log cabin, the garden, and finally settling deep in the forest surrounding the property, his mind circles back, shifting in time and space, weaving in and out of memories of his silent, powerful Swedish father; his formidable Cree mother, an expert trapper and a source of great strength; and his brother Clifford, a precocious young boy who is drawn to the mysterious workings of the universe.As the night unfolds, memories of Clifford surface in Harold’s mind’s eye: teaching his younger brother how to tie his shoelaces; jousting on a bicycle without rubber wheels; building a motorcycle. Memory, fiction, and fantasy collide, and Clifford comes to life as the scientist he was meant to be, culminating in his discovery of the Grand Unified Theory.Exquisitely crafted, funny, visionary, and wholly moving, Clifford is an extraordinary work for the way it defies strict category and embraces myriad forms of storytelling. To read it is to be immersed in a home, a family, a community, the wider world, the entire cosmos.",
  "genres": [
    "Indigenous",
    "Canada",
    "Memoir",
    "Book Club",
    "Contemporary",
    "Nonfiction",
    "Canadian Literature"
  ],
  "author": "Harold R. Johnson",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/45314494-clifford"
}