{
  "title": "The Girls",
  "description": "In Lori Lansens’ astonishing second novel, readers come to know and love two of the most remarkable characters in Canadian fiction. Rose and Ruby are twenty-nine-year-old conjoined twins. Born during a tornado to a shocked teenaged mother in the hospital at Leaford, Ontario, they are raised by the nurse who helped usher them into the world. Aunt Lovey and her husband, Uncle Stash, are middle-aged and with no children of their own. They relocate from the town to the drafty old farmhouse in the country that has been in Lovey’s family for generations.Joined to Ruby at the head, Rose’s face is pulled to one side, but she has full use of her limbs. Ruby has a beautiful face, but her body is tiny and she is unable to walk. She rests her legs on her sister’s hip, rather like a small child or a doll.In spite of their situation, the girls lead surprisingly separate lives. Rose is bookish and a baseball fan. Ruby is fond of trash TV and has a passion for local history.Rose has always wanted to be a writer, and as the novel opens, she begins to pen her autobiography. Here is how she I have never looked into my sister’s eyes. I have never bathed alone. I have never stood in the grass at night and raised my arms to a beguiling moon. I’ve never used an airplane bathroom. Or worn a hat. Or been kissed like that. I’ve never driven a car. Or slept through the night. Never a private talk. Or solo walk. I’ve never climbed a tree. Or faded into a crowd. So many things I’ve never done, but oh, how I’ve been loved. And, if such things were to be, I’d live a thousand lives as me, to be loved so exponentially.Ruby, with her marvellous characteristic logic, points out that Rose’s autobiography will have to be Ruby’s as well — and how can she trust Rose to represent her story accurately? Soon, Ruby decides to chime in with chapters of her own.The novel begins with Rose, but eventually moves to Ruby’s point of view and then switches back and forth. Because the girls face in slightly different directions, neither can see what the other is writing, and they don’t tell each other either. The reader is treated to sometimes overlapping stories told in two wonderfully distinct styles. Rose is given to introspection and secrecy. Ruby’s style is \"tell-all\" — frank and decidedly sweet.We learn of their early years as the town \"freaks\" and of Lovey’s and Stash’s determination to give them as normal an upbringing as possible. But when we meet them, both Lovey and Stash are dead, the girls have moved back into town, and they’ve received some ominous news. They are on the verge of becoming the oldest surviving craniopagus (joined at the head) twins in history, but the question of whether they’ll live to celebrate their thirtieth birthday is suddenly impossible to answer.In Rose and Ruby, Lori Lansens has created two precious characters, each distinct and loveable in their very different ways, and has given them a world in Leaford that rings absolutely true. The girls are unforgettable. The Girls is nothing short of a tour de force.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Canada",
    "Adult Fiction",
    "Adult",
    "Chick Lit"
  ],
  "author": "Lori Lansens",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/453065.The_Girls"
}