{
  "title": "Literary Criticism, Vol 2: French Writers / Other European Writers / Prefaces to the New York Edition",
  "description": "Henry James, renowned as one of the world’s great novelists, was also one of the most illuminating, audacious, and masterly critics of modern times.This Library of America volume is one of two volumes of the most extensive collection of his critical writings ever assembled, with many pieces never before available in book form. It includes reviews of a great number of European writers, especially French writers, along with more general essays and the Prefaces Henry James wrote for the New York Edition of his works, published between 1907 and 1909.The collection attests to James’s nearly unparalleled creative energy and to the reach of his theoretical and interpretive curiosity. His unique authority as a commentator draws upon the European-American contrast that is a central circumstance of his own fiction. A member of intellectual circles on both continents, he became the foremost interpreter to American readers of the literary and cultural life of Europe.More than one hundred reviews and essays are gathered by author, so that readers can trace the development of James’s complex, meditative, and highly volatile attitudes toward a wide spectrum of literature. James reviews the formidable Honoré de Balzac (with his “huge, all compassing, all desiring, all devouring love of reality”), Gustave Flaubert (“a pearl-diver, breathless in the thick element while he groped for the priceless word”), and Ivan Turgenev, the Russian visitor in Paris, with whom James felt great personal affinity, even though Tugenev “lacked the immense charm of absorbed inventiveness.”James delivers his critical judgments with great elegance and point, especially when he discusses the performance of other critics like Hippolyte Taine and Augustin Sainte-Beuve, and, of course, he can be wonderfully acerbic. An early moralistic essay on Baudelaire finds Poe “vastly the greater charlatan of the two, and the greater genius.”James brings his critical zest, exhilaration, and independence of judgment to bear on writers as diverse as Alphonse Daudet, George Sand, Victor Hugo, Guy de Maupassant, Théophile Gautier, J. W. von Goethe, and Gabriele D’Annunzio.Readers will find, in the complete collection of the Prefaces, one of literature’s most revealing artistic autobiographies, a wholly absorbing account of how writing gets written, and a vision of the possibilities for fiction which critics and novelists of later times will find immensely instructive and liberating.",
  "genres": [
    "Literary Criticism",
    "Writing",
    "American",
    "19th Century",
    "Reference"
  ],
  "author": "Henry James",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/124275.Literary_Criticism_Vol_2"
}