{
  "title": "The Heart You Break",
  "description": "Her new client is the bad boy of rock.Security agent Julia Slate is going undercover. Her assignment? Protect rocker Bran Copper. He's sexy, has a reputation for living life to the extreme, and he's also the target of one very obsessed fan. Julia's job is to keep Bran safe...and the catch? Bran can't know that she's his bodyguard. Bran's manager has hired her because the star refuses to get protection. Bran just wants to be left alone. With his stalker escalating, that isn't an option. It should be easy to keep him at arm’s length. Julia pretends to be Bran's new assistant as she moves into his mountain home. She acts shy and reserved, a delicate flower who isn't a threat...when she can totally kick butt any day of the week. She will stay with Bran twenty-four, seven, and make sure he's safe. It's supposed to be business only, and there is no way the guy is her type. He's everything that she doesn't want in a lover. Right? But...the more time they spend together, the more she realizes that the bad boy? It's just an image he projects. There is a whole lot more to the real man.But she’s lying to him.Bran has been betrayed over and over again, and now Julia is lying to him, too. She thought her lies didn't matter. She thought she was keeping him safe, but she never expected to give her heart to the man she's been hired to protect.He’s never met anyone like her.Bran's new assistant is gorgeous, smart, and...making him crazy. He's used to women throwing themselves at him, used to people not caring about who he is—just that he’s famous. But Julia isn't like that. She touches something inside of him, she makes him want, makes him crave everything that he's never had. Soon Bran can't imagine ever letting her go. He needs her, he wants her, and what Bran wants…he gets.As the threats keep mounting, as the stalker closes in, will Bran be able to forgive Julia when he learns the truth? Or will they crash and burn? Because THE HEART YOU BREAK...it could be the one that matters most.Author's  Ready for sin and rock? Because Bran is one sexy singer, and Julia is a bodyguard who will do anything to protect her man. But as Bran falls for Julia, as the lies twist around them, things are going to become wild and dangerous. No cliff-hangers. This book can be read as a stand-alone. So have fun and rock on!",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Mystery",
    "Music"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/45324833-the-heart-you-break"
}