{
  "title": "Democracy Matters: Winning the Fight Against Imperialism",
  "description": "In his major bestseller, Race Matters, philosopher Cornel West burst onto the national scene with his searing analysis of the scars of racism in American democracy. In Democracy Matters, West returns to the analysis of the arrested development of democracy, both in America and in the crisis-ridden Middle East.In a strikingly original diagnosis, he argues that if America is to become a better steward of democratization around the world, we must first wake up to the long history of imperialist corruption that has plagued our own democracy. Both our failure to foster peace in the Israeli-Palestinian conflict and the crisis of Islamist anti-Americanism stem largely from hypocrisies in our dealings with the world.Racism and imperial expansionism have gone hand in hand in our country's inexorable drive toward hegemony, and our current militarism is only the latest expression of that drive. Even as we are shocked by Islamic fundamentalism, our own brand of fundamentalism, which West dubs Constantinian Christianity, has joined forces with imperialist corporate and political elites in an unholy alliance, and four decades after the murder of Dr. Martin Luther King, Jr., insidious racism still inflicts debilitating psychic pain on so many of our citizens.But there is a deep democratic tradition in America of impassioned commitment to the fight against imperialist corruptions---the last great expression of which was the civil rights movement led by Dr. King---and West brings forth the powerful voices of that great democratizing tradition in a brilliant and deeply moving call for the revival of our better democratic nature. His impassioned and provocative argument for the revitalization of America's democracy will reshape the terms of the raging national debate about America's role in today's troubled world.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Philosophy",
    "History",
    "Social Justice",
    "Race",
    "Sociology"
  ],
  "author": "Cornel West",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/45324.Democracy_Matters"
}