{
  "title": "Strength and Honor",
  "description": "Earth's space forces, spearheaded by the United States, had long been at war with the forces of the Palatine Empire, a neo-Roman culture that broke away from Earth's control long ago. But when the alien life-form known as the Hive - a biological force whose only imperative was seek and devour - began wreaking destruction across the galaxy, the Romans were forced to turn to Earth for help. Ceasar Magnus surrendered to Captain John Farragut - commander of the pride of the U.S. space fleet, the battle class starship, the U.S.S. Merrimack - and the period known as the Subjugation began.Even since the surrender, an uneasy peace and alliance had been in force, as all humanity and their alien allies joined together to battle the Hive.When the threat of the Hive seemed to have been neutralized, John Farragut was summoned to Ceasar Magnus' fortress to be honored. But instead, Ceasar Magnus was assassinated and Farragut and the Merrimack were lucky to escape from what could have proved a deadly trap.Now Magnus' son Romulus has taken control of the Palatine Empire and has himself proclaimed Ceasar, and Captain Farragut and the Merrimack are about to face their greatest challenge ever.The forced alliance between the interplanetary Empire of Rome and the United States-led Earth is shattered as Ceasar Romulus declares war, striking at the U.S. Deep Space base and then following up with a direct attack against Earth. Merrimack has no choice but to retaliate with an assault on the Roman capital world of Palatine. In the midst of this chaos, the Hive renews its invasion. And even if John Farragut and his crew can survive all of this, the rogue Roman palterner Augustus - who was long been assigned to his own mission aboard Merrimack - flees the ship when war is declared, and no one knows whether he is only biding his time, waiting to meet Farragut in a final deadly showdown.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Fiction",
    "Military Science Fiction",
    "Science Fiction Fantasy",
    "Fantasy"
  ],
  "author": "R.M. Meluch",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/4534683-strength-and-honor"
}