{
  "title": "La forma en que vivimos: El Ser Humano, su Ruptura con el Medio y Consigo Mismo",
  "description": "Desde siempre, el temor a una catástrofe global ha perseguido al ser humano. Hoy estamos escribiendoun capítulo clave para el futuro de nuestro planeta. ¿Cabe algún espacio para el optimismo? «Los signos del calentamiento global están en todas partes y son mucho más complejos que el incremento de la temperatura global. El aumento del nivel del mar y eventos de calor extremo, la pérdida de hábitats y el desplazamiento de grandes masas humanas, son fenómenos que están cambiando el mundo. Sin embargo, todo ello es solo una de entre las muchas formas en que los seres humanos estamos afectando el planeta. La contaminación de distinto tipo, la transformación de la superficie terrestre, la nueva extinción de especies y el excesivo nivel de consumo generan un estrés sobre el planeta que difícilmente reconocemos en su real magnitud. »En un libro notable -no solo por lo interesante y atingente de su contenido, sino por su estructura lógica-, Fernando Acosta nos invita a revisar antecedentes del pasado, a reparar sobre lo que ocurre en el presente y a meditar sobre el futuro, conformando una historia que nos permite repensar el destino de la Tierra. Junto a esto, su valor también reside en que presenta cada uno de los temas de forma amena, con argumentos y contraargumentos, respaldado por una gran evidencia científica y con constantes referencias a grandes escritores e historiadores, construyendo un relato accesible para cualquier persona interesada en el futuro de nuestro pequeño hábitat cósmico y que esté abierta a cuestionar sus propias decisiones de vida. Todo, en momentos en que la supervivencia tanto de la humanidad como de otras especies parece más incierta que nunca.» Gabriel País, Director Ejecutivo de Axion Reseñ«Un libro ambicioso, informativo y de gran alcance que entrega una visión crítica y excelentemente documentada acerca de la relación del ser humano con la naturaleza, que cubre el pasado y el presente de las sociedades y que reflexiona sobre algunos de los potenciales impactos futuros de las actividades antrópicas. Todos temas trascendentales para la supervivencia de la vida en el planeta tal como la conocemos.»AMBIENTUM (España) «Minucioso recorrido por nuestra atribulada historia como humanidad, poniendo en perspectiva este presente de crisis ambiental. Muy bien documentado y de lectura amena, recorre el camino del hombre y las decisiones que fueron signando el camino hacia la situación crítica en que estamos viviendo.»ECOS (Argentina) «Este texto nos deja tremendamente impresionados. Es un trabajo hermoso donde hay una línea de tiempo estructurada desde el comienzo de los tiempos hasta las experiencias que tenemos en los tiempos actuales. Su fluidez hace que sea muy fácil de leer y por consecuencia de entender. Un libro que debería estar incorporado dentro del currículum de la enseñanza escolar y universitaria. Aquí están los contenidos que necesitamos que sean vistos para impedir la destrucción del medio ambiente.»Sergio Campos, Radio Cooperativa (Chile) «Es impresionante la cantidad de información y la capacidad de mostrar el panorama general que necesitamos hoy día. Es un libro asombrosamente bien fundamentado muy ameno de leer. Como bien señala el título, \"la forma en que vivimos\" es lo que ha provocado los problemas que estamos sufriendo y es el punto de vista desde el cual debemos entender, mirar y enfrentar los desafíos del siglo XXI.»Anahí Urquiza, FACSO, Universidad de Chile «La manera en que el libro aborda la problemática actual de la humanidad y cómo interactuamos con la naturaleza y el mundo hace que este libro sea imperdible y de un tremendo valor. La humanidad solo se salva cuando todos tengamos la conciencia del daño que hemos provocado al medio ambiente. Un libro magistral que nadie puede dejar de leer.»Sergio Hernández, APRIMIN",
  "genres": [],
  "author": "Fernando Acosta Barriga",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/45323601-la-forma-en-que-vivimos"
}