{
  "title": "Church of Lies",
  "description": "From the Preface:  \"My name is Flora Jessop. I've been called apostate, vigilante, and crazy bitch, and maybe I am. But some people call me a hero, and I'd like to think they're right too. If I am a hero, maybe it's because every time I can play a part in saving a child or a woman from a life of servitude and degradation, I'm saving a little piece of me, too.I was one of twenty-eight children born to my dad and his three wives. Indoctrinated to believe that the outside world was evil, and that I resided among the righteous, I was destined to marry a man chosen for me by the Prophet. I would then live in harmony with my sister-wives, bear many children, and obey and serve my future husband in this life and throughout eternity. But my innocence didn't last long. While still a child, I understood that the church of the righteous was nothing but a church of lies.When I was eight years old my father sexually molested me for the first time, raping me when I was twelve. I tried to kill myself. Beaten, molested, taunted, and abused by family members alleging they only wanted to save my soul became a daily routine, I ran from this abuse more than once in my early teens--even attempting to cross the desert on foot. My family hunted me down. I thought government agencies would provide me safety if I reported my father. Instead, police and social services colluded with the FLDS to return me to my family and I ended up back inside polygamy, right where I started.\"Flora goes on from there to tell the dramatic true story of how she ultimately escaped and has been fighting against frustrating obstacles with hard fought successes in rescuing women and children from the FLDS. It's a story you can't put down.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Religion",
    "Cults",
    "True Crime",
    "Biography",
    "Polygamy"
  ],
  "author": "Flora Jessop",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/4533197-church-of-lies"
}