{
  "title": "So Late So Soon",
  "description": "Luke Thurber REALLY regrets messing with the ancient time artifact that his Dad found in storage at the museum. If only he'd stuck with his homework instead, he wouldn’t 1. Accidentally cloned himself 2. Left his mp3 player in the early 1980s, where some enterprising plagiarist used it to rewrite pop music history 3. Accidentally cloned himself again... Join the Thurbers and their resurrected family dog on a frantic, funny and thought-provoking chase through history as they flee the attentions of Silverberg, the powerful Guardian of Time who has sworn to stop their meddling - PERMANENTLY. SO LATE SO SOON is a serio-comic story of growing up, messing up, and looking up to a parent who, not so long ago, was every bit as confused as you were... --------------------------------------- Pre-publication feedback which gives some further \"If you like Cory Doctorow’s YA or The Time Traveler’s Wife or Beverly Cleary or Roald Dahl or Calvin and Hobbes or 80s TV serials... then you'll enjoy this. SO LATE SO SOON is fun but touches on serious themes. There's 'gritty history' and genuine peril, but it's a modern, tech-literate adventure story designed to keep children turning the pages (which it does very effectively!).\" \"Fast paced time travel tale, laden with natty turns of phrase, \"So Late So Soon\" will have you leaping from chapter to chapter. Who is this Tony guy? How deep does his interference in time go and who will stop him! I read 10 chapters over a glass of wine in the kitchen while burning dinner. It scans like a movie script, the narrative instantly playing out in the visual cortex like the words are not even there. Gonna consume this garage science phenomena rapid and feed it to the weens for feedback. There's a multi series TV spinoff around the corner, gotta be. Dr. Seuss never stared into infinity like this.\" \"It's partially entry-level SF and partially genre homage (can you spot all the namechecks?); steeped in the classics but contemporary and very addictive.\"",
  "genres": [],
  "author": "Harry Tynan",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/45358229-so-late-so-soon"
}