{
  "title": "The Imperfects",
  "description": "HIGHLY RECOMMENDED BY GOOD MORNING AMERICA · PARADE · OK! MAGAZINE · ELLE CANADA · CHRISTIAN SCIENCE MONITOR · PUBLISHERS WEEKLY“A page-turning family saga, this book will entertain readers of all generations.” — Good Morning America“Compassionate, thoughtful, and surprisingly moving… [ The Imperfects ] will satisfy fans of Maggie Shipstead and Celeste Ng.” —BooklistFrom the bestselling author of The Bookshop of Yesterdays comes a captivating new novel about a priceless inheritance that leads one family on a life-altering pursuit of the truth.The Millers are far from perfect. Estranged siblings Beck, Ashley and Jake find themselves under one roof for the first time in years, forced to confront old resentments and betrayals, when their mysterious, eccentric matriarch, Helen, passes away. But their lives are about to change when they find a secret inheritance hidden among her possessions—the Florentine Diamond, a 137-carat yellow gemstone that went missing from the Austrian Empire a century ago.Desperate to learn how one of the world’s most elusive diamonds ended up in Helen’s bedroom, they begin investigating her past only to realize how little they know about their brave, resilient grandmother. As the Millers race to determine whether they are the rightful heirs to the diamond and the fortune it promises, they uncover a past more tragic and powerful than they ever could have imagined, forever changing their connection to their heritage and each other.Inspired by the true story of the real, still-missing Florentine Diamond, The Imperfects illuminates the sacrifices we make for family and how sometimes discovering the truth of the past is the only way to better the future.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Mystery",
    "Family",
    "Adult",
    "Contemporary"
  ],
  "author": "Amy Meyerson",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/45422542-the-imperfects"
}