{
  "title": "Last of the Gladiators: A Memoir of Love, Redemption, and the Mob",
  "description": "When the author discovered his 77-year old father, alone and nearly dead, in the intensive care unit of New York Presbyterian Hospital, he makes a critical decision. \"You're not going out this way,\" the author promises his father. Hours later, he's loaded onto a Medevac jet, headed for a California coastal town and an unknown future. As the son beings to execute, with single-minded focus, a monumental plan to give his father, one of the most accomplished trial layers of his generation, a few more good years, word of the lawyer's unexpected escape from New York to California reverberates in the Mob's smoke-filled backrooms, the country's highest-flying corporate boardrooms, and America's halls of Justice.Then, in the role reversal of all role reversals, the son begins to personally look after the father's deepening medical needs and, determined to give him \"a good quality of life,\" cooks him his favorite Italian dishes and takes him on trips all across the world. The son also corrals his father's near photographic memory, and the master trial lawyer narrates a masterful story about America's crime scene of the past half century--a tale of organized crime, politics, trial law, personal redemption, indomitable spirit, and family loyalty. Not to be outdone, the author's lifelong struggle with bipolar disorder is revealed for the first time. As a writer and publisher, he is a walking petri dish of expert insight about, and personal conquests over, mental illness. He fights tooth and nail to save his beloved father, and we see first-hand how the author faces down his own personal demons with the guile and smarts that only his father could have gifted him. The wily attorney not only stays alive another five years, but he also has a ball doing it. The story comes in full circle when the son begins to realizes that he did not, in fact, \"save\" his father. His father \"saved\" him. Last of the Gladiators is the intense and unforgettable story of how the love between a father and son can overcome any and all obstacles, of how the very limits of life can be overcome. It is a story that could only be told by the father-son team who rode into the eye of the storm and lived to tell about it. Part intimate portrait and part historical saga, Last of the Gladiators will leave readers in a state of captivation, fascination, and inspiration.",
  "genres": [],
  "author": "James M. LaRossa Jr.",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/45427390-last-of-the-gladiators"
}