{
  "title": "Forever Moore",
  "description": "With his raven hair and snow-white skin, Lord Ansil Eirwin draws unwanted attention wherever he goes. After his father’s untimely death, Ansil is set to become Duke of Ravenswood on his next birthday. The gallant and timid lord would never dream of shirking responsibility, so he subverts his desires in order to please his mother and new stepfather, Reginald.Orien Moore, known as the Huntsman, lives on the fringes and has forsaken close bonds with anyone, even the misfits he has taken in. When Orien is called upon by his brother, Reginald, to kill the pampered future duke, it is the perfect opportunity to seek revenge against his power-hungry brother. Orien formulates a plan to use Reginald’s vicious request to his advantage by kidnapping Ansil and holding him hostage until he can fulfill his birthright.Soon Orien realizes that Ansil is nothing like he’d expected. Kind and joyful, Ansil enchants Orien and his ragtag group. And Ansil, in turn, cannot help but be curious about the gruff huntsman as Orien’s vulnerabilities are exposed. Their mutual interest transforms into affection, followed by overwhelming desire. But they are living on borrowed time.With Reginald seeking power in Ravenswood, they have no way of knowing what will transpire once Orien returns Ansil to his proper place in society. The only certainty is that the odds are stacked against them. Will the young lord and his huntsman ever have the chance to experience the happily ever after they’ve found in each other’s arms?***PLEASE NOTE: FOREVER MOORE is a romantic fairy tale—minus the magic—that features one reluctant lord, one brooding huntsman, and plenty of angsty, forbidden love. It’s loosely based on a treasured fairy tale in a make-believe setting that isn’t part of any specific time period and doesn’t play by any traditional rules. It also completely stands alone from EVER AFTER.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "LGBT",
    "Historical",
    "Gay",
    "Enemies To Lovers"
  ],
  "author": "Riley Hart",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/45421644-forever-moore"
}