{
  "title": "Beside Every Successful Man: A Woman's Guide to Having It All",
  "description": "“There is a reason this book is titled beside every successful man rather than behind him. It is about taking the best part of the progress women have made and combining it with age-old wisdom to create a more satisfying future for both you and your husband. The wives who were the models for this book are not put-upon ‘little women.’ They didn’t abandon their own ambitions and desires by helping their husbands achieve theirs. They fulfilled them. Their service isn’t the same thing as subservience—they stand beside their husbands as equal partners. . . . This book is about real women who practiced simple though sometimes challenging principles to help their husbands achieve results that benefited their entire family. . . . What you’re about to read won’t tell you what you should want. It will tell you how to get what you do want.”—from the author’s introduction to Beside Every Successful Man“Stay-at-home wife”? “Stay-at-home mom”? In our parents’ day, those labels were either proudly worn or grudgingly accepted, but to nearly everyone they meant the same thing: a woman whose lifestyle involved running the household, preparing the meals, and tending to her husband and kids.What has happened since? Station wagons have yielded to sport-utility hybrids, technology has arrived with a myriad of new ways to stay connected, and a new army of educated, highly skilled women has reinvented—and reembraced—“stay at home.”Today’s female “stay-at-homer” tends to be much more highly educated and work-credentialed, which opens up exciting possibilities, chief among them the opportunity to be her husband’s most important career partner, mentoring and advising him to reach a level of success he wouldn’t achieve otherwise.The unexpected dividends? Here, journalist and researcher Megan Basham persuasively argues that those who choose home as “command central” can expect a stronger marriage, but also—eventually—a higher income. Ironically, passing up that second paycheck frees up time to guide your husband to the kinds of professional triumphs that are money multipliers, creating long-sought financial freedom for your family.Far from being homemaking June Cleavers, the women Basham investigates are firebrands, with skills ranging from public relations and accounting to executive decision-making. Many have pedigreed educations. While they were in the working world, what these women longed for was not a life of lunching and spa days but, rather, time to reflect and the comfort of being part of a joint family mission. For these trust-their-gut women searching for intellectual satisfaction and serenity, the answer was to help their husbands achieve a professional dream.To show how it is possible to “have it all,” Basham profiles a wide range of wives, not just those whose husbands (like former Time Warner CEO Dick Parsons and Amazon founder Jeff Bezos) have risen to national prominence, but those whose husbands have triumphed outside the limelight. Each of these women, it turns out, has led a richly satisfying life—partly achieved by assuring her husband’s success.One of the most provocative and convincing books ever written on the topic of women and work—a manual that, with its precise tips, will speed women toward the balance they seek— Beside Every Successful Man doesn’t just tell women what to do, it shows them how in a way that is inspirational.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Megan Basham",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/4542112-beside-every-successful-man"
}