{
  "title": "Being and Having",
  "description": "I hope that this book will be widely read, and I especially commend it to four classes of I. For myself I have come across nothing more important than M. Marcel's writings here and elsewhere on the problem of metaphysics. I say problem for we are all of us these days in the end puzzled as to what exactly metaphysics is. The strict Thomist has his so has the so too the Biblical theologian who is much too ready to find in the decay of ontology an argument for the authenticity of 'Biblical perspectives'. M. Marcel was trained in the tradition of and he knew the influence both of Bergsen and of W. E. Hocking. His conversation with himself certainly betrays their but it is of far wider significance. Professor Ayer and Dr. E. L. Mascall have their answer to the question what ontology they have their formulae. Marcel probes beneath these answers; for him ontology is much more than a body of doctrine. It is the intellectual expression of the human situation; what is expressed in the syllogisms of, for instance, Père Garrigou-Lagrange, is valid only in so far as it catches and summarises the very being of man and the universe, as that being is lived through and met with by man in his pilgrimage through life. I find as I read M. Marcel that the frontiers are blurred reflection, metaphysics, spirituality. And that is the strength of his seemingly inconsequent method. In a way he is too wise to suppose that the arguments of the philosophia perennis are enough in their abstract form to convince a man; they only carry conviction in relation to a whole experience of life of which they are the expression. The issues between the Thomist, the positivist, the idealist are not issues simply of doctrine but of life; and to see what they are, one must probe, stretching language beyond the frontiers of poetry, somehow to convey the issues as things through which men live. 2. The book should be studied closely by the moralist whether he be philosopher or moral theologian. Where some of the most familiar ethical ideas are concerned, Marcel reminds us of their 'inside' when we so often in our discussion think simply of their 'outside'. What is a promise? We have our answer pat, our formula which permits us to go on with the discussion of our obligations to keep the promises we have made and so on. We don't wait to probe. I find myself inevitably using that word 'probe' again and again in connection with M. for what he does is to probe the unsuspected profundities of the familiar. Most professional students of ethics are morally philistine, men who give little time to penetrating the 'inside' of the ideas they are handling. And there Marcel pulls them up short. 3. The book should be widely read by the many Christian 'fellow-travellers' of today, those who follow, as it were, afar off the Christian way without themselves coming yet to the point of an act of faith in the Crucified. Its very incompleteness will respond to their groping anxiety, and it will enrich their vision of life. And this it can do because it eschews dogmatic exposition seeking rather to shew the inside of the truly Christian way of life. Fidelity, hope, charity, mystery-these are fundamental categories of the Christian and of all these Marcel has much to say, which is in every way fresh and yet at the same time rooted in the tradition of Catholic Christianity. The reader of such a work as Albert Camus' La Peste, with its preoccupation with the problem of an atheistic sanctity, will understand M. Marcel. In a way he challenges the possibility of Camus' vision; and he does so not on dogmatic grounds but by an analysis of holiness and goodness which shews indirectly their inseparability from acknowledgment of the all-embracing mystery of God. An age which has known evil as ours has and does still know it, is inevitably interested in goodness; and it is with goodness, as something inevitably i",
  "genres": [
    "Philosophy",
    "France",
    "Religion",
    "20th Century",
    "Theology",
    "Nonfiction"
  ],
  "author": "Gabriel Marcel",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1242857.Being_and_Having"
}