{
  "title": "First Time",
  "description": "It’s 2007, and no one is out at Hamilton High School…  …least of all Cody McPherson, the star quarterback everyone says is destined for the NFL; the boy who the entire school expects to see crowned Homecoming King in a few weeks.  Cody’s dad wants to see Cody start the professional football career he’s been grooming him for all his life. Cody’s friends all want him to hurry up and ask Jessica Edmonds to be his Homecoming date. Some days, it feels like everyone in the state of Ohio wants to chime in with an opinion about which college he should play for.  Just about the only one who doesn’t seem to want anything from Cody is Simon Andrews, the transfer student who’s been tutoring him in biology. Cody’s pretty sure he wants something from Simon, though. Not something he can ever admit to, of course. Not something he’d ever do anything about. And definitely not something he expects Simon to want, too.  It’s 2007, and Simon has no plans to come out any time soon…  …especially not before he graduates. Hamilton is the sixth school that Simon Andrews has attended during his high school career, and all he wants to do is keep his head down, his grades up, and make it through graduation without attracting any attention. Of course, that doesn’t mean there aren’t things at Hamilton that attract Simon’s attention.  Well, just one thing, really: Cody McPherson, the too-nice, too-hot, too-straight jock who Simon’s been crushing on—er, tutoring, ever since the start of the school year.  Simon has started looking forward to his study dates with Cody more than he should, but he’s smart enough to know nothing will ever come of it. He can’t imagine ever letting Cody know he’s interested—or letting anyone else at school know, either. Not after he’s already experienced firsthand just how ugly coming out at the wrong time, to the wrong people, can be. Besides, Simon doesn’t expect to be at Hamilton for long enough to matter. Sure, his mother has promised that this time, she’ll hold down a job long enough for them to stick around, but Simon’s too smart to trust that, either.  There’s a first time for everything though, and in 2007 at Hamilton High School, there are going to be a lot of firsts.  First Time is a coming-of-age gay romance novella of approximately 34,000 words that contains an unruly set of butterflies who take up residence in Simon Andrews’ stomach, biology tutoring that comes with a heaping side of sizzling chemistry, a quarterback with two left feet, a first date with far too many participants, and two boys who are each terrified of coming out… right up until the moment that they finally manage to do it. Every Stella Starling romance takes place in the same interconnected, contemporary world. First Time is a prequel to Cody and Simon’s present-day love story, which will be told in the novel Second Chance, scheduled for release in 2019.",
  "genres": [
    "M M Romance",
    "Romance",
    "Sports",
    "Contemporary",
    "Young Adult",
    "LGBT",
    "Friends To Lovers"
  ],
  "author": "Stella Starling",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/45429075-first-time"
}