{
  "title": "Cuba Libre: Una historia real de amor sobre escapar dentro y fuera de Cuba",
  "description": "Cuba Libre: un engaño amoroso para salir de isla caribeña   —«Porque el amor es el motor que mueve el mundo. Y es el amor y no el destino, el motor que ha movido mi vida».   —«Creo que deberíamos, deberíamos abogar por el fin del embargo».- Hillary Clinton sobre Cuba en el consejo de relaciones internationales en 2014.   Esa es la oración clave que envuelve esta historia de amor real desarrollada en las calles de la Habana, Cuba, y que, de alguna manera, refleja cómo la vida de los cubanos cambió después de la implementación de la Ley de Democracia Cubana por el Congreso de los Estados Unidos de Norteamérica.  En ese contexto, la escritora Cheryl Ness relata la historia de Francine, quien viajó —y se enamoró— de la isla caribeña, esa que «vive anclada en un realismo mágico latinoamericano».  Cuba Libre. Una historia sobre escapar dentro y fuera de Cuba es el título del primer libro de Ness, en el que describe a detalle cómo es la vida del pueblo cubano sometido a un sistema comunista y dictatorial, pero también cómo las patrañas amorosas han sido parte de su gente para lograr salir de la isla en busca de mejores oportunidades. Sí, un engaño amoroso en dictadura. Esa es la historia de esta obra literaria que muestra uno de los cientos de casos de amoríos “sin amor” o por conveniencia.  Y es que con la implementación de la Ley de Democracia Cubana, desde 1992, en la isla caribeña sus hombres y mujeres ven en el “amor” la salida al futuro, a la democracia, a la libertad. La experiencia de Francine —la protagonista— no es única, pero es una de esas cientos de historias que pocos autores han escrito.  Cuba, aún en la actualidad, mantiene sus majestuosidades arquitectónicas y culturales, pero también el dogmatismo y el empobrecimiento del comunismo, por lo que cientos de cubanos se “enamoran” por conveniencia en busca de ser amparados por la legislación norteamericana, que se implementó como un mecanismo de ayuda humanitaria y, en definitiva, salir sin retorno de Cuba.  Francine — quien solo encontró un verdadero amor: quedarse en la isla que la adoptó— vivió muy de cerca esa experiencia. Ella, al igual que muchos turistas extranjeros, se enamoraron de la isla y de algún cubano, pero también terminaron desilusionados cuando se enteraron que solo jugaron con sus sentimientos y que se convirtieron en el pasaje de huida, en el trampolín, de la diáspora cubana.  «En estos momentos escribo mis memorias. Escribo lo que hice en mi vida por amor, creyéndome que lo que hacía estaba sujeto a las leyes del destino, creyéndome que era el destino el que tomaba las decisiones por mí. Pero mis años de experiencia me han enseñado que no existe el destino, que lo que lleva a todos los seres humanos a moverse de un país a otro, a evolucionar, a cambiar de forma de ver la vida es el amor».   Autor biografía  En su primer libro en español, la escritora alemana Cheryl Ness relata cómo es la vida en la isla caribeña y cómo el amor por conveniencia —muchas veces— es una válvula de escape para los cubanos que anhelan una vida en libertad plena.",
  "genres": [],
  "author": "Cheryl Ness",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/45427828-cuba-libre"
}