{
  "title": "The Secret Trilogy",
  "description": "Three Novels. Two Women. One Epic Love Story.High-profile psychiatrist, Dr. Helaine Kristenson--AKA the \"Love Doc\"--is not just talented and beautiful. She's the leading authority in the field of psychosexual relations and the bestselling author of the how-to bible, \"Keeping Mr. Right.\" Professionally, the esteemed doctor deals with secrets of the heart everyday. Privately, she even has a few of her own to keep her busy...Straight-laced chief investment strategist, Lydia Beaumont, is not just talented and beautiful. She's a consummate professional and headed to the top of the corporate ladder at financial giant, Soloman-Schmitt. Professionally, she has no secrets to speak of. Privately, she's just unearthed one that's going to rock her world a bit...Bedazzling neophyte, Venus Angelo, is not just talented and beautiful. She's a self-made millionaire ten times over again and on the fast track with her high-powered career in corporate finance. Professionally, she's a dedicated and driven perfectionist. Privately, she's full-blown enigmatic and somewhat reckless. And she's got way too many skeletons in the closet...Savvy and seasoned investment banker, Delilah Lewiston is not just talented and beautiful. She runs the largest and most solid bank in the world. Professionally, she \"speaks softly and carries a big stick\" and doesn't trade or take stock in any secrets. Privately, however, she's safeguarding a couple of gems...Controversial super-model, Sharon Chambers, is not just talented and beautiful. She's the highest paid poser on the planet. Not to mention the most spoiled and temperamental. Professionally, her life of debauchery and conquest is an open book, about which, she really doesn't give a damn. Privately, though, even she's keeping a few secrets. But that isn't going to last...Sex, love, money, lawyers, reporters, action, adventure, intrigue and blackmail--what's YOUR secret worth?",
  "genres": [
    "Lesbian",
    "Lesbian Romance",
    "LGBT",
    "Lesbian Fiction"
  ],
  "author": "Francine Saint Marie",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/4542908-the-secret-trilogy"
}