{
  "title": "London is a Forest",
  "description": "Can a city be a forest? At first glance, this does not chime with our childhood idea of the `wild wood' - a dark entanglement of trees, where humans fear to tread. But a forest does not need to be dense and impenetrable, and it's not unheard of for people to live in them either. In London, 8.6 million people are crammed into just 600 square miles alongside 8.3 million trees, and millions upon millions of other plants, insects and animals. According to one UN definition, this makes the city a forest. The Forestry Commission agree, describing London as the world's largest urban forest. And it's a very special, urban forest at that. Following a number of trails through the rich diversity of London, this book will look closely at the urban forest, our relationships with it and attitudes towards it and will uncover the fascinating stories and secrets it holds. Through these paths that meander through the urban forest, author Paul Wood explores its geography, its past and future, and looks at the remarkable variety of life supported in this unique metropolitan ecosystem. From the edgelands to the beating heart of the clamorous 21st century megacity, a wealth of arboreal details, history, legend and anecdotes will be revealed along the way. You'll discover some of the species found here, and the people who have helped to shape this remarkable environment over many centuries. Complementing the trails, Wood will look in more detail at the fascinating stories of some of the iconic, and some of the more hidden species that define the urban forest. These will include familiar tree species like the London Plane, Oaks, Cherries and Hornbeam, alongside the rare Wild Service Tree and the surprising Tree of Heaven. Other inhabitants of the forest such as parakeets, urban foxes and, of course, humans will also be featured.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Paul    Wood",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/45431355-london-is-a-forest"
}