{
  "title": "Owner of a Broken Heart",
  "description": "“…a sexy romp with an undercurrent of emotion and familial devotion.”—Entertainment Weekly The four very different Richardson sisters have one thing in common: their fierce loyalty to their family and pride in the historic bed and breakfast they own. But unexpected desire will challenge them in ways they never imagined . . .  Sportswriter Nina Richardson had the perfect life away from her family’s famous shadow. But a social media blowup and rejection by her boyfriendbrought her back to their peaceful Charleston, South Carolina B&B to figure out what went wrong. So there’s no way she’s going to trust the crazy-hot sparks flying between her and handsome new employee Clinton Jefferson. It’s just reckless, rip-his-clothes-off, one-night-and-forget-it lust—right?   Fresh from working for the Richardsons’ biggest rival, Clinton wants to show his modernization ideas aren’t sabotage or a gimmick. Getting involved with the rebellious Nina means trouble for sure—but he can’t resist showing this stubborn, fiery woman how she should be loved. But false accusations and Nina’s returned ex shake their passion—and fragile trust—to the core.  Now between cascading obstacles and conflicting loyalties, can Clinton and Nina untangle what they really want in time?“Hodges excels at portraying her trademark protagonists—smart, successful career women—with Nina and her siblings, and Clinton is as appealing as he is business savvy. Fans of Susan Mallery and Sheryl Woods will enjoy the keen and sexy launch of Hodges' Richardson Sisters series.”—Booklist  “More impressive is Hodges’s characterization of Nina’s two sisters, each of whom is strong-willed, unique, and sure to provide fodder for future installments. Sizzling love scenes and a strong sense of family will have readers returning for the next in the series.”—Publishers Weekly  “Owner of a Broken Heart demonstrates Cheri Hodges’ ability to craft interesting characters and a decent sexy love story.”—All About RomancePraise for Strategic Seduction “Readers will find themselves craving a trip to Georgia just to visit the restaurants, diners and coffee shops mentioned in this smart contemporary romance.” —Bookpage “A sexy, impassioned Southern romance. . . . The dialogue is witty, and Hodges does a good job of bringing Atlanta and Paris to life. . . . The genuine friendships and suspenseful blackmail plot carry the story to a satisfying ending.” —Publishers Weekly “Hodges builds a community of friends and lovers and uses Atlanta itself as another character . . . an enjoyable romance.” —Kirkus Reviews",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Cheris Hodges",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/45437750-owner-of-a-broken-heart"
}