{
  "title": "Turtles All the Way Down / The Fault in Our Stars / An Abundance of Katherines / Paper Towns / Looking for Alaska / Will Grayson Will Grayson",
  "description": "John Green Collection 6 Books Set Includes titles In This Set:- Turtles All the Way Down, The Fault in Our Stars, An Abundance of Katherines, Paper Towns, Looking For Alaska, Will Grayson Will Grayson. Description:- Turtles All the Way Down Living with anxiety and OCD is enough but when Daisy, her Best and Most Fearless Friend, brings her on a mission to find a fugitive billionaire things are about to get even more complicated.To find Russell Pickett, Aza must enter the world of his geeky, but maybe kind-of-cute son, Davis. The Fault in Our Stars Despite the tumour-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. An Abundance of Katherines When it comes to relationships, Colin Singleton's type is girls named Katherine.And when it comes to girls named Katherine, Colin is always getting dumped.Nineteen times, to be exact. Paper Towns Quentin Jacobsen has always loved Margo Roth Spiegelman, for Margo (and her adventures) are the stuff of legend at their high school. So when she one day climbs through his window and summons him on an all-night road trip of revenge he cannot help but follow. Looking For Alaska BEFORE. Miles Halter’s whole life has been one big non-event until he starts at anything-but-boring Culver Creek Boarding School and meets Alaska Young. Gorgeous, clever, funny, sexy, screwed up and utterly fascinating she pulls Miles into her world, launches him into a new life, and steals his heart. Will Grayson, Will Grayson One cold night, in a most unlikely corner of Chicago, Will Grayson crosses paths with . . . Will Grayson.Two guys with the same name, running in two very different circles, suddenly find their lives going in new and unexpected directions, and culminating in epic turns-of-heart and the most fabulous musical ever to grace the high-school stage.",
  "genres": [],
  "author": "John Green",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/45438446-turtles-all-the-way-down-the-fault-in-our-stars-an-abundance-of-kath"
}