{
  "title": "Charlie, Love and Clichés",
  "description": "Six years ago at a random diner I met a stranger and he became the-one-who-got-away, or more correctly the-one-who-didn’t-show-up.A small advice from me to you: if you haven’t dated, touched *or* kissed a guy in years and *years*…do not try to crawl away or hide from the-one-who-got-away. It’s not a good look.William Carter, the stranger I’d met six years ago was the last person I’d imagine ever seeing at my dad’s firm where I work. While I panic and fight off the butterflies in my stomach and in general struggle to act normal, I realize he doesn’t even remember me. I’m not sure if I should feel relieved or heartbroken. Things get worse when I learn we’ll need to work in close quarters to each other, but at least I let him know that I don’t have a crush on him anymore right away. Just in case he gets any ideas.While I’m in the process of writing lists and making serious changes in my life, because I decide I’m ready to be the heroine in my own story; having William just a breath away is not helping things. Especially when things shift between us and we start to make eye contact in meetings. Then he shows up in places I least expect him to…as in blind dates and sex clubs. He also gives me cheese because he knows how much I like it and there are secret notes he leaves in my office. If you were wondering, I still don’t have a crush on him though. Nope.Even though I’d promised myself I’d never wait around for another guy and postpone my own life, I’m afraid William Carter who looks at me as if I’m his and was always supposed to be his might ruin my hopeful plans. And quite possibly me for any other guy since I’m craving his touch like I’ve never craved anything in my life before. But we both know we’re a losing game so we keep admitting that neither one of us has a crush on the other.Not anymore. Not at all. Not even a little bit.",
  "genres": [
    "Romance",
    "Second Chance",
    "Contemporary",
    "Workplace Romance",
    "Contemporary Romance",
    "Friends To Lovers",
    "Second Chance Romance"
  ],
  "author": "Ella Maise",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/45450189-charlie-love-and-clich-s"
}