{
  "title": "Mother Land",
  "description": "From the critically acclaimed author of America for Beginners, a wonderfully insightful, witty, and heart-piercing novel, set in Mumbai, about an impulsive American woman, her headstrong Indian mother-in-law, and the unexpected twists and turns of life that bond them.When Rachel Meyer, a thirtysomething foodie from New York, agrees to move to Mumbai with her Indian-born husband, Dhruv, she knows some culture shock is inevitable. Blessed with a curious mind and an independent spirit, Rachel is determined to learn her way around the hot, noisy, seemingly infinite metropolis she now calls home. But the ex-pat American’s sense of adventure is sorely tested when her mother-in-law, Swati, suddenly arrives from Kolkata—a thousand miles away—alone, with an even more shocking announcement: she’s left her husband of more than forty years and moving in with them. Nothing the newlyweds say can budge the steadfast Swati, and as the days pass, it becomes clear she is here to stay—an uneasy situation that becomes more difficult when Dhruv is called away on business. Suddenly these two strong-willed women from such very different backgrounds, who see life so differently, are alone together in a home that each is determined to run in her own way—a situation that ultimately brings into question the very things in their lives that had seemed perfect and permanent . . . with results neither of them expect.Heartfelt, charming, deeply insightful and wise, Mother Land introduces us to two very different women from very different cultures . . . who maybe aren’t so different after all.“Lively and evocative, Mother Land is a deftly crafted exploration of identity and culture, with memorable and deeply human characters who highlight how that which makes us different can ultimately unite us.”—Amy Myerson, author of The Bookshop of Yesterdays and The Imperfects",
  "genres": [
    "Fiction",
    "India",
    "Contemporary",
    "Book Club",
    "Audiobook",
    "Novels",
    "Adult"
  ],
  "author": "Leah Franqui",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/45449494-mother-land"
}