{
  "title": "The Empowered Empath: A Simple Guide on Setting Boundaries, Controlling Your Emotions, and Making Life Easier",
  "description": "https://amzn.to/327gqvB \n  \n\nAre you tired of feeling drained and lethargic?\n\nDo you feel as if being an empath has become more of a curse than a blessing?\nThe joys and pains of the world can be overwhelming, especially if you have the gifts of being able to feel the emotions of others.  Judy Dyer brings you her transformative journey to becoming an Empowered Empath. After reading and applying the principles laid out in this book, you will awaken everything that has been lying dormant within you and no longer feel the need to shy away from it or hide it. Emotional freedom, happiness and joy belong to you and its time to claim it.  Do you want to feel confident in your day to day interactions with people?  This book delivers to you numerous step by step takes on how you can discover your true potential and what you are meant to do with your amazing life. It can train an unskilled Empath to go from a state of turmoil and frustration, to become comfortable and free in their skin. With The Empowered Empath, you’ll discover:  \n   How to become an assertive empath \n  \n   How to set boundaries \n  \n   How to make the best career decisions for you as an Empath \n  \n   New ways to find peace living in a cruel world \n  \n   How your health can impact your gifts as an Empath \n  \n   How you can raise an Empath child in a gentle and understanding way \n  \n   A strategic plan to take control of your overwhelming emotions and live your best life now \n Whatever your desires as an Empath are, you can achieve it once you realize how to develop your gifts with this powerful guide. Discover your leadership, creativity, and other strengths to fulfill your destiny along with the rest of the Empath community.  Won’t you want to discover how to truly master your gift and become all who you were destined to be? Get your copy of this fantastic guide to unlock your true potential today!  Click the link below to view the book on Amazon!  https://amzn.to/327gqvB",
  "genres": [
    "Self Help",
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Spirituality",
    "Personal Development"
  ],
  "author": "Judy Dyer",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/45443015-the-empowered-empath"
}