{
  "title": "Forge Your Upgraded Self - How to Overcome Low Self-Esteem and Broken Confidence",
  "description": "In today’s world, there exists an outbreak so infectious that it spreads worldwide. It knows no bound. It recognizes no gender, age, or rank. It is so debilitating that it erodes so many people of their potentials and robs them of their dreams. It surreptitiously realigns the way people see, feel and think of themselves including the perspectives by which they view the people around them.  85% of the world’s population today are suffering from low self-esteem and the majority of them are not even aware. This is pandemic in the sense that it is harmfully affecting many of us in today’s culture- in our career, relationship, personal growth, and well-being.  Studies reveal how low self-esteem has been linked to violent behavior, school dropout rates, teenage pregnancy, low academic achievement, and suicide.  • World Health Organization reported that one in every forty (40) seconds, a person dies by suicide reaching a staggering number close to 800,000 people every year. It’s the second leading cause of death among 15 to 29-year-olds globally; • 61% of teen girls with low self-esteem admit to talking badly about themselves;”  • “25% of teen girls with low self-esteem resort to injuring themselves on purpose or cutting when feeling bad about themselves;”  • “The top wish among all girls is for their parents to communicate better with them, which includes more frequent and open conversations about what is happening in their own lives”   These statistical figures are downright chilling and will continue to lurk in unless and until we decide to start a positive change. Change starts from within.   In this book, I will show you how to forge a better self to achieve a more productive and successful in life and liberate ourselves from the clutches of self-limiting and self-defeating mindset.",
  "genres": [],
  "author": "Rey Noel G. Sarzate",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/45477912-forge-your-upgraded-self---how-to-overcome-low-self-esteem-and-broken-co"
}