{
  "title": "No Time To Die",
  "description": "Liz Tilberis, the editor in chief of Harper's Bazaar magazine, was at the pinnacle of her career when diagnosed with ovarian cancer, one of the disease's deadliest forms. (\"When ovarian cancer is detected early, the cure rate is at least a 90 percent five-year survival rate for Stage I diagnosis. At Stage IV, they tell you to go home and get your affairs in order,\" she writes.) In 1993, the day after holding a gala holiday dinner for the likes of Ralph Lauren and Donna Karan, Tilberis underwent exploratory surgery that revealed her cancer was at Stage III. Since then, she has survived three recurrences, massive doses of chemotherapy, and a bone marrow transplant. Tilberis's book is notable not only for the sanguine humor which she injects throughout, but also for her honesty regarding what she suspects was the cause of her fertility treatments with the hormone-stimulating drugs Clomid and Pergonal, which she points out are still widely used. (She never conceived a child, but is the mother of two adopted sons.) Tilberis is especially cutting with her descriptions of her coworkers' chilliness and lack of empathy when she first returned to work. It seems that AIDS causes notwithstanding, the world of fashion is still incapable of admitting there is suffering in the world. Tilberis also deserves praise for confessing that her infertility is due to fallopian tube scarring from pelvic inflammatory disease--often caused by sexually transmitted diseases. No Time to Die and Liz Tilberis are inspiring. While her cancer is in no certain way vanquished, Tilberis chooses to treat it as a chronic condition, not a killer. She's made it her mission to use her magazine platform and her position as president of the Ovarian Cancer Research Fund to raise awareness of a complicated and frightening--but possibly preventable--disease. This book is as much a tale of survival and sang-froid as it is an excoriation of the cruelties of the two-faced world of fashion.",
  "genres": [
    "Fashion",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "liz-tilberis",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/4547666-no-time-to-die"
}