{
  "title": "Fervor",
  "description": "Wynn was born an omega but raised as an assassin. His kind is weaker and needs protecting—at least that is what the alphas in power have been saying for decades. In his twenty years, Wynn has seen omegas stripped of their rights, only to have those rights placed in the hands of the nearest alpha. But Wynn is different, recruited at a young age, he’s always known his purpose, to eliminate the worst of the worst. Alphas who should be convicted of the most heinous crimes may avoid prison, but there is no avoiding the tip of Wynn’s blade. When he’s given his next mission, a billionaire alpha developing tech that could take even more autonomy away from omegas, he’s ready, willing and able to do what needs to be done.  From a gritty neighborhood on the wrong side of the tracks, Magnus has spent his life clawing his way to the top. He may have started in the slums, but now he’s a billionaire alpha whose name is the only one that matters when it comes to tech security and defense. He’s close to finally succeeding in creating the omega protection device that may have saved his brother’s life all those years ago. His success hasn’t come without sacrifice. His life is his work, so when a gorgeous omega with a golden gaze and pretty smile bumps into him, he doesn’t have time be interested. But, Magnus can’t ignore his inner wolf and soon all he wants is to be near Wynn, to see him, smell him, claim him.  Immediately after first contact, Wynn is conflicted. He’s positive that he’s never known an alpha like Magnus, but if his name has shown up on Wynn’s list then he must be evil. To think otherwise is to doubt his life’s devotion. And it doesn’t take long for Magnus to have a list of questions a thousand miles long for Wynn, his secretive omega. But his questions don’t stop him from realizing Wynn isn’t just the bravest man he knows, he’s also his mate.  When outside forces begin to press in—Wynn’s jealous boss for one—the two must decide what their love is worth, because it may well cost them everything.  Fervor is the first book in the Omega Assassins Club. It is considerably more violent than the average Kiki book but with the same spice, humor, and heart. Readers should be aware Fervor contains mentions of graphic violence and abuse. However, a swoon-worthy HEA is guaranteed!",
  "genres": [
    "M M Romance",
    "Omegaverse",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "LGBT",
    "Fantasy"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/45480156-fervor"
}