{
  "title": "Dark Alliance: The CIA, the Contras, and the Cocaine Explosion",
  "description": "Major Motion Picture based on Dark Alliance and starring Jeremy Renner, \"Kill the Messenger,\" to be be released in Fall 2014Winner of the 1999 PEN/Oakland Censorship AwardWinner of the 1999 Firecracker Alternative Bookseller (FAB) Award, Politics categoryFinalist for the 1999 Bay Area Book Reviewers AwardsDark Alliance is a book that should be fiction, whose characters seem to come straight out of central the international drug lord, Norwin Meneses; the Contra cocaine broker with an MBA in marketing, Danilo Blandon; and the illiterate teenager from the inner city who rises to become the king of crack, \"Freeway\" Ricky Ross. But unfortunately, these characters are real and their stories are true.In August 1996, Pulitzer Prize-winning journalist Gary Webb stunned the world with a series of articles in the San Jose Mercury News reporting the results of his year-long investigation into the roots of the crack cocaine epidemic in America, specifically in Los Angeles. The series, titled \"Dark Alliance,\" revealed that for the better part of a decade, a Bay Area drug ring sold tons of cocaine to Los Angeles street gangs and funneled millions in drug profits to the CIA-backed Nicaraguan Contras.Gary Webb pushed his investigation even further in his book, Dark The CIA, The Contras, and the Crack Cocaine Explosion . Drawing from then newly declassified documents, undercover DEA audio and videotapes that had never been publicly released, federal court testimony, and interviews, Webb demonstrates how our government knowingly allowed massive amounts of drugs and money to change hands at the expense of our communities.Webb's original article spurred an immediate outcry. Within days of publication, both of California's senators made formal requests for investigations of the U.S. government's relationship with the cocaine ring. As a result, public demonstrations erupted in L.A., Washington D.C., and New York. Then-chief of the CIA, John Deutsch, made an unprecedented attempt at crisis control by going to South Central L.A. to hold a public forum. Representative Maxine Waters later said in George magazine, \"I was shocked by the level of corruption and deceit and the way the intelligence agencies have knowledge of big-time drug dealing.\"The allegations in Webb's story blazed over the Internet and the Mercury News' website on the series was deluged with hits—over a million in one day. A Columbia Journalism Review cover story called it \"the most talked-about piece of journalism in 1996 and arguably the most famous—some would say infamous—set of articles of the decade.\"Webb's own stranger-than-fiction experience is also woven into the book. His excoriation by the media—not because of any wrongdoing on his part, but by an insidious process of innuendo and suggestion that in effect blamed Webb for the implications of the story—had been all but predicted. Webb was warned off doing a CIA expose by a former Associated Press journalist who lost his job when, years before, he had stumbled onto the germ of the \"Dark Alliance\" story. And though Internal investigations by both the CIA and the Justice Department eventually vindicated Webb, he had by then been pushed out of the Mercury News and gone to work for the California State Legislature Task Force on Government Oversight. He died in 2004.The updated paperback edition of Dark Alliance features revelations in just-released reports from the Department of Justice, internal CIA investigations, and a new cache of recently declassified secret FBI, DEA, and INS files—much of which was not known to Webb when writing the first edition of this book. Webb further explains the close working relationship that major drug traffickers had with U.S. Government agencies—particularly the DEA—and recounts the news of the past year regarding this breaking story.After more than two years of career-damning allegations leveled at Webb, joined in the past year by glowing reviews of the hardcover edition of Dark Alliance from shore to shore, the core findings of this courageous investigative reporter's work—once fiercely denied—are becoming matters of public record. The updated paperback edition of Dark Alliance adds yet another layer of evidence exposing the illegality of a major CIA covert operation.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "True Crime",
    "Conspiracy Theories",
    "Crime",
    "American History"
  ],
  "author": "Gary  Webb",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/455652.Dark_Alliance"
}