{
  "title": "Second First Impressions",
  "description": "Distraction (n): an extreme agitation of the mind or emotions.Ruthie Midona has worked the front desk at the Providence Luxury Retirement Villa for six years, dedicating her entire adult life to caring for the Villa’s residents, maintaining the property (with an assist from DIY YouTube tutorials), and guarding the endangered tortoises that live in the Villa’s gardens. Somewhere along the way, she’s forgotten that she’s young and beautiful, and that there’s a world outside of work—until she meets the son of the property developer who just acquired the retirement center.Teddy Prescott has spent the last few years partying, sleeping in late, tattooing himself when bored, and generally not taking life too seriously—something his father, who dreams of grooming Teddy into his successor, can’t understand. When Teddy needs a place to crash, his father seizes the chance to get him to grow up. He’ll let Teddy stay in one of the on-site cottages at the retirement home, but only if he works to earn his keep. Teddy agrees—he can change a few lightbulbs and clip some hedges, no sweat. But Ruthie has plans for Teddy too.Her two wealthiest and most eccentric residents have just placed an ad (yet another!) seeking a new personal assistant to torment. The women are ninety-year-old, four-foot-tall menaces, and not one of their assistants has lasted a full week. Offering up Teddy seems like a surefire way to get rid of the tall, handsome, unnerving man who won’t stop getting under her skin.Ruthie doesn’t count on the fact that in Teddy Prescott, the Biddies may have finally met their match. He’ll pick up Chanel gowns from the dry cleaner and cut Big Macs into bite-sized bits. He’ll do repairs around the property, make the residents laugh, and charm the entire villa. He might even remind Ruthie what it’s like to be young and fun again. But when she finds out Teddy’s father’s only fixing up the retirement home to sell it, putting everything she cares about in jeopardy, she’s left wondering if Teddy’s magic was all just a façade.From the USA Today  bestselling author of The Hating Game and 99 Percent Mine comes the clever, funny, and unforgettable story of a muscular, tattooed man hired as an assistant to two old women—under the watchful eye of a beautiful retirement home manager.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Audiobook",
    "Chick Lit",
    "Adult"
  ],
  "author": "Sally  Thorne",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/45553600-second-first-impressions"
}