{
  "title": "The American",
  "description": "The American is a novel by Henry James, originally published as a serial in The Atlantic Monthly in 1876-77 and then as a book in 1877. Christopher Newman, a ‘self-made’ American millionaire in France, falls in love with the beautiful aristocratic Claire de Bellegarde. Her family, however, taken aback by his brash American manner, rejects his proposal of marriage. When Newman discovers a guilty secret in the Bellegardes’ past, he confronts a moral dilemma: Should he expose them and thus gain his revenge? James’s masterly early work is at once a social comedy, a melodramatic romance and a realistic novel of manners.Excerpt:On a brilliant day in May, of the year 1868, a gentleman was reclining at his ease on the great circular divan which at that period occupied the centre of the Salon Carre, in the Museum of the Louvre. This commodious ottoman has since been removed, to the extreme regret of all weak-kneed lovers of the fine arts; but our visitor had taken serene possession of its softest spot, and, with his head thrown back and his legs outstretched, was staring at Murillo's beautiful moon-borne Madonna in deep enjoyment of his posture. He had removed his hat and flung down beside him a little red guide-book and an opera-glass. The day was warm; he was heated with walking, and he repeatedly, with vague weariness, passed his handkerchief over his forehead. And yet he was evidently not a man to whom fatigue was familiar; long, lean, and muscular, he suggested an intensity of unconscious resistance. His exertions on this particular day, however, had been of an unwonted sort, and he had often performed great physical feats that left him less jaded than his quiet stroll through the Louvre.",
  "genres": [
    "Classics",
    "Fiction",
    "Literature",
    "American",
    "19th Century",
    "Novels",
    "Historical Fiction"
  ],
  "author": "Henry James",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/456501.The_American"
}