{
  "title": "The Year's Best Fantasy and Horror: Sixteenth Annual Collection",
  "description": "For more than a decade, readers have turned to The Year's Best Fantasy and Horror to find the most rewarding fantastic short stories. Ellen Datlow and Terri Windling continue their critically acclaimed and award-winning tradition with another stunning collection of stories. The fiction and poetry here is culled from an exhaustive survey of the field, nearly four dozen stories ranging from fairy tales to gothic horror, from magical realism to dark tales in the Grand Guignol style. Rounding out the volume are the editors' invaluable overviews of the year in fantasy and horror, new Year's Best sections on comics, by Charles Vess, and on anime and manga, by Joan D. Vinge, and a long list of Honorable Mentions, making this an indispensable reference as well as the best reading available in fantasy and horror.The critically acclaimed and award-winning tradition continues with another stunning collection, including stories by Kelly Link, Kim Newman, Corey Marks, Eric Schaller, M. Shayne Bell, Helga M. Novak, Terry Dowling, Michael Libling, Zoran Zivkovic, Bentley Little, Carlton Mellick III, Brian Hodge, Conrad Williams, Tom Disch, Melissa Hardy, Joel Lane, Nicholas Royle, Tracina Jackson-Adams, Karen Joy Fowler, Jackie Bartley, Peter Dickerman, Ramsey Campbell, Adam Roberts, Robert Phillips, Jay Russell, Luis Alberto Urrea, Margaret Lloyd, Stephen Gallagher, Robin McKinley, Haruki Murakami, Theodora Goss, Kathy Koja, Lucy Taylor, Elizabeth Hand, Kevin Brickmeier, Sharon McCartney, Susan Power, Don Tumasonis, Nan Fry.Rounding out the volume are the editors' invaluable overviews of the year in fantasy and horror, Year's Best sections on comics, by Charles Vess, and on anime and manga, by Joan D. Vinge, and a long list of Honorable Mentions, making this an indispensable reference as well as the best reading available in fantasy and horror.",
  "genres": [
    "Fantasy",
    "Horror",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Science Fiction",
    "Speculative Fiction"
  ],
  "author": "Ellen Datlow",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/455800.The_Year_s_Best_Fantasy_and_Horror"
}