{
  "title": "Bird of Another Heaven",
  "description": "From the author of Snow Mountain Passage , a saga of the Donner Party, comes a deeply engaging new novel, set in both our time and the late nineteenth century. It centers on a California woman, half Indian, half Hawaiian, who became consort and confidante to the last king of Hawaii.The story is told by her great-grandson, Sheridan Brody, a Bay Area talk show host, whose life has reached an unexpected standstill. He can’t quite commit—he doesn’t know why—to his Japanese-American girlfriend and her five-year-old son. A corporate merger may soon threaten his job. But when he receives an on-air call from a woman claiming to be his grandmother, Sheridan feels compelled to uncover all he can about this previously unknown branch of his family, embarking on a quest that will change how he sees his future and his past.What he finds, through the journals of his great-grandmother, Nani Keala (aka Nancy Callahan), and through his own investigations, is an almost mythic tale: how Nani, a shy girl from a remote Indian village, learns English at a local white rancher’s school and meets the Hawaiian king, David Kalakaua, on his grand progress by train across the United States in 1881, and returns with him to Honolulu. There, as his young ally and protégée, ever more assured and charming, she plays an integral role in his attempt to revive the monarchy and spirit of his people and, eventually, witnesses the mysterious circumstances surrounding his downfall.Bird of Another Heaven is rich in historical scene and character, based in part on actual events. Nani’s life unfolds against the backdrop of the opening of northern California and America’s rising ambitions in Asia and the Pacific during the 1800s. It is also a story of emotional intensity and compassion, equally compelling for Sheridan’s contemporary journey of self-discovery and the beautifully imagined journey of Nani, a woman of extraordinary power and appeal.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club"
  ],
  "author": "James D. Houston",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/456482.Bird_of_Another_Heaven"
}