{
  "title": "The Demon's Sermon on the Martial Arts",
  "description": "The Demon said to the swordsman, \"Fundamentally, man's mind is not without good. It is simply that from the moment he has life, he is always being brought up with perversity. Thus, having no idea that he has gotten used to being soaked in it, he harms his self-nature and falls into evil. Humandesire is the root of this perversity.\"Woven deeply into the martial traditions and folklore of Japan, the fearsome Tengu dwell in the country's mountain forest. Mythical half-man, half-bird creatures with long noses, Tengu have always inspired dread and awe, inhabiting a liminal world between the human and the demonic, and guarding themost hidden secrets of swordsmanship. In The Demon's Sermon on the Martial Arts , a translation of the 18th-century samurai classic by Issai Chozanshi, an anonymous swordsman journeys to the heart of Mt. Kurama, the traditional domain of these formidable beings. There he encounters a host of demon;through a series of discussions and often playful discourse, they reveal to him the very deepest principles of the martial arts, and show how the secrets of sword fighting impart the truths of life itself.The Demon's Sermon opens with The discourses, a collection of whimsical fables concerned with the theme of transformation-for Chozanshi a core phenomenon to the martial artist. Though ostensibly light and fanciful, these stories offer the attentive reader ideas that subvert perceived notions ofconflict and the individual's relationship to the outside world. In the main body of work, The Sermon, Chozanshi demonstrates how transformation is fostered and nurtured through ch'i - the vital and fundamental energy that flows through all things, animate and inanimate, and the very bedrock ofChozanshi's themes and the martial arts themselves. This he does using the voice of the Tengu, and the reader is invited to eavesdrop with the swordsman on the demon's revelations of the deepest truths concerning ch'i, the principles of yin and yang, and how these forces shape our existence. In TheDispatch, the themes are brought to an elegant conclusion using the parable of an old and toothless cat who, like the demon, has mastered the art of acting by relying on nothing, and in so doing can defeat even the wiliest and most vicious of rats despite his advanced years.This is the first direct translation from the original text into English by William Scott Wilson, the renowned translator of Hagakure and The Book of Five Rings . It captures the tone and essence of this classic while still making it accessible and meaningful to today's reader. Chozanshi's deepunderstanding of Taoism, Buddhism, Confucianism, and Shinto, as well as his insight into the central role of ch'i in the universe, are all given thoughtful treatment in Wilson's introduction and extensive endnotes. A provocative book for the general reader, The Demon's Sermon will also prove aninvaluable addition to the libraries of all those interested in the fundamental principles of the martial arts, and how those principles relate to our existence.",
  "genres": [
    "Martial Arts",
    "Philosophy",
    "Japan",
    "Graphic Novels",
    "Comics",
    "Nonfiction",
    "Buddhism"
  ],
  "author": "Issai Chozanshi",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/455922.The_Demon_s_Sermon_on_the_Martial_Arts"
}