{
  "title": "The Water Room",
  "description": "They are detection’s oddest couple: two cranky detectives whose professional partnership dates back half a century. Now Arthur Bryant and John May return in a case of multiple murder that twists through a subterranean course of the secrets, lies, and extreme passions that drive even ordinary men and women to the most shocking crimes….They are living legends with a reputation for solving even the trickiest cases using unorthodox, unconventional, and often completely unauthorized methods. But the Peculiar Crimes Unit headed by Detectives John May and Arthur Bryant is one mistake away from being shut down for good. And when the elderly sister of Bryant’s friend is found dead in the basement of her decrepit house in Kentish Town, they find themselves on the verge of making exactly that mistake.According to the coroner, Ruth Singh’s heart simply stopped beating. But why was a woman who rarely left the house fully dressed for an outing? And why was there river water in her throat? Convinced that the old lady didn’t die a natural death, the detectives delve into a murky case with no apparent motive, no forensics, and no clues. And they’ve barely launched their investigation when death claims another victim. Suddenly they discover some very unnatural behavior surrounding Ruth Singh’s death by “natural” causes—from shady real estate developers and racist threats to two troubled marriages, from a dodgy academician working London’s notorious “grey economy” to a network of antiquities collectors obsessed with Egyptian mythology. And running beneath it all are the sweeping tentacles of London’s vast and forgotten underground river system. As the rains pour down and the water rises, Bryant and May must rely on instinct, experience, and their own very peculiar methods to stem a tide of evil that threatens to drown them all.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "British Literature",
    "Detective",
    "Audiobook"
  ],
  "author": "Christopher Fowler",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/455821.The_Water_Room"
}