{
  "title": "Covert Narcissist: Uncover the Covert Narcissist’s Manipulation Tactics, It’s Effects on the Brain, and the Road to Recovery",
  "description": "Break Free From The Covert Narcissist's Abuse Cycle Today!   If you’re reading this book you have been through some unbearable pain and I want to commend you on making it this far. You have survived 100% of your worst days. My relationship with my covert narcissist left me confused, broken, and utterly drained. I didn’t think anyone could ever understand what I went through. Trying to explain it was hard enough. He didn’t yell, he didn’t hit, yet no one had ever caused me so much pain and then turned around and said I had only myself to blame. That’s what makes covert narcissists so dangerous, they’re so subtle and quiet, masters of deceit. If you feel like you have been pushed to the brink of insanity, losing control, forgetting who you even are I want to let you know that you are not alone. What helped me eventually overcome my deep attachment to my narc was understanding how the mind of a narcissist works and understanding what was going on in my own head while all of this was happening. By identifying the nature of the covert narcissist, recognizing the abuse cycle, and understanding the manipulation tactics I was able to finally stop the madness inside my head. In this book I go over all these points as well as reasons why we’re attracted to the narcissist, why they’re attracted to us, and most importantly tips on moving on after experiencing this type of abuse.   Here Is A Preview Of What You'll Learn...    \n   The Abuse Cycle \n   Manipulation Tactics \n   Brain Chemistry and Abuse \n   Why We're Attracted To and Who Attracts The Narcissist \n   Tools for Recovery \n     Don't let the covert narcissist fool you any longer , download your copy today! Available now for only $0.99!",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Grace  Lewis",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/45681546-covert-narcissist"
}