{
  "title": "On the Justice of Roosting Chickens: Consequences of American Conquest & Carnage",
  "description": "The United States has long been considered a deadly foe by the inhabitants of its ever-expanding \"spheres of influence.\" In Reflections on the Justice of Roosting Chickens , Churchill examines the toll U.S. policies have taken on civilians around the world and the role activists are (or aren’t) playing to stop the carnage. The Western world was stunned to wake up on 9-11 to find that the Third World had \"pushed back.\" By ignoring the suffering and loss of life of their victims while grieving over our own, Amercans have made themselves complicit in their government’s global slaughter. In a heartwrenching recount, Churchill reminds us of the untold millions who have perished as a result of U.S. military intervention (in either a physical, diplomatic or economic sense) in Iraq, Cambodia, Palestine, East Timor, the Americas . . . and the list goes on. To further illustrate his point, included are annotated chronologies of U.S. military actions from 1776 to the present and a compilation of International Laws either broken or ignored by the United States. Comprehensive, yet remaining concise, this book cannot be overlooked by those still \"Why do they hate us?\" \"Few are as eloquent or as able to maintain lucidity for the lay reader as is Churchill.\"— Bloomsbury Review \"Ward Churchill has carved out a special place for himself in defending the rights of oppressed people, and -exposing the dark side of past and current history, often marginalized or suppressed. These are achievements of inestimable value.\"—Noam Chomsky Ward Churchill is co-director of the American Indian Movement of Colorado, a national spokesperson for the Leonard Peltier Defense Committee, and an associate professor of American Indian Studies and Communications at the University of Colorado, Boulder. Author of more than a dozen titles, he is also an indefatigable lecturer on government repression, American Indian affairs and global politics.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Political Science",
    "The United States Of America",
    "American History",
    "Social Issues"
  ],
  "author": "Ward Churchill",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/456819.On_the_Justice_of_Roosting_Chickens"
}