{
  "title": "Liars' Legacy",
  "description": "They were born in the shadows. Schooled in espionage. Trained to move undetected and to kill without remorse. Elusive twins, Jack and Jill, take the global spy game to electric levels in this captivating masterwork from bestselling author Taylor Stevens.   The Broker is dead. The secret network he controlled has lost its restraints. From the darkest deep state enclave to the farthest reaches of the planet, the world’s deadliest assassins are now free to pursue their own agendas. The United States government, unwilling to risk upheaval and global chaos, has preemptively mobilized killers of its own to hunt down and terminate each threat.   Among the most dangerous agents of death are Jack and Jill. Often estranged—always connected by their stark shared childhood—brother and sister have managed to elude both U.S. intelligence and their foreign enemies, which makes them the perfect instruments of destruction for anyone who can control them.   As the siblings board a plane to Berlin hoping to meet their father for the first time, they suspect a trap. What they can’t predict is how far a high-level Russian operation will go to secure their skills, or how hard the U.S. killers sent to stop them will fight to assassinate them first.  For the twins, resistance and cooperation both mean certain death.   Caught between two superpowers with unlimited resources and unable to trust each other, brother and sister will match wit against skill in a life-threatening chase across Europe, to the United States, and into an unholy alliance that could change the balance of global power forever.   Filled with pulse-pounding tension, blistering action, and intense human drama, Liars’ Legacy is world-class intrigue at its best.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Adult Fiction",
    "Mystery",
    "Espionage",
    "Suspense"
  ],
  "author": "Taylor Stevens",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/45693634-liars-legacy"
}