{
  "title": "Manifesto",
  "description": "MANY AMAZON REVIEWS ON THIS BOOK ARE FOR ANOTHER UNRELATED BOOK OF THE SAME TITLE (THIS CAN BE CONFIRMED BY READING THE DETAILS OF THE REVIEWS REFERENCING AN OLDER/CLASSIC NON-SCIENCE FICTION BOOK) PLEASE DISREGARD THOSE REVIEWSA heavy gold wristwatch, a diary passed down through the ages, and a letter of warning from Christian’s neighbor. That’s all he gets from the elderly man who just died a few days prior. And the warning is simple – when you travel backward through time, you incidentally delete a full microsecond from existence, causing a ripple felt by a vigilant policing agency far in the future. When you travel backward, you need to work fast because they now know where you are and they’re coming for you with the intent to kill you.Christian Steele was only six years old when he heard about a high school kid who shot and killed a dozen elementary school students who’d been enjoying a field trip at the zoo. A year later, he read about a similar school shooting on the internet. Over and over again, his empathetic heart kept getting shattered by the news of another child’s life cut short for no reason at all.Empathy calls on anger and vengeance when Christian inherits a device that allows him to go back in time. All he’s ever wanted to do was to save all those children. All his vengeful heart ever wanted was to shoot the shooter before he could hurt those kids. He was on a mission now – to undo every single school shooting in all of history, but at what expense? How far would he be willing to go to end all the school shootings?Brought to you by the international bestselling author of the Mystic Saga, Dominion, Beyond the Event Horizon, Maelstrom, Endeavor, and his newest acclaimed series The Ani Maxima Files. With over 300,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. EDITORIAL \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Akron Beacon Journal Book Review\"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller, Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer, Hall of Fame Reviewer, and Vine Voice Michael GallagherGiven 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga! MANY AMAZON REVIEWS ON THIS BOOK ARE FOR ANOTHER UNRELATED BOOK OF THE SAME TITLE (THIS CAN BE CONFIRMED BY READING THE DETAILS OF THE REVIEWS REFERENCING AN OLDER/CLASSIC NON-SCIENCE FICTION BOOK) PLEASE DISREGARD THOSE REVIEWS",
  "genres": [
    "Time Travel"
  ],
  "author": "Scott McElhaney",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/45723410-manifesto"
}