{
  "title": "Suicide Tango: My Year Killin' It with a Shrink",
  "description": "SUICIDE TANGO is a novel about love and suicide.Tripsy South is a super-smart and thinking seventeen-year-old girl with a hyperkinetic knowledge of suicide in teens, especially girls. She \"suffers\" from a laundry list of maladies, including unio mystica, a special knowledge that also comes with a caustic and devastating wit that often draws blood from anyone nearby. Tripsy's pissed off at everyone well beyond her kill radius because America's teen-suicide epidemic isn't just growing, it's actively being fueled by BigPharma, BigMedia and America's government, corporate and civic leaders, who very clearly don't give a damn. Worse, they all allow the epidemic to continue.These sad facts drive Tripsy even nuttier than she already advertises.Don't be quick to feel sorry for Tripsy, though: this young brainiac has a master plan to shake things up.One day, out of the blue, she descends into the office of Dr. Jon Moore, a middle-of-the-road psychiatrist in Santa Barbara, California, who treats troubled children and suicidal teens. She then begins a year-long series of in-depth psychiatric sessions that test Dr. Moore's last raw nerve. Dr. Moore has written his own unpublished manuscript about teen suicidal behavior, but he gets schooled on every level by this precocious young expert on all elements of teen suicide.Unsure about how to react to Tripsy's unusual behavior, let alone how to treat her, Dr. Moore embarks on a deep emotional journey that forces him to examine his own past, present and future, not only as a psychiatrist but as a human being.Structured as lengthy doctor's notes, SUICIDE TANGO takes you on a wild roller-coaster ride of emotions, thoughts and beliefs, and introduces some hard facts about American teens in the throes of anxiety, depression and suicidal behavior.Will Dr. Moore survive this young girl's storming into his life and educating him in ways he never imagined?What will become of Tripsy who, as she informed Dr. Moore, has only one year left in her? In the end, we can't help but look around in disbelief and scream, \"WTF just happened!?\"",
  "genres": [
    "Young Adult"
  ],
  "author": "Tripsy South",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/45716514-suicide-tango"
}