{
  "title": "Pete Frame's Rock Family Trees",
  "description": "Frame traces the development and history of Eric Clapton, Led Zeppelin, The Rolling Stones, Genesis, The Police, and more with his hand-drawn rock trees.Which member of The Blockheads began his musical career in North East working men's clubs and co-wrote an American No. 1 hit single? What is the connection between the laid-back Californian sheen of The Eagles and the heavy-metal overdrive of Whitesnake? The links are at best tenuous, but to dedicated students of rock 'n' roll trivia, they are fascinating, to say the least. Pete Frame, founder of 'Zig-Zag' magazine admits that his \"obsession for historical detail\" led him along the historical backroads when researching his own articles on various rock artists, eventually prompting the charting of linear family trees which have for many years been the most eagerly anticipated element of 'Zig-Zag', and later, 'Sounds'.It's not just the carefully researched and rarely inaccurate data about who played what with which band before moving on to form that band with so-and-so that provides the appeal of Frame's trees, either. The wealth of personal comments and witty observations are entertaining in their own right, betraying a familiarity with his subjects and a love for their music that transcends any strict academic interest in documentation. The hand-drawn form of the trees has its own attraction, too, being a blend of Frame's experience as an architect and a certain whacked-out talent as a calligrapher.But whatever justification one applies to the purchase of this mighty tome, whether you be rock journalist, maniac, record collector, or insatiable fact-oid, there is no escaping the fact that you have in your hands a piece of rock 'n' roll history. That's a comforting thought, isn't it? Oh, and if you want the answers to those two questions, try charts 30 and 19.",
  "genres": [
    "Music",
    "Reference",
    "Nonfiction"
  ],
  "author": "Pete Frame",
  "average_rating": "4.81",
  "url": "https://www.goodreads.com/book/show/4571820-pete-frame-s-rock-family-trees"
}