{
  "title": "Amberlee Day's MyHeartChannel Romance Collection",
  "description": "Enjoy this collection of three, full length, clean romance novels from Amberlee Day.Sweet Home VermontPopular homemaker, farm wife, and cook Betsy Lacey has her own online channel, Sweet Home Vermont. What her viewers don’t know is that she isn’t married, only pretends she owns the beautiful farm, and can’t cook. If her brother and sister-in-law find out she’s been putting videos of their home online, it’ll be a quick end for her career as an internet star.Hunky Boone put himself through school helping run the Lacey’s hobby farm, but once he started helping Betsy film her secret show, he never left. Balancing farm work and the channel, Boone keeps his own secret from best friend he’s fallen in love with her.When a twist of fate brings her unexpected biggest fan—sexy veteran Dean—to the farm, it threatens to expose everyone’s secrets, and sheds a whole new light on Betsy’s sweetest desires. The Country GentlemanKenzie Vega puts her whole heart into everything she does, from fundraising for a cancer cure to her love of the outdoors. She’s especially passionate about forests, and even produces a MyHeartChannel show encouraging viewers to immerse themselves in nature. But while Kenzie’s days are filled with people, her private life is the opposite, and she’s actually very much alone.A second-generation logger, Peter Olson believes in sustainable harvests while he makes his living cutting down trees. However, he keeps his profession a secret from the fascinating woman in his hiking club. Past experience has taught him that people who love the outdoors get upset about trees coming down, and he doesn’t want to blow the relationship before it has a chance to grow. But when he realizes that Kenzie’s favorite forest is slated for clear-cutting, his fear of losing her overshadows his good judgement.As Kenzie struggles to save a memory of her mother, will she learn to risk giving someone new a place in her heart?Accidentally Engaged for the HolidaysAlyssa Jones-Blakely had it all—wealth, a place in high society, and a popular MyHeartChannel showcasing her impeccable sense of fashion and globetrotting lifestyle. Loss of the family income sent her tumbling to the bottom of the social ladder. While she’s long since righted her own wrongs, she remains shunned and sharp-eyed for an opportunity to get back where she living a fabulous life.Ex-Marine Dean Stallings went through rough times after his war-zone injury. Years later, he’s spending his life creating tiny house villages to help people experiencing homelessness. He’s happy as a single bachelor, flirting and keeping things light on the dating scene. A relationship would only slow him down, especially to a shallow ex-socialite.When Dean stumbles into Alyssa, he sees a beautiful woman to flirt with and she sees a ticket back to her old life. Will Dean’s belief in second chances include the woman who may break his heart? And will Alyssa open her own heart this Christmas to discover that the best things in life don’t come with a designer label?",
  "genres": [],
  "author": "Amberlee Day",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/45724493-amberlee-day-s-myheartchannel-romance-collection"
}