{
  "title": "Lifespan: Live a longer and healthier life with this bestselling anti-ageing book from a Harvard Medical School doctor",
  "description": "In this paradigm-shifting book from acclaimed Harvard Medical School doctor and one of TIME magazine’s 100 most influential people on earth, Dr. David Sinclair reveals that everything we think we know about ageing is wrong, and shares the surprising, scientifically-proven methods that can help readers live younger, longer.For decades, the medical community has looked to a variety of reasons for why we age, and the consensus is that no one dies of old age; they die of age-related diseases. That's because ageing is not a disease – it is inevitable.But what if everything you think you know about ageing is wrong?What if ageing is a disease? And that disease is curable.In THE EVOLUTION OF AGEING, Dr. David Sinclair, one of the world’s foremost authorities on genetics and ageing, argues just that. He has dedicated his life’s work to chasing more than a longer lifespan – he wants to enable people to live longer, healthier, and disease-free well into our hundreds. In this book, he reveals a bold new theory of ageing, one that pinpoints a root cause of ageing that lies in an ancient genetic survival circuit. This genetic trick – a circuit designed to halt reproduction in order to repair damage to the genome –has enabled earth’s early microcosms to survive and evolve into more advanced organisms. But this same survival circuit is the reason we age: as genetic damage accumulates over our lifespans from UV rays, environmental toxins, and unhealthy diets, our genome is overwhelmed, causing gray hair, wrinkles, achy joints, heart issues, dementia, and, ultimately, death.But genes aren’t our destiny; we have more control over them than we’ve been taught to believe. We can’t change our DNA, but we can harness the power of the epigenome to realise the true potential of our genes. Drawing on his cutting-edge findings at the forefront of medical research, Dr. Sinclair will provide a scientifically-proven roadmap to reverse the genetic clock by activating our vitality genes, so we can live younger longer. Readers will discover how a few simple lifestyle changes – like intermittent fasting, avoiding too much animal protein, limiting sugar, avoiding x-rays, exercising with the right intensity, and even trying cold therapy – can activate our vitality genes. Dr. Sinclair ends the book with a look to the near future, exploring what the world might look like – and what will need to change – when we are all living well to 120 or more.Dr. Sinclair takes what we have long accepted as the limits of human potential and mortality and turns them into choices. THE EVOLUTION OF AGEING is destined to be the biggest book on genes, biology, and longevity of this decade.",
  "genres": [
    "Science",
    "Health",
    "Nonfiction",
    "Biology",
    "Audiobook",
    "Self Help",
    "Medicine"
  ],
  "author": "David A. Sinclair",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/45714767-lifespan"
}