{
  "title": "In The Wake Of The Butcher: Cleveland's Torso Murders",
  "description": "Partially buried was the lower half of a woman's torso, legs amputated at the knees. This 'Lady of the Lake,' as she was dubbed by the police and the press, was the first in a terrifying series of decapitation murders that haunted Cleveland for the next few years. From 1934 to 1938, the 'Torso Killer' left the corpses of at least twelve victims in and around the Kingsbury Run area of Cleveland. A frightened city turned to its safety director, the legendary Eliot Ness, who focused more energy and manpower on this investigation than any previous police action in Cleveland. But the killer was never arrested, or even officially identified. In the Wake of the Cleveland's Torso Murders is the first detailed, book-length examination of these horrific crimes. Where previous examinations of the Kingsbury Run murders have relied almost exclusively on contemporary newspaper coverage, this compelling account is based on police reports, autopsy protocols, and personal interviews with the descendants of victims and investigators, and unpublished manuscripts. Illustrated with maps, rare crime scene and morgue photographs, and newspaper photos, this carefully researched true crime study offers a detailed account of one of the most sensational unsolved murder cases in the nation's history. Badal presents his evidence carefully, allowing the gruesome facts to speak for themselves. Along the way he dispels some long-held rumors about the crimes and confirms others; such as the legend of Ness's 'secret suspect.' In the Wake of the Butcher presents its compelling case and leaves readers to come to their own conclusions about these notorious Cleveland murders.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "History",
    "Read For School",
    "Mystery"
  ],
  "author": "James Jessen Badal",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/457276.In_The_Wake_Of_The_Butcher"
}