{
  "title": "The Strategy Paradox: Why Committing to Success Leads to Failure",
  "description": "A compelling vision. Bold leadership. Decisive action. Unfortunately, these prerequisites of success are almost always the ingredients of failure, too. In fact, most managers seeking to maximize their chances for glory are often unwittingly setting themselves up for ruin. The sad truth is that most companies have left their futures almost entirely to chance, and don’t even realize it. The reason? Managers feel they must make choices with far-reaching consequences today, but must base those choices on assumptions about a future they cannot predict. It is this collision between commitment and uncertainty that creates THE STRATEGY PARADOX.This paradox sets up a ubiquitous but little-understood tradeoff. Because managers feel they must base their strategies on assumptions about an unknown future, the more ambitious of them hope their guesses will be right – or that they can somehow adapt to the turbulence that will arise. In fact, only a small number of lucky daredevils prosper, while many more unfortunate, but no less capable managers find themselves at the helms of sinking ships. Realizing this, even if only intuitively, most managers shy away from the bold commitments that success seems to demand, choosing instead timid, unremarkable strategies, sacrificing any chance at greatness for a better chance at mere survival.Michael E. Raynor, coauthor of the bestselling The Innovator's Solution, explains how leaders can break this tradeoff and achieve results historically reserved for the fortunate few even as they reduce the risks they must accept in the pursuit of success. In the cutthroat world of competitive strategy, this is as close as you can come to getting something for nothing.Drawing on leading-edge scholarship and extensive original research, Raynor’s revolutionary principle of Requisite Uncertainty yields a clutch of critical, counter-intuitive findings. Among -- The Board should not evaluate the CEO based on the company’s performance, but instead on the firm’s strategic risk profile-- The CEO should not drive results, but manage uncertainty-- Business unit leaders should not focus on execution, but on making strategic choices-- Line managers should not worry about strategic risk, but devote themselves to delivering on commitmentsWith detailed case studies of success and failure at Sony, Microsoft, Vivendi Universal, Johnson & Johnson, AT&T and other major companies in industries from financial services to energy, Raynor presents a concrete framework for strategic action that allows companies to seize today’s opportunities while simultaneously preparing for tomorrow’s promise.",
  "genres": [
    "Business",
    "Nonfiction",
    "Management",
    "Leadership",
    "Self Help",
    "Psychology",
    "War"
  ],
  "author": "Michael E. Raynor",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/457393.The_Strategy_Paradox"
}