{
  "title": "Impostor Syndrome",
  "description": "In 2006 Julia Lerner is living in Moscow, a recent university graduate in computer science, when she’s recruited by Russia’s largest intelligence agency. By 2018 she’s in Silicon Valley as COO of Tangerine, one of America’s most famous technology companies. In between her executive management (make offers to promising startups, crush them and copy their features if they refuse); self promotion (check out her latest op-ed in the WSJ, on Work/Life Balance 2.0); and work in gender equality (transfer the most annoying females from her team), she funnels intelligence back to the motherland. But now Russia's asking for more, and Julia’s getting nervous.Alice Lu is a first generation Chinese American whose parents are delighted she’s working at Tangerine (such a successful company!). Too bad she’s slogging away in the lower echelons, recently dumped, and now sharing her expensive two-bedroom apartment with her cousin Cheri, a perennial “founder’s girlfriend”. One afternoon, while performing a server check, Alice discovers some unusual activity, and now she’s burdened with two powerful but distressing suspicions: Tangerine’s privacy settings aren’t as rigorous as the company claims they are, and the person abusing this loophole might be Julia Lerner herself. The closer Alice gets to Julia, the more Julia questions her own loyalties. Russia may have placed her in the Valley, but she's the one who built her career; isn’t she entitled to protect the lifestyle she’s earned? Part page-turning cat-and-mouse chase, part sharp and hilarious satire, Impostor Syndrome is a shrewdly-observed examination of women in tech, Silicon Valley hubris, and the rarely fulfilled but ever-attractive promise of the American Dream.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Contemporary",
    "Mystery Thriller",
    "Audiobook",
    "Adult"
  ],
  "author": "Kathy Wang",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/45729929-impostor-syndrome"
}