{
  "title": "What It Takes: Lessons in the Pursuit of Excellence",
  "description": "NEW YORK TIMES BESTSELLER From Blackstone chairman, CEO, and co-founder Stephen A. Schwarzman, a long-awaited book that uses impactful episodes from Schwarzman's life to show readers how to build, transform, and lead thriving organizations. Whether you are a student, entrepreneur, philanthropist, executive, or simply someone looking for ways to maximize your potential, the same lessons apply.People know who Stephen Schwarzman is—at least they think they do. He’s the man who took $400,000 and co-founded Blackstone, the investment firm that manages over $500 billion (as of January 2019). He’s the CEO whose views are sought by heads of state. He’s the billionaire philanthropist who founded Schwarzman Scholars, this century’s version of the Rhodes Scholarship, in China. But behind these achievements is a man who has spent his life learning and reflecting on what it takes to achieve excellence, make an impact, and live a life of consequence. Folding handkerchiefs in his father’s linen shop, Schwarzman dreamed of a larger life, filled with purpose and adventure. His grades and athleticism got him into Yale. After starting his career in finance with a short stint at a financial firm called DLJ, Schwarzman began working at Lehman Brothers where he ascended to run the mergers and acquisitions practice. He eventually partnered with his mentor and friend Pete Peterson to found Blackstone, vowing to create a new and different kind of financial institution. Building Blackstone into the leading global financial institution it is today didn’t come easy. Schwarzman focused intensely on culture, hiring great talent, and establishing processes that allow the firm to systematically analyze and evaluate risk. Schwarzman’s simple mantra “don’t lose money” has helped Blackstone become a leading private equity and real estate investor, and manager of alternative assets for institutional investors globally. Both he and the firm are known for the rigor of their investment process, their innovative approach to deal making, the diversification of their business lines, and a conviction to be the best at everything they do. Schwarzman is also an active philanthropist, having given away more than a billion dollars. In philanthropy, as in business, he is drawn to situations where his capital and energy can be applied to drive transformative solutions and change paradigms, notably in education. He uses the skills learned over a lifetime in finance to design, establish, and support impactful and innovative organizations and initiatives. His gifts have ranged from creating a new College of Computing at MIT for the study of artificial intelligence, to establishing a first-of-its-kind student and performing arts center at Yale, to enabling the renovation of the iconic New York Public Library, to founding the Schwarzman Scholars fellowship program at Tsinghua University in Beijing—the single largest philanthropic effort in China’s history from international donors. Schwarzman’s story is an empowering, entertaining, and informative guide for anyone striving for greater personal impact. From deal making to investing, leadership to entrepreneurship, philanthropy to diplomacy, Schwarzman has lessons for how to think about ambition and scale, risk and opportunities, and how to achieve success through the relentless pursuit of excellence. Schwarzman not only offers readers a thoughtful reflection on all his own experiences, but in doing so provides a practical blueprint for success.",
  "genres": [
    "Business",
    "Biography",
    "Finance",
    "Nonfiction",
    "Leadership",
    "Personal Development",
    "Entrepreneurship"
  ],
  "author": "Stephen A. Schwarzman",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/45733318-what-it-takes"
}