{
  "title": "The Lost Book of Adana Moreau",
  "description": "The mesmerizing story of a Latin American science fiction writer and the lives her lost manuscript unites decades later in post-Katrina New OrleansIn 1929 in New Orleans, a Dominican immigrant named Adana Moreau writes a science fiction novel titled Lost City. It is a strange and beautiful novel, set in a near future where a sixteen-year-old Dominican girl, not all that unlike Adana herself, searches for a golden eternal city believed to exist somewhere on a parallel Earth. Lost City earns a modest but enthusiastic readership, and Adana begins a sequel. Then she falls gravely ill. Just before she dies, she and her son, Maxwell, destroy the only copy of the manuscript.Decades later in Chicago, Saul Drower is cleaning out his dead grandfather’s home when he discovers a mysterious package containing a manuscript titled A Model Earth, written by none other than Adana Moreau.Who was Adana Moreau? How did Saul’s grandfather, a Jewish immigrant born on a steamship to parents fleeing the aftershocks of the Russian Revolution, come across this unpublished, lost manuscript? Where is Adana Moreau’s mysterious son, Maxwell, a theoretical physicist, and why did Saul’s grandfather send him the manuscript as his final act in life? With the help of his friend Javier, Saul tracks down an address for Maxwell in New Orleans, which is caught at that moment in the grip of Hurricane Katrina. Unable to reach Maxwell, Saul and Javier head south through the heartland of America toward that storm-ravaged city in search of answers.Blending the high-stakes mystery of The Shadow of the Wind, the science fiction echoes of Exit West, and the lyrical signatures of Bolaño and Márquez, Michael Zapata’s debut shines a breathtaking new light on the experiences of displacement and exile that define our nation. The Lost Book of Adana Moreau is a brilliantly layered masterpiece that announces the arrival of a bold new literary talent.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Books About Books",
    "Science Fiction",
    "Fantasy",
    "Book Club",
    "Audiobook"
  ],
  "author": "Michael  Zapata",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/45734704-the-lost-book-of-adana-moreau"
}