{
  "title": "Plain Jane [Box Set]",
  "description": "Book 1  “Why have love and pain when you can just have great sex?”- Natalie Jane Lorin  Some say, once a good girl goes bad, she’s gone forever. However, reality says once a good girl gets laid the right way, she’s a brand-new freak, right? Natalie’s passionless marriage is slowly dying; one day her husband up and leaves without an explanation. Joyclyn , from the bestselling series, The Ultimate No-No, takes a liking to Natalie and seductively brings Natalie into her world of sex, lust, and the game of who can get it. When Natalie meets William David, their sexual chemistry turns into something more than just a one night. Natalie discovers more than just her sexual beast; she soon finds herself face-to-face with true love. Joyclyn’s envy threatens to get the best of her; she wants Natalie all to herself; find out what happens when the game of who can get it turns into a game of winner takes Natalie.  Book 2  According to a broken heart, love equaled pain. William David, better known as Silk, knew all too well about that sort of pain. Upon meeting Natalie Jane Lorin, everything he swore against, suddenly becomes irrelevant. In the follow up to Plain Jane, the love between Silk and Natalie takes you on an explosively erotic ride. Nothing comes easy according to Joyclyn, and when discovering her protégé, Silk, has taken a liking to Natalie in more ways than one, she vows to put a stop to it. However, she can’t let Silk know what she’s up to. Instead, she discovers what would be the perfect distraction for Natalie: Kenneth, her estranged husband.  This series gets steamier with forbidden sex, devious plans for the heart, and the quest to claim one person; Natalie. Will Natalie fall blind to the three people in her life vying for her attention? The prize is Natalie; who’s going to win? Is it her new best friend, who holds a secret desire for her, her newest flame, who is part of a devious plan, or her estranged husband, who now wants her back? Find out in Plain Jane 2.  More secrets, more sex, more drama.",
  "genres": [],
  "author": "Tamika Newhouse",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/45747975-plain-jane-box-set"
}