{
  "title": "The Caldarian Conflict",
  "description": "Brother Mendell, a devout follower of Lord Justice, usually spends his life in study. When asked to counsel a pirate prisoner before his execution, Mendell finds himself caught up in a secret military plot that involves exploding merchant ships, secret suicide missions, and even a plot against the king. Now, pursued by a merciless adversary funded by a secretive backer, Mendell must unravel the mystery before he, too, becomes a casualty of The Caldarian Conflict.This is a fantasy novel intended for readers 14 and up. Will appeal to fans of Brandon Sanderson, George RR Martin, and R A Salvatore.Long Admiral Cain finds an elegant solution to Caldaria's piracy lure pirate ships to decoy merchant vessels stuffed with explosives instead of treasure. The suicidal captains are military men with fatal illnesses. The unsuspecting crews are poor men enticed from the gutters of Caldaria with the promise of handsome wages and free meals. Cain considers it a dual service--after all, he’s protecting the merchants and sweeping the streets clean of vagrants.There are only two if the peasants find out, they'll revolt. If the King finds out, he’ll have Cain’s head. Accordingly, anyone with too much knowledge must die.Brother Mendell, a devout follower of Lord Justice, is caught in the crossfire when he seeks retribution for an unfairly executed prisoner. After discovering the first few layers of Admiral Cain's plan, Mendell realizes that even a monk must carefully navigate through these dangerous waters. Mendell soon finds himself pursued by Admiral Cain's merciless assistant, Krell, who suspects that the monk might ruin their ambitious plan and uncover their mysterious backer--and will gladly kill the monk to keep him silent.Mendell must unravel the mystery before he, too, becomes a casualty of The Caldarian Conflict.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Pirates",
    "Action"
  ],
  "author": "Mike Kalmbach",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/12437641-the-caldarian-conflict"
}