{
  "title": "In the Land of Men: A Memoir",
  "description": "A fiercely personal memoir about coming of age in the male-dominated literary world of the nineties, becoming the first female literary editor of Esquire, and Miller's personal and working relationship with David Foster WallaceA naive and idealistic twenty-two-year-old from the Midwest, Adrienne Miller got her lucky break when she was hired as an editorial assistant at GQ magazine in the mid-nineties. Even if its sensibilities were manifestly mid-century—the martinis, powerful male egos, and unquestioned authority of kings—GQ still seemed the red-hot center of the literary world. It was there that Miller began learning how to survive in a man’s world. Three years later, she forged her own path, becoming the first woman to take on the role of literary editor of Esquire, home to the male writers who had defined manhood itself— Hemingway, Mailer, and Carver. Up against this old world, she would soon discover that it wanted nothing to do with a “mere girl.” But this was also a unique moment in history that saw the rise of a new literary movement, as exemplified by McSweeney’s and the work of David Foster Wallace. A decade older than Miller, the mercurial Wallace would become the defining voice of a generation and the fiction writer she would work with most. He was her closest friend, confidant—and antagonist. Their intellectual and artistic exchange grew into a highly charged professional and personal relationship between the most prominent male writer of the era and a young woman still finding her voice. This memoir—a rich, dazzling story of power, ambition, and identity—ultimately asks the question “How does a young woman fit into this male culture and at what cost?” With great wit and deep intelligence, Miller presents an inspiring and moving portrayal of a young woman’s education in a land of men.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Feminism",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Writing"
  ],
  "author": "Adrienne Miller",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/45730112-in-the-land-of-men"
}