{
  "title": "The Desert Home or the Adventures of a Lost Family in the Wilderness",
  "description": "The Desert Home or the Adventures of a Lost Family in the Wilderness is a thrilling adventure novel written by Captain Mayne Reid. The story follows the journey of a family who gets lost in the desert while traveling through the American West. The family consists of a father, mother, and their two children, who must rely on their survival skills to make it through the harsh conditions of the wilderness.As they navigate their way through the desert, they encounter a variety of challenges and dangers, including wild animals, hostile Native American tribes, and treacherous terrain. Along the way, they also meet a diverse cast of characters, including cowboys, miners, and other travelers who offer their assistance.Despite the many obstacles they face, the family remains determined to find their way home and reunite with their loved ones. Through their perseverance and resourcefulness, they learn valuable lessons about survival, courage, and the importance of family.Overall, The Desert Home is a captivating and exciting adventure novel that offers a thrilling glimpse into the harsh realities of life in the American West. With its vivid descriptions, engaging characters, and heart-pumping action, this book is sure to keep readers on the edge of their seats from beginning to end.1889. Reid was a popular writer of books for young people. The Desert Home There is a great desert in the interior of North America. It is almost as large as the famous Sahara of Africa. It is fifteen hundred miles long, and a thousand wide. Now, if it were a regular shape, -that is to say, a parallelogram, -you could at once compute its area, by multiplying the length upon the breadth; and you would obtain one million and a half for the result-one million and a half of square miles. But its outlines are as yet very imperfectly known; and although it is fully fifteen hundred miles long, and in some places a thousand in breadth, its surface extent is probably not over one million of square miles, or twenty-five times the size of England. Fancy a desert twenty-five times as big as all England! Do you not think that it has received a most appropriate name, when it is called the Great American Desert? See other titles by this author available from Kessinger Publishing.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original wor",
  "genres": [
    "Adventure",
    "Fiction",
    "Classics"
  ],
  "author": "Thomas Mayne Reid",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1243733.The_Desert_Home_or_the_Adventures_of_a_Lost_Family_in_the_Wilderness"
}