{
  "title": "The Frailty Myth: Redefining the Physical Potential of Women and Girls",
  "description": "Can women be equal to men as long as men are physically stronger? And are men, in fact, stronger?These are key questions that Colette Dowling, author of the bestselling The Cinderella Complex , raises in her provocative new book. The myth of female frailty, with its roots in nineteenth-century medicine and misogyny, has had a damaging effect on women's health, social status, and physical safety. It is Dowling's controversial thesis that women succumb to societal pressures to appear weak in order to seem more \"feminine.\"The Frailty Myth presents new evidence that girls are weaned from the use of their bodies even before they begin school. By adolescence, their strength and aerobic powers have started to decline unless the girls are exercising vigorously--and most aren't. By sixteen, they have already lost bone density and turned themselves into prime candidates for osteoporosis. They have also been deprived of motor stimulation that is essential for brain growth.Yet as breakthroughs among elite women athletes grow more and more astounding, it begins to appear that strength and physical skill--for all women--is only a matter of learning and training. Men don't have a monopoly on physical prowess; when women and men are matched in size and level of training, the strength gap closes. In some areas, women are actually equipped to outperform men, due partly to differences in body structure, and partly to the newly discovered strengthening benefits of estrogen.Drawing on extensive research in motor development, performance assessment, sports physi-ology, and endocrinology, Dowling presents an astonishing picture of the new physical woman. And she creates a powerful argument that true equality isn't possible until women learn how to stand up for themselves--physically.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Gender",
    "Womens Studies",
    "Health",
    "Womens",
    "Sociology"
  ],
  "author": "Colette Dowling",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/457578.The_Frailty_Myth"
}