{
  "title": "Aunt Phil's Trunk:  Volume One, An Alaska Historian's Collection of Treasured Tales",
  "description": "Alaska history decoded!Aunt Phil's Trunk Volume One will keep you spellbound!If you enjoy reading entertaining nonfiction short stories, then you will love Aunt Phil's Trunk Volume One. Not only do these easy-to-read pages keep you hooked to see what happens next, they also offer a window into the past through hundreds of historical photographs.Did you know?•\tMysterious petroglyphs dot Alaska's coastlines?•\tThe last shot of the American Civil War boomed in the Bering Sea?•\tThe Klondike Gold Rush began after a man dreamed of salmon with golden scales?These and dozens more little-known stories fill the pages of Aunt Phil's Trunk Volume One and share Alaska's colorful past up to 1900.Anyone interested in Alaska history will love this book. It is full of interesting and little-known facts about the state. The stories behind these facts are colorful and entertaining. - Writer's DigestRichly assembled with historic photos and rarely told tales, Aunt Phil's Trunk is an engaging addition to Alaska's storytelling legacy. - Alex DeMarban, Editor, First Alaskans magazineWhat an amazing treasure. I pride myself on being a historian, with a minor in Alaska history; but I can truly take a quick backseat to this marvelous work. - John Gailey, tour director,John Hall's AlaskaMore than 20,000 copies of print book sold worldwide!Order your copy of Aunt Phil's Trunk Volume One now!Read More Here:The Aunt Phil's Trunk Alaska history series is noted for its easy-to-read short stories and hundreds of historical photographs that complement the entertaining nonfiction writing. Suitable for ages 9 to 99, the first book in the series shares stories from early Alaska up to 1900.Volume 1 kicks off the series by showcasing the arrival of Alaska Natives thousands of years ago. Anthropologists theorize the Natives traveled from Asia across the Bering Sea Land Bridge and settled in various parts of Alaska. Stories in this section include mighty shaman, mysterious petroglyphs and fierce battles against Russian fur traders, who arrived in the mid-1700s.After Alaska became a possession of the United States in 1867, Americans began streaming into the Last Frontier. Explorers, businessmen, miners and crooks came north and changed Alaska forever. The discovery of gold brought even more people.Gold Rushes•\tJuneau-Douglas•\tCook Inlet•\tKlondike Gold Rush•\tPLUS photo essay of the various routes the gold-crazed stampeders forgedOther stories in this volume include how Catholic nuns mingled with rough-and-tumble adventurers on the banks of Nome, the last shot of the Civil War boomed in the Bering Sea and how infamous conman Soapy Smith served as an angel of mercy before he became the undisputed king of crime in Skagway.This volume is a treasure trove of short stories about Alaska's colorful past and is filled with close to 350 rare historical photographs!",
  "genres": [
    "Nonfiction",
    "History",
    "Historical"
  ],
  "author": "Laurel Downing Bill",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/4579696-aunt-phil-s-trunk"
}