{
  "title": "Mating My Mob",
  "description": "An Australian RH Adventure. Meanwhile, in Australia… a feisty chick in her red ballgown is jumping off the Pyrmont Bridge in Darling Harbour to escape dingo shifters. She’s saved by five guys with mixed feelings over whether to kill her or use her to form the mate bond that will move their lives from 'fight and run' into 'safety and belonging'... if only one of them wasn’t keeping a secret that completely changes the game.  An ambush, and the realisation that mate magic runs deeper than they thought, leads them to hide in a cabin in the Blue Mountains – where Jager bombs are drunk and things get out of control in the hot and naked kind of way.  This is not a parody of Australian life and is definitely a genuine shifter RH paranormal romance. Our Harper gets to keep all 5 of her men, after they earn her trust and her heart.  This is a fast burn, with m/f, m/m, and m/m/f (threesomes, foursomes, and moresomes) and a trigger notice for not-entirely-consensual anal (dubcon) and an instance of self-harm which may be triggering for some people - but which is not part of the main plot or an ongoing recurrence.  If you like fast burn RH, from 0-100 in about 10 chapters, this is for you. If you like slow-medium burn with lots of tension and lead up, then go into this one with your eyes wide open for something different. The premise for this book actually started as a dare on facebook... and out of that the author was supposed to write a short story but couldn't help herself, she's a sucker for world building and character development and that takes time. So here it is. For anyone who would love a second book please head over to the facebook group 'Amanda Cashures Keepers' and share your desires.  As it stands this is a stand-alone, book 2 won't exist unless readers really want it. It has a Happily For Now ending where Harper gets to keep her five guys and they get all their hopes and dreams answered. Its a full-length novel at 100k and there's plenty of bonus materials over on 'Amanda Cashures Keepers' facebook group.",
  "genres": [
    "Reverse Harem",
    "Shapeshifters",
    "Paranormal",
    "M M Romance",
    "Fantasy",
    "Polyamory",
    "Romance"
  ],
  "author": "Amanda Cashure",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/45784988-mating-my-mob"
}