{
  "title": "Shooting at Loons",
  "description": "Margaret Maron has garnered both the praise of critics and the raves of satisfied readers for her award-winning Deborah Knott series. The Indianapolis News notes that a Deborah Knott book is \"more than just a mystery; it is a portrait of a place.\" The Houston Chronicle compares Maron's rich description of central North Carolina to the writings of Sarah Orne Jewett and Kate Chopin. And the Raleigh News & Observer gets it exactly right when it says that the series is \"like pecan pie. It leaves you wanting more.\" Now, in Shooting at Loons, we follow Judge Deborah Knott to the state's lush Crystal Coast, where expensive yachts ride at anchor...and murders wash in on the \"Down East\" tide. Asked to sit in for a hospitalized judge in gracious old Beaufort, Deborah hopes to spend a restful week at her cousin's nearby Harkers Island cottage; but her very first clamming expedition turns up the corpse of a well-known fisherman in the shallow waters. Discovering the body puts her right in the middle of the fight between the locals who have long made their living from the sea and the new tide of well-to-do \"dingbatters\": weekenders and land developers who view the coast as their personal playground and gold mine. Deborah soon realizes that the centuries-old way of life in this isolated corner of the South is as endangered as loons and sea turtles, and the fisherman's murder is clearly tied to the coming changes. On the bench and off, she can feel the rage and fear and greed these changes arouse. Even so, sipping her bourbon in the fresh salt air proves beneficial for Deborah's soul, and life at the beach takes a definite upswing when she meets a game warden who's hunting for loon poachers. Not untila second murder occurs and a lover from her past becomes a suspect does Deborah realize she's up to her own neck in intrigue - and dangerously close to a killer...",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Southern",
    "Cozy Mystery",
    "Crime",
    "Audiobook"
  ],
  "author": "Margaret Maron",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/457782.Shooting_at_Loons"
}