{
  "title": "The Tailor of Panama",
  "description": "Le Carré's Panama—the young country of 2.5 million souls which, on December 31, 1999, will gain full control of the Panama Canal—is a Casablanca without heroes, a hotbed of drugs, laundered money and corruption.Seldom has the weight of global politics descended so heavily on such a tiny and unprepared nation. And seldom has the hidden eye of British Intelligence selected such an unlikely champion as Harry Pendel—a charmer, a dreamer, an evader, a fabulist and presiding genius of the house of Pendel & Braithwaite Co. Limitada, Tailors to Royalty, formerly of London and presently of Panama City.Yet there is a logic to the spies' choice. Everybody who is anybody in Central America passes through Pendel's doors. He dresses politicos and crooks and conmen. His fitting room hears more confidences than a priest's confessional. And when Harry Pendel doesn't hear things as such—well, he hears them anyway, by other means.For what is a tailor for, if not to disduise reality with appearance? What is truth if not the plaything of the artist? And what are spies and politicians and journalists if not themselves selectors and manipulators of the truth for their own ends?In a thrilling, hilarious novel, le Carré has provided us with a satire about the fate of truth in modern times. Once again, he has effortlessly expanded the borders of the spy story to bring us a magnificent entertainment straight out of the pages of tomorrow's history.JOHN LE CARRÉ was born in 1931. After attending the universities of Bern and Oxford, he taught at Eton and spent five years in the British Foreign Service. His third novel, The Spy Who Came In from the Cold, secured him a worldwide reputation, which was solidified by the acclaim for his trilogy, Tinker, Tailor, Soldier, Spy, The Honourable Schoolboy and Smiley's People. His mostly autobiographical novel, A Perfect Spy, wa followed by The Russia House, The Night Manager and Our Game. The Tailor of Panama is his sixteenth novel.John le Carré lives in Cornwall, England.",
  "genres": [
    "Fiction",
    "Espionage",
    "Thriller",
    "Mystery",
    "Crime",
    "Spy Thriller",
    "Mystery Thriller"
  ],
  "author": "John Le Carré",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/45783.The_Tailor_of_Panama"
}