{
  "title": "Love Your Life",
  "description": "An utterly delightful novel about a woman who ditches her dating app for a writer's retreat in Italy--only to find that real love comes with its own filters Call Ava romantic, but she thinks love should be found in the real world, not on apps that filter men by height, job, or astrological sign. She believes in feelings, not algorithms. So after a recent breakup and dating app debacle, she decides to put love on hold and escapes to a remote writers' retreat in coastal Italy. She's determined to finish writing the novel she's been fantasizing about, even though it means leaving her close-knit group of friends and her precious dog, Harold, behind.At the retreat, she's not allowed to use her real name or reveal any personal information. When the neighboring martial arts retreat is canceled and a few of its attendees join their small writing community, Ava, now going by \"Aria,\" meets \"Dutch,\" a man who seems too good to be true. The two embark on a baggage-free, whirlwind love affair, cliff-jumping into gem-colored Mediterranean waters and exploring the splendor of the Italian coast. Things seem to be perfect for Aria and Dutch.But then their real identities--Ava and Matt--must return to London. As their fantasy starts to fade, they discover just how different their personal worlds are. From food choices to annoying habits to sauna etiquette . . . are they compatible in anything? And then there's the prickly situation with Matt's ex-girlfriend, who isn't too eager to let him go. As one mishap follows another, it seems while they love each other, they just can't love each other's lives. Can they reconcile their differences to find one life together?",
  "genres": [
    "Romance",
    "Chick Lit",
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Adult",
    "Contemporary Romance"
  ],
  "author": "Sophie Kinsella",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/45756732-love-your-life"
}