{
  "title": "The Unknown",
  "description": "EIGHT CHILDREN WERE KIDNAPPED.BUT WHY?Eight kids, ages nine to seventeen, awaken to find that almost everything they have ever known has been stolen from them. They were ripped from their beds in the middle of the night and transported to an unfamiliar and unforgiving new world where there are strict rules, and they are punished if they refuse to obey.As the kids grapple with their mysterious new reality, they struggle with disconcerting questions. Where in the world are they? Why were they taken away from their families? Will they ever get to go back home? And the most frightening question of all: Will this be the place where they die?**CYBILS AWARD NOMINEE!****THE UNKNOWN has been selected by educators as recommended or required reading for middle school and high school students across the United States.**What readers are saying about THE UNKNOWN:\"I have read hundreds of books and it is extremely rare for me to be surprised or give 5 stars. I almost always anticipate the plot twists. I thought I had this one all figured out from the very beginning. I couldn't have been more wrong! An exhilarating, emotional, fast paced read that I couldn't put down. This story was utterly unique.\" - Justine, Book Catharsis ★★★★★\"Gripping. Unique. Lots of mystery and intrigue. I finished reading this book in awe.\" - Carly Wilson, Goodreads ★★★★★\"One of the best books I have ever read! I loved the plot twists, unique concept, and beautiful descriptions. I would recommend this book to any fan of mysteries.\" - Subba Reddy, Goodreads ★★★★★\"Lots of suspense, twists, and turns. I never saw the ending coming. It was a total surprise and explained everything!\" - Karon Hoffman, Goodreads ★★★★★What teachers are saying about THE UNKNOWN:\"Great book for any student that says 'I get bored quickly!' Trust me! You won't with ‪J.W. Lynne‬'s The Unknown!\" - Mr. Stefanelli\"I am an ELA educator, and my class is reading and analyzing The Unknown. We have approximately 200 IB students. They are engaging with this book. It is so relevant to them. It has been a real blessing.\" - Mr. Nelson\"Keeps you guessing until the end. If you like adventurous mysteries with great characters, then I highly recommend this book. 10 out of 10 stars.\" - Ms. MurrayTHE UNKNOWN is book one in a completed series of two full-length novels about five girls and three boys who are taken from their homes in the middle of the night and wake up in a frightening and mysterious world full of secrets.Books in the UNKNOWN series:Book 1: THE UNKNOWNBook 2: THE HAVENTHE UNKNOWN can be read as a standalone.If you like fast-paced thrillers with intriguing mystery, captivating suspense, unexpected twists and turns, heartwarming friendship, a dash of romance, and a surprise ending that brings everything together, don't miss this original must-read!",
  "genres": [
    "Dystopia",
    "Mystery",
    "Science Fiction",
    "Young Adult",
    "Suspense",
    "Romance",
    "Fiction"
  ],
  "author": "J.W. Lynne",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/45819832-the-unknown"
}