{
  "title": "The Protective SEAL",
  "description": "Jack Williams has never felt so lost. For him, being a Navy SEAL wasn’t just a job, it was a way of life. Protecting people had always been his strength, until a career-ending injury forced him into retirement. He’s struggling to start over when he stumbles across a car in a ditch, springing him back into action. Only this is no random citizen in distress. He knows the pretty face behind the wheel. Intimately. In fact, there’s a good chance the baby in her arms is his. One year ago, Samantha Engel was forced into witness protection to escape her ruthless mob-boss father. Jack had been her protector, and seeing her again now, in desperate need of help, stirs up a flood of emotions that catch Jack off-guard. Scheduled to testify against her dad, Sam is now on the run. Her father’s offering a pretty penny to anyone who can silence her for good. Jack may not the protector he once was, but he knows one thing for if Sam and her baby are in trouble, he’s not letting them out of his sight. With tensions running high and temptations running higher, Sam readily puts her life in Jack’s capable hands. Once the only person she could trust, she’d feared her daughter would grow up never knowing the man she owed her life to. But being back in Jack’s arms—and his bed—makes her heart pound like no time has passed. With the mob threat closing in, Jack knows failure isn’t an option. But even if they survive, Jack will have to fight to find a way to keep Sam and her daughter under his protection, or risk having to say good-bye again—this time for good. This novel contains sexual content, violence, profanity, and scenes with referenced substance abuse.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Contemporary",
    "Romantic Suspense",
    "Second Chance",
    "Military Romance",
    "Contemporary Romance"
  ],
  "author": "Katie Knight",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/45833129-the-protective-seal"
}