{
  "title": "The Power of the Promise: The Faithfulness of God",
  "description": "Writing a Holy Christian book is a call to me. This book is special book, it was written in amazing ways, theologically, contextually, scripturally and spiritually in a way that it has never been written in history.Since the beginning of all things and the fall of the first family of the ground, the Holy God is the God who lived in a relationship with the Life of the world through his promises. In the beginning of all things the Holy God gave the first family of the ground a promise. The Holy God called the Life of the world to his promises or Covenant. The Holy God is by God own self is a faithful God and the faithfulness of God is the nature of God and the Holiness of God and the Holiness of the Life of the God's people. The call of the Holy God is a call of the Holy faith. The life of the world was founded in the Holy words of the Holy God and the words of the Holy God restores the life of the world in all things. The promises of the Holy God never fail the Life the Lord's people. The Christian Holy God is a faithful God to his promises and the Life of his people in all things.You are the Child of the Promises of the Holy God and the Promises of the Holy God is with you. The Promises of the Holy God is stronger than your fear and doubt. The Promises of the Holy God is stronger than the power of the Devil and darkness. The Holy God is a faithful God to his Promises. There is a Promises of God on your life and you are the Child of the Promise. Whatever God has saw in you, will come to pass and the Promises of the Holy God is a Promises to bless you and Prospers you in all things.I believe the words of the Holy God through the works of the Holy spirit will make great spiritual, theological blessings on your journey. Amen",
  "genres": [
    "Nonfiction"
  ],
  "author": "Michaelo Abasori",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/45838588-the-power-of-the-promise"
}