{
  "title": "Traegonia: The Ember Rune",
  "description": "Traegonia the Ember RuneDo you believe that the extraordinary can exist side by side within our ordinary lives?Welcome to The World of Traegonia where two young Traegons turn one boy's ordinary world into something truly extraordinary. Where trees are homes, hawks are transportation, fairies exist and the creatures of the forests have their own stories to tell. Open yourself to possibility that just beyond the forest tree line a very different reality exists.Traegonia the Ember Rune, the second book in the Traegonia series, continues the adventures of a young boy and a community of, mystical creatures of the forest known as, Traegons. These sixteen inch tall forest dwelling creatures, that resemble a cross between a troll and a wingless dragon, are wise and inquisitive. Although, they may appear scary at first they are actually quite kind and civilized. When Dino is faced with leaving, Karia and Juna, his two young Traegon friends behind when his parents decide to go on vacation, he decides to smuggle them on board a plane to California. His family vacation turns into an adventure of a lifetime when they meet two young girls and a bold and a bit wild young Traegon named Fletch. This Northern California Mountain holds danger, mystery and a path of learning for each of these new friends. Faced with forces of nature, a rogue cougar and the evolution of their own journeys, the group of unlikely friends must believe in themselves and each other to uncover the meaning of the Ember Rune and get off the mountain safely. New friendships are made, old ones revealed and a new community of Traegons is introduced. Join Dino, Karia and Juna on this second exciting adventure and decide for yourself... Do they exist?Do you Believe?Funny, tender and exciting you are sure to be drawn into the World of Traegonia!Read Traegonia the Sunbow Prophecy, the first book in this exciting Fantasy Series to see how their friendship began.",
  "genres": [],
  "author": "K.S. Krueger",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12439574-traegonia"
}