{
  "title": "The Party Upstairs",
  "description": "An electrifying debut novel that unfolds in the course of a single day inside one genteel New York City apartment building, as tensions between the building's super and his grown-up daughter spark a crisis that will, by day's end, have changed everything.Ruby has a strange relationship to privilege, having grown up the super's daughter in the basement of an Upper West Side co-op that is full-on gentrified, and getting more so with each passing year. She wasn't economically privileged herself, but her close childhood friendship with the daughter of wealthy tenants named Caroline, and the mere fact of living in a lovely neighborhood, close to her beloved Natural History Museum and just across the park from the Met, brought with them certain real advantages, even expectations. Naturally Ruby followed her dreams and took out large student loans to attend a prestigious small liberal arts college and explore her interest in art. But now, out of school for a while, she is no closer to her dream job, or anything resembling it, and she's been forced by circumstances to do the last thing she wanted to do: move back in with her parents, back in the basement apartment of the building. And Caroline is throwing one of her parties tonight, in her father's glorious penthouse apartment, a party Ruby looks forward to and dreads in equal measure.With exquisite narrative control, The Party Upstairs distills down worlds of wisdom about families, great expectations, and the hidden violence of class into the gripping, darkly witty story of a single fateful day inside a single Manhattan co-op. Told from the alternating perspectives of the super, Martin, and his daughter, Ruby, as they are obliged, one way or another, to interact with the various species of inhabitant of the little ecosystem of their building, the novel builds from the spark of an early morning argument between Martin and Ruby to the ultimate conflagration that results by day's end. By the time the ashes have cooled, the façade that masks the building's power structures of dominance and submission will have burned away, and no party will be left unscathed.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "New York",
    "Novels",
    "Adult",
    "Audiobook"
  ],
  "author": "Lee Conell",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/45865627-the-party-upstairs"
}