{
  "title": "Bloods: Black Veterans of the Vietnam War: An Oral History",
  "description": "A NEW YORK TIMES NOTABLE BOOK • The national bestseller that tells the truth about the Vietnam War from the black soldiers’ perspective.An oral history unlike any other, Bloods features twenty black men who tell the story of how members of their race were sent off to Vietnam in disproportionate numbers, and of the special test of patriotism they faced. Told in voices no reader will soon forget, Bloods is a must-read for anyone who wants to put the Vietnam experience in historical, cultural, and political perspective.Praise for Bloods“Superb . . . a portrait not just of warfare and warriors but of beleaguered patriotism and pride. The violence recalled in Bloods is chilling. . . . On most of its pages hope prevails. Some of these men have witnessed the very worst that people can inflict on one another. . . . Their experience finally transcends race; their dramatic monologues bear witness to humanity.” —Time“[Wallace] Terry’s oral history captures the very essence of war, at both its best and worst. . . . [He] has done a great service for all Americans with Bloods . Future historians will find his case studies extremely useful, and they will be hard pressed to ignore the role of blacks, as too often has been the case in past wars.” — The Washington Post Book World“Terry set out to write an oral history of American blacks who fought for their country in Vietnam, but he did better than that. He wrote a compelling portrait of Americans in combat, and used his words so that the reader—black or white—knows the soldiers as men and Americans, their race overshadowed by the larger humanity Terry conveys. . . . This is not light reading, but it is literature with the ring of truth that shows the reader worlds through the eyes of others. You can’t ask much more from a book than that.” —Associated Press“ Bloods is a major contribution to the literature of this war. For the first time a book has detailed the inequities blacks faced at home and on the battlefield. Their war stories involve not only Vietnam, but Harlem, Watts, Washington D.C. and small-town America.” — Atlanta Journal-Constitution“I wish Bloods were longer, and I hope it makes the start of a comprehensive oral and analytic history of blacks in Vietnam. . . . They see their experiences as Americans, and as blacks who live in, but are sometimes at odds with, America. The results are sometimes stirring, sometimes appalling, but this three-tiered perspective heightens and shadows every tale.” — The Village Voice“Terry was in Vietnam from 1967 through 1969. . . . In this book he has backtracked, Studs Terkel–like, and found twenty black veterans of the Vietnam War and let them spill their guts. And they do; oh, how they do. The language is raw, naked, a brick through a window on a still night. At the height of tension a sweet story, a soft story, drops into view. The veterans talk about fighting two wars: Vietnam and racism. They talk about fighting alongside the Ku Klux Klan.” — The Boston Globe",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Race",
    "American History",
    "African American"
  ],
  "author": "Wallace Terry",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/1243993.Bloods"
}