{
  "title": "Flying The Talk: When Passion and Destiny Collide",
  "description": "FLYING THE TALK   When Passion and Destiny Collide    Vivacious public speaker and hypnotist Nicole Vanderkelen,  has just returned to Boston after the break-up of her marriage. Financially ruined, and with a gaping hole in her heart, she strives endlessly to succeed professionally and to serve humanity.  Broke and lonely, Nicole enlists the services of Boston’s #1 Telephone Dateline in search of friends and bedmates. The phone line provides an endless supply of amazing dates and the opportunity to listen to men’s wildest sexual desires. Struggling to pay her bills, she decides to write a book about the sex fantasies and conversations she hears on the line.  Nicole goes to work jotting down erotic fantasies, descriptions, and phone numbers in her little black journal. That same journal also contains her international travel notes, poetry, and her hypnosis clients’ phone numbers. Months into the writing process, her little black book is lost. After weeks of searching, she gives up hope of its return. Desperate for relief from grief and despair, Nicole’s drugs of choice become serial dating and risky sex. The world of BDSM beckons her, draws her in, and tests her limits.  Frenchman, Jean-Paul LaPierre is ready to find love after a decade spent playing the role of a carefree bachelor. One day, he finds Nicole’s mysterious black book. Night-after-night, the book’s many facets confuse, frustrate, and mesmerize him. The enigmatic nature of the journal soon consumes his every thought. Convinced that the owner of the book is the woman of his dreams, Jean-Paul launches a gut-wrenching search to find her.  Elizabeth Fortune, dancer, choreographer, and long-time friend of Nicole’s is just coming out of yet another terrible relationship. While Elizabeth’s talents are many, her most impressive talent seems to be hooking up with the wrong men.  New Zealand native, Wade Roberts, is a brilliant young scientist working on projects pertaining to the ozone layer at Cambridge’s prestigious Massachusetts Institute of Technology. Wade is driven by his love for Nicole, his desire to benefit humanity, and a need to fulfill unspoken promises made to his father.   In addition to being an erotic romance, mystery, and comedy, FLYING THE TALK is both uplifting and empowering. It is a laugh-out-loud look back to the 1990s. Its pages provide an emotional playlist of music titles that will put a light in your heart and a spring in your step.   Let the emotional foreplay and the mystery contained in these pages sweep over you and lead you to a deeply satisfying climax. It’s an erotic mystery and love story; it’s a hilarious romp through Boston’s Back Bay that will accelerate your pulse and leave you wanting more.",
  "genres": [],
  "author": "J. Griffin Van Guilder",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/45858796-flying-the-talk"
}