{
  "title": "Untamed",
  "description": "She never should’ve agreed to a girls’ night out.  Untamed, Book Four, Eternal Brethren Military Romantic Suspense Series Quinn “Wrangler” McCord is brash and impatient, known to push buttons, skirt tradition, and be counted on to stir things up. As the brother of the undercover motorcycle club’s president, and one of the youngest members, he never pushes enough to damage his career as a Navy SEAL. Underneath the false front, all isn’t jovial. Memories of a past mistake, one he can never rectify, haunt him, pushing him to take chances. Whether it’s a mission or a new woman, he’s always up for a challenge. Anything to help forget what he left behind. Rebecca North clawed her way out of a devastating breakup to become a respected paralegal. She’s come a long way from the lost young woman who had few choices and little money, becoming confident, independent…and a mother. Her new job in Liberty Lake provides a great income and brings her closer to home and her mother. It never occurs to Becca her safe haven will be the place where her past and present collide.  A short flirtation at the club’s bar turns into an explosive reunion. Recovering quickly, he jumps at the chance to heal his mistakes. She can’t turn him down fast enough, wanting nothing to do with the cocky motorcycle club member. A man who’ll never be allowed back into her life.  Intentions, though, are fragile. When Becca is threatened by the very men the Eternal Brethren are tasked to neutralize, Wrangler wastes no time spiriting her away. Protecting people from danger is something he’s trained to do. Overcoming the pain he’d caused isn’t. Especially when the secret she never intends to divulge stands before him, his bright, searching eyes the same as his.  Will a common cause be the thread which holds them together? Or will past mistakes and a secret life he can’t share be too much for either to overcome?  Untamed is the fourth book in the Eternal Brethren Military Romantic Suspense Series by best seller Shirleen Davies. It is a stand-alone, full-length novel with no cliffhanger and a guaranteed HEA.  PLEASE NOTE: This series contains strong language common within the military. It is also a steamy romance with open door love scenes.  Book 1: Steadfast Book 2: Shattered Book 3: Haunted Book 4: Untamed Book 5: Devoted",
  "genres": [],
  "author": "Shirleen Davies",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/45876937-untamed"
}