{
  "title": "The Wicked Wolves of Windsor: and other fairytales",
  "description": "\"Feminist fairytales, timeless stories.\"  Meet a horse that tells only lies, wolves who speak of curses, and a magical raven who utters riddles.  \"A Dash of Magic, and a Hint of Wicked.\"  From the landscapes of medieval castles, modern skyscrapers, and Regency ballrooms, this short story collection features strong female leads and women saving themselves.  \"A literary glass of bourbon after a long day.\"  A powerful debut book by Byrd Nash.   This collection draws upon the original fairytale source material and is Grimm-esque. It will not be suitable for all readers. __________________________________________________________________________________________________  THE FAIRYTALE SHORT STORIES  The Wicked Wolves of Windsor  “I’m not going to eat you,” said the wolf as he kept pace with the bicycle. “I only want to talk.”  Between the wicked wolves of the Wild Hunt and her violent father, Doireann needs all of her wits to survive. A dark retelling of Red Riding Hood in a magical fantasy England, post WWI.  The Queen’s Favorite  Feeling the rough scaliness of his hand, the queen could only whisper, “The witch lies, sire. Who knows what mischief she wanted to cause between us?”  Queen Elaine and her talking horse must speak the truth to free themselves from a monster. An empowering tale of surviving domestic violence set in a medieval landscape.  A Society of Heartless Women  Murder, betrayal, and revenge is in fashion in this Jane Austen horror satire set in Regency Bath, England.  Granny Starseed  Between drownings and gunfire, when will granny leave? A hippy witch and her talking raven upset the lives of her family when she comes to visit their suburban home.  Milking Time  A magical fantasy set in Regency England, where a not-so-ordinary farm girl duels a sorcerer.  The Prince Learns a Lesson  A graduate student is given an impossible transform a spoiled prince within three days. A contemporary magical fairytale.  At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Fairy Tales",
    "Fiction"
  ],
  "author": "Byrd Nash",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/45880877-the-wicked-wolves-of-windsor"
}