{
  "title": "Germany: A Nation in Its Time: Before, During, and After Nationalism, 1500-2000",
  "description": "For nearly a century, historians have depicted Germany as a rabidly nationalist land, born in a sea of aggression. Not so, says Helmut Walser Smith, who, in this groundbreaking 500-year history—the first comprehensive volume to go well beyond World War II—challenges traditional perceptions of Germany’s conflicted past, revealing a nation far more thematically complicated than twentieth-century historians have imagined.Smith’s dramatic narrative begins with the earliest glimmers of a nation in the 1500s, when visionary mapmakers and adventuresome travelers struggled to delineate and define this embryonic nation. Contrary to widespread perception, the people who first described Germany were pacific in temperament, and the pernicious ideology of German nationalism would only enter into the nation’s history centuries later. Tracing the significant tension between the idea of the nation and the ideology of its nationalism, Smith shows a nation constantly reinventing itself and explains how radical nationalism ultimately turned Germany into a genocidal nation.Smith’s aim, then, is nothing less than to redefine our understanding of Germany: Is it essentially a bellicose nation that murdered over six million people? Or a pacific, twenty-first-century model of tolerant democracy? And was it inevitable that the land that produced Goethe and Schiller, Heinrich Heine and Käthe Kollwitz, would also carry out genocide on an unprecedented scale?Combining poignant prose with an historian’s rigor, Smith recreates the national euphoria that accompanied the beginning of World War I, followed by the existential despair caused by Germany’s shattering defeat. This psychic devastation would simultaneously produce both the modernist glories of the Bauhaus and the meteoric rise of the Nazi party.Nowhere is Smith’s mastery on greater display than in his chapter on the Holocaust, which looks at the killing not only through the tragedies of Western Europe but, significantly, also through the lens of the rural hamlets and ghettos of Poland and Eastern Europe, where more than 80% of all the Jews murdered originated. He thus broadens the extent of culpability well beyond the high echelons of Hitler’s circle all the way to the local level. Throughout its pages, Germany also examines the indispensable yet overlooked role played by German women throughout the nation’s history, highlighting great artists and revolutionaries, and the horrific, rarely acknowledged violence that war wrought on women.Richly illustrated, with original maps created by the author, Germany: A Nation in Its Time is a sweeping account that does nothing less than redefine our understanding of Germany for the twenty-first century.",
  "genres": [
    "History",
    "Germany",
    "Nonfiction",
    "European History",
    "Audiobook",
    "German Literature",
    "Politics"
  ],
  "author": "Helmut Walser Smith",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/45894079-germany"
}