{
  "title": "Eden Mine",
  "description": "In Eden Mine, the award-winning author of Black River examines the aftershocks of an act of domestic terrorism rooted in a small Montana town on the brink of abandonment, as it tears apart a family, tests the faith of a pastor and the loyalty of a sister, and mines the deep rifts that come when the reach of the government clashes with individual freedomJo Faber is packing up the home she and her brother Samuel inherited. For generations, the Fabers have lived near Eden Mine, but Jo and Samuel will be the last. Their family home has been seized by the state through eminent domain.At the moment she hears the news of the bombing on the radio, Jo knows nothing, but she also knows that something isn't right. The arrival of their friend and unofficial guardian, Sheriff Hawkins, confirms her suspicions. Samuel said he was going to find work. But soon it's clear that he's not gone, but missing--last seen by a security camera near the district courthouse at Elk Fork. And a nine-year-old girl, the daughter of a pastor of a storefront church, is in critical condition.This isn't the first time Jo and Samuel have seen the ravages of violence visit their family. Last time, they lost their mother and Jo lost her ability to walk. Samuel took care of her, outfitted their barn with special rigging so she could keep riding their mule. But he was never the same, falling in with a separatist group, getting a tattoo he'd flaunt, then spending years hiding. She thought he had finished with all that. But now he's missing, and she can't talk to the one person she trusts.A timely story of the anger and disaffection tearing apart many communities in this country, S.M. Hulse's Eden Mine is also a beautiful novel of the West, of a deep love for the land, of faith in the face of evil, and of the terrible choices we make for the ones we love.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Westerns",
    "Adult",
    "Christian",
    "Terrorism"
  ],
  "author": "S.M. Hulse",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/45892262-eden-mine"
}