{
  "title": "Unmaking the Presidency: Donald Trump's War on the World's Most Powerful Office",
  "description": "\"This is a book for everyone who has developed an unexpected nostalgia for political 'norms' during the Trump years . . . Other books on the Trump White House expertly detail the mayhem inside; this book builds on those works to detail its consequences.\" ―Carlos Lozada (one of twelve books to read \"to understand what's going on\")\"Perhaps the most penetrating book to have been written about Trump in office.\" ―Lawrence Douglas, The Times Literary SupplementThe definitive account of how Donald Trump has wielded the powers of the American presidencyThe extraordinary authority of the U.S. presidency has no parallel in the democratic world. Today that authority resides in the hands of one man, Donald J. Trump. But rarely if ever has the nature of a president clashed more profoundly with the nature of the office. Unmaking the Presidency tells the story of the confrontation between a person and the institution he almost wholly embodies.From the moment of his inauguration, Trump has challenged our deepest expectations of the presidency. But what are those expectations, where did they come from, and how great is the damage? As editors of the “invaluable” ( The New York Times ) Lawfare website, Susan Hennessey and Benjamin Wittes have attracted a large audience to their hard-hitting and highly informed commentary on the controversies surrounding the Trump administration. In this book, they situate Trump-era scandals and outrages in the deeper context of the presidency itself. How should we understand the oath of office when it is taken by a man who may not know what it means to preserve, protect, and defend something other than himself? What aspects of Trump are radically different from past presidents and what aspects have historical antecedents? When has he simply built on his predecessors’ misdeeds, and when has he invented categories of misrule entirely his own?By setting Trump in the light of history, Hennessey and Wittes provide a crucial and durable account of a presidency like no other.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Government",
    "Audiobook",
    "American History",
    "Presidents"
  ],
  "author": "Susan Hennessey",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/45892268-unmaking-the-presidency"
}