{
  "title": "You're Not Listening: What You're Missing and Why It Matters",
  "description": "Who listens to you?New York Times contributor Kate Murphy asked people on five continents this question, and the response was typically a long, awkward pause. People struggled to come up with someone, anyone, who truly listened to them without glazing over, glancing down at a phone, or jumping in to offer an opinion. Many admitted that they, themselves, weren’t very good listeners, and most couldn’t even describe what it meant to be a good listener.Despite living in a world where technology allows constant digital communication and opportunities to connect, it seems no one is really listening or even knows how. And it’s making us lonelier, more isolated, and less tolerant than ever before. A listener by trade, Murphy wanted to know how we got here.In this illuminating and often humorous deep dive, Murphy explains why we’re not listening, what it’s doing to us, and how we can reverse the trend. She makes accessible the psychology, neuroscience, and sociology of listening while also introducing us to some of the best listeners out there (including a CIA agent, focus-group moderator, bartender, radio producer, and top furniture salesman).While listening is often regarded as talking’s meek counterpart, Murphy discovered it’s actually the more powerful position in communication. We learn when we listen. It’s how we connect, cooperate, empathize, and fall in love. Listening is something we do or don’t do every day. While we might take listening for granted, how well we listen, to whom, and under what circumstances determines who we are and the paths we take in life.Equal parts cultural observation, scientific exploration, and rousing call to action that’s full of practical advice, You’re Not Listening is to listening what Susan Cain’s Quiet was to introversion. It’s time to stop talking and start listening.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Audiobook",
    "Communication",
    "Personal Development",
    "Relationships"
  ],
  "author": "Kate   Murphy",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/45892276-you-re-not-listening"
}