{
  "title": "The Island of Sea Women",
  "description": "A new novel from Lisa See, the New York Times bestselling author of The Tea Girl of Hummingbird Lane, about female friendship and family secrets on a small Korean island.Mi-ja and Young-sook, two girls living on the Korean island of Jeju, are best friends that come from very different backgrounds. When they are old enough, they begin working in the sea with their village’s all-female diving collective, led by Young-sook’s mother. As the girls take up their positions as baby divers, they know they are beginning a life of excitement and responsibility but also danger.Despite their love for each other, Mi-ja and Young-sook’s differences are impossible to ignore. The Island of Sea Women is an epoch set over many decades, beginning during a period of Japanese colonialism in the 1930s and 1940s, followed by World War II, the Korean War and its aftermath, through the era of cell phones and wet suits for the women divers. Throughout this time, the residents of Jeju find themselves caught between warring empires. Mi-ja is the daughter of a Japanese collaborator, and she will forever be marked by this association. Young-sook was born into a long line of haenyeo and will inherit her mother’s position leading the divers in their village. Little do the two friends know that after surviving hundreds of dives and developing the closest of bonds, forces outside their control will push their friendship to the breaking point.This beautiful, thoughtful novel illuminates a world turned upside down, one where the women are in charge, engaging in dangerous physical work, and the men take care of the children. A classic Lisa See story—one of women’s friendships and the larger forces that shape them—The Island of Sea Women introduces readers to the fierce and unforgettable female divers of Jeju Island and the dramatic history that shaped their lives.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Audiobook",
    "Historical",
    "Adult",
    "War"
  ],
  "author": "Lisa See",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/45885239-the-island-of-sea-women"
}