{
  "title": "Afropessimism",
  "description": "Combining trenchant philosophy with lyrical memoir, Afropessimism is an unparalleled account of Blackness.Why does race seem to color almost every feature of our moral and political universe? Why does a perpetual cycle of slavery—in all its political, intellectual, and cultural forms—continue to define the Black experience? And why is anti-Black violence such a predominant feature not only in the United States but around the world? These are just some of the compelling questions that animate Afropessimism, Frank B. Wilderson III’s seminal work on the philosophy of Blackness.Combining precise philosophy with a torrent of memories, Wilderson presents the tenets of an increasingly prominent intellectual movement that sees Blackness through the lens of perpetual slavery. Drawing on works of philosophy, literature, film, and critical theory, he shows that the social construct of slavery, as seen through pervasive anti-Black subjugation and violence, is hardly a relic of the past but the very engine that powers our civilization, and that without this master-slave dynamic, the calculus bolstering world civilization would collapse. Unlike any other disenfranchised group, Wilderson argues, Blacks alone will remain essentially slaves in the larger Human world, where they can never be truly regarded as Human beings, where, “at every scale of abstraction, violence saturates Black life.”And while Afropessimism delivers a formidable philosophical account of being Black, it is also interwoven with dramatic set pieces, autobiographical stories that juxtapose Wilderson’s seemingly idyllic upbringing in mid-century Minneapolis with the abject racism he later encounters—whether in late 1960s Berkeley or in apartheid South Africa, where he joins forces with the African National Congress. Afropessimism provides no restorative solution to the hatred that abounds; rather, Wilderson believes that acknowledging these historical and social conditions will result in personal enlightenment about the reality of our inherently racialized existence.Radical in conception, remarkably poignant, and with soaring flights of lyrical prose, Afropessimism reverberates with wisdom and painful clarity in the fractured world we inhabit. It positions Wilderson as a paradigmatic thinker and as a twenty-first-century inheritor of many of the African American literary traditions established in centuries past.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Race",
    "Theory",
    "Politics",
    "History",
    "Memoir"
  ],
  "author": "Frank B. Wilderson III",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/45894104-afropessimism"
}