{
  "title": "Il più grande uomo scimmia del Pleistocene",
  "description": "«Il libro che avete fra le mani è uno dei più divertenti degli ultimi cinquecentomila anni» ha scritto Terry Pratchett. È vero, tanto tempo è passato, da quando vissero Ernest, il narratore di questo libro, con la sua ingegnosa famiglia, dal padre Edward, che fu senza dubbio «il più grande uomo scimmia del Pleistocene», a quell’amabile reazionario di zio Vania, che tornava sempre a vivere sugli alberi, a quel viaggiatore incallito dello zio Ian, per non parlare delle ragazze. Un curioso gruppetto, che si trovò, sotto la guida del grande Edward, nella delicata situazione di chi dà all’evoluzione una spinta che non si riequilibrerà mai: la spinta da cui siamo nati tutti noi. Ragionando con impeccabile acume scientifico, nonché un delizioso humour freddo, Edward e i suoi scoprirono «alcune delle cose più potenti e spaventose su cui la razza umana abbia mai messo le mani: il fuoco, la lancia, il matrimonio e così via», sempre sulla base di una elementare esigenza: quella di «cucinare senza essere cucinati e mangiare senza essere mangiati». E naturalmente non mancarono le dispute e i crucci, perché ogni volta si poteva discutere se quelle nuove invenzioni erano davvero buone o cattive, se non rischiavano di sfuggire al controllo e soprattutto se non andavano un po’ troppo contro la natura. Mah...Pubblicato per la prima volta nel 1960, e poi ripreso più volte sotto vari titoli, questo libro si è fatto strada silenziosamente fra i classici della fantascienza a ritroso. Ma in realtà è un libro inclassificabile: una riflessione romanzesca, acutissima e leggera, su tutta la storia dell’umanità, contrassegnata in ogni dettaglio da quella limpidezza e da quell’ironia che appartengono alla migliore tradizione letteraria e scientifica inglese. Quando Théodore Monod lesse questo libro, segnalò all’autore uno o due errori tecnici, subito aggiungendo «che non importavano un accidente, perché la lettura del libro l’aveva fatto ridere tanto che era caduto da un cammello nel bel mezzo del Sahara».",
  "genres": [
    "Fiction",
    "Humor",
    "Historical Fiction",
    "Roman",
    "Science Fiction",
    "Classics",
    "British Literature"
  ],
  "author": "Roy  Lewis",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/4590678-il-pi-grande-uomo-scimmia-del-pleistocene"
}