{
  "title": "Goof and Other Stories",
  "description": "\"Sometimes I wish that instead of being born the usual way, I had been flown through the solar system to earth and just dropped off here. It would be much simpler than having to have been nothing first. But I wasn't flown in. I was born, so I have to deal with it.\"Meet Digby Shaw, on the verge of turning teenager. Right now he’s still child enough to rage at the mere mention of Keebler dwarves. About to graduate from grade school, outlawed by his family, Digby’s every move at home is mysteriously known by his mother, and in the classroom he’s under the sharp eye of a powerful nun, twice the size of God, with a man’s name. And he has a theory his father doesn’t like him one bit.Nothing is safe anymore. Digby suffers every misfortune at embarrassed to perform in the school play about a saint, bullied by the local juvenile delinquent, trying to do good when his every other instinct is to be bad. He likes books, lighting fires, facts of all shapes and sizes, and tormenting his younger brother. And all of a sudden, to his bewilderment, Digby also seems to like girls. One girl in particular, his oldest friend’s sister. And still, her brother, his supposed friend, locks him in a box in the woods, just for fun.Only memory and love save Digby, and then only briefly. He would still rather just be cool.\"You see, I'm a goof. I'm klutzy with stuff that's heavy or fragile. I act like a guy when I'm with guys and like a girl when I'm with girls. I sweat a lot over nothing. Even my name is goofy. Digby Shaw. Shaw’s not so bad, but nobody ever even gets that far. 'Digby? Is that a word? Is that really your name?'No, a‑hole. I made it up so no one would ever know who I was.\"This is a funny book about being sad and in the dark. It’s also about what it’s like to grow up in a funny family. Digby is getting ready to walk out into a world that’s looking larger and fiercer to him every passing day. But he can’t help but feel a little fiercer himself as he goes along. And he’s certainly getting larger.\"You know the Cheshire Cat? I'm the Cheshire Cat with love handles.\"",
  "genres": [],
  "author": "Sean  Enright",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/4591642-goof-and-other-stories"
}