{
  "title": "Unworthy Republic: The Dispossession of Native Americans and the Road to Indian Territory",
  "description": "In May 1830, the United States formally launched a policy to expel Native Americans from the East to territories west of the Mississippi River. Justified as a humanitarian enterprise, the undertaking was to be systematic and rational, overseen by Washington’s small but growing bureaucracy. But as the policy unfolded over the next decade, thousands of Native Americans died under the federal government’s auspices, and thousands of others lost their possessions and homelands in an orgy of fraud, intimidation, and violence. Unworthy Republic reveals how expulsion became national policy and describes the chaotic and deadly results of the operation to deport 80,000 men, women, and children.Drawing on firsthand accounts and the voluminous records produced by the federal government, Saunt’s deeply researched book argues that Indian Removal, as advocates of the policy called it, was not an inevitable chapter in U.S. expansion across the continent. Rather, it was a fiercely contested political act designed to secure new lands for the expansion of slavery and to consolidate the power of the southern states. Indigenous peoples fought relentlessly against the policy, while many U.S. citizens insisted that it was a betrayal of the nation’s values. When Congress passed the act by a razor-thin margin, it authorized one of the first state-sponsored mass deportations in the modern era, marking a turning point for native peoples and for the United States.In telling this gripping story, Saunt shows how the politics and economics of white supremacy lay at the heart of the expulsion of Native Americans, how corruption, greed, and administrative indifference and incompetence contributed to the debacle of its implementation, and how the consequences still resonate today.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "Native American",
    "Race",
    "Indigenous"
  ],
  "author": "Claudio Saunt",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/45894124-unworthy-republic"
}