{
  "title": "Summer Love Autumn Goodbye: a #YouAreNotAlone standalone novel",
  "description": "She found love when she was least suspecting it.Marissa spends every summer of her childhood camping almost 200 miles away from home with her grandparents and aunt. One summer, while staying with her aunt, she meets Chad.Chad is the definition of a bad boy. He is Marissa's cousin's best friend, too old for her, and definitely not someone level-headed Marissa should be interested in. Marissa doesn't see him for his past, but instead sees him for the person he can become. It doesn't take her long to become infatuated by the troubled teenager.Forced to keep their relationship a secret because of Chad's criminal record, age, and the fact that he is a teenage father, Marissa and Chad find ways to be together. They were determined to make the relationship work when Marissa returns home at the end of the summer.Chad's past mistake keep coming back to haunt him. Can their relationship survive all the obstacles in their way?Once Marissa returns home at the end of the summer, Chad makes the effort (and the three hour drive) to see Marissa as much as he possibly can in the beginning, but eventually those visits taper off. Anthony's mother emerges from her seclusion and turns his life upside down.When tragedy strikes, Chad finds himself spiraling down back into a work of drugs after losing another family member. A devastating injury ruins his chances at the state championship in wrestling and annihilates his chances at a college scholarship.Marissa struggles to keep Chad's spirits up as he is hit by one catastrophe after another, but her life isn't easy either. After being forced to change schools and move to another city, her mother informs her that her summers will no longer be free. She will not be able to return to Chad's hometown with her grandparents every summer any longer.Will their relationship survive all the obstacles thrown at them?",
  "genres": [],
  "author": "Morgan M. Rylie",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/45916685-summer-love-autumn-goodbye"
}