{
  "title": "The Village, Forest And An Old Mansion:",
  "description": "A Romantic, psychological and suspense thriller with a word count of 1,06,161 from the author of ‘A Mansion of Illusions’ and ‘Strawberry (An apartment-full of romance and suspense)!They all have entered into that old palace, in the suburbs of that small village, just at the beginning of a tiny forest, with an expectation of just entertainment and fun. But the unknown fear, the uneasiness which greeted them as soon as they stepped into it was quite unexpected. The psychologist Susmitha’s repeated saying that it was quite natural to feel in such a way in an odd palace in a faraway place to their usual dwellings did not have much effect on them. The situation became too complex when Susmitha herself started confusing and baffled when she too subjected to that unknown fear and uneasiness.They could not know whether the ghastly experiences they were having in that palace were real or just their hallucinations and imaginations. Their predicament reached its motto when one of the young girls, Prameela, missed in the tiny forest which was just on the backside of the palace. A situation like that came to them that they could not stay in that palace anymore while could not leave it until the missed girl was found.It was the place where new loves have started. Thanuja and Sasikant who were just known to each other after they entered into that palace found out that there was love started in between them. This palace has given a chance to Rajesh, the owner of that palace, who was the rich man among them all to show and express his love to Susmitha who was the psychologist there. Moreover here they all have opened up their hearts, remembered their long forgotten memories, and shared their views. Here Sailaja the gynecologist changed the orthodox thinking of Mrudula.It was difficult to say what the people underwent in that palace during their stay of few days in it. Despite the unknown fear, despite the uneasiness and despite their ghastly experiences, to some extent they enjoyed their stay in it also. Witchcraft, split personalities, hallucinations and disembodied voices! Strengthening of old loves and stemming up of new loves between the couples. The palace had become a stage to display all their emotions not just love and affection but rancor, hate, jealousy and envy also. The other romantic and suspense thrillers of this author, ‘A Mansion Of Illusions’, ‘Nirupama’, ‘Amaswitha” ‘Across the river…..Under the bridge….’ ‘Strawberry (An apartment-full of romance and suspense)’ ‘Lovenest’, ‘Moonshine’, ‘Enna (Her life….her love…..her struggle) ’, 'Sand Dunes (A collection of eight short stories)' Dusk (Heart beat of old people), Rose Garden (Heart Beat of Young People), Rain Flower, Scarecrow and “Chasing butterflies…….(A pure love and romantic thriller) along with two non-fiction books ‘Body, Mind And You’ and ‘English Grammar Simplifier’ are also available as ebooks only on Amazon.",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/45911632-the-village-forest-and-an-old-mansion"
}