{
  "title": "And I Do Not Forgive You: Stories & Other Revenges",
  "description": "Exciting fans of such writers as Kelly Link, Karen Russell, and Carmen Maria Machado with prose that shimmers and stings, Amber Sparks holds a singular role in the canon of the weird. Now, she reaches new, uncanny heights with And I Do Not Forgive You. In “Mildly Happy, With Moments of Joy,” a friend is ghosted by a simple text message; in “Everyone’s a Winner at Meadow Park,” a teen precariously coming of age in a trailer park befriends an actual ghost. At once humorous and unapologetically fierce, these stories shine an interrogating light on the adage that “history likes to lie about women”— as the subjects of “A Short and Speculative History of Lavoisier’s Wife” and “You Won’t Believe What Really Happened to the Sabine Women” (it’s true, you won’t) will attest. Blending fairy tales and myths with apocalyptic technologies, all tethered intricately by shades of rage, And I Do Not Forgive You offers a mosaic of an all-too-real world that fails to listen to its silenced goddesses.Mildly unhappy, with moments of joy --You won't believe what really happened to the Sabine women --A place for hiding precious things --Everyone's a winner in Meadow Park --A short and slightly speculative history of Lavoisier's wife --We destroy the Moon --In which Athena designs a video game with the express purpose of trolling her father --Is the future a nice place for girls --Our mutual (theater) friend --The dry cleaner from Des Moines --The eyes of Saint Lucy --We were a storybook back then --Rabbit by rabbit --Through the looking-glass --The noises from the neighbors upstairs --Our geographic history --Death deserves all caps --A wholly new and novel act, with monsters --When the husband grew wings --The language of the stars --Mildly joyful, with moments of extraordinary unhappiness --Tour of the cities we have lost",
  "genres": [
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Feminism",
    "Magical Realism",
    "Audiobook",
    "Adult"
  ],
  "author": "Amber Sparks",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/45894105-and-i-do-not-forgive-you"
}