{
  "title": "Tower of Skulls: A History of the Asia-Pacific War, Volume I: July 1937-May 1942",
  "description": "In 1937, the swath of the globe east from India to the Pacific Ocean enclosed half the world’s population, all save a fraction enduring under some form of colonialism. Japan’s onslaught into China that year unleashed a tidal wave of events that fundamentally transformed this region and killed about twenty-five million people. From just two nation states with real sovereignty, Thailand and Japan, and two with compromised sovereignty, China and Mongolia, the region today encompasses at least nineteen major sovereign nations. This extraordinary World War II narrative vividly describes in exquisite detail the battles across this entire region and links those struggles on many levels with their profound twenty-first-century legacies.Beginning with China’s long-neglected years of heroic, costly resistance, Tower of Skulls explodes outward to campaigns including Singapore, the Philippines, the Netherlands East Indies, India, and Burma, as well as across the Pacific to Pearl Harbor. These pages cast penetrating light on how struggles in Europe and Asia merged into a tightly entwined global war. They feature not just battles, but also the sweeping political, economic, and social effects of the war, and are graced with a rich tapestry of individual characters from top-tier political and military figures down to ordinary servicemen, as well as the accounts of civilians of all races and ages.In this first volume of a trilogy, award-winning historian Richard B. Frank draws on rich archival research and recently discovered documentary evidence to tell an epic story that gave birth to the world we live in now.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military History",
    "China",
    "Japan",
    "War"
  ],
  "author": "Richard B. Frank",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/45993326-tower-of-skulls"
}