{
  "title": "Breaking Hate: Confronting the New Culture of Extremism",
  "description": "A stunning exploration of how to heal a nation reeling from extremist violence from a viral TED speaker and onetime white-supremacist leader who now work as a peace activist disengaging hateful radicals.At fourteen, Christian Picciolini was recruited by a now notorious skinhead leader and encouraged to fight with the movement to protect the white race from extinction. Soon, he had become an expert in racist ideology, a neo-Nazi terror who roamed the neighborhood, quick to throw fists. By the time he left the movement years later and was able to see clearly for the first time, Picciolini found that his life was in shambles and the nation around him was coming apart. Told with startling intimacy and compassion, BREAKING HATE is the inside story of how extremists have taken the reins of our political discourse and a guide to how everyday Americans can win it back. The forces pushing to polarize and radicalize us are many--from fake news to coded language to Russian trolls to a White House that often aims to inflame rather than to heal. Increasingly, the information with which we construct our world views is segregated by social media stars and advertisers with murky motives to validate our worst impulses. As Picciolini demonstrates, our modern world systematically normalizes extremism in such a way that we grow blind to it, only recognizing it in the wake of tragedy. Drawing on profiles of extremists that he works to free from violent ideology and on his own painful history leading and then escaping from an infamous neo-Nazi group, BREAKING HATE explains why terrorism and violence have come to characterize our daily lives and why that doesn't need to be the case.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Audiobook",
    "Social Justice",
    "Race",
    "Psychology",
    "Terrorism"
  ],
  "author": "Christian Picciolini",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/45990998-breaking-hate"
}