{
  "title": "Hair: The American Tribal Love-Rock Musical",
  "description": "This review is for the first printing 1969 of HAIR: THE AMERICAN TRIBAL LOVE-ROCK MUSICAL book. I found the book used and in good condition through an Amazon third party seller. The vintage paperback was published by \"Pocket Books\" and is written in play format i.e. dialogue with some stage directions. The words to the songs are also written out in all-caps to distinguish between dialogue and song. \"Hair\" was based on the counter-culture hippie movement of the 60s and focused on a group of friends called a \"tribe,\" and one of the character's (Claude) decision to accept being drafted into the military. It revolutionized Broadway by bringing rock music to the theater crowd and broke conventional story telling in non-linear fashion. It also dealt with sexuality, war, drugs, race and stereotypes, and the divide between generations. I was too young to see it on Broadway, so I'm happy to have found this book. My copy has 16-pages of black & white pictures of the original cast performing \"Hair,\" which was a pleasant surprise since it was not listed in the book's description. I understand that \"Hair\" went through a series of changes after it took off and I know there are dramatic changes from the Broadway musical to the Hair film by Milos Forman, so this first run book might be different than what was finally put on the stage. Some of the lyrics to the songs are slightly different and/or appear in different order, so that's another thing I thought you'd like to know. I've been a fan of the musical \"Hair\" ever since I've heard the songs and saw the film so this is just another piece of the puzzle to add to my collection. If you can find a copy for cheap, I advise picking it up.",
  "genres": [
    "Plays",
    "Musicals",
    "Fiction",
    "Theatre",
    "Drama",
    "Music",
    "American"
  ],
  "author": "Gerome Ragni",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/459713.Hair"
}