{
  "title": "Legends of the Patriarchs and Prophets and Other Old Testament Characters",
  "description": "Legends of the Patriarchs and Prophets and Other Old Testament Characters is a book written by Sabine Baring-Gould. The book is a collection of stories and legends about the characters from the Old Testament of the Bible. The author has compiled these stories from various sources, including Jewish and Christian traditions, apocryphal texts, and folk tales. The book includes stories about Adam and Eve, Cain and Abel, Noah and the Flood, Abraham and Sarah, Isaac and Rebekah, Jacob and Esau, Joseph and his brothers, Moses and the Exodus, Joshua and the conquest of Canaan, Samson and Delilah, David and Goliath, Solomon and the Queen of Sheba, and many others. The author has also provided his own commentary on these stories, offering insights into their historical and cultural significance. The book is a fascinating read for anyone interested in the Old Testament and its characters, and it provides a unique perspective on the stories that have shaped Western culture for centuries.1881. An incredible number of legends exists connected with the personages whose history is given in the Old Testament. This list is lengthy, but by no means exhaustive. Partial Fall of the Angels; Adam and Eve; Fall of Man; Cain and Abel; Seth; Enoch; The Giants; Methuselah; Noah; Relics of the Ark; Prophets Eber and Saleh; Tower of Babel; Abraham; Melchizedek; Esau and Jacob; Joseph; Job; Jethro; Moses; Joshua; Judges; Samuel; Saul; David; Solomon; Elijah; Isaiah; Jeremiah; Ezekiel; Ezra; Zechariah.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [],
  "author": "Sabine Baring-Gould",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/4594453-legends-of-the-patriarchs-and-prophets-and-other-old-testament-character"
}