{
  "title": "SAS Shadow Raiders: The Special Forces Mission That Changed The Course of WWII",
  "description": "The incredible story of the radar wars: Britain's most secret battle.In the winter of 1941 an alien-seeming object was captured in a death-defying dash by an RAF reconnaissance pilot flying a lone unarmed Spitfire across the French coast. Balanced upon the cliffs near Le Havre was what appeared to be a giant convex dish, directed across the Channel at the war-torn British coastline.With Britain's cities being pounded by fearsome bombing raids, teams of experts studied the photograph worriedly. Might the dish constitute a highly secret form of radar - one that had the capacity to tip the balance of the war decisively in the enemy's favour? If so, Nazi Germany would have leapfrogged British technology many-fold.A top-secret mission was devised to steal what had become known as the 'Wurzburg Dish' after Enigma intercepted coded German messages. Appropriately christened Operation Biting, this was to be the first-ever Allied raid using airborne forces. Commanded by legendary Major John 'Johnny' Frost, he demanded blind loyalty from his band of piratical raiders. 'A wild crew ... they looked horrible,' he admitted. Each and every rehearsal had proved disastrous; it was a suicide mission in all but name.On the French coast agents of the Special Operations Executive - Churchill's shadowy ministry for ungentlemanly warfare - risked all to map the target's defences. At the eleventh hour, two unwelcome additions joined Frosts's crew. One was a shadowy German cloaked in mystery; the other a British radar specialist who could not be allowed to fall into enemy hands.Relying on files declassified for the purposes of writing this book, eyewitness testimony, and working with the families of key figures involved, Lewis reveals an untold epic of daring, ruthless rule-breaking and ferocity, coupled with bravery and ingenuity beyond measure. The results of Operation Biting would resonate throughout the war and beyond, changing the course of twentieth-century history.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military History",
    "Military Fiction",
    "Historical"
  ],
  "author": "Damien Lewis",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/46002264-sas-shadow-raiders"
}