{
  "title": "A Talent for Killing",
  "description": "\"A breathless, lean noir thriller. Every line is razor sharp and without an ounce of fat. Jason Bourne fans will find a lot to like.\" Publishers Weekly Kane was a top CIA assassin until he suffered traumatic physical and psychological injuries in a mission that went horribly wrong. The Agency wiped his memory, gave him a new identity, and retired him to a life of mundane, anonymous domesticity. But his training, and his talent for killing, came back with a vengeance. He created a new life for himself as a killer-for-hire, righting wrongs for people who can't find peace or justice any other way. He doesn't know that his memories are fiction, or that he is always being watched, or that he's been targeted for death by a rogue faction within the Agency. A TALENT FOR KILLING In this brutal, fast-moving thriller from Ralph Dennis, the author of the legendary Hardman series of crime novels, Kane finds himself caught between the mob, Cuban revolutionaries, and his own government as he seeks retribution for a man murdered for uncovering small-town corruption...and justice for another man on death row, falsely convicted of raping and murdering a child. Praise for Ralph Dennis \"There are times when Dennis' writing touches on the inspired. He knew how to ride the zeitgeist....if not get ahead of the game. A TALENT FOR KILLING is a really exhilarating action thriller that springs a couple of surprises.\" NB Magazine UK \"Like Chandler and Hammett before him, Dennis was trying to do something different with what was thought of as throwaway literature.\" Joe R. Lansdale \"Ralph Dennis has mastered the genre and supplied top entertainment.\" New York Times \"Exceptional characterization, strong and vigorous prose.\" Mystery Scene Magazine A portion of this book was previously published in 1976 under the title Deadman's Game",
  "genres": [
    "Thriller",
    "Mystery",
    "Noir",
    "Crime",
    "Fiction",
    "Audiobook",
    "Espionage"
  ],
  "author": "Ralph Dennis",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/46000949-a-talent-for-killing"
}