{
  "title": "A Reação Adversa do Caos",
  "description": "SINOPSE  Luna passou a levar uma vida isolada após ser expulsa da escola há um ano. Ela odeia Nietzsche por conta de sua afirmação sobre não existirem verdades absolutas, pois acha que todos precisam de alguma coisa na qual acreditar. Mas, depois que encontra uma pedra que veio do espaço, um cara de outro planeta a leva embora da Terra, e ela, que era tão cheia de certezas, começa a ficar cheia de dúvidas. Inserida em novas culturas e relacionamentos complexos entre diferentes espécies, a jovem percebe que precisa encontrar seu lugar nesse novo mundo. Porém, reviravoltas acontecem, e, com o intuito de saber mais sobre seu passado, ela termina presa em um lugar esquecido e desabitado que ninguém consegue encontrar. Forçada a viver com um bando de estranhos, Luna vai descobrir que nem tudo é o que parece. Um chuveiro que serve de psicólogo, uma governanta que adora fazê-la passar vergonha, um amigo que dá péssimos conselhos e um professor que lhe diz verdades as quais ela se recusa a aceitar começam a fazê-la ter outro modo de enxergar a vida e a ajudam a descobrir coisas surpreendentes sobre sua história. E é justamente a pessoa que Luna mais odeia, quem a tirou do lugar ao qual ela achava pertencer, que a faz questionar tudo aquilo em que sempre acreditou e sentir coisas que ela nem sabia que existiam.   SOBRE A AUTORA  Stephanne Says nasceu em 1994 em Campina Grande, PB, mas atualmente mora em São Paulo, onde estuda Cinema de Animação na FAAP. Queria ser astronauta, mas é muito de humanas, então resolveu viajar para o espaço por meio dos livros. Quando não está escrevendo, está falando sobre signos no Instagram. Morre de medo de altura e de andar de avião, mas ama viajar e confirmar que sua única certeza é que da vida ainda não sabe de nada.",
  "genres": [
    "Fantasy"
  ],
  "author": "Stephanne Says",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/45999839-a-rea-o-adversa-do-caos"
}