{
  "title": "Hunted Witch Agency; Complete Collection",
  "description": "Over 1,000 pages sure to delight fans of kickass heroine Urban Fantasy with magic galore in this special complete collection of five full length novels written by Author Rachel Medhurst.\n\n\n\nContains:\n\n\n\nMagically Bound (Hunted Witch Agency #1)\n\n\n\nWitch...\n\n\n\n\n\nWarlock...\n\n\n\n\n\n\nWhatever…\n\n\n\nMy name’s Devon Jinx, and, yes, I’m half warlock, half witch. But I couldn't care less about which kind of magic is better. All I want to do is keep my head down and get on with my new job as an investigator at the Hunted Witch Agency....\nA recent, shall we say, mistake, has put me in place to inherit the leadership of the warlocks. Which means only one thing. I have a choice to make:\n\n\nLeave behind my life of witchery to become a warlock...\n\n\n\nOr lose my warlock magic forever!\n\n\nComplicating my choice is the fact that someone is trying to destroy the warlock coven. If I don't stop them, the warlocks will be annihilated. The task seems impossible until Gerard Freshwater, a distractingly handsome witch, explodes into my life. He's determined to make me see that being a witch isn't just the best option, but the only option!\n\nMagically Bonded (Hunted Witch Agency #2)\n\n\n\nIf magic could kill, it would!\n\n\n\n\n\nOr, at least it would kill Devon Jinx...\n\n\n\nHalf warlock, half... well, it used to be half witch, but I’m not so sure anymore. Ever since I defeated a powerful witch, my magic isn’t what it used to be. And, yet, I still hunt the ring leaders of the witch slave trade...\nUntil a more unsavoury plot appears. Gerard, my handsome agent partner, works with me to unravel the mystery of the warlock and witch gatherings. Apparently, they want to do a lot more than party. They’re prepared to create half-breeds, like me, to keep the warlock coven safe from the witches who threaten it...\nAnd yet, from my own experience, being a half witch, half warlock, isn’t all fun and games. If I don’t stop the rogue supernaturals, the poor beings that are born into the world will face the same ultimatum as me: To choose just one type of magic… or die!\n\nMagically Betrayed (Hunted Witch Agency #3)\n\nBetrayal runs in the family… \nThe Hunted Witch Agency is hot on the heels of the leader of the witch slave trade. I’m determined to bring them down, even though they’re closer to home than I realise. Gerard, the only male keeping me sane, is ready to put them down for good. Until I’m kidnapped!\nThe witch who takes me has a personal vendetta. She can torture me all she likes, but she’ll never make me give up my mission to end her enterprise. And her!\nI’m witch royalty, I’m a warlock disgrace. And now, I’m kidnapped. However, my magic is under control. For now. How long can I keep avoiding the inevitable?\n\nMagically Banished (Hunted Witch Agency #4)\n\n\n\nBetrayed...\n\n\n\n\n\nBanished...\n\n\n\n\n\n\nBothered?\n\n\n\nSince inheriting the link to the main source of warlock magic, the bounty on my head has quadrupled. If I don’t find a way to disconnect from the powerful source, the warlocks will hunt me down!\nBanished to the city of Edinburgh for protection, I throw myself into a new case. Magic drugs are on the rise, and the agency is tasked in bringing down the coven responsible for pushing contaminated batches!\nBut with a powerful witch mob leader protecting our culprit, we may run out of time. In an effort to prevent further deaths, I use my magic... and bring the warlocks back onto my trail. Will I be able to stop the massacre before the warlocks find an excuse to end me for good?\n\nMagically Blended (Hunted Witch Agency #5)\n\n\n\nCase closed?\n\n\n\n\n\nMaybe not...\n\n\n\nI’m a protector of the ley lines, and I’m also the direct link to warlock magic. No wonder I’m amazingly amazing right now. Although, this amount of magic is making me shaky. Is any paranormal creature built to hold so much? \nFighting the urge to use my magic every waking hour, I throw myself into the unfinished case of the Scottish mob coven and their poisoned drugs. My ignorance led me to believe that I’d wrapped everything up with a bow. And, yet, when our original culprit throws blame on the mob leader, we have to find evidence. Do we release our enemy to get our proof? Even at the risk of losing him? \nEither way, his fate, and mine, will be decided on the day of the solstice. Will I be magically blended or magically broken?\n\nThis is the final book in the Hunted Witch Agency series. Devon is going to miss you.",
  "genres": [
    "Urban Fantasy"
  ],
  "author": "Rachel Medhurst",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/46000470-hunted-witch-agency-complete-collection"
}