{
  "title": "Conscious: A Brief Guide to the Fundamental Mystery of the Mind",
  "description": "As concise, accessible, and enlightening as Astrophysics for People in a Hurry and Seven Brief Lessons on Physics, this mind-expanding dive into the mystery of consciousness challenges our beliefs about who or what experiences the world and how and reshapes our understanding of free will and the concept of a self.As humans, our awareness of being—that is, our consciousness—is so ingrained that we take it for granted. But the idea of consciousness raises profound questions when examined up close. Why would any collection of matter in the universe be conscious? How are we even able to think about this? And why should we?In Conscious, Annaka Harris ponders these and other brain-twisting questions as she takes us through evolving definitions, philosophies, and scientific findings that probe our limited understanding of this age-old mystery. Is consciousness an illusion, or is it a universal property of all matter? Where does it reside, and what gives rise to it? As we try to understand how consciousness comes to be in the first place, we must grapple with how to define it, and--in the age of artificial intelligence--how to decide who or what experiences it. Conscious is an illuminating meditation on the self, intelligence, and the circuitry that appears to give rise to the certainty of experience. Harris weaves lively arguments and viewpoints from an array of scientists, philosophers, academics, mindfulness experts, and futurists whose examinations radically alter our ideas about consciousness without definitively pinning it down—allowing us, as conscious beings, to think on it for ourselves, if indeed we can.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Science",
    "Psychology",
    "Audiobook",
    "Neuroscience",
    "Spirituality"
  ],
  "author": "Annaka Harris",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/45995124-conscious"
}