{
  "title": "King Mombo",
  "description": "\"Savage tribes and stirring encounters with wild beasts.\" - Saturday Review, 1903 \"One of the most delightful and instructive of writers of travel and adventure.\" - The Christian Work & Evangelist, 1902 \"Thrilling experiences in hunting elephants crocodiles gorillas and a number of other wild beasts.\" - The Book Buyer, 1902 \"Plenty of exciting adventure and hair-breadth 'scapes.\" - Presbyterian Banner, 1902 \"Admirable, an authentic story of personal adventure in Africa.\" - The Athenaeum, 1903 \"Equal to his best stories.\" -New-York Observer, 1903  Landing near the equator in Africa, the author plunged into the jungle and lived with King Mombo and his people, sharing their adventures and dangers. In narrating a white man's adventures in the great African rain forest Du Chaillu in his 1902 book \"King Mombo\" throws a vivid glare of light into those dense, dark African rain forests and reveals their strange life and fearful scenes. It is full of slaves and slave hunters, crocodiles and lions and tigers and elephants and snakes and gorillas, with plenty of exciting adventure and hair-breadth 'scapes.  Recounting his adventures in the great African forest the author declares that he could write many more volumes dealing with the wild men and \"savage tribes\" which he encountered there. In describing the manners a type of a primate the natives called \"ngina,\" which later fought several of his dogs, the author writes:  \"He gives yell after yell, roar after roar, until the whole forest is filled with the din of his big voice. Then he comes forward, walking erect, and roaring all the time. Sometimes the yell resembles that of an angry dog, though a hundred times louder. His big vindictive gray eyes look his antagonist straight in the face, glaring vengeance. The hair on the top of his head moves up and down, and the hair on his body stands erect. Then he beats his chest with his huge and powerful hands….\"  In describing this primate's ultimate attack on his dogs, the author writes that the dogs \"gave a terrific war-cry, the one used before attacking their enemy, and the gorilla uttered a terrific yell of defiance in response. The dogs had become bolder and bolder, and more and more angry. Suddenly 'Bloodthirsty' came too near the ngina, and before he had time to retreat, and quicker than the eye could follow, the big monster had sent his powerful arm forward and with his huge hand seized 'Bloodthirsty'….\"  Readers of Du Chaillu's other books on hunting, travel, and adventure will welcome this book from the same fertile pen. The wild animals and wilder men, the faithful hunters, and friendly chiefs encountered by the writer are excellently presented with a spirit and interest that will easily fire imagination of those with a spirit of adventure.  About the author: Paul Belloni Du Chaillu ( 1831 – 1903) was an American traveler, zoologist, and anthropologist. He became famous in the 1860s as the first outsider to confirm the existence of gorillas, and later the Pygmy people of central Africa.  He was sent in 1855 by the Academy of Natural Sciences at Philadelphia on an African expedition. Until 1859, he explored the regions of West Africa in the neighborhood of the equator, gaining considerable knowledge of the delta of the Ogooué River and the estuary of the Gabon. During his travels from 1856 to 1859, he observed numerous gorillas, known to non-locals in prior centuries only from ambiguous reports. He brought back dead specimens and presented himself as the first white European person to have seen them.",
  "genres": [],
  "author": "Paul Belloni du Chaillu",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/46002134-king-mombo"
}