{
  "title": "A Hellish Year One",
  "description": "Abandon all hope, ye who enter here. The Academy of the Devil is waiting, and there will be no mercy.   For as long as I can remember, I’ve been the girl who didn’t fit in, the girl who collapsed in the middle of class, just because my brain decided to turn on me. I can’t really complain, though. We don’t live in the Middle Ages, so I have yet to be subjected to an exorcism. I can get treatment for my condition. Epilepsy aside, I can mostly be a normal person and have a normal life.  There’s just one problem. I’m not a normal person. I never have been. And the first time I find this out is upon receiving an exclusive invitation to The Academy of the Devil.  Unfortunately, the Academy of the Devil isn’t like other schools and the current princes of the school have a lot of experience in ripping whatever contender they have to shreds. First, there’s Callum, incubus extraordinaire and leader of the house of Lust. He thrives on making students fall in love of him and then breaking their spirits. Then there’s Mikael, the envious cambion, rumored to enjoy feeding students to the school’s dragon. And last, but not least, the leader of the house of Wrath, the hell hound Stefan. I hear he doesn’t bother with the dragon and just takes care of pests himself.  All of them despise humans. All of them sneer at anyone who displays any kind of weakness. All of them hate me and everything I stand for. That’s fine. I don’t need friends, lovers, or even valued mentors. All I need is to survive my school years with my soul, my sanity and my brain intact.  It’ll be a challenge, but I’ve dealt with worse. I might not be ready for the Academy of the Devil, but they’re not ready for me either.  The Academy of the Devil is a paranormal bully reverse harem romance. All characters involved in the pairing are 18+ years old. But be advised! The series will contain dark themes, including violence, ableism, bullying of a character suffering from an invisible disability, and other similar content that may be disturbing for some readers. Approach with caution. Once you enter The Academy of the Devil, you will never be the same.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal",
    "Demons",
    "Romance",
    "Audiobook",
    "Angels"
  ],
  "author": "Eva  Brandt",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/46014635-a-hellish-year-one"
}