{
  "title": "The Lover",
  "description": "Zaytuna just wants to be left alone to her ascetic practices and nurse her dark view of the world. But when an impoverished servant girl she barely knows comes and begs her to bring some justice to the death of a local boy, she is forced to face the suffering of the most vulnerable in Baghdad and the emotional and mystical legacy of her mother, a famed ecstatic whose love for God eclipsed everything. The Lover is a historically sensitive mystery that introduces us to the world of medieval Baghdad and the lives of the great Sufi mystics, washerwomen, Hadith scholars, tavern owners, slaves, corpsewashers, police, and children indentured to serve in the homes of the wealthy. It asks what it means to have family when you have nearly no one left, what it takes to love and be loved by those who have stuck by you, and how one can come to love God and everything He’s done to you.PRAISE FOR THE LOVERThe Lover #1 Amazon Bestseller “Completely engrossing and richly atmospheric. Tenth century Baghdad comes alive through the eyes of a dazzling cast of characters.”— Ausma Zehanat Khan, acclaimed author of The Getty-Khattak Mysteries“Dust and cool water; ascetism and the bonds of love. In 10th century Baghdad, Zaytuna is torn between the mysticism of Sufi practice and her need for connection to the world – and the reality of survival day to day. When a child dies in a fall, she must try to understand why, bringing her into conflict with both powerful people and her own brother, and challenging, too, her own understanding of herself and her faith.”— Marian Thorpe, Author of the Award Winning Empire's Legacy Series“Too often, narratives of women in Islam are told from the vantage point of the privileged, the women of the wealthy classes … this novel turns that narrative on its head.”— Safiyyah Surtee, AltMuslimahDr. Laury Silvers debut novel transports the reader to 10th century Baghdad, during the city's golden age when it was one of the largest and most diverse cities in the world. Her exquisite descriptions of the city and erudite knowledge of its historical denizens render real the people of Baghdad to the reader, whether pious mystics, cynical wine merchants, or frontier soldiers turned detectives. It's a great mystery and its faithful portrayal of Baghdad makes it a compelling read for anyone interested in the history of Islam and the Medieval Middle East.--Sherwan Hindreen Ali, a native Baghdadi and graduate student in the Institute for Islamic Studies, McGill UniversityThis is a novel that will both entertain readers and educate them about a wide range of subjects relating to intellectual, social and cultural history of the period in which it is set. It successfully weaves together fiction with meticulous historical research. --Michael Mumisa, Cambridge Special Livingstone Scholar With an informed, historical view of the spiritual atmosphere in medieval Baghdad, Laury Silvers has written an exciting mystery in lucid, gripping prose, bringing to life complex individuals of the past, moral agents both layered and conflicted. --Cyrus Ali Zargar, Al-Ghazali Distinguished Professor, UCF and Author of The Polished Mirror",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Islam",
    "Historical",
    "Historical Mystery",
    "Literature"
  ],
  "author": "Laury Silvers",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/46028371-the-lover"
}