{
  "title": "His Unexpected Heiress",
  "description": "An unexpected fortune falls into a tradeswoman’s lap, a gentleman insists it rightfully belongs to him, will falling in love make matters better or worse?\n\nA third son to an earl, Adam Gillensford knows his only hope of an inheritance is through his great uncle. But when the Will is read, Adam learns most of the wealth has been left to a complete stranger, and a seamstress at that. If he hopes to salvage any kind of funds for himself, he has two choices: adhere to his late uncle’s wishes and assist the new heiress in finding her way, or sabotage her so the courts will find her unfit to inherit. Deciding his course would be easier if the heiress wasn’t so enchanting. Elaine Chapple, a woman in trade, is rather used to being seen as unusual. But running her own dress shop is far different from discovering a man she barely knew left his entire estate in her care. As unexpected as the fortune is, the help of the gentleman attached to it is even more perplexing. Does Mr. Gillensford mean to make her a success, or a fool? With a greedy family urging Adam to act for his own good, and Elaine’s difficulty in adapting to her new life, only love could possibly untangle this mess.\n\nHis Unexpected Heiress is part of the ENTANGLED INHERITANCE series, a set of stand-alone regency-romance novels. Look for the complete collection of stories by these incredible authors:A Provision for Love by Heather Chapman (June)His Unexpected Heiress by Sally Britton (July)The Rivals of Rosennor Hall by Rebecca Connolly (August)An Unwelcome Suitor by Ashtyn Newbold (September)\n\n\n\n\nOther Titles by Sally Britton:\nThe Branches of Love SeriesMartha's Patience, a prequel novella\nThe Social Tutor\n\nThe Gentleman Physician\n\nHis Bluestocking Bride\n\nThe Earl and His Lady\n\nMiss Devon's Choice\n\nCourting the Vicar's Daughter\n\n\n\nIngelwood Romances\nRescuing Lord Inglewood\n\n\nDiscovering Grace\n\n\n\n\nStand-Alone Works\n\nThe Captain and Miss Winter",
  "genres": [
    "Romance",
    "Regency",
    "Historical Romance",
    "Historical Fiction",
    "Historical",
    "Clean Romance",
    "Audiobook"
  ],
  "author": "Sally Britton",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/46024231-his-unexpected-heiress"
}