{
  "title": "The Brother’s Creed Box Set: The Complete Zombie Apocalypse Series",
  "description": "Limited-Time New Release Price! Grab it before it goes up to $8.99!\n\n\n\n\"The Brother's Creed is Zombie Apocalypse done with heart and style.\" ★★★★★“Fast paced and full of action!” ★★★★★“This is one of the best Zombie series available!” ★★★★★\n\n\n\nTwo brothers fight to survive the end of the world with their faith and humanity intact!\n\n\nReturning to town after a weekend on their ranch in Montana, James and Connor Andderson learn firsthand that the dead are coming back to life. As the nation succumbs to an outbreak unlike anything ever seen, the brothers must gather their supplies and set out on a road trip to save their parents from a fate worse than death itself. Their naïve optimism quickly fades, and the choices they confront will leave them scarred for life.Meanwhile, Emmett Wolfe, along with his daughter and ex-wife, leave Texas bound for a safe haven in Alaska. Along the way, they rescue a mysterious young woman from a shopping mall, but the cost of their daring recovery will leave them reeling. The U.S. quickly falls into chaos, and Emmett learns early on that there are dangers far worse than the undead.Tank finds himself amidst a group of survivors heading north, but their convoy is stopped dead in its tracks when they’re ambushed by a gang of ruthless killers. Escaping the attack, Tank and two others are hunted through Wyoming by the bloodthirsty Reclaimers. With no other choice, Tank has to face the reality that sacrifices are necessary if they are to survive.As the virus spreads across America, the remaining survivors must band together to fight not only the walking dead, but the living as well. Their journey to the Alaskan wilderness is met with constant hardship, betrayal, and death. But as the world crumbles around them, they will come to realize they cannot lose what makes them human. They must hold on to faith and hope or all is lost and they will not survive the coming apocalypse.\n\n\nGet the award-winning and best-selling series that has a combined total of over 550 FIVE STAR reviews on Amazon!\n\n\n\nThis box set includes the COMPLETE Brother’s Creed series:\n\nOutbreakBattlebornWolf PackBad CompanyLast Hope\nPLUS two bonus short stories:TankedLife After (Box Set exclusive)",
  "genres": [
    "Horror"
  ],
  "author": "Joshua C. Chadd",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/46023025-the-brother-s-creed-box-set"
}