{
  "title": "Aria",
  "description": "National BestsellerThis extraordinary, gripping debut is a rags-to-riches-to-revolution tale about an orphan girl's coming of age in Iran.\"Aria is a feminist odyssey, about a girl in a time of intolerance as the revolution in Iran is breaking out . . . a poised and dramatic historical novel with contemporary relevance.\" --John Irving\"Here comes a sweeping saga about the Iranian revolution as it explodes--told from the ground level and the centre of chaos. A Doctor Zhivago of Iran.\" --Margaret Atwood (on Twitter)It is the early 1950s in a restless Iran, a country powerful with oil wealth but unsettled by class and religious divides and by a larger world hungry for its resources. One night, a humble driver in the Iranian army is walking home through a neighbourhood in Tehran when he hears a small, pitiful cry. Curious, he searches for the source, and to his horror comes upon a newborn baby girl abandoned by the side of the road and encircled by ravenous dogs. He snatches up the child, and forever alters his own destiny and that of the little girl, whom he names Aria.Nazanine Hozar's stunning debut takes us inside the Iranian revolution--but seen like never before, through the eyes of an orphan girl. Through Aria, we meet three very different women who are fated to mother the lost reckless and self-absorbed Zahra, wife of the kind-hearted soldier; wealthy and compassionate Fereshteh, who welcomes Aria into her home, adopting her as an heir; and finally, the mysterious, impoverished Mehri, whose connection to Aria is both a blessing and a burden. The novel's heart-pounding conclusion takes us through the brutal revolution that installs the Ayatollah Khomeini as Iran's supreme leader, even as Aria falls in love and becomes a young mother herself.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Iran",
    "Historical",
    "Audiobook",
    "Book Club",
    "Canada"
  ],
  "author": "Nazanine Hozar",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/46017939-aria"
}