{
  "title": "Imperfect Union: How Jessie and John Frémont Mapped the West, Invented Celebrity, and Helped Cause the Civil War",
  "description": "Steve Inskeep tells the riveting story of John and Jessie Frémont, the husband and wife team who in the 1800s were instrumental in the westward expansion of the United States, and thus became America's first great political coupleIn 1813, John Frémont was born a nobody. His mother conceived him out of wedlock, and at age 13, in Charleston, South Carolina, he was sent to work to support her and his siblings. But, via the assistance of series of mentors, he rose from obscurity, making his way to Washington, before joining the upper echelons of society by marrying the daughter of an influential senator, Thomas Hart Benton, who only reluctantly blessed their union. Jessie Benton Frémont, as she came to be known, had grown up in the mold of her father, knowing personally then President Andrew Jackson, but her ambition was frustrated. She had limited options for own career advancement, at a time when women could not yet vote let alone hold public office. But she threw herself passionately into the promotion of her husband who rose to become one of the most famous men of the era. John travelled thousands of miles on horseback, at times with an almost willful indifference to his safety and that of the other members of his expeditions, many of whom would perish, in an effort to map the uncharted American West. The notes and letters he would send home Jessie skillfully shaped into dramatic reports and bestselling books. She became his political adviser, and was gradually recognized as a political force in her own right. Thus she helped lift John to a seat in the Senate, and ultimately to propel him, in 1856, to become the first-ever presidential nominee of the newly established Republican party. With rare detail and in consummate style, Inskeep tells this story of a couple whose joint ambitions and talents seemed somehow intertwined with those of the nascent United States itself. The Frémonts came to be influential to not one but three great social movements of the times--westward settlement, women's rights and opposition to slavery. Their adventures amount to nothing less than a tour of the early American soul.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Civil War",
    "Politics",
    "Audiobook"
  ],
  "author": "Steve Inskeep",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/46033572-imperfect-union"
}