{
  "title": "Impetuous",
  "description": "What if you had to hit pause on your life and rewind? Just when you were ready to fast forward, prepared for anything but your past skipping through your victory lap. Tess Sinclair thought she had it all figured out, or at least, locked down for those last few months of prerequisite classes and working weekend shifts to earn tuition. One phone call from child services changes all her plans and she is forced to move back home. Maddy. Mad as sin. Mom. Tess may have turned eighteen, but now she feels like an adult going backwards. There are sibling fights to break up without joining them. Dinner recipes to fake from the can because her mother's too medicated to recite the ingredients. Being the new girl at the final year at high-school is a whole other level of teenage torture that she should have outgrown. Ditto to boy crushes. The good boy gone bad, his devilishly smart twin, and the hot jock that normally wouldn't give her the time of day, forget make a play. All led by a dark prince that finds out her sneakers are made of glass. They ought to be the kings of the school and Tess the poor, bullied girl from the wrong side of the tracks. This Cinderella tale has been told before, with a charming but predictable ending. Except, no one seems to have gotten the tropes right. The prince has a wicked stepmother. The jock struggles to hide he has more brains than brawn. The rich, heartthrob twins are bullied by the masses instead of put on a pedestal. Tess is the only one willing to come to their rescue. Can she figure out the hidden secret twisting their roles? If Tess can't run, then she'll learn to fight fate to get her victory lap to the finish line. Warnings/Triggers for references to mental health, institutionalization and stereotypes. Mention of child abuse/neglect. There is adult intimacy, violence and language as well as the usual drugs and alcohol with these darker themes. Oh, and lame jokes. I have plenty of those. Some may offend since they can take a religious tone as I poke fun of the Catholic school. You were warned. In this book the main female character ends up with multiple love interests at the end of the series in a HFN. +++ How about a 'bully themes' RH book with a different twist? The MFC comes to the rescue of her bullied harem and they work together to overcome their challenges. I would NOT group this with other bully romances out there and don't want to disappoint anyone expecting otherwise. This book contains bullying of the main characters but not to each other, which is the twist, a bully romance where the harem comes together to deal with it.",
  "genres": [
    "Reverse Harem",
    "Contemporary",
    "Romance",
    "Young Adult",
    "Contemporary Romance",
    "High School"
  ],
  "author": "Mercedes Jade",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/46036431-impetuous"
}