{
  "title": "The Trials of Blackbriar Academy",
  "description": "I shouldn’t be here, and everyone knows it.  Blackbriar Academy is an enchanted school on a magical island, and everyone wants in. It’s a home away from home for the most advanced mages in the world—and only the absolute best of the best are given an invitation.  By some freak accident, I managed to get one.  If I pass the trials, I get to stay. With nowhere else to go, Blackbriar is my one shot at having a real life, and I won’t let anyone take this from me.  But there’s a catch.  It turns out the people on this island are being trained to hunt the darkness—basically, they’re being trained to hunt me.  To survive, I have to hide what I am. As a half-mage, I shouldn't have any magic at all. And yet, my natural abilities are almost impossibly powerful—and incredibly illegal. Over history, magic like mine has corrupted the souls of those who were born with it. They’ve all gone dark—razing towns and murdering hundreds of thousands throughout history.  All but me, and I have no idea why.  As the trials get more and more challenging, it’s clear I’m being hunted. If I’m caught… I die.  At Blackbriar Academy, nothing is ever as it seems... but I have nowhere else to go.  Nothing, and no one, will stand in my way.  The Trials of Blackbriar Academy is a full-length novel with a powerfully magical heroine, a riveting storyline, and an alternative relationship dynamic that supports our badass heroine's right to choose more than one man. Get ready for a breathtaking story, soulmate romance, lip-biting love scenes, mind-blowing magic, one kickass heroine, four gorgeous men, lots of toned muscles, fights to the death, and edge-of-your-seat action. This is a heart-pounding story filled with an academy fantasy romance unlike anything you’ve read before.  Buckle in for heart-pounding action, breathtaking magic, deadly assassins, four drop-dead gorgeous leading men, lots of toned muscles, and most importantly—a young woman’s journey of justice, self-discovery, and freedom.  READ THE WHOLE SERIES The Blackbriar Academy: a riveting and addictive academy fantasy romance series.  Book 1: The Trials of Blackbriar Academy Book 2: The Shadows of Blackbriar Academy Book 3: The Hex of Blackbriar Academy (Aug 2019) Book 4: The Blood Oath of Blackbriar Academy (Sept 2019) Book 5: The Battle for Blackbriar Academy (Oct 2019)  \nPublisher’s Note:\n The Blackbriar Academy saga is a reverse harem series with explicit scenes and is meant for mature readers who enjoy spellbinding stories with a few very steamy, fan-your-face moments in their fantasy fiction.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Magic",
    "Paranormal",
    "Audiobook",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Olivia Ash",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/46035263-the-trials-of-blackbriar-academy"
}