{
  "title": "Two Moons of Sera Vol. 1",
  "description": "In a world where water and earth teem with life, Serafay is an anomaly. The result of genetic experiments on her mother's water-borne line Serafay will have to face the very people responsible to discover who she really is. But is she the only one?This Omnibus includes Volumes 1, 2, 3 and 4! Get the whole story in ONE file.Review from Connie J Jasperson, Author's blog Best in Fantasy!\"I LOVED this series. Sera and Tor are a great couple, and their struggle to find safety takes them to many dangerous places. Still, they find others like them, others who do not fit in and who are unhappy with the atrocities committed in the name of war.Buy the first instalment for .99. Just do it.You won't be able to rest until you have read them all.\"Review by Michele Stefanides Author of Tales From Shrimps\"Two Moons of Sera, or 2MOS as Tyler refers to it, is a delightful read. Although written in words, 2MOS leaves me feeling as though I’m being carried along through the story on the wind of a song. It feels lyrical and fluid, those feelings heightened by the sea-side setting.\"Review by Dannye Williamsen Author of Second Chances and The Threads That Bind\"It isn’t often that I am swept into the current of a story as quickly as I was with Pavarti K. Tyler’s Two Moons of Sera...Being an impatient reader, I would not normally choose a serial novel; however, if the subsequent volumes are as well-written and attention-grabbing as this one, it would be worth the wait.\"Review by james crawford Author of Caleo\"This is a great start to what I am sure will be an amazing serial Novel. I loved the world Sera lives in and how we are learning about it through her eyes along with her. By the sounds of it, Sera's world is only going to get more complex and wonderful as she discovers her place in it. I am very fond of Sera. Although is raised in a very sheltered way, her world literally stops at the edge of the beach, she is a strong willed, adventurous woman and I can’t wait to see her character develop.\"Review by ME Summers\"One of the best things about this story is its rich description of setting. The characters move through the story with sand and cliff and scratchy tree, punishing sun and cooling sea. It has the effect of making the fantasy feel real. I can easily see the landscape as the characters move through it, and it gives me a grounding in reality I need to really connect with a fantasy story.\"",
  "genres": [],
  "author": "Pavarti K. Tyler",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/12444643-two-moons-of-sera-vol-1"
}