{
  "title": "Kim Jiyoung, Born 1982",
  "description": "A fierce international bestseller that launched Korea’s new feminist movement, Kim Jiyoung, Born 1982 follows one woman’s psychic deterioration in the face of rigid misogyny.Truly, flawlessly, completely, she became that person.In a small, tidy apartment on the outskirts of the frenzied metropolis of Seoul lives Kim Jiyoung. A thirtysomething-year-old “millennial everywoman,” she has recently left her white-collar desk job—in order to care for her newborn daughter full-time—as so many Korean women are expected to do. But she quickly begins to exhibit strange symptoms that alarm her husband, parents, and in-laws: Jiyoung impersonates the voices of other women—alive and even dead, both known and unknown to her. As she plunges deeper into this psychosis, her discomfited husband sends her to a male psychiatrist.In a chilling, eerily truncated third-person voice, Jiyoung’s entire life is recounted to the psychiatrist—a narrative infused with disparate elements of frustration, perseverance, and submission. Born in 1982 and given the most common name for Korean baby girls, Jiyoung quickly becomes the unfavored sister to her princeling little brother. Always, her behavior is policed by the male figures around her—from the elementary school teachers who enforce strict uniforms for girls, to the coworkers who install a hidden camera in the women’s restroom and post their photos online. In her father’s eyes, it is Jiyoung’s fault that men harass her late at night; in her husband’s eyes, it is Jiyoung’s duty to forsake her career to take care of him and their child—to put them first.Jiyoung’s painfully common life is juxtaposed against a backdrop of an advancing Korea, as it abandons “family planning” birth control policies and passes new legislation against gender discrimination. But can her doctor flawlessly, completely cure her, or even discover what truly ails her?Rendered in minimalist yet lacerating prose, Kim Jiyoung, Born 1982 sits at the center of our global #MeToo movement and announces the arrival of writer of international significance",
  "genres": [
    "Fiction",
    "Feminism",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Asia",
    "Asian Literature"
  ],
  "author": "Cho Nam-Joo",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/46041199-kim-jiyoung-born-1982"
}