{
  "title": "The Adventurer's Son",
  "description": "\"I’m planning on doing 4 days in the jungle. . . . It should be difficult to get lost forever\": These were the haunting last words legendary adventurer Roman Dial received from his son, before the 27-year old disappeared into the jungles of Costa Rica. This is Dial’s intensely gripping and deeply moving account of his two-year quest to unravel the mystery of his son’s fate.In the predawn hours of July 10, 2014, twenty-seven-year-old Cody Roman Dial, the son of preeminent Alaskan scientist and National Geographic Explorer Roman Dial, walked alone into Corcovado National Park, an untracked rainforest along Costa Rica’s remote Pacific Coast that shelters miners, poachers, and drug smugglers. He carried a light backpack and machete. Before he left, he emailed his father: \"I am not sure how long it will take me, but I’m planning on doing 4 days in the jungle and a day to walk out. I’ll be bounded by a trail to the west and the coast everywhere else, so it should be difficult to get lost forever.\"They were the last words Dial received from his son.The Adventurer’s Son recreates the author’s two-year quest to learn the truth about his child’s disappearance. Immediately after Cody Roman’s planned departure date passed without a word from him, Dial set off for Costa Rica. As he trekked through the dense jungle, interviewing locals and searching for clues—the authorities suspected murder—the desperate father was forced to confront the deepest questions about his own life. Roman had raised his son to be fearless, to seek out adventure amid earth’s wildest places. Was he ultimately responsible for his son’s fate?A harrowing story of drama, adventure, and a father’s love for his son, set in the most beautiful and dangerous reaches of the planet, The Adventurer’s Son is a mystery, the memoir of a father and his son, and an unforgettable story of love and profound loss.The Adventurer’s Son includes 25 color photographs.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Travel",
    "Adventure",
    "Biography",
    "Audiobook",
    "Nature"
  ],
  "author": "Roman Dial",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/46041442-the-adventurer-s-son"
}