{
  "title": "Dating Jesus: A Story of Fundamentalism, Feminism, and the American Girl",
  "description": "By the age of twelve, Susan Campbell had been flirting with Jesus for some time, and in her mind, Jesus had been flirting back. Why wouldn't he? She went to his house three times a week, sat in his living room, listened to his stories, loudly and lustily sang songs to him. So, one Sunday morning, she walked to the front of her fundamentalist Christian church to profess her love for Jesus and be baptized. But from the moment her robe floated to the surface of the baptistry water, she began to question her fundamentalist faith. If baptism requires complete immersion underwater, what does it mean, if a piece of fabric attached to a would-be Christian floats to the top? Does the baptism still count? In Dating Jesus,, Campbell takes us into the world of fundamentalism-a world where details really, really matter-while wrestling with questions that would thwart any young woman intent on adhering to a literalist religion. If dancing isn't permitted, what do you do when you're voted part of the homecoming court? If instrumental music is prohibited inside the church, can a piano be played during your wedding? For a while, Campbell diligently plays by the gender-restrictive rules. She knocks on doors for Jesus rather than preach from the pulpit; diligently guards her chastity, refusing even to date; and memorizes long fragments from the Bible. But her questions continue to surface, and when dogmatic answers from her Bible teachers, family, and congregational fellows confirm that women will never be allowed a seat at the throne, her faith begins to erode. After Campbell flees her church, she remains thirsty for an unwavering and compassionate faith she knows is out there, somewhere. To find it, she returns to the historical roots of religious movements, studies the works of early feminist thinkers and contemporary theologians, and rereads the Bible with the same fervor of her youth. Dating Jesus is a lovingly told tale of how one born-and-bred fundamentalist matured into a feminist while holding onto her sanity and sense of humor.",
  "genres": [
    "Religion",
    "Memoir",
    "Nonfiction",
    "Feminism",
    "Biography Memoir",
    "Biography",
    "Christianity"
  ],
  "author": "Susan Campbell",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/4606796-dating-jesus"
}