{
  "title": "Seren's Initiation",
  "description": "Seren Perry, smart and pretty but shy and withdrawn, wins a scholarship to Cappella Academy after scoring high on the school’s admissions test. She’s sad to be leaving her best friend, Kayla, but won’t miss her troubled parents back at home. Seren, who attracts the eye of rich boys who are feared by the administration of the academy, doesn’t know how many lives she’s already involved in. And she has only been in classes for one day! But trouble starts right away when Seren trips and almost falls into a giant oak tree on the way to classes. She is rescued by Clyde Collins, handsome, wealthy and one of the rich boys who takes notice of Seren, but not for the right reasons. One of Glenn, also takes notice of her and her thick, dark hair and gorgeous body. Like Seren, Glenn, though rich and handsome, is also quiet and shy. Glenn’s heart skipped a beat from the moment he saw her. But Glenn also took part in the gang’s “extracurricular” activities, robbing and setting fire to buildings in town owned by successful business. Seren finds out Clyde is the leader of a gang of vicious bullies at the academy. Her new friend Betty tells her to stay away from them no matter what. But then Seren meets Glenn, sees him as the strong, silent type, and feels she can trust him. Seren’s heart skips a beat every time Glenn looks at her with his longing, deep green eyes. By chance Seren and Glenn find themselves alone together. But it’s a setup. Clyde noticed earlier Glenn and Seren talking. Clyde forces Glenn to take Seren into his confidence in any way possible, money, love, or sex, whatever it takes. Clyde is hatching a criminal plan and needs a girl who is new in town. But Glenn has a powerful attraction to Seren, even though it’s only the first day of school. Will Glenn twist Seren’s heartstrings and do the gang’s dirty work or will he fall for her and protect her? How will she answer when Clyde asks her to commit a crime for the gang? Or will Clyde and the others start falling for Seren like Glenn? Seren’s Initiation is the story of a poor girl entering a world of wealth and privilege, surrounded by attractive young men who want her and women who want to destroy her. In this reverse harem high school erotic romance, Seren wonders what shocks and surprises tomorrow will bring, and if she can even survive the first day!",
  "genres": [
    "Reverse Harem",
    "High School"
  ],
  "author": "Candice Logan",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/46064561-seren-s-initiation"
}