{
  "title": "Face It",
  "description": "‘I was saying things in songs that female singers didn’t really say back then. I wasn’t submissive or begging him to come back, I was kicking his ass, kicking him out, kicking my own ass too. My Blondie character was an inflatable doll but with a dark, provocative, aggressive side. I was playing it up, yet I was very serious.’BRAVE, BEAUTIFUL AND BORN TO BE PUNKDEBBIE HARRY is a musician, actor, activist and the iconic face of New York City cool. As the front-woman of Blondie, she and the band forged a new sound that brought together the worlds of rock, punk, disco, reggae and hip-hop to create some of the most beloved pop songs of all time. As a muse, she collaborated with some of the boldest artists of the past four decades. The scope of Debbie Harry’s impact on our culture has been matched only by her reticence to reveal her rich inner life – until now.In an arresting mix of visceral, soulful storytelling and stunning visuals that includes never-before-seen photographs, bespoke illustrations and fan art installations, Face It upends the standard music memoir while delivering a truly prismatic portrait. With all the grit, grime, and glory recounted in intimate detail, Face It recreates the downtown scene of 1970s New York City, where Blondie played alongside the Ramones, Television, Talking Heads, Iggy Pop and David Bowie.Following her path from glorious commercial success to heroin addiction, the near-death of partner Chris Stein, a heart-wrenching bankruptcy, and Blondie’s break-up as a band to her multifaceted acting career in more than thirty films, a stunning solo career and the triumphant return of her band, and her tireless advocacy for the environment and LGBTQ rights, Face It is a cinematic story of a woman who made her own path, and set the standard for a generation of artists who followed in her footsteps – a memoir as dynamic as its subject.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Debbie Harry",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/46059211-face-it"
}