{
  "title": "Moonshine:",
  "description": "When Rose and her family came into that locality, they really felt embarrassed seeing the surroundings there. It was such a locality only very rich people were living in big palace like houses and comparing with them Rose' family was quite poor indeed. Because of her father's employment in one of the company's there, Rose family had to move to that place.Then Rose had to go to the palace of Margaret who was one of the very rich ladies in that locality and a managing director of two thousand crore company when her brother Ginaldy went into their house to play with Margaret's son Stuart. There first she met with Margaret whom appeared to her quite kind, considerate and welcoming. Rose instantly started liking Margaret. Then she met Stuart inside that palace and his handsome physique and active eyes immediately attracted Rose. Then many a time Ginaldy went into the house of Margaret, many a time Rose went there to fetch him back and in that process many a time she met with Stuart also. Slowly a love like thing started in between them both and in due course of time they recognized it as love.But Margaret who was the richest lady put a condition to agree for Stuart marriage to be performed with Rose. She did not say what that condition was in before saying that she would say about it only after marriage. But after marriage when Rose came to know about that condition she became aghast and terrified. It was such a condition that sure would create disputes and differences between Stuart and her. But Rose had to agree to that as she promised before marriage itself to do whatever Margaret would ask. When Rose became managing director of the two thousand crore company in the place of Margaret as a part of fulfilling her promise to her mother in law, her worst fear came true. Stuart really misunderstood her, quarreled with her and left the house. The rest of the story proves Rose' courage, intelligence and tenacity. While trying to take the company onto profit tracks at all her best, Rose relentlessly made attempts to reconcile with Stuart. She got success not just in taking the company onto the profit tracks again, but also could make Stuart understand her love and live along with her. Then Stuart and Rose once again were the happiest couple.This novel tells how a common girl stands against uncommon difficulties and situations if arise in her life. Even it is a heroine oriented novel, hero's character also is dignified, decent and commendable. A heroine oriented romantic thriller.The romantic and suspense thrillers of this author, ‘A Mansion Of Illusions’, ‘Across The River…Under The Bridge…’, ‘Chasing Butterflies’, ‘Rain Flower’, ‘Nirupama’, ‘A Village, A Forest And An Old Mansion’ ‘Lovenest’, ‘Moonshine’, ‘Scarecrow’ ‘Enna (Her life….her love…..her struggle) ’, 'Sand Dunes (A collection of eight short stories)' ‘Rose Garden’ and ‘Amaswitha’ (Sex, Psychology And Supernatural) along with two non-fiction books ‘Body, Mind And You’ and ‘English Grammar Simplifier’ are available as ebooks only on Amazon.",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/46076182-moonshine"
}