{
  "title": "Magic Over Boys",
  "description": "For a girl who has always been on the outside looking in, the rebel, the loner, the shadow walking amongst the ordinary non-suspecting at all my previous schools; I'd never thought I'd become one of the Beautiful Ones at the most exclusive posh prep academy called Shadowlight Academy.  It wasn't easy. And I almost died because of it. Being bullied by them and surviving it, changed everything. Now I'm one of them. The power behind the Beautiful Ones is unlike anything I have ever encounter...so is its beautiful eternal draw. It wants me, wants my power...can I resist?  Unlike many high school heroines in fantasy books, I always knew I was not ordinary. Far from it.  Since I was two, I have been seeing angels and demons. Given the gift of battle as a warrior, my role as a slayer often interferes with my role as a normal girl. So no, I was never a typical girl who had just found out she was heir to some magical family or something like that. I've been \"gifted\" practically all my life.  So when my ordinary family moved us to San Francisco to a new school where my father teaches, I didn't think much of the school. Shadowlight Academy, the most exclusive and posh prep academy for the super rich. I thought I would be there to slay the evil like an undercover superhero amongst the ordinary.  I just didn't think the ordinary would all be extremely unordinary. Especially the three most popular kids in school. Then there's the hot brooding rebel boy who didn't seem to fit in, too. Everyone here has secrets, and I am determined to find out what, before it kills me...the entire Academy and even the world.  Okay, I might be dramatizing a bit, but yes, from what I've barely seen...it could be that big. Better get my game gear on and my entire armor on, because this is going to be one epic battle. But who can I trust?  The Beautiful Ones, which rule Shadowlight Academy is known to be both beautiful yet wicked. They're fascinated with me as I am of them. But who or what are they really, and why do I feel drawn to them like a fly to a spider? Can I escape their beautiful web before I am trapped forever? Do I want to?  *Magic Over Boys is the second in a high school paranormal academy series for mature teens and up. Expect a tough heroine who can take on anyone and anything, will, lots of steam literally and figuratively, and a reverse harem.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Young Adult"
  ],
  "author": "Kailin Gow",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/46066869-magic-over-boys"
}