{
  "title": "Stans By Me: A Whirlwind Tour Through Central Asia - Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan",
  "description": "Ged Gillmore likes to think of himself as James Bond. Or Indiana Jones. Or a suave and daring hybrid of both. As he flicks through his world atlas, he pictures himself infiltrating enemy lines, uncovering ancient artefacts, and strapping himself in for white-knuckle flights over dusty arid landscapes. So the very thought of joining an organised bus tour is enough to make our intrepid traveller dry retch and shudder.But join one he must if he's to survive multiple border crossings on his mission to discover the mysteries of Central Asia in only three weeks. Follow our rugged Indiana Bond as he clambers aboard a bus with an unlikely group of characters thrown together by exotic circumstances for a whirlwind tour through the five ‘Stans – Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan.* Prepare yourself to come face to face with mesmerizing landscapes and striking citadels that look like sets from Star Wars and Game of Thrones.* Learn about ancient rituals such as goat-pulling and bride-stealing that are still practised today.* Visit floating mountains, singing dunes, sunken forests and bejewelled cities so beautiful they are almost impossible to describe.Along the way you’ll encounter yurt erections, bullet trains and enemy travel agents. You’ll learn how a baby’s first steps are celebrated in Kyrgyzstan. You’ll become acquainted with the life-and-death importance of etiquette in a Khan’s palace. And you’ll be gently reminded that people – even those on a seemingly boring bus tour – are rarely what they seem.Stans By Me is a hilarious travel memoir full of fascinating characters, magnificent monuments and curious customs – all told with Gillmore’s deadpan British wit. If you enjoy the travel tales of Bill Bryson, David Sedaris, J. Maarten Troost or Will Ferguson, you’ll get a kick out of Stans By Me.",
  "genres": [
    "Travel",
    "Asia",
    "Nonfiction",
    "Kazakhstan"
  ],
  "author": "Ged Gillmore",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/46065667-stans-by-me"
}