{
  "title": "Starting Out Sideways",
  "description": "Roseanna Plow is perfectly content with her nice, simple life on Long Island, despite the fact that she's being driven slowly insane by her meddling mother, who resembles Donna Reed on drugs. Rosie is very happy with her handsome husband and a fulfilling career as job counselor for the developmentally challenged. It might not be glamorous work, but Rosie is proud of the fact that she cares more about people than Prada. What more could a woman want in life? Except maybe being able to wear a sexy thong that doesn't make her behind look like a rump roast in butcher string…But when Rosie's incredible husband turns out to be an incredible putz--sleeping with her best friend Inga--her life goes from Seventh Heaven to Jerry Springer in the blink of an eye and the tip of a wine glass. Alone and deceived, but with her sense of humor still intact, Rosie turns to her wonderfully wacky mother to help her bounce back. Of course, Ma's recipe for mental recovery leaves much to be desired. And after Rosie discovers a painful family secret, hidden behind years of lies, she must set out to find herself and what really matters in life.Along the way, Rosie is surprised to find help from Mickey Hamilton, a.k.a. Ham, who is kind, generous, and has a great butt to match. If only Rosie can overlook the fact that he's nicknamed after the meat section at the local supermarket he manages. Milton, one of Rosie's endearing mentally challenged clients--and Ham's employee--also becomes a source of comfort along the way, always ready to defend \"Miss Plow's\" honor and warm her heart, even as it's breaking. And can a twenty-five-year-old punk office assistant with hair like candy corn really become Rosie's new best friend? As she moves along the twisted road to self-discovery, Rosie finds happiness, acceptance, and even love - though none of it in the places she'd expected.With laugh-out-loud scenes seamlessly interspersed among gut-wrenching moments of heartache, Starting Out Sideways is a unique and utterly delightful novel that will make you laugh, cry, and remember what's truly important in life.",
  "genres": [
    "Adult Fiction",
    "Fiction"
  ],
  "author": "Mary E. Mitchell",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/460465.Starting_Out_Sideways"
}