{
  "title": "Chasing butterflies.....:",
  "description": "Twenty one years old Susmitha started facing problems not just because of her parents death in a flight accident at her fifteenth year itself but because of the strange will executed by her father also. It was the tradition for generations together in her family that the fathers do write wills so that their daughters get right on the properties of their fathers only after they enter into their twenty second year and get married. They do lose their right completely over their father’s assets if they marry before they enter into their twenty second year. It was just because some women in the previous generations in her family spoiled themselves and the properties by marrying before they enter into their twenty second year and some other women did the same by not marrying for a long time, they preferred to write wills like that. Susmitha did not know whether any girl in the previous generations of her family faced any problem because of those wills but the will executed by her father like that became a death warrant to her. It was just because of her uncle Nagendra Rao who became the guardian to her and her properties after the death of her parents and his wife and son wanted so desperately to get rid of Susmitha to have her properties completely for themselves. While she was thinking so furiously how to escape from that problem, she remembered only one person Madan who was her college-mate and towards whom she was attracted so immensely. Without bothering with the little dispute she has with him she went to his faraway village and house, blackmailed him with a secret she came to know about him and could secure shelter in his house. When she apologized to him for her past behavior and for the way she blackmailed him to get shelter in his house while expressing her love on him and both came to the decision to marry also, she thought all her problems have been solved. But Mamatha, about whom Susmitha came to know by reading the diary of Madan, who loved Madan a lot but refused by him and fell into the river while struggling with Madan on the bridge of the river in that village started coming to her again and again saying that she wanted to take revenge on Madan, Susmitha started feeling fear and strange incidents started taking place. While Susmitha was saying that Mamatha died, became a devil and was hell bent upon to take revenge on Madan and Madan took the help of his cousin and psychologist Sukanya to treat her. What happened ultimately whether Mamatha was successful in taking revenge on Madan or Sukanya in treating Susmitha is the story ‘Chasing butterflies…………..’The twenty one romantic and suspense thrillers of this author ‘A Mansion Of Illusions (1,17,731 Words)’, ‘A village, a forest and an old mansion (1,13,049 Words)’, ‘Chasing butterflies (1,11,211 Words)’ ‘Across the river…under the bridge (1,02,739 Words)’, ‘Enna (1,03,119 Words)’ ‘Strawberry (1,11,700 Words)’ ‘Amaswitha (1,51,618 Words)’, ‘Sasikala (1,09,423 Words)’ ‘Just Relax! (1,15,793 Words)’, ‘ House of Delusions (1,18,530 Words)’ ‘Half Opened Doors (1,23,600 words)’ ‘Lovenest (50,565 Words)’, ‘Moonshine (51,427 Words)’ ‘Nirupama (51,675 Words)’, ‘Scarecrow (52,226 Words)’ ‘Rose Garden (62, 284 Words)’, ‘Dusk (53,856 Words)’, ‘Rain Flower (53,139 Words)’ ‘rustle In The leaves (3,52,000 words) and ‘Snow Flower’ (2,15,200 words), Wisps Of Smoke (3,20,500 words) along with a short stories book ‘Sand Dunes (24,973 Words) and two non-fiction books ‘Body, Mind And You (16,533 Words)’ and ‘English Grammar Simplifier (18,436 Words)’ are available as ebooks and paperbacks only on Amazon websites. The total of word count of all these books is more than 25,00,000 (Twenty Five Lakhs words).",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/46073052-chasing-butterflies"
}