{
  "title": "Diamonds and Dragons",
  "description": "We are The Four Princes from The Four Kingdoms of Wyvern. Razor is the Red Prince from the Kingdom of RoseCliff. Jasper is the Green Prince from the Emerald Realms. Tar is the Black Prince from the Dark Forests. And Flint is the Silver Prince from the Metal Lands.  We are princes one day who will rule our kingdoms in Wyvern. Right now, we are the Kings of Wyven School for Boys, a school known for the toughest training of rulers and heads of states to be in order to prepare them for the cruel, cruel world we know of, in the kingdoms of Wyvern.  On a typical day at Wyvern School for Boys, one student or another gets beaten badly, pranked on so viciously, that they end up seriously injured or close to death. It is the way of Wyvern. It is how kingdoms determine the next heir and successors to thrones.   It is a vicious game. One of survival. One of rules.   So when they let in Allotrope Free from some nowhere kingdom, we felt affronted. Assaulted with disrespect.  First of all, Allotrope is not a boy, but this girl, who is much too pretty and gorgeous to be in a school full of boys.   Second, she is the last thing anyone would think could be a ruler or head of state. She is an orphan.   Wyvern School for Boys is letting her in as a statement from one of our mothers, who is the ruling Queen of one of of kingdoms. Girls can grow up to become rulers too.   Kingdoms are at sake. Real wars are being fought. The last thing we need is a girl like Allotrope to make everything we stand for, a whole big joke.   So, when it comes time to eliminate a student at Wyvern School for Boys, Allotrope should be the first to go, and we Four Princes, will make sure she goes.   ****   Call me Allotrope...Ally for short. When I received a royal decree from Queen Jade of the Emerald Realms to attend school at Wyvern School for Boys, I thought it was a prank pulled by my friend William who apprentices with me at the Blacksmith. There was no way I could attend such an elite school just for kings-to-be.   But it was a Royal Decree, and if I don't obey the Decree, there was a threat of death to me and to all I hold dear, which probably means William and his parents, Bilbo and Kate, the blacksmith and his wife, the alchemist, whom had let me stayed with them since I became an orphan.   To keep them safe. To keep me from losing my head, I packed up what little belongings I had and enrolled at Wyvern School for Boys.   Everything at Wyvern School for Boys was meant to intimidate. Being the only girl at a school of incredibly handsome boys, especially the Four Princes, was intimidating.   Not to mention the cutthroat competition that literally cuts students from the school.   I'm stuck in a hard place...either get killed by defying the Royal Decree and also get everyone I cared for, killed. Or stick it out at Wyvern School for Boys, despite all the bullying and cutthroat games Wyvern has in store for me.   Of course, there is no choice...I must survive Wyvern School for Boys, or die trying.  Did I mention this is a school for Dragons, too? I just have to watch out for the fire.  ***Diamonds and Dragons is book 1 of the Cruel Princes of Wyvern Series for mature teens and up (17+) and is a paranormal dark fantasy bully romance reverse harem that will contain steamy and scorching scenes, dark fantasy elements, and consensual sex. This is a high school NA series.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal",
    "Enemies To Lovers",
    "Paranormal Romance",
    "New Adult",
    "Shapeshifters"
  ],
  "author": "Rachel Angel",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/46066870-diamonds-and-dragons"
}