{
  "title": "Grass Roots: African Origins of an American Art",
  "description": "Through the prism of America's most enduring African-inspired art form, the Lowcountry basket, Grass Roots guides readers across 300 years of American and African history. In scholarly essays and beautiful photographs, Grass Roots follows the coiled basket along its transformation on two continents from a simple farm tool once used for processing grain to a work of art and a central symbol of African and African American identity. Featuring images of the stunning work of contemporary basket makers from South Carolina to South Africa, as well as historic photographs that document the artistic heritage of the southern United States, Grass Roots appears at a moment when public recognition of the Gullah/Geechee heritage is encouraging a reexamination of Africa's contribution to American civilization.Working with basket makers from Charleston and Mt. Pleasant, South Carolina, historian Dale Rosengarten has been studying African-American baskets for over 20 years and brings her research up-to-date with interviews of artists and the results of recent historical inquiry. Anthropologist Enid Schildkrout draws on her research in West Africa and museum collections around the world to explore the African antecedents of Lowcountry basketry. Geographer Judith A. Carney discusses the origins of rice in Africa and reveals how enslaved Africans brought to America not only rice seeds but, just as important, the technical know-how that turned southern coastal forests and swamps into incredibly profitable rice plantations. Historian Peter H. Wood discusses the many skills that enslaved Africans contributed to the settlement of the Old South and at the same time used to resist the conditions of their servitude. John Michael Vlach, a leading authority on African American folk art, discusses the history of visual depictions of plantation life. Fath Davis Ruffins, a specialist on the imagery of popular culture, sheds light on the history embedded in old photographs of African Americans in the Charleston area. Cultural historian Jessica B. Harris explores the tradition of rice in American cooking and the enduring African influences in the southern kitchen. Anthropologist and art historian Sandra Klopper sketches the history of coiled basketry in South Africa, illuminating its evolution from utilitarian craft to fine art, parallel to developments in America. Anthropologist J. Lorand Matory traces the changing meanings of Gullah/Geechee identity and discusses its appearance as a significant force on the American cultural scene today.",
  "genres": [],
  "author": "Dale Rosengarten",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/4612733-grass-roots"
}