{
  "title": "Thoreau Bound: A Utopian Romance in the Isles of Greece",
  "description": "Aldous Huxley’s dystopian novel Brave New World (1932) depicts a futuristic society where politicians utilize technology to deceive their citizens so that they “love their servitude”. In a Foreword to a reprint of the novel (written in 1951) Huxley claims that the biggest flaw in his story is that a protagonist (“the Savage”) is given only two alternatives. Huxley writes: “If I were now to rewrite the book, I would offer the Savage a third alternative … in a community of exiles and refugees from the Brave New World.”The comic novel Thoreau Bound might be the third alternative — between the technological utopians and the computer-smashing neo-Luddites — that Huxley had in mind.O. Thoreau has more problems than Casanova. Like his ancestor Henry David, he is pummeled by the mass-culture that substitutes an artificial life for a real one, and deadens his creative genius. To find his authentic self he needs solitude — yet everywhere he wanders women flutter and fall around him like October leaves.With 50 books in his backpack and 100 bucks in his pocket, the wanderlusting Thoreau saunters through the heart of modern Greece. Here he encounters a dozen extraordinary women and men, each one who has left the beaten path to search for a more glorious existence. In the middle of his exotic journey, Thoreau discovers a hilarious Utopia, a community of liberated women — women wise, wonderful and wild. In this endangered paradise, healthy sexuality is celebrated, the natural world is treasured, work is play, creativity is nurtured, and the hearts of every individual flourish with laughter and genuine Love.Thoreau Bound explores the problems and themes of love, eros, Utopia, and the search for an authentic and meaningful life. The era of Don Juans and the exploitation of women is ending; a new model of human relationships is about to dawn. In the utopias of the future, women and men will relate as equal partners, nourishing each other with the utmost passion, compassion, and sincerity.",
  "genres": [],
  "author": "Michael Pastore",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/12446375-thoreau-bound"
}