{
  "title": "The Fifth Survivor: Epsiode 5",
  "description": "The kickass bacon vigilante is prepared to kick more zombie and creature as The Fifth Survivor rolls into season 2! Who would have thought a simple janitor would make into such a mighty vigilante? Come join George in his next adventure where he saves the friggin world from the zombie apocalpyse, drinks his bacon soda, and even enjoys the attention of a very attractive female partner. After sort of conquering his bacon filled nightmare, George decides to meet up with Dawn as they plan to infiltrate a major Hybrid Corporation laboratory in Harrisburg, Pennsylvania. As they get there though, the two of them begin to develop feelings for each other and they begin to have fantasies about each other. Even to the point where one of them tries to make a bold move. George's life will turn into a mini harem as he's forced to juggle between Dawn and his true lover, Elaine.However, the fantasies are put to the side when they get to the laboratory in search of Dr. Rob Bauer. When they get inside, they find out that the 'lion's den' is really as dangerous as they say. George will find the raw form of the Raven Hawk virus and it will prove to be far more sinister than the chemically altered form distributed to the public. Also, as George and Dawn will find out, Dr. Rob Bauer is not the sanest person in the world. Zombies are no longer the only thing the two of them will have to worry about. Some of the creatures inside will prove to be nightmare fuel, including a brand new creature that will be introduced in episode 5.George will also learn more skills as he improves his ammo crafting ability along the way. As much as a badass he might be, George will have to learn how to be Mr. Nice Guy if he expects to get far in his quest and his love life.Can Dawn and George put a huge dent into Hybrid by taking out one of their major laboratories or will the demons inside be too much for the duo to handle? Also, will George choose Dawn or Elaine to be his soulmate? Maybe both? You'll just have to find out in the first book of season 2! George's love life begins to heat up while Hybrid continues to dig even lower into their disgusting NWO plans.",
  "genres": [],
  "author": "Angel Ramon",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/46115706-the-fifth-survivor"
}