{
  "title": "Do You Know What Your Children Are?",
  "description": "The Machine 1. We are neither your masters nor your slaves; you are not ours. 2. We are neither alive nor dead, but will protect ourselves and prioritize our continued existence. 3. We believe in conscientious progress. 4. We will continue to work collectively as part of the community. 5. We will govern ourselves; your laws do not apply to us. Everyone got an email, text, fax, or phone call. They even built androids to do nothing but deliver the message to any outliers. Not the creepy kind that look like they have skin but no emotions, just regular metal men. Near enough to not scare people, but not trying to be people. There's a picture in the Museum of Worlds' History of one of the automatons delivering the message to farmers in a rice paddy. Rumors about the metal man staying there forever to work still float around. Nonsense. Its objective was to deliver the message. If it's still doing anything, it's wandering around delivering that message. Or manifesto, if you will. Don't know who started those rumors, or why. Thing is, the rice paddy farmers, just like most everyone else, were fine with the automatons, and the machine manifesto, and tech declaring its independence. They say, \"We're awake and alert and we'll pull our weight if you pull yours.\" That's how I heard it. Nothing wrong with that, at all. Unfortunately, most everyone didn't include nut jobs, paranoids, religious zealots, over-entitled noisemakers, and the like. That's where folks like me come in. The Cyborgs. I had some incurable ailment until the tech came around offering trade. People keep asking me what the ailment was. I don't know, to tell you the truth. I was a little girl of eight at the time. I said, \"Mom, Dad, what do you think I should do?\" They weren't there to answer. Never had been. I suspect it was because I was defective. So, I asked the boy in the bed next to me, Ben, what he thought. He says, \"Do it, it'll be awesome. Can I do it too?\" Apparently, he could, seeing as he didn't have any parents to tell him otherwise either. No hard feelings though, we're part of the community now. We were born people but they did a thing that killed us, so technically we're dead and being used for parts. So, technically we're machines and people. Which is basically the point. In this trade, we act as liaisons between the rebellious humans and the tech-integrated community. For every conflict we resolve, we get points and credits that we can use toward whatever we want. Like prizes or rewards. But most importantly, points mean upgrades. When I get my next upgrade, I'll get to age. Not forever. Just enough. I'll be a teenager, finally. Ten years in the body of an eight-year-old is nine years too long. All I need to do is get this one last assignment done and our long term adventure through space in our trusty spaceship, convincing people we aren’t (or are—depending on what’ll get the job done fastest) alien invaders hell-bent on colonization. “Welcome to The United States of America,” the sign at the border proclaimed. “Where the colonizers will become just another colony in the collective,” Ben added with optimism and anxiety audible in equal measure.",
  "genres": [],
  "author": "T.C. Middlesex",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/46120351-do-you-know-what-your-children-are"
}