{
  "title": "Such Unfortunates",
  "description": "Each year, more Americans die of drug abuse than the total of those who perished during the Vietnam War. This is the amazing and inspirational true story of an addict named Andrew and how he was able to overcome his addiction even though the odds were stacked against him.Andrew grew up in an unimaginably abusive family. His life seemed normal on the outside, but the internal turmoil he was experiencing was a horrific ordeal. Andrew's life began in an upper-class town of Moorestown, New Jersey. His family had a million-dollar beach house, he attended college, and even had the rare opportunity of driving a Ferrari around South Florida.Behind what seemed like an idyllic life was a nightmare of abuse, mental illness, and torment that no child should ever face. This led Andrew to suffer from pain, anxiety, panic attacks, and depression. Searching for relief, he found solace in drugs and became quickly addicted to anything that would change the way he felt. His addiction to drugs took him to such extremes as working for the DEA while being high on drugs, multiple rehabs, jails, becoming homeless, and even to the point of being considered dead.When all hope was lost, people he considers \"angels\" entered his life. One person, in particular, refused to give up on him even when everyone told her this was the best option. Through her determination, he was able to find the strength to look inside and find the real reasons for his addiction. Once he understood these reasons, he was finally able to figure out how to stay clean and successfully turned his life around.This book is a wild ride that will amaze, bewilder, amuse, and inspire you. People have said it was one of the \"most interesting books they have ever read,\" and, \"I never wanted to put it down.\" This book will give hope to anyone who is suffering from addiction or knows someone who is facing the adversity of addiction. It will show them why they should never give up. It also shows us how working together, we can beat this opiate epidemic.",
  "genres": [
    "Spirituality",
    "Memoir"
  ],
  "author": "Andrew     Mann",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/46124179-such-unfortunates"
}