{
  "title": "A Tail of Woah",
  "description": "As the daughter of an Inari Fox, celestial messenger to the gods, I should have been reverent, wise, and collected like my father. As the daughter of a kitsune queen, I should have been poised and delicate, with just a hint of playfulness to pay homage to the fox spirit within, just like my mother. Unfortunately, genetics can be unpredictable, and they ended up with a hot mess dipped in sarcasm, rolled in spunk, drizzled with sass, and sprinkled with pop-rocks. Hi! My name's Kaede, and I'm that mess. Life was a never-ending series of clubbing and drinking with my bodyguard, Hiroki. That was his official title, but he's more of a babysitter. He's a nogitsune, kind of like a kitsune, but more physically badass with a little less spiritual oomph. I have the hots for him, but he's afraid of losing important pieces of his anatomy if my parents catch him touching their daughter. I enjoyed my life, except for the hangovers and vomit. It was good. Until I decided to save a human from jumping off a building, just because he saw dead people. The supernatural community had one rule. Don't get caught. I ended up on the six-o'clock news and shipped off to boarding school to learn how to blend in better. Good times. The kicker is Aesir Academy is in Iceland. Know what's in Iceland? Ice, land, and ancient Norse gods. Some of which are sleeping. For a damn reason. Like wanting to destroy the world. Know what wakes them up? Celestial messengers. Know how to keep them from waking up? Kill the messenger. School should be about fitting in with the popular kids, not destroying the world and staying alive. At least I made some friends to help me save the world. Dogs love foxes. Especially hellhounds and werewolves… This trilogy is intended for mature audiences only. It contains graphic language, puns, and sexual situations. 18+ readers only! Harem members are added as the series progresses. Includes M/M themes. This is a medium burn reverse harem where the girl gets all the guys. Why Choose?",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fantasy",
    "Shapeshifters",
    "Romance",
    "Magic",
    "M M Romance"
  ],
  "author": "Jacquelyn Faye",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/46123397-a-tail-of-woah"
}