{
  "title": "Surrendering the Dark",
  "description": "For someone with a soul as dark as mine, there’s only one person who can bring light back into my world…\n\n\n\nLucifer\nWhen Amalie walked into my life, I thought for sure my Father was trying to trick me yet again. Wasn’t it enough that He cast me out of Heaven and forced me to live among the humans? Now, He’s dangling the promise of a soulmate in front of my face hoping for… what? That I’ll give up my quest to destroy humanity once and for all? That I’ll miraculously find my true self again? He only has Himself to blame for the monster I’ve become and the destruction I’ve caused. If He thinks bringing this girl into my life will halt everything I’ve worked so hard to achieve, it just proves He doesn’t know me at all.Yet, I can’t ignore the undeniable attraction I feel for the latest of Lilly’s descendants. Of course she’s beautiful. That’s a given. But there’s something in her eyes, an innocence and strength, that draws me to her, wanting to discover more about her, causing me to desire to make her mine.  \n\n\nAmalie\nI never thought wishes could come true, but the moment I saw Lucifer I knew mine had finally been granted. I come from a long line of strong women who have dedicated their lives to a singular purpose: defeating the forces of evil in order to protect the universe from their influence. Having my soul paired with Lucifer’s seems like a cosmic calamity, but there’s something in his eyes when he looks at me. I can see his desire to be accepted for who he is by someone who won’t judge him for his past deeds. Am I the one meant to lead his life down a different path? Can my love help Lucifer remember the angel he once was before his fall from Grace? I don’t have the answers to those questions, but my heart tells me our love will be everlasting and strong enough to change a soul ravaged by hatred and loneliness for far too long.\n\nThis is a part of my Watcher series of books. Minimum reading for this story is The Redemption Series (Malcolm, Anna, Lucifer, and Redemption).  Reading Order of Watcher Books by Series (All books FREE to read through Kindle Unlimited):\n\nThe Watchers Trilogy (Ages 13+)\nCursed\n\n\nBlessed\n\n\nForgiven\n\n\nThe Watcher Chronicles (Ages 17+ due to mature content and themes)\nBroken\n\nKindred\n\nOblivion\n\nAscension\n\n\nCaylin's Story (Ages 13+ - Can be read by younger readers without having to read the Watcher Chronicles)\nTimeless\n\nDevoted\n\n\nAiden's Story (Ages 17+ due to mature content and themes)\n\nAlternate Earth Series (Ages 17+ due to mature content and themes)\nCataclysm",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Angels"
  ],
  "author": "S.J. West",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/46114672-surrendering-the-dark"
}