{
  "title": "Renegade Flight",
  "description": "Aurora Rising meets Top Gun, with the addition of cybernetic dragons, in this is the witty, romantic, and electrifying sci-fi novel by Andrea Tang.Viola Park's life is over. She's gone from planning her future as a pilot-in-training to resigning herself to life on the ground. And it's all because she made one tiny, not-altogether-legal maneuver on the prestigious GAN Academy's entrance exam. It's bad enough that she didn't get into the Academy, but getting caught cheating? It's probably the worst thing Vi could imagine.Still, there are perks that come with Vi's family legacy at the school, and when Vi learns that recent pilot disappearances have left the Academy desperate for recruits, she does what any good Park would do--uses her connections to wiggle her way back in. But instead of matriculating with the regular class of future Peacekeepers, Vi is forced to enter as a probationary student, which means she'll have to work twice as hard to prove herself worthy of a place in the cockpit of one of the legendary dragon mechs.Lucky for Vi, the Academy has set up a combat tournament for all students, and the prize is a guaranteed spot in the Peacekeeper corps. Unlucky for Vi, she'll have to compete against her probie classmates, including Nicholas Lee, a mysterious boy prone to throwing Vi off her game. And as more Peacekeepers go missing, what starts out as a ploy to save her reputation turns into a fight for the future of Peacekeepers everywhere, and if Vi can't master her mech combat skills, she might not survive the battle.Set fifteen years after Prudence Wu took flight in Rebelwing, a new generation of scrappy young pilots challenge corruption, competition, and more dangerous mechs than ever, as they redefine what it means to be a revolutionary.",
  "genres": [
    "Young Adult",
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Dystopia",
    "Young Adult Fantasy",
    "Young Adult Science Fiction"
  ],
  "author": "Andrea Tang",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/46116430-renegade-flight"
}