{
  "title": "The Top 10 Reasons the Rich Go Broke: Powerful Stories That Will Transform Your Financial Life… Forever",
  "description": "THIS BOOK ISN’T JUST FOR THE RICH IT’S FOR YOU“There is no better time for this book than now. John is my “expert” advisor on the very important world of financial planning, and he wrote this book for you.” ROBERT KIYOSAKI, BEST SELLING AUTHOR, RICH DAD POOR DADAlthough this book is about why the rich go broke, the core message is why people go broke and why so many lack the financial intelligence to achieve their financial dreams.Unlike the thousands of traditional “how-to” personal financial books that use traditional methods that rarely induce change, these stories elicit something deep within that allows you to achieve lasting financial freedom and the peace of mind you want, and you deserve. A good story, well told, can change the world.After 25 years in the trenches guiding thousands of individuals and small business owners, John MacGregor opens the vault to share 10 incredible stories that have the power to transform your financial life forever.  In this book MacGregor reveals for the first time “The B.E.A.R. Trap,” THE underlying reason why so many people suffer financially.This book answers and solves:• Why 78% of people are suffering from financial stress and anxiety.• Why 65% of people could not come up with $500 today for an emergency expense.• Why money is the #1 source of stress in our society.• And, why this problem is getting worse—not better—despite all the information available. This book is not just about putting more money in your pocket, it’s about changing your life forever and get you started on your path to financial independence. The Million-Dollar Lesson: LEARNING FROM YOUR MISTAKES IS SMART.LEARNING FROM OTHER PEOPLE’S IS GENIUS.Scroll Up And Hit The “Buy Now” button.Edorsements:Tom Burns MD, Real Estate Entrepreneur and Author of Why Doctors Don’t Get Rich10 Reasons the Rich go Broke is a window into our subconscious. With ten riveting real-world stories, John MacGregor shows us what can happen if we allow destructive beliefs to dictate our actions. He then follows with experienced advice on how to avoid these calamities. You will turn the pages fast in anticipation of the next captivating story to learn another critical lesson. This is a must read and gives you the gift of learning from the mistakes of others, so that you can avoid the pain and create the life of your dreams.JW Wilson, Executive Director The Learning Code InstituteThe neurological research is clear, stories are one of the most effective ways to stimulate the brain areas that support rapid learning and behavioral change. During his decades of financial planning, MacGregor has carefully chosen powerful stories which have positively transformed his client’s relationship with money. This book, which shares those mistakes so you won’t make them, is a must read if you are struggling financially and want more peace of mind in your life. It’s game changer.",
  "genres": [
    "Personal Finance",
    "Nonfiction"
  ],
  "author": "John MacGregor CFP",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/46139461-the-top-10-reasons-the-rich-go-broke"
}