{
  "title": "The Power of Knowledge: The Greater Intelligence within You",
  "description": "The Power of Knowledge reveals the reality of “Knowledge,” the deeper spiritual mind within you which holds the key to finding your greater purpose and direction in life.  Book 5 of Volume 1 of the New Message from God contains 14 revelations given to present the reality of your spiritual nature, the crisis of living apart from your deeper nature and how you can escape this crisis and begin the journey of healing the division between your thinking mind with the mind of Knowledge within you. With this comes the possibility of following Knowledge now and in the future, leading you to a new life, new relationships and the fulfillment of your purpose for being in the world.  Through this book, you have the opportunity to understand where Knowledge lives in your experience and to build a lasting connection to this deeper experience that has always been with you. The book Steps to Knowledge takes this further in the form of a daily practice you can begin to apply in your life.  The journey of finding and following Knowledge will bring you back to your original purpose for being in the world, the memory of those who sent you and the greater contribution you are meant to provide to a world facing great and difficult change in the future. Here a sacred process begins that has the power to free you from the past and prepare you for a new and greater life in the future.  Each chapter of The Power of Knowledge is a revelation given from the Source, compiled into this text by the Messenger, Marshall Vian Summers.  A New Message from God has come into the world. It is an expression of the timeless pure connection with God as it has existed throughout human history and since the beginning of the manifest universe. Humanity now has direct access to this pure experience, unobstructed by human misunderstanding, authority and corruption. It has now entered the world anew.",
  "genres": [],
  "author": "Marshall Vian Summers",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/46135085-the-power-of-knowledge"
}