{
  "title": "Living with the Single Dad",
  "description": "A pain so powerful can only be eased by a love even stronger.Welcome to Seattle, the Emerald City and home to The Single Dads of Seattle. Ten sexy single fathers who play poker every Saturday night, have each other's backs, love their children without quarter, and hope to one day find love again. This is Aaron's story ...Single Dad of Seattle, Aaron Steele isn't a single dad at all. He's a retired Navy SEAL whose sister just died, leaving him to raise her newborn daughter all by himself. Only he has no clue how to be a dad--let alone a single dad. He's lost in a sea of diapers and bottles, late nights and exhausting mornings, all the while dealing with a failure from his last mission he just can't shake. He needs help. He needs a nanny.Professional nanny Isobel Jones has a heart of gold. She's always willing to help out, no matter the cause. She spends her days with children making memories and her nights on the laptop making magic as a graphic designer. After hearing Aaron's heartbreaking story, she jumps at the chance to help. But she never expected her new boss to be a blue-eyed Adonis with dog tags, who quickly begins to fuel her fantasies.While the beautiful nanny is off-limits, she's also a welcomed distraction. Aaron's grief is still raw and he just knows he's going to mess up this whole dad thing. Isobel's never shied away from a challenge, and that's exactly what Aaron is--a big challenge. He's angry and stubborn, moody and confusing, and yet she knows deep down he's capable of so much love.Will Isobel living with the single dad help pull him out of his misery, or will Aaron let the turmoil inside him chase away perhaps the only person that could help him finally find happiness?** This book can be read as a standalone. It includes lots of steamy scenes, cursing, and of course as with all my books, this has an HEA and no cliffhanger or cheating. If you like single dads who take charge, this book is for you.** The political views expressed in this book do not necessarily reflect those of the author. This is fiction and the characters will have their own morals, ethics, political and religious views in order to make them well-rounded and realistic.",
  "genres": [
    "Romance",
    "Contemporary",
    "Military Fiction",
    "Audiobook",
    "Small Town Romance",
    "Forced Proximity",
    "Family"
  ],
  "author": "Whitley Cox",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/46141994-living-with-the-single-dad"
}