{
  "title": "Surrender the Wind",
  "description": "Surrender the Wind is book two for the Fire on the Plains Romance. This is the next generation *Can be enjoyed as a stand-alone*Which brother will capture the wind? Only Owl Girl knows...Wenona of the Wind is the grown daughter of Talks to the Sky and Fire Eyes. She has been raised within the Bird Band of the Kiowa, but she does not have a sense of belonging and she does not believe she carries the gift of controlling the sky. In fact, she'd like leave.When Levi and Nash Van Horn are injured and taken to the Bird Band, Wenona finally feels a purpose and a connection. She offers to heal them. But there's not much time since Kansas is becoming a state and the U.S. Army is fast approaching. After much consideration, Chief Man of Sun decides that the Bird Band will finally surrender. And in the interest of peace, he sends Wenona away to her mother's farm with the brothers. On this journey Wenona discovers the truth about her mother's childhood and she learns the truth about herself. She is more Kiowa than she ever realized.One brother will offer her the world, the other will betray her. Will the gift she denied help her to become the woman she's destined to be?Dear Reader, The Fire on the Plains Romance © 2019 EMis a planned series of novellas, ranging from 80 to 110 pages that are perfect when you want a satisfying story but don't have the time to invest in the lengthy novel. These stories move quick with engaging characters, fast plots and timeless American west settings. The heat levels range from warm to smoldering. These are the pocket romances you snuck from your mama, your grandma or aunt. (We all did.)You can keep track of all the FOTPR romances atElleMarlow.Blogspot.com and simply look for the page with the FOTPR heading. Enjoy! And don't be afraid to share your thoughts with me. I love hearing from readers. ~EM Not for the under 18 reader due to graphic sexual descriptions. This series do go in order from book 1 - 3 they are not stand-alones. Book 3, Surrender the Earth due on Amazon January 2020.",
  "genres": [],
  "author": "Elle Marlow",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/46142669-surrender-the-wind"
}