{
  "title": "باولا",
  "description": "باولا هي ابنة إيزابيل الليندي التي توفيت سنة 1992 م بعد معاناة طويلة من داء الفيرفيرين – هكذا ترجمه صالح علماني، ولم أسمع بهذا المرض ولا بأعراضه من قبل -، باولا غائبة في هذا الكتاب كما كانت غائبة عن الوعي بفعل المرض، الحاضر في كلتا الحالتين كانت إيزابيل في مرافقتها الدائمة لابنتها العشرينية – 28 عاما ً عندما توفيت – في المستشفى، وفي الحديث عنها قليلا ً، وعن نفسها وتشيلي كثيرا ً في هذا الكتاب. تقول إيزابيل أنها بدأت في كتابة كتابها هذا في المستشفى بعد سقوط ابنتها، كان في بدايته رسالة لباولا علها تقرأها عندما تفيق، رسالة تدون فيها تفاصيل حياة أسلافها، ومن ثم حياتها هي، وتاريخ تشيلي بالتغيرات السياسية والاجتماعية التي طالته في السبعينات، ودفعت بإيزابيل إلى الفرار إلى فنزويلا والعيش هناك لسنوات طويلة. يمكننا اعتبار هذا الكتاب نصف سيرة ذاتية – عادت إيزابيل لتكمل سيرتها الذاتية في كتابها الأخير الذي صدر مؤخرا ً تحت عنوان ( حصيلة الأيام) والذي حمل بوضوح وصف ( مذكرات) وفيه تكمل من حيث توقفت في كتاب باولا -، حافلة بالعمل الصحفي والتلفزيوني والسياسي والكتابي، حافلة بالعشاق العاجلين، وبالحب الذي ظنت أنه لن يأتي – متشوق إلى قراءة مذكراتها عن السنوات الـ 13 التي تلت ( باولا) – من 1992 م وحتى 2005 م عندما شرعت بكتابة ( حصيلة الأيام) لأرى هل ظل ذلك الحب كما وصفته في ( باولا) أم أنها استبدلته بحب جديد -، وبالحديث في الوضع الاجتماعي والسياسي السائد في تشيلي حتى الفترة الانقلابية التي أدت إلى قتل قريبها ( سلفادور الليندي) أول رئيس اشتراكي ينتخب ديمقراطيا ً في التاريخ، واعتلاء أوغستو بينوشيه للحكم. الكتاب محمل جدا ً، كتب بيد روائية عظيمة، وأم حنون، وامرأة وطنية، وتتضح فيه ملامح الثقافة التشيلية – الطبقة التي تنتمي إليها إيزابيل على الأقل – والتي ستبدو غريبة لمن اعتادوا على الروائيين الأوروبيين والأمريكان العقلانيين، حيث تنتشر أرواح الأسلاف، وحكايات النبؤات التي لا تخيب، والأفعال السحرية التي تجلب الحظ.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Spanish Literature",
    "Biography Memoir",
    "Book Club",
    "Magical Realism"
  ],
  "author": "Isabel Allende",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/4613804"
}