{
  "title": "Playing For Keeps",
  "description": "Life is all about choices, right? Everything we do, from brushing our teeth in the morning, until we climb into bed at night, is a series of choices.Sometimes we make bad choices, sometimes they’re good, sometimes they’re made under duress, and sometimes they’re the lesser of two evils kind.Sometimes there’s no choice at all, but you’re still forced to do something, because the world refuses to slow for you. And sometimes, the one perfect choice stands right in front of you in a cop’s uniform and he asks you to feel what he feels.But if you're proud like me, even when you know the right choice, the wrong words slide off your tongue and begin a chain reaction that can't ever be undone.Playing For Keeps is the conclusion to a Checkmate duet featuring Andi Conner and Riley Cruz. The first part is titled Castling The Rook and should be read first.⭐️⭐️⭐️⭐️⭐️After the first book in this duo, I was a little worried because it left everything so open and so many possibilities. We really hadn’t heard anything about Riley or Andi in the other books from the series - so my mind was FILLED with craziness. But, as usual Emilia Finn’s mind is even crazier than mine - which I didn’t think possible! This author’s ability to write real human emotions is unparalleled.⭐️⭐️⭐️⭐️⭐️Holy hell. This book wrecked me in all the ways possible...it was such an incredibly poignant, beautifully written, heartbreakingly breathtaking story of loss, love, and second chances. Never have I rooted for someone as I did Riley; he’s the hero we didn’t know we needed. His story won’t leave you — ever. I have so many feels after this book, I don’t even know how to put it into words.⭐️⭐️⭐️⭐️⭐️Have you ever gone through such an emotional state that you feel heart can't take much more? That is what happens within the first chapter of this book.⭐️⭐️⭐️⭐️⭐️I don't know how she does it. I really don't. This book was so freaking amazing I can't stand it! I cried for Riley, I cried for Andi, I cheered for both of them, I wanted to punch Riley a couple times.⭐️⭐️⭐️⭐️⭐️I'd like to know where Emilia gets her superpower! She has this amazing gift of pulling you in, getting you invested emotionally to all the characters, and leaves you always wanting more. I haven't been able to find an author in a long while that can do that for me.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Dark"
  ],
  "author": "Emilia Finn",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/46138747-playing-for-keeps"
}