{
  "title": "Bullying: Teen’s Age And Bullying: How To Avoid becoming A Victim?",
  "description": "Is your teenager being bullied? Or worse are they themselves the bully? Are you a Teenager and being victim of bullying?\n\n\nBullying has long plagued the education system, and with the advent of social media it has only gotten worse. Every day it seems we are inundated with news reports of teens either taking their own lives or losing them to the criminal prosecution all because of bullying. And the first question that everyone asks is where was the parents? With many teens taking drastic actions because they themselves don’t see a way out these often tragic situations we can no longer just chalk it up to kids being kids, it’s time to pay attention. \n** Discover How to prevent Bullying**\n\n\nToo often parents don’t see the warning signs of bullying. Many teenagers will even go extra lengths to hide them. Often to embarrassed that they have become victims at school to discuss it with their parents. As the stigma of having your parents or other adults settle your disputes can be embarrassing to some teens. Even though it shouldn’t be, once bullying starts the only thing that will stop it is such intervention.  As a parent you cannot simply hope it figures it self out, tell your child to stand up for themselves, or worse just hope that a teacher eventually steps in.\n\nSo how do you get involved? In this book by Patrice Met, author of the BRIGHTERS Publishing Platform, guides you through the questions you need to be asking your teen. Not to mention the warning signs that you need to be on the look out for.\n\nThis e-book isn’t just for adults. In fact teenagers themselves can learn a lot about how to avoid and deescalate bullying situations and behaviors. Too often teens don’t realize a situation is as bad as it is until it’s too late. This book will show them ways to handle that kind of behavior without letting ruin their life.\n\n\n ****ORDER YOUR COPY AND YOUR TEEN’S COPY NOW****If you are ready to end bullying in your life, or to prevent your teen’s to avoid it than this book is a necessary hand-guide. With it you will learn everything you need to help you or your child move past and make sure that this type of behavior does not continue.\nClick here to get your copy or to recommend it to a parent or a teenager",
  "genres": [],
  "author": "Patrice Met",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/46130944-bullying"
}