{
  "title": "The Dare: Friends, Family, and Other Eerie Mysteries",
  "description": "Age Level: 9 and up | Grade Level: 4 and upScholastic Book Clubs selectionOklahoma Book Award HonorIllinois Reads List selectionU.S. Asian Pacific American Library Association Selection Twelve-year-old Paris Pan has moved to a small town where she has a real shot at making friends. But that friendship comes at a price. She must take The Dare, something that caused a girl to disappear on the very property she now resides. To make matters worse, Paris must play basketball against her will, eradicate a crush on the least desirable boy in seventh grade, and cope with a family crisis that was possibly caused by a chili dog.  \n   A humorous, suspenseful middle-grade novel featuring a tween protagonist who is caught up in a \"ghostly\" mystery in a small town while navigating sticky situations at school and at home \n   Great for children ages 9-12 who have grown out of chapter books and are looking for engrossing, fast-paced reading. \n   Popular with both upper elementary and middle school girls and boys grades 4-7 \n   Addresses social issues from peer-pressure, bullying, empathy, friendship, and more \n   Makes a wonderful tool or gift for anyone looking for a story featuring a diverse, spunky female protagonist \n \"Paris's desire for friendship will ring true with middle school readers.\" - School Library Journal \"I love Paris Pan takes the Dare so much I have read it five times. Cynthea Liu, you are awesome, you write the best books in the world. I think Paris Pan takes the Dare is the best!\" Your number one fan, Hanna\"I got my copy of Paris Pan last night and started reading it to my daughter. We're going to do one chapter a night as our bedtime reading. It's really easy to read out loud, too. We're enjoying it!\" - C. Tahmaseb, Parent\"My 7-year-old has been reading Paris at bedtime, under the covers and wearing one of those forehead flashlights.\" - Parent\"I bought two copies and gave one to [daughter's] best friend...Meanwhile, they are reading (without being pushed) a chapter a night to each other on ichat! They are so cute. Then they discuss the chapter and are LOVING the book.\" - Flora, Parent\"Oh, I loved it! I finished it in one sitting tonight! Paris is a hoot!\" - Kathleen, Children's Bookseller\"I loved it too! I'm really looking forward to you visiting our school! I know the kids will really enjoy it!\" - Courtney, Elementary School TeacherJust wanted to let you know how much I enjoyed the book. I stayed up past my bedtime last night reading and then finished it over breakfast this morning, making myself late for work!\" - Roxanne, Writer\"My 7-year-old has been reading Paris at bedtime, under the covers and wearing one of those forehead flashlights.\" - Parent \"Paris Pan Takes the Dare\" is a masterpiece. Child readers will grow up and present battered copies to their children who will wonder what all the fuss is about, then present even more battered copies to their children.\" FredTownWard ★★★★★ \"Surprisingly creepy in parts, and freshly genuine throughout all, Paris Pan Take",
  "genres": [
    "Middle Grade",
    "Horror",
    "Mystery",
    "Childrens"
  ],
  "author": "Cynthea Liu",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/46159585-the-dare"
}