{
  "title": "Soot",
  "description": "The electrifying sequel to the national bestseller \n\nSmoke\n\n - bringing back readers to a world that \n\nEntertainment Weekly \n\ncalled \"Part Dickens, part dystopia, and totally immersive.\"\nThe year is 1909. It has been ten years since Thomas Argyle, Charlie Cooper and Livia Naylor set off a revolution by releasing Smoke upon the world. They were raised to think Smoke was a sign of sin manifested, but learned its suppression was really a means of controlling society. Smoke allowed people to mingle their emotions, to truly connect, and the trio thought that freeing the Smoke would bring down the oppressive power structure and create a fair and open society. But the consequences were far greater than they had imagined, and the world has fractured. Erasmus Renfrew, the avowed enemy of Smoke, is now Lord Protector of what remains of the English state. Charlie and Livia live in Minetowns, an egalitarian workers' community in the north of England which lives by Smoke. Thomas Argyle is in India on a clandestine mission to find out the origins of Smoke, and why the still-powerful Company is mounting an expedition in the Himalayas.Mowgli, the native whose body was used to trigger the tempest that unleashed the Smoke, now calls himself Nils and is a chameleon-like thief living in New York. And Eleanor Renfrew, Erasmus' niece who was the subject of his cruel experiments in suppressing Smoke, is in hiding from her uncle in provincial Canada. What she endured has given her a strange power over Smoke, which she fears as much as her uncle.Believing her uncle's agents have found her, she flees to New York with a theater troupe led by Balthazar Black, an impresario with secrets of his own. There they encounter Nils and a Machiavellian Company man named Smith. All these people seek to discover the true nature of Smoke, and thereby control its power. As their destinies entwine, a cataclysmic confrontation looms, and the Smoke will either bind them together or rend the world.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Dystopia",
    "Science Fiction",
    "Alternate History"
  ],
  "author": "Dan Vyleta",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/46159811-soot"
}