{
  "title": "The GenoType Diet: Change Your Genetic Destiny to live the longest, fullest and healthiest life possible",
  "description": "What’s Your GenoType?GenoType 1The HunterTall, thin, and intense, with an overabundance of adrenaline and a fierce, nervous energy that winds down with age, the Hunter was originally the success story of the human species. Vulnerable to systemic burnout when overstressed, the Hunter’s modern challenge is to conserve energy for the long haul.GenoType 2The GathererFull-figured, even when not overweight, the Gatherer struggles with body image in a culture where thin is “in.” An unsuccessful crash dieter with a host of metabolic challenges, the Gatherer becomes a glowing example of health when properly nourished.GenoType 3The TeacherStrong, sinewy, and stable, with great chemical synchronicity and stamina, the Teacher is built for longevity—given the right diet and lifestyle. This is the genotype of balance, blessed with a tremendous capacity for growth and fulfillment.GenoType 4The ExplorerMuscular and adventurous, the Explorer is a biological problem solver, with an impressive ability to adapt to environmental changes, and a better than average capacity for gene repair. The Explorer’s vulnerability to hormonal imbalances and chemical sensitivities can be overcome with a balanced diet and lifestyle.GenoType 5The WarriorLong, lean, and healthy in youth, the Warrior is subject to a bodily rebellion in midlife.With the optimal diet and lifestyle, the Warrior can overcome the quick-aging metabolic genes and experience a second, “silver,” age of health.GenoType 6The NomadA GenoType of extremes, with a great sensitivity to environmental conditions—especially changes in altitude and barometric pressure, the Nomad is vulnerable to neuromuscular and immune problems. Yet a well-conditioned Nomad has the enviable gift of controlling caloric intake and aging gracefully. The author of the international bestseller Eat Right 4 Your Type again breaks new ground with the first diet plan based on your unique genetic code.With Eat Right 4 Your Type and additional books in the Blood Type Diet® series, Dr. Peter J. D’Adamo pioneered a new, revolutionary approach to dieting—one linked to a person’s blood type. In the GenoType Diet, he takes his groundbreaking research to the next level by identifying six unique genetic types. Whether you are a Hunter, Gatherer, Teacher, Explorer, Warrior, or Nomad, Dr. D’Adamo offers a customized program that compliments your genetic makeup to maximize health and weight loss, as well as prevent or even reverse disease. In simple, concise prose, Dr. D’Adamo explains how a host of environmental factors, including diet and lifestyle, dictate how and when your genes express themselves. He goes on to demonstrate precisely how, with the right tools, you can alter your genetic destiny by turning on the good genes and silencing the bad ones. Your health risks, weight, and life span can all be improved by following The GenoType Diet that’s right for you.Using family history and blood type, as well as simple diagnostic tools like fingerprint analysis, leg length measurements, and dental characteristics, Dr. D’Adamo shows you how to map out your genetic identity and discover which of the six GenoType plans you should follow. Without expensive tests or a visit to the doctor, The GenoType Diet reveals previously hidden genetic strengths and weaknesses and provides a precise diet and lifestyle plan for every individual. Based on the latest and most cutting-edge genetic research, this is a twenty-first-century plan for wellness and weight loss from a renowned healthcare pioneer.",
  "genres": [
    "Health",
    "Nonfiction",
    "Food",
    "Biology",
    "Nutrition",
    "Medicine",
    "Diets"
  ],
  "author": "Peter J. D'Adamo",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/1244715.The_GenoType_Diet"
}