{
  "title": "The Lost Empire of Atlantis: History's Greatest Mystery Revealed",
  "description": "“MENZIES [IS] PROPOUNDING ONE OF THE MOST REVOLUTIONARY IDEAS IN THE HISTORY OF HISTORY.” —New York Times MagazineNew York Times bestselling historian Gavin Menzies presents newly uncovered evidence revealing, conclusively, that “the lost city of Atlantis” was not only real but also at the heart of a highly advanced global empire that reached the shores of America before being violently wiped from the earth.For three millennia, the legend of Atlantis has gripped the imaginations of explorers, philosophers, occultists, treasure hunters, historians, and archaeologists. Until now, it has remained shrouded in myth. Yet, like ancient Troy, is it possible that this fabled city actually existed? If so, what happened to it and what are its secrets? The fascinating reality of Atlantis’s epic glory and destruction are uncovered, finally, in these pages in thrilling detail by the iconoclastic historian Gavin Menzies—father of some of “the most revolutionary ideas in the history of history” (New York Times).Meticulously analyzing exciting new geologic research, recently unearthed archaeological artifacts, and cutting-edge DNA evidence, Menzies has made a jaw-dropping Atlantis truly did exist, and was part of the incredibly advanced Minoan civilization that extended from its Mediterranean base to England, India, and even America. In The Lost Empire of Atlantis, he constructs a vivid portrait of this legendary civilization and shares his remarkable findings.As riveting as an Indiana Jones adventure, The Lost Empire of Atlantis is a revolutionary work of popular history that will forever change our understanding of the past.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Science",
    "Ancient History",
    "Travel",
    "Anthropology"
  ],
  "author": "Gavin Menzies",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/12447514-the-lost-empire-of-atlantis"
}