{
  "title": "The Day I Died",
  "description": "She had to die, to find the truth.Oshin Fletcher lives by three obey authority, don't draw unnecessary attention to yourself, and above all else, never leave the city walls.Some say that rules are meant to be broken. For Oshin, her world shattered on the day she was betrayed. A secret meeting leads her beyond the safety of her city. Lured by the ignorance that comes with being lonely and hopeful, Oshin was about to discover just how severe consequences could be. Lost and alone, she waited; no one came. But they did. The infected, the decaying, the undead.Oshin wakes to find herself in an abandoned house, deep within the forest. Her body was changing, her desire to feed, uncontrollable. She was a marionette--her hunger, the puppeteer. She pivots on a line between life and death. They say the undead are mindless, but Oshin was very much aware. She sets out in an unknown world where the worst evils aren't the undead, but humanity itself. With only days before the effects of the disease take hold and decay sets in, Oshin must race to find a way back home for a cure. She soon discovers that home is not everything she thought it to be. Dark secrets have been in play since the moment she was born.An emotionally intense zombie survival story.Reader Young Adult Sci-fi - graphic violence, gore, strong language (Recommended 16+)______________________________________________________________Praise for The Day I Died\"The Day I Died is a riveting teen dystopian sci-fi story...Absorbing, revealing, and at once familiar in theme, yet original in its rendition...Never could [Oshin] have imagined what is to come--and, neither will the reader. \" --D. Donovan, Senior Reviewer, Midwest Book Review \"Very different zombie apocalypse story. I really enjoyed the characters and the storyline. Reminded me a little of my favorite zombie movie[s], \"Warm Bodies\", where one of the main characters retains some of his human emotions and morals,despite being a flesh eating zombie!\" -- JRV1952\"If your a fan of Zombie stories similar to the Walking dead this book is definitely for you. It grabbed my attention from start to finish\" --Anthony Alejo",
  "genres": [
    "Horror",
    "Nonfiction",
    "Dystopia"
  ],
  "author": "Aya Knight",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/46149073-the-day-i-died"
}