{
  "title": "Democracy in One Book or Less: How It Works, Why It Doesn’t, and Why Fixing It Is Easier Than You Think",
  "description": "Bill Bryson meets Thomas Frank in the true story of how power-hungry politicians broke American democracy ― and why fixing it is easier than you think ―from the New York Times bestselling author of Thanks, ObamaHere's something true for almost every American. The democracy you live in today is different - completely different - than the democracy you were born into.Since 1980, the number of Americans legally barred from voting has more than doubled. Since the 1990s, your odds of living in a competitive Congressional district have fallen by more than half. In the twenty-first century alone, the amount of money spent on Washington lobbying has increased by more than 100 percent. Meanwhile, new rules in Congress make passing new bills nearly impossible, no matter how popular or bipartisan they are.No wonder it feels like our representatives have stopped representing us. Thanks to changes you never agreed to, and that you probably don't even know about, your slice of power - your say in how your country is run - is smaller than it's ever been.How did this happen? And how can we fix it before it's too late? That's what former Obama speechwriter David Litt set out to answer.Millions of Americans now recognize that our democracy is in trouble, and that the trouble goes beyond Trump. But too often, we're looking in the wrong places for solutions. Voter suppression is real, but Voter ID laws aren't tipping elections. Getting rid of bizarrely shaped districts won't end gerrymandering. In fact, it would make gerrymandering worse. Calling for a Constitutional Amendment to overturn Citizens United is a nice gesture. But in the real world, it's the least effective type of campaign finance reform.If We, the People, want to save our republic, we need to start by understanding it.Poking into forgotten corners of history, Litt tells the true story of how the world's greatest experiment in democracy went awry. Translating political science into plain English, he explains how our system of government really works. Searching for solutions, he speaks to experts, office-holders, and activists nationwide.He also tries to crash a party at Mitch McConnell's former frat house. It goes poorly.But Democracy (in One Book or Less) is more than just an engaging narrative. Litt provides a to-do list of meaningful, practical changes - a blueprint for restoring the balance of power in America before it's too late.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "Political Science",
    "Government",
    "American"
  ],
  "author": "David Litt",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/46159079-democracy-in-one-book-or-less"
}