{
  "title": "Russian Mojito: A Detective Emilia Cruz Novel",
  "description": "Driven to the edge by her own secrets, can the first female police detective in Acapulco give Russia a dose of Mexican justice?Finalist, 2020 Silver Falchion AwardSurvivor of a deadly cartel ambush, Detective Emilia Cruz returns to Acapulco to recover from the trauma. Before she can catch her breath, her penniless stepfather is kidnapped. The stakes couldn't be higher as Emilia finds herself thrust back into the dangerous world of drug cartel violence.At the same time, a Russian guest is murdered by a cold-blooded killer in the luxury hotel managed by her boyfriend, Kurt Rucker.As the body count rises and the kidnappers tighten their grip on Emilia's family, she discovers a chilling connection between Russian murder victims and fuel thieves wreaking havoc on Mexico's underground gas pipelines.Soon she's on a midnight stakeout, waiting and watching for the thieves.But she’s really on a collision course with a cold-blooded killer and his powerful Russian boss.Poison Cup award, Outstanding Series, 2019 and 2020 -- CrimeMasters of America.If you love international police procedural mystery series by Ian Rankin, Jo Nesbo, Ann Cleeves, Peter May, Louise Penny, and Jussi Adler-Olsen, you'll want to read the Detective Emilia Cruz series. With suspenseful twists, complex characters, and a taste of the exotic, it’s a must-read for fans of Don Winslow’s cartel and border thrillers set in Mexico.Author Carmen Amato is a former CIA intelligence officer who uses her own counterdrug and espionage experiences to craft intrigue-filled mystery crime fiction that keeps you guessing until the very end. Amato is a recipient of both the National Intelligence Award and the Career Intelligence Medal.“Carmen Amato has created a character that deserves to be recognized as an equal alongside well known favorites created by Hammett, Larson and Padura.” – Felix Contreras, host of AltLatino, National Public Radio",
  "genres": [],
  "author": "Carmen Amato",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/46163777-russian-mojito"
}