{
  "title": "Supreme Inequality: The Supreme Court's Fifty-Year Battle for a More Unjust America",
  "description": "From New York Times bestselling author Adam Cohen, a revelatory examination of the conservative direction of the Supreme Court over the last fifty years since the Nixon administrationIn the early 1960s, the Supreme Court led by Chief Justice Earl Warren was at the height of its power, expanding civil rights for the poor and minorities and promoting equality in dramatic ways through rulings such as Brown v Board of Education and establishing the \"Miranda warning\" for persons in police custody. But when Warren announced his retirement in 1968, newly elected President Richard Nixon, who had been working tirelessly behind the scenes to put a stop to what he perceived as the Court's liberal agenda, had his new administration launch a total assault on the Warren Court's egalitarian victories, moving to dismantle its legacy and replace liberal justices with others more loyal to his views. During his six years in office, he appointed four justices to the Supreme Court, thereby setting its course for the next fifty years.In Supreme Inequality, Adam Cohen surveys the most significant Supreme Court rulings since Nixon and exposes how rarely the Court has veered away from a pro-corporate agenda. Contrary to what Americans might like to believe, the Court does not protect equally the rights of the poor and disadvantaged, and, in fact, hasn't for decades. Many of the greatest successes of the Warren Court, such as school desegregation, labor unions, voting rights, and class action suits, have been abandoned in favor of rulings that protect privileged Americans who tend to be white, wealthy, and powerful.As the nation comes to grips with two newly Trump-appointed justices, Cohen proves beyond doubt that the trajectory of today's Court is the result of decisions made fifty years ago, decisions that have contributed directly and grievously to our nation's soaring inequality. A triumph of American legal, political, and social history, Supreme Inequality holds to account the highest court in the land, and should shake to its core any optimistic faith we might have in it to provide checks and balances.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Law",
    "American History",
    "Audiobook",
    "Social Justice"
  ],
  "author": "Adam Cohen",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/46184066-supreme-inequality"
}