{
  "title": "Steel Drivin' Man: John Henry: the Untold Story of an American Legend",
  "description": "The ballad \"John Henry\" is the most recorded folk song in American history and John Henry--the mighty railroad man who could blast through rock faster than a steam drill--is a towering figure in our culture. But for over a century, no one knew who the original John Henry was--or even if there was a real John Henry. In Steel Drivin' Man, Scott Reynolds Nelson recounts the true story of the man behind the iconic American hero, telling the poignant tale of a young Virginia convict who died working on one of the most dangerous enterprises of the time, the first rail route through the Appalachian Mountains. Using census data, penitentiary reports, and railroad company reports, Nelson reveals how John Henry, victimized by Virginia's notorious Black Codes, was shipped to the infamous Richmond Penitentiary to become prisoner number 497, and was forced to labor on the mile-long Lewis Tunnel for the C&O railroad. Nelson even confirms the legendary contest between John Henry and the steam drill (there was indeed a steam drill used to dig the Lewis Tunnel and the convicts in fact drilled faster).  Equally important, Nelson masterfully captures the life of the ballad of John Henry, tracing the song's evolution from the first printed score by blues legend W. C. Handy, to Carl Sandburg's use of the ballad to become the first \"folk singer,\" to the upbeat version by Tennessee Ernie Ford. We see how the American Communist Party appropriated the image of John Henry as the idealized American worker, and even how John Henry became the precursor of such comic book super heroes as Superman or Captain America. Attractively illustrated with numerous images, Steel Drivin' Man offers a marvelous portrait of a beloved folk song--and a true American legend.",
  "genres": [
    "History",
    "Nonfiction",
    "Music",
    "American History",
    "Folklore",
    "Biography",
    "African American"
  ],
  "author": "Scott Reynolds Nelson",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/461646.Steel_Drivin_Man"
}