{
  "title": "Cyclonopedia: Complicity with Anonymous Materials",
  "description": "At once a horror fiction, a work of speculative theology, an atlas of demonology, a political samizdat and a philosophic grimoire, CYCLONOPEDIA is work of theory-fiction on the Middle East, where horror is restlessly heaped upon horror. Reza Negarestani bridges the appalling vistas of contemporary world politics and the War on Terror with the archeologies of the Middle East and the natural history of the Earth itself. CYCLONOPEDIA is a middle-eastern Odyssey, populated by archeologists, jihadis, oil smugglers, Delta Force officers, heresiarchs, corpses of ancient gods and other puppets. The journey to the Underworld begins with petroleum basins and the rotting Sun, continuing along the tentacled pipelines of oil, and at last unfolding in the desert, where monotheism meets the Earth's tarry dreams of insurrection against the Sun. 'The Middle East is a sentient entity - it is alive!' concludes renegade Iranian archeologist Dr. Hamid Parsani, before disappearing under mysterious circumstances. The disordered notes he leaves behind testify to an increasingly deranged preoccupation with oil as the 'lubricant' of historical and political narratives. A young American woman arrives in Istanbul to meet a pseudonymous online acquaintance who never arrives. Discovering a strange manuscript in her hotel room, she follows up its cryptic clues only to discover more plot-holes, and begins to wonder whether her friend was a fictional quantity all along. Meanwhile, as the War on Terror escalates, the US is dragged into an asymmetrical engagement with occultures whose principles are ancient, obscure, and saturated in oil. It is as if war itself is feeding upon the warmachines, leveling cities into the desert, seducing the aggressors into the dark heart of oil ...",
  "genres": [
    "Philosophy",
    "Fiction",
    "Horror",
    "Theory",
    "Science Fiction",
    "Literature",
    "Iran"
  ],
  "author": "Reza Negarestani",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/4617457-cyclonopedia"
}