{
  "title": "Island Practice: Cobblestone Rash, Underground Tom, and Other Adventures of a Nantucket Doctor",
  "description": "ISLAND PRACTICE was optioned for a television series by Imagine Television (\"Friday Night Lights,\" \"24\") and Fox Television. Screenwriter is Amy Holden Jones, acclaimed feature film writer whose movies include \"Mystic Pizza\" and \"Indecent Proposal.\"ISLAND PRACTICE audiobook is now available! Read by talented actor Joe Barrett, who has also recorded William Faulkner, Tom Wolfe, John Irving, among others. With a Foreword by Nathaniel Philbrick, author of the bestseller \nIn the Heart of the Sea\nIf you need an appendectomy, he can do it with a stone scalpel he carved himself. If you have a condition nobody can diagnose—“creeping eruption” perhaps—he can identify what it is, and treat it. A baby with toe-tourniquet syndrome, a human leg that’s washed ashore, a horse with Lyme disease, a narcoleptic falling face-first in the street, a hermit living underground—hardly anything is off-limits for Dr. Timothy J. Lepore.This is the spirited, true story of a colorful, contrarian doctor on the world-famous island of Nantucket. Thirty miles out to sea, in a strikingly offbeat place known for wealthy summer people but also home to independent-minded, idiosyncratic year-rounders, Lepore holds the life of the island, often quite literally, in his hands. He’s surgeon, medical examiner, football team doctor, tick expert, unofficial psychologist, accidental homicide detective, occasional veterinarian. When crisis strikes, he’s deeply involved.He’s treated Jimmy Buffett, Chris Matthews, and various Kennedy relatives, but he makes house calls for anyone and lets people pay him nothing—or anything: oatmeal raisin cookies, a weather-beaten .44 Magnum, a picture of a Nepalese shaman.Lepore can be controversial and contradictory, espousing conservative views while performing abortions and giving patients marijuana cookies. He has unusual hobbies: he’s a gun fanatic, roadkill collector, and concocter of pastimes like knitting dog-hair sweaters.Ultimately, Island Practice is about a doctor utterly essential to a community at a time when medicine is increasingly money-driven and impersonal. Can he remain a maverick even as a healthcare chain subsumes his hospital? Every community has—or, some would say, needs—a Doctor Lepore, and his island’s drive to retain individuality in a cookie-cutter world is echoed across the country.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Medicine",
    "Medical",
    "Biography Memoir",
    "Audiobook",
    "Doctors"
  ],
  "author": "Pam Belluck",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/12447716-island-practice"
}