{
  "title": "Chaos Theory: The Biker Variable",
  "description": "Somewhere on the high-functioning end of the spectrum, a savant and polymath with an eiditic memory, a conveniently accommodating conscience, and old money, Cleone was born to be a captain of industry, though she won't get control of her business until she is thirty. Snatched off the sidewalk near her university by a street gang in the pay of her uncle, she is hauled into the desert for the handoff to persons unknown. Trapped in a dog cage in the back of an SUV, she is the helpless witness to an illegal transaction that goes badly wrong. .Pulled out of the vehicle by members of a motorcycle gang, fearing they will ransom her back to her uncle, she lies about her identity. She lies about everything On his current trajectory, Mason Metcalf, Vice President of the Knights of Chaos Motorcycle Club, is destined to die before he is forty, knifed in prison, shot during the commission of a felony, beaten in a barroom brawl, or dead of a moment's inattention on his Harley. When the Knights pull a bruised and frantic young woman from the back of an SUV belonging to their former trading partners, they must either kill the inconvenient witness or keep her, but they can never let her go. Put in charge of the prisoner, Mason keeps her in his apartment over the clubhouse, contained, controlled, and carefully watched, but he badly underestimates her resourcefulness. Escaping within forty-eight hours, she leads him on a chase from the Oregon border to the campus of Berkeley. Retaken, can Cleone bend this very bad man, and his criminal enterprise, to her will? Can she use them in her bid to wrest early control of her company from the board of directors? Would they be a useful tool in her more long-range plans?\"Read this book. Whether you're looking for motorcycle club drama, spicy erotica, quirky, three-dimensional characters, intelligent prose, or all the above, Chaos Theory has it. JB Sandkamp lifts this genre to a whole new level. And never mind the genre—it's just terrific fiction\" --- Amanda CoffinThis novel is for 18+ and contains scenes of graphic sex and violence",
  "genres": [],
  "author": "J.B. Sandkamp",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/46188743-chaos-theory"
}