{
  "title": "Unknown Valor: A Story of Family, Courage, and Sacrifice from Pearl Harbor to Iwo Jima",
  "description": "In honor of the 75th Anniversary of one of the most critical battles of World War II, the popular primetime Fox News anchor of The Story with Martha MacCallum pays tribute to the heroic men who sacrificed everything at Iwo Jima to defeat the Armed Forces of Emperor Hirohito—among them, a member of her own family, Harry Gray.When news of the Japanese attack on Pearl Harbor came over the radio in a New York diner on Sunday, December 7, 1941, patrons grabbed their coats and their children by the hand, left a few dollars on the table and briskly headed home.  Everything was altered in an instant. They didn’t know what they needed to do, but they knew where they needed to be: home.Martha MacCallum’s mother was a child in that diner that day, and her thoughts went to her teenage cousin Harry. In Unknown Valor, MacCallum follows Harry from life at home in Boston to the bloody battle on the island known as Iwo Jima. She follows her mother’s family on the homefront, from the days before the war to the days of waiting on the front porch for Harry’s letters.Unknown Valor is the story of the Pacific war’s oppressive jungles and deadly beaches where teenagers fought and died, and the war rooms of the leaders  who set the course.  MacCallum explores Hirohito, the Emperor who drove a deadly expansion of the Empire, only to watch the United States relentlessly reclaim it all, at enormous human cost.Meticulously researched, heart-wrenching, and illuminating, Unknown Valor is the story of the sacrifice made by ordinary American boys, who left home to save the world from tyranny, and left indelible marks on those back home who loved them.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military Fiction",
    "War",
    "Audiobook",
    "Military History"
  ],
  "author": "Martha MacCallum",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/46178710-unknown-valor"
}