{
  "title": "The Little Light",
  "description": "The Sun, the Moon, Mercury, Mars, Jupiter, Venus, Saturn, Rahu, and Ketu - Celestial Beings from world mythology - bicker and squabble, just like any family. But they’re going to have to put their differences aside to help the Little Light - a wise soul, imbued with insight and curiosity - prepare for its birth on Planet Earth, where it has a great and far-reaching destiny...  “A part of the Sun will always shine inside the Little Light, come what may. Life can be full of pain, suffering and strife, but this spark will always remain untouched because it belongs to the source of all life on earth. Nothing and no one can take it away because it is a gift from the father to all his children. It can never be tarnished or spoilt. It exists and will continue to burn bright till the death of the physical body.”  In her debut novel The Little Light, Dipa Sanatani takes the reader on a voyage of awakening and discovery, ideal for lovers of mythology, spirituality, folklore and fairy tales.  On the eve of its birth, The Little Light finds itself in the topsy-turvy world of the Planet Party, hosted in the Cosmic Womb. Here, anything is possible, and anything could happen… and the Little Light must do all it can to listen, learn, and ready itself for the path which will lead it to its destiny on earth.  Along the way the Little Light meets Mercury, who bristles at being constantly overshadowed (literally!) by his father, The Sun, a flamboyant figure who wears a gold ring on every finger and bright yellow loafers. As the rest of the Celestial Beings gather, they have to contend with Havah and Dag, the Guardians of the Lore, who know that the Little Light will soon be a tiny baby in a cold, hard world where it will have to struggle for its survival.  Alongside the Little Light, we learn there is more to explore in the heavens and on this earth than anybody could ever imagine possible. Endless lives, perpetual cycles of death and rebirth, infinite possibilities for love, happiness, renewal, enlightenment and wisdom… it’s all out there, waiting to be discovered, and waiting to make a change deep within us all.",
  "genres": [
    "Spirituality",
    "Fiction",
    "Fantasy",
    "Religion",
    "Philosophy",
    "Death"
  ],
  "author": "Dipa Sanatani",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/46174893-the-little-light"
}