{
  "title": "The Painter Knight",
  "description": "THE PASSING OF THE FLAMESimon, the Court Painter of Branion, was the closest friend of the kingdom's ruler. Aristok Marsellus the Third. And though Marsellus was the vessel of the Living Flame, able to call upon the power of his god at need, while Simon was a follower of the opposing Essusiate religion, still it was the painter, not Marsellus's own priests and guards, who was the Aristok's staunchest ally and defender.Yet not even Simon could protect Marsellus from unexpected treachery within the Banion court. But when an assassin's blade put a sudden end to Marsellus's reign, it was Simon who—at the dictate of both his own god and his friend's specter—became the champion and rescuer of the new Aristok, Marsellus's five-year-old daughter Kassandra.With civil and religious war threatening the suddenly leaderless realm, and Kassandra herself lighting to survive becoming the new vessel of the living Flame, Simon had no choice but to flee Branion with the child. Pursued by the very forces which should have been the new ruler's protectors, Simon and a most unlikely band of companions had to keep both the child and her powers hidden while they made a desperate bid to reach the one person who could offer the uncrowned Aristok both sanctuary and a chance, however desperate, of regaining her kingdom and bringing her father's slayers to justice. (Back Cover)In the kingdom of Branion, the hereditary royal line is blessed—or cursed—with the power of the Flame, a magic which can as easily destroy its human vessel as well as whatever foe it has been unleashed against. Two hundred years before the events of THE STONE PRINCE, Branion is beseiged by a civil war, and only Simon, Court Painter and closest friend of the kingdom's ruler, can find the courage to rescue a young child—the heir to the Flame—from becoming a victim in the family power struggle!",
  "genres": [
    "Fantasy",
    "LGBT",
    "Fiction",
    "M M Romance",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Gay"
  ],
  "author": "Fiona Patton",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/461990.The_Painter_Knight"
}