{
  "title": "Strange Kin: Ireland and the American South",
  "description": "The ties between Ireland and the American South span four centuries and include shared ancestries, cultures, and sympathies. The striking parallels between the two regions are all the more fascinating because, studded with contrasts, they are so complex. Kieran Quinlan, a native of Ireland who now resides in Alabama, is ideally suited to offer the first in-depth exploration of this neglected subject, which he does to a brilliant degree in Strange Kin.The Irish relationship to the American South is unique, Quinlan explains, in that it involves both kin and kinship. He shows how a significant component of the southern population has Irish origins that are far more tangled than the simplistic distinction between Protestant Scotch Irish and plain Catholic Irish. African and Native Americans, too, have identified with the Irish through comparable experiences of subjugation, displacement, and starvation. The civil rights movement in the South and the peace initiative in Northern Ireland illustrate the tense intertwining that Quinlan addresses.He offers a detailed look at the connections between Irish nationalists and the Confederate cause, revealing remarkably similar historical trajectories in Ireland and the South. Both suffered defeat; both have long been seen as problematic, if also highly romanticized, areas of otherwise \"progressive\" nations; both have been identified with religious prejudices; and both have witnessed bitter disputes as to the interpretation of their respective \"lost causes.\" Quinlan also examines the unexpected twentieth-century literary flowering in Ireland and the South -- as exemplified by Irish writers W. B.Yeats, James Joyce, and Elizabeth Bowen, and southern authors William Faulkner, Eudora Welty, and Flannery O'Connor.Sophisticated as well as entertaining, Strange Kin represents a benchmark in Irish-American cultural studies. Its close consideration of the familial and circumstantial resemblances between Ireland and the South will foster an enhanced understanding of each place separately, as well as of the larger British and American polities.",
  "genres": [],
  "author": "Kieran Quinlan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/4620389-strange-kin"
}