{
  "title": "unSpun: Finding Facts in a World of Disinformation",
  "description": "The founders of FactCheck.org teach you how to identify and debunk spin, hype, and fake news in this essential guide to informed citizenship in an age of misinformation.Americans are bombarded daily with mixed messages, half-truths, misleading statements, and out-and-out fabrications masquerading as facts. The news media is often too intimidated, too partisan, or too overworked to keep up with these deceptions.unSpun  is the secret decoder ring for the twenty-first-century world of disinformation. Written by Brooks Jackson and Kathleen Hall Jamieson, the founders of the acclaimed website FactCheck.org, unSpun  reveals the secrets of separating facts from disinformation, such  • the warning signs of spin• common tricks used to deceive the public• how to find trustworthy and objective sources of informationTelling fact from fiction shouldn’t be a difficult task. With this book and a healthy dose of skepticism, anyone can cut through the haze of political deception and biased eportage to become a savvier, more responsible citizen.Praise for unSpun“Read this book and you will not go unarmed into the political wars ahead of us. Jackson and Jamieson equip us to be our own truth squad, and that just might be the salvation of democracy.” —Bill Moyers“The definitive B.S. detector—an absolutely invaluable guidebook.” —Mark Shields, syndicated columnist and political analyst, NewsHour with Jim Lehrer“ unSpun is an essential guide to cutting through the political fog.” —Mara Liasson, NPR national political correspondent“The Internet may be a wildly effective means of communication and an invaluable source of knowledge, but it has also become a new virtual haven for scammers–financial, political, even personal. Better than anything written before, unSpun shows us how to recognize these scams and protect ourselves from them.” —Craig Newmark, founder and customer service representative, Craigslist",
  "genres": [
    "Nonfiction",
    "Politics",
    "School",
    "Reference",
    "Psychology",
    "Journalism",
    "Sociology"
  ],
  "author": "Brooks Jackson",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/462140.unSpun"
}