{
  "title": "The Information Trade: How Big Tech Conquers Countries, Challenges Our Rights, and Transforms Our World",
  "description": "In this timely, provocative, and ultimately hopeful book, a widely respected government and tech expert reveals how Facebook, Google, Amazon, Tesla, and other tech giants are disrupting the way the world works, and outlines the growing risk they pose to our future if we do not act to contain them.Today’s major technology companies—Google, Facebook, Amazon, Tesla, and others—wield more power than national governments. Because of their rising influence, Alexis Wichowski, a former press official for the State Department during the Obama administration, has re-branded these major tech companies “net states.” In this comprehensive, engaging, and prescriptive book, she considers their growing and unavoidable influence in our lives, showing in eye-opening detail how these net states are conquering countries, disrupting reality, and jeopardizing our future—and what we can do to regulate and reform the industry before it does irreparable harm to the way we think, how we act, and how we’re governed. Combining original reporting and insights drawn from more than 100 interviews with technology and government insiders, including Microsoft president Brad Smith, Google CEO Eric Schmidt, the former Federal Trade Commission chair under President Obama, the co-founder of the Center for Humane Technology , and the managing director of Jigsaw—Google’s Department of Counterterrorism against extremis and cyber-attacks—The Information Trade explores what happens when we cede our power to them, willingly trading our personal freedom and individual autonomy for an easy, plugged-in existence.Neither an industry apologist or fearmonger, Wichowski reminds us that we are not helpless victims; we still control our relationship with the technologies and the companies behind them. Most important, she shows us how we can curtail and control net states in practical, actionable ways—and makes urgently clear what’s at stake if we don’t.",
  "genres": [
    "Nonfiction",
    "Technology",
    "Audiobook",
    "Business",
    "Science",
    "Politics"
  ],
  "author": "Alexis Wichowski",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/46206721-the-information-trade"
}