{
  "title": "A Single Desperate Prayer: A Memoir",
  "description": "2020 Eric Hoffer Award Winner for Best Self - Published Book. 2020 Eric Hoffer First Horizon Award Winner for Best First Book By Debut Authors.2020 Finalist for Eric Hoffer Grand Prize Short - List. 2020 Finalist for Eric Hoffer Da Vinci Eye Award.2020 Finalist for Eric Hoffer Montaigne Medal.More than a memoir, A Single Desperate Prayer is a riveting account of one resilient girl’s life in a Crimean ghetto, replete with equal amounts of tragedy and triumph.  Told through the eyes of a child, the reader witnesses Ludmila’s growth and maturation as she starts from practically nothing, learns how to beg in the streets, loses all of what little she had, is left to the wolves, and then saved by grace—all before her fifteenth birthday.   Witness the miracles that her single prayer brought to life. Without being preachy—because children certainly aren’t—Ludmila lets you see what happens when you open yourself up to the power of faith. You’ll be on the edge of your seat; you’ll laugh; you’ll cry. You’ll get angry at the injustice, and you’ll champion our heroine. You can’t help but love and celebrate Ludmila as she learns how the forces of good work in a world that seems totally dark, and how a heart transformed can withstand anything.   How hopeless can a child get? Ludmila got there.   How did she escape her condition? A single desperate prayer.   Ludmila had to wait a considerable time for her prayer to be answered. The underlying beauty of her story lies in what she did while she waited.  This gripping story appeals to a wide audience, from children to adults, from adoptive parents to those considering it. People who’ve been orphaned, or lost, or are looking for a way out. Those who need inspiration, and are searching for a practical way to find happiness and purpose in life. This page-turning story is sure to enrich every reader’s life with its powerful message of determination and hope.",
  "genres": [],
  "author": "Ludmila Ritz",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/46204363-a-single-desperate-prayer"
}