{
  "title": "Devolose",
  "description": "Her friends say he’s the devil. But he might really be her savior . . .Devolose and Tawny have been rescued after three years together in the emperor’s dungeon. Every day he was forced to inflict pain on the Earth woman he only wanted to protect. How could he not develop feelings for her when they’re connected in so many ways? But how can they trust feelings forged in captivity? The more he pushes her away to protect her, the more determined she is to stay at his side. After decades of slavery, the emperor took far more than his soul. Can half a male satisfy a complete woman?Travel the galaxy with Dev and Tawny!* * * \"Devolose\" is the fourth book in the bestselling alien abduction paranormal romance series, Galaxy Gladiators. If you like hot alien alphas who love with all their heart and the strong, courageous females who are worthy of them, then you’ll love this steamy standalone installment in Alana Khan’s exciting series.* * *This series contains steamy sex scenes, muscular aliens, and badass heroines. Guaranteed happily ever afters, no cheating, and no cliff-hangers. The stories are intended for readers 18+.* * *Please note: This series can be read as standalones, although reading them in order may bring more enjoyment, as the books are full of that rich, delicious 'found-family trope' where people with nothing in common form connections that are stronger than blood!* * *Galaxy Gladiators series:Book 1: ZarBook 1.5: Terminus (Shadow’s prequel)Book 2: ShadowBook 3: TyreeBook 4: DevoloseBook 5: Drayke Book 6: Axxios & Braxxus [MFM] Book 6.5: Jax-Xon (Sirius’ prequel)Book 7: SiriusBook 8: DaxBook 9: BeastBook 10: Ar'TokBook 11: WrageBook 12: WarDogBook 13: StrykerBook 14: VartanBook 15: MaximusBook 16: SteeleBook 17: TarrexBook 18: Zar-RynnBook 19: ValerisBook 20: DoctoréBook 21: Theos",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction",
    "Science Fiction Romance",
    "Fantasy",
    "Space",
    "Paranormal Romance"
  ],
  "author": "Alana Khan",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/46212557-devolose"
}