{
  "title": "Push",
  "description": "An Unexpected Forbidden Romance To the unassuming observer, Ben Lockwood is your typical, suburban dad. Aside from the fact that he’s only thirty-six and his daughter is a sophomore in college. He and his wife, Jessica, had their only daughter, Hailey, when they were in high school. So you can imagine the unease Ben is feeling when said daughter brings her new boyfriend home for Thanksgiving… To stay, in their house, for the whole weekend. Ryan Harper, otherwise known as The Boyfriend, is every dread Ben’s ever had in his daughter dating come to fruition. There’s nothing wrong with Ryan. He’s polite, smart, and charming… He doesn’t have any neck tattoos or facial piercings, and he drives a BMW. But still, he’s dating Ben’s daughter. That makes him a threat. It’s in Ben’s best interest to keep an eye on the kid. You know, to make sure there’s no funny business going on under his roof. Unfortunately for him, the tension in the house is less about Ryan being his daughter’s boyfriend, and more about him being a strangely intriguing human. And soon enough, Ben can’t tell if he’s watching Ryan to protect his daughter’s innocence, or obliterate his own. It seems like the boring married-guy image isn’t going to hold up for long… Not after this bizarre, life-changing weekend. What are these new, strange feelings and desires? Where did they come from? And why do they have to center around what belongs to his daughter? Ben and Ryan’s situation couldn’t get much more complicated… Until Jessica steps into the mix. An unexpected push is all it took for their lives to change forever. ***PUSH by Nyla K is a label-free HEA love story. It contains infidelity triggers, which do work themselves out, so I urge you to give it a shot. MM turns to MMF, in a very steamy, explicit romance that will make you laugh, maybe cry, and definitely swoon. The theme of love is love is key here, so there aren’t many defining, or coming out moments. That being said, this book does explore male-male bisexuality, pansexuality and polyamory, but in a very casual, unassuming way. If MM and MMF are not your cup of tea, then steer clear. However, if you’re looking for an open-minded tale of taboo and forbidden romance that ultimately works out for its characters, then this book is for you!***",
  "genres": [
    "M M F",
    "M M Romance",
    "Romance",
    "LGBT",
    "Erotica",
    "Menage",
    "Contemporary"
  ],
  "author": "Nyla K.",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/46207255-push"
}