{
  "title": "Two Kingdoms & One Apocalypse",
  "description": "Book 3 & 4 together...Two KingdomsI'm getting a little tired of completing my goals, only to have the bar raised too substantially for me to transition at a productive pace...I started off as a sad little ghost with an impossible crush on four really hot, Gothic guys with some attitude problems. Now I'm The Apocalypse, they're the Four Horsemen, and Lucifer is my fucked up daddy. Now my additional goals look like this?Goal #9: Make a deal with the Devil without getting cheated, manipulated, or tricked.Goal #10: Make my boys love me and take over the world...okay...so maybe just that first part. That second part sounds like it could take too much ambition, and I just don't have the drive for that.Goal #11: Make cookies.Goal #12: Call dibs on my favorite color.Goal #13: Find out if my siblings or my father killed me and my boys...****One ApocalypseThe life goals have stacked up since I started this journey as a sad, lonely little ghost. I’m not sure how things escalated so quickly from trying to be seen and heard, to bearing the weight of the world on my vain little shoulders.As a result, my goals have gotten a little more serious…Goal #14: Learn to take a hit without breaking or suffering some type of death.Goal #15: Decide once and for all if I’m going to save or destroy the world. I’m not sure why people put this sort of responsibility on hell-spawn like me.Goal #16: Practice my evil laugh, because all hell-spawn need a good evil laugh.Goal #17: Find and kill all the unicorns. Mwahahahahaha.Goal #18: Live to enjoy forever with the guys I sacrificed all my memories to save.Goal #19: No matter what, they don’t get to die. Or I really will be THE Apocalypse.We’re the most screwed up collection of antiheroes the world has ever seen, because the only thing that makes me want to save the world is knowing I could lose my boys forever if I don’t. It’s one HELL of a love story, you know?**Sexual Content.**Language Warning.**Dark humor.**Reverse Harem.**Series FINALE. (Read in order: Four Psychos, Three Trials, Two Kingdoms, and One Apocalypse. This book cannot be read as a stand-alone.)",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fantasy",
    "Adult",
    "Dark Romance",
    "Paranormal Romance"
  ],
  "author": "Kristy Cunning",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/46227605-two-kingdoms-one-apocalypse"
}