{
  "title": "Journal of E. Willard Smith, While with the Fur Traders Vasquez and Sublette, in the Rocky Mountain Region, 1839-1840",
  "description": "\"Full of information on the mountain men, the fur trade, and the Indians.\" - Americana Catalogue, 1843\"Smith left Independence in 1839 in good company... mountain men Andrew Sublette, Louis Vasquez, Philip Thompson.\" - It Happened in Colorado\"One of the best records of conditions and activity in the Colorado region during fur trade days, and the first and only authentic record of a completed voyage from the Upper South Platte to the Mississippi.\" - Dr. LeRoy Hafen, HistorianTwenty-two year-old Elias Willard Smith left Independence on August 6, 1839 in a party of 32 fur traders under Vasquez and Sublette. The party followed the Santa Fe Trial to Bent's Fort, thence northward over the divide and down the South Platte to Fort Vasquez. Later, by way of North Park, the Little Snake and Fort Davy Crockett, they reached Brown's Hole on Green River. The journal is full of information on the mountain men, the fur trade, and the Indians.Smith's narrative is regarded as one of the best records of conditions and activity in Colorado in its fur trading days. The fur trading posts on the South Platte are well portrayed. The legendary fur traders with their ox-carts and mule wagons are portrayed hauling and packing trade goods to supply their posts and conducting the fur trade with the roving Native Americans. Starting at the Santa Fe Trail from the outfitting mecca of Independence, Missouri, the party went on to Bent's Fort on the Arkansas River. They then traveled north over the Great Divide and down the South Platte River Fort Vasquez, near present Platteville. Then leaving wagons they rode horseback and pack mules over the Rocky Mountains, across North Park, down the Little Snake River to Fort Davy Crockett. They then arrived in the favorite trapper winter quarters of pallisade-encircled Brown's Hole on Green River.The narrative indicates that horse-stealing by both renegade whites and by the Sioux Indians, and the retaliations, developed a veritable reign of terror in the early winter of 1839-40 in this Rocky Mountain fastness. Fearing retaliation by the whole force of the Sioux nation they would be forced to flee.The journal gives the first and only authentic account in fur trading days of a trip from the upper South Platte River to the Mississippi River. This twenty-three-year-old traveler was well-educated, thus cutting a contrast to the tough \"squaw-man\" traders and trappers in his party, later known as mountain men.In 1913, The Quarterly of the Oregon Historical Society published Smith's 30-page Journal with an introduction by J. Neilson Barry (1870-1961), which has been republished here for the convenience of the interested reader. ( See Vol. 14, No. 3, Sep., 1913, pp. 250-279).About the Elias Willard Smith (1814–1886) was an American architect and civil engineer. He was born in 1814 in Albany, New York, and died in 1886 in Washington, DC. He was educated as an engineer, at the Rensselaer Polytechnic Institute. As a graduation present from his father, he undertook a trip from St. Louis to the Rocky Mountains and back (1839–1840). During this trip, he recorded his observations in a journal, which was handed down in his family and later published in various scholarly venues.",
  "genres": [],
  "author": "Elias Willard Smith",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/46222425-journal-of-e-willard-smith-while-with-the-fur-traders-vasquez-and-subl"
}