{
  "title": "Political thinking for the masses: Way to freedom",
  "description": "I am the author of a political book of radical texts on liberty. I genuinely believe change is close, change in a way that has never happened in the millennia of human parasitism on this planet. Maybe the start of it can’t be perfect. But if we (anyone) believe we can push it a little bit sooner, we won’t be able to not to, to not live that life. I mean the legal protection (of sex slaves, other slaves); because the change in people’s minds can’t happen overnight. A political book has to be translated into a political program: specific laws, which reach the point to change individuals’ beliefs, though.This book will mean everything significant (political) you’ve done until now was nothing (no heaven for you). Maybe you’ve even helped conserve this world (including myself; it needs to be social). Yet, it doesn’t make you feel bad. You feel excited, change is so close, unexpectedly close and unimaginably revolutionary.When you buy alcohol, you should know that this allows an \"alcoholic\" to do so, with all its social repercussions. Those are not independent of you. You make it happen. Why I'm interested in prostitution? Who isn't? I'm a misogynist, and in order to not rape, I really need to end prostitution from this planet. a) Elimination of structural capabilityb) Elimination of structural possibility, impunityc) Elimination of structural sentimental containmentMaybe your eye is caught by \"rape\", or \"sodomy\", or \"pedophilia\" on the book. But it is \"exposure\" that should interest you: this, and this kind of sexuality, forms the basis for rape etc. I'm not an ecologist. Do you think an ecologist is willing to violently hold someone down to sterilize them? What ecologists do isn't effective: overcome by technology. I am effective. My idea for conservatism is a bit more extended: it comes down to \"can it actually change the world?\" or just makes you feel good. You know: all these words that mean nothing. \"Significant words\" in rallies and political speeches. Once you were introduced into this idea of \"success\", social stuff. But you don't need to live like this. Life is life. Living is living (through/with others of course). No (megalomaniac) goals. \"Slowly learning that life is ok\". No goals; no identities. Just live until die.Even if you feel success (or failure), you can try to push it away. No one is perfect. We attempt to be free.When others think you achieved an accomplishment, they \"see\" this accomplishment. The answer isn't to not do anything they might consider success. You don't need to adopt their opinions and make the same recognitions. Even if you initially do, you can try to designify later.",
  "genres": [
    "Politics",
    "Gender",
    "Nonfiction"
  ],
  "author": "Elias Tsikoudis",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/46224544-political-thinking-for-the-masses"
}