{
  "title": "Your End of the Lead: Changing how you think and act to help your reactive dog",
  "description": "Living with a dog is supposed to be fun, right? But when your dog is reactive, walks can be a nightmare – filled with the stress of trying to avoid other dogs or people. And many of the things you planned to do with your dog – family days out, doggy sports, relaxing holidays – are out of the question altogether. You tense up when you see someone coming. It only makes things worse, but it is hard not to when you know how your dog is going to behave. You are embarrassed and desperate. You feel like such a failure and just want it to stop.Reactivity is hard to live with but when we think of it as just a dog issue – that our dog has a problem behaviour that we have to modify – we are missing half of the story. To make real progress, we also need to transform ourselves. Your End of the Lead is a ground-breaking book, which will show you how to shape your thinking and adjust what you do so that you can be successful in helping your dog. Taking a holistic approach and bringing together ideas from a diverse range of disciplines, Janet Finlay offers practical ways to change your mindset, so that you can really enjoy life with your dog again while helping you to develop the skillset you need to make real progress in resolving your dog’s reactivity. With the help of this book, you can start to become the confident, resilient, mindful guardian for your dog that you have always wanted to be.Dr Janet Finlay is a Tellington TTouch Instructor, accredited dog trainer and qualified coach for people. At Canine Confidence, Janet specialises in working with the guardians of reactive dogs, using a holistic approach that goes beyond training and addresses the problem of reactivity from both ends of the lead. Janet teaches internationally and runs a number of successful online programmes, which have helped hundreds of guardians and their dogs change their lives for the better.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Janet Finlay",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/46216275-your-end-of-the-lead"
}