{
  "title": "Jedediah Smith, The Pathfinder of the Sierras",
  "description": "\"A great explorer and scout of the West, the first American to cross the Sierra Nevada, a great pioneer.\" -California Senate Resolution (1953) \"His escape from the dangers of the wilderness seem like miracles. Grizzly bears, Indians, and starvation stalked his path but just missed him.\" -Putney, In the South Dakota Country (1922) \"The first white American to come overland to California.\" -California. Dept. of Public Instruction (1920)  History furnishes few examples of daring and adventure comparable to those of the fur trappers and hunters of the tramontane regions of the Great West. The thrilling adventures of Jedediah Smith's expedition through interior California and its tragic fate on the Umpqua in Oregon, his return to his partners with only two survivors of his party, and his untimely death on the Santa Fe trail, constitute a story of absorbing interest.  Armed with his Bible and his gun, he led his men over an unexplored country from St. Louis to Sante Fe and then on to the Pacific. At the shore he turned north and explored the coast to the mouth of the Columbia River. He returned by way of the Columbia and Missouri Rivers. He discovered and explored the central and southwestern routes to the Pacific. These explorations were of as great importance as Lewis and Clarke's while the difficulties he overcame were very much greater. His escape from the dangers of the wilderness seem like miracles. Grizzly bears, Indians, and starvation stalked his path but just missed him. Jedediah Smith carried his Bible and lived its teachings all the way.  He was really one of the greatest of American explorers and his name ought to be perpetuated by some of the mountains or lakes or rivers that he discovered; but unfortunately he has been overlooked and well-nigh forgotten, while men of less merit and far less achievement, who followed the trails he was the first to open, have become the heroes of our western history.  In 1896, prominent educator and historian in southern California James Miller Guinn (1834-1918) published a 12 page work \"Jedediah Smith, The Pathfinder of the Sierras.\" In introducing his work, Guinn writes:  \"Twenty years before Fremont, the Pathfinder, made his explorations in the Great Basin and the valleys of California, Bridger had discovered Great Salt Lake; Ashley had traversed the Great Basin from the Rockies, westward to the Sierra Nevadas, had discovered Utah Lake, and built a fort and trading post on its shores, and Jedediah Smith, the pioneer trapper of California, had crossed the Sierras, had explored the valleys of the San Joaquin and the Sacramento; had followed the Cascade range from the Klamath to Columbia; had marked out what afterwards became the overland emigrant trail by way of the great Salt Lake, across the deserts of Nevada, down the Humboldt and over the Snowy Mountains into the valley of the Sacramento; and had traced that other emigrant trail by which, in later years, so many belated Argonauts found their way from Salt Lake across the mountains and deserts to Los Angeles.\"",
  "genres": [],
  "author": "James Miller Guinn",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/46232040-jedediah-smith-the-pathfinder-of-the-sierras"
}