{
  "title": "Slashtag",
  "description": "Welcome to Slashtag, the most immersive horror reality competition series in history! Tag along as seven of America's favorite celebrities step into the infamous Propitius Hotel, home to one of the most prolific serial killers in history - Arthur Wilson.Arthur built and operated the Propitius Hotel from 1905 until 1928 when dozens of bodies were found in his hotel, along with countless hidden torture rooms throughout the hotel. Arthur disappeared, seemingly never to be caught. He then returned - nearly 40 years later - under the guise of a priest leading a congregation of 100 people back to his hotel, where he once again committed mass murder. Enter Tawny Howlett-- a top-tier lifestyle influencer who is in the midst of the crappiest week of her life. Her brand new health drink turned out to be tainted, and now thousands of her followers want nothing more than to see her social media empire crumble. In order to rehabilitate her image, she's agreed to take part in \"Slashtag: The Ultimate Horror Experience\". At first it's all fun and games, until the team of seven celebs discover that the ghost is very real, and out for blood. In order to survive the three-day live-streamed event, Tawny and her fellow contestants must band together to try and send the spirit of Arthur Wilson straight to hell.\"I suddenly wish that I were just crazy. A hallucination would mean my brain is broken, which is something I’ve spent my entire adult life attempting to accept. If we’re both seeing this, it means the world is broken in a way my brain is not prepared to confront.\"While Tawny has her hands full trying to survive a weekend at the Propitius Hotel, it's up to her younger sister April to work from the outside to try and find a way to save her sister, and uncover the dark truth behind the TV network that continues to air the deaths of some of America's top talent. Together these seven doomed souls must solve the puzzles hidden within the hotel in order to vanquish the spirit of Arthur Wilson.-----------------------------------------------------------------------------From best-selling author Jon Cohn, comes the tale of a social media influencer's attempt to salvage what's left of her dwindling empire, save her sister, and survive the unimaginable in Slashtag, a gripping horror novel with IRL vibes and unexpected twists and turns in the age of social media.Jon Cohn's best-selling debut novel, \"The Island Mother\" won Publisher's Weekly's Booklife Prize for Best Indie Horror Novel of 2022.",
  "genres": [
    "Horror",
    "Thriller",
    "Fiction",
    "Paranormal",
    "Adult",
    "Suspense"
  ],
  "author": "Jon Cohn",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/124490399-slashtag"
}