{
  "title": "Fallen Star",
  "description": "Kai Zhao Vin had once been the greatest spirit artist his people had ever known—until he was stripped of his power by the world-conquering Host known as the Arashan. With his world destroyed and his people gone, Vin managed to escape to another world: the next target of the Arashan conquest. There, he managed to recover much of his former power as well as make powerful allies, all the while preparing for the arrival of the Arashan. But the people of his new home don't want to believe in the danger, forcing Vin to take the matter in his own hands. His only desire was to take revenge, and he has vowed to stop them from conquering another world. Kyarra Con Aroch, the Eternal Soul, had always been the protector of the Kingdom of Tourran, with every one of her former lives serving in that capacity—until the royal family was killed, and she was forced to fight to take the Kingdom back. Alongside powerful allies such as Vin, a warrior from another world, Kyarra managed to take back the city, but only found herself with more responsibility. Now crowned Queen, she finds herself in a situation for which she had never been prepared for. Forced to maneuver world politics as well as govern her own people, she must also convince everyone that the Arashan are coming. Ashara Ravena, daughter of a prominent merchant in the kingdom of Amaranthine, had come a long way from being destitute and running from her past. Now an adviser to the Queen of Tourran, the Eternal Soul, and with more wealth than her family ever had, she still doesn’t feel like she belongs. Her knowledge lacking, and her advice worth little, Ashara can’t help but feel worthless—especially considering that the two people she is closest to, Vin and Kyarra, are both incredibly powerful figures in every sense of the word. While she cares for both of them, she can’t help but feel inadequate next to them. All the while, the offer she received from a stranger keeps replaying inside her head. All she had to do was whisper a name, and she could gain enough power to be their equal, but Ashara fears that the price would be more than she was willing to pay. The Arashan were coming to conquer another world, and the decisions the three of them make will shape the future of an entire world and more.  For the fans of eastern and western fantasy.",
  "genres": [
    "Fantasy"
  ],
  "author": "Ivan Kal",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/46252701-fallen-star"
}