{
  "title": "Niewidzialne życie",
  "description": "Powieść Marthy Batalha przywołuje na myśl książki Isabel Allende i Eleny Ferrante.Jest błyskotliwa, sugestywna, przesycona brazylijskim duchem, napisana z ciepłą ironią i dystansem. O autorce mówi się, że jest nadzieją najnowszej literatury brazylijskiej i nową mistrzynią opowiadania.To historia dwóch sióstr, które dorastają w latach 40. XX wieku w Rio de Janeiro i nieustannie podejmują próby, by rola żony i matki nie była jedyną rolą w ich życiu.Eurídice jest młodsza i poważniejsza, a Guida starsza, pewna siebie i zdeterminowana, by pójść własną drogą.Pewnego dnia Guida ucieka z domu i zrywa kontakty z rodziną. Życie jednak nie szczędzi jej rozczarowań. Wkrótce sama musi zatroszczyć się o siebie i swoje dziecko.Eurídice stara się być dobrą córką i poślubia mężczyznę, przy którym będzie się czuła bezpiecznie. Choć jest uzdolniona i ma liczne talenty, to mąż oczekuje od niej tylko jednego: by była perfekcyjną panią domu. Jak wiele ówczesnych kobiet, Eurídice akceptuje taką rolę. Ale do czasu...Towarzysząc Guidzie i Eurídice, czytelnik poznaje galerię fascynujących postaci: Zélię, sąsiadkę plotkarkę, jej ojca Álvara, na którego rzucił klątwę potężny szaman, Filomenę, byłą prostytutkę, która została niańką, jednego z pierwszych milionerów Republiki, a także starego kawalera Antônia – podkochującego się w Eurídice właściciela składu papierniczego na rogu.Powieść wciąga od pierwszej strony swoim rytmem i spójną konstrukcją, potwierdzając, że jej autorka jest doskonałą opowiadaczką historii.Prawa do wydania powieści sprzedano do siedemnastu krajów, trwa jej ekranizacja w reżyserii Karima Aïnouza (premiera planowana na 2019).Książka znalazła się na krótkiej liście do Prêmio São, jednej z najważniejszych literackich nagród w Brazylii.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Brazil",
    "Historical",
    "Romance",
    "Book Club",
    "Contemporary"
  ],
  "author": "Martha Batalha",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/46235894-niewidzialne-ycie"
}