{
  "title": "Quinzinzinzili",
  "description": "Bien sûr, cela fait des décennies que la littérature nous annonce l’anéantissement de la race humaine, notre capacité à nous détruire ne se discutant plus. Beaucoup de livres pour un sujet aussi crucial, mais dans le lot peu de chefs-d’oeuvre... Quinzinzinzili, ce roman au titre improbable, est pourtant de ceux-là, ses rares lecteurs n’en démordent pas, qui s’étonnent toujours de son ironie visionnaire, de son pessimisme halluciné et de ses trouvailles géniales. Publié en 1935, il a été imaginé par Régis Messac (1893-1945), considéré comme l’un des précurseurs du genre, et nous entraîne après le cataclysme, à la suite du dernier des adultes, témoin stupéfait de la renaissance du genre humain : sous ses yeux désabusés, un groupe d’enfants réinvente une Humanité dont l’Histoire a disparu. Et Messac, qui sait que la Civilisation est mortelle, nous offre le spectacle d’une poignée de gosses en train de lui régler son compte... Stupéfiant, Quinzinzinzili renaît et devrait susciter l’admiration de ceux qui croient davantage aux vertus des Lettres qu’à celles de l’Homme. Formidable précurseur, Régis Messac, né en 1893, fils d’instituteur, qui deviendra enseignant, il est le premier Français à s’être intéressé de près au « roman de détection » — appellation d’époque du polar — , en le portant sur les bancs de l’université avec une thèse qui fait date, « Le »Detective novel« et l’influence de la pensée scientifique », rédigée à son retour d’un long séjour en Amérique du Nord. Auteur prolifique sur une courte période, habile à manier l’anticipation et la chronique sociale, il s’était très tôt rebellé contre un système (on lui doit un pamphlet À bas le latin !) qui le marginalisera. Blessé à la guerre, il est un pacifiste convaincu. Il a une intense activité de critique (il écrit les premiers essais littéraires sur la S.F.), de traducteur et de romancier durant les années 30. Gagné par un pessimisme acide, il imagine des contre-utopies : Quinzinzinzili (1935), La Cité des Asphyxiés (1937) ou le posthume Valcrétin indiquent que rien de l’avenir « messacien » n’est souriant. Motivés par la provocation dont il espère qu’elle conduira à un soubresaut moral (« Où est le bonheur ? Dans l’accord avec son milieu. Si nous vivons parmi les Crétins, soyons crétins. »), ses récits présentent une vue panoramique de sociétés futures ou parallèles. Arrêté par les Allemands en 1943, déporté « Nacht und Nebel », il disparaît en Allemagne en 1945.",
  "genres": [
    "Science Fiction",
    "France",
    "Dystopia",
    "Fiction",
    "Post Apocalyptic",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Régis Messac",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/4626645-quinzinzinzili"
}