{
  "title": "Dragon Untameable",
  "description": "When Alveria is plunged into a pitch-black darkness, can a dragon-shifter labelled as \"Untameable\" and the dragon-hunter sent to kill her, bond together to save their world? Laini Unclaimed, a maid at the Alveria Palace, thought supervising a kid's birthday party of young dragons was going to be the hardest part of her day. Then a never-ending darkness falls across Alveria, and an army of monsters are unleashed from the underworld. As attacks on humans and dragons rise, there’s little the royals can do to protect the people from creatures impervious to magic—and many think Laini is to blame. She's one of the first to face the terrifying monsters when she saves Prince Cade's life at the palace. After a lifetime of rejection, all the orphan wants is to find her place as an accepted member of Alverian society. But when the realm plunges into eternal night, her uncontrollable—unheard of—power the power over light and dark. Despite whispers of suspicion and blame, Laini denies responsibility for the darkness—how could it be her when she doesn't even understand her powers? Under the king’s guidance, she's sent to the prestigious Alveria Dragon Akademy to learn control of this newfound magic with a mis-fit group of other Untameables. But even the strong Akademy walls may not keep Laini safe, for a young dragon hunter lurks in the shadows, watching Laini and biding his time. Now Laini must discover the source of her powers and banish the darkness covering Alveria—before whispers become a cry for her death. But as the truth emerges, she learns that it is far more than her own life that's at stake, it's all of Alveria. Return to the Alveria Akademy in an all new dragon fantasy adventure! This novel contains violence and profanity.",
  "genres": [
    "Fantasy",
    "Dragons",
    "Young Adult"
  ],
  "author": "Ava Richardson",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/46263015-dragon-untameable"
}