{
  "title": "Beth's Stable",
  "description": "They say that in space, no one can hear you... (Yeah, you know what I'm quoting.) But there are lots of places you can still scream and be heard. Especially if you suddenly find yourself on a ship traveling through space. I’ve been abducted by aliens and auctioned to an alien pirate. My epic love of movies sort of comes in handy, what with all the sci-fi suddenly in my face. Therefore, I don’t completely lose my mind when my new owner takes me to his ship where I learn I’m under the control of not one, but *five* space pirates. (...And it’s not scary at all when I only meet four of them, and everyone warns me away from the mystery fifth alien.) Luckily, they’re not deterred by the fact that I've come to them carrying a passenger. I’m pregnant. Last I saw my ex, he was hell-bent on giving me another beating I wouldn’t forget. But with my new 'owners,' I’m safe for the first time in a long time--and so is my little girl. Not that everything is all raindrops on roses, and innocent kittens: they’re pirates. They’ve got a real addiction to plundering, and a passion for purloining. I’m pretty fond of the former, but when it comes to the thieving, I’m afraid they’re going to take more than my body. ...Piece by piece, all five of my pirates are stealing my *heart.*  **Note: Beth’s Stable is a standalone Reverse Harem romance where five men woo one woman. They’re space pirates, but there are no crossed energy sabers in this story. There is a Happily Ever After. You should probably be at least 18 if you crack open this ebook because Beth would hate to corrupt you. (Although if her pirates had met you before they grew completely, totally devoted to her, they would have loved showing you the ropes. Sorry, doves!) ;D",
  "genres": [
    "Reverse Harem",
    "Aliens",
    "Science Fiction",
    "Romance",
    "Fantasy",
    "Science Fiction Romance",
    "Pirates"
  ],
  "author": "Amanda Milo",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/46265540-beth-s-stable"
}