{
  "title": "The Shadow of the Torturer",
  "description": "In a stunning blend of the lyric extravagance of fantasy and the keen edge of science fiction, meeting in a future so distant that it seems like the ancient past, Gene Wolfe begins his chronicle of Sverian the Torturer, in this the first volume of The Book of the New Sun.One is not born into the torturer's guild, one is adopted there from the children of its victims. In the great Citadel built of unsmeltable gray metal, young Severian and his fellow apprentices study to achieve the rank of Master Torturer, learning the ancient mysteries of the guild, sworn to torture whome the Autarch says to torture, and to kill whom he says to kill.But with the coming of Thecla, a beautiful and intelligent woman whose indiscretions have lost her her place in the inner circle of concubines of the House Absolute, life changes for Severian, as he disobeys the rules he has been raised to follow. The young torturer expects to be killed for his crime; instead he is exiled from the City to serve as a simple executioner in distant Thrax, the City of Windowless Rooms. As he leaves, his master gifts hime with the ancient executioner's sword, Terminus Est, the Line of Division.So armed, he sets forth into the vast City, heading for the distant gate. On his way he encounters the twins Agia and Agilus, who drive him to an arcane duel on the Sanguinary Field; the acting troupe of Dr. Talos, a charlatan, Baldanders, a monstrous giant, and the lovely Jolenta; and Dorcas, a mysterious girl who appears on the shore of the Lake of Birds, where the dead lie.Into Severian's hands falls also the miraculous gem, the Claw of the Conciliator, whose powers promise to lead him to the very throne of the House Absolute. But first he must journey north, to the land of the mountains and it is at the great gate of the City Imperishable, the largest in the world, that the first volume of The Book of the New Sun closes, with Severian standing in the portal of his destiny.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Audiobook",
    "Classics",
    "Novels"
  ],
  "author": "Gene Wolfe",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/463365.The_Shadow_of_the_Torturer"
}