{
  "title": "All the Shah's Men: An American Coup and the Roots of Middle East Terror",
  "description": "Half a century ago, the United States overthrew a Middle Eastern government for the first time. The victim was Mohammad Mossadegh, the democratically elected prime minister of Iran. Although the coup seemed a success at first, today it serves as a chilling lesson about the dangers of foreign intervention.In this book, veteran New York Times correspondent Stephen Kinzer gives the first full account of this fateful operation. His account is centered around an hour-by-hour reconstruction of the events of August 1953, and concludes with an assessment of the coup's \"haunting and terrible legacy.\"Operation Ajax, as the plot was code-named, reshaped the history of Iran, the Middle East, and the world. It restored Mohammad Reza Shah to the Peacock Throne, allowing him to impose a tyranny that ultimately sparked the Islamic Revolution of 1979. The Islamic Revolution, in turn, inspired fundamentalists throughout the Muslim world, including the Taliban and terrorists who thrived under its protection.\"It is not far-fetched,\" Kinzer asserts in this book, \"to draw a line from Operation Ajax through the Shah's repressive regime and the Islamic Revolution to the fireballs that engulfed the World Trade Center in New York.\"Drawing on research in the United States and Iran, and using material from a long-secret CIA report, Kinzer explains the background of the coup and tells how it was carried out. It is a cloak-and-dagger story of spies, saboteurs, and secret agents. There are accounts of bribes, staged riots, suitcases full of cash, and midnight meetings between the Shah and CIA agent Kermit Roosevelt, who was smuggled in and out of the royal palace under a blanket in the back seat of a car. Roosevelt,the grandson of President Theodore Roosevelt, was a real-life James Bond in an era when CIA agents operated mainly by their wits. After his first coup attempt failed, he organized a second attempt that succeeded three days later.The colorful cast of characters includes the terrified young Shah, who fled his country at the first sign of trouble; General H. Norman Schwarzkopf, father of the Gulf War commander and the radio voice of \"Gang Busters,\" who flew to Tehran on a secret mission that helped set the coup in motion; and the fiery Prime Minister Mossadegh, who outraged the West by nationalizing the immensely profitable Anglo-Iranian Oil Company. The British, outraged by the seizure of their oil company, persuaded President Dwight Eisenhower that Mossadegh was leading Iran toward Communism. Eisenhower and Prime Minister Winston Churchill of Great Britain became the coup's main sponsors.Brimming with insights into Middle Eastern history and American foreign policy, this book is an eye-opening look at an event whose unintended consequences - Islamic revolution and violent anti-Americanism--have shaped the modern world. As the United States assumes an ever-widening role in the Middle East, it is essential reading.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "World History",
    "War",
    "Audiobook"
  ],
  "author": "Stephen Kinzer",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/46347.All_the_Shah_s_Men"
}