{
  "title": "The Age of Enterprise: A Social History of Industrial America",
  "description": "Cochran's prewar interest in business history, social science history & synthesis yielded after the war two works of enormous importance--probably the most influential in his career. For years he struggled to fashion a new synthesis of 19th & early 20th century American history with business as its core. After he married Rosamond Beebe in '37, she prevailed upon him to elicit the editorial help of Wm Miller, a Penn graduate student who had worked with him at NYU. The result was The Age of Enterprise: A Social History of Industrial America. \"We have not been a people essentially political, literary, metaphysical or religious,\" wrote Cochran & Miller. \"Our habits & folkways have not been formed only by voting, reading, logic-chopping or prayer. Our manners are not simply those of conventions, lyceums, schools & churches. We have been primarily a business people, & business has been most important in our lives\". They hoped to provide a synthesis at once fuller, more engaging & valid than suggested by simple economic explanations. Institutions played a role in the story, but as shapers of America, the business society. To be sure, the evolution of the firm--including the critical \"separation of ownership from control\" that accompanied the rise of big business, emphasized earlier by Berle & Means & later by Chandler--were duly noted. But they devoted considerable attention to industrial laborers, urban dwellers, social philosophers (especially Herbert Spencer), politicians & commercial farmers. Compared with the nonacademic, hagiographic business biographies of the day or the \"robber baron\" classics by Josephson, Allen & their ilk, The Age of Enterprise was comprehensive, balanced & synthetic. Even so, & in spite of its mission to demonstrate the centrality of business in the American experience, it was infused with populism. It portrayed company owners \"stripped of control\" by financiers & managers in a process that \"gradually dulled the initiative of erstwhile American entrepreneurs\" & \"profoundly threatened American democracy.\" Cochran admitted privately that he harbored socialist sympathies. But he kept his left-leaning empathies concealed in public & restrained in print--altho less so in this book than in later works. The fruitfulness of the book's cultural perspective can be seen in his treatment of industrial labor. While the rise of organized labor like the rise of big business is treated adequately, the focus is on the nature of work & workers. In the Gilded Age, workers were motivated to organize not merely by \"simple questions of wages & hours\" but also by their \"eroding feeling of self importance\" in the face of sporadic, monotonous & dangerous factory work. They also considered the social conditions that hindered unionization such as \"geographical dispersion of the working force, racial & linguistic antagonisms\" & even viewed the work experience within the context of worker's leisure activities. In these ways, the authors' dedication to understanding the workers' plight led them to raise questions that later would inspire a generation of leading New Labor historians such as David Brody, Herbert Gutman, David Montgomery & Roy Rosenswieg. The rise of big business staffed with professional middle managers that would form the centerpiece of Alfred Chandler's work was viewed in The Age of Enterprise in both economic & cultural terms. (In the burgeoning new bureaucracies \"skilled jobs & minor administrative positions were reserved for native white Americans.\") They discussed the significant economies captured thru the giant mergers, but also highlighted the leverage that businessmen gained in politics & against labor as well as \"the growing appeal to businessmen of sheer 'bigness' itself.\" Unfortunately, they stopped short of closing the loop by considering the ways in which prevailing social attitudes both nourished & impinged this \"fetish for monopoly\" & thus, in turned, shaped firm & industry structure. Publication of The Age of Enterprise earned Cochran tenure, promotion & wide recognition, & brought him into regular contact with other scholars in the budding field.--David B. Sicilia (edited)",
  "genres": [
    "History",
    "Nonfiction",
    "American History"
  ],
  "author": "Thomas Childs Cochran",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/1245091.The_Age_of_Enterprise"
}