{
  "title": "Twice Buried",
  "description": "Third book in the Posadas County Mystery Series \"Gastner is an incisive investigator whose two most valuable qualities are compassion and insomnia. Unlike other fictional detectives who approach murder as a personal affront, Gastner sees himself as the victims' advocate, striving to even the scales of justice for those no longer able to do it themselves.\"― Booklist When two baffling crimes strike Posadas County, New Mexico, Undersheriff Bill Gastner knows they're connected somehow. But as the case heats up he may have to call in reinforcements… Bill Gastner, Undersheriff of Posadas County, may be getting on in years, but he's still as sharp as any other small town sheriff. When he gets a call that an elderly schoolteacher was found dead at the bottom of her basement stairs, he suspects it wasn't an accident. Something strange is going on… He's also sure that elderly Reuben Fuentes knows nothing about the bodies scattered on his dusty, southern New Mexico ranch. Although the other county sheriffs want to arrest Fuentes and be done with the case, Bill isn't convinced. No spring chicken himself, Bill summons his former deputy, Estelle Reyes-Guzman, from Mexico to help clear the old man of suspicion. She's used to handling people who call her a 'lady cop' and can take anything thrown her way. Eventually this generation-spanning law enforcement team finds a thread tying all the crimes together―a killer with no conscience. In this thrilling addition to Steven F. Havill's posadas County Mystery Series, Undersheriff Bill Gastner will have to rely on former deputy Estelle Reyes-Guzman to help him unravel a harrowing case that spans all of Posadas County. Check out the iconic",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Westerns",
    "Audiobook",
    "Mystery Thriller",
    "Thriller"
  ],
  "author": "Steven F. Havill",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/464049.Twice_Buried"
}