{
  "title": "A Bed of Red Flowers: In Search of My Afghanistan",
  "description": "As a young girl growing up in 1970s Afghanistan, Nelofer Pazira seems destined for a bright future. The daughter of liberal-minded professionals, she enjoys a safe, loving and privileged life. Some of her early memories include convivial family picnics and New Years’ celebrations overlooking the thousands of red flowers that carpet the hills of Mazar. But Nelofer’s world is shattered when she is just five and her father is imprisoned for refusing to support the communist party. This episode plants a “seed of anger” in her, which is given plenty of opportunity to grow as the years unfold.In 1979, the Soviets invade Afghanistan beginning a ten-year occupation. The country becomes an armed camp with Russians fighting U.S.-backed mujahidin fighters while trying to impose military rule. For Nelofer, daily life includes an endless succession of tanks, rockets screaming overhead and explosions in the street. During this time, she and her best friend, Dyana, seek refuge in their love of poetry. At eleven, the two girls throw stones at Soviet tanks and plot other acts of rebellion at the local school. As Nelofer gets older, she joins the resistance movement, distributes contraband books, studies guerilla warfare and hides a gun in her parent’s mint garden.When Nelofer’s younger brother comes home from school in military garb, the family finally decides to flee Afghanistan. What follows is a perilous, clandestine journey across rugged mountains into Pakistan. But the life of a refugee is not what Nelofer expects. Though she once idealized the mujahidin as freedom fighters, she is shocked, as a woman, to find herself stripped of her personal freedom in their midst.In 1990, Nelofer and her family are offered refugee status in Canada. Here she corresponds with her friend Dyana, whose letters reveal the increasing oppression of life under the Taliban. Fearing that her friend will kill herself, Pazira returns to Afghanistan to rescue her. This search becomes the basis for the acclaimed film Kandahar . Her journey to discover Dyana’s tragedy leads her finally to Russia, the land of her enemy, where she confronts the legacy of the Soviet invasion of her homeland first-hand.A Bed of Red Flowers is a gripping, heart-rending story about a country caught in a struggle of the superpowers – and of the real people behind the politics. Universally acclaimed for its astute insights and extraordinary humanity, Pazira’s memoir won the Drainie-Taylor Biography Prize for 2005. The Winnipeg Free Press “Powerfully written, A Bed of Red Flowers is a rare account of a misunderstood country and its intrepid people, trying to live ordinary lives under extraordinary circumstances.” The Gazette (Montreal) describes the book as “an outpouring of passionate non-fiction that captivates like the tales of Sheherazade.… It’s a remarkable journey. An inspiring read.”",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "History",
    "Biography Memoir",
    "Book Club",
    "Asia"
  ],
  "author": "Nelofer Pazira",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/464519.A_Bed_of_Red_Flowers"
}