{
  "title": "Modernity and Self-Identity: Self and Society in the Late Modern Age",
  "description": "Modernity differs from all preceding forms of social order because of its dynamism, its deep undercutting of traditional habits and customs, and its global impact. It also radicallly alters the general nature of daily life and the most personal aspects of human activity. In fact, one of the most distinctive features of modernity is the increasing interconnection between globalizing influences and personal dispositions. The author analyzes the nature of this interconnection and provides a conceptual vocabulary for it, in the process providing a major rethinking of the nature of modernity and a reworking of basic premises of sociological analysis. Building on the ideas set out in the author's The Consequences of Modernity , this book focuses on the self and the emergence of new mechanisms of self-identity that are shaped by―yet also shape―the institutions of modernity. The author argues that the self is not a passive entity, determined by external influences. Rather, in forging their self-identities, no matter how local their contexts of action, individuals contribute to and directly promote social influences that are global in their consequences and implications. The author sketches the contours of the he calls \"high modernity\"―the world of our day―and considers its ramifications for the self and self-identity. In this context, he analyzes the meaning to the self of such concepts as trust, fate, risk, and security and goes on the examine the \"sequestration of experience,\" the process by which high modernity separates day-to-day social life from a variety of experiences and broad issues of morality. The author demonstrates how personal meaninglessness―the feeling that life has nothing worthwhile to offer―becomes a fundamental psychic problem in circumstances of high modernity. The book concludes with a discussion of \"life politics,\" a politics of selfactualization operating on both the individual and collective levels.",
  "genres": [
    "Sociology",
    "Philosophy",
    "Nonfiction",
    "Psychology",
    "Social Science",
    "Anthropology",
    "Politics"
  ],
  "author": "Anthony Giddens",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/46414.Modernity_and_Self_Identity"
}