{
  "title": "Someone Like You",
  "description": "Welcome to The Educators, Kathryn Shay’s bold new series of never before published novellas. Veteran teacher Shay returns to one of her favorite settings and vividly portrays the teachers, administrators and students of Crystal Corners High School. As is her trademark, sizzling romances are back-dropped by controversial, complicated and sometimes dangerous situations.In the second installment, Someone Like You, teacher Brie Gorman and Coach Nick Corelli have been at odds for years. She never liked the sexy jock himself, and hates how the school tends to coddle athletes. But when one of Brie’s students, the star quarterback of the football team, goes into a downward spiral, she and Nick must work together to help him. Unexpectedly, a fiery passion they can’t ignore erupts between them, even when they clash over the best way to save the boy’s life. Look for the third novella in the series, Maybe This Time, coming soon! Still the One is also available.Praise for Kathryn Shay’s novels“Shay knows how to pack an emotional wallop.” Booklist“Shay is a master of her craft.” Catherine Anderson, USA Bestselling Author“Kathryn Shay never disappoints!” Lisa Gardner, New Times Bestselling Author“I don’t know when I’ve been more involved in a novel’s characters and story.” The Romance Reader“Shay’s powerful characters and emotional topics strike a chord with her readers and have earned her a well deserved place among the top romance authors.” Waldenbooks Romantic Reader“Shay writes an emotion-packed story.” RT Book Club“Ms. Shay knows her way around a steamy love scene.” Romance Reviews Today.“Shay’s writing trademark is taking seemingly impossible relationships and developing them into classic tales of true love.” Fresh FictionPraise for Shay’s High School Stories“Kathryn Shay has carefully and precisely brought the reality of high school life into focus.” A Reader“Shay uses her own extensive background as a high-school teacher to create believable teenagers.”The Romance Reader",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Kathryn Shay",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/10256444-someone-like-you"
}