{
  "title": "The Survivor: Bill Clinton in the White House",
  "description": "New York Times BestsellerThe definitive account of one of the most accomplished, controversial, and polarizing figures in American history. Bill Clinton is the most arresting leader of his generation. He transformed American politics, and his eight years as president spawned arguments that continue to resonate. For all that has been written about this singular personality–including Clinton’s own massive autobiography–there has been no comprehensive, nonpartisan overview of the Clinton presidency.Few writers are as qualified and equipped to tackle this vast subject as the award-winning veteran Washington Post correspondent John F. Harris, who covered Clinton for six of his eight years in office–as long as any reporter for a major newspaper. In The Survivor, Harris frames the historical debate about President William Jefferson Clinton, by revealing the inner workings of the Clinton White House and providing the first objective analysis of Clinton’s leadership and its consequences.Harris shows Clinton entering the Oval Office in 1993 primed to make history. But with the Cold War recently concluded and the country coming off a nearly uninterrupted generation of Republican presidents, the new president’s entry into this maelstrom of events was tumultuous. His troubles were exacerbated by the habits, personal contacts, and the management style, he had developed in his years as governor of Arkansas. Clinton’s enthusiasm and temper were legendary, and he and Hillary Rodham Clinton–whose ambitions and ordeals also fill these pages–arrived filled with mistrust about many of the characters who greeted them in the “permanent Washington” that often holds the reins in the nation’s capital.Showing surprising doggedness and a deep-set desire to govern from the middle, Clinton repeatedly rose to the challenges; eventually winning over (or running over) political adversaries on both sides of the aisle–sometimes facing as much skepticism from fellow Democrats as from his Republican foes. But as Harris shows in his accounts of political debacles such as the attempted overhaul of health care, Clinton’s frustrations in the war against terrorism, and the numerous personal controversies that time and again threatened to consume his presidency, Bill Clinton could never manage to outrun his tendency to favor conciliation over clarity, or his own destructive appetites.The Survivor is the best kind of history, a book filled with major revelations–the tense dynamic of the Clinton inner circle and Clinton’s professional symbiosis with Al Gore to the imprint of Clinton’s immense personality on domestic and foreign affairs–as well as the minor details that leaven all great political narratives. This long-awaited synthesis of the dominant themes, events, and personalities of the Clinton years will stand as the authoritative and lasting work on the Clinton Presidency.",
  "genres": [
    "Presidents",
    "Politics",
    "Biography",
    "History",
    "Nonfiction",
    "American History",
    "Us Presidents"
  ],
  "author": "John F.  Harris",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/46625.The_Survivor"
}