{
  "title": "Gaston 1",
  "description": "Un beau jour de février 1957, un drôle d'hurluberlu fait son entrée dans l'hebdomadaire Spirou. Il est vêtu d'une veste bleue tout ce qu'il y a de classique, affublé d'un noeud papillon, les cheveux lissés et l'air vaguement ahuri. On ne sait pas trop ce qu'il fait là. Au fur et à mesure que les semaines passent, on en apprend un peu plus à son sujet. Il s'appelle Gaston et se prétend garçon de bureau. Très vite, sa tenue vestimentaire se relâche. Gaston envoie balader son noeud-pap', arbore un pull-over de couleur verte, des blue-jeans et une paire d'espadrilles du plus bel effet. Une star est née... Mais personne ne le sait encore. Et surtout pas son créateur, André Franquin, le dessinateur de Spirou et Fantasio. Au début, celui-ci trouvait amusant d'animer les pages du journal avec un \"héros sans emploi\". Il pensait juste à des illustrations qui viendraient égayer les rubriques du magazine. En décembre, Gaston devient personnage de bande dessinée. Cette fois, le mouvement est enclenché. La carrière du plus formidable gaffeur de l'histoire de la BD est enfin (\"m'enfin !\", dirait Gaston) lancée... Elle durera jusqu'à la mort de Franquin, survenue en janvier 1997. Gaston Lagaffe est un poète. Un anar sans le vouloir. Un écolo avant l'heure. Un inventeur génial de machines impossibles ou d'instruments de musique incertains comme le gaffophone. Tout au long de ses dix-neuf albums et de ses quelque mille gags, Franquin a créé un univers indémodable, drôle, truculent, peuplé de personnages inoubliables, magistralement servi par un des graphismes les plus dynamiques de la BD. Gaston, par ses gaffes ingénieuses et en même temps pleines de naïveté, aura passé son temps à dynamiter le fonctionnement de l'entreprise qu'était le journal Spirou, désorganisant la production et sabotant l'outil de travail bien malgré lui. Finalement, derrière son apparente innocence, ce Gaston Lagaffe était, mine de rien, un dangereux révolutionnaire... --Gilbert Jacques",
  "genres": [
    "Comics",
    "Bande Dessinée",
    "Graphic Novels",
    "France",
    "Humor",
    "Fiction",
    "Comic Book"
  ],
  "author": "André Franquin",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/466163.Gaston_1"
}