{
  "title": "Nationalism and the Imagination",
  "description": "Gayatri Chakravorty Spivak has distinguished herself as one of the foremost scholars of contemporary literary and postcolonial theory and feminist thought. Known for her translation of Derrida’s On Grammatology and her groundbreaking essay, “Can the Subaltern Speak?,” Spivak has often focused on subaltern, marginalized women and the role of essentialism in feminist thought to unite women from divergent cultural backgrounds.  In Nationalism and the Imagination, Spivak expands upon her previous postcolonial scholarship, employing a cultural lens to examine the rhetorical underpinnings of the idea of the nation-state.             In this gripping and intellectually rigorous work, Spivak specifically analyzes the creation of Indian sovereignty in 1947 and the tone of Indian nationalism, bound up with class and religion, that arose in its wake. Spivak was five years old when independence was declared, and she vividly writes: “These are my earliest memories: Famine and blood on the streets.” As well, she recollects the songs and folklore stories that were prevalent at the time in order to examine the role of the mother tongue and the relationship between language and feelings of national identity. She concludes that nationalism colludes with the private sphere of the imagination in order to command the public sphere.             Originally given as an address at the University of Sofia in Bulgaria, Nationalism and the Imagination provides powerful insight into the historical narrative of India as well as compelling ideas that speak to nationalist concerns around the world. Also included in this book is the discussion with Spivak that followed the speech, making this an essential and informative work for scholars of post-colonialism.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Politics",
    "Sociology",
    "Theory"
  ],
  "author": "Gayatri Chakravorty Spivak",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/4668904-nationalism-and-the-imagination"
}