{
  "title": "Let Them Eat Prozac",
  "description": "Here is a frank examination of the pharmaceutical industry and of one of the most popular drugs of the last twenty years by a psychiatrist who has been a consultant to many of the top companies.Sales of Prozac, Paxil and Zoloft now account for billions of dollars worldwide. Despite outward expressions of confidence in these new miracle drugs, drug companies and researchers still do not know exactly how they work, or what their potential side effects are.After years of consulting to the major companies, independent study, and prescribing Prozac and its sister antidepressants, David Healy shows that some of the patients taking Prozac, Paxil and Zoloft can become suicidal and commit suicide at a much higher rate than if they had been left untreated. The manufacturers have refused to acknowledge this risk, key national regulators have not taken appropriate steps to protect the safety of their citizens, and critics of these drugs have been harassed and threatened.In this book David Healy describes his transition from drug industry consultant to independent-minded critic. We meet leading figures in drug research, industry promotion, and government regulators. We are taken into back rooms of lawsuits where industry experts go head-to-head with lawyers and victims families looking for compensation for apparently Prozac-induced suicide.Near the conclusion of the book we witness Healy being offered a prestigious job at the University of Toronto, then having the offer rescinded. Only because on university faculty union support for his case did the university back down, with the result that Healy is now Visiting Professor of Medicine at the University of Toronto.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Science",
    "History",
    "Health",
    "Psychiatry"
  ],
  "author": "David Healy",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/4673969-let-them-eat-prozac"
}