{
  "title": "The Little Girl Who Lives Down the Lane",
  "description": "Alone in the darkened house, with only fire's glow and thirteen flickering candles for illumination, silent except for the mounting chords of a Liszt concerto, Rynn was preparing a solemn celebration. Until a knock at the door shattered sanctuary.Rynn is the little girl who lives in the house at the end of the lane with her father-or so she says. No one had seen the poet, Leslie Jacobs, for a long time, and though the pungent aroma of Gauloise filled the parlor with intimations of his presence, no one was certain he was there:Not Mrs. Hallet, the real estate agent who'd rented the old house to the eminent English poet and his daughter and whose formidable manner, product of her impeccable Long Island lineage, brooked no betrayals, especially not from a thirteen-year-old...Not her son Frank, whose Halloween visit, intruding on Rynn's birthday rituals, had been more trick than treat and whose own insidious motives would soon lock them both in a perilous contest of will...Not the local policeman who came to call and, lured by what he had seen, returned...Not the shy young amateur magician who arrived on an errand-and stayed to become confidant and co-conspirator...Who was the little girl who lived in such strange seclusion at the end of the leaf-swept land? Lonely and innocent seeking shelter from a hostile world? Or consummate liar? Each for his own reason, the Hallets were determined to find out. And it was then that the terrible secrets of the house at the end of the lane emerged. Moving with swift and shocking turnabout to a profoundly disturbing denouement, here is a fine and freezing novel of suspense that probes the subtle bonds of innocence to evil.",
  "genres": [
    "Horror",
    "Fiction",
    "Thriller",
    "Mystery",
    "Suspense",
    "Gothic",
    "Halloween"
  ],
  "author": "Laird Koenig",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/4666185-the-little-girl-who-lives-down-the-lane"
}