{
  "title": "Never Enough",
  "description": "At thirty-nine, Nancy Kissel had it all: glamour, gusto, garishly flaunted wealth, and the royal lifestyle of the expatriate wife. Not to mention three young children and what a friend described as \"the best marriage in the universe.\" That marriage—to Merrill Lynch and former Goldman Sachs investment banker Robert Kissel—ended abruptly one November night in 2003 in the bedroom of their luxury apartment high above Hong Kong's glittering Victoria Harbour. Why?Hong Kong prosecutors, who charged Nancy with murder, said she wanted to inherit Rob's millions and start a new life with a blue-collar lover who lived in a New Hampshire trailer park.She said she'd killed in self-defense while fighting for her life against an abusive, cocaine-addicted husband who had forced her for years to submit to his brutal sexual demands.Her 2005 trial, lasting for months and rich in lurid detail, captivated Hong Kong's expatriate community and attracted attention worldwide. Less than a year after the jury of seven Chinese citizens returned its unexpected verdict, Rob's brother, Andrew, a Connecticut real estate tycoon facing prison for fraud and embezzlement, was also found dead: stabbed in the back in the basement of his multimillion-dollar Greenwich mansion by person or persons unknown.Never Enough is the harrowing true story of these two brothers, Robert and Andrew Kissel, who grew up wanting to own the world but instead wound up murdered half a world apart; and of Nancy Kissel, a riddle wrapped inside an enigma, a modern American woman for whom having it all might not have been enough.In this singularly compelling narrative, Joe McGinniss—past master at exposing the dark heart of the American family in the bestsellers Fatal Vision, Blind Faith, and Cruel Doubt—explores his darkest and most disturbing subject yet: a smart and beautiful family so corroded by greed that it destroys itself from within.Here is a family saga almost biblical in its tragic proportion but dazzlingly modern in flavor—and utterly unstoppable in its pulsating narrative drive. From the shimmering skyscrapers and greed-drenched bustle of Hong Kong to the moneyed hush and hauteur of backcountry Greenwich, McGinniss lures readers irresistibly forward, as this twisted tale of ambition gone mad and love gone bad rushes to its terrible, inexorable conclusion.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Mystery",
    "True Story",
    "Biography"
  ],
  "author": "Joe McGinniss",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/466750.Never_Enough"
}