{
  "title": "Palestine: Peace Not Apartheid",
  "description": "Following his #1 New York Times bestseller, Our Endangered Values, the former president, winner of the Nobel Peace Prize, offers an assessment of what must be done to bring permanent peace to Israel with dignity and justice to Palestine.President Carter, who was able to negotiate peace between Israel and Egypt, has remained deeply involved in Middle East affairs since leaving the White House. He has stayed in touch with the major players from all sides in the conflict and has made numerous trips to the Holy Land, most recently as an observer in the Palestinian elections of 2005 and 2006. In this book, President Carter shares his intimate knowledge of the history of the Middle East and his personal experiences with the principal actors, and he addresses sensitive political issues many American officials avoid. Pulling no punches, Carter prescribes steps that must be taken for the two states to share the Holy Land without a system of apartheid or the constant fear of terrorism. The general parameters of a long-term, two-state agreement are well known, the president writes. There will be no substantive and permanent peace for any peoples in this troubled region as long as Israel is violating key UN resolutions, official American policy, and the international “road map” for peace by occupying Arab lands and oppressing the Palestinians. Except for mutually agreeable negotiated modifications, Israel’s official pre-1967 borders must be honored. As were all previous administrations since the founding of Israel, US government leaders must be in the forefront of achieving this long-delayed goal of a just agreement that both sides can honor. Palestine Peace Not Apartheid is a challenging, provocative, and courageous book.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "War",
    "Political Science",
    "Israel",
    "Religion"
  ],
  "author": "Jimmy Carter",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/467042.Palestine"
}