{
  "title": "Brainrush",
  "description": "Listed in the Wall Street Journal as the #1 Bestselling Action/Adventure in their \"Readers Guide to Self-Published Big Sellers\" (Dec 9, 2011).When terminally ill combat pilot Jake Bronson emerges from an MRI with extraordinary cognitive powers, everyone wants a piece of his talent--including Battista, one of the world's most dangerous terrorists. To save his love and her autistic child, Jake is thrust into a deadly chase that leads from the canals of Venice through Monte Carlo and finally to an ancient cavern in the Hindu Kush Mountains of Afghanistan--where Jake discovers that his newfound talents carry a hidden price that threatens the entire human race.An original weave of current events bound by colorful locations and cutting-edge technology, Bard's novel is a must-read for fans of Michael Crichton, James Rollins, Clive Cussler, and Brad Thor. A dynamic mix of fast-paced action and thought provoking soul, this book challenges the reader to keep pace with every sharp turn and shocking twist. Acclaimed by fans of action, sci-fi, and political thrillers alike, Brainrush is one of the most innovative and entertaining books of the year.BRAINRUSH was in the top-10 of the Amazon-USA Top-Rated List for over four months straight. The sequel, \"BRAINRUSH-II, The Enemy of My Enemy\", was released early December to rave reviews. Within a few weeks it became the #1 Top-Rated Action/Adventure AND the #2 Top-Rated Mystery/Thriller on Amazon USA--where it remains today (September 27, 2012):\"Brainrush explores the bonds of friendship while pushing the boundaries of science, creating a compelling, action-packed thriller with a climax that's a knock-out!\"- CJ Lyons, New York Times Best-Selling Author\"A terrifically entertaining thriller with three finely executed set pieces strung together with nice characterization. Especially successful is Bronson, an amiable, low-key tough guy able to rescue his princess, survive brutality, and retain a sense of humor.\"- Publishers Weekly 2011*\"If this startling debut doesn't have you turning pages at breakneck speed, then you're not paying attention. Rich characters, crackling dialogue, and a climactic sequence that is stunning, enervating, and innovative all at once. Richard Bard is a voice to be reckoned with.\"- Rebecca Forster, USA Today Best-Selling Author\"An inventive and compelling hybrid of science fiction, adventure, and political thriller. Rather than end the novel with a simple rescue operation, however, this author provides a far more intriguing and unexpected conclusion.- Publishers Weekly 2010** As a semifinalist in the 2010 and 2011 Amazon Breakthrough Novel Awards, the unpublished Brainrush manuscript received two separate reviews from Publishers WeeklyThis title is also available in audiobook. The sequel, \"BRAINRUSH II, The Enemy of My Enemy\" is also available.",
  "genres": [
    "Thriller",
    "Science Fiction",
    "Fiction",
    "Mystery",
    "Action",
    "Suspense",
    "Amazon"
  ],
  "author": "Richard Bard",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/12455203-brainrush"
}