{
  "title": "Wasted: A Memoir of Anorexia and Bulimia",
  "description": "Precociously intelligent, imaginative, energetic and ambitious, Marya Hornbacher grew up in a comfortable middle-class American home. At the age of five, she returned from a ballet class one day, put on an enormous sweater, curled up on her bed and cried -- because she thought she was fat. By age nine, she was secretly bulimic, throwing up at home after school while watching The Brady Bunch reruns on television and munching Fritos. She added anorexia to her repertoire a few years later and took great pride in her ability to starve.Why would a talented young girl go through the looking glass and step into a netherworld where up is down and food is greed, where death is honor and flesh is weak? Why enter into a love affair with hunger, drugs, sex and death? Marya Hornbacher sustained both anorexia and bulimia through five lengthy hospitalizations, endless therapy, the loss of family, friends, jobs and, ultimately, any sense of what it meant to be \"normal.\"In this vivid, emotionally wrenching memoir, she re-creates the experience and illuminates the tangle of personal, family and cultural causes that underlie eating disorders. Hornbacher's story gathers intensity with each passing year. By the time she is in college and working for a news service in Washington, DC, she is in the grip of a such a horrifying bout with anorexia that it will forever put to rest the romance of wasting away. Down to 52 pounds and counting, Hornbacher's body becomes a the death instinct with the drive to live, mind and body locked in mortal combat. Wasted is the story of one woman's travels to the darker side of reality, and her decision to find her way back -- on her own terms. A landmark book from a 23-year-old writer of virtuoso prose, Wasted takes us inside the experience of anorexia and bulimia in a way that no one else has ever done.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Mental Health",
    "Psychology",
    "Mental Illness",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Marya Hornbacher",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/46815.Wasted"
}