{
  "title": "The Trouble Boy",
  "description": "In the tradition of \"Bright Lights, Big City\" and \"Less Than Zero, \" Tom Dolby has written a searing debut novel about going after what you really want without losing yourself in the process. Powerfully written, keenly felt, \"The Trouble Boy\" heralds an exciting new voice in fiction. \"This is about fame and celebrity and the lengths to which people will go to have a taste of it. . .\"At twenty-two, Toby Griffin wants it all--fame, fortune, an Oscar-winning screenplay and a good-looking boyfriend by his side. For now, what he's got is a freelance writing job at a tanking online magazine, a walk-up sublet in the East Village and \"the boys,\" a young posse of preppy Upper East Siders with a taste for high fashion, top-shelf liquor and other men.But for Toby, downing vodka cranberries and falling in and out of lust with a series of guys he knows as Subway Boy, Loft Boy and Goth Boy is getting old. That all changes when Toby gets the chance of a lifetime--working as a personal assistant to hip, ruthless film mogul, Cameron Cole. In this decadent, drug-fueled world of VIP lounges, endless networking and relentless hype, Toby discovers that nothing is what is seems and that anything and anyone can be spun into PR gold. Though he's making friends with all the right people. Toby realizes that succeeding in Manhattan isn't as easy as he thought--until the one tragic night that changes his future forever and puts him in a position of power he never could have imagined.But with Toby's name suddenly becoming Page Six material, his life is coming unglued. And as his professional contacts betray him and his friends reveal troubling secrets, his choices become that much harder--and that much more important. Now, in his first year on his own, Toby Griffin is about to learn the price of getting everything he ever wanted.\"What really makes Toby's world so familiar--along with the author's lively, often-hilarious eye for even the most mundane social details--is the crisp prose and the snappy story.\"-- \"The San Francisco Chronicle\"",
  "genres": [
    "Gay",
    "Gay Fiction",
    "Fiction",
    "LGBT",
    "M M Romance",
    "Queer"
  ],
  "author": "Tom Dolby",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/467792.The_Trouble_Boy"
}