{
  "title": "The Winter Vault",
  "description": "Award-winning poet and novelist Anne Michaels gives us a love story of extraordinary depth and complexity, a mesmerizing tale that juxtaposes historical events with the most intimate moments of individual lives.In 1964, a newly married Canadian couple settles into a Nile River houseboat moored below the towering figures of Abu Simbel. Avery is one of the engineers responsible for the dismantling and reconstruction of the temple as it’s rescued from the rising waters of the Aswan Dam. He is a “machine-worshipper,” yet exquisitely sensitive to the dichotomy of creation and destruction of which machines are capable. Jean is a botanist by avocation and passion, interested in everything that grows. They had met on the banks of the St. Lawrence River and watched together as the construction of the seaway changed the course of the river and swallowed towns, homes, lives. Now, at the edge of another world about to be lost forever, Avery and Jean create their own world, exchanging the “moments that are the mortar of our days, innocent memories we don’t know we hold until given the gift of the eagerness of another.”But that gift will not be enough to bind them when tragedy strikes, and they will go back to separate lives in Toronto. Avery returns to school to study architecture, and Jean enters the life of Lucjan, a Polish émigré artist. Lucjan’s haunting stories of occupied Warsaw draw Jean further and further away from Avery. But, in time, he will also offer her the chance for forgiveness, consolation, and, finally, her own, most essential life.Stunning in its explorations of both the physical and emotional worlds of its characters, intensely moving and lyrical, The Winter Vault is a radiant work of fiction.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Literary Fiction",
    "Egypt",
    "Canadian Literature",
    "Book Club"
  ],
  "author": "Anne  Michaels",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/4682252-the-winter-vault"
}