{
  "title": "What They Don't Teach You at Harvard Business School: Notes from a Street-smart Executive",
  "description": "This business classic features straight-talking advice you’ll never hear in school. Featuring a new foreword by Ariel Emanuel and Patrick Whitesell Mark H. McCormack, one of the most successful entrepreneurs in American business, is widely credited as the founder of the modern-day sports marketing industry. On a handshake with Arnold Palmer and less than a thousand dollars, he started International Management Group and, over a four-decade period, built the company into a multimillion-dollar enterprise with offices in more than forty countries. To this day, McCormack’s business classic remains a must-read for executives and managers at every level. Relating his proven method of “applied people sense” in key chapters on sales, negotiation, reading others and yourself, and executive time management, McCormack presents powerful real-world guidance on • the secret life of a deal• management philosophies that don’t work (and one that does)• the key to running a meeting—and how to attend one• the positive use of negative reinforcement• proven ways to observe aggressively and take the edge• and much more Praise for What They Don’t Teach You at Harvard Business School “Incisive, intelligent, and witty, What They Don’t Teach You at Harvard Business School is a sure winner—like the author himself. Reading it has taught me a lot.” —Rupert Murdoch , executive chairman, News Corp, chairman and CEO, 21st Century Fox “Clear, concise, and informative . . . Like a good mentor, this book will be a valuable aid throughout your business career.” —Herbert J. Siegel, chairman, Chris-Craft Industries, Inc. “Mark McCormack describes the approach I have personally seen him adopt, which has not only contributed to the growth of his business, but mine as well.” —Arnold Palmer “There have been what we love to call dynasties in every sport. IMG has been different. What this one brilliant man, Mark McCormack, created is the only dynasty ever over all sport.” —Frank Deford, senior contributing writer, Sports Illustrated",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Leadership",
    "Management",
    "Economics",
    "Entrepreneurship"
  ],
  "author": "Mark H. McCormack",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/467754.What_They_Don_t_Teach_You_at_Harvard_Business_School"
}