{
  "title": "Saving the World at Work: What Companies and Individuals Can Do to Go Beyond Making a Profit to Making a Difference",
  "description": "Even the actions of a single person can help to change the world. How? Through simple acts of leadership and compassion. Open up this book, and discover the true stories of people whose actions have caused a chain reaction at work and in their communities. Among A manager who gives an employee some supportive praise, and as a result literally saves his life (page 231).A small group of bank tellers who spearhead a movement to raise millions of dollars for breast cancer, making it the biggest fundraiser in North America, and enhancing their company’s reputation (page 213).A sales manager who gets a copy of a groundbreaking book that leads to a transformation of the company’s operations. As a result, hundreds of millions of pounds of carpet waste avoid the landfill, and the company sparks a revolution in its industry (page 12). A “responsibility revolution” is shaking up corporate America. In this provocative and insightful book, bestselling author Tim Sanders reveals why companies must to go beyond making a profit and start making a difference.Every one of us, regardless of title or position, can inspire our companies to change the way they do business, helping them to become a positive force for enriching people, communities, and the environment. When this happens, not only do we help save the world, we help save our companies from becoming irrelevant. We also become part of what Sanders calls the Responsibility Revolution.Companies that don’t participate in this revolution risk becoming obsolete. Today customers, employees, and investors are demanding that companies focus on their social responsibilities—not just their bottom lines. Sixty-five percent of American consumers say they would change to brands associated with a good cause if price and quality were equal; 66 percent of recent college graduates will not work for companies with poor social values. And more than sixty million people are willing to pay a premium for socially and environmentally responsible products.In SAVING THE WORLD AT WORK, Tim Sanders offers concrete suggestions on how all of us can help our companies join the Responsibility Revolution. Drawing on extensive interviews with hundreds of employees and CEOs, and illuminated by countless stories of people who are making a difference in the workplace and in the world, Sanders offers practical advice every individual and company can use to make the world a better place--now and in the future.",
  "genres": [
    "Business",
    "Leadership",
    "Buisness",
    "Nonfiction",
    "Green",
    "Environment"
  ],
  "author": "Tim Sanders",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/4681541-saving-the-world-at-work"
}