{
  "title": "Mariposas en la nieve",
  "description": "¿Qué significa hacerse mayor? Adquirimos responsabilidades y ganamos el ser dueños de nosotros mismos. Por el camino, sin embargo, se nos ha ido hurtando el placer de jugar, la espontaneidad, la ilusión inquebrantable, la fe en nuestros sueños, la confianza en que algún día podemos llegar a volar. En algún lugar parece estar escrito que los adultos debemos ser serios y respetables antes que originales y divertidos. ¿Es posible recuperar esa parte de la infancia? La protagonista de esta historia se ve inmersa en una aventura que hace descarrilar su ordenada vida. Perdida en el desasosegante y pulcro paisaje de un lugar llamado Raspajo de la Sierra, se dará de bruces con las dolorosas caricaturas de tan esforzada respetabilidad, para descubrirse con el inusitado coraje y la inconsciente alegría de una niña. De vuelta a su realidad cotidiana, y perseguida por la inquietud de haberse enfrentado con unos fantasmas que le pertenecen, intentará encontrar la pista para comenzar a vivir sin las alas cortadas. Mariposas en la nieve es un relato de misterio y suspense, un relato sobre la rebelión de los sentimientos domesticados, un cuento de hadas contemporáneo para quienes, a pesar de habernos hecho mayores, no renunciamos a seguir creyendo en ellos. ¿Se puede desandar el camino de la realidad cotidiana y sin magia en la que habitualmente nos movemos? lntentémoslo. Mariposas en la nieve es una novela de desaprendizaje, que busca asomarse y empujarnos a ese tipo de pequeñas osadías que pueden variar nuestro destino. Cuando la experiencia salta por los aires, quizá nos queda esa oportunidad. En este historia no hay espacio para los milagros, sí para la esperanzada fantasía de lo posible. Con esta novela Lola Beccaria nos ofrece, después de Una mujer desnuda , otra magnífica muestra de una escritura y un estilo bien poco convencionales.",
  "genres": [
    "Fiction"
  ],
  "author": "Lola Beccaria",
  "average_rating": "2.48",
  "url": "https://www.goodreads.com/book/show/4692322-mariposas-en-la-nieve"
}