{
  "title": "Gun Control on Trial: Inside the Supreme Court Battle Over the Second Amendment",
  "description": "This past June, the Supreme Court decided a question at the heart of one of America's most impassioned debates, ruling that individual citizens have the constitutional right to possess guns. With that decision, the District's handgun ban―one of the toughest and most controversial in the nation―was ended. In Gun Control on Trial, journalist Brian Doherty tells the full story behind the landmark District of Columbia v. Heller ruling. With exclusive, behind the scenes access throughout the case, Doherty delved into the issues of this monumental case to provide a compelling look at the inside stories, The plaintiffs' fight for the right to protect themselves and their families from violent neighborhoods. The activist lawyers who worked exhaustively to affirm that right. The forces that fought to stop the case, including city officials and the NRA. The story of the Heller case stretches back to long before the decision struck down D.C.'s restrictive gun ban and forward to the future of the political and legal battle over gun control in America. Doherty provides clear, concise explanations of the issues and battles that have driven the gun control debate for decades, detailing how the Heller decision is a new starting point for the gun control debate as it passionately and energetically continues in the years ahead. It's important to note that the Heller decision does not settle every controversy in the gun control debate. It only settles the legal question of whether or not the right to possess weapons under the Second Amendment extends to personal it does, writes Doherty. What the Supreme Court decided in Heller may be narrow in its direct and immediate effect; but it's deep in its implications for the relationship between the government and the American people, explains Doherty. It establishes a new shape to the arena in which the legal and political struggle over guns and gun control will be fought. And that fight assuredly continues.",
  "genres": [
    "Nonfiction",
    "History",
    "Law",
    "Political Science",
    "Politics"
  ],
  "author": "Brian Doherty",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/4688515-gun-control-on-trial"
}