{
  "title": "La Calle de las Brujas",
  "description": "La estructura es compleja, cualqueira pensaría que para un primer libro se debe escribir algo para mente sencillas. No es el caso de LA CALLE DE LAS BRUJAS. Para nada. Como dije, la estructura es compleja, dificil de entender, dirían muchos, yo prefiero pensar que son juegos con los que Sandra se divierte. Juega con tu mente, se mete en tu pasado, lo revuelve, lo saca, te hiere... es una genio. El libro trata de un viaje, en el cual este pobre hombrecillo debe pasar por aquella calle llena de magia para llegar hasta su pasado... no a su futuro como normalmente sería. Se nota una cierta influencia de Italo Calvino en algunas partes. Me recordó un poco a CIUDADES INVISIBLES, pero después ya no. Y es que en la calle de Sandra Becerril, habitan personajes maravillosos, históricos, irreales pero tangibles. Lo leo de nuevo y se me cae la baba por ser ese viajante una vez más... La CALLE DE LAS BRUJAS, transcurre en un mundo de belleza alucinatoria entre el cuento clásico y el rito iniciático; donde la metafísica se entremezcla con la nostalgia, la obsesión y el deseo, todos cómplices del mismo enigma: ¿Qué es una bruja y cuál es su hechizo? El viaje que realiza su protagonista es alegoría de nuestro propio viaje; revestido de un lánguido erotismo y una oscura soledad, en vísperas de un destino que al cumplirse, podría dejarnos más vulnerables que nunca. LA CALLE DE LAS BRUJAS revive el género de realismo mágico con la voz de una autora que tiene mucho, pero mucho futuro. Sobre la autora puedo comentar que es una joven mexicana reconocida como una de las escritoras de su generación con personalidad más definida. Ganadora de premios internacionales, también es una destacada fotógrafa reconocida mundialmente. Ha publicado en más de 20 revistas literarias, tres antologías y proximamente otra novela que seguramente será de igual o mejor calidad que LA CALLE DE LAS BRUJAS Ficha: LA CALLE DE LAS BRUJAS, Becerril Sandra, Editorial Justine. México 2006. 80pp. Sitio oficial de Sandra Becerril: www.shamra.com.mxFuente: http://es.shvoong.com/books/258571-la...",
  "genres": [],
  "author": "Sandra Becerril",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/12456278-la-calle-de-las-brujas"
}