{
  "title": "Roads",
  "description": "This limited edition \"facsimile\" reprint volume is a complete and detailed reproduction of the original first edition published by Arkham House in 1948), fully authorized, and packaged in a deluxe gift box that includes a booklet with detailed biographical information about the author and illustrator. The dust jacket and gift box both feature the beautiful metallic gold ink of the original Arkham House edition.\"I have not tried to paint the portrait of a man, but merely to present a personality and hazard a guess as to the motivation that makes Santa Claus the wondrous figure he is - a figure who more than any other exemplifies the beauty of selflessness.\" - Seabury QuinnDrawing upon the original Christian legends that coalesced over centuries into the familiar, jolly form of Saint Nicholas, pulp fiction pioneer Seabury Quinn weaves a spellbinding new origin for this most beloved of children's icons in his classic novella Roads.First published in the January 1938 issue of Weird Tales, this re-imagining of Santa Claus has been hailed by genre historian Sam Moskowitz as \"the greatest adult Christmas story written by an American.\" Ten years after its initial publication, Roads reappeared as a handsome hardcover book from Arkham House, the groundbreaking speculative fiction publisher founded in 1938 by August Derleth and Donald Wandrei - an edition which featured beautiful new illustrations by the legendary fantasy artist Virgil Finlay.Divided into three sections, Quinn's tale begins in the days of the Roman Empire, where the mighty gladiator Claus - a barbarian from the frozen Northland - has just finished his term of service in the province of Judea. On the journey back to his homeland, Claus chances upon a poor family under attack and saves them from a murderous band of soldiers. With this selfless act, his life is changed forever. Claus goes on to travel further than he ever could have imagined. Crossing from one end of the Empire to the other and back again, he eventually outlives the power of Rome and the dark ages that follow it, and witnesses the rise of new civilizations on its former lands. Immune to the effects of time, Claus accumulates the wisdom of many lifetimes before discovering the final road he is destined to follow - a path which will lead him to his true calling, and fulfill a promise made to one very special child on behalf of all the children of the world.",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Sword and Sorcery",
    "Horror",
    "Weird Fiction",
    "Christmas",
    "Christianity"
  ],
  "author": "Seabury Quinn",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/470670.Roads"
}