{
  "title": "The Beast Within",
  "description": "His haunting, impressionistic study of a man's slow corruption by jealousy, Emile Zola's The Beast Within (La Bete Humaine) is translated from the French with an introduction and notes by Roger Whitehouse in Penguin Classics.Roubaud is consumed by a jealous rage when he discovers a sordid secret about his young wife's past. The only way he can rest is by forcing her to help him murder the man involved, but there is a witness - Jacques Lantier, a fellow railway employee. Jacques, meanwhile, must contend with his own terrible impulses, for every time he sees a woman he feels the overwhelming desire to kill. In the company of Roubaud's wife, Severine, he finds peace briefly, yet his feelings for her soon bring disasterous consequences. A key work in the Rougon-Macquart cycle, The Beast Within is one of Zola's most dark and violent works - a tense thriller of political corruption, and a graphic exploration of the criminal mind.Roger Whitehouse's vivid translation is accompanied by an introduction discussing Zola's depiction of the railways, politics and the legal system and the influence of the studies of criminology and the Jack the Ripper murders on his novel. This edition also includes a chronology, suggestions for further reading and notes.Emile Zola (1840-1902) was the leading figure in the French school of naturalistic fiction. His principal work, Les Rougon-Macquart, is a panorama of mid-19th century French life, in a cycle of 20 novels which Zola wrote over a period of 22 years, including Au Bonheur des Dames (1883), The Beast Within (1890), Nana (1880), and The Drinking Den (1877).If you enjoyed The Beast Within, you might like Zola's The Drinking Den, also available in Penguin Classics.",
  "genres": [
    "Classics",
    "Fiction",
    "France",
    "French Literature",
    "19th Century",
    "Literature",
    "Novels"
  ],
  "author": "Émile Zola",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/470283.The_Beast_Within"
}