{
  "title": "The Tumbleweed Dossier",
  "description": "Happy Valley - Hal Harper is an independent filmmaker and Penny Garland is his beautiful, yet overbearing, über-Mormon fiancé. Max is her fat, dimwitted brother and Josey is her loyal minion. Penny’s Mom, who has a few screws loose, is convinced Hal isn’t good enough for her and will do anything to get between them. Simon Manners is a meddling returned missionary and Alexandra Lombardi is a redheaded distraction. Buddy Kennedy is an amoral businessman, MRV is a corrupt, jack-Mormon politician, and Scruffy is a deranged talking teddy bear with a passion for murder and cannibalism. Only in Happy Valley can these characters take you on a hilariously dark, yet touching journey that will teach you more about life in Utah than you ever thought possible.Son of Santa - Santa Claus is Real. Sure, the story has changed a lot over the years, but all the hard facts point to the undeniable truth of his existence. People just don’t want to accept it, so they stop believing. But Santa still visits those who keep believing, despite what they tell their friends at school and fancy parties. Not everybody knows the deeper secrets of the Santa Claus tale. You see, “Santa Claus” isn’t really a single person, it is more of a title that is passed from father to son. It has been a Kringle family tradition for generations. Jack Kringle didn’t want to be the next Santa Claus, so he left the North Pole for New York City. There he found success and wealth as a scheming businessman, often times trampling on the “little guy” to get what he wanted. Suddenly, his twin brother, Dale, appears in New York on a secret mission that may just teach Jack the true meaning of Christmas.The Tumbleweed Dossier - It’s time for full disclosure! Due to the highly publicized nature of the events that took place in Tumbleweed, Texas, the Federal Bureau of Investigation has commissioned this report. The author has been granted full access to the Tumbleweed dossier, interviewed all surviving key individuals, and written this objective novelization of what happened. Subject 1: Special Agent Stanley B. Goode, FBI. Lead investigator into the disappearance of Daisy Dotson. Subject 2: Special Agent Kimberly Hart, FBI. Agent Goode’s partner on the case who may have ulterior motives. Subject 3: Daisy Dotson, High School Student. Daughter of oil tycoon, Arnold Dotson. Mysteriously disappeared after the prom. Subject 4: Dr. Ronnie James “RJ” Wiley, DDS. Dentist with a practice in Tumbleweed, expert in all things paranormal. Within these pages you will discover the truth about vampires, aliens, and unidentified flying objects.",
  "genres": [],
  "author": "Sugar Ray Dodge",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/4705417-the-tumbleweed-dossier"
}