{
  "title": "From Cover to Cover: Evaluating and Reviewing Children's Books",
  "description": "From Cover To Cover is a fresh, up-to-date look at some of the best examples of children's literature today, and also includes practical advice on how to write clearly articulated, reasoned opinions so that others can learn about books they have not yet read.It includes: - a short explanation of the process of making a children's book from manuscript to final bound book - a description of the importance of the many different parts of a book (jacket flaps, title page, copyright, Cataloging-in-Publication information, etc.) - six thought-provoking chapters that explain how to think about and critically evaluate several different genres of children's books: - books of information traditional literature (myths, legends, tall tales, folktales) poetry, verse, rhymes, and songs picture books - easy readers and transitional books - fiction- a concluding chapter on how to write reviews that are both descriptive and analyticalFrom Cover To Cover is an invaluable resource for all professionals who wish to write book evaluations that go beyond a simple personal response.This definitive guide to reviewing children’s books makes it effortless for parents, teachers, librarians, children's literature students and general readers who are interested in becoming children's book reviewers to assess the strengths and weaknesses of a children’s book. An authoritative reviewer in her own right, Kathleen Horning provides practical guidelines for reading critically, evaluating an initial response, answering questions raised during the first reading, putting a response into words, balancing description with criticism, and writing reviews for a particular audience.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Library Science",
    "Adult",
    "Reference",
    "Education",
    "Grad School"
  ],
  "author": "Kathleen T. Horning",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/470772.From_Cover_to_Cover"
}