{
  "title": "Mozart's Sister",
  "description": "Maria Anna Walburga Ignatia Mozart, affectionately called Nannerl by her family, could play the piano with an otherworldly skill from the time she was a child, when her tiny hands seemed too small to encompass a fifth. At the tender age of five, she gave her first public performance, amazing the assembled gentlemen and ladies with the beautiful music she created. But her moment of glory was cut short, for even as her father carried her around to receive their praise, her mother began laboring to bring a second child into the world. After hours of her mother’s pained cries and agonized shouts, which rang in Nannerl’s ears like a terrifying symphony, the child was born. They named him Wolfgang. Nannerl loved him instantly. As they grew, Wolfgang and his sister became inseparable, creating a fantasy world together and playing music the likes of which no one had ever heard. They were two sides of a single person, opposite in temperament—he lighthearted and charismatic, she shy and retiring—but equal in talent. Yet it was Wolfgang who carried their father’s dreams of glory. And as the siblings matured, Nannerl’s prodigious talent was brushed aside by her father. Instead of playing alongside her brother in the world’s great cities, she was forced to stop performing and become a provincial piano teacher to support Wolfgang’s career. Nannerl might have accepted this life in her brother’s shadow but for the appearance of a potential suitor who reawakened her passion for life, for love, for music—and who threatened to upset the delicate balance that kept the Mozart family in harmony. Mozart’s Sister draws you into the lush palaces and salons of eighteenth-century Europe and into the fascinating life of a woman who ultimately found a way to express her own genius.From the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Music",
    "Historical",
    "18th Century",
    "Book Club",
    "Romance"
  ],
  "author": "Rita Charbonnier",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/471025.Mozart_s_Sister"
}