{
  "title": "Nocturnal",
  "description": "Note: This edition is for the 2007 original podcast rough draft version, which greatly differs from the re-written 2012 version. It is not the same book as the 2012 edition.Scott Sigler reinvented the alien-invasion story in his bestselling novels Infected and Contagious… rebooted the biotech thriller in Ancestor…now, in his most ambitious, sweeping novel to date, he works his magic on the paranormal thriller, taking us inside a terrifying underworld of subterranean predators that only his twisted mind could invent.  Homicide detective Bryan Clauser is losing his mind.  How else to explain the dreams he keeps having—dreams that mirror, with impossible accuracy, the gruesome serial murders taking place all over San Francisco? How else to explain the feelings these dreams provoke in him—not disgust, not horror, but excitement?  As Bryan and his longtime partner, Lawrence “Pookie” Chang, investigate the murders, they learn that things are even stranger than they at first seem. For the victims are all enemies of a seemingly ordinary young boy—a boy who is gripped by the same dreams that haunt Bryan. Meanwhile, a shadowy vigilante, seemingly armed with superhuman powers, is out there killing the killers. And Bryan and Pookie’s superiors—from the mayor on down—seem strangely eager to keep the detectives from discovering the truth.  Doubting his own sanity and stripped of his badge, Bryan begins to suspect that he’s stumbled into the crosshairs of a shadow war that has gripped his city for more than a century—a war waged by a race of killers living in San Francisco’s unknown, underground ruins, emerging at night to feed on those who will not be missed.  And as Bryan learns the truth about his own intimate connections to the killings, he discovers that those who matter most to him are in mortal danger…and that he may be the only man gifted—or cursed—with the power to do battle with the nocturnals.  Featuring a dazzlingly plotted mystery and a terrifying descent into a nightmarish underworld—along with some of the most incredible action scenes ever put to paper, and an explosive, gut-wrenching conclusion you won’t soon forget—Nocturnal is the most spectacular outing to date from one of the genre’s brightest stars.",
  "genres": [
    "Horror",
    "Thriller",
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Audiobook",
    "Urban Fantasy"
  ],
  "author": "Scott Sigler",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/4719232-nocturnal"
}