{
  "title": "The Great Starvation Experiment: The Heroic Men Who Starved so That Millions Could Live",
  "description": "What does it feel like to starve? To feel your body cry out for nourishment, to think only of food? How many fitful, hungry nights must pass before dreams of home-cooked meals metastasize into nightmares of cannibalism? Why would anyone volunteer to find out?In The Great Starvation Experiment, historian Todd Tucker tells the harrowing story of thirty-six young men who willingly and bravely faced down profound, consuming hunger. As conscientious objectors during World War II, these men were eager to help in the war effort but restricted from combat by their pacifist beliefs. So, instead, they volunteered to become guinea pigs in one of the most unusual experiments in medical history -- one that required a year of systematic starvation.Dr. Ancel Keys was already famous for inventing the K ration when the War Department asked for his help with feeding the starving citizens of Europe and the Far East at the war's end. Fascists and Communists, it was feared, could gain a foothold in war-ravaged areas. \"Starved people,\" Keys liked to say, \"can't be taught Democracy.\" The government needed to know the best way to rehabilitate those people who had been severely underfed during the long war. To study rehabilitation, Keys first needed to create a pool of starving test subjects.Gathered in a cutting-edge lab underneath the football stadium at the University of Minnesota, Dr. Keys' test subjects forsook most food and were monitored constantly so that Dr. Keys and his scientists could study the effects of starvation on otherwise healthy people. While the weight loss of the men followed a neat mathematical curve, the psychological deterioration was less predictable. Some men drank quarts and quarts of water to fill their empty stomachs. One man chewed as many as forty packs of gum a day. One man mutilated himself to escape the experiment. Ultimately only four of the men were expelled from the experiment for cheating -- a testament to the volunteers' determination and toughness.To prevent atrocities of the kind committed by the Nazi doctors, international law now prevents this kind of experimentation on healthy people. But in this remarkable book, Todd Tucker captures a lost sliver of American history -- a time when cold scientific principles collided with living, breathing human beings. Tucker depicts the agony and endurance of a group of extraordinary men whose lives were altered not only for the year they participated in the experiment, but forever.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Nutrition",
    "Psychology",
    "Medicine",
    "Health"
  ],
  "author": "Todd Tucker",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/472138.The_Great_Starvation_Experiment"
}