{
  "title": "PR!: A Social History Of Spin",
  "description": "The early years of the twentieth century were a difficult period for Big Business. Corporate monopolies, the brutal exploitation of labor, and unscrupulous business practices were the target of blistering attacks from a muckraking press and an increasingly resentful public. Corporate giants were no longer able to operate free from the scrutiny of the masses.“The crowd is now in the saddle,” warned Ivy Lee, one of America’s first corporate public relations men. “The people now rule. We have substituted for the divine right of kings, the divine right of the multitude.” Unless corporations developed means for counteracting public disapproval, he cautioned, their future would be in peril. Lee’s words heralded the dawn of an era in which corporate image management was to become a paramount feature of American society. Some corporations, such as AT&T, responded inventively to the emergency. Others, like Standard Oil of New Jersey (known today as Exxon), continued to fumble the PR ball for decades. The Age of Public Relations had begun.In this long-awaited, pathbreaking book, Stuart Ewen tells the story of the Age unfolding: the social conditions that brought it about; the ideas that inspired the strategies of public relations specialists; the growing use of images as tools of persuasion; and, finally, the ways that the rise of public relations interacted with the changing dynamics of public life itself. He takes us on a vivid journey into the thinking of PR practitioners—from Edward Bernays to George Gallup—exploring some of the most significant campaigns to mold the public mind, and revealing disturbing trends that have persisted to the present day. Using previously confidential sources, and with the aid of dozens of illustrations from the past hundred years, Ewen sheds unsparing light on the contours and contradictions of American democracy on the threshold of a new millennium.",
  "genres": [
    "History",
    "Nonfiction",
    "Sociology",
    "Psychology",
    "Politics",
    "Philosophy",
    "American History"
  ],
  "author": "Stuart Ewen",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/471973.PR_"
}