{
  "title": "Nightmare USA: The Untold Story of the Exploitation Independents",
  "description": "From Quentin Tarantino (Kill Bill) to Eli Roth (Hostel), the young guns of modern Hollywood just can't get enough of that exploitation film high. That's because, between 1970 and 1985, American Exploitation movies went berserk. With censorship relaxed, and the gate to excess wide open, horror - the Exploitation genre par excellence - offered a vibrant alternative to the mainstream of American cinema. Luridly titled wonders like The Headless Eyes, Scream Bloody Murder and Hitch Hike to Hell were everywhere, from the drive-ins of Texas to the grindhouses of New York, touting a combination of mind-bruising violence, weird sex and drug-soaked delirium. Massively popular around the world, American exploitation movies added immensely to the richness of the nation's cinema, but they have remained persona non grata in most serious studies of American film. Until now...Built on five years of research, Nightmare USA explores the development of America's subterranean horror film industry, spotlighting some of the wildest films imaginable from an era unchecked by censorship or 'good taste.' Ranging from cult favourites like I Drink Your Blood to stylish mind-benders like Messiah of Evil and ultra-violent shockers like Don't Go in the House, Nightmare USA goes where no other in-depth study has gone before, revealing the fascinating true stories behind classics and obscurities alike. Stephen Thrower, author of Beyond Terror, the definitive book on Italian gore maestro Lucio Fulci, has explored the attics and cellars of American cinema, delved beneath the floorboards, peered between the walls, searching for the strangest, most exotic cine-lifeforms... Nightmare USA is the reader's guide to what lies beyond the mainstream of American horror, dispelling the shadows to meet the men and women behind fifteen years of screen the Exploitation Independents!This massive overview of the Horror genre's development through the 1970s and 1980s -- In-depth EXCLUSIVE interviews with twenty-five grindhouse movie makers, many of whom are discussing their work for the first time ever in print.-- Over 175 individual films reviewed, with full cast and crew credits compiled by world-renowned cinema archivist Julian Grainger.-- Vast quantities of previously unpublished stills, posters, press-books, plus behind-the-scenes photographs from the filmmakers' own collections.",
  "genres": [
    "Film",
    "Horror",
    "Nonfiction",
    "Media Tie In",
    "History",
    "Reference",
    "Biography"
  ],
  "author": "Stephen Thrower",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/4717056-nightmare-usa"
}