{
  "title": "Orpheus in the Bronx: Essays on Identity, Politics, and the Freedom of Poetry",
  "description": "\"Orpheus in the Bronx not only extols the freedom language affords us; it embodies that freedom, enacting poetry's greatest gift---the power to recognize ourselves as something other than what we are. These bracing arguments were written by a poet who sings.\"---James LongenbachA highly acute writer, scholar, editor, and critic, Reginald Shepherd brings to his work the sensibilities of a classicist and a contemporary theorist, an inheritor of the American high modernist canon, and a poet drawing and playing on popular culture, while simultaneously venturing into formal experimentation.In the essays collected here, Shepherd offers probing meditations unified by a \"resolute defense of poetry's autonomy, and a celebration of the liberatory and utopian possibilities such autonomy offers.\" Among the pieces included are an eloquent autobiographical essay setting out in the frankest terms the vicissitudes of a Bronx ghetto childhood; the escape offered by books and \"gifted\" status preserved by maternal determination; early loss and the equivalent of exile; and the formation of the writer's vocation. With the same frankness that he brings to autobiography, Shepherd also sets out his reasons for rejecting \"identity politics\" in poetry as an unnecessary trammeling of literary imagination. His study of the \"urban pastoral,\" from Baudelaire through Eliot, Crane, and Gwendolyn Brooks, to Shepherd's own work, provides a fresh view of the place of urban landscape in American poetry.Throughout his essays---as in his poetry---Shepherd juxtaposes unabashed lyricism, historical awareness, and in-your-face contemporaneity, bristling with intelligence.A volume in the Poets on Poetry series, which collects critical works by contemporary poets, gathering together the articles, interviews, and book reviews by which they have articulated the poetics of a new generation.",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Essays"
  ],
  "author": "Reginald Shepherd",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/471132.Orpheus_in_the_Bronx"
}