{
  "title": "Les Diners de Gala",
  "description": "“Les diners de Gala is uniquely devoted to the pleasures of taste … If you are a disciple of one of those calorie-counters who turn the joys of eating into a form of punishment, close this book at once; it is too lively, too aggressive, and far too impertinent for you.”―Salvador Dalí Food and surrealism make perfect sex and lobsters, collage and cannibalism, the meeting of a swan and a toothbrush on a pastry case. The opulent dinner parties thrown by Salvador Dalí (1904–1989) and his wife and muse, Gala (1894–1982) were the stuff of legend. Luckily for us, Dalí published a cookbook in 1973, Les diners de Gala, which reveals some of the sensual, imaginative, and exotic elements that made up their notorious gatherings. This reprint features all 136 recipes over 12 chapters, specially illustrated by Dalí, and organized by meal courses, including aphrodisiacs. The illustrations and recipes are accompanied by Dalí’s extravagant musings on subjects such as dinner “The jaw is our best tool to grasp philosophical knowledge.” All these rich recipes can be cooked at home, although some will require practiced skill and a well-stocked pantry. This is cuisine of the old school, with meals by leading French chefs from such stellar Paris restaurants as Lasserre, La Tour d’Argent, Maxim’s, and Le Train Bleu. Good taste, however voluptuous, never goes out of fashion. In making this exceptionally rare book available to a wide audience, TASCHEN brings an artwork, a practical cookbook, and a multisensory adventure to today’s kitchens.The first English edition of Les Diners de Gala was published in 1973 by FELICIE, INC., New York",
  "genres": [
    "Art",
    "Cookbooks",
    "Nonfiction",
    "Cooking",
    "Food",
    "France",
    "Food Writing"
  ],
  "author": "Salvador Domenech Felipe Jacinto; translated by J. Peter Moore Dali",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/472401.Les_Diners_de_Gala"
}