{
  "title": "Five Lost Classics: Tao, Huang-lao, and Yin-yang in Han China",
  "description": "Three schools of Taoism flourished at the beginning of the Han Dynasty in 2nd-Century B.C. the Lao-tzu, the Chuang-tzu, and the Huang-Lao, the last being the most influential philosophy at the court of the Han rulers. But, after Confucianism became the predominant court philosophy in the 1st Century B.C., Huang-Lao Taoism became little more than a name; its central principles virtually forgotten, its texts destroyed or lost.In 1973, among the many unique documents discovered in the richly furnished tomb of a Han-dynasty aristocrat, were five books written on silk, primary texts of Huang-lao Taoism and Yin-yang philosophy that had been lost to mankind for more than 2,000 years. A discovery as important in China as the unearthing of the Dead Sea Scrolls was in the West, the Mawangdui texts created a sensation when they were first published, even leading to the foundation of a new religion on Taiwan. Now Robin D. S. Yates, a noted expert in Chinese history and philosophy, offers the first complete translation of these precious and unique texts to be published in a Western language.As Professor Yates explains in his illuminating introduction to this volume, the recovery of the five lost classics sheds new light on a critical transitional period of Chinese political and intellectual history. Implicit in the texts is the assumption that a ruler who strives to align himself with the unknowable, transcendent order of the cosmos will become a \"true king\" capable of commanding the allegiance of a unified China. To this end, the essays deal with concrete questions of self-cultivation and political insight rather than with the abstract considerations typical of Western philosophy.The first four texts focus on different facets of Huang-lao Taoism while the fifth is devoted to Yin-yang The Law unfolds the essence of the Tao and explains why rulers must abide within the boundaries of the law; The Canon is largely cast as a series of stories and dialogues between the mythological Yellow Emperor and his leading officials; Designations is a collection of fifty-four aphorisms expounding the eternal dilemmas of the human condition; Tao the Origin is an essay on the origin of the Tao; The Nine Rulers, the fragmentary fifth text, is a Yin-yang essay that considers the laws of nature which effective rulers must understand and obey. It is the only Yin-yang text which has survived almost whole into the Twentieth Century, and is valuable because its philosophy is basic to the origins of Huang-Lao tradition.Brilliantly translated by Professor Yates and prefaced with his fascinating and informative introduction, Five Lost Classics is as accessible to general readers as it is illuminating to scholars. With the publication of this volume, a document of inestimable value takes its place, after a two thousand year hiatus, in the canon of world literature and philosophy.",
  "genres": [
    "Philosophy",
    "Classics",
    "Taoism",
    "Religion",
    "China"
  ],
  "author": "Robin D.S. Yates",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/472642.Five_Lost_Classics"
}