{
  "title": "The Freedom Writers Diary",
  "description": "#1 NEW YORK TIMES BESTSELLER • The twentieth anniversary edition of the classic story of an incredible group of students and the teacher who inspired them, featuring updates on the students’ lives, new journal entries, and an introduction by Erin Gruwell Now a public television documentary,  Freedom Writers: Stories from the Heart In 1994, an idealistic first-year teacher in Long Beach, California, named Erin Gruwell confronted a room of “unteachable, at-risk” students. She had intercepted a note with an ugly racial caricature and angrily declared that this was precisely the sort of thing that led to the Holocaust. She was met by uncomprehending looks—none of her students had heard of one of the defining moments of the twentieth century. So she rebooted her entire curriculum, using treasured books such as Anne Frank’s diary as her guide to combat intolerance and misunderstanding. Her students began recording their thoughts and feelings in their own diaries, eventually dubbing themselves the “Freedom Writers.” Consisting of powerful entries from the students’ diaries and narrative text by Erin Gruwell,  The Freedom Writers Diary  is an unforgettable story of how hard work, courage, and determination changed the lives of a teacher and her students. In the two decades since its original publication, the book has sold more than one million copies and inspired a major motion picture  Freedom Writers . And now, with this twentieth-anniversary edition, readers are brought up to date on the lives of the Freedom Writers, as they blend indispensable takes on social issues with uplifting stories of attending college—and watch their own children follow in their footsteps.  The Freedom Writers Diary  remains a vital read for anyone who believes in second chances.",
  "genres": [
    "Nonfiction",
    "Education",
    "Memoir",
    "Biography",
    "Teaching",
    "School",
    "Banned Books"
  ],
  "author": "Erin Gruwell",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/47304.The_Freedom_Writers_Diary"
}