{
  "title": "Couch",
  "description": "\"Couch hits on an improbable, even fantastic premise, and then rigorously hews to the logic that it generates, keeping it afloat (at times literally) to the end.\"—Los Angeles Times\"Delightfully lighthearted writing. . . . Occasionally laugh-out-loud funny, the enthusiastic prose carries readers through sporadic dark moments . . . Parzybok’s quirky humor recalls the flaws and successes of early Douglas Adams.\"—Publishers Weekly\"The book succeeds as a conceptual art piece, a literary travelogue, and a fantastical quest.\"—Willamette Week\"Hundreds of writers have slavishly imitated—or outright ripped off—Tolkien in ways that connoisseurs of other genres would consider shameless. What Parzybok has done here in adapting the same old song to a world more familiar to the reader is to revive the genre and make it relevant again\"—The StrangerA Spring Summer Indie Next Reading List Pick: Top 10 Reading Group Suggestions\"Couch follows the quirky journey of Thom, Erik, and Tree as they venture into the unknown at the behest of a magical, orange couch, which has its own plan for their previously boring lives. Parzybok's colorful characters, striking humor, and eccentric magical realism offer up an adventuresome read.\"—Christian Crider, Inkwood Books, Tampa, FLA January 2009 Indie Next List Pick\"This funny novel of furniture moving gone awry is a magical realism quest for modern times. Parzybok's touching story explores the aimlessness of our culture, a society of jobs instead of callings, replete with opportunities and choices but without the philosophies and vocations we need to make meaningful decisions.\"—Josh Cook, Porter Square Books, Cambridge, MA\"A lot of people are looking for magic in the world today, but only Benjamin Parzybok thought to check the sofa, which is, I think, the place it’s most likely to be found. Couch is a slacker epic: a gentle, funny book that ambles merrily from Coupland to Tolkien, and gives couch-surfing (among other things) a whole new meaning.”—Paul La Farge\"One of the strangest road novels you'll ever read. It's a funny and fun book, and it's also a very smart book. Fans of Tom Robbins or Christopher Moore should enjoy this.\"—Handee Books\"It is an upholstered Odyssey unlike any other you are likely to read. It is funny, confusing in places, wild and anarchic. It is part Quixote, part Murakami, part Tom Robbins, part DFS showroom. It has cult hit written all over it.\"—Scott, Me and My Big MouthBenjamin Parzybok on tour: http://booktour.com/author/benjamin_p...In this exuberant and hilarious debut reminiscent of The Life of Pi and Then We Came to the End, an episode of furniture moving gone awry becomes an impromptu quest of self-discovery, secret histories, and unexpected revelations.Thom is a computer geek whose hacking of a certain Washington-based software giant has won him a little fame but few job prospects. Erik is a smalltime con man, a fast-talker who is never quite quick enough on his feet. Their roommate, Tree, is a confused clairvoyant whose dreams and prophecies may not be completely off base. After a freak accident fl oods their apartment, the three are evicted—but they have to take their couch with them. The real problem? The couch—huge and orange—won’t let them put it down. Soon the three roommates are on a cross-country trek along back roads, byways, and rail lines, heading far out of Portland and deep into one very weird corner of the American dream.Benjamin Parzybok is the creator of Gumball Poetry, a journal published through gumball machines, and the Black Magic Insurance Agency, a city-wide mystery/treasure hunt. He has worked as a congressional page, a ghostwriter for the governor of Washington, a web developer, a Taiwanese factory technical writer, an asbestos removal janitor, and a potato sorter. He lives in Portland, Oregon, with the writer Laura Moulton and their two children. Read \"A Reader's Guide and Companion\" to Couch.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Adventure",
    "Book Club",
    "Humor",
    "Magical Realism",
    "Novels"
  ],
  "author": "Benjamin Parzybok",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/4728684-couch"
}