{
  "title": "Virginia Woolf and London: The Sexual Politics of the City",
  "description": "To Virginia Woolf, London was a source of creative inspiration, a setting for many of her works, and a symbol of the culture in which she lived and wrote. In a 1928 diary entry, she observed, \"London itself perpetually attracts, stimulates, gives me a play & a story & a poem, without any trouble, save that of moving my legs through the streets.\" The city fascinated Woolf, yet her relationship with it was problematic. In her attempts to resolve her developmental struggles as a woman write in a patriarchal society, Woolf shaped and reshaped the image and meaning of London.Using psychoanalytic, feminist, and social theories, Susan Squier explores the transformed meaning of the city in Woolf's essays, memoirs, and novels as it functions in the creation of a mature feminist vision. Squier shows that Woolf's earlier works depict London as a competitive patriarchal environment that excluded her, but her mature works portray the city as beginning to accept the force of female energy. Squier argues that this transformation was made possible by Woolf's creative ability to appropriate and revise the masculine literary and cultural forms of her society. The act of writing, or \"scene making,\" allowed Woolf to break from her familial and cultural heritage and recreate London in her own literary voice and vision.Virginia Woolf and London is based on analyses of Woolf's memoirs, her little-known early and mature London essays, Night and Day , Mrs. Dalloway , Flush , and The Years . By focusing on Woolf's changing attitudes about the city, Squier is able to define Woolf's evolving belief that women could \"reframe\" the city-scape and use it to imagine and create a more egalitarian world. Squier's study offers significant new insights into the interplay between self and society as it shapes the work of a woman writer.Originally published in 1985.A UNC Press Enduring Edition -- UNC Press Enduring Editions use the latest in digital technology to make available again books from our distinguished backlist that were previously out of print. These editions are published unaltered from the original, and are presented in affordable paperback formats, bringing readers both historical and cultural value.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Susan Merrill Squier",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/473109.Virginia_Woolf_and_London"
}