{
  "title": "Three Gothic Novels: The Castle of Otranto, Vathek, The Vampyre, and a Fragment of a Novel",
  "description": "One of the most interesting phenomena in the history of literature, the Gothic novel — which flourished from about 1765 to 1825 — still has much to offer to the modern reader. Supernatural thrills, adventure and suspense, colorful settings, and, in the better examples, literary quality are all present. Unfortunately, true Gothic novels (not simply modern detective stories called \"Gothic\") are extremely rare books, and have never been as available as they should be.The first member in this collection, Horace Walpole's The Castle of Otranto , published as a Christmas book for 1764, was the first and one of the greatest members of the genre. It has also been one of the most influential books in history. It motivated the Gothic revival in the arts, and it probably did more to usher in the early-19th-century Romanticism than any other single work. It also served as the model in plot, characterizations, settings, and tone for hundreds, perhaps thousands of successors. Vathek , by the eccentric British millionaire William Beckford, is generally considered to be the high point of the Oriental tale in English literature. Certainly no one has ever written (in any European tongue) a story which better unifies the stirrings of Gothic romanticism with the color, poetry, and vivacity of the original Arabian Nights .The third novel in this collection, John Polidor's Vampyre , emerged from the same soirées of ghost-story telling in Geneva that produced Mary Shelley's Frankenstein . The first full-length vampire story in English, it initiated a very important literary chain that also leads up to the present. Included with Polidori's novel is Lord Byron's little-known Fragment, from which Polidori (who was Byron's physician in Switzerland) plagiarized his plot.These three novels (and the fragment) are still well worth reading. Generations of readers have found thrills and horrors in Walpole's fine work, while Vathek cannot be excelled in its unusual mixture of the bizarre, cruel irony, and masterful narration. Polidori's thriller still conveys chills, and the Fragment makes us all wish that Byron had completed his novel.",
  "genres": [
    "Horror",
    "Gothic",
    "Fiction",
    "Classics",
    "Fantasy",
    "Vampires",
    "Literature"
  ],
  "author": "E.F. Bleiler",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/47404.Three_Gothic_Novels"
}