{
  "title": "Celebutards: The Hollywood Hacks, Limousine Liberals, & Pandering Politicians Who Are Destroying America",
  "description": "Celebutards. A compound of celebrity, debutante, and retard, this blunt term describes lazy and egotistical stars with too much money, fame, leisure time, and media attention, but too little common sense or knowledge, who love to spout off on topics about which they have zero expertise.A longtime observer of the celebutard species, award-winning New York Post columnist Andrea Peyser warns us that, in an age in which fabulousness is too often mistaken for gravitas, we must be ever vigilant of the hypocrites who walk among us. With razor-sharp wit, she explodes the absurdities of the celebutard culture, showing how a dull thinker such as Madonna becomes a self-appointed sage on matters of faith; Rosie O'Donnell transforms from a shrill, gay mom into a physics expert who blames the tragedy of 9/11 on the U.S. government; singer Sheryl Crow urges us to use a single square of toilet paper per wipe while she racks up mileage in her gas-guzzling caravan of SUVs; and hothead Sean Penn morphs into an expert on international diplomacy as he brazenly breaks bread with enemies of his own country like Venezuelan leader Hugo Chavez. Always outspoken, never pulling any punches, Andrea Peyser shows why it's vitally important that these mental midgets and media whores are exposed for the often dangerous phonies they are. In these pages, she gives us everything we need to recognize and uncover celebutards in our midst. \"With an attitude that would frighten James Bond, Andrea Peyser takes on the famous and powerful who are destroying America. Read her book...knowing you are learning something.\"Bill O'Reilly\"With Peyser's trademark slashing wit and keen eye for liberal hypocrisy, CELEBUTARDS is guaranteed to score a direct hit on pampered Hollywood spokes-persons and other great liberal thinkers.\"Ann Coulter\"Andrea Peyser is a godsend, and I can't start my day without her.\"Sean Hannity\"Andrea tells it like it is...she's done a great job.\"Donald Trump\"Andrea Peyser's got a bloodhound's nose for hypocrisy and hijinks that we sorely need these days.\"Jonah Goldberg, New York Times bestselling author of Liberal Fascism\"Andrea Peyser. . .Today's Worst Person in the World!\"Keith Olbermann",
  "genres": [
    "Nonfiction",
    "Politics"
  ],
  "author": "Andrea Peyser",
  "average_rating": "2.89",
  "url": "https://www.goodreads.com/book/show/4743523-celebutards"
}