{
  "title": "L'année dernière à Marienbad",
  "description": "Tout le film est l'histoire d'une persuasion : il s'agit d'une réalité que le héros crée par sa propre vision, par sa propre parole.Cela se passe dans un grand hôtel, une sorte de palace international. Un inconnu erre de salle en salle, longe d'interminables corridors. Son œil passe d'un visage sans nom à un autre visage sans nom. Mais il revient sans cesse à celui d'une jeune femme. Et voilà qu'il lui offre un passé, un avenir et la liberté. Il lui dit qu'ils se sont rencontrés déjà, lui et elle, il y a un an, qu'ils se sont aimés, qu'il revient maintenant à ce rendez-vous fixé par elle-même, et qu'il va l'emmener avec lui.L'inconnu est-il un banal séducteur ? Est-il un fou ? Ou bien confond-il seulement deux visages ? La jeune femme, en tout cas, commence par prendre la chose comme un jeu. Mais l'homme ne rit pas. Obstiné, grave, sûr de cette histoire passée que peu à peu il dévoile, il insiste, il apporte des preuves... Et la jeune femme, peu à peu, comme à regret, cède du terrain. Puis elle prend peur. Elle se raidit. Elle ne veut pas quitter cet autre homme qui veille sur elle et qui est peut-être son mari. Mais l'histoire que l'inconnu raconte prend corps de plus en plus, irrésistiblement, elle devient de plus en plus vraie. Le présent, le passé, du reste, ont fini par se confondre, tandis que la tension croissante entre les trois protagonistes crée dans l'esprit de l'héroïne des phantasmes de tragédie : le viol, le meurtre, le suicide.Puis soudain, elle va céder... Elle a déjà cédé, en fait, depuis longtemps. Après une dernière tentative pour se dérober, elle semble accepter d'être celle que l'inconnu attend, et de s'en aller avec lui vers quelque chose, quelque chose d'innommé, quelque chose d'autre : l'amour, la poésie, la liberté... ou, peut-être, la mort...Ciné-roman, illustré de photogrammes du film réalisé par Alain Resnais (1961).",
  "genres": [
    "Film",
    "France",
    "Fiction",
    "Literature",
    "French Literature",
    "Fantasy",
    "Plays"
  ],
  "author": "Alain Robbe-Grillet",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/4745500-l-ann-e-derni-re-marienbad"
}