{
  "title": "Mungai and the Goa Constrictor",
  "description": "Set in a rainforest of an unspecified continent, Mungai and the Goa Constrictor is a tale littered with colourful and enjoyable characters, conspiracies and unlikely friendships between the species. Told through the eyes of animals the narrative explores the predatory world of deception and greed. The book carries an important missive: ‘Beware of predators in the guise of friends’. Mungai, the central character, is a jungle creature of indeterminate origin, who creates a cunning master plan allowing him to find ways of passing through life without too much cost to himself and as little effort as possible, and at the expense of others not as strong minded or as clever as he is.He goes all out to achieve his objectives, regardless of the consequences, as he sets out to destroy the environment for personal gain.On his travels Mungai encounters an equally ruthless and selfish creature, a boa constrictor called Goa, and together they go in search of innocents to use to implement their designs.They subsequently meet, befriend and manage to convince all manner of creatures to join them in their venture with promises of great rewards in return for small labours. The creatures believe their efforts to be beneficial to the environment and look forward to the promised bounty. Before too long, some notice their hard work continues but the rewards are not forthcoming and they begin to realise, with some input from the good outsiders they have teamed up with, the two legs, that what they are involved in is not good for anyone.Dissatisfaction begins to burgeon and rebellion is fast-approaching.Mungai finds out, all too late, that those he shamelessly inveigled into his plans are not as naive as he first thought and eventually the tables are turned.The perpetrators become the victims as Operation Equinox is devised and executed.",
  "genres": [],
  "author": "A.E. Curzon",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/12460918-mungai-and-the-goa-constrictor"
}