{
  "title": "Spanked by Daddy",
  "description": "Adults Only - contains hardcore, graphic sex, spanking - When Jenny’s stepdad, Steve, catches her sneaking in after a night out with her boyfriend, he goes to her room, intending to punish her. Little does he know that his greatest fantasy is about to come true. Word 8,700“You know I hate it when I have to spank you.” Steve stood at the foot of the bed, watching his pretty, young stepdaughter squirm under her sheets. He had just heard her creaky bedroom window close at 3:31 A.M. And he knew she’d probably sneaked out of the house again. Earlier that day when Steve picked her up from her Aunt Betsy's house he learned of her new penchant for sneaking out, and her new obsession with some loser named Kyle.Jenny took a deep breath. Her whole body trembled with a confusing mixture of fear and excitement. “But Daddy, you know you don't have to spank me.”No, he didn't have to spank her. And he knew it. But it was his pleasure. His privilege. His dick got hard as soon as he heard the sound of her bedroom window closing. He didn't care how late it was. She needed to be punished, and she needed it now. “Honey, you know the rules. It's not just about you sneaking out. It's about that boy.”“I wasn't with him...” she said, her voice quivering. She could tell she was really in big trouble. And the worst part was, nothing really even happened with Kyle, although she wanted it to. Her entire night was such a waste.“Yes you were.” He bluffed. Truthfully, Steve had no idea where his stepdaughter went that night. But he loved to spank her and it had been several months since the last time he got to do it. And the odds were definitely in his favor. If she was with Kyle, it meant she needed punished for sure. Of course, she could lie and say she had to open the bedroom window for fresh air or something. But he knew he could catch her in a lie about Kyle. And he had looked forward to an opportunity like this for quite some time. In fact, when he learned of Kyle earlier that day, he knew his chance might come sooner than expected. It would be the first time he would spank her since her mother died. And the first time since she had turned eighteen.Tears filled Jenny's eyes. “But Daddy...”“Don't you 'but Daddy' me. You know how your Mama would feel about this.” He swallowed. Her mother was a firm believer in corporal punishment, and she always said it didn't matter how old Jenny was – if she needed a spanking, she'd get a spanking. When she was still alive, Nancy had burned her butt over sneaking out of the house on at least one occasion. It was vivid in Steve's mind because he got to witness the whole thing. “And you know how I feel about this.”“But I'm too old...”“No, girl. It don't matter if you're eighteen, twenty, thirty... you live in this house, you get a whippin' when you need it.” Steve grasped his belt buckle. His shirt was long enough to cover his erection, which stood at attention just below the buckle. Damn, he wanted to give her one good walloping. He wanted to show her who the boss was in that house. When she couldn't sit down the next day, he wanted her to remember he was the one who gave her exactly what she needed.“I don't know any other eighteen year olds who get spanked. I think it's illegal.” Naturally, Jenny protested. She had just turned eighteen two months earlier, and Steve had spanked her occasionally ever since he married her mom when she was fifteen. She somehow thought the spankings would stop after her eighteenth birthday. And, especially, after her mom passed on.Steve laughed. “No, darlin'. It ain't how old you are. It's how old you act. And you need to stop running around with that boy. You know he's not good for you.” He unfastened his belt. “And you should know better than to lie to me.”She gulped, watching him undo the belt. She was going to get it really good, and she knew it. Her hand instinctively moved to her perky bottom to shield herself. She hadn't been whipped with a belt in over a year, and her mom had administered that punishment. She could tell from the look in her stepdad's eyes that he meant business. He wanted to blister her good. So why did it make her feel so weird? Even Kyle hadn't turned her on that much.Jenny looked into Steve's eyes. Maybe she could talk him out of it? She grabbed the sheet and pulled it away to expose her tight, young body. She always caught him looking at her. Always. And now she was legal. Maybe it was time to let him have his way, especially if it would get her out of this. “I'm really sorry, Daddy. I wish you'd forgive me.” She deliberately tried to make her voice sound as innocent and sweet as possible.",
  "genres": [
    "Erotica"
  ],
  "author": "Bree Jandora",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/12460970-spanked-by-daddy"
}