{
  "title": "Imperfect Justice: Prosecuting Casey Anthony",
  "description": "Filled with explosive new information, this is the definitive inside story of the case that captivated the nation and the verdict that no one saw comingIt was the trial that stunned America, the verdict that shocked us all. On July 5, 2011, nearly three years after her initial arrest, Casey Anthony walked away, virtually scot-free, from one of the most sensational murder trials of all time. She'd been accused of killing her daughter, Caylee, but the trial only left behind more questions: Was she actually innocent? What really happened to Caylee? Was this what justice really looked like?In Imperfect Justice, prosecutor Jeff Ashton, one of the principal players in the case's drama, sheds light on those questions and much more, telling the behind-the-scenes story of the investigation, the trial, and the now-infamous verdict. Providing an inside account of the case, Ashton, a career prosecutor for the state of Florida, goes where the press and pundits have only speculated, detailing what really happened during the investigation, showing how the prosecution built their case, and explaining how a woman so shrouded in suspicion was proclaimed innocent.Moving beyond the simple explanations, Ashton offers an in-depth look at the complex figure of Casey Anthony, a woman whose lies he spent three years trying to understand. And yet this focus on Casey came with its own risks; here he details how this widespread fixation on Casey—both in the media and in the trial—may have undermined the case itself. As everyone got caught up in the quest to understand the supposed villain, somehow the victim, Caylee, was all but forgotten—not just to the public, but more important, to the jury.Complete with never-before-revealed information about the case and the accused, Ashton examines what the prosecution got right, what they got wrong, and why he remains completely convinced of Casey Anthony's guilt.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Biography",
    "Memoir",
    "Law"
  ],
  "author": "Jeff Ashton",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/12460899-imperfect-justice"
}