{
  "title": "US Army's First, Last, and Only All-Black Rangers: The 2nd Ranger Infantry Company (Airborne) in the Korean War, 1950-1951",
  "description": "Finalist, 2009, Army Historical Foundation Distinguished Book AwardThe 2nd Ranger Infantry Company (Airborne) was the first and only all-black Ranger unit in the history of the United States Army. The company’s life span covered ten months, from selection and training through a seven-month combat deployment in Korea, after which the unit was deactivated. The 2nd and 4th Rangers were among the units initially assigned to the Eighth Army and were considered to be “combat ready.”The 2nd Ranger Company battled North Korean and Communist Chinese Forces near Tangyang, Majori-ri, and Chechon. The 2nd Ranger Company conducted the first airborne assault in Ranger history near the town of Munsan-ni and executed the heroic attack and defense of Hill 581. The men of the 2nd Ranger Company demonstrated courage, served with honor, and achieved a magnificent combat record.Edward Posey’s The US Army’s First, Last, and Only All-Black The 2nd Ranger Infantry Company (Airborne) in the Korea War, 1950-1951 is the first complete history of this elite all-volunteer unit whose members were drawn from the 3rd Battalion of the 505th Airborne Infantry Regiment and the 80th Airborne Anti-Aircraft Battalion. As a member of the unit, Posey bases his account on firsthand experience, official records, interviews with survivors, and other material to produce a rich and worthy addition to the growing literature on the Korean War. Posey’s study explains the obstacles these patriotic men faced, their sacrifices, and their courageous actions on the far side of the world.Finally, more than fifty years after the end of the war, the world will learn the true story of the United States Army’s first, only, and last all-black Ranger unit.About the Master Sergeant (Ret) Edward L. Posey joined the US Army in 1947. After serving with Company L, 3rd Battalion, 505th Airborne Infantry Regiment, he volunteered for airborne training with the Rangers in 1950 and served with distinction in the Korean War (where he was wounded). Sergeant Posey retired from the service in 1969. In 2002, he was inducted in the Ranger Hall of Fame for his dedication to duty and distinguished military career.",
  "genres": [
    "Military Fiction",
    "History",
    "United States",
    "Nonfiction"
  ],
  "author": "Master Sergeant (Ret.) Edward L. Posey",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/4748540-us-army-s-first-last-and-only-all-black-rangers"
}