{
  "title": "A Sudden Wild Magic",
  "description": "Our world has long been protected by \"The Ring\" - a benevolent secret society of witches and conjurers dedicated to the continuance and well-being of humankind. Now, in the face of impending climatic disaster, the Ring has uncovered a conspiracy potentially more destructive than any it has ever had to contend with. For eons, the mages of a neighboring universe have been looting the Earth of ideas, innovations and technologies - all the while manipulating events and creating devastating catastrophes for their own edification. And unless the brazen piracy is halted, our planet is certainly doomed. Aboard a modified city omnibus, a raiding party of adepts is dispatched to Arth, the stronghold of the interfering Pentarchy - a world ruled by magic, ritual and unbending tradition. And while the Inner Ring on Earth battles spies, traitors and the terrifying sendings of an evil, would-be queen, a motley group of commandoes launches a cynical attack on the virtue of the great citadel of Arth - determined to conquer the mighty fortress through internal dissension, psychological sabotage and kamikaze sex. But ultimately the destiny of two separate universes is in the hands of a trio of unlikely champions: a dotty old Earth woman, caretaker to many cats and a bizarre, simianlike familiar...a rebellious heir to the Pentarchy, whose birthright enables him to perform astonishing feats...and Zillah, a beautiful but troubled young mother who unknowingly possesses the wildest, strangest, and most powerful magic of all. A Sudden Wild Magic is a breathtakingly original, consistently delightful blend of fantasy and SF - a surprising, funny and warmly human adventure of wars, worlds and otherworlds that signals the dazzling emergence of a major new talent in the literary field of the fantastic.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Magic",
    "Humor",
    "Science Fiction",
    "Adult"
  ],
  "author": "Diana Wynne Jones",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/47536.A_Sudden_Wild_Magic"
}