{
  "title": "The Devil's Cloth : A History of Stripes",
  "description": "A renowned French scholar takes readers through the social and cultural history of stripes in this imaginative...playful, but learned book that will doubtless have an influence (The New York Times Book Review). From the taboo striped cloaks of the Middle Ages to the liberating stripes of the French and American flags, The Devil's Cloth chronicles the checkered past of this maligned and misunderstood pattern that has been linked to everything from medieval scandals to religious and political uprisings to contemporary fashion statements. The story begins nearly a thousand years ago, when the monks of the Carmelite Order were ordered by the Pope to surrender their striped garments--to superstitious minds a sure sign of the devil. Anti-stripe sentiment raged throughout the Middle Ages, becoming the de rigueur fashion for prostitutes, hangmen, lepers, court jesters, and disloyal Round Table knights. Over the centuries, the list expanded to include Jews, heretics, adulterous wives, madmen, convicts, and servants. Briefly rescued from ignominy by the Renaissance, the stripe enjoyed a resurgence in 1775, where its newly conferred status as an enduring symbol of freedom paved the way for a subsequent European comeback. With lively narrative style, Pastoureau traces the fascinating trajectory of the ubiquitous stripe from the stripe-related stress of biblical figures--Cain, Delilah, and Judas prominent among them--to the bathing suits, pinstripe suits, and pajamas of today. Not even the hapless zebra escapes the skewering lens of history. Whether its subject is horizontal or vertical, stylish or subversive, this richly informative book will appeal to readers of every stripe.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "Fashion",
    "Microhistory",
    "Philosophy",
    "Art History"
  ],
  "author": "Michel Pastoureau; Translator-Jody Gladding",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/474865.The_Devil_s_Cloth_"
}