{
  "title": "Erotic Interludes: Erotic Invitation / Erotic Weekend / Erotic Stranger",
  "description": "Erotic Invitation By Cheyenne McCraySheila Lane burns for Nick Tarantino, but circumstance has forced her to keep the flames locked deep in her heart-and other parts of her anatomy-for three years. Drop-dead gorgeous bosses only fall in love with their administrative assistants in the movies, right? Besides, she's full-figured and plain, nothing like the flawless, cultured females in his world. Still, no other man has existed for Sheila since she met Nick. All her erotic fantasies revolve around being at the mercy of this powerful man and his sexy, commanding voice.When Nick sells Tarantino Investments, Shelia is heartbroken and sure her fantasies will never come true. But when she receives a mysterious invitation, her life changes forever.Erotic Weekend By Cheyenne McCrayAndi Kelly is looking forward to a weekend of uninhibited sex and turning over control to a dominant man for just two days. She's headed to what patrons refer to as \"The Bondage Club\", an exclusive resort catering to those who live the lifestyle of, or wish to experience, BDSM.What she never expects is to meet the man of her dreams-who just happens to be her fellow Vice President of the investment firm she works for, Derrick Macintyre.Derrick has had his eye on Andi for as long as she's worked at the investment firm. When he learns she's planning a weekend at his favorite club, he ensures that she ends up as his sub-and he intends to make her his, for always.Erotic Stranger By Cheyenne McCrayTeri Carter can't remember the last time she had a man who really did anything for her. A corporate lawyer, she travels constantly, and her social life-especially her sex life-is nonexistent. It's beenages since she's been laid, and Teri has a deep, dark fantasy. She wants to spend one erotic night with a stranger.Josh Williams is a BDSM Master who knows a born submissive when he sees one. After just a look at the green-eyed brunette in the hotel bar, he has no doubt he can teach her all about pain, pleasure, and complete submission. What he doesn't expect is what Teri has to teach him.",
  "genres": [
    "Erotica",
    "Erotic Romance",
    "Romance",
    "BDSM",
    "Anthologies",
    "Contemporary Romance",
    "M F Romance"
  ],
  "author": "Cheyenne McCray",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/47485.Erotic_Interludes"
}