{
  "title": "Wild Life",
  "description": "It is the early 1900s and Charlotte Bridger Drummond is a thoroughly modern woman. The sole provider for her five young boys, Charlotte is a fiercely independent, freethinking woman of the West who fully embraces the scientific spirit that is sweeping the nation at the dawn of the industrial age. Thumbing her nose at convention, she dresses in men's clothes, avoids housework whenever possible, and proudly supports her family by writing popular women's adventure stories. Ready to show off her knowledge of the local flora and fauna and have an adventure of her own, Charlotte joins a search party for a child who has disappeared in the deepwood wilderness on the border between Oregon and Washington. But when she gets lost herself, she is thrust into a mysterious world that not only tests her courage but challenges her entire concept of reality.  Starving and half dead from exposure, Charlotte is rescued by a band of elusive, quasi-human beasts. As she becomes a part of the creatures' extended family, Charlotte is forced to reconsider her previous notions about the differences between animals and humans, men and women, and above all, between wilderness and civilization.  Beautifully written and historically accurate, \"Wild Life\" is a highly original tale set at the very edge of civilization, where one woman takes on the untamed world of nature, and in the process, discovers much about the deepest recesses of her very own human nature.  Putting a surprising, revitalizing, feminine spin on the classic legend of Tarzan and other wildman sagas, award-winning novelist Molly Gloss delivers a rich portrait of America's northwestern frontier at the start of the twentieth century.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Historical",
    "Book Club",
    "Science Fiction",
    "Speculative Fiction"
  ],
  "author": "Molly Gloss",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/475582.Wild_Life"
}