{
  "title": "Supercapitalism: The Transformation of Business, Democracy, and Everyday Life",
  "description": "From the greatly admired author of The Work of Nations and The Future of Success , one of America's greatest economic and political thinkers as well as a distinguished public servant in three national administrations, a breakthrough book on the clash between capitalism and democracy.Mid-twentieth-century capitalism has turned into global capitalism, and global capitalism—turbocharged, Web-based, and able to find and make almost anything just about anywhere—has turned into supercapitalism. But as Robert B. Reich makes clear in this eye-opening book, while supercapitalism is working wonderfully well to enlarge the economic pie, democracy—charged with caring for all citizens—is becoming less and less effective under its influence.Reich explains how widening inequalities of income and wealth, heightened job insecurity, and the spreading effects of global warming are the logical outcomes of supercapitalism. He shows us why companies, fighting harder than ever to maintain their competitive positions, have become even more deeply involved in politics; and how average citizens, seeking great deals and invested in the stock market to an unprecedented degree, are increasingly loath to stand by their values if it means biting the hands that feed them. He makes clear how the tools traditionally used to temper America's societal problems—fair taxation, well-funded public education, trade unions—have withered as supercapitalism has burgeoned.Reich sets out a clear course to a vibrant capitalism and a concurrent, equally vibrant democracy. He argues forcefully that the spheres of business and politics must be kept distinct. He calls for an end to the legal fiction that corporations are citizens, as well as the illusion that corporations can be \"socially responsible\" until laws define social needs. Reich explains why we must stop treating companies as if they were people—and must therefore abolish the corporate income tax and levy it on shareholders instead, hold individuals rather than corporations guilty of criminal conduct, and not expect companies to be \"patriotic.\" For, as Reich says, only people can be citizens, and only citizens should be allowed to participate in democratic decision making.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Business",
    "Sociology",
    "History",
    "Finance"
  ],
  "author": "Robert B. Reich",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/476241.Supercapitalism"
}