{
  "title": "Always Coming Home",
  "description": "Ursula K. Le Guin’s magnificent work of imagination, a visionary, genre-crossing story about a future utopian community on the Northern California coast. A masterly, hypnotic and her most consistently lyric and luminous book. This new edition includes an introduction by Shruti Swamy, author of A House is a Body.Midway through her career, Ursula K. Le Guin embarked on one of her most detailed, impressive literary projects, a novel that took more than five years to complete. Blending story and fable, poetry, artwork, and song, Always Coming Home is this legendary writer’s fictional ethnography of the Kesh, a people of the far future living in a post-apocalyptic Napa Valley.Having survived ecological catastrophe brought on by relentless industrialization, the Kesh are a peaceful people who reject governance and the constriction of genders, limit population growth to prevent overcrowding and preserve resources, and maintain a healthy community in which everyone works to contribute to its well-being. This richly imagined story unfolds through a series of narrated “translations” that illuminate individual lives, including a woman named Stone Telling, who travels beyond the Valley and comes to reside with another tribe, the patriarchal Condor people.With sharp poignancy, Le Guin explores the complexities of the Kesh’s unified society and presents to us—in exquisite detail—their lives, histories, adventures, customs, language, and art.  In addition to poems and folk tales, Le Guin created verse dramas, records of oral performances, recipes, and even an alphabet and glossary of the Kesh language. The novel is illustrated throughout with drawings by artist Margaret Chodos and includes a musical component—original recordings of Kesh songs that Le Guin collaborated on with composer Todd Barton—bringing this utterly original and compelling world to life.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Fantasy",
    "Poetry",
    "Speculative Fiction",
    "Classics",
    "Science Fiction Fantasy"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1246232.Always_Coming_Home"
}