{
  "title": "The Lenses of Gender: Transforming the Debate on Sexual Inequality",
  "description": "In this book a leading theorist on sex and gender discusses how hidden assumptions embedded in our cultural discourses, social institutions, and individual psyches perpetuate male power and oppress women and sexual minorities. Sandra Lipsitz Bem argues that these assumptions, which she calls the lenses of gender, shape not only perceptions of social reality but also the more material things―like unequal pay and inadequate daycare―that constitute social reality itself. Her penetrating and articulate examination of these hidden cultural lenses enables us to look at them rather than through them and to better understand recent debates on gender and sexuality.According to Bem, the first lens, androcentrism (male-centeredness), defines males and male experience as a standard or norm and females and female experience as a deviation from that norm. The second lens, gender polarization, superimposes male-female differences on virtually every aspect of human experience, from modes of dress and social roles to ways of expressing emotion and sexual desire. The third lens, biological essentialism, rationalizes and legitimizes the other two lenses by treating them as the inevitable consequences of the intrinsic biological natures of women and men.After illustrating the pervasiveness of these three lenses in both historical and contemporary discourses of Western culture, Bem presents her own theory of how the individual either acquires cultural gender lenses and constructs a conventional gender identity or resists cultural lenses and constructs a gender-subversive identity. She contends that we must reframe the debate on sexual inequality so that it focuses not on the differences between men and women but on how male-centered discourses and institutions transform male-female difference into female disadvantage.",
  "genres": [
    "Gender",
    "Nonfiction",
    "Feminism",
    "Psychology",
    "Academic",
    "Textbooks",
    "Gender and Sexuality"
  ],
  "author": "Sandra Lipsitz Bem",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/475665.The_Lenses_of_Gender"
}