{
  "title": "Seduce Me at Sunrise",
  "description": "From the New York Times bestselling author of Mine Till Midnight comes a dazzling novel about forbidden love and long-denied desire - the kind of passion that happens once in a lifetime . . . perfect for fans of Sarah MacLean, Julia Quinn and Eloisa James.' Lisa Kleypas is the best' Sarah MacLeanHe has tried hard to forget her . . .Kev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation . . . and before long Win is torn from him by a devastating twist of fate.Can she remember the man he once was?Then, Win returns to England . . . only to find that Kev has hardened into a man who will deny love at all costs. Meantime, an attractive, seductive suitor has set his sights on Win. It's now or never for Kev to make his move. But first, he must confront a dangerous secret about his destiny - or risk losing the only woman he has lived for . . .' Kleypas can make you laugh and cry - on the same page' Julia QuinnThe Mine Till MidnightSeduce Me at SunriseTempt Me at TwilightMarried by MorningLove in the AfternoonPraise for Lisa ' Lushly sexy and thoroughly romantic . . . superbly crafted characters and an intriguing plot blend together brilliantly in this splendid romance ' Booklist' Intricately and elegantly crafted, intensely romantic . . . from a not-to-be-missed romance author' Kirkus Reviews' Witty, often hilarious, and delightfully passionate ' Library Journal, starred review'Readers are introduced to the unforgettable characters and their original personalities through a delightful storyline peppered with sharp repartee and steamy sensuality ' RT Book Reviews (top pick)' An unforgettable story peopled with remarkable characters and a depth of emotion that will leave you breathless' Romantic Times BOOKreviews' Is it possible to give a book 6 stars? . . . [This] story has all of the forbidden romance, witty banter, and sigh-inducing declarations of love that you deserve ' That's Normal",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Friends To Lovers",
    "Adult"
  ],
  "author": "Lisa Kleypas",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/4767920-seduce-me-at-sunrise"
}