{
  "title": "How Lincoln Learned to Read: Twelve Great Americans and the Educations That Made Them",
  "description": "An engaging, provocative history of American ideas, told through the educations (both in and out of school) of twelve great figures, from Benjamin Franklin to Elvis Presley.How Lincoln Learned to Read tells the American story from a fresh and unique how do we learn what we need to know? Beginning with Benjamin Franklin and ending with Elvis Presley, author Daniel Wolff creates a series of intimate, interlocking profiles of notable Americans that track the nation's developing notion of what it means to get a \"good education.\" From the stubborn early feminism of Abigail Adams to the miracle of Helen Keller, from the savage childhood of Andrew Jackson to the academic ambitions of W.E.B. Du Bois, a single, fascinating narrative emerges. It connects the illiterate Sojourner Truth to the privileged Jack Kennedy, takes us from Paiute Indians scavenging on western deserts to the birth of Henry Ford's assembly line. And as the book traces the education we value – both in and outside the classroom – it becomes a history of key American ideas.In the end, How Lincoln Learned to Read delivers us to today's headlines. Standardized testing, achievement gaps, the very purpose of public education – all have their roots in this narrative. Whether you're a parent trying to make sure your child is prepared, a teacher trying to do the best possible job, or a student navigating the educational system, How Lincoln Learned to Read offers a challenge to consider what we need to know and how we learn it. Wide-ranging and meticulously researched, built mostly on primary sources, this is an American story that begins and ends with hope.",
  "genres": [
    "Education",
    "Nonfiction",
    "History",
    "Biography",
    "Historical",
    "Teaching"
  ],
  "author": "Daniel Wolff",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/4766940-how-lincoln-learned-to-read"
}