{
  "title": "The Sandman, Vol. 10: The Wake",
  "description": "When Neal Gaiman penned the seventy-fifth issue of The Sandman he made history in two ways. For the first time in comic book history, a profitable on-going series was being brought to a conclusion. More importantly the threads that he began to spin in the very first issue are now brought together and tied together in a loose bundle that wraps the whole package up nicely and yet leaves him the option to slip another present into the bundle at some later date.Sandman: The Wake is comprised of the last six issues of the regular Sandman comic book series. The first three cover the actual wake of Morpheus, King of Dreams. In this story within a story characters from the series meet to remember and pay their respects to the fallen immortal. In eulogies which alternate between respect, praise and villification, the Dream Lord's character is summed up and his flaws laid bare to, literally, all the world.In the final chapter of The Wake the reader is returned to an earlier time in the saga of the Sandman, when an aging \"William Shekespeare\" having just completed his final play \"The Tempest,\" commissioned at the bequest of the Dream Lord, reflects on his life, his struggles, tragedies and a bargain for greatness he made with Morpheus many years earlier. In perhaps the series' most poigniant line, a statement which ironically becomes the Sandman's own epitaph, Morpheus reveals that he made the bargain because\"...I am the King of Stories, but I have no story of my own.\"Carefully balancing melancholy and tragedy with hope and determination the beautifully illustrated and even more beautifully written Sandman: The Wake stands counter to Morpheus' own words and serves as an extrodinary ending to one of the most incredible stories in the history of comics.- Joel Feigenbaum",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Fantasy",
    "Fiction",
    "Graphic Novels Comics",
    "Horror",
    "Comic Book"
  ],
  "author": "Neil Gaiman",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/47723.The_Sandman_Vol_10"
}