{
  "title": "Falling",
  "description": "Hawkins Ranch; Previous Demon LGBT Paranormal Shape-shifterCain Hawkins is a master at suppressing his desires. After all, he's been doing it for over one hundred years. What Cain wants more than anything is a man to love, but he knows that no matter how much he craves it, it can never be. Because Cain is a Naverto demon, and to desire another man is more than forbidden, it is an act that will bring about his execution. So he keeps to himself, working with abused horses on a small patch of land, all on his own. But then his brother makes a request that Cain cannot refuse.Luke Forrester just wants a job and a place where he can recover from the brutal beating he took at the hands of his former boss. He dreams of a place where he can work with the horses that he loves so much. The fact that he's had a crush on Cain Hawkins, his best friend's brother-in-law, for more than two years threatens everything. But Luke's determined not to screw things up. He will do the work and prove to Cain that it wasn't a mistake to hire him, and he won't allow the fact that he desires something more with Cain to interfere with his work one bit.But working and living in such close proximity can test the best of intentions, and when one kiss leads to something much, much more, Cain must open himself in a way that he never has before. He must trust Luke completely and tell him everything about who and what he is. And together, they must find a way to fight for Cain's humanity and save him from his demon clan before he is found out and they are ripped apart forever.Publisher's This book contains explicit sexual content, graphic language, and situations that some readers may find male/male sexual practices (anal/oral sex) and strong violence.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Westerns",
    "Romance",
    "Demons",
    "Fantasy",
    "Shapeshifters"
  ],
  "author": "Cameron Dane",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/4770964-falling"
}