{
  "title": "Saving Paradise: How Christianity Traded Love of This World for Crucifixion and Empire",
  "description": "When Rita Brock and Rebecca Parker began traveling the Mediterranean world in search of art depicting the dead, crucified Jesus, they discovered something that traditional histories of Christianity and Christian art had underplayed or sought to explain it took Jesus Christ a thousand years to die.During their first millennium, Christians filled their sanctuaries with images of Christ as a living presence in a vibrant world. He appears as a shepherd, a teacher, a healer, an enthroned god; he is an infant, a youth, and a bearded elder. But he is never dead. When he appears with the cross, he stands in front of it, serene, resurrected. The world around him is ablaze with beauty. These are images of paradise-paradise in this world, permeated and blessed by the presence of God.But once Jesus perished, dying was virtually all he seemed able to do.Saving Paradise offers a fascinating new lens on the history of Christianity, from its first centuries to the present day, and asks how its early vision of beauty evolved into one of torture. In tracing the changes in society and theology that marked the medieval emergence of images of Christ crucified, Saving Paradise exposes the imperial strategies embedded in theologies of redemptive violence and sheds new light on Christianity's turn to holy war. It reveals how the New World, established through Christian conquest and colonization, is haunted by the loss of a spiritual understanding of paradise here and now.Brock and Parker reconstruct the idea that salvation is paradise in this world and in this life, and they offer a bold new theology for saving paradise. They ground justice and peace for humanity in love for the earth and open a new future for Christianity through a theology of redemptive beauty.",
  "genres": [
    "History",
    "Religion",
    "Theology",
    "Nonfiction",
    "Spirituality",
    "Christianity",
    "Church History"
  ],
  "author": "Rita Nakashima Brock",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/477107.Saving_Paradise"
}