{
  "title": "From the Ashes of Angels: The Forbidden Legacy of a Fallen Race",
  "description": "Provides convincing evidence that angels, demons, and fallen angels were flesh-and-blood members of a giant race predating humanity, spoken of in the Bible as the Nephilim. • Indicates that the earthly paradise of Eden was a realm in the mountains of Kurdistan. • By the author of Gateway to Atlantis. Our mythology describes how beings of great beauty and intelligence, who served as messengers of gods, fell from grace through pride. These angels, also known as Watchers, are spoken of in the Bible and other religious texts as lusting after human women, who lay with them and gave birth to giant offspring called the Nephilim. These religious sources also record how these beings revealed forbidden arts and sciences to humanity--transgressions that led to their destruction in the Great Flood. Andrew Collins reveals that these angels, demons, and fallen angels were flesh-and-blood members of a race predating our own. He offers evidence that they lived in Egypt (prior to the ancient Egyptians), where they built the Sphinx and other megalithic monuments, before leaving the region for what is now eastern Turkey following the cataclysms that accompanied the last Ice Age. Here they lived in isolation before gradually establishing contact with the developing human societies of the Mesopotamian plains below. Humanity regarded these angels--described as tall, white-haired beings with viperlike faces and burning eyes--as gods and their realm the paradise wherein grew the tree of knowledge. Andrew Collins demonstrates how the legends behind the fall of the Watchers echo the faded memory of actual historical events and that the legacy they have left humanity is one we can afford to ignore only at our own peril.",
  "genres": [
    "History",
    "Nonfiction",
    "Alternate History",
    "Conspiracy Theories",
    "Ancient History",
    "Religion",
    "Philosophy"
  ],
  "author": "Andrew Collins",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/477311.From_the_Ashes_of_Angels"
}