{
  "title": "Art for Art's Sake",
  "description": "In the quaint, sleepy college town of Huntsville, history has an eerie way of repeating itself generation after generation... When in-the-closet college student Matthew Rhodes arrives at the old building in the town's historical district, little does he realize his life is about to take a sudden and dramatic turn. He is certainly prepared to earn extra income by posing nude for erotica artist Skylar Novak, and definitely anxious to discover if the sexy and reclusive man has an interest in him other than one of an artistic nature. But things get complicated when Matthew meets a handsome stranger lurking outside the artist's door. A stranger who has a sudden and compelling effect on him before disappearing in the blink of an eye. Matthew and Skylar quickly discover they share both an uncontrollable and supernatural bond with each other, leading to a red-hot and steamy affair, but they also realize they are mysteriously linked to the stranger. Is he even a man at all, or could he be an entity from another plane of existence who has lecherous designs of his own? And could his connection to Matthew and Skylar have historical significance, involving an elaborate and desperate plan that has miserably failed every generation for centuries? Before the situation can drive him insane, Matthew is determined to open his mind to new possibilities and learn the whole truth. But in doing so, will his burgeoning love and unquenchable sexual appetite for Skylar, the man of his dreams, suffer in the process? Or will his actions secure their love for eternity? Gay / Contemporary / The Arts / Paranormal / Ghosts / Hauntings / Romantic Comedy / Voyeurism / Menage (M/M/M) / Group Sex",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Paranormal",
    "Romance",
    "Erotica",
    "Fantasy",
    "Supernatural"
  ],
  "author": "Karma Eastwick",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/4777977-art-for-art-s-sake"
}