{
  "title": "The Book of Spirits",
  "description": "In his first novel, the national bestselling The Book of Shadows ,James Reese beguiled readers with a boldly imaginative, darkly erotic tale of awakening that introduced the captivating and deeply unusual Herculine. Now this extraordinary writer continues Herculine's incredible journey of self-discovery -- a search that will lead her into a world of shadows and perils, where she will taste the forbidden and find redemption. September 1826. Taught to trust ... and to learn by a quartet of remarkable saviors, Herculine is bound for America, leaving behind a strange and violent past in France for an uncertain future in an exotic new land. Arriving in Virginia, Herculine is led by fate to Mother-of-Venus, a mysterious old slave woman who is blessed with gifts both terrifying and strange, and to a young poet named Edgar Poe who is haunted by evils of the past. Under the mystical guidance of Mammy Venus, Herculine soon calls upon her powerful legacy to rescue Celia, a beautiful, damaged slave. Landing in the coastal wilds of Florida, Celia stirs passions -- and dark, otherworldly powers -- within Herculine, propelling them into an erotic obsession that only the missing witch Sebastiana d'Azur can break. Hope comes in a missive that will lure the desperate Herculine north, to the chaotic streets of New York and a strange, magical house in which the confused and eager witch is accepted by a band of like-minded sisters and introduced to exquisite carnal pleasures. Finally loosed from the shackles of shame and desire, Herculine heads south once again to find salvation and fulfill her destiny. Set in a time of promise and peril, bondage and bloodshed, James Reese's lush, richly atmospheric, and beautifully told tale shatters the boundaries between the living and the dead, the magical and the ordinary, the imagined and the historical. A novel of the mind and the senses, The Book of Spirits is a mesmerizing and unforgettable work from an exceptional talent.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Paranormal",
    "Historical Fiction",
    "Historical",
    "Horror",
    "Dark Fantasy"
  ],
  "author": "James Reese",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/1246409.The_Book_of_Spirits"
}