{
  "title": "Economics in One Lesson 1st edition by Henry Hazlitt (2008) Hardcover",
  "description": "Here is a publishing event: the new Mises Institute edition of the classic book that has taught many millions sound economic thinking. It is a hardbound volume, priced very low thanks to special benefactors, and now available in quantity discounts for distribution to your friends, family, and anyone you meet who needs to understand what economics implies for the society, government, and civilization.Henry Hazlitt wrote this book following his stint at the New York Times as an editorialist. His hope was to reduce the whole teaching of economics to a few principles and explain them in ways that people would never forget. It worked. He relied on some stories by Bastiat and his own impeccable capacity for logical thinking and crystal-clear prose.He was writing under the influence of Mises himself, of course, but he brought his own special gifts to the project. As just one example, this is the book that made the idea of the \"broken window fallacy\" so famous.What thrills us in particular about this new edition is that it is beautiful, it is hardcover, and it is newly typeset for modern readers. It has a full index. It includes a wonderful foreword by Walter Block. It's the right size, shape, and feel – perfect for making this book central to all educational efforts of the future.This is the book to send to reporters, politicians, pastors, political activists, teachers, or anyone else who needs to know.Professor Block explains that it was this book that turned him on to economics as a science. He believes that it is probably the most important economics book ever written in the sense that it offers the greatest hope to educating everyone about the meaning of the science.Written for the non-academic, it has served as the major antidote to fallacies in the popular press, and has appeared in dozens of languages and printings. It's still the quickest way to learn how to think like an economist. And this is why it has been used in the best classrooms more than sixty years.Many writers have since attempted to beat this book as an introduction, but have never succeeded. Hazlitt's book remains the best. Even if you own this book already, or have several past editions, you will want to have this book as your own as a wonderful testament to its place in the world of ideas.In putting this edition together, we chose to work from Hazlitt's own first edition because it contains the core of what is crucial here without later updates that only date the book. As with Mises and Human Action, the author's first instincts were the best ones.Contents:    * Part One: The Lesson    * Part Two: The Lesson Applied        o The Broken Window        o The Blessings of Destruction        o Public Works Mean Taxes        o Taxes Discourage Production        o Credit Diverts Production        o The Curse of Machinery        o Spread-the-Work Schemes        o Disbanding Troops and Bureaucrats        o The Fetish of Full Employment        o Who's \"Protected\" by Tariffs?        o The Drive for Exports        o \"Parity\" Prices        o Saving the X Industry        o How the Price System Works        o \"Stabilizing\" Commodities        o Government Price-Fixing        o Minimum Wage Laws        o Do Unions Really Raise Wages?        o \"Enough to Buy Back the Product\"        o The Function of Profits        o The Mirage of Inflation        o The Assault on Savings        o The Lesson Restated",
  "genres": [
    "Economics",
    "Nonfiction",
    "Business",
    "Politics",
    "Finance",
    "Philosophy",
    "History"
  ],
  "author": "Henry Hazlitt",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/4784218-economics-in-one-lesson-1st-edition-by-henry-hazlitt-2008-hardcover"
}