{
  "title": "There Goes the Neighborhood: Racial, Ethnic, and Class Tensions in Four Chicago Neighborhoods and Their Meaning for America",
  "description": "A stunning, long-awaited book that looks at the (still) shocking truths of race, ethnicity, and class in America today.William Julius Wilson, among our most admired sociologists and urban policy advisers, author of When Work Disappears (\"Profound and disturbing,\" Time; \"His magnum opus,\" David Remnick, The New Yorker), and Richard P. Taub, chairman of the Department on Comparative Human Development at the University of Chicago, spent three years with a group of researchers studying four working- and lower-middle-class Chicago neighborhoods: African American, white ethnic, Latino, and one in transition from white ethnic to Latino.Their focus: to understand how and why certain urban residents react to looming racial, ethnic, or class changes, and what their reactions mean in terms of the stability of their neighborhood.Using first-person narratives and interviews throughout, There Goes the Neighborhood gives voice to attitudes and realities few Americans are willing to look at. Their findings lay bare a disturbing and incontrovertible truth: that the American dream of racial integration, forty-two years after the passage of the Civil Rights Act, still eludes us - and, in fact, may not happen in the foreseeable future.The authors examine the ways in which forces that contribute to strong neighborhoods work against the idea of integration. They explain why residents of neighborhoods with weak social organizations often choose to move rather than confront unwanted ethnic or racial change. Finally, the authors make clear that the racial and ethnic tensions that have become all but inherent to urban neighborhoods have urgent implications for Americans at every level of society.Groundbreaking, authoritative, eye-opening, and certain to rekindle, and permanently alter, the discussion of race relations in our time.",
  "genres": [
    "Sociology",
    "Race",
    "Nonfiction",
    "Urban Studies",
    "Politics",
    "History",
    "Cities"
  ],
  "author": "William Julius Wilson",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/4784.There_Goes_the_Neighborhood"
}