{
  "title": "Keeping the House",
  "description": "Set in the conformist 1950s and reaching back to span two world wars, Ellen Baker’s superb novel is the story of a newlywed who falls in love with a grand abandoned house and begins to unravel dark secrets woven through the generations of a family. Like Whitney Otto’s How to Make an American Quilt in its intimate portrayal of women’s lives, and reminiscent of novels by Elizabeth Berg and Anne Tyler, Keeping the House is a rich tapestry of a novel that introduces a wonderful new fiction writer.When Dolly Magnuson moves to Pine Rapids, Wisconsin, in 1950, she discovers all too soon that making marriage work is harder than it looks in the pages of the Ladies’ Home Journal . Dolly tries to adapt to her new life by keeping the house, supporting her husband’s career, and fretting about dinner menus. She even gives up her dream of flying an airplane, trying instead to fit in at the stuffy Ladies Aid quilting circle. Soon, though, her loneliness and restless imagination are seized by the vacant house on the hill. As Dolly’s life and marriage become increasingly difficult, she begins to lose herself in piecing together the story of three generations of Mickelson men and Wilma Mickelson, who came to Pine Rapids as a new bride in 1896 and fell in love with a man who was not her husband; her oldest son, Jack, who fought as a Marine in the trenches of World War I; and Jack’s son, JJ, a troubled veteran of World War II, who returns home to discover Dolly in his grandparents’ house.As the crisis in Dolly’s marriage escalates, she not only escapes into JJ’s stories of his family’s past but finds in them parallels to her own life. As Keeping the House moves back and forth in time, it eloquently explores themes of wartime heroism and passionate love, of the struggles of men’s struggles with fatherhood and war and of women’s conflicts with issues of conformity, identity, forbidden dreams, and love.Beautifully written and atmospheric, Keeping the House illuminates the courage it takes to shape and reshape a life, and the difficulty of ever knowing the truth about another person’s desires. Keeping the House is an unforgettable novel about small-town life and big matters of the heart.Advance praise for Keeping the House“Ellen Baker’s first novel is a wonder! Keeping the House is a great big juicy family saga, a romantic page-turner with genuine characters written with a perfect sense of history, time, and place. Her portrayal of the American housewife is hilarious and heartbreaking. I couldn’t have liked it more!”–Fannie Flagg, author of Can’t Wait to Get to Heaven“Ellen Baker’s first novel, Keeping the House, is a quilt that grids a small Midwestern town in the middle of the last century. Under this writer’s deft hands, each square is a story, a mystery, an indiscretion, a tale of the great house and grand family who once ruled there. Even more, it captures the roles of women both the living embodiments of demure ideals, and those who couldn’t fit the pattern. Edith Wharton’s novels of domestic despair and display come to mind with each page.”–Jacquelyn Mitchard, author of The Deep End of the Ocean“A born storyteller, Ellen Baker has written an enthralling family saga filled with three generations of memorable characters and capturing the dreams and frustrations of twentieth-century women in wonderful, spot-on historical detail.”–Faith Sullivan, author of Gardenias and The Cape Ann“Ellen Baker has written the novel I’ve been waiting to read for a very long time. It’s the book you want to curl up with, the book you rush home to, the book you wish you’d written. In Keeping the House , she serves up the complexities of family relationships, the anguish of victims of wars, the innermost thoughts of women, and the social mores of the past. Seasoned with mysteries that kept me devouring pages, this is one huge gourmet feast of a book for readers to savor. I look forward to every delicious book this author writes.”–Bev Marshall, author of Walking Through Shadows and Right as Rain",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Chick Lit",
    "Mystery",
    "Audiobook"
  ],
  "author": "Ellen Baker",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/478614.Keeping_the_House"
}