{
  "title": "Through Violet Eyes",
  "description": "“A fast, smart novel, brighter than a meteor and twice as scary. Stephen Woodworth provides shocks and thoughts in equal measure, and climbs right to the top!”—Greg Bear In a world where the dead can testify against the living, someone is getting away with murder. Because to every generation are born a select few souls with violet-colored eyes, and the ability to channel the dead. Both rare and precious—and rigidly controlled by a society that craves their services—these Violets perform a number of different duties. The most fortunate increase the world's cultural heritage by channeling the still-creative spirits of famous dead artists and musicians. The least fortunate aid the police and the law courts, catching criminals by interviewing the deceased victims of violent crime.But now the Violets themselves have become the target of a brutal serial murderer—a murderer who had learned how to mask his or her identity even from the victims. Can the FBI, aided by a Violet so scared of death that she is afraid to live, uncover the criminal in time? Or must more of her race be dispatched to the realm that has haunted them all since childhood?Praise for Through Violet Eyes“Chilling . . . shades of  Minority Report  and  The Eyes of Laura Mars  . . . tantalizing puzzle rife with red herrings, one made all the more entertaining by brisk pacing and strong internal logic.” —Publishers Weeklya“Wow . . . one cool idea and Stephen Woodworth makes it work like fine oiled machinery. Full of energy and suspense,  Through Violet Eye s is a great and original first novel. I look forward to his next.” —Joe R. Lansdale “An eerie and compelling page-turner that maps the terra incognita between the living and the dead, loss and redemption, desire and grief, at the same time exploring what it means to be human in a frightening otherworld that too closely evokes our own reality.” —Elizabeth Hand",
  "genres": [
    "Mystery",
    "Paranormal",
    "Thriller",
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Horror"
  ],
  "author": "Stephen Woodworth",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/478628.Through_Violet_Eyes"
}