{
  "title": "The Kindness Handbook: A Practical Companion",
  "description": "A friend criticizes you. You grow impatient with someone you're trying to help. A cell phone user annoys you on a train. Would your first response to these situations be kindness? In The Kindness Handbook, Sharon Salzberg explores with insight and clarity how kindness for ourselves and others can be the quality we choose to steer our lives by.From the foundation of this transformative practice and its entry point through you, to its daily expression in your life, this book features a thoughtful collection of anecdotes, stories, and practical tools to inspire kindness for any life situation. The Kindness Handbook is your personal companion to explore the rich landscape of kindness-and help you see just how it might shift and open up your life to greater joy, meaning, and compassion.\"For kindness to be more fully realized, it needs to be distinguished from being ineffectual or meek. It also needs to be infused with wisdom, supported by courage, and threaded with balance.\"-Sharon Salzberg, author of The Kindness Handbook\"This book is like having Sharon and her gentle wisdom on call, 24-7, to remind you that in every moment, kindness can make a huge difference in how the next moment unfolds, in yourself and in others. This simple practice will light up and lighten your life.\"-Jon Kabat-Zinn, author of Coming to Our Senses and Arriving at Your Own Door\"Sharon Salzberg is a powerful teacher of the enduring value of kindness. Here she brings her teachings to us in a beautiful and accessible form through moving stories and powerful exercises. The world needs more kindness. Sharon is showing us the way.\"-Roshi Joan Halifax, abbot at the Upaya Zen Center\"With the deep wisdom gained by her many years of dharma practice and the greatness of her Being, Sharon leads us gently with confident strength and inspiration down the path to true happiness and love. Sleep with this book under your pillow!\"-Krishna Das, author of Flow of Grace",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Buddhism",
    "Self Help",
    "Personal Development",
    "Psychology"
  ],
  "author": "Sharon Salzberg",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/4781342-the-kindness-handbook"
}