{
  "title": "Daughters of Joy, Sisters of Misery: Prostitutes in the American West, 1865-90",
  "description": "They were called \"frail sisters,\" \"fallen angels,\" \" filles de Joie, \" \"soiled doves,\" \"queens of the night,\" and \"whores.\" They worked the seamy brothels, saloons, cribs, streets, and \"hog ranches\" of the American frontier. They were the prostitutes of the post-Civil War West. Daughters of Joy, Sisters of Misery details the destitute lives of these nearly anonymous women. Anne Butler reveals who they were, how they lived and worked, and why they became an essential element in the development of the West's emerging institutions. Her story bears little resemblance to the popular depictions of prostitutes in film and fiction. Far removed from the glittering lives of dancehall girls, these women lived at the boarders of society and the brink of despair. Poor and uneducated, they faced a world where scarce jobs, paltry wages, and inflated prices made prostitution a likely if bitter choice of employment. At best their daily lives were characterized by fierce economic competition and at worst by fatal violence in the hands of customers, coworkers, or themselves. They were scorned and attacked by the legal, military, church, and press establishments; nevertheless, as Butler shows, these same institutions also used prostitutes as a means for maintaining their authority and as a lure for economic development. Daughters of Joy, Sisters of Misery is based on an enormous amount of research in more than twenty repositories in Wyoming, Arizona, Texas, Colorado, New Mexico, and Kansas. Using census lists, police dockets, jail registers, military correspondence, trial testimony, inquests, court martials, newspapers, post return, and cemetery records, Butler illuminates the dark corners of a dark profession and adds much to our knowledge of both western and women's history.",
  "genres": [
    "History",
    "Nonfiction",
    "Sex Work",
    "19th Century",
    "American History"
  ],
  "author": "Anne M. Butler",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/47842.Daughters_of_Joy_Sisters_of_Misery"
}