{
  "title": "أشياء لن تسمع بها أبدا",
  "description": "الشعور الذي ستخرج به من قراءتك لنعوم تشومسكي هو الغضب، غضب هائل، مرارة كبيرة، ما يفعله تشومسكي لقارئه هو هدم وإعادة بناء أفكاره حول السياسة، الاقتصاد والتاريخ، هذا الهدم يذرو معه الكثير من الأفكار التي لطالما قرأناها وظننا أننا بها أمسكنا بشيء من المعرفة الاقتصادية أو السياسية، تشومسكي يظهر لنا مقدار التزييف الذي مورس ويمارس دائما ً على هذه الأفكار وعلى التاريخ. يعتبر تشومسكي الذي تجاوز الآن الثمانين عاما ً، أكثر من يقتبس منهم من المؤلفين الأحياء، حيث تعمر كلماته كتابات الآلاف حول العالم، ألف قرابة المائة كتاب، في المجالات التي ينشط فيها وهي علم اللغويات - تخصصه الأساس - وفي السياسة والفلسفة. تتناول هذه المجموعة موضوعات متنوعة، من العولمة، إلى السياسة الأمريكية تجاه إيران، إلى الحرب على العراق، والتغيير الاجتماعي، الفرق ما بين أوباما وبوش، الرأسمالية، انبعاث الجنوب، الحزب الواحد في أمريكا، الطبيعة الإنسانية، اللغة والثقافة، مستقبل الديمقراطية، الدين والسياسة، إسرائيل والهولوكوست، المثقفون، والأزمة الاقتصادية. سأعرض فيما يأتي بعض آراء تشومسكي، والكتاب كله آراء مثيرة، ومخالفة للسائد، يعيبه فقط الترجمة الركيكة والمليئة بالأخطاء. عن العولمة يقول تشومسكي \"للبيان والتاريخ أنا أؤيد العولمة\" ولكنه يفرق بين العولمة المطروحة الآن والتي يرى أنها وسيلة الأغنياء لنهب ما تبقى لدى الفقراء، وتدعيم سلطتهم على العالم، ويوضح أن العولمة التي يدعو إليها هي \"العولمة التي تضع حقوق الناس الذين هم من لحم ودم على رأس أولوياتها\". فيما يخص السياسة الأمريكية تجاه إيران، يذكر تشومسكي بتأييد كسينجر لحصول إيران على طاقة نووية عندما كانت خاضعة لأمريكا في عهد الشاه، والرفض الحالي للفكرة، والذي برره كسينجر ذاته بأن الإيرانيون \"كانوا دولة حليفة\" !! وتشومسكي في هذا الكتاب وكتب أخرى يبرهن مرارا ً وتكرارا ً على أن أمريكا وإسرائيل لا تلتزمان بأي قانون يخالف مصالحهما، حتى ولو كان هذا القانون إنساني ومدعوم عالميا ً، وهو ينثر الأمثلة حول هذا في كل مكان. يحتوي الكتاب على مقالين مهمين جدا ً لنا كعرب ومسلمين الأول عن الإرهاب الأمريكي والإسرائيلي، والثاني عن الهجوم على الفلوجة، وأسلوب تشومسكي في هذه المقالات ليس الإدانة فقط من خلال ذكر الأحداث، وإنما المقارنة بأفعال تاريخية تم تجريمها، ليفضح النفاق والوجه الأسود لأمريكا وإسرائيل ..لتحميل الكتابhttp://www.4shared.com/office/uNI9qbR...أوhttp://www.2shared.com/document/DEslz...",
  "genres": [
    "Politics",
    "Nonfiction",
    "Philosophy"
  ],
  "author": "Noam Chomsky",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/12465812"
}