{
  "title": "Return To Rome: Confessions of an Evangelical Catholic",
  "description": "What does it mean to be evangelical? What does it mean to be Catholic? Can one consider oneself both simultaneously? Francis Beckwith has wrestled with these questions personally and professionally. He was baptized a Catholic, but his faith journey led him to Protestant evangelicalism. He became a philosophy professor at Baylor University and president of the Evangelical Theological Society (ETS). And then, in 2007, after much prayer, counsel, and consideration, Beckwith decided to return to the Catholic church and step down as ETS president.This provocative book details Beckwith's journey, focusing on his internal dialogue between the Protestant theology he embraced for most of his adult life and Catholicism. He seeks to explain what prompted his decision and offers theological reflection on whether one can be evangelical and Catholic, affirming his belief that one can be both.EXCERPTIt's difficult to explain why one moves from one Christian tradition to another. It is like trying to give an account to your friends why you chose to pursue for marriage this woman rather than that one, though both may have a variety of qualities that you found attractive. It seems to me then that any account of my return to the Catholic church, however authentic and compelling it is to me, will appear inadequate to anyone who is absolutely convinced that I was wrong. Conversely, my story will confirm in the minds of many devout Catholics that the supernatural power of the grace I received at baptism and confirmation as a youngster were instrumental in drawing me back to the Mother Church. Given these considerations, I confess that there is an awkwardness in sharing my journey as a published book, knowing that many fellow Christians will scrutinize and examine my reasons in ways that appear to some uncharitable and to others too charitable.",
  "genres": [
    "Theology",
    "Catholic",
    "Religion",
    "Faith",
    "Christianity",
    "Biography",
    "Nonfiction"
  ],
  "author": "Francis J. Beckwith",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/4790007-return-to-rome"
}