{
  "title": "The Pawprints of History: Dogs and the Course of Human Events",
  "description": "The Pawprints of History shines a new light on a favorite subject -- the relationship between humans and their four-legged best friends. Stanley Coren, a renowned expert on dog-human interactions, has combed the annals of history and found captivating stories of how dogs have lent a helping paw and influenced the actions, decisions, and fates of well-known figures from every era and throughout the world.As history's great figures strut across the stage, Coren guides us from the wings, adoringly picking out the canine cameos and giving every dog of distinction its day. In this unparalleled chronicle, we see how Florence Nightingale's chance encounter with a wounded dog changed her life by leading her to the vocation of nursing. We learn why Dr. Freud's Chow Chow attended all of his therapy sessions and how the life of the Fifth Dalai Lama was saved by a dog who shared his bed. Dogs have even found their way to the battlefield -- great military leaders such as Robert the Bruce and Omar Bradley have shared their lives, exploits, and gunfire with dogs. From Wagner, who admitted that one of the arias in the opera Siegfried was \"written\" by one of his dogs, to the dogs that inspired and lived with Presidents Lincoln, Roosevelt, Johnson, and Clinton, these loving canines do double duty as loyal pets and creative muses.From war to art, across the spectrum of human endeavor and achievement, there often stands, not only at his side but leading the way, man's beloved \"best friend.\" For those who believe that behind every great person is a good dog, the uplifting stories in The Pawprints of History will be a lasting delight.",
  "genres": [
    "Dogs",
    "History",
    "Animals",
    "Nonfiction",
    "Microhistory",
    "Historical",
    "Nature"
  ],
  "author": "Stanley Coren",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/479636.The_Pawprints_of_History"
}