{
  "title": "Because You Loved Me.. : I Don't Mind Falling In Love, All Over Again",
  "description": "Book Summary of Because You Loved Me.. : I Don't Mind Falling In Love, All Over Again???...because falling in love is literally like falling'India 2009 : the board exams are around the corner for one last time for all students of class 10. And amongst those who'd be appearing for them, exists a certain Ritesh Garg whose idea of an ideal life is soon to take a beating.His aim in life is simple : get the love of his life. But is it as simple as it seems to be?May be not... Ritesh wants Aarushi. But does Aaurshi wan Ritesh?Radhika Aunty wants Aarushi to get grades good enough to secure a science stream in 11. But she doesn't want Ritesh in her daughter's Life. Aarushi's brother, Aryan wants Ritesh to suffer but doesn't want his sister to be unhappy.Laharry wants to romanticize Mathematics but Gupta wants his Students to be oriented towards physics.Pallu wants Shreelekha but Shreelekha has her fulfilments to meet.Amidst these ???wants' and don't wants' Lies Ritesh's battle in securing what he lost once. His journey of resurrecting his love story will be challenged at every stage. Be it financial insecurities or dangerous accidents, troubles will be there galore.Would Ritesh survive to tell the tale? Or would he simply fail?It's time to find out........About the AuthorA Kolkatan by profession and a freelance North Indian, it took Ritwik Mallik a journey of nearly 1400 Km to discover the writer in him. An avid reader and debater, his first trysts with writing started at the age of four in the form of articles for the school magazine.Described as someone who is nice to his friends and even nicer to his enemies; his attraction to junk food is quite well expressed in his stories (his eyes hurt at the sight of healthy food). A passionate slacker when it came to academics, most part of his school life had been spent in balancing studies an co-curricular activities. A;; he dreams of is touching the sky with his feet firmly on the ground.His is the author of the bestselling novel ???Love Happens Like That'",
  "genres": [],
  "author": "Ritwik  Mallik",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/12466561-because-you-loved-me"
}