{
  "title": "To Destroy You Is No Loss: The Odyssey of a Cambodian Family",
  "description": "This amazing book was written by California author Joan Criddle, who has done a remarkable job in simulating the words of a Cambodian-American, Silicon Valley computer programmer Teeda Butt Mam, the daughter of a Lon Nol minor government official. When Phnom Pehn fell, Teeda was fifteen years old and attending an English school in the city. As a pampered child of a well-to-do urban family, she was not prepared to endure the hardships and the horrors which she would soon be forced to experience.Upon the defeat of the Lon Nol Khmer Republic, Pol Pot founded Democratic Kampuchea and launched the economic plan of his French-trained associate, Khieu Samphan, who held that land was the source of all wealth. Khieu spurned technological and industrial development. According to him, only agricultural abundance and high prices for agricultural products could create economic prosperity. He viewed the Cambodian peasant as a “natural man” whose knowledge of agriculture was a sufficient education for anyone if supplemented with an elementary knowledge of reading, writing, and arithmetic. He also believed that educated urbanites had been so corrupted by Western ideas and values that they were a “useless” entity in the economic body unless they could be successfully re-educated --brainwashed -- and transformed into ideologically correct peasants; otherwise, he believed they should be destroyed, not being any “loss” to the country. Khieu’s plan was designed to be put into effect with “ruthless force.” And it was.As terrible, as horrible, as depressing as it is to learn how political and economic extremism can distort human perception and turn men into beasts, Teeda’s story is at the same time absorbing, edifying, and ennobling--even hopeful. She and her family are exemplars of human courage, determination, and resourcefulness. After four years spent in slave labor and another year in a frustrating attempt to escape with her family to the United States, their spirit of liberty was never crushed. If their destruction was “no loss” to the Khmer Rouge, their preservation has been a decided gain for the citizenry of the United States",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Memoir",
    "Book Club",
    "Read For School",
    "Asia"
  ],
  "author": "Joan D. Criddle",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/480258.To_Destroy_You_Is_No_Loss"
}