{
  "title": "Tool and Die",
  "description": "Jacobia “Jake” Tiptree traded her power-broker life for a run-down dream house in peaceful Eastport, Maine. But the do-it-yourself enthusiast is learning that no matter how carefully you build your home, murder has a way of slipping in through the cracks….It’s a bright June afternoon and old-house-fixer-upper Jake Tiptree is driving through downeast Maine on an unusual errand. She’s getting ready to interview a large, angry man with a criminal history. Jim Diamond may or may not be harassing his ex-wife with life-threatening letters, but Jake promised her new housekeeper, Bella Diamond, she’d look into the matter. An ex-con and a deadbeat, Jim Diamond doesn’t have a history of violence…that is, not until Jake arrives at his apartment and discovers that a killer has been there first.Suddenly Jake and her best friend, Ellie White, find themselves at the center of a murder with too many suspects and too few clues. And as if that’s not enough, Jake is now saddled with the manic Bella, whose certainty that she’ll be the next victim is fueling a supercompulsive neatness–one that threatens to clean Jake and her long-suffering husband, Wade, out of house and home.Add to that a moose in her kitchen, a rebellious son with a habit of dumping Miss Right for Miss Wrong, and a troublesome ex of her own, and Jake is already at wit’s end. Then she gets word that a horde of her dad’s long-lost relatives mean to descend on Eastport, intending to be put up at her far-from-fixed-up fixer-upper.When the killer does strike again, it’s not where Jake expects…and the victim couldn’t be more of a surprise. For this is a case bigger than the usual angry—ex-spouse variety, and now that Jake and Ellie have gotten themselves involved, they’ve each won a special place in a ruthless murderer’s master plan of greed, deception, and death. And the prize? A pair of eternally private rooms–six feet under!",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Sarah Graves",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/480046.Tool_and_Die"
}