{
  "title": "Lazarus",
  "description": "Lazarus is a novel written by Leonid Andreyev. It is a story that revolves around the character of Lazarus, who is resurrected from the dead by Jesus Christ. The novel explores the consequences of this miraculous event on Lazarus and his surroundings. As Lazarus returns to life, he finds himself in a world that has changed. He is haunted by the memories of his previous life and the afterlife, and he struggles to come to terms with his new existence. The people around him are also affected by his resurrection, and they react in different ways. Some are amazed and worship him, while others are frightened and reject him. The novel delves into themes of faith, mortality, and the human condition. It questions the nature of life and death, and the role of religion in shaping human beliefs and values. The character of Lazarus serves as a symbol of hope and redemption, as he learns to embrace his second chance at life and make the most of it. Overall, Lazarus is a thought-provoking and spiritually rich novel that explores the complexities of human existence and the power of faith. It is a must-read for anyone interested in literature that challenges conventional beliefs and values.And when the scarlet, flattened globe would lower, Lazarus would set out for the desert and walk straight toward the sun, as though striving to reach it. He always walked straight toward the sun and those who tried to follow him and to spy upon what he was doing at night in the desert, retained in their memory the black silhouette of a tall stout man against the red background of an enormous flattened disc.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Short Stories",
    "Horror",
    "Fiction",
    "Russia",
    "Russian Literature",
    "Classics",
    "Mythology"
  ],
  "author": "Leonid Andreyev",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/4796684-lazarus"
}