{
  "title": "Steven Spielberg: Interviews",
  "description": "Steven Spielberg has become a brand name and a force that extends far beyond the movie screen. Phrases like \"phone home\" and the music score from Jaws are now part of our cultural script, appearing in commercials, comedy routines, and common conversation.Yet few scholars have devoted time to studying Spielberg's vast output of popular films despite the director's financial and aesthetic achievements. Spanning twenty-five years of Spielberg's career, Steven Spielberg: Interviews explores the issues, the themes, and the financial considerations surrounding his work. The blockbuster creator of E.T., Jaws, and Schindler's List talks about dreams and the almighty dollar.\"I'm not really interested in making money,\" he says. \"That's always come as the result of success, but it's not been my goal, and I've had a tough time proving that to people.\"Ranging from Spielberg's twenties to his mid-fifties, the interviews chart his evolution from a brash young filmmaker trying to make his way in Hollywood, to his spectacular blockbuster triumphs, to his maturation as a director seeking to inspire the imagination with meaningful subjects.The Steven Spielberg who emerges in these talks is a complex mix of businessman and artist, of arrogance and insecurity, of shallowness and substance. Often interviewers will uncover the director's human side, noting how changes in Spielberg's personal life -- marriage, divorce, fatherhood, remarriage -- affect his movies. But always the interviewers find keys to the story-telling and filmmaking talent that have made Spielberg's characters and themes shape our times and inhabit our dreams.\"Every time I go to a movie, it's magic, no matter what the movie's about,\" he says. \"Whether you watch eight hours of Shoah or whether it's Ghostbusters, when the lights go down in the theater and the movie fades in, it's magic.\"",
  "genres": [
    "Film",
    "Nonfiction",
    "Biography",
    "Business"
  ],
  "author": "Lester D. Friedman",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/479609.Steven_Spielberg"
}