{
  "title": "So Sad to Fall in Battle: An Account of War Based on General Tadamichi Kuribayashi's Letters from Iwo Jima",
  "description": "The Battle of Iwo Jima has been memorialized innumerable times as the subject of countless books and motion pictures, most recently Clint Eastwood’s films Flags of Our Fathers and Letters from Iwo Jima, and no wartime photo is more famous than Joe Rosenthal’s Pulitzer Prize-winning image of Marines raising the flag on Mount Suribachi. Yet most Americans know only one side of this pivotal and bloody battle. First published in Japan to great acclaim, becoming a bestseller and a prize-winner, So Sad to Fall in Battle shows us the struggle, through the eyes of Japanese commander Tadamichi Kuribayashi, one of the most fascinating and least-known figures of World War II.As author Kumiko Kakehashi demonstrates, Kuribayashi was far from the stereotypical fanatic Japanese warrior. Unique among his country’s officers, he refused to risk his men’s lives in suicidal banzai attacks, instead creating a defensive, insurgent style of combat that eventually became the Japanese standard. On Iwo Jima, he eschewed the special treatment due to him as an officer, enduring the same difficult conditions as his men, and personally walked every inch of the island to plan the positions of thousands of underground bunkers and tunnels. The very flagpole used in the renowned photograph was a pipe from a complex water collection system the general himself engineered.Exclusive interviews with survivors reveal that as the tide turned against him, Kuribayashi displayed his true Though offered a safer post on another island, he chose to stay with his men, fighting alongside them in a final, fearless, and ultimately hopeless three-hour siege.After thirty-six cataclysmic days on Iwo Jima, Kurbiayashi’s troops were responsible for the deaths of a third of all U.S. Marines killed during the entire four-year Pacific conflict, making him, in the end, America’s most feared–and respected–foe. Ironically, it was Kuribayashi’ s own memories of his military training in America in the 1920s, and his admiration for this country’s rich, gregarious, and self-reliant people, that made him fear ever facing them in combat–a feeling that some suspect prompted his superiors to send him to Iwo Jima, where he met his fate.Along with the words of his son and daughter, which offer unique insight into the private man, Kuribayashi’s own letters cited extensively in this book paint a stirring portrait of the circumstances that shaped him. So Sad to Fall in Battle tells a fascinating, never-before-told story and introduces America, as if for the first time, to one of its most worthy adversaries.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Japan",
    "World War II",
    "Biography",
    "Military History"
  ],
  "author": "Kumiko Kakehashi",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/479659.So_Sad_to_Fall_in_Battle"
}