{
  "title": "Privatizing Poland: Baby Food, Big Business, and the Remaking of Labor",
  "description": "The transition from socialism in Eastern Europe is not an isolated event, but part of a larger shift in world the transition from Fordism to flexible (or neoliberal) capitalism. Using a blend of ethnography and economic geography, Elizabeth C. Dunn shows how management technologies like niche marketing, accounting, audit, and standardization make up flexible capitalism's unique form of labor discipline. This new form of management constitutes some workers as self-auditing, self-regulating actors who are disembedded from a social context while defining others as too entwined in social relations and unable to self-manage. Privatizing Poland examines the effects privatization has on workers' self-concepts; how changes in \"personhood\" relate to economic and political transitions; and how globalization and foreign capital investment affect Eastern Europe's integration into the world economy. Dunn investigates these topics through a study of workers and changing management techniques at the Alima-Gerber factory in Rzeszów, Poland, formerly a state-owned enterprise, which was privatized by the Gerber Products Company of Fremont, Michigan. Alima-Gerber instituted rigid quality control, job evaluation, and training methods, and developed sophisticated distribution techniques. The core principle underlying these goals and strategies, the author finds, is the belief that in order to produce goods for a capitalist market, workers for a capitalist enterprise must also be produced. Working side-by-side with Alima-Gerber employees, Dunn saw firsthand how the new techniques attempted to change not only the organization of production, but also the workers' identities. Her seamless, engaging narrative shows how the employees resisted, redefined, and negotiated work processes for themselves.",
  "genres": [
    "Nonfiction",
    "History",
    "Anthropology",
    "Politics",
    "Sociology",
    "Social Science",
    "Economics"
  ],
  "author": "Elizabeth C. Dunn",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/480183.Privatizing_Poland"
}