{
  "title": "Year of the Hyenas",
  "description": "\"Year of the Hyenas\" is a brilliant, original, and unique murder mystery, set in ancient Egypt at the height of that kingdom's glory and power. It is at once a strikingly insightful portrait of a mysterious, complex, and sophisticated society, reminiscent of Norman Mailer's \"Ancient Evenings\" in its wonderful detail and feel for the past, and a fast-paced detective story that reads like the best of twenty-first-century thrillers.From the oldest known court transcripts in history, Egyptologists have long known about the mysterious death of Ramses III, involving intrigue, ambition, greed, and crimes of passion on a huge, though hidden, scale. In \"Year of the Hyenas,\" Brad Geagley takes this event -- a struggle that nearly brought ancient Egypt to its knees -- as the backdrop for a story that is every bit as captivating as the distant civilization it resurrects.At the heart of the novel is Semerket, the so-called Clerk of Investigations and Secrets, a detective half-paralyzed by problems of his own, with a reputation for heavy drinking and tactless behavior toward the great, the powerful, and the holy, a kind of Sam Spade of the ancient world, deeply (and dangerously) addicted to the truth. Hard-bitten, deeply flawed, he is retained by the authorities to investigate what is considered an insignificant murder of an elderly, insignificant Theban priestess. They fail to inform him, however, that they don't expect him to solve the case. In fact, they don't want him to.But Semerket is not so easily fooled, and this is hardly an \"insignificant\" murder. As he delves deeper for the elusive truth, he uncovers a web of corruption so vast that it threatens the life of the last greatPharaoh, Ramses III, and the stability of the kingdom. Even worse, uncovering the conspiracy means more than just putting his own life on the line -- for, unbeknownst to Semerket, his adored ex-wife Naia has fallen afoul of those who would bring down the reign of Ramses, and he soon finds himself having to choose between saving her and saving Egypt....Merging historical fact and speculation with a nail-biting crime story that could be taking place in the present, \"Year of the Hyenas\" is a riveting and remarkable achievement.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Egypt",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Ancient"
  ],
  "author": "Brad Geagley",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/481007.Year_of_the_Hyenas"
}