{
  "title": "In Service",
  "description": "Malla only wanted to serve a few good men. As a sexual companion that sustains Luo troops with human energy, she's eager for her first assignment. Fresh out of training, she's assigned to a hell of a team in a hellish situation and promptly falls for all four of them. Three of them accept her immediately, bound to her in the searing sexual circumstances of her arrival.But Shon is her hard case. He accepts her body and her energy just fine, but holds his heart back. The team leader doesn't trust his gift of berzerker rage, and his own team doesn't trust him either. She's happy to prove them wrong by taking all of him in his darkest moment...only to find the team doesn't see it as the confirmation she does. When her men disagree despite the proof she presents, Malla sees she's not really the equal partner she thought she was. If her team won't trust her judgment, then she can't trust them with her heart.When a lonely warrior who has never fully let himself go because of his \"gift\" of berzerker rage meets a woman who actually expects him to do so, he's shockingly tempted. In the fight of his life, Shon's team is saved because of Malla's open spirit and dazzling sexuality. But the thrill of success after the mission is ripped away when he discovers she has faced his berzerker state...alone.She trusted him to be more human than he is, and he tragically, horrifically proved her wrong. There's no way he deserves her heart, he no longer deserves her body, and he can't possibly continue with his team, facing their knowledge of what he's capable of. No one should ever face his Fury again. Broken, the team scatters, the defeat of their enemy small comfort to the shattering of their family. War takes its toll on all of them, until Shon finally sees the truth of what it means to have someone believe in him.Publisher's Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, domination, dubious consent, exhibitionism, male/male sexual practices, masturbation, Ménage (m/m/m/f), spanking, violence, voyeurism.",
  "genres": [
    "Science Fiction",
    "Menage",
    "Romance",
    "Aliens",
    "M M F",
    "Erotica",
    "Futuristic"
  ],
  "author": "Mima",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/4808667-in-service"
}