{
  "title": "The Leaphorn & Chee Novels",
  "description": "Three of New York Times bestselling author Tony Hillerman's most popular novels are together for the first time in one volume.Tony Hillerman is one of the most revered and honored mystery writers published today. This stunning collection includes the critically acclaimed novels Skinwalkers, A Thief of Time, and Coyote Waits, all of which have been adapted for PBS by producer Robert Redford. This is a must-have anthology from one of the great masters of suspense.In Skinwalkers, three shotgun blasts explode into the trailer of Officer Jim Chee of the Navajo Tribal Police. Chee survives to join partner Lieutenant Joe Leaphorn in a frightening investigation that takes them into a dark world of ritual, witchcraft, and blood -- all tied to the elusive and evil \"skinwalker.\" In A Thief of Time, a noted anthropologist vanishes at a moonlit Indian ruin where \"thieves of time\" ravage sacred ground for profit. When two corpses appear amid stolen goods and bones at an ancient burial site, Leaphorn and Chee must plunge into the past to unearth the astonishing truth behind a mystifying series of horrific murders.And in Coyote Waits, it wasn't the car fire that killed Navajo Tribal Policeman Delbert Nez -- a bullet did. Officer Jim Chee's good friend Del lies dead, and a whiskey-soaked Navajo shaman is found with the murder weapon. The old man is Ashie Pinto. He's quickly arrested for homicide and defended by a woman Chee could either love or loathe. But Pinto won't utter a word of confession or denial. Leaphorn and Chee must unravel a complex plot involving a historical find, a lost fortune, and the mythical Coyote, who is always waiting, and always hungry.",
  "genres": [
    "Mystery",
    "Fiction",
    "Westerns",
    "Native American",
    "Crime",
    "Native Americans",
    "Literature"
  ],
  "author": "Tony Hillerman",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/48094.The_Leaphorn_Chee_Novels"
}