{
  "title": "The Battle for Castle Cockatrice",
  "description": "What do you get when you cross a bunch of odious toads and ornery fire-breathing birds with one parrot, a distressed dragon, a group of weasels, a troop of mermaids, a herd of unicorns, a band of gryphons, and three children? When Penelope, Simon, and Peter go to the beach, they get a surprise they'll never forget. A package washes ashore and begins to speak! The children open it up to reveal a talking parrot and spider who were kidnapped and sent away. Their home is Mythologia, where sunrise takes place all day long and magical creatures like Mooncalves and Will-o'-the-Wisps lived peacefully--until the evil Cockatrices decided to take over. And now the new rulers are threatening to turn it into a land of cruelty and fear. It's only a matter of time before the Cockatrices become all powerful. So with the help of a counterspy toad, Penelope, Simon, and Peter decide to do everything they can to help overthrow the wicked birds. But will they be able to survive a trip to Mythologia's scariest places and defeat the evil Cockatrices? For Penelope, Simon, and Peter, a day at the beach is the beginning of an unforgettable adventure. A big brown package washes ashore and begins to speak! Imprisoned inside are Parrot and his companion Ducibelle, a spider, exiles from the land of Mythologia, where magical creatures like unicorns, dragons, and mermaids live together happilyuntil the villainous cockatrices (half serpent, half rooster) take over and enslave the entire population. Can the children help defeat the evil cockatrices and restore peace to Mythologia?A charming, whimsical tour-de-force, The Battle for Castle Cockatrice is a classic story that fantasy readers will welcome back into print.A marvelously created fantasy. The Horn Book",
  "genres": [
    "Fantasy",
    "Childrens",
    "Fiction",
    "Animals",
    "Young Adult",
    "Humor",
    "British Literature"
  ],
  "author": "Gerald Durrell",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/48155.The_Battle_for_Castle_Cockatrice"
}