{
  "title": "New News Out of Africa: Uncovering Africa's Renaissance",
  "description": "For twenty years an acclaimed correspondent on PBS's The News Hour with Jim Lehrer and the winner of two Emmys and two Peabody Awards (the latter two for her coverage of Africa), Charlayne Hunter-Gault was until recently the Johannesburg Bureau Chief for CNN. In New News Out of Africa , thiseminent reporter offers a fresh and surprisingly optimistic assessment of modern Africa, revealing that there is more to the continent than the bad news of disease, disaster, and despair.Blending personal memoir with sterling reportage and astute analysis, Hunter Gault presents an Africa we rarely see. She looks first at South Africa, contrasting the country she first encountered as a young reporter--when she personally witnessed the brutality of apartheid--with the black-led,multiracial society of today, a nation undergoing one of the most radical social and economic experiments in modern times. She acknowledges the great imbalance in income in modern South Africa (where upwards of 30 to 40 percent of blacks are unemployed) and describes the ravaging effect of AIDS onthe nation, but she also underscores the nation's commitment to affirmative action, describes how South African universities have opened their doors to black students, and debunks many of the myths about the violence of South African society. Likewise, Hunter-Gault looks at the continent-wideefforts to promote \"an African Renaissance,\" illuminating the political and economic conditions in Rwanda, Mozambique, Nigeria, Ghana, Kenya, Angola, and Sierra Leone. Finally, the book describes the challenges of reporting on the much-maligned continent and the efforts of African journalists totell their own story.A compelling book on a topic of vital importance, New News Out of Africa promises to re-define what is news about this vast and complex continent.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Travel",
    "Politics",
    "Political Science",
    "Journalism"
  ],
  "author": "Charlayne Hunter-Gault",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/48290.New_News_Out_of_Africa"
}