{
  "title": "The Garden of Vegan: How It All Vegan Again!",
  "description": "Get tempted by an inspiring array of vegan recipes from the authors of How It All Vegan! When How It All Vegan!: Irresistible Recipes for an Animal-Free Diet was published in 1999, authors Tanya Barnard and Sarah Kramer were hailed for their fun and outlandish approach to vegan cooking, taking it out of the realm of the staid and the boring to create truly original animal-free dishes. How It All Vegan! was a Book Sense 76 selection and has sold 50,000 copies to date. The Garden of How It All Vegan Again! picks up where the first book left off. Tanya and Sarah, vegan chefs extraordinaire, have created truly delectable, truly original new recipes that manage to leave the animal products (including butter, milk, cheese and honey) where they belong, with their natural owners. Where How It All Vegan! was, in many ways, a bible for the uninitiated vegan, The Garden of Vegan goes one step further, offering recipes for a more sophisticated palate that add funky twists to familiar dishes bursting with color and flavor. At the same time, they are fun and easy to prepare, even for those of us who find boiling water a challenge. Whether you’re a full-time vegan or just interested in creating fabulous animal-free meals, The Garden of -Vegan will lead you into temptation with its inspiring -array of vegan goodies. So skip that steak and forget that fish. It’s time to discover how it all vegan, again! Two-color throughout, including numerous pictures. Praise for How It All Vegan! : \"Written with sass, style, and a sense of humor . . . more than just a cookbook.\"— Bust \"One of the most inviting cookbooks to come along in years.\"—Vegan.com Tanya Barnard and Sarah Kramer appear to be mild mannered vegans, but when the two of them get together, they become mighty Vegan Warriors, writing cookbooks and kicking vegan ass! They live in Victoria, Canada.",
  "genres": [
    "Cookbooks",
    "Vegan",
    "Food",
    "Cooking",
    "Nonfiction",
    "Vegetarian",
    "Reference"
  ],
  "author": "Tanya Barnard",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/48314.The_Garden_of_Vegan"
}