{
  "title": "Tough Guys Don't Dance",
  "description": "Norman Mailer peers into the recesses and buried virtues of the modern American male in a brilliant crime novel that transcends genre. When Tim Madden, an unsuccessful writer living on Cape Cod, awakes with a gruesome hangover, a painful tattoo on his upper arm, and a severed female head in his marijuana stash, he has almost no memory of the night before. As he reconstructs the missing hours, Madden runs afoul of retired prizefighters, sex addicts, mediums, former cons, a world-weary ex-girlfriend, and his own father, old now but still a Herculean figure. Stunningly conceived and vividly composed, Tough Guys Don’t Dance represents Mailer at the peak of his powers.   Praise for Tough Guys Don’t Dance   “Spectacular . . . [Norman Mailer] makes every word count, like a master knife thrower zinging stilettos in a circle around your head.”—People   “As brash, brooding and ultimately mesmerizing as the author himself . . . [Mailer strikes a] dazzling balance between humor and horror.”—New York Daily News   “A first-rate page-turner of a murder mystery . . . full of great characters, littered with dead bodies and replete with plausible suspects.”—Chicago Tribune   “[Tough Guys Don’t Dance] has that charming Mailer bravado.”—The New York Times   Praise for Norman Mailer   “[Norman Mailer] loomed over American letters longer and larger than any other writer of his generation.”—The New York Times   “A writer of the greatest and most reckless talent.”—The New Yorker   “Mailer is indispensable, an American treasure.”—The Washington Post   “A devastatingly alive and original creative mind.”—Life   “Mailer is fierce, courageous, and reckless and nearly everything he writes has sections of headlong brilliance.”—The New York Review of Books   “The largest mind and imagination [in modern] American literature . . . Unlike just about every American writer since Henry James, Mailer has managed to grow and become richer in wisdom with each new book.”—Chicago Tribune   “Mailer is a master of his craft. His language carries you through the story like a leaf on a stream.”—The Cincinnati PostFrom the Paperback edition.",
  "genres": [
    "Fiction",
    "Mystery",
    "Novels",
    "Literature",
    "Crime",
    "American",
    "Classics"
  ],
  "author": "Norman Mailer",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/12469.Tough_Guys_Don_t_Dance"
}