{
  "title": "La Dolce Vegan!: Vegan Livin' Made Easy",
  "description": "Sarah Kramer is a vegan cooking superstar. Her first two books, How It All Vegan! and The Garden of Vegan , co-authored with Tanya Barnard, have sold well over 100,000 copies; How It All Vegan! won the Veggie Award for favorite cookbook of 2004 by VegNews magazine, and Herbivore magazine, in a cover story on Sarah, called her “The World’s Coolest Vegan.” Sarah returns with her first solo cookbook, featuring more of the delectable, easy-to-prepare recipes that vegans around the world have come to adore. For Sarah, vegan cooking—which eschews all animal products, including butter, milk, and cheese—can be an adventure in dining, without a lot of investment in time or money. In fact, most of the recipes in La Dolce Vegan! can be prepared in 20 to 30 minutes or less. From soups and salads to entrees and desserts, they are sure to inspire both committed and part-time vegans alike. At the heart of the book is Sarah’s wholehearted commitment to the vegan lifestyle that has changed her life completely—from a childhood plagued with health problems to an adulthood filled with the pleasures and joys of living vegan. For Sarah, an animal-free diet will make you happier, healthier, and more content with the world around you. In addition to the wonderful recipes, there is a fun do-it-yourself section of vegan tips and non-food items. Learn to live the sweet life of veganism and you’ll never look back! Recipes Beauty and the Beet Borscht, Mocked Clam Chowder, Roasted Cherry Tomato Pasta, Sloppy Janes, Blessed Broccoli Stir-Fry, Apple Pie Pancakes, Carob Almond Truffles, and Tomato Soup Cake. Sarah Kramer is the co-author of How It All Vegan! and The Garden of Vegan . She lives in Victoria, British Columbia, with her husband, where she manages a tattoo shop in addition to creating her vegan masterpieces and maintaining her popular website www.GoVegan.net .",
  "genres": [
    "Cookbooks",
    "Vegan",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Health"
  ],
  "author": "Sarah Kramer",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/48313.La_Dolce_Vegan_"
}