{
  "title": "Reflections of a Tortured Soul, one hearts journey through the pain of love and life",
  "description": "With age come wisdom and understanding. It’s very unfortunate that we are designed in a way that we have to achieve a certain degree of years before we are able to reflect upon our lives. Only then we can truly appreciate the pain and sorrow that our choices can cause another.I have many friends that are artists, singers, songwriters, musicians and other artistic endeavors. For years I envied their ability to express their emotions, from sadness to euphoria and everything in between. The have this incredible gift for allowing others to relate to their own deeply personal lives. As a fan of their art, I have relied on their music to help me through my own personal journey. I have met many people over the years in the same position, healing through art is one of God’s many gifts to us.My journey has been one of mostly pain and deceit. From a very early age with the death of my dear mother to a troubled childhood and eventually failed marriages and few if any real friends. There have been some joyous occasions too. My marriages are a great source of joy and sorrow, the birth of my daughters and the choice to have two step-daughters are a few. Unfortunately, I have this innate ability to sabotage those blessed events.There are so many many people that I have hurt or disappointed over my life. In particular there are six. Although, it is not my intention to belittle or trivialize any of the others both male and female that I have caused pain to. These six women, Carole, Racheal, Rebekah, Janet, Liza and Avi, were forced to endure a tremendous torment and for that I will always be regretful.The following is a collection of writings, done over the years. Some for joyous moments and others not so. The idea of this book was inspired by the artists I know. I have always written to help process some of my own emotions. Not for a moment do I consider myself an artist or a poet. Others that have read some of my work seem to identify with it for their own personal reasons. The lessons I have learned are these: Be true to yourself and honor commitments (no matter how difficult) made to others. I believe had I followed them I would have avoided a lifetime of failure and regrets.",
  "genres": [],
  "author": "Eric Mastel",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/12468862-reflections-of-a-tortured-soul-one-hearts-journey-through-the-pain-of-l"
}