{
  "title": "Ghost Dogs of the South",
  "description": "Award-winning husband-and-wife folklorists Randy Russell and Janet Barnett have gone to the dogs. Digging deeply through the rich field of Southern folklore, the authors have discovered that a dog's devotion to its human does not always end at the grave. Dogs can be as peculiar as people. Their relationship with humans is complex. In story after story from Southern homes, there is strong evidence that this relationship can extend beyond death. Do dogs return from the other side to comfort and aid their human companions? You bet your buried bones they do. In  Ghost Dogs of the South , you'll meet the A stray dog that warns Kentucky coal miners of impending disaster; a literary critic of a dog with the gift of speech; a dog-snatching mermaid on the Mississippi River; a Tennessee dog that returns year after year to go trick-or-treating; a pair of Georgia hounds that stumble upon an enchanted woods; a girl whose pain is eased by the ghost of a butterfly dog. Dog ghosts (dogs that have become ghosts), ghost dogs (humans who return as ghosts in the shape of dogs), dogs that see ghosts, dogs that are afraid of ghosts―all make an appearance in these twenty stories that illuminate the shadow side of man's best friend. For several years, folklorists Randy Russell and Janet Barnett have taught a course about Southern folklore at the North Carolina Center for Advancement of Teaching in Cullowhee, North Carolina. Russell is also the author of several mysteries, including Edgar Award nominee Hot Wire .They live in Asheville, North Carolina. \"Alternately eerie, funny, tragic and sentimental . . . These tales will undoubtedly delight dog lovers and will not fail to charm even the most dour skeptics of supernatural phenomena.\" — Publishers Weekly",
  "genres": [
    "Animals",
    "Paranormal",
    "Nonfiction",
    "Ghost Stories",
    "Folklore",
    "Short Stories"
  ],
  "author": "Randy Russell",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/48280.Ghost_Dogs_of_the_South"
}