{
  "title": "A Sor Juana Anthology",
  "description": "Here is a new voice―new to us―reaching across a gap of three hundred years. Sor (Sister) Juana Inés de la Cruz was acclaimed in her time as “Phoenix of Mexico, America’s Tenth Muse”; a generation later she was forgotten. In our century she was rediscovered, her works were reissued, and she is now considered one of the finest Hispanic poets of the seventeenth century. She deserves to be known to English-speaking readers for another reason as well: she speaks directly to our concern for the freedom of women to realize themselves artistically and intellectually.Her poetry is surprising in its scope and variety. She handled with ease the intricate verse forms of her day and wrote in a wide range of genres. Many of her lyrics reflect the worldliness and wit of the courtly society she moved in before becoming a nun; some, composed to be sung, offer charming glimpses of the native people, their festivities and colorful diversity. Alan Trueblood has chosen, in consultation with Octavio Paz, a generous selection of Sor Juana’s writings and has provided an introductory overview of her life and work. The short poems, and excerpts from her play The Divine Narcissus , are accompanied by the Spanish texts on facing pages. Her long philosophical poem, First Dream , is translated in its entirety, as is her famous autobiographical letter to the Bishop of Puebla, which is both a self-defense and a vindication of the right of women to cultivate their minds.The Anthology was conceived as a companion to the English-language edition of Octavio Paz’s magisterial study of Sor Juana. On its own, it will be welcomed as the first representative selection in English of her verse and prose.",
  "genres": [
    "Poetry",
    "Spanish Literature",
    "Fiction",
    "Classics",
    "Womens",
    "Collections"
  ],
  "author": "Juana Inés de la Cruz",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/483864.A_Sor_Juana_Anthology"
}