{
  "title": "I Am Your Sister: Collected and Unpublished Writings",
  "description": "Audre Lorde was not only a famous poet; she was also one of the most important radical black feminists of the past century. Her writings and speeches grappled with an impressive broad list of topics, including sexuality, race, gender, class, disease, the arts, parenting, and resistance, and they have served as a transformative and important foundation for theorists and activists in considering questions of power and social justice. Lorde embraced difference, and at each turn she emphasized the importance of using it to build shared strength among marginalized communities. I Am Your Sister is a collection of Lorde's non-fiction prose, written between 1976 and 1990, and it introduces new perspectives on the depth and range of Lorde's intellectual interests and her commitments to progressive social change. Presented here, for the first time in print, is a major body of Lorde's speeches and essays, along with the complete text of A Burst of Light and Lorde's landmark prose works Sister Outsider and The Cancer Journals. Together, these writings reveal Lorde's commitment to a radical course of thought and action, situating her works within the women's, gay and lesbian, and African American Civil Rights movements. They also place her within a continuum of black feminists, from Sojourner Truth, to Anna Julia Cooper, Amy Jacques Garvey, Lorraine Hansberry, and Patricia Hill Collins. I Am Your Sister concludes with personal reflections from Alice Walker, Gloria Joseph, Johnnetta Betsch Cole, Beverly Guy-Sheftall, and bell hooks on Lorde's political and social commitments and the indelibility of her writings for all who are committed to a more equitable society.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Poetry",
    "Essays",
    "Race",
    "LGBT",
    "Queer"
  ],
  "author": "Audre Lorde",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/4832100-i-am-your-sister"
}