{
  "title": "One Small Boat: The Story of a Little Girl, Lost Then Found",
  "description": "This story of one little girl's journey through our foster-care system forms an intimate portrait of foster care in America and the children whose lives are forever shaped by it.  Augusten Burroughs called Kathy Harrison's memoir Another Place at the Table a \"riveting and profoundly moving story of a hero, disguised as an everyday woman.\" In One Small Boat, Harrison tells the story of one little girl who arrived on her doorstep, and describes how caring for this child was an experience that challenged everything she thought she knew about foster-care parenting and the needs of the children she shelters.  Daisy was five when she arrived in Harrison's bustling home. Mother of three children by birth and three by adoption, and with a handful of foster kids always coming and going, Harrison had ten children under her roof at any given time. But Daisy was in many ways unique. Daisy's birth mother wasn't poor, uneducated, or drug addicted. She simply couldn't bring herself to take care of her little girl, and the effects on the child were heartrending. Daisy was unwilling to eat-even frightened of it-and seemed to have a severe speech impediment. After two weeks in Kathy's loving home, however, Daisy began to thrive. What had happened to her? And how can a foster-care parent give back all that has been taken from a child like Daisy-knowing that she might leave one day very soon? Harrison had seen many children pass through her doors, but this one touched her in a way she didn't immediately understand.  One Small Boat will be of deep interest to anyone who has nurtured and cared for a child or anyone interested in the intricate web that is our social welfare system.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Adoption",
    "Fostering",
    "Biography Memoir",
    "Biography",
    "Abuse"
  ],
  "author": "Kathy Harrison",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/483367.One_Small_Boat"
}