{
  "title": "The Satanic Verses",
  "description": "alternate covers for this ISBN can be found here.Just before dawn one winter's morning a hijacked jumbo-jet blows apart high above the English Channel. Through the debris of limbs, drinks trolleys, memories, blankets and oxygen masks, two figures fall towards the sea without benefit of parachutes: Gibreel Farishta, India's legendary movie star, and Saladin Chamcha, the man of a thousand voices, self-made self and Anglophile supreme. Clinging to each other, singing rival songs, they plunge downward, and are finally washed up, alive, on the snow-covered sands of an English beach. A miracle; but an ambiguous one, because it soon becomes apparent that curious changes are coming over them. Gibreel seems to have acquired a halo, while, to Saladin's dismay, his legs grow hairier, his feet turn into hoofs, and there are bumps burgeoning at his temples.So begins The Satanic Verses, Salman Rushdie's first novel for five years.Gibreel and Saladin have been chosen (by whom?) as protagonists in the eternal wrestling match between Good and Evil. But which is which? Can demons be angelic? Can angels be devils in disguise? As the two men tumble through their tale, through time as well as space, towards their final confrontation, we are witnesses to a cycle of extraordinary stories, tales of love and passion, of betrayal and faith: the story of Ayesha, the butterfly-shrouded visionary who leads an Indian village on an impossible pilgrimage; of Allie, the mountain-climber haunted by a ghost who urges her to attempt the ultimate feat — a solo ascent of Everest; of murders, metamorphoses and riots in a London \"visible but unseen\"; and, centrally, the story of Mahound, the Prophet of Jahilia, the city of sand — Mahound, the recipient of a revelation in which satanic verses mingle with divine.In this great wheel of a book, where the past and the future chase each other furiously, Salman Rushdie takes us on an epic journey, a journey of tears and laughter, of wonderful stories and astonishing flights of the imagination, a journey towards the evil and the good that lie inseparably entwined within the hearts of women and of men.--front flap",
  "genres": [
    "Fiction",
    "Classics",
    "Magical Realism",
    "Fantasy",
    "Literature",
    "Religion",
    "Banned Books"
  ],
  "author": "Salman Rushdie",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/4834.The_Satanic_Verses"
}