{
  "title": "Make Money Trading Leading Stocks: A Beginner's Guide to Free Trading Tools, Technical Analysis, Money and Risk Management, Trading Log for profits in ... Stock Market, Trend and Momentum Trading)",
  "description": "Customer Reviews (as of Nov 16, 2019):\n\n\nValue Investor (amazon.ca)5.0 out of 5 stars - Easy to Understand and Useful InformationNovember 11, 2019Format: Kindle Edition - Verified PurchaseVery interesting read for anyone thinking about getting into trading. The author makes it very clear that in order to be a successful trader you must invest a little bit of your time to learn and practice the skills required. Jay (amazon.ca)5.0 out of 5 stars - Easy to followNovember 8, 2019Format: Kindle EditionVerified PurchaseSimple illustration, charts, links provided to understand the stock movement to make buy or sell decision. Looking forward to implement the knowledge to make money. Kyle (amazon.ca)5.0 out of 5 stars - Good system and great toolsNovember 7, 2019Format: Kindle Edition / Verified PurchaseI’ve worked for David in the consulting industry so I may be a little bit biased. This book breaks down very simple systems and tools to make money in the stock market. It is an easy read and the system is fairly simple to implement. I’m looking forward to making my first trade with this system. Stock Investor (amazon.in)5.0 out of 5 stars - Excellent book, tons of FREE tools and resources for trading any stock market of the world13 November 2019Format: Kindle Edition - Verified PurchaseI have been stock trading for few years now. I wish I had this book before. The author has done a meticulous job in describing how the FREE tools and resources widely available on the internet can be used for trading any stock markets of the world. I am so glad to learn about how to find the leading stocks in the leading sectors, how to use stock scanners, how to define risks and profit targets even before entering a trade, how many shares to buy, are some of the greatest highlights of the book. I will recommend this book to everyone who wants to be profitable in stock trading. I have not seen any book with so many examples, 20+ colorful charts, 40+ useful hyperlinks, suggestions for further research, and much more.\nBook Description:\n\nAnybody who wants to learn about stock market trading, investing, and related strategies, systems, setups, indicators, technical analysis, online trading, and much more, this book is for them. Chart analysis, price patterns, trading plan, which stocks to buy, when to buy and sell are all explained with numerous examples and charts. Essentially it shows how to make money in stocks. Beginners will love it.In this book, the author dive deep into a few specific stock trading strategies such as:1. Use of FREE tools and resources to trade any stock markets of the world2. Identify Leading Sectors3. Identify Leading Stocks within the Leading Sectors4. Use of Relative Strength to ensure the Stocks and Sectors are outperforming the broader market5. Determine Optimal Position Size based on your risk tolerance level6. Use of a Stock Scanner to automate the process, and much more. About the Author: Debabrata (David) Das, Ph.D.Engineer by training, passionate about trading and investing.",
  "genres": [],
  "author": "Debabrata (David) Das",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/48497891-make-money-trading-leading-stocks"
}