{
  "title": "Democracy and Distrust: A Theory of Judicial Review",
  "description": "This powerfully argued appraisal of judicial review may change the face of American law. Written for layman and scholar alike, the book addresses one of the most important issues facing Americans within what guidelines shall the Supreme Court apply the strictures of the Constitution to the complexities of modern life?Until now legal experts have proposed two basic approaches to the Constitution. The first, “interpretivism,” maintains that we should stick as closely as possible to what is explicit in the document itself. The second, predominant in recent academic theorizing, argues that the courts should be guided by what they see as the fundamental values of American society. John Hart Ely demonstrates that both of these approaches are inherently incomplete and inadequate. Democracy and Distrust sets forth a new and persuasive basis for determining the role of the Supreme Court today.Ely’s proposal is centered on the view that the Court should devote itself to assuring majority governance while protecting minority rights. “The Constitution,” he writes, “has proceeded from the sensible assumption that an effective majority will not unreasonably threaten its own rights, and has sought to assure that such a majority not systematically treat others less well than it treats itself. It has done so by structuring decision processes at all levels in an attempt to ensure, first, that everyone’s interests will be represented when decisions are made, and second, that the application of those decisions will not be manipulated so as to reintroduce in practice the sort of discrimination that is impermissible in theory.”Thus, Ely’s emphasis is on the procedural side of due process, on the preservation of governmental structure rather than on the recognition of elusive social values. At the same time, his approach is free of interpretivism’s rigidity because it is fully responsive to the changing wishes of a popular majority. Consequently, his book will have a profound impact on legal opinion at all levels―from experts in constitutional law, to lawyers with general practices, to concerned citizens watching the bewildering changes in American law.",
  "genres": [
    "Law",
    "Politics",
    "Nonfiction",
    "History",
    "College",
    "Justice",
    "Political Science"
  ],
  "author": "John Hart Ely",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/484916.Democracy_and_Distrust"
}