{
  "title": "The Wolverton Bible",
  "description": "Cartoonist Basil Wolverton was known for his grotesque drawings, fantastically odd creatures, spaghetti-like hair, smoothly sculpted caricatures and insanely detailed crosshatching. His career in the golden age of comic books lasted from 1938 until 1952, after which his illustrations and caricatures extended into such publications as Life, Pageant and MAD magazines. Stylistically, he has been regarded as one of the spiritual grandfathers of underground and alternative comix. Less well known and understood is his work for the Worldwide Church of God, headed until 1986 by radio evangelist Herbert Armstrong. From 1953 through 1974, Wolverton, a deeply religious man, was commissioned and later employed by the church to write and illustrate a narrative of the Old Testament (including over 550 illustrations), some 20apocalyptic illustrations inspired by the Book of Revelations, and dozens of cartoons and humorous illustrations for various Worldwide Church publications.Compiled and edited by Wolverton's son, Monte, the 304-page Wolverton Bible includes all of Wolverton's artwork for the Worldwide Church of God corporation. Recording artist and noted EC authority Grant Geissman (Tales of Terror: The E.C. Companion and Foul Play : The Art and Artists of the Notorious 1950s E.C. Comics )provides an insightful foreword, while Monte Wolverton delivers commentary and background in the introduction and in each section. This volume is authorized and commissioned by the Worldwide Church of God and endorsed by the Wolverton family.Many of the illustrations in this book are regarded as Basil Wolverton s finest work. Still others have never been published, and some of the humorous drawings printed here rival Wolverton's work in MAD magazine.",
  "genres": [
    "Comics",
    "Art",
    "Religion",
    "Graphic Novels",
    "War",
    "Scripture",
    "Mythology"
  ],
  "author": "Basil Wolverton",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/4844328-the-wolverton-bible"
}