{
  "title": "The Betrayals of Grim's Peak",
  "description": "Librarian's note: Alternate cover edition for ASIN B0062FUG5Q.Augustus Tomlin was found floating in the waters of the Florida Keys as an infant after a mysterious undersea explosion. Not long after turning sixteen, following an attack by creatures right out of a nightmare near his adoptive parents' seaside cabin, he is pulled away from the only family he has ever known back into the one thing that scares him the most – the ocean.Augie reluctantly follows his new friend Mira and her drac to the centuries old underwater city of Grim's Peak where he must overcome his overwhelming phobia of water and adapt to his new surroundings quickly because it is clear that someone is hell bent on trying to kill him. The only clue he has to his origins is the small medallion he was wearing on the night he was found. Augie's quest for the truth about who he is and what happened to his parents leads him and his friends to secret underground caverns, a dead undersea lake called the Hel-mir, and to several encounters with a dangerous species of half-human/half-fish hybrids called Mers who will seemingly stop at nothing to reclaim the territory now occupied by Grim's Peak that they say was stolen from them by the town's founders almost a thousand years ago. It isn't long before Augie discovers he is part of a centuries old mystery that began with a single lie - a lie so powerful that were it to ever be exposed it would bring everything crashing down around him including the amazing new world he has been introduced to. Time is running out, and to uncover the truth Augie must face earth shattering revelations about his past, survive against incredible odds, and discover the identity of the traitor in his midst who has been living right under his nose all along.",
  "genres": [
    "Fantasy",
    "Adventure",
    "Young Adult"
  ],
  "author": "Sean J. Quirk",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/12471332-the-betrayals-of-grim-s-peak"
}