{
  "title": "Steam-Cleaning Love",
  "description": "Lesbian. Poetry. Queer. LGBT studies. Poetry. Letters to women. Love poems.Jane Eaton Hamilton distinguished herself with Body Rain (1991) a tough, passionate lyrical book written out of a woman's anger and a woman's love. Steam-Cleaning Love, Hamilton's second book of poetry, is \"ginger root tough and jelly edgy\"-spicy, sweet, biting; it overwhelms, inundates, the palate. This new book revives the angry, biting, funny, loving, randy voice that won readers to her first volume, but sets that voice in a gentler space. These are passionate poems that celebrate women as friends and lovers, and the beauty, the delight, the desire of women's bodies.\"There is joy in these poems, and a vibrant healthiness. Her poems are about many things we might like to call ordinary, but they’re written in a way that’s anything but.\"--sub-TERRAIN\"Her poetry is often ribald, and sometimes it is frankly lewd--and how, these days, one welcomes a bit ofhonest lewdness.\"--BC Bookworld\"Hamilton has an attractively skittish voice that lends the work a very individual cast. An accomplished collection.\"--Books in Canada\"I was impressed by the amazing insights; an incredible rendering of the pain and joys of truly loving relationships.\"--ARC\"...Hamilton knows how to forge tough language and difficult truths into poetry, and this collection includes many well-wrought and satisfying poems.The first section, “How We Are Counted,” contains poems that are primarily centred on the body, with a smattering of poems on mysticism and betrayal. Some of these poems struck me as brave, particularly “Apology”: “Eventually I was the liar… I betrayed you easily / as rain falls, as earth thirsts, / my fledg-ling hunger / parting its beak / for the worm, for the for the kiss, / the satisfying thrust.”Hamilton seems at her best when talking big poems with big subjects; some writers need the added weight of a big poem in order to really show some of their muscles, and this seems to be the case here. In “Barbara’s Garden,” written for a woman whose lover has died of cancer, Hamilton shows great facility with language: “the sky above Stanley Park feckled with stars, / the candles on our table unwavering…” The narrator imagines Barbara “listening for the vibration of life,” and “her articulate flight / through the thicket of the body.”It’s in the third section, “Window Box of Bruises,” that many of the tough and hard-won poems rise up. “Rising” shows the narrator shadowed by her dead friend in “October, that hell month… Four weeks / of changing clocks, of sparklers / moaning on the streets. Let Diane / tell you, using my tongue, gibbling / her story with my larynx and these / ugly teeth.” --Sarah Van Arsdale, Lesbian Review of Books\"Reading [these poems] is like reading other people's letters until, by the transforming magic good poems have, you discover they are all for you.\" -Jane Rule",
  "genres": [
    "LGBT",
    "Poetry"
  ],
  "author": "Eaton  Hamilton",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/4843483-steam-cleaning-love"
}