{
  "title": "Seirsha of Errinton",
  "description": "Sometimes the brightest love kindles in the bleakest of darkness.The people of Errinton are cold, but none is more so than their distant and aloof princess. At least, that's how Seirsha hopes to be seen. After living in the shadow of her father, the cruel King Bowen, the princess has learned to keep her distance, hiding her feelings and the love she has for her people. Seirsha finds peace only with a peasant family in the village and a very unlikely friend from the caves near the castle.But after her involvement in the death of the male heir to the Errintonian throne, Seirsha's defenses begin to crumble. The search for another successor begins, and the one man with the power to strip away the princess's walls steps back into her life.Seirsha knows she should keep her distance from Lord Rigel—the only man in Errinton with a legitimate claim to her father's throne—but when Bowen orders her to keep the dark lord close so she may spy on him, the princess must make a choice. With another Dragon War looming and Errinton's oppressed rising against their leaders, will Seirsha betray her blood or turn her back on Rigel—the man she's loved her entire life?Author's Note - This novel is darker than the previous two in the series and was written for a more mature audience. In writing this, I directly dealt with issues that the other novels only vaguely alluded to. The point of the story, however, is not the cancerous evil that has spread through the kingdom, but the light at the end of the tunnel--the hope in the darkness. For my younger readers and for those looking for a lighter read, this novel can be skipped without worry of missing important elements needed for the fourth book.",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Fantasy Romance",
    "Dragons",
    "Magic",
    "Historical"
  ],
  "author": "Shari L. Tapscott",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/48517057-seirsha-of-errinton"
}