{
  "title": "Garden of Beasts: A Novel of Berlin 1936",
  "description": "In the most ingenious and provocative thriller yet from the acclaimed New York Times bestselling author Jeffery Deaver, a conscience-plagued mobster turned government hitman struggles to find his moral compass amid rampant treachery and betrayal in 1936 Berlin.Paul Schumann, a German American living in New York City in 1936, is a mobster hitman known as much for his brilliant tactics as for taking only \"righteous\" assignments. But then Paul gets caught. And the arresting officer offers him a stark choice: prison or covert government service. Paul is asked to pose as a journalist covering the summer Olympics taking place in Berlin. He's to hunt down and kill Reinhard Ernst—the ruthless architect of Hitler's clandestine rearmament. If successful, Paul will be pardoned and given the financial means to go legit; if he refuses the job, his fate will be Sing Sing and the electric chair.  Paul travels to Germany, takes a room in a boardinghouse near the Tiergarten—the huge park in central Berlin but also, literally, the \"Garden of Beasts\"—and begins his hunt. In classic Deaver fashion, the next forty-eight hours are a feverish cat-and-mouse chase, as Paul stalks Ernst through Berlin while a dogged Berlin police officer and the entire Third Reich apparatus search frantically for the American.  Garden of Beasts is packed with fascinating period detail and features a cast of perfectly realized locals, Olympic athletes and senior Nazi officials—some real, some fictional. With hairpin plot twists, the reigning \"master of ticking-bomb suspense\" (People) plumbs the nerve-jangling paranoia of prewar Berlin and steers the story to a breathtaking and wholly unpredictable ending.",
  "genres": [
    "Fiction",
    "Thriller",
    "Historical Fiction",
    "Mystery",
    "Crime",
    "Historical",
    "Suspense"
  ],
  "author": "Jeffery Deaver",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/485016.Garden_of_Beasts"
}