{
  "title": "Where the Devil Says Goodnight",
  "description": "--- Forgive me, Father, for I will sin ---Adam. Catholic priest. Celibate. Does not yield to temptation. Emil. Sinner. Seducer. Snake. Hot as hell itself.After a sheltered childhood ruled by religion, all Adam wants is to be a good priest and make his parents proud. But it’s hard to stay virtuous in a big city like Warsaw, and when he makes one slip up, his life spirals into ruin. He is sent to a tiny mountain village where he hopes to live down his shame and work on restraint.But staying celibate becomes far from easy when he meets Emil, a local man with long dark hair, a mysterious past, and as little morality as he has luck. Emil has no qualms about flirting with a priest. Worse still, he seems hell-bent on tasting forbidden fruit and unearthing the desires Adam has always kept hidden.The odd village hides secrets far more sinister than Adam's insatiable lust for Emil. Old Slavic magic looms everywhere. Superstition mixes with reality. Someone is watching his every move. Someone follows him in the dark, lurking in the shadows of the ancient forest. Adam is plagued by disturbing events, and Emil could be his only salvation even if he is the devil himself.Can a priest shepherd the black sheep to safety or has he been the wolf all along?POSSIBLE SPOILERS:Genre: Dark, paranormal M/M romance Erotic content: Scorching hot, emotional, explicit scenesThemes: Occult, witchcraft, Slavic superstition and myth, folklore, priest, forbidden love, hurt/comfort, metalhead, little town, temptation, religion, paganism, cult, old gods, possession, demons, magic, homophobia, bigotry, prejudice, coming out, fish out of water, soul mates, mysterious man, tease and denialLength: ~ 120,000 words (standalone)WARNING: This story contains scenes of violence, offensive language, self-harm, and morally ambiguous characters.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Fantasy",
    "Dark",
    "Romance",
    "Horror",
    "Dark Romance"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/48507044-where-the-devil-says-goodnight"
}