{
  "title": "Witches Abroad",
  "description": "The Whole Discworld Better Watch Out When A Witch Like Magrat Garlick Suddenly Becomes A Fairy Godmother...\"I niver had time to Trane a replaysment so youll have to Do. You must goe to the city of Genua. I would of done thys myself only I cannot by reason of bein dead. Ella Saturday muste NOTTE marry the prins.\"Magrat looked at the slim white wand that had come with the note. \"Oh, my,\" she said. \"I'm a fairy godmother...\"It's sad by true: Death waits for no one, not even a fairy godmother. So when Emberella's Fairy Godmother Desiderata was unexpectedly \"called away,\" it fell to three of the Discworld's most dedicated witches -- Magrat Garlick, Granny Weatherwax and Nanny Ogg -- to grab their broomsticks and keep the dear departed Desiderata's appointment in far distant Genua.Their mission was to save the beautiful, innocent Emberella from her *other* fair godmother's determination to create a traditional \"happy ending.\" A happy ending that would see sweet young Ella married off to the highly questionable Duc -- and leave the godmother herself in charge of not only the royal newlyweds, but all of Genua.Before they reached the end of their breakneck and ill-prepared-for journey, Magrat, Nanny and Granny faced all the usual travelers' woes, plus more than their quota of storybook encounters -- from a vampire who was terrorizing a small town, to a little red-hooded girl and the extremely confused werewolf who was pursuing her -- not to mention the problems caused by Magrat's newly aquired wand, which would only do pumpkins.But their troubles didn't really begin until they reached the city of Genua. for sweet-talk and spells were useless in full-blown case of fairy godmother rivalry!",
  "genres": [
    "Fantasy",
    "Fiction",
    "Humor",
    "Comedy",
    "Witches",
    "Audiobook",
    "Science Fiction Fantasy"
  ],
  "author": "Terry Pratchett",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/12472833-witches-abroad"
}