{
  "title": "Puck You",
  "description": "Six hockey players who hate me to the bone vs. one sassy, smart, sophisticated journalist?  Oh, this will be fun.  I’ve spent years making these six muscle-bound, irresistible bad boys’ lives hell. And now, they’re going to take out all their frustrations… on me.  The Seattle Stormbreakers are the National Hockey League’s reckless, rebellious rule-breakers. They’re unstoppable on the ice and legendary for their hard-partying. Every girl in the city knows exactly how smoking hot every last squad member is:  Swaggering ladies' man captain Donovan Stone.  Tough guy center-forward Jared Southern.  Wealthy playboy Chase Halloway.  Wild and reckless defenceman Garrett Fleming.  Lawless good ol’ boy Ash .  And last but not least, strong, silent Piotr Zhernakov, the team's big, tall, imposing Russian goalie.  Six hockey-playing bad boys would be a lot for anyone to handle, but in my case, it just means that I’m six-ways screwed. The Stormbreakers hate me, and they’re not afraid to show it, either.  As a tabloid journalist, I’ve built a career on reporting every naughty scandal and steamy story to come out about the team. So when the Stormbreakers’ owners hire me as their new PR manager, I find myself thrown in with six studs who all want a piece of me. I’ll clean up their image, but first, I’ll have to get dirty with the whole team.  This is a hot, over-the-top reverse harem romance with no cheating and a happily-ever-after. Puck You is a fast, fun, ultra-steamy high-heat romp featuring six bad boy alpha males and one lucky lady who doesn’t have to choose.  Each book in this series is a standalone romance, but if you think you can handle a full season, read all four in order to see who takes the cup!",
  "genres": [
    "Sports",
    "Hockey",
    "Reverse Harem",
    "Romance",
    "Sports Romance",
    "Contemporary"
  ],
  "author": "Mia Wilde",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/48560578-puck-you"
}