{
  "title": "Two Sisters and the Christmas Groom",
  "description": "Annie Flanagan happily moves to Jubilee Springs to work as a maid for Delly Nighy, the daughter of her former New York City employer. Very few know that her next younger sister, Kate, has signed up with the Colorado Bridal Agency and started writing to an Irish miner, Michael O’Hare, in the same town. Both Annie and her mother back in New York grow concerned when the second man the bridal agency puts Kate in contact with is a miner in Central City. He’s not Irish—and he’s not Catholic. What is worse, she seems to prefer him over Michael. Kate Flanagan, working as a scullery maid to help support her family, desperately desires to escape the dead-end poverty allotted to Irish women living in the lower east side of Manhattan in New York. Anxious to find a husband out west, she signs up with the bridal agency suggested by her sister. After living with her alcoholic father, she is leery of choosing Irishman Michael O’Hare for a husband. As much as she wants to live near her sister, dare she take the chance Michael O’Hare will not turn out like her da—a man who pulls his children from school and puts them to work to support the family while he uses his wages to buy whiskey? Annie and Michael grow closer as they work together in order to persuade Kate to come to Jubilee Springs. They know she needs to come soon—before winter sets in and disrupts the railroad service to the high mountain mining community. Kate agrees to travel to Jubilee Springs before Christmas, but several factors combine which threaten to derail this romance. Michael knows what he promised. He knows what he wants. In the end, will he marry the bride who has captured his heart? This sweet romance is part of the multi-author series, Sweethearts of Jubilee Springs. It is also the starting novel of the author’s own spin-off sub-series of Train Wreck in Jubilee Springs. If you enjoy this book, you might also enjoy Nathan's Nurse and Kate's Railroad Chef.",
  "genres": [
    "Romance",
    "Western Romance"
  ],
  "author": "Zina Abbott",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/48560631-two-sisters-and-the-christmas-groom"
}