{
  "title": "Trail Fever: Spin doctors, rented strangers, thumb wrestlers, toe suckers, grizzly bears, and  other creatures on the road to the White H",
  "description": "A wickedly funny and astute chronicle of the 1996 presidential campaign--and how we go about choosing our leaders at the turn of the century. In it Michael Lewis brings to the political scene the same brilliance that distinguished his celebrated best-seller about the financial world, Liar's Poker.Beginning with the primaries, Lewis traveled across America--a concerned citizen who happened to ride in candidates' airplanes (as well as rented cars in blinding New Hampshire blizzards) and write about their adventures. Among the contenders he Pat Buchanan, a walking tour of American anger; Lamar Alexander, who appealed to people who pretend to be nice to get ahead; Steve Forbes, frozen in a smile and refusing to answer questions about his father's motorcycles; Alan Keyes, one of the great political speakers of our age, whom no one has ever heard of; Morry Taylor--\"the Grizz\"--the hugely successful businessman who became the refreshing embodiment of ordinary Americans' appetites and ambitions; Bob Dole, a man who set out to prove he would never be president; and Bill Clinton, the big snow goose who flew too high to be shot out of the sky.We watch the clichés of this peculiar subculture collide with characters from the real a pig farmer in Iowa; an evangelical preacher in Colorado Springs; a homeless person in Manhattan; a prospective illegal immigrant in Mexico. The politicians speak and speak, often reversing positions, denying direct quotations, mastering the sound bite, dodging hard questions, wreaking havoc on the English language. Spin doctors spin. Rented strangers (campaign workers) proliferate. One particular toe sucker goes awry. Ads are honed to misrepresent and distort. Money makes the world go round.And the citizens are left dumbfounded or cheering empty platitudes. When trail fever breaks on Election Day, half of America's eligible voters stay home.This book offers a striking look at us and our politics and the mammoth unlikelihood of connection between the inauthentic modern candidate and the voter's passions, needs, and desires. In telling the story, Michael Lewis once again proves himself a masterful observer of the American scene.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Business",
    "Presidents",
    "United States",
    "American History"
  ],
  "author": "Michael   Lewis",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/485613.Trail_Fever"
}