{
  "title": "The Battles for Spotsylvania Court House and the Road to Yellow Tavern, May 7-12, 1864",
  "description": "The Battles for Spotsylvania Court House and the Road to Yellow Tavern, May 7–12, 1864 continues Gordon C. Rhea’s peerless treatment of the Civil War’s clash of Grant’s Army of the Potomac versus Lee’s Army of Northern Virginia. Inlaid with detail, innovative analysis, riveting prose, and an abundance of supporting primary evidence, it is a worthy sequel to Rhea’s first, acclaimed work, The Battle of the Wilderness, May 5–6, 1864.Here Rhea examines the maneuvers and battles from May 7, 1864, when Grant left the Wilderness, through May 12, when his attempt to break Lee’s line by frontal assault reached a chilling climax at what is now called the Bloody Angle.After suffering severe casualties in the Wilderness, Lee had no choice but to curb his aggressive instincts and prepare for a defensive battle at Spotsylvania. Perfecting the art of fieldworks (which foreshadowed the trenches in France during World War I), he orchestrated his threadbare veterans in a defensive performance that ranks as a classic in military history. Grant, sworn to destroy Lee’s army, had to solve the knotty problem of penetrating his adversary’s confounding, well-appointed earth-works. He mounted a volley of assaults that proved slaughterous for both armies and led to a turning point in his strategic thinking. Contributing to the carnage were advances in weaponry that by 1864 had outstripped the Napoleonic warfare of the day. The result was massive on May 12 alone, Lee lost eight thousand men; Grant, nine thousand.Rhea draws exhaustively upon previously untapped materials―most notably contemporary newspaper accounts and diaries and letters only recently made available―to construct the definitive account of Grant and Lee at Spotsylvania. Here for the first time is a detailed description of the cavalry’s role in the campaign, from the grim fighting at Todd’s Tavern through Philip Sheridan’s Richmond raid and Jeb Stuart’s mortal wounding at Yellow Tavern. Here, too, are fresh and challenging interpretations that often contradict conventional wisdom.When May 13 dawned to an eerie silence, there was no clear victor of the previous days’ battles. As Rhea states in his epilogue, the end was not yet in sight. The wily Lee and bulldog Grant would soon meet again.",
  "genres": [
    "Civil War",
    "History",
    "American Civil War",
    "Military History",
    "Nonfiction",
    "American History",
    "Military Fiction"
  ],
  "author": "Gordon C. Rhea",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/485302.The_Battles_for_Spotsylvania_Court_House_and_the_Road_to_Yellow_Tavern_May_7_12_1864"
}