{
  "title": "While the Music Played",
  "description": "A Remarkable Story of Courage and Friendship in WW II \"We were the dreamers of dreams, the singers of songs. We were the music makers. We would not hear nor play nor love without each other. This is a prelude to our experience, an overture to who we were and how we arrived on the shores of friendship.\" Beginning in 1939 pre-war Prague, WHILE THE MUSIC PLAYED focuses on the story of young Max Mueller, a curious bright romantic—a budding musician, piano tuner, and nascent journalist. Max is on the cusp of adolescence and facing a rapidly changing world as the Nazi influence invades Prague's tolerant spirit with alarming speed, compromising those Max loves even as he struggles to understand. While his father, noted German conductor Viktor Mueller, is drafted into the German army and finds himself increasingly involved with Nazi propaganda; Viktor's best friend, noted Czech composer Hans Krása, protests the occupation in every way he can. As everyone Max knows and loves chooses sides and accepts the consequences, he becomes increasingly isolated, and forced to find his own way. With each step, Max's journey grows more fraught until music is the one constant tying him to both the lost childhood he cherishes and the man he still hopes to become. But will it be enough to sustain him against the relentless Nazi threat? With a seamless blend of historical and fictional characters, told from multiple points of view, and sweeping across the capitals of Prague, London, and Berlin as World War II ravages Europe, this meticulously researched book is unique with its diverse and interweaving narratives, threaded with news accounts, and including some of the most triumphant and devastating moments of the war—from the opera houses of Berlin to the music halls of London and the making of the famous children's opera Brundibár. \"WHILE THE MUSIC PLAYED is a lyrical, absorbing, and heart-breaking story of love and courage from the widely revered and best-selling author Nathaniel Lande",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Music",
    "World War II",
    "War",
    "Coming Of Age",
    "Audiobook"
  ],
  "author": "Nathaniel Lande",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/48563701-while-the-music-played"
}