{
  "title": "Magnetized: Conversations with a Serial Killer",
  "description": "A riveting psychological portrait for readers of true crime classics such as My Dark Places, The Stranger Beside Me, and I’ll Be Gone In the Dark, one of Argentina’s most innovative writers brings to life the story of a serial killer who, in 1982, murdered four taxi drivers without any apparent motive.Over the course of one ghastly week in September 1982, the bodies of four taxi drivers were found in Buenos Aires, each murder carried out with the same cold precision. The assailant: a nineteen-year-old boy, odd and taciturn, who gave the impression of being completely sane. But the crimes themselves were not: four murders, as exact as they were senseless.More than thirty years later, Argentine author Carlos Busqued began visiting Ricardo Melogno, the serial killer, in prison. Their conversations return to the nebulous era of the crimes and a story full of missing pieces. The result is a book at once hypnotic and unnerving, constructed from forensic documents, newspaper clippings, and interviews with Melogno himself. Without imposing judgment, Busqued allows for the killer to describe his way of retreating from the world and to explain his crimes as best he can. In his own words, Melogno recalls a visit from Pope Francis, grim depictions of daily life in prison, and childhood remembrances of an unloving mother who drove her son to Brazil to study witchcraft. As these conversations progress, the focus slowly shifts from the crimes themselves, to Melogno’s mistreatment and mis-diagnosis while in prison, to his current fate: incarcerated in perpetuity despite having served his full sentence.Using these personal interviews, alongside forensic documents and newspaper clippings, Busqued crafted Magnetized, a captivating story about one man’s crimes, and a meditation on how one chooses to inhabit the world, or to become absent from it.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Psychology",
    "History",
    "Adult"
  ],
  "author": "Carlos Busqued",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/48577217-magnetized"
}