{
  "title": "Ông tớ là cây anh đào",
  "description": "\"Rất nhiều lần mẹ kể với tớ rằng, hồi bé mẹ rất thích trèo lên cây anh đào và nghĩ ra đủ thứ trò chơi trên đó. Tớ lắng nghe mẹ và cảm thấy thật ghen tị, bởi vì mỗi lần bố mẹ cho tớ về với ông bà ngoại, thời gian thật là ít ỏi, Felice thì lại quá cao và tớ thì lại quá bé để có thể một mình leo lên cái cây.Khi nào ông ngoại không bận bịu với vườn cây hay với những con gà, ông sẽ đưa tớ lên: ông buộc chặt dây giày, rồi ông cõng tớ lên vai và leo thoăn thoắt lên cao, như một chú khỉ trưởng thành và một chú khỉ con.\"Ông tớ là cây anh đào đã được xuất bản ở 23 nước, được đề cử giải thưởng văn học Deutsche Jungenliteratur tại Đức năm 2002, đạt giải thưởng Prix Chronos tại Pháp và giải thưởng Văn học dịch hay nhất tại Slovakia năm 2008.Kể từ khi được xuất bản, câu chuyện tinh tế và truyền cảm này đã làm biết bao trẻ em và người lớn trên khắp thế giới phải xúc động.Angela Nanetti sinh ra tại Budrio, Ý. Bà từng giảng dạy môn tiếng Ý tại các trường cấp ba và cấp hai, đồng thời tham gia vào nhiều hoạt động nghiên cứu Văn học. Trong những năm 80, bà tham gia vào các hoạt động biên tập tại các dự án sách lớn. Cùng thời điểm đó, bà ra mắt cuốn tiểu thuyết trẻ em đầu tay của mình. Cuốn sách đã được dịch ra nhiều thứ tiếng và nhận được nhiều giải thưởng danh giá.Sau một loạt các tác phẩm tiếp theo, Angela Nanetti đã khẳng định được khả năng viết vượt trội của mình, đặc biệt là khả năng nắm bắt và miêu tả tâm lý nhân vật ở các lứa tuổi. Từ năm 1995, bà nghỉ dạy và dành toàn bộ thời gian cho việc viết văn, từ đó có được danh tiếng cả ở trong nước và quốc tế.Một số giải thưởng bà được trao tặng:- Giải thưởng Andersen cho Văn học thiếu nhi năm 2003- Thành viên danh dự của Hiệp hội Nhà văn và Nghệ sĩ Ý- Đại diện của của Hội nhà văn và các nghệ sĩ châu Âu và Ý tại Ý- Giải thưởng danh dự Budrio trao vào ngày Quốc khánh ý năm 2005",
  "genres": [
    "Childrens",
    "Fiction",
    "Italian Literature",
    "Italy",
    "Young Adult",
    "Contemporary",
    "Family"
  ],
  "author": "Angela Nanetti",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/48570796-ng-t-l-c-y-anh-o"
}