{
  "title": "McIntyre Security Bodyguard Series - Box Set 3",
  "description": "McIntyre Security Bodyguard Series - Box Set 3  This box set contains the following four novels:  Hostage  Beth and Shane have it all. They're married and expecting their first child. They've never been happier.  A weekend getaway puts Beth in the wrong place at the wrong time, and all hell breaks loose, putting both Beth's life and her baby's life in mortal danger.  When the unexpected happens, can Shane save his family? Can this alpha protector pull his wife back from the edge before it's too late?  Hostage is book 7 in the McIntyre Security Bodyguard Series. It's a full-length novel (70,000 words) that ends in a wonderful HEA.  Redeemed  Annie  Ten years ago, I made the biggest mistake of my life And I’ve paid the price every day since then, both in body and spirit Now I’m desperate, and the only man who can save me is the one I betrayed so long ago. I don’t deserve his forgiveness. He doesn’t owe me a thing. But like the hero he is, that won’t stop him from risking his life to save me…. even when I don’t deserve it.  Jake  My life ended the day Annie broke our engagement and married another man. I’ve been going through the motions ever since, unable to forget her. Unable to move on. I gave her my heart, and I don’t do give-backs, so she’s stuck with it, whether she wants it or not. When I find out she’s in danger, I’ll move Heaven and Earth to protect her, regardless of what it costs me. She doesn’t owe me a thing, but damn, I’ll go to my knees for her. For just one look, one touch, one word.   Marry Me  Lia McIntyre Lia's been with Jonah for nearly two years now. She loves her rock star boyfriend with a heart of gold. But deep down, she struggles with insecurity. She knows Jonah wants more with her, but she's afraid she can't live up to his expectations. And she thinks it's only a matter of time before he figures that out for himself.  Jonah Locke Ever since leaving L.A. and his lucrative recording contract, Jonah Locke is thriving as an independent singer/songwriter. He's more popular than ever. He's living his dream, except for one small part. He wants to marry Lia. But every time he asks, she changes the subject. What's it going to take to get her to realize he's for real?  Snowbound Fans of the McIntyre Security Bodyguard Series will love this new novella featuring Beth and Shane, as well as other favorites, including Luke, Sam, Cooper, Erin and Mack. This suspenseful Christmas novella will best be enjoyed as part of the series.",
  "genres": [],
  "author": "April  Wilson",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/48564542-mcintyre-security-bodyguard-series---box-set-3"
}