{
  "title": "The Law of Attraction Game Book: 28 Days of Love: SPARK Your Self Worth With Daily Inspiration. IGNITE Your Self Esteem and Self Confidence With FUN!",
  "description": "* A Canada Book Awards WINNER *\n\n  Are You Ready for a World of Love And Appreciation? \n\nWithin this book lies a playful journey, one that will reveal the secrets of your special and unique nature. Create a new reality - a reality of wonder, adventure and expansion. With small but powerful daily exercises, you will: \n   Give yourself the attention you don't need to crave from anywhere or anyone else! \n   Feel optimistic instantly and gain the courage to move onwards and upwards \n   Experience phenomenal and genuine connections and relationships. \n   Flood your conscious mind with PROOF of your unique strengths and self-worth. \n   Connect with your Higher Self for inspiration \n   Rediscover who you really are, so you can move forward with purpose \n   Recognize your impact in the world around you \n   Embrace your power, your voice and your mind! \n   See for yourself that you have worth and incredible, priceless value! \n \n\n\nAs you play, you will change the direction of your life by focusing your attention where it really matters.\nAs soon as you begin to play, you awaken and unleash that secret part of you that is ready to THRIVE. \n“In this Game, you will start the FIRE of self-love, by reclaiming your attention towards YOU.”\nThis is the first step in the manifesting cycle...\nAwaken the magic within. And engage the secret power that supercharges manifesting.\n\nLovers of books by Esther Hicks, Pam Grout and Rhonda Byrne will enjoy this magical and experiential self-love book for men and women! \n\nAt the end of the Game Book, you’ll find a secret link to powerful bonuses:\nBONUS 1:           \nAn incredible 1-hour audio interview recording with New World Library founder Marc Allen.\nBONUS 2:           \nA guided Love meditation.\nBONUS 3:           \nThe Law of Attraction Goal Planner LoveSheet (on Excel).  \n\n\nPRAISE:\n\nBEST-SELLING AUTHOR MARISSA STAPLEY, Things to Do When It’s Raining\n“Wonderfully enlightening. I just loved this book. Khajuria's writing style is inspiring, kind and gently persuasive. It feels like having a conversation with a good friend, and contained many lessons about manifesting and living my best life that I'm going to carry with me. Highly recommend!”\n\n\nREADER’S FAVOURITE (5 STARS)\n\"…I was struck by the imagination and love of life that went into each day's offering. The first day's subject alone had me thinking about things in an entirely new and positive light... Law of Attraction Game Book: 28 Days of Love is most highly recommended.",
  "genres": [],
  "author": "P.K.  Davies",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/48575685-the-law-of-attraction-game-book"
}