{
  "title": "Ausgebrannt",
  "description": "Ausgebrannt - das ist Andreas Eschbachs dramatisches Endzeit-Szenario, das uns in die Zeit der versiegenden Ölreserven katapultiert. Wir erleben ein düsteres Szenario, das uns drastisch und spannungsgeladen vor Augen führt, wohin der immer größere Hunger nach Öl führen könnte.Als Markus Westermann in New York zum ersten Mal amerikanischen Boden betritt, ist das für ihn ein magischer Moment: Endlich ist er im \"Land der unbegrenzten Möglichkeiten\", wo er ganz groß rauskommen will. Sein amerikanischer Traum scheint jedoch ausgeträumt, bevor er richtig begonnen hat: Seine Firma will ihn entlassen. Zufällig lernt er den Österreicher Karl Block kennen. Der behauptet, mit einer einzigartigen Methode Erdöl finden zu können. Markus Westermann wittert seine Chance und tatsächlich: Die beiden überzeugen eine einflussreiche Risikokapitalgesellschaft und schwimmen bald im Geld. Westermann ist auf der Überholspur - bis nicht nur ihm, sondern auch den Saudis plötzlich das Öl ausgeht. Die Welt, wie wir sie kennen, gerät aus den Fugen.Andreas Eschbach, bekannt geworden vor allem durch seinen Thriller Das Jesus-Video, weiß, wie man eine spannende Geschichte schreibt. Auch in Ausgebrannt webt er ein Netz aus Personen, Handlungssträngen, Orten und Epochen, das den Leser - ob er will oder nicht - in seinen Bann schlägt. Die Geschichte von Markus Westermann wird dabei erst nach und nach klar - Eschbach arbeitet häufig mit Rückblenden und Zeitsprüngen, zum Teil zu Ereignissen, die weit vor der eigentlichen Erzählung liegen; ganz allmählich weitet sich so die Perspektive. Und indem der Autor viele gut recherchierte Details einarbeitet, stehen plötzlich historisch scheinbar so entfernte Episoden wie der Bau der Bagdad-Bahn und die Terrorflieger vom 11. September 2001 in einem Zusammenhang.Denn neben den Ereignissen um Markus Westermann erzählt Eschbach auch eine andere Geschichte: die Geschichte der globalisierten Welt, die förmlich am Öltropf hängt, und in der gewiefte Marketingleute, Berater und Finanzexperten mit Milliarden jonglieren. Produktion, Mobilität, Konsum, ja, unser gesamter Lebensstil wären ohne das schwarze Gold schlicht nicht möglich. Was diese Abhängigkeit für uns alle im Ernstfall bedeuten könnte, macht sich aber wohl kaum jemand klar. In Ausgebrannt spielt Eschbach diese Frage bis zum Ende durch - und bietet mit seinem Szenario, das eine ungemütliche Zukunft verheißt, wichtige Denkanstöße. --Holger Sweers, Literaturtest",
  "genres": [
    "Thriller",
    "Fiction",
    "Science Fiction",
    "German Literature",
    "Dystopia",
    "Audiobook",
    "Novels"
  ],
  "author": "Andreas Eschbach",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/4856263-ausgebrannt"
}