{
  "title": "Gods and Monsters Box Set 1",
  "description": "What could possibly be worse than dying at the hands of an evil God?Becoming his obsession...A Dark Gods Romance, Books 1-3.“I can tear your throat out right here,” he said, his voice a hushed whisper of threats and spilled blood. “I could kill you a thousand different ways where you sit.”The nail cut deeper. Blood beaded, then spilled down my front, over my breasts. I choked on a whimper.“Now tell me everything.”1. Prince PoisonFew knew Valissa's secret but it already carried a death toll. One.If the Gods ever discovered what she was, they would capture and flay her alive.But in the land of Gods and Monsters, no secret stays hidden for long.Lissa—drunk on the high of a midnight party that's rife with mysterious pirates—gets too close to one of the pirates, who turns out to have secrets of his own.Jasper is no pirate. He is a servant of the Gods. And the moment she touches him, she steals his power.He kidnaps Lissa, and he's taking her to one of the most brutal Gods in all the lands ... He's taking her to Prince Poison.Prince Poison's mere touch kills and his cruelty is said to stretch beyond even the darkest pits of Lissa's soul. But when she's standing in front of this fearsome God, ready to face her gruesome fate, the Prince might see more in her than she ever thought possible.2. CaptiveValissa is an abomination among Gods and Monsters.She's cursed with the unexplained ability to steal power from the children of the Gods. It's a curse worthy of death, but her fate is much worse than that.Prince Poison, the cruelest of them all, keeps her captive in the stardust palace, where she's forced to train her abilities into something that terrifies her, while evading the malicious interest of those around her.What's worse than holding the interest of a God whose touch kills and whose lips enchant?Becoming his captive...3. PhantomValissa’s death toll is on the rise:One—before she was stolen away to the cruel Prince Poison. Seven—under the Prince’s malicious watch.The worst part? Valissa just doesn’t care anymore, not about the lives of those she doesn’t know when her own life is falling apart all around her.Ava’s not speaking to her. Jasper pushes her in training to the point of exhaustion. And though Valissa does everything he wants, the Prince grows distant.Valissa finds the closest thing to a friend in the mysteriously dark stranger who haunts her in the stardust palace. Damianos; a God or aniel she most definitely knows better than to trust.In the Land of Gods, is it really ‘better the devil you know’? And what about when the devil you don’t know is just so damn intoxicating?What’s worse than being the prisoner of a God?Abandoning all hopes of freedom.This is Box Set 1 of 2. It includes the first three books in the Gods and Monsters 6-book series.Box Set 2 is available for preorder, release date: January 2020.Disclaimer: Please read content warnings.",
  "genres": [
    "Fantasy",
    "Dark",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Enemies To Lovers",
    "Dark Romance"
  ],
  "author": "Klarissa King",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/48594027-gods-and-monsters-box-set-1"
}