{
  "title": "Accused of Treason: The US Army's Witch Hunt for a Jewish Spy",
  "description": "February 1997 was the date that changed the Tenenbaum family’s lives forever.Dr. David A. Tenenbaum is a civilian mechanical engineer who works for the Army at the TACOM base in Warren, Michigan. In 1997, he was falsely accused of being an Israeli spy—and having dual loyalty to the State of Israel simply because he is Jewish—by a known anti-Semite and several other anti-Semitic coworkers who referred to Tenenbaum as the “little Jewish spy.” The FBI conducted a full-scale criminal investigation of Tenenbaum and his family. It resulted in an official report to FBI Director Louis Freeh, that there was no evidence Tenenbaum had ever done anything wrong. In fact, Tenenbaum was not even working on classified programs. Instead, he was concentrating on an approved and unclassified program known as the Light Armor Systems Survivability (LASS) to up-armor the Army’s HMMWVs because, following Somalia, it was a known fact that the HMMWVs were death traps.The Tenenbaums’ federal lawsuit for religious discrimination was dismissed after the Army falsely claimed that they “would not be able to disclose the actual reasons or motivations for their actions without revealing state secrets.” Senator Carl Levin ordered the IG-DOD to investigate the Tenenbaum case and determine if the Army was guilty of anti-Semitism. After over two years, the IG-DOD issued a report which confirmed that the US Army was guilty of anti-Semitism.To this day, the Army refuses to make Tenenbaum whole and compensate him for the false accusations against him. Tenenbaum is one of the only persons for whom a favorable Inspector General report has been issued to not be compensated. The government has never been held accountable for their anti-Semitism.Senators Gary Peters and Claire McCaskill of the Senate Homeland Security and Governmental Affairs Committee have pushed the Army, but the Army refuses to acknowledge the Inspector General’s findings of religious discrimination against Tenenbaum. The Army also refuses to accept that the price of prejudice against Tenenbaum was borne by the soldiers lost in Humvees who would have benefitted from the LASS program.",
  "genres": [],
  "author": "David A. Tenenbaum",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/48590146-accused-of-treason"
}