{
  "title": "Tracking the Vanishing Frogs: An Ecological Mystery",
  "description": "When considering endangered species, public concern is most intense for the more visible and charismatic of animals - such as dolphins, koala bears, buffaloes. But in recent years, there is one creature whose decline could have a monumental impact on the world - the humble frog.In 1990, a group of scientists sounded an unusual alarm that was literally heard around the earth. Frogs and their cousin amphibians, the researchers warned, are declining in number and facing extinction at an unusually fast pace. And, some suggested, this decline could be a signal that human-caused environmental degradation has reached a new and potentially lethal level.Kathryn Phillips heard the alarm and followed the scientists as they responded to the possible catastrophe. Some headed straight into the wetlands and woodlands, with Phillips tagging along, to search for and study the disappearing amphibians. Others turned to their laboratories and experiments to seek the answer. One straddled the boundary between scientist and conservationist and took on a badly managed U.S. Forest Service to save a rare toad.Phillips tells a riveting story of these scientists' efforts to comprehend why their beloved frogs are dying. She draws a fascinating real-world picture of how scientists and science works, and she explores and clearly explains the environmental problems that threaten frogs - and people. And she entertains with some of the quirkier characteristics of frogs and the humans who study them.Both enlightening and entertaining, Ms. Phillips brilliantly explores the mystery of the extinction of this biological \"barometer\" of the planet's environment in a book that is paradoxically and simultaneously terrifying and delightful.",
  "genres": [
    "Nature",
    "Science",
    "Nonfiction",
    "Ecology"
  ],
  "author": "Kathryn Phillips",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/4858458-tracking-the-vanishing-frogs"
}