{
  "title": "The Book of Lost Friends",
  "description": "From the #1 \n\nNew York Times\n\n bestselling author of \n\nBefore We Were Yours\n\n comes a new novel inspired by historical events: a dramatic story of three young women on a journey in search of family amidst the destruction of the post-Civil War South, and of a modern-day teacher who rediscovers their story and its vital connection to her own students' lives.\nIn her distinctive voice, Lisa Wingate brings to life startling stories from actual \"Lost Friends\" advertisements that appeared in Southern newspapers after the Civil War, as freed slaves desperately searched for loved ones who had been sold off.Louisiana, 1875:  In the tumultuous aftermath of Reconstruction, three young women set off as unwilling companions on a perilous quest: Lavinia, the pampered heir to a now-destitute plantation; Juneau Jane, her illegitimate free-born Creole half-sister; and Hannie, Lavinia's former slave. Each carries private wounds and powerful secrets as they head for Texas, following dangerous roads rife with ruthless vigilantes and soldiers still fighting a war lost a decade before. For Lavinia and Juneau Jane, the journey is one of inheritance and financial desperation, but for Hannie, torn from her mother and eight siblings before slavery's end, the pilgrimage westward reignites an agonizing question: Could her long-lost family still be out there? Beyond the swamps lie the seemingly limitless frontiers of Texas and, improbably, hope.Louisiana, 1987:  For first-year teacher Benedetta Silva, a subsidized job at a poor rural school seems like the ticket to canceling her hefty student debt—until she lands in a tiny, out-of-step Mississippi River town. Augustine, Louisiana, seems suspicious of new ideas and new people, and Benny can scarcely comprehend the lives of her poverty-stricken students. But amid the gnarled live oaks and run-down plantation homes lies the century-old history of three young women, a long-ago journey, and a hidden book that could change everything.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Audiobook",
    "Historical",
    "Civil War",
    "Adult"
  ],
  "author": "Lisa Wingate",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/48580647-the-book-of-lost-friends"
}