{
  "title": "Broadway Nights: A Romp of Life, Love, & Musical Theatre",
  "description": "\"No one out there knows Broadway or can tell a story like the a-mahzing Seth Rudetsky.\"—Jonathan Groff, Tony-nominated actor/singer, \"Spring Awakening\" “BROADWAY NIGHTS literally made me laugh out LOUD. Seth Rudetsky is the funniest man I know. Period.” —Kristin Chenoweth, Tony award-winning actress “Seth Rudetsky knows every skeleton in (or out) of the closet on Broadway and his passion, joy and encyclopedic knowledge of that Magic Kingdom inform every sentence of this book. He makes our age, this age, seem Golden, too, and he is right about that.” —Terrence McNally, playwright “I love Seth Rudetsky! He is Mr. Broadway! Seth's love for the Musical Theatre equals my own and his knowledge of all things Broadway is an obsession to be cherished. His chronicle of the journey of starstruck kid to Broadway pianist/conductor is a wonderful every-theatre-kid tale with wicked humor and New York City savvy, sass and insight. I LOVE THIS BOOK!” —Betty Buckley,Tony award-wining actress/singer \"Seth Rudetsky belts a high comedic note in this hilariously reflective, mile-a-minute insight about the real people who travel the Great White Way.\"—Ana Gasteyer, Actress/Singer, \"Saturday Night Live\", \"Wicked\" \"Seth Rudetsky's book is everything you want to know about Broadway AND Funny!\"—Lea DeLaria, Actress/Comedian, \"The Rocky Picture Horror Show\" “Seth Rudetsky works in the pits, but his book is anything but. A laugh-filled excursion to Broadway with a guide who knows where all the phantoms are buried. Even if the closest you ever get to the Broadway jungle is second mezz at “The Lion King,” you'll have a good time” —Bruce Vilanch, Actor-Writer-One-time-Square Welcome to life beneath the wicked stage! Stephen Sheerin was born to play on Broadway—or at least, under it. He’s a musician, a conductor, and his dream is to music direct a big Broadway musical. After years of toiling in the pit of some of the best-loved (and loathed) hits on the Great White Way, he’s just been given his big break. Can life really be going that well? Of course not—his family is driving him crazy and his boyfriend can’t seem to get rid of his other boyfriend. Then there’s Stephen himself—neurotic and bitchy—who realizes that maybe total happiness is over-rated.",
  "genres": [
    "Fiction",
    "Humor",
    "Theatre",
    "Audiobook",
    "LGBT",
    "Romance",
    "Contemporary"
  ],
  "author": "Seth Rudetsky",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1247474.Broadway_Nights"
}