{
  "title": "In Sequence",
  "description": "ABOUT THIS EPISODE  The Golden Ratio killer resurfaces in California to target a former victim, and this time the case takes Malcolm and Seong-Jae hunting deep into his past, searching for connections between victim and killer that may reveal his identity. But with the killer one step ahead of them, toying with them, leaving false trails at every turn, it's like playing Russian Roulette — and if they guess the wrong suspect out of a potential five, one misstep could leave many more dead.  With Malcolm and Seong-Jae's domestic life — and sex life — up in the air they're off their game, off the mark, and already starting to crack. But they aren't the only ones, as back in Baltimore Huang kicks a new plan into motion and Anjulie finds herself under unwanted scrutiny. Everyone's lives are falling apart.  And if they can't get their sh*t together, more than their relationships may crash and burn.  ABOUT SEASON TWO  Malcolm Khalaji and Seong-Jae Yoon are back on the case — and partnering with the FBI on a horrific serial murder case that will test Malcolm's faith and revive the darkest parts of Seong-Jae's past. With an enigmatic killer leading them on a wild goose chase through city after city and body after body, both Mal and Seong-Jae will find themselves pushed to their limits as they discover the worst of what humanity can do.  Even two minds against one may not be enough as they track the devious Golden Ratio Killer, and try to find the key to his pattern. But the trail of breadcrumbs left by the white rabbit will lead them suspiciously close to home, and a connection they never could have predicted. With their worlds exploding around them and everyone they know suddenly cast into doubt...  Can their partnership — and their love — survive the greatest trial of their lives?",
  "genres": [
    "M M Romance",
    "Romance",
    "Mystery",
    "Contemporary",
    "Crime",
    "LGBT",
    "Dark"
  ],
  "author": "Cole McCade",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/48592038-in-sequence"
}