{
  "title": "The Beginnings of Western Science: The European Scientific Tradition in Philosophical, Religious, and Institutional Context, 600 B.C. to A.D. 1450",
  "description": "This landmark book represents the first attempt in two decades to survey the science of the ancient world, the first attempt in four decades to write a comprehensive history of medieval science, and the first attempt ever to present a full, unified account of both ancient and medieval science in a single volume. In The Beginnings of Western Science , David C. Lindberg provides a rich chronicle of the development of scientific ideas, practices, and institutions from the pre-Socratic Greek philosophers to the late-medieval scholastics.Lindberg surveys all the most important themes in the history of ancient and medieval science, including developments in cosmology, astronomy, mechanics, optics, alchemy, natural history, and medicine. He synthesizes a wealth of information in superbly organized, clearly written chapters designed to serve students, scholars, and nonspecialists alike. In addition, Lindberg offers an illuminating account of the transmission of Greek science to medieval Islam and subsequently to medieval Europe. And throughout the book he pays close attention to the cultural and institutional contexts within which scientific knowledge was created and disseminated and to the ways in which the content and practice of science were influenced by interaction with philosophy and religion. Carefully selected maps, drawings, and photographs complement the text.Lindberg's story rests on a large body of important scholarship produced by historians of science, philosophy, and religion over the past few decades. However, Lindberg does not hesitate to offer new interpretations and to hazard fresh judgments aimed at resolving long-standing historical disputes. Addressed to the general educated reader as well as to students, his book will also appeal to any scholar whose interests touch on the history of the scientific enterprise.",
  "genres": [
    "History",
    "Science",
    "History Of Science",
    "Philosophy",
    "Nonfiction",
    "Religion",
    "Medieval"
  ],
  "author": "David C. Lindberg",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/485857.The_Beginnings_of_Western_Science"
}