{
  "title": "The Fortunate Ones",
  "description": "Every day he stood exactly where he was directed. He listened for his number, shouted his answer in the freezing cold. He was ragged and he was starving, but he was alive. He was one of the fortunate ones whom fate had left standing. And he needed to stay that way. For Hannah.  Berlin, 1941. Felix Thalberg, a printer’s apprentice, has the weight of the world on his shoulders. His beloved city is changing under Nazi rule and at home things are no better – Felix’s father hasn’t left the house since he was forced to wear a yellow star, and his mother grows thinner every day.  Then one night, Felix meets a mysterious young woman in a crowded dance hall, and his life is changed forever. Hannah is like a rush of fresh air into his gloomy, stagnant life and Felix finds himself instantly, powerfully infatuated with her. But when he tries to find her again, she’s vanished without a trace.  Was Hannah taken away by the Gestapo and held prisoner… or worse? When Felix himself is imprisoned in Sachsenhausen concentration camp, his thoughts are only for her safety. And when a life-threatening injury lands him on the ward of Dr Max Eichel – a Nazi medical officer with a sadistic reputation – his love for his lost Hannah sees him through the pain.  Until one day Dr Eichel brings his pretty young wife to tour the camp and Felix’s world is thrown off-kilter. Framed in the hospital window he sees – impossibly – the same girl he met that fateful night… her wrist in the vice-like grip of the deathly calm SS Officer. And it’s clear Hannah recognises him at once – there is no mistaking her expression, she has been dreaming of him too...  A gripping and beautiful wartime love story about two people facing impossible odds – heartbreaking, moving and unforgettable. Perfect for fans of The Tattooist of Auschwitz, We Were the Lucky Ones and The Alice Network.",
  "genres": [
    "Historical Fiction",
    "World War II",
    "Historical",
    "Fiction",
    "Romance",
    "War",
    "Holocaust"
  ],
  "author": "Catherine Hokin",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/48581677-the-fortunate-ones"
}