{
  "title": "The Lost and Found Bookshop",
  "description": "In this thought-provoking, wise and emotionally rich novel, New York Times bestselling author Susan Wiggs explores the meaning of happiness, trust, and faith in oneself as she asks the question, \"If you had to start over, what would you do and who would you be?\"There is a book for everything . . . Somewhere in the vast Library of the Universe, as Natalie thought of it, there was a book that embodied exactly the things she was worrying about.In the wake of a shocking tragedy, Natalie Harper inherits her mother’s charming but financially strapped bookshop in San Francisco. She also becomes caretaker for her ailing grandfather Andrew, her only living relative—not counting her scoundrel father.But the gruff, deeply kind Andrew has begun displaying signs of decline. Natalie thinks it’s best to move him to an assisted living facility to ensure the care he needs. To pay for it, she plans to close the bookstore and sell the derelict but valuable building on historic Perdita Street, which is in need of constant fixing. There’s only one problem–Grandpa Andrew owns the building and refuses to sell. Natalie adores her grandfather; she’ll do whatever it takes to make his final years happy. Besides, she loves the store and its books provide welcome solace for her overwhelming grief.After she moves into the small studio apartment above the shop, Natalie carries out her grandfather’s request and hires contractor Peach Gallagher to do the necessary and ongoing repairs. His young daughter, Dorothy, also becomes a regular at the store, and she and Natalie begin reading together while Peach works.To Natalie’s surprise, her sorrow begins to dissipate as her life becomes an unexpected journey of new connections, discoveries and revelations, from unearthing artifacts hidden in the bookshop’s walls, to discovering the truth about her family, her future, and her own heart.",
  "genres": [
    "Fiction",
    "Romance",
    "Books About Books",
    "Audiobook",
    "Chick Lit",
    "Contemporary",
    "Book Club"
  ],
  "author": "Susan Wiggs",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/48613318-the-lost-and-found-bookshop"
}