{
  "title": "The New Age of Empire: How Racism and Colonialism Still Rule the World",
  "description": "A damning exploration of the many ways in which the effects and logic of anti-black colonialism continue to inform our modern world. Colonialism and imperialism are often thought to be distant memories, whether they're glorified in Britain's collective nostalgia or taught as a sin of the past in history classes. This idea is bolstered by the emergence of India, China, Argentina and other non-western nations as leading world powers. Multiculturalism, immigration and globalization have led traditionalists to fear that the west is in decline and that white people are rapidly being left behind; progressives and reactionaries alike espouse the belief that we live in a post-racial society.But imperialism, as Kehinde Andrews argues, is alive and well. It's just taken a new form: one in which the U.S. and not Europe is at the center of Western dominion, and imperial power looks more like racial capitalism than the expansion of colonial holdings. The International Monetary Fund, World Bank, World Trade Organization and even the United Nations are only some of these modern mechanisms of Western imperialism. Yet these imperialist logics and tactics are not limited to just the west or to white people, as in the neocolonial relationship between China and Africa. Diving deep into the concepts of racial capitalism and racial patriarchy, Andrews adds nuance and context to these often over-simplified narratives, challenging the right and the left in equal measure.Andrews takes the reader from genocide to slavery to colonialism, deftly explaining the histories of these phenomena, how their justifications are linked, and how they continue to shape our world to this day. The New Age of Empire is a damning indictment of white-centered ideologies from Marxism to neoliberalism, and a reminder that our histories are never really over.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Race",
    "Social Justice",
    "Audiobook",
    "Sociology"
  ],
  "author": "Kehinde Andrews",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/48614638-the-new-age-of-empire"
}