{
  "title": "The Private Abuse of the Public Interest: Market Myths and Policy Muddles",
  "description": "Despite George W. Bush’s professed opposition to big government, federal spending has increased under his watch more quickly than it did during the Clinton administration, and demands on government have continued to grow. Why? Lawrence Brown and Lawrence Jacobs show that conservative efforts to expand markets and shrink government often have the ironic effect of expanding government’s reach by creating problems that force legislators to enact new rules and regulations. Dismantling the flawed reasoning behind these attempts to cast markets and public power in opposing roles, The Private Abuse of the Public Interest urges citizens and policy makers to recognize that properly functioning markets presuppose the government’s ability to create, sustain, and repair them over time.The authors support their pragmatic approach with evidence drawn from in-depth analyses of education, transportation, and health care policies. In each policy area, initiatives such as school choice, deregulation of airlines and other carriers, and the promotion of managed care have introduced or enlarged the role of market forces with the aim of eliminating bureaucratic inefficiency. But in each case, the authors show, reality proved to be much more complex than market models predicted. This complexity has resulted in a political cycle—strikingly consistent across policy spheres—that culminates in public interventions to sustain markets while protecting citizens from their undesirable effects. Situating these case studies in the context of more than two hundred years of debate about the role of markets in society, Brown and Jacobs call for a renewed focus on public-private partnerships that recognize and respect each sector’s vital—and fundamentally complementary—role.",
  "genres": [
    "Economics",
    "Politics"
  ],
  "author": "Lawrence D. Brown",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/4860911-the-private-abuse-of-the-public-interest"
}