{
  "title": "خمسة أيام في باريس",
  "description": "\"هل تعطينا يا سيدي كلمتك.. لا، لست أفعل ذلك. ما زال غير مصدق أنه فعل ذلك ولم يعرف لماذا لم يشعر بالسوء حيال كاتي، لكنه لم يفعل. لقد خسر للتو زوجته، ووظيفته، ومنزله. لقد مثل أمام الكونغرس هذا الصباح، وأمام دائرة الأغذية العقاقير بعد الظهر، بصفته رئيس شركة عالمية، وقد خرج فارغ اليدين، عاطلاً عن العمل، ووحيداً. لم يبق لديه أي شيء سوى كرامته، والمعرقة التي لم يتخل عنها. لقد نجح! وفيما وقف يبتسم لنفسه، وينظر إلى الأعلى إلى سماء سبتمبر، سمع صوتاً مباشرة خلفه، إنه صوت مألوف، وإنما غريب، وفيه ميزة توحي بأنه قادم من زمن آخر، مكان آخر، وفيما التفت مع نظرة ذهول، شاهد أوليفيا تقف مباشرة خلفه. ماذا تفعلين هنا؟\".. ظننت أنك في فرنسا تكتبين\"، ونظرت هي إليه بابتسامة صغيرة.. كان الأمر جيداً هناك\"، قالت وهي تبتسم له ابتسامة عريضة. كانت فخورة به بوضوح، لكنها لم تجب على سؤاله، لقد جاءت لدعمه، ولو بطريقة غير منظورة، في الجلسة قرأت عن الجلسة في صحيفة الهيرالد تريبيون في أوروبا، وعرفت أنه يجدر بها التواجد هناك، من دون أن تتأكد من سبب ذلك... وهي شاكرة الآن لأنها تبعت حدسها. \"أنت اكثر شجاعة مما تظن\"، ذكّرت أوليفيا بيتر فيما نظرت إليه، وشدها إلى قربه، متسائلاً كيف عاش الأشهر الثلاثة والنصف الماضية من دونها، لم يستطع تخيل تركها مجدداً، ليس للحظة واحدة. لا، أنت شجاعة\"، قال بنعومة وامتلأت عيناه بالإعجاب، لقد تخلت عن كل شيء، وابتعدت عن كل شيء، ولم تتنازل عن أي شيء. ثم أدرك فجأة أنه فعل الشيء نفسه. لقد تخلى عن زودته ووظيفته وكل شيء ما يؤمن به. لقد أصبحا حرين الآن. بثمن باهظ، بلا شك، لكن الأمر يستحق ذلك بالنسبة إليهما معاً\". في رواياتها دانيال ستيل كما في تلك التي نقرأ سطورها رومانسية مفقتدة في عالم الرواية، وفي رواياتها كما في \"خمسة أيام في باريس\" تركيز واهتمام بقيم أخلاقية اختفت أو كادت من العالم حولها بصورة خاصة والعالم ككل بصورة عامة. تطرح الكاتبة معالجاتها ضمن أسلوب سردي رائق عذب بعيد عن التعقيد وكأنها بذلك تطمح إلى إيصال رسالتها إلى قارئها بسهولة ويسر. لذا ليس من الغريب أن يبلغ حجم رواياتها لأكثر من 500 ملين نسخة، فالجميع معجب بمواضيعها وبأسلوبها الروائي السلس وبلغتها البسيطة، التي هي في متناول فهم الجميع. من هنا كان لا بد من أن يكون تصنيف رواياتها الأول على لائحة نيويورك تايمز للكتب الأكثر مبيعاً.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Novels",
    "Contemporary Romance",
    "France"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/10258442"
}