{
  "title": "Empire of Wild",
  "description": "“Empire of Wild is doing everything I love in a contemporary novel and more. It is tough, funny, beautiful, honest and propulsive—all the while telling a story that needs to be told by a person who needs to be telling it.”—Tommy Orange, author of There ThereA bold and brilliant new indigenous voice in contemporary literature makes her American debut with this kinetic, imaginative, and sensuous fable inspired by the traditional Canadian Métis legend of the Rogarou—a werewolf-like creature that haunts the roads and woods of native people’s communities.Joan has been searching for her missing husband, Victor, for nearly a year—ever since that terrible night they’d had their first serious argument hours before he mysteriously vanished. Her Métis family has lived in their tightly knit rural community for generations, but no one keeps the old ways . . . until they have to. That moment has arrived for Joan.One morning, grieving and severely hungover, Joan hears a shocking sound coming from inside a revival tent in a gritty Walmart parking lot. It is the unmistakable voice of Victor. Drawn inside, she sees him. He has the same face, the same eyes, the same hands, though his hair is much shorter and he's wearing a suit. But he doesn't seem to recognize Joan at all. He insists his name is Eugene Wolff, and that he is a reverend whose mission is to spread the word of Jesus and grow His flock. Yet Joan suspects there is something dark and terrifying within this charismatic preacher who professes to be a man of God . . . something old and very dangerous.Joan turns to Ajean, an elderly foul-mouthed card shark who is one of the few among her community steeped in the traditions of her people and knowledgeable about their ancient enemies. With the help of the old Métis and her peculiar Johnny-Cash-loving, twelve-year-old nephew Zeus, Joan must find a way to uncover the truth and remind Reverend Wolff who he really is . . . if he really is. Her life, and those of everyone she loves, depends upon it.",
  "genres": [
    "Horror",
    "Fantasy",
    "Fiction",
    "Indigenous",
    "Mystery",
    "Canada",
    "Audiobook"
  ],
  "author": "Cherie Dimaline",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/48613330-empire-of-wild"
}