{
  "title": "The No Spin Zone: Confrontations with the Powerful and Famous in America",
  "description": "“[O'Reilly] is the real McCoy. He's the best reporter I've seen in years…He's smart, well-read, has good values…and he is fearless in picking targets.”—NewsdayBill O'Reilly is even madder today than when he wrote his last book, The O'Reilly Factor, and his fans love him even more. He's mad because things have gone from bad to worse in politics, in Hollywood, in every social stratum of the nation. True to its title, The No Spin Zone cuts through all the rhetoric that some of O'Reilly's most infamous guests have spewed to expose what's really on their minds, while sharing plenty of his own emphatic counterpoints along the way.Shining a searing spotlight on public figures from President George W. Bush and Senator Hillary Clinton to the Reverends Jesse Jackson and Al Sharpton to his former CBS News colleague Dan Rather, The No Spin Zone is laced with the kind of straight-shooting commentary that had made O'Reilly the voice of middle America's disenfranchised.“This explosive anchor can be articulate, bombastic, scornful, witty, iconoclastic, passionate, persuasive, and sarcastic.”—Publisher's Weekly“[O'Reilly's] brand of hard-nosed, regular-guy TV talk is here to stay.”—Newsweek“[The No Spin Zone] vibrates with O'Reilly's gruff Irish wit and elbows-on-the-bar social criticism.”—Atlanta Journal-ConstitutionA twenty-year veteran of the television industry, Bill O'Reilly has won two Emmy awards for excellence in reporting. He served as national correspondent for ABC News and as anchor of the nationally syndicated Inside Edition. A graduate of Marist College, he holds two master's degrees, on in public administration from Harvard and another in broadcast journalism from Boston University. He lives on Long Island with his wife and their daughter.James Ellroy, who contributes an Afterword to The No Spin Zone, is a famed novelist and journalist who profiled Bill O'Reilly for the magazine GQ.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Political Science",
    "History",
    "Audiobook"
  ],
  "author": "Bill O'Reilly",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/48625.The_No_Spin_Zone"
}