{
  "title": "C'mon, Get Happy . . .: Fear and Loathing on the Partridge Family Bus",
  "description": "This memoir by David Cassidy tells the real story behind his phenomenal ’70s stardom—and the sadness that shadowed it. Includes photos and a new afterword.   Barely out of his teens, David Cassidy landed a role on a new sitcom about a musical family that toured in a psychedelic bus. The critics blasted it—but TV viewers loved it! And the young female audience especially loved Keith Partridge. Not only did they tune in each week, they bought The Partridge Family’s hit single, “I Think I Love You,” in the millions, and plastered David’s image on their bedroom walls. Throughout the early seventies, David Cassidy was a phenomenon.   In this wry, witty memoir, he recounts not only those wild youthful years and Hollywood relationships—with, among others, stepmom Shirley Jones, costar Susan Dey, actress Meredith Baxter, and two guest stars who soon found greater fame on Charlie’s Angels—but also the darker parts of his life as well. David delves into his painful family history and his childhood in West Orange, New Jersey, and the groupies and drugs he indulged in as his success began to overwhelm him. He also shares his encounters with the icons of the era—Lennon and McCartney, Elvis, the Beach Boys, and more. Most of all, he takes us back to a time when the world seemed more innocent—at least until the camera stopped rolling.  Includes a new afterword about David’s final years by friend and coauthor Chip Deffaa.   “A chatty read about becoming an overnight success and all the trappings that came with it: Tiger Beat magazine, sold-out stadium shows, hit records, willing girls in every hotel lobby.” —Star Tribune",
  "genres": [
    "Nonfiction",
    "Biography",
    "Music",
    "Memoir",
    "Autobiography",
    "Pop Culture",
    "Biography Memoir"
  ],
  "author": "David  Cassidy",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/48635889-c-mon-get-happy"
}