{
  "title": "The Greatest Story Ever Sold: The Decline and Fall of Truth from 9/11 to Katrina",
  "description": "New York Times op-ed columnist Frank Rich examines the trail of fictions manufactured by the Bush administration from 9/11 to Hurricane Katrina, exposing the most brilliant spin campaign ever wagedWhen America was attacked on 9/11, its citizens almost unanimously rallied behind its new, untested president as he went to war. What they didn't know at the time was that the Bush administration's highest priority was not to vanquish Al Qaeda but to consolidate its own power at any cost. It was a mission that could be accomplished only by a propaganda presidency in which reality was steadily replaced by a scenario of the White House's own invention---and such was that scenario's devious brilliance that it fashioned a second war against an enemy that did not attack America on 9/11, intimidated the Democrats into incoherence and impotence, and turned a presidential election into an irrelevant referendum on macho imagery and same-sex marriage.As only he can, acclaimed New York Times columnist Frank Rich delivers a step-by-step chronicle of how skillfully the White House built its house of cards and how the institutions that should have exposed these fictions, the mainstream news media, were too often left powerless by the administration's relentless attack machine, their own post-9/11 timidity, and an unending parade of self-inflicted scandals (typified by those at The New York Times). Demonstrating the candor and conviction that have made him one of our most trusted and incisive public voices, Rich brilliantly and meticulously illuminates the White House's disturbing love affair with \"truthiness,\" and the ways in which a bungled war, a seemingly obscure Washington leak, and a devastating hurricane at long last revealed the man-behind-the-curtain and the story that had so effectively been sold to the nation, as god-given patriotic fact.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "War",
    "Journalism",
    "American History"
  ],
  "author": "Frank Rich",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/48653.The_Greatest_Story_Ever_Sold"
}