{
  "title": "Vesper Flights",
  "description": "Animals don't exist in order to teach us things, but that is what they have always done, and most of what they teach us is what we think we know about ourselves. Helen Macdonald's bestselling debut H is for Hawk brought the astonishing story of her relationship with goshawk Mabel to global critical acclaim and announced Macdonald as one of this century's most important and insightful nature writers. H is for Hawk won the Samuel Johnson Prize for Nonfiction and the Costa Book Award, and was a finalist for the National Book Critics Circle Award and the Kirkus Prize for Nonfiction, launching poet and falconer Macdonald as our preeminent nature essayist, with a semi-regular column in the New York Times Magazine.In Vesper Flights Helen Macdonald brings together a collection of her best loved essays, along with new pieces on topics ranging from nostalgia for a vanishing countryside to the tribulations of farming ostriches to her own private vespers while trying to fall asleep. Meditating on notions of captivity and freedom, immigration and flight, Helen invites us into her most intimate experiences: observing songbirds from the Empire State Building as they migrate through the Tribute of Light, watching tens of thousands of cranes in Hungary, seeking the last golden orioles in Suffolk's poplar forests. She writes with heart-tugging clarity about wild boar, swifts, mushroom hunting, migraines, the strangeness of birds' nests, and the unexpected guidance and comfort we find when watching wildlife. By one of this century's most important and insightful nature writers, Vesper Flights is a captivating and foundational book about observation, fascination, time, memory, love and loss and how we make sense of the world around us.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Essays",
    "Science",
    "Memoir",
    "Animals",
    "Birds"
  ],
  "author": "Helen Macdonald",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/48637750-vesper-flights"
}