{
  "title": "Mischievous Christmas Angel",
  "description": "After one night of blistering lovemaking that would bring any sane man to his knees clutching a ring, Jack’s forced to accept Mia’s unexpected rejection. Then when she seems to be warming up to having a relationship, danger erupts around him in freakish accidents and mystical happenings. How can he permit her and her little girl to be anywhere near these threats?Mia lovingly adopts her best friend’s four-year-old child in accordance with her will. She also agrees to move her new family and her business to live with her aunt before the Christmas holidays arrive. But… she isn’t willing to hold on to a man because of one incredible night’s loss of restraint.Angels with Attitudes Book #1 My Cheeky Angel - From shy, lonely tomboy to hotshot businesswoman, baggy jeans to suits and stilettos, this story follows the journey of Annie Hynes. She’s faced with one conflict after another and is forced to cope with life’s challenges. Will she eventually accept true love? Or… is she just too timid.Book #2 His Devious Angel - Man-hater gets mixed up with a crazy, hotshot soldier when he runs her down with his convertible. Now she's stuck having to accept his help to do her dog-walking job. Just her luck some expensive pets go missing, and her new partner decides the puppy-mill rumor needs to be investigated. Dangerous work - but they have an eccentric angel on their side. Book #3 Lovable Christmas Angel - This wonderful Christmas story takes place in Waikiki, Honolulu; a magical city where anything is believable. Leilani is about to find out just how angels scheme to make romance happen for those in their care because Angels really do love romance. Book#4 A Wonderful Life - Numerous heartbreaking tragedies have broken Noel Bradford’s spirit. When he finds himself perched on the barrier of a bridge, intending to jump into the icy river, he prays for help.Book #5 Mischievous Christmas Angel - Jack gets into hot water when he fetches a pretty mom with her adopted daughter and moves them to his city to live with his best friend – their aunt. Thank goodness his angel is constantly available, because with all the drama in his life, he really needs all the help he can get.",
  "genres": [
    "Romance"
  ],
  "author": "Mimi Barbour",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/48637257-mischievous-christmas-angel"
}