{
  "title": "The Escape to Candyland",
  "description": "WHAT IS THE MESSAGE HIDDEN BEHIND A POLITE SMILE?In Yong Takahashi’s Atlanta, the immigrants, preacher’s wives, strippers, and shopkeepers who pass each other on the street all have a secret story to tell. Caught between generations of family, regrets from their pasts, conflicting cultures, and even countries, each character has a reason to fiercely guard their secret lives, even as they learn that the truth must escape. Takahashi’s characters chase their American dreams down back alleys and campaign trails, stumbling under the weight of the gifts their families have given them. A box of Boraxo hand soap. Change for the vending machine. A stranger’s driver’s license. A mother’s love. The smallest exchange could prove kill or cure when you walk the streets of Candyland.“A beautifully wrought series of stories and vignettes.”—Pinckney Benedict, author of the award-winning Miracle Boy and Other Stories“Dark and addictive literary confectionery . . . compelling the reader to devour the contents in one sitting––then return to savor the unsavory, again and again.”—MARI ANN STEFANELLI, The Writer’s High®“ The Escape to Candyland covers the everyday extraordinary with . . . characters whose struggles and small victories are authentic. Not to be missed!”—Melanie Faith, author of In a Flash! Writing & Publishing Dynamic Flash Prose“Takahashi captures a mood, reveals a moment, and gently unfolds our human condition onto the page. She transports us to another world . . . yet she reflects each of our unique situations back at us . . . the sweet agonies and bitter joys in which all of humankind is swaddled.”—Val M. Mathews, editor, The Wild Rose Press and The Exit 271 Studio“ Escape to Candyland is a mesmerizing collection that weaves delicately through the wasteland of life’s pain and struggle . . . [and] captures the breadth of hope and love contained in the human heart.”—Zachary Steele, author of Anointed and Flutter , founder and executive director of Broadleaf Writers Association",
  "genres": [
    "Fiction"
  ],
  "author": "Yong Takahashi",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/48645823-the-escape-to-candyland"
}