{
  "title": "Wicked Hexes",
  "description": "From International Bestselling author Amelia Hutchins comes a tale of twisted wickedness and seduction. One heavily hexed witch… One heavily hexed Viking… A hex that leaves her powerless and in her enemies clutches… What could go wrong? How far would you go to save everyone you love? For Laura, she’d do anything to protect those she cares about from becoming collateral damage to the curse her mother placed centuries ago. Even if it means killing the only man she has ever loved again. How far would you go to save the woman you loved? Braydon will do whatever it takes to get his mate back and claim her as his Queen. Even if it means making her believe he is the villain. Laura Cheveron has done everything possible to avoid facing the curse, but fate has other plans when she is summoned to attend the annual Witch’s Ball in New Orleans. One hex leaves her powerless, exposed to her enemies and places her right in the clutches of the one man she has been avoiding. Can she escape him before they trigger the curse, and he goes mad? Or will she lose everything to the curse, again? Braydon has a plan to undo the curse on Laura, but before he can unravel it, he needs her stripped of her magic and at his mercy. She thinks he wants to kill her, but he’s okay playing the bad guy in her story. He’s loved her since the moment he first laid eyes on her. He made her his wife, and she took his life. To get her back, he’s willing to go to battle against her to make her his once more. Standalone HEA ending. Can be read in any order. Other books by Amelia Hutchins The Fae Chronicles Fighting Destiny Taunting Destiny Escaping Destiny Seducing Destiny Unraveling Destiny Embracing Destiny coming 2019 The Elite Guards A Demon’s Dark Embrace Claiming the Dragon King The Winter Court A Demon’s Plaything A Guardian’s Diary Darkest Before Dawn Death before Dawn Midnight Rising (Final Book TBA) If these pricks ever start talking to me. Playing with Monsters series (Part of the Fae Chronicles) Playing with Monsters Sleeping with Monsters Becoming his Monster Last Monster book TBA Wicked Knights Oh, Holy Knight (Standalone alternative POV to If She’s Wicked) If She’s Wicked Book Three, TBA MIDNIGHT COVEN BOOKS Forever Immortal Immortal Hexes Wicked Hexes",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Magic",
    "Witches",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "Amelia Hutchins",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/48643121-wicked-hexes"
}