{
  "title": "WHAT SWEETNESS FROM SALT",
  "description": "Francine Conley writes with a raconteur’s wit and craftsman’s ear for the frisson between words. In What Sweetness from Salt, Conley weaves the ekphrastic and allusive with her personal mythology, the result of which has a propulsive narrative spine. These poems grapple with the inherited burdens of family and the lovers, cities, and heartbreaks they lead to. Conley’s poems demand we stay porous, desirous, and flawed: which is to say, human.—Stephanie Danler, essayist and author of Sweetbitter  Francine Conley is a sage soul whose richly powerful collection What Sweetness From Salt absolutely wrecked me in the best way, reduced me to a sobbing, open-hearted mess. These poems are so smart, witty, and incisive, and yet the deep gazing both inward and outward, the introspective deep knowing, I almost had to lie on the floor I was hurting and healing so hard. At every turn, I’m impressed by the fluid movement, how Conley places the glass darkly over a mother’s psyche, shining it over the mess of life, the mother’s life—revealing not a binary but a blurring, showing how “There is no better loneliness than a mother’s love.” She writes deftly and achingly of girlhood, motherhood, rife sexual relationships, and the feminine body and its cultural history of being policed, all in such starkly clear lyric, like glass, breakable. Perfect and breakable. This collection’s syntax and sounds, imagery and wit, thoroughly delight me even as it tears me open, exhibiting such exquisite nuance, maturity, wisdom, and play, as in the following passage, which will stay with me as salt sweetening on my tongue: “In time bitch / stuck in my throat like a bone. Stayed like salt / on my tongue. I used to think it tasted different / in every country. In Switzerland salt tasted thin, almost sweet. In Germany; like cake.” Oh, read for yourself, the sweetness this collection engenders.—Jenn Givhan, award-winning author of Girl with Death Mask and Rosa’s Einstein  “Say a word like bitch and you’ll be cleaned out,” begins this masterful book about women, mothers and our difficulties finding meaning in a world that values neither. These fierce voices do not worry about propriety so much as they fight to salvage a self who can love in spite of it all. From the Midwest, to western Europe, from a child’s eye-view to that of mature motherhood, the poems in What Sweetness From Salt move us through all the ways that we are “a frightful expression of ourselves.”—Connie Voisine, author of The Bower and Calle FloristaRead less",
  "genres": [],
  "author": "Francine Conley",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/48653836-what-sweetness-from-salt"
}