{
  "title": "Storm Warning",
  "description": "Only the author of The Eagle has Landed could write a novel about World War II as original, exciting, and suspenseful as Storm Warning\n.At the end of August 1944 the Deutschland, a three-masted nineteenth-century sailing vessel, slipped out of a Brazilian port at the mouth of the Amazon with a crew of twenty-two men and five nuns as passengers. The destination was Germany, the route five thousand miles of storm-swept ocean barred by the overwhelming military might of American and British forces - both in the sea and in the air.While the Deutschland and her crew set out on this voyage, Fate moves other parties like chess pieces about the world, in preparation for the final encounter month later off Scotland, on the Outer Hebridean island of Fhada:Janet Munro, an American doctor caught in Europe by the war and now working with air raid victims.her uncle, Rear Admiral Carey Reeve, severely wounded and fretting under the personal order of General Eisenhower that he spend the rest of the war out of the firing line,U-Boat ace Paul Gericke, ordered on a desperate mission to penetrate the Royal Naval installation at Falmouth,Harry Jago and the surviving crew of his gunboat. who have seen action from the Solomons to the English Channel.As the Deutschland struggles north these and others are drawn inexorably together to coincide at that one point on the map: Washington Reef, three miles northwest of Fhada. And then, out of the North Atlantic, the winds start to blow up the storm of the Century.Americans, Germans, Scottsmen, lairds, prisoners, fishwives, admirals - all are there. The presence of each of them has a history that we have followed in parallel with the progress of the barkentine, and now all are drawn together in the desperate struggle against man's oldest and implacable foe - the sea. This is the point at which the enmities of war fade into insignificance.Storm Warning is immensely impressive, both in its grand sweep and its command of detail, in its handling of the interweaving histories of its many fascinating characters, in its sheer powerful storytelling action. It is a compulsively readable, gripping, and moving book.",
  "genres": [
    "Fiction",
    "Thriller",
    "Historical Fiction",
    "Adventure",
    "Action",
    "War",
    "Suspense"
  ],
  "author": "Jack Higgins",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/486695.Storm_Warning"
}