{
  "title": "Royally Crushed",
  "description": "One pampered princess desperate to escape the confines of royal life. One rugged outdoorsman whose survival TV show ratings are in the toilet. What happens when you drop them into the jungle together with only each other to rely on?Being a princess isn’t the fairytale you think it is. It’s the same five conversations over the same scones and tea every damn day until you die. It’s never having a minute without someone watching you and micro-managing your every move. And now that I’m twenty-nine, it’s gotten so much worse because my handlers are currently seeking a suitable (read: boring, uptight, and likely horrible in bed) husband for me. Apparently I must be married before I turn thirty and my royal eggs turn to dust. I need out now or I am going. To. Lose. It. So naturally, I sneak off to the jungle to co-host a new nature docu-series starring Will Banks (a.k.a. McHotty of the Wilderness). Turns out this was a terrible idea because we full-on hate each other from the moment the helicopter drops us off. Luckily, we’re stuck out here alone together for the next two very long weeks. I’d give anything for a scone and some polite chitchat right about now. Although, Will is rather easy on the eyes. Especially when he takes his shirt off to get washed up. And all that loathing seems to be building a lusty tension between us that won’t be denied. Even though we most definitely should deny the lustiness. Forever. Because … I hate him. Don’t I?  Royally Crushed is a wildly funny, opposites-attract, hate-at-first-sight romantic comedy adventure filled with loads of witty banter, sexual tension so high it could make even the most proper of princesses snap, and enough swoon-worthy moments that you should probably get yourself a fainting pillow.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Chick Lit",
    "Royal Romance",
    "Fiction"
  ],
  "author": "Melanie Summers",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/48656982-royally-crushed"
}