{
  "title": "Further Lovely Lettuce Lore",
  "description": "Editorial ReviewsReviewJulie Cooper-Fratrik’s Further Lovely Lettuce Lore takes us on an ebullient romp through a verdant garden of linguistic, earthly, and otherworldly delights. Hers is a chiaroscuro journey in which the mortal “sorrows, / here in the world/ the little singing world” meet life’s joys, its deepest loves, its numinous wonders and surprise. A feminist Dream Song for our times, Cooper-Fratrik’s cycle “might be a song in the forest; it might be a song in the sea.” Wherever she goes, we follow, for the flowers of this poet’s imagination are forever “in riotous bloom.”Ethel Rackin, author of Go On, finalist for the 2016 Jewish Book Council’s Berru Poetry Award  The play of the mind: without it, there is no serendipity, no discovery. Julie Cooper-Fratrik’s volume of poetry, Further Lovely Lettuce Lore, offers us a “leap to a far shore of reality,” to borrow from Polanyi. The volume disperses a veritable pollen-field of connections—fertile, exuberant and sometimes dizzying—upon those who enter it, celebrating in parison on the richness of language and the plenitude of nature. “Lettuce” of the title effectively puns on the granting of permission, the enjoining verb, “Let us…” inviting us to delicious entanglement. Cooper-Fratrik is, moreover, as well as a “feminist” writer in the best of senses, an erudite poet (there are end-notes to help us), and the complex skein of echoes and allusions and plays on words and names (the litany of lettuces is downright brilliant) affords the reader both a set of rigorous mental challenges and breathtaking moments of simplicity of heart. The palindromic “Anna” makes, in its own way, a girdle that encircles the whole world in these poems; and the “Lore” of the title derives from the verb “to learn” in its most ancient form. “Digression: Sad Young Man on a Train, after Duchamp, takes ekphrastic poetry in a whole new direction. The cup is full here—full to over-brimming. This is a volume to learn from, and to live with.Richard Wertime, author of Citadel on the Mountain, winner of the James A. Michener Memorial Award",
  "genres": [],
  "author": "Julie Cooper-Fratrik",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/48659909-further-lovely-lettuce-lore"
}