{
  "title": "When the Walls Cave In",
  "description": "Editorial ReviewsReviewLike a series of Hopper paintings, the poems found in When the Walls Cave In paint the essentials of life--birth, love, marriage, heartbreak, death--with a realism cast in the dark hues of melancholy. Here Dym's pen travels again and again to where \"There is only minutia, / cracks and holes and empty want--.\" But what is found in this \"grey rubble\" and \"sorrowful dirge\" often surprises with unexpected beauty and wry absurdities: the mother who is radiant in the throes of death; the physician who might have been a poet; soup that is eaten with bare hands; Chihuahuas and gators that dream of love. There is craft here to salute as well--wonderful musicality of language and line, but let's not kid ourselves, it is Victoria Dym's leaping associations of heart and imagination these poems celebrate.\"--Celeste Gainey, author, the GAFFER (ArktoiBooks/Red Hen Press, 2015)In Victoria Dym's accomplished second chapbook, God is in the details. From pungent childhood terrors to the stubborn grief of divorce, Dym deftly evokes the pivotal moments in which the world changes: a barn cat killed on a highway, a hidden cell phone with one contact number, a vacuum cleaner found like an intruder in the middle of a room. These poems are sensuous as well as surprising--you will smell the Brasso polish \"like a perfume that stays under my nail beds well into the next week\" and taste Granma Bungie's \"Hamantaschen cookies: / three corners oozing with apricot, cherry, prune...\" Even When the Walls Cave In, this versatile poet's imagination not only records but halts the damage, as in \"Shift\" \"Sixty minutes of daylight savings time, / forwards or back when nothing / and nobody in the world dies, / not even a worm.\"--Angele Ellis, Under the Kaufmann's Clock: Fiction, Poems, and Photographsof Pittsburgh, with photos by Rebecca Clever (Six Gallery Press, 2016)",
  "genres": [],
  "author": "Victoria Dym",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/48659617-when-the-walls-cave-in"
}