{
  "title": "Blank Canvas",
  "description": "When a car accident changed the trajectory of his life at fifteen, Sam Braga set out to find his own way in the world. It never occurred to him he’d find home in Fairfield, Colorado, working with a childhood friend at a tattoo shop, and the legal guardian of a gorgeous little girl who was abandoned by her mother at birth. Sam has his life organized exactly the way he needs it. Maisy, work, and his found-family. There isn’t room for anything else. Especially when DCS gets involved and tells him that his disability might interfere with his petition to finally adopt the little girl he’s been raising. Sam might be lonely, but he just doesn’t have room for love.  Niko Pagonis tells himself he’s not using the small town of Fairfield as an escape, but who is he kidding. When his NHL career ends two minutes after it begins, Niko flees the East Coast in search of somewhere to settle. He finds home in the form of his accounting firm and his gym buddies who never abandon him on leg-day. Eventually, however, it’s not enough. Niko craves connection, and above all, he wants to feel like he belongs. He stumbles onto the unlikely family at Irons and Works, and more than that, he finds himself in the path of the gorgeous single-dad who has made it clear he has no plans to fit Niko into his routine.  But things aren’t always that simple, even when both men try to make them that way. A misguided offer of friends with benefits turns into something else, and both Sam and Niko know they’re flirting with disaster. Still, neither one of them can seem to stay away from the other. Will they find their way through the mess before someone gets hurt? Or will it all come crashing to the ground.  Blank Canvas is the second book in the Irons and Works series. Each book contains an individual storyline with no cheating and HEA.",
  "genres": [
    "M M Romance",
    "Romance",
    "Disability",
    "Contemporary",
    "LGBT",
    "Queer",
    "Gay"
  ],
  "author": "E.M. Lindsey",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/48702720-blank-canvas"
}