{
  "title": "One Woman Only: The Good Man Series, Book 2",
  "description": "As far as anyone knows, Jonah Goodman has spent his adult life doing a little of this and a little of that. Everyone thinks he’s good at many things but a master at none. It isn't that he doesn't have the brains or even the heart to be a master. He doesn't have the commitment. He's not like his brother Daniel, so focused on his goal that he blocks out everything else, or his other triplet brother, Mark, to whom focus is unthinkingly part of his genius. Whether his lack of follow through stems from fear or self-doubt, no one but Jonah knows. But it all started his senior year of high school, when he took the virginity of his girl, Kelly Shepherd. He immediately broke up with her and went so far as to drop out of school and move away. Since then, he’s found his place as a simple—but excellent—mechanic, well-known in the world of NASCAR. Now, he's about to meet up with Kelly again in a most interesting venue—his parents' wedding.Kelly Shepherd has always liked Mr. and Mrs. Goodman. They were the town characters—she a former stripper who had triplets out of wedlock, and he an affable thief who did his time and then came home to be sheltered in the open arms of their small town. Kelly's parents, rich factory owners and employers of most of the town, would never be so loved and appreciated as the Goodmans. Nor would they love each other as the Goodmans did. Or show such open affection for their children. Jonah's parents were one of the reasons Kelly was so happy to start dating him in their senior year. Then she handed over her V-card and everything went to hell. She never even knew why. Now, after a disastrous marriage, a necessary divorce, and a career choice that still disappoints her parents, Kelly is finally returning home to see the couple she most admires marry each other after more than thirty-six years of \"living in sin.\" Her mother's words, not hers. She thinks the one thing spoiling the thought of the weekend is the chance she might see the only man to break her heart. No, not her worthless husband. Jonah Goodman. But there's more, much more ahead.",
  "genres": [],
  "author": "Dee S. Knight",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/48705086-one-woman-only"
}