{
  "title": "Bio-Mechanical",
  "description": "Having grown up the son of a Southern Baptist preacher, James Gossett was expected to be one thing, and one thing only—a God-fearing, straight, Christian man. It didn’t help that from a young age, James knew he was different. He hid the truth about who he was from himself, and from his family, until a freak accident during a routine simulation right after basic training cost him both legs, and nearly his life. Knowing what he almost lost, James decided to come out—and with that, lost the rest of the blood kin he had left alive. Settling in Fairfield, James rediscovered what it meant to be part of a family who loved him for who he was—but he still had one big secret kept close to his heart. In spite of his promiscuous reputation, James was a virgin, in every sense of the word, and he wasn’t sure that would ever change.  Rowan Balk was dedicated to one thing, and one thing alone—ensuring that no child would ever suffer what he did at the hands of a prejudiced system. Having been torn from his disabled adoptive mother shortly after her MS diagnosis, Rowan grew up with a fire in him to make sure no one ever felt his pain. But his determination came at the expense of ever finding love, and until he set foot in Fairfield, he was okay with that. Then he set eyes on the quiet, southern tattoo artist with secrets in his eyes and a mouth he could get lost in for days. But Rowan wasn’t the sort of person who was willing to turn his life upside down for one man, even if he knew deep down, James Gossett was probably the one. When it’s obvious James wants Rowan just as much, Rowan realizes he can’t say no. So he makes James a proposition—he’ll help James discover himself in the bedroom, no strings attached, until Rowan leaves the state.  But will that be enough for both lonely men? Or will they somehow find a way to come together, in spite of the distance between them?  Bio-Mechanical is the fourth book in the Irons and Works series. It contains no cheating and a HEA. Each book can be read as a stand-alone, though reading the previous books will help with some background context of other characters.",
  "genres": [
    "M M Romance",
    "Romance",
    "Disability",
    "Contemporary",
    "LGBT",
    "Queer",
    "Gay"
  ],
  "author": "E.M. Lindsey",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/48702898-bio-mechanical"
}