{
  "title": "The Chronicles of Lord Asunaro",
  "description": "A Japanese tale - not about daring ninja or battling samurai - but a hero with a very different penchant. Based on an actual historical figure, the Akutagawa-nominated master short story writer, Kanji Hanawa, takes the reader on a journey of self-discovery, as Lord Asunaro inherits his own Japanese fiefdom and grapples with his role and ultimate legacy. Hanawa provides us with an unusual and entertaining perspective on the psychology of change within Japan when it was still ruled by its men of steel, samurai and shoguns.As Japan emerges from the conflict-ridden era dominated by infamous warlords into a golden age of plenty, a young lord - heir to a vast domain and incumbent ruler of all he surveys - lives deep within a spiralling castle.From the pen of Hanawa, this cleverly spun tale features our young Lord Asunaro, a 'warlord' who doesn't fit the brave samurai stereotype, as he faces a modernising world where learning now outvalues military prowess. Carrying the legacy of his bloodline, he is compelled to find his place among the great figures of his ancestors.Hanawa's charming story, The Chronicles of Lord Asunaro is translated by Meredith McKinney, and takes the reader back to life and leadership in feudal Japan - while also exploring universal themes of legacy, inheritance, expectations, the weight of history and the psychology of change.Red Circle Original, Short and Compelling ReadsThe Chronicle of Lord Asunaro is part of Red Circle Minis, a series of short captivating books by Japan's finest contemporary writers that brings the narratives and voices of Japan together as never before. Each book is a first edition written specifically for the series and is being published in English first.",
  "genres": [
    "Japan",
    "Japanese Literature",
    "Short Stories",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Kanji Hanawa",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/48703530-the-chronicles-of-lord-asunaro"
}