{
  "title": "Pulse",
  "description": "Death is a heartbeat away—\n Grab your copy of this action-packed anthology and join the fight for survival. Thirteen medical thrillers—written by Wall Street Journal, USA Today and Amazon bestsellers—fill your Kindle with high-stakes adventures. These full-length novels with wide-ranging appeal include the best of the best at the FBI, the CIA, the police, private security, and military special forces. Can these heroes win the day against those who would use medical science for their darkest deeds? Readers who have enjoyed Michael Crichton, Patricia Cornwell, David Baldacci, Danielle Girard, Kendra Elliot, Tim Tigner and Sandra Brown have also enjoyed:\nJudith Lucci, Wall Street Journal, USA Today, Amazon International Bestseller, Chaos at Crescent City Medical Center\n\nMardi Gras Takes A Bloody Turn\n\nThe wife of Louisiana's Governor is discovered in her hospital bed unconscious and covered with blood.\n\nFiona Quinn, USA Today Bestseller, Kindle Scout Winner, Thorn\n\nThorn Has Met His Match\n\nRetired Navy Seal, turned Iniquus security operative, Thorn Iverson is heading home from Brussels when the call comes in.\n\nEdwin Dasso, USA Today Best-Selling Author, Empty Promises\n\nBig pharma is buying all the politicians in D.C., plotting to unleash their new, but deadly, super-narcotic on the American public.\n\nJenifer Ruff, USA Today Bestselling Thriller Author, Everett\n\nAt Everett College, perfection in medical school has a DARK side…\n\nAudrey J Cole, USA Today bestselling author, The Recipient\n\nSergeant Wade McKinnon knows who killed Samantha the moment he arrives at her crime scene. Problem is, he watched her killer die a year ago. \n\nChris Patchell, Award-winning, USA Today Bestselling Author, Dark Harvest\n\nWhat is the sinister motive lurking behind the disappearance of pregnant women in Seattle, Washington?\n\nTimothy Browne- USA Today and Amazon Bestselling Author, Tree Of Life\n\nA massive earthquake hits Eastern Turkey, the ancient area of Mesopotamia, unveiling hidden secrets and opening an epic battle between good and evil.\n\nJD Lasica, Amazon Bestselling Author, Biohack\n\nAn elite hacker and covert ops specialist, finds her life turned upside down when she discovers that the parents who raised her were imposters. What price would you pay to know the truth?\n\nInge-Lise Goss, Multi-Award Winning, USA Today Bestselling Author, No Freedom\n\nCan humans survive the android uprising and the horrific medical procedures that occur to humans who don't obey them?\n\nDeborah Shlian and Linda Reid, Multi-Award Winning Authors, Dead Air\n\nTalk is cheap, but when this radio host takes action, she may pay the ultimate price.\n\nEric J.",
  "genres": [],
  "author": "Judith Lucci",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/48677269-pulse"
}