{
  "title": "Lady Luck's Map of Vegas",
  "description": "A successful Web designer, forty-year-old India has a fabulously hip life in Denver and a sexy Irish lover in New York who jets out to see her on bi-weekly visits. The long-distance romance suits India just Though Jack is the only man who has ever made India feel truly alive, she doesn’t want things to get too serious. But then her father passes away, and India must honor the promise she made to to look after her mother when he’s gone.Suddenly India finds herself back in Colorado Springs with the woman who both intrigues and infuriates her. Eldora is sixty something and exquisitely gorgeous, but her larger-than-life personality can suck the air out of a room. True to form, Eldora throws India a curveball, insisting that they hit the road to look for India’s twin, Gypsy, a brilliant artist who lives a vagabond’s existence in the remote mountain towns of New Mexico. It looks like India can’t avoid her mother’s intensity any longer, especially after she discovers stunning secrets from Eldora’s past.Thirty years ago, Eldora regaled her twin girls with glamorous stories about her days as a Las Vegas showgirl– stories of martinis and music at the Sahara, back when Frank and Sammy ruled the town. But the story of how she really ended up in Sin City, and the unsavory life she’d run from with her daughters in tow, is full of details she’s never seen fit to share–until now.As mother and daughter sail down Route 66, the very road Eldora drove those many years ago, looking for Gypsy, while passing motels, diners, and souvenir shops, Eldora must relive a lifetime of memories that have tormented her before she can put them to rest once and for all. . . .Award-winning author Barbara Samuel brings us a heartfelt story of second chances and unexpected detours. As two women come to terms with themselves and each other, the past unravels and the future spreads out before them like the open road.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Womens Fiction",
    "Audiobook",
    "Contemporary",
    "Family"
  ],
  "author": "Barbara Samuel",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/1247740.Lady_Luck_s_Map_of_Vegas"
}