{
  "title": "Raising a Rare Girl: A Memoir",
  "description": "A  New York Times  Book Review Editors' Choice Kate Bowler's The Everything Happens Book Club Pick! Award-winning writer Heather Lanier's memoir about raising a child with a rare syndrome, defying the tyranny of normal, and embracing parenthood as a spiritual practice that breaks us open in the best of ways .Like many women of her generation, Heather Lanier did everything by the book when she was expecting her first child. She ate organic foods, recited affirmations, and drew up a birth plan for an unmedicated labor in the hopes that she could create a SuperBaby, an ultra-healthy human destined for a high-achieving future.But her daughter Fiona challenged all of Lanier's preconceptions. Born with an ultra-rare syndrome known as Wolf-Hirschhorn, Fiona received a daunting she would experience significant developmental delays and might not reach her second birthday. Not only had Lanier failed to produce a SuperBaby, she now fiercely loved a child that the world would sometimes reject. The diagnosis obliterated Lanier's perfectionist tendencies, along with her most closely held beliefs about certainty, vulnerability, God, and love.With tiny bits of mozzarella cheese, a walker rolled to library story time, a talking iPad app, and a whole lot of pop and reggae, mother and daughter spend their days doing whatever it takes to give Fiona nourishment, movement, and language. They also confront society's attitudes toward disability and the often cruel assumptions made about Fiona's worth. Lanier realizes the biggest question is not, Will my daughter walk or talk? but, How can I best love my girl, just as she is?Loving Fiona opens Lanier up to new understandings of what it means to be human, what it takes to be a mother, and above all, the aching joy and wonder that come from embracing the unique life of her rare girl.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Parenting",
    "Disability",
    "Biography",
    "Medical",
    "Audiobook"
  ],
  "author": "Heather Lanier",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/48710089-raising-a-rare-girl"
}