{
  "title": "Notes on a Silencing: A Memoir",
  "description": "A riveting, lucid memoir of a young woman's struggle to regain her sense of self after trauma, and the efforts by a powerful New England boarding school to silence her--at any costWhen the elite St. Paul's School recently came under state investigation after extensive reports of sexual abuse on campus, Lacy Crawford thought she'd put behind her the assault she'd suffered at St. Paul's decades before, when she was fifteen. Still, when detectives asked for victims to come forward, she sent a note.Her criminal case file reopened, she saw for the first time evidence that corroborated her memories. Here were depictions of the naïve, hard-working girl she'd been, a chorister and debater, the daughter of a priest; of the two senior athletes who assaulted her and were allowed to graduate with awards; and of the faculty, doctors, and priests who had known about Crawford's assault and gone to great lengths to bury it.Now a wife, mother, and writer living on the other side of the country, Crawford learned that police had uncovered astonishing proof of an institutional silencing years before, and that unnamed powers were still trying to block her case. The slander, innuendo, and lack of adult concern that Crawford had experienced as a student hadn't been imagined as the effects of trauma, after all: these were the actions of a school that prized its reputation above anything, even a child.This revelation launched Crawford on an extraordinary inquiry into the ways gender, privilege, and power shaped her experience as a girl at the gates of America's elite. Her investigation looks beyond the sprawling playing fields and soaring chapel towers of crucibles of power like St. Paul's, whose reckoning is still to come. And it runs deep into the channels of shame and guilt, witness and silencing, that dictate who can speak and who is heard in American society.An insightful, mature, beautifully written memoir, Notes on a Silencing is an arresting coming-of-age story that wrestles with an essential question for our time: what telling of a survivor's story will finally force a remedy?",
  "genres": [
    "Memoir",
    "Nonfiction",
    "True Crime",
    "Audiobook",
    "Biography",
    "Feminism",
    "Crime"
  ],
  "author": "Lacy Crawford",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/48717403-notes-on-a-silencing"
}