{
  "title": "The Arab Winter: A Tragedy",
  "description": "A New York Times Book Review Editors’ ChoiceWhy the conventional wisdom about the Arab Spring is wrongThe Arab Spring promised to end dictatorship and bring self-government to people across the Middle East. Yet everywhere except Tunisia it led to either renewed dictatorship, civil war, extremist terror, or all three. In The Arab Winter , Noah Feldman argues that the Arab Spring was nevertheless not an unmitigated failure, much less an inevitable one. Rather, it was a noble, tragic series of events in which, for the first time in recent Middle Eastern history, Arabic-speaking peoples took free, collective political action as they sought to achieve self-determination.Focusing on the Egyptian revolution and counterrevolution, the Syrian civil war, the rise and fall of ISIS in Syria and Iraq, and the Tunisian struggle toward Islamic constitutionalism, Feldman provides an original account of the political consequences of the Arab Spring, including the reaffirmation of pan-Arab identity, the devastation of Arab nationalisms, and the death of political Islam with the collapse of ISIS. He also challenges commentators who say that the Arab Spring was never truly transformative, that Arab popular self-determination was a mirage, and even that Arabs or Muslims are less capable of democracy than other peoples.Above all, The Arab Winter shows that we must not let the tragic outcome of the Arab Spring disguise its inherent human worth. People whose political lives had been determined from the outside tried, and for a time succeeded, in making politics for themselves. That this did not result in constitutional democracy or a better life for most of those affected doesn't mean the effort didn't matter. To the contrary, it matters for history―and it matters for the future.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Audiobook",
    "Cultural",
    "Social Science",
    "Political Science"
  ],
  "author": "Noah Feldman",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/48710558-the-arab-winter"
}