{
  "title": "Begin Again",
  "description": "From New York Times and USA Today bestselling author Jennifer Probst comes a new story in her Stay series.Chloe Lake is finally living her dream. As the daughter of the Governor, she’s consistently in the spotlight, and after being dubbed the Most Eligible Bachelorette of NYC, both her career and personal life has exploded. Fortunately, her work as an advocate for animal welfare requires constant publicity and funding, so she embraces her role and plays for the camera—anything for the sake of her beloved rescues.But when a big case is on the line, she’s faced with the one obstacle she never counted on: the boy who broke her heart is back, and in order to gain justice, they need to work together.Chloe swears she can handle it until old feelings resurface, and she’s faced with a heartbreaking choice.Will this time end differently—or are they destined to be only each other’s first love—instead of forever?Owen Salt fell hard for Chloe when he was a screwed-up kid in college, and spent the next years changing himself into the man his grandfather believed he was capable of. But when his career led him across the country, he knew he needed to leave the woman he loved behind. He’s never forgotten her, but as the new darling of the press, now, she’s way out of his league. When work brings him back to fight for justice by her side, he swears he can handle it.But he’s never really gotten over his first love—and he wants one more opportunity to prove he’s a man who’s worthy.Can Owen convince the woman who holds his heart to take a second chance on forever—or is it too late for them both?Every 1001 Dark Nights novella is a standalone story. For new readers, it’s an introduction to an author’s world. And for fans, it’s a bonus book in the author’s series.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Second Chance",
    "Contemporary",
    "Second Chance Romance",
    "Workplace Romance"
  ],
  "author": "Jennifer Probst",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/48716175-begin-again"
}