{
  "title": "The Decline and Rise of Democracy: A Global History from Antiquity to Today",
  "description": "\"One of the most important books on political regimes written in a generation.\" —Steven Levitsky, New York Times –bestselling author of How Democracies DieA new understanding of how and why early democracy took hold, how modern democracy evolved, and what this history teaches us about the futureHistorical accounts of democracy’s rise tend to focus on ancient Greece and pre-Renaissance Europe. The Decline and Rise of Democracy draws from global evidence to show that the story is much richer—democratic practices were present in many places, at many other times, from the Americas before European conquest, to ancient Mesopotamia, to precolonial Africa. Delving into the prevalence of early democracy throughout the world, David Stasavage makes the case that understanding how and where these democracies flourished—and when and why they declined—can provide crucial information not just about the history of governance, but also about the ways modern democracies work and where they could manifest in the future.Drawing from examples spanning several millennia, Stasavage first considers why states developed either democratic or autocratic styles of governance and argues that early democracy tended to develop in small places with a weak state and, counterintuitively, simple technologies. When central state institutions (such as a tax bureaucracy) were absent—as in medieval Europe—rulers needed consent from their populace to govern. When central institutions were strong—as in China or the Middle East—consent was less necessary and autocracy more likely. He then explores the transition from early to modern democracy, which first took shape in England and then the United States, illustrating that modern democracy arose as an effort to combine popular control with a strong state over a large territory. Democracy has been an experiment that has unfolded over time and across the world—and its transformation is ongoing.Amidst rising democratic anxieties, The Decline and Rise of Democracy widens the historical lens on the growth of political institutions and offers surprising lessons for all who care about governance.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Economics",
    "Political Science",
    "World History",
    "Academic"
  ],
  "author": "David Stasavage",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/48710539-the-decline-and-rise-of-democracy"
}