{
  "title": "Holiday Magic at the Disney Parks: Celebrations Around the World from Fall to Winter",
  "description": "This deluxe jacketed hardcover is visual storytelling at its best. Almost 1,900 photographs (two-thirds of them taken just for this book) showcase Disney's special menu offerings, decorating details from amazing artists and designers, and the most significant historical holiday events. \n\nA harmonic trio of researchers, writers, and photographers logged more than 180,000 miles visiting every Disney park and resort across the globe, personally documenting the holiday installations through eighty thousand photographs and, wherever possible, meeting the talented and endlessly passionate artisans behind it all.With twelve theme parks and dozens of resort hotels, plus numerous cruise ships, dining and shopping districts, and more than six decades of holiday experiences, there are a lot of pumpkin treatments and ornate trees to reflect upon. (The smallest holiday tree at a Disney property is just four inches high, while the very tallest reaches up to seventy feet.) And each decoration is chosen carefully to fit within a story and is expertly placed on its tree or garland by craftspeople backstage. The decor is installed onstage, maintained, and, ultimately, disassembled by technicians before it is once again cleaned, prepared, and stored in vast warehouses. . .till next year's event. The stories and contributions from so many unsung Cast Members (often hard at work at hours of the night when others are asleep) fill these pages, along with the joys of Halloween, Christmas, Hanukkah, and New Year celebrations. Time to join the party!Searching for that perfect gift for the Disney theme park fan in your life? Explore more archival-quality books from Disney Editions:The Disney Monorail: Imagineering a Highway in the SkyWalt Disney's Ultimate Inventor: The Genius of Ub IwerksOne Day at Disney: Meet the People Who Make the Magic Across the GlobeMarc Davis in His Own Words: Imagineering the Disney Theme ParksYesterday's Tomorrow: Disney's Magical Mid-CenturyEat Like Walt: The Wonderful World of Disney FoodMaps of the Disney Parks: Charting 60 Years from California to ShanghaiThe Haunted Mansion: Imagineering a Disney ClassicPoster Art of the Disney Parks",
  "genres": [
    "Nonfiction",
    "Christmas",
    "Holiday",
    "Halloween",
    "Travel"
  ],
  "author": "Graham  Allan",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/48718191-holiday-magic-at-the-disney-parks"
}