{
  "title": "American Baby: A Mother, a Child, and the Shadow History of Adoption",
  "description": "The truth about postwar adoption in America, told through the bittersweet story of one teenager, the son she was forced to relinquish, and their twin searches to find each other. In 1960s America, premarital sex was not uncommon, but birth control was hard to get and abortion was illegal. In 1961, sixteen-year-old Margaret Erle became pregnant. Her unsympathetic family sent her to a maternity home. In the hospital, nurses would not even allow her to hold her own newborn. After she was finally badgered into signing away her rights, her son vanished into an adoption agency's hold.Claiming to be acting in the best interests of all, the adoption business was founded on secrecy and lies. American Baby lays out how a lucrative and exploitative industry removed children from their birth mothers and place them with families, fabricating stories about infants' origins and destinations, then closing the door firmly between the parties forever. They struck shady deals with doctors and researchers for pseudoscientific \"assessments,\" and shamed millions of young women into surrendering their children.Gabrielle Glaser dramatically demonstrates the expectations and institutions that Margaret was up against. Though Margaret went on to marry and raise a large family with David's father, she never stopped longing for and worrying about her firstborn. She didn't know he spent the first years of his life living just a few blocks away from her, wondering often about where he came from and why he was given up. Their tale--one they share with millions of Americans--is one of loss, love, and the search for identity.Adoption's closed records are being legally challenged in states nationwide. Open adoption is the rule today, but the identities of many who were adopted or who surrendered a child in the decades this book covers are locked in sealed files. American Baby both illuminates a dark time in our history and shows a path to justice, honesty and reunion that can help heal the wounds inflicted by years of shame and secrecy.",
  "genres": [
    "Nonfiction",
    "History",
    "Adoption",
    "Biography",
    "Audiobook",
    "Memoir",
    "Adult"
  ],
  "author": "Gabrielle Glaser",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/48710835-american-baby"
}