{
  "title": "The Kraken's Heart",
  "description": "Lexi\n  Lexi doesn't live anywhere near an ocean, lake, or even a sandbox. When she wakes up on a sandy beach, she knows that something must be very wrong. As she starts to take in her surroundings, she realizes that her situation is worse than she ever could have imagined. She was abducted from Earth and put on display in a massive alien zoo. Her enclosure is surrounded by terrifying alien monsters, but none are as scary as the one she is trapped with. When she first glimpses the Kraken swimming in the water, she was sure that she had been put in the enclosure to become his next meal. After a misunderstanding in their first encounter, she realizes that the shy man with tentacles might not be the monster that she had made him out to be.  \nDrax\n  Drax has been a prisoner in the strange alien zoo for such a long time that his homeworld is a distant memory. His only companion is a humanoid butterfly alien trapped in the cage next to his. When the bugman is gifted a human as a mate, Drax knows that he would do anything to have his own human. He risks his life in a desperate attempt for a mate. Lexi is everything that he could have hoped for and more. He is enchanted by her alien beauty and the two strange appendages she uses to walk. However, he doesn't know how to make her happy in the cage they share. His fumbled introduction only seems to make her more frightened of him. He would do anything to make her happy, even if it means staying out of sight so that his tentacles didn’t scare her again. When he finally allows himself to go near her once more, he realizes that he had misunderstood her fear. His hope soars as he discovers that he might finally have a chance to make her his mate, for she already has his heart.  \nThis novella contains a love story between a tentacled Kraken and a human from Earth. HEA, no cliff-hanger.  This book contains sexually explicit content that is suitable only for mature readers.",
  "genres": [
    "Aliens",
    "Romance",
    "Science Fiction",
    "Science Fiction Romance",
    "M F Romance",
    "Fiction",
    "Novella"
  ],
  "author": "Annie Beth Rider",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/48719926-the-kraken-s-heart"
}