{
  "title": "Finally Free",
  "description": "Blake Porter was one of the lucky ones. She’d met the man she was going to marry while she was in high school. She thought she was living a fairytale; the nerdy wannabe journalist dating the gorgeous star quarterback. One wrong move proved to irrevocably alter the course of their lives.  Betrayed by the girl he loved, Levi McCoy left for the Army and never looked back. Blake’s deception pierced his soul and shattered his heart. He used the pain to his advantage and became cold and calculating - the perfect Black Ops soldier.  Over a decade later, the 707 has been called in to rescue a reporter embedded in a deadly terrorist cell, and Levi’s shocked to learn it’s the one woman who’d once owned his heart. But Blake is no longer the naive teenager she’d once pretended to be. She’s something far more dangerous.  With bombs exploding, blood being spilled, and the terrorists closing in, they both battle the memories of their beautiful beginnings and shared history. Levi and Blake face off in a showdown of wills. In one corner, Levi is determined not to fall for the woman he’s never stopped loving. In the other, Blake tries to hold on to her self-respect and not beg Levi to hear the truth.  When the lies and deception are revealed will they survive with their hearts and lives intact?  The 707 Freedom Series: The 707 is an elite team of Army Commandos. A special Black Ops team known as the 707 research and development group. They have a two-person chain of command: their Commander and the President. Meet the men of the 707: Lenox, Jasper, Levi, and Clark. Watch as they show us that sacrifice, commitment, and bravery are not just for the battlefield. Each man must fight to find and protect the women who are theirs. Each book is a standalone, a look into the life of a Special Forces soldier's life and the code they live and die by.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Romantic Suspense",
    "Military Romance",
    "Audiobook",
    "Suspense",
    "Second Chance"
  ],
  "author": "Riley Edwards",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/48711402-finally-free"
}