{
  "title": "Immoral Surrender: Complete Immoral Series",
  "description": "A lonely wife. A neglectful husband. A 6'5\" tall drink of hot chocolate with sensuality to spare.Claire has just had her life uprooted by her husband as he moved them to a new city for a fresh start. He is supposed to be showing her how much he has changed, but all she sees is more of the same. She longs for more, but doesn't believe it is possible - until she meets Tony. Tony is the dream man every woman in town wants to get her hands on. The epitome of sensuality, he is a salsa dance instructor, and he takes a liking to Claire. She agrees to take lessons from him and finds herself feeling like a new woman when she's with him. How will she respond when the discovers a desire she's never known before? Follow her very real and compelling adventure thought self doubt, real life struggles, and the slow transformation into something more than she ever imagined. Discover what life has to offer with Claire in Discovering Desire!Alan Austin is a national award winning author now writing erotic fiction under a new pen name and outside of his established publication outlet in order to delve into some of his deepest desires and fantasies. Alan and his wife are both authors who enjoy the wilder side of life and leverage some of their own experiences along with a healthy dose of imagination to heat things up in their writing. Alan is a mid-thirties family man from the Midwest United States with an amazing wife and the best kids in the world. He enjoys working out and reading when he has time between family activities and writing. Alan grew up on the west coast before moving his family inland to make a home for himself. He is an active volunteer in his community and loves serving others. Alan and his wife enjoy sharing their wildest fantasies and he uses his short stories as vehicle to share them with others. It is his hope that his short stories can bring some excitement to others!Please follow Alan's erotic fantasy author page on Facebook at",
  "genres": [],
  "author": "Alan Austin",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/48713092-immoral-surrender"
}