{
  "title": "Sapphire and Steel",
  "description": "Svagnar is the ferocious warrior jarl of Arkavic.To stop the constant attacks on his country, he's formed an audacious abduct his enemy's daughter and make her his wife, hoping that tying their countries together through marriage will end the war.But the last thing he intends is to become dangerously attracted to his stolen bride.Aster is the captain of the princess's guard. She is low-born, steadfast and fiercely loyal. But the princess is sent away to be wed, and on the way they are surprised by a group of barbarian warriors. To save the princess from capture, Aster claims to be her and gets taken instead.The last thing she expects is to become a royal bride in a desperate bid to save a country.Caught between war and peace, lies and loyalty, duty and lust, the two find themselves dangerously drawn to each other.But in the chess game of war, the heart is always the first pawn to be sacrificed.This is a stand-alone, enemies-to-lovers, forced marriage romance set in the medieval fantasy world of Westmere and contains sexual content only suitable for adults.---\"A blend of Game of Thrones & Radiance (by Grace Draven).\" Becca, Goodreads ★★★★★\"The world is is beautiful, you've got angst, you've got pining, you've got action, and the sex is hot as. I really adored this book.\" Emily, Amazon Review ★★★★★\"The lyrical narrative was an absolute joy to read. Was my first time reading a romance novel and if all romance novels are like this I should read more!\" Grey, Goodreads ★★★★★\"With a bit of intrigue, a lot of chemistry and a bucket load of romance, this story was one I couldn't put down and I recommend it to anyone who enjoys romance.\" Jules, Amazon Review ★★★★★\"I love a good bodice-ripper and this absolutely qualifies. A traditional story line, told well, with compelling characters. I would definitely recommend this as a good, fun, sexy read.\" Amanda, Goodreads ★★★★★",
  "genres": [
    "Fantasy",
    "Romance",
    "Enemies To Lovers",
    "Fantasy Romance",
    "Romantasy",
    "Adult",
    "Historical Fiction"
  ],
  "author": "Violet Froste",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/48738550-sapphire-and-steel"
}