{
  "title": "The Cop & The Curves",
  "description": "The Curves of a Feather Collection is a series of sweet, steamy, stand-alone shorts about older Alpha men falling in love with younger, curvy women.   Chase  I’ve given up hope on ever finding my one-and-only. Pretty girls flock to me like birds to a feather but none of them are what I want. I want my forever girl. I want curves that just don’t quit and a fiery attitude that can keep me warm during the longest, coldest winter nights.  I’ll fight for that woman… if I ever find her.  I’ve been over oceans and through mountain ranges and across entire continents fighting for my country. I scour my home city now as a vigilant police officer. I keep my eyes open for crime and crime only — I’ve long since accepted that I won’t ever find true love.  That’s why I’m so shocked when I rescue Jenny. She’s the sweetest, most beautiful woman I have ever laid my eyes on. Is this it? Is this what true love feels like? I’m sure it is! She could be my saviour in this lonely world. I’ll do anything to keep her by my side. Who’s going to stop me?   Jenny  I don’t lead the most exciting existence, that’s why it’s such a shock when the most eventful day of my year turns into the most important moment of my life.  Today, I was rescued by the most handsome man I have ever seen… and I think he likes me!  I don’t want to get my hopes up too high, though. This guy’s a former soldier and current smoking-hot cop. Lady’s love a tall, hunky man in uniform and I’ll be the first to admit, I don’t exactly have runway model proportions.  But when Chase’s chiseled arms pull me out of a chaotic emergency at my workplace, I get the sense that he could lead me to something more than just safety.  I’ll follow him right to his bedroom, if he asks.  Oh, please let him ask!  Can he finally lead me to my happily-ever-after?   This story features instant-love, scolding sex scenes, and a sweet, happy ending. There are no cliffhangers! The book is completely self-contained. So, if you’re looking for a quick dose of pure, steamy romantic pleasure, this is the story for you!",
  "genres": [],
  "author": "J.J. Loraine",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/48730053-the-cop-the-curves"
}