{
  "title": "Sentinels of Oz",
  "description": "We’ve rid Oz of two outsider murderers. Glinda is next.\n\nFirst, the Oz just had to go vote in some yahoo who crashed here in a flying balloon. He turned Oz against the Sentinels and everyone started calling us witches. There were always four Sentinels protecting Oz—North, South, East, and West. I swear, everyone where that Wizard comes from must be an utter sociopath because the next person who ended up in Oz dropped a house on my aunt and murdered my mother. She stole my aunt’s silver slippers right off her corpse like some savage.Glinda has established herself as the Good Witch of the South and abandoned her duties as a Sentinel. She wants to rule Oz instead of balancing the Four Points. Instead of learning from our ancestors, Glinda wants everyone to learn magic and compete for the honor of being one of the four Sentinels at Emerald City Academy. I’m competing against Munchkins, Winkies, Quadlings, and that psychopathic farm girl has been invited because she’s Glinda’s golden girl. The Gillikins in the North seem to be suspiciously left out of the school, which is odd because when good and Wicked Witch assignments were being given out, Locasta was crowned Good Witch of the North.I honestly don’t know if Dorothy is dense or just evil. She’s got a Munchkin fan club and they are picking on my cousin Saffron because they think her mother was the Wicked Witch of the East. I can’t do anything about it because I have to figure out what this school is really about. I’ve got my Winkie friend Oprix, and Idris, the Prince of the Flying Monkeys here with us. No one knows the Flying Monkeys can now shift into men. The Quadling Headmaster, Daxar, seems to be on my side.\n\nSomeone started this. Someone broke Oz. It’s up to me, the daughter of the alleged Wicked Witch of the West to fix it. If I have to murder Dorothy Gale and Glinda the Good, so be it. I’m fixing Oz and restoring the Sentinels. No one at this school is taking my birthright.",
  "genres": [
    "Fantasy"
  ],
  "author": "J.B. Trepagnier",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/48735867-sentinels-of-oz"
}