{
  "title": "Gilded Lives, Fatal Voyage: The Titanic's First-Class Passengers and Their World",
  "description": "Gilded Lives, Fatal Voyage takes us behind the paneled doors of the Titanic’s elegant private suites to present compelling, memorable portraits of her most notable passengers.  The intimate atmosphere onboard history’s most famous ship is recreated as never before.    The Titanic has often been called “an exquisite microcosm of the Edwardian era,” but until now, her story has not been presented as such. In Gilded Lives, Fatal Voyage, historian Hugh Brewster seamlessly interweaves personal narratives of the lost liner’s most fascinating people with a haunting account of the fateful maiden crossing. Employing scrupulous research and featuring 100 rarely-seen photographs, he accurately depicts the ship’s brief life and tragic denouement, presenting the very latest thinking on everything from when and how the lifeboats were loaded to the last tune played by the orchestra. Yet here too is a convincing evocation of the table talk at the famous Widener dinner party held in the Ritz Restaurant on the last night. And here we also experience the rustle of elegant undergarments as first-class ladies proceed down the grand staircase in their soigné evening gowns, some of them designed by Lady Duff Gordon, the celebrated couterière, who was also on board.      Another well-known passenger was the artist Frank Millet, who led an astonishing life that seemed to encapsulate America’s Gilded Age—from serving as a drummer boy in the Civil War to being the man who made Chicago’s White City white for the 1893 World Exposition. His traveling companion Major Archibald Butt was President Taft’s closest aide and was returning home for a grueling fall election campaign that his boss was expected to lose. Today, both of these once-famous men are almost forgotten, but their ship-mate Margaret Tobin Brown lives on as “the Unsinkable Molly Brown,” a name that she was never called during her lifetime.        Millionaires John Jacob Astor and Benjamin Guggenheim, writer Helen Churchill Candee, movie actress Dorothy Gibson, aristocrat Noelle, the Countess of Rothes, and a host of other travelers on this fateful crossing are also vividly brought to life within these pages. Through them, we gain insight into the arts, politics, culture, and sexual mores of a world both distant and near to our own. And with them, we gather on the Titanic’s sloping deck on that cold, starlit night and observe their all-too-human reactions as the disaster unfolds. More than ever, we ask ourselves, “What would we have done?”",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Historical",
    "Edwardian",
    "American History",
    "20th Century"
  ],
  "author": "Hugh Brewster",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/12478862-gilded-lives-fatal-voyage"
}