{
  "title": "A Tiger's Tale",
  "description": "There once was a happy tigerWho lived on the isle of SumatraWith large green forests in which to roamMany tiger families called it home But people came; some broke the lawThey cut many trees with a mighty sawMen slashed and burned forests of the landDestroying much more than originally plannedThe orangutans fled; elephants; tigers tooAfter all was said, what could they do?Learn about the endangered Sumatran Tiger, the threats he faces, and the ways we can help him to survive in this beautifully illustrated rhyming story for ages 4+.A Tiger's Tale was a silver medal winner in The Wishing Shelf Book Awards 2019.Reviewed by Mamta Madhavan for Readers' Favorite - 5 StarsA happy tiger lived on the island of Sumatra where there were large green forests to roam and it was home to many tigers. But people came there and cut down the trees, broke the law, and burned the forests of the land. The destruction caused the animals to flee and the men struggled and toiled to farm rubber, tea, and palm oil. They grew coffee and built houses and the tiger had nowhere to go. He wanted to go back to the forest he once knew. The children came together from every town to save the animals and they knew the animals' future depended on them. They decided to give the animals lots of space with many trees. The adults also followed the children's plans and the animals returned to the forest in large numbers. The tiger took himself a beautiful wife and settled down happily.A Tiger's Tale (Wayne Gerard Trotman's Rhyming Stories) by Wayne Gerard Trotman is an adorable story that speaks about the dangers faced by the Sumatran tigers and how they can be helped to survive in the large green forests of Sumatra. Nhat Hao Nguyen's wonderful illustrations add color and movement to the rhyming verses and make them palpable to young readers. The concept has been dealt with in an entertaining way and will encourage children to help protect endangered animals and the forests so that animals' homes are intact. A Tiger's Tale is a good book to make children aware of the importance of protecting endangered species by saving the forests from being cut down and destroyed by unscrupulous people. It is also a good way to introduce children to rhyming words.",
  "genres": [],
  "author": "Wayne Gerard Trotman",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/48740529-a-tiger-s-tale"
}