{
  "title": "Forbidden Lust",
  "description": "Feel the drama and passion in the Dynasties: Seven Sins series!Next stop, paradise—With the man of her forbidden fantasies?Giving in to desire with her brother’s best friend…A secluded island resort is the perfect romantic setting for the night of passionate abandon Allison Randall plans to share with Zane Patterson. Her elder brother’s best friend has always been off-limits…and Zane is determined to keep it that way. But when a storm strands them together, neither can hold back. Everything Allison dreamed of is finally in reach…until unwelcome revelations threaten a rude awakening!Harlequin Desire: Luxury, scandal, desire—welcome to the lives of the American elite.One man’s betrayal can destroy generations. Fifteen years ago, a hedge-fund hotshot vanished with billions, leaving the high-powered families of Falling Brook changed forever. Now seven heirs, shaped by his betrayal, must reckon with the sins of the past. Passion may be their only path to redemption. Experience all Seven Sins!DYNASTIES: SEVEN SINSBook 1: Ruthless Pride by Naima SimoneThis CEO’s pride led him to give up his dreams for his family. Now he’s drawn to the woman who threatens everything…Book 2: Forbidden Lust by Karen BoothHe’s always resisted his lust for his best friend’s sister—until they’re stranded together in paradise…Book 3: Insatiable Hunger by Yahrah St. JohnHis unbridled appetite for his closest friend is unleashed when he believes she’s fallen for the wrong man…Book 4: Hidden Ambition by Jules BennettAmbition has taken him far, but revenge could cost him his one chance at love…Book 5: Reckless Envy by Joss WoodWhen this shark in the boardroom meets the one woman he can’t have, envy takes over…Book 6: Untamed Passion by Cat SchieldWill this black sheep’s self-destructive wrath flame out when he’s expecting an heir of his own?Book 7: Slow Burn by Janice MaynardIf he’s really the idle playboy his family claims, will his inaction threaten a reunion with the woman who got away?",
  "genres": [
    "Harlequin",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Harlequin Desire"
  ],
  "author": "Karen Booth",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/48734295-forbidden-lust"
}