{
  "title": "Laced",
  "description": "A haunted castle, a pair of international jewel thieves, and a hotel fire -- so begins Regan and Jack Reilly's honeymoon in Ireland . . .Private Investigator Regan Reilly and her husband, Jack, head of the Major Case Squad in New York City, have just gotten hitched! They've headed to Hennessy Castle, a romantic spot in western Ireland -- seemingly the perfect place to escape the world and the criminals they deal with daily -- to begin their lives together. But Hennessy Castle is hardly relaxing!Their first afternoon in Ireland, Regan and Jack go out for a jog, stopping at an old graveyard at the edge of town. The first tombstone they see is marked REILLY. Turns out May Reilly, who died in 1822, was a talented lacemaker who made an exquisite tablecloth for a banquet at Hennessy Castle but was never paid. Legend has it that May has haunted the castle ever since.Awakened in the middle of the night, Regan spots a mysterious woman on the back lawn of the castle. At the sound of Jack's voice, Regan turns her head for a moment. When she turns back, the woman is gone. A moment later, the hotel's fire alarm goes off.In the ensuing melee, Regan and Jack meet a young American Irish couple, Sheila and Brian O'Shea, who have started a business selling Irish memorabilia -- but on this trip to Ireland their \"business\" is to pick up paintings they've commissioned from a superstitious amateur artist who doesn't realize the value of her work. The last thing these two online entrepreneurs want is for Regan and Jack to figure out what they're up to.The following morning, May Reilly's famous tablecloth is discovered missing from the memorabilia room at the castle, and a note has been left forJack by an elderly couple who checked out immediately after the fire. The \"elderly\" couple is, in fact, two international jewel thieves in disguise, who refer to themselves as \"Jane and John Doe.\" Taunting Jack, who has been on their trail for more than a year, they claim responsibility for the theft of May Reilly's tablecloth, knowing full well that Jack won't be able to enjoy his honeymoon when he finds out they were right under his nose and may still be in Ireland.With the help of Regan's Irish cousin -- Galway resident Gerard Reilly -- Regan and Jack hunt for the thieves who have eluded law enforcement for too long. Their search takes as many twists and turns as the winding country roads of the Emerald Isle, as they travel from tiny villages to the crowded pubs of Galway and back to Hennessy Castle -- where May Reilly is not resting in her grave!Filled with Irish history and lore, and a cast of quirky characters on both sides of the Atlantic, \"Laced\" will take you on a journey that will keep you laughing, turning pages, and maybe even believing in ghosts!",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Cozy Mystery",
    "Suspense",
    "Ireland",
    "Romance"
  ],
  "author": "Carol Higgins Clark",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/487325.Laced"
}