{
  "title": "Mo Dearbadande: My Butterfly",
  "description": "***Warning*** This book contains intense scenes of physical, mental, and sexual abuse. It also explores sexual themes of a taboo nature. Please do NOT purchase this eBook if you find such content disturbing or offensive. However, if you enjoy a story about dealing with deep-seated issues, healing past hurts, and the positive transformation that ensues, please enjoy this most riveting tale!Praise for My Butterfly \"I devoured this book in just four short days. I must say, I'm very impressed with this submission as the first novel from SJ Byrne. I have read the works of several novice writers this year, and this by far stands out from the rest...This tale is not one for the faint of heart; it delves into the depths of the darkest aspects of the human psyche, without fear of restraint or taboo. But only with the exploration of the dark can one truly experience and appreciate the light. The fear, awkwardness, and hesitation of the main character takes a full grip upon the reader, as does her strength and growth.\"Heather SchuckerAnother 5 star review... \"This was an amazing book...the story flowed from one scene to the next. I was caught up from the very beginning, just couldn't stop reading! This author has a way of making you see just what she is writing about.\"dmslsfly \"Lj.\"Overview of My Butterfly An abusive marriage isn't all that uncommon; getting out of one after more than fifteen years is. Every survivor has their personal way of coping, Katherine Daniels uses the creative outlet of her art to heal scars that refuse to fade. Before she can be completely free, she must face the dark secret of a disturbing desire that was born within her destructive marriage.More praise... \"I'm absolutely fascinated. I've read other books that were supposed to be set in Scotland, but really, it could have been anywhere. This one brings the places alive like no other.\"Ana Easton\"I love this journey! Its full of emotion and innovations! A definite keeper I will return to read many times. Superb detail in the story telling. I am looking forward to the next one!!!\"M. Sinemus\"Lovely story. I was moved at the end...I loved it. Breathtaking.\"Tanger",
  "genres": [],
  "author": "S.J.  Byrne",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/12479128-mo-dearbadande"
}