{
  "title": "Aline and the Blue Bottle",
  "description": "In the beginning there was only One World, where creatures with white magic, with black magic, and with no magic lived. As their powers grew, so did the thirst for power until it all ends during the War of Magic. The One World is divided into 8 7 with magic and 1 with no magic—the human world.For thousands of years, the 8 worlds live in peace. But secrets begin to brew to either protect or to threaten the peace. One secret, was Aline, who lives in the human world with no awareness of the other seven magical worlds. Where nothing special ever happens to her. She lives a plain life with horrible school mates where she has no friends.On her 12thbirthday, on Halloween, she has to flee to a new magical world. In this world she learns that she has magical powers and must figure out how to use them in order to defend herself from a horrible warlock named Dashiok. She meets two sisters, Cristina, a nature sylph, and Sofia, a sense sylph, who become her best friends. Together they receive powers from magical meteors in an Endowing Ceremony.During her training sessions with the sisters, she discovers that a magical blue bottle needs Aline’s help. Dashiok wants to use the powerful blue bottle to take over the 8 worlds. This leads Aline to go on her first quest. Some of the members of the High Wizard Council join Aline and her friends and they become the quest carriers.The quest carriers travel through the Winding Forest, the Bleak forest, and finally the Southern Shores where they fight an army of hobgoblins, enchanted colossals, and yawares to find the blue bottle. Here Aline faces Yakar, the first and only vampire.Aline finds out that before she was born, when Dashiok was trying to take her, he transfers some of Yakar’s powers to Aline and this creates the only real connection Yakar ever had to another leaving being.The link between the Yakar and Aline secures her safety, and the quest carriers are able to take the blue bottle away from Dashiok.See if you can uncover all of the secrets hidden in the magical worlds where Aline and her friends have their adventures…",
  "genres": [
    "Fantasy"
  ],
  "author": "Carolina Ugaz-Morán",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/48749440-aline-and-the-blue-bottle"
}