{
  "title": "Bach's Musical Universe: The Composer and His Work",
  "description": "A concentrated study of Johann Sebastian Bach’s creative output and greatest pieces, capturing the essence of his art.Throughout his life, renowned and prolific composer Johann Sebastian Bach articulated his views as a composer in purely musical terms; he was notoriously reluctant to write about his life and work. Instead, he methodically organized certain pieces into carefully designed collections. These benchmark works, all of them without parallel or equivalent, produced a steady stream of transformative ideas that stand as paradigms of Bach’s musical art.In this companion volume to his Pulitzer Prize–finalist biography, Johann Sebastian Bach: The Learned Musician, leading Bach scholar Christoph Wolff takes his cue from his famous subject. Wolff delves deeply into the composer’s own rich selection of collected music, cutting across conventional boundaries of era, genre, and instrument. Emerging from a complex and massive oeuvre, Bach’s Musical Universe is a focused discussion of a meaningful selection of compositions—from the famous Well-Tempered Clavier, violin and cello solos, and Brandenburg Concertos to the St. Matthew Passion, Art of Fugue, and B-minor Mass.Unlike any study undertaken before, Bach’s Musical Universe details Bach’s creative process across the various instrumental and vocal genres. This array of compositions illustrates the depth and variety at the essence of the composer’s musical art, as well as his unique approach to composition as a process of imaginative research into the innate potential of his chosen material. Tracing Bach’s evolution as a composer, Wolff compellingly illuminates the ideals and legacy of this giant of classical music in a new, refreshing light for everyone, from the amateur to the virtuoso.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "German Literature"
  ],
  "author": "Christoph Wolff",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/48749110-bach-s-musical-universe"
}