{
  "title": "The Trouble in Willow Falls",
  "description": "After a scathing blogger review and a negative Atlanta television newscast tarnish Willow Falls’ reputation as a secluded North Georgia tourist destination, the town council votes to use the remainder of its annual budget to hire a PR firm to restore the town's image. At a town-hall meeting, angry residents brainstorm ideas to boost Willow Falls’ appeal. When a second Atlanta television station announces plans to film a segment for its Around Georgia series, residents invest their time and limited resources to spruce up Main Street’s appearance. Willow Post editor Emily Hayes can't help but shake her head at her town's desperate efforts.  For months, Emily has submitted her novel to numerous publishers but received only rejections. When famous artist Naomi Jasper offers Emily much-needed cash to finish writing, then cast and direct a play about Willow Falls’ colorful history, Emily faces a difficult decision—postpone the rewrite of her novel or accept the project. After convincing her sister, Rachel Streetman, to partner with her, Emily puts her dreams on hold and agrees to take on the play. Failure to deliver is not an option.  All her life Rachel has dreamed of becoming a stage actress, so when she receives an invitation to audition for a respected Broadway director, Rachel abandons her sister and the Willow Falls play. But an incident with the director sends her reeling back into the arms of Charlie Bricker, her one true love. Out of options, Rachel reluctantly accepts her part in the town play with the slim hope that her performance might kick-start her career.  If anyone understands broken hearts, it's Willow Inn’s beloved innkeeper, Sadie Liles. Sadie has learned to live with the fact that love is the last thing she'll ever find. Then he walks through the front door.  As the town prepares for Redding Arms’ grand opening, five newcomers and one British tourist test the town’s quirky, lovable, argumentative residents’ souls. Digging deep to deal with the strife, bickering, and personal backstabbing will test Willow Falls in ways the small town never imagined. Could it be that the trouble in Willow Falls is the very thing that reminds its residents that honesty, love, and loyalty to one another is what binds them together?",
  "genres": [
    "Fiction",
    "Contemporary",
    "Christian Fiction"
  ],
  "author": "Pat Nichols",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/48743633-the-trouble-in-willow-falls"
}