{
  "title": "The Iron Triangle: Inside the Liberal Democrat Plan to Use Race to Divide Christians and America in their Quest for Power and How We Can Defeat Them",
  "description": "To save America and the world, Conservatives must first answer this one very important Why do the vast majority of Christian African Americans vote for the Atheist/Anti-Christian, Liberal Democrat Party?This book answers that question. Why is this important? The answering of this question and the implementation of the suggested remedies will greatly improve America's chances of ushering in an enlightened era of freedom and prosperity, while critically damaging its primary source of The Democrat Party. This evil party could not survive without 90% of Christian African American vote.Conservatives Why would African Americans forsake their children, spouses, communities, lives, freedom and GOD for the Democrat Party? Presently, Democrats control every Black ghetto, every failing Black school, every drug corner and every prison in America. Amazingly, the majority of African Americans love them for it. Why? This book explains it.This book argues that falsely accused White Christian conservatives have nothing more for which to apologize. Despite slanderous accusations of racism and hatred, this book reassures Conservatives, and encourages them to press forward. The real oppressors are now unmasked. To control African Americans during and after the Civil Rights Movement, White Democrats organized and formed an unholy alliance with most Black preachers, Black civic organizers and Black politicians. I call this trifecta the \"Iron Triangle.\" It has worked perfectly.This book exposes the greatest continuous betrayal in The betrayal of America in general, and of Black America in particular by the Democrat Party and the Iron Triangle. It utilizes lessons and anecdotes from my life experiences in the Jim Crow South, in the Black church, as a correctional officer, leading civic organizations, and involvement in politics to illustrate these facts. It traces the origins and explains the rationale behind the Black community's fatal attraction to the oldest and most prolifically evil organization in history. It further explains how liberals have used this deadly infatuation to take over the Democrat Party and America.This book explains why undermining Christianity and inciting racial discord between Black and White Christians is essential to Democrat Party survival. It explains why Democrat Party leadership believes the gospel of Jesus Christ is poisonous, racial reconciliation is catastrophic, and atheism is necessary. This book explains how their plans can be countered. It is a primer, designed to teach Conservatives how to communicate with a Democrat who has been indoctrinated with a lifetime of lies. This book teaches history, psychology, religion, philosophy and truth. So let's talk to and reason with our brothers and sisters in Christ, and our fellow countrymen. Then, lets dismantle this Iron Triangle and save America.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History"
  ],
  "author": "Vince Everett Ellison",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/48758366-the-iron-triangle"
}