{
  "title": "Everybody (Else) Is Perfect: How I Survived Hypocrisy, Beauty, Clicks, and Likes",
  "description": "From the former editor-in-chief of Nylon comes a provocative and intimate collection of personal and cultural essays featuring eye-opening explorations of hot button topics for modern women, including internet feminism, impossible beauty standards in social media, shifting ideals about sexuality, and much more. Gabrielle Korn starts her professional life with all the right credentials. Prestigious college degree? Check. A loving, accepting family? Check. Instagram-worthy offices and a tight-knit group of friends? Check, check. Gabrielle’s life seems to reach the crescendo of perfect when she gets named the youngest editor-in-chief in the history of one of fashion’s most influential publication. Suddenly she’s invited to the world’s most epic parties, comped beautiful clothes and shoes from trendy designers, and asked to weigh in on everything from gay rights to lip gloss on one of the most influential digital platforms. But behind the scenes, things are far from perfect. In fact, just a few months before landing her dream job, Gabrielle’s health and wellbeing are on the line, and her promotion to editor-in-chief becomes the ultimate test of strength. In this collection of inspirational and searing essays, Gabrielle reveals exactly what it’s truly like in the fashion world, trying to find love as a young lesbian in New York City, battling with anorexia, and trying not to lose herself in a mirage of women’s empowerment and Instagram perfection. Through deeply personal essays, Gabrielle recounts her struggles to reconcile her long-held insecurities about her body while coming out in the era of The L Word, where swoon-worthy lesbians are portrayed as skinny, fashion-perfect, and power-hungry. She takes us with her everywhere from New York Fashion Week to the doctor’s office, revealing that the forces that try to keep women small are more pervasive than anyone wants to admit, especially in a world that’s been newly branded as woke. From #MeToo to commercialized body positivity, Korn’s biting, darkly funny analysis turns feminist commentary on its head. Both an in-your-face take on impossible beauty standards and entrenched media ideals and an inspiring call for personal authenticity, this powerful collection is ideal for fans of Roxane Gay and Rebecca Solnit.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Essays",
    "LGBT",
    "Feminism",
    "Queer",
    "Audiobook"
  ],
  "author": "Gabrielle  Korn",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/48748023-everybody-else-is-perfect"
}