{
  "title": "DNA Nation: How the Internet of Genes is Changing Your Life",
  "description": "\"An indispensable resource for understanding the complex world of over-the-counter genetic testing ... the impressive book explores territory that is both easy to understand and enlightening.\"---Kirkus Review  \"Highly important, life-changing and delightfully written...[Pistoi] is pulling the rug out from under many of our preconceptions...with continuous wit and humor. A book which indeed demands to be savored.\"--- Paul Levinson, author of The Silk Code and The Plot to Save Socrates  Millions of people have done it: with a few clicks and some spit, and at less than the cost of a fancy dinner, you can buy a reading of your DNA online. With this in hand, you can find out where you came from, trace relatives around the world and find new friends on a genetic social network. You can learn about your predisposition to disease, get a genetically tailored diet, understand the sports to which you or your children might be more suited, and even find a date. It’s the dawn of consumer genomics, where the progress of biology meets the power of the Internet and big data.  But do these applications work? Can we really prevent diseases based on what we read in our DNA? What do scientists say? And do we really understand the implications? What happens if things go wrong and the data is misused or the trust abused?  Sergio Pistoi, a journalist and a DNA scientist, investigated this brave new world first-hand by interrogating his own genes, and has provided a practical, informative and thought-provoking survival guide to home genetic testing. From medicine to food, from social networking to genealogy and advertising, this book will show you how the DNA revolution is beginning to have such a profound impact on our daily lives and privacy and why it will influence the choices we make.  If you are interested in how social media meets cutting-edge science, and what it means for your life, or if you are considering buying a DNA test, then this is the book for you.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Technology",
    "Health",
    "Genetics",
    "Internet"
  ],
  "author": "Sergio Pistoi",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/48758450-dna-nation"
}