{
  "title": "Voyage in the Dark",
  "description": "'It was as if a curtain had fallen, hiding everything I had ever known,' says Anna Morgan, eighteen years old and catapulted to England from the West Indies after the death of her beloved father. Working as a chorus girl, Anna drifts into the demi-monde of Edwardian London. But there, dismayed by the unfamiliar cold and greyness, she is absolutely alone and unconsciously floating from innocence to harsh experience. Her childish dreams have been replaced by the harsher reality of living in a man's world, where all charity has its price. Voyage in the Dark was first published in 1934, but it could have been written today. It is the story of an unhappy love affair, a portrait of a hypocritical society, and an exploration of exile and breakdown; all written in Rhys's hauntingly simple and beautiful style. Jean Rhys (1894-1979) was born in Dominica. Coming to England aged 16, she drifted into various jobs before moving to Paris, where she began writing and was 'discovered' by Ford Madox Ford. Her novels, often portraying women as underdogs out to exploit their sexualities were ahead of their time and only modestly successful. From 1939 (when Good Morning, Midnight was written) onwards she lived reclusively, and was largely forgotten when she made a sensational comeback with her account of Jane Eyre's Bertha Rochester, Wide Sargasso Sea, in 1966.If you enjoyed Voyage in the Dark, you might like James Joyce's A Portrait of the Artist as a Young Man, also available in Penguin Classics.'A wonderful bitter-sweet book, written with disarming simplicity'Esther Freud, Express'Her eloquence in the language of human sexual transactions is chilling, cynical, and surprisingly moving'A.L. Kennedy",
  "genres": [
    "Fiction",
    "Classics",
    "Novels",
    "20th Century",
    "Literature",
    "Female Authors",
    "Historical Fiction"
  ],
  "author": "Jean Rhys",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/487580.Voyage_in_the_Dark"
}