{
  "title": "Wick",
  "description": "Malik Dawson – better known to his brothers as Wick; The Vice President of The Kings of Retribution MC, Louisiana Chapter. He lives for his club. The unity and loyalty of the brotherhood give him a sense of purpose and belonging he felt he was missing after years of serving his country. But all men have their demons, and Wick carries the pain and guilt of losing his childhood friend; the friend he feels he did not protect as they fought side by side in combat. Before he died, Damien made him promise to always be there for his little sister, Vayda; look after her and protect her if something were to ever happen to him. Following through on a vow made years ago, Wick watches over his fallen comrade's sister. Then one night, he kisses her, and he no longer sees her as his friend's kid sister. She becomes so much more. It should never have happened. That's what he keeps telling himself. Wick becomes torn between what he wants and the promise he made to his friend years ago. Distancing himself, Wick avoids the overwhelming need to claim her and make Vayda his. When a rescue mission is compromised, and Vayda's life is on the line, Wick holds nothing back. He sets out on a mission of his own to find her—killing anyone who gets in the way. Vayda Wilder—aka—Tequila, comes from a long line of military service members: Grandfather, Father, and big brother, Damien. All her life, she dreamed of becoming a United States Air Force pilot. Chasing her dreams, Vayda enlists straight out of high school, becoming the best soldier and pilot she could be. A few years later, her brother's death left her devastated. Damien was Vayda's hero and the one person who she felt truly understood her. With years of experience, Vayda starts taking on secret covert missions and saving countless lives from the evil grip of human traffickers. Soon her assignments begin crossing paths with her brother's best friend, Malik. One unforgettable kiss changes everything—yet it doesn't. Malik becomes distant—treating her like she no longer exists. Burying herself deep in mercenary work helps take her mind off the man she wants until she finds herself captured by the Cartel. Fighting for his woman, Malik, and The Kings of Retribution become Vayda's only hope of making it out alive.",
  "genres": [
    "Romance",
    "Contemporary",
    "Suspense",
    "Motorcycle",
    "Erotica",
    "Military Fiction",
    "Friends To Lovers"
  ],
  "author": "Sandy Alvarez",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/48762332-wick"
}