{
  "title": "Elijah Wolfe",
  "description": "ElijahWhen I step inside the courtroom, things happen. Opposing counsel cringes and the judges take a deep breath because they know what they’re in for. They have held me in contempt more times than I can count, and I’ve never lost a case. They don’t call me the “Wolfe” for nothing. I’m decisive, aggressive, and strong, both in the courtroom and in the bedroom. I like order and control, and everyone knows it. Everyone except for Aspen Michaelson, the new associate my mother hired to work at our firm.Her interview wasn’t the first time I laid eyes on her and her sexy body. We shared one magical night together in Hawaii. We were two strangers who only knew each other’s first names. She left in the middle of the night without a word. I never forgave her for that. I was the one who always left, not the other way around. Now that she worked for me, I would do everything I could to make her pay for that night, to show her I was the boss in the office and the bedroom. But I lost control over her and her quirky ways, and I didn’t know how to stop it.AspenAfter my father passed away, I moved from Connecticut to New York City, where my sister and her husband lived. Working at a prestigious law firm in New York had always been a dream of mine. Caitlin Wolfe made that dream come true when she hired me to work at her top law firm. Little did I know that Elijah Wolfe, the man with whom I had one amazing night in Hawaii, was her son, senior partner, and future CEO of Wolfe & Associates. He looked just as sexy in New York as he did in Hawaii, but he was different. He was cold and calculating. Not the man who seduced me and brought me back to his suite. He was my boss, and he was setting me up to fail.The one thing he didn’t know about me was that I played the game just as good as he did, if not better. I needed to stay in control of both my body and mind, but he made it very difficult with his tailored designer suits and the cologne he wore that sent my pheromones into overdrive.Let the games begin..18+",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "New Adult",
    "Second Chance"
  ],
  "author": "Sandi Lynn",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/48761377-elijah-wolfe"
}