{
  "title": "The Swap",
  "description": "\"No list of thrillers is complete without Robyn Harding\", proclaims Real Simple. Now the USA Today best-selling author of The Party delivers a riveting tale about the toxic relationship between two couples after a night of sexual shenanigans and the manipulative teenager with an explosive secret at the center of it all.Low Morrison is not your average teen. You could blame her hippie parents or her looming height or her dreary, isolated hometown on an island in the Pacific Northwest. But whatever the reason, Low just doesn’t fit in - and neither does Freya, a once-famous social media influencer who now owns the pottery studio in town.After signing up for a class, Low quickly falls under Freya’s spell. And Freya, buoyed by Low’s adoration, is compelled to share her darkest secrets and deepest desires. Finally, both feel a sense of belonging...that is, until Jamie walks through the studio door. Desperate for a baby, she and her husband have moved to the island hoping that the healthy environment will result in a pregnancy. Freya and Jamie become fast friends, as do their husbands, leaving Low alone once again.Then one night, after a boozy dinner party, Freya suggests swapping partners. It should have been a harmless fling between consenting adults, one night of debauchery that they would put behind them, but when one of the women becomes pregnant, Low finds the perfect opportunity to unleash her growing resentment.Robyn Harding brings her acclaimed storytelling, lauded as \"fast-paced, thrilling, gut-wrenching\" by Taylor Jenkins Reid, New York Times<‘i> best-selling author of Daisy Jones and the Six, to this dark and suspenseful thriller for fans of Megan Miranda and Lisa Jewell.",
  "genres": [
    "Thriller",
    "Mystery Thriller",
    "Fiction",
    "Mystery",
    "Audiobook",
    "Contemporary",
    "Suspense"
  ],
  "author": "Robyn Harding",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/48805365-the-swap"
}