{
  "title": "American Fantasy Novels (Study Guide): The Magicians, the Land of the Silver Apples, David and the Phoenix, When the Green Star Calls, Tam Lin",
  "description": "This is nonfiction commentary. Chapters: The Magicians, the Land of the Silver Apples, David and the Phoenix, When the Green Star Calls, Tam Lin, by the Light of the Green Star, the Iron Ring, Rogue Mage Series, the Metal Monster, the Master Key, Furies of Calderon, the Goblin Wood, on Stranger Tides, the Sea of Trolls, Under the Green Star, the Anybodies, the Face in the Abyss, the Cobra King of Kathmandu, Dwellers in the Mirage, Slaves of Sleep, Storm Rising, the Nobodies, Wizard's Hall, Tal: His Marvelous Adventures With Noom-Zor-Noom, Strange Brew, Kissing the Beehive, a Short, Sharp Shock, Hell on Earth, the Islands of the Blessed, the Ancient, Escape From Kathmandu, Gypsy Rizka, Shapeshifter's Quest, Amy's Eyes, a World Away: the Quest of Dan Clay, Catwings Return. Source: Wikipedia. Pages: 108. Not illustrated. Free updates online. Purchase includes a free trial membership in the publisher's book club where you can select from more than a million books without charge. Excerpt: The Magicians (Grossman novel) - Fillory is the magical land described in Lev Grossman's novel The Magicians, which was published in 2009 by Viking Press. Christopher Plover, a character in The Magicians, is the author of the \"Fillory and Further\" series, comprising five books: The World in the Walls, The Girl Who Told Time, The Flying Forest, The Secret Sea, and The Wandering Dune. In The Magicians, the Fillory books are published in England in the 1930s and are about the five Chatwin childrenMartin, Fiona, Rupert, Helen and Janeand their adventures in Fillory. Quentin Coldwater, one of the magicians of the book's title, grows up a huge fan of the \"Fillory and Further\" series, which he assumes are fiction, much like The Chronicles of Narnia. Upon graduating from Brakebills, his Hogwarts-like magical college, however, Quentin discovers that Fillory is real. The kingdom features mobile trees with clock faces, a talking bear with a predilection for a...http: //booksllc.net/?id=23986473",
  "genres": [],
  "author": "Books LLC",
  "average_rating": "2.00",
  "url": "https://www.goodreads.com/book/show/10259349-american-fantasy-novels-study-guide"
}