{
  "title": "The Immaculate Deception",
  "description": "Our Review\nWhen in RomeA stolen masterpiece with arcane allegorical significance; a decades-old political kidnapping and murder; and, of course, a tantalizing artwork of unknown provenance -- in his seventh Jonathan Argyll art mystery, The Immaculate Deception, English art historian Iain Pears returns with a virtuosic display of ingenious plotting and literary trompe l'oeil.Pears's clever and effortlessly erudite art mysteries have found a select readership on both sides of the Atlantic. But the phenomenal success of Pears's 1998 literary thriller, An Instance of the Fingerpost -- a multifaceted Restoration whodunit on a par with Umberto Eco's The Name of the Rose -- has dramatically increased stateside interest in the author's earlier work. The Immaculate Deception once again centers on the exploits of the affable and perpetually distracted English art dealer Jonathan Argyll; the beautiful and formidable Flavia di Stefano of the Italian Art Theft Squad; and hererstwhile boss, General Taddeo Bottando, along with several of the series' usual -- or, more appropriately -- unusual supporting cast of suspects.When a masterpiece on loan for the opening of an international exhibition is stolen in a manner calculated to embarrass the Italian government, Flavia di Stefano is ordered by the newly installed prime minister to recover the painting at all costs. Her deceptively simple mandate quickly reveals itself to be a politically fraught, no-win situation. If is she meets the thief's ransom demands, she'll almost certainly be disgraced -- and perhaps go to jail; if she refuses the order, she'll be summarily removed from her post. With Jonathan jaunting through the Tuscan countryside on the trail of an interesting art collection, Flavia turns to her oldfriend and confidant General Bottando for advice. As a seasoned survivor of the Roman political arena himself, he suggests that she follow the time-honored convention and do as other Romans: \"When faced with deviousness, you must be devious yourself.\"Working together, Flavia and Bottando devise a plan to recover the painting. But no sooner has the ransom been paid than the art-napper -- a former '60s radical turned bourgeois performance artist -- is found dead under highly suspicious circumstances. Worse, Bottando himself has disappeared without a trace, leaving Flavia to face her first major crisis as head of the ArtSquad alone. Risking official censure and hounded by a sinister journalist, Flavia explores the tenuous connection between a decades-old act of terrorism and recent events, only to discover a secret conspiracy that could topple the government -- or cost her her life.Like Michael Dibdin's award-winning Aurelio Zen novels, Pears's Jonathan Argyll mysteries go beyond genre fundamentals to immerse readers in every aspect of contemporary Italian culture -- from its legendary art and cuisine to the labyrinthine bureaucracy of the political and criminal justice systems to candid, unexpectedly breathtaking portrayals of everyday life. The Immaculate Deception is a splendid addition to a mystery series of the first order, and an exuberant confirmation of Iain Pears as a modernmaster of the form.\n--Greg Marrs",
  "genres": [
    "Mystery",
    "Fiction",
    "Art",
    "Italy",
    "Crime",
    "Mystery Thriller",
    "British Literature"
  ],
  "author": "Iain Pears",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/487824.The_Immaculate_Deception"
}