{
  "title": "Album Dei King Crimson: In the Court of the Crimson King, Lizard, Larks' Tongues in Aspic, in the Wake of Poseidon, Red, Islands",
  "description": "Fonte: Wikipedia. Pagine: 25. Capitoli: In the Court of the Crimson King, Lizard, Larks' Tongues in Aspic, In the Wake of Poseidon, Red, Islands, Starless and Bible Black, The Great Deceiver, Cirkus: The Young Persons' Guide to King Crimson Live, USA, THRaKaTTaK, The 21st Century Guide to King Crimson - Volume One - 1969-1974, Earthbound, VROOOM VROOOM, The Power to Believe, Epitaph, A Young Person's Guide to King Crimson, Ladies of the Road, Heavy ConstruKction, Three of a Perfect Pair, The Night Watch, King Crimson on Broadway, B'Boom: Live in Argentina, Beat, Discipline, Live in Mexico City, The Beginners' Guide to the King Crimson Collectors' Club, Absent Lovers: Live in Montreal, EleKtrik, Live in Japan, Live at the Marquee, Live in Central Park, NYC, The ConstruKction of Light, Live at Cap D'Agde, Live at Jacksonville, The Beat Club, Bremen. Estratto: In the Court of the Crimson King (an observation by King Crimson) (Island Records, 1969) e il primo album dei King Crimson, gruppo inglese di rock progressivo. I King Crimson avevano gia tentato di registrare in studio il loro repertorio per ben due volte nel 1969, senza pero mai rimanere soddisfatti dei risultati: entrambe le sedute in questione erano state percio abbandonate anzitempo. Nel frattempo, il gruppo aveva conquistato una relativa notorieta fra stampa, pubblico e addetti ai lavori, grazie a numerosi concerti tenuti, nell'arco di cinque mesi, prevalentemente nell'area londinese. Decisiva, appena tre settimane prima di rientrare in studio, la loro apparizione come gruppo spalla al concerto dei Rolling Stones in onore di Brian Jones a Hyde Park, Londra.Dunque la band che il 21 luglio 1969 varco la soglia dei Wessex Studios a Islington era tutt'altro che un quintetto di debuttanti, e anche l'esperienza maturata in studio nei due citati tentativi non pote che incidere positivamente sul prodotto discografico. Tale relativa maturita artistica ha testimonianze storiche illustri fra coloro che assistettero...",
  "genres": [],
  "author": "Source Wikipedia",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/12480554-album-dei-king-crimson"
}