{
  "title": "My Lady Scandalous: The Amazing Life and Outrageous Times of Grace Dalrymple Elliott, Royal Courtesan",
  "description": "A wicked turnabout on Jane Austen's oft-quoted adage - \"a single man in possession of a good fortune must be in want of a wife\" - is My Lady Scandalous, a richly raucous history that traverses the notoriously licentious British Regency era in the company of its most celebrated courtesan.Following a simple Edinburgh girlhood, Grace Dalrymple came of age in the sin city of London, where wealthy men ruled society and women had everything to lose, starting with their reputations. As an impressionable bride of seventeen who married a man more than twice her age, Grace's remarkable beauty (likened by journalists to \"a May morning\") soon attracted the attentions of other men. A disastrous liaison with a consummate rake not only branded Grace as a demi-rep - a woman with half a reputation - but the scandal provoked Dr. John Eliot, her philandering husband, to pursue a divorce.Grace became mistress of the most infamous peer in England, George James, Lord Cholmondeley, whose \"secret perfections\" were reputed to inspire \"female enthusiasm.\" Cholmondeley commemorated the relationship by commissioning two works from eminent portraitist Thomas Gainsborough, first in 1778 and later in 1782, the same year Grace gave birth to a daughter, Georgiana (who may, in fact, have been the child of the Prince of Wales). Had Grace been an aristocrat, she and Cholmondeley might have had a future together, but it was not to be.The tabloids broke the news: \"Miss Dalrymple has embarked for France, and it is said parted with her noble gallant.\" Grace was soon to find a new protector in that nation's richest man, Philippe, Duc d'Orleans. Though Grace was ensconced as \"one of the most brilliant and popular among the fashionable 'impures,'\" her liaison with the duke turned perilous when Orleans fell to the Revolution's guillotine, just as she narrowly escaped with her life.\"People die, but love may not,\" declares author Jo Manning of her subject's romantic and historic misadventures. A connoisseur of the times, Manning ably demonstrates - through contemporary newspapers, magazines, prints, and portraits as well as Grace's posthumously published journal - how life in George III's England and Marie Antoinette's France can seem strangely familiar, especially when history turns to affairs of the heart.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "18th Century",
    "French Revolution",
    "Research"
  ],
  "author": "Jo Manning",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/487963.My_Lady_Scandalous"
}