{
  "title": "Culture Is The Bass: 7 Steps to Creating High Performing Teams",
  "description": "Nicely orchestrated and well-executed business advice. — Kirkus ReviewsEntrepreneur Magazine  List of the “Top 15 Books on Business Culture That You Need to Read Today\".\"Leonard’s debut compares the culture of an organization to the bass in an orchestra. The author is obviously passionate about both music and project portfolio management, and his enthusiasm shines through the text. Nicely orchestrated and well-executed business advice.”  — Kirkus Reviews Everyday companies fail to compete in the market and grow because of a poor project management culture. Culture Is The 7 Steps to Creating High PerformingTeams walks you through how organizations can achieve balance, harmony and a unified vision. Gerald Leonard offers 7 key principles based on his unique perspective and experience as a professional musician, culture change expert and certified Portfolio Management Professional (PfMP).“Gerald Leonard is an exceptional person in both fields. He understands systems and cultures and processes plus he is a world-class professional musician. I've performed with him in the National Speakers Association's “All-Star Band” and was amazed by his rock-steady performance and his unbelievable versatility.”Jim Cathcart – Mentor, Strategic Advisor, Motivational Expert, Sales Consultant, Entertainer & AuthorLearn the secret to reclaiming your workplace culture, and workplace motivation. Discover why and how of culture change in a simple to follow 7 step process and grow your leadership skills. Learn how to thrive in a difficult workplace, gain great feedback and learn the secret to reclaiming control of your time and tripling your productivity!Inside, you’ll • How companies can perform like a world-class orchestra and receive a standing ovation from their employees and customers.• How to create a shared vision for your team and grow your leadership skills.• An 8-step process for implementing change, creating buy-in and increase productivity• How to develop stories that will touch your staff’s heart, head, and hands.Culture is the Bass helps organizations create a truly competitive advantage that consistently produces and exceeds stakeholder expectations. The 7 steps process will provide you with a great mental model.“Love the analogy/metaphor of music being compared to business. There are lots of similarities, as you show us. As a musician myself, I've often thought about how the two are similar - and how interesting it would be to create a speech, or in your case a book, around the topic.” Shep Hyken - Customer Service Expert, Keynote Speaker & New York Times and Wall Street Journal Best-Selling Author of Amaze Every Customer Every Time and The Amazement Revolution“Gerald, I enjoyed reading the metaphor of how a great culture is like an orchestra. You can't make beautiful music and enjoy harmony without a commitment from all to play their part. You must have the right leadership, and the right players, playing to their strengths.”Shirley Davis, Ph.D., CSP, SPHR, SHRM-SCP President of SDS Global Enterprises, Inc.; Business Executive; Workforce Management Expert, Author of Reinvent Strategies for Achieving Success in Every Area of Your Life“This concept and book are genius! Gerald's performance/speech abou",
  "genres": [
    "Business",
    "Cultural",
    "Leadership"
  ],
  "author": "Gerald J. Leonard",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/48829540-culture-is-the-bass"
}