{
  "title": "Florence Adler Swims Forever",
  "description": "Over the course of one summer that begins with a shocking tragedy, three generations of the Adler family grapple with heartbreak, romance, and the weight of family secrets in this stunning debut novel that’s perfect for fans of Manhattan Beach and The Dollhouse. Atlantic City, 1934. Every summer, Esther and Joseph Adler rent their house out to vacationers escaping to “America’s Playground” and move into the small apartment above their bakery. Despite the cramped quarters, this is the apartment where they raised their two daughters, Fannie and Florence, and it always feels like home. Now Florence has returned from college, determined to spend the summer training to swim the English Channel, and Fannie, pregnant again after recently losing a baby, is on bedrest for the duration of her pregnancy. After Joseph insists they take in a mysterious young woman whom he recently helped emigrate from Nazi Germany, the apartment is bursting at the seams. Esther only wants to keep her daughters close and safe but some matters are beyond her control: there’s Fannie’s risky pregnancy—not to mention her always-scheming husband, Isaac—and the fact that the handsome heir of a hotel notorious for its anti-Semitic policies, seems to be in love with Florence. When tragedy strikes, Esther makes the shocking decision to hide the truth—at least until Fannie’s baby is born—and pulls the family into an elaborate web of secret-keeping and lies, bringing long-buried tensions to the surface that reveal how quickly the act of protecting those we love can turn into betrayal. Based on a true story and told in the vein of J. Courtney Sullivan’s Saints for All Occasions and Anita Diamant’s The Boston Girl, Beanland’s family saga is a breathtaking portrait of just how far we will go to in order to protect our loved ones and an uplifting portrayal of how the human spirit can endure—and even thrive—after tragedy.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Audiobook",
    "Historical",
    "Jewish",
    "Family"
  ],
  "author": "Rachel Beanland",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/48823934-florence-adler-swims-forever"
}