{
  "title": "American Holocaust: The Conquest of the New World",
  "description": "For four hundred years - from the first Spanish assaults against the Arawak people of Hispaniola in the 1490s to the U.S. Army's massacre of Sioux Indians at Wounded Knee in the 1890s - the indigenous inhabitants of North and South America endured an unending firestorm of violence. During that time the native population of the Western Hemisphere declined by as many as one hundred million people. Indeed, as historian David E. Stannard argues in this stunning new book, the European and white American destruction of the native peoples of the Americas was the most massive act of genocide in the history of the world. Stannard begins with a portrait of the enormous richness and diversity of life in the Americas prior to Columbus's fateful voyage in 1492. He then follows the path of genocide from the Indies to Mexico and Central and South America, then north to Florida, Virginia, and New England, and finally out across the Great Plains and Southwest to California and the North Pacific Coast. Stannard reveals that wherever Europeans or white Americans went, the native people were caught between imported plagues and barbarous atrocities, typically resulting in the annihilation of 95 percent of their populations. What kind of people, he asks, do such horrendous things to others? His highly provocative answer: Christians. Digging deeply into ancient European and Christian attitudes toward sex, race, and war, he finds the cultural ground well prepared by the end of the Middle Ages for the centuries-long genocide campaign that Europeans and their descendants launched - and in places continue to wage - against the New World's original inhabitants. Advancing a thesis that is sure to create muchcontroversy, Stannard contends that the perpetrators of the American Holocaust drew on the same ideological wellspring as did the later architects of the Nazi Holocaust. It is an ideology that remains dangerously alive today, he adds, and one that in recent years has surfaced in American justifications for large-scale military intervention in Southeast Asia and the Middle East. At once sweeping in scope and meticulously detailed, American Holocaust is a work of impassioned scholarship that is certain to ignite intense historical and moral debate.",
  "genres": [
    "History",
    "Nonfiction",
    "Native American",
    "Politics",
    "American History",
    "Indigenous",
    "Race"
  ],
  "author": "David E. Stannard",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/48835.American_Holocaust"
}