{
  "title": "The Tale of Despereaux: The Graphic Novel",
  "description": "This fresh new graphic format, featuring all-new artwork inspired by the film The Tale of Despereaux, is destined to bring Kate DiCamilllo's award-winning classic to an even wider audience.The Tale of Despereaux tells the story of several unlikely Despereaux, a brave mouse banished to the dungeon for speaking with a human; Roscuro, a good-hearted rat who loves light and soup, but is exiled to darkness; Pea, a Princess in a gloomy castle who is prisoner to her father's grief; and Mig, a servant girl who longs to be a Princess, but is forced to serve the jailer. Refusing to live his life cowering, Despereaux befriends Princess Pea and learns to read (rather than eat) books - reveling in stories of knights, dragons and fair maidens. Banished from Mouse World for being more man than mouse, Despereaux is rescued by another outcast, Roscuro, who wants to hear the tales. But when the Princess dismisses Roscuro's friendship, he becomes the ultimate rat and plots revenge with fellow outsider Mig. After Pea is kidnapped, Despereaux discovers he is the only one who can rescue her.Kate DiCamillo's literary classic about Despereaux Tilling has enchanted children and adults around the globe. In this tale of bravery, forgiveness and redemption, one small creature teaches a kingdom that it takes only a little light to show the What you look like doesn't equal what you are. Published in 23 languages, with more than 2 million copies in print, a New York Times #1 bestseller and winner of the Newbery Medal, The Tale of Despereaux is now animated adventure from Universal Pictures.THE TALE OF DESPEREAUX is a trademark and copyright of Universal Studios. Licensed by Universal Studios Licensing LLLP. All Rights Reserved.",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Animals",
    "Fiction",
    "Comics",
    "Middle Grade",
    "Childrens"
  ],
  "author": "Matt       Smith",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/4882377-the-tale-of-despereaux"
}