{
  "title": "The Untidy Pilgrim",
  "description": "This classic coming-of-age novel, winner of the Lippincott Fiction Prize for Young Novelists in 1954, is a deliberately comic portrayal of \"Mobile madness,\" a malady specific to the Gulf Coast but recognizable by all.Eugene Walter's first novel is about a young man from a small central Alabama town who goes south of the \"salt line\" to Mobile to work in a bank and study law.  As soon as this unnamed pilgrim arrives, he realizes that--although he is still in Alabama—he has entered a separate physical kingdom of banana trees and palm fronds, subtropical heat and humidity, old houses and lacy wrought-iron balconies. In the \"land of clowns\" and the \"kingdom of monkeys\"—in the town that can claim the oldest Mardi Gras in America--there is no Puritan work ethic; the only ruling forces are those of chaos, craziness, and caprice. Such forces overtake the pilgrim, seduce him away from the beaten career path, and set him on a zigzag course through life.The Untidy Pilgrim celebrates the insularity as well as the eccentricity of southerners—and Mobilians, in particular—in the mid-20th century. Cut off from the national mainstream, they are portrayed as devoid of that particularly American angst over what to \"do\" and accomplish with one's life, and indulge instead in art, music, cooking, nature, and love.  In this novel Walter eschews the \"gloom and doom\" southern literary tradition established by Faulkner, Capote, and McCullers to illuminate the joyous quirkiness of human existence.In 1954 this refreshing approach to the southern scene garnered the praise of the judges for that year's Lippincott Fiction Prize, Jacques Barzun, Diana Trilling, and Bernard DeVoto. This reissue of the paperback in The University of Alabama Press's Deep South Books series assures yet another generation the delight of Eugene Walter's award-winning romp through Mobile.",
  "genres": [
    "Novels",
    "Southern"
  ],
  "author": "Eugene F. Walter",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/488246.The_Untidy_Pilgrim"
}