{
  "title": "The Engagement: America's Quarter Century Struggle Over Same-Sex Marriage",
  "description": "A NEW YORK TIMES NOTABLE BOOK OF THE YEAR • The riveting story of the conflict over same-sex marriage in the United States—the most significant civil rights breakthrough of the new millennium\"Full of intimate details, battling personalities, heated court cases, public persuasion.”  —John Williams, The New York TimesOn June 26, 2015, the U.S. Supreme Court ruled that state bans on gay marriage were unconstitutional, making same-sex unions legal across the United States. But the road to that momentous decision was much longer than many know. In this definitive account, Sasha Issenberg vividly guides us through same-sex marriage’s unexpected path from the unimaginable to the inevitable.It is a story that begins in Hawaii in 1990, when a rivalry among local activists triggered a sequence of events that forced the state to justify excluding gay couples from marriage. In the White House, one president signed the Defense of Marriage Act, which elevated the matter to a national issue, and his successor tried to write it into the Constitution. Over twenty-five years, the debate played out across the country, from the first legal same-sex weddings in Massachusetts to the epic face-off over California’s Proposition 8 and, finally, to the landmark Supreme Court decisions of United States v. Windsor and Obergefell v. Hodges . From churches to hedge funds, no corner of American life went untouched.This richly detailed narrative follows the coast-to-coast conflict through courtrooms and war rooms, bedrooms and boardrooms, to shed light on every aspect of a political and legal controversy that divided Americans like no other. Following a cast of characters that includes those who sought their own right to wed, those who fought to protect the traditional definition of marriage, and those who changed their minds about it, The Engagement is certain to become a seminal book on the modern culture wars.",
  "genres": [
    "History",
    "Nonfiction",
    "LGBT",
    "Politics",
    "Queer",
    "Law",
    "Audiobook"
  ],
  "author": "Sasha Issenberg",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/48822628-the-engagement"
}