{
  "title": "The Water Thief",
  "description": "In 304 c.e. Aelius Spartianus, officer and historian at the court of Diocletian in Dalmatia, is writing the biographies of past Roman rulers, including Hadrian, who has been dead for nearly 175 years. Aelius's particular charge is to investigate the unsolved mystery of the drowning death in the Nile of Hadrian's favorite, young Antinous. Soon his duty turns twofold: the hunt for Antinous's grave, supposed to conceal proof of a conspiracy against Rome, and the murder of a wealthy army supplier and his servant. The mystery thickens as deaths multiply; scholarly work turns into a race against time and into a confrontation with risk, lies, and half-truths at the hands of priests, authorities, and former colleagues. While the trials against Christians (later known as the Great Persecution) inflame Egypt, Aelius gathers clues in odd places until his road leads inescapably to Rome. Joined in his search by a blind retired soldier who is well experienced in counterespionage, Aelius scavenges for evidence in a world capital in decline. From Rome his breathless trail takes him to Hadrian's country estate, which is now acres and acres of monumental ruins in the wilderness. In the haunted stillness of roofless halls and overgrown gardens, Aelius deciphers the great plan of the villa, an astronomical chart confirming how the danger against Rome is clear and imminent. But who is behind it all? How deadly close is danger? In order to save the state and himself, Aelius must solve not only the puzzle of Antinous's drowning, but also the murders that have marred his path. Internationally renowned and critically acclaimed author Ben Pastor brings her thematic skill to bear in this new historical mystery. International Praise for the Works of Ben Pastor \"History blends with absolute perfection to personal story, and the novel is like an orchestral score, with pages of rare evocative power. It is narrative one reads with admiration and even devotion.\"---La Stampa Turrolibri on Kaputt Mundi \"The mystery plot develops within a perfectly wrought historical milieu. . . . A novel of great emotional impact.\"---Il Giorno on The Horseman's Song \"Along with Margaret Doody and Elizabeth George, Ben Pastor is considered one of the strongest female voices of today's mystery writing. Her investigative tales show a breathless rhythm, a perfect blend of action thriller and authorial narrative.\"---La Repubblica on The Dead in the Square \"Pastor's plot is well crafted, her prose sharp.\"---Publishers Weekly on Lumen",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical Mystery",
    "Historical",
    "Roman",
    "Thriller"
  ],
  "author": "Ben Pastor",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/488230.The_Water_Thief"
}