{
  "title": "War of the Gods Complete Series Boxed Set",
  "description": "\"I've dried your front,\" the Fae prince said, his voice nearly harsh. \"Now turnaround.\" Liar. He'd simply swept the towel over my legs, though his gaze had darted to the flesh between my thighs. I turned as he'd commanded, my skin burning with carnal need. He started to dry my back. The towel slowly moved toward my butt. I parted my legs, bent forward a little, and bared for him. He swallowed and stiffened behind me. A swath of the towel got between my thighs, rubbing back and forth with his large warm palm beneath it. I swayed my hips a little. \"Don't move, Cass,\" he said huskily. \"If you move again, I'll take you right here, right now.\" A smile curved my lips and I swayed more. He withdrew the towel and ceased his rubbing. Then he spanked me.  This darkly sexy Reverse Harem Fantasy boxed set includes: A bonus novella: A Court of the Beginning and the End Book 1: A Court of Blood and Void Book 2: A Court of Fire and Metal Book 3: A Court of Ice and Wind Book 4: A Court of Earth and Aether  They call me beautiful. They call me a monster. Soon, they'll call me death.  As a direct descendant of the God of Death, Cassandra Saélihn is considered the most dangerous monster of all time. Her own mother locks her in a cage to protect the world from her. Cass thought this jail would be her world for a lifetime, but then four sexy, formidable warriors--a vampire lord, twin fae princes, and a demigod--find her.  They claim she's not a monster, but a powerful weapon.  The Olympian gods have begun to destroy the Earth with a vengeance, and only she can stop and kill them. But Cass has a mind of her own and can't be told what to do, no matter how drawn she is to her four warrior saviors.  To their dismay, the four warriors can't tame the wild, cunning, and volatile Cass. But they have a bigger problem--their growing attraction toward her.  To turn the woman they desire into the ultimate weapon and ensure Earth's survival, they'll have to conquer her body and heart, which seems even harder than winning the war against the atrocious gods. But nothing turns these alpha males on more than an impossible dare. And nothing turns Cass on more than being stalked.  This 1300 + pages reverse harem fantasy/paranormal romance collection features one hell of strong woman and her four powerful supernatural mates. It contains brutal battles, explicit love scenes, raw language, magic, swordfights, Greek gods, dark fae, vampires, shifters, and a lot of assholes.  Here's what readers are saying about the series:  \"It was highly entertaining and had a lot of laugh out loud moments. As well as some really hot moments that will have you fanning your face.\" - Amazon Reviewer ★★★★★  \"If you like snarky heroines and devoted alphas this series is for you. There was also an awesome twist in the storyline that I never saw coming!\" - Amazon Reviewer ★★★★★  \"The best part of this book is that even with the fun sexy scenes there is a real and fascinating storyline to follow. The romance is definitely a main part of the story, but not the only focus, which is terrific. For those complaining of her age, which is chronologically 16, the author does explain that Cass reached her species adulthood at 9 years old. It even lists her equivalent age as in her early 20s. So she's not a child.\" - Amazon Reviewer ★★★★★",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal",
    "Magic",
    "Gods",
    "Romance",
    "Vampires"
  ],
  "author": "Meg Xuemei X",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/48835170-war-of-the-gods-complete-series-boxed-set"
}