{
  "title": "Health, Happiness & Destiny Come from Wise Choices : Why You Shouldn't Ask Your Doctor",
  "description": "Richard Ruhling, MD graduated from Loma Linda University, a community featured in National Geographic (11/05) as the only ‘Blue Zone’ for health in N America. After a Master’s Degree in Public Health, he got Internal Medicine and was board-certified, also getting Cardiology training before teaching Health Science at Loma Linda. While there, National Institutes of Health was funding his school $40 million to learn why the community lived 7-11 years longer than other non-smoking groups. It’s about eating habits, which is an important aspect of this book. At a cardiology convention, Ruhling heard Pritikin report how his diet helped reversed most diseases and 85% of patients got off drugs for blood pressure, diabetes and heart disease. This was an awakening to real healthcare… Medical care is not healthcare; it’s the diagnosis and treatment of disease. Adverse Drug Reactions make medical care the leading cause of death, but the media doesn’t report it, preferring to do ad$ for drug companies. Ruhling confirms a UCLA study by Dr. Breslow that 7 health habits give a 30-year advantage over people who break all the rules. Health is a by-product of obedience to laws of the body. Ball games are often won or lost in the last plays of the game. The game of life is similar--if we depend on drugs to relieve symptoms, we may die sooner or end in a nursing home where the average number of prescriptions are 9-13 and people are so spaced out they can stand in the hallway, filling they diaper and think everything is ok. We don’t have to go that way. This book shows how food can be your best medicine and most diseases are reversible. This can empower us to be the captain of our own ship in important dimension of health. Health, Happiness & Destiny Come from Wise Choices--Follow Me to a Better Life! Richard Ruhling, MD",
  "genres": [
    "Health"
  ],
  "author": "Richard Ruhling",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/48808114-health-happiness-destiny-come-from-wise-choices"
}