{
  "title": "Reborn in Flames",
  "description": "I have spent my entire life in the basement of my father’s church. My sadistic mother and god-fearing father believe I have the devil inside of me because I heal after their abuse. I’d accepted long ago I would die in the very place I’d been born without ever feeling the sun on my skin. Then one day, my mother took me from my father’s religious cult in the wake of his death. Nearly a week later, and after countless hours with her boyfriend Jed’s creepy remarks, I find myself in Washington State. I had only ever interacted with my parents and now Jed, so you can imagine my surprise when I ran smack dab into possibly the most handsome man in the world. He’s not alone though, there are intriguing and handsome men popping up everywhere in my life.Except I shouldn’t be focusing on that. I should be preparing for my mother’s cruel hits. Preparing to run the minute I turn 18. Preparing to hide from Jed’s leering comments and uncomfortable stares. One interaction with this man and I feel like my entire life has been altered.Five days until I turn 18. Five days until my mother realizes what happens when you keep a bird cooped up for too long, only to open its cage. Five days until I am out of here.My problem? Everything inside of me tells me that those intriguing men are mine… and they seem to think the same.This is a slow/medium burn fantasy RH that features a naive but strong MFC with a troubled past and a secret about what she really is. Come meet Maya and her protective and possessive dragon shifters! This book will be part of the Reborn series.Warnings: Please be advised that the book contains darker themes such as child abuse, PTSD, swearing, and violence. Additionally, sexual themes are suitable for mature audiences +18. This book will end on a slight cliffhanger.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Shapeshifters",
    "Fantasy",
    "Romance",
    "Dragons",
    "Paranormal Romance"
  ],
  "author": "M. Sinclair",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/48813438-reborn-in-flames"
}