{
  "title": "Sirius",
  "description": "Readers who are fans of Ruby Dixon’s Ice Planet Barbarians would love this story! ~ Amber Lynn MyersCan this genetically engineered “Product” and the spirited Earth female who rescues him survive a hostile planet and learn to love?AliyahHe was being hunted for sport when I saved his life. Why does he insist he’s broken when I know we’re perfect for each other?SiriusProduced in a test tube, born a slave, bred for fighting, and doomed to death. I don’t want my love to contaminate the beautiful human I’ve vowed to protect.If you like heroic males who fall for kick-ass women and who fight together to conquer every threat a savage planet throws their way - then join Sirius and Aliyah in this standalone seventh book of the sci-fi romance series, Galaxy Gladiators. Contains steamy sensual scenes, a hot muscular alien who's been damaged and patched back together, and a courageous, savvy heroine capable of saving the day. Guaranteed no cliff-hanger, no cheating, and a happily ever after. Intended for readers 18+.Please note: This series CAN be read as standalones, although it’s likely MORE FUN and ENJOYABLE to read them in order, as the books are full of that rich, delicious 'found-family trope' where people with nothing in common form connections that are stronger than blood.Read \"Sirius\" today to fall in love again for the first time!* * *Galaxy Gladiators series:Book 1: ZarBook 1.5: Terminus (Shadow’s prequel)Book 2: ShadowBook 3: TyreeBook 4: DevoloseBook 5: Drayke Book 6: Axxios & Braxxus [MFM] Book 6.5: Jax-Xon (Sirius’ prequel)Book 7: SiriusBook 8: DaxBook 9: BeastBook 10: Ar'TokBook 11: WrageBook 12: WarDogBook 13: StrykerBook 14: VartanBook 15: MaximusBook 16: SteeleBook 17: TarrexBook 18: Zar-RynnBook 19: ValerisBook 20: DoctoréBook 21: Theos",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Fantasy",
    "Romance",
    "Space",
    "Science Fiction Romance"
  ],
  "author": "Alana Khan",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/48839301-sirius"
}