{
  "title": "Failed State",
  "description": "In this second dystopian legal thriller from the author of the acclaimed The Rule of Capture and Tropic of Kansas, defense lawyer Donny Kimoe juggles two intertwined cases whose outcomes will determine the course of America’s future—and his own.In the aftermath of a second American revolution, peace rests on a fragile truce. Though the ruling regime has been deposed, the former dictator president has vanished, escaping justice. Some believe he is dead; others fear he is in hiding, gathering forces to make a comeback. As the political leadership in Washington works to rewrite laws and restore order, Donny Kimoe seeks justice. He intends to settle scores—and win lawsuits—over what happened when civil war tore the country apart. Donny isn’t the only one looking to right the wrongs of the past. The rebels he once defended are now exacting their own kind of justice. Amid the flooded ruins of New Orleans, they are building their idea of utopia—which includes kidnapping their defeated adversaries who got rich destroying the country and trying them for their crimes. One of their hostages is the daughter of an old colleague turned enemy who wants Donny to defend her. If Donny fails, the companies allied with his former friend will send their mercenaries to save her and retake the city—breaking the fragile truce and dragging the country back into violence. But if Donny takes the case, he risks blowing the trial for his most dangerous client—and being tried by his former clients for his own crimes against the revolution.To save the future, Donny has to gamble his own. The only way out is to find the evidence that will get both sides back to the table, bring the feud to an end, and secure a more lasting peace. To do that, Donny must take even greater risks—and break his own moral code—by betraying his clients’ secrets. Including one explosive secret hidden in the ruins, the discovery of which could extinguish the last hope for a better tomorrow—or, if Donny plays it right, keep it burning.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Fantasy",
    "Legal Thriller",
    "Alternate History",
    "Thriller"
  ],
  "author": "Christopher    Brown",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/48836836-failed-state"
}