{
  "title": "Truth: A History and a Guide for the Perplexed",
  "description": "The pursuit of truth, says Felipe Fern치ndez-Armesto, is \"the quest for language that can match reality.\" He believes that the nature of that quest has never quite been fully understood; Truth aims to fill the void. He identifies four key methods of determining the truth--what we feel, what we are told, what we figure out, and what we observe--which are given poetic names such as \"the hairy ball--teeth optional\" and \"the cage of wild birds.\" These four methods always exist together in every culture, although each one may be differently valued in different places at different times.But Western philosophy after Descartes, in Fern치ndez-Armesto's assessment, has been largely hostile to these ways of knowledge, and has steadily come to question the very existence of truth. His summation of post-Cartesian philosophy is a largely negative one, which veers dangerously close to ad hominem assaults. Nietzsche, for example, who \"was praised too much in his youth for his superior powers of mind and never achieved prowess or position to match,\" is dismissed as \"a sexually inexperienced invalid\" whose philosophy was \"warped and mangled out of his own lonely, sickly self-hatred.\" Pragmatism and existentialism, two of the 20th century's most important philosophical movements, are found inadequate; the former is \"the philosophy of lovers of technology,\" while the latter \"represents the retreat of Luddites and pessimists into the security of self-contemplation.\" But even though \"philosophical subjectivisms, scientific uncertainties, and dumbing, numbing linguistics\" have served to undermine the notion of truth, Fern치ndez-Armesto believes, they cannot destroy it thoroughly. It seems that even in the face of relativism, truth will win out.",
  "genres": [
    "Philosophy",
    "History",
    "Nonfiction"
  ],
  "author": "Felipe Fern치ndez-Armesto",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/488472.Truth"
}