{
  "title": "No Offense",
  "description": "New York Times\n bestselling author Meg Cabot's returns with a charming romance between a children's librarian and the town sheriff in the second book in the Little Bridge Island series.Welcome to Little Bridge, one of the smallest, most beautiful islands in the Florida Keys, home to sandy white beaches, salt-rimmed margaritas, and stunning sunsets—a place where nothing goes under the radar and love has a way of sneaking up when least expected... A broken engagement only gave Molly Montgomery additional incentive to follow her dream job from the Colorado Rockies to the Florida Keys. Now, as Little Bridge Island Public Library’s head of children’s services, Molly hopes the messiest thing in her life will be her sticky-note covered desk. But fate—in the form of a newborn left in the restroom—has other ideas. So does the sheriff who comes to investigate the “abandonment”.  When John Hartwell folds all six-feet-three of himself into a tiny chair and insists that whoever left the baby is a criminal, Molly begs to differ and asks what he’s doing about the Island’s real crime wave (if thefts of items from homes that have been left unlocked could be called that). Not the best of starts, but the man’s arrogance is almost as distracting as his blue eyes. Almost… John would be pretty irritated if one of his deputies had a desk as disorderly as Molly’s. Good thing she doesn’t work for him, considering how attracted he is to her. Molly’s lilting librarian voice makes even the saltiest remarks go down sweeter, which is bad as long as she’s a witness but might be good once the case is solved—provided he hasn’t gotten on her last nerve by then. Recently divorced, John has been having trouble adjusting to single life as well as single parenthood. But something in Molly’s beautiful smile gives John hope that his old life on Little Bridge might suddenly hold new promise—if only they can get over their differences. Clever, hilarious, and fun, No Offense will tug at readers’ heartstrings and make them fall in love with Little Bridge Island and its unique characters once again.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Audiobook",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Meg Cabot",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/48836844-no-offense"
}