{
  "title": "Dead Famous: An Unexpected History of Celebrity from Bronze Age to Silver Screen",
  "description": "Celebrity, with its neon glow and selfie pout, strikes us as hypermodern. But the famous and infamous have been thrilling, titillating, and outraging us for much longer than we might realise. Whether it was the scandalous Lord Byron, whose poetry sent female fans into an erotic frenzy; or the cheetah-owning, coffin-sleeping, one-legged French actress Sarah Bernhardt, who launched a violent feud with her former best friend; or Edmund Kean, the dazzling Shakespearean actor whose monstrous ego and terrible alcoholism saw him nearly murdered by his own audience - the list of stars whose careers burned bright before the Age of Television is extensive and thrillingly varied.Celebrities could be heroes or villains; warriors or murderers; brilliant talents, or fraudsters with a flair for fibbing; trendsetters, wilful provocateurs, or tragic victims marketed as freaks of nature. Some craved fame while others had it forced upon them. A few found fame as small children, some had to wait decades to get their break. But uniting them all is the shared origin point: since the early 1700s, celebrity has been one of the most emphatic driving forces in popular culture; it is a lurid cousin to Ancient Greek ideas of glorious and notorious reputation, and its emergence helped to shape public attitudes to ethics, national identity, religious faith, wealth, sexuality, and gender roles.In this ambitious history, that spans the Bronze Age to the coming of Hollywood's Golden Age, Greg Jenner assembles a vibrant cast of over 125 actors, singers, dancers, sportspeople, freaks, demigods, ruffians, and more, in search of celebrity's historical roots. He reveals why celebrity burst into life in the early eighteenth century, how it differs to ancient ideas of fame, the techniques through which it was acquired, how it was maintained, the effect it had on public tastes, and the psychological burden stardom could place on those in the glaring limelight. DEAD FAMOUS is a surprising, funny, and fascinating exploration of both a bygone age and how we came to inhabit our modern, fame obsessed society.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Historical",
    "Audiobook",
    "Humor",
    "Adult"
  ],
  "author": "Greg  Jenner",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/48868613-dead-famous"
}