{
  "title": "Not Afraid Secrets of Eminem: Birth to 2020",
  "description": "Discover startling secrets about Eminem in a new book about his life like none other before. Includes a look at the following questions. What is Eminem’s relationship with Trump? Why is he so angry at the president? What did Trump tweet about Eminem? What was Trump’s relationship with Eminem before his presidency? Was Eminem’s mother really diagnosed with Munchhausen’s syndrome by proxy? (The answer to this one is yes.) When and why was Eminem’s mother diagnosed with Munchhausen’s syndrome by proxy? What does she have to say about it? Why has Eminem been visited by the Secret Service on more than one occasion? Why did Eminem once attempt suicide? What REALLY happened between Eminem and Mariah Carey? Which one of them is telling the TRUTH? What was the full reason why Eminem said he’d rather slit his father’s throat than reconcile with him What happened to Eminem’s romantic relationship with Brittany Murphy? What has Debbie Mathers been posting on her secret social media accounts? What are her political views? What has been Eminem’s involvement with politics over the years? What are some of the family SECRETS in Eminem’s complex and tragic family? Who are Eminem’s four children? Who will inherit his wealth? What is his net worth? Who is the child Kim raises on her own? Why did Kim go to jail? Why did she attempt suicide? Kim Scott Mathers, who is she really? Why did her twin sister have to say about her and Eminem? How many times does Eminem say that he’s been in love? What extravagant gift did Eminem buy Kim in 2013? What is their relationship today? Who are Eminem’s two brothers and one sister? Which drugs did Eminem get severely addicted to, what was his drug of choice? What shocking gift did Marshall buy Elton John? Why did a friend of Eminem’s from a former hip hop group kill himself when Eminem wouldn’t respond to his letters? ALL THESE QUESTIONS ANSWERED IN-DEPTH AND MANY MORE! Knowledge gleaned from thousands of interviews, books, YouTube videos, and social media postings to track down the full answers to questions that have puzzled Eminem fans for so many years. A critical analysis from a writer with a master’s degree with honors.  Buy Now with one click or Add to Cart",
  "genres": [],
  "author": "Lisa Gardiner",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/48860892-not-afraid-secrets-of-eminem"
}