{
  "title": "일의 기쁨과 슬픔",
  "description": "Sekiz öykü, sekiz farklı iş hayatı, Ama hüznü ve neşesi hep aynı…Hiç iş yerinde ağladınız mı? Cevabınız evetse bu hikâyeler sizi teselli edecek, yalnız olmadığınızı hissettirecek.Jang Ryujin günümüzün değişen iş hayatını ve insan ilişkilerini büyük bir titizlikle hikâyelerine işliyor. Üniversiteden mezun olduktan sonra yedi yıldan fazla bir ofiste çalışan Ryujin, ilk kitabı Çalışmanın Hüznü ve Neşesi Kore'de çok sevilince istifa edip kendini tamamen yazmaya adadı. Kitaba adını veren hikâye, ilk kez kitabın Kore'deki yayıncısının internet sitesinde yayınlandı ve kısa sürede 400,000'den fazla görüntüleme kaydetti. Hatta o kadar çok tıklandı ki sitenin sunucusu çöktü. Kitap haline getirildikten sonra ise uzun süre en çok satanlar listesinde ilk sırayı korudu. “Çalışmanın Hüznü ve Neşesi” isimli hikâye hem mini dizi hem de tiyatro olarak izleyiciyle buluştu.Jang Ryujin ironiyle gerçekliği birleştirerek günümüzün çalışan gençlerine ait kaygıları kelimelere döküyor. Bu kitapta, yüz ayrı özgeçmiş yazmış bir kadının işteki ilk gününü, daha iyisi için önüne gelen iş tekliflerini geri çeviren bir müzisyenin trajikomik hikâyesini, erkeklerden daha düşük maaşla çalışan bir kadının maruz kaldığı cinsiyet eşitsizliğini, tek başına yaşayan bir kadının gecenin bir yarısı kapısına dayanan ziyaretçilerle yaşadığı gerilim dolu anları ve çok daha fazlasını bulacak, kapitalizmin acımasızlığına rağmen hayatlarını sürdürmeye çalışan gençlerin hüznüne ve neşesine tanık olacaksınız.“Jang Ryujin'i daha önce duymuştum, okuyanların coşkusu inanılmazdı. Kitabı okuduktan sonra söylenenlerin doğru olduğunu hayranlıkla fark ettim. Jang Ryujin tarafından ele alınan öyküler, tam da günümüzün hikâyeleri.” — Pyun Hyeyoung, Yisang Edebiyat Ödüllü Yazar“Jang Ryujin, gerçekliğin sıcaklığıyla şimdiki ânı eksiği ya da fazlası olmadan aktarabilen bir yazar. Kitabın son sayfasını çevirdiğimde yüreğimde ürpertiyle karışık bir mutluluk hissettim. Bunu mümkün kılabilen pek fazla kitap yoktur.” — Park Sangyoung, 2022 Booker Edebiyat Ödülü İçin Uzun Listeye Seçilen Yazar",
  "genres": [
    "Literature"
  ],
  "author": "Jang Ryu-jin",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/48885556"
}