{
  "title": "The Summer House",
  "description": "The Summer House weaves Lauren K. Denton’s inviting Southern charm around a woman’s journey to find herself.Sometimes it takes losing everything to find yourself again.Lily Bishop wakes up one morning to find a good-bye note and divorce papers from her husband on the kitchen counter. Having moved to Alabama for his job only weeks before, Lily is devastated, but a flyer at the grocery store for a hair stylist position in a local retirement community provides a refuge while she contemplates her next steps.Rose Carrigan built the small retirement village of Safe Harbor years ago—just before her husband ran off with his assistant. Now she runs a tight ship, making sure the residents follow her strict rules. Rose keeps everyone at arm’s length, including her own family. But when Lily shows up asking for a job and a place to live, Rose’s cold exterior begins to thaw.Lily and Rose form an unlikely friendship, and Lily’s salon soon becomes the place where residents share town gossip, as well as a few secrets. Lily soon finds herself drawn to Rose’s nephew, Rawlins—a single dad and shrimper who’s had some practice at starting over—and one of the residents may be carrying a torch for Rose as well.Neither Lily nor Rose is where she expected to be, but the summer makes them both wonder if there’s more to life and love than what they’ve experienced so far.“The perfect summer read! While following the endearing relationship between Rose Carrigan and Lily Bishop, Denton introduces readers to the utterly charming town of Safe Harbor. Situated on the Alabama Gulf Coast, you’ll feel the sun, taste the salt, and linger with new friends—you won’t want to leave. And with lyrical prose and rich characters, The Summer House is a beautifully poignant reminder that we are never too young to find a good place to stand nor too old to start over.” —Katherine Reay, bestselling author of The Printed Letter Bookshop and Dear Mr. Knightley",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Audiobook",
    "Book Club",
    "Contemporary",
    "Adult Fiction"
  ],
  "author": "Lauren K. Denton",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/48856381-the-summer-house"
}