{
  "title": "Our Lady of Perpetual Hunger: A Memoir",
  "description": "Named a Favorite Book for Southerners in 2020 by  Garden & Gun \"Donovan is such a vivid writer—smart, raunchy, vulnerable and funny— that if her vaunted caramel cakes and sugar pies are half as good as her prose, well, I'd be open to even giving that signature buttermilk whipped cream she tops her desserts with a try.”—Maureen Corrigan,  NPRNoted chef and James Beard Award-winning essayist Lisa Donovan helped establish some of the South's most important kitchens, and her pastry work is at the forefront of a resurgence in traditional desserts. Yet Donovan struggled to make a living in an industry where male chefs built successful careers on the stories, recipes, and culinary heritage passed down from generations of female cooks and cooks of color. At one of her career peaks, she made the perfect dessert at a celebration for food-world goddess Diana Kennedy. When Kennedy asked why she had not heard of her, Donovan said she did not know. \"I do,\" Kennedy said, \"Stop letting men tell your story.\"OUR LADY OF PERPETUAL HUNGER is Donovan's searing, beautiful, and searching chronicle of reclaiming her own story and the narrative of the women who came before her. Her family's matriarchs found strength and passion through food, and they inspired Donovan's accomplished career. Donovan's love language is hospitality, and she wants to welcome everyone to the table of good food and fairness.Donovan herself had been told at every juncture that she wasn't enough: she came from a struggling southern family that felt ashamed of its own mixed race heritage and whose elders diminished their women. She survived abuse and assault as a young mother. But Donovan's salvations were food, self-reliance, and the network of women in food who stood by her.In the school of the late John Egerton, OUR LADY OF PERPETUAL HUNGER is an unforgettable Southern journey of class, gender, and race as told at table.",
  "genres": [
    "Memoir",
    "Food",
    "Nonfiction",
    "Cooking",
    "Audiobook",
    "Biography Memoir",
    "Book Club"
  ],
  "author": "Lisa Donovan",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/48889993-our-lady-of-perpetual-hunger"
}