{
  "title": "Your Words, Your Life Story: A Journal for Sharing Memories",
  "description": "You can be the author of your life story. Only you can tell the truth about the joys and sorrows, successes and failures, loved ones and villains and your secret dreams. J. Q. Rose has delivered an effective guide with practical tips to help anyone start the process of recording one’s life story. Elizabeth Your Words, Your Life Story is a wonderful resource for anyone who wants to capture and share the moments which made a significant impact on them - both the good times and the bad times. The journal guides you through the process of documenting and organizing your memories, offers exercises and writing prompts to spark your creativity, and provides plenty of space to record your life story. This journal is a perfect starting point for anyone who wants to turn their memories into a treasured keepsake for generations to come. Ellen J.Q. asks a question. \"Why Tell My Story?\"Ah-ha. I'm hooked. Why, indeed? Who cares? She tells us. She also discusses the differences in an autobiography and a memoir. But one thing that is helping me is the timeline. Some blank pages are in the book for readers to discover their memories, and it is helping me…Believe me, it's great. Some memories are already coming back to me when I look at a certain year. There are a lot of blank pages to fill up in the book. It's going to be a lot of fun doing it too. Beverly How do you begin? Published author J.Q. Rose will help you follow the path to sharing your story using her book based on years of leading workshops in life storytelling. Your Words, Your Life A Journal for Sharing Memories will help spark memories then save them as a collection of precious stories in the journal. You are not a writer? J.Q. will help you learn how to tell your story using video or audio programs. Preserving the experiences of the past for future generations is important. Your beloved stories will be a treasured guide to help them through their own lives. You won't be alone on your journey down memory lane. Receive free support through the private Facebook group, Tell Your Life Story and Memoirs Circle. You're invited to join in to share stories, resources, tips, experiences and memories. (You do not need to purchase this book to participate.) Start now to put together the stories that make up your life story, a treasured family keepsake.",
  "genres": [],
  "author": "J.Q. Rose",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/48857699-your-words-your-life-story"
}