{
  "title": "Twenty-Eight Snow Angels: A Widow's Story of Love, Loss and Renewal",
  "description": "\"Beach Book Festival\" Runner-Up in the Autobiography Category!A BEAUTIFULLY WRITTEN STORY OF A LIFE RENEWED Diane Dettmann's memoir, Twenty-Eight Snow Angels: A Widow's Story of Love, Loss and Renewal, invites the reader into her personal experience of grief, as she faces life alone, after the death of her husband. With honesty and a clear perspective, Diane reveals her daily struggles as she faces the difficult realities of grief. The reader feels her pain and at the same time rejoices in her commitment to tackle the daily challenges of life on her own and succeed. Her heartfelt story inspires hope as readers discover they can build a meaningful life-alone or with someone new-after a devastating loss. This inspirational story vividly portrays the painful depths of grief that many people experience with a loss in their life. Diane's descriptive writing captivates the reader and engages them in the journey through her painful loss. Alone for the first time in her life, she realizes the healing powers passing strangers provide as they float in and out of her life. Along the way, she discovers personal strengths and skills she never knew she possessed. With sparks of humor scattered throughout her story, she provides the readers with a glow in the darkness that inspires them to keep going. Twenty-Eight Snow Angels is a book that will leave the reader thinking, \"Someone finally gets it \" Even counselors, family members and friends who read this book can gain a deeper understanding of how ravishing grief can be to people who have experienced a traumatic loss in their life. \"A keenly observed story of the sudden death of a husband. The reader feels the grief and the hope that follows.\" %u2013Adair Lara, author of Hold Me Close, Let Me Go  \"Writer Diane Dettmann's grief makes small events, like the sale of a beloved piano, become as momentous as the sale of a national treasure. In the process, she rediscovers faith, community and love.\" -Susan Parker, author of Walking in the Deep End \"In Twenty-Eight Snow Angels, writer Diane Dettmann gives us a poignant account of a life badly rent and ultimately revitalized in a way we can take to heart.\" -Peggy Lang, award-winning ghostwriter \"The reader is drawn in and captivated by Diane's vivid account of her grief after the death of her loving husband . . . a powerful story of love, grief, hope and faith all can learn from.\" -Mary Jacks, M.S. Licensed Marriage and Family Therapist \"Diane's piano move was one of our most memorable. It really touched us all\" -Paula Soukup, Manny's Piano Company, Inc.",
  "genres": [
    "Memoir"
  ],
  "author": "Diane Dettmann",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/12482608-twenty-eight-snow-angels"
}