{
  "title": "Tragedy of Me",
  "description": "With the Curse of the Beast broken, Brielle Healer thought she’d left her bloody, gruesome past behind her. She thought she’d finally be able to have her happy ending with Raul, the gypsy who saved her life and she’s betrothed to. But when a new batch of dead bodies are discovered on her property, she doubts whether the curse was truly broken. Not to mention, Lord Kenrick’s brother, Daedric has shown up in town seeking information about his missing brother, who was last seen with Bri. He and other Knights of the Crowhurst Order want answers, answers that could very well endanger Bri’s life once more. But an encounter with Daedric has her wondering if perhaps Kenrick isn’t truly dead after all. That there might be a way to bring him back from wherever it is his spirit slipped into. However, as they delve deeper into research they discover an attempt to get Kenrick back will likely mean a trip through a hellish realm more powerful and dangerous than either can handle. But when tragedy strikes, Brielle knows she has nothing left to lose. And this might be her one chance to redeem herself for past failures and crimes.Raul Tinker spent his whole life trying to outrun his past. But the darkness has finally caught up to him, in the form of his vengeful sister Yalena, who blames him for their family’s downfall amongst their gypsy clan. She wants to destroy everything he loves, starting with Brielle. Although trained in magic, he knows he’s no match for the evilness she’s dipped her fingers into. Yalena promises not to harm Brielle, if Raul agrees to do her bidding. Which means people will die and the world will be opened up to unimaginable horrors. Raul knows no matter what he chooses, he’ll lose a piece of himself. Because the only way to stop her would be to allow the same darkness that consumes Yalena to consume him as well… But he will do anything necessary to ensure Bri's safety. Anything.",
  "genres": [
    "Magic",
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal"
  ],
  "author": "Rebekah L. Purdy",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/48893380-tragedy-of-me"
}