{
  "title": "The Firefly Dance",
  "description": "Bright lights flicker in the dark evenings of summer. Pinpoints of hope float against the black descent of night. The sweetest of small and innocent creatures finds its way through the shadows. Fireflies seem to dance on sheer air, illuminating the space between heartbeats.Children give off a similar brave glow, despite the challenges of their young lives. The lessons of childhood are often painful, the shedding of fragile wings in the gloam of an uncertain future. These rich novellas are small jewels reflecting the essence of what it means to grow up dancing among the shadows of life, carrying a brave, small beacon because you know that even the brightest days always, always, end in darkness.Childhood can be so sweetly sad and sadly sweet, profound and deceptively easy to categorize, yet poignant to remember.New York Times bestselling novelist Sarah Addison Allen (GARDEN SPELLS, SUGAR QUEEN, THE PEACH KEEPER) anchors THE FIREFLY DANCE with her wistful and funny novella about Louise, a North Carolina girl whose keen observations of the lives around her weaves an unforgettable spell with just a hint of everyday magic.Phyllis Schieber's Sonya, a child of Holocaust survivors, is confronted with the responsibilities of her legacy when she has a poignant encounter with a classmate, another child of survivors, and her mother, in a local shop in their 1970's New York neighborhood.Kathryn Magendie's Petey deals wryly with her family's move from the cool blue mountains of North Carolina to the hot flatlands of Texas.Augusta Trobaugh's stoic Georgia boy leads us through his surreal encounter with a mysterious backwoods toddler who turns out to be anything but ordinary.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Short Stories",
    "Fantasy",
    "Chick Lit",
    "Contemporary",
    "Historical Fiction"
  ],
  "author": "Sarah Addison Allen",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/12483841-the-firefly-dance"
}