{
  "title": "Jackie and Maria: A Novel of Jackie Kennedy & Maria Callas",
  "description": "From the internationally bestselling author of The Secret Wife comes a tale of love, sacrifice and betrayal, available for pre-order now.JACKIEWhen her first marriage ends in tragedy, Jackie Kennedy fears she’ll never love again. But all that changes when she encounters…ARISuccessful and charming, Ari Onassis is a man who promises her the world. Yet soon after they marry, Jackie learns that his heart also belongs to another…MARIAA beautiful, famed singer, Maria Callas is in love with Jackie’s new husband – and she isn’t going to give up.Little by little, Jackie and Maria’s lives begin to tangle in a dangerous web of secrets, scandal and lies. But with both women determined to make Ari theirs alone, the stakes are high. How far will they go for true love?Readers love The Second Marriage:‘Glamorous and highly seductive, this compelling story explores the lives of two complex, powerful women complete with all their talents and flaws.’ Dinah Jefferies, author of The Tuscan Contessa‘Heart-breaking. Brilliant. Powerful. Its intensity and perception knocked me out; I guarantee that this fascinating love-triangle story will have you enthralled.’ Kate Furnivall, author of The Guardian of Lies‘I was completely enthralled, wholly swept up in the characters, the glamour, and the fascinating story of these iconic women. An utter treat from beginning to end – readers far and wide will fall under its spell.’ Jenny Ashcroft, author of Beneath a Burning Sky‘I can't rave highly enough about this book – it's my favourite Gill Paul novel to date. A dazzling yet moving portrait of two very different iconic women, it's brilliantly researched, compellingly told and completely fascinating. I just loved it.’ Tracy Rees, author of Amy Snow‘A compelling and fascinating story about powerful personalities.’ Rosanna Ley, author of The Lemon Tree Hotel‘Addictive and so well-researched. I read it in a day.’ Kate Riordan, author of The Heatwave‘A truly compelling story… This is the best of historical fiction – leaving you wanting to learn more.’ Liz Trenow, author of The Forgotten Seamstress",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Romance",
    "Book Club",
    "Adult"
  ],
  "author": "Gill Paul",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/48896281-jackie-and-maria"
}