{
  "title": "So Marvelously Far",
  "description": "Crisis Chronicles Press is thrilled to announce the publication of So Marvelously Far, an essential new poetry collection by Ohio's own Nick Gardner.“This first book of poetry by Nick Gardner composed of 49 poems written in sonnet form brings the diurnal under the close and sustained scrutiny of a poetic sensibility that is at once broad and focused, a sensibility attuned to the brokenness of life while affirming the possibility of redemption. Gardner not only extracts meaning in such poems as ‘Dog Food’ which looks the blunted reality of opiate addiction clearly if not profoundly in the eye, or in ‘Grounding’ where the poetic sensibility seems to drift in an airy medium somewhere between longing and optimism while insisting on a vision that edges toward apocalypse, but also constructs meaning by drawing upon the desultory events, occurrences, and people of lived life, yoking them to insight and poignancy. Between the poles of angry sadness and hopeful anticipation, there are works like ‘Searching for Veins in Mr. Powell’s Cornfield’ which collapses several layers of meaning into one another. The images Gardner employs are oftentimes dark as they argue the harsh truth of the micro realities of drug addiction in small town America. Nonetheless, they also argue a guarded hope that poetically makes itself known as a shot across the bow of an oftentimes listing ship of life. The effect of So Marvelously Far is one of unsettling vision as well as one of poetic power. The work warns in ironic tones of the normalization of an increasingly dehumanized landscape, one redolent of the Avett Brothers in their song ‘Head Full of Doubt.’ More importantly, it is also a celebration of a remarkable and prescient poetic sensibility that will likely be around for some time.”—Steven Joyce, Associate Professor of German & Comparative Literature, The Ohio State University; author of Transformations and Texts, The Apostate Djin, The Winds of Ilion, and A Sea of Other.",
  "genres": [],
  "author": "Nick  Gardner",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/48894882-so-marvelously-far"
}