{
  "title": "Battle for Earth",
  "description": "Evil alien monsters. High tech military action. An oddball special operations team with whom you will fall in love.  This is immersive science fiction adventure that will engage your imagination.  The world was in crisis even before the invasion. Humanity was polarized. Nations were crumbling, crushed by immense pressure. Pressure from within, pressure from without; civil wars and the clash of entire civilizations. Then the aliens invaded and changed everything.  The invaders have overwhelming technological superiority. But we are an unusual people, practiced in the art of war. We even hold a few technological advantages of our own.  The story centers around an elite special forces team with extreme force multiplying capabilities. The invasion is hard enough. But the insectoid alien monsters are only the vanguard of the horror yet to come. Join the team along the action packed and twisting road that leads to interstellar war.  The plotline runs deep in the book series as conflict gives over to resolution, from the decidedly personal, to an ever expanding military conflict on a scale that is barely imaginable. The Universe is Broken. You can feel it. The Second Law of Thermodynamics tells the tale. Entropy. The Breaking creeps up on everyone. It’s everywhere. Even entropy can be defeated. Let’s turn the Universe upside down until we get the answer.  The series begins with the Battle for Earth and moves from there to the stars and beyond. It is a unique telling of the age-old conflict between good and evil, in the setting of an expanding war. In this story virtue does carry a gun. Sometimes. Actually, it’s a military sci fi, so there are a lot of guns. Oh well. We’ll just have to deal with it.  Explore the worlds and technologies envisioned by Hammer Trollkin in Shockwave. A little back-engineering of alien tech combined with human ingenuity makes for a fast-track to the stars and beyond. Too bad it has to involve warfare on a cosmic scale. This is fast paced science fiction with a twist of fantasy to spice it all up and the occasional philosophical jaunt to keep you thinking. It’s going to get real kinetic out there.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fantasy",
    "Dystopia"
  ],
  "author": "Hammer Trollkin",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/48892817-battle-for-earth"
}