{
  "title": "Blue",
  "description": "\"Molto probabilmente il mio organismo aveva prodotto più adrenalina negli ultimi giorni che nei sedici anni precedenti. Erano successe così tante cose e avevo avuto così poco tempo per riflettere\" Gwendolyn ha tutte le ragioni di questo mondo per pensarla così. Ha appena scoperto di non essere una normale ragazza londinese, bensì una viaggiatrice nel tempo che i Guardiani - una setti segreta che ha sede nel dedalo di vie intorno a Temple Church - inviano nelle epoche passate per prelevare una goccia di sangue dai dodici prescelti e completare il cronografo, una missione da cui dipende il destino dell'umanità. Peccato che la sua famiglia non l'avesse informata perché tutti erano convinti che la predestinata fosse l'odiosa cugina Charlotte e peccato che, di conseguenza, Gwen avesse trascorso gli ultimi sedici anni della propria vita a studiare (poco), giocare (molto), chiacchierare e divertirsi con le amiche come ogni ragazza. Mentre avrebbe dovuto imparare a tirare di scherma, ballare il minuetto, apprendere nozioni di storia universale e conversare in modo appropriato con l'aristocrazia del Settecento. Quasi tutto, nella sua nuova situazione, la infastidisce: essere sballottata avanti e indietro nei secoli, la supponenza mista a invidia della cugina Charlotte, la noia delle lezioni di ballo e portamento... Poche cose le piacciono: il piccolo gargoyle fantasma Xemerius, che solo lei Gwen può vedere e, naturalmente, il suo compagno di viaggi nel tempo: Gideon, bello da morire, anche se è talmente imprevedibile con lei da farla impazzire dal desiderio e dalla rabbia insieme. Invece, senza alcun dubbio, Gwen sa di cosa avere paura: del conte di Saint Germain, il grande burattinaio che tiene le fila di tutto e che vuole completare al più presto il Cronografo, prima che i nemici glielo impediscano. Ma chi sono veramente i nemici? Perché Gwen non riesce a fidarsi di lui?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Time Travel",
    "Historical Fiction",
    "Fiction",
    "Science Fiction"
  ],
  "author": "Kerstin Gier",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/12483132-blue"
}