{
  "title": "Across the river ...Under the bridge....:",
  "description": "Dazzle Penkins is a twenty six years old girl and the daughter of Thomas Penkins who is owner of a conglomerate which comprises six profitable companies the turnover of all of which is thirty six thousand crores per year and profit is three thousand crores per year. She received a phone call from her father while she was in USA requesting her to come to India immediately saying that there is a very important matter needs to be discussed with her. But by the time she reached India her father died with a heart attack making her not only shocked, bewildered and distressed but also a major shareholder of the ‘Penkins Conglomerate.’ Dazzle has become more and more perplexed and disturbed thinking what her father that desperately wanted to say to her. He neither left any clue of the same anywhere nor shared even a little of that with anyone else. Her father did not say anything about the same even to his close relatives Catherine and Williams or to his close friend Dr.Nickerson or to Viola who intimated with him as much as Dazzle. Dazzle just did not know what to do after she started hearing strange sounds and having odd sexual experiences with her previous boyfriends Nathaniel Zimbra and Chuck Watson who were dead. Dazzle’s close friend Viola said that Dazzle is suffering from a psychological disorder. But Viola’s hypnotizing and programming Dazzle did not help even a little to cure Dazzle from that psychological disorder. Dazzle strongly believed that there is more than her psychological disorder in her suffering like that but she did not know what to do. When Dazzle shared her odd experiences with her present lover George he insisted that they have to take the help of a private detective to investigate into the said mysteries. Even Dazzle did not like the idea of taking the help of a private detective, as George threatened her that he would go far away from her if she would not agree, Dazzle has to. Then detective Smaran was hired by the Dazzle who was advised by George and he started investigating into the matters not only to know what her father desperately wanted to say to her before his death but to know the reason for the Dazzle’s odd experiences also. Dazzle was more shocked, more astounded, more distressed when Smaran unraveled the mysteries on the day he promised. Dazzle could not even guess such a thing behind her suffering with the psychological disorder! A romantic, psychological and investigative thriller with 1,05,440 Words. Along with this ebook, the other romantic and suspense thrillers of this author, ‘A Mansion Of Illusions’, ‘Chasing Butterflies’, ‘Rain Flower’, ‘Nirupama’, ‘A Village, A Forest And An Old Mansion’ ‘Lovenest’, ‘Moonshine’, ‘Scarecrow’ ‘Enna (Her life….her love…..her struggle) ’, 'Sand Dunes (A collection of eight short stories)' ‘Rose Garden’ and ‘Amaswitha’ (Sex, Psychology And Supernatural) along with two non-fiction books ‘Body Mind And You’ and ‘English Grammar Simplifier’ are also available as ebooks only on Amazon.",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/48905524-across-the-river-under-the-bridge"
}