{
  "title": "Do Me a Favor",
  "description": "Some days things just click. Today is not that day.Love is a battlefield, and divorce attorney Sadie Howard is entrenched on the frontlines. She thought she might have met the right man once, but he was a career military guy who got shipped overseas and left her heart on the tarmac. These days, the only commitment Sadie wants is the one she's made to her Denver law practice.Combat photographer Roman Dvornakov is back. Fresh out of the U.S. Army, he’s using family connections to snap photos at a few weddings while he builds his civilian photography practice. After all he’s captured on film, a few posed wedding shots should be a cakewalk. Seeing so much death through the camera lens, he’s now ready to build something worth living for. A thriving photography business, definitely. But he’s certain his new mission also includes Sadie, the girl who slipped away.Sadie isn’t convinced, and she's not willing to open her heart anytime soon. Besides, she’s got a high-profile divorce case taking up all her attention. Winning the case for her client will make or break her practice.  So what if it's a custody dispute over a ridiculously expensive fish tank? When Roman discovers the soon-to-be divorced couple are still in love, he and his slightly-nutty grandmother, Babushka, are determined to convince them to cancel the proceedings. He’s not camera shy when it comes to matters of the heart, but interfering with Sadie's clients could wreck her career and any chance they'll ever have together... WARNING: READ ONLY IF YOU LOVE A STRONG HEROINE, AN ALPHA HERO WITH A HEART OF GOLD, FAMILY MEDDLING, AND A GUARANTEED HEA. IF LAUGHING SO HARD THAT THOSE AROUND YOU ASK IF YOU ARE OKAY IS YOUR THING, THEN THIS BOOK IS FOR YOU.",
  "genres": [
    "Romance",
    "Contemporary",
    "Audiobook",
    "Second Chance",
    "Contemporary Romance",
    "Friends To Lovers",
    "Second Chance Romance"
  ],
  "author": "Christina Hovland",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/48915593-do-me-a-favor"
}