{
  "title": "Musical Chairs",
  "description": "“Poeppel has created a story that is well thought out, well plotted, well written, and fully developed. A delightful novel that celebrates the messiness and joy to be found in real life.” — Kirkus Reviews (starred review)“100% page-turning delight…Pull out a lawn chair and prepare to read this gleefully entertaining novel.” —Stephen McCauley, author of My Ex-LifeThe award-winning, “quick-witted and razor-sharp” (Taylor Jenkins Reid, New York Times bestselling author of Daisy Jones & The Six ) author of Limelight and Small Admissions returns with a hilarious and heartfelt new novel about a perfectly imperfect summer of love, secrets, and second chances.Bridget and Will have the kind of relationship that people they’re loving, compatible, and completely devoted to each other. The fact that they’re strictly friends seems to get lost on nearly everyone. For three decades, they’ve nurtured their baby, the Forsyth Trio—a chamber group they created as students with their Juilliard classmate Gavin Glantz. In the intervening years, Gavin has gone on to become one of the classical music world’s reigning stars, while Bridget and Will have learned to embrace the warm reviews and smaller venues that accompany modest success.Bridget has been dreaming of spending the summer at her well-worn Connecticut country home with her boyfriend Sterling. But her plans are upended when Sterling breaks up with her over email, her twin twenty-somethings arrive unexpectedly, and her elderly father announces he’s getting married. She concocts a plan to host her dad’s wedding on her ramshackle property, while putting the Forsyth Trio back into the spotlight. But to catch the attention of the music world, she and Will place their bets on luring back Gavin, whom they’ve both avoided ever since their stormy parting.“In this funny, profound, and brilliantly alive novel about all the messy, wise, and wonderful chords that love can strike in our lives, Poeppel gathers together fathers and daughters, old flames and new sparks, music, writing and gardening, to explore what it really means to feel at home, and how life can open you up in ways you never saw coming” (Caroline Leavitt, New York Times bestselling author).",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Contemporary",
    "Chick Lit",
    "Humor",
    "Music"
  ],
  "author": "Amy Poeppel",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/48914611-musical-chairs"
}