{
  "title": "Lena & Ivar",
  "description": "Lena & Ivar is the prequel novel to the Viking Glory series. Meet the generation that laid the foundation for the unstoppable characters from this suspenseful and steamy series.\nWhat happens when love and war don’t mix?\nIvar Sorenson is not only his father’s heir to their jarldom, he’s his parents’ last remaining son.  There isn’t much choice for the future jarl when his father demands an alliance with their feuding neighbor.  That alliance can only come in the form of a marriage...to a woman Ivar doesn’t want and doesn’t like. Not when he already has the one great love of his life already by his side. Can Ivar convince his father that a marriage is needed to end the feud? Can he prove that the woman he loves is the woman his tribe needs to lead alongside him? Can these friends to lovers get their second chance?\n\n\nWhat happens when the heart wants what the heart wants?\n\n\n\nLena Torbinsdóttir has known Ivar Sorenson her entire life, growing up and training alongside him. As children, they were inseparable playmates and best friends.  As adults, Lena and Ivar are soulmates. But ongoing conflict between their tribe and their neighbor may force Lena to give up the only man she has ever loved in the name of duty and politics. Can Lena walk away when Ivar faces marriage to another woman? Can Lena survive when her competition wants Ivar’s attention all for herself?\nWith help from their friends, Rangvald and Lorna, can Ivar and Lena find a way to create peace while protecting their future together?\n\n\n\nLena & Ivar is the prequel novel to the Viking Glory series.  Meet the generation that laid the foundation for the unstoppable characters from this suspenseful and steamy series.Viking Glory is a steamy historical series that will transport you back to the world of the ancient Norse with brave heroes and even stronger heroines. The series follows the lives and loves of five friends. Brother and sister, Leif and Freya, along with their cousin, Bjorn, and their friends Strian and Tyra sail the seas and conquer hearts. This is a four book series where each book can be read as a standalone but is best read as part of the series.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Viking Romance",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Celeste Barclay",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/48915154-lena-ivar"
}