{
  "title": "A May Day to Remember",
  "description": "A May Day to Remember features eight all-new novellas full of May Day Mischief and heart-pounding romance. Indulge in these novellas from USA Today and bestselling authors today:Married by May by Nadine MillardLady Beatrice Fortescue can’t face another unsuccessful London Season. Her mother is determined to make Beatrice an Incomparable by June. So Beatrice is determined to be married by May.One Fateful May Day by Amanda MarielLady Emma Finch knew disaster would strike when she agreed to accompany her friends to the village May Day festival. Viscount Linley, Archer Wakefield, attended the festival with fun and frolic in mind. Neither could have guessed what would happen once their paths crossed.The Vixen in Red by Dawn BrowerLady Charlotte Rossington crosses paths with Collin, the Earl of Frossly when she is banished to the country. He’s handsome as sin and the wickedest rogue she’s ever encountered. She is drawn to him--the last thing she wants is to be forced to choose between her dream and love.A May Day Code for Love by Jacki DeleckiWhen Miss Ella Evans, bluestocking and gothic fiction writer, is asked to accompany one of the Crown’s undercover agents to a May Day celebration in pursuit of a of a band of French smugglers, she cannot refuse even though it means confronting the man who stole her innocence with the empty promise of matrimony three years ago.Lord Sebastian Grosvenor pledged his fealty to the Crown, but that loyalty is tested when Lord Rathbourne, Head of English Intelligence, demands he pose as the besotted beau to a bookish spinster to root out a dangerous foreign spy. When Ella’s clever machinations prove invaluable to their mission, Sebastian finds himself torn between protecting her honor and identifying the smuggling ringleader.Danger and passion collide when Ella uncovers the spy’s identity and is kidnapped. Can Sebastian rescue the young woman who’s stolen his heart without sacrificing his duty to the Crown?His Elusive Nightingale by Aileen FishWhen Malcolm Lennox, part time magistrate and amateur sleuth, seeks the reward for finding a missing opera singer, he seeks out Kitty Fairfax, the singer’s maid, to accomplish the challenge.Lady Mary’s May Day Mischief by Cerise DeLandLady Mary Finch always succeeded match-making for her friends. Until she fails…and often. But what’s she to do when the man she loves fears her motives? Can she earn Lord Bridges’ trust or will she lose him forever?The Queen of May by Diana BoldFlynn Hollister, the second son of the Earl of Darlington, is soon to join the Army. At the May Day celebration, he declares his love for the Queen of May Day, Violet Weatherby. She promises to write to him while he is gone, and he leaves thinking he’s found the woman of his dreams.When he returns from war five years later, wounded and heartsick, he is shocked to find that the woman he’s been corresponding with the entire time is now married to his brother.Daisy Weatherby, Violet’s younger sister, has loved Flynn since she was a child, and she is the one who’s been writing to him. How can she tell him that the woman he fell in love with is her and not her sister?Magic in Mayflowers by Sandra SookooSelf-confirmed spinster Miss Anne Deighton wants to match her younger sister to a gentleman and see her happily married before settling into her fate… for her own previous two engagements failed.Quiet Reginald Marleigh, Viscount Ingleby, has come to the Wiltshire countryside to attend May Day festivities… and to turn his attention to the responsibilities of his title. Yet during the four days of the country festival, there are all too many opportunities for mischief and stolen kisses… and perhaps reckless danger.If the two of them let themselves, they’ll see there is magic in Mayflowers, and it might just encourage love to bloom.",
  "genres": [],
  "author": "Nadine Millard",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/48932375-a-may-day-to-remember"
}