{
  "title": "Kashi Marnanmukti",
  "description": "एक परिचय ...ईश्वर सृजित यह सृष्टि जितनी अनंत है, उतनी ही सूक्ष्म भी | अंतस् की इस सूक्ष्म सृष्टि में, माया के अनेक आवरणों के पीछे वह परम ज्योति प्रतिष्ठित है जिसके दर्शन करता मानव शिवत्व को प्राप्त हो जाता है | जो इस सत्य को जानता है, वह यह भी जानता है की जीवन मात्र सृष्टि की अनंतता से उसकी सूक्ष्मता की और यात्रा है और मृत्यु इस यात्रा की परम मंगलकारी पूर्णता | साधना के इसी क्षण मनुष्य निज-स्वभाव के गंतव्य को पा, स्व-हृदय में परमेश्वर की प्राणप्रतिष्ठा कर लेता है |काशी के मणिकर्णिका महाश्मशान में मात्र तेरह वर्ष की आयु से चांडाल के रूप में नित्य शवों के जलाने वाले महामृणगंम (महा) ने चिताग्नि में अहर्निश शवों का हविष्य अर्पित करते हुए, इस मृत्यु-यज्ञ को ही अपनी तपस्या बना लिया | काशीवास ने महा को पंचतत्वों के रहस्यों का परिचय दिया, वहीं कबीर और तुलसी ने स्वपनों एवं भावों में आ उसे निर्गुण और सगुण का मार्ग दिखाया| किंतु अज्ञान के किसी क्षण माया के प्रपंच ने उसे काशी त्यागने पर विवश कर दिया |मनुष्य भले ही ईश्वर को विस्मृत कर दे परंतु अंत:करण में बसा ईश्वर एक क्षण को भी मनुष्य का साथ नहीं छोड़ता | युग-युग में जन्में अपने शिष्यों को शिव साक्षात् योगाचार्य का रूप धर, गुरु बन, मोक्ष-यात्रा की और प्रशस्त करतें है | ' काशी मरणान्मुक्ति ' में गुरु की महिमा की व्याख्या इन शब्दों में की गई है -\"गुरु के ज्ञान को मन की मुद्रा बना, गुरु के शब्द पर ध्यान करने वाला जीव ही काशीवास के रहस्य को ज्ञात कर इन मुक्ति के भेदों के ज्ञान को प्राप्त होता है |\"महा की यही यात्रा उसे साधना के उस चरम पर पहुँचा देती है जहाँ समस्त द्वैत विगलित हो जाते हें और यह श्मशान प्रहरी, महाश्मशानाधिपति काशी विश्वनाथ से एकाकार हो जाता है... यही काशी मरणान्मुक्ति है |Synopsis:Kashi Marnanmukti is a classic piece of Hindi Literary Work in all aspects from the story to the language and the mystical narration. The novel is based on the spiritual journey of its protagonist, Maha Mrinangam or 'Maha' as he has been addresses thoughout the story, a chandaal (executioner), from the condemned cremation grounds of Manikarnika Ghat in Kashi (Benares) to Kashi Vishwanath, the Supreme divinity that resides in the the conscience of every being. The book gives a picturesque description of the several shades of 18th century Benares, immersing the reader in the mysticism that surrounds the city. Kashi Marnanmukti is a Sanskrit phrase which means \"those fortunate enough to die in Kashi are freed from the cycle of birth and death\".Maha's search for the ultimate and eternal truth behind the cycle of life and death leads him to Manikarnika Ghat, where at the tender age of 13 he chooses to work as a chandaal, burning the funeral pyres day and night. Kashi Vishwanath, through the condemned cremation grounds, reveals the true meaning of death to him, while Kabir and Tulsidas, through his dreams and visions, open to him the doors to real meaning of life, but always concluding their teachings with words \"Par yaad rakh main tera Guru nahin\" (Remember I am not your guru). Maha's longing for a guru deviates him from the path of real Sadhna, the path of knowing one's Svabhav (one's own self). Trapped in the illusory world of Maya, Maha leaves Kashi and sets out for the journey of the four Dhaams (Hindu shrines in located in four different directions) and twelve Jyotirlingas (sacred idols of Lord Shiva present at twelve different temple in India).The dark night of ignorance ends and the sun of knowledge rises in the form of his guru, who guides him to the path of enlightenment. With each destination of this journey, Maha finds himself moving a step closer his own self. Maha completes the journey externally to return to Kashi and attain samadhi and internally to reach his own conscience and attain oneness with the Kashi Vishwanath residing within.",
  "genres": [],
  "author": "Manoj Thakkar",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/12484894-kashi-marnanmukti"
}