{
  "title": "Freaks of Nature: What Anomalies Tell Us About Development and Evolution",
  "description": "In most respects, Abigail and Brittany Hensel are normal American twins. Born and raised in a small town, they enjoy a close relationship, though each has her own tastes and personality. But the Hensels also share a body. Their two heads sit side-by-side on a single torso, with two arms and two legs. They have not only survived, but have developed into athletic, graceful young women. And that, writes Mark S. Blumberg, opens an extraordinary window onto human development and evolution. In Freaks of Nature , Blumberg turns a scientist's eye on the oddities of nature, showing how a subject once relegated to the sideshow can help explain some of the deepest complexities of biology. Why, for example, does a two-headed human so resemble a two-headed minnow? What we need to understand, Blumberg argues, is that anomalies are the natural products of development, and it is through developmental mechanisms that evolution works. Freaks of Nature induces a kind of intellectual vertigo as it upends our intuitive understanding of biology. What really is an anomaly? Why is a limbless human a \"freak,\" but a limbless reptile-a snake-a successful variation? What we see as deformities, Blumberg writes, are merely alternative paths for development, which challenge both the creature itself and our ability to fit it into our familiar categories. Rather than mere dead-ends, many anomalies prove surprisingly survivable--as in the case of the goat without forelimbs that learned to walk upright. Blumberg explains how such variations occur, and points to the success of the Hensel sisters and the goat as examples of the extraordinary flexibility inherent in individual development. In taking seriously a subject that has often been shunned as discomfiting and embarrassing, Mark Blumberg sheds new light on how individuals--and entire species--develop, survive, and evolve.",
  "genres": [
    "Science",
    "Nonfiction",
    "Evolution",
    "Nature",
    "Biology",
    "History",
    "Popular Science"
  ],
  "author": "Mark S. Blumberg",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/4893592-freaks-of-nature"
}