{
  "title": "U.S. Army Ambulances and Medical Vehicles in World War II",
  "description": "A fully illustrated book covering all types of ambulances and medical vehicles used by the US Army during World War 2.Of all the armies involved in World War II, the U.S. Army developed the most sophisticated system for the transport and treatment of injured and sick soldiers, pushing the boundaries of available technology to give their men the best chance of not only survival but a full recovery.Each infantry regiment had a medical detachment that was tasked with conserving the strength of the regiment by not only providing medical and dental treatment but also undertaking all possible measures to keep the regiment healthy. In combat they would provide emergency medical treatment on the battlefield, then move casualties to aid stations they had established. At aid stations, casualties would be triaged, stabilized, and treated before being moved on for further treatment. Vehicles formed a crucial part of the Medical Detachment’s equipment.This fully illustrated, comprehensive book covers all types of medical vehicles used both in-theater and in the United States, including ambulances and technical support vehicles. It details vehicle markings modifications, for use in the evacuation of troops from the battlefield, and the other uses these vehicles were adapted for during the war - including their use as “Clubmobiles” and “Chuck Wagons” by the American Red Cross.Table of Contents1. Introduction2. Metropolitan Ambulances3. Multi patient Ambulances4. Field Litter Carriers5. Front Line Ambulances6. Medics Jeeps7. Rescue Teams8. Medical Trucks9. Reverse Lend-Lease10. Field Ambulances11. Markings12. On the Front13. Other Missions, Other Life14. The American Red Cross15. The American Field Service16. ConundrumsBibliography and Acknowledgements",
  "genres": [],
  "author": "Didier Andres",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/48933602-u-s-army-ambulances-and-medical-vehicles-in-world-war-ii"
}