{
  "title": "The WORST Christmas Book EVER!",
  "description": "The WORST Christmas Book EVER! Yes, it's true. This will be the WORST Christmas book you will read—EVER. But wait! Sammy is out to prove that this book is NOT the worst Christmas book—EVER. But can this little bird do enough to convince you? Read the book to find out! About the Sammy Bird Series This is a picture book series about a quirky bird named Sammy and his amusing misadventures. Readers will discover that Sammy is a little red bird who has a BIG personality. The books in this series are humorous, engaging and sometimes deal with common childhood issues like bullying, fear of the dark, patience and friendship. The books are interactive and engages young readers to participate in the story. There are over 90 Books in the series and counting! From the Author I like to think of myself as a storyteller who brings families together through the medium of picture books. Whether it is between a parent or child or a grandparent and child. These stories are intended to be light-hearted and funny and most importantly the stories engage young readers to be a part of the story itself. My hope is that these books will help build upon a child's love for reading and allow families to laugh and enjoy spending time together. As a reader, you can look forward to many more adventures with this silly and fun-loving red bird! -V. Moua About the The WORST Christmas Book EVER! This is a read aloud kids book. The target age range audience is appropriate for pre k preschool and young children who are at the following stages of I can read level 1, I can read level 2, I can read level 3 and I can read level 4. This is a book that any child will love, especially at bedtime. It is suitable for parents to read to their children. Also, grandparents will enjoy reading this book to their grandchildren. This series is part of the short bedtime stories for kids. Read this children's book FREE as part of your PRIME or Kindle Unlimited membership!",
  "genres": [],
  "author": "V. Moua",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/48923661-the-worst-christmas-book-ever"
}