{
  "title": "Amaswitha:",
  "description": "A psycho analytical thriller from the writer of ‘A Mansion of Illusions’ and ‘A Village, A Forest And An Old Mansion’ with a word length of 1,51,618 words.Long time back there was a village. It was afflicted with cholera and all the villagers were swiped of except three, Mohura, Amaswitha and Montu. Mohura thought it was just by god’s decision that the village was afflicted with cholera and the parents and siblings of all the three were dead. He wanted to take revenge on god, take him into his control and spread his empire everywhere in the universe to put a stop to the god’s atrocities. But Amaswitha was his main weakness and he wanted her to be the queen of his empire and be with him all the time. Montu was his best friend and Mohura wanted him also to be with him always. But either Amaswitha or Montu liked the decision of Mohura much and they disliked a lot his taking the help of bad angels to take revenge on god and to spread his empire everywhere. Amaswitha and Montu, both were committed suicide, to stop Mohura from implementing his evil ideas.But just their death did not stop Mohura and in every life of Amaswitha, Mohura tried to make her the queen of his empire but failed. But in the ninth life of her, as Sasikala, Mohura could make her the queen of his empire but in that life also Amaswitha did not like Mohura’s ideas and she just liked her husband Somanath whom she had to marry because of the evil design of Mohura and their son Aravind.Montu also took another life as Sasinadh and while he was leading a very pathetic life as a bangle seller, Mohura made him rich after Sasinadh’s promise to him that he would help Mohura in the way Mohura would ask him once he became rich. But Sasinadh did not fulfill his promise as he could not even think about the nasty things that Mohura wanted him to do. It was not just Sasinadh but most of the humans who became rich promising Mohura to help him later denied that promise after they heard the nasty things Mohura asked them to do. But Muhura would not leave any of his betrayers or their family members also for the generations to come. He would take the male souls of his betrayers into him, strengthen himself and torture the female souls related to their betrayers until their death. It just would go like that generations after generations also in the betrayers’ families. Mohura took the Sasinadh’s soul and all his sons’ souls except one, into him and strengthened himself and killed all his female folk after torturing them. He did not leave his descendants either as he would not leave any of the descendants of his betrayers.As Somanadh was the direct descendant of Sasinadh he wanted to take his soul also into him and strengthen himself. But he wanted to make his death even more painful to him as he was related to Sasinadh, he made Sasikala who was Amaswitha at one time married him and asked her to take his soul into her and strengthen herself. But instead of that, Sasikala became a faithful wife to Somanath and gave him a son Aravind. It enraged Mohura a lot and he took the soul of Sasinadh into him and strengthened himself and took a decision to take his son Aravind’s soul also later.To save Aravind and his family from the clutches of Mohura and his evil gang, Sasikala, trained Vamsi and sent him to Aravind’s home. There Vamsi met beautiful psychologist Sanjana who was the sister of Aravind’s wife Menaka and they influenced each other a lot.Sahamooti, who was a famous psychiatrist and also a victim of Mohura’s gang, took the decision to destroy that gang. He met his favourite disciples Charles and Rose of Black Ant Mental Care and asked them to help him in his mission and they agreed. How all these people have got success over the evil group is the story",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/48940897-amaswitha"
}