{
  "title": "A Christmas Mystery",
  "description": "Captivating British Whodunnit Murder Mystery Series with a twist of poison!Hugely popular author makes this beautiful historic city of Cambridge, England, leap off the page, with the eccentric Professor of poisons, Elizabeth Green, in this English crime fiction series.“I always like finding a new author with something a little bit different in the crime genre, and Charlot King is certainly that.” Amazon review“A wonderful murder mystery, deftly handled by Charlot and brought bang up to date with twists and subplots that entice the reader.” Amazon review\"Another perfect mystery from the criminally under-rated Charlot King. This really is turning into an indispensable series to read if you like classic who-dunnit books harking back to the golden era of Christie, Marsh and Dickson Carr.\" Amazon reviewThe plot Professor Elizabeth Green, a professor of poisons, has travelled to Oxford to deliver a keynote speech at Catte College when Father Christmas bursts into a formal supper, leaving a woman dead. It is not long before Elizabeth herself is in the firing line with the local Oxford Inspector, as more bodies start to fall. Meanwhile as the snow comes down and suspects mount, Inspector Abley and Sergeant Lemon are finding it hard to communicate. Will Professor Elizabeth Green help solve the puzzle before Christmas Day? Join her at Christmas as she navigates festivities among the dead bodies.The Series The Cambridge Murder Mysteries are set in the heart of Cambridge, England, featuring a vegan and animal-loving sleuth Elizabeth Green, and her sidekicks Inspector Abley and grandson, Godric. As the series unfolds, we learn more about these characters and their lives. If you like crime fiction, murder mysteries, whodunnits, women sleuths, traditional British detective stories, then you might like these books in the Bk1 ‘Poison’, Bk2 ‘Cursed’, Bk3 ‘Blood Moon’, Bk4 ‘A Christmas Mystery’, Bk5 ‘Valentine’s Day – Kiss of Death’, and the novella ‘Christmas Eve in Grantchester’.Or, if you just like a good mystery set in Cambridge with all the quirky peculiarities of the English, then The Cambridge Murder Mysteries might be for you too. If you enjoy intelligent storytelling, strong and vulnerable characters with twists and turns of the plot, then you’ll love the puzzles of these whodunnits.Charlot's fondness for Cambridge is replicated in her series, which has been described as evocative and authentic of this historic English city.And what of Professor Elizabeth Green? In her fifties, this female protagonist woman sleuth is quintessentially English. An eccentric professor in her ivory tower, she maintains a sharp wit, yet is flawed by her inability to connect well with people, instead giving off a cold, opinionated and sometimes acerbic air. Though very kind to all animals (dogs, cats and the rest!) - a vegan - and a great gardener, in truth she keeps her friends close, and only lets a few dear people into her world.Pick up this page-turning whodunnit series in the tradition of Agatha Christie and Miss Marple, Colin Dexter and Inspector Morse or Dorothy Sayers and Lord Peter Wimsey, and you’ll get a murder mystery fuelled by poison in the dark alleys of Cambridge today!",
  "genres": [
    "Christmas",
    "Mystery"
  ],
  "author": "Charlot King",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/48929322-a-christmas-mystery"
}