{
  "title": "Not Your Shoe Size",
  "description": "A sizzlingly spicy romance full of passion, second chances, and forbidden desires featuring a protective Alpha Hero and a sweet yet strong Heroine.After years of hiding behind a mask of faux-girliness, Kate ‘Middleton’ McGrath finally feels like she's stepping into her true self. She still craves the dominance of her Daddy, Tyler ‘Ty’ Henderson, in the bedroom, but outside of that, she’s ready to be seen as the fully grown woman she’s become.However, the perennially grumpy Ty doesn’t want things to change. He is fiercely protective of his Katie and perfectly content with the way things are... Except for the part where they’re not already married. He’s determined to make Kate his bride and cement their happily ever after.However, their seemingly perfect romance is thrown into chaos when a mysterious man from Kate's past reappears, stirring old insecurities. Love is a dangerous game, one that challenges even the strongest of bonds. In this tale of second chances, Ty must fight to prove his devotion and show Kate that their love is worth every risk.NOT YOUR SHOE SIZE is the follow-up novella to ACT YOUR AGE by critically acclaimed author Eve Dangerfield.★★★★★ “Not Your Shoe Size was exactly what I needed: sexy, fast-paced and sweet!” Read More Sleep Less ★★★★★ “This was the perfect icing on the cake for this couple... It takes you into the true heart of Ty and Kate, and I loved every second that I spent there.”  Dirty Girl Romance★★★★★ “Eve Dangerfield has the remarkable ability to take something that I find unsettling and a little weird and make it captivating.” Stacey is Sassy★★★★★ “Okay, that was perfect! I loved that we got more from these two!” Dar★★★★★ “More please!” This series was a tantalising read, and I loved every minute of it!” Jess",
  "genres": [
    "Romance",
    "Novella",
    "Contemporary Romance",
    "BDSM",
    "Contemporary",
    "Erotica",
    "Erotic Romance"
  ],
  "author": "Eve Dangerfield",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/48979462-not-your-shoe-size"
}