{
  "title": "Moon Over Manifest",
  "description": "The movement of the train rocked me like a lullaby. I closed my eyes to the dusty countryside and imagined the sign I’d seen only in Gideon’s Manifest—A Town with a rich past and a bright future. Abilene Tucker feels abandoned. Her father has put her on a train, sending her off to live with an old friend for the summer while he works a railroad job. Armed only with a few possessions and her list of universals, Abilene jumps off the train in Manifest, Kansas, aiming to learn about the boy her father once was.Having heard stories about Manifest, Abilene is disappointed to find that it’s just a dried-up, worn-out old town. But her disappointment quickly turns to excitement when she discovers a hidden cigar box full of mementos, including some old letters that mention a spy known as the Rattler. These mysterious letters send Abilene and her new friends, Lettie and Ruthanne, on an honest-to-goodness spy hunt, even though they are warned to “Leave Well Enough Alone.”Abilene throws all caution aside when she heads down the mysterious Path to Perdition to pay a debt to the reclusive Miss Sadie, a diviner who only tells stories from the past. It seems that Manifest’s history is full of colorful and shadowy characters—and long-held secrets. The more Abilene hears, the more determined she is to learn just what role her father played in that history. And as Manifest’s secrets are laid bare one by one, Abilene begins to weave her own story into the fabric of the town. Powerful in its simplicity and rich in historical detail, Clare Vanderpool’s debut is a gripping story of loss and redemption.CHARACTERS Manifest townspeople of 1918 Shady saloon owner and bootlegger con artist extraordinaireNed Manifest High School track starHattie Mae up-and-coming journalist for the Manifest HeraldThe Hungarian owner and operator of Miss Sadie’s Divining ParlorSister nun, not a universalIvan postmasterVelma T. chemistry teacher and maker of home remediesMr. undertakerHadley Ned’s father and owner of the hardware storeEudora president of the Daughters of the American Revolution (Manifest chapter)Pearl Ann daughter of Mrs. Larkin, and Ned’s girlArthur mine ownerLester pit boss Jinx’s uncle  Additional townspeople and their countries of origin Donal ScotlandCallisto GreeceCasimir and Etta (and little Eva) PolandOlaf and Greta NorwayMama ItalyHermann GermanyNikolai Russia Manifest townspeople of 1936 Abilene new girl in townGideon Abilene’s fatherLettie and friends of AbilenePastor Shady still a little shadyHattie Mae still writing “Hattie Mae’s NewsAuxiliary”Ivan still postmasterVelma still the chemistry teacherSister still a nunMiss still a divinerMr. still the undertakerMr. the barberMrs. owner of Dawkins Drug and DimeMrs. woman who sits on her porch and stares",
  "genres": [
    "Historical Fiction",
    "Middle Grade",
    "Young Adult",
    "Fiction",
    "Childrens",
    "Historical",
    "Mystery"
  ],
  "author": "Clare Vanderpool",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/10260497-moon-over-manifest"
}