{
  "title": "I Don't Want to Lose Hope: One life's journey, fight and triumph!",
  "description": "A book under a title “I Don’t Want to Lose Hope” is a very interesting piece of art, written by a Qazaq prominent writer, translator Nemat Kelimbetov.It is an autobiographical novel, written by Nemat Kelimbetov during his dark times. His story begins with an appeal to his wife at the time of his own physical ailment - the hero is confined to a hospital bed. For many years after an unsuccessful surgery, the author struggled with his body, which refused to obey him - a strong man in the prime of life with strong public opinion due to his illness was left alone. His illness compelled him to forget about his bright career and future and made him worry about his family: two sons and a spouse. Of course, as a result he fell into a deep depression.In the literary world, many works are devoted to overcoming, but not all of them describes it in so sincere and tender manner. The form of the monologue helps the author to share with the reader the most intimate, the most important moments in his life.The heart of the remarkable, autobiographical novel, awarded the Franz Kafka Golden Medal for Literature in 2010 is not just a person's battle with death, but a lyrical, deeply emotional narrative about the unyielding will to live and love that overcome all difficulties of life.While reading his book, you feel how his mind sharpened in the struggle with a severe physical illness, which he could manage to overcome, mobilizing his will to live. He was a courageous and goal-oriented man, able to win at the cost of incredible efforts thanks to his inexhaustible will to live.His large-scale, often paradoxical idea and bright, clever word help people to find moral reference points, to find support in themselves, not to get lost under the onslaught of circumstances, to find the light in the dark times.The book is for those who are desperate, do not see a way out because of their illness or other complicated circumstances in their life. After reading it, you will not \"lose your hope\" or it comes back to you again.In opinion of James Willsher, a newspaper and magazine reporter from Unitied Kingdom the book is about forgiveness, patience, wisdom, love and virtue, all those feelings which a person feels in his final hours. It is a story, where every word is weighed and balanced. The book might be a bestseller in America with sales in the millions, and a film in production.A novel “I Don’t Want to Lose Hope” was translated into more than twenty languages and spread all over the world. Furthermore, this year Nemat Kelimbetov’s book was chosen as a book to be read by everyone within a framework of folk literature campaign “One country, one book”. This campaign is carried out throughout the territory of Qazaqstan every year starting from 2006.Almost forty years of his life Nemat Kelimbetov spent first motionless in bed, then in a wheelchair. But he never complained about his fate, did not lose hope, remained an optimist. Moreover, thanks to his enormous efforts he has made great achievements in terms of science and literature.The literary heritage of Nemat Kelimbetov includes many translations from Russian language into Qazaq language. Among them: \"Our lovely Shushikent\" of Armenian writer Leonid Gurunts, novels of Uzbek writers: \"The Starlit Nights\" of Primkul Kadyrov and \"The Horizon\" of Saiyed Akhmad, \"The Lightning\" of the Ukrainian writer Vasyl Kozachenko.Nemat Kelimbetov is famous for his fundamental works on Turkic studies. He is an author of such books as: \"Ancient Turkic poetry and continuity of traditions in Qazaq literature\", \"Origins of Qazaq Literature\", \"Continuity of Art Traditions\", \"Literature of the Ancient World\" and others. He wrote a number of textbooks and manuals for students of higher educational institutions on the Ancient period of Qazaq literature.",
  "genres": [
    "Kazakhstan"
  ],
  "author": "Nemat Kelimbetov",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/48984391-i-don-t-want-to-lose-hope"
}