{
  "title": "You May Kiss the Bridesmaid",
  "description": "The moment you stop looking, that’s when Prince Charming will come knocking on your door!Summer Knowles does not want a boyfriend. Relationships have caused enough problems in her life. As bridesmaid at her sister’s wedding, she’s going to avoid all things romantic—especially the brawny, hipster best-man who has commitment-phobe written all over him!When Archie Hill meets Summer, he immediately thinks bridesmaid-and-best-man-with-benefits! They have one week together and may as well make the most of it. But what if one week just isn’t enough…As wedding fever takes hold, can a sworn-off-men bridesmaid and a die-hard bachelor learn a thing or two about happy-ever-after?A friends-with-benefits, wedding date rom-com, perfect for fans of Sarah Adams!Please note that this title was originally published as You May Kiss the Bridesmaid.What readers are saying about Camilla ‘A fun read filled with humor, heart, and love big enough to reach...to the stars and back. Recommended read for Contemporary Romance, Chick-Lit, and Romantic Comedy fans. Get ready to be starstruck!’ Gina, Satisfaction for Insatiable Readers‘It's not every day the female lead is revered more for her high intelligence, than her beauty. It was nice to see that dynamic between Lana and Christian...following what the heart wants. Sara, Chick Lit Central‘I completely fell for Christian in this book and it's been ages since I last felt like this about a book boyfriend.’ Rachel, Rachel Random Reads ‘I adored these characters. Penned in my favorite dual POV, the writing style was crisp and engaging, yet also perceptive and loaded with wry wit and clever touches. I zipped through their star-crossed storylines.’ Honolulubelle, Books & Bindings‘Cute, sweet, and fun!’ Zoe, What's Better Than Books?'This book had me smiling away to myself!! It has the perfect mixture of sweet, passion, drama and courage!' Michelle, Come Read With Me‘A fantastic romantic read that I devoured in one sitting.’ Kay, Coffee and Kindle Book Reviews‘An addictive page turner with an absolutely wonderful meet-cute.’ Julie, Romantic Reads and Such‘You can definitely feel the chemistry between main characters. They're so different but perfect for each other. An adorable rom-com that made me smile a lot.’ San, Behind the Sentence",
  "genres": [
    "Romance",
    "Chick Lit",
    "Romantic Comedy",
    "Contemporary",
    "Humor",
    "Contemporary Romance",
    "Audiobook"
  ],
  "author": "Camilla Isley",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/48946956-you-may-kiss-the-bridesmaid"
}