{
  "title": "A History of England from the Tudors to the Stuarts",
  "description": "During the 229-year period from 1485 to 1714, England transformed itself from a minor feudal state into what has been called \"the first modern society,\" and emerged as the wealthiest and most powerful nation in the world. Those years hold a huge story.The English people survived repeated epidemics and famines, one failed invasion and two successful ones, two civil wars, a series of violent religious reformations and counter-reformations, and confrontations with two of the most powerful monarchs on Earth, Louis XIV of France and Philip II of Spain.But they did much more than survive. They produced a marvelous culture that gave the world the philosophy of John Locke, the plays of Shakespeare, the wit of Swift, the poetry of Milton, the buildings of Christopher Wren, the science of Isaac Newton, and the verse of the King James Bible.And despite the cruelty, bloodshed, and religious suppression they visited on so many, they also left behind something else: the political principles and ideals for which we—and so many of them—would work and die, and on which we Americans would build our nation.Professor Robert Bucholz presents a sweeping, 48-lecture course on one of the most intriguing times in modern history.Professor Bucholz—whose work has been solicited and commented upon by His Royal Highness, the Prince of Wales—is a noted expert on the English court and royal household, and a frequent media commentator on British history and the Royal Family.AudioFile magazine comments: \"Professor Bucholz intertwines descriptions of court intrigue with portrayals of its effects on those governed, from the merchant to the tenant farmer to the beggar. Bucholz's lecturing style engages his students in the realities of the time with empathy, data, and humor. … The listener will find no dry history here, but a colorful album of real peoples' memories.\"",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Historical",
    "British Literature",
    "Medieval",
    "World History"
  ],
  "author": "Robert O. Bucholz",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/4897584-a-history-of-england-from-the-tudors-to-the-stuarts"
}