{
  "title": "The Silence And The Storm;Narratives Of Violence Against Women In India",
  "description": "From the rape of Mathura, a young tribal girl, by two policemen in Desaiganj, Maharashtra, in 1972, to the brutal sexual assault and murder of an eight-year-old girl in Kathua, Kashmir, in 2018, the narrative around violence against women in India has barely changed. While laws have been reformed, societal structures that perpetuate and even justify this violence have remained the same over the decades.Kalpana Sharma, who has written on gender issues for over thirty years, goes deep into the subject in The Silence and the Storm. She argues that violence against women is not restricted to sexual assault, rape, domestic violence and child sexual abuse. What of the violence that developmental policy and environmental destruction wreaks on women—on their health, on their workload, on their mobility? Poor women lose their lands, their livelihoods and access to common resources like forests and rivers. Their daily lives, already burdened, become close to unbearable. There is also the violence in which women are often collateral damage. In conflict zones, men take up arms on behalf of the state or an ideology but the cost is not just loss of life on both sides, but also the trauma inflicted on women caught in the middle. Sexual violence against women in India is also inevitably linked with the kind of politics that dominates today—sectarian politics that feeds on, breeds, encourages, and inflames societal divisions. And, as always, in the battle between warring groups, women pay the price.In her book, Sharma provides the necessary perspective to understand violence against women in India in the larger context of the politics and economics of the country. Her passionate, empathetic and cogently argued account deepens our understanding of the violence that Indian women have had to endure for decades.",
  "genres": [
    "Nonfiction",
    "India",
    "Womens"
  ],
  "author": "Kalpana Sharma",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/48980752-the-silence-and-the-storm-narratives-of-violence-against-women-in-india"
}