{
  "title": "Infinitum",
  "description": "Sure to become a treasured collectible, a gorgeous, groundbreaking, full-color Afrofuturist graphic novel that captures the spirit of the record-breaking film Black Panther and its mantra “Wakanda Forever.”Afrofuturism, a cultural movement that began in the early 20th Century as an escape from racial hostility, economic turmoil, and aggressive policing in black communities, is enjoying a renaissance witnessed by the record-breaking success of creative projects, including the acclaimed, award-winning film, Black Panther; Janelle Monae’s hit album, Dirty Computer; Jordan Peele’s provocative feature Get Out; Octavia Butler’s famed science fiction novel, Kindred; and Solange Knowles’ sundial headdress. Now comes Tim Fielder’s compelling, beautifully rendered graphic novel, INFINITUM.In INFINITUM, King AjA Oba and Queen Lewa are revered across the African continent for their impressive political and military skills. Yet the future of their kingdom is in jeopardy, for the royal couple do not have an heir of their own. When the King kidnaps his son born to a concubine, Obinrin, she curses AjA with the “gift” of immortality. After enjoying long, wonderful lives both, Queen Lewa and the crown prince die naturally, leaving the ageless bereaved King AjA heartbroken and alone. Taking advantage of AjA’s vulnerability, enemy nations  rise to power and kill the king – or so they think.  King AjA Oba survives the fatal attack, finally realizing the bitter fruit of Obinrin’s curse.For decades, the immortal AjA wanders the world, mourning his lost subjects and searching for a new kingdom. His journey leads him across time, allowing him to witness the trans-Atlantic slave trade, the New World, and the American Civil Rights Movement. The expansion of global technology brings about intergalactic travel, first contact with an alien species, and conflicts within and ultimately outside the known universe. Thrust into these seminal events, AjA, now known by many as “John,” faces harrowing decisions that will determine mankind’s physical and spiritual trajectory.In 260 stunningly, emotionally evocative full-color images, INFINITUM presents a unique cosmic experience, addressing pressing issues of racism, classism, gender inequality, the encroachment of technology and the spiritual cost of war , while exposing the history behind ancient mysteries, including Olmec heads and Maroon societies.",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Comics",
    "Science Fiction",
    "Fiction",
    "Graphic Novels Comics",
    "African American"
  ],
  "author": "Tim  Fielder",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/48982562-infinitum"
}