{
  "title": "Demi-Tasse and Mrs. Grundy",
  "description": "A biography and collection of stories from 1924-1927 of writer Josephine Van De Grift, columnist for the Akron Beacon Journal and reporter for the Newspaper Enterprise Association. A well-loved writer in her day, Josephine Van De Grift, later known as Mrs. William Rigby, began her writing career early in her teen years. Her play \"The Lonely Road\" won her a coveted spot in Dr. Pierce Baker's Harvard 47 Workshop in New York. While in New York, she went undercover to report on her findings of \"getting on the stage of New York\" (Broadway) under the guise of a pseudonym. While in New York, she worked for the Newspaper Enterprise Association (N.E.A.). She interviewed well-known celebrities of the era including authors including Richard Atwater (Mr. Poppers Penguins) and Dorothy Parker (and the Algonquin Round Table), actors including Will Rogers, philanthropists, Broadway chorus girls, sports heroes, circus performers and many more. Additionally, she joined the Blue Pencil Club, an elite literary society of only a handful of members the same year as author H.P. Lovecraft.Her column \"Demi-Tasse and Mrs. Grundy\" won praise from her readers nationwide. She went on to become a successful society page editor for the Akron Beacon Journal in Akron, Ohio between 1924-1927, when she passed away suddenly at the age of 33 after childbirth complications. Her passing devastated her readers. Her followers begged her husband Bill to one day make a book of all her stories, but none was ever made – until now. Almost a century later, her great-granddaughter, Kristin (née Carter) Groulx, also a writer, historian and genealogist, has taken the time to thumb through saved newspaper clippings and put them to paper in one book for Josephine’s beloved readers to see and remember her by.",
  "genres": [
    "Biography"
  ],
  "author": "Kristin Carter-Groulx",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/49000142-demi-tasse-and-mrs-grundy"
}