{
  "title": "Narcissism: How to Stop Narcissistic Abuse, Heal Your Relationships, and Transform Your Life",
  "description": "Do you suspect that you have a narcissist in your life?\n\nIs someone draining your precious energy and making you feel crazy?\nTake back your power, discover what narcissism truly means, and get the tools you need to handle anyone on the narcissism spectrum.  No one likes to think that their friend, colleague, family member, or partner is a narcissist, but you can’t afford to remain in denial. Narcissists can’t form healthy, two-way relationships. For the sake of your mental health, you need to learn what makes a narcissist tick, how to identify them, and how to deal with their most obnoxious behaviors.  Perhaps you’ve turned to the internet to learn more about narcissism but soon felt overwhelmed by all the conflicting information out there. How can you separate fact from fiction?  In Narcissism: How to Stop Narcissistic Abuse, Heal Your Relationships, and Transform Your Life, you’ll learn everything you need to know about narcissism. You’ll equip yourself with the tools you need to stop narcissists in their tracks, build healthier relationships, and recover from narcissistic abuse. You’ll discover:   \n   The difference between normal and pathological narcissism \n  \n   The truth about narcissists, treatment options, and change \n  \n   The telltale signs you are dealing with a narcissist \n  \n   What narcissists look for in their victims \n  \n   How to stop yourself from being a magnet for narcissists \n  \n   How to handle narcissistic partners, parents, in-laws, colleagues, and friends \n  \n   And much, much more \n  \nNo one has to tolerate narcissism. By reading this book, you’ll gain the power to draw boundaries, stand up for yourself, and insist on respectful treatment.  Once you understand how narcissists operate, you’ll find it easy to spot them. Download this amazing guide today and get ready to start your new narcissist-free life!  Discover the Secrets That Will Protect You From Narcissists Forever Click the link below to view the book on Amazon!  https://amzn.to/2qSGlJK",
  "genres": [],
  "author": "Judy Dyer",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/49001246-narcissism"
}