{
  "title": "A Beautifully Foolish Endeavor",
  "description": "April May and the Carls are back in the much-anticipated sequel to Hank Green's #1 New York Times bestselling debut novel, An Absolutely Remarkable Thing.The Carls disappeared the same way they appeared, in an instant. While they were on Earth, they caused confusion and destruction without ever lifting a finger. Well, that’s not exactly true. Part of their maelstrom was the sudden viral fame and untimely death of April May: a young woman who stumbled into Carl’s path, giving them their name, becoming their advocate, and putting herself in the middle of an avalanche of conspiracy theories.  Months later, the world is as confused as ever. Andy has picked up April’s mantle of fame, speaking at conferences and online about the world post-Carl; Maya, ravaged by grief, begins to follow a string of mysteries that she is convinced will lead her to April; and Miranda infiltrates a new scientific operation . . . one that might have repercussions beyond anyone’s comprehension. As they each get further down their own paths, a series of clues arrive—mysterious books that seem to predict the future and control the actions of their readers; unexplained internet outages; and more—which seem to suggest April may be very much alive. In the midst of the gang's possible reunion is a growing force, something that wants to capture our consciousness and even control our reality. A Beautifully Foolish Endeavor is the bold and brilliant follow-up to An Absolutely Remarkable Thing. It’s a fast-paced adventure that is also a biting social commentary, asking hard, urgent questions. How will we live online? What powers over our lives are we giving away for free? Who has the right to change the world forever? And how do we find comfort in an increasingly isolated world?",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "LGBT",
    "Young Adult",
    "Contemporary",
    "Adult"
  ],
  "author": "Hank Green",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/49003616-a-beautifully-foolish-endeavor"
}