{
  "title": "Bad Reputation",
  "description": "Carina He’s pretending to be my fiancé, but what if I want this lie to become real? I was bullied by mean girls in high school. So when my best friend insists I travel home for our reunion, I balk. But then I think of hiring a hot escort as my fake fiancé. That will sure improve my reputation. Plus it’ll make everyone jealous and be my perfect revenge. I knew that escorts had to be handsome. But I didn’t think the one I hired would be so charming. Leo is the perfect man, from his tall, muscular body to his sense of humor. But he isn’t really mine. We’re from two different coasts. And it feels like we’re from two different worlds. But when he really gets into the role by kissing me, our lips fit together perfectly. This could never work out. Or could it? Each kiss he gives me starts to make our romance seem more real. Leo It’s just a job, but all I can think about is working her over. I used to be a player. But after having to work as an escort, I’m taking a new approach to dating. That is, I don’t really plan to date at all. It’s not like escorts have the best reputation. But all that changes when I meet Carina. Curvy and pretty, she is the perfect girl next door. But the problem is that she is my client, even if it is for just one night. It’s bad to mix business with pleasure, but I just can’t resist. Especially after I kiss her lips. What starts out as just pretend, turns into an obsession. One night of feeling her body pressed against mine is not enough. Soon I’m coming up with more reasons to continue this façade. Free of charge. Why can’t I get her out of my system? Could this pretend relationship last forever? Bad Reputation is a full length standalone fake fiancé steamy romance novel. This is a \"safe\" read, with absolutely no cheating at all and both characters being gaga for each other and no one else as soon as they meet. It is the first book in the Too Bad It's Fake series of standalone books with connected characters and shared world that can be read separately or binge-read altogether for maximum enjoyment. Jamie Knight promises to always bring you a happy ever after filled with plenty of heat. And never any cheating or cliffhangers!",
  "genres": [
    "Romance",
    "Novella"
  ],
  "author": "Jamie Knight",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/48995954-bad-reputation"
}