{
  "title": "The Man Who Emptied Death Row: Governor George Ryan and the Politics of Crime",
  "description": "George H. Ryan, Illinois governor from 1999 to 2003, became nationally known for two significant and very different reasons. The first governor in the United States to clear out his state’s death row and put a moratorium on the death penalty, he was also convicted and sent to prison on corruption charges. The Man Who Emptied Death Row: Governor George Ryan and the Politics of Crime details the career of a man who both enhanced and tarnished the image of the highest office in Illinois and examines the political history and culture that shaped him.Author James L. Merriner explores the two very different stories of George Ryan: the brave crusader against the death penalty and the petty crook. An extensive analysis of the official record, exclusive interviews, and previously undisclosed incidents in Ryan’s career expose why the governor pardoned or commuted the sentences of all 171 prisoners on Illinois’s death row before leaving office and how he later was convicted of eighteen counts of official corruption.This biography traces Ryan’s family history and the Illinois political climate that influenced his development as a politician. Although Ryan championed good-government” initiativesorgan donations, tougher drunken-driving and lobbyist disclosure lawshe never overcame a reputation as a wheeler-dealer, notes Merriner.Merriner goes beyond Ryan’s life and career to explore the politics of crime, highlighting the successes and failures of the criminal justice system and suggesting how both white-collar fraud and violent crime shape politics. A fascinating story that reveals much about the way Illinois politics works, The Man Who Emptied Death Row will help determine how history will judge Illinois governor George Ryan.",
  "genres": [],
  "author": "James L. Merriner MA",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/4900646-the-man-who-emptied-death-row"
}