{
  "title": "The Order Anthology",
  "description": "All three books in The Order Series in one convenient package! Enter a world of secret societies, sensuality, and scandal...Bloom (The Order, 1):When she was sold at the age of nine to a Suitor, Fawn believed he would protect her from the “Mainworld”, where those who know nothing about the Order dwell. Living with the cruel man who bought her freedom, she finds just what the Order is about: money, control, and status for the Owner and humiliation and abuse for those they own.Unwilling to accept the expectations of being Owned, Fawn goes from golden girl to maid, content to live in the shadows of the Order as long as she isn’t Owned again.It’s been ten years since she disgraced her former Owner’s name, and now the brooding Frenchman Elliot Lyon wants her. Master Lyon is kind, smart, and unlike any man she’s met. She doesn’t want to admit it to herself, but Fawn is drawn to him despite constantly planning her next escape.Even the prettiest flowers have thorns, and Master Lyon is hiding secrets that will uproot everything she thinks she knows about him.Wilt (The Order, 2):When she was sold to Master Elliot Lyon of House Chimera, Fawn could have never imagined he was the same person as Elliot, the man beneath a well placed mask. A victim. Just like her. She would have never thought he was grooming her for the Wolf she’d already escaped once. That he planned to deliver her to the beast’s jaws in exchange for his wife. Master Jäger will stop at nothing to have her—even if that means using others as collateral. With more than just their lives on the line, Fawn must become someone else, and Master Lyon distances himself further from Elliot as her transfer looms.The roots of the Order run deep within them, but Fawn is beginning to realize another bond has formed between her and her Owner, a man she vowed to destroy along with the rest of their tangled branches.In a world where trust is just a tool and love isn’t meant for people like them, Fawn is determined to beat the powerful at their own elaborate games of make-believe. Even the man who Owns her.Chrysalis (The Order, 3):After Wolf Manor, Fawn vowed to never be weak, broken, or scared again. She has wrenched her power from the Vultures, visiting them under the cover of darkness to deliver the same drug they’d given her. This version has a different side effect: death.It doesn’t stop the nightmares, it can’t erase what happened, but revenge is the only distraction from Lyon Estate. Tucked in the wilderness, she draws back into herself until Master Lyon demands they make good on their deal. In order to continue her vengeance, he is to be her Owner—really this time.While it is a small sacrifice to make, Fawn isn’t prepared to be pulled back into Elliot’s world, where the rules of the Order exist, but in a new way. Running from him sends her into the arms of others in House Chimera. People who should be off limits, but they also stir something within her wholly different than the emotions Master Lyon can conjure. Marius is patient, and she finds herself clinging to him more now than ever before. People like them don’t believe in love, but can they choose it?Fawn is no longer the prey, but beyond the trees, a lone Wolf is hunting…",
  "genres": [],
  "author": "Nikki Rae",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/49004127-the-order-anthology"
}