{
  "title": "The Brideship Wife",
  "description": "Inspired by the history of the British “brideships,” this captivating historical debut tells the story of one woman’s coming of age and search for independence—for readers of Pam Jenoff's The Orphan's Tale and Armando Lucas Correa’s The German Girl. Tomorrow we would dock in Victoria on the northwest coast of North America, about as far away from my home as I could imagine. Like pebbles tossed upon the beach, we would scatter, trying to make our way as best as we could. Most of us would marry; some would not. England, 1862. Charlotte is somewhat of a wallflower. Shy and bookish, she knows her duty is to marry, but with no dowry, she has little choice in the matter. She can’t continue to live off the generosity of her sister Harriet and her wealthy brother-in-law, Charles, whose political aspirations dictate that she make an advantageous match. When Harriet hosts a grand party, Charlotte is charged with winning the affections of one of Charles’s colleagues, but before the night is over, her reputation—her one thing of value—is at risk. In the days that follow, rumours begin to swirl. Soon Charles’s standing in society is threatened and all that Charlotte has held dear is jeopardized, even Harriet, and Charlotte is forced to leave everything she has ever known in England and embark on a treacherous voyage to the New World. From the rigid social circles of Victorian England to the lawless lands bursting with gold in British Columbia’s Cariboo, The Brideship Wife takes readers on a mesmerizing journey through a time of great change. Based on a forgotten chapter in history, this is a sparkling debut about the pricelessness of freedom and the courage it takes to follow your heart.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Canada",
    "Romance",
    "Fiction",
    "Book Club",
    "19th Century"
  ],
  "author": "Leslie     Howard",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/48992813-the-brideship-wife"
}