{
  "title": "Panipat",
  "description": "Panipat, Vishwas Patil's first literary work, takes a look at the third battle of Panipat, which took place on January 14, 1761. It presents the historical battle that progressed between the Maratha army and the army of Ahmad Shah Abdali, the founder of the Afghan Empire.The book initially follows the battle that takes place between the army of Najib-ud-Daulah, an ethnic Pashtun, and the Scindias. It then proceeds to cover the northward progress of the massive Maratha forces to counter the threat of Najib-ud-Daulah. Eventually, the Maratha infantry and cavalry succeed in entering the Mughal stronghold of Panipat. Here, they are surrounded by a huge force of Shia Muslim and Afghan soldiers who block their source of ration. The resulting frustration and malnutrition takes its toll on the Maratha army.The book speaks of the valiant efforts of men like Jankoji Shinde, Nanasaheb Peshwa, and many other Maratha compatriots. The author has also countered the common negative portrayal of Sadashivrao Bhau, one of the Maratha leaders, with strong appreciation of his war tactics.The book highlights the myriad experiences that cast their shadows on the battleground, including bloodshed, depression, disease, desolation, martyrdom, betrayal, death, fear, victory, loss, hatred, ignorance, and vengeance.It also focuses on certain key points pertaining to India as a federal nation. Some of these points include the role of religion, the battle for supremacy between the North and the South, the detrimental influence of regional politics, the role of language, and the importance of unity. At the end of the book, the author has provided insights into his research efforts, which included several trips to Panipat. Panipat was originally written in Marathi and first published on October 20, 1988. Since then, it been translated to English and several other Indian languages, including Hindi. Panipat has received thirty-eight awards since its release in 1988, and sold more than 200,000 copies.",
  "genres": [
    "Marathi",
    "History",
    "Historical",
    "Nonfiction",
    "War",
    "Indian Literature",
    "India"
  ],
  "author": "Vishwas Patil",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/48994847-panipat"
}