{
  "title": "East Coast Girls",
  "description": "Four friends reunite in Montauk to celebrate their thirtieth birthdays, twelve years after one fateful summer, in this novel of friendship and secrets.Childhood friends Hannah, Maya, Blue and Renee share a bond that feels more like family. Growing up, they had difficult home lives, and the summers they spent together in Montauk were the happiest memories they ever made. Then, the summer after graduation, one terrible night changed everything.Twelve years have passed since that fateful incident, and their sisterhood has drifted apart, each woman haunted by her own lost innocence. But just as they reunite in Montauk for one last summer escape, hoping to find happiness once more, tragedy strikes again. This time it’ll test them like never before, forcing them to confront decisions they’ve each had to live with and old secrets that refuse to stay buried.“Masterfully drawn characters who feel like family. . . . Pitch-perfect pacing and language reveals all the right pieces at just the right moments and the idyllic Montauk setting is skillfully depicted. Kletter will be an author to watch for fans of Elin Hilderbrand and Emily Giffin.” — Booklist“A mix of gorgeous writing and page-turning suspense as four friends enjoy summer pleasures that lead to terrible mistakes, desperate choices, and, as we all hope from the ones we love, the grace of forgiveness.” —Nancy Thayer, New York Times –bestselling author of Surfside Sisters“Lush prose and poignant reflections on fate, forks in the road and the power of female friendships. . . . I’ve already made a permanent place for it right beside Judy Blume’s Summer Sisters in the bookshelf of my heart.” —Chandler Baker, New York Times– bestselling author of Whisper Network",
  "genres": [
    "Fiction",
    "Contemporary",
    "Chick Lit",
    "Audiobook",
    "Adult",
    "Historical Fiction",
    "Book Club"
  ],
  "author": "Kerry Kletter",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/48995369-east-coast-girls"
}