{
  "title": "Wicked Souls",
  "description": "Something Wicked this way comes. Don’t miss it!  Dark delights. Wicked spells. Damned souls and spirits seeking revenge. On All Hallows’ Eve when the veil is thin, all manner of wicked souls come out to play.  Denizens of night dance in a frenzy. Stolen hearts beat like the pounding of a thousand drums. The rhythm of love vies with the rhyme of magic and the melody of mischief.  Do you want to join in?  Get your copy today and devour these reverse harem romance stories by today's New York Times and USA Today bestselling and hot new authors. They'll shake your soul, rattle your heart, and satisfy your darkest desires.  In the darkness lie all things tantalizing, enthralling, and even wicked. Come see what others sold their soul to gain. This collection will take you by the hand and hold you in its grip deep into the night. Every story will leave you breathless and wanting more.  But beware, once you turn the page, you'll never want to stop.  Join demons, devils, shifters, witches, wayward souls and more in these amazing reverse harem romances, where no one gets left out.  Why choose when you can have it all?  40+ reverse harem romances to tempt your dark side.1.\tHer Masks by Rebecca Royce & Ripley Proserpina2.\tTricked by Mila Young3.\tTrue Monsters by May Dawson & Lacey Carter Anderson4.\tThieves of Fate by Ophelia Bell5.\tFrightful Beginnings by C.R. Jane6.\tResting Witch Face by Skyler Andra7.\tHer Curse by Katherine Bogle8.\tAwaken by Monica Corwin9.\tHer Wolves by Margo Bond Collins10.\tReaper Reborn by Serenity Ackles11.\tStealing Magic by Maggie Alabaster12.\tCatrina by Tiegan Clyne13.\tEverwood Academy by J.E. Cluney14.\tSomething Wicked by Caia Daniels15.\tMillwood Academy - The Beginning by Tanya Dawson16.\tIdol Threats by J.S. Lee17.\tThe Devil’s Lantern by Niobe Marsh18.\tA Hunter’s Moon by Dana Lyons19.\tDemon Stalked by Ann Denton & Katie May20.\tThe Lost and the Hunted by Grace McGinty21.\tTo Creepy with Love by Morgan Jane Mitchell22.\tWitching Hour: The Stroke of Three by A.J. Mullican & Elle Ryan23.\tReaper’s Last Homecoming by Bee Murray24.\tThe Dragonshadow Princess by K.M. McKenna25.\tA Weekend to Remember by Eden Rose26.\tBloody Halloween by Anna Santos27.\tAlpha Magic by Amelia Shaw28.\tHer Protectors by Faith Summers29.\tRoots and Gerunds by Edeline Wrigh",
  "genres": [],
  "author": "Rebecca Royce",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/49008322-wicked-souls"
}