{
  "title": "Without Expiration: A Personal Anthology",
  "description": "“Are we bad people who sometimes do good things, or good people who do bad things?”  As society struggles to reconcile the uncovering of past wrongs with simple human frailty, punishment and personal redemption, the stories in Without Expiration challenge us to consider the humanity of characters who are flawed and heartbroken and who do and suffer terrible things. Works from Without Expiration have been published in some of America’s best short fiction journals. From the tale of a devastated father hunting his daughter’s killer to that of a couple forced to confront the disintegration of their marriage anew each time the wife awakes from a persistent vegetative state, the short fictions in this anthology seek to obliterate any sense of righteous indignation and to question how any of us can make it unscathed through a life where our every mistake is without expiration.  “Hincy doesn’t hold your hand while he tells you a story—he leads you to the darkest hour, the deepest secret, the saddest truth, and leaves you holding the consequences. While one story is funny and filled with ludicrous-but-adorable characters, the next is stark, real, and unsettling. You may need a moment to recuperate between stories, but it’s well worth it. This is short story telling at its finest.” — Connie Kuntz, editor The Rockford Review  “Deft, poignant, and unflinching, this collection takes the short story form and turns it inside-out like yesterday's lost sock. Not to be missed.” — Charles Hood, winner of the Kenneth Patchen Prize for Experimental Fiction  “In Without Expiration, William Hincy wields keen mastery of a dazzling variety of narrative styles and voices. Many of the stories in this collection are deeply poignant, with a recurring theme of loss, while others are told with a primal irreverence, exploring the substance of what is human and humane. Running throughout the range of short fiction in this volume are a love of language, a wry humor, and startling insights from an emerging author you need to know.” — Michael Craft, author of Inside Dumont: A Novel in Stories and fourteen other novels  “An exciting new voice in literary fiction. The stories in Without Expiration expertly walk the line between humor, social satire, and genuine human emotion.” — Adam Cushman, author of Cut  “William R. Hincy's short stories produce what Edgar Allan Poe described as a lasting ‘singular effect,’ which is the greatest gift a writer can deliver to the intelligent reader. Hincy’s stories reveal the wisdom, versatility, and human understanding of an author the world needs. Bravo!”  — T.D. Johnston, winner of the International Book Award for Friday Afternoon and Other Stories",
  "genres": [
    "Short Stories"
  ],
  "author": "William R. Hincy",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/49015068-without-expiration"
}