{
  "title": "The Boy Who Never Gave Up: St Yared’s Enlightenment Through Failure, in Amharic and English",
  "description": "Young Yared is not the best student. He fails so often that he considers giving up on school completely. But the failures and perseverance of a caterpillar inspire him to untangle his heart and return to his studies with purpose. Motivated by the beauty of church music, he developed a new way to write it that caught the ear of the emperor. His devotion to music and education elevated him from the streets of Axum to Sainthood, and his music is still considered sacred to the Ethiopian Orthodox Church. Side by side text in indigenous Ethiopian languages like Amharic, Tigrinya and Afaan Oromo support reading fluency. Beautiful illustrations by brilliant Ethiopian artist Daniel Getahun capture the style of ancient Ethiopian Civilization and the beauty of its people. Part of the Ready, Set, Go! series of bilingual early readers by Open Hearts Big Dreams, a nonprofit devoted to increasing Ethiopian literacy. Ready Set Go Books, an Open Hearts Big Dreams Project, is focused on increasing the literacy rate in Ethiopia through giving readers books with stories in their heart languages, full of colorful illustrations with Ethiopian settings and details. Profits from books sales will be used to create, print, and distribute more Ready Set Go Books to kids in Ethiopia, Africa’s second most populous country. Ethiopia’s population is 44% children, ages 0-14 (43 million out of 97 million total). Only 5.5% of children attend pre-school or kindergarten, and the adult literacy rate is 49%. Our books are based on wise Ethiopian sayings that often rhyme in Amharic. If an adult says the first half, many children can chant the second half. Sometimes the meaning of these sayings is clear. Sometimes it has to be puzzled out and argued over. But sayings and idioms and proverbs help people express truths and beliefs in unusual ways. Open Hearts Big Dreams Fund (OHBD) is a 501(3)(c) not for profit organization that believes the chance to dream big dreams should not depend on where in the world you are born. Our focus is to support nonprofit organizations and their programs that provide literacy, K-12 education, and leadership as well as that support the parents and communities where the kids live, in Ethiopia",
  "genres": [],
  "author": "Worku L. Mulat",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/49011923-the-boy-who-never-gave-up"
}