{
  "title": "Flac: A Narrative",
  "description": "Poised on the brink of mania, Flac attacks his life. Yet, paradoxically, \"Flac leads a prisoner's life in a jail that is himself.\" The perfect(ly imperfect) hero for a novel by a prominent Lacanian psychoanalyst. Who is Flac? He is a young man, a composite creature of fantasy and flesh, a monster and an infant, a word and a man. But what is Flac? He is the site of the battle between the subject and language-the word made flesh. He is a whirl of words and emotions, trapped in a body whose unending death torments and titillates him. Flac is a paradox who proves the truth of his own existence by defying and contradicting it. Wading through life along with Flac are his aunt, who seems to have stepped out of a Goya painting, his boundary-lacking mother, and a host of demonic little boys at a Catholic school. The overall effect of this ghoulishly delightful cast of characters is to make the reader feel a vertiginous excitement with the turning of every page. Serge Andre's powerful novel is \"one thousand percent autobiographical.\" That is, it is a distillation and multiplication of all the neuroses, psychoses, and desires that make up a creative consciousness. What is most captivating about the novel, however, is its way of seducing an audience with its hypnotic motions and bewitching systems of imagery. Andre plays with us, but plays an illicit and addictive game that does not end with the last word of his tale. FLAC is more than a novel; it is a threat and a challenge to the reader. It accuses the reader of misusing language, or using it mindlessly. André excoriates his \"You get drunk on long tirades, exhilarated at sequences of words that you line up in rival dynasties, listing their filiations, the procession of their descendants and collaterals. You lull yourself with your favorite litanies.\" Yet, at the same time, FLAC demonstrates that the truth of this accusation is the only reality there is.",
  "genres": [],
  "author": "Serge André",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/4902193-flac"
}