{
  "title": "Wild Cards: A novel by Stuart Stromin",
  "description": "All they needed for revenge was his mind, her body, and one lucky night in Vegas.  Two street hustlers seek payback from a vicious mobster on one explosive night in Las Vegas.  Now in their thirties, Lucky and Shannon have loved one another since they were teenage runaways. They have dipped their fingers in countless small time scams, specializing in the confidence trick, Follow the Lady, where an outside man pretends to conspire with the mark to cheat the inside man. To take on Steve, a connected nightclub owner, they have to play the long con, where so many things can go wrong. They are going to have to adapt and improvise, using every trick learned in a career of deception: sleights of hand, secret confederates, diversion, distraction, and seduction.  Shannon has been bloodied before by the mobster, and she will do anything for revenge. Lucky realizes that if they succeed, they will never have to be hungry for money again, which might be enough to keep the two of them together. They have had a stormy relationship over the years, but he has never stopped wanting her. He has to use all his skills to make sure she keeps her cool for the demands of her role. Using her feminine wiles, Shannon lures Steve to Las Vegas, and the hustlers engineer a confrontation between Lucky and Steve. Lucky challenges Steve to a unique duel: a heads-up one on one poker game of Texas Hold’Em.  The game is fixed. High above the lights of the Las Vegas Strip, in a glamorous penthouse suite, with false shuffles, corrupt hotel detectives, and a rigged deck, they manage to cheat the mobster out of two hundred and fifty thousand dollars.  It is mob money, however, and someone is going to have to pay the ultimate price.  In a taut narrative told in shifting points of view as the clock ticks through twelve volatile hours in Las Vegas, Wild Cards examines revenge, greed and duplicity in a fast-paced plot full of intrigue, twists and surprises.  After a life of crime, as he makes his desperate escape through the Mohave desert, Lucky finds transcendence and acceptance, and is filled with gratitude for the redemption which his lucky stars have delivered.",
  "genres": [],
  "author": "Stuart Stromin",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/49023476-wild-cards"
}