{
  "title": "The Abyssal Plain: The R'lyeh Cycle",
  "description": "With The Abyssal Plain, Holloway and Talley have managed to transform the Cthulhu Mythos into something with a more modern flavor, drawing not just from the well of cosmic horror, but from technothrillers, survival horror, and splatterpunk, with just a dash of the lost sensibilities of the shudder pulps. A cup full of tentacles mixed with existential nihilism and sprinkled with liberal quantities of gore, this is Lovecraftian horror with a bloody bent that few others have dared to explore. --Peter Rawlik, author of ReanimatorsThey called it the Event.The Event changed everything. The earthquakes came first, including the Big One, shattering the Pacific Rim and plunging the world into chaos. Then the seas came, the skies opened, and the never-ending rain began. But as bad as that was, there is something worse.The Rising has begun.A lone man who abandoned the world for his addictions searches a waterlogged Austin for something, anything to cling to. Little does he know that something else searches for him.In the Sonoran Desert, the downtrodden of the world search for a better life north of the border, only to see the desert become an ocean: an ocean that takes life and gives death.In the woods of Alabama, survivors escape to Fort Resistance, but soon discover that it isn't just the horrors of the deep places of the world that they need to fear; but rather a new and more deadly pestilence that has grown in their own ranks.In England, it's too late to fight, and all that's left is to survive. One man reaches for his own humanity, but what to do when humanity is an endangered species?And in the Pacific, He is rising.In The Abyssal Plain: The R'lyeh Cycle, authors William Holloway, Michelle Garza and Melissa Lason, Brett J. Talley, and Rich Hawkins have created a timely and uniquely modern reimagining of the Cthulhu Mythos.",
  "genres": [
    "Horror",
    "Fantasy",
    "Anthologies",
    "Short Stories",
    "Fiction",
    "Science Fiction",
    "Cthulhu Mythos"
  ],
  "author": "William  Holloway",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/49010966-the-abyssal-plain"
}