{
  "title": "The Cruel Prince / The Wicked King / The Queen of Nothing",
  "description": "Please Note That The Following Individual Books As Per Original ISBN Supplied Individually by Publisher and As Per Cover Image In this Listing shall be Dispatched Collectively :    The Folk of the Air Series 3 Books Collection Set By Holly Black  The Cruel Prince (The Folk of the Air)  One terrible morning, Jude and her sisters see their parents murdered in front of them. The terrifying assassin abducts all three girls to the world of Faerie, where Jude is installed in the royal court but mocked and tormented by the Faerie royalty for being mortal. As Jude grows older, she realises that she will need to take part in the dangerous deceptions of the fey to ever truly belong. But the stairway to power is fraught with shadows and betrayal. And looming over all is the infuriating, arrogant and charismatic Prince Cardan . .   The Wicked King (The Folk of the Air #2)  I have heard that for mortals, the feeling of falling in love is very like the feeling of fear. Jude has tricked Cardan onto the throne, binding him to her for a year and a day. But the new High King does everything in his power to humiliate and undermine her, even as his fascination with her remains undimmed. Meanwhile, a traitor in the court is scheming against her. Jude must fight for her life and the lives of those she loves, all while battling her own complicated feelings for Cardan.  The Queen of Nothing [Hardcover] (The Folk of the Air #3):  After being pronounced Queen of Faerie and then abruptly exiled by the Wicked King Cardan, Jude finds herself unmoored, the queen of nothing. She spends her time with Vivi and Oak, watching reality television, and doing odd jobs, including squaring up to a cannibalistic faerie.When her twin sister Taryn shows up asking a favour, Jude jumps at the chance to return to the Faerie world, even if it means facing Cardan, who she loves despite his betrayal.",
  "genres": [
    "Fantasy",
    "Romance",
    "Enemies To Lovers",
    "Young Adult",
    "Romantasy",
    "Fae",
    "Fiction"
  ],
  "author": "Holly Black",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/49017036-the-cruel-prince-the-wicked-king-the-queen-of-nothing"
}