{
  "title": "White Hot Light: Twenty-Five Years in Emergency Medicine",
  "description": "Another “pitch-perfect book of short essays” (New York Times Book Review) from the acclaimed author of Blood of Strangers, this one exploring the contemporary practice of medicine from the perspective of a doctor with 25 years of experience in the ER.In the late 1990s, a young physician in Albuquerque, New Mexico, published a stunning memoir of his experiences in the highly charged world of the ER. Presented in a series of powerful, poetic vignettes, The Blood of Strangers became an instant classic.Now, over two decades later, Dr. Frank Huyler delivers another dispatch from the trenches—this time from the perspective of middle age. In portraits visceral, haunting, sometimes surreal, Huyler reveals the gritty reality of medicine practiced on the razor’s edge between life and death.From the doomed, like the Iraq vet with a brain full of shrapnel, to the self-destructive, like the young woman who inserts a sewing needle into her heart, to the transcendent, like the homeless Navajo artist whose sketches charm the nurses, Huyler assembles a profound mosaic of human suffering and grace, complemented by episodes from his personal life: the hail that fell the night his wife gave birth, his drive through a snowstorm to see his father in a Colorado ER, the beautiful wedding of his childhood friend with terminal cancer. Melding hard-earned wisdom with a poet's crystalline vision, Huyler evokes the awesome burden of responsibility, the exhaustion, the relief of a costume disco nurse party, and those rare occasions when the confluence of luck and science yield, in the author’s words, “moments of breathtaking greatness.” White Hot Light offers an unforgettable portrait of a field that illuminates society at its most vulnerable, and its most elemental.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Medical",
    "Medicine",
    "Essays",
    "Biography",
    "Health"
  ],
  "author": "Frank Huyler",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/49046272-white-hot-light"
}