{
  "title": "Almost Human",
  "description": "In this paranormal fantasy, chapters alternate between a vampire and a young woman, as they join an ensemble cast to navigate difficulties and discoveries of desire; perils of zombies and vampires; and struggles with friendship, morality and... college.Vol. 1: Fatal Infatuation Felicity views going away to college as an opportunity to mature into a confident young woman, but her new beginning turns out to be more of an adventure than she bargains for when she finds that her school is plagued by vampires!...Cain is an elder vampire who displays quiet confidence even as he struggles to overcome sins of his past. Surprisingly, he found that in losing his life he gained his faith and a purpose...His mission: find the hostile vampires that inhabit this small college town, and educate them to live in peace with humans. Their leader, Sindy, is a wicked temptress who has set her sights on Felicity's new friend Ben. She will be difficult to control, but after meeting Felicity, Cain's most difficult task lies in controlling himself.  Vol. 2: Lost ReflectionsFelicity has helped her friends to escape the venomous vixen Sindy, but cannot divine the motives of Cain, the vampire who captured first her gratitude, and then her heart...She finds the historical account of Cain’s past enthralling and frightening. Now she must determine whether the addictive venom in Cain’s kiss is clouding her judgment, and if his thirst for her blood is a driving force too strong for their love to conquer...It’s difficult to contemplate such questions while under the attack of a vengeful vampire and his zombie slaves. Felicity’s heart has already been lost to Cain; will she lose her life as well?  Vol. 3: Evolving EcstasyThe relationship between Cain and Felicity has crested to a peak that leaves them unsure whether to step back from each other for safety, or jump into a future united in death...The venom of Cain’s bite could protect Felicity from hostile vampires, but it would give him a measure of psychic control over her as well. Would Felicity only accept becoming a vampire, due to his addictive venom, coupled with the foolishness of a young girl in love?...Perhaps there is a brighter future for her in the human world. Is Cain’s desire for Felicity’s love worth the loss of her life?",
  "genres": [
    "Paranormal",
    "Vampires",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Fiction"
  ],
  "author": "Melanie Nowak",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/4908510-almost-human"
}