{
  "title": "Bones and the Stellar Wind",
  "description": "What would have happened if Indiana Jones were a young woman? What would happen if markings on cave ceilings, turned out to be primitive paintings of exploding stars a billion miles from Earth?Young Amelia Branson was raised in a traditional home, taught to listen and accept her family’s teachings, no matter what. But she can’t (and won’t) accept these ideas at face value. Instead, she begins to question the origins of the universe and humanity. Even after tragedy strikes her family and leaves her with a crippling phobia, Amelia refuses to cease following what she believes is her destiny. She breaks from her background, determined to learn and experience the world and all it has to offer. In the Copper Canyon of Mexico, the combination of her her gymnastic talents, determination and independent spirit created access to a sacred site of the Rarámuri (Tarahumara), after being lost for 500 years. While studying at Yale, Amelia traveled to the Yucatan. While studying one of the remote Mayan archaeological sites, she was led to a previously unknown site. Here she found carvings and painted images that proved to be the basis of early Mayan culture. Returning to New Haven, she met Adler, an adventurous astrophysics professor and formed an unlikely alliance and romance.Adler began to suspect that the images of stars painted on the ceiling of that unknown site were more than just decoration, and in fact an early record of a supernova, an exploding star. Working with a team of astronomers, and physicists, they discover that these exploding stars have had a profound effect on humans.While doing research at Olduvai Gorge in East Africa, Amelia is assigned to investigate reports of an ancient village on the flanks of Mount Kilimanjaro. As an avid mountain climber, Adler is quick to join her on this adventure. He also uses this chance to place sensors on the mountain to help his team confirm their theories of the exploding stars. At the first site they visit, a group of terrorists are reported to be going in their direction to take hostages for ransom.In South Africa 100,000 years ago, a primitive bushman and his tribe witness one of those supernovae. Hraff is inspired to record this event, so sets out on his own adventure to find a cave where he can paint the likeness of the sky and exploding star.",
  "genres": [],
  "author": "Edwin Kraft",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/49087075-bones-and-the-stellar-wind"
}