{
  "title": "Hidden in the Shadows",
  "description": "The hidden village was meant to keep them safe, but the Nazis have found it… There’s no time to lose. Laura gathers the children and whispers to them to be brave. The smallest cowers in her arms as they hear the crack of gunshots outside. Laura knows they’ll have to run if they are to survive…Nazi-occupied Holland, 1943 : In a makeshift village in the middle of the woods, hiding from Nazi soldiers determined to find them, a beautiful young Jewish woman named Laura thought she was safe. By day she remained silent and out of sight, but as darkness fell, she began to fall in love with a resistance fighter named Wouter . Until everything changed, on the day the village was stormed…Desperate to protect the six small and terrified children in her care , Laura races towards the church spires of the nearest town in the distance and just manages to escape from the soldiers.Wouter is stuck on the other side of the village when the German officers start shooting. As he desperately scrambles through the dark, dense woodland, he has no idea whether Laura has made it out alive.Devastated that he hadn’t tried to save her, Wouter spends his days delivering food and transporting people to safety, determined to help those most in peril. But he never gives up hope of finding the woman he loves.Even when he hears the rumours about the Nazis cramming Jews onto cattle trains for deportation to brutal work camps, he can’t believe she’s gone forever. How could he live if Laura was amongst them? And if he does find her, will their love have survived the ravages of everything they’ve been through, together and apart?An utterly heartbreaking tale of love, betrayal and sacrifice, Hidden in the Shadows is perfect for fans of Fiona Valpy, The Nightingale and All the Light We Cannot See.Readers love Imogen ‘ Literally gave me shivers … Absolutely heartbreaking … Gripping … This one really got to me, I was in tears… Will stay with me for a very long time .’ Echoes in an Empty Room , ⭐⭐⭐⭐⭐‘ Unbelievable … Drop everything as you will not want to put this down .’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ Powerful, inspiring, heartbreaking … An inspiring story about the bravery and kindness of ordinary people… It had me in tears .’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ Heart-wrenching … My heart was in my mouth through some of it and tears for others.’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ I couldn’t put it down … I read it in a day … From the first chapter you are engaged with the characters and I even found myself warning them when they were due to be raided – OUT LOUD! ’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ Couldn’t put this book down … Have read a few historical fiction [books] about WWII but this one was the best. I was transported through time and space and felt as if I was right there .’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ Truly heartbreaking and emotional … Tear-jerking … Glued to the story… A page-turner and unputdownable, will make you cry till the end! ’ Tropical Girl Reads Books , ⭐⭐⭐⭐⭐‘ Absolutely captivated me from the first to the last page! … Heartbreaking … This five-star read needs to be top of your list – especially if you are a lover of historical fiction!’ NetGalley reviewer, ⭐⭐⭐⭐⭐‘ Wow! Where do I begin?… An inspirational read and one of hope… Loved it. ’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘A moving story of courage and betrayal … This is a rapid-paced, compelling story with masterful execution.’ Goodreads reviewer, ⭐⭐⭐⭐⭐",
  "genres": [
    "Historical Fiction",
    "Holocaust",
    "World War II"
  ],
  "author": "Imogen Matthews",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/49088719-hidden-in-the-shadows"
}