{
  "title": "Future Feeling",
  "description": "An embittered dog walker obsessed with a social media influencer inadvertently puts a curse a young man—and must adventure into mysterious dimension in order to save him—in this wildly inventive, delightfully subversive, genre-nonconforming debut novel about illusion, magic, technology, kinship, and the emergent future.The year is 20__, and Penfield R. Henderson is in a rut. When he’s not walking dogs for cash or responding to booty calls from his B-list celebrity hookup, he’s holed up in his dingy Bushwick apartment obsessing over holograms of Aiden Chase, a fellow trans man and influencer documenting his much smoother transition into picture-perfect masculinity on the Gram. After an IRL encounter with Aiden leaves Pen feeling especially resentful, Pen enlists his roommates, the Witch and the Stoner-Hacker, to put their respective talents to use in hexing Aiden. Together, they gain access to Aiden’s social media account and post a picture of Pen’s aloe plant, Alice, tied to a curse:Whosoever beholds the aloe will be pushed into the Shadowlands.When the hex accidentally bypasses Aiden, sending another young trans man named Blithe to the Shadowlands (the dreaded emotional landscape through which every trans person must journey to achieve true self-actualization), the Rhiz (the quasi-benevolent big brother agency overseeing all trans matters) orders Pen and Aiden to team up and retrieve him. The two trace Blithe to a dilapidated motel in California and bring him back to New York, where they try to coax Blithe to stop speaking only in code and awkwardly try to pass on what little trans wisdom they possess. As the trio makes its way in a world that includes pitless avocados and subway cars that change color based on occupants’ collective moods but still casts judgment on anyone not perfectly straight, Pen starts to learn that sometimes a family isn’t just the people who birthed you.Magnificently imagined, linguistically dazzling, and riotously fun, Future Feeling presents an alternate future in which advanced technology still can’t replace human connection but may give the trans community new ways to care for its own.",
  "genres": [
    "LGBT",
    "Queer",
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Transgender",
    "Adult"
  ],
  "author": "Joss Lake",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/49084873-future-feeling"
}