{
  "title": "Greta Thunberg (Volume 40)",
  "description": "In this book from the critically acclaimed, multimillion-copy best-selling Little People, BIG DREAMS series, discover the inspiring true story of Greta Thunberg, the environmental activist.When young Greta learned of the climate crisis, she stopped talking. She couldn't understand why people in power were not doing anything to save our Earth. One day she started protesting outside the Swedish Parliament, creating the 'School Strike for Climate'. Soon, lots more young people joined her in a global movement that shook adults and politicians alike.She had found her voice and uses it to inspire humans to action with her powerful \"No one is too small to make a difference.\" This inspiring book features stylish and quirky illustrations and extra facts at the back , including a biographical timeline with historical photos and a detailed profile of the climate activist's life.Little People, BIG DREAMS is a best-selling biography series for kids that explores the lives of outstanding people, from designers and artists to scientists and activists. All of them achieved incredible things, yet each began life as a child with a dream.This empowering series of books offers inspiring messages to children of all ages, in a range of formats. The board books are told in simple sentences, perfect for reading aloud to babies and toddlers. The hardcover and paperback versions present expanded stories for beginning readers. With rewritten text for older children, the treasuries each bring together a multitude of dreamers in a single volume. You can also collect a selection of the books by theme in boxed gift sets . Activity books and a journal provide even more ways to make the lives of these role models accessible to children. Inspire the next generation of outstanding people who will change the world with Little People, BIG DREAMS!",
  "genres": [
    "Nonfiction",
    "Picture Books",
    "Biography",
    "Childrens",
    "Environment",
    "History",
    "Nature"
  ],
  "author": "Mª Isabel Sánchez Vegara",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/49087769-greta-thunberg-volume-40"
}