{
  "title": "Evolving Ecstasy",
  "description": "***This is an epic saga, in which each book averages 145,000 words in length (the equivalent of 2 - 3 typical novels) ALMOST HUMAN ~ The First Trilogy In this paranormal fantasy, chapters alternate perspective between a vampire and a young woman, as they join an ensemble cast of characters to navigate difficulties of addiction and desire; perils of zombies and vampires; and struggles with abuse, morality and... college. Volume 3: Evolving Ecstasy The relationship between Cain and Felicity has crested to a peak that leaves them unsure whether to step back from each other for safety, or jump into a future united in death. Felicity is unlike any human Cain has known before. She treats him as an equal; a man worthy of friendship, respect and even… love. She embodies qualities of gentleness and loving trust that he has never found among his own kind. This makes her far more desirable to him than any creature of darkness could ever be. The venom of Cain’s bite could protect Felicity from hostile vampires, but it would give him a measure of psychic control over her as well. Would Felicity only accept becoming a vampire, due to his addictive venom, coupled with the foolishness of a young girl in love? Perhaps there is a brighter future for her in the human world. Is Cain’s desire for Felicity’s love worth the loss of her life? *ALMOST HUMAN is a series of successive trilogies, not stand-alone books. Each trilogy is self-contained enough to be read alone as a 3 book set, but the story unfolds chronologically, and the characters do continue from one trilogy to the next. Main storyline closure is in each 3rd book, but there are also story-ties leading from one trilogy to the next in the series. *For series updates and previews, MelanieNowak.com",
  "genres": [
    "Vampires",
    "Paranormal",
    "Urban Fantasy",
    "Fiction",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "Melanie Nowak",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/4908511-evolving-ecstasy"
}