{
  "title": "Unknown Universe",
  "description": "In the year 2193, the population of Earth was approximately twenty billion people. Before a silent, relentless killer stalked the population, leaving destruction and devastation in its wake. It had only one name, ‘Virus’ and it never slept, it never faltered and it never died.  From this killer there was nowhere to hide, there were no terrorists to blame, no environmental catastrophe to point a finger at. It killed without mercy or remorse. A deadly assassin with humanity as its target. Within seven years from the first sign of the ‘Virus’ it had wiped from the Earth, 38% of the population. Within the next seven years, the ‘virus’ mutated.  Despite all the best efforts of the remaining scientists, government agencies, researchers and doctors using everything at their disposal. The ‘virus’ ravaged the world. Taking life after life until the ‘virus’ mutated once more. Eventually it killed without discrimination. There was no cure and no way to stop it. As the years passed, speculations over the cause of the ‘virus’ were many.  Militant terrorists was a favorite theory, another was a plot by beings from outer space to take over the world. The most common belief was that an environmental experiment backfired. Of course, the most likely suspects for this were covert science government agencies that were experimenting in anti-gravity and hazardous space technology. As of this writing, none of these theories were ever proved.  Twenty-one years after the first sign of the emergence of the ‘Virus’ only one billion people remain on Earth. Predominately females. In essence, if the XY chromosome is not extinct, it is on the endangered list.  When the odds are stacked against her, can she survive and keep the people who depend on her not only safe from the virus but their own government who have sold them out to a race of interstellar species!  Can one woman make a difference in this world?  She can if her name is Peyton St. Hill, daughter to the stars. Touched by the Divine and given abilities far exceeding those of a Goddess. Peyton with her sisters and thousands of women will rescue the Jenersar Warriors from servitude and together they will escape Earth and reach for the stars, somehow...  Nine planets known as Maikonia. In the language of the Stars this means. Home! Created and shielded for just over two million years Maikonia awaits the Star Daughter and all she welcomes into her heart and on to her world.  In this first installment we follow the adventures of Peyton and her sisters as well as the Jenersar Warriors in leaving Earth and traveling to Maikonia.  Honestly, what can go wrong!",
  "genres": [
    "Romance"
  ],
  "author": "L.M. Lacee",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/49082281-unknown-universe"
}