{
  "title": "Wishes Fulfilled",
  "description": "This book is dedicated to your mastery of the art of realizing all your desires. The greatest gift you have been given is the gift of your imagination. Everything that now exists was once imagined. And everything that will ever exist must first be imagined.     Wishes Fulfilled  is designed to take you on a voyage of discovery, wherein you can begin to tap into the amazing manifesting powers that you possess within you and create a life in which all that you imagine for yourself becomes a present fact.     Dr. Wayne W. Dyer explores, for the first time, the region of your highest self; and definitively shows you how you can truly change your concept of yourself, embark upon a God-realized way of living, and fulfill the spiritual truth that with God all things are possible—and “all things” means that nothing is left out.     By practicing the specific technique for retraining your subconscious mind, you are encouraged to not only place into your imagination what you would like to manifest for yourself, but you are given the specifics for realigning your life so you can live out your highest calling and stay connected to your Source of being. From the lofty perspective of your highest self, you will learn how to train your imagination in a new way.     Your wishes—all of them—can indeed be fulfilled. By using your imagination and practicing the art of assuming the feeling of your wishes being fulfilled, and steadfastly refusing to allow any evidence of the outer world to distract you from your intentions, you will discover that you, by virtue of your spiritual awareness, possess the ability to become the person you were destined to be.     This book will help you See—with a capital S—that you are divine, and that you already possess an inner, invisible higher self that can and will guide you toward a mastery of the art of manifestation. You can attain this mastery through deliberate conscious control of your imagination!",
  "genres": [
    "Self Help",
    "Spirituality",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Inspirational",
    "Audiobook"
  ],
  "author": "Wayne W. Dyer",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/12489036-wishes-fulfilled"
}