{
  "title": "The \"Greene Shorts\" Incest Collection; Volume 1",
  "description": "Joyful, consensual incest is the theme in each of the six sizzling hot short stories in this volume of “Greene Shorts” short stories from erotica writer Esmeralda Greene. Five of these tales have been previously released individually, and one is all new, unavailable anywhere else. The stories are:1: \"Family Ties \" - Erica and Rob are a teenaged couple who love each other dearly, and they don't let the fact that they're brother and sister stand in the way of that love. Their parents accept their unusual relationship, though their mother is having second thoughts...2: \"The Go-Between\" - Mischievous, bisexual Evelyn learns that her boyfriend's mother has a secret desire for her own son. So Evelyn becomes a \"go-between,\" shuttling between the bedrooms of mother and son, teasing the mother with “gifts” from her son.3: \"My Sons and Lovers\" - Divorced, still young, and living on an isolated farm with two “gorgeous” teenage sons, a mother decides to act on the lustful desires she's been feeling for her boys. So she sets out to seduce each of her lucky sons in turn...4: \"Fathers and Daughters\" - Lester is a divorced father with a problem in the raising of his teenaged daughter: She's been trying to seduce him. He turns to his ex-wife for advice, but she confesses to her own happy experience with incest, and says, “Go for it!”5: \"Mom is Pregnant\" - Scott lusts after his sexy single mom, and when she becomes pregnant his feelings are only magnified as her body develops its voluptuous new curves. Soon, the passion between mother and son is enthusiastically consummated.6: \"Randy Grandpa\" - This story is available only in this volume! Recently widowed, Earl comes to live with his divorced daughter and his two teenaged granddaughters. Earl and his daughter are planning on rekindling the sexual relationship they've enjoyed in the past, but that raises the problem of how to broach the issue of their incestuous union with the girls. Unknown to them, the two sisters have their own joyful experience with incest...This is Esmeralda Greene's first collection of entirely incest-themed short stories. None of these stories have been released in a collection before.",
  "genres": [
    "Erotica",
    "Short Stories",
    "Menage"
  ],
  "author": "Esmeralda Greene",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/12488630-the-greene-shorts-incest-collection-volume-1"
}