{
  "title": "K-pop Confidential",
  "description": "In this novel about chasing big dreams, a Korean-American girl travels to Seoul in hopes of debuting in a girl group at the same K-pop company behind the most popular boy band on the planet.Candace Park knows a lot about playing a role. For most of her life, she's been playing the role of the quiet Korean girl who takes all AP classes and plays a classical instrument, keeping her dreams of stardom-and her obsession with SLK, K-pop's top boyband-to herself. She doesn't see how a regular girl like her could possibly become one of those K-pop goddesses she sees on YouTube. Even though she can sing. Like, really sing.So when Candace secretly enters a global audition held by SLK's music label, the last thing she expects is to actually get a coveted spot in their trainee program. And convincing her strict parents to let her to go is all but impossible ... although it's nothing compared to what comes next.Under the strict supervision of her instructors at the label's headquarters in Seoul, Candace must perfect her performance skills to within an inch of her life, learn to speak Korean fluently, and navigate the complex hierarchies of her fellow trainees, all while following the strict rules of the industry. Rule number one? NO DATING, which becomes impossible to follow when she meets a dreamy boy trainee. And in the all-out battle to debut, Candace is in danger of planting herself in the middle of a scandal lighting up the K-pop fandom around the world.If she doesn't have what it takes to become a perfect, hair-flipping K-pop idol, what will that mean for her family, who have sacrificed everything to give her the chance? And is a spot in the most hyped K-pop girl group of all time really worth risking her friendships, her future, and everything she believes in?",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Fiction",
    "Music",
    "Audiobook",
    "Asian Literature"
  ],
  "author": "Stephan  Lee",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/49090423-k-pop-confidential"
}