{
  "title": "The Riches of This Land: The Untold, True Story of America's Middle Class",
  "description": "A vivid character-driven narrative, fused with important new economic and political reporting and research, that busts the myths about middle class decline and points the way to its revival.For over a decade, Jim Tankersley has been on a journey to understand what the hell happened to the world's greatest middle-class success story -- the post-World-War-II boom that faded into decades of stagnation and frustration for American workers. In The Riches of This Land, Tankersley fuses the story of forgotten Americans-- struggling women and men who he met on his journey into the travails of the middle class-- with important new economic and political research, providing fresh understanding how to create a more widespread prosperity. He begins by unraveling the real mystery of the American economy since the 1970s - not where did the jobs go, but why haven't new and better ones been created to replace them.His analysis begins with the revelation that women and minorities played a far more crucial role in building the post-war middle class than today's politicians typically acknowledge, and policies that have done nothing to address the structural shifts of the American economy have enabled a privileged few to capture nearly all the benefits of America's growing prosperity. Meanwhile, the \"angry white men of Ohio\" have been sold by Trump and his ilk a theory of the economy that is dangerously backward, one that pits them against immigrants, minorities, and women who should be their allies.At the culmination of his journey, Tankersley lays out specific policy prescriptions and social undertakings that can begin moving the needle in the effort to make new and better jobs appear. By fostering an economy that opens new pathways for all workers to reach their full potential -- men and women, immigrant or native-born, regardless of race -- America can once again restore the upward flow of talent that can power growth and prosperity.",
  "genres": [
    "Economics",
    "Nonfiction",
    "History",
    "Politics",
    "Sociology",
    "Business",
    "Audiobook"
  ],
  "author": "Jim  Tankersley",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/49089793-the-riches-of-this-land"
}