{
  "title": "The Colours I See",
  "description": "Reader Ready Award Recommended Read 2021There’s nothing wrong with being different, it’s wrong that people think there is.And, in lots of ways, I am different. I’m too thin. My eyes are too dark. I breathe funny. I’m genius level smart... but I’d rather be an artist like Aunt Zelda was. Not that my parents like that much, since they’d rather I wasn’t 'wasting my potential'. But the thing is, I don’t just love art, I’m seriously good at it too. Maybe not as good as Aunt Zelda, but still really good; even if it’s not always easy to get everyone’s colours right.That’s one of my secrets you know. The colours I see around people. The ones that tell me what everyone’s feeling. Most people can’t see them. But I can. And, from the way Aunt Zelda painted, I’m pretty sure she could too. It’s another thing that makes me like her, and something else that makes me different. That makes me, me. And one I’m totally not above using to my advantage, because, lets face it, what else am I going to use the world’s lamest superpower for?There’s... another big secret I have. One which could get me into a lot of trouble if the wrong people found out. But it’s not like I planned on fancying him. I didn’t even realise I could fancy him till I already did. And there’s nothing wrong with me trying to find out if he fancies me back, is there? I mean, I have his colours right there, just begging for me to use them. So I should try to figure it out, shouldn’t I? Because... because I... I really want him to fancy me back, and then...But if he doesn’t, that’ll be okay. I mean, I’ll make myself okay with it. Because he’s one of my best friends, and... and I’d rather he was in my life than not. And if Aunt Zelda figured out ways to make it okay, then... then I know I can too. I just... really hope... I don’t have to.The Neva Aton CollectionFour boys who were made to be friends. Four stories with a bigger tale to tell.Sly, Zel, Jay and Arian. Four boys who meet by chance and circumstance, but the friendships they form feel more like fate. Brought together by their sense of humour. Kept together because of the genuine bond they have with each other. Each with their own story to tell.The Neva Aton Collection is a series of magical realism books which have been designed to be read in any order. Each story is able to stand alone, but when put together show the power the relationships around us can have on our lives.What are you waiting for? Grab your copy today!",
  "genres": [
    "Fiction",
    "Young Adult"
  ],
  "author": "Ila Golden",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/49091043-the-colours-i-see"
}