{
  "title": "This Is Herman Cain!: My Journey to the White House",
  "description": "Presidential hopeful, former CEO of Godfather’s Pizza, and rising star of the race for the 2012 Republican nomination answers his most-asked question: Who is Herman Cain?When Herman Cain speaks, people listen. When he debates, he wins.If you care about the future of America, you have heard of the down-to-earth political newcomer running for president, the straight-talking man of the people with blunt assessments of what America needs. Originally overlooked by mainstream politicos and media, Herman Cain is truly a candidate from “outside the Beltway,” but no longer one who is being ignored.BUT WHO IS HE?While Herman Cain has been the host of a popular conservative Atlanta-area radio talk show called The Herman Cain Show , a different name originally captured American interest. As CEO, Herman Cain transformed Godfather’s Pizza from a company teetering on the verge of bankruptcy into a household word. Cain—as those with an interest in commonsense solutions to political problems will remember—is also famous for using the language and logic of everyday business to expose the fallacies inherent in Clinton assumptions about “Hillarycare” during a 1994 televised town hall meeting.WHAT IS HIS STORY?Herman Cain’s rise is the embodiment of the American dream. His parents, Luther and Lenora Cain, made a living the only way black people could in the ’40s and ’50s. Luther held down three jobs, including being a chauffeur; Lenora cleaned houses. They had two big dreams: to buy a house and to see their sons graduate from college. With dedication and hard work, they made both these dreams come true. In this thrilling memoir, Herman Cain describes his past and present . . . and the future he is determined to create, a future that will put our country back on track. His message resonates because he describes the American reality, and his down-to-earth personal tale of hope and hard work is both unforgettable and inspirational.***What is it in my DNA that years ago prompted me to forgo the ease of cruise control and take on the enormous challenge of doing my part toward making America a better place for my granddaughter and the generations to come?Why do I, a son of the segregated South, refuse to think of myself as a “victim” of racism?What is it that motivates me to insist on defining my identity in terms of “ABC”—as being American first, black second, and Conservative third?Just who is Herman Cain? And how did I get this way?Just a hint: it may have had something to do with lessons learned from my parents, Lenora and Luther Cain, Jr.—From This Is Herman",
  "genres": [
    "Politics",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography"
  ],
  "author": "Herman Cain",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/12490867-this-is-herman-cain"
}