{
  "title": "A Killer Secret",
  "description": "Would you kill to keep a secret?That's the question haunting three people whose lives become inescapably intertwined by the secrets that define them and ultimately threaten to tear them apart.A disgraced professor, a disenchanted psychologist, and a deceitful patient are about to learn more than they expected about each other and themselves. Will their relationships survive their secrets? Will they?Everyone has secrets.Some are just darker than others.And some, well, they're worth killing to keep.Initial Reader \"Really enjoyed the book (in a twisted thriller kind of way). I was shocked multiple times and couldn't sleep for a few nights after reading the end.\"\"Just when I thought I had it figured out...BOOM, I was wrong!\"\"This book is definitely not for the faint of heart.\"\"Everything seems to follow the normal pattern of a suspense/thriller novel, until it absolutely doesn't!\"\"I was riveted to the story.\"\"So many twists and turns ... absolutely did not see that ending coming!\"\"Wow. I literally could not put this book down. I was shocked by the ending, and I want to read again just to make sense of it all.\"\"I was surprised of the ending and happy to see that there is room for a sequel possibly in the future. I highly recommend this book for an amazing thriller read that surprises the reader.\"\"Really great book. Can't recommend it enough. Keep in mind 1)you won't be able to put it down 2) you will need a friend to talk to about it.\"Excerpt from Midwest Book \"Jeff Berney knows how to craft a suspense story that is as compelling as any Alfred Hitchcock could have shaped. As events in multiple lives move forward in a chess match-style of intrigue, readers will not only find the story replete with surprises, but should be advised that if it's chosen for late night reading, dawn might arrive before the story's completed.\"",
  "genres": [],
  "author": "Jeff Berney",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/49107080-a-killer-secret"
}