{
  "title": "For the Love of a Boy",
  "description": "I was living in darkness. Cold and alone, I was gripped by the agony of loss and grieving for an existence I no longer believed I could have. Then he appeared in my life and I thought that maybe, just maybe, I’d been gifted with another chance at happiness. That I might be allowed the privilege of loving and caring for another man. That I could have my very own boy…A new beginning is more than Malcolm ever dared wish for.Now that Malcolm has claimed Seth as his boy, he’s determined to be the perfect Daddy for the man he adores. Whatever his boy needs, he’ll make sure he gets it. But more than that, he’s sworn in his heart to protect him with his life. Seth’s bastard of a father and the twisted church that abused his boy had better stay away from them—or else.Seth has discovered comfort and safety in his Daddy’s arms.Finally, Seth accepts that a life filled with joy is possible. He believes that love is what matters more than anything and that he has nothing to be ashamed of. However, the demons of his past still taunt him, lurking in the shadows of his mind where they try and snatch away his happiness. Sometimes it seems as if his lingering fears will never be vanquished. And sometimes, being afraid is a warning that should be heeded… For the Love of a Boy is the continuation of Malcolm and Seth's journey of love, redemption and healing in the Father series trilogy. The first book, In the Name of the Father, should be read prior to this one. However, you can be assured that none of the books in the Father series end on a cliffhanger and that this age gap, Daddy/boy series with lots of hurt/comfort contains a sweet forever after.Father Series reading In the Name of the FatherFor the Love of a BoyNow and ForeverT References to past child abuse, a scene of on-page violence.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Gay",
    "Abuse"
  ],
  "author": "Morticia Knight",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/49115965-for-the-love-of-a-boy"
}