{
  "title": "TO FORGE A KING: The Chronicles Of Ellorhim",
  "description": "If you enjoy epic fantasy or swords & sorcery then you will like this new series, the Chronicles of Ellorhim. This is an exciting new coming of age story with detailed world building and gritty action and fight scenes. The backstory has Norse or Scandinavian cultural and spiritual influences and overtones. What Amazon customers are saying about To Forge A \"This is probably the best new entry into a fantasy series which I have read over the past few years. Powerful, Rich, Entertaining and Captivating. From start to finish I was enthralled by the in-depth world building and superbly written characters.\" \"Not your Typical Coming of Age Story\" \"I took a chance and boy was I treated to a great book. This tale is excellent and I highly recommend it.\" Updated new version. His past was lost, only faded dreams and echoes of happier times remained. Sometimes he had a flash, a quick fleeting glimpse of a better place with friends, warmth and cheer below a silver sun in a twilight land. Those were rare though. Now, there is only the harsh brutal present, sweat stinging the eye and blood flowing from cracked bruised knuckles, a sword in his filthy callused hand and the hoarse shouts of the Sword Masters ringing in his ears. Exhaustion paints his partner's face like cheap mask. No doubt his own face looks just as bad. It is a never ending struggle, up before the sun, running, jumping, lifting and fighting, each day full of pain and injury. Training, always training, His country, Vesfalruk, needs warriors to defend their land and homes. And, this place makes the best warriors. There are none better with sword or ax in all the world. But there is a power and a sense of belonging in this place, this ancient Guild Hall and fortress lying in the shadow of the Eastern White Mountains. Being here comforts him in ways he does not understand and the cold winter winds are somehow less chill. His sword calls and he takes it up and trots out into the yard. Vesfalruk is a besieged place, an isolated mountainous land that has struggled against numerous foes and invaders, the Erhand. It is a land with a violent and bloody history and a kingdom without a king. There has been no king for over two-hundred years and relative peace, if it can be called that, has been the norm for most of that time. So trade flourishes, peace reigns and ancient traditions are openly questioned and sometimes mocked. Vesfalruk warriors are still renowned throughout Ellorhim and the Guild Halls continue to train them, against a rising popular opinion. Old enemies are stirring again, their armies gather, swelling and massing for another round of invasion and conquest. And, that is fine with him and it if the same for those he has grown up with in this Guild Hall. Let them come again. We will be ready. He vows this, to himself and to others.",
  "genres": [
    "Fantasy"
  ],
  "author": "Thomas Adams",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/49122016-to-forge-a-king"
}