{
  "title": "My Daddy Is a Hero: How Chris Watts Went from Family Man to Family Killer",
  "description": "A husband. A father. A killer. Chris Watts was a family man. Everybody, including his family, believed that. Yet, on August 13, 2018, he murdered Shanann, his pregnant wife, and two young daughters, burying Shanann and their unborn son in a shallow grave and dumping their daughters’ bodies in separate oil tanks. As terrible as his story is, it is also a warning because, to this day, living behind bars, Watts is still acting out the character traits that made him kill in the first place. In this, the first and only psychological exploration of the Watts family murders, psychotherapist Lena Derhally has pieced together the crime, the events leading to it, and most of all, her beliefs about the “why,” including the fact that Chris Watts—now a self-described “man of God”—is not in the least remorseful about killing his family. Using police discovery and other sources, Derhally recreates the night of the murders and the investigation that followed. She explores the childhoods, families of origin, meeting, and early relationship of Shanann and Chris Watts. She also examines Watts’s double life and duplicity regarding his well-publicized affair with a co-worker, who, although she claimed their affair was casual, was searching online for wedding dresses at the time of the murders. The book includes an in-depth look at community psychopaths, the different subtypes of narcissism, how to prevent this type of violence, and interviews with a neuroscientist, a criminal psychologist, and a journalist in order to determine what in Watts's twisted makeup allowed him to hide who he really is for so long. Using her knowledge of attachment theory, Imago relationship theory, and psychopathology, Derhally draws a profile of the real Chris Watts and--just as important--she warns readers that he is still a danger today.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Psychology",
    "Mental Health",
    "Biography"
  ],
  "author": "Lena Derhally",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/49121932-my-daddy-is-a-hero"
}