{
  "title": "Dust: Season One",
  "description": "Blaise is a shifter collared from birth to keep her from her abilities. It's been her dream to get the collar off and vanish into the countryside. Working as a highly paid whore has gotten her close - she can almost taste it. Until her Mistress dies, and the new Master burns her contract. Now everything is gone, and Blaise has to fight just to keep herself out of his hands. \n\n Keepers are charged with keeping the peace amongst shifters, mages, and humans. The lower ranks spend their time collaring newborns and inspecting communities. But the higher ranks are on scene to investigate murders and hunt down criminals. Of these Keepers the Six Horsemen are an elite, high ranking, team, but to those who rule the kingdom, these six men are little more than instruments to do a job, and they're getting sick of it. \n\n\nWhen they're ordered to take in a whore, a calculated move to prevent Keepers from forming meaningful relationships that will impact their job performance, the Six Horsemen go looking for Blaise. But there's a pretty good chance she's going to be dead before they find her.\n\n\n\n\n Dust is season one of the Six Horsemen series and it is comprised of five individual episode style installments that fit perfectly back-to-back. Episode one was available for a limited time in the Land Of Nightmares anthology. Episodes two-four will be released one month apart as ARC's through Bookfunnel. Episode five is releasing here and only here for the first time in Dust. This season is more than 60k.  \n\n To join in the ARC process visit www.sixhorsemen.com \n\n\nSix Horsemen is an adult reverse harem. It is intended for an adult audience. It is a medium burn with a three rose rating in the relationship department, but every episode involves some panty-dropping. The series has a five rose rating in the trigger department. Episode one alone contains drug use, non-con, and physical abuse.\nThis series does contain m/m content, and there are plans for m/m/m/f/m/m/m at some stage.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Shapeshifters",
    "Paranormal"
  ],
  "author": "Amanda Cashure",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/49122785-dust"
}