{
  "title": "On Fascism",
  "description": "As featured on NPR's \"On Point\"\"The twelve lessons in On Fascism draws from American history and brilliantly complement those of Timothy Snyder’s On Tyranny .\"―Laurence TribeAn expert on American authoritarianism offers a searing rebuke of the exceptional narrative that dominates our understanding of US history. In 12 lessons, Matthew C. MacWilliams' On Fascism exposes the divisive rhetoric, strongman tactics, violent othering, and authoritarian attitudes that course through American history and compete with our egalitarian, democratic aspirations. Trumpism isn’t new, but rooted in our refusal to come to terms with this historical reality.The United States of Lyncherdom, as Mark Twain labeled America. Lincoln versus Douglas. The Chinese Exclusion Act. The Trail of Tears. The internment of Japanese-Americans. The Palmer Raids. McCarthyism. The Surveillance State. At turning points throughout history, as we aspired toward great things, we also witnessed the authoritarian impulse drive policy and win public support. Only by confronting and reconciling this past, can America move forward into a future rooted in the motto of our Republic since 1782: e pluribus unum (out of many, one).But this book isn’t simply an indictment. It is also a celebration of our spirit, perseverance, and commitment to the values at the heart of the American project. Along the way, we learn about many American heroes – like Ida B. Wells, who dedicated her life to documenting the horrors of lynching throughout the nation, or the young Jewish-American who took a beating for protesting a Nazi rally in New York City in 1939. Men and women who embodied the soaring, revolutionary proclamations set forth in the Declaration of Independence and the Preamble to the Constitution.On Fascism is both an honest reckoning and a call for reconciliation. Denial and division will not save the Republic, but coming to terms with our history might.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "Audiobook",
    "American",
    "Theory"
  ],
  "author": "Matthew C. Macwilliams",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/49127372-on-fascism"
}