{
  "title": "From Orphan to Highflyer",
  "description": "If you want to be grabbed and exposed to a theatre of The Second World War that many don’t know about in a gripping manner straight from a man who overcame a childhood filled with savage hardship to complete a tour of operations captaining Liberator aircraft against the Japanese at the young age of 20, then this book will take you on an unbelievable journey.My name is Philip Martin and I have been best friends with Denis for many years now, hearing many of his surreal stories during this time. However, being a private man, Denis was never one to openly talk about his horrific childhood or his fifteen years as a pilot dealing with enemy fire, engine explosions, engine fires, mechanical faults, passing out at the controls, vicious storms and much more, all while flying some of the most iconic aircraft around the world. Many of his stories were always locked away, unknown to you or anyone else. It was only after a severe illness and fall that almost killed Denis that the idea of writing his life story even occurred to me. Even then I expected him to say no, as he had done to similar offers in the past. But to me, these tantalising, gripping, death defying stories had to be told before they were lost forever. Fortunately he agreed and over the next year over many cups of tea, the jaw dropping stories that Denis had experienced through throughout his life came to the surface after decades of being locked away. Details and stories that are so unbelievable that they almost don’t seem real, and that isn’t even including his experiences during the War! Though the heroics of the RAF across western Europe are well known, the impact that the RAF had in the Far East is not. Many people have told me ‘I didn’t even know that the RAF had a presence in India and the Far East’. But now, you have the opportunity to read Denis’s life, in his exact words. Due to our close friendship and Denis’ razor sharp memory, his mesmerising stories are told with a candid honesty like never before. Stories The brutal aspect of many British schools that would land teachers and officials in jail today!Witnessing Spitfires and Hurricanes engage German Messerschmitts in the skies above Kent.How two cadets in Rhodesia ended up murdered and stuffed into termite mounds, and the repercussions that followed for the murderers.The nasty, ice cold instructor who almost killed Denis with his instructions and awful advice.The disappearance of a cadet in Palestine who was never seen again.Experiences of Jerusalem in 1944.Why Denis in a fit of rage pulled a gun on his best friends crew.The heroic, charismatic Commanding Officer who came up with seemingly impossible flights and led from the front!The operation that the Americans were convinced was impossible to do!Flying into vicious storms Seeing his friends and comrades get shot down.The one quick decision that saved them from certain peril And much, much more.On top of all this, Denis recalls his time flying in the Far East after the war, and all the drama that came with it. From nail biting stories like the miraculous landing Denis performed in a Dakota that resulted in a few passengers kissing the ground and later on, singing ‘he’s a jolly good fellow’ to more sombre stories like that of a friendly Malayan garage owner being murdered and Denis’ close call with armed men.You will also be given a fascinating insight into the role of the RAF during the first decade of the Cold War in the Mediterranean with detailed accounts of the exercises that Denis undertook while flying across the region, captaining an iconic Lancaster Bomber. All of this is wonderfully woven with personal stories which give it a beautiful human touch, stories which will have you shaking your head in amazement. So what are you waiting for, click here to order your copy today!",
  "genres": [],
  "author": "Denis Elliott",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/49129513-from-orphan-to-highflyer"
}