{
  "title": "Eli's Promise",
  "description": "A \"fixer\" in a Polish town during WWII, his betrayal of a Jewish family, and a search for justice 25 years later—by the winner of the National Jewish Book Award. Eli’s Promise is a masterful work of historical fiction spanning three eras—Nazi-occupied Poland, the American Zone of post-war Germany, and Chicago at the height of the Vietnam War, all tied together by a common thread. Award-winning author Ronald H. Balson explores the human cost of war, the mixed blessings of survival, and the enduring strength of family bonds.1939: Eli Rosen lives with his wife Esther and their young son in the Polish town of Lublin, where his family owns a construction company. As a consequence of the Nazi occupation, Eli’s company is Aryanized, appropriated and transferred to Maximilian Poleski—an unprincipled profiteer who peddles favors to Lublin’s subjugated residents, and who knows nothing at all of construction. An uneasy alliance is formed; Poleski will keep the Rosen family safe if Eli will manage the business. Will Poleski honor his promise or will their relationship end in betrayal and tragedy?1946: Eli resides with his son in a displaced persons camp in Allied occupied Germany hoping for a visa to America. His wife has been missing since the war. One man may know what has happened to her. Is he the same man who is now sneaking around the camps selling illegal visas?1965: Eli Rosen rents a room in Albany Park, Chicago. He is on a mission. With patience, cunning, and relentless focus, Eli navigates Chicago's unfamiliar streets and dangerous political backrooms, searching for the truth. Powerful and emotional, Eli’s Promise is a rich, rewarding novel of World War II and a husband’s quest for justice.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Holocaust",
    "Historical",
    "Jewish",
    "Audiobook"
  ],
  "author": "Ronald H. Balson",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/49127513-eli-s-promise"
}