{
  "title": "Losing the Long Game: The False Promise of Regime Change in the Middle East",
  "description": "One of Foreign Affairs' Best of Books of 2021 and \"Books For The Century\"!\"Book of the Week\" on Fareed Zakaria GPSFinancial Times Best Books of 2020The definitive account of how regime change in the Middle East has proven so tempting to American policymakers for decades―and why it always seems to go wrong.\"It's a first-rate work, intelligently analyzing a complex issue, and learning the right lessons from history.\"― Fareed ZakariaSince the end of World War II, the United States has set out to oust governments in the Middle East on an average of once per decade ― in places as diverse as Iran, Iraq, Afghanistan (twice), Egypt, Libya, and Syria. The reasons for these interventions have also been extremely diverse, and the methods by which the United States pursued regime change have likewise been highly varied, ranging from diplomatic pressure alone to outright military invasion and occupation. What is common to all the operations, however, is that they failed to achieve their ultimate goals, produced a range of unintended and even catastrophic consequences, carried heavy financial and human costs, and in many cases left the countries in question worse off than they were before.Philip H. Gordon's Losing the Long Game is a thorough and riveting look at the U.S. experience with regime change over the past seventy years, and an insider’s view on U.S. policymaking in the region at the highest levels. It is the story of repeated U.S. interventions in the region that always started out with high hopes and often the best of intentions, but never turned out well. No future discussion of U.S. policy in the Middle East will be complete without taking into account the lessons of the past, especially at a time of intense domestic polarization and reckoning with America's standing in world.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "International Relations",
    "Political Science",
    "Audiobook",
    "War"
  ],
  "author": "Philip H. Gordon",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/49127433-losing-the-long-game"
}