{
  "title": "2030: How Today's Biggest Trends Will Collide and Reshape the Future of Everything",
  "description": "Once upon a time, the world was neatly divided into prosperous and backward economies. Babies were plentiful, workers outnumbered retirees, and people aspiring towards the middle class yearned to own homes and cars. Companies didn't need to see any further than Europe and the United States to do well. Printed money was legal tender for all debts, public and private. We grew up learning how to \"play the game,\" and we expected the rules to remain the same as we took our first job, started a family, saw our children grow up, and went into retirement with our finances secure.That world—and those rules—are over.By 2030, a new reality will take hold, and before you know it:- There will be more grandparents than grandchildren- The middle-class in Asia and Sub-Saharan Africa will outnumber the US and Europe combined- The global economy will be driven by the non-Western consumer for the first time in modern history- There will be more global wealth owned by women than men- There will be more robots than workers- There will be more computers than human brains- There will be more currencies than countriesAll these trends, currently underway, will converge in the year 2030 and change everything you know about culture, the economy, and the world.According to Mauro F. Guillen, the only way to truly understand the global transformations underway—and their impacts—is to think laterally. That is, using “peripheral vision,” or approaching problems creatively and from unorthodox points of view. Rather than focusing on a single trend—climate-change or the rise of illiberal regimes, for example—Guillen encourages us to consider the dynamic inter-play between a range of forces that will converge on a single tipping point—2030—that will be, for better or worse, the point of no return.2030 is both a remarkable guide to the coming changes and an exercise in the power of “lateral thinking,” thereby revolutionizing the way you think about cataclysmic change and its consequences.",
  "genres": [
    "Nonfiction",
    "Business",
    "Economics",
    "Audiobook",
    "Politics",
    "Science",
    "Technology"
  ],
  "author": "Mauro F. Guillén",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/49127551-2030"
}