{
  "title": "For Men Only: A Straightforward Guide to the Inner Lives of Women",
  "description": "Finally—You Can Understand Her! Complicated and impossible to understand? Do you love and want to please the woman in your life, but just can’t seem to figure her out? That was before For Men Only . Now at your fingertips is the tool that will unlock the secret to her mysterious ways. Through hundreds of interviews and the results of a scientific national survey of women, this book demonstrates that women are actually not random and that they really can be systematized and “mapped.” In fact, much to men’s delight, this book shows that women are actually quite easy to understand and please—as long as you know what it is they need. This simple map will guide you to loving your wife or girlfriend in the way she needs to be loved.The bestselling author of For Women Only teams with her husband to offer men the key to unlocking the mysterious ways of women. Through Shaunti and Jeff Feldhahn ’s national scientific survey and hundreds of interviews, For Men Only reveals what you can do today to improve your relationship. And believe it or not, as Jeff assures men, “It’s not splitting the atom.”And for every guy who rarely reads a Quick-Start Guide Included!“When we featured Shaunti’s book For Women Only on FamilyLife Today , the phone rang off the hook! When Shaunti and Jeff come back on our broadcast, I’m buying some more phones. This is fresh and relevant—good stuff for every marriage. Read it!”-Dennis Rainey, President, FamilyLifeStory Behind the Book“As I was writing For Women Only to help women understand the inner lives of men, over and over I heard that men wished there was a way to understand their wives, but they felt it was probably impossible. I heard from them, ‘You are writing this little slim volume about men, but if it was about understanding women, it would have to be the size of an encyclopedia! Women are random and complicated!’ These men were surprised and encouraged when I assured them that women are neither random nor complicated, and we can be understood. Men just want to love their wives well, and For Men Only will help them do that.”—Shaunti Feldhahn",
  "genres": [
    "Marriage",
    "Relationships",
    "Nonfiction",
    "Christian",
    "Self Help",
    "Psychology",
    "Family"
  ],
  "author": "Shaunti Feldhahn",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/49149.For_Men_Only"
}