{
  "title": "Modern Family: The Untold Oral History of One of Television's Groundbreaking Sitcoms",
  "description": "An oral history, with the full participation of cast and crew, of one of the most popular sitcoms in television history.Since premiering in 2009, the groundbreaking television sitcom Modern Family has garnered tens of millions of devoted fans, earning 75 Emmy nominations and 22 Emmy Awards, including five in a row for Outstanding Comedy Series (one of only two sitcoms to ever achieve that feat). Professors have written about it. Psychologists have lectured on it. Leading publications, such as The New York Times and Washington Post, have explained their love for it. With funny, heartfelt and relatable stories about family, Modern Family has gained a worldwide following of hundreds of millions of viewers in countries as diverse as England, Israel, The Netherlands, Germany, and South Africa.As much as people love the show, few know the stories behind it. How did a kernel of an idea by Emmy-winning writers Steve Levitan and Chris Lloyd morph into a television juggernaut? Where did they find the cast? How did they come up with story ideas and film favorite episodes? What went on behind the scenes? Up until now, there have been individual stories and interviews about the show, but nothing comprehensive that captures the complete story of the series.Marc Freeman's Modern Family: The Untold Oral History of One of Television's Groundbreaking Sitcoms is the only major book ever written that explores this show as told by those who created it. More than seventy people, including the entire cast, crew, and creators, detail the full history of this iconic sitcom. The cast recalls their memories of the trials and tribulations of casting. They share their impressions from the first table read through the last light turning out. Writers, directors, and performers walk readers through storylines, production and favorite episodes. Guest stars such as Elizabeth Banks, Josh Gad, Adam Devine, Matthew Broderick and Nathan Lane recall their appearances on the show while others recount their experiences working with Kevin Hart, Barbara Streisand, Ed Norton and more. Readers get to go behind the scenes and experience the show like never before, including personal photos. They’ll also discover the never-told fallout and divorce of the two showrunners, making the show two separate series blended into one. Even people unfamiliar with the show will gain deep insight into what it takes to put a series on television.Typically, oral histories come out as retrospectives, based entirely on recall. This one will have the benefit of having the ending occur in real-time. From script development to final season (the 11th season will be the show's last) readers will get a glimpse of the cast’s relationships with each other and the emotions attached to saying goodbye to the best and longest-running workplace many of them expect to ever experience. Much like the series itself, this book shares a story of family, of conflict and collaboration, that went into this timeless, groundbreaking series.",
  "genres": [
    "Nonfiction",
    "Pop Culture",
    "Audiobook",
    "Tv",
    "Biography",
    "Adult",
    "History"
  ],
  "author": "Marc   Freeman",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/49127550-modern-family"
}