{
  "title": "Anxious People",
  "description": "A poignant, charming novel about a crime that never took place, a would-be bank robber who disappears into thin air, and eight extremely anxious strangers who find they have more in common than they ever imaginedLooking at real estate isn't usually a life-or-death situation, but an apartment open house becomes just that when a failed bank robber bursts in and takes a group of strangers hostage. The captives include a recently retired couple who relentlessly hunt down fixer-uppers to avoid the painful truth that they can't fix up their own marriage. There's a wealthy banker who has been too busy making money to care about anyone else and a young couple who are about to have their first child but can't seem to agree on anything, from where they want to live to how they met in the first place. Add to the mix an eighty-seven-year-old woman who has lived long enough not to be afraid of someone waving a gun in her face, a flustered but still-ready-to-make-a-deal real estate agent, and a mystery man who has locked himself in the apartment's only bathroom, and you've got the worst group of hostages in the world.Each of them carries a lifetime of grievances, hurts, secrets, and passions that are ready to boil over. None of them is entirely who they appear to be. And all of them—the bank robber included—desperately crave some sort of rescue. As the authorities and the media surround the premises, these reluctant allies will reveal surprising truths about themselves and set in a motion a chain of events so unexpected that even they can hardly explain what happens next. Humorous, compassionate, and wise, Anxious People is an ingeniously constructed story about the enduring power of friendship, forgiveness, and hope—the things that save us, even in the most anxious of times.Includes short story - The Last Round of Golf",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Mystery",
    "Humor",
    "Adult"
  ],
  "author": "Fredrik Backman",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/49127718-anxious-people"
}