{
  "title": "When a Man Marries",
  "description": "What do you get when you combine a wickedly sharp-tongued heroine with a case of mistaken identities, a houseful of quarantined high-society dinner party guests, and a jewel thief? A comedy of errors, a madcap mystery, and a sexy love story rolled into one—When A Man Marries by Mary Roberts Rinehart, the grand dame of early twentieth century mysteries!“That's the trouble with a lie; somebody asks you to tell one as a favor to somebody else, and the first thing you know, you are having to tell a thousand, and trying to remember the ones you have told so you won't contradict yourself, and the very person you have tried to help turns on you and reproaches you for being untruthful!”So sayeth Kit McNair, New York society darling turned amateur sleuth, as she reflects on the series of outrageous events brought on by her willingness to help a friend in need. When Kit’s dear friend Jim springs the news on her at a dinner party that his overbearing Aunt Selina is due any moment for an impromptu visit, and that he is too ashamed to tell his aunt that his wife, Bella, divorced him, Kit reluctantly agrees to pretend to be Bella, whom Aunt Selina has never met. The rest of their friends think this will be great fun to watch, and they settle in for an evening of entertainment as only Kit McNair can deliver.But there’s a handsome stranger at the party too, a Mr. Tom Harbison, and Kit is dismayed to have to introduce herself to this eligible bachelor as a married woman! She wants only to get this night over with and get Aunt Selina out of town so she can drop this cumbersome ruse, but when Jim’s butler falls ill while serving dinner, the board of health suspects smallpox and quarantines the entire dinner party inside the house. And who should Kit discover hiding in the basement but Jim’s ex-wife Bella, desperately trying to pretend that she hasn’t been caught spying on her ex-husband.The quarantined socialites become the talk of the town, and their plans to escape the house are thwarted at every turn by overzealous reporters. As if being trapped in the house with the real Bella and Aunt Selina while her friends blame her for their predicament wasn’t bad enough, jewelry starts going missing and Kit finds herself on the trail of a jewel thief while falling for Mr. Harbison, but it’s awfully hard to flirt with him while pretending to be another man’s wife! And what’s she going to do when everyone else begins to suspect him as the thief among them? As Kit narrows in on the jewel thief her charade begins to unravel, with some hilarious and surprising consequences!Bonus Content: Introduction, Image GalleryLegacy Vintage Collection Enhanced eBooks have been professionally edited for readability and professionally formatted for your favorite e-reader! View more on The Vintage Reader.",
  "genres": [
    "Humor",
    "Mystery",
    "Fiction",
    "Romance",
    "Mystery Thriller"
  ],
  "author": "Mary Roberts Rinehart",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/12491965-when-a-man-marries"
}