{
  "title": "Screening Reality: How Documentary Filmmakers Reimagined America",
  "description": "“A towering achievement, and a volume I know I'll be consulting on a regular basis.”-Leonard Maltin\"Authoritative, accessible, and elegantly written, Screening Reality is the history of American documentary film we have been waiting for.\" --Kenneth Turan, Los Angeles Times film criticFrom Edison to IMAX, Ken Burns to virtual environments, the first comprehensive history of American documentary film and the remarkable men and women who changed the way we view the world.Amidst claims of a new “post-truth” era, documentary filmmaking has experienced a golden age. Today, more documentaries are made and widely viewed than ever before, illuminating our increasingly fraught relationship with what's true in politics and culture. For most of our history, Americans have depended on motion pictures to bring the realities of the world into view. And yet the richly complex, ever-evolving relationship between nonfiction movies and American history is virtually unexplored. Screening Reality is a widescreen view of how American “truth” has been discovered, defined, projected, televised, and streamed during more than one hundred years of dramatic change, through World Wars I and II, the dawn of mass media, the social and political turmoil of the sixties and seventies, and the communications revolution that led to a twenty-first century of empowered yet divided Americans. In the telling, professional filmmaker Jon Wilkman draws on his own experience, as well as the stories of inventors, adventurers, journalists, entrepreneurs, artists, and activists who framed and filtered the world to inform, persuade, awe, and entertain. Interweaving American and motion picture history, and an inquiry into the nature of truth on screen, Screening Reality is essential and fascinating reading for anyone looking to expand an understanding of the American experience and today's truth-challenged times.",
  "genres": [
    "Film",
    "Nonfiction",
    "Art",
    "History"
  ],
  "author": "Jon Wilkman",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/49148825-screening-reality"
}