{
  "title": "Shelter in Place",
  "description": "It is the Saturday after the 2016 presidential election, and in a plush weekend house in Connecticut, an intimate group of friends, New Yorkers all, has gathered to recover from what they consider the greatest political catastrophe of their lives. They have just sat down to tea when their hostess, Eva Lindquist, proposes a dare. Who among them would be willing to ask Siri how to assassinate Donald Trump? Liberal and like-minded-editors, writers, a decorator, a theater producer, and one financial guy, Eva's husband, Bruce-the friends have come to the countryside in the hope of restoring the bubble in which they have grown used to living. Yet with the exception of one brash and obnoxious book editor, none is willing to accept Eva's challenge.Shelter in Place is a novel about house and home, furniture and rooms, safety and freedom and the invidious ways in which political upheaval can undermine even the most seemingly impregnable foundations. Eva is the novel's polestar, a woman who moves through her days accompanied by a roving, carefully curated salon. She's a generous hostess and more than a bit of a control freak, whose obsession with decorating allows Leavitt to treat us to a slyly comic look at the habitués and fetishes of the so-called shelter industry. Yet when, in her avidity to secure shelter for herself, she persuades Bruce to buy a grand if dilapidated apartment in Venice, she unwittingly sets off the chain of events that will propel him, for the first time, to venture outside the bubble and embark on a wholly unexpected love affair.A comic portrait of the months immediately following the 2016 election, Shelter in Place is also a meditation on the unreliable appetites-for love, for power, for freedom-by which both our public and private lives are shaped.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Gay",
    "New York",
    "The United States Of America",
    "Novels",
    "American"
  ],
  "author": "David Leavitt",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/49127605-shelter-in-place"
}