{
  "title": "Street Soldier: My Life as an Enforcer for Whitey Bulger and the Boston Irish Mob",
  "description": "For decades the FBI let James “Whitey” Bulger get away with murder, an almost unbelievable story that entered a new chapter when Bulger was arrested in California and put on trial. During the 1980s, Edward J. MacKenzie, Jr., “Eddie Mac,” was a drug dealer and enforcer who would do just about anything for Bulger. In this compelling eyewitness account, the first from a Bulger insider, Eddie Mac delivers the goods on his one-time boss and on such former associates as Stephen ''The Rifleman'' Flemmi and turncoat FBI agent John Connolly. Eddie Mac provides a window onto a world rarely glimpsed by those on the outside.Street Soldier is also a story of the search for family, for acceptance, for respect, loyalty, and love. Abandoned by his parents at the age of four, MacKenzie became a ward of the state of Massachusetts, suffered physical and sexual abuse in the foster care system, and eventually drifted into a life of crime and Bulger's orbit. The Eddie Mac who emerges in these pages is An enforcer who was also a kick-boxing and Golden Gloves champion; a womanizer who fought for custody of his daughters; a tenth-grade dropout living on the streets who went on, as an adult, to earn a college degree in three years; a man, who lived by the strict code of loyalty to the mob, but set up a sting operation that would net one of the largest hauls of cocaine ever seized. Eddie's is a harsh story, but it tells us something important about the darker corners of our world.Street Soldier is as disturbing and fascinating as a crime scene, as heart-stopping as a bar fight, and at times as darkly comic as Quentin Tarantino’s Pulp Fiction or Martin Scorsese’s Good Fellas .",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Crime",
    "Biography",
    "History"
  ],
  "author": "Edward J. MacKenzie Jr.",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/491690.Street_Soldier"
}