{
  "title": "Surrender the Sea",
  "description": "The final story in the Fire on the Plains RomancesTheir love was written on the walls of caves and drawn amongst the stars. But is love enough to fight California's destiny?Before her death, A Chumash mother secretly gives her two children to a shaman. He is to hide them within an alcove near San Diego De Alta. The daughter grows to such beauty, he names her after the sun. He also foresees a day when a man with eyes like sea will take Soleil away. But this man must arrive before missionary Ricardo Coronado discovers that he's sired a child. A child that's forbidden.After leaving Wenona of the Wind to the arms of his brother, this Van Horn brother embarks a journey west. He doesn't stop until he reaches California. From the moment of his arrival he is carried away by the beauty of the coast. However, nothing is as beautiful the exotic Soleil that he finds alone on the beach. Hers is a spirit that speaks to his heart. But when a shocking betrayal brings a Spanish missionary to their hidden oasis, Nash will once again have to fight for the one that he loves. Only this time it's not her heart he must conquer, but the sea and the man with a secret to kill.Dear Reader, The Fire on the Plains Romance © 2019 EMis a planned series of novellas, ranging from 80 to 110 pages that are perfect when you want a satisfying story but don't have the time to invest in the lengthy novel. These stories move quick with engaging characters, fast plots and timeless American west settings. The heat levels range from warm to smoldering. These are the pocket romances you snuck from your mama, your grandma or aunt. (We all did.)You can keep track of all the FOTPR romances atElleMarlow.Blogspot.com and simply look for the page with the FOTPR heading. Enjoy! And don't be afraid to share your thoughts with me. I love hearing from readers. ~EM Not for the under 18 reader. This series do go in order from book 1 - 3 they are not stand-alones.\"The setting was so beautiful, the characters so real to me, that I didn't want to turn the last page.\" AH reviews  Buy Surrender the Sea and enjoy the last of this series.",
  "genres": [],
  "author": "Elle Marlow",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/49184420-surrender-the-sea"
}