{
  "title": "The Empathy Engineer: A Colorless Love Story",
  "description": "As featured in YAHOO \"The Empathy Engineer combines the social undertones of works by Jhumpa Lahiri and Khaled Hosseini with the dramatic tension of classic romance novels.\" ( is a young software engineering star in San Francisco from India. When he meets the woman of his dreams at a party, he gets infatuated with her. She too falls for his charm and enigma, and soon, they want to get married and settle down in San Francisco. But their fairytale love story gets tragically cut short when his Indian family rejects and humiliates her due to her dark skin color. Their love story falls apart, and she separates from him for failing to protect her against his prejudiced family.Abir is devastated by the colorism and lack of empathy displayed by his family and how it affected his life. Shattered by his failure to protect the love of his life, he sets on a spiritual life journey to seek and spread the message of empathy. He takes an online identity as \"the empathy engineer\" and devotes his time on TED talks and writing blogs to spread his ideas on how empathy can abate most prejudices in society.Four years later, on a visit to India, when he is finally thinking of settling down again by marrying a woman arranged by his family, he bumps into his ex-flame serendipitously. But this time, she is with another man. What will happen to his unfinished love story now? Will he get a final closure from his past relationship, or will he end up breaking multiple hearts instead?A note from the authorMy book is a testimonial to colorism faced by millions of dark-skinned Indian women who are given lower status in the Indian society. Irrespective of how an Indian woman carries herself, her education, or class, or talent, or beauty, the first thing that makes a woman 'acceptable' in the Indian society is her skin color. It's an undercurrent, often not-talked-about but subtle profiling which makes women with darker skin tone find it very hard to get the respect they deserve.Some Reviews from Amazon \"The author boldly ventures into uncharted waters of subtle and systematic human bias/prejudice with skin color, and how even well educated people have their own deep biases based on other’s skin color.\"“I love reading foreign authors because there is a different kind of poetry to the words. This author is a storyteller. The love story was beautiful and kept me turning the pages. Can this be a movie, please?”\"A well-written page turner that is soon to become a modern day classic.\"“I loved this romance novel as it offers so much more than the genre usually does.”\"If Namesake by Jhumpa Lahiri was the most relate able transcontinental treatise for the first generation immigrants, the empathy engineer arouses similar nostalgia for my generation.\"\"The US is a cultural melting pot and we need more positive stories like this about enduring love and acceptance.\"\"The Empathy Engineer is a love story as well as a story about treating all of the people that we meet with dignity.\"\"A beautiful love story which highlights the themes of overcoming prejudice, self-reflection, and attaining love and respect in the universe.\"\"I also believe that this book can be easily adopted for a screenplay for a movie, which would be a hit with the Indian audience, considering love, acceptance and east/west interplay are such a big theme of many Bollywood movies.",
  "genres": [
    "Romance"
  ],
  "author": "Sid Chattopadhyay",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/49181237-the-empathy-engineer"
}