{
  "title": "If the Shoe Fits: The Story of a Real Life Cinderella",
  "description": "If you are looking for an uplifting and inspirational true story, then look no further...Do you enjoy biographies and heartbreak-to-happiness stories, with a personal-development theme? Then why not try ‘If the Shoe Fits - The Story of a Real-Life Cinderella’. Go on a fascinating journey with author Emma Fletcher, as she takes you on an emotional roller-coaster ride through her incredible life story. You’ll laugh and cry along with the author and be astounded, as Fletcher’s unique and gripping story is revealed. For lovers of motivational life stories and personal-development books.‘If the Shoe Fits - the Story of a Real Life Cinderella,’ is the autobiography of one woman’s journey through a series of traumatic events, aimed at empowering the reader with their own battles. Author Emma Fletcher, leads her readers through her heartwarming personal battle with tragedy, explaining how she dealt with each event faced. Fletcher openly considers and analyses, how each event impacted upon her life and subsequently lead her to self-realisations. She looks at how each moment shapes us into who we become and ultimately how she broke the cycle of allowing trauma to define her. Fletcher eloquently describes how she dealt with each event and how, through soul-searching and personal discovery, she was able to understand what these life changing events meant to her purpose in life. As she looks at how these discoveries enabled her to come out the other side of each traumatic moment with renewed hope, she considers how grief and tragedy can be used as a tool to empower us, rather than needing to define us. The author manages to offer readers a sense of self-empowerment over their own lives, through her candid and refreshing writing style and earnest approach to her life. ‘If the Shoe Fits’ is an honest and thought-provoking journey, filled with parables on life and a look at how it is possible to deal with each encounter we face, allowing it to become a positive learning curve, to lead us to the next moment in our life. Aimed at helping people in a similar situation, Fletcher reflects on how each event both shaped her and made her into the person she is today. Her story will make you question whether there really is such a thing as coincidence or whether each and every moment, is intentionally designed to lead us to the next; the building blocks of life and the very foundations of who we are.About the Fletcher is an established actress and teacher; having worked with children with special educational and mental health needs for many years. Both of these career settings have allowed Fletcher the opportunity to discover and learn about the way the mind works and why people make certain life choices, based upon their past experiences.Her discoveries are an empowering read for anyone facing their own personal battle and life decisions or for anyone, just looking to read an inspiring story of survival and triumph over adversity.Here’s what some of our readers are ‘The book had me enthralled from start to finish.’‘The most absorbing and touching book I’ve read in so long.’‘A brilliant tale of survival and growth.’‘An honest, moving, and at times, humorous account of the struggle for self-realisation.’Once you start reading, you won’t want to stop! Start your journey - take a look inside now! View sample pages on Kindle right here.",
  "genres": [],
  "author": "Emma Fletcher",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/49188642-if-the-shoe-fits"
}