{
  "title": "Black Heart",
  "description": "A DEMON AWAITSI love the ever changing dynamics of the characters from one book to the next. If you like thrillers with a great story line and intriguing characters, you'll love A Demon Awaits. --Reader MomI am amazed that you can take a character I hate and make me root for him. What genius and talent! --PamSIN AND VENGEANCE...the book was spellbinding. The plotting is brilliant, and Randy is an exquisite character, an evil genius for the modern age. --Debra HamelC.J. West delivers, from the highly erotic opening scene to the chilling conclusion. Sin & Vengeance is a provocative page-turner brimming with intrigue and heart-pounding suspense. --AlynnTHE END OF MARKING TIME... West has brilliantly portrayed a world gone crazy where the rule is there are no rules, or are they. Crime fiction meets science fiction in this awesome thriller.\" --Book BitchPowerful, thought provoking and massively entertaining... I loved this book and the way it made me root for someone who I knew I shouldn't like. --CrimeSquad.comADDICTED TO LOVEThis book had me so hooked. I loved the plot ... unique and creative [with] just the right about of romance, sexuality, thrills, mystery, and just plain crazy ... --Tiffany Harkleroad, Tiffany's BookshelfCJ's latest offering is a blend of the thrillers we come to expect from him and a new touch of romance, actually a little steamier than just any old romance, so I like to call it a \"steamy thriller.\" --RoxanneFrom the moment Randy Black appears in CJ West's novel, Sin and Vengeance, he is consumed with a lust for revenge. Randy is so obsessed that he plans to sacrifice himself to destroy the man who has taken his rightful place. Randy delivers retribution in spectacular fashion, but his suicide mission takes an unexpected twist. Randy survives, his blood cools, and he doesn't know what to do next.A Demon Awaits is the second book in the Randy Black series and as the book opens, Randy sees his future. Horrific torture lies ahead if he doesn't change course. He's given a chance to atone for his mistakes. He latches on and begins the difficult journey to rebuild the life that tragedy stole from him 15 years earlier, but questions haunt his every step. Is he worthy of forgiveness? Can God forgive him? Can he forgive himself?Earthly trials impede Randy at every turn. Randy is threatened and beaten. He's repeatedly tempted to lash out and undo the spiritual progress he's made. Randy resists only to discover that he's being manipulated by Tom Gold, his own defense attorney. Finally, Randy is ready to strike back, but there are limits to what he can do. Sin carries weighty consequences in the afterlife and Randy is out of second chances.",
  "genres": [
    "Thriller"
  ],
  "author": "C.J. West",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/4918651-black-heart"
}