{
  "title": "We Are All the Same in the Dark",
  "description": "The discovery of a girl abandoned by the side of the road threatens to unearth the long-buried secrets of a Texas town's legendary cold case in this superb, atmospheric novel from the internationally bestselling author of Black-Eyed Susans.It's been a decade since Trumanell Branson disappeared, leaving only a bloody handprint behind. Her pretty face still hangs like a watchful queen on the posters on the walls of the town's Baptist church, the police station, and in the high school. They all promise the same thing: We will find you. Meanwhile, her brother, Wyatt, lives as a pariah in the desolation of the old family house, cleared of wrongdoing by the police but tried and sentenced in the court of public opinion and in a new documentary about the crime.When Wyatt finds a lost girl dumped in a field of dandelions, making silent wishes, he believes she is a sign. The town's youngest cop, Odette Tucker, believes she is a catalyst that will ignite a seething town still waiting for its own missing girl to come home. But Odette can't look away. She shares a wound that won't close with the mute, one-eyed mystery girl. And she is haunted by her own history with the missing Tru.Desperate to solve both cases, Odette fights to save the lost girl in the present and to dig up the shocking truth about a fateful night in the past--the night her friend disappeared, the night that inspired her to become a cop, the night that wrote them all a role in the town's dark, violent mythology.In this twisty psychological thriller, Julia Heaberlin paints unforgettable portraits of a woman and a girl who redefine perceptions of physical beauty and strength.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Book Club",
    "Audiobook",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Julia Heaberlin",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/49189494-we-are-all-the-same-in-the-dark"
}