{
  "title": "For Young Women Only: What You Need to Know about How Guys Think",
  "description": "Unlock the Male MysteryGuys will be guys. And now girls can know what that means! For Young Women Only dives into the mysterious inner-workings of the teenage male mind so that you can begin to understand why guys say and do what they do. Exploring critical topics including respect, insecurity, appearance, physical affection, and the \"tough and tender\"-ness of guys, this book is also packed with \"ask the expert\" sections, quotes, and fun personal stories from guys in all walks of life. Why is he so visually stimulated? You may wish it weren't so, but that won't make it so. I don't want to put on a front for him to like me. Actually, he wants your genuineness, too! This book will help you grasp how God wired the opposite sex so you can enjoy your relationships with them.Why Are Guys So Weird?Unravel the mystery. A national scientific survey and in-depth personal interviews give you an unprecedented look inside the teenage male mind. Discover how: He'd be perfectly fine if he was loved by few and hated by many...as long as he was respected by all His ego is the size of Africa (but so are his insecurities) He hides his real feelings under a tough exterior He's magnetized by pretty girls-but also wants to find a diamond in the rough He actually does want to marry a virgin He just wants you to be yourself.It's the inside scoop you've been waiting for! You'll come to not only understand him, but also know what he might really be thinking about you.\"This is a phenomenal book that I wish I'd had as a teenager!\" \n-Shannon Ethridge, Bestselling author, Every Young Woman's Battle \n\"Girls, this book is a MUST-read!\" \n-Candace Cameron Bure, Actress, speaker \nStory Behind the Book\"My teenage daughter really needs to hear this!\" Such was the typical reaction from countless men and women who read Shaunti Feldhahn 's bestselling For Women Only.\"If forty-year-old women are surprised by the truth about how men think, we realized the value in helping teenagers discover these realities as well,\" says Shaunti. Teaming with her best friend Lisa Rice, a mother of teen girls and the coauthor of For Women Only Discussion Guide, they launched a major national survey of guys fifteen to twenty. Their surprising findings are revealed here to help girls improve their relationships with the opposite sex, now and into the future.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Relationships",
    "Christian Living",
    "Self Help",
    "Christianity",
    "Romance"
  ],
  "author": "Shaunti Feldhahn",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/49160.For_Young_Women_Only"
}