{
  "title": "Swift Sword: The True Story of the Marines of MIKE 3/5 in Vietnam, 4 September 1967",
  "description": "Redesigned cover art and upgraded manuscript to showcase the true story of 164 Marines and Navy Corpsman who fought outnumbered and outgunned against the vaunted North Vietnamese Army on Operation Swift in 1967.A true Vietnam War saga based on 50 interviews with veterans who were there and relatives of those who didn’t come home.“I served in Vietnam and reading Swift Sword is as close as you can get to reliving the terror of personal combat without actually being there.”- Larry D., Vietnam VeteranMonday, September 4, 1967…Eyes peeled and moving quietly, Lance Corporal Jack Swan led 164 of his fellow US Marines from Mike Company, 3rd Battalion, Fifth Marines over the face of a bare, rocky knoll deep in the Que Son Valley of South Vietnam. The men knew every step could be booby-trapped and the enemy might be hiding behind any bush. Carrying unreliable M16 rifles that often malfunctioned, their job was to rescue an isolated company of fellow leathernecks besieged by the Communist North Vietnamese Army.The sight of a serene, shrub-covered rice paddy greeted the Americans as they crested the knoll. “Too serene,” Swan thought as a bush quivered in the corner of his eye. “I think that bush just moved,\" he whispered to his squad leader. \"If it moves again, shoot it!\" The shrub moved, Swan fired, and the bush went down.Then, all hell broke loose…A hailstorm of rocket-propelled grenades, thundering mortars, and AK-47 machine-gun fire strafed the exposed men from all directions. The Marines of Mike Company had walked into an ambush laid by over 2,500 well-camouflaged North Vietnamese warriors.It seemed as if the Angel of Death was swooping down upon the Americans like a swift sword.Instead of rescuing their fellow comrades, the Marines now faced complete annihilation. Outnumbered, out-gunned, and exposed, there was nowhere to hide. Would any of them survive to see the setting sun?Read Swift Sword, a true Vietnam War story of epic courage and brotherhood in the face of insurmountable odds that will leave you on the edge of your seat.They never gave up. We should never forget.",
  "genres": [
    "History",
    "War",
    "Military Fiction",
    "Nonfiction",
    "Asia"
  ],
  "author": "Doyle D. Glass",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/124925832-swift-sword"
}