{
  "title": "The Natural: The Misunderstood Presidency of Bill Clinton",
  "description": "Joe Klein, best-selling author of Primary Colors and one of our most brilliant political analysts, now tackles the subject he knows Bill Clinton. Astute, even-handed, and keenly intelligent, The Natural is the only book to read if you want to understand exactly what happened–to the military, to the economy, to the American people, to the country–during Bill Clinton’s presidency, and how the decisions made during his tenure affect all of us today.Much has been written about Clinton, but The Natural is the first work to cut through the gossip, scandals, media hype, and emotional turbulence that Clinton always engendered, to step back and rationally analyze the eight years of his tenure, a period during which America rose to unprecedented levels of prosperity. Joe Klein puts that record into perspective, showing us what worked and what didn’t, exactly what was accomplished and why, and who was responsible for the successes and the failures.We see how the Clinton White House functioned on the inside, how it dealt with the maneuvers of Congress and the Gingrich revolution, and who held power and made the decisions during the endless crises that beset the administration. Klein’s access to the White House over the years as a journalist gave him a prime spot from which to view every crucial event–both political and personal–and he sets them forth in an insightful, readable, and completely engrossing manner.The Natural is stern in its criticism and convincing with its praise. It will cause endless debate amongst friends and foes of the Clinton administration. It is a book that anyone interested in contemporary politics, in American history, or in the functioning of our democracy, should read.",
  "genres": [
    "Politics",
    "History",
    "Biography",
    "Nonfiction",
    "Presidents",
    "Biography Memoir",
    "Us Presidents"
  ],
  "author": "Joe Klein",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/49199.The_Natural"
}