{
  "title": "We Have Been Harmonized: Life in China's Surveillance State",
  "description": "One of the world’s most respected investigative reporters reveals how George Orwell’s chilling vision of authoritarianism in 1984 has come true in modern China’s high-tech surveillance state.They are always watching.For nearly twenty years, politicians from President Bill Clinton to tech gurus including Google’s Eric Schmidt proclaimed that the internet could not be censored by any government, including China. As recently as 2013, Tim Berners-Lee, often credited as the inventor of the World Wide Web, declared that “piece by piece, website by website, China’s ‘great firewall’ would meet the same fate as the Berlin Wall.” Yet these predictions have been proved wrong. In We Have Been Harmonized, award-winning journalist Kai Strittmatter reveals how the internet and high tech have transformed the power of Chinese authoritarians, allowing them to create the most horrifying surveillance state in history.Advances in technology—facial recognition, GPS tracking, supercomputer databases, mobile phones, high-resolution security cameras—make it nearly impossible for a Chinese citizen to hide anything from authorities. Text messages and emails are instantly stripped of “problematic” words. The year 1989—when the world witnessed the student protests and tragic massacre at Tiananmen Square—has been banished from search results. Cameras scan for “appropriate” facial expressions as they track individuals’ movements. Each citizen is given a score for good behavior. Those who lose points can be banned from traveling, have their internet speed reduced, or even have their toilet paper limited. All of this has happened with the help of Chinese tech companies, as well as the complicity of Western governments and corporations eager to gain access to China’s huge market. While these companies export their technology to authoritarian states around the globe, they are also reshaping American lives via app, smart phones, and computing. Strittmatter’s book is a terrifying portrait of an Orwellian nightmare unlike anything we’ve ever witnessed, and a dire warning about what could happen anywhere.",
  "genres": [
    "Nonfiction",
    "China",
    "Politics",
    "History",
    "Audiobook",
    "Asia",
    "Technology"
  ],
  "author": "Kai Strittmatter",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/49203415-we-have-been-harmonized"
}