{
  "title": "Countdown To Christmas: Cinnamon-sprinkled clean and cosy romcom",
  "description": "Christmas needs saving, but can Christmas save them? Within a year, the ultra-organised Alice Trip has turned her life from lonely, cheated on nearly-bride, to a girl on the up, due to emigrate to be with her family in Spain. All goes to plan until a magical evening snowfall on the first of December… ...which becomes a nation-stopping blizzard. When Alice’s car dies on the deserted moorland in the Yorkshire Dales, her humiliating rescue from a snowdrift by local farmer, Jason, and a weekend stranded with him at Hollins Fell Farm, heralds the beginning of A Very Difficult December. Day by day, careful arrangements unravel, and her beloved Christmas gets it in the neck... Jason Skelling, meanwhile, has nothing to celebrate. He’s clinging on by his fingertips to the family farm, with a worryingly ill uncle to care for. The lead up to Christmas is a painful one for both of them since the car accident that killed his parents and aunt happened just before the holiday season only two years previously. In a cold and lonely farmhouse, life is hard work for the once carefree Jason. His biggest plans for Christmas are to watch TV and forget his dodgy finances, until the surprise discovery of a distressed and accidentally half-naked redhead in a snowdrift turns his December upside-down… This clean and cosy Christmas romcom is cinnamon-sprinkled, uplifting reading for any time of the year. Enjoy! HEARTS OF ECKDALE This story is a stand-alone novel in the Hearts of Eckdale series of feelgood rural romances. Love will find a way this year, among the unerringly practical folk of the hauntingly beautiful, but isolated, rural valley at the heart of North Yorkshire, England. They call it, ‘God’s Own Country’, and although the matches may be made in heaven, they’re wished for, fought for, fought against, or stumbled upon accidentally, by mere mortals. They’ll fall in love, and so will you. Welcome to Eckdale!",
  "genres": [
    "Contemporary Romance",
    "Christmas",
    "Contemporary"
  ],
  "author": "Nessy Alexander",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/49196285-countdown-to-christmas"
}