{
  "title": "Devil's Hour",
  "description": "Devil’s hour, noun: the hour when the demon or devil who leads hell is at its strongest.   Born on the wrong side of the tracks, Royce Locke is no stranger to scrapping and fighting for the things he wants. What he desires most is Sawyer Key—his partner on the force and the man he’s falling in love with. After asking Sawyer to take a chance on him, Royce will need to back up his pretty words with fearless action instead of being his own worst enemy.  Someone is harassing the mayor of Savannah, and Locke and Key are tasked with finding out who. The investigation quickly takes a twisted turn, leading them to an enemy who thinks purification by fire is the only way to save the city. Scarier than The Purists’ elusiveness is their ability to turn public opinion in their favor, creating unrest and threatening anarchy by fanning flames and fear. When you play with fire, someone is bound to get burned.  When menace becomes murder, the two detectives will race the clock against the devil to save their beloved city from becoming a raging inferno. Royce will need to draw on his grit now more than ever if he hopes to realize the dreams that are finally within reach. The rag is lit, the Molotov cocktail is tossed, and the zero hour is upon them. Challenge received and accepted.  Devil’s Hour is the second book in the Zero Hour series, which follows Locke and Key’s investigations and evolving relationship. This is a series that must be read in order. Devil’s Hour has a happy-for-now ending with no cliffhanger. It contains mature language and sexual content intended for adults 18 and older.  Trigger warning: Part of the storyline involves coming to terms with a friend’s suicide, which may be difficult for some people to read.",
  "genres": [
    "M M Romance",
    "Romance",
    "Mystery",
    "Contemporary",
    "Audiobook",
    "Crime",
    "LGBT"
  ],
  "author": "Aimee Nicole Walker",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/49198964-devil-s-hour"
}