{
  "title": "The Unwilling",
  "description": "THE INSTANT BESTSELLER“We the unwilling, led by the unqualified to kill the unfortunate, die for the ungrateful.” —Unknown SoldierSet in the South at the height of the Vietnam War, The Unwilling combines crime, suspense and searing glimpses into the human mind and soul in New York Times bestselling author John Hart's singular style. Gibby's older brothers have already been to war. One died there. The other came back misunderstood and hard, a decorated killer now freshly released from a three-year stint in prison. Jason won't speak of the war or of his time behind bars, but he wants a relationship with the younger brother he hasn't known for years. Determined to make that connection, he coaxes Gibby into a day at the long hours of sunshine and whisky and older women. But the day turns ugly when the four encounter a prison transfer bus on a stretch of empty road. Beautiful but drunk, one of the women taunts the prisoners, leading to a riot on the bus. The woman finds it funny in the moment, but is savagely murdered soon after. Given his violent history, suspicion turns first to Jason; but when the second woman is kidnapped, the police suspect Gibby, too. Determined to prove Jason innocent, Gibby must avoid the cops and dive deep into his brother's hidden life, a dark world of heroin, guns and outlaw motorcycle gangs. What he discovers there is a truth more disturbing than he could have not just the identity of the killer and the reasons for Tyra's murder, but the forces that shaped his brother in Vietnam, the reason he was framed, and why the most dangerous man alive wants him back in prison. This is crime fiction at its most raw, an exploration of family and the past, of prison and war and the indelible marks they leave.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Thriller",
    "Suspense",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "John Hart",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/49195609-the-unwilling"
}