{
  "title": "The Book of CarolSue",
  "description": "Award-winning author Lynne Hugo returns with a life-affirming, poignant novel in the spirit of A Man Called Ove —a story brimming with both wit and warmth about how a family gets on . . . and goes on. CarolSue and her sister, Louisa, are best friends, but haven’t had much in common since CarolSue married Charlie, moved to Atlanta, and swapped shoes covered with Indiana farm dust for pedicures and afternoon bridge. Louisa, meanwhile, loves her farm and animals as deeply as she’d loved Harold, her late husband of forty years. Charlie’s sudden death leaves CarolSue so adrift that she surrenders to Louisa’s plan for her to move back home. But canning vegetables and feeding chickens are alien to CarolSue, and she resolves to return to Atlanta—until Louisa’s son, Reverend Gary, arrives with an abandoned infant and a dubious story. He begs the women to look after the baby while he locates the mother—a young immigrant who fears deportation. Keeping his own secrets, Gary enlists the aid of the sheriff, Gus, in the search. But CarolSue’s bond with the baby is undeniable, and she forms an unconventional secret plan of her own. How many mistakes can be redeemed? Praise for the novels of Lynne Hugo “Sparkling prose, wry humor, and timely, relevant themes abound.”— Donna Everhart, USA Today bestselling author of The Moonshiner's Daughter “ A tender hymn of   hope and rebirth that stays with you long after the last page.”—Kim Michele Richardson, author of  The Book Woman of Troublesome Creek “I lost hours of sleep as I raced to finish this extraordinary novel.”— Randy Susan Meyers, bestselling author of Waisted “Delivered with humor and heart.”— Terri-Lynne DeFino, author of The Bar Harbor Retirement Home for Famous Writers (And Their Muses)",
  "genres": [
    "Fiction",
    "Contemporary",
    "Womens Fiction",
    "Chick Lit"
  ],
  "author": "Lynne Hugo",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/49195168-the-book-of-carolsue"
}