{
  "title": "How to Sell Your Blood and Fall in Love",
  "description": "“You have money, I have blood. How would you like to buy it?”No romantic story has ever lived up to Dr. Clementine Hughes’ reality but at least he has his steamy two-million-word fanfic and a prestigious research position at Vitalis-Barron Pharmaceuticals, where their benefits are superb and their experimentation on vampires highly unethical. When a mysterious accident turns Clementine into a vampire, discovery would demote him to lab rat and his growing thirst for his coworker’s veins forces him to the streets to hunt.Justin Yu is usually the one attacking villains in alleys, not the other way around. After the tragedy he brought upon his local vampiric community in his youth, he’s struggled tirelessly to keep their vampires safe. So when a panicking Clementine botches a bite attempt, Justin takes pity—and advantage—and offers the vampire a trade: his blood in exchange for an exorbitant fee.In desperation, Clementine accepts.Justin’s blood is bland and unappealing, but the more Clementine learns to appreciate the man’s sharp humor and persistent compassion, the more he acquires a taste for Justin. Justin is determined not to let Clementine’s good looks and thoughtful intellect distract him as hunters from Vitalis-Barron close in on Justin’s neighborhood, and it turns out someone there knows Clementine’s vampiric secret…Sell Your Blood is the second book in a series of loosely connected MM paranormal romances. It features an Ivy League a-spec vampire who’s never been in love before and an inner-city man who’s sworn off relationships for the last decade as they struggle to combine their different worlds and find a fire in each other hotter than they thought possible. While it can be enjoyed on its own, the optimal reading order is chronological. Note this story features blackmail, general violence, the smoking of prescription drugs to manage intense pain, and the acquisition of far too many salt and pepper shakers.",
  "genres": [
    "Fantasy",
    "Romance",
    "Vampires",
    "Queer",
    "Audiobook",
    "LGBT",
    "Paranormal"
  ],
  "author": "D.N. Bryn",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/124931701-how-to-sell-your-blood-and-fall-in-love"
}