{
  "title": "Crossing The Line",
  "description": "Partners…with benefits. Your partner knows your secrets. Your partner watches your back. Your partner…is the star of your fantasies?Linc Dalton knows that he is supposed to keep his hands off his partner…well, unless he is protecting Blair Kincaid’s gorgeous body. She’s his partner at the elite protection firm of Wilde Securities. Their job is to guard the wealthy, to take out the bad guys, and to generally kick butt. He trusts Blair completely. He admires her strength and courage. And he wants her desperately. Not that he ever intends to let her know that fun fact. Instead, he keeps up a fake persona where he offers her jokes and flippant comments. Blair is straight-laced. By-the-book. Always by-the-book. Linc likes things a bit wilder. Control isn’t his strong suit, but, with a massive effort, he’s kept his control in place around Blair. With Blair, he’s on his best behavior…Until he isn’t. Until they get a new case. Until they have to go undercover as lovers.And, suddenly, Linc has to put his hands on Blair’s delectable form. He has to stay very close to her. Has to whisper sweet promises to her. Has to share the same bed with Blair. It’s just a cover story. He’s not really in love with her…except, one night, they cross the line. Stop being pretend lovers and become the real thing. Once Linc has Blair, there is no turning back. Giving her up isn’t an option. She broke the rules, and for once, Blair doesn’t care.She shouldn’t have done it. Blair knows she shouldn’t have let the desire she feels for Linc sweep her away. Yet she did, and now, everything has changed. She wants him more than ever before, and, surely, they can do this, right? They can be lovers and partners and still get the job done. As long as emotions don’t get involved, everything is fine.Until it isn’t. Until Blair and Linc are targeted as prey. Until all of their emotions are out of control. When their cover is blown, Blair and Linc find themselves being hunted. It’s a race for survival, and Blair knows that Linc has her back. Just as she has his. Prepare yourself…things are about to get wild.The stakes are higher than they’ve ever been, and Linc and Blair are about to turn things red-hot. Molten level. Watch out…you just might get burned.Author’s Note: These partners have been on a slow-burn path, but their desire is about to ignite into an inferno they can’t control. You ready to steam up the pages? We’ve got action, thrills, romance…and a hero who is funny, sexy, and willing to do anything to claim his lady. CROSSING THE LINE is a complete, stand-alone novel. Guaranteed happily-ever-after (though reaching that ending will sure be fun…and a wee bit dangerous). Enjoy!",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary",
    "Friends To Lovers",
    "Contemporary Romance",
    "Mystery"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/49212322-crossing-the-line"
}