{
  "title": "Edge of the Breach",
  "description": "We all become monsters at the edge of the breach. In a post-apocalyptic world where season of birth determines power — spring healers, summer mages, fall shapeshifters, and winter shields — a man and a woman emerge from tragic childhoods to lead humanity on opposite sides of an interrealm war.▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀There is a hole in the sky. They call it the Rift. A portal to the gods. The scar of a suffering world. Through it, the gods rule the last scraps of civilization, harkening war. As chaos beckons, two leaders emerge from the ashes of a dying planet.Julian Kyder is the son of an abusive rape victim who compensates for his abandonment through psychopathy. Sira Rune is a cancer survivor who dedicates her life to living free and fearless while experiencing the taboo and the unorthodox. Rune is the only one unafraid of Kyder, and that terrifies him, because he only knows how to function through fear. Even though she gives him more chances than he deserves, how much violence can she forgive? When is a person beyond redemption? While he struggles to control his demons and she struggles to find purpose, the gods drag the ruined world into war.\nAmazon #1 Top Free Bestseller LGBT SF\n\nAmazon Top 10 New Releases LGBT SF\n\nAmazon Top 25 New Releases LGBT Fantasy\nCONTENT WARNING: The Rift Cycle is a highly graphic series intended for mature audiences.TAGS: science fiction, fantasy, grimdark, horror, LGBT, mental illness▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nREAD AN EXCERPT\nChapter 1: Pain Made a Man Kyder, Age 9 - July 7, 7009Her body is stone. Her eyes glass. She doesn’t see me. Doesn’t want me. Yet her blood runs through me, a river of pain.I call her mother, but she calls me nothing. She hopes to forget me. Hopes I will disappear. Conceived in violence, I am a constant reminder of the crime that made me.“Come,” she orders me. Like a dog. And I jog at her heels, obedient.She won’t use my name. It’s a reminder I exist. The meaning behind it is empty, anyway. She refused to name me, so the hospital staff did. Julian Kyder — Julian after the doctor who delivered me and Kyder after the hospital. Forever marked by the circumstances of my birth.She tried to abort, but I survived. She put me up for adoption, but no one took me. She tried to release me into the system, but they were already at overcapacity. We’re trapped. Stuck together as two halves of misery. The doctor told me I am a miracle. She told me I am a curse.“This way.”She leads me along the edge of the Shelf toward the market. With each step, my feet crunch along the parched gravel. To our left, cliffs drop hundreds of meters into the Ruined Sea, a toxic cesspool that encircles the island. In the distance, Mount Erebus puffs ash into the blanched sky, a grandfather smoking the last bit of a cigar.We mutilated our world, bombarded the planet for centuries with nuclear weapons until we ran out of missiles, until Earth flipped upside-down. The only habitable continent is Antarctica, now the North Pole, and even here, the war melted the desolate wasteland into a scorching desert. Humans near extinction, huddled near the top of the planet like exiles. But we deserve it.Sweat trickles down my back. I pull my robe tight around myself, hoping to block out the sun. It’s summer, so there’s no respite from the heat. The days are endless. They bleed into each other like ink on a page, no distinction between the lines. Night won’t come for another few months, and soon after it does, it won’t leave till winter’s done.Some call it balance. Day and night. Light and dark. Sun and stars. Birth and death. People look for meaning when it’s only chaos disguised as order…▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nWELCOME TO THE BREACH.",
  "genres": [
    "Horror",
    "Science Fiction",
    "Fantasy",
    "LGBT",
    "Post Apocalyptic",
    "Dark"
  ],
  "author": "Halo Scot",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/49211278-edge-of-the-breach"
}