{
  "title": "RomeAntically Challenged",
  "description": "Amazon Best Romance of the Month Publishers Marketplace  ROMANCE 2020-2021 pickFresh Fiction Fresh PickA witty, sexy, and charming story from the #1 National Bestselling author of the St. Helena Vineyard series that fans of Emily Henry, Jen DeLuca, and Kate Clayborn will adore. Growing up the lone Asian in a community of WASPs, Annie has always felt out of place. Her solution? Start a family of her own. Not easy when every man she’s dated, including her ex-fiancé, finds “his person” right after breaking up with Annie. Even worse than canceling the wedding eight weeks beforehand? Learning the “other woman” plans to walk down the aisle wearing her wedding gown. New plan—find a fresh, man-free start. Too bad her exit strategy unexpectedly lands her working at a hospital in Rome, Rhode Island, rather than Rome, Italy, and sharing a cabin with a big, brooding, and annoyingly hot male roommate. Home on medical leave after covering a literally explosive story in China, investigative photojournalist Emmitt embarks on his most important assignment—cementing his place in his daughter’s life. Three men and a baby might work in the movies, but with a stepdad and devoted uncle competing for Paisley’s attention, Emmitt has lost his place at the family table. Then there’s the adorably sexy squatter in his cabin, who poses another problem, one he’d very much like to solve up close and personal. But he can’t win—Annie has sworn off men, Paisley’s gone boy crazy, and Emmitt’s estranged father reappears with a secret that changes everything. Annie and Emmitt are about to discover love comes in many forms, and sometimes the best families are the ones we make.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Contemporary Romance",
    "Adult",
    "Audiobook"
  ],
  "author": "Marina Adair",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/49213012-romeantically-challenged"
}