{
  "title": "Boyfriend 101",
  "description": "CamdenI'm a fun-loving guy who doesn't take life too seriously. If there's something I want, I go for it. Why not? Life's too short to slide into the grave with regrets. But what I don't do is go for men who aren't out and proud. Been there, done that. The only real way to get to me is to hurt my brother, but now that Sawyer's happy, he doesn't need me anymore. I'm stoked for him, I am! But seeing my friends and brother paired off is a constant reminder of the one thing I don't have but desperately want: Jude. There's something about this beautiful man who insists he's not into men. Even with my rules about guys who aren't out, I've craved him since the moment he stepped foot in Fever Falls. Now that he's one of my best friends, that desire has raged into an inferno I'm powerless to tame.JudeI've always considered myself straight. I wrote off the whole fascination with my longtime best friend Rush as something weird that happened. I've been over him for a while now, and the person who helped me was Camden Burke, the flirty man who calls me beautiful. I used to hate getting compliments about my looks, but when Cam does it... Well, let's say the way he makes me feel is my first clue that the thing with Rush wasn't a one-time deal. I'm bisexual. And Cam makes me laugh and always listens. Since I've been in Fever Falls, I've become closer to him than I've ever been with anyone, Rush included. So when I decide to explore my newfound sexuality, who better than Cam to show me all the pleasures of being with a man? Only, we get caught, and now it's not just Cam showing me what it's like to be with a guy--he's become my professor in what he calls Boyfriend 101, and apparently, I'm a very good student.But unfortunately, I have some issues to work out and a few exam scores start slipping. Cam has already graded on a curve by breaking some of his rules to be with me. If I can't get my act together, I'll flunk out of Boyfriend 101, and I can't imagine retaking the course with anyone but him.",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "LGBT",
    "Contemporary Romance",
    "Audiobook"
  ],
  "author": "Riley Hart",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/49212278-boyfriend-101"
}