{
  "title": "The Scientist and the Spy: A True Story of China, the FBI, and Industrial Espionage",
  "description": "\"A riveting true story of industrial espionage in which a Chinese-born scientist is convicted of trying to steal U.S. trade secrets, by a finalist for the Pulitzer Prize in nonfiction. In September 2011, sheriff's deputies in Iowa encountered three neatly dressed Asian men at a cornfield that had been leased by Monsanto to grow corn from patented hybrids. What began as a routine inquiry into potential trespassing blossomed into a federal court case that saw one of the men -- Mo Hailong, also known as Robert Mo -- plead guilty to conspiracy to steal trade secrets from U.S. agro-giants DuPont Pioneer and Monsanto on behalf of the China-based DBN Group, one of the country's largest seed companies. The Mo case was part of the U.S. government's efforts to stanch the rising flow of industrial espionage by Chinese companies -- some with the assistance of the Chinese government itself -- on American companies. And it's not an isolated one. Economic espionage costs U.S. companies billions of dollars a year in lost revenue. As former Attorney General Eric Holder once put it, \"There are only two categories of companies affected by trade secret Those that know they've been compromised and those that don't know it yet.\" Using the story of Mo and of others involved in the case, journalist Mara Hvistendahl uncovers the fascinating and disquieting phenomenon of industrial espionage as China marches toward technological domination. In The Scientist and the Spy, she shines light on U.S. efforts to combat theft of proprietary innovation and technology and delves into the efforts to slow the loss of such secrets to other nations. As technology and innovation become more and more valuable, government agencies like the FBI and companies around the world are growing increasingly concerned -- and are increasingly outspoken about -- the threats posed to Western competitiveness. General Keith Alexander, the ex-director of the National Security Agency, has described Chinese industrial espionage and cyber crimes as \"the greatest transfer of wealth in history.\" The Scientist and the Spy explains how the easy movement of experts and ideas affects development and the important role that espionage plays in innovation, both for the spies and the spied-upon. She also asks whether the current U.S. counter-espionage strategy helps or harms the greater public good. The result is a compelling nonfiction thriller that's also a call to arms on how we should rethink the best ways to safeguard intellectual property\"--",
  "genres": [
    "Nonfiction",
    "China",
    "History",
    "Science",
    "Politics",
    "True Crime",
    "Audiobook"
  ],
  "author": "Mara Hvistendahl",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/49224633-the-scientist-and-the-spy"
}