{
  "title": "The Opium Lord's Daughter",
  "description": "Following the harrowing journey of Lady Lee Su-Mei and her family, Robert Wang's debut novel is a historical drama told from dual perspectives—Chinese and British—about the First Opium War, a tragic and history-altering conflict. Honoring the tradition of noted historical fiction writers such as Ken Follett, Philippa Gregory, and James Clavell, The Opium Lord's Daughter artfully weaves true events and characters into the narrative, offering the reader a selective glimpse into a world populated with rogue drug traders, imperialist government officials, religious zealots, scrappy survivors. Su-Mei, the eponymous protagonist, is a young woman unbounded by convention. From the moment we meet little Su-Mei, she valiantly resists her wealthy and powerful father—one of the largest opium traders in mid-19th century China—who attempts to force her into the barbaric practice of foot binding. Through her, readers look with fresh eyes upon antiquated and harmful traditions, and understand how time and experiences truly shape a person during their life's journey.  Her defiance sets in motion a series of events, forever altering her fate, as well as the fates of those she holds dear. Su-Mei is forced to rapidly come-of-age and muster her heroic spirit to survive her crumbling world. Taboo romances, tumultuous adventures, and heart-wrenching tragedies befall Su-Mei and her loved ones throughout the course of the story. The Opium Lord's Daughter is an expedition through the destruction of a culture, underscoring the hold and havoc drug empires continue to exert in society, even to this day. A must read for fans of Shogun, Downtown Abbey, Outlander and other sweeping tales rooted in history!",
  "genres": [
    "Historical",
    "Historical Fiction",
    "Asian Literature",
    "Fiction",
    "China"
  ],
  "author": "Robert  Wang",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/49227039-the-opium-lord-s-daughter"
}