{
  "title": "Numan Versus Numan",
  "description": "Two tribute bands. One ultimate prize. Zero room for failure.Having been blown away by seeing Gary Numan perform 'Bombers' on TV in 1978, Five went out the very next day and put an ad in the paper to form a tribute band. He named it 'The Romford Bombers'. They soon went on to dominate the Numan tribute band circuit. Until last year that is, when 'The Storm Troopers' came out of nowhere and stole their crown.The Bombers’ 56-year-old lead singer will do whatever it takes to win it back. He also has reason to believe The Storm Troopers are pursuing a hidden agenda, and he’s determined to get to the bottom of it.As Five wrestles with his suspicions, the Romford and Dagenham Gary Numan Fan Club organise one final battle of the bands. The winner will become the all-time ultimate Numan tribute act. The stakes have never been higher.Five enlists the help of his best mate, Pete - wild card and hacker extraordinaire - and the two dive into the dark web in search of answers to the following questions:- Why is there no trace of The Storm Troopers before last year?- Why does Ross, the Troopers’ singer and Five’s nemesis, have suspicious gaps in his knowledge of Numanology?- Why does he work at the local undertaker’s and what are those weird neon lights coming from the backyard?And what would the real Gary Numan think about all this? Five has been writing to Gary, perhaps one day he will receive a reply.Read the book to find out what Five discovers about the mysterious Storm Troopers, the damnable, girlfriend-stealing Ross and his sinister deeds!PLEASE NOTEThis book is not just for Gary Numan fans, but please be warned it does contain middle-aged men wearing eyeliner.Most of the characters come from Essex. If you are not familiar with that part of the United Kingdom, you may come away with rich cultural insights that change the way you perceive human existence.No lobsters or geography teachers were harmed in the writing of this book.If bad language offends you, It's probably best you read something from the cosy mystery section instead.This is book one in the Alternative 80s series.",
  "genres": [],
  "author": "Nicky Blue",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/49209958-numan-versus-numan"
}