{
  "title": "Forge of the High Mage",
  "description": "After decades of warfare, Malazan forces are now close to consolidating the Quon Talian mainland. Yet it is at this moment that Emperor Kellanved orders a new campaign far to the north: the invasion of Falar.Since the main Malazan armies are otherwise engaged in Quon Tali, a collection of orphaned units and broken squads has been brought together under Fist Dujek - himself recovering from the loss of an arm - to fight this new campaign. A somewhat rag-tag army, joined by a similarly motley fleet under the command of the Emperor himself.There are however those who harbour doubts regarding the stewardship of Kellanved and his cohort Dancer, and as the Malazan force heads north, it encounters an unlooked-for and most unwelcome threat - unspeakable and born of legend, it has woken and will destroy all who stand in its way. Most appalled by this is Tayschrenn, the untested High Mage of the Empire. He is all-too aware of the true nature of this ancient horror - and his own inadequacy in having to confront it. Yet confront it he must, alongside the most unlikely of allies . . .And then the theocracy of Falar is itself far from defenceless - its priests are in possession of a weapon so terrifying it has not been unleashed for centuries. Named the Jhistal, it was rumoured to be a gift from the sea-god Mael. But two can play at that game, for the Emperor sails towards Falar aboard his flagship Twisted - a vessel that is itself thought to be not entirely of this world . . .Here, then, in the tracts of the Ice Wastes and among the islands of Falar, the Empire of Malaz faces two seemingly insurmountable tests - each one potentially the origin of its destruction . . .These are bloody, turbulent and treacherous times for all caught up in the forging of the Malazan Empire.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Fiction",
    "High Fantasy",
    "Epic",
    "Dark Fantasy",
    "Audiobook"
  ],
  "author": "Ian C. Esslemont",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/49247224-forge-of-the-high-mage"
}