{
  "title": "Paige Not Found",
  "description": "An adventure story that examines consent and privacy in a way that books have not had to before this generation where everything is online.A week ago, if someone had told Paige she’d be stuck in traffic with three total strangers on a mission to stop a global organization from controlling their minds, she would have laughed. But somehow this is real life. She adjusts her noise cancelling headphones, trying to drown out more of the car horns and music blaring from a neighboring sedan. Her fists clench and unclench. Inside her shoes, her toes wiggle, trying to let out some of her nervous energy.As much as Paige hates the word normal, it’s a pretty good word to describe her life, and the kind of night she was having just before a single email turned her world upside down.In an effort to better understand and communicate with their autistic daughter, Paige's parents enrolled her in a study without her consent. Without her knowledge they had a chip implanted in her brain that keeps track of her location and brain activity. It can boost the chemicals that affect her mood. Suddenly, Paige isn’t sure who she can trust. Can she even trust her own mind anymore?Now the company that created her chip is days away from merging with the most popular social network in the world, that has a reputation for selling people’s private information to the highest bidder.Paige feels betrayed and like she’s been robbed of her free will. But there is one thing she can do. The email includes the names and addresses of the other kids involved in the study. She can track them down and show them what’s been done to them.Maybe altogether they can put a stop to this merger and figure out how to get their chips removed for good.",
  "genres": [
    "Middle Grade",
    "Science Fiction",
    "Autistic Spectrum Disorder",
    "LGBT",
    "Disability",
    "Queer",
    "Realistic Fiction"
  ],
  "author": "Jen  Wilde",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/124932771-paige-not-found"
}