{
  "title": "Paddled by Krampus",
  "description": "A kinky Holiday tale of strict discipline, hard spankings, and a monstrously large cock...  Alvina is a very bad girl. Instead of learning magic from her kind Master Jareth, she naps during lessons, lies, and steals his magic potions. When she overhears Jareth speak of his miraculous pleasure potion, she can't resist stealing some for herself. In the dead of night she guzzles the brew, and is overwhelmed with uncontrollable magical orgasms. Unlucky for her, Krampus - the monstrous punisher of the wicked - is wandering the woods on the night of her deceitful deed, and decides to punish her for her misbehavior.  Alvina is given a hard paddling by Krampus, helpless to escape as her magical arousal keeps her trapped in sensations of pleasure and pain. She's manhandled easily by the massive man-beast, dangled in the air and suspended to kick and struggle as she's spanked. Soon Alvina is begging for release, desperate to be stretched by Krampus's massive cock and filled with his seed. Alvina receives a final, painful caning from her handsome Master Jareth, as Krampus instructs him in the ways of punishing his wayward apprentice.  This kinky erotic short story is written in 3rd Person POV and is about 12k words in length. WARNING! This book contains scenes of kinky fantasy play and rough sex. It is intended only for adult audiences. These are the kinks within: erotic humiliation, scolding, spanking (paddling/caning), flogging, monster-f*cking, extra-large penetration, manhandling/rough sex, blowjobs, begging, crying, restraint, size difference, creampie/semen, briefly mentioned age gap. Also a pine tree gets involved. You probably shouldn't put pine needles on your genitals. You can...if you want...but you probably shouldn't...just read about it instead.",
  "genres": [
    "Christmas",
    "Novella",
    "Erotica",
    "Holiday",
    "Fantasy",
    "Romance",
    "Monsters"
  ],
  "author": "Harley Laroux",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/49234154-paddled-by-krampus"
}