{
  "title": "Women in the Holocaust",
  "description": "As Jews throughout Europe faced Nazi persecution, Jewish women?wives, daughters, mothers?encountered special problems and had particular vulnerabilities. This is the first book of original scholarship devoted to women in the Holocaust. By examining women’s unique responses, their incredible resourcefulness, their courage, and their suffering, the book enhances our understanding of the experiences of all Jews during the Nazi era.The introductory essay by Lenore Weitzman and Dalia Ofer stakes out new intellectual territory and shows how questions about gender lead to a richer and more finely nuanced understanding of the Holocaust. Testimonies of Holocaust survivors, written especially for this book, shed light on women’s lives in the ghettos, the Jewish resistance movement, and the concentration camps. The narratives personalize and exemplify many of the larger themes explored in other chapters by Holocaust historians, sociologists, and literary experts. These chapters explore the variety and complexity of gender differences during the Holocaust. The culturally defined prewar roles of Jewish men and women endowed them with different spheres of knowledge, expertise, and skills with which to face the Nazi onslaught. During the war the Nazis imposed different regulations, work requirements, and sanctions on the two sexes. Women had to assume new roles as family protectors during the ghetto period, when men were more vulnerable. In contrast women, and especially mothers, were more vulnerable in the concentration camps. The detailed portraits of women in these chapters show us their individuality, strength, and humanity.Contributors to this Gershon BaconYehuda BauerDaniel BlatmanGisela BockRuth BondyLiza ChapnikIda FinkMyrna GoldenbergSara R. HorowitzPaula E. HymanMarion KaplanFelicja KarayBronka KlibanskLawrence L. LangerDalia OferRenée PoznanskiJoan RingelheimNechama TecMichal UngerLidia Rosenfeld VagoLenore J. Weitzman",
  "genres": [
    "History",
    "Holocaust",
    "Nonfiction",
    "Judaism"
  ],
  "author": "Professor Dalia Ofer",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/4924432-women-in-the-holocaust"
}