{
  "title": "The Forgotten Kingdom",
  "description": "The story continues in The Forgotten Kingdom, the second book in the astonishing Lost Queen trilogy, already hailed as “Outlander meets Camelot” (Kirsty Logan) and “The Mists of Avalon for a new generation” (Linnea Hartsuyker).AD 573. Imprisoned in her chamber, Languoreth awaits news in torment. Her husband and son have ridden off to wage war against her brother, Lailoken. She doesn’t yet know that her young daughter, Angharad, who was training with Lailoken to become a Wisdom Keeper, has been lost in the chaos. As one of the bloodiest battles of early medieval Scottish history scatters its survivors to the wind, Lailoken and his men must flee to exile in the mountains of the Lowlands, while nine-year-old Angharad must summon all Lailoken has taught her and follow her own destiny through the mysterious, mystical land of the Picts.In the aftermath of the battle, old political alliances unravel, opening the way for the ambitious adherents of the new religion: Christianity. Lailoken is half-mad with battle sickness, and Languoreth must hide her allegiance to the Old Way to survive her marriage to the next Christian king of Strathclyde. Worst yet, the new King of the Angles is bent on expanding his kingdom at any cost. Now the exiled Lailoken, with the help of a young warrior named Artur, may be the only man who can bring the Christians and the pagans together to defeat the encroaching Angles. But to do so, he must claim the role that will forever transform him. He must become the man known to history as “Myrddin.”Bitter rivalries are ignited, lost loves are found, new loves are born, and old enemies come face-to-face with their reckoning in this compellingly fresh look at one of the most enduring legends of all time.",
  "genres": [
    "Historical Fiction",
    "Fantasy",
    "Fiction",
    "Historical",
    "Audiobook",
    "Scotland",
    "Historical Fantasy"
  ],
  "author": "Signe Pike",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/49249855-the-forgotten-kingdom"
}