{
  "title": "Fire on the Island",
  "description": "A Romantic Thriller For lovers of crime fiction and the allure of the Greek islands, Fire on the Island is the perfect summer read. Fire on the Island is a playful, romantic thriller set in contemporary Greece, with a gay Greek-American FBI agent, who is undercover on the island to investigate a series of mysterious fires. Set against the very real refugee crisis on the beautiful, sun-drenched Greek islands, this novel paints a loving portrait of a community in crisis. As the island residents grapple with declining tourism, poverty, refugees, family feuds, and a perilously damaged church, an arsonist invades their midst. Nick Damigos, the FBI agent, arrives on the island just in time to witness the latest fire and save a beloved truffle-sniffing dog. Hailed as a hero and embraced by the community, Nick finds himself drawn to Takis, a young bartender who becomes his primary suspect, which is a problem because they're having an affair. Theirs is not the only complicated romance in the community and Takis isn't the only suspicious character on the island. The priest is an art forger, a young Albanian waiter harbors a secret, the captain of the coast guard station seems to have his own agenda, and the village itself hides a violent history. Nick has to unravel the truth in time to prevent catastrophe, as he comes to terms with his own past trauma. In saving the village, he will go a long way toward saving himself. A long time devotee of the Greek islands, Smith paints the setting with gorgeous color and empathy, ushering in a new romantic thriller with the charm of Zorba the Greek while shedding bright light on the very real challenges of life in contemporary Greece.",
  "genres": [
    "Fiction",
    "Mystery",
    "LGBT",
    "Thriller",
    "Gay",
    "Romance",
    "Greece"
  ],
  "author": "Timothy Jay Smith",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/49249815-fire-on-the-island"
}