{
  "title": "Hill Women: Finding Family and a Way Forward in the Appalachian Mountains",
  "description": "After rising from poverty to earn two Ivy League degrees, an Appalachian lawyer pays tribute to the strong \"hill women\" who raised and inspired her, and whose values have the potential to rejuvenate a struggling region--an uplifting and eye-opening memoir for readers of Hillbilly Elegy and Educated.Nestled in the Appalachian mountains, Owsley County is one of the poorest counties in both Kentucky and the country. Buildings are crumbling and fields sit vacant, as tobacco farming and coal mining decline. But strong women are finding creative ways to subsist in their hollers in the hills.Cassie Chambers grew up in these hollers and, through the women who raised her, she traces her own path out of and back into the Kentucky mountains. Chambers's Granny was a child bride who rose before dawn every morning to raise seven children. Despite her poverty, she wouldn't hesitate to give the last bite of pie or vegetables from her garden to a struggling neighbor. Her two daughters took very different strong-willed Ruth--the hardest-working tobacco farmer in the county--stayed on the family farm, while spirited Wilma--the sixth child--became the first in the family to graduate from high school, then moved an hour away for college. Married at nineteen and pregnant with Cassie a few months later, Wilma beat the odds to finish school. She raised her daughter to think she could move mountains, like the ones that kept her safe but also isolated her from the larger world.Cassie would spend much of her childhood with Granny and Ruth in the hills of Owsley County, both while Wilma was in college and after. With her \"hill women\" values guiding her, Cassie went on to graduate from Harvard Law. But while the Ivy League gave her knowledge and opportunities, its privileged world felt far from her reality, and she moved back home to help her fellow rural Kentucky women by providing free legal services.Appalachian women face issues that are all too domestic violence, the opioid crisis, a world that seems more divided by the day. But they are also community leaders, keeping their towns together in the face of a system that continually fails them. With nuance and heart, Chambers uses these women's stories paired with her own journey to break down the myth of the hillbilly and illuminate a region whose poor communities, especially women, can lead it into the future.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Audiobook",
    "Biography Memoir",
    "Feminism"
  ],
  "author": "Cassie Chambers",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/49249313-hill-women"
}