{
  "title": "Hollywood vs. America: The Explosive Bestseller that Shows How-and Why-the Entertainment Industry Has Broken Faith With Its Audience",
  "description": "Why does our popular culture seem so consistently hostile to the values that most Americans hold dear? Why does the entertainment industry attack religion, glorify brutality, undermine the family, and deride patriotism? In this explosive book, one of the nation's best known film critics examines how Hollywood has broken faith with its public, creating movies, television, and popular music that exacerbate every serious social problem we face, from teenage pregnancies to violence in the streets. Michael Medved powerfully argues that the entertainment business follows its own dark obsessions, rather than giving the public what it In fact, the audience for feature films and network television has demonstrated its profound disillusionment in recent years, with disastrous consequences for many entertainment companies. Meanwhile, overwhelming numbers of our fellow citizens complain about the wretched quality of our popular culture--describing the offerings of the mass media as the worst ever. Medved asserts that Hollywood ignores--and assaults--the values of ordinary American families, pursuing a self-destructive and alienated ideological agenda that is harmful to the nation at large and to the industry's own interests. In hard-hitting chapters on \"The Attack on Religion,\" \"The Addiction to Violence,\" \"Promoting Promiscuity,\" \"The Infatuation with Foul Language,\" \"Kids Know Best,\" \"Motivations for Madness,\" and other subjects, Medved outlines the underlying themes that turn up again and again in our popular culture. He also offers conclusive evidence of the frightening real-world impact of these messages on our society and our children. Finally, Medved shows where and how Hollywood took a disastrous wrong turn toward its current crisis, and he outlines promising efforts both in and outside the industry to restore a measure of sanity and restraint to our media of mass entertainment. Sure to elicit strong response, whether it takes the form of cheers of support or howls of enraged dissent, Hollywood vs. America confronts head-on one of the most significant issues of our times.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Cultural",
    "Film",
    "History",
    "Sociology",
    "American"
  ],
  "author": "Michael Medved",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/49257.Hollywood_vs_America"
}