{
  "title": "Joseph Brant and His World: 18th Century Mohawk Warrior and Statesman",
  "description": "Joseph Brant was a promising but undistinguished Mohawk warrior living in upper New York State. He became an innovative, influential leader and spokesperson for First Nations, whose support for Britain during the American Revolution led to their resettlement in Upper Canada along the Grand River. Their descendants live today on the large Six Nations Reserve alongside the Grand, south of Brantford in southwestern Ontario.This new, illustrated biography of Brant reflects recent research into the political, social and cultural background of his life. Author James Paxton rejects the interpretation of earlier biographers, who depicted Brant as a man who belonged neither to the \"Indian\" or the \"white\" world. Paxton shows that Brant was fully Mohawk, with Iroquoian values that stressed the interdependence of people. He stands as the product of a unique, multicultural 18th-century community in the Mohawk Valley, New York.Using skill and diplomacy and his dense network of relationships and alliances, Brant attempted to ensure the ongoing social, economic and political autonomy of the Six Nations in their new Canadian territory.The events of Brant's day impinge directly on our own. It would be hard to imagine the standoff at Caledonia had Brant not led the Six Nations to the Grand River area and then invited Loyalists to settle among them. Yet, in 1784, Mohawks and Loyalists envisioned a different sort of community, one bound by history, common interest and shared practices. At a time when First Nations' claims against the government promise to become more numerous and confrontational, this book encourages us to consider the inclusive and multicultural legacy of Joseph Brant.Table of ContentsContentsA Note on Terminology1. Joseph Brant's World2. Storm Clouds3. The Whirlwind4. Alliances5. IsolationEpilogueSites of InterestSelected BibliographyAcknowledgementsVisual CreditsIndex",
  "genres": [],
  "author": "James Paxton",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/4928115-joseph-brant-and-his-world"
}