{
  "title": "The Guard Trilogy #1 - 3",
  "description": "A Three-Part Urban Fantasy/Paranormal Mystery If you appreciate brilliant urban fantasy or paranormal mysteries involving everyday people, you'll love this entertaining three-part trilogy.Ottawa, the capital of Canada, is considered the 3rd cleanest city in the world and rated the 2nd highest quality of living of any big city in the Americas, but unless you're Canadian you probably wouldn't know any of that stuff. And it's all very nice and well, but boring as hell.... That's what four unsuspecting girlfriends thought, until their good friend Lynn Westlake came home to visit, and they found themselves in the biggest mystery and adventure of their normal boring lives.The Guard - The Guard Trilogy Book 1 A flash of something in the pages caught my eye, and I stopped. Thumbing back through the pages again, slower this time, I found it. It was about an inch thickness in... Mom's handwriting... pages of it.When a woman linked to the supernatural, discovers her adoptive mother's journal holds a cryptic mystery, she and her closest friends race to uncover a secret matriarchal society safeguarded by mystical unseen forces.What if Cancer wasn't just an illness or evil sickness that took our loved ones? What if it's something bigger--a sacrifice or choice to keep humanity safe--to keep the balance?The Unseen - The Guard Trilogy Book 2Shivers.Nausea.Dread. Those sensations were back. The same ones I'd had seeing the dark figure under the streetlight, and at the airport.Anguish.Pain, and sorrow... darkness... death. The friends Lynn needs to solve this mystery are the same people she's been trying to convince for years of things seen and unseen. When the mothers of daughters no longer hold the key, the four must come together to solve the mystery and keep the balance. They must accept that sometimes what you believe may not always be the truth, and that family is sometimes more than blood.What if magic was real? What if everything you believed about angels as a child was real--what if evil was real?The Believer - The Guard Trilogy Book 3I was picking up on something... ominous, weighing on me... threatening, reminiscent of horror movies where at any minute the bad guy might pounce on the unsuspecting teenagers. Something played at the edge of my vision... When Lynn's life of obscure gifts of insight intensifies, venturing out alone feels like the only option for solving the mystery. Lynn's open mind concerning the paranormal is a result of her sometimes-creepy insight, but when faced with things greater than her little premonitions, she struggles with her own denial, lacking the ability to get out of her own way.What if it was your DNA, your ancestry, and not your choices, that had impact on whether you turned out good or evil? What if your choices were your destiny?",
  "genres": [
    "Fantasy"
  ],
  "author": "N.L. Westaway",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/49253703-the-guard-trilogy-1---3"
}