{
  "title": "The Year's Best Fantasy and Horror: Thirteenth Annual Collection",
  "description": "For more than a decade, readers have turned to The Year's Best Fantasy and Horror to find the most rewarding fantastic short stories. Ellen Datlow and Terri Windling continue their critically acclaimed and award-winning tradition with another stunning collection of stories. The fiction and poetry here is culled from an exhaustive survey of the field, nearly four dozen stories ranging from fairy tales to gothic horror, from magical realism to dark tales in the Grand Guignol style. Rounding out the volume are the editors' invaluable overviews of the year in fantasy and horror, and a long list of Honorable Mentions, making this an indispensable reference as well as the best reading available in fantasy and horror.ContentsSummation 1999: Fantasy, Terri WindlingSummation 1999: Horror, Ellen DatlowHorror and Fantasy in the Media: 1999, Edward BryantComics: 1999, Seth JohnsonObituaries: 1999, James FrenkelDarkrose and Diamond, Ursula K. Le GuinThe Chop Girl, Ian R. MacLeodThe Girl Detective, Kelly LinkThe Transformation, N. Scott MomadayCarabosse, Delia ShermanHarlequin Valentine, Neil GaimanToad, Patricia A. McKillipThe Dinner Party, Robert GirardiHeat, Steve Rasnic TemThe Wedding at Esperanza, Linnet TaylorRedescending, Ursula K. Le GuinYou Don't Have to be Mad . . .Kim NewmanThe Paper-Thin Garden, Thomas WhartonThe Anatomy of a Mermaid, Mary SharrattThe Grammarian's Five Daughters, Eleanor ArnasonThe Tree Is My Hat, Gene WolfeWelcome, Michael Marshall SmithThe Pathos of Genre, Douglas E. WinterShatsi, Peter CrowtherKeepsakes and Treasures: A Love Story, Neil GaimanWhat You Make It, Michael Marshall SmithThe Parwat Ruby, Delia ShermanOdysseus Old, Geoffrey BrockThe Smell of the Deer, Kent MeyersChorion and the Pleiades, Sarah Van ArsdaleCrosley, Elizabeth Engstromn0 Naming the Dead, Paul J. McAuleyThe Stork-Men, Juan GoytisoloThe Disappearance of Elaine Coleman, Steven MillhauserWhite, Tim LebbonDear Floods of Her Hair, James SallisMrs. Santa Decides to Move to Florida, April SelleyTanuki, Jan HodgmanAt Reparata, Jeffrey FordSkin So Green and Fine, Wendy WheelerOld Merlin Dancing on the Sands of Time, Jane YolenSailing the Painted Ocean, Denise LeeGrandmother, Laurence SnydalSmall Song, Gary A. BraunbeckThe Emperor's Old Bones, Gemma FilesThe Duke of Wellington Misplaces His Horse, Susanna ClarkeHalloween Street, Steve Rasnic TemThe Kiss, Tia V. TravisThe Beast/The Hedge, Bill LewisPixel Pixies, Charles de LintFalling Away, Elizabeth BirminghamHonorable Mentions: 1999",
  "genres": [
    "Fantasy",
    "Horror",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Speculative Fiction",
    "Dark Fantasy"
  ],
  "author": "Ellen Datlow",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/492979.The_Year_s_Best_Fantasy_and_Horror"
}