{
  "title": "The Poetics of Passion",
  "description": "In 1872 London, a scandalous love poetess and a passionate children's book illustrator are set at odds in this sparkling enemies-to-lovers historical romance, the first in the Muses of Scandal series.A secret identity means secret desires—and not-so-secret scandals . . .Musa Bartham has a secret. To support her destitute family after her father’s disappearance, she’s been publishing steamy poetry under the pen name of Felicity Vita. As Felicity Vita, Musa’s scandalous books have won legions of devoted fans—including an anonymous gentleman pen pal whose letters spark unruly desires she would never ever succumb to in her orderly daily life. But when Musa’s cherished younger sister, Angela, is offered sponsorship by their aristocratic great-aunt for an advantageous marriage, Musa realizes her dangerous double life as Felicity must come to an end. Instead, she’ll write books for children.Sebastian Atkinson is a passionate artist reduced to working nights as a printer. Though Seb is infuriated by the prim yet alluring young woman who corners him into illustrating her insipid children’s book, he can’t turn Musa away: he suspects she may be Felicity Vita, the seductive poetess with whom he’s been exchanging love letters for the past year. Egged on by his best friend, an ambitious journalist desperate for a break, Seb seeks to unmask Musa’s secret identity. But the closer Seb comes to the truth, the more Musa entices him—and the more Musa finds Seb curiously attractive and even more curiously familiar. Could he have anything to do with her anonymous gentleman pen pal?Unable to resist each other, the two shift from enemies to lovers just as their love letters are stolen, setting Angela's future at risk. As Seb and Musa frantically come together to contain the damage before it's too late, it’s uncertain whose hearts and lives will be broken amid the most sensational scandal of all.Includes an expanded excerpt from The Dance of Desire, the second book in the Muses of Scandal series. “A beguiling Victorian romance filled with secret identities, hidden passion, and family loyalty . . . for fans of Evie Dunmore, Mimi Matthews, and Emily Sullivan.\" — Historical Novel Review“Charming and sexy . . . Ross’s debut historical romance is definitely a novel that will enchant readers!” — ELIZA KNIGHT, USA Today bestselling author“Chock full of compelling characters, charm, and heartfelt emotion. I fell in love with Sebastian and Musa and their loyalty to their families above all else, even when their love was on the line.”— HARPER ST. GEORGE, author of THE DUCHESS TAKES A HUSBAND“A story of hidden identities, secret longings, and the conflict of familial duty versus private pleasure, Delphine Ross conjures . . . the era with a master hand. A fascinating read!”–MIMI MATTHEWS, USA Today bestselling author of THE BELLE OF BELGRAVE SQUARE",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Victorian",
    "Enemies To Lovers",
    "Fiction"
  ],
  "author": "Delphine Ross",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/124939354-the-poetics-of-passion"
}