{
  "title": "The Selected Writings of Edgar Allan Poe",
  "description": "Enormously popular and widely admired, Edgar Allan Poe occupies an extraordinary place in American literature. Technically skillful and spiritually haunting, Poe's body of work poems, tales, a novel, and essays—awakens readers to the darker side of humanity. This Norton Critical Edition includes Poe's most important writing, introduced, annotated, and edited by leading Poe scholar G. R. Thompson.\"Backgrounds and Contexts\" includes fifty-seven judiciously chosen documents that illuminate Poe's short but prolific career, among them Poe's reviews, prefaces, and related correspondence as well as thematic pieces dealing with Transcendentalism and alternative Romanticism, psychological science, sensation fiction, and slavery and the South.Fourteen critical essays address the major themes and genres of Poe's work. Among the contributors are Richard Wilbur, Grace Farrell, Barton Levi St. Armand, J. Gerald Kennedy, and John T. Irwin. A Selected Bibliography and an Index to Works and First Lines of Poems are also included.--back coverTable of ContentsAcknowledgments\tEdgar A. Poe—An American Life (1809-1849)\tA Note on Texts and Annotations\tThe Texts of The Selected Writings of Edgar Allan Poe\tPOEMS\tIntroduction\tTamerlane\tDreams\tSpirits of the Dead\tEvening Star\tImitation\tStanzas: In Youth\tA Dream\tThe Happiest Day\tThe Lake\tSonnet—To Science\tAl Aaraaf\tIntroduction\tFairyland [1]\tFairyland [2]\tAlone\tTo Helen [Stanard]\tIsrafel\tThe Sleeper\tThe Valley of Unrest\tThe City in the Sea\tThe Coliseum\tSonnet—Silence\tDream-Land\tThe Raven\tUlalume—A Ballad\tThe Bells\tTo Helen [Whitman]\tA Dream Within a Dream\tFor Annie\tEldorado\tAnnabel Lee\tTALES AND SKETCHES\tIntroduction\tMetzengerstein\tLoss of Breath [A Decided Loss]\tMS. Found in a Bottle\tThe Assignation [The Visionary]\tLionizing [Some Passages in the Life of a Lion]\tShadow\tSilence\tBerenice\tKing Pest\tLigeia\tHow to Write a Blackwood Article\tA Predicament [The Scythe of Time]\tThe Man That Was Used Up\tThe Fall of the House of Usher\tWilliam Wilson\tThe Man in the Crowd\tThe Murders in the Rue Morgue\tA Descent into the Maelström\tThe Colloquy of Monos and Una\tNever Bet the Devil Your Head\tThe Oval Portrait [Life in Death]\tThe Masque of the Red Death\tThe Pit and the Pendulum\tThe Tell-Tale Heart\tThe Gold-Bug\tThe Black Cat\tThe Premature Burial\tThe Purloined Letter\tSome Words with a Mummy\tThe Power of Words\tThe Imp of the Perverse\tThe Facts of the Case of M. Valdemar\tThe Cask of Amontillado\tHop-Frog\tThe Narrative of Arthur Gordon Pym\tSelections from Eureka\tBackgrounds and Contexts\tEdgar Allan Poe—Preface to Tamerlane and Other Poems\tEdgar Allan Poe—To B__________ (July 1836)\tEdgar Allan Poe—To Joseph T. and Edwin Buckingham (May 4, 1833)\tEdgar Allan Poe—Preface to Tales of the Folio Club\tEdgar Allan Poe—To T. W. Hite (April 30, 1835)\tEdgar Allan Poe—Review of Theodore Fay, Norman Leslie\tEdgar Allan Poe—Review of Morris Mattson, Paul Ulric\tJ. P. Kennedy—To Edgar Allan Poe (February 9. 1836)\tEdgar Allan Poe—To J. P. Kennedy (February 11, 1836)\tJ. K. Paulding—To T. W. White (March 3, 1836)\tEdgar Allan Poe—Review of Drake & Halleck (April 1836)\tEdgar Allan Poe—To Harrison Hall (September 2, 1836)\tEdgar Allan Poe—Review of Robert M. Bird, Sheppard Lee (September 1836)\tEdgar Allan Poe—Review of Baron de la Motte Fouqué, Undine (September 1839)\tEdgar Allan Poe—To Philip P. Cooke (September 21, 1839)\tEdgar Allan Poe—Review of Thomas Moore, Alciphron\tEdgar Allan Poe—Preface to Tales of the Groesque and Arabesque\tEdgar Allan Poe—Prospectus for Penn Magazine\tEdgar Allan Poe—To William E. Burton (June 1, 1840)\tEdgar Allan Poe—Review of Edward Lytton Bulwer, Night and Morning\tEdgar Allan Poe—Review of Lambert A. Wilmer, Quacks of Helicon\tEdgar Allan Poe—Excordium to Critical Notices\tEdgar Allan Poe—Review of Henry Wadsworth Longfellow, Ballads and Other Poems\tEdgar Allan Poe—Two Reviews of Nathaniel Hawthorne, Twice-Told Tales\tEdgar Allan Poe—To J. E. Snodgrass (June 4, 1842)\tEdgar Allan Poe—To James Russell Lowell (July 2, 1844)\tEdgar Allan Poe—Preface to the Marginalia series\tJames Russell Lowell—Our Contributors . . . Edgar Allan Poe\tAnonymous [Edgar Allan Poe]—Review of Henry Wadsworth Longfellow\tEdgar Allan Poe—Review of Thomas Hood, Prose and Verse\tUnsigned Review—Tales of Edgar Allan Poe\tEdgar Allan Poe—Preface to The Raven and Other Poems\tEdgar Allan Poe—The Philosophy of Composition\tEdgar Allan Poe—To P. P. Cooke (August 9, 1846)\tEdgar Allan Poe—Review of Nathaniel Hawthorne, Twice-Told Tales and Mosses from an Old Manse\tEdgar Allan Poe—The Poetic Principle\tEdgar Allan Poe—A Reviewer Reviewed\tGeorge Graham—The Later Edgar Poe\tCharles Baudelaire—Edgar Allan Poe: His Life and Works\tWalt Whitman—[Edgar Poe's Significance]\tTRANSCENDENTALISM AND ALTERNATIVE ROMANTICISM\tIntroduction\tFrederic Henry Hedge—On Immanuel Kant and German Transcendentalism\tFriedrich Schlegel—Fragments from Lyceum, Athenaeum, and Dialogue of Poesie\tAugust Wilhelm Schlegel—The Tragic; The Comic\tJean Paul Friedrich Richter—Humoristic Subjectivity\tSCIENCES OF THE MIND\tIntroduction\tLavater, Gall, and Spurzheim—From Physiognomical System of Dr. Gall and Spurzheim\tOrson S. Fowler—From Fowler's Practical Phrenology\tThomas C. Upham—From Outlines of Imperfection and Disordered Action\tPOPULAR FICTION: BLACKWOOD'S AND THE SENSATION TALE\tIntroduction\tAnonymous—Extracts from Gosschen's Diary\tAnonymous—The Buried Alive\tWilliam Maginn—The Man in the Bell\tTHE SOUTH AND SLAVERY\tIntroduction\tJames E. Heath—Southern Literature\tAnonymous—Slavery\tEdgar Allan Poe—To Beverley Tucker (May 2, 1836)\tJ. V. Ridgely—The Authorship of the Paulding-Drayton Review\tEdgar Allan Poe—To J. E. Snodgrass (June 17, 1840)\tCriticism\tIntroduction\tFloyd Stovall—[Poetry, Imagination, and Cosmos: Poe's Debt to Coleridge]\tRobert C. McLean—[Poetic Theory and Affective Poetry: Poe and George Tucker]\tRichard Wilbur—The House of Poe\tJames W. Gargano—The Question of Poe's Narrators\tJoseph J. Moldenhauer—Murder as a Fine Art: Basic Connections between Poe's Aesthetics, Psychology, and Moral Vision\tPaul John Eakin—Poe's Sense of an Ending\tGrace Farrell—The Quest of Arthur Gordon Pym\tLiahna Klenman Babener—The Shadow's Shadow: The Motif of the Double in Edgar Allan Poe's \"The Purloined Letter\"\tBarton Levi St. Armand—The \"Mysteries\" of Edgar Poe: The Quest for a Monomyth in Gothic Literature\tJoseph N. Riddel—The \"Crypt\" of Edgar Allan Poe\tJ. Gerald Kennedy—Phantasms of Death in Poe's Fiction\tJohn Carlos Rowe—Poe, Antebellum Slavery, and Modern Criticism\tTerence Whalen—Average Racism: Poe, Slavery, and the Wages of Literary\tNationalism\tJohn T. Irwin—Detective Fiction as High Art: Lacan, Derrida, and Johnson on \"The Purloined Letter\"\tSelected Bibliography",
  "genres": [
    "Classics",
    "Horror",
    "Fiction",
    "Poetry",
    "Short Stories",
    "Gothic",
    "Mystery"
  ],
  "author": "Edgar Allan Poe",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/49338.The_Selected_Writings_of_Edgar_Allan_Poe"
}