{
  "title": "The Shoe Bird: A Musical Fable by Samuel Jones. Based on a Story by Eudora Welty",
  "description": "Seventy years ago the musical fable “Peter and the Wolf” unexpectedly took the world by storm. Written and composed by the Russian Serge Prokofiev, this droll story for narrator and orchestra has sold millions of recordings in countless versions, narrated by great performers from Sir John Gielgud to Sting. The only problem up until now has been that “Peter and the Wolf” – composed specifically for children, and featuring a narrator with orchestra - is practically the only piece of its kind. The vast audience that loves “Peter” has not been able to find a similarly enchanting musical story. But now all that will change! The Shoe Bird has arrived! In The Shoe Bird multi-Grammy-award-winning performer and Guinness World Records™ holder Jim Dale brings to life a flock of unforgettable bird characters – Arturo the parrot, Gloria the goose, Minerva the owl, even the extinct Dodo! This is Eudora Welty’s fantastical story of how some feathered friends made a fateful switch from flying to wearing shoes, little knowing that they would soon become the prey of Freddy the Cat! Masterfully scored for full symphony orchestra and children’s choirs by Welty’s fellow Mississippian Samuel Jones, The Shoe Bird appeals immediately to children and adults, just like the classic Peter and the Wolf. The Shoe Bird is a new work that reinvigorates a great tradition of storytelling fun for the whole family. It can be heard again and again, always rewarding the listener with the wit and wisdom of Eudora Welty, the delightful animal characters impersonated by Jim Dale, and the rich musical background of full symphony orchestra and chorus. Jim Dale is very enthusiastic and ready to promote The Shoe Bird which he considers one of his favorite recording projects.",
  "genres": [
    "Childrens",
    "Music",
    "Audiobook",
    "Juvenile"
  ],
  "author": "Samuel Jones",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/4930621-the-shoe-bird"
}