{
  "title": "Edgar Allan Poe: Poetry & Tales",
  "description": "Read throughout the world, admired by Dostoyevsky and translated by Baudelaire, Edgar Allan Poe has become a legendary figure, representing the artist as obsessed outcast and romantic failure. His nightmarish visions, shaped by cool artistic calculation, reveal some of the dark possibilities of human experience. His enormous popularity and his continuing influence of literature depend less on legend or vision than on his stylistic and formal accomplishments as a writer of fiction and a great lyric poet.In this complete and uniquely authoritative Library of America collection, well-known tales of “mystery and imagination” and his best-known verse are collected with early poems, rarely published stories and humorous sketches, and the ecstatic prose poem Eureka.But his enormous popularity and his continuing influence on literature depend less on legend or vision than on his stylistic and formal accomplishments as a writer of fiction and as a great lyric poet (“always for all lands,” as Yeats said), famous for the sensuous musicality of “To Helen,” “The City in the Sea,” and “Annabel Lee” and for the hypnotic, incantatory rhythms of “The Raven” and “Ulalume.”“The Fall of the House of Usher” and “The Cask of Amontillado” show Poe’s mastery of Gothic horror; his “The Pit and the Pendulum” is a classic of terror and suspense. He invented the modern detective story, as in “The Murders in the Rue Morgue,” and developed the form of science fiction that was to influence, among others, Jules Verne and Thomas Pynchon.Poe was also adept at the humorous sketch of playful jeu d’esprit, such as “X-ing a Paragraph” or “Never Bet the Devil Your Head.” All his stories reveal his high regard for technical proficiency and for what he called “ratiocination.”Poe’s fugitive early poems, stories rarely collected (such as “Bon-Bon,” “King Pest,” “Mystification,” and \"The Duc De L’Omelette), his only attempt at drama, \"Politian\"—these and much more are included in this comprehensive collection, presented chronologically to show Poe’s development as a writer, his oeuvre culminates in his vision of an indeterminate universe, Eureka: A Prose Poem, his culminating vision of an indeterminate universe, printed here for the first time as Poe revised it and intended it should stand.A special feature of this volume is the care taken to select an authoritative text of each work. The printing and publishing history of every item has been investigated in order to choose a version that incorporates all of Poe’s own revisions without reproducing the errors or changes introduced by later editors. Here, then, is one of America’s and the world’s most disturbing, powerful, and inventive writers published in “the first truly dependable collection of Poe’s poetry and tales.”",
  "genres": [
    "Poetry",
    "Horror",
    "Classics",
    "Fiction",
    "Short Stories",
    "Literature",
    "Gothic"
  ],
  "author": "Edgar Allan Poe",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/49339.Edgar_Allan_Poe"
}