{
  "title": "The Inevitable Fall of Christopher Cynster",
  "description": "#1 New York Times bestselling author Stephanie Laurens returns to the Cynsters' next generation with a rollicking tale of smugglers, counterfeit banknotes, and two people falling in love.A gentleman hoping to avoid falling in love and a lady who believes love has passed her by are flung together in a race to unravel a plot to undermine the realm.Christopher Cynster has finally accepted that to have the life he wants, he needs a wife, but before he can even think of searching for the right lady, he's drawn into an investigation into the distribution of counterfeit banknotes.London born and bred, Ellen Martingale is battling to preserve the fiction that her much-loved uncle, Christopher's neighbor, still has his wits about him, but Christopher's questions regarding nearby Goffard Hall trigger her suspicions. As her younger brother attends card parties at the Hall, she feels compelled to investigate.While Ellen appears to be the sort of frippery female Christopher abhors, he quickly learns that, in her case, appearances are deceiving. And through the twists and turns in an investigation that grows ever more serious and urgent, he discovers how easy it is to fall in love, while Ellen learns that love hasn't, after all, passed her by.But then the villain steps from the shadows, and love's strengths and vulnerabilities are put to the test—just as Christopher has always feared. Will he pass muster? Can they triumph? Or will they lose all they've so recently found?A historical romance with a dash of intrigue, set in rural Kent. A Cynster Next Generation novel—a full-length historical romance of 124,000 words.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Audiobook",
    "Historical Fiction",
    "Mystery",
    "Regency Romance"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/49349672-the-inevitable-fall-of-christopher-cynster"
}