{
  "title": "JFK: Coming Of Age In The American Century, 1917-1956",
  "description": "A Pulitzer Prize-winning historian takes us as close as we have ever been to the real John F. Kennedy in the first truly definitive biography of the elusive 35th president.By the time of his assassination in 1963, John F. Kennedy stood at the helm of the greatest power the world had ever seen, a booming American nation he had steered through some of the most perilous diplomatic standoffs of the Cold War era. Born in 1917 to a striving Irish American family that had ascended the ranks of Boston's labyrinthine political machine, Kennedy was bred for government, and his meteoric rise to become the youngest elected president ever cemented his status as one of the most mythologized political figures in American history. And yet, in the decades since his untimely death, hagiographic portrayals of his dazzling charisma, reports of his extramarital affairs, and disagreements over his political legacy have made our 35th president more mysterious than ever--a problem further exacerbated by the fact that no genuinely comprehensive account of his life has yet been attempted.Beckoned by this gap in our historical knowledge, Fredrik Logevall has spent seven years searching for the \"real\" JFK. The result of this prodigious effort is a sweeping two-volume biography that, for the first time, properly contextualizes Kennedy amidst the roiling American Century. Beginning with the three generations of Kennedy men and women who transformed the clan from working-class Irish immigrants to members of Boston's political elite, Volume One spans the first thirty-nine years of JFK's life, from sickly second son to restless Harvard undergraduate and World War II hero, through his ascendance on Capitol Hill and, finally, his decision to run for president.In chronicling Kennedy's extraordinary life and times, Logevall offers the clearest portrait we have of an iconic, yet still elusive, American president.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Politics",
    "Presidents",
    "American History",
    "Biography Memoir"
  ],
  "author": "Fredrik Logevall",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/49350179-jfk"
}