{
  "title": "The Billionaire's Black Book",
  "description": "She's been sent into the lair of the beast...Newspaper writer Bonnie Hamelin has just been handed a dream assignment from her senior editor—an exclusive interview with billionaire author Jack R. R. Bestia, whose hugely popular fantasy series has been made into a hit cable show adored by millions of fans worldwide. Correction—it should be a dream assignment, but for Bonnie, the prospect of interviewing this particular author seems more like a nightmare. It’s not just that he has a reputation for being reclusive and temperamental. And it’s not that she doesn’t like Jack’s books—in fact, she loves them—a little too much. He’s her favorite author of all-time. But the first (and last) time they met… well, let’s just say she didn’t make the best impression. Superstar author Jack Bestia does not have any interest in doing an interview. He does have: -a huge deadline looming-a strong preference for privacy-some pretty nasty scars from his last relationship-and a big, BIG secret. He doesn’t want a snooping reporter anywhere near his seaside Newport, Rhode Island mansion. Unfortunately, his publisher isn’t interested in his preferences, his schedule, or his excuses. The seventh and final book in his bestselling series is two years overdue, and Jack’s on thin ice, at risk of getting cut from the publishing house altogether. He has no choice but to welcome Bonnie into his private world. But he doesn’t have to make it easy for her. He’ll act every bit as beastly as the tabloids have claimed he does, and she won’t want to spend a minute longer in his presence than absolutely necessary. That plan—and an iron-clad non-disclosure agreement—will ensure that no one finds out the awful truth. When Bonnie’s curiosity gets the better of her and she sees the wrong thing at the wrong time in the wrong place… Jack takes drastic measures, forcing her to stay in his secluded seaside castle until his new book comes out, a virtual prisoner. It’s the only way to protect his secret. Unfortunately, he failed to anticipate the effect this clever and determined beauty might have on his household… and his heart.",
  "genres": [
    "Romance"
  ],
  "author": "Amy DeLuca",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/49357095-the-billionaire-s-black-book"
}