{
  "title": "Remedios: Stories of Earth and Iron from the History of Puertorriquenas",
  "description": "Full of medical folklore and healing tales, Remedios presents the history of the many women—and cultures—who have met at the crossroads of the islands of Puerto Rico. Beginning with the First Mother in sub-Saharan Africa more than 200,000 years ago, Aurora Levins Morales takes readers on a journey through time and around the globe. We learn of Juana de Asbaje, author of the \"Reply to Sor Filotea\" in 1693, the first feminist essay written in the New World; Gracia Nasi, Constantinople's \"Queen of the Jews\"; the African-American activist and warrior of words Ida B. Wells; and the unlikely martyr and symbol, Ethel Rosenberg. Levins Morales weaves in her own story of pain and healing, ameliorated by the restorative power of memory, and bears witness to a larger history of resistance and abuse by women and men. This historical memoir revives our connection to the forgotten lore of our grandmothers, featuring explanations of the medicinal properties of herbs and and foods such as rosemary, ginkgo, and banana. With love, joy, and defiance, Levins Morales offers Remedios as testimony to those barely recorded or known to his tory, the women who shaped our world. Aurora Levins Morales is author of Medicine History, Culture, and the Politics of Integrity (South End Press, 1998) and Getting Home Alive (Firebrand, 1986). A Jewish \"red diaper baby\" from the mountains of Puerto Rico, Morales writes lucidly about the complexities of social identity. She teaches at the University of California, Berkeley and the University of Minnesota, Minneapolis. [box] Also available from South End Press Medicine History, Culture, and the Politics of Integrity TC $14.00, 0-89608-581-3 o CUSA DeColores Means All of Us TP $18.00, 0-89608-583-X o CUSA Loving in the War Years TP $17.00, 0-89608-626-7 o CUSA",
  "genres": [
    "History",
    "Nonfiction",
    "Social Justice",
    "Gender Studies",
    "Feminism",
    "Anthropology",
    "Plants"
  ],
  "author": "Aurora Levins Morales",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/1249426.Remedios"
}