{
  "title": "Insanely Hot, Then Not",
  "description": "Known: They share some serious stranger on the train chemistry. Tonight, he’s finally taking her on a date.Unknown: He’s just inherited billions and plans to tear up his deadbeat dad’s building for some closure. And she’s the single-mom he evicted from his building to make way for the bulldozer.One question: What could go wrong?ScarlettI’ve got one rule as a single mom: My daughter comes first. So when it comes to romance, so far, I’ve limited myself to fantasies about the gorgeous green-eyed guy on the train. For months, he’s been the bright light in my otherwise dull work week. Our eyes meet, electricity jolts between us, my body goes to mush, and then we lose each other in the station and I’ve got enough to keep me going for the next twenty-four hours. He’s that hot. But it’s more than that. I swear we have a connection. But then one day he disappears.Our big loft apartment in San Francisco is our happy place. It’s big and bright and sunny, and the one constant in Zoe’s life.So when someone moves into the top two floors and starts making a racket that keeps us up all night, neither of us are happy. Next, I get a letter that we’ve got to move out because Mr. Big Bucks upstairs is making our apartment into a home gym. Hell no. After a couple of jumbo glasses of wine I slip a note under his door letting him know what I think of that.LachlanIt’s incredible, the way I can’t stop thinking about that curvy girl on the train with the sexy pixie hair. When my father dies and I have to go back to Australia to deal with all the legalities, it’s like she’s with me, providing the tenderness that he never did. I swear, she’s the only reason I got through all that. I spent years avoiding all the insecurities his abandonment created, but his death has ripped all that wide open. My friends say, I bet the two billion dollars he left you helps. And it does. A little.When I get home and see her on the train, I know this is going to be the day I talk to her. It helps that she seems just as hot to see me as I am to see her after my month away. She agrees to go on a date with me that night. But when I realize she’s the tenant in my building whom I’ve just evicted, I know I’m in a whole lot of trouble.*This is a full-length romance with a guaranteed HEA. The Flame Series books have some crossover characters but can be read in any order and have no cliffhangers.",
  "genres": [
    "Contemporary",
    "Collections"
  ],
  "author": "Daniella Brodsky",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/49346019-insanely-hot-then-not"
}