{
  "title": "Grasp: The Science Transforming How We Learn",
  "description": "A groundbreaking look at the science of how it works both in the mind and in the classroom, which teaching techniques are most effective, and how schools should (and absolutely should not) use instructional technology. This is an essential resource for teachers, anyone interested in cutting-edge research into learning, and parents considering the educational alternatives available to their children.As the head of Open Learning at MIT, renowned professor Sanjay Sarma has a daunting job to fling open the doors of the MIT experience for the benefit of the wider world. But if you're going to undertake such an ambitious project, you first have to How do we learn?  What are the most effective ways of educating? And how can the science of learning transform education to unlock our potential, as individuals and across society?Grasp  takes readers across multiple frontiers, from fundamental neuroscience to cognitive psychology and beyond, as it explores the future of learning. Some of its • For educators teaching remotely, online instructional tools have been proven to be a powerful ally when used appropriately—and a dangerous impediment when misapplied.• By structuring its curriculum to better incorporate cutting-edge learning strategies, one law school in Florida has rocketed to the top of its state in bar exam passage rates.• Scientists are studying the role of forgetting, exposing it not as a simple failure of memory but a critical weapon in our learning arsenal.• New developments in neuroimaging are helping us understand how reading works in the brain. It's become possible to identify children who might benefit from specialized dyslexia interventions—before they learn to read.Along the way, Sarma debunks long-held fallacies (such as the noxious idea of \"learning styles\"), while equipping readers with a set of practical tools for absorbing and retaining information across a lifetime. He presents a vision for learning that's more inclusive and democratic—revealing a world bursting with powerful learners, just waiting for the chance they deserve.Drawing from the author's experience as an educator and the work of researchers and educational innovators at MIT and beyond,  Grasp  offers scientific and practical insight, promising not just to inform and entertain readers but to open their minds.",
  "genres": [
    "Education",
    "Nonfiction",
    "Psychology",
    "Science",
    "History",
    "Social Science",
    "Brain"
  ],
  "author": "Sanjay Sarma",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/49348224-grasp"
}