{
  "title": "Written: A Story of Love, Secrets, Betrayal and Honour",
  "description": "What if your entire existence was based on someone else's story, someone else's dreams, someone else's expectations ....someone else's lies?NYC Big Book Awards 2021 Winner in Women's Issues FictionWriter's Digest Awards 2020 Finalist in Mainstream Literary FictionWritten is the heart-wrenching story of a young girl’s struggle for freedom, and the uncovering of an intricate plan laced around forty years of secrets, betrayal and lies, in a family desperate to preserve their culture and honour.Reviews'Readers will find this book hard to put down' Michael McConnell - Editor of NY Times Best Sellers'Lee tells Eleanor’s tale in smooth, expressive prose that captures her protagonist’s inner turmoil' Kirkus ReviewsWhat readers have to say...Wow! 'Just finished reading your book!! Wow....wow...wow!'Amazing 'The book is amazing - it was 'unputdownable!'Heartbreaking 'The descriptive language makes you feel like you are in the moment. What a heartbreaking yet inspirational story''This book looks worn now...a sign of a good read. D.A. Lee the most amazing author and probably the best book I have ever read (I’ve read a lot). It captivated me like a book has never. It pulled on my heartstrings and brought me to tears. Amazing read by a wonderful strong woman. You have to read this !!!!'Page-turner 'I have just read her new book, Written. The book is a real page-turner. I couldn’t put it down. Very enjoyable read, albeit heart-wrenching. I strongly recommend this book.'Unputdownable 'This is a multi-faceted book that elicits tears, sadness, joy and an entire range of other emotions. I read this non-stop over the space of a day, and couldn’t put it down such was the power of the story. A highly emotive and courageous subject, which the author has done justice to. Highly highly recommended''A well-told story about cultural issues around love and marriage - rich, deep and thoughtful. I couldn't put it down.''AMAZING!!!!!! Not only the heart-felt story but the way the story was told, exquisite...addictive. So beautifully done.....'SynopsisFour-year-old Eleanor is forced to accept her mother’s religious beliefs, that her whole life has already been written, and that she has no choice but to honour and accept her parents’ plans for her. Subject to abuse by an Islamic teacher, and witness to scenes of violence inflicted by her father, Eleanor finds her only refuge at school, where she dreams of a life beyond the hills of her hometown of Ashcroft, England. A mysterious woman befriends Eleanor – showing her a world of choice and freedom. Caught between her parent's cultural values and her own desires, Eleanor must decide whether to honour her parents’ wishes – a life locked in marriage to the hands of an abuser – or rewrite her own sto",
  "genres": [],
  "author": "D.A. Lee",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/49350738-written"
}