{
  "title": "Given Up for Dead: America's Heroic Stand at Wake Island",
  "description": "A gripping narrative of unprecedented valor and personal courage, here is the story of the first American battle of World War II: the battle for Wake Island. Based on firsthand accounts from long-lost survivors who have emerged to tell about it, this stirring tale of the “Alamo of the Pacific” will reverberate for generations to come.On December 8, 1941, just five hours after the bombing of Pearl Harbor, Japanese planes attacked a remote U.S. outpost in the westernmost reaches of the Pacific. It was the beginning of an incredible sixteen-day fight for Wake Island, a tiny but strategically valuable dot in the ocean. Unprepared for the stunning assault, the small battalion was dangerously outnumbered and outgunned. But they compensated with a surplus of bravery and perseverance, waging an extraordinary battle against all odds.When it was over, a few hundred American Marines, sailors, and soldiers, along with a small army of heroic civilian laborers, had repulsed enemy forces several thousand strong––but it was still not enough. Among the Marines was twenty-year-old PFC Wiley Sloman. By Christmas Day, he lay semiconscious in the sand, struck by enemy fire. Another day would pass before he was found—stripped of his rifle and his uniform. Shocked to realize he hadn’t awakened to victory, Sloman wondered: Had he been given up for dead—and had the Marines simply given up?In this riveting account, veteran journalist Bill Sloan re-creates this history-making battle, the crushing surrender, and the stories of the uncommonly gutsy men who fought it. From the civilians who served as gunmen, medics, and even preachers, to the daily grind of life on an isolated island—literally at the ends of the earth—to the agony of POW camps, here we meet our heroes and confront the enemy face-to-face, bayonet to bayonet.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Military History",
    "Military Fiction",
    "War",
    "American History"
  ],
  "author": "Bill Sloan",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/493868.Given_Up_for_Dead"
}