{
  "title": "The Hollow Bone of Healing: Miracles and Messages from the Quantum Field of Source Energy",
  "description": "Be a Conduit or Channel for Healing\nMost people, when faced with a life crisis, turn to authorities outside themselves for help. The Hollow Bone of Healing offers you simple and effective self-healing solutions to heal body, mind, and spirit. Learn how to channel Source Energy, angels and guides, and be The Hollow Bone.  This book is for you if you are...    in a crisis (healing, relationship, financial, career, etc.) and are seeking simple and effective self-healing solutions that go beyond what is currently available,    seeking personal transformation at a deeper level to enrich your life live your purpose, and share your gifts with the world, or    a Healing Arts Practitioner looking for a new approach for helping clients heal faster, more efficiently, and with deeper permanent results.   In this book you will:    Learn how to be The Hollow Bone of Healing and channel Source Energy, angels, and guides    Experience the power of Pure Love  Receive healing and messages from Source Energy through the Merge Technique   Release trauma gently and easily, from this lifetime or any others, from you or your ancestors, using the Time-Space Continuum Technique   Manifest your heart’s desires quickly and easily, using Sacred Geometry Activations   Clear your space and give back to the earth with the Portal Technique   \nHow This Book Works\nPart I: How to Sense Energy and Be The Hollow Bone of Healing Learn how you connect with Source Energy. Learn how to Merge with Source Energy for healing and messages. Understand and practice the steps of being The Hollow Bone of Healing. Discover interesting background information and personal examples, sample the free guided meditations that accompany this manual, and take advantage of the opportunities for personal reflection to deepen your transformation.  Part II: Self-Healing Techniques Learn how to easily heal trauma, manifest your heart’s desires, and clear space with Light and Love. Discover interesting background information and personal examples, sample the free guided meditations that accompany this manual, and take advantage of the opportunities for personal reflection to deepen your transformation.  Part III: How to Live The Hollow Bone of Healing Hear from those who are living it. Understand this is not just a modality when we’re feeling sick or things are going right. These self-healing techniques raise your vibration, elevate your consciousness, and create a better life every day. Learn how you can continue learning more self-healing techniques that work!  What Readers are Saying: Grace Hedman: “I have become an ally with my heart, my head and life. It helped me claim my power and own it, so I can easily shine my light into the world.",
  "genres": [],
  "author": "Phoenix Rising Star",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/49374386-the-hollow-bone-of-healing"
}