{
  "title": "Securing Grant Money:Step-By-Step Guide For First-Time Homebuyers",
  "description": "CONVENIENCE. EFFICIENCY. INFORMATION. KNOWLEDGE. ACTION. - SIMPLE-  The power of knowledge is in the action. Taking action brings experience and much more. In C.R. Wesley's Real Estate Knowledge Series you'll get an entry level welcome into the market followed by stepping stones to new endeavors.  This first book of the Real Estate Knowledge Series, Securing Grant Money: Step-by-Step Guide For First Time Homebuyers, will guide you through the actions in acquiring your first home AND receiving a forgivable loan or grant money for your down payment. Eligibility requirements must be met in the county of your purchase. Which means your income will need to be below the median income of the area you are purchasing in.  This guide illustrates and explains every step along the way. This guide will help educate you efficiently and simplify the process. You will know every party that you need to establish a relationship with and every resource tool to get you the grant. Each step of the buying process is related to you preparing to receive your down payment assistance.  We all know the American dream of getting a home, but we all don't know that there are programs there to help us get there. Especially those who may need a bit more assistance. Grab a cup of tea and join us! All of our literature is written to be direct and full of compact value. Giving you only what you need with suffice explanation to get you into action! We strive to simplify the learning curve to get you what you're looking for and getting you into action!  Educate yourself. Take action and reap the benefits of the down payment assistance programs that are here to help you. Once you learn the process, please help someone else to do the same. Our motive is to help people build success through education. Real Estate is a worthy lesson to learn. Continue to shop with us for our next launches! Thanks for reading and we hope you enjoy (and find value in) the literary presentation!  We would appreciate your feedback and supportive rating if you found this book helpful. Thank you and keep striving for growth.",
  "genres": [],
  "author": "C.R. Wesley",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/49386701-securing-grant-money"
}