{
  "title": "The Wake: The Deadly Legacy of a Newfoundland Tsunami",
  "description": "NATIONAL BESTSELLER “Fascinating, infuriating, eloquent and cautionary.” — Postmedia A Globe and Mail , CBC Books and Maclean’s Book of the Year In the vein of Erik Larson’s Isaac’s Storm and Dead Wake comes an incredible true story of destruction and survival in Newfoundland by one of Canada’s best-known writers On November 18, 1929, a tsunami struck Newfoundland’s Burin Peninsula. Giant waves up to three storeys high hit the coast at a hundred kilometres per hour, flooding dozens of communities and washing entire houses out to sea. The most destructive earthquake-related event in Newfoundland’s history, the disaster killed twenty-eight people and left hundreds more homeless or destitute. It took days for the outside world to find out about the death and damage caused by the tsunami, which forever changed the lives of the inhabitants of the fishing outports along the Burin Peninsula. Scotiabank Giller Prize–winning writer Linden MacIntyre was born near St. Lawrence, Newfoundland, one of the villages virtually destroyed by the tsunami. By the time of his birth, the cod-fishing industry lay in ruins and the village had become a mining town. MacIntyre’s father, lured from Cape Breton to Newfoundland by a steady salary, worked in St. Lawrence in an underground mine that was later found to be radioactive. Hundreds of miners would die; hundreds more would struggle through shortened lives profoundly compromised by lung diseases ranging from silicosis and bronchitis to cancer. As MacIntyre says, though the tsunami killed twenty-eight people in 1929, it would claim hundreds if not thousands more in the decades to follow. And by the time the village returned to its roots and set up as a cod fishery once again, the stocks in the Grand Banks had plummeted and St. Lawrence found itself once again on the brink of disaster. Written in MacIntyre’s trademark style, The Wake is a major new work by one of this country’s top writers.",
  "genres": [
    "Nonfiction",
    "History",
    "Canada",
    "Book Club",
    "Historical",
    "Biography",
    "Audiobook"
  ],
  "author": "Linden MacIntyre",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/49397547-the-wake"
}