{
  "title": "Becoming My Daddy: Cut Short",
  "description": "Abby's journey from innocence to obsession has run its course and now everything might be cut short. Will her story end with her new daddy? Find out! The reviews are in! \"Highly Arousing!\" \"I want to be Mr. Edwards!\" \"What a Sensuous Read!\" 'Abby felt Olivia’s breasts push against her back before her arms reached around to grab what was more than a handful of flesh for her little hands. She just held her hands there holding the shape of Abby’s tits as she pressed her body against her. A quiver ran through Olivia’s body that Abby could feel against her back as a loud *crack* rang out behind her. As the pain of her spanking registered, Olivia’s hands seemed to involuntarily squeeze Abby’s tits, stiffening her nipples against the other woman’s palms. “Thank you, daddy,” Olivia purred right into Abby’s ears from behind. Another spanking sent a vibration through both women as Abby could literally feel Olivia being spanked against her. Just as before, her hands squeezed into Abby’s tits at the blow, but they seemed to continue massaging them on their own afterwards this time. Abby felt like each movement sent mini-tremors down her back and made her breath shaky. She wondered if Olivia could feel any of her body’s response as the woman behind her thanked their daddy once more.' After weeks of torturous teasing and making her wait, Mr. Edwards finally gave Abby everything she'd been waiting for, but just ask things looked like they were going her way, everything changed. What is she going to learn when the couple returns in the morning? Will her plans change again? Will she lose all that she's gained with her new daddy? How will her story end? Alan Austin is a national award winning author now writing erotic fiction under a new pen name and outside of his established publication outlet in order to delve into some of his deepest desires and fantasies. Alan and his wife are both authors who enjoy the wilder side of life and leverage some of their own experiences along with a healthy dose of imagination to heat things up in their writing. Alan is a mid-thirties family man from the Midwest United States with an amazing wife and the best kids in the world. He enjoys working out and reading when he has time between family activities and writing. Alan grew up on the west coast before moving his family inland to make a home for himself. He is an active volunteer in his community and loves serving others. Alan and his wife enjoy sharing their wildest fantasies and he uses his short stories as vehicle to share them with others. It is his hope that his short stories can bring some excitement to others! Please follow Alan's erotic fantasy author page on Facebook at",
  "genres": [],
  "author": "Alan Austin",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/49416487-becoming-my-daddy"
}