{
  "title": "Daughter of the Game",
  "description": "November 1819\nWith DAUGHTER OF THE GAME, Tracy Grant makes a stunning debut with a tale of nonstop adventure, dark mystery, and passionate romance. This novel lays bare the world of Regency London and explores the nature of good and evil, truth and lies, loyalty and betrayal...Set mainly in London just after the Napoleonic Wars, DAUGHTER OF THE GAME is a fast-paced and involving historical thriller. Charles and Melanie Fraser are the perfect aristocratic couple: handsome, wealthy, powerful, accomplished, they are the envy of their friends and the toast of London society. A London night: outside, a mist hovers over the cobblestones and yellow pools of lamplight glow with murky radiance. And inside the glittering mansions of society's finest families, lushly dressed ladies dance the night away with coolly elegant gentlemen... and the latest gossip is exchanged with a tilt of a fan. Surely in a world of such supreme confidence, no evil could touch those charmed lives.On this cloud-shrouded evening the unthinkable comes to pass: six-year-old Colin Fraser vanishes from the cocoon of his family's Berkeley Square home. His disappearance plunges his socially -- and politically -- prominent parents, Charles and Melanie Fraser, into a maze of intrigue, one that stretches back to the Napoleonic Wars.The Frasers' perfect jewel-box of a life is shaken to the core. Charles is a former intelligence agent and the grandson of a duke. And now Charles is a member of Parliament. He possesses a cool intellect and a burning sense of justice. Driven by the devastation he saw during the war and by his own family's sordid history, he is a man who will not rest until he discovers the truth. Melanie is a war refugee who charms London's \"beau monde\" at routs and receptions, all the while writing pamphlets on child labor and women's education. In a world where marriage is a matter of convenience and love is a game, their union is a model of constancy.As Colin's ransom, his captors demand a ring...not just any ring, but the legendary Carevalo Ring. Many people, it seems, are enticed by the gold and ruby ornament, but are they lured by its beauty or by the promise of power that surrounds it? And there are those, perhaps even elements in the British government, who would kill to possess it.Charles and Melanie's race against time to recover the ring and save their son becomes a dark and perilous game, where plot plays upon counterplot. Their hunt takes them to the Drury Lane Theatre and the debtors' prison in the Marshalsea, a London gaming hell and a Brighton racing stable, a gin-soaked brothel and a Thames-side villa. They uncover a chilling labyrinth of secrets, both personal and political, that binds them together in unexpected ways and threatens to destroy them.As layers of deception are stripped away, Charles and Melanie begin to question all that they believed in. In a world of spies, blackmail, and murder, no one is quite who they seem to be. Caught up in a tangled web of political and sexual intrigue going back many years, the Frasers can be sure of nothing. For the secret to finding Colin lies in the murky loyalties of war-torn Europe, in past sins and scandals. For no one is quite who they seem to be and deception and betrayal -- of a country, an ideal, a lover, a spouse -- come far more easily than truth and fidelity...",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Romance",
    "Historical",
    "Fiction",
    "Historical Mystery",
    "Regency"
  ],
  "author": "Tracy Grant",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1026185.Daughter_of_the_Game"
}