{
  "title": "Spooked: The Trump Dossier, Black Cube, and the Rise of Private Spies",
  "description": "A Pulitzer Prize winning investigative journalist’s journey into a billon-dollar secret industry that is shaping our world – the booming business of private spying, operatives-for-hire retained by companies, political parties  and the powerful to dig up dirt on their enemies and, if need be, destroy them. For decades, private eyes from Allan Pinkerton, who formed the first detective agency in the U.S., to Jules Kroll, who transformed the investigations business by giving it a corporate veneer, private spies were content to stand in the shadows. Now, that is all changing. High-profile stories grabbing recent headlines – the Steele Dossier, Black Cube, the Theranos scandal, Harvey Weinstein’s attacks on his accusers –  all share a common thread, the involvement of private spies.Today, operatives-for-hire are influencing presidential elections, the news media, government policies and the fortunes of companies.. They are also peering into our personal lives as never before, using off-the shelf technology to listen to our phone calls, monitor our emails, and decide what we see on social media. Private spying has never been cheaper and the business has never been more lucrative—just as its power has never been more pervasive.  Spooked is a fast-paced, disturbing and, at times, hilarious tour through the shadowlands of private spying and its inhabitants, a grab-bag collection of ex-intelligence operatives, former journalists and lost souls. In this hidden world, information is currency, double-crosses are commonplace, and hacking can be standard procedure.  Drawing on his journalistic expertise and unique access to sources, Barry Meier uncovers the secrets private spies want to keep hidden.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Business",
    "Espionage",
    "Audiobook",
    "True Crime"
  ],
  "author": "Barry Meier",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/49398003-spooked"
}