{
  "title": "Forgotten: Luca",
  "description": "LucaI left him behind because I had no choice…That’s what I keep telling myself, but it doesn’t make it any easier to sleep at night… or to drown out the words he kept repeating over and over the day we’d met: I just want to go home.That was eight long years ago and I’d only known him as Billy, a terrified fourteen-year-old I’d had to leave behind to save someone else.But his name wasn’t Billy and he’s no longer a frightened kid lost in a world where he was nothing more than a possession. His name is Remy, and while I didn’t recognize him upon meeting him again, he sure as hell remembers me.It would be easier just to turn my back on him a second time, especially since that’s exactly what he wants, but there’s no way I can let the tormented young man go. At least not without trying to make things right first. The problem is, even if I can make up for leaving Remy behind so long ago, I’m not sure I’ll be able to walk away from him twice.I don’t know what that means, but I do know that it scares the hell out of me.Because needing in my world comes at a heavy price… one that not even I can afford to pay.RemyHe gave me hope when I’d had none left, but he forgot about me just like all the others…I fight. That’s what I do. It’s who I am. But when Luca Covello walked into the dark, dirty room my captors were keeping me in so long ago, I’d already decided to do the one thing I hadn’t in the three years since I’d been taken from my home and family.Give up.Then he’d been there, like a bright light in a sea of darkness, and I’d had something new to fight for, to stay alive for… the day Luca came back to get me like he’d promised.Except he never came.And now, eight years later, he’s decided he wants to play the hero and save me. Well, I don’t need saving. Not anymore… not ever.Along with two years of sobriety under my belt, I’ve got a good job, a decent apartment, and I’ve managed to put my past where it belongs… in the past. No one, not even the gorgeous, mysterious businessman, is going to mess things up for me. If he’s come seeking forgiveness, I’m fresh out.And if he’s come seeking something else… well, let’s just say that when I’m done with him, there’s no way he’ll forget me this time around. Trigger Warning: For those who would like to see the trigger warnings associated with this book, please either download the sample or use the \"look inside\" feature and go to Trigger Warning page for more information.",
  "genres": [
    "M M Romance",
    "Romance",
    "Abuse",
    "Contemporary",
    "LGBT",
    "Gay",
    "Dark"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/49392785-forgotten"
}