{
  "title": "The Exiles",
  "description": "The author of the #1 New York Times bestseller Orphan Train returns with an ambitious, emotionally resonant novel about three women whose lives are bound together in nineteenth-century Australia and the hardships they weather together as they fight for redemption and freedom in a new society. Seduced by her employer’s son, Evangeline, a naïve young governess in early nineteenth-century London, is discharged when her pregnancy is discovered and sent to the notorious Newgate Prison. After months in the fetid, overcrowded jail, she learns she is sentenced to “the land beyond the seas,” Van Diemen’s Land, a penal colony in Australia. Though uncertain of what awaits, Evangeline knows one thing: the child she carries will be born on the months-long voyage to this distant land.During the journey on a repurposed slave ship, the Medea, Evangeline strikes up a friendship with Hazel, a girl little older than her former pupils who was sentenced to seven years transport for stealing a silver spoon. Canny where Evangeline is guileless, Hazel—a skilled midwife and herbalist—is soon offering home remedies to both prisoners and sailors in return for a variety of favors.Though Australia has been home to Aboriginal people for more than 50,000 years, the British government in the 1840s considers its fledgling colony uninhabited and unsettled, and views the natives as an unpleasant nuisance. By the time the Medea arrives, many of them have been forcibly relocated, their land seized by white colonists. One of these relocated people is Mathinna, the orphaned daughter of the Chief of the Lowreenne tribe, who has been adopted by the new governor of Van Diemen’s Land.In this gorgeous novel, Christina Baker Kline brilliantly recreates the beginnings of a new society in a beautiful and challenging land, telling the story of Australia from a fresh perspective, through the experiences of Evangeline, Hazel, and Mathinna. While life in Australia is punishing and often brutally unfair, it is also, for some, an opportunity: for redemption, for a new way of life, for unimagined freedom. Told in exquisite detail and incisive prose, The Exiles is a story of grace born from hardship, the unbreakable bonds of female friendships, and the unfettering of legacy.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Australia",
    "Audiobook",
    "Historical",
    "Adult"
  ],
  "author": "Christina Baker Kline",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/49397137-the-exiles"
}