{
  "title": "Rough Love",
  "description": "Second chances aren’t always easy. Sometimes, it takes some Rough Love.Bruce Tannen is better known by his nickname, Brutal, because once upon a time, he was a monster on the football field. Now, he’s a farmhand on what used to be his family’s land, and change is all around him. A new family, new expectations, and even new friends. It’s all just fine by him until he runs into the one woman to ever hold his heart. The past comes back with a wallop of a tackle that even he can’t take. Allyson left him a lifetime ago, but she’s the only thing that’s ever felt right… in his arms, in his heart, in his life. Something’s different, though. She’s a shadow of her former self, and he wonders what could’ve dulled her shine. He can help fight her demons to bring back that sunny smile he used to bask in, but should he?Allyson Meyers knew who she was and where she was going, but a wrong turn years ago took her on a journey she never imagined. Not even in her worst nightmares. It was ugly, but she’s stronger now for the one person who matters… her son, Cooper. Being a single mother is a burden she’s grateful to bear alone until she sees a pair of all-too-familiar broad shoulders and dark, knowing eyes that remind her of who she once was. Bruce was the one she'd left behind, the path she should’ve taken. It’s too bad you can’t rewrite history. But if she’s brave enough, maybe they could create a new future?Can Bruce open his heart to the one who shattered it? And can Allyson blend who she is now with who she used to be and live the happily ever after she should’ve had?Rough Love is a full-length Romance with an HEA, no cheating, and no cliffhanger. It can be read as a standalone.",
  "genres": [
    "Romance",
    "Westerns",
    "Second Chance",
    "Contemporary Romance",
    "Contemporary",
    "Second Chance Romance",
    "Sports"
  ],
  "author": "Lauren Landish",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/49398706-rough-love"
}