{
  "title": "A Rage for Justice: The Passion and Politics of Phillip Burton",
  "description": "This political biography of Phillip Burton (1926-1983) is the riveting story of one of the most brilliant, driven, and productive legislators of his―or indeed any―era of American politics. A ruthless and unabashed progressive, Burton terrified his opponents, ran over his friends, forged improbable coalitions, and from 1964 to 1983 became one of the most influential Representatives in the House. He also acquired more raw power than almost any left-liberal politician ever had.Moving from grassroots campaigns to epic battles in the California state capital, and finally to the very pinnacle of power on Capitol Hill, John Jacobs's inside account of Burton's life shows how politics really works. He demonstrates the exercise of power in the hands of a superb strategist and shows an unheralded master going about his life's work during the glory years of postwar American liberalism.Burton was an unforgettable, uncontrollable figure whose relentless day-and-night politicking distilled the raw essence of American politics. Jacobs brings to life Burton's seething, perpetual sense of outrage, gargantuan appetites, and dedication to the disenfranchized. Animated by a sometimes frightening drive for power―his only modern counterpart is Lyndon Johnson―Burton played a pivotal role in California and U.S. politics, championing welfare and civil rights, landmark labor legislation, environmentalism and congressional reform. His achievements included the groundbreaking black lung bill for miners and their families; Supplemental Social Security for the aged, blind, and disabled; and helping to secure America's extensive national park system.Burton's failures were equally dramatic: in 1976, at the height of his power, he lost, by one vote, the chance to become House Majority Leader. Had he won this critical political fight, he no doubt would have become Speaker of the House.Jacobs's account is based on Burton's personal papers and hundreds of interviews with people at every stage of his life, including four Democratic Speakers of the House. The result is a book that brilliantly demonstrates how one person can make a difference in public life.",
  "genres": [
    "Politics",
    "Biography"
  ],
  "author": "John Jacobs",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/49422.A_Rage_for_Justice"
}