{
  "title": "Spirit Run: A 6,000-Mile Marathon Through North America's Stolen Land",
  "description": "The son of working-class Mexican immigrants flees a life of labor in fruit-packing plants to run in a Native American marathon from Canada to Guatemala in this \"stunning memoir that moves to the rhythm of feet, labor, and the many landscapes of the Americas\" (Catriona Menzies-Pike, author of The Long Run).Growing up in Yakima, Washington, Noé Álvarez worked at an apple-packing plant alongside his mother, who “slouched over a conveyor belt of fruit, shoulder to shoulder with mothers conditioned to believe this was all they could do with their lives.” A university scholarship offered escape, but as a first-generation Latino college-goer, Álvarez struggled to fit in.At nineteen, he learned about a Native American/First Nations movement called the Peace and Dignity Journeys, epic marathons meant to renew cultural connections across North America. He dropped out of school and joined a group of Dené, Secwépemc, Gitxsan, Dakelh, Apache, Tohono O’odham, Seri, Purépecha, and Maya runners, all fleeing difficult beginnings. Telling their stories alongside his own, Álvarez writes about a four-month-long journey from Canada to Guatemala that pushed him to his limits. He writes not only of overcoming hunger, thirst, and fear―dangers included stone-throwing motorists and a mountain lion―but also of asserting Indigenous and working-class humanity in a capitalist society where oil extraction, deforestation, and substance abuse wreck communities.Running through mountains, deserts, and cities, and through the Mexican territory his parents left behind, Álvarez forges a new relationship with the land, and with the act of running, carrying with him the knowledge of his parents’ migration, and―against all odds in a society that exploits his body and rejects his spirit―the dream of a liberated future.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Travel",
    "Audiobook",
    "Indigenous",
    "Sports",
    "Biography"
  ],
  "author": "Noé Álvarez",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/49411424-spirit-run"
}