{
  "title": "Holiday Greetings from Sugar and Booze",
  "description": "Holiday Greetings from Sugar and Booze is a music-filled holiday comedy starring Ana Gasteyer and Maya Rudolph, with a jolly cast including Patti LuPone, Rachel Dratch, and Richard Kind. In this heart-warming story of love and friendship, listeners follow the journey of \"Sugar\" and \"Booze,\" as they go from inseparable college buddies to busy working moms who mostly keep in touch with each other, and their close friends and family, through annual holiday letters. Pulled apart by distance and their hectic lives, their friendship nears a breaking point. That is until one December, when everything comes to a head at their annual holiday fete. Can their friendship survive the holidays?Booze performed by Ana GasteyerSugar performed by Maya RudolphAuntie Ana performed by Patti LuPoneMadeline performed by Rachel DratchAntoni performed by Tim BagleyDan performed by Brian HuskeyJim performed by Oscar NunezKaren performed by Dylan GelulaManny performed by Richard KindCaleb, Military Man performed by Michael Cruz KayneKyle performed by Branson ReeseTommy, Scotty, Opening Ensemble performed by Casey JostAudrey, Opening Ensemble performed by Erin AndersonNicole, Opening Ensemble performed by Montego GloverJudy, Opening Ensemble performed by Leslie KritzerLittle Karen performed by Gianna DennisLittle Kyle performed by Michael MarstonLittle Caleb performed by AJ JastrabLitter Kid performed by James BernardLitter performed by Benjamin McGowanRadio DJ, Opening Ensemble performed by Jim SantangeliE.R. Nurse, Party Ensemble performed by Mona MansourMichaela performed by Sara Grace WelbournParty Ensemble performed by Franca VercelloniNarrator performed by Marc VietorHoliday Greetings from Sugar and Booze features music from Ana Gasteyer’s album sugar & booze, available now at sugarandboozealbum.com.©2019 Broadway Video, LLC (P)2019 Audible Originals, LLC",
  "genres": [
    "Audiobook",
    "Humor",
    "Fiction",
    "Christmas",
    "Holiday",
    "Comedy",
    "Contemporary"
  ],
  "author": "Ana Gasteyer",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/49420956-holiday-greetings-from-sugar-and-booze"
}