{
  "title": "Wicked Blaze Correctional",
  "description": "Wicked Blaze Correctional. The home to the most dangerous criminals of each realm. A private correctional institution that had to be placed on a separate realm because of the threat the inmates posed. Drake had sent me here, to ruin me. To destroy me and any memory of his egregious act that could incriminate him for being the homicidal maniac he was.What he hadn’t counted on? Me. He hadn’t counted on my strength and my magic rising up to become the scariest damn thing in this place.It helped that I had a human by my side that showed up to breakfast every morning covered in blood. I should probably ask Dimitri what that was about one of these days. Don’t forget Milo! An Ink Mage with the nifty ability to not only interpret dreams but to change them, as well as reality itself. Did I mention he was absolutely mental, maybe it was because of the insomnia? I don’t know what to tell them about one of the lead guards, Vaughn, who keeps claiming I am his ‘mate’ and promising to get me out. Or how to explain the odd feeling I have about the new inmate that just showed up, seeming a bit too sweet for this place.There is something changing in the air though, something different than what has been going on the past six months, so what has been changing? Maybe it's the magic eater that keeps floating by my cell every morning? I didn’t care what the change was as long as I got out. I had a witch to kill and I wasn’t going to be able to put Drake in the ground from here.Welcome to Wicked Blaze Correctional - Book 1 of the Wronged Series. This trilogy will be a fast burn reverse harem filled with dark subject matters, a strong FMC, and insane men. This institution isn’t like any correctional facility you’ve read about before. It’s brutal, cutthroat, and there are no rules except that you can’t leave until your sentence is done… which is never. Follow Valentina and her men on a journey filled with revenge, steam, and strong characters that don’t fit the norm of society. A bit crazy? That is just normal.This Fantasy medium/fast burn RH contains several dark themes that readers should be aware of: swearing (I know surprising, right?), gore, violence, assault, and sexual themes suitable for +18. Additionally, this book does have a mature light m/m themes that develop over time.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fantasy",
    "Magic",
    "Romance",
    "Paranormal Romance",
    "Shapeshifters"
  ],
  "author": "M. Sinclair",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/49444511-wicked-blaze-correctional"
}