{
  "title": "Misrule",
  "description": "Knox and Roxy have finally set the date for their wedding, but things won’t go smoothly. There are too many people within the Club who won’t accept Knox—and one woman in particular whose day of reckoning has been a long time coming. Not to mention the outside interference from family. But the most deadly threat of all will come from an unexpected enemy. They’ve been Misled. They’ve been Misunderstood. They’ve been Misguided. Now it’s time to put the past aside and focus on new beginnings. Can the Club put aside differences long enough to defeat the looming threat against them ? Or will Knox and Roxy’s wedding turn into a funeral…?   Prologue  “When you intend to make a honest woman out of my momma-in-law?” For the past two months, Mortician had been posing that question to Knox Harrington on an increasingly regular basis. He felt the pressure. Truth be told, he wanted to marry Roxanne Doucette, Mortician’s “momma-in-law”, and something of a mother figure to not only the women of the Death Dwellers Motorcycle Club, but the men, too. Knox shrugged, his usual answer. The other men at the table sent him various looks of disapproval and displeasure. The club president, Outlaw, lifted a brow at him, the silent question screaming DANGER to Knox. Outlaw discarded three cards, then replaced them in his hand with three from the deck. They were at their weekly get-together, this time held at Mortician and his wife, Bailey’s, house. Roxanne lived in the mother-in-law quarters, where Knox also lived now. The place was small, nothing he was used to; however, it made Roxanne happy so he was more than willing to ignore the lack of space. A burst of female laughter emanated from the den, two doors down the hall from where the men sat in the game room. Knox picked out Roxanne’s robust laughter and couldn’t help but smile. She was such a beautiful, intelligent, vivacious woman. She brought meaning and sunshine to his life. He should want to jump at the chance to marry her. So what was stopping him? He glanced around the table from Mortician, the club enforcer, who loved his dreads, the club, and family, and not necessarily in that order. If something made Bailey unhappy, Mortician went out of his way to change that. And, if Roxanne was unhappy, then most assuredly Bailey would be. The girl simply adored her mother. Knox focused on Johnnie, club VP. He was educated and easy-going, so above the rest of the club—on Knox’s level actually—that Knox wondered why Johnnie didn’t turn in his patch. Recently, he’d separated from his wife. Which pleased Knox to no end. He hated Kendall, and was glad he didn’t have to suffer her presence at the family dinners anymore. Next, he spied on Val, the club’s Road Captain. He was an idiot. Period. Knox turned his attention to Digger, sergeant-at-arms and Mortician’s blood brother. Another idiot, who, so far, hadn’t packed on the pounds with all the eating he’d become known for. Knox moved on to Cash and Stretch, the explosive’s technician and secretary/treasurer respectively, as well as husbands to each other, and boyfriends to Outlaw’s sister, Ophelia. And her baby daddies to her two kids. Cash might’ve been on-level with Knox and Johnnie, except he’d tied himself to Ophelia and Stretch, Pushover One and Pushover Two. And, finally, there was Outlaw. King of Criminals, Jerks, and Assholes… There was his answer, Knox realized. He hadn’t proposed to Roxanne because of them.",
  "genres": [],
  "author": "Kathryn C. Kelly",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/49434768-misrule"
}