{
  "title": "Lucy McConnell's Snow Valley Box Set",
  "description": "Read the Entire Lucy McConnell Snow Valley Romance Collection! Blue Christmas As head of Snow Valley hospital’s fundraising effort, Paisley Hackett barely has time to organize the craft show, cookie decorating party, and the annual Christmas Ball. What she doesn’t have time for is falling in love with Clay Jett, the incredibly handsome bass player who sweeps into town. With everything going on, Paisley will have to work overtime to protect her heart from Clay and his swoon-worthy ballads.  Love in Light and Shadow Mercedes O'Shay has sworn off gorgeous men because they have a tendency to break her heart. When she meets her new neighbor, Chet Bauer, she immediately puts him in the Do Not Date category based on his well-defined muscles and stunning blue eyes. But the more Mercedes learns about the cowboy who reads classics and forges iron, the more she realizes the heart doesn't see in black and white; it sees light and shadows.  Romancing Her Husband Natalie Lawson is at a crossroads. Her husband is down on his luck and some days he's just plain down while Natalie is moving forward, gaining promotions and starting new adventures. When tragedy throws them together, Natalie learns a profound lesson that may save her marriage and provide the key to romancing a husband.  Wedding Fever  Cat O’Shae, a Christian romance writer who moved to Snow Valley, sets a New Year’s resolution to create romance off the page. When her eyes lift from the computer screen, they land on Sam Miller, an unlikely candidate for a romantic hero, except he sure does look good in a cowboy hat and he did save her from one mad chicken… Sam might just be what she needs to start the New Year off right.   One Date Deal Veronica (Ronnie) Martin wasn’t planning on helping a stranded motorist on her way out of Snow Valley. But, as one of the small town’s two mechanics, she couldn’t leave a neighbor stranded. When that neighbor turns out to be Grady Owens, her older brother’s best friend, Ronnie’s long-time crush waves her over to the side of the road. After a few minutes of flirting, Grady asks her out. Ronnie is ecstatic, until she realizes he doesn’t recognize her. She accepts his invitation, but when he finds out who she is and tries to cancel, she makes a one-date deal.   His Wedding Date Fake Fiancee  When Chloe Winston finds herself crushing on her business partner, she tamps down the flame of attraction because falling for Troy Martin could spell disaster for their business. But, when Troy needs a fake fiancee for his sister’s Christmas wedding, Chloe agrees to fill the role, if only to show him what he’s been missing out on all these months. Little did she know that her eyes would be opened to the joys of spending the holidays surrounded by family in the heart of Snow Valley.",
  "genres": [],
  "author": "Lucy McConnell",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/49434120-lucy-mcconnell-s-snow-valley-box-set"
}