{
  "title": "Day of the False King",
  "description": "\"Another brilliant and out-of-the-ordinary murder mystery by the author of\" Year of the Hyenas, \" with an unusual and interesting detective, this time trying to pursue and rescue his own ex-wife, sold into slavery in the city of Babylon (in modern times, near Baghdad) at a time of violence and great danger, much like today.\"\"Day of the False King\" continues the story of Semerket, Egypt's Clerk of Investigations and Secrets. The time is approximately 1150 B.C., and the conspirators who plotted the overthrow of Pharaoh Ramses III have been tried and executed. But the old pharaoh has succumbed to the wounds inflicted by his Theban wife, Queen Tiya; it is his first-born son who now rules Egypt as his chosen successor, Ramses IV.Geographically placed at the center of the Old World, where East literally meets West, Babylon has forever been the crossroads for conquering armies and adventuresome merchants, and the prize of dynasts. From cruel tyrants to far-seeing visionaries, an ever-changing set of rulers have claimed Babylon's throne as their own. But they were not god-kings as in Egypt; in fact, there was no term for \"king\" in any of the Babylonian languages. Instead, they were called simply \"Strong Man\" or \"Big Man.\" Then as now, only martial strength determined who ruled. Strangely, or perhaps inevitably, the rights of the individual were first codified and set down as laws here.Around the time that \"Day of the False King\" takes place, the Middle East is undergoing -- just as it is today -- a tortuous, protracted transformation. The old regimes have vanished, setting the stage for the aggressive emergence of the new nations of Phoenicia, Israel, and Philistia; it is the fourth of these new peoples, the Assyrians, who will achieve dominance in the years ahead.Babylonia in particular has suffered a series of cataclysms. The old Kassite Dynasty, themselves invaders from the north, has been toppled. The nation of Elam (soon to be known as Persia) has launched a massive war to conquer Babylonia from the southeast. Native tribes in the country also see this moment as their own chance to evict the foreigners and re-establish a dynasty of their own.Into this roiling alchemy, Semerket's adored ex-wife, Naia, is thrust. She and Rami, the tomb-maker's son, have been banished to Babylon as indentured servants -- punishment for their accidental roles in the Harem Conspiracy against Ramses III.As in \"Year of the Hyenas,\" most of the events and characters in \"Day of the False King\" are drawn from history. The Elamite invader King Kutir and the native-born Marduk truly vied for the throne of Babylonia. There really was a festival called \"Day of the False King,\" when the entire world turned upside down for a day, when slaves ruled as masters, when the most foolish man in Babylon was chosen to become king. Semerket the detective is plunged into the midst of these events in pursuit of his own goals: to serve his Pharaoh and to find the woman he loves.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Egypt",
    "Historical Mystery",
    "Historical",
    "Fiction",
    "Indonesian Literature"
  ],
  "author": "Brad Geagley",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/494614.Day_of_the_False_King"
}