{
  "title": "Complete Works of Arthur Conan Doyle",
  "description": "This collection was designed for optimal navigation on Kindle and other electronic devices. It is indexed alphabetically, chronologically and by category, making it easier to access individual books, stories and poems. This collection offers lower price, the convenience of a one-time download, and it reduces the clutter in your digital library. All books included in this collection feature a hyperlinked table of contents and footnotes. The collection is complimented by an author biography. Table of Contents List of Works in Alphabetical Order List of Works in Chronological OrderArthur Conan Doyle Biography The Complete Collection of Sherlock Holmes A Study in ScarletThe Sign of FourThe Adventures of Sherlock HolmesThe Memoirs of Sherlock HolmesThe Hound of the BaskervillesThe Return of Sherlock HolmesThe Valley of FearHis Last BowThe Case-Book of Sherlock Holmes The Napoleonic Tales The Great Shadow and The Crime of The Brigadier The \"Slapping Sal\" The Exploits of Brigadier GerardUncle BernacThe Adventures of Gerard The Professor Challenger Works The Lost WorldThe Poison BeltWhen the World Screamed Other Novels Beyond the City A Desert Being the Tragedy of the Korosko The Doings of Raffles Haw A Duet, with an Occasional Chorus The Firm of GirdlestoneMicah Clarke The Mystery of Cloomber The Parasite The Refugees Rodney Stone Sir Nigel The Stark Munro Letters The White Company Other Short Stories and Collections The Cabman's StoryThe Captain of The Polestar And Other TalesDanger! And Other StoriesThe Green Flag and Other Stories of War and SportThe Last Galley. Tales and ImpressionsMy Friend the Murderer The Mystery of Sasassa Valley Round the Red LampTales of TerrorTales of Mystery Poetry Songs of Action (28 Songs) Songs of the Road (32 Songs) Spiritualist Works The New Revelation, or What Is Spiritualism The Vital Message Works on Current Affairs The Great Boer War A Visit to Three Fronts Literary Criticism Through the Magic Door",
  "genres": [
    "Classics",
    "Fiction",
    "Mystery",
    "Literature",
    "Crime",
    "Adventure",
    "Short Stories"
  ],
  "author": "Arthur Conan Doyle",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/4947464-complete-works-of-arthur-conan-doyle"
}