{
  "title": "The Dalai Lama's Cat and The Four Paws of Spiritual Success",
  "description": "The Dalai Lama's Cat is back: irreverent, vain--and as delightfully insightful as ever! \n\"If you're wondering how being in the presence of an enlightened person may be communicated on the pages of book written by a flawed and complex--if extremely beautiful--cat, let me confess that my only job here is to offer you a mirror. A looking glass of a particular kind. One that reflects back not the contours of your nose or the arch of your brow, but which provides a much deeper reflection of who and what you are.Look closely, dear reader, there's no need to be afraid. For what you will discover, if you ever doubted it, is that your own true nature is quite different from whatever flecks and imperfections may temporarily obscure it. At heart you are a being whose pristine nature is nothing other than pure, great love and pure, great compassion.Mine too!\"When the Dalai Lama's inner circle is set the task of providing His Holiness with a book he can give his visitors, an unexpected volunteer stretches out her paws. The book is to summarize the four key elements of Tibetan Buddhism--and, importantly, to communicate how it feels to be in the profoundly reassuring presence of His Holiness. Who better to do this than his much-loved feline?Through encounters with celebrity visitors and her own intriguing adventures, the Dalai Lama's Cat explains all four key themes, not so much as ideas but as practices to be embodied. Along the way she even gets a new title: \"Therapy Cat.\"If you have ever sought a summary of Tibetan Buddhist wisdom, albeit from an unusual and whiskery source, this may just be the book to get you purring!",
  "genres": [
    "Fiction",
    "Buddhism",
    "Spirituality",
    "Animals",
    "Cats",
    "Self Help",
    "Audiobook"
  ],
  "author": "David Michie",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/49464000-the-dalai-lama-s-cat-and-the-four-paws-of-spiritual-success"
}