{
  "title": "Race of Aces: WWII's Elite Airmen and the Epic Battle to Become the Master of the Sky",
  "description": "\"Brings you into the cockpit of the lethal, fast-paced world of fighter pilots...Fascinating.\" -- Sara Vladic\n\n\"Extraordinary...A must-read.\" -- US Navy Captain Dan Pedersen\n\n\"A heart-pounding narrative of the courage, sacrifice, and tragedy of America's elite fighter pilots.\" -- James M. Scott\"Vivid and gripping...Confirms Bruning's status as the premier war historian of the air.\" -- Saul David\n\n\n\nThe astonishing untold story of the WWII airmen who risked it all in the deadly race to become the greatest American fighter pilot.\n In 1942, America's deadliest fighter pilot, or \"ace of aces\" -- the legendary Eddie Rickenbacker -- offered a bottle of bourbon to the first U.S. fighter pilot to break his record of twenty-six enemy planes shot down. Seizing on the challenge to motivate his men, General George Kenney promoted what they would come to call the \"race of aces\" as a way of boosting the spirits of his war-weary command.  What developed was a wild three-year sprint for fame and glory, and the chance to be called America's greatest fighter pilot. The story has never been told until now.  Based on new research and full of revelations, John Bruning's brilliant, original book tells the story of how five American pilots contended for personal glory in the Pacific while leading Kenney's resurgent air force against the most formidable enemy America ever faced. The pilots -- Richard Bong, Tommy McGuire, Neel Kearby, Charles MacDonald and Gerald Johnson -- riveted the nation as they contended for Rickenbacker's crown. As their scores mounted, they transformed themselves from farm boys and aspiring dentists into artists of the modern dogfight.  But as the race reached its climax, some of the pilots began to see how the spotlight warped their sense of duty. They emerged as leaders, beloved by their men as they chose selfless devotion over national accolades.  Teeming with action all across the vast Pacific theater, Race of Aces is a fascinating exploration of the boundary between honorable duty, personal glory, and the complex landscape of the human heart.",
  "genres": [
    "History",
    "Nonfiction",
    "Aviation",
    "World War II",
    "Military History",
    "Military Fiction",
    "War"
  ],
  "author": "John R. Bruning",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/49459799-race-of-aces"
}