{
  "title": "Storm",
  "description": "A contemporary romance with a touch of mystery, thrill, suspense and humor, by bestselling romance author Saniya.S.KohariGoli—I hate him. I'll say it again, just for the heck of it. I freaking hate Aariz! .Because I don't know him. Love at first sight and all that crap, is just the stuff of dreams. It's the conspiracy of writers who wants us to believe such non-sense, so we'd buy their books to dream more such crap. (Doesn't mean, I'm gonna stop reading such crap. Nope!).Sure, his drowning deep stare that always lingers on me, makes me wish to lose myself in his rain-filled, cloud-like grey eyes..His crisp corporate attire, make me wanna pull his collar, kiss him hard, and disturb his jelled hair..He teases me non-stop. Calls my name in a sing-song voice, which just gets on my nerves. .He shouts at me, as if, I was made on a special order by God, just for Aariz to stake his claim on!.But I don't love him, except for the fact that I can't live without him..However, the world isn't so black and white. Love is not so easy. It's not like, I love you, you love me...let's go down the cherry tree! No, this world is serious about being nosy in our business. They don't want us to stay in love. They call us forbidden for each other..He says, 'he had been dead without me.' While I, 'feel alive because of him.' When love is this deep, a storm roars into life. At every turn, this world has a storm lurking in the corner, trying to pull us apart. Be it the fate, society, family, bitter exes, sweet one-sided crushes or...people we thought as friends. None can be trusted. They are all, the storms of our life. .The test of love would be when the storm finally passes. Question is, would we still be able to crawl our way back to each other?.This is the story of us, two people, who love each other passionately, and who fight for their love tirelessly..A twisted roller coaster tale of love, romance, jealousy, passion, drama, sacrifice, betrayal, destiny, friendship and incomprehensible affection. A pull that brings us together, every time we are thrown apart. We are wrong for each other, but that's the allure of forbidden love. It feels nothing but pure.",
  "genres": [],
  "author": "Saniya S. Kohari",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/49485884-storm"
}