{
  "title": "Cherry Slice",
  "description": "Reality TV turns deadly in Cherry Hinton’s first case When Kenny Thorpe, a contestant on Expose TV’s Big Blubber, the hot new celebrity weight-loss show, is murdered on live television in front of 3 million viewers, the case seems pretty watertight. After all, everyone saw Martin do it – didn’t they? Cherry Hinton knows there’s more to this than meets the eye. As an investigative reporter, she went undercover on dating show Caravan of Love… but after getting in too deep with one of the other contestants, she was caught knickerless in front of the nation. Humiliated, fired and heartbroken, she has fled to Brentwood, where she opens a cake shop, and tries to forget all about Expose. Until Kenny Thorpe’s sister walks into her shop with a letter that turns Cherry’s world upside down. Is Martin innocent? How is infamous gangster Leon Solent involved? Is Expose to blame, and is there a killer still on the loose? Cherry is the only one in a position to find out.Praise for Cherry  \"If you’re in need of comic distraction (as we all are…) this is extremely funny.\" Harriet Tyce, author of international bestseller Blood Orange \"A scathingly satirical look at reality TV and society's hypocritical standards, Cherry Slice might not be as nice as pie, but its gooey centre is our intrepid P.I Cherry Hinton ... I think I love her!\" Lucy V. Hay, author of Never Have I EverWhat people are saying about Cherry  \"A fast, fun cozy mystery. \"Cherry is a hoot and a half! This character's debut is sure to be just the first of many stories and I am hoping that as the characters develop, so will the recipes.\" \"You need to go pick up this wonderful book.\" \"A cute murder mystery. One I won't soon forget!\" \"I can’t wait to read more from this author!\" \"A wonderful example of an imaginative cosy mystery.\" \"The plot is original and cunningly thought-out. If you like a cosy that makes you chuckle, occasionally wince and be thoroughly entertained from start to finish, then this is for you.\" \"Well-written and hard to put down – high quality comic chick lit with a side of mystery.\" \"A thrilling read which kept me turning the pages, characters you care for and just brilliantly written. Great novel!",
  "genres": [
    "Mystery",
    "Audiobook",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "Jennifer Stone",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/49481420-cherry-slice"
}