{
  "title": "Essential Horse Conformation: 51 Checkpoints Before You Buy",
  "description": "The conformation, or build of your horse, can predict whether or not he or she can be successful in a particular horse sport, or whether or not he or she will eventually have lameness issues. Essential Horse Conformation walks you through the process of choosing the best horses for your needs, and sets you and the horse up for a high ratio of success. This nose-to-tail conformation assessment includes 44 illustrative photos, and is written so every horse lover can understand how the individual parts of a horse form a whole. A must read for everyone who is thinking of purchasing a horse, or who is re-evaluating existing horses in their herds.\"Lisa's common sense and experience give insightful revelations. I love how concise she is while clearly defining each step of the process! Lisa's books are definitely in my library of go to info when I need help training and selecting my horses.\" ––Patty D’Andrea, PATH International Advanced Instructor, Founder/Executive Director, Healing with Horses Ranch, Manor, TXI realize there is no perfect horse, and that the many variables of each horse should all be a part of the puzzle. This very informative read helps us see the many pieces, and explains why and how they fit together. Lisa Wysocky has a great way of describing with words and uses a lot of real-life visuals that are truly useful. Examples and situations that people will encounter out in the field are hard to capture, but she does it with ease. She also doesn't assume readers already have common knowledge, yet moves through topics without boring more advanced readers. This book does a great job educating the horse community about what is important and why.\" ––Mary Mitten, executive director, We Can Ride, Minnetonka, Minnesota, PATH International Advanced InstructorThe information is succinctly presented with good photos and diagrams throughout, and readers will find the material easy to assimilate. A very helpful book that any horse purchaser, especially those newer to the horse world that are contemplating buying their first horse, and at a very reasonable price point. ––Catskill Horse Magazine",
  "genres": [],
  "author": "Lisa Wysocky",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/49524442-essential-horse-conformation"
}