{
  "title": "Shakespeare in a Divided America: What His Plays Tell Us about Our Past and Future",
  "description": "From leading scholar James Shapiro, a timely exploration of what Shakespeare's plays reveal about our divided land, from Revolutionary times to the present dayRead at school by almost every student, staged in theaters across the land, and long highly valued by both conservatives and liberals alike, Shakespeare's plays are rare common ground in the United States. For well over two centuries now, Americans of all stripes--presidents and activists, writers and soldiers--have turned to Shakespeare's works to address the nation's political fault lines, such as manifest destiny, race, gender, immigration, and free speech. In a narrative arching across the centuries, James Shapiro traces the unparalleled role of Shakespeare's 400-year-old tragedies and comedies in making sense of so many of these issues on which American identity has turned. Reflecting on how Shakespeare has been invoked--and at times weaponized--at pivotal moments in our past, Shapiro takes us from President John Quincy Adams's disgust with Desdemona's interracial marriage to Othello, to Abraham Lincoln's and his assassin John Wilkes Booth's competing obsessions with the plays, up through the fraught debates over marriage and same-sex love at the heart of the celebrated adaptations Kiss Me Kate and Shakespeare in Love. His narrative culminates in the 2017 controversy over the staging of Julius Caesar in Central Park, in which a Trump-like leader is assassinated.Extraordinarily researched, Shakespeare in a Divided America shows that no writer has been more closely embraced by Americans, or has shed more light on the hot-button issues in our history. Indeed, it is by better understanding Shakespeare's role in American life, Shapiro argues, that we might begin to mend our bitterly divided land.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Audiobook",
    "Literary Criticism",
    "Sociology",
    "American History"
  ],
  "author": "James Shapiro",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/49512631-shakespeare-in-a-divided-america"
}