{
  "title": "Harem: The World Behind the Veil",
  "description": "A fascinating illustrated history of one of the strangest, and cruelest, cultural institutions ever devised. A worldwide best seller, translated into twenty-five languages.“I was born in a konak (old house), which once was the harem of a pasha,” writes Alev Lytle Croutier. “People around me often whispered things about harems; my own grandmother and her sister had been brought up in one.”Drawing on a host of firsthand accounts and memoirs, as well as her own family history, Croutier explores life in the world’s harems, from the Middle Ages to the early twentieth century, focusing on the fabled Seraglio of Topkapi Palace as a paradigm for them all. We enter the slave markets and the lavish boudoirs of the sultanas; we witness the daily routines of the odalisques, and of the eunuchs who guarded the harem. Here, too, we learn of the labyrinthine political scheming among the sultan’s wives, his favorites, and the valide sultana—the sultan’s mother—whose power could eclipse that of the sultan himself.There were the harems of the sultans and the pashas, but there were also “middle-class” harems, the households in which ordinary men and women lived out ordinary—albeit polygamous—lives. Croutier reveals their marital customs, child-rearing practices, and superstitions. Finally, she shows how this Eastern institution invaded the European imagination—in the form of decoration, costume, and art—and how Western ideas, in turn, finally eroded a system that had seemed eternal. Juxtaposing a rich array of illustrations—Western paintings, Turkish and Persian miniatures, family photographs, and even film stills—Croutier demystifies the Western erotic fantasy of “the world behind the veil.” This revised and updated 25th anniversary edition of Harem includes a new introduction by the author, revisiting her subject in light of recent events in Turkey, and the world.",
  "genres": [
    "History",
    "Nonfiction",
    "Womens",
    "Historical",
    "Womens Studies",
    "Art",
    "World History"
  ],
  "author": "Alev Lytle Croutier",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/495019.Harem"
}