{
  "title": "The Long Road to Legend",
  "description": "Mark Warren’s first book in a trilogy on Wyatt Earp is more than historical fiction. Though it is a period piece of the 19th century, it is a timeless story that relates to all of us.Regardless of when or where a person lives in time, each of us is faced with a universal plight: How do we become a man or a woman? And how do we find our place in the world?Do the times shape us? Yes, just as surely as the place and people around us. Family, especially. It has always been this way. What if you wanted to run away from home to fight in a war . . . but you were too young? What if you were forced to labor over 80 acres of crops by an overbearing father who knew nothing about giving some slack to his sons? And, as a fourteen year old, after accruing the requisite calluses of farming, what aspirations might you consider for your vocation?This is the story of such a boy who never quite finds all those answers. But because of his physicality, confidence, and a willingness to exercise deliberate courage, he does find his place in a life much admired by his peers. His name will always be spoken anytime that a conversation arises about justice vs. law and order . . . and how those American commodities do not always balance on the scales of a courtroom bench. His name was Wyatt Earp. Earp was many things--farmer, freight hauler, stage driver, railroad wrangler, husband, constable, wood splitter, accused horse thief, brothel bouncer, buffalo hunter, gambler, and lawman-most of this in the \"new\" and raw land of America's untapped West. The possibilities seemed endless for Wyatt, but he will be remembered in that last category . . . peace officer, a role he did not want. Instead, it would seem that history wanted it for him. He was that good at it.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Westerns",
    "Historical"
  ],
  "author": "Mark  Warren",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/49515405-the-long-road-to-legend"
}