{
  "title": "The Hitchhiker Man",
  "description": "When you’re willing to step outside your comfort zone, the world awaits. In 2007, Matt Fox—a recent graduate who studied strategic decision-making in university—found himself alone on the side of a highway with no plan other than to see where his thumb and the road would take him. For the next two years, he would travel across Canada to Alaska and back, experiencing life in a way most people never will…a life beyond his comfort zone. Along the way, he encounters adventures he never imagined—sleeping under the stars, sneaking into drug-fueled music festivals, and working at ski resorts and local farms to earn enough for his next meal. He also confronts danger—and his own mortality—from a life-threatening injury in Whistler, to a confessed murderer in Banff, to a hungry grizzly in Alaska. But most importantly, Fox learns that life isn’t about getting to the destination, but enjoying each moment along the way. From feeling like an invisible outcast on day one to a man comfortable in his own skin no matter the circumstance, The Hitchhiker Man is the unforgettable story of how one man got lost on the road, and ultimately found himself.  \"The sound of something breathing deeply woke me up from my sleep. The strange noise provided a quick reminder that I was camping in Denali National Park – six million acres of raw Alaskan wilderness. I held my breath and hoped that whatever was beyond the thin fabric wall would go away. The tent shook violently. I looked around, but I couldn’t see in the pitch-black night. Then the tent became still again. I could hear the creature’s claws tear the thick Alaskan moss as it circled us. I hoped it wasn’t a grizzly, but I had seen so many that morning there was no doubt that it had to be.  My friend Heidi was sleeping peacefully beside me, unaware of the dire situation we were in. I couldn’t decide if I should wake her or let her sleep. Then the tent shook again. She had to know. It might be the last time we speak. I remembered the girl who had given us a ride that morning who had insisted that we got bear spray. She took us to the store to buy some. It was thirty dollars, but I only had fifty to my name, so I left it on the shelf. It seemed like the biggest mistake of my life. How did I end up in Alaska in the first place? I thought. When only a year before I had been living a normal middle-class life near Toronto. One decision to go hitchhiking had changed the path of my life forever. But I had no regrets for the decisions I had made. I had chosen what I thought was the right path for me and perhaps that path had finally come to its end. I said goodbye to the ones I loved then thanked the universe for the life I had lived before sitting and waiting in silence.\"",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Biography"
  ],
  "author": "Matt    Fox",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/49496548-the-hitchhiker-man"
}