{
  "title": "Monsters: History's Most Evil Men And Women",
  "description": "Some devised methods of torture cruel beyond belief, some killed members of their own families, others ordered the murders of millions of innocents; some were admired statesmen, some were maniacs - others simply butchers. Vlad Dracul, prince of Wallachia, impaled his enemies on a forest of bloody stakes; the Byzantine empress Irene had her son's eyes gouged out; the Crusaders massacred 70,000 innocent Muslims and Jews when they took Jerusalem; and, the Mongol warlord Tamerlane built pyramids of human skulls. In the 20th century, Adolf Hitler slaughtered 6 million Jews, Josef Stalin liquidated 25 million Russians, while Mao Zedong was responsible for the deaths of 70 million Chinese. In \"101 World Heroes\" Simon Sebag Montefiore selected his ultimate heroes and heroines; here he reveals history's dark side.\"Monsters\" presents, in chronological order, compellingly readable portraits of 101 sinister individuals who shared a relish for the brutal exercise of pitiless, unbounded power, a delight in imposing pain and suffering, and a contempt for human life. Many of them - Nero and Al Capone, Genghis Khan and Henry VIII, Lucrezia Borgia and Jack the Ripper, Lenin and Himmler, Charles Manson and Pablo Escobar - are notorious. Others - Byzantine emperor Justinian the Slit-Nose, Pope John XII (who turned the Vatican into a brothel), the 16th century Scots cannibal Sawney Beane, Baron Ungern-Sternberg (who conquered Mongolia in 1920 believing he was Genghis Khan reborn), vampiric Hungarian countess Elizabeth Bathory, Barbarossa the Ottoman pirate-king - are less familiar.Each biography is accompanied by an article revealing fascinating aspects of those monsters: Sultan Selim the Grim divulges the secret Ottoman methods of royal murder; 'Bloody' Mary evokes the heretic's death at the stake; we travel with Leopold II of Belgium into the 'Heart of Darkness' that was the Belgian Congo; Malawian dictator Dr Banda unveils the strange phenomenon of medical doctors who became murderous tyrants; and, Papa Doc of Haiti reveals the nature of Voodoo. Lavishly illustrated, interspersed with illuminating quotations, both accessible and informative, \"Monsters\" is a Who's Who of the cruel and murderous, the rapacious and depraved, and a gripping compendium of stories, characters and indispensable lessons from history that no one should forget - and everyone should know.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Historical",
    "Crime",
    "True Crime",
    "Biography Memoir"
  ],
  "author": "Simon Sebag Montefiore",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/4949406-monsters"
}