{
  "title": "Africaville",
  "description": "A ferociously talented writer makes his stunning debut with this richly woven tapestry, set in a small Nova Scotia town settled by former slaves, that depicts several generations of one family bound together and torn apart by blood, faith, time, and fate.Vogue : Best Books to Read This WinterStructured as a triptych, Africaville chronicles the lives of three generations of the Sebolt family—Kath Ella, her son Omar/Etienne, and her grandson Warner—whose lives unfold against the tumultuous events of the twentieth century from the Great Depression of the 1930s, through the social protests of the 1960s to the economic upheavals in the 1980s.A century earlier, Kath Ella’s ancestors established a new home in Nova Scotia. Like her ancestors, Kath Ella’s life is shaped by hardship—she struggles to conceive and to provide for her family during the long, bitter Canadian winters. She must also contend with the locals’ lingering suspicions about the dark-skinned “outsiders” who live in their midst.Kath Ella’s fierce love for her son, Omar, cannot help her overcome the racial prejudices that linger in this remote, tight-knit place. As he grows up, the rebellious Omar refutes the past and decides to break from the family, threatening to upend all that Kath Ella and her people have tried to build. Over the decades, each successive generation drifts further from Africaville, yet they take a piece of this indelible place with them as they make their way to Montreal, Vermont, and beyond, to the deep South of America.As it explores notions of identity, passing, cross-racial relationships, the importance of place, and the meaning of home, Africaville tells the larger story of the black experience in parts of Canada and the United States. Vibrant and lyrical, filled with colorful details, and told in a powerful, haunting voice, this extraordinary novel—as atmospheric and steeped in history as The Known World, Barracoon, The Underground Railroad, and The Twelve Tribes of Hattie—is a landmark work from a sure-to-be major literary talent.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Canada",
    "Historical",
    "Audiobook",
    "Book Club",
    "African American"
  ],
  "author": "Jeffrey Colvin",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/49523572-africaville"
}