{
  "title": "The Quiet Americans: Four CIA Spies at the Dawn of the Cold War—A Tragedy in Three Acts",
  "description": "From the bestselling author of Lawrence in Arabia, a gripping history of the early years of the Cold War, the CIA's covert battles against communism, and the tragic consequences which still affect America and the world todayAt the end of World War II, the United States dominated the world militarily, economically, and in moral standing - seen as the victor over tyranny and a champion of freedom. But it was clear - to some - that the Soviet Union was already executing a plan to expand and foment revolution around the world. The American government's strategy in response relied on the secret efforts of a newly-formed CIA.The Quiet Americans chronicles the exploits of four spies - Michael Burke, a charming former football star fallen on hard times, Frank Wisner, the scion of a wealthy Southern family, Peter Sichel, a sophisticated German Jew who escaped the Nazis, and Edward Lansdale, a brilliant ad executive. The four ran covert operations across the globe, trying to outwit the ruthless KGB in Berlin, parachuting commandos into Eastern Europe, plotting coups, and directing wars against Communist insurgents in Asia.But time and again their efforts went awry, thwarted by a combination of stupidity and ideological rigidity at the highest levels of the government - and more profoundly, the decision to abandon American ideals. By the mid-1950s, the Soviet Union had a stranglehold on Eastern Europe, the U.S. had begun its disastrous intervention in Vietnam, and America, the beacon of democracy, was overthrowing democratically-elected governments and earning the hatred of much of the world. All of this culminated in an act of betrayal and cowardice that would lock the Cold War into place for decades to come.Anderson brings to the telling of this story all the narrative brio, deep research, skeptical eye, and lively prose that made Lawrence in Arabia a major international bestseller. The intertwined lives of these men began in a common purpose of defending freedom, but the ravages of the Cold War led them to different fates. Two would quit the CIA in despair, stricken by the moral compromises they had to make; one became the archetype of the duplicitous and destructive American spy; and one would be so heartbroken he would take his own life.The Quiet Americans is the story of these four men. It is also the story of how the United States, at the very pinnacle of its power, managed to snatch defeat from the jaws of victory.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Espionage",
    "American History",
    "War",
    "Biography"
  ],
  "author": "Scott Anderson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/49524790-the-quiet-americans"
}