{
  "title": "The Empireid",
  "description": "Fiction. Poetry. Vagabond is pleased to announce the launch of THE EMPIREID, by Ilvario, an epic journey in verse. In structured form of 17 line terza rima stanzas (A-B-A, B-C-B, C-D-C, D-E-D, E-F-E, F-F), THE EMPIREID continues the story of the Trojan line of Aeneas, from the founding of Rome to present day. Challenging war, empire and religion, THE EMPIREID (which translates to, \"The Story of the End of Empire\") follows the tale of Horacio, grandson of Venus, and last of the Trojan line, who on the eve of his thirteenth year, in 1453, the year that Constantinople fell, is sent on a quest to Hades, to free the gods of old from a trap set by Pluto, the God of the Underworld, to strip them of their powers, by placing them into an eternal sleep...that trap being monotheism. Following history, legend and myth, the story weaves a tapestry of Mediterranean warfare throughout the 1460's, during the rise of the Ottoman Empire, when much of the world was still unknown, where our hero is taken captive by a band of corsairs. Raised at sea as one of their own, aboard The Crescent Moon, captained by the pirate Reis-el-Khan, Horacio grows to become a seafaring warrior entangled in the expanding wars for conquest and regional power, all the while driven to fulfill his mission, until by fate and circumstance, being made captain, he is propelled between natural and unnatural forces - a blood feud, cat-and-mouse high seas chase on one end and the ethereal forces of other dimensions, pulling and leading him to his ultimate destination...Aethalia, The Island of Venus, from where through the Enfola, the navel connecting heaven, the underworld and earth, Horacio discovers a secret entrance to Hades, and with demons at his heels, and the assistance of a few divine gifts, Horacio must navigate the labyrinth and ever present dangers of the underworld, to find and smash the Infinity Glass, using the Sword of Troy, which he has carried with him all these years, only by which he might free Saturn, the ruler of time and father to all the gods immortal...but to do so he must pay a heavy price. You may purchase at a discount, directly from the publisher at: https://www.vagabondbooks.net/2019/09...",
  "genres": [],
  "author": "Ilvario",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/49535136-the-empireid"
}