{
  "title": "Adoring Keaton",
  "description": "A friends-to-lovers new adult MM romance from USA Today bestseller Siobhan Davis. Stand-alone with HEA and no cliff-hanger. Keaton Moving to California was supposed to be my fresh start. A clean slate. An opportunity to drop the façade, escape the lies, find a focus, and just be myself.But I should have realized it wouldn’t be easy, especially when my last name is Kennedy.I’m not ready to be a gay icon or some celebrity role model. I still haven’t admitted the truth to my family or the girl I professed to love, so there’s no way I want the public to know I’m into dudes.Falling for my hot, straight, football-player roomie wasn’t part of the game plan.Neither was backing myself into a corner because I trusted the wrong guy.Now everything is on the line, and it’s time to stop pretending. Austen From the time I was a little kid, all I wanted is to play football in college and play in the NFL. As wide receiver for the Golden Bears, I am on track to achieve my goals, but it comes at a heavy price.Denying who I am—for the sake of my career—goes against everything I believe. I should never have listened to my high school coach, because all the lies are suffocating me.Until Keaton Kennedy enters my life, turning it upside down.Now, there is even more reason to tell the truth, because I’m falling for the famous one and I want the entire world to know.This heartwarming, emotional romance has a dash of angst and drama, a sprinkling of humor, and cameos from some of your favorite characters from the series. It is a 100k-word full-length novel, and the second to last book in the Kennedy Boys series. This can be read as a stand-alone novel as it focuses on a new couple; however, it is recommended you start at the beginning of the series for maximum reading enjoyment.",
  "genres": [
    "M M Romance",
    "Romance",
    "Friends To Lovers",
    "Contemporary",
    "College",
    "Sports",
    "Contemporary Romance"
  ],
  "author": "Siobhan     Davis",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/49540134-adoring-keaton"
}