{
  "title": "Diary of a Submissive",
  "description": "“Trust no one.”After the recent tragedy, The Unholy is on high alert as they deal with the increasing tensions of the mafia. Believing the latest attack to be a declaration of war, Sal attempts to strategize, aligning the pieces and players of an ever-shifting gameboard. They know who fired the shots, but who led the countdown?The violence wasn’t just another random act of crime, but a bloody massacre armed with a message.Welcome to your new life, Sal Raniero.As the newest mob boss on the block, he is outraged by the assault on his turf and fiercely determined to protect his girl and his brothers. With friends and foes coming from every direction, he works the problem, analyzing the unknown variables, and inching closer to a perilous instability than ever before.With enemies breathing down their neck, Sal and Iris suffer under the blinding glare of spotlights on their relationship. Coming clean isn’t as easy as they hoped. Confronting their families and associations, they realize everyone has an opinion on their forbidden romance and powerhouse alignment. Feeling the pressure mounting, Sal unilaterally decides to abandon his post and take off on a cross-country adventure with the beautiful girl of his dreams. Along the way, they discover normalcy in amongst the betrayals and lies. Remembering the innocent days before they were the future of the criminal underworld, they learn the truth should never be taken for granted as they unravel the web of their years apart. He is the Dark Prince of The Mafia Commission. She is the Lotus Queen. They were never meant to fall in love. They were raised to divide and conquer.Even each other.Diary of a Submissive is the fourth book in a Tomb of Ashen Tears, the epic dark mafia romance. It is highly recommended readers experience the first three books: Salt Kissed Love, Famous Last Words, and Every Minute I Love You.",
  "genres": [],
  "author": "Kailee Reese Samuels",
  "average_rating": "4.93",
  "url": "https://www.goodreads.com/book/show/49526732-diary-of-a-submissive"
}