{
  "title": "Ned",
  "description": "After four years of training to become a Navy SEAL, Ned Marshall is finally ready to marry the woman of his dreams, Shae Johnson . And Shae’s been uber patient, waiting, building a life as a free-lance graphic artist, moving around the globe to be with him. So, when she said yes to his proposal in Geneva, he fully expected to live happily-ever-after.At the very least, he expected her to be waiting at the hotel for him three days after an emergency call-out. And maybe it was unreasonable to expect her to be sitting in the hotel, working on her watercolors—Shae, after all grew up in Montana, and she has adventure in her blood. So of course she’s going to go climb the beautiful Swiss mountains. Even make a friend.But Ned isn’t thrilled with her new friend, and something about him doesn’t feel safe…So she’s made some friends while waiting for Ned to return? Shae can’t believe that after years of sacrifice, Ned is actually angry at her—what did he expect, that she’d sit by the window? Dana and his friends are harmless, right?Not so much. Because when Shae finds herself kidnapped, and brought to Russia, she fears the worst—she’s been swept up in a human trafficking ring. And when she’s sent to, of all places, Siberia how will Ned ever find her?But Ned isn’t going to lose her—not after everything they’ve been through, and he’ll stop at nothing to rescue her. But when he discovers the real reason she’s been taken, he will have to become a traitor to his country if he wants her back.Join the epic race to rescue Shae in the high-adrenaline book three in the Minnesota Marshalls series.The Minnesota MarshallsBook 1: FraserBook 2: JonasBook 3: NedBook 4: Iris (coming soon)Book 5: Creed (coming soon)More Marshall family romantic adventuresThe Epic Story of RJ and YorkBook 1: Out of the NightBook 2: I Will Find YouBook 3: No Matter the CostThe Montana MarshallsBook 1: KnoxBook 2: TateBook 3: FordBook 4: WyattBook 5: Ruby Jane",
  "genres": [
    "Contemporary",
    "Romance",
    "Suspense",
    "Christian Fiction",
    "Christian",
    "Fiction",
    "Christian Romance"
  ],
  "author": "Susan May Warren",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/124983113-ned"
}