{
  "title": "The Weather of the Pacific Northwest",
  "description": "The Pacific Northwest experiences the most varied and fascinating weather in the United States, including world-record winter snows, the strongest non-tropical storms in the nation, and shifts from desert to rain forest in a matter of miles. Local weather features dominate the meteorological landscape, from the Puget Sound convergence zone and wind surges along the Washington Coast, to gap winds through the Columbia Gorge and the \"Banana Belt\" of southern Oregon. This book is the first comprehensive and authoritative guide to Northwest weather that is directed to the general reader; helpful to boaters, hikers, and skiers; and valuable to expert meteorologists. In The Weather of the Pacific Northwest , University of Washington atmospheric scientist and popular radio commentator Cliff Mass unravels the intricacies of Northwest weather, from the mundane to the mystifying. By examining our legendary floods, snowstorms, and windstorms, and a wide variety of local weather features, Mass answers such interesting questions o Why does the Northwest have localized rain shadows? o What is the origin of the hurricane force winds that often buffet the region? o Why does the Northwest have so few thunderstorms? o What is the origin of the Pineapple Express? o Why do ferryboats sometimes seem to float above the water's surface? o Why is it so hard to predict Northwest weather? Mass brings together eyewitness accounts, historical records, and meteorological science to explain Pacific Northwest weather. He also considers possible local effects of global warming. The final chapters guide readers in interpreting the Northwest sky and in securing weather information on their own. Cliff Mass , professor of atmospheric sciences at the University of Washington and weekly guest on KUOW radio, is the preeminent authority on Northwest weather. He has published dozens of articles on Northwest weather and leads the regional development of advanced weather prediction tools. \"What used to be thought of as the quietly gray weather of the Northwest may now be recognized as a titanic struggle of the weather gods; full of avalanches, non-tropical cyclones, and weather induced mirages. Turn off the TV weather, read this book, and get in touch with the magic dance of Northwestern wind, waves, and water.\" - Congressman Jay Inslee, co-author of Apollo's Igniting American's Clean Energy Economy \"Great progress has been made in understanding the often challenging and always interesting weather of the Pacific Northwest. Cliff Mass has either participated in or directed much of that work. Readers will directly benefit from his knowledge, experience, and enthusiasm in this highly readable, fascinating, and useful book.\" - Jeff Renner, Chief Meteorologist, KING Television, Seattle \"Cliff Mass has written an excellent, clear and comprehensive survey of weather in this region covering the origin and incidence of all major weather phenomena in the Northwest from rain to wind to snow to drought to optical illusions. Weather, as Cliff makes abundantly clear, is not just a source of griping or amusement or awe in this region, but often a life and death matter.\" - David Laskin, author of Rains All the Time and The Children's Blizzard \" The Weather of The Pacific Northwest is a great tool for learning and understanding our constantly changing weather. Having grown up in Seattle and racing year round on Puget Sound it is always a struggle to figure out what the weather is going to do, and Cliff Mass does a great job of explaining what affects our weather and why it can be so diverse. Anyone wanting to understand the Pacific Northwest's weather will find this book extremely informative and a joy to read.\" - Trevor Sterry, Vice Commodore Shilshole Bay Yacht Club \"The book uniquely includes solid scientific rigor in explanations that help to unravel the many mysteries and curiosities of the weather in the Pacific Northwest. It provides an unsurpassed opportunity to interested laypersons and weather enthusiasts not only to learn about the many weather events that occur in the Northwest but also to understand the meteorological principles that are at the root of their existence.\" - Brad Colman, NOAA/National Weather Service",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "Reference",
    "History",
    "Americana",
    "Natural History"
  ],
  "author": "Cliff Mass",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/4953508-the-weather-of-the-pacific-northwest"
}