{
  "title": "All die Finsternis inmitten der Sterne",
  "description": "Als Tochter eines Drogendealers hat Wavy schon früh gelernt: Traue niemandem. Am wenigsten deinen Eltern.Die Achtjährige ist den schizophrenen Launen ihrer Mutter ausgeliefert und kümmert sich ganz alleine um den Haushalt und ihren kleinen Bruder. Frieden findet sie nur beim Betrachten des Sternenhimmels über den Feldern hinter dem Elternhaus. Und dort begegnet sie dem Riesen Kellen, dem tätowierten Ex-Häftling mit einem Herz aus Gold. Er erweckt in Wavy ein Gefühl, das sie inmitten ihrer Welt aus Gewalt und Vernachlässigung für unmöglich gehalten hat.Als eine Tragödie Wavys Familie auseinanderreißt, wird unter dem strengen Blick der Welt das, was Wavy so schön erscheint, auf einmal hässlich …Provokant und einfühlsam erzählt Bryn Greenwood in ihrem Bestseller von zwei verlorenen Seelen und deren sonderbarer, ja unmöglicher Liebe. Eine schockierende und eindringliche Coming-of-Age-Geschichte, jenseits von Moral und Konvention.FESTA MUST READ: Große Erzähler ohne Tabus. Muss man gelesen haben.Dieses Buch wurde in den USA aufgeregt diskutiert: Ein 13-jähriges Mädchen hat Sex mit einem erwachsenen Mann. Doch es geht um Liebe, nicht um Pädophilie. Der Roman beleuchtet das Thema von verschiedenen Perspektiven und regt zum Nachdenken an.Die vielen Vergleiche mit Nabokovs ›Lolita‹ sind unpassend, denn der Erzähler in ›Lolita‹ ist definitiv ein Pädophiler, der Mann in diesem Roman sicher nicht.Die Autorin hat sich mehrfach zu den Vorwürfen geäußert: Sie ist selbst die Tochter eines Drogendealers, wie das Mädchen in dem Buch, und auch sie hatte mit 13 Jahren eine Beziehung mit einem erwachsenen Mann. Der Roman ist aber keine Autobiografie.",
  "genres": [
    "Book Club",
    "Drama",
    "Historical Fiction",
    "Contemporary Romance",
    "Crime",
    "Romance",
    "Literary Fiction"
  ],
  "author": "Bryn Greenwood",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/49586485-all-die-finsternis-inmitten-der-sterne"
}