{
  "title": "Sleepwalking Through Life: Environmental Hypnosis and the Devastating Effects of Somnambulism",
  "description": "“For Fifty Years, I Just Thought I Was Just Forgetful... Turns Out, All This Time I Was In Hypnosis!” One woman’s story of how environmental hypnosis trapped her, mentally and emotionally for fifty years, and how de-hypnotising her, made all of the difference in her recovery. Sheryl Hill had spent her entire life feeling less than adequate. As a young African American girl growing up in Seattle in the 1960’s, her self esteem and self image was conceived during the racism of the civil rights movement. As she grew from a child to a teenager into adulthood, Hill noticed that she would often drift off into her own dreamworld, not remembering what she had been doing for hours at a time. Either becoming hyper focused on a task, or wandering from room to room accomplishing nothing. She would often lose important documents, tickets and jewelry and have no earthly idea where she might have left them. She was not able to stay awake in movies, at concerts, or while riding in a car. Hill began to feel overwhelmed and over burdened by her own life, which often lead to excessive drinking and eating in order to cope. Over the years she developed several unusual fears and phobias. Antidepressants and antianxiety medications rarely worked. Quite by accident, Hill stumbled across the answers to her own conditions after she returned to school to study hypnosis as a means to a secondary source of income, for her retirement years. It was not until she began to practice hypnosis, that she began to unravel the mystery of what had been happening to her all these years. She was a somnambulist! In a perpetual, low grade and often medium-to-deep state of spontaneous hypnosis and needed to be de-hypnotised in order to regain conscious and alert awareness. This book is part autobiography, laced with current science and amusing and informative client studies, offering persons with the same affliction a ray of hope into what is happening with them. It is written for both clinicians and their clients/patients. We all know someone who is a somnambulist.",
  "genres": [],
  "author": "Sheryl Hill",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/49599199-sleepwalking-through-life"
}