{
  "title": "Six Merry Little Murders",
  "description": "Indulge yourself with this collection of delectable cozy mystery novellas!Lee Strauss - MURDER BY PLUM PUDDINGThere's nothing more fun than a festive holiday dinner party and Ginger Reed, the former Lady Gold, has Hartigan House decorated and the gramophone playing. Dressed in her finest Parisian low-waisted gown, feather-topped tiara, and T-strapped Italian leather shoes, Ginger is ready to host the delectable event.It's a jolly good time, until someone chokes on the pudding.Is it an accident or is it murder? And can Ginger unravel the mystery before the church bells ring and New Year's Day dawns?Karen MacInerney - SLAY BELLS RINGIt's Christmastime on Dewberry Farm, and homesteader Lucy Resnick is busy bundling mistletoe bunches and cedar swags for the Buttercup Christmas Market when a neighbor's houseguest keels over right next to her peach orchard. Was it a stray bullet from a hunter that took him out? Or did a guest at the fancy ranch next door decide to scratch somebody off his or her Christmas list? It's up to Lucy to unwrap the mystery… before the holiday killer strikes again.CeeCee James - CHRISTMAS AT BAKER STREETIn this Baker Street spin-off, Oscar and Cecelia find themselves and the guests snowed in this Christmas holiday. What should be all sugar cookies and hot cocoa takes a drastic turn when one of the guests turns up cold—as in stone cold dead. With no help in sight, the two hope to find the killer before anyone else gets iced out, including them.Nancy Warren - CAT'S PAWS AND CURSESIn this classic closed room mystery, someone is murdered during a knitting class. But how was it possible? Lucy Swift and her band of undead knitters must catch the culprit before there's a second Christmas catastrophe!Molly Fitz - MEOWY CHRISTMAS MAYHEMIt's Angie's first Christmas as a pet owner, and she can't wait to celebrate with Octo-Cat, Paisley, and Nan. All it takes is a little finely-crafted trickery to get her crabby tabby into the local pet supply store for a special photo opportunity with Santa. Unfortunately, the jolly old soul is found dead in the stock room before he ever gets the chance to say \"cheese.\" Angie and her motley crew of sidekicks need to work fast to find the culprit and prevent any further suspicious holiday slaying... Otherwise, the most wonderful time of the year could end up becoming the most murderous season Blueberry Bay has ever seen.Addison Moore - CHRISTMAS FUDGE FATALITYMy name is Lottie Lemon, and I see dead people. Okay, so I rarely see dead people, mostly I see furry creatures of the dearly departed variety, aka dead pets, who have come back from the other side to warn me of their previous owner's impending doom.The holidays have arrived and the Jolly Holly Tree Lot is hosting a special event that has the entire town bustling to get a picture with the jolly old elf himself. And I'm just as anxious as anyone to get to the front of the line, but that body I stumble upon threatens to take the joy right out of the season.",
  "genres": [
    "Short Stories"
  ],
  "author": "Lee Strauss",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/49620474-six-merry-little-murders"
}