{
  "title": "Backpacked: A Reluctant Trip Across Central America",
  "description": "The laugh-out-loud new travel memoir from the bestselling author of Mousetrapped: A Year and A Bit in Orlando, Florida\n\n \n\nCatherine Ryan Howard prefers bath robes to bed bugs, lattes to lizards and mini-bars to malaria. So why is she going backpacking? \n\n\n \nShe doesn't know either...    Catherine isn't the backpacking type. Working for one of the world's biggest hotel chains, she and her employee discount have become accustomed to complimentary bath robes, 24-hour room service and Egyptian cotton sheets. As for holidays, Catherine likes places that encourage lying - lying on the beach, by the pool, in bed...  She's been on what feels like one long holiday in Florida when her fearless best friend, Sheelagh, announces plans to backpack across Central America. With Catherine's US visa about to expire, her having no desire to return home to Ireland just yet and her common sense, evidently, on a day off, she agrees to go along.   After all, how bad can this backpacking thing be?   Um... very bad, actually. Catherine soon finds herself showering with the threat of electrocution, living with mutant cockroaches, sleeping on wooden planks, suffering from all but one of the side-effects listed on her bottle of anti-malarial tablets (liver failure, in case you were wondering) and riding a horse up the side of a smoking, lava-filled volcano.  And that's just the first week.   Backpacked is the wry tale of what happened when one very reluctant backpacker hit the backpacker trail and discovered that beyond the mosquitoes, bad coffee and flea-infested hostels lie even bigger mosquitoes, even worse coffee and flea-infested hostels whose bathrooms have no doors...",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Humor",
    "Adventure",
    "Autobiography",
    "Biography"
  ],
  "author": "Catherine Ryan Howard",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/12500815-backpacked"
}