{
  "title": "Cooking for Friends",
  "description": "TV’s most popular chef, Gordon Ramsay, bridges the gap between his famous chef’s table (situated in the white heat of his restaurant kitchen) and his table at home with Tana and their young family. His latest cookbook is packed with simple, seasonal, modern British recipes. Gordon lives life in the fast lane, travelling the world to foster his many hugely successful business enterprises and to film his highly acclaimed TV series. But, despite the commitments of a busy work life, he has always believed that families should sit around their tables to eat together as much as possible. His latest cookbook gathers together over 100 inspiring and well-constructed recipes which everyone will enjoy cooking for their friends and family, including Chorizo, broad bean and mint couscous, Scallop brochettes with coriander and chilli butter, Smoked salmon and horseradish cream tarts and Toffee and chocolate steamed pudding. The recipes embody Gordon’s strongly held opinion that we should support local producers and farmers’ markets, that we should cook with seasonal fresh ingredients which haven't travelled miles to reach our plates and that we should celebrate the wealth of regional dishes available to us from Cornish crab soup to Bakewell tarts. Gordon shares the dishes that he loves to cook (and eat) when he’s off duty. With chapters covering Hot and Cold Soups; Pasta and Grains; Fish and Shellfish; Meat and Poultry; Pies and Tarts; Vegetables and Salads; Puddings and Ices and Coffee and Chocolate, each recipe is introduced with an insight into why he has chosen it and includes tips on how to re-create it perfectly. With emphasis on simplicity for stunning results, the majority of the recipes are short and easy to cook. This beautiful book has been created by one of Britain's top designers, in tandem with an amazing young photographer. While food is king in this book, sprinkled as it is with candid photos of Gordon and the family, Cooking for Friends allows you to share his love of life and the good things in it.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference",
    "Biography",
    "Autobiography"
  ],
  "author": "Gordon Ramsay",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/4961923-cooking-for-friends"
}