{
  "title": "Golden Gates: Fighting for Housing in America",
  "description": "A stunning, deeply reported investigation into the housing crisis \nSpacious and affordable homes used to be the hallmark of American prosperity. Today, however, punishing rents and the increasingly prohibitive cost of ownership have turned housing into the foremost symbol of inequality and an economy gone wrong. Nowhere is this more visible than in the San Francisco Bay Area, where fleets of private buses ferry software engineers past the tarp-and-plywood shanties where the homeless make their homes. The adage that California is a glimpse of the nation's future has become a cautionary tale.With propulsive storytelling and ground-level reporting, New York Times journalist Conor Dougherty chronicles America's housing crisis from its West Coast epicenter, peeling back the decades of history and economic forces that brought us here and taking readers inside the activist uprisings that have risen in tandem with housing costs. To tell this new story of housing, Dougherty follows a struggling math teacher who builds a political movement dedicated to ending single-family-house neighborhoods. A teenaged girl who leads her apartment complex against their rent-raising landlord. A nun who tries to outmaneuver private equity investors by amassing a multimillion-dollar portfolio of affordable homes. A suburban bureaucrat who roguishly embraces density in response to the threat of climate change. A developer who manufactures homeless housing on an assembly line.Sweeping in scope and intimate in detail, Golden Gates definitively captures a fundamental political realignment in America as it plays out during a moment of rapid technological and social change.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Economics",
    "History",
    "Sociology",
    "Urbanism",
    "Urban Planning"
  ],
  "author": "Conor Dougherty",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/49640653-golden-gates"
}