{
  "title": "The Price of Peace: Money, Democracy, and the Life of John Maynard Keynes",
  "description": "A page-turning biography of world-changing economist John Maynard Keynes and the big ideas that outlived him.In the spring of 1934, Virginia Woolf sketched an affectionate biographical portrait of her great friend John Maynard Keynes. Writing a full two years before Keynes would revolutionize the economics world with the publication of The General Theory, Woolf nevertheless found herself unable to condense her friend's already-extraordinary life into anything less than twenty-five themes, which she jotted down at the opening of her homage: \"Politics. Art. Dancing. Letters. Economics. Youth. The Future. Glands. Genealogies. Atlantis. Mortality. Religion. Cambridge. Eton. The Drama. Society. Truth. Pigs. Sussex. The History of England. America. Optimism. Stammer. Old Books. Hume.\"Keynes was not only an economist, as he is remembered today, but the preeminent anti-authoritarian thinker of the twentieth century, a man who devoted his life to the belief that art and ideas could conquer war and deprivation. A moral philosopher, political theorist, and statesman, Keynes immersed himself in a creative milieu filled with ballerinas and literary icons as he developed his own innovative and at times radical thought, reinventing Enlightenment liberalism for the harrowing crises of his day--which included two world wars and an economic collapse that challenged the legitimacy of democratic government itself. The Price of Peace follows Keynes from intimate turn-of-the-century parties in London's riotous Bloomsbury art scene to the fevered negotiations in Paris that shaped the Treaty of Versailles, through stock market crashes and currency crises to diplomatic breakthroughs in the mountains of New Hampshire and wartime ballet openings at Covent Garden.In this riveting biography, veteran journalist Zachary D. Carter unearths the lost legacy of one of history's most important minds. John Maynard Keynes's vibrant, deeply human vision of democracy, art, and the good life has been obscured by technical debates, but in The Price of Peace, Carter revives a forgotten set of ideas with the power to reinvent national government and reframe the principles of international diplomacy in our own time.",
  "genres": [
    "Economics",
    "Biography",
    "History",
    "Nonfiction",
    "Politics",
    "Philosophy",
    "Business"
  ],
  "author": "Zachary D. Carter",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/49644992-the-price-of-peace"
}