{
  "title": "Five Day Fiancé",
  "description": "Jocko Brewer is handsome, rich, funny, and he’s my new fiancé…for five days.My name is Allison Jenkins and I need a fiancé for five days.I know how desperate that sounds, because it is. You see, after my college boyfriend and I broke up, he recovered swiftly, and is now — gasp — engaged to someone else. Did I mention he and I were dating for five years? That’s years. It took him five months to ask his new girl to marry him. FML. Our group of friends from college are going to Cancún for five days celebrating the wedding of our mutual friend this spring. It’s an April destination wedding. That means we’re all together in one tiny resort eating basically all of our meals together, hanging out at the pool together, and drinking together. All of my friends are bringing their husbands, fiancés, and/or boyfriends. I’m literally the only one of the group still in her twenties…and single. So I’ll be the girl hanging out at the bar with all of the single aunts drinking margaritas. (Which doesn’t sound too awful, by the way.) The awful part will be watching my ex flaunting his hot, new, younger fiancée in front of me. Basically, I need a plan — stat — so these five days don’t suck a$$.Enter my coworker, Jocko Brewer. Handsome playboy and charmer of the ladies. Number two sales rep in the entire company already — at age twenty-nine. And, surprisingly, the guy I get along with best in the office. Though, I have to admit, he is the definition — most times — of arrogance. He’s on record saying he’ll never settle down until his forties. Sounds silly to me, but whatever. If he’s crazy enough to agree to my little Cancún plot and act like we’re engaged, I’d be happy. But there’s just a little teensy-weensy problem that happens when we’re in Cancún. This fiancé role-playing bit?Well, we both start taking it just a wee bit too seriously. And that’s a grande problem.Somebody help me. I’m falling for the biggest playboy I know and I can’t get up. But, turns out Jocko does have a heart underneath that playboy façade. Who would have thought that so much could happen in five days?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers",
    "Audiobook",
    "Travel",
    "Chick Lit"
  ],
  "author": "Mickey Miller",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/49651901-five-day-fianc"
}