{
  "title": "Feminism for Women: The Real Route to Liberation",
  "description": "'Timely, necessary and important' J.K. Rowling'[This book is] guaranteed to remind us what we have still to fight for. I can't think of a single person who wouldn't benefit from reading it' Observer'Bindel is a rock star of second-wave feminism . . . an important, courageous book' The Times'Bindel delivers a robust call to arms in every chapter . . . this book could not be timelier . . . As a young feminist who has finally seen the light, I consider it essential reading' The CriticFeminism is a quest for the liberation of women from patriarchy. Feminism strives for a world in which women are not oppressed. Feminism prioritises exposing and ending male violence towards women and girls.This is Julie Bindel's feminism, a definition born of 40 years at the front line of the feminist movement. Why then, she asks, is feminism the only social justice movement in the world that is expected to prioritise every other issue before pursuing its own objective of women's liberation? Why does the movement appear to be moving backwards, accommodating the rights and feelings of men and leaving women in the cold? Women make up half the global population yet why is feminism still treated as a minority movement?In this searing and ground-breaking book, Bindel deconstructs the many pervasive myths about feminism - Do women really want what men have? Can men be feminists? Are women liberated by sexual violation? - assessing whether feminism has achieved its goals and debunking theories that second wave feminism is irrelevant and one-dimensional.Bindel shines a light on the most important issues, including pornography, sexual violence and prostitution. Drawing on Bindel's own experiences, as well as countless interviews with women and girls of all ages and backgrounds (as well as contributions from commentators such as Gloria Steinem and Chimamanda Ngozi Adichie), Feminism for Women presents a clear-sighted view of why feminism is a proud social movement that every woman on the planet benefits from.The invisible forces of misogyny affect us all.This book is a call to arms to reclaim feminism for all women.Only together can we resist and overcome.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Politics",
    "Gender",
    "Womens",
    "Social Science",
    "Sociology"
  ],
  "author": "Julie Bindel",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/49636606-feminism-for-women"
}