{
  "title": "The Complete Middle East Cookbook",
  "description": "The food of the Middle East is known for its diverse flavors and colors. Now you can enjoy all of these titillating meals in the comfort of your own home!Tess Mallos shows us how to produce delectable meals from the fascinating cultures of the Middle East, with recipes carefully tested and set out in easy to follow steps. Many of the dishes are illustrated, in 80 superb photographs.This book provides a brilliant insight into the regional dishes of Greece, Turkey, Lebanon, Egypt and Syria and an invaluable introduction to some of the lesser known cuisines of other countries in the Afghanistan, Armenia, Cyprus, Iran, Iraq, Jordan, Saudi Arabia, Bahrain, Kuwait, Oman, Qatar, the United Arab Emirates, and Yemen.The pages in this Middle Eastern Cookbook guide the reader through the vast scope of Middle Eastern food —recipes and photographs show how to use familiar foods in new and exciting ways, while the introduction to each chapter examines the food, lifestyle and cooking methods of each country, to explain exactly how to use the right ingredients in delicious, authentic dishes.The recipes ensure that the traditional essence of each cuisine is preserved, while the instructions are given in the clearest and most accessible way for the modern cook, with guidance wherever necessary for the use of today's appliances. The basics of Middle Eastern cooking are carefully explained, and the glossary gives regional names and descriptions of a host of food and ingredients.The Complete Middle East Cookbook is a joy to read and use in the kitchen. A bestselling classic, it has been revised and enhanced with contemporary photographs, so that it will continue to delight all who seek to know and enjoy the rich and varied cuisines of the Middle East.Recipes",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference"
  ],
  "author": "Tess Mallos",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/496305.The_Complete_Middle_East_Cookbook"
}