{
  "title": "Roses and Revenants",
  "description": "The dead don’t always respect my boundaries, but it’d be nice if they’d stop interrupting my coffee dates.As the last of the esteemed Bell coven, it is my solemn duty to uphold sacred witch tradition, and to protect humanity from the restless spirits of the dead.Instead, I'm a runaway exorcist living out of a junker van, without a care for the expectations that come with my family name. All I want is peace to work through the endless grief of my parents' horrific demise, but the universe seems determined to prevent that. The Great Covens are desperate to matchmake their way into my family fortune, and a new, sinister revenant lurks behind every mirror, a dark figure stalking me from the threshold of Death.Thankfully, I have Eric, my ever-loyal human guardian, protecting my body and soul as I traverse the deadside. He’s watched over me my entire life, but his vow to my father to keep me safe didn't extend to my heart, still in tatters over his rejection of my feelings for him.My childhood friend has finally tracked me down, intent on keeping me from running away again. In the five years I've been gone, Joss has become a gorgeous warlock who won't take no for an answer.Adrian -stoic, secretive, and far too enticing for his own good- has his own reasons for dragging me away from the world of humans, but his coven is plagued by rumors of dark magic I shouldn’t get involved with.I could handle all of that, if only Warden Stone hadn't made it his mission to annoy me to death. A deadline I'm not ready to face is looming, and this beautiful but irritating man is intent on forcing my hand.And I thought being on my own was hard. With four alluring men pushing and pulling me where they want me, can I uncover the dark skeletons in my family’s closet before it’s too late? Or will the last of the Bell exorcists join them in Death forever?Roses and Revenants is the first full-length novel in the House of Mirrors series, a dark, medium-burn paranormal reverse harem romance set in the Cimmerian Cage universe. With a strong heroine, steamy scenes, plenty of action and romance, and four gorgeous men in the harem, this witch will never have to choose. For mature readers only.",
  "genres": [],
  "author": "Cate Corvin",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/49680748-roses-and-revenants"
}