{
  "title": "The Politics of Anti-Semitism",
  "description": "How did a term, once used accurately to describe the most virulent evil, become a charge flung at the mildest critic of Israel, particularly concerning its atrocious treatment of Palestinians? Edited by Alexander Cockburn and Jeffrey St. Clair, the print and online journal CounterPunch has become a must read for hundreds of thousands a month who no longer believe anything they read in the mainstream press beyond the sports scores. On the subject of Israel and Palestine, the Israeli lobby in the U.S., the current Middle East crisis, and its ramifications at home and abroad, CounterPunch has been unrivaled. Herein, you’ll find CounterPunch ’s most compelling reporting and commentary on this topic. Contributors former U.S. Representative - Cynthia McKinney , famed British foreign correspon-dent Robert Fisk, former seniorCIA analysts Bill and Kathy Christison , the trenchant and witty philosopher Michael Neumann , seasoned Capitol Hill staffer \"George Sutherland,\" Norman Finkelstein , the leading Israeli dissident Yuri Avneri, Shaheed Alam (who became a target of the fanatical Daniel Pipes), and Israeli journalists Neve Gordon and Yigal Bronner . In addition Will Yeoman 's path-breaking essay on Israel and divestment, >Kurt Nimmo on the hysterical attacks on AmiriBaraka for his poem on 9-11, Anne Pettifer ’s Zionism Unbound , Jeffrey St. Clair on the (Israeli) attack on the USS Liberty and the suppression of the investigation, and >Alexander Cockburn ’s caustic and lightheartedmemoir of his own experiences of being attacked as an anti-Semite, consequent upon his criticisms of Israel. This first book in the new CounterPunch series, is a timely anthology on the compulsion of silence and complicity in crimes against a betrayed people. Nationally syndicated journalists Alexander Cockburn and Jeffrey St. Clair have co-authored numerous bestsellers, including The CIA, Drugs And The Press , Washington Babylon and Al A User’s Manual .",
  "genres": [
    "Politics",
    "Race",
    "History",
    "Political Science",
    "Nonfiction",
    "Israel",
    "American"
  ],
  "author": "Alexander Cockburn",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/496871.The_Politics_of_Anti_Semitism"
}