{
  "title": "A Princess and Her Scoundrel",
  "description": "Meet the captivating Tyndarian royalty and their forbidden loves as they dive into a world filled with danger, intrigue, and tender romance.From mysterious spies to celebrity bad boys, powerful billionaires, and everyday individuals thrust into the adventure, each must navigate treacherous paths in the wake of their country's shattering revolution. Claiming birthrights, defying betrayal. Will love conquer all, or will the lies rip them apart? Brace yourself to uncover secrets and join the unforgettable \"Spies and Royals\" in a thrilling journey where heart-pounding suspense dances hand in hand with contageous laughter and sweet, irresistible romance.In book one, a Princess and HER Scoundrel:Paris James, the dashing heartthrob of the high seas, knows how to throw epic parties on his yacht for his father's richest clients. Testing and perfecting luxurious water toys, he lives a carefree bachelor's life. He has no room for love until destiny helps him win the royal Tyndarian bracelet in a game of chance—-and with that bracelet, comes a very special girl who steals his breath away.Laney Moon, a sweet and dedicated first-grade teacher, leads a normal life, but her world turns upside down when her cousin loses her treasured heirloom bracelet in a rigged poker game--a terrible blow that could cost her grandmother's beloved home. Determined to reclaim what rightfully belongs to her, Laney stows aboard Paris's majestic vessel and is shocked to run straight into the arms of a man whose stormy blue eyes and irresistible smile ignites a fire in her heart she's never imagined.In a whirlwind of romance and chance, Paris proposes an exhilerating gamble: if Laney can convince the other guests aboard the yacht that she is the long-lost princess who once possessed the precious bracelet, he will gladly hand it back to her. As their daring charade unfolds, they unwittingly attract the attention of shadowy forces. Are they after the priceless artifact or is there a deeper mystery at play? It's up to Paris to be the daring and seemingly uncaring pirate, all to keep Laney safe from harm.As danger lurks and the stakes build, so do their feelings for each other. Paris finds himself torn between shielding Laney from her haunting past  and forging a future where she becomes an irreplaceable part of his life... because, princess or not, Laney Moon has already sailed away with his heart.",
  "genres": [
    "Contemporary"
  ],
  "author": "Stephanie Fowers",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/49695620-a-princess-and-her-scoundrel"
}