{
  "title": "The Story of Mary Schwandt: Her Captivity During the Sioux Outbreak of 1862",
  "description": "\"Mattie Williams and Mary Schwandt were taken prisoners, the treatment was brutal and inhuman.\" -Indian Outbreaks (1904) \"Mattie Williams and Mary Schwandt were captured unhurt, and were taken back to Waucouta's village.\" -History of Redwood County, Minnesota (1916)  The stories of those pioneers who have survived captivity among Native American tribes during hostile outbreaks along frontier settlements are full of harrowing interest. Of particular interest is that told by Mary Schwandt (1848-1939) in her 1894 narrative, \"The Story of Mary Schwandt: Her Captivity During the Sioux Outbreak of 1862.\"  On the morning of the 18th of August, 1862, at about 6 o'clock, John Moore, a \"half-breed trader,\" residing near the Minnesota residence where Mary Schwandt worked as a maid, came to the house and informed them that there was an outbreak among the Sioux, and that they had better leave at once. Her employer, Mr. Reynolds immediately got out his buggy, and, taking his wife, started off across the prairie in such a direction as to avoid the Agency. At the same time Schwandt got into the wagon of a Mr. Patoile, a trader at Yellow Medicine, who had just arrived there on his way to New Ulm, and they also started out on the prairie.  In describing the moment the Sioux overtook their wagon, Schwandt writes:  \"As we leaped out Mr. Davis said, 'We are lost!' … Some shots passed through my dress, but I was not hit. Miss Williams, too, was unhurt. I was running as fast as I could towards the slough, when two Indians caught me, one by each of my arms…\"  In describing one frightening encounter back at the village, Schwandt recounts:  \"One day I was sitting quietly and shrinkingly by a tepee when he came along dressed in full chief's costume and looking very grand. Suddenly he jerked his tomahawk from his belt and sprang toward me. He glared down upon me so savagely. He brandished his tomahawk over me a few times, then laughed, put it back in his belt and walked away, still laughing and saying something in Indian….\"  She concludes her harrowing account by thanking the heroic Sioux woman risked her own life to save her:  \"Wherever you are, Maggie, I want you to know that the little captive German girl you so often befriended and shielded from harm loves you still for your kindness and care, and she prays God to bless you and reward you in this life and that to come.\"",
  "genres": [
    "History"
  ],
  "author": "Mary Schwandt",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/49683770-the-story-of-mary-schwandt"
}