{
  "title": "Linguistic Justice: Black Language, Literacy, Identity, and Pedagogy",
  "description": "Bringing together theory, research, and practice to dismantle Anti-Black Linguistic Racism and white linguistic supremacy, this book provides ethnographic snapshots of how Black students navigate and negotiate their linguistic and racial identities across multiple contexts. By highlighting the counterstories of Black students, Baker-Bell demonstrates how traditional approaches to language education do not account for the emotional harm, internalized linguistic racism, or consequences these approaches have on Black students' sense of self and identity. This book presents Anti-Black Linguistic Racism as a framework that explicitly names and richly captures the linguistic violence, persecution, dehumanization, and marginalization Black Language-speakers endure when using their language in schools and in everyday life. To move toward Black linguistic liberation, Baker-Bell introduces a new way forward through Antiracist Black Language Pedagogy, a pedagogical approach that intentionally and unapologetically centers the linguistic, cultural, racial, intellectual, and self-confidence needs of Black students. This volume captures what Antiracist Black Language Pedagogy looks like in classrooms while simultaneously illustrating how theory, research, and practice can operate in tandem in pursuit of linguistic and racial justice.　A crucial resource for educators, researchers, professors, and graduate students in language and literacy education, writing studies, sociology of education, sociolinguistics, and critical pedagogy, this book features a range of multimodal examples and practices through instructional maps, charts, artwork, and stories that reflect the urgent need for antiracist language pedagogies in our current social and political climate.",
  "genres": [
    "Nonfiction",
    "Education",
    "Teaching",
    "Social Justice",
    "Linguistics",
    "Writing",
    "Race"
  ],
  "author": "April Baker-Bell",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/49705087-linguistic-justice"
}