{
  "title": "The Leader in Me: How Schools and Parents Around the World Are Inspiring Greatness, One Child At a Time",
  "description": "The world has entered an era of the most profound and challenging change in human history. Most of our children are not prepared, and we know it. Parents around the world see the change and know that the traditional three R's -- reading, writing, and arithmetic -- are necessary, but not enough. Their children need to become far more responsible, creative, and tolerant of differences. They need to increase their ability to think for themselves, take initiative, get along with others, and solve problems. Business leaders are not finding people whose skills and character match the demands of today's global economy, including strong communication, teamwork, analytical, technology, and organizational skills. They need young people who are self-motivated, creative, and have a strong work ethic. How will we bridge this ever-widening gap? The Leader in Me is the story of the extraordinary schools, parents, and business leaders around the world who are preparing the next generation to meet the great challenges and opportunities of the twenty-first century. In 1999, the A.B. Combs Elementary School in North Carolina was on the verge of being cut as a magnet school and needed to find new ways to educate its students. Teachers and administrators began teaching practical, principle-based leadership skills -- with remarkable results. In a short time, the number of students passing end-of-grade tests vaulted from 84 to 97 percent. Simultaneously, the school began reporting significant increases in students' self-confidence, dramatic drops in discipline problems, and striking increases in teacher and administrator job satisfaction. Parents, meanwhile, reported equivalent improvements in their children's attitudes and behavior at home. As news of the school's success spread, schools around the world began adopting the mantra to \"develop leaders, one child at a time.\" Business and civic leaders started partnering with schools in their communities to sponsor teacher training and student resources. Each school and family approached the principles differently, but the results were the same -- attentive, energized young people engaging in the world around them. The best way to prepare the next generation for the future is to emphasize the value of communication, cooperation, initiative, and unique, individual talent -- for nothing undermines confidence more than comparison. Whether in the classroom or at home, it is never too early to start applying leadership skills to everyday life. Drawing on the many techniques and examples that have already seen incredible success around the world, The Leader in Me shows how easy it is to incorporate these skills into daily life. It is a timely answer to many of the challenges facing today's young people, businesses, parents, and educators -- one that is perfectly matched to the global demands of the twenty-first century.",
  "genres": [
    "Education",
    "Nonfiction",
    "Leadership",
    "Parenting",
    "Teaching",
    "Self Help",
    "School"
  ],
  "author": "Stephen R. Covey",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/4972618-the-leader-in-me"
}