{
  "title": "An Elm Creek Quilts Sampler",
  "description": "Three Complete Novels,  The Quilter's Apprentice, Round Robin, and The Cross-Country Quilters, from The New York Times Bestselling Author, Jennifer Chiaverini  Here's where it all began -- the three novels that first made beloved friends of the Elm Creek Quilters, who stepped out of Pennsylvania's idyllic Elm Creek Manor and into the heart of America.  The Quilter's Apprentice: Master quilter Sylvia Compson shares the secrets of her creative gifts with her young assistant, Sarah McClure. During their lessons, the intricate, varied threads of Sylvia's life begin to emerge. It is the story of a young wife living through the hardships and agonies of the World War II home front; of a family torn apart by jealously and betrayal; of misunderstanding, loss, and a tragedy that can never be undone. As the bond between them deepens, Sarah resolves to help Sylvia free herself from remembered sorrows and restore her life -- and her home, Elm Creek Manor -- to its former glory. In turn, Sylvia helps Sarah confront her own troubled past. Out of their shared triumph is born a lifelong friendship and a fledgling business called Elm Creek Quilts.  Round Robin: To celebrate the beginning of Elm Creek Quilts, Sarah, Sylvia, and their circle of friends name themselves the Elm Creek Quilters. As a gift to Sylvia, the others have begun a round robin -- a quilt created by sewing concentric patchwork to a central block as it is passed around a sewing circle. As each woman makes her creative contribution, she adds her story to the history of Elm Creek Manor. Resplendent in green, blue, and gold, the quilt serves as a symbol of the complex, lasting ties that unify mothers and daughters, sisters and friends. As they stitch together the sometimes harmonious -- often discordant -- scraps of their crazy-quilt lives, the Elm Creek Quilters learn that friendship is a most precious gift and that even in the darkest of times, love illuminates the way home.  The Cross-Country Quilters: Five women arrive at Elm Creek Manor, hoping to find in their quilting lessons an escape from the problems they have left at home. This far-flung group becomes fast friends who pledge to complete a \"challenge quilt\" -- symbolic of each woman's personal goals -- in one year's time. Although the Cross-Country Quilters share a common creative goal, as the year goes by, their bonds are tested by the demands of daily life. But despite differences in age, race, and background, the friends' love for quilting and affection for one another unite them in a patchwork of caring and acceptance. The quilt they make reminds them of an everlasting truth -- friends may be separated by great distance, yet the strength of their bond can transcend any obstacle.  \"Endearing characters and pleasant vignettes render this series as charming and cozy as a favorite blanket,\" said Publishers Weekly of the Elm Creek Quilts books. Jennifer Chiaverini is at her heartwarming best in these three novels that launched a bestselling phenomenon.",
  "genres": [
    "Fiction",
    "Quilting",
    "Mystery",
    "Chick Lit",
    "Crafts",
    "Womens Fiction",
    "Adult"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/49709.An_Elm_Creek_Quilts_Sampler"
}