{
  "title": "Our Way Back to Always",
  "description": "Luisa (Lou) Patterson grew up across the street from Sam Alvarez in the small, quirky town of Port Coral. They used to be inseparable--spending every holiday together, shooting silly YouTube videos, and rescuing stray cats. But then middle school happened, including the most disastrous (and embarrassing) serenade ever, and Lou and Sam haven't talked in the four years since. Sam is now the golden boy with plenty of friends, while Lou is an introverted romantic who's happy playing video games and writing fan fiction. But it's also the summer before their senior year, and life is knocking on Lou's door.With her older sister having given up a scholarship to Princeton to have a baby and work at the local botanica, all of their mother's expectations are now riding on Lou's shoulders. She's retaking her SAT's, signed up for way too many AP classes, and her sights set on colleges with fancy names like Duke and Vanderbilt. But when she finds the bucket list she and Sam wrote together as kids, before Sam's father was diagnosed with cancer, she's shocked to see that she hasn't accomplished any of the goals she'd set for herself. Go to a party? Nope. Pull the greatest prank of all time? Still no. Learn how to be a really good kisser? Definitely not.Torn between the future that her mother, sister, and younger self planned for her, Lou sets out to finish the list, and in a stroke of destiny or fate, Sam decides to tag along. Still trying to stay afloat amid the grief of losing his father, Sam himself is staring down a future that feels all too close, and is coming far too fast. But with the bucket list to guide them, Sam and Lou might just be able to find a way through the future, and also a way back to each other.",
  "genres": [
    "Romance",
    "Contemporary",
    "Young Adult",
    "Young Adult Romance",
    "Young Adult Contemporary",
    "Audiobook",
    "Fiction"
  ],
  "author": "Nina Moreno",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/49705954-our-way-back-to-always"
}