{
  "title": "The Hidden Forest: The Biography of an Ecosystem",
  "description": "The tallest species of spruce, hemlock, fir, cedar, and pine trees on earth coexist in the old growth of the H. J. Andrews Experimental Forest in Oregon’s Cascade Range. Set aside as a living laboratory by the U.S. Forest Service in 1948, the 16,000 acres represent a vital scientific the long-term study of a single contained ecosystem. Here, for the first time, researchers from an enormous range of disciplines—forest scientists, botanists, entomologists, wildlife ecologists, soil biologists, and others—have assembled to examine the role of every working element in the life of a forest. In The Hidden Forest , veteran science writer Jon Luoma offers an absorbing account of how these scientists came to recognize the importance of natural forest ecosystems and how their research is revolutionizing forest management. Luoma takes readers into the hidden forest where researchers have discovered a host of species previously unknown to science, and interactions in the forest ecosystem that no one previously imagined. He describes projects dealing with the forest canopy, rotting logs, insects, fungi, wildlife, streams, and the effects of flood, fire, clear cutting, and volcanic eruption. And he tells the human story behind the research, capturing the shared excitement and wonder of scientific discovery. Along the way, Luoma provides a short course in such complex issues as forest succession, biodiversity, and the politics of forestry. In a new foreword, Jerry Franklin discusses the importance of dedicated, long-term research sites and comments on new discoveries that have emerged from forest ecosystem research since The Hidden Forest was first published.",
  "genres": [
    "Nature",
    "Science",
    "Nonfiction",
    "Ecology",
    "Natural History",
    "Biology",
    "Environment"
  ],
  "author": "Jon R. Luoma",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1250232.The_Hidden_Forest"
}