{
  "title": "Memoirs of an Addicted Brain: A Neuroscientist Examines his Former Life on Drugs",
  "description": "A gripping, ultimately triumphant memoir that's also the most comprehensive and comprehensible study of the neuroscience of addiction written for the general public.FROM THE \"We are prone to a cycle of craving what we don't have, finding it, using it up or losing it, and then craving it all the more. This cycle is at the root of all addictions, addictions to drugs, sex, love, cigarettes, soap operas, wealth, and wisdom itself. But why should this be so? Why are we desperate for what we don't have, or can't have, often at great cost to what we do have, thereby risking our peace and contentment, our safety, and even our lives?\"The answer, says Dr. Marc Lewis, lies in the structure and function of the human brain.Marc Lewis is a distinguished neuroscientist. And, for many years, he was a drug addict himself, dependent on a series of dangerous substances, from LSD to heroin. His narrative moves back and forth between the often dark, compellingly recounted story of his relationship with drugs and a revelatory analysis of what was going on in his brain.He shows how drugs speak to the brain - which is designed to seek rewards and soothe pain - in its own language. He shows in detail the neural mechanics of a variety of powerful drugs and of the onset of addiction, itself a distortion of normal perception.Dr. Lewis freed himself from addiction and ended up studying it. At the age of 30 he traded in his pharmaceutical supplies for the life of a graduate student, eventually becoming a professor of developmental psychology, and then of neuroscience - his field for the last 12 years. This is the story of his journey, seen from the inside out.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Memoir",
    "Science",
    "Neuroscience",
    "Biography",
    "Mental Health"
  ],
  "author": "Marc  Lewis",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12502722-memoirs-of-an-addicted-brain"
}