{
  "title": "Smut University, Part 2",
  "description": "Series Blurb: Jaxon Michaels is a New York Times bestseller many times over. Going against his father’s inclinations and seizing his own dreams, he is compelled to share his inspiration with other aspiring authors, and so teaches several writing classes at an Ivy League University. The most notable and popular of these is The Art of Sex… in Writing; how to write realistic and super hot love scenes! Jax is confident, gorgeous, rich, famous, oozing sexuality, and leaves his readers and students swooning.Addison Tomms is a beautiful senior English and Creative Writing major at Columbia with high hopes of becoming published one day. She’s already written a novel in secret and is anxious for her new professor’s opinion. Addy knows most people take his class to get off, and despite feeling the effects of his charming and charismatic demeanor, and intimidated by his talent, she’s there to get an education.From day one, Jax and Addy are drawn to each other and their written words light the other on fire. Desire explodes and gets out of control when the sexy professor yearns to help his brilliantly gifted student reach the height of publishing success, yet can’t seem to keep his hands to himself. It could mean trouble—on many levels—for them both.Smut University is a super-steamy roller coaster of emotion and sensual overload that goes off the rails when the line between love and lust become indistinguishable. And, what happens when deception and jealousy threaten to destroy Jax and Addy’s very fragile and very hot relationship? Can Addy trust Jax… and her heart?This novella serial is true Kahlen Aymes from cover to cover: full of humor, heart, heat… and angst! She’ll leave you gasping, panting, and crying for more. You won’t want to miss a single page of this scorching, yet very romantic story! #ProfessorPantyMelter & #StudentSexyPants #GetAnEducation",
  "genres": [
    "College",
    "Erotica"
  ],
  "author": "Kahlen Aymes",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/49755209-smut-university-part-2"
}