{
  "title": "First Flyght",
  "description": "Betrayal will send her back to him. Grit and determination will forge her future.Vivian Kawabata is ready to claim her birthright and ascend to the head of the family empire, but that dream ends when her brother stabs her in the back, draining the accounts and leaving her unable to pay for so much as a pair of shoes.But she’s not giving up without a fight.To stand a chance of restoring her rightful place in the universe, the rule-following Vivian may have to break a few intergalactic laws. After how she’s been treated, it’s a price she’s willing to pay.With an old starship she secured from her aunt, she takes on two new roles: a sexy heiress collecting eligible bachelors and a hard-nosed captain rebuilding a lost fortune by any means necessary.Completely out of her depth, she’d be sunk without the help of a relationship broker, a handsome ex-boyfriend, a hacker with a heart of gold, and a host of other romantic partners she meets along the way.With a business that runs the razor’s edge between trade and smuggling, the former high-society socialite will have to choose between love and business if she’s to rebuild her empire.First Flyght is the first book in the Flyght Series of star-spanning sci-fi romance. If you like action-packed space operas and a universe full of twists, then you’ll love S. J. Pajonas’s interstellar adventure.Please note: THIS SERIES MUST BE READ IN ORDER. It is a true series and plot elements carry through every book, from beginning to end. You will miss too much by reading this series out of order or skipping around. The Flyght Series is complete at six books. This is also a slow-burn romance series that contains profanity and sexual situations.",
  "genres": [
    "Reverse Harem",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Space",
    "Adult"
  ],
  "author": "S.J. Pajonas",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/49756101-first-flyght"
}