{
  "title": "Heroes A2Z #12: Lost Puppy Love",
  "description": "HEROES A2Z #12LOST PUPPY LOVEThis puppy and potion demand your devotion.When the heroes go to the pet store, they can’t agree on what kind of animal to adopt. Abigail wants a turtle, Andrew a snake, and Baby Zoë a hyena. What crazy choices! But Mom and Dad put their feet down. One family, one pet. So the heroes leave and won’t return until they can agree on a pet. That night while camping, the decision seems to be made for them. An adorable puppy wanders into the heroes’ campsite. Suddenly it’s bark vs. bite when this lost puppy finds all kinds of trouble. With a sip of Love Potion #K9, people become pets and every dog has its day. Will the heroes be collared and sent to the doghouse?The 14-book Heroes A2Z chapter book series follows the funny adventures of three superhero kids from Traverse City, Michigan. Each illustrated book includes over one hundred drawings and is perfect for all elementary school students, grades K-6. The books also make great read-alouds.Meet Abigail, the oldest of the heroes. When it comes to sports, she can't be beat--not at arm wrestling, not at archery, and certainly not at aces on the tennis court. Andrew comes next. He's Abigail's twin, youngest by a measly eight minutes. If it has wheels, Andrew can ride it. He's amazing, astounding, and accomplished on wheels. Last but definitely least is Baby Zoë. She's the strongest of the heroes, like Superman in a diaper. She can't walk that well, but she can fly and shoot lasers out of her eyes. Zoë puts the \"aww\" in awesome.Throughout their adventures, the superheroes battle kung fu kitties, dinosaurs, aliens, monkey-driven monster trucks, and a rockstar from outer space. They travel to the South Pole, the Rock-n-Roll Hall of Fame in Ohio, and to scenic Mackinac Island. Wherever danger lurks, wherever villains strike, expect Heroes A2Z to save the day!ALSO AVAILABLEHeroes A2Z #1: Alien Ice CreamHeroes A2Z #2: Bowling Over HalloweenHeroes A2Z #3: Cherry Bomb SquadHeroes A2Z #4: Digging For DinosHeroes A2Z #5: Easter Egg HauntHeroes A2Z #6: Fowl MouthwashHeroes A2Z #7: Guitar Rocket StarHeroes A2Z #8: Holiday HoldupHeroes A2Z #9: Ivy League All-StarsHeroes A2Z #10: Joey Down UnderHeroes A2Z #11: Kung Fu KittiesHeroes A2Z #12: Lost Puppy LoveHeroes A2Z #13: Monkey Monster TruckHeroes A2Z #14: Nursery Rhyme Crime",
  "genres": [],
  "author": "David Anthony",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/12502569-heroes-a2z-12"
}