{
  "title": "A Thousand Country Roads",
  "description": "Ten years and twelve million copies after the first printing of The Bridges of Madison County, Robert James Waller brings to a poignant conclusion his story of the love affair between a wandering photographer and the conventional wife of an Iowa farmer. In A Thousand Country Roads, Robert Kincaid initially finds himself with little but memories of a lonely existence lived mostly on the road and memories of Francesca Johnson, the woman whose passion he stirred so briefly and with such power. So, with his memories pushing him, searching for something undefined, something to give meaning to the rest of his life, Kincaid takes to the road again in what becomes a journey of discovery and surprise. With his dog Highway beside him in an old truck named Harry, Kincaid begins a long winding run back to Roseman Bridge in Madison County, Iowa, returning to the place of his great love affair. Living her own solitary life, Francesca still visits Roseman Bridge and reflects on her days and nights with Robert Kincaid. Cherishing the memory of the strange, wandering man who changed her world, she vows to search for him. On the expedition he calls Last Time, Kincaid wanders through Oregon, northern California, eastward to the Dakotas, and on to Iowa. Along the way, a chance encounter with a woman from his distant past reveals another dimension of his life he could not have imagined. Finally, in a Seattle bar called Shorty's, where saxophonist Nighthawk Cummings still plays on Tuesday nights, Kincaid turns in his chair, looking inward and outward at the same time, and smiles at what he sees sitting before him. And so it comes, the ultimate loner finds he is not as alone as he once believed. There was something about this man that was out of the ordinary, something almost familiar about him. Sunlight angled down and caught the right side of his face, caught the long gray hair parted in the middle and brushed back along the top and sides. The sea wind came and blew his hair, and he reached to push it back from his face, pulled an orange suspender higher on his shoulder, adjusted the leather Swiss Army knife case on his belt. The sun passed behind a cloud, and he fell into shadow for a few seconds before sunlight again came on him. She experienced an involuntary shudder and had a powerful urge to walk outside and talk with the man. And later: He was glad he had come. It had not been a mistake. Here, in the old bridge, he felt a kind of serenity, and he bathed in the feeling and came quiet within himself. At that moment, he knew this place would be his home ground, the place where his ashes would someday drift out over Middle River. He hoped some of his dust would become one with the bridge and the land, and that some might wash far downstream and into larger rivers and then into all the seas he had crossed on crowded troop ships or night jets to somewhere. From A Thousand Country Roads Author Biography: Robert James Waller grew up in the small town of Rockford, Iowa, and was educated at the University of Northern Iowa and Indiana University. He was for many years a professor at his Iowa alma mater, where he also served as Dean of the College of Business from 1979 to 1986. He lives on a remote ranch in the high desert mountains of Texas and pursues his interests in writing, photography, music, economics and mathematics. This is his tenth book.",
  "genres": [
    "Fiction",
    "Romance",
    "Novels",
    "Adult Fiction",
    "Chick Lit",
    "Classics",
    "Drama"
  ],
  "author": "Robert James Waller",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/49760.A_Thousand_Country_Roads"
}