{
  "title": "Black Berry, Sweet Juice: On Being Black and White in Canada",
  "description": "Lawrence Hill's remarkable novel, Any Known Blood, amulti-generational story about a Canadian man of mixed race, was met withcritical acclaim and it marked the emergence of a powerful new voice in Canadianwriting. Now Hill, himself a child of a black father and white mother, brings usBLACK BERRY, SWEET JUICE: On Being Black and White in Canada, \n \naprovocative and unprecedented look at a timely and engrossing topic.In BLACK BERRY, SWEET JUICE, Hill movingly reveals his struggleto understand his own personal and racial identity. Raised by human rightsactivist parents in a predominantly white Ontario suburb, he is imbued withlingering memories and offers a unique perspective. In a satirical yet serioustone, Hill describes the ambiguity involved in searching for his identity - anespecially complex and difficult journey in a country that prefers to see him asneither black nor white.Interspersed with slices of his personal experiences, fascinating familyhistory and the experiences of thirty-six other Canadians of mixed raceinterviewed for this book, BLACK BERRY, SWEET JUICE also examinescontemporary racial issues in Canadian society. Hill explores the terms used todescribe children of mixed race, the unrelenting hostility towards mix-race couples and the real meaning of the black Canadianexperience. It arrives at a critical time when, in the highly publicized andcontroversial case of Elijah Van de Perre, the son of a white mother and blackfather in British Columbia, the Supreme Court of Canada has just granted custodyto Elijah's mother, Kimberly Van de Perre.A reflective, sensitive and often humourous book, BLACK BERRY, SWEET JUICEis a thought provoking discourse on the current status of race relations inCanada and it's a fascinating and important read for us all.",
  "genres": [
    "Nonfiction",
    "Canada",
    "Memoir",
    "Race",
    "Sociology",
    "Book Club",
    "History"
  ],
  "author": "Lawrence Hill",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/497821.Black_Berry_Sweet_Juice"
}