{
  "title": "Beginners: The Joy and Transformative Power of Lifelong Learning",
  "description": "The best-selling author of Traffic and You May Also Like now gives us a thought-provoking, playful journey into the transformative joys that come with starting something new, no matter your ageWhy do so many of us stop learning new skills as adults? Are we afraid to be bad at something? Have we forgotten the sheer pleasure of beginning from the ground up? Or is it simply a fact that you can't teach an old dog new tricks?Inspired by his young daughter's insatiable need to know how to do almost everything, and stymied by his own rut of mid-career competence, Tom Vanderbilt begins a year of learning purely for the sake of learning. He tackles five main skills (and picks up a few more along the way), choosing them for their difficulty to master and their distinct lack of career marketability--chess, singing, surfing, drawing, and juggling. What he doesn't expect is that the circuitous paths he takes while learning these skills will prove even more satisfying than any knowledge he gains.He soon finds himself having rapturous experiences singing Spice Girls songs in an amateur choir, losing games of chess to eight-year-olds, and dodging scorpions at a surf camp in Costa Rica. Along the way, he interviews dozens of experts to explore the fascinating psychology and science behind the benefits of becoming an adult beginner. Weaving comprehensive research and surprising insight gained from his year of learning dangerously, Vanderbilt shows how anyone can get better at beginning again--and, more important, why they should take those first awkward steps. Ultimately, he shares how his refreshed sense of curiosity opened him up to a profound happiness and a deeper connection to the people around him. It's about how small acts of reinvention, at any age, can make life seem magical.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Audiobook",
    "Education",
    "Personal Development",
    "Memoir"
  ],
  "author": "Tom Vanderbilt",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/49829875-beginners"
}