{
  "title": "Cabin 1",
  "description": "From bestselling and multi-award-winning romantic suspense author Amanda McKinney comes the first book in the steamy, edge-of-your-seat, three-part series, Steele Shadows Security…\nHidden deep in the remote mountains of Berry Springs is a private security firm where some go to escape, and others find exactly what they’ve been looking for.\n\nWelcome to Cabin 1, Cabin 2, Cabin 3…\nCocky, reckless, and die-hard playboy were just a few of the names Gage Steele had been called since he and his brothers left the Marines and moved back to the small, southern town of Berry Springs to take over their father’s personal security firm. On the one-year anniversary of his father’s death, Gage had only two things in mind—endless whiskey and endless women, but what he got was a battered, bruised spitfire stumbling through woods in the middle of the night.Newly-appointed prosecutor and unapologetic workaholic, Niki Avery had spent her life working toward one goal—never to have to depend on anyone but herself… until the day she was brutally attacked on the side of the road. Stripped of her Louis Vuitton and her dignity, the fiercely independent ADA must submit to being under the watchful eye of a former Marine, a loose cannon with a temper as scorching as his ruggedly handsome good looks. As cracks begin to show in the Steele family, including newly discovered evidence that their father’s death was no accident, Gage wrestles with his growing feelings for his client, knowing not only that Niki is off-limits, but together, they were like gasoline and fire—an explosion he wanted nothing more than to ignite in the bedroom. But when a pair of bloody body parts show up at the compound, it becomes clear that Niki’s attacker hasn’t given up and Gage realizes he’ll do anything to keep her safe… even as his own family is spiraling out of control.Cabin 1 is the first book in the 3-part Berry Springs spinoff series, STEELE SHADOWS SECURITY—and is its darker, grittier, steamier partner. Enjoy. ;)",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Contemporary",
    "Military Fiction",
    "Contemporary Romance",
    "Thriller"
  ],
  "author": "Amanda McKinney",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/49837700-cabin-1"
}