{
  "title": "The Biggest Bluff: How I Learned to Pay Attention, Master Myself, and Win",
  "description": "The New York Times bestseller!A New York Times Notable Book“The tale of how Konnikova followed a story about poker players and wound up becoming a story herself will have you riveted, first as you learn about her big winnings, and then as she conveys the lessons she learned both about human nature and herself.” — The Washington PostIt's true that Maria Konnikova had never actually played poker before and didn't even know the rules when she approached Erik Seidel, Poker Hall of Fame inductee and winner of tens of millions of dollars in earnings, and convinced him to be her mentor. But she knew her a famously thoughtful and broad-minded player, he was intrigued by her pitch that she wasn't interested in making money so much as learning about life. She had faced a stretch of personal bad luck, and her reflections on the role of chance had led her to a giant of game theory, who pointed her to poker as the ultimate master class in learning to distinguish between what can be controlled and what can't. And she certainly brought something to the table, including a Ph.D. in psychology and an acclaimed and growing body of work on human behavior and how to hack it. So Seidel was in, and soon she was down the rabbit hole with him, into the wild, fiercely competitive, overwhelmingly masculine world of high-stakes Texas Hold'em, their initial end point the following year's World Series of Poker.But then something extraordinary happened. Under Seidel's guidance, Konnikova did have many epiphanies about life that derived from her new pursuit, including how to better read, not just her opponents but far more importantly herself; how to identify what tilted her into an emotional state that got in the way of good decisions; and how to get to a place where she could accept luck for what it was, and what it wasn't. But she also began to win. And win. In a little over a year, she began making earnest money from tournaments, ultimately totaling hundreds of thousands of dollars.  She won a major title, got a sponsor, and got used to being on television, and to headlines like \"How one writer's book deal turned her into a professional poker player.\" She even learned to like Las Vegas.But in the end, Maria Konnikova is a writer and student of human behavior, and ultimately the point was to render her incredible journey into a container for its invaluable lessons. The biggest bluff of all, she learned, is that skill is enough. Bad cards will come our way, but keeping our focus on how we play them and not on the outcome will keep us moving through many a dark patch, until the luck once again breaks our way.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Memoir",
    "Self Help",
    "Biography",
    "Business",
    "Audiobook"
  ],
  "author": "Maria Konnikova",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/49814228-the-biggest-bluff"
}