{
  "title": "Twilight of the Mammoths: Ice Age Extinctions and the Rewilding of America",
  "description": "As recently as 11,000 years ago—\"near time\" to geologists—mammoths, mastodons, gomphotheres, ground sloths, giant armadillos, native camels and horses, the dire wolf, and many other large mammals roamed North America. In what has become one of science's greatest riddles, these large animals vanished in North and South America around the time humans arrived at the end of the last great ice age. Part paleontological adventure and part memoir, Twilight of the Mammoths presents in detail internationally renowned paleoecologist Paul Martin's widely discussed and debated \"overkill\" hypothesis to explain these mysterious megafauna extinctions. Taking us from Rampart Cave in the Grand Canyon, where he finds himself \"chest deep in sloth dung,\" to other important fossil sites in Arizona and Chile, Martin's engaging book, written for a wide audience, uncovers our rich evolutionary legacy and shows why he has come to believe that the earliest Americans literally hunted these animals to death.As he discusses the discoveries that brought him to this hypothesis, Martin relates many colorful stories and gives a rich overview of the field of paleontology as well as his own fascinating career. He explores the ramifications of the overkill hypothesis for similar extinctions worldwide and examines other explanations for the extinctions, including climate change. Martin's visionary thinking about our missing megafauna offers inspiration and a challenge for today's conservation efforts as he speculates on what we might do to remedy this situation—both in our thinking about what is \"natural\" and in the natural world itself.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Palaeontology",
    "Natural History",
    "Nature",
    "Biology"
  ],
  "author": "Paul S. Martin",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/49825.Twilight_of_the_Mammoths"
}