{
  "title": "Portrait of Death: Unforgotten",
  "description": "Three years ago, I held her pink silk toe shoe in my hand, helplessly watching the cab drive away before I could give it back to her. The next morning when I stood in front of the portrait drying on my easel, I knew the beautiful ballerina would soon die. Her portrait is one of two hundred and twenty-seven. Each one of the subjects is the victim of murder, and I’ve painted them all. I’ve kept my morbid ability a secret for twenty years, terrified someday, someone would find out.  Someday has arrived, and the someone banging down my door today demanding answers is a gorgeous, irate homicide detective armed with a photo of one of my paintings right there on the front page of the most popular tabloid in the city. He peppers me with questions I can’t answer, and despite my worst fears being realized, all I can think about is painting this man, alive, and with far fewer clothes on.  Detective Callum Graham tells me the dead ballerina I painted is his sister, and she's been missing for three years. Missing, he says firmly, as though any other conclusion is unacceptable. My inappropriate thoughts of seeing him naked, vanish. How do I explain to this man, this brother desperate to find his baby sister alive, that she’s been dead for two years, eleven months, and three weeks?   AUTHOR'S NOTE  There have been allegations made by unnamed individuals who have not read this book in its entirety, as to the so-called ‘political rant’ included in this novel and a singular remark of “lord cheeto” which has caused these same unnamed individuals to take offense. I have copied directly from the manuscript the alleged inflammatory remark and so-called political rant, to allow future readers to have—in context—access to the passage in question and judge for themselves whether reading the entire novel is worth their time, without having to rely on false news. The passage in question is located on page 9.  \"After Elliot’s death, I thought the curse had ended. I went six years without painting another portrait of someone’s death and moved to Manhattan the year I turned seventeen. I hadn’t been there for six months before I tore a stub of paper off a flyer advertising puppies for sale and came to hours later with a brand new, gruesome painting drying on my easel. I still didn’t know how or why, but several times a year, I’d carelessly pick up something without even thinking about it, and a few days later, there would be a new painting down here in my crypt. It was my secret. One I hadn’t ever intended to share with the world, but thanks to a backstabbing, money-grubbing, coke-snorting, no good son of a b**** ex-boyfriend, my crypt and my paintings were the hottest tabloid story to hit the stands since Lord Cheeto made office. In the last week, everyone I considered a friend abandoned me like rats fleeing from a sinking ship. Only Nigel, my very well paid assistant and agent, stuck by me. He told me all press was good press, no matter how bad it seemed. He’s just trying to keep me from running off to a deserted island in the Caymans. Did I forget to mention the POD paintings are all murder victims? Yeah. That’s a treat, huh? Once the initial panic and feelings of betrayal faded, and after I changed the locks and updated my security system, I knew someone would come to investigate. I had a room full of dead people, murdered people, framed on canvases in my basement. I just didn’t expect the person to be the older brother of a murdered woman whose Portrait of Death hung on the wall in my crypt.",
  "genres": [
    "Paranormal",
    "Romance",
    "Mystery",
    "Romantic Suspense",
    "Contemporary",
    "Suspense",
    "Paranormal Romance"
  ],
  "author": "Isabel Wroth",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/49836265-portrait-of-death"
}