{
  "title": "Such a Pretty Girl: A Story of Struggle, Empowerment, and Disability Pride",
  "description": "A memoir by a disability rights activist Such a Pretty Girl is Nadina LaSpina's story—from her early years in her native Sicily, where still a baby she contracts polio, a fact that makes her the object of well-meaning pity and the target of messages of hopelessness; to her adolescence and youth in America, spent almost entirely in hospitals, where she is tortured in the quest for a cure and made to feel that her body no longer belongs to her; to her rebellion and her activism in the disability rights movement.LaSpina’s personal growth parallels the movement’s political development—from coming together, organizing, and fighting against exclusion from public and social life, to the forging of a common identity, the blossoming of disability arts and culture, and the embracing of disability pride.While unique, the author's journey is also one with which many disabled people can identify. It is the journey to find one's place in an ableist world—a world not made for disabled people, where disability is only seen in negative terms. La Spina refutes all stereotypical narratives of disability. Through the telling of her life’s story, without editorializing, she shows the harm that the overwhelming focus on pity and on a cure that remains elusive has done to disabled people. Her story exposes the disability prejudice ingrained in our sociopolitical system and denounces the oppressive standards of normalcy in a society that devalues those who are different and denies them basic rights.Written as continuous narrative and in a subtle and intimate voice, Such a Pretty Girl is a memoir as captivating as a novel. It is one of the few disability memoirs to focus on activism, and one of the first by an immigrant.",
  "genres": [
    "Nonfiction",
    "Disability",
    "Memoir",
    "Social Justice",
    "Audiobook",
    "Disability Studies",
    "Feminism"
  ],
  "author": "Nadina LaSpina",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/49822748-such-a-pretty-girl"
}