{
  "title": "The Bridge and Other Stories",
  "description": "THE meets Christa on the west tower of the Brooklyn Bridge, just as they’re both about to jump off and kill themselves. Despite his paralyzing depression—and her panic over a second bout of cancer—they can’t go through with their plans knowing that the other is going to die. So they make a pact—they’ll stay alive for 24 hours, and try to convince each other to live.From the Staten Island Ferry to Chinatown to the Museum of Modern Art—Henry and Christa embark on a New York City odyssey that exposes the darkest moments of their lives. Is it too late for them? Or will love give them the courage to face the terrifying possibility of hope? HURRICANE Sawyer flees her controlling, wealthy family in New York City for a solitary existence on Cape Cod. Three months later, a mounting anxiety binds her to the house she can no longer leave.With hurricane season approaching, Lily hires Cliff Buckley—an angry carpenter with an immediate disgust for his elitist employer—to storm-proof her house.Cliff soon discovers they have more in common than he thinks, as well as a raging spark between them could either destroy—or save—everything they care about. The question is, can either of them survive Hurricane Lily?—a recovering alcoholic—meets Jack at a roadside stop on the way to her sister’s wedding. Hoping to drown her sorrows in the company of a stranger, she brings him back to her motel room.The next day, shaken by the intensity of the experience, Tanya joins her sister’s bridal party at an upscale mountain lodge. There, she meets the groom’s family for the first time, including his brother, Jack—just home from the Peace Corps and reeling from his night with the bold, beautiful woman he thought he’d never see again.Both at a crossroads in their lives, Tanya and Jack collide for one explosive weekend. Will they choose the safety of past regrets, or will they be brave enough to embrace the present—together?",
  "genres": [],
  "author": "Rebecca Rogers Maher",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/49820259-the-bridge-and-other-stories"
}