{
  "title": "The SEAL's Unexpected Triplets",
  "description": "Cora Caspian has been nanny to adorable triplet girls since the day they were born. But when their parents die in a tragic fire, she’s more than a bit stunned when their will dictates that a particular former Navy SEAL become the girls’ co-guardian with her. She’ll be in charge of the girls’ health and happiness…and William Royce will keep them safe. Of all the men in the hired security firm, William seems to her to be the least likely to take care of three toddlers. He’s all alpha male, muscle, and military might—not at all what the girls need. And certainly not at all what Cora needs—even if he is the sexiest man she’s ever seen. Having been raised as a military brat, she knows what it’s like to grow up in a home with a man who puts duty first and feelings last—just like William. Turns out, though, William is nothing like her father. He takes his job seriously, but he’s good with the girls in a way she never could have anticipated. And when he’s alone with Cora, good doesn’t begin to describe how he is…  As an orphan with no idea how to be part of a family, being named guardian of three toddlers just might be William’s worst nightmare. Even worse is sharing a home with their stunningly attractive nanny-turned-mother, who’s made it perfectly clear she thinks he’s the wrong man for the job. But when it becomes apparent someone’s trying to harm the triplets, William’s protective feelings get riled up. Cora is riling up feelings too, ones he can’t ignore. Suddenly, being part of a real family may be what his lonely life needs—even if it’s only temporary.  As the danger to the triplets grows, William realizes all the warm and fuzzy feelings are getting in the way of his duty. To protect the triplets, he’ll have to put up a wall between the new family he’s built, but losing Cora and the triplets might just destroy him.  This novel contains sexual content, violence and profanity.",
  "genres": [
    "Military Fiction",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Katie Knight",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/49839677-the-seal-s-unexpected-triplets"
}