{
  "title": "Dear Mr. Buffett: What an Investor Learns 1,269 Miles from Wall Street",
  "description": "“Buffett, Tavakoli Flag Scheme Bigger Than Madoff’s” – Bloomberg News\"Full of anecdotes, details and character sketches that add depth...she knows her stuff, has strong opinions and turns a colourful quote.\" - Financial Times“An excellent read, loaded with information about the goings-on in the financial sector in the US…racy, laced with wit.” – Business Standard\"Tavakoli tugs vigorously at the seemingly disparate threads of the current financial crisis, naming names, citing cases and leaving no schmuck — whether investment bank, credit rating agency, monoline insurer, mortgage brokers, regulators and their ilk — unspared. Based on more than 20 years in the derivatives arena, and having served time at Salomon Bros, Bear Stearns and Goldman Sachs, she knows that of what and who she speaks. Should anyone ever display the slightest interest in criminalizing the criminals who led us down this path, a prosecutor could do worse than ordering up copies for the grand jury.\" – Seeking AlphaFrom the publisher (John Wiley & Sons): Janet Tavakoli takes you into the world of Warren Buffett by way of the recent mortgage meltdown. In correspondence and discussion with him over 2 years, they both saw the writing on the wall, made clear by the implosion of Bear Stearns. Tavakoli, in clear and engaging prose, explains how the credit mess happened beginning with the mortgage lending Ponzi schemes funded by investment banks, the Fed bailout and its impact on the dollar. Through her narrative, we hear from Warren Buffett and learn how his enduring principles caused him to see the mess that was coming well in advance and kept him and his investors well out of the way.",
  "genres": [
    "Finance",
    "Business",
    "Economics",
    "Nonfiction",
    "Biography",
    "Money",
    "Management"
  ],
  "author": "Janet M. Tavakoli",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/4986749-dear-mr-buffett"
}