{
  "title": "A Most English Princess: A Novel of Queen Victoria's Daughter",
  "description": "To the world, she was Princess Victoria, daughter of a queen, wife of an emperor, and mother of Kaiser Wilhelm. Her family just called her Vicky…smart, pretty, and self-assured, she changed the course of the world.Young Vicky imagines she'll inherit the throne of England. Why not? She's the eldest child of Queen Victoria and Prince Albert, and her little brother Bertie is sweet but lazy - she'll make a far better heir.When her father tells her that males will always take precedence, the precocious princess sets her sights on marrying a powerful prince who will also be the love of her life.January 1858: Vicky glides down the aisle of St. James Chapel into the waiting arms of her beloved, Prince Frederich, heir to the kingdom of Prussia. Vicky is determined they will lead by example, just as her parents had done, while bringing about a liberal, united Germany.Brought up to believe in herself, Vicky struggles in the narrow-minded Prussian court, where her status as Queen Victoria's daughter fuels the resentment she faces as an outsider. Frowned upon by her in-laws and criticized in the press, each day she seems to take a wrong step.But handsome Fritz is always by her side as they navigate court intrigue and challenge the cunning Chancellor Otto von Bismarck while fighting for principle—and the soul of a nation. At home they endure tragedy, including their son, Wilhelm, rejecting all they stand for.This is the dramatic story of an indomitable English princess, undoubtedly royal and completely human, from her younger years as the apple of her father's eyes, through her rise to power, to the final months of her life.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "British Literature",
    "Victorian",
    "Romance",
    "Audiobook"
  ],
  "author": "Clare McHugh",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/49867453-a-most-english-princess"
}