{
  "title": "Francis",
  "description": "Francis the cat detective, whose first case featured in Akif Pirinçci's international bestseller Felidae, enjoys a comfortable bachelor existence with his human companion and 'tin-opener' Gustav, until one day disaster strikes. Gustav is invaded by a live - in lover who aims to reform his life-style - and his cat's. Francis decides to go on the road, and sets out one stormy night to try his luck in the country.However, perils lurk in the country too. Soon the corpses are coming thick and fast. A serial killer is slaughtering the farmyard cats. The strange, blind tribe of cats who live in the sewage system, rescuing and adopting unwanted kittens, commission Francis to bring the murderer to justice. But who is the murderer? Are the sewer cats right to suspect Crazy Hugo, formerly one of their number, and his mastiff accomplice? Could the real culprit be the mysterious creature known to Francis as Monster Paw? What about the seductive Alcina and her family of forest-dwelling wild cats - how are they involved? What is the true secret of the satellite dish once tended by Diana the ecologist and her cat the ESP enthusiast Ambrosius? And why is a human hunter out to shoot Francis himself?Reluctantly dabbling in the paranormal, Francis brings his logical brain to bear on the case, until all is made clear in a denouement with surprises to spring until the last.Once again, Akif Pirinçci has written a gripping and witty crime story which at the same time faithfully reflects feline behaviour.Praise for'A tough and unsentimental detective story told the way cats see things. I wish my cat could read it.'- Patricia Highsmith'The plot is ingenious, the movement lively ... Altogether there is never a dull moment.'- Julian Symons, Sunday Times'The most unusual thriller of the year ... Takes the prize for black humour, too.'- Mail on Sunday'Orlando the Marmalade Cat playing Inspector Morse, with a dash of James Bond thrown in.'- Independent on Sunday'Has all the twists and terrors of a good Ruth Rendell.'- Country Living",
  "genres": [
    "Crime",
    "Fiction",
    "Cats",
    "Thriller",
    "Fantasy",
    "Animals",
    "Mystery"
  ],
  "author": "Akif Pirinçci",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1250414.Francis"
}