{
  "title": "Collaborative Learning: Higher Education, Interdependence, and the Authority of Knowledge",
  "description": "In Collaborative Learning, Kenneth Bruffee advocates a far-reaching change in the relations we assume between college and university professors and their students, between the learned and the learning. He argues that the nature and source of the authority of college and university professors is the central issue in college and university education in our time, and that if college and university professors continue to teach exclusively in the stand-up-and-tell-'em way, their students will miss the opportunity to learn mature, effective interdependence―and this, Bruffee maintains, is the most important lesson we should expect students to learn. The book makes three related points. First, we should begin thinking about colleges and universities, and they should begin thinking about themselves, not as stores of information but as institutions of reacculturation. Second, we should think of college and university professors not as purveyors of information but as agents of cultural change who foster reacculturation by marshaling interdependence among student pers. And third, colleges and universities should revise longstanding assumptions about the nature and authority of knowledge and about classroom authority. To accomplish this, the author maintains, both college students and their professors must learn collaboratively. Describing the practical value of the activities encouraged by a collaborative approach―students working in consensus groups and research teams, tutoring peers, and helping each other with editing and revision―Bruffee concludes that, in the short run, collaborative learning helps students learn better―more thoroughly, more deeply, more efficiently―than learning alone. In the long run, collaborative learning is the best possible preparation for the real world, as students look beyond the authority of teachers, practice the craft of interdependence, and construct knowledge in the very way that academic disciplines and the professions do. With no loss of respect for the value of expertise, students learn to depend on one another, rather than depending exclusively on the authority of experts and teachers. In the second edition of this widely respected work, the argument is sharply focused on the need to change college and university education top to bottom, and the need to understand knowledge differently in order to accomplish that change. Several chapters, including that on collaborative learning and computers, have been throughly revised, and three new chapters have been on differences between collaborative learning and cooperative learning; on literary study and teaching literature; and on postgraduate education.From COLLABORATIVE LEARNING, second ON THE Behind every public debate about college curriculum today lie comfortably unchallenged traditional assumptions. When we become fully aware of how deeply and irremediably these traditional assumptions have been challenged by twentieth-century thought, we see that a potentially more serious, and perhaps more rancorous and divisive, educational debate lies in wait for us. ON THE SOCIAL CONSTRUCTION OF Remember the time Aunty Molly sat on the Thanksgiving turkey? Tell such a story at a family party and family members follow the story easily and get the point, because they are all members of the same small knowledge community. They know the people and the situation thoroughly, and they understand the family's private references. But try to tell the same story to neighbors or colleagues. For them to follow the story and get the point, you have to explain a lot of obscure details about family events and personalities that they're not familiar with. That is, when a smaller community sets out to integrate itsuelf into a larger one, the level of discourse has to change. The story changes and even its meaning changes as it becomes a constituting narrative of a larger and more complex community. The main purpose of college or university education is to help older adolescents and adults renegotiate their membership in that encompassing common culture. The foundational knowledge that shapes us as children sooner or later circumscribes our lives. We never entirely outgrow the local, foundational knowledge communities into which we are born. But for most people, the need to cope to one degree or another with the diversity and complexity of human life beyond the local and familiar does outgrow knowledge that is familiar and (locally) foundational. ON POSTGRADUATE The problem is not that graduate professors do not know what they need to know. The problem is that most of them have learned what they know entirely under the traditional social conditions of academic alienation and aggression. Indeed, the problem is that mmbers of current graduate faculties were selected into the profession in part because they evidenced those traits. As a result, their fine education and superb reputations as scholars and critics may in some cased actually subvert their ability to understand knowledge as a social construct, learinng as an adult social process, and teaching as a role of leadership among adults.",
  "genres": [
    "Education"
  ],
  "author": "Kenneth A. Bruffee",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1250429.Collaborative_Learning"
}