{
  "title": "On Roads That Echo: A bicycle journey through Asia and Africa",
  "description": "★★★★★ \"A true adventure in every sense. Superbly written\" ★★★★★ \"Just a stunningly good hardcore travel adventure\" ★★★★★ \"I can't begin to do justice in describing how amazing this book is\" ★★★★★ \"An incredible story, beautifully written\" ★★★★★ \"I felt every turn of the pedal on this flabbergasting adventure\" ★★★★★ \"Had me gripped from start to finish. You must read this...\" ★★★★★ \"Truly amazing! The book and the author!\" ★★★★★ \"My heart was in my mouth throughout. I feel I must read it again\" ★★★★★ \"Far more than just an adrenalin-filled adventure…” ★★★★★ \"I couldn't restrain myself from binge-reading\" ★★★★★ \"I'm not going to find another book to match this for a very long time, until he writes another of course!” ★★★★★ \"In a genre that’s really competitive, big things are destined for the author\" BOOK DESCRIPTION Having already pedalled 18,000 miles from Britain to Beijing, Charlie Walker’s homeward leg carried him a further 26,000 miles through Central Asia, the Middle East, and Africa. The two-and-a-half-year journey spanned the mountains and deserts of former Soviet Republics, Afghanistan on the fearful brink of foreign withdrawal, and remote corners of the Congolese jungle. From hiking through sandstorms in the Gobi desert to barrelling down rapids in a dugout canoe, this perilous adventure, and Charlie’s many encounters along the way, gives insight into the past, present, and future of often-overlooked places during periods of great change. On Roads That Echo deftly achieves the delicate balancing act of relating an impressive and gruelling odyssey while also colourfully portraying the lands and lives encountered with empathy, perception, and a wealth of background knowledge. “A first class adventure by a first class adventurer - packed with compelling incident and insight.” - BENEDICT ALLEN “An epic adventure, told candidly and vividly. Charlie’s words make me want to go back and experience these places with the same depth.” - MARK BEAUMONT “A mammoth journey that makes me yearn for the formative freedom of the open road.” - ALASTAIR HUMPHREYS",
  "genres": [
    "Travel",
    "Adventure",
    "Nonfiction",
    "Cycling",
    "Memoir",
    "Africa"
  ],
  "author": "Charlie  Walker",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/49859669-on-roads-that-echo"
}