{
  "title": "Steps and Stones: An Anh's Anger Story",
  "description": "When Anh’s friends leave and he feels left out at school, his anger shows up to keep him company. Anh the protagonist of Gail Silver’s previous book Anh’s Anger, is a typical and easy-to-relate-to elementary school-age boy. His anger, personified as a red hairy impulsive creature, teaches him some valuable lessons about not getting carried away by his strong emotions. By counting his steps and coordinating them with his breathing Anh is able to slow down and take his anger for a peaceful and magically transformative walk.Reach and Teach.com called Anh’s Anger, “One of the best books we’ve ever seen on the issue of dealing with anger.” The New Yorker review highlighted how the book uses “deep breathing… to regain control during a tantrum.” And Zen Master Thich Nhat Hanh calls the Anh’s Anger series, “a wonderful gift for both children and adults who want to learn how to turn unhappy situations into joyful ones.”Steps and Stones the second of the Anh’s Anger Story trilogy will help children learn to understand the causes of their own strong emotions, and teaches them peaceful ways to resolve difficulties through mindfulness and meditation. An invaluable tool for parents and teachers alike.Steps and Stones is beautifully illustrated by New York artist and children’s book illustrator Christiane Krömer. Using a mix of paper, acrylic, cardboard, and found materials, her vibrant multi-textured collages reflect the connection between the characters and their environment and echo the wide range of emotions that come together in the story.Gail Silver writes: “If, at an early age, children become comfortable with identifying and articulating their anger, then they can feel confident working through anger in healthy ways during their adolescent years. There is a lot of adolescent violence in the news today. I am overwhelmed with pain and sadness every time I hear of an adolescent using a gun. While these teens are deeply troubled and have many problems, unresolved anger plays a part in their difficulty. I hope these books can be used as a preventative resource. We can only practice what we know or what we are willing to learn. My hope is that the Anh’s Anger stories can contribute to a decrease in adolescent aggression and violence by teaching children at an early age how to safely understand and express their anger.”",
  "genres": [
    "Picture Books",
    "Childrens",
    "Emotion",
    "Mental Health"
  ],
  "author": "Gail Silver",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/12504269-steps-and-stones"
}