{
  "title": "YOUR BRAND-NEW SELF: Overcoming Personal Fear, Doubts and Lack of Confidence",
  "description": "Confidence is, to a limited extent, a result of how we have been raised and how we've been educated. We gain from others how to consider ourselves and how to carry on - these exercises influence what we accept about ourselves and other people. Confidence is likewise a result of the encounters and how we've figured out how to respond to different situations.  Shyness is an emotion that influences how a person feels and carries on around others. Shyness can mean feeling uncomfortable, reluctant, anxious, bashful, hesitant, or unreliable. People who feel shy sometimes see physical sensations like becoming flushed or feeling stunned, unsteady, or winded.  Shyness is simply something contrary to being at ease with yourself around others. When people feel shy, they may delay to state or accomplish something because they're feeling uncertain of themselves and they're not prepared to be taken note.  Some key information in the book are: • Overcome self-doubt • Ways to Overcome Shyness and Social Anxiety • Overcoming personal fear • Overcoming doubts • Overcoming lack of confidence   When we remain in the comfort zone shielded from these experiences by the recognition of routine exercises, we live unconscious of the capacity to develop and grow new qualities and aptitudes. The less we experience open doors for mix-ups and disappointment, the more terrified we become of what could occur if we were to step outside of the comfort zone.  Nonetheless, when we dive in, even without confidence in the capacities, courage dominates. In the realm of the known, confidence works with no impediment, however, in the realm of fear of the obscure courage dominates.  Courage is typically a more respectable trait than confidence because it requires more noteworthy quality, and typically a courageous individual is one unbounded for development and achievement.",
  "genres": [],
  "author": "Olatunbosun  Amao",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/49899964-your-brand-new-self"
}