{
  "title": "By Force and Fear: Taking and Breaking Monastic Vows in Early Modern Europe",
  "description": "An unwilling, desperate nun trapped in the cloister, unable to gain release: such is the image that endures today of monastic life in early modern Europe. In By Force and Fear, Anne Jacobson Schutte demonstrates that this and other common stereotypes of involuntary consignment to religious houses--shaped by literary sources such as Manzoni's The Betrothed--are badly off the mark.Drawing on records of the Congregation of the Council, held in the Vatican Archive, Schutte examines nearly one thousand petitions for annulment of monastic vows submitted to the Pope and adjudicated by the Council during a 125-year period, from 1668 to 1793. She considers petitions from Roman Catholic regions across Europe and a few from Latin America and finds that, in about half these cases, the congregation reached a decision. Many women and a smaller proportion of men got what they asked for: decrees nullifying their monastic profession and releasing them from religious houses. Schutte also reaches important conclusions about relations between elders and offspring in early modern families. Contrary to the picture historians have painted of increasingly less patriarchal and more egalitarian families, she finds numerous instances of fathers, mothers, and other relatives (including older siblings) employing physical violence and psychological pressure to compel adolescents into entering religion. Dramatic tales from the archives show that many victims of such violence remained so intimidated that they dared not petition the pope until the agents of force and fear had died, by which time they themselves were middle-aged. Schutte's innovative book will be of great interest to scholars of early modern Europe, especially those who work on religion, the Church, family, and gender.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Anne Jacobson Schutte",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/12505437-by-force-and-fear"
}