{
  "title": "Devaluing to Prosperity: Misaligned Currencies and Their Growth Consequences",
  "description": "Experts have long questioned the effect of currency undervaluation on overall GDP growth. They have viewed the underlying basis for this policy—intervention in currency markets to keep the price of the home currency cheap—as doomed to failure on both theoretical and empirical grounds. Moreover, the view has been that overvalued currencies hurt economic growth but undervalued currencies cannot help in growth acceleration. A parallel belief has been that the real exchange rate—that is, a country's competitive ranking—cannot be affected by merely changing the nominal exchange rate. This view is grounded in the belief, and expectation, that inflation follows any devaluation of currency. Hence, the conclusion that the real exchange rate cannot be affected by policy.However, given China's remarkable performance in recent decades, this traditional view is being reexamined. China devalued its currency by large amounts in the 1980s and early 1990s; instead of inflation, it achieved high growth. Today, there is near-universal demand for China to significantly revalue its currency.This book examines the veracity of various propositions relating to currency misalignments, and their effect on various items of policy interest. The author subjects more than a century of global exchange rate management and growth outcomes to rigorous empirical analysis and demonstrates convincingly that a country can systematically devalue and yet prosper.The analysis helps in interpreting several phenomena, especially for the last three decades, which have witnessed high economic growth in developing countries, a widening of global imbalances, and a sharp increase in reserve accumulation, particularly among high-growth Asian economies. The book shows that these events are strongly linked via a consistent policy of currency undervaluation in Asian economies.",
  "genres": [],
  "author": "Surjit S. Bhalla",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/12504755-devaluing-to-prosperity"
}