{
  "title": "The Body Politic",
  "description": "In the bestselling tradition of The Interestings and A Little Life, this keenly felt and expertly written novel by the author of the “savvy, heartfelt, and utterly engaging” (Alice McDermott) Bed-Stuy Is Burning follows four longtime friends as they navigate love, commitment, and forgiveness while the world around them changes beyond recognition. New York City is still regaining its balance in the years following 9/11, when four twenty-somethings—Tess, Tazio, David, and Angelica—meet in a bar, each yearning for something: connection, recognition, a place in the world, a cause to believe in. Nearly fifteen years later, as their city recalibrates in the wake of the 2016 election, their bond has endured—but almost everything else has changed. As freshmen at Cooper Union, Tess and Tazio were the ambitious, talented future of the art world—but by thirty-six, Tess is married to David, the mother of two young boys, and working as an understudy on Broadway. Kind and steady, David is everything Tess lacked in her own childhood—but a recent freak accident has left him with befuddling symptoms, and she’s still adjusting to her new role as caretaker. Meanwhile, Tazio—who once had a knack for earning the kind of attention that Cooper Union students long for—has left the art world for a career in creative branding and politics. But in December 2016, fresh off the astonishing loss of his candidate, Tazio is adrift, and not even his gorgeous and accomplished fiancée, Angelica, seems able to get through to him. With tensions rising on the national stage, the four friends are forced to face the reality of their shared histories, especially a long-ago betrayal that has shaped every aspect of their friendship. Elegant and perceptive, The Body Politic explores the meaning of commitment, the nature of forgiveness, the way that buried secrets will always find their way to the surface, and how all of it can shift—and eventually erupt—over the course of a life.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Politics",
    "Literature",
    "Literary Fiction"
  ],
  "author": "Brian Platzer",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/49900590-the-body-politic"
}