{
  "title": "Behind the Dragon's Veil",
  "description": "Magical artifices, dragon-shifters, palace intrigues and meddling sorcery meet in Behind the Dragon’s Veil, the first novel in a new YA Steampunk Fantasy series. RAPUNZEL meets A GATHERING OF SHADOWS \"Seventeen years of forced isolation has let Annarae to value freedom when she rises as queen. But ruling means surviving court and appeasing her corrupt & demanding council. She’ll risk anything to be free, even to slay a dragon.\" Behind the Dragon's Veil An artificer turned queen. After seventeen years of seclusion and secrecy, Annarae, an artificer, and now the queen of Andrandria, sits the throne and embraces freedom for the first time. When a dragon threatens her kingdom, she organizes a tournament to assemble slayers. But her problems are far from over. With a killer bent on stealing a power she doesn’t have, a queen without a husband and heir is perilous to the realm. She must marry the champion or risk losing her throne to a regent. A dragon turned mass murderer Rebellious Fallagiocrus is never one to obey his father. Ignoring the ancient treaty that expelled his dragarri species, and evading capture each time, he'll shift into his dragon form to soar the night away. He is unstoppable until the fateful night where he loses control of his body and incinerates an entire village by accident. He must win the slayer tournament to right his mistake. A country mage turned killer Ambitious Kilin is a small town battle mage fully capable of competing in the slayer tournament. If he succeeds he'll escape his personal prison and win a chance to earn a coveted position in the Maginari Academy. But unbeknownst to his main ego, his split personality was the reason behind the dragon attack. Tangled together in a strange fate, this unlikely crew embark on a journey to save their kingdom and themselves. Filled with surprise, romance, secrets and wonder, Behind the Dragon’s veil is perfect for fans of RAPUNZEL, A GATHERING OF SHADOWS and A COURT OF MIST AND FURY.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Christina Jolly",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/49933253-behind-the-dragon-s-veil"
}