{
  "title": "Seinfeld: The Totally Unauthorized Tribute",
  "description": "May 14th, 1998, will go down as one of the most significant and historic dates in the annals of television. Such a bold prediction is not mere speculation; it is pure fact. May 14th, 1998 will mark the final original episode in the lives of a one-of-a-kind New York quartet: Kramer, George, Elaine, and, of course, Jerry. May 14th marks the end of \"Seinfeld\" as we know it. Popular sitcoms and television dramas have impacted American culture for decades, and devoted viewers have often had to say goodbye to characters they had come to know and rely on for entertainment and, beyond that, guidance, laughter, and escape. \"M.A.S.H.\" and \"The Mary Tyler Moore Show\" started it all, followed by such now syndicated gems as \"Taxi,\" \"Dallas,\" \"Hill Street Blues,\" and \"L.A. Law.\" Who could ever forget Sam Malone locking up \"Cheers\" for the last time? What viewer didn't miss the endearing Huxtable family when \"The Cosby Show\" went off the air? But nothing compares to this. Nothing compares to the end of \"Seinfeld.\" Television comedy will forever ripple with the aftereffects of the coveted \"show about nothing.\" Specific measures must be taken to ensure that the loss of \"Seinfeld\" doesn't leave America in a chaotic state of Thursday night withdrawal. After all, 30 million people tune in every week to witness Jerry's dating woes, George's hopelessly bad luck, Elaine's trials and tribulations under the watchful eye of J. Peterman, and Kramer's misguided get-rich-quick schemes and bumbling negotiations of Jerry's apartment doorway. For nine years, this crew, and all of the eclectic, primo-New York characters that they have come into contact with, have held television audiences captive with their antics and unprecedented observations of the little details that make up this zany planet. More than that, the words, acts, and thoughts of each distinct character have seeped into the national consciousness, dominating watercooler conversations across the nation.It is obvious that no one can get enough of this classic comedy. With \"Seinfeld\" marching into syndication, sure to live on forever in reruns, David Wild's volume of \"Seinfeld\" facts and history becomes the essential tribute that no viewer can be without. Seinfeld: The Totally Unauthorized Tribute (Not That There's Anything Wrong With That) -- complete with an overall history of the show; a season-by-season, episode-by-episode chronology accompanied by analysis and commentary; a true-or-false quiz to stump even the most dedicated fan; character profiles; and interviews with noted Seinfeld-connected celebrities (Raquel Welch or George Steinbrenner ring a bell?) who expound on what the show meant to them -- becomes the essential encyclopedia for everything you have ever wanted to know about \"Seinfeld,\" the comedian, the show, the legacy. So forge ahead. Take control. Be the master of your domain.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Tv",
    "Cultural"
  ],
  "author": "David Wild",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/499180.Seinfeld"
}