{
  "title": "Bishop",
  "description": "At only thirty-two, Bishop Stockley has lived a hard-knock life. His gang was his family, the streets his home. Until the crew he’d always called his brothers betrayed him. After doing five years in a federal prison, Bishop is back at his dad’s trailer and working for his landscaping company, thrust into a legit world where he’s no longer the alpha—a world where a criminal record is the least of his disadvantages, because Bishop can’t read or write. Illiteracy had never been an obstacle for him on the streets, he didn’t need to know how to read Moby Dick to survive, he needed to know how to read people… and that was a hustle he’d learned hard and fast. Now, he had to change his life.  Bishop’s only support system was a young, inexperienced dad who’d insisted he call him Mike all their life—since they looked more like brothers than father and son. And his hot-tempered, childhood, best friend from ’juvie, Trent. Bishop already had the deck stacked against him, but he wasn’t afraid of hard work to change his situation, and he did want to change. Especially after he encountered Edison Scala, a kind-spirited office manager who didn’t hesitate to come to his defense… a man that saw past Bishop’s grass-stained coveralls. A man who wasn’t intimidated by his stern features and his silence.  Edison hadn’t grown up the way most of his peers had. He’d been raised by a single father who’d owned an old-fashioned barber shop where Edison was taught how to not only shave with a straight razor, and shine shoes, but also how to treat others, to not judge, to be a gentleman, to be respectful and speak without profanity. But, the biggest lesson he’d learned, was to always be himself. His lack of friends and a social life wasn’t his fault. No matter how much weight he gained, no matter how many times his staff called him a square, Edison did not need to change.  Bishop knew Edison was off-limits. He’d made personal vows to himself when he was released from prison, ones that he never intended to break. But, when Edison asked him about providing landscaping services at his home, there was no way he could refuse. He hadn’t expected Edison to feed him, praise him, encourage him, and look at him the way he did—as if Bishop was somebody. Mike and Trent warned him not to mix business with pleasure and he didn’t intend to.  No multiple pairings. No cliffhangers. Ends with a very, very HFN. Warning: This book is a M/M contemporary romance, a hardened man’s struggle to find real love. There are no police chases or doors being kicked in, in this one. But, don’t worry. Bishop is still intense enough to keep you on the edge.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Slow Burn",
    "LGBT",
    "Gay"
  ],
  "author": "A.E. Via",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/49904131-bishop"
}