{
  "title": "How Lulu Lost Her Mind",
  "description": "From New York Times bestselling author Rachel Gibson comes the story of a mother-daughter journey to rediscover the past before it disappears forever. Lou Ann Hunter’s mother, Patricia, has always had a passionate nature, which explains why she’s been married and divorced five times and spooned enough male patients to be ousted from three elderly care facilities. She also has Alzheimer’s, which is why she wants to spend her remaining months or years surrounded by memories at her family’s decrepit old plantation in Louisiana with her only daughter. Lou Ann, a.k.a. Lulu the Love Guru, has built an empire preaching sex, love, and relationship advice to the women of America—mostly by defying the example her mother has set for her. But with her mother suddenly in need of a fulltime caretaker, Lou Ann reluctantly agrees to step out of the spotlight and indulge her mother’s wishes, even if it means trading in her Louboutins and Chanel No. 5 for boots and mosquito repellant. Upon arrival at Sutton Hall, Lou Ann discovers that very little functions at it should, least of all her mother’s mind. She is haunted not only by creaky floorboards and things that go bump in the night, but also by the living ghost sleeping downstairs. Every good day Patricia and Lou Ann have treasure hunting in the attic seems to be followed by two days of meltdowns and cold shoulders. And as Lou Ann adjusts to this new and inevitably temporary dynamic, she is forced to confront the fact that her mother’s fate is completely out of her hands—and the end may be coming quicker than she even thought possible. Heartrending at times and laugh-out-loud funny at others, How Lulu Lost Her Mind is the book for anyone whose mom has ever made them cry—whether tears of joy, regret, frustration, love, or all of the above. Fans of Emily Giffin, Kristan Higgins, and Jill Shalvis won’t be able to forget it.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Audiobook",
    "Humor",
    "Adult",
    "Contemporary"
  ],
  "author": "Rachel Gibson",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/49931466-how-lulu-lost-her-mind"
}