{
  "title": "Send in the Idiots: Stories from the Other Side of Autism",
  "description": "A remarkable, elegantly written portrait of four autistic men and women, and what their struggles and triumphs reveal about this baffling condition, and about us all.In 1982, when he was four years old, Kamran Nazeer was enrolled in a small school in New York City alongside a dozen other children diagnosed with autism. Calling themselves the Idiots, these kids received care that was at the cutting edge of developmental psychology. Twenty-three years later, the school no longer exists.Send in the Idiots is the always candid, often surprising, and ultimately moving investigation into what happened to those children. Now a policy adviser in England, Kamran decides to visit four of his old classmates to find out the kind of lives that they are living now, how much they've been able to overcome―and what remains missing. A speechwriter unable to make eye contact; a messenger who gets upset if anyone touches his bicycle; a depressive suicide victim; and a computer engineer who communicates difficult emotions through the use of hand these four classmates reveal an astonishing, thought-provoking spectrum of behavior.Bringing to life the texture of autistic lives and the pressures and limitations that the condition presents, Kamran also relates the ways in which those can be eased over time, and with the right treatment. Using his own experiences to examine such topics as the difficulties of language, conversation as performance, and the politics of civility, Send in the Idiots is also a rare and provocative exploration of the way that people―all people―learn to think and feel. Written with unmatched insight and striking personal testimony, Kamran Nazeer's account is a stunning, invaluable, and utterly unique contribution to the literature of what makes us human.",
  "genres": [
    "Nonfiction",
    "Autistic Spectrum Disorder",
    "Psychology",
    "Memoir",
    "Biography",
    "Health",
    "Science"
  ],
  "author": "Kamran Nazeer",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/12506.Send_in_the_Idiots"
}