{
  "title": "The Fame of a Dead Man's Deeds: An Up-Close Portrait of White Nationalist William Pierce",
  "description": "The Fame of a Dead Man's Deeds: An Up-Close Portrait of White Nationalist William Pierce by Robert S. Griffin is about the life and ideas of the most influential and intriguing figure on the extreme right in America. William Pierce is best known as the author of the infamous underground novel, The Turner Diaries, which has sold over three hundred thousand copies and very likely inspired the bombing of the Murrah Federal Building in Oklahoma City in 1995. An Anti-Defamation League report calls the organization Pierce heads, the National Alliance, the most dangerous hate group in America. Robert Griffin lived for a month on Pierce's heavily guarded property in rural West Virginia and came to know Pierce and those around him. Griffin conducted twenty hours of audio-taped interviews with Pierce, which he draws upon extensively in The Fame of a Dead Man's Deeds. The book recounts Pierce's personal story from childhood on, identifies the books and people and situations that have influenced him, spells out his perspective on the issues of our time, and describes his day-to-day routine. The title of the book is drawn from an old Norse poem which, in ways that become clear as the book progresses, captures the meaning Pierce ascribes to his own life. Pierce is put in a larger frame by accounts of the lives and ideas of other individuals on the far right, most of them unfamiliar to the general public, and references to related published materials, many of which are not readily available in this country. Readers of this book will come away with a clear understanding of white nationalism--another label, white racialism--and its critique of American life. General readers will find The Fame of a Dead Man's Deeds engaging and accessible, and even the most discerning readers will find this book timely, important, informative, and thought-provoking.",
  "genres": [
    "Politics",
    "Biography",
    "Race",
    "American",
    "Philosophy",
    "Nonfiction"
  ],
  "author": "Robert S. Griffin",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/499234.The_Fame_of_a_Dead_Man_s_Deeds"
}