{
  "title": "Don’t Burn This Book: Thinking for Yourself in an Age of Unreason",
  "description": "The Progressive Woke Machine--from outrage mobs and online censorship to activists masquerading as journalists--is waging war against the last free thinkers in the world. This book is both an explanation of the current political upheaval and your guide to surviving it.America, and the West in general, is in the midst of an identity crisis that's headed towards an outright revolution. The progressive left, once the advocates of free expression and individual autonomy, now undermine these values at every turn. This uncomfortable truth has turned moderates and true liberals into the politically homeless class. In response, Dave Rubin launched his political talk show The Rubin Report in 2015 as a laboratory for anyone trying to make sense of our shifting political landscape. He discusses the most controversial issues of the day with people he both agrees and disagrees with, including those who have been dismissed, deplatformed, and even despised before they've had a chance to speak for themselves. Based on his own story as well as his experiences from the front lines of the free speech wars, this book will inspire you to make up your own mind about what you believe on any issue, and show you how to: * Check your facts, not your privilege: No matter your gender, economic class, or level of education, you're still allowed to have opinions (for now!). Rubin separates facts from feelings, dispelling today's most pervasive myths, like the wage gap, gun violence, racism, affirmative action, climate change, hate crimes, and more.  * Learn to stand your ground: A difference of opinion should not be a deal-breaker for any relationship, professional or personal. Sadly, these days, it often is. Rubin will show you that losing a few friends is a small price to pay for standing up for what you believe in--and why choosing an authentic path is ultimately worth it. * Defend liberalism while you still can: Time is running out to defend individual rights, limited government, and free expression. Rubin provides a roadmap for true classically liberal principles regardless of your party affiliation, and shows you why freedom is impossible without them. Don't Burn This Book empowers you with time-tested and common-sense principles that can turn the tide against authoritarians on both sides in this increasingly polarized world. This book is a rallying cry for anyone who wants to live freely, which is quickly becoming the most radical belief you could have.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Philosophy",
    "Self Help",
    "Psychology"
  ],
  "author": "Dave  Rubin",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/49907457-don-t-burn-this-book"
}