{
  "title": "A Demon's Guide to Wooing a Witch",
  "description": "Calladia Cunnington curses the day she met Astaroth the demon, but when he shows up memoryless, why does she find him so helpless . . . and sort of hot?Calladia Cunnington knows she’s rough around the edges, despite being the heir to one of small-town Glimmer Falls’ founding witch families. While her gym obsession is a great outlet for her anxieties and anger, her hot temper still gets the best of her and manifests in bar brawls. When Calladia saves someone from a demon attack one night, though, she’s happy to put her magic and rage to good use . . . until she realizes the man she saved is none other than Astaroth, the ruthless demon who orchestrated a soul bargain on her best friend.Astaroth is a legendary soul bargainer and one of the nine members of the demon high council—except he can’t remember any of this. Suffering from amnesia after being banished to the mortal plane, Astaroth doesn’t know why a demon named Moloch is after him, nor why the muscular, angry, hot-in-a-terrifying-way witch who saved him hates him so much.Unable to leave anyone in such a vulnerable state—even the most despicable demon—Calladia grudgingly decides to help him. (Besides, punching an amnesiac would be in poor taste.) The two set out on an uneasy road trip to find the witch who might be able to restore Astaroth’s memory so they can learn how to defeat Moloch. Calladia vows that once Astaroth is cured, she’ll kick his ass, but the more time she spends with the snarky yet utterly charming demon, the more she realizes she likes this new, improved Astaroth . . . and maybe she doesn’t want him to recover his memories, after all.",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Witches",
    "Audiobook",
    "Paranormal Romance",
    "Enemies To Lovers"
  ],
  "author": "Sarah  Hawley",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/125065121-a-demon-s-guide-to-wooing-a-witch"
}