{
  "title": "All I Ever Wanted: A Rock 'n' Roll Memoir",
  "description": "Runner-up, Carr P. Collins Award for Best Book of Non-Fiction, 2021Go-Go’s bassist Kathy Valentine’s story is a roller coaster of sex, drugs, and of course, music; it’s also a story of what it takes to find success and find yourself, even when it all comes crashing down.At twenty-one, Kathy Valentine was at the Whisky in Los Angeles when she met a guitarist from a fledgling band called the Go-Go’s—and the band needed a bassist. The Go-Go’s became the first multi-platinum-selling, all-female band to play instruments themselves, write their own songs, and have a number one album. Their debut, Beauty and the Beat, spent six weeks at the top of the Billboard 200 and featured the hit songs “We Got the Beat” and “Our Lips Are Sealed.” The record's success brought the pressures of a relentless workload and schedule culminating in a wild, hazy, substance-fueled tour that took the band from the club circuit to arenas, where fans, promoters, and crew were more than ready to keep the party going.For Valentine, the band's success was the fulfillment of a lifelong dream—but it’s only part of her story. All I Ever Wanted traces the path that took her from her childhood in Texas—where she all but raised herself—to the height of rock n’ roll stardom, devastation after the collapse of the band that had come to define her, and the quest to regain her sense of self after its end. Valentine also speaks candidly about the lasting effects of parental betrayal, abortion, rape, and her struggles with drugs and alcohol—and the music that saved her every step of the way. Populated with vivid portraits of Valentine’s interactions during the 1980s with musicians and actors from the Police and Rod Stewart to John Belushi and Rob Lowe, All I Ever Wanted is a deeply personal reflection on a life spent in music.",
  "genres": [
    "Music",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Kathy Valentine",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/49950142-all-i-ever-wanted"
}