{
  "title": "Kundun: A Biography of the Family of the Dalai Lama",
  "description": "Here is the story of Tibet as told by its remarkable first family--a story of reincarnation, coronation, heartbreaking exile, and finally the tenacious efforts of a holy man to save a nation and its people.Kundun is the first work to focus on the Dalai Lama's family--his parents, four brothers, and two sisters. Particularly compelling are Mary Craigs portraits of the Dalai Lamas siblings, who have negotiated with China on behalf of their country, enlisted the aid of international allies to spearhead Tibetan Resistance, and worked tirelessly to help thousands of sick and starving refugee children. This remarkable book opens in 1933 with the death of the thirteenth Dalai Lama and the frantic effort among Tibetan authorities to find his reincarnation. In their search for a baby boy displaying the characteristic marks of a Dalai Lama--tiger striped legs, wide eyes, large ears, and palms bearing the pattern of a sea shell--officials were led to a tiny village in northeastern Tibet, home of Lhamo Dhondup, a smart, stubborn toddler already known for his tantrums. Responding calmly when a group of high lamas and dignitaries tested his memory of a previous life, the child easily recognized a rosary, walking stick, and drum belonging to the thirteenth Dalai Lama.In an instant this little boy and his entire family were swept into a world of unending ritual and complex internal politics. Lhamo was installed as the fourteenth Dalai Lama at the age of three, and was known from that point on as His Holiness or Kundun (the Presence), titles even his family members were obliged to use. A few years later the young Dalai Lama and his family were faced with China's invasion of Tibet. Living in exile since the late 1950s, they have waged a decades-long struggle for the freedom of their country. Particularly compelling are Craig's portraits of the Dalai Lama's siblings, who have negotiated with China on behalf of their country, enlisted the aid of international allies to spearhead Tibetan Resistance, and worked tirelessly to help thousands of sick and starving refugee children.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Religion",
    "Buddhism",
    "Historical"
  ],
  "author": "Mary A. Craig",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/499591.Kundun"
}