{
  "title": "The Compton Cowboys: The New Generation of Cowboys in America's Urban Heartland",
  "description": "“Thompson-Hernández's portrayal of Compton's black cowboys broadens our perception of Compton's young black residents, and connects the Compton Cowboys to the historical legacy of African Americans in the west. An eye-opening, moving book.”— Margot Lee Shetterly, New York Times bestselling author of Hidden FiguresA rising New York Times reporter tells the compelling story of The Compton Cowboys, a group of African-American men and women who defy stereotypes and continue the proud, centuries-old tradition of black cowboys in the heart of one of America’s most notorious cities.A rising New York Times reporter tells the compelling story of The Compton Cowboys, a group of African-American men and women who defy stereotypes and continue the proud, centuries-old tradition of black cowboys in the heart of one of America’s most notorious cities.In Compton, California, ten black riders on horseback cut an unusual profile, their cowboy hats tilted against the hot Los Angeles sun. They are the Compton Cowboys, their small ranch one of the very last in a formerly semirural area of the city that has been home to African-American horse riders for decades. To most people, Compton is known only as the home of rap greats NWA and Kendrick Lamar, hyped in the media for its seemingly intractable gang violence. But in 1988 Mayisha Akbar founded The Compton Jr. Posse to provide local youth with a safe alternative to the streets, one that connected them with the rich legacy of black cowboys in American culture. From Mayisha’s youth organization came the Cowboys of today: black men and women from Compton for whom the ranch and the horses provide camaraderie, respite from violence, healing from trauma, and recovery from incarceration.The Cowboys include Randy, Mayisha’s nephew, faced with the daunting task of remaking the Cowboys for a new generation; Anthony, former drug dealer and inmate, now a family man and mentor, Keiara, a single mother pursuing her dream of winning a national rodeo championship, and a tight clan of twentysomethings--Kenneth, Keenan, Charles, and Tre--for whom horses bring the freedom, protection, and status that often elude the young black men of Compton.  The Compton Cowboys is a story about trauma and transformation, race and identity, compassion, and ultimately, belonging. Walter Thompson-Hernández paints a unique and unexpected portrait of this city, pushing back against stereotypes to reveal an urban community in all its complexity, tragedy, and triumph.The Compton Cowboys is illustrated with 10-15 photographs.",
  "genres": [
    "Nonfiction",
    "History",
    "Audiobook",
    "Animals",
    "Race",
    "Horses",
    "African American"
  ],
  "author": "Walter Thompson-Hernández",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/49950404-the-compton-cowboys"
}