{
  "title": "Tomahawk Hill: A Small-Town, Enemies to Lovers Romance",
  "description": "Review What readers are saying about Tomahawk Hill. \"I absolutely loved this story! Upon meeting the main characters Olivia and Jake, I was hooked. I felt like I was in part Olivia and I wanted to know everything about the mysterious and charming Jake Hurst. As new characters were introduced I felt more and more like I was a part of this world getting to know each of their unique personalities. And the poetic descriptions of every house, every road, every field, and every shop on Main Street made me feel like a resident of Tomahawk Hill. I know this place now, and I know these people. The only thing I could ask for, is more. I could easily spend the next ten years watching these people and this place grow.\" ~Amazon Reviewer \"More Jake and Olivia please!\" ~Amazon Reviewer \"I'm moving to Tomahawk Hill!\" ~Amazon Reviewer \"What a great debut novel!\" ~ Amazon Reviewer Olivia Weiss is a Midwestern girl living the California dream. She has a great apartment just minutes from the beach and is building a career for herself as a writer for hire. But when she receives a letter from her beloved grandfather telling her the truth about her inheritance nearly a year after his death; Olivia must decide if her life is in LA or in her hometown of Tomahawk Hill. The Hurst family name gives Jake every advantage. While this makes him infuriatingly cocky at times, he doesn’t take much for granted, including his place as Chief Operating Officer of his family’s California chain of luxury hotels. Despite his passion for running the family business, Jake is feeling restless and unable to define what it is he’s missing until he’s given the opportunity to sink his fortune into a small-town project involving big risks. Sparks fly between Olivia and Jake when their ambition gets in the way of what’s best for Tomahawk Hill and its tight-knit community of residents.",
  "genres": [],
  "author": "Hana Mira",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/49955534-tomahawk-hill"
}