{
  "title": "Broken French",
  "description": "A widowed, billionaire, single dad romance.Josie thought she was getting a promotion at her architectural firm, but instead her career implodes. She impulsively takes up her roommates' offer to nanny for a little girl on a mega yacht in the South of France. Even though she can't stand boats, this seems like fate giving her an opportunity to lick her wounds in a bucket list paradise while she figures out how to get her life back.But this little girl she's arrived to look after has a daddy. A widowed, hot, young, billionaire of a daddy. A man who, for all his wealth, is grumpy, conceited, and utterly closed off. But Josie can't help but be drawn closer to this enigmatic man.Xavier Pascale is on an emotional island of his own making. It's just him and his daughter and he likes it that way. He works hard, his shareholders are happy, his best friends are his bodyguard, and the people who work for him. What's wrong with that? But then he meets Josephine Marin. Her arrival in his life is like a deep ocean tremor along a catastrophic emotional fault line. And now... well, now, he's very, very aware of his isolation and his very human need. But he can't be distracted. When he gets distracted terrible things happen.He should send the nanny home.He really should.But what if he just takes what he wants, just this one time ...This is a standalone, contemporary romance. It includes luscious scenes of sparkling blue ocean, and tantalizing, seductive food, as well as a smoking hot, dirty-talking Frenchman. If traveling scares you, or sexy times scare you, then this book is not for you. But if you're looking for a decadent armchair vacation after being stuck in one place for over a year--that will make you laugh, swoon, and cry--then this one is for you!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Slow Burn",
    "Forced Proximity",
    "Billionaire Romance",
    "Audiobook"
  ],
  "author": "Natasha Boyd",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/49962192-broken-french"
}