{
  "title": "A Vampyre's Daughter",
  "description": "An Army vet wishes he were dead...A lonely vampyre wishes she were human...And a drug lord wishes he were immortal...After a failed suicidal mission to destroy an opium kingpin’s yacht, Army vet, Brandt Dekker, is shipwrecked on a desolate island. He is initially happy to be alive -- until his haunting memories return.A stunning, yet awkward, girl named Lia has been caring for him, along with her mysterious and frightening father. They seem merely eccentric at first, until an astonishing truth surfaces: Lia has fangs. Real serpent-like fangs. She confesses to be a vampyre and yet promises no harm to Brandt.Panicking, Brandt tries to escape the island, but the only possibility is an ancient derelict boat that has no motor or sails. There is nowhere on the small island to hide. He must come to grips with his new neighbors, and find a way to become allies if they are all to survive. Because, there are real monsters hunting Brandt. Monsters with guns and explosives rather than fangs or claws. Assassins who will find this island and kill anyone in their path to get to Brandt.With help from Lia to repair the boat, Brandt pledges to set sail and lure the assassins away. But the repair takes days. And as each day passes, Brandt finds himself more and more enchanted by the sweet and gentle woman who claims to be a benevolent vampyre. He doesn't believe he deserves love and happiness, but could they possibly lie in this enchanting girl's embrace? Her past has imprisoned her on the island, and his has imprisoned his soul, and both of their worst fears come back to threaten their newfound hope together. Brandt had been willing to sacrifice his life for a chance at redemption against his enemies, until he came to the island. Now there is more at stake than he is willing to sacrifice. In a battle to save their lives, Brandt will also fight for his soul against a terrifying enemy that is more powerful than he could have ever imagined.",
  "genres": [],
  "author": "Jeff Schanz",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/49987432-a-vampyre-s-daughter"
}