{
  "title": "Tanglewood Tales",
  "description": "THE WAYSIDE. INTRODUCTORY.A short time ago, I was favored with a flying visit from my young friend Eustace Bright, whom I had not before met with since quitting the breezy mountains of Berkshire. It being the winter vacation at his college, Eustace was allowing himself a little relaxation, in the hope, he told me, of repairing the inroads which severe application to study had made upon his health; and I was happy to conclude, from the excellent physical condition in which I saw him, that the remedy had already been attended with very desirable success. He had now run up from Boston by the noon train, partly impelled by the friendly regard with which he is pleased to honor me, and partly, as I soon found, on a matter of literary business.It delighted me to receive Mr. Bright, for the first time, under a roof, though a very humble one, which I could really call my own. Nor did I fail (as is the custom of landed proprietors all about the world) to parade the poor fellow up and down over my half a dozen acres; secretly rejoicing, nevertheless, that the disarray of the inclement season, and particularly the six inches of snow then upon the ground, prevented him from observing the ragged neglect of soil and shrubbery into which the place had lapsed. It was idle, however, to imagine that an airy guest from Monument Mountain, Bald Summit, and old Graylock, shaggy with primeval forests, could see anything to admire in my poor little hillside, with its growth of frail and insect-eaten locust trees. Eustace very frankly called the view from my hill top tame; and so, no doubt, it was, after rough, broken, rugged, headlong Berkshire, and especially the northern parts of the county, with which his college residence had made him familiar. But to me there is a peculiar, quiet charm in these broad meadows and gentle eminences. They are better than mountains, because they do not stamp and stereotype themselves into the brain, and thus grow wearisome with the same strong impression, repeated day after day. A few summer weeks among mountains, a lifetime among green meadows and placid slopes, with outlines forever new, because continually fading out of the memory—such would be my sober choice.",
  "genres": [
    "Classics",
    "Fiction",
    "Fantasy",
    "Mythology",
    "Short Stories",
    "Childrens",
    "Adventure"
  ],
  "author": "Nathaniel Hawthorne",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/49968215-tanglewood-tales"
}