{
  "title": "Katherine Swynford: The Story of John of Gaunt and His Scandalous Duchess",
  "description": "In her remarkable new book, Alison Weir recounts one of the greatest love stories of medieval England. It is the extraordinary tale of an exceptional woman, Katherine Swynford, who became first the mistress and later the wife of John of Gaunt, Duke of Lancaster.Katherine Swynford’s charismatic lover was one of the most powerful princes of the 14th century, the effective ruler of England behind the throne of his father Edward III in his declining years, and during the minority of his nephew, Richard ll. Katherine herself was enigmatic and intriguing, renowned for her beauty, and regarded by some as dangerous. Her existence was played out against the backdrop of court life at the height of the age of chivalry and she knew most of the great figures of the time — including her brother-in-law, Geoffrey Chaucer. She lived through much of the Hundred Years War, the Black Death, and the Peasants’ Revolt. She knew loss, adversity, and heartbreak, and she survived them all triumphantly. Although Katherine’s story provides unique insights into the life of a medieval woman, she was far from typical in that age. She was an important person in her own right, a woman who had remarkable opportunities, made her own choices, flouted convention, and took control of her own destiny — even of her own public image.Weir brilliantly retrieves Katherine Swynford from the footnotes of history and gives her life and breath again. Perhaps the most dynastically important woman within the English monarchy, she was the mother of the Beauforts and through them the ancestress of the Yorkist kings, the Tudors, the Stuarts, and every other sovereign since — a legacy that has shaped the history of Britain.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Historical",
    "Medieval",
    "British Literature",
    "Biography Memoir"
  ],
  "author": "Alison Weir",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/499712.Katherine_Swynford"
}