{
  "title": "The Sweeney Sisters",
  "description": "\"This is a big-hearted belly-laugh of a book, told with wit and poignancy. Family secrets, laughter and tears, shocking reveals, and an uplifting ending make this a story to savor--and share.\"--Susan Wiggs, New York Times bestselling author of The Lost and Found Bookshop An accomplished storyteller returns with her biggest, boldest, most entertaining novel yet—a hilarious, heartfelt story about books, love, sisterhood, and the surprises we discover in our DNA.Maggie, Eliza, and Tricia Sweeney grew up as a happy threesome in the idyllic seaside town of Southport, Connecticut. But their mother’s death from cancer fifteen years ago tarnished their golden-hued memories, and the sisters drifted apart. Their one touchstone is their father, Bill Sweeney, an internationally famous literary lion and college professor universally adored by critics, publishers, and book lovers. When Bill dies unexpectedly one cool June night, his shell-shocked daughters return to their childhood home. They aren’t quite sure what the future holds without their larger-than-life father, but they do know how to throw an Irish wake to honor a man of his stature. But as guests pay their respects and reminisce, one stranger, emboldened by whiskey, has crashed the party. It turns out that she too is a Sweeney sister. When Washington, DC based journalist Serena Tucker had her DNA tested on a whim a few weeks earlier, she learned she had a 50% genetic match with a childhood neighbor—Maggie Sweeney of Southport, Connecticut. It seems Serena’s chilly WASP mother, Birdie, had a history with Bill Sweeney—one that has remained totally secret until now. Once the shock wears off, questions abound. What does this mean for William’s literary legacy? Where is the unfinished memoir he’s stashed away, and what will it reveal? And how will a fourth Sweeney sister—a blond among redheads—fit into their story? By turns revealing, insightful, and uproarious, The Sweeney Sisters is equal parts cautionary tale and celebration—a festive and heartfelt look at what truly makes a family. \"Dolan uses her experience in podcasting with her own sisters to craft believable women characters who worry about real problems and use wry humor to push through dark moments . . . . A warmhearted portrait of love embracing true hearts.\"— Kirkus",
  "genres": [
    "Fiction",
    "Contemporary",
    "Chick Lit",
    "Audiobook",
    "Book Club",
    "Family",
    "Romance"
  ],
  "author": "Lian Dolan",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/49978226-the-sweeney-sisters"
}