{
  "title": "That's What She Said: What Men (and Women) Need to Know About Working Together",
  "description": "Going beyond the message of Lean In and The Confidence Code, Gannett’s Chief Content Officer contends that to achieve parity in the office, women don’t have to change—men do—and in this inclusive and realistic handbook, offers solutions to help professionals solve gender gap issues and achieve parity at work.Companies with more women in senior leadership perform better by virtually every financial measure, and women employees help boost creativity and can temper risky behavior—such as the financial gambles behind the 2008 economic collapse. Yet in the United States, ninety-five percent of Fortune 500 chief executives are men, and women hold only seventeen percent of seats on corporate boards. More men are reaching across the gender divide, genuinely trying to reinvent the culture and transform the way we work together. Despite these good intentions, fumbles, missteps, frustration, and misunderstanding continue to inflict real and lasting damage on women’s careers.What can the Enron scandal teach us about the way men and women communicate professionally? How does brain circuitry help explain men’s fear of women’s emotions at work? Why did Kimberly Clark blindly have an all-male team of executives in charge of their Kotex tampon line? In That’s What She Said, veteran media executive Joanne Lipman raises these intriguing questions and more to find workable solutions that individual managers, organizations, and policy makers can employ to make work more equitable and rewarding for all professionals.Filled with illuminating anecdotes, data from the most recent relevant studies, and stories from Lipman’s own journey to the top of a male-dominated industry, That’s What She Said is a book about success that persuasively shows why empowering women as true equals is an essential goal for us all—and offers a roadmap for getting there.",
  "genres": [
    "Nonfiction",
    "Business",
    "Feminism",
    "Womens",
    "Leadership",
    "Psychology",
    "Self Help"
  ],
  "author": "Joanne Lipman",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/49981117-that-s-what-she-said"
}