{
  "title": "The Right Address",
  "description": "The Right Address sears through the upper crust of New York’s glittering Park Avenue scene to dish the dirt on the ladies who lunch, the gents who club, and the desperate climbers who will stop at nothing to join the backstabbing, champagne-sipping, socialite-eat-socialite stratosphere.When Melanie Sartomsky, wily Floridian flight attendant, snares billionaire divorcée Arthur “the coffin king” Korn, she is catapulted into the crème de la crème of Park Avenue society, where hiring the wrong decorator is tantamount to social suicide, and where, if you’re anyone, your personal assistant has a personal assistant. But Melanie quickly discovers that in the world of the rich and idle, malicious gossip is as de rigeur as owning twenty pairs of Manolo Blahniks. And despite her frenzied plunge into the charity circuit and the right dinner reservations, her neighbors are Givenchy-clad vultures who see her as nothing more than a reinvented trailer trollop. To make matters worse, when a snide society-rag journalist rakes her over the coals, Melanie’s reputation is toast.Meanwhile, Melanie is not the only billionaire in the neighborhood coming unhinged. Kleptomania, adultery, plagiarism, and a grisly Harlem sex murder are just a few of the secrets swirling under the pedigreed patina of furs and emeralds on Park Avenue.Authors Jill Kargman and Carrie Karasyov know a thing or two about their subject matter. They met at the Upper East Side’s chic Spence School and claim that The Right Address is inspired by “the insane socialites we’ve eavesdropped on our entire lives.” Meow.So kick off your Jimmy Choos, crack open the Veuve Clicquot, and get ready for a rollicking, unforgettable tour of the richer-and-bitchier-than-thou set.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "New York",
    "Contemporary",
    "Adult",
    "Audiobook",
    "Humor"
  ],
  "author": "Carrie Doyle Karasyov",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/499845.The_Right_Address"
}