{
  "title": "Ash: The Days of Ash and Fury, Act One: Includes Omens of Fury, Tremors of Fury, and Spawn of Fury",
  "description": "Begin the sweeping, internationally bestselling tale readers are calling... \"Uplifting four-color fantasy\" ... \"A MUST read for all fantasy lovers!\"...\"Impossible to put down!\"... \"Heartwarming and heartbreaking\" ... \"Fantastic in every way!\" ... \"Vibrant, exciting, memorable, and unpredictable!\"Magic is everywhere.Its presence saturates the idyllic forests of Thornwood, where the elves' innate power allows them to commune with the land. It flows south, to the Grove, where enchanted waters bubble forth to provide healing and succor to those in need. To the east, ancient fragments still persist in the dark, deep gnomish tunnels of G'naath. In the very throat of the Maw, the dwarven halls of Belgorne grow more magnificent with every passing generation, for the blood of Silverstone kings lives on. The great Tower of Kehrlia stands as a beacon in the kingdom of Mor, tempting prospective Incantors into years of grueling trials under its ambitious master, Sartean D'Avers.The ordinary magics of Tahr, however, cannot stand against what is to come.At the muzzle of the Maw, the mighty volcano Fang stirs, smoke and ash belching from its mouth for the first time in millennia. Random fires ignite across Tahr with no apparent cause. Beneath it all, darker powers roil and rage as those long-forgotten plot their violent exodus from the eternal prison of Fury. As the very land of Tahr begins to quake and crumble, the Master of Kehrlia makes his play at the throne, putting into motion a scheme that would enslave humanity.Witness the fall of kingdoms through the eyes of Tahr's would-be heroes: Lucan Thorne: a roguish young tavern hustler. Aria Evanti: a demure elven princess. Firstson J'arn Silverstone: stoic heir to the dwarven Sovereign. Shyla Greykin: the wide-eyed, irreverent gnome girl who dared venture Outside.Drawn together by forces unseen, these extraordinary individuals find themselves swept into an epic quest that will ask a question old as time: how far into the abyss can one venture before redemption is forever out of reach?So begin The Days of Ash and Fury.",
  "genres": [
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Sean Hinn",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/49990924-ash"
}