{
  "title": "Dear America: The True Odyssey of an American Youth who Miraculously Survived the Concentration Camps of the Soviet Gulag",
  "description": "Dear America! is the incredible first-hand account about how a young American teenager, Thomas Sgovio (1916-1997), miraculously survived 10 years in Stalin’s brutal concentration labor camps in Northern Siberia. After being released, he was forced to spend an additional 5 years in the timber regions of central Siberia as the Russian government would not allow him to leave the country, or live in any major city. After the death of Stalin, Thomas was finally released. It took him an additional 5 years working as a commercial artist in Moscow before he finally succeeded in extricating himself and his mother from the U.S.S.R in 1960. After leaving Russia, Tom lived in Italy where he married and worked on diverse artistic projects. Tom and his wife returned to the United States in 1963. Thomas was a native of Buffalo, New York and the only son of Joseph and Anna Sgovio. His father Joseph was a political idealist and believed in the early ideological dream of communism fighting for workers rights in early America. After years of protests and being arrested in Buffalo, New York, Joseph was deported from the USA in early 1933 and chose to live in what he thought was “The Dream” in the Soviet Union. When Thomas graduated from Buffalo Technical High School in 1935, he went to Russia, with his mother and sister, to continue his art education, and join his father. Thomas’ studies at the Moscow Vsyekokhudojhnik Gallery of Fine Arts were abruptly ended in 1938 when he was arrested by the Soviet Secret Police and sent to the Gulag. As an artist, Thomas Sgovio created a series of drawings and paintings, which reside in the Hoover Archives at Stanford University, based on memories of his life as a prisoner in the Soviet Gulag. His love for his native home of Buffalo, New York which he often despaired of ever seeing again, is reflected in his renderings of Buffalo landmarks, which were started immediately after his return.Tom has been recognized with many awards in Western New York for his beautiful artwork. He also gave countless seminars and displayed his paintings, all drawn from memory, depicting the repression that he and millions of others suffered in the Soviet Union. This was his way of spreading the message of Freedom and Democracy which he so dearly loved and treasured.",
  "genres": [
    "Russia"
  ],
  "author": "Thomas Sgovio",
  "average_rating": "4.81",
  "url": "https://www.goodreads.com/book/show/49981231-dear-america"
}