{
  "title": "Love Without Borders: How Bold Faith Opens the Door to Embracing the Unexpected",
  "description": "From the founder of This Gathered Nest YouTube channel, an uplifting story of Angela Braniff's unusual path to becoming the mother to seven children through various methods of adoption and biological approaches, encouraging women and mothers to embrace the unique purpose that God has put in their lives.Angela’s love for life and her family radiates through everything she does. The Braniff household includes their two biological daughters, Kennedy, 12, and Shelby 10; Rosie, 7, who was adopted from China with Down syndrome; Noah, 7, adopted from Congo; Jonah 5, adopted domestically; and finally, Ivy and Amelia, their one year old twins who were adopted as embryos, and implanted in Angela, who gave birth to them. In fact, after the book was finished, they joyfully welcomed a new baby into their home, Benjamin, through adoption, making them now a family of ten!Love Without Borders shares Angela's relatable, humorous, and honest view of motherhood. Angela chronicles her journey to discover God’s purpose for her life. For years she walked the safe, expected path, until one day she could feel God calling her to boldly step out and follow him into new places, which led her to raise a large, non-traditional family that looked different than she ever imagined.  It was a winding path to motherhood, complete with heartbreak from failed adoptions, challenging pregnancies, and secondary infertility, but through it all Angela found the unique adventure God had for her. She has shared her family’s stories on her popular YouTube channel, This Gathered Nest, and now invites us in to go deeper and listen to where God might be calling us to go and who we’ve been tasked with loving, no matter how unusual (or just plain crazy) it may sound! The beauty of God’s plan is he uses imperfect people to bring about perfectly beautiful stories.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Christian",
    "Parenting",
    "Audiobook",
    "Faith"
  ],
  "author": "Angela Braniff",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/49978982-love-without-borders"
}