{
  "title": "The End of Calico Jack",
  "description": "In October 1720, Calico Jack, Anne Bonny, and Mary Read stole the William, a 12 ton sloop. With a nefarious crew, Calico Jack voided his pardon to the first Royal Governor of the Bahamas, Woodes Rogers, and went hunting for merchant ships.  I know. I was aboard the evening we stole the William.  The good news is, I found the ship's log in a cave on Coffin Cay with the \nexact course and route and longitude and latitude\n of where the Nuestra Señora De Riqueza would be on October 16, 1720.   The bad news is, I'm now sailing around the Spanish Main with Calico Jack, Ann Bonny, and Scary Mary Read. If I make it off this ship alive, you'll read how \none of the largest pirate treasures ever taken\n wound up in a cave off the southwestern tip of Hispaniola  You're welcome to climb aboard and sail with us. We need lots of crew. The men of our crew keep getting stabbed or shot or hung. ~ Ricky Bradshaw  P.S. The End of Calico Jack is a fictional retelling of the life of Calico Jack, Ann Bonny, and Mary Read based on historical research. Some liberties have been taken in the telling of the story. (I was forced into piracy, after all, and taking things is what pirates do.) In the book I include a REAL PIRATE MAP of Calico Jack's sailing routes and ports and stuff. ~ Ricky Bradshaw  Written for the General Market (G): Contains no sexual dialogue or strong language. May also contain some content of an inspirational/religious nature.Interview with the AuthorQ: Why should a boy or girl begin reading the Caribbean Chronicles Series?Novels in the Caribbean Chronicles Series are fast, fun, clean teen and tween books that take readers back to the Golden Age of Piracy. Boys and girls will fall in love with the quirky characters Ricky Bradshaw meets, their pirate sayings, not-so-bright antics, and the way Ricky helps capture ships and find treasure by using the skills and knowledge a 21st century boy would when thrust back into the age of pirates.Q: Why should parents buy the Caribbean Chronicles Series for their boys and girls?Parents will appreciate the clean elements and moral values that avoid profanity and sexual situations. As an awkward, self-conscious teen, Ricky struggles with his epilepsy. His absence seizures are un-predictable and while not life-threatening (normally), they leave him self-aware of his limitations. But Ricky's absence seizures also provide a portal back in time and a means to alter current and future events -- provided he can escape pirate land without getting killed.Q: What age is appropriate for these books?The Caribbean Chronicles Series is appropriate for mature sixth grade readers. Other parents may choose seventh or eighth grade, due to the fact that Ricky \nIS\n fighting with pirates. The blood and gore isn't too much, but pirates were not nice people. It's also a great, nostalgic read for adults who enjoy reading about pirates and sailing adventure stories. Beginning with the third book in the series, \nThe End of Calico Jack\n, each book focuses on the adventures of a real pirate.",
  "genres": [
    "Pirates"
  ],
  "author": "Eddie       Jones",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/50013030-the-end-of-calico-jack"
}