{
  "title": "Amnesia",
  "description": "\"You will have survivors from Earth, if I can have Amber - it turns out your planet has something worthwhile to offer me after all.\"  \n  When NASA began their negotiations with the arriving aliens who offered them desperately needed salvation, they didn't know they were dealing with a monster, a universal terrorist, driven to possess, conquer and destroy. Incapable of love and devoid of compassion, he was only saving a human colony to appease his younger brother who ruled their planet in a solar system far away.  When evacuation negotiations become difficult, he defies his brother’s blue print and changes the deal. After months of coveting the chief negotiators repressed and dominated fiancé - he offers her liberation she doesn’t even realize she needs and finds a devious way to make her his own.\nTHE STORY BEGINS: Months later, when Amber wakes up after a crash landing to find herself on a hostile planet with a \"man\" beside her that \"shifts\" into a demon warrior whilst protecting her from the wild creatures they run into.She can't remember him, nor can she remember the end of Earth and how she came to be in a new solar system with an alien who claims they are lovers. Even though she is wildly attracted to him something feels amiss, especially his recount of how they came to be together after Earth's mysterious ending, or why they can't immediately return to his home planet where he is the Monarch's son.As their adventure continues, Amber is hurtled into worlds that both stun and defy her imagination. Her continued flashbacks of another lover, the mystery surrounding her departure from Earth and how she came to be the coveted spouse and princess on his planet are slowly revealed to her along with the terrifying choices she has made to survive. Who should read this book?  This is a hybrid series: It has everything paranormal romance readers love: with a handsome alien monarchy who shift into demon warriors when attacked AND It has everything that fantasy readers love - New Kingdoms and New Worlds with magic and sorcery. It's packed with adventure and intrigue in every chapter and contains lots of romance & simmering sex too. It takes the reader on a wild ride from a hostile foreign planet with savage creatures to a new kingdom filled with intrigue and mystery.AUTHOR NOTE: This IS NOT a quick steamy read, it's both a Space Opera and Epic Fantasy all rolled into one action packed series. There is a HEA for the main characters but a cliff hanger lead up to the second book.",
  "genres": [
    "Romance",
    "Fantasy",
    "Fantasy Romance",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "Canada Jackson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/50005565-amnesia"
}