{
  "title": "A Demonic Year Two",
  "description": "Second chances are always costly, and at The Academy of the Devil, the price you have to pay for weakness is high. Get ready. Class is in session again, and this year, the lessons we have to learn are tougher than ever.  It’s official. I must be cursed.  After my hellish first year at The Academy of the Devil, I thought I was prepared for anything. But things never work the way they should at this damn school, and as my second year begins, it becomes obvious that my troubles have just begun.  My relationship with Callum, Stefan, and Mikael is still as confusing as ever. I have no idea where I stand with them and they’re not doing any better. My new bond with Mikael adds even more complications to the mix, because even if we’re the ones who are part of the House of Envy, the green-eyed monster is alive and well in Callum and Stefan too.  To make matters worse, the students aren’t very happy with the idea of having a nephilim in their midst. The dethroned prince of the school isn’t safe from anyone, not anymore, and I don’t know how to help him.  Then, there’s Dean Mephistopheles, who’s starting to pay an alarming amount of attention to me. And against my better judgment, I find myself drawn to him too.  I don’t know what will happen now, but one thing is certain. My second year at The Academy of the Devil is certainly going to be demonic.  A Demonic Year Two is a 81k words paranormal reverse harem romance that contains steamy scenes between the heroine, three temperamental demons, and a very possessive headmaster. For extra spice, you’ll also find a dash of MM romance, as well as a hint of BDSM content. All sexual content involves characters that 18+ years old. But warning! There will be some dark themes that may be disturbing for readers, including bullying and ableism. Proceed with caution!",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fantasy",
    "Demons",
    "Romance",
    "Magic",
    "Paranormal Romance"
  ],
  "author": "Eva  Brandt",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/50018926-a-demonic-year-two"
}