{
  "title": "Culture of Complaint: The Fraying of America",
  "description": "The best-selling author of The Shock of the New, The Fatal Shore, and Barcelona here delivers a withering polemic aimed at the heart of recent American politics and culture.Culture of Complaint is a call for the re-knitting of a fragmented and over-tribalized America--a deeply passionate book, filled with barbed wit and devastating takes on public life, both left and right of center. To the right, Hughes fires broadsides at the populist demagogy of Pat Buchanan, Pat Robertson, Jesse Helms and especially Ronald Reagan (\"with somnambulistic efficiency, Reagan educated America down to his level. He left his country a little stupider in 1988 than it had been in 1980, and a lot more tolerant of lies\"). To the left, he skewers political correctness (\"political etiquette, not politics itself\"), Afrocentrism, and academic obsessions with theory (\"The world changes more deeply, widely, thrillingly than at any moment since 1917, perhaps since 1848, and the American academic left keeps fretting about how phallocentricity is inscribed in Dickens' portrayal of Little Nell\"). PC censoriousness and 'family-values' rhetoric, he argues, are only two sides of the same character, extrusions of America's puritan heritage into the present--and, at root, signs of America's difficulty in seeing past the end of the Us-versus-Them mentality implanted by four decades of the Cold War.In the long retreat from public responsibility beaten by America in the 80s, Hughes sees \"a hollowness at the cultural core\"--a nation \"obsessed with therapies and filled with distrust of formal politics; skeptical of authority and prey to superstition; its language corroded by fake pity and euphemism.\" It resembles \"late Rome...in the corruption and verbosity of its senators, in its reliance on sacred geese (those feathered ancestors of our own pollsters and spin-doctors) and in its submission to senile, deified emperors controlled by astrologers and extravagant wives.\"Culture of Complaint is fired by a deep concern for the way Hughes sees his adopted country heading. But it is not a relentless diatribe. If Hughes lambastes some aspects of American politics, he applauds Vaclav Havel's vision of politics \"not as the art of the useful, but politics as practical morality, as service to the truth.\" And if he denounces PC, he offers a brilliant and heartfelt defence of non-ideological multiculturalism as an antidote to Americans' difficulty in imagining the rest of the world--and other Americans.Here, then, is an extraordinary cri de coeur, an outspoken call for the reconstruction of America's ideas about its recent self. It is a book that everyone interested in American culture will want to read.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Essays",
    "Art",
    "Philosophy",
    "Sociology",
    "Cultural"
  ],
  "author": "Robert Hughes",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/500046.Culture_of_Complaint"
}