{
  "title": "Rethinking Diabetes: What Science Reveals About Diet, Insulin, and Successful Treatments",
  "description": "An eye-opening investigation into the history of diabetes research and treatment by the award-winning journalist and best-selling author of Why We Get Fat • \"[Gary] Taubes’s meticulous, science-based work makes him the Bryan Stevenson of nutrition, an early voice in the wilderness for an unorthodox view that is increasingly becoming accepted.\"—Niel Barsky, The GuardianBefore the discovery of insulin, diabetes was treated almost exclusively through diet, from subsistence on meat, to reliance on fats, to repeated fasting and near-starvation regimens. After two centuries of conflicting medical advice, most authorities today believe that those with diabetes can have the same dietary freedom enjoyed by the rest of us, leaving the job of controlling their disease to insulin therapy and other blood-sugar-lowering medications. Rather than embark on “futile” efforts to restrict sugar or carbohydrate intake, people with diabetes can lead a normal life, complete with the occasional ice-cream cake, side of fries, or soda.These guiding principles, however, have been accompanied by an explosive rise in diabetes over the last fifty years, particularly among underserved populations. And the health of those with diabetes is expected to continue to deteriorate inexorably over time, with ever-increasing financial, physical, and psychological burdens. In Rethinking Diabetes, Gary Taubes explores the history underpinning the treatment of diabetes, types 1 and 2, elucidating how decades-old research that is rife with misconceptions has continued to influence the guidance physicians offer—at the expense of their patients’ long-term well-being.The result of Taubes’s work is a reimagining of diabetes care that argues for a recentering of diet—particularly, fewer carbohydrates and more fat—over a reliance on insulin. Taubes argues critically and passionately that doctors and medical researchers should question the established wisdom that may have enabled the current epidemic of diabetes and obesity, and renew their focus on clinical trials to resolve controversies that are now a century in the making.",
  "genres": [
    "Health",
    "Nonfiction",
    "Science",
    "Audiobook",
    "Medicine",
    "Food",
    "Medical"
  ],
  "author": "Gary Taubes",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/125090756-rethinking-diabetes"
}