{
  "title": "The Invincible Company: How to Constantly Reinvent Your Organization with Inspiration From the World's Best Business Models",
  "description": "The long-awaited follow-up to the international bestsellers, Business Model Generation and Value Proposition DesignAlex Osterwalder and Yves Pigneurs' Business Model Canvas changed the way the world creates and plans new business models. It has been used by corporations and startups and consultants around the world and is taught in hundreds of universities. After years of researching how the world's best companies develop, test, and scale new business models, the authors have produced their definitive work. The Invincible Company explains what every organization can learn from the business models of the world's most exciting companies.The book explains how companies such as Amazon, IKEA, Airbnb, Microsoft, and Logitech, have been able to create immensely successful businesses and disrupt entire industries. At the core of these successes are not just great products and services, but profitable, innovative business models--and the ability to improve existing business models while consistently launching new ones.The Invincible Company presents practical new tools for measuring, managing, and accelerating innovation, and strategies for reducing risk when launching new business models. Serving as a blueprint for your growth strategy, The Invincible Company explains how to constantly stay ahead of your competition.In-depth chapters explain how to create new growth engines, change how products and services are created and delivered, extract maximum profit from each type of business model, and much more. New tools--such as the Business Model Portfolio Map, Innovation Metrics, Innovation Strategy Framework, and the Culture Map--enable readers to understand how to design invincible companies.The Invincible Company: ● Helps large and small companies build their growth strategy and manage their core simultaneously● Explains the world's best modern and historic business models● Provides tools to assess your business model, innovation readiness, and all of your innovation projectsPresented in striking 4-color, and packed with practical visuals and tools, The Invincible Company is a must-have book for business leaders, entrepreneurs, and innovation professionals.",
  "genres": [
    "Business",
    "Entrepreneurship",
    "Management",
    "Nonfiction",
    "Design",
    "Leadership",
    "Buisness"
  ],
  "author": "Alexander Osterwalder",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/50043755-the-invincible-company"
}