{
  "title": "Banned Plays: Censorship Histories of 125 Stage Dramas",
  "description": "\"Outlines the censorship history of 125 classic plays from ancient times to the present. Each entry presents the name(s) under which the play has appeared, the date and place of original production, a summary of the play, its censorship history, and suggestions for further reading. Additional features include playwrights' profiles, a list of the plays grouped by reasons for banning, and a list of 100 additional challenged, censored, or banned plays\"--cover. Examines the characters, plot summary, and outlines the censorship history of 125 classic plays from ancient times to present. Each entry presents the name(s) under which the play has appeared, the date and place of original production, a summary of the play, its censorship history, and suggestions for further reading. Additional features include playwrights' profiles, a list of the plays grouped by reasons for banning, and a list of 100 additional challenged, censored, or banned plays. As public tastes change, so does the nature of popular drama. In the fifth century BCE, Aristophanes' Lysistrata attracted censors for its themes, of wifely rebellion and sex. From the 15th to the 18th centuries, plays were censored primarily for religious or political reasons. In the 19th century, social and sexual reasons for censorship emerged. In recent years, plays dealing with topics such as homosexuality and AIDS have garnered attention from censors. This comprehensive guide outlines the censorship histories of 125 classic plays from ancient times to the present. Each produced and place of original production, a summary of the play, its censorship history, and suggestions for further reading. Among the works covered Angels in Millennium Approaches (Tony Kushner, 1991) Le Barbier de Seville (Pierre Beaumarchais, 1775) The children's hour (Lillian Hellman, 1934) The crucible (Arthur Miller, 1953) Henry IV, Part 2 (William Shakespeare, 1598) Jesus Christ, Superstar (Tim Rice and Andrew Lloyd Webber, 1971) Oedipus Rex (Sophocies, 425 BCE) Oh! Calcutta (Kenneth Tynan, 1969) Salome (Oscar Wilde, 1896) Le Tartuffe (Moii)re. 1669)Examines the characters, plot summary, and censorship history of 125 plays, and offers suggestions for further reading.",
  "genres": [],
  "author": "Dawn B. Sova",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/500426.Banned_Plays"
}