{
  "title": "The Beauty in Breaking",
  "description": "An emergency room physician explores how a life of service to others taught her how to heal herself.Michele Harper is a female, African American emergency room physician in a profession that is overwhelmingly male and white. Brought up in Washington, DC, in an abusive family, she went to Harvard, where she met her husband. They stayed together through medical school until two months before she was scheduled to join the staff of a hospital in central Philadelphia, when he told her he couldn't move with her. Her marriage at an end, Harper began her new life in a new city, in a new job, as a newly single woman.In the ensuing years, as Harper learned to become an effective ER physician, bringing insight and empathy to every patient encounter, she came to understand that each of us is broken—physically, emotionally, psychically. How we recognize those breaks, how we try to mend them, and where we go from there are all crucial parts of the healing process.The Beauty in Breaking is the poignant true story of Harper's journey toward self-healing. Each of the patients Harper writes about taught her something important about recuperation and recovery. How to let go of fear even when the future is murky. How to tell the truth when it's simpler to overlook it. How to understand that compassion isn't the same as justice. As she shines a light on the systemic disenfranchisement of the patients she treats as they struggle to maintain their health and dignity, Harper comes to understand the importance of allowing ourselves to make peace with the past as we draw support from the present. In this hopeful, moving, and beautiful book, she passes along the precious, necessary lessons that she has learned as a daughter, a woman, and a physician.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Medicine",
    "Audiobook",
    "Medical",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Michele Harper",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/50043108-the-beauty-in-breaking"
}