{
  "title": "Immoral Fantasy: Immoral Series Book 2",
  "description": "A lonely wife. A neglectful husband. A 6'5\" tall drink of hot chocolate with sensuality to spare.  Things just keep getting hotter as Claire's lessons with Tony escalate and she is encouraged by her new friend Molly to see where things might go. Claire's husband certainly didn't make a good first impression on Molly or her husband, but Claire is still holding out hope that their families can be good friends as she wrestles with shame and guilt from indulging in her fantasy more than she should've and frustration with her husbands lack of effort in their relationship. How far will she let things go with Tony? Will he sweep her completely off her feet? Her initial desire has becoming a full blown fantasy now!  Alan Austin is a national award winning author now writing erotic fiction under a new pen name and outside of his established publication outlet in order to delve into some of his deepest desires and fantasies. Alan and his wife are both authors who enjoy the wilder side of life and leverage some of their own experiences along with a healthy dose of imagination to heat things up in their writing.  Alan is a mid-thirties family man from the Midwest United States with an amazing wife and the best kids in the world. He enjoys working out and reading when he has time between family activities and writing. Alan grew up on the west coast before moving his family inland to make a home for himself. He is an active volunteer in his community and loves serving others.  Alan and his wife enjoy sharing their wildest fantasies and he uses his short stories as vehicle to share them with others. It is his hope that his short stories can bring some excitement to others!  Please follow Alan's erotic fantasy author page on Facebook at https://www.facebook.com/AlanAustinAu...",
  "genres": [],
  "author": "Alan Austin",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/50039374-immoral-fantasy"
}