{
  "title": "Tuesday Nights",
  "description": "If every man is a master of time, then what of the man who loses track of it?  A viscount's son and a bare knuckle boxer, Michael Cunningham is more interested in building his fortune than spending time at the Marriage Mart. But long ago he promised his mother he would get married \"if not before, then on the eve of my twenty-eighth birthday\".  Reminded by his sister, a duchess, that his next birthday is his twenty-eighth birthday, Michael realizes he has much to do in the three weeks he has to keep his promise – not the least of which is to secure the only woman he has ever considered for a wife – the younger daughter of his business partner and the very woman his sister has just hired to be a governess!  The duchess will rescind her offer of employment to Olivia Waterford, but there's no time for courtship, no time for banns to be read, and certainly no time to wait for a wedding to be planned once Michael proposes. His sister has the perfect plan, though. In order to meet his mother's deadline and ensure a quick marriage, she insists Michael must ruin Olivia!  Olivia has felt affection for her father's business partner since the day he rescued her from a rake. But since the gentleman never showed a romantic interest in her during his frequent visits to her family's home in Shipley, imagine her shock when he climbs into her bed and is discovered by her father! Ruined, indeed!  Now married and living in London, Michael is sure Olivia despises him for what happened, while Olivia is quite sure her husband has feelings for her sister and simply wandered into the wrong bedchamber that fateful Tuesday night.  Will a week be enough time for Michael to court his new wife and convince her of his affections? Or will he regret his last-minute efforts to accomplish too much in too little time? Only time will tell in \"Tuesday Nights\".",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Amazon",
    "Historical Fiction",
    "Audiobook",
    "Regency"
  ],
  "author": "Linda Rae Sande",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/50030284-tuesday-nights"
}