{
  "title": "Sleeping Beauty",
  "description": "From the bestselling author of THE FROG PRINCE and ALICE IN WONDERLAND comes SLEEPING BEAUTY & SLEEPING BEAUTY WAKES UP!--both named Best Reads of 2012 by Kindles & Wine! (alturl.com/7smju)NOTE TO This e-book contains one instance of interactive content. If you do not wish to view the interactive content, the choice to \"opt-out\" and continue reading the novel will be presented to you. You will notmiss any part of the story by opting out.BOOK Sure, Claire Beau thought about sleeping with her doctor. With his moss green eyes and sexy petulance, neurologist Brendan Charmant is definitely worth fantasizing about. But she didn't actually do it...did she?In this tale of \"While You Were Sleeping\" meets \"50 First Dates,\" Claire knows she should be able to answer this simple question, but she has no idea. What she's sure She met Dr. Charmant for an appointment one day and woke up at home six weeks later to find that they are in the middle of a whirlwind love affair, a claim bolstered by her brother, their friends, and the weeks of steamy emails and text messages they've exchanged. But to Claire he's just the arrogant doctor with only a passing interest in finding a diagnosis for her debilitating symptoms.Claire Beau is afflicted with \"Sleeping Beauty Syndrome,\" a mysterious disorder that causes her to sleep for days at a time, and black out for entire weeks. Dr. Brendan Charmant might have given her the best night (or two, or three) of her life, but she has no memory of ever seeing him out of his white coat. Still, she can't help finding herself more than willing to fall for him (again). After all, doesn't every girl deserve a Prince Charming? And waking up comes with other perks, including a plum starring movie role that appears poised to catapult her to fame.Sure, she knows that her best friend, the hot, blond surfer, Davin Wibbens, thinks she deserves better. Still she's crushed when he abandons their friendship over her decision to continue dating Brendan. But when Brendan's arrested for a crime against her that she can't recall, and Davin disappears and is feared dead--all in a matter of days--Claire realizes that sometimes the best way to make your dreams come true might be to just stay asleep. So why is she risking everything to save them all from this waking nightmare?Movie sets, belly-aching laughs, Hollywood, love, surfing, sleeping, tears, a little bit of intrigue, and an \"ending that practically sings 'And they lived happily ever after!'\" Think you know what true love is? Keep dreaming...PRAISE FOR THE AMAZON \"As an author of fairy tale-inspired novels myself, Sleeping Beauty was a delightful mix of sweet and sour, happy and sad, twists and turns, with a magical ending that practically sings 'And they lived happily ever after!' An absolute pleasure.\" -Barbara Silkstone, bestselling author of THE SECRET DIARY OF ALICE IN WONDERLAND, AGE 42 AND THREE-QUARTERS and WENDY AND THE LOST BOYS",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary Romance",
    "Fantasy",
    "Fiction",
    "Humor",
    "Contemporary"
  ],
  "author": "Elle Lothlorien",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/12508890-sleeping-beauty"
}