{
  "title": "Mick Harte Was Here",
  "description": "An award-winning, heartrending young middle grade novel from Barbara Park—the #1 New York Times bestselling author of the Junie B. Jones series—just right for readers of Frindle, Love That Dog, The Lemonade War, and other classic young middle grade favorites. Kids aren’t supposed to die. Phoebe’s brother, Mick, was one of the funniest, coolest kids you’d ever meet—the kid who made you laugh until your stomach hurt, even if you were mad at him. The kid who freaked his and Phoebe’s mom out by putting a ceramic eye in a defrosted chicken; who went trick-or-treating as Thomas Crapper, the inventor of the modern-day flush toilet; who did a wild solo dance in front of the entire school. He was the kid you’d want to be friends with. So how can he be gone? And how will Phoebe’s family survive without him? Winner of 12 State Awards!An IRA-CBC Young Adults’ ChoiceA School Library Journal Best Book of the YearA Publishers Weekly Best Book of the Year * “Genius . . . excruciatingly real . . . powerful.” — Publishers Weekly, starred “[A] wrenching story permeated with humor and hope.” — School Library Journal For the Review section (please add the two reviews and the state awards below):“A very moving story about a terrific 12-year-old boy. By the end of the book, readers miss him, too.” — Kirkus Reviews “Park skillfully interweaves humor and pain in this unique, utterly believable account of Phoebe’s attempt to cope with a heartbreaking loss.” — The Horn Book WINNER —Georgia Children’s Book AwardWINNER —Connecticut Nutmeg Book AwardWINNER —Kansas William Allen White Children’s Book AwardWINNER —North Dakota Flicker Tale Children’s Book AwardWINNER —Rhode Island Children’s Book AwardWINNER —South Carolina Children’s Book AwardWINNER —Vermont Dorothy Canfield Fisher Book AwardWINNER —Illinois Rebecca Caudill Young Readers’ Book AwardWINNER —Indiana Young Hoosier Book AwardWINNER —Iowa Children’s Choice AwardWINNER —Minnesota Maud Hart Lovelace Book AwardNOMINEE —Washington Evergreen Young Adult Book AwardWINNER —Kentucky Bluegrass Master List",
  "genres": [
    "Realistic Fiction",
    "Fiction",
    "Young Adult",
    "Middle Grade",
    "Childrens",
    "Grief",
    "Death"
  ],
  "author": "Barbara Park",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/500800.Mick_Harte_Was_Here"
}