{
  "title": "Lewis & Clark: The Journey of the Corps of Discovery: An Illustrated History",
  "description": "The beautifully illustrated story of two unlikely friends who led the United States’ first expedition in search of the fabled Northwest Passage—based on the acclaimed PBS documentary.In the spring of 1804, at the behest of President Thomas Jefferson, a party of explorers called the Corps of Discovery crossed the Mississippi River and started up the Missouri, heading west into the newly acquired Louisiana Territory.The expedition, led by two remarkable and utterly different commanders—the brilliant but troubled Meriwether Lewis and his trustworthy, gregarious friend William Clark— was to be the United States' first exploration into unknown spaces. The unlikely crew came from every corner of the young soldiers from New Hampshire and Pennsylvania and Kentucky, French Canadian boatmen, several sons of white fathers and Indian mothers, a slave named York, and eventually a Shoshone Indian woman, Sacagawea, who brought along her infant son.Together they would cross the continent, searching for the fabled Northwest Passage that had been the great dream of explorers since the time of Columbus. Along the way they would face incredible hardship, disappointment, and danger; record in their journals hundreds of animals and plants previously unknown to science; encounter a dizzying diversity of Indian cultures; and, most of all, share in one of America's most enduring adventures. Their story may have passed into national mythology, but never before has their experience been rendered as vividly, in words and pictures, as in this marvelous homage by Dayton Duncan.Plentiful excerpts from the journals kept by the two captains and four enlisted men convey the raw emotions, turbulent spirits, and constant surprises of the explorers, who each day confronted the unknown with fresh eyes. An elegant preface by Ken Burns, as well as contributions from Stephen E. Ambrose, William Least Heat-Moon, and Erica Funkhouser, enlarge upon important threads in Duncan's narrative, demonstrating the continued potency of events that took place almost two centuries ago. And a wealth of paintings, photographs, journal sketches, maps, and film images from the PBS documentary lends this historic, nation-redefining milestone a vibrancy and immediacy to which no American will be immune.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Science",
    "Westerns",
    "Travel"
  ],
  "author": "Dayton Duncan",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/500771.Lewis_Clark"
}