{
  "title": "The Importance of Being Wild",
  "description": "\"A contemporary romance story full of sensuality and beauty. Hot and sultry, readers will be enthralled with this unique love story.\" Chick Lit Café A STEAMY CONTEMPORARY ROMANCE.  FREE ON KINDLE UNLIMITEDI pretended I didn't notice him.My ex had shattered my heart--and my confidence--when it came to men.Especially scorching hot ones like the muscular inked man who walked into my bar and lingered at a photo of a motorbike I could all-too-easily imagine him straddling.His gaze, then locked on mine with a bold and intrusive look that left no doubt that he wanted... no, he intended... to undress me. And God help me, I wanted him to, even though I was terrified.When I let him in, pleasure blinded me--insatiable, toe-curling, guilty pleasure of the adults-only type. It was a second chance at love, and it seemed all my dreams had come true. Then his ex turned up with a chilling secret that turned my dream into a nightmare. Suddenly, I hated him as much as I craved him. I lost myself in Curtis, and he destroyed my trust.But then, I also had a secret...*****Soft and vulnerable one moment, and then defensive and feisty the next, Bonita Wild captivated me. She had curves that I wanted to spend a whole night savoring...the type to bring a man to his knees.I never thought I could want so badly. Was it a twist of fate that I walked into her bar that day, or destiny? Sure, I'd messed up, but now I'd been given a second chance. She was my soulmate.She gave me everything--her trust, her body, and her heart.Then a long-buried secret resurfaced, revealing a past I'd rather forget.It looked as though I'd betrayed her...Now I'll do anything to win her back. AUTHOR'S NOTE: THIS BOOK CONTAINS STEAMY EXPLICIT SEX SCENES FOR MATURE AUDIENCES ONLY\"Everything got put on hold as I found myself glued to the pages. A guilty pleasure that I thoroughly enjoyed reading. A big thumbs up from this reader!\" Karen E Proctor\"This book kept me captivated consistently throughout. Sometimes, I laughed loud enough for my husband to wonder what was going on. Great summer read!\" FIVE STARS Amazon Customer",
  "genres": [
    "Romance",
    "Contemporary",
    "Love Story",
    "Fiction",
    "Adult",
    "Novels",
    "Erotica"
  ],
  "author": "J.J. Sorel",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/50071950-the-importance-of-being-wild"
}