{
  "title": "Sexual Misbehavior in the Civil War: A Compendium",
  "description": "Over three million young men left home, shouldered rifles, and set about killing one another in the 1860s. Behind, they left wives and sweethearts. The 50,000 books about the war have told us in meticulous detail about the strategy, tactics, weapons, uniforms, canteens, famous generals, religious beliefs, personality quirks, fortifications, battles, sieges, gunboats, medical care, and recruiting policies. The causes of the war have been endlessly analyzed. The surviving veterans wrote hundreds of memoirs, sometimes inflating their own heroism and importance. What rarely appears in this literature is any mention of sex, in spite of most soldiers being in their early twenties, a time of manly vigor. The late 19th century brought the ascendancy of Victorian prudishness and hypocrisy. The Comstock laws sent men to prison for mailing contraceptive advice. Just advice! Whatever willingness there might have been to reveal wartime hanky-panky evaporated in the tenor of the time and the admiring gaze of the veteran's growing grandchildren. The following scene would be unimaginable: the old veteran sits by the stove in the country store. His long white beard covers his tattered vest. A faded medal graces his chest. On the floor are the shavings from his most recent whittling. A tiny child pipes up: \"Tell us about the war, grandpa.\" \"Well, Jimmy, there was this pretty little whore in Memphis.\" Never happen. Material collected twenty years ago resulted in the author's 1994 book, The Story the Soldiers Wouldn't Tell - Sex in the Civil War, which presented everything that was then known on the subject. There had been no previous book on Civil War sex. Since then, the author and his wife, Beverly, have read over 90,000 court-martials and countless letters and diary entries. What emerges is that sexual activity was far more common and public than our previous research or any memoir had ever revealed. The records come from literally every corner of the country: Key West, Washington Territory, Los Angeles, and Maine. The malfeasants are both officers and enlisted men. The victims range from six-year girls to sixty-year old grandmothers. The soldiers carried with them lewd books and obscene photos. Even more striking is the universality of houses of prostitution. Every village and every city neighborhood has at least one such-and everybody knew it. They knew the addresses of the houses. They knew the names of the madams and the names of many of the \"girls.\" Most of the witnesses for the trials had visited the houses, for the usual reasons. The military police tramped through the houses, looking for deserters. Rape, thought to be rare during the war, was not that rare. An unexpected finding was that Union soldiers, who were supposedly freeing the slaves, were quick to rape black women. An even more surprising finding was that the Confederate army had a policy of not prosecuting rapists, whether the victim was black or white. The inventor of the Graham cracker had, in 1834, written a book claiming that masturbation caused severe illness, even death. This idea had taken root in the medical profession and many army doctors testified that a defendant was not guilty because of \"insanity from self-abuse.\" The Union army's largest hospital listed dozens men, dead from \"masturbation.\" The famous ship Monitor had a thick iron turret. In other such ships, the sound-proof turret proved a convenient place for old sailors to rape young boys. A Union cavalry colonel was tried for sexually assaulted both men and women. Evidence for Civil War homosexuality was unknown until now. Even more astonishing stories appear in the records: sex with horses, sheep, even with chickens and turkeys. There are records of obscene tattoos, foul cursing by Winfield Scott Hancock, black and white mistresses of Confederate generals, even many records of \"fornication and bastardy\" in the little village of Gettysburg. Ads for abortion clinics appeared on the front pages of newspaper",
  "genres": [
    "History",
    "Civil War"
  ],
  "author": "Thomas P. Lowry",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/500796.Sexual_Misbehavior_in_the_Civil_War"
}