{
  "title": "Penric's Progress",
  "description": "MYSTERY AND MAGIC FROM A LEGENDARY MASTERFootloose nobleman Penric journeys from young lord to sorcerer and scholar in the Bastard’s Order—and solves mysteries along the way.  Penric’s Demon: On the way to his betrothal, young Lord Penric happens upon a riding accident and stops to help. But the victim is a Temple divine, servant to the five gods of this world. Her avowed god is The Bastard, “master of all disasters out of season.” As she lies dying, she passes her strange powers to Penric—and changes the course of his life forever.  Penric and the Shaman: Now a divine of the Bastard’s Order as well as a sorcerer and scholar, Penric must accompany a Locator of the Father’s Order assigned to capture a runaway shaman charged with the murder of his best friend.  Penric’s Fox: When Penric—sorcerer, scholar, and divine in the Bastard’s Order—travels to Easthome, the capital of the Weald, he once again finds himself embroiled in a mystery. The body of a sorceress has been found in the woods, and it is up to Penric and his friends, Shaman Inglis and Locator Oswyl, to unravel a mystery mixing magic, murder, and the strange realities of Temple demons.   About Penric's Demon:  “A novella filled with a satisfying blend of strong characters and wry humor.”—Publishers Weekly  About Lois McMaster Bujold: \"The pace is breathless, the characterization thoughtful and emotionally powerful, and the author's narrative technique and command of language compelling. Highly recommended.\"—Booklist  \"If you love solid space opera rooted in strong character, you can't go wrong . . . The Warrior's Apprentice already displays the craft and the heart which would soon make Lois McMaster Bujold one of the most feted talents in SF.\"—SF Reviews  “Bujold is adept at worldbuilding and provides a witty, character-centered plot, full of exquisite grace notes . . . fans will be thoroughly gripped and likely to finish the book in a single sitting.”—Publishers Weekly on Diplomatic Immunity",
  "genres": [
    "Fantasy",
    "Novella",
    "Fiction",
    "Mystery",
    "Science Fiction Fantasy",
    "Magic",
    "Adventure"
  ],
  "author": "Lois McMaster Bujold",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/50089232-penric-s-progress"
}