{
  "title": "The Making of America: The Substance and Meaning of the Constitution",
  "description": "For many years in the United States, there has been a gradual drifting away from the Founding Fathers' original success formula. This has resulted in some of their most unique contributions for a free and prosperous society becoming lost or misunderstood. Therefore, there has been a need to review the history and development of the making of America in order to recapture the brilliant precepts which made Americans the first free people in modern times. The Making of America provides a wealth of material on the Founding Father's intentions when drafting the American Constitution. It is one of the most thorough compilations of statements by the Framers relating to constitutional interpretation, and addresses the Constitution clause by clause -- providing resources on the Founder's intent of each clause. The National Center for Constitutional Studies, a nonprofit educational foundation, was created in order to revive those original American concepts in all of their initial brilliance and vitality. The very fact that many of them are becoming obscure and misunderstood emphasizes the urgency of the task. The study for The Making of America extended over a period of nearly 40 years, and an organized effort to present this information in a published text was a concerted endeavor of nearly 14 years.It will be observed that many new insights are provided in the writings of the Founders for the solution to serious economic, political and social problems plaguing the world today. It is felt that a study of The Making of America can be of lasting value to all who have a serious concern for the general welfare of not only America but all mankind.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Government",
    "Historical",
    "School"
  ],
  "author": "W. Cleon Skousen",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/500648.The_Making_of_America"
}