{
  "title": "Demigods Academy: Year One",
  "description": "HARRY POTTER MEETS PERCY JACKSON  On their eighteenth birthday, everyone in the world receives a Shadowbox—a magic box that is a gift like no other… because it’s a gift from the Gods. For the majority of people, there’s only a birthday message inside their Shadowbox. For a few chosen, though, there’s something more. Nobody knows what those special guys receive. What’s known is that they disappear and never come back.  Rumors say they are invited to join the Gods’ Army… I think it’s just a load of crap.  My name is Melany Richmond, and for my entire life, I’ve been an outcast, an orphan tossed around like a ship in a storm. I don’t think that gods really exist. I never even received my Shadowbox when I turned eighteen. Maybe because nobody knows my true birth date, or because not even the gods care about me. Afterall, I'm a blue haired rebel and troublemaker with tattoos all over my arms.  I’m not like Callie Demos, the beautiful blondie living in the huge estate my adopted mother takes care of. She is the perfect specimen of Greek devotion and nobody doubts she will get “the call.” She has everything in her life and doesn’t appreciate any of it. Her birthday party is the biggest event in town, and everyone wants to be there when she receives her blessing. To me, it’s just another ridiculous parade.  But when I secretly open her Shadowbox and feel its magic on my skin, all my beliefs vanish.  \nGods do exist.\n And if the scroll in my hands says the truth, they have a secret academy where their recruits train to become demigods.  I’ve done really bad things in my life, but stealing Callie’s opportunity to attend the God’s Academy? It’s got to be the worst.  If Gods find out I’m a faker, what was supposed to be someone else’s gift may turn into my personal curse.   MAGIC. ADVENTURES. FRIENDSHIP.  \"As a huge fan of Greek mythology, I absolutely adored jumping into a world where all of my favorite gods and goddesses come to life! -Canada Starkey ★★★★★  \"MUST READ! All the characters, locations, and scenarios are written in such detail that you imagine being amid the Academy experiencing the training and trials alongside Melany and her friends (and enemies). OMG, what an ending. And...when can we expect Year Two? -Author Danah Logan ★★★★★  \"The plot twists had me devouring this book in one day!\" -Ivy on Goodreads ★★★★★  \nDemigods academy is a Young Adult Urban Fantasy novel for readers of all ages. Perfect for fans of Harry Potter and Percy Jackson. It's NOT a Reverse Harem.\n  Demigods Academy: Year Two releases in September 2019 Demigods Academy: Year Three releases in October 2019",
  "genres": [
    "Fantasy",
    "Mythology",
    "Young Adult",
    "Magic",
    "Urban Fantasy",
    "Paranormal",
    "Gods"
  ],
  "author": "Elisa S. Amore",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/50076215-demigods-academy"
}