{
  "title": "It's Not OK to Feel Blue (and other lies): Inspirational people open up about their mental health",
  "description": "*The Sunday Times bestseller*\n'Reading this book made me feel more normal about the things I feel sometimes... It's a great book; however you're feeling, it'll help' - Ed SheeranIt's OK if everything might feel a bit overwhelming. It's OK to talk about it. It's OK to not want to talk about it. It's OK to find it funny. It's OK to be human. Over 70 people have shared their powerful, funny and moving stories exploring their own mental health, including Sam Smith, Emilia Clarke, Candice Carty-Williams and Adam Kay. One in four of us will experience a mental health issue. This book is here to tell you, or someone you care about, it's OK.  \nWith writing from:\n Adam Kay - Alastair Campbell - Alexis Caught - Ben Platt - Bryony Gordon - Candice Carty-Williams - Charlie Mackesy - Charly Cox - Chidera Eggerue - Claire Stancliffe - Davina McCall - Dawn O'Porter - Elizabeth Day - Elizabeth Uviebinené - Ella Purnell - Emilia Clarke - Emma Thompson - Eve Delaney - Fearne Cotton - Gabby Edlin - Gemma Styles - GIRLI (Milly Toomey) - Grace Beverley - Hannah Witton - Honey Ross - Hussain Manawer - Jack Rooke - James Blake - Jamie Flook - Jamie Windust - Jessie Cave - Jo Irwin - Jonah Freud - Jonny Benjamin - Jordan Stephens - Kai-Isaiah Jamal - Kate Weinberg - Kelechi Okafor - Khalil Aldabbas - KUCHENGA - Lauren Mahon - Lena Dunham - Maggie Matic - Martha Lane Fox - Mathew Kollamkulam - Matt Haig - Megan Crabbe - Michael Kitching - Michelle Elman - Miranda Hart - Mitch Price - Mona Chalabi - Montana Brown - Nadia Craddock - Naomi Campbell - Poorna Bell - Poppy Jamie - Reggie Yates - Ripley Parker - Robert Kazandjian - Rosa Mercuriadis - Saba Asif - Sam Smith - Scarlett Curtis - Scarlett Moffatt - Scottee - Sharon Chalkin Feldstein - Shonagh Marie - Simon Amstell - Steve Ali - Tanya Byron - Travon Free - Yomi Adegoke - Yusuf Al Majarhi'This is the freshest, most honest collection of writings about mental health that I've read... searing wit, blinding passion, bleeding emotion and a fantastic, heroic, glorious refusal to lie down and take it' - Stephen Fry'This is the book I needed when I was little. May this be a leap forward in the much needed conversation around mental health' - Jameela Jamil",
  "genres": [
    "Nonfiction",
    "Mental Health",
    "Self Help",
    "Psychology",
    "Audiobook",
    "Essays",
    "Mental Illness"
  ],
  "author": "Scarlett Curtis",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/50120765-it-s-not-ok-to-feel-blue-and-other-lies"
}