{
  "title": "Setting the Family Free",
  "description": "“A supremely moving novel by turns ferocious and tender and funny from beginning to end. Goodman’s finest book.” —\tJunot Díaz, Pulitzer Prize winning author of The Brief Wondrous Life of Oscar Wao“A generous, boisterous, surprising read, like a tiger in your back yard.” —\tJacquelyn Mitchard, The Deep End of the OceanThe loner who collects unusual things. The private reserve of exotic pets released into a rural Ohio community. The estranged wife who loves the animals like family. The caretaker who knows the beasts are dangerous. The neighbors and locals who fall victim to attack. The reporters who present the incidents to the world. The Sheriff and his team of experts who must hunt the creatures down. The animal advocate who winces at the spectacle. The celebrity zookeeper who knows what must be done.This expanding story unfolds through the innovative use of multiple narratives, news broadcasts, newspaper articles, press conferences, political tapes, and quotes from experts, eyewitnesses, and those closest to the unfolding events. Who are the heroes; who are the victims? Who decides?Advance Praise for Setting the Family Free“A supremely moving novel by turns ferocious and tender and funny from beginning to end. Goodman’s finest book.”—\tJunot Díaz, Pulitzer Prize winning author of The Brief Wondrous Life of Oscar Wao“A generous, boisterous, surprising read, like a tiger in your back yard.”—\tJacquelyn Mitchard, The Deep End of the Ocean“Warm, poignant, funny, and suspenseful.”—\tLucrecia Guerrero, Tree of Sighs“A good read under the Big Top of a fine craftsman’s imagination.”—\tRafael Alvarez, The Fountain of Highlandtown“One of Baltimore’s most riveting and prolific writers.”—\tKatherine Cottle, The Hidden Heart of Charm City“Part fable, part meditation, and total page-turner . . . at once funny, terrifying, and sometimes heartbreaking . . . rare and wonderful.”—\tJerry Holt, The Killing of Strangers“A good read written by a thoughtful and skilled writer.” —\tBathsheba Monk, Nude Walker“A rollicking story of things getting out of control . . . vivid as the nightly news!”\t—\tCharles Rammelkamp, Mata Hari: Eye of the Day “Wild, wonderful, well written, and highly original. It's a jungle out there in this page-turner novel.”—\tToby Devens, Happy Any Day Now “A gripping read. This book will stay in my mind for years to come.”—\tTom Glenn, Last of the Annamese “Every year, humans kill 50 billion animals for meat. Now, thanks to Goodman’s Setting the Family Free, the animals are eating us . . .”—\tMark Mirabello, Ph.D, Handbook for Rebels and Outlaws",
  "genres": [
    "Fiction",
    "Animal Fiction"
  ],
  "author": "Eric D. Goodman",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/50094058-setting-the-family-free"
}