{
  "title": "Blossoms and Bones: Drawing a Life Back Together",
  "description": "Visionary artist and New York Times bestselling author of The Wild Unknown Kim Krans returns with a decadently illustrated and incredibly raw graphic memoir that chronicles her multi-layered search for truth and recovery from an eating disorder and infertility in the throes of a health and wellness-obsessed culture, touching on the healing potentials of creativity and spirituality. With pen and paper as her trusted allies, revered visionary artist, spiritual seeker, and bestselling author of The Wild Unknown, Kim Krans chronicles her deeply personal journey of recovery through drawing.After cancelling her flight home to wellness-obsessed Los Angeles, where Krans had been secretly experiencing a debilitating eating disorder, she finds her way to an ashram and seeks spiritual and creative refuge. For forty days she relies on “drawing the feeling” as a way to realign her relationship to food, addiction, fertility, perfectionism, and the endless messaging of “never enough” echoing throughout current culture. She makes the ashram her home and embarks on the healing process through intricately hand-drawn narration of both her inner and outer worlds, cancelling forthcoming high-profile teaching obligations and international travel. Radical simplification, meditation, community, and creativity bring her through the darkest chapter of her life. What emerges from Krans’ deeply personal undertaking is a raw and beautiful never-before-seen artists’ document that explores what it means to prioritize truth and self-discovery in a world of relentless expectations and distractions. A memoir at its heart, Blossoms and Bones is a lifeline of light and beauty, a call to embrace our creative power, and a courageous example of realigning with one’s destiny.",
  "genres": [
    "Graphic Novels",
    "Memoir",
    "Nonfiction",
    "Art",
    "Comics",
    "Mental Health",
    "Graphic Novels Comics"
  ],
  "author": "Kim Krans",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/50103096-blossoms-and-bones"
}