{
  "title": "Fight of the Century: Writers Reflect on 100 Years of Landmark ACLU Cases",
  "description": "A unique collaboration between the American Civil Liberties Union and authors Michael Chabon and Ayelet Waldman, Fight of the Century features original essays by the most influential writers at work today—including Jennifer Egan, Neil Gaiman, Marlon James, Viet Thanh Nguyen, Salman Rushdie, Jesmyn Ward, and more—each writing about a landmark ACLU case, published in conjunction with the 100th anniversary of the organization.The American Civil Liberties Union began as a small group of idealists and visionaries, including Helen Keller and Jane Addams. A century after its founding, the ACLU remains the nation’s premier defender of the rights and freedoms guaranteed by the Constitution. In collaboration with the ACLU, prize-winning authors Michael Chabon and Ayelet Waldman have curated an anthology of essays about landmark cases in the ACLU’s 100-year history. In Fight of the Century, bestselling and award-winning authors present unique literary takes on historic decisions like Brown v. Board of Education, the Scopes trial, Roe v. Wade, and more. Contributors include Geraldine Brooks, Michael Cunningham, Jennifer Egan, Dave Eggers, Louise Erdrich, Neil Gaiman, Lauren Groff, Marlon James, Viet Thanh Nguyen, Morgan Parker, Ann Patchett, Salman Rushdie, George Saunders, Elizabeth Strout, Jesmyn Ward, Meg Wolitzer, and more. Fight of the Century shows how throughout American history, pivotal legal battles, fought primarily by underdogs and their lawyers, have advanced civil rights and social justice. The ACLU has been integral in this process. The essays range from personal memoir to narrative history, each shedding light on the work of one remarkable organization as it shaped a country. Chabon and Waldman are donating their advance to the ACLU and the contributors are forgoing payment.",
  "genres": [
    "Nonfiction",
    "History",
    "Essays",
    "Politics",
    "Law",
    "Social Justice",
    "Anthologies"
  ],
  "author": "Michael Chabon",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/50092714-fight-of-the-century"
}