{
  "title": "Motherland: A Memoir of Love, Loathing, and Longing",
  "description": "A richly textured, multilayered story about mothers and daughters, aging and time, loathing and love from the James Beard Award-winning author of the critically acclaimed memoir \n\nPoor Man's Feast\n\n, the blog of the same name, and the \n\nWashington Post\n\n column \n\nFeeding My Mother\n\n.\nElissa and Rita have forever struggled to find their place in each other's worlds. Rita, an overreaching, makeup-addicted, narcissistic Manhattan singer couldn't be more different from Elissa, her gay, taciturn New England writer daughter. Stuck in an outrageous maelstrom of codependency, mother and daughter cannot seem to extricate themselves from the center of each other's lives. Motherland is their universal story: a kaleidoscopic journey built on the ferocity of mother-daughter love, moral obligation, and the possibility and promise of healing.Having survived a harrowing childhood at the hands of her mother, Elissa is finally settled in Connecticut with her wife of almost twenty years. After much time, therapy, and wine, Elissa is at last in a healthy place, orbiting around her mother, but keeping far enough away from her to preserve the independent, quiet life she has built for herself. All of this is suddenly at risk when Rita, whose days are spent traversing the streets of Manhattan from Bergdorf's to Bloomingdale's and back again, suffers an incapacitating fall that leaves her fully dependent on her only child.Forced to confront her mother's desperate need for beauty, her view of the world through a medley of men, her lost days in the spotlight, addiction, and the money that has mysteriously disappeared in the name of maintaining her youth, Elissa must navigate the waters of their shared history, obligation, the problems of caregiving and age, and the frenetic, co-dependent love that has defined their obsessive relationship. Motherland asks the universal mother-daughter question: How much love is too much love?Filled with tenderness, wry irreverence, and unforgettable characters, Motherland is an exploration of what it means to escape from the shackles of the past only to have to face them again, finally, in the name of peace and the fragile mother-daughter bond.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "LGBT",
    "Queer",
    "Biography Memoir",
    "Biography"
  ],
  "author": "Elissa Altman",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/50127498-motherland"
}