{
  "title": "Overload: How Good Jobs Went Bad and What We Can Do about It",
  "description": "Why too much work and too little time is hurting workers and companies—and how a proven workplace redesign can benefit employees and the bottom lineToday's ways of working are not working—even for professionals in \"good\" jobs. Responding to global competition and pressure from financial markets, companies are asking employees to do more with less, even as new technologies normalize 24/7 job expectations. In Overload , Erin Kelly and Phyllis Moen document how this new intensification of work creates chronic stress, leading to burnout, attrition, and underperformance. \"Flexible\" work policies and corporate lip service about \"work-life balance\" don't come close to fixing the problem. But this unhealthy and unsustainable situation can be changed—and Overload shows how.Drawing on five years of research, including hundreds of interviews with employees and managers, Kelly and Moen tell the story of a major experiment that they helped design and implement at a Fortune 500 firm. The company adopted creative and practical work redesigns that gave workers more control over how and where they worked and encouraged managers to evaluate performance in new ways. The result? Employees' health, well-being, and ability to manage their personal and work lives improved, while the company benefited from higher job satisfaction and lower turnover. And, as Kelly and Moen show, such changes can—and should—be made on a wide scale.Complete with advice about ways that employees, managers, and corporate leaders can begin to question and fix one of today's most serious workplace problems, Overload is an inspiring account about how rethinking and redesigning work could transform our lives and companies.",
  "genres": [
    "Nonfiction",
    "Business",
    "Management",
    "Leadership"
  ],
  "author": "Erin L. Kelly",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/50154693-overload"
}