{
  "title": "My Ugandan Hill",
  "description": "IndieReader Review: 4.8 stars\"From being cared for by traditional ayahs (nanny/nursemaids) to life-threatening encounters with musota snakes, as seen through young C. H. Colman's eyes, the reminiscences of MY UGANDAN HILL come wonderfully to life. Readers of all ages, parents, teachers, take note: supported by judicious use of Luganda and Swahili terms, native concepts, and introductions to African wildlife, this is a perfect tale for pleasure reading and education.\"SPRC.H. Colman has written a heartwarming memoir in My Ugandan Hill, providing middle-grade readers with a glimpse into the author's unique early childhood growing up in Uganda...What makes Colman's memoir especially interesting is that although it's told from the perspective of a child, he doesn't do it through rose-colored lenses. Far from it, in fact: their gardener stole from Colman's nursemaid and was sent to jail while another servant was thrown in jail for allegedly walking around without a lantern after curfew. After complaining to a British officer, his mother was told to keep quiet if she wanted her servant to stay alive. Later, rioting between the Ugandans and the police presented an imminent danger to the well-being of their family, and ultimately provided the impetus for them to leave Uganda. All told, the book gives a vivid and uncompromising portrait of Colman's exotic childhood...SummaryWhen Charles Colman's family moved to Uganda, Africa, they discovered a world far different from post-WWII Britain. Very large snakes could bite or squeeze people to death. Dysentery and malaria were common diseases. A bump behind Charles's ear turned out to be a tick that made him ill with dire symptoms first misdiagnosed as meningitis. Flies laid eggs under his skin. Huge flying cockroaches landed on his face, swam in his milk, and squealed when cornered. Earthquakes abounded, strong enough to crack cement. Conflicts flared between African tribes, and between civilians harassed by the Baganda police. As backdrop to these facets of Ugandan life, a revolution for independence from British imperial rule was brewing.",
  "genres": [],
  "author": "C.H. Colman",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/50147149-my-ugandan-hill"
}