{
  "title": "Royally Yours",
  "description": "Tinsel, Vermont is known for its no-paparazzi policy and Christmas decorations that are fit for a queen. This holiday season, join four royals on a stroll through town square as they each find their Christmas wishes for a happily-ever-after...tiaras optional.One Royal Christmas by Melissa TaggIn the wake of the worst year of his life, His Majesty Jonah Harrison Archer Davies makes the drastic decision to temporarily abdicate the throne and travel to Tinsel, Vermont, in hopes of finding the peace and privacy he needs to heal, discover his vision for his country . . . and somehow believe himself worthy of the crown. But when he meets charming librarian Rowan Bell,on a quest of her own to save Tinsel’s quaint cottage library, he’s more torn than ever before as duty to the crown collides with an enchanting Christmastime romance he didn’t see coming. The Reluctant Princess by Betsy St. AmantPrincess Eleanor is weary of the protocol that comes with the crown, along with her lack of voice on causes she holds dear. She takes a holiday in the safety of Tinsel, Vermont, to determine her next steps–and certainly didn’t mean to fall for the average Joe assigned as her chauffeur. But Miles Channing isn’t so average, after all. He’s Liam Neal, part of the notoriously famous American Neal Family, and is hiding with secrets of his own.When Christmas comes and the truth shakes her life like a snow globe, Eleanor must decide once and for all where she’ll be standing when the snowflakes settle. A Royal Wonderland by Liz JohnsonWith his public break up still making tabloid headlines,Prince Andrew Tennesley hopes a few weeks in Tinsel will help the gossips move on and give him a chance to propose a program the people of his country need. When Andrew is left to decorate a home for Tinsel’s Christmas lights contest, he has to rely on pretty hardware store owner Charlotte Hudson for help. Charlie doesn’t mind hanging twinkle lights with him. She just isn’t interested in the spotlight. But as they set out to create a winter wonderland, Andrew has her wondering if she’s been hiding out in Tinsel too and missing out on the best gift of the season–love. A Tinsel Holiday by Ashley ClarkPrincess Beatrix has already met the love of her life. Two years ago, an American journalist named Tyler was assigned to write a feature story about her. But the twenty-four hours that followed changed the two of them forever. Now, Tyler has returned home to Tinsel and traded his career in journalism to run The Melody Inn. Though the quirky mayor and eccentric town traditions are a far cry from the world travels he once enjoyed,Tyler has settled into small-town life and made peace with the knowledge he will never see Beatrix again. But when an American tour brings Princess Beatrix to Tinsel, she and Tyler will have another twenty-four hours together and one more chance at love. Only this time, with gingerbread and mistletoe.",
  "genres": [
    "Christmas",
    "Christian Fiction",
    "Fiction",
    "Contemporary",
    "Romance",
    "Christian Romance",
    "Anthologies"
  ],
  "author": "Melissa Tagg",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/50155569-royally-yours"
}