{
  "title": "By Blood",
  "description": "The award-winning writer returns with a major, absorbing, atmospheric novel that takes on the most dramatic and profoundly personal subject matter.San Francisco in the 1970s. Free love has given way to radical feminism, psychedelic ecstasy to hard-edged gloom. The Zodiac Killer stalks the streets. A disgraced professor takes an office in a downtown tower to plot his return. But the walls are thin and he's distracted by voices from next door—his neighbor is a psychologist, and one of her patients dislikes the hum of the white-noise machine. And so he begins to hear about the patient's troubles with her female lover, her conflicts with her adoptive, avowedly WASP family, and her quest to track down her birth mother. The professor is not just absorbed but enraptured. And the further he is pulled into the patient's recounting of her dramas—and the most profound questions of her own identity—the more he needs the story to move forward. The patient's questions about her birth family have led her to a Catholic charity that trafficked freshly baptized orphans out of Germany after World War II. But confronted with this new self— “I have no idea what it means to say ‘I’m a Jew’”—the patient finds her search stalled. Armed with the few details he’s gleaned, the professor takes up the quest and quickly finds the patient’s mother in records from a German displaced-persons camp. But he can’t let on that he’s been eavesdropping, so he mocks up a reply from an adoption agency the patient has contacted and drops it in the mail. Through the wall, he hears how his dear patient is energized by the news, and so is he. He unearths more clues and invests more and more in this secret, fraught, triangular relationship: himself, the patient, and her therapist, who is herself German. His research leads them deep into the history of displaced-persons camps, of postwar Zionism, and—most troubling of all—of the Nazi Lebensborn program. With ferocious intelligence and an enthralling, magnetic prose, Ellen Ullman weaves a dark and brilliant, intensely personal novel that feels as big and timeless as it is sharp and timely. It is an ambitious work that establishes her as a major writer.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Book Club",
    "Literary Fiction",
    "Novels",
    "Contemporary"
  ],
  "author": "Ellen Ullman",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/12510833-by-blood"
}