{
  "title": "Twilight of Democracy: The Seductive Lure of Authoritarianism",
  "description": "The Pulitzer Prize-winning author, professor, and historian offers an expert guide to understanding the appeal of the strongman as a leader and an explanation for why authoritarianism is back with a menacing twenty-first century twist.Across the world today, from the Americas to Europe and beyond, liberal democracy is under siege while populism and nationalism are on the rise. In Twilight of Democracy, prize-winning historian Anne Applebaum offers an unexpected explanation: that there is a deep and inherent appeal to authoritarianism, to strongmen, and, especially, to one-party rule--that is, to political systems that benefit true believers, or loyal soldiers, or simply the friends and distant cousins of the Leader, to the exclusion of everyone else.People, she argues, are not just ideological; they are also practical, pragmatic, opportunistic. They worry about their families, their houses, their careers. Some political systems offer them possibilities, and others don't. In particular, the modern authoritarian parties that have arisen within democracies today offer the possibility of success to people who do not thrive in the meritocratic, democratic, or free-market competition that determines access to wealth and power.Drawing on reporting in Spain, Switzerland, Poland, Hungary, and Brazil; using historical examples including Stalinist central Europe and Nazi Germany; and investigating related phenomena: the modern conspiracy theory, nostalgia for a golden past, political polarization, and meritocracy and its discontents, Anne Applebaum brilliantly illuminates the seduction of totalitarian thinking and the eternal appeal of the one-party state.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "Political Science",
    "Sociology",
    "Philosophy"
  ],
  "author": "Anne Applebaum",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/50155421-twilight-of-democracy"
}