{
  "title": "Kent State: Four Dead in Ohio",
  "description": "From Derf Backderf, the bestselling author of My Friend Dahmer, comes the Eisner and ALA/YALSA Alex Award-winning tragic and unforgettable story of the Kent State shootings, told in graphic novel form.Named a “Best Book of the Year” by New York Times, Forbes, Publishers Weekly, Library Journal, and NPR!Derf Backderf takes us back to the age of the Vietnam War, Richard Nixon, Woodstock, and the Cold War and explores, in words and images, a scene of tragedy: the campus of Kent State University, where National Guard Troops attacked unarmed protestors and killed four students (Allison Beth Krause, age 19, Jeffrey Glenn Miller, age 20, Sandra Lee Scheuer, age 20, and William Knox Schroeder, age 19).On May 4, 1970, the Ohio National Guard gunned down unarmed college students protesting the Vietnam War at Kent State University. In a deadly barrage of 67 shots, four students were killed and nine shot and wounded. It was the day America turned guns on its own children—a shocking event burned into our national memory.The fatal shootings triggered immediate and massive outrage on campuses around the country. More than four million students participated in organized walkouts at hundreds of universities, colleges, and high schools, the largest student strike in the history of the United States at that time. It was a day that shocked the nation and helped turn the tide of public opinion against America’s war in Vietnam.A few days prior, 10-year-old Derf Backderf saw those same guardsmen patrolling his nearby hometown, sent in by the governor to crush a trucker strike.Using the journalism skills he employed on My Friend Dahmer and Trashed, Backderf has conducted extensive interviews and research to explore the lives of these four young people and the events of those four days in May, when the country seemed on the brink of tearing apart.Kent State: Four Dead in Ohio is a moving and troubling story about the bitter price of dissent—as relevant today as it was in 1970.",
  "genres": [
    "Graphic Novels",
    "History",
    "Nonfiction",
    "Comics",
    "Politics",
    "Historical",
    "True Crime"
  ],
  "author": "Derf Backderf",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/50159458-kent-state"
}