{
  "title": "The Tiger Claw",
  "description": "Shauna Singh Baldwin first heard of the mysterious story of Noor Inayat Khan (codename Madeleine ) at The Safe House, an espionage-themed restaurant in Milwaukee. A former Dutch spy told her of the brave and beautiful Indo-American woman who left her family in London, England to become a spy in Nazi-occupied France during the Second World War.The story immediately intrigued Baldwin, inspiring her to travel to Europe, seek out the places where Noor lived, interview the people who knew her and discover more about the enigmatic woman. The Giller Prize finalist The Tiger Claw — Baldwin’ s follow-up novel to her award-winning What The Body Remembers — was born from the silences, conflicting stories and significant gaps she discovered along the way.As the novel begins, we’re thrown into a bleak German prison cell with Noor, where she is shackled hand and foot and freezing from the winter’s cold. It is December 1943, the turning point in the war raging in Europe. Noor’s captor, Herr Vogel, allows her onionskin paper on which he directs her to write children’s stories. She does so, but also secretly writes letters to someone she addresses as “ma petite,” the spirit of the child she had conceived with Armand Rivkin, a French Jewish musician and the love of her life. Although she must keep the letters hidden from her captor, it is through these words to her unborn child, alternating with a thrilling third-person narrative, that we learn Noor’s courageous and heartbreaking story.Noor’s mother is an American from Boston who married a Sufi musician and teacher from India. Growing up in France, Noor is extremely close with her liberal Muslim father, but when he dies, Noor’s conservative uncle Tajuddin and her brother Kabir govern the family.Uncle Tajuddin and Kabir disapprove of Noor’s love for Armand, and as the men of the family in 1930s France, they have the legal right to stop her engagement. Noor is faced then with the choice between defying her family and turning against her heart. She stops seeing Armand, but is devastated and lonely. Once the war begins, Noor’s family heads to England while Armand’s family stays.When Germany invades France, Noor despairs of ever seeing Armand again, until Kabir unwittingly introduces her to his new friend who is recruiting bilingual women for the resistance. Noor is offered training, and she accepts. She will help defeat the Germans, but her true purpose will be to find and reunite with Armand.As a resistance agent, Noor trains to be a radio operator, taking on a second identity — Nora Baker — one of many names she will eventually assume. When she arrives in France, she plays Anne-Marie Régnier — a woman caring for her sick aunt — and to other spies in her resistance network, she is known as “Madeleine.”She has secret rendezvous with other agents, transmits messages from various safe houses, and risks capture at every turn. She rents an apartment across the street from Drancy, the concentration camp where she knows Armand is being held. At great peril, she sends him a message — the tiger claw pendant she always wears for luck and courage.Noor must wade her way through oppression and hypocrisy from all h her beloved Armand could be killed by the Germans at any time; her French and British colleagues fight the occupation of France while Britain still occupies India; she learns of dark family secrets; and, one by one, members of the spy network are being ratted out by a double agent. Betrayal can come from anyone.We know from the beginning that Noor will end up imprisoned, but who betrays her? Will she ever be released? Will Kabir find her? Will she and Armand be reunited? Baldwin paces the story like a nail-biting thriller, revealing only a little bit at a time.The Tiger Claw is packed with complex characters riding the line between good and evil. In the end, it is the reader who must be the judge, and decide where he or she stands.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Canada",
    "Historical",
    "Book Club",
    "Canadian Literature"
  ],
  "author": "Shauna Singh Baldwin",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/501815.The_Tiger_Claw"
}