{
  "title": "Moonbird: A Year on the Wind with the Great Survivor B95",
  "description": "B95 can feel it: a stirring in his bones and feathers. It’s time. Today is the day he will once again cast himself into the air, spiral upward into the clouds, and bank into the wind.He wears a black band on his lower right leg and an orange flag on his upper left, bearing the laser inscription B95. Scientists call him the Moonbird because, in the course of his astoundingly long lifetime, this gritty, four-ounce marathoner has flown the distance to the moon—and halfway back! B95 is a robin-sized shorebird, a red knot of the subspecies rufa. Each February he joins a flock that lifts off from Tierra del Fuego, headed for breeding grounds in the Canadian Arctic, nine thousand miles away.  Late in the summer, he begins the return journey. B95 can fly for days without eating or sleeping, but eventually he must descend to refuel and rest. However, recent changes at ancient refueling stations along his migratory circuit—changes caused mostly by human activity—have reduced the food available and made it harder for the birds to reach. And so, since 1995, when B95 was first captured and banded, the worldwide rufa population has collapsed by nearly 80 percent. Most perish somewhere along the great hemispheric circuit, but the Moonbird wings on. He has been seen as recently as November 2011, which makes him nearly twenty years old. Shaking their heads, scientists ask themselves: How can this one bird make it year after year when so many others fall?  National Book Award–winning author Phillip Hoose takes us around the hemisphere with the world’s most celebrated shorebird, showing the obstacles rufa red knots face, introducing a worldwide team of scientists and conservationists trying to save them, and offering insights about what we can do to help shorebirds before it’s too late. Through prose, research, and images, Hoose explores the tragedy of extinction through the triumph of a single bird.",
  "genres": [
    "Nonfiction",
    "Science",
    "Birds",
    "Animals",
    "Nature",
    "Middle Grade",
    "Childrens"
  ],
  "author": "Phillip Hoose",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/12510885-moonbird"
}