{
  "title": "The Son of Good Fortune",
  "description": "From award-winning author Lysley Tenorio, comes a big hearted debut novel following an undocumented Filipino son as he navigates his relationship with his mother, an uncertain future, and the place he calls homeExcel spends his days trying to seem like an unremarkable American teenager. When he’s not working at The Pie Who Loved Me (a spy-themed pizza shop) or passing the time with his girlfriend Sab (occasionally in one of their town’s seventeen cemeteries), he carefully avoids the spotlight.But Excel knows that his family is far from normal. His mother, Maxima, was once a Filipina B-movie action star who now makes her living scamming men online. The old man they live with is not his grandfather, but Maxima’s lifelong martial arts trainer. And years ago, on Excel’s tenth birthday, Maxima revealed a secret that he must keep forever. “We are ‘TNT’—tago ng tago,” she told him, “hiding and hiding.” Excel is undocumented—and one accidental slip could uproot his entire life.Casting aside the paranoia and secrecy of his childhood, Excel takes a leap, joining Sab on a journey south to a ramshackle desert town called Hello City. Populated by drifters, old hippies, and washed-up techies—and existing outside the normal constructs of American society—Hello City offers Excel a chance to forge his own path for the first time. But after so many years of trying to be invisible, who does he want to become? And is it possible to put down roots in a country that has always considered you an outsider?Thrumming with energy and at once critical and hopeful, The Son of Good Fortune is a luminous story of a mother and son testing the strength of their bond to their country—and to each other.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Coming Of Age",
    "Literary Fiction",
    "Audiobook",
    "Book Club",
    "Asian Literature"
  ],
  "author": "Lysley Tenorio",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/50172133-the-son-of-good-fortune"
}