{
  "title": "My Soul Is Sealed",
  "description": "Five years ago, Elijah Larson watched Zoe Hendricks, the love of his life, drive away, bound for New York to chase her dreams of being on Broadway. She landed her dream role, and he made a trip there to see what she'd made of herself. When they saw each other after a solo concert she put on, it was clear that the spark that had always existed between them was still there, and it only took one night for that spark to reignite into a flame that burned even brighter than it had all those years ago.A year later, Elijah finds himself down on one knee, asking the woman he'd never stopped loving to marry him. When she says yes and makes the decision to come back to Florida after her contract on Broadway expires, it seems like life is perfect. But Zoe and Elijah both have secrets from the five years they spent apart. Things they're ashamed of. When someone starts stalking and threatening Zoe, exposing her secrets as well as her friends', Elijah finds himself faced with memories of things he'd rather keep buried. Do those memories hold the key to what's happening to Zoe now or is it all a coincidence? Can he put together the pieces of this mystery in time, or will he lose the woman he loves all over again, this time for good?Trigger warning: Though they are not major parts of the plot of this book, the topics of domestic abuse and sexual assault are touched on in this book, and there is a suicide attempt. If you feel like these would be difficult subjects for you to read about, please tread with caution. In the front matter of the book, the chapter that includes the suicide attempt is mentioned, and it may be skipped if you wish without it detracting from your overall enjoyment of the book.Note: This book is Elijah's version of the events that took place in the book My Heart Is Sealed. While there are notable differences in the way this story is told, those who have read My Heart Is Sealed will notice similarities.",
  "genres": [],
  "author": "Carmen Richter",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/50198389-my-soul-is-sealed"
}