{
  "title": "Slay All Day",
  "description": "What happens when a monster hunter falls for his prey?Harrison Key has one job—hunt and destroy monsters. He’s taken out vamps, shifters, demons…it’s all in a night’s work for him. He protects the innocent and destroys the wicked. Case closed. The job doesn’t pay much and the benefits are literally hell, but a hunter is born to the work. Gifted with super strength and speed, Harrison was created to fight monsters. There is nothing else for him in this world.Then he meets her.She looks like innocence but makes him think of the hottest sin. When Harrison first meets Elise Aine, she’s surrounded by vamps who are only too eager to take a bite. Harrison stakes the vamps and intends to walk away from Elise, but she has other plans. She says that she’s under supernatural attack. Elise desperately needs his protection, and she’ll pay any price. One look into her dark and gorgeous eyes, and Harrison can’t walk away. He doesn’t want to walk away. He wants her.What Harrison doesn’t know…could just kill him.Elise isn’t human. Not by a long shot. And she’s got big plans for Harrison. Sure, the guy may think he’s a hunter, he may believe that his job is to rid the world of the wicked, but he’s dead wrong. And with her help, Harrison may just turn out to be the wickedest one of them all. Because he’s not really a hunter. He’s something far, far more interesting. And hot. Smokin’, in fact.He just needs to let his wild side out to play…As the queen of the fairies, Elise was born to trick and deceive, and, with way too many enemies closing in, she needs the most powerful protector imaginable at her side. Harrison is her destined mate, if he’ll just stop fighting monsters long enough to see that deep inside…he is a beast. A beast like no other. One that can blast fire and soar into the skies. A beast who can only be bound and tamed by love.Betrayal burns deep and cuts hard.Can the queen of the fairies show a hunter that even monsters can love? Or when he finds out the truth about her, will rage be all that Harrison knows? Either way, things are about to get red-hot. Watch out for the flames and smoke.Author’s Note: SLAY ALL DAY is a stand-alone with action, humor, and plenty of hot times ahead. Sit down, buckle up, and enjoy the ride!",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Romance",
    "Fae",
    "Dragons",
    "Vampires"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/50187626-slay-all-day"
}