{
  "title": "The Last Piece of His Heart",
  "description": "At Santa Cruz Central High School, they called them the misfits, the outcasts, the weirdos. But most of us knew them as the Lost Boys... Ronan Wentz has been to hell and back, and he carries the scars to prove it. Worse, the blood of a monster runs through his veins. After ten years in foster care, eighteen-year-old Ronan is finally reunited with family. His uncle gives him a roof over his head and puts him to work, managing a shabby apartment complex in Santa Cruz, California.But a second chance is still a second chance. Ronan becomes a solitary hunter, a vigilante, walking the streets at night to keep the nightmares at bay. If he can use the anger burning in his tainted blood to protect instead of hurt, maybe then he’ll find the absolution he seeks.Then he meets Shiloh.Shiloh Barrera looks like she has it all together. Smart, ambitious, and full of artistic creativity she channels into making beautiful one-of-a kind jewelry. But Shiloh’s cool, capable demeanor is a front. Her demons drive her to succeed as much as her ambition—to prove her worth to the mother who can’t stand to look at her, and who’s harboring secrets of her own.When Shiloh and Ronan meet, the physical attraction is instant and scorching. Neither believes it will last. Falling in love is an impossible pipe dream saved for those less shattered and damaged than they are.But as hard as they try to resist, the growing feelings between them seem inevitable… until one terrible night destroys Shiloh’s dreams and Ronan’s future. When the smoke clears, and the rubble settles, they’ll have to choose - do their pasts determine their future, or can they build a new one from the broken pieces of their hearts?Lost Boys is a new series of interconnected, coming-of-age standalones from USA Today bestselling author Emma Scott.",
  "genres": [
    "Romance",
    "New Adult",
    "Friends To Lovers",
    "Contemporary",
    "Contemporary Romance",
    "High School",
    "Young Adult"
  ],
  "author": "Emma   Scott",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/50235833-the-last-piece-of-his-heart"
}