{
  "title": "When You Come Back to Me",
  "description": "At Santa Cruz Central High School, they called them the misfits, the outcasts, the weirdos. But most of us knew them as the Lost Boys...Holden Parish survived his parents' horrific attempts to make him \"the perfect son.\" After a year's stint in a Swiss sanitarium to recover, he has vowed to never let anything--or anyone--trap him again. Brilliant but broken, he seeks refuge behind alcohol, meaningless sex, and uses his wicked sense of humor to keep people away. He only has to ride out one year in the coastal town of Santa Cruz with his aunt and uncle before he inherits his billions and can make his escape. Disappear.Falling in love is not in the plans.River Whitmore. Star quarterback of the Central High football team, Prom King, Mr. Popular, ladies' man. He leads the perfect life...except it's all a lie. His father has River's future in the NFL all planned out, while River's dream is to run the family business in the town that he loves. But his mother's illness is tearing the family apart and River is becoming the glue that holds them together. How can he break his father's heart when it's already shattering?River's carefully-crafted façade explodes when he meets Holden Parish. A guy who dresses in coats and scarves year-round, drinks expensive vodka, and spends his free time breaking into houses for the fun of it. They're complete opposites. River seeks a quiet life, away from the spotlight. Holden would rather have dental surgery than settle down.Holden's demons and River's responsibilities threaten to keep them apart, while their undeniable attraction crashes them together again and again, growing into something deep and real no matter how they resist.Until one terrible night changes everything.#MMromance This book CAN BE READ AS A STANDALONEPlease note, this book contains spoilers for The Girl in the Love Song",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "New Adult",
    "High School",
    "Sports"
  ],
  "author": "Emma   Scott",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/50235824-when-you-come-back-to-me"
}