{
  "title": "Love's Glory",
  "description": "In October of 2017 cocky, alpha-male Irishman, Colin Campbell, Sergeant in Charge of the Special Assault Unit of the University of Virginia Campus Police Force, dove in front of a bullet meant for a University of Virginia student. The bullet shattered his thigh and severed his femoral artery, a wound which nearly took Colin’s life and left him temporarily disabled. His infirmities robbed him of the strength and athletic prowess which had been his for most of his life leaving him humiliated and bereft.  His partner, Joshua Abrams, a Doctor of Psychology at the Rainier Clinic in Charlottesville, never once left his injured lover’s side. He poured every ounce of strength and love he possessed into healing the magical Irishman whom he adored and was overwhelmed with relief and gratitude when Colin was taken off the critical list. Thinking that they had survived their trial, he took Colin home, believing that their happiness was now assured.  But like many injured police officers, Colin subsequently withdrew from his partner. Overwhelmed by feelings of shame and embarrassment, he devoted himself almost obsessively to the physical therapy with which he hoped to rebuild his strength and reclaim the life he had lost. Unable to share his pain and feelings of inadequacy, he shut Joshua out, leaving him to cope alone with the post-traumatic stress he suffered as a result of Colin’s shooting.  In the following months Colin and Joshua fought to keep their relationship alive. Although deeply in love, they felt powerless to cope with the after-effects of Colin’s injuries both to his body and to his pride as a man, and to heal the emotionally devastating PTSD with which Joshua suffered.  Love’s Trials tells the story of this painful and challenging time in Colin and Joshua’s life. As we join them now, Colin is still walking with a cane and still suffering the physical after effects of his injuries. But he and Joshua are both in therapy and are now dealing positively with the emotional and psychological damage they both endured.  They face their future side by side, determined to stand or fall together, as soul mates and lovers. This book follows them on their journey as they move toward the happy future they both long to share. They have moments of anxiety and intense emotion, but you can count on a happy ending. In fact, you can count on a happy read. In this book, Colin and his beloved Joshua have left their trials behind and now revel in Love’s Glory.  This book contain mature content including explicit sexual relations between Colin and Joshua. + 18 years of age",
  "genres": [
    "M M Romance",
    "LGBT",
    "Gay"
  ],
  "author": "Janice Jarrell",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/50221876-love-s-glory"
}