{
  "title": "The Radium Girls: The Scary But True Story of the Poison That Made People Glow in the Dark",
  "description": "The acclaimed national bestseller about America’s glowing girls and their brave fight for justice, now adapted for young readers.Amidst the excitement of the early twentieth century, hundreds of young women spend their days hard at work painting watch dials for troops overseas using glow-in-the-dark paint made with radium. They are well paid and consider themselves lucky—until they begin to fall mysteriously ill. As the corporations try to cover up a shocking secret, these determined shining girls suddenly find themselves at the center of a historic and deadly scandal.Written with a captivating voice and galloping pace, The Radium Girls illuminates the courage and tenacity of these incredible women, whose determination to fight back led to life-changing regulation, advanced nuclear research, and ultimately saved countless lives.This enthralling and accessible young readers’ edition of the New York Times and USA Today bestseller includes all-new material including a glossary, timeline, dozens of bonus photos, and more.Selected Praise for Radium Girls (adult edition):\"The glowing ghosts of the radium girls haunt us still.\" - \nNPR Books\n\"The Radium Girls makes it impossible for you to ignore these women's incredible stories, and proves why, now more than ever, we can't afford to ignore science, either.\" - \nBustle\n\"Written in a highly readable, narrative style, Moore's chronicle of these inspirational women's lives is sure to provoke discussion-and outrage-in book groups.\" - \nBooklist-STARRED review\n\"A must-read for anyone interested in American and women's history, as well as topics of law, health, and industrial safety.\" - \nLibrary Journal, STARRED review",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Book Club",
    "Audiobook",
    "Historical",
    "Biography"
  ],
  "author": "Kate  Moore",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/50225762-the-radium-girls"
}