{
  "title": "Flinx Transcendent",
  "description": "From one of the most brilliant imaginations in science fiction comes Flinx Transcendent , Alan Dean Foster’s thrilling conclusion to the series that began over thirty-five years ago–the epic adventures of Flinx and his flying minidrag companion, Pip.Flinx is the only one with even the tiniest chance of stopping the evil colossus barreling in to destroy the Humanx Commonwealth (and everything else in the Milky Way). With time running out, Flinx is a man in search of a solution and in search of himself. His efforts take him to the land of his mortal enemies, the bloodthirsty AAnn, where chances are excellent that Flinx’s discovery–and summary execution–will eliminate all his demons and doubts in one masterstroke.The way Flinx is feeling, that might not be the worst imaginable end. After years of searching for his father, he finally has–and must bear–the truth. And now he must also seek out an ancient sentient weapons platform wandering around somewhere in the galaxy and then communicate with it, a powwow that could very well fry his already frazzled brain. Then there are the oblivion-craving assassins determined to stop Flinx before he can prevent total annihilation.With a future that rosy, it’s no surprise he’s flirting with disaster. Still, Flinx is no quitter, and he’s got something else going for him–an uncanny ability to improvise and triumph (or at least survive) in impossible situations. He’s certainly been through enough of them, and now he’s going to need every ounce of that know-how, because he’s venturing to places where the laws of physics fear to tread, where no one’s ever been, to do what no one’s ever done, and where his deadliest enemy is so close it’s invisible.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Adventure",
    "Space Opera",
    "Science Fiction Fantasy",
    "Aliens"
  ],
  "author": "Alan Dean Foster",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/5026723-flinx-transcendent"
}