{
  "title": "The Curator",
  "description": "'Dark, sharp and compelling' PETER JAMES 'Fantastic' MARTINA COLE 'Britain's answer to Harry Bosch' MATT HILTON 'A powerful thriller from an explosive new talent' DAVID MARK______________________ It's Christmas and a serial killer is leaving displayed body parts all over Cumbria. A strange message is left at each #BSC6 Called in to investigate, the National Crime Agency's Washington Poe and Tilly Bradshaw are faced with a case that makes no sense. Why were some victims anaesthetized, while others died in appalling agony? Why is their only suspect denying what they can irrefutably prove but admitting to things they weren't even aware of? And why did the victims all take the same two weeks off work three years earlier? And when a disgraced FBI agent gets in touch things take an even darker turn. Because she doesn't think Poe is dealing with a serial killer at all; she thinks he's dealing with someone far, far worse - a man who calls himself the Curator. And nothing will ever be the same again . . . Praise for Mike 'Unlike most procedurals; MW Craven grabs the reader by the scruff of the neck and drags them bodily over the grit and grimness of this expertly-crafted tale; leaving them bruised, broken, but ultimately satisified' Matt Wesolowski on The Curator ' Truly mind-blowing' A. A. Dhand on Black Summer ' A book that shines with tension, wit and invention' William Shaw on Black Summer ' Washington Poe - a rising giant in detective fiction' Alison Bruce on Black Summer ' A twisty thriller with a killer plot Ed James on Black Summer 'I loved this book!' Jo Jakeman on Black Summer 'One of the best British crime novels I've read in a long time . . . Simply an unputdownable page-turner ' Nick Oldham on Black Summer ' Grabs you from the very first page. A dark and brilliantly twisted crime thriller , bringing back the inimitable Washington Poe and Tilly Bradshaw' Colin Falconer on Black Summer ' Dark and twisted in all the right places. Poe is a great mix of compelling, complex & charismatic , and well on his way to becoming one of the standout characters in crime fiction' Robert Scragg on Black Summer 'In Tilly and Poe, MW Craven has created a stand-out duo who are two of the most compelling characters in crime fiction in recent years. They deserve to join the ranks of Holmes and Watson, Rebus and Clarke, Hill and Jordan . . .' Fiona Cummins on Black Summer ' Dark, thrilling and unputdownable with sharply drawn characters that stride off the page' Victoria Selman on Black Summer 'Gleefully gory and witty, with a terrific sense of place' Sunday Times on Black Summer",
  "genres": [
    "Crime",
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Detective"
  ],
  "author": "M.W. Craven",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/50255799-the-curator"
}