{
  "title": "Never Kiss a Stranger",
  "description": "KikiEllis Atwood is the devil. Ok, maybe that’s too harsh. Ellis Atwood is ruining my life. First, he demolishes a perfectly good wedding trellis. Second, he destroys a gorgeous doggie wedding that I spent ages planning. (I kid you not.) Third, he makes me feel all warm and fuzzy, and that is not ok. I prefer the cold and harsh way my fiancé makes me feel so much better. (wait, that didn’t come out right.)Fourth, and there is a fourth, he gets me all wound up and flustered. And last, when he unexpectedly kissed me it made me forget my own name, or the fact that I’m getting married...in a month. Please someone help me out. I’m a mess. Worst part is, Ellis isn’t the bad guy I first thought he was. And being forced to spend time with him is making me realize that he needs my help more than anything. So what’s a girl like me to do?EllisI’m only in town long enough to figure out a plan with my brother on how to save our brewery from the awfulness that is my father. Oh and be in a wedding. Where I may or may not be crushing a little too hard on the bride-to-be. (spoiler alert, I'm crushing hard.)She’s really cute. Like seriously. And she has the cutest job, she’s a dog wedding planner. (I kid you not.)I can see why Henry loves her. I can see why everyone loves her. I can see why I’m falling for her. I’m usually not a relationship-type guy. Call it picky or whatnot, but usually I get bored easily. So, my plan is simple. Spend as much time with Kiki (soon to be Faniki, I know) and hopefully get bored with her adorkable smile and sexy legs that go on for miles. Then, I can save the brewery, be the best man of the wedding, and get my butt back to Atlanta and away from the happy couple.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Humor",
    "Audiobook",
    "Comedy",
    "Romantic Comedy"
  ],
  "author": "Logan Chance",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/50266011-never-kiss-a-stranger"
}