{
  "title": "Ghosts of The Silent Hills",
  "description": "About the BookThe dead do not rest till they get what they want. You have arrived in the hills. In here, you are surrounded by dense, menacing forests, enveloped in a deadly silence... You never know what lurks here in the Cold, dark night. Do not walk alone after sunset in the hills. A beautiful woman in white haunts the Lonely pathways, looking to enchant and ensnare men... All the people who died in accidents here... They say you hear their screams at night. And the deserted lodges sitting amidst lush greenery and calm streams... Spirits lie in wait here, ready to prey on the living. There are sceptics who did not heed these warnings. They tried to rationalize what they saw, what they felt. But when they came face to face with the beings that they believed didn’t exist, they couldn’t run away anymore... Ghosts of the silent hills is a collection that will make your nights a little scarier, encompassing the very best spine-chilling stories based on true hauntings.About the AuthorBorn in Shimla in 1955, Anita Krishan spent the initial twenty-two years of her life in this pristine Himalayan town, earning her master’s degree in English literature from Himachal University, and moving on to a career of introducing delights of the language to her young learners. In her long tenure as an educator, she has enriched the lives of countless students with the mystery of the narrative. A versatile writer, each of her literary works appertains to a different genre... from the joys and travails of life, to terrorism that has brought the world to its tenterhooks, to now the paranormal. She has travelled extensively around the globe absorbing the diverse human ethos and cultures—the delectable food for her thoughts. Presently, she lives in Gurgaon with her family.",
  "genres": [
    "Horror",
    "Audiobook",
    "Short Stories",
    "Thriller",
    "Fiction",
    "Paranormal",
    "Indian Literature"
  ],
  "author": "Anita Krishan",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/50260404-ghosts-of-the-silent-hills"
}