{
  "title": "Video Game Addiction: Disorder or Deviance?",
  "description": "On May 25th, 2019, the World Health Organization (WHO) voted to adopt the 11th edition of the International Classification of Diseases - adding Video Gaming Disorder as a diagnosable disorder. There is speculation that the American Psychiatric Association will also add a video game disorder in the next edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM-6). There are strengths and weaknesses in the claim of a video game disorder. However, there are unique cultural factors found in the video game subculture that rebuke the concept of labeling players with a disorder.Video games are no longer the pastime of greasy faced nerds. Video games are made available to toddlers to the elderly, 24/7 online, and has a variety of category offering an always different immersive experience. In the 21st century, video games have made it to the main stage of conversations and have become a topic discussed in the news. ESPN now covers esports like traditional sports!The World Health Organization, the American Psychological Association and the DSM, researchers, medical professionals, and news outlets fail to adequately conceptualize the issue of what a gaming disorder means and how the medicalization of video games is going to affect the individuals and their community that is supposedly suffering.The voice and experience of the players are lost. Although there is merit in having a general addiction disorder and criteria for treatment, to single out video gaming as being its own disorder is unjust. The video game subculture is extremely valuable to society, and the contribution of players should be rejoiced instead of chastised.Examining relevant research, psychology, and news articles an argument is made that video game addiction is needless medicalization hazardous to the video game culture and players.(Excerpts are taken from the book and used in the description)",
  "genres": [],
  "author": "Trey J. Hunt",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/50264831-video-game-addiction"
}