{
  "title": "Restoring Our Republic: The Making of the Republic and How We Reclaim It Before It's Too Late",
  "description": "In Restoring Our Republic, Ned Ryun examines the genesis for the ideas which inspired our constitutional republic, from the ancient Hebrews, Greeks and Romans to the English and their common law. Ryun also discusses the machinery of the republic built by the Founders meant to protect the rights of the American people and how that machinery has been dismantled by Progressives. “Restoring Our Republic is powerful love letter to the United States of America. Detailed and sweeping, yet digestible and engrossing, this is the book America needs right now, a potent antidote to the poisonous lies promulgated by today’s elite, those unworthy heirs of the exponential greater men of the founding. Ned Ryun gives us back our history, and in doing so reveals the truth about who we are asAmericans.”— Kurt Schlichter, Senior Columnist at Townhall.com “Ned Ryun nails it with Restoring Our Republic . Our Founder Fathers weren’t anarchic revolutionaries. They fought instead to preserve our Judeo-Christian Civilization. That civilization, the greatest ever, is under lethal assault once more from those who detest PresidentTrump’s MAGA agenda. Read Restoring Our Republic to refuel your commitment and help win back our country.”— Sebastian Gorka Ph.D. Former Strategist to President Donald Trump, Host of America First \"The success of our republic isn’t by it is due to disciplined, deliberate choices. The growth of socialism now threatens the freedom this success provides. How will Americans now choose? Ned Ryun’s Restoring Our Republic examines this and celebrates the DNA ofAmerican liberty.”— Dana Loesch, nationally syndicated radio host and best-selling author “Restoring Our Republic is both a love letter and a call to arms. As the republic of liberty created by the settlers of this country is slowly replaced with a new regime, Ryun reminds us of what we had and howwe can get it back. This is not simply a diagnostic, much less a eulogy, it is a plan for the reinvigoration of our nation, for the unity of her people, and for the restoration of the Republic.”— Chris Buskirk, Publisher and Editor of American Greatness “Ned Ryun incisively details the fundamental principles and history of freedom and liberty that made America great, as well as the disastrous consequences of throwing overboard the constitutional ideals of theFounding Fathers. Restoring Our Republic makes clear that the only wayto make America great again is to keep America free.”— Sean Davis, co-founder of The Federalist “Ned Ryun’s Restoring Our Republic is a great analysis of what we’vefought for, where we’ve been, and where we’re going.”— Dan Bongino, The Dan Bongino Show “Restoring Our Republic is a historical road map of how the UnitedStates of America came to be the greatest force for good the world has ever known. Ned Ryun explains the complex underpinnings of the American experiment and pulls no punches in warning of the fragility of American exceptionalism. Understanding that America’s constitutional and legal foundation was laid thousands, not hundreds of years ago, Ned calls on Americans to appreciate the gift they’ve been given, while warning of the dangers ahead if they stray from theFounders’ course. A celebration of western civilization and values, Restoring Our Republic reminds us that a strong America means a return to our core tenets. This book is sure to become the must read manifesto of Constitutional conservatives.”— John Cardillo, Host of America Talks Live",
  "genres": [],
  "author": "Ned Ryun",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/50261704-restoring-our-republic"
}