{
  "title": "Rodham",
  "description": "From the New York Times bestselling author of American Wife and Eligible, a novel that imagines a deeply compelling what-might-have-been: What if Hillary Rodham hadn’t married Bill Clinton? In 1971, Hillary Rodham is a young woman full of promise: Life magazine has covered her Wellesley commencement speech, she’s attending Yale Law School, and she’s on the forefront of student activism and the women’s rights movement. And then she meets Bill Clinton. A handsome, charismatic southerner and fellow law student, Bill is already planning his political career. In each other, the two find a profound intellectual, emotional, and physical connection that neither has previously experienced. In the real world, Hillary followed Bill back to Arkansas, and he proposed several times; although she said no more than once, as we all know, she eventually accepted and became Hillary Clinton. But in Curtis Sittenfeld’s powerfully imagined tour-de-force of fiction, Hillary takes a different road. Feeling doubt about the prospective marriage, she endures their devastating breakup and leaves Arkansas. Over the next four decades, she blazes her own trail—one that unfolds in public as well as in private, that involves crossing paths again (and again) with Bill Clinton, that raises questions about the tradeoffs all of us must make in building a life. Brilliantly weaving a riveting fictional tale into actual historical events, Curtis Sittenfeld delivers an uncannily astute and witty story for our times. In exploring the loneliness, moral ambivalence, and iron determination that characterize the quest for political power, as well as both the exhilaration and painful compromises demanded of female ambition in a world still run mostly by men, Rodham is a singular and unforgettable novel.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Politics",
    "Audiobook",
    "Book Club",
    "Literary Fiction",
    "Feminism"
  ],
  "author": "Curtis Sittenfeld",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/50253429-rodham"
}