{
  "title": "The Book of Two Ways",
  "description": "Everything changes in a single moment for Dawn Edelstein. She's on a plane when the flight attendant makes an announcement: prepare for a crash landing. She braces herself as thoughts flash through her mind. The shocking thing is, the thoughts are not of her husband, but a man she last saw fifteen years ago: Wyatt Armstrong.Dawn, miraculously, survives the crash, but so do all the doubts that have suddenly been raised. She has led a good life. Back in Boston, there is her husband, Brian, her beloved daughter, and her work as a death doula, where she helps ease the transition between life and death for patients in hospice.But somewhere in Egypt is Wyatt Armstrong, who works as an archaeologist unearthing ancient burial sites, a job she once studied for, but was forced to abandon when life suddenly intervened. And now, when it seems that fate is offering her second chances, she is not as sure of the choice she once made.After the crash landing, the airline ensures the survivors are seen by a doctor, then offers transportation wherever they want to go. The obvious option for Dawn is to continue down the path she is on and go home to her family. The other is to return to the archaeological site she left years before, reconnect with Wyatt and their unresolved history, and maybe even complete her research on The Book of Two Ways--the first known map of the afterlife. As the story unfolds, Dawn's two possible futures unspool side by side, as do the secrets and doubts long buried beside them. Dawn must confront the questions she's never truly asked: What does a life well-lived look like? When we leave this earth, what do we leave behind? Do we make choices...or do our choices make us? And who would you be, if you hadn't turned out to be the person you are right now?",
  "genres": [
    "Fiction",
    "Romance",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Historical Fiction",
    "Adult"
  ],
  "author": "Jodi Picoult",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/50265329-the-book-of-two-ways"
}