{
  "title": "Lessons from the Titans: What Companies in the New Economy Can Learn from the Great Industrial Giants to Drive Sustainable Success",
  "description": "Three top Wall Street analysts reveal enduring lessons in sustainable success from the great industrial titans--the high-tech companies of their day--to the disruptors that now dominate the economy.Before Silicon Valley disrupted the world with new technologies and business models, America's industrial giants paved the way. Companies like General Electric, United Technologies, and Caterpillar were the Google and Amazon of their day, setting gold standards in innovation, growth, and profitability. Today's leaders can learn a great deal from their successes, as well as their missteps. In this essential guide, three veteran Wall Street analysts reveal timeless lessons from the titans of industry--and offer battle-tested survival tactics for an ever-changing world. You'll learn: how GE became the largest company on earth--only for a culture of arrogance to set in motion the largest collapse in historyhow Boeing reassessed risks, raised profits--and tragically lost its balancehow Danaher avoided the pitfalls of tremendous success--by continually reinventing itselfhow Honeywell experienced a near-fatal cultural breakdown--and executed a flawless turnaroundhow Caterpillar relied too much on forecasting, lost billions--and rallied by recommitting to the basicsFilled with illuminating case studies and brilliant in-depth analysis, this invaluable book provides a multitude of insights that will help you weather market upheavals, adapt to disruptions, and optimize your resources to your best advantage. You'll learn hard-won lessons in innovation, growth, resilience, and operational excellence, as well as the time-proven fundamentals of continuous improvement for lasting success. In the end, you'll have your own personal toolbox of useful takeaways from more than a century's worth of data, experience, wisdom, and can-do spirit, courtesy of some of the greatest business enterprises of all time. This is how manufacturers survived the first disruptors of technology--and how today's giants can survive and thrive during continuous cycles of disruption.",
  "genres": [
    "Business",
    "Nonfiction",
    "Management",
    "Finance",
    "History",
    "Economics",
    "Leadership"
  ],
  "author": "Scott   Davis",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/50310904-lessons-from-the-titans"
}