{
  "title": "Hard to Handle",
  "description": "New York Times bestselling author K. Bromberg is back with an all new second-chance, standalone hockey romance.At first, the request seemed simple—sign a new athlete to the agency. Then I found out the new athlete was none other than the most wanted man in hockey today: Hunter MaddoxGifted. Sexy. At the top of his game. And the only man who has ever broken my heart.If signing him will help save our family business, I’ll swallow my pride and do what’s asked. But when it becomes clear his uncharacteristic antics off the ice are a hint of something deeper, keeping things strictly professional between us becomes more than complicated. But I know better than to cross that line. I’ll never date a client. Not even for him.***Win the Stanley Cup and do it before time runs out. Not a small feat, but it’s what’s motivated me since the start of my career. And time is running out.Enter Dekker Kincade.Feisty. Dogged. Damn gorgeous. The one I let get away.I have no idea why she’s traveling with the team, but hell if resisting her is going to be easy. But I have a job to do, and I refuse to lose sight of that end game. Even if she confuses me. Even if she sees parts of me I’ve hidden from the world. I can’t lose focus. Not even for her.Are you ready to fall for the Kincade sisters and the men who love them in K. Bromberg's sexy, contemporary, sports romance series? These books can all be read as standalones, but you’ll enjoy reading them as a series!Hard to Handle (Hunter & Dekker's story - hockey romance)Hard to Hold (Rush & Lennox's story - soccer romance)Hard to Score (Drew & Brexton's story - football romance)Hard to Lose (Gunner & Chase's story - baseball romance)Hard to Love (Finn & Stevie's story)",
  "genres": [
    "Romance",
    "Sports Romance",
    "Sports",
    "Second Chance",
    "Hockey",
    "Contemporary Romance",
    "Second Chance Romance"
  ],
  "author": "K. Bromberg",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/50278412-hard-to-handle"
}