{
  "title": "Back from the Far Field: American Nature Poetry in the Late Twentieth Century",
  "description": "Many poets writing after World War II have found the individual focus of contemporary poetics poorly suited to making statements directed at public issues and public ethics. The desire to invest such individualized poetry with greater cultural authority presented difficulties for Vietnam-protest poets, for example, and it has been a particular challenge for nature writers in the Thoreau tradition who have attempted to serve as advocates for the natural world. Examining the implications of this dilemma, Bernard W. Quetchenbach locates the poets Robert Bly, Gary Snyder, and Wendell Berry within two the American nature-writing tradition, and the newer tradition of contemporary poetics. He compares the work of two other twentieth-century poets, Robinson Jeffers and Theodore Roethke, to illustrate how the \"contemporary shift\" toward a poetics focused on the poet's life has affected portrayals of nature and the \"public voice\" in poetry. Turning back to the work of Bly, Snyder, and Berry, Quetchenbach assesses their attempts to reinvent the public voice in the context of contemporary poetics and what effect these attempts have had on their work. He argues that these poets have learned from their postwar generation techniques for adapting a personalized poetics to environmental advocacy. In addition to modifying what critics have called the \"poetics of immediacy,\" these poets have augmented their poetic output with prose and identified themselves with long-standing traditions of poetic, ethical, and spiritual authority. In doing so, Bly, Snyder, and Berry have attempted to solve not only a problem inherent in contemporary poetics but also the larger problem of the role of the poet in a society that does not recognize poetry. While it would be an overstatement to suggest that these three figures have found a place for the poet in American life, they have reached audiences that extend beyond traditional readers of poetry. At the end of the twentieth century, Quetchenbach concludes, poets have begun to identify, and direct their writing to, specific audiences defined less by aesthetic preferences and more by a shared interest in and dedication to the work's subject matter. Whether revealing a disturbing trend for poetry or an encouraging one for environmentalism and other political causes, it is one of many provocative conclusions Quetchenbach draws from his examination of postwar nature poetry.",
  "genres": [],
  "author": "Bernard Quetchenbach",
  "average_rating": "2.00",
  "url": "https://www.goodreads.com/book/show/1251363.Back_from_the_Far_Field"
}