{
  "title": "Fool's Gold",
  "description": "New in paperback, Jane Smith's hilarious novel of artistic pretensions and inflated egos in sunny Provence. Vivian Hart, dismissed from her job, moves with her family to grimly traffic-choked and commercialized Provence, where they discover, as have so many before them, that all that glitters is not gold. \"A witty rejection of every romantic fantasy ever spun about France. Fool's Gold does for beautiful Provence what Fawlty Towers did for quaint English hotels.\"- The Christian Science Monitor . Jane S. Smith is the author of Patenting the Polio and the Salk Vaccine , winner of the Los Angeles Times Book Prize, and of Elsie De A Life in the High Style , a National Book Critics Circle finalist. She lives in Evanston, Illinois. Fool's Gold is her first novel. An The Lecturer on Art Late as usual, Vivian Hart rammed her car into the fast-moving traffic heading west to New Jersey over the George Washington Bridge. The aggressive driving was just a reflex, a habit acquired during her thirty-eight years on Planet New York. She was on her way to be fired, a situation that no degree of promptness would improve. She had received the call at nine that morning, a terse order to attend her first faculty meeting in the ten years she had taught at Malcolm College of Knowledge. The explanation came when she turned on the car radio. Every day, just before the weather, her favorite station featured a one-minute expos of the most glaring case of capitalist malfeasance in the last twenty-four hours. Today's subject had been Vivian's boss. Amos Malcolm, millionaire pioneer in drop-in education, the genius who had transformed an evening class in auto-body repair into the largest privately-owned school in the tri-state metropolitan area, had just been indicted for misappropriation of federal funds. To keep their client out of jail, old Amos' lawyers had agreed to an immediate suspension of operations. When she finally arrived at the main campus, a converted freight depot just off the New Jersey Turnpike, it was to hear a somewhat reworded version of the same news. Malcolm College of Knowledge, where Northern New Jersey Learns what Earns, was b",
  "genres": [],
  "author": "Jane S. Smith",
  "average_rating": "2.87",
  "url": "https://www.goodreads.com/book/show/1251400.Fool_s_Gold"
}