{
  "title": "The City of Zirdai",
  "description": "With her indomitable style, New York Times bestselling author Maria V. Snyder returns with an electric new fantasy series that will keep you on the edge of your seat.* KING OF KORAHA, the thrilling conclusion, is available for pre-order now! *'It's suicide, Shyla. You're the prize they want.'Through her courage and tenacity, Shyla Sun-Kissed has awoken the power of The Eyes of Tamburah. But this feat only marks the beginning of the challenges that the magical order, the Invisible Sword, faces to free the underground city of Zirdai.Though they have allies among the monks and splinter cells inside the city, Shyla knows the Invisible Sword doesn't have the strength to win. With the group fracturing due to the strain of losses from their latest ordeal, thinly veiled suspicions and endless disagreements, it's up to Shyla to forge a new united order.When both the draconian Water Prince and brutal Heliacal Priestess learn of Shyla's new powers, life becomes even more complicated as they will stop at nothing to capture Shyla and take the magic of The Eyes for themselves. Hunted at every turn and unable to hide, Shyla and the Invisible Sword must use every resource at their command - and unearth new ones - in their race to save the city from destruction. But their enemies always seem to be one step ahead. And the cost to win the battle may be more than Shyla would ever be willing to pay...Praise for The Eyes of 'Combines the sassiness and adventure of Tomb Raider, the twisted darkness of Blade Runner, and the secrets and mythology of Prince of Persia.' Bronwyn Eley, Booktopia'An enjoyable desert-inspired treasure hunt that was full of action and plot twists. It keeps you on the edge of your seat and you find yourself addicted to turning the page.' Morgan, Mashleas Reads",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Magic",
    "Romance",
    "Young Adult Fantasy",
    "Adventure",
    "Audiobook"
  ],
  "author": "Maria V. Snyder",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/50311563-the-city-of-zirdai"
}