{
  "title": "Ghosted",
  "description": "He may play like an angel, but this sinful angel is determined to make my life hell.  When my mom got sick, my dreams of a career in music imploded. That is, until Madame Usher wafts into my life like a ghost from the past, offering me the chance to study at the exclusive Manderley Academy – a music school for the most gifted and wealthy.  It’s an offer I can’t refuse—free room and board at the gothic mansion where elite students immerse themselves in mastering their art. But there’s a catch, and it’s a big one.  I’m her slave.  I clean the rooms. I polish the piano keys. I serve her and the six rich, pretentious students who paid to be here.  I must endure their bullying in silence. Even when they destroy my things, sabotage my performances, and try their best to drive me from Manderley.  Rich. Arrogant. Cruel. Especially Dorien Valencourt – the cute boy who used to be my friend grew up into the world's hottest a-hole. The Bad Boy of Baroque with his sinister smirk and come-to-bed eyes. Dorien won’t have the poor little charity case ruining his fun. He’s heard me play. He knows I’m a serious contender for the prestigious Manderley Prize.  Dorien isn’t used to losing, especially to the help.  But he’s not the only one haunting me.  Something twisted and evil shrouds Manderley Academy. Maybe my bullies are the least of my problems. Maybe Dorien’s not the one behind the strange noises in the walls, the warnings scrawled on my mirror, and the gruesome murders on the school grounds.  Maybe...maybe Manderley’s ghosts are real.  A dark mystery unfolds around musician Faye de Winter in book one of this gripping gothic college bully romance by USA Today best-selling author Steffanie Holmes. Warning: Proceed with caution – this tale of a spoiled rich boy with an unsettling secret and the girl who refuses to put up with his shit contains dark themes, a creepy house, a smoldering second-chance romance, college angst, cruel bullies, swoon-worthy sex, and potential triggers.",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Paranormal",
    "Dark",
    "Fantasy",
    "Paranormal Romance",
    "Contemporary"
  ],
  "author": "Steffanie Holmes",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/50312101-ghosted"
}