{
  "title": "Falling Series Collection 2",
  "description": "Dive into the final four books of the steamy and addictive Falling series. Everything you need to heat up your Kindle is right here. From an emotional office romance, to sexy bad boys, enemies to lovers, brother's best friends, explosive second chances, and a little m/m to mix things up. One-click and start binge-reading now.   Falling for Lucas  Sleeping with the boss wasn't meant to be part of the promotion.    People think I’m a suave businessman but they couldn’t be more wrong. The expensive suit is just covering the ugly scars of my past.  I have no interest in love or making promises that I can’t keep.  Until I find her in my hotel suite.  She’s a broken mess and everything in me wants to protect her. To make her mine.  I’m falling for my employee and she should be running far away from me.  Will I let her?  No chance.  Falling for Caleb  Never stop fighting if you think you’ve found the one.  I’m not fussy about the men I share my bed with, but my heart is another matter.  Loving someone too much goes hand in hand with pain and suffering. It’s not something I want in my life.  Then I meet him.  Just one kiss and he finds his way in. It’s just a shame I don’t have the same effect on him.  Can I convince him that he’s the only one for me despite what my reputation says?  I’m falling for a man whose sole intention is run as far away from me as he can.  Falling for Declan  Hate is easy. Love takes courage.  My life is sweet. I work hard, party harder, surf whenever the hell I want and get any woman I desire. It can’t get any better.  Then my worst enemy moves to town.  I’ve hated her from as early as I can remember, and now she’s taunting me once again.  Or tempting me?  It seems the girl who plagued my younger years is now a woman I can’t get out of my head.  I’m falling for my childhood enemy.  Nothing good can come of this, or can it?  Falling for Liam  She's mine, every last broken, beautiful bit of her.  I’ve always been different. Always been the nice one. The misunderstood one.  Everything changed when I found her, the woman I've been waiting for. Hoping for. The one.  Then, she left.  Now she's back, and she's nothing like I remember. She’s broken. Harboring dark secrets that beg to be exposed.  And that's fine, because I've got some sordid secrets of my own.  I’m going to prove I'm the one she needs.  Because she’s mine.  Mine to protect.  Mine to love.  It’s time for her to submit to the one thing she truly desires.  Me. All of me.",
  "genres": [
    "Romance"
  ],
  "author": "Tracy Lorraine",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/50351685-falling-series-collection-2"
}