{
  "title": "A Memory, a Monologue, a Rant, and a Prayer: Writings to Stop Violence Against Women and Girls",
  "description": "Selections from the “Until the Violence Stops” FestivalFeaturing writings by Abiola Abrams • Edward Albee • Tariq Ali • Maya Angelou • Periel Aschenbrand • Patricia Bosworth • Nicole Burdette • Kate Clinton • Kimberle Crenshaw • Michael Cunningham • Edwidge Danticat • Ariel Dorfman • Mollie Doyle • Slavenka Drakulic • Michael Eric Dyson • Dave Eggers • Kathy Engel • Eve Ensler • Jane Fonda • Carol Gilligan • Jyllian Gunther • Suheir Hammad • Christine House • Marie Howe • Carol Michèle Kaplan • Moisés Kaufman • Michael Klein • Nicholas Kristof • James Lecesne • Elizabeth Lesser • Mark Matousek • Deena Metzger • Susan Miller • Winter Miller • Susan Minot • Robin Morgan • Kathy Najimy • Lynn Nottage • Sharmeen Obaid-Chinoy • Sharon Olds • Hanan al-Shaykh • Anna Deavere Smith • Diana Son • Monica Szlekovics • Robert Thurman • Betty Gale Tyson • Alice Walker • Jody Williams • Erin Cressida Wilson • Howard ZinnThis groundbreaking collection, edited by author and playwright Eve Ensler, features pieces from “Until the Violence Stops,” the international tour that brings the issue of violence against women and girls to the forefront of our consciousness. These diverse voices rise up in a collective roar to break open, expose, and examine the insidiousness of brutality, neglect, a punch, or a put-down. Here is Edward Albee on S&M; Maya Angelou on women’s work; Michael Cunningham on self-mutilation; Dave Eggers on a Sudanese abduction; Carol Gilligan on a daughter witnessing her mother being hit; Susan Miller on raising a son as a single mother; and Sharon Olds on a bra.These writings are inspired, funny, angry, heartfelt, tragic, and beautiful. But above all, together they create a true and profound portrait of this issue’s effect on every one of us. With information on how to organize an “Until the Violence Stops” event in your community, A Memory, a Monologue, a Rant, and a Prayer is a call to the world to demand an end to violence against women.“In the current era, it takes some brain racking to think of anyone else doing anything quite like Ensler. She’s a countercultural consciousness-raiser, an empowering figure, a truth-teller.”–Chicago Tribune",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Short Stories",
    "Plays",
    "Womens",
    "Poetry",
    "Social Justice"
  ],
  "author": "V (formerly Eve Ensler)",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/503436.A_Memory_a_Monologue_a_Rant_and_a_Prayer"
}