{
  "title": "Murder at Kingscote",
  "description": "For fans of HBO’s The Gilded Age, explore the dark side of the alluring world of America’s 19th century elite in this gripping series of riveting mysteries…\nIn late nineteenth-century Newport, Rhode Island, journalist Emma Cross discovers the newest form of transportation has become the newest type of murder weapon . . .\n   On a clear July day in 1899, the salty ocean breeze along Bellevue Avenue carries new smells of gasoline and exhaust as Emma, now editor-in-chief of the Newport Messenger, covers Newport's first-ever automobile parade. But the festive atmosphere soon turns to shock as young Philip King drunkenly swerves his motorcar into a wooden figure of a nanny pushing a pram on the obstacle course.   That evening, at a dinner party hosted by Ella King at her magnificent Gothic-inspired \"cottage,\" Kingscote, Emma and her beau Derrick Andrews are enjoying the food and the company when Ella’s son staggers in, obviously still inebriated. But the disruption is nothing compared to the urgent shouts of the coachman. Rushing out, they find the family's butler pinned against a tree beneath the front wheels of Philip's motorcar, close to death.   At first, the tragic tableau appears to be a reckless accident—one which could ruin Philip's reputation. But when Emma later receives a message informing her that the butler bullied his staff and took advantage of young maids, she begins to suspect the scene may have been staged and steers the police toward a murder investigation. But while Emma investigates the connections between a competing heir for the King fortune, a mysterious child, an inmate of an insane asylum, and the brutal boxing rings of Providence, a killer remains at large—with unfinished business to attend to . . .",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Cozy Mystery",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Cozy"
  ],
  "author": "Alyssa Maxwell",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/50354305-murder-at-kingscote"
}