{
  "title": "The Year Without Summer",
  "description": "In 1815, a supervolcanic eruption led to the extraordinary 'Year Without Summer' in 1816: a massive climate disruption causing famine, poverty and riots. Snow fell in August. Lives, both ordinary and privileged, changed forever. 1815, Sumbawa Island, IndonesiaMount Tambora explodes in a cataclysmic eruption, killing thousands. Sent to investigate, ship surgeon Henry Hogg can barely believe his eyes. Once a paradise, the island is now solid ash, the surrounding sea turned to stone. But worse is yet to come: as the ash cloud rises and covers the sun, the seasons will fail.1816.In Switzerland, Mary Shelley finds dark inspiration. Confined inside by the unseasonable weather, thousands of famine refugees stream past her door. In Vermont, preacher Charles Whitlock begs his followers to keep faith as drought dries their wells and their livestock starve. In Britain, the ambitious and lovesick painter John Constable struggles to reconcile the idyllic England he paints with the misery that surrounds him. In the Fens, farm labourer Sarah Hobbs has had enough of going hungry while the farmers flaunt their wealth. And Hope Peter, returned from Napoleonic war, finds his family home demolished and a fence gone up in its place. He flees to London, where he falls in with a group of revolutionaries who speak of a better life, whatever the cost. As desperation sets in, Britain becomes racked with riots - rebellion is in the air.For fans of David Mitchell and Andrew Miller, The Year Without Summer tells the story of a fateful year when temperatures fell and the summer failed to arrive. It is a story of the books written, the art made; of the journeys taken, of the love longed for and the lives lost. Six separate lives, connected only by an event many thousands of miles away. Few had heard of Tambora - but none could escape its effects.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "19th Century",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Guinevere Glasfurd",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/50326791-the-year-without-summer"
}