{
  "title": "George Crook: From the Redwoods to Appomattox",
  "description": "Renowned for his prominent role in the Apache and Sioux wars, General George Crook (1828–90) was considered by William Tecumseh Sherman to be his greatest Indian-fighting general. Although Crook was feared by Indian opponents on the battlefield, in defeat the tribes found him a true friend and advocate who earned their trust and friendship when he spoke out in their defense against political corruption and greed.Paul Magid’s detailed and engaging narrative focuses on Crook’s early years through the end of the Civil War. Magid begins with Crook’s boyhood on the Ohio frontier and his education at West Point, then recounts his nine years’ military service in California during the height of the Gold Rush. It was in the Far West that Crook acquired the experience and skills essential to his success as an Indian fighter.This is primarily an account of Crook’s dramatic and sometimes controversial role in the Civil War, in which he was involved on three fronts, in West Virginia, Tennessee, and Virginia. Crook saw action during the battle of Antietam and played important roles in two major offensives in the Shenandoah Valley and in the Chattanooga and Appomattox campaigns. His courage, leadership, and tactical skills won him the respect and admiration of his commanding officers, including Generals Grant and Sheridan. He soon rose to the rank of major general and received four brevet promotions for bravery and meritorious service. Along the way, he led both infantry and cavalry, pioneered innovations in guerrilla warfare, conducted raids deep into enemy territory, and endured a kidnapping by Confederate partisans.George Crook offers insight into the influences that later would make this general both a nemesis of the Indian tribes and their ardent advocate, and it illuminates the personality of this most enigmatic and eccentric of army officers.",
  "genres": [
    "American Civil War",
    "American History",
    "Civil War"
  ],
  "author": "Paul Magid",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/12514877-george-crook"
}