{
  "title": "Lost and Found",
  "description": "an alternate cover edition can be found hereHe promised to never leave me. But when I needed him the most, that was exactly what he did…Wilderness guide Xander Reed has spent fifteen years trying to forget the night he turned to his best friend in his darkest hour, only to find the young man who’d sworn to always have his back was turning his on Xander instead. Two thousand miles and fifteen years of building a new life in the quiet backcountry of the Rocky Mountains should have been enough to put the memory of Bennett Crawford out of his mind forever, but old wounds run deep and when Bennett suddenly reappears in his life as part of a wilderness expedition Xander is guiding, the scars he thought long healed break wide open.I’d only ever wanted to protect Xander from getting hurt again. I never considered the one he needed protection from was me…Bennett Crawford was faced with an impossible choice the night his best friend needed him.He chose wrong.As the only son of one of the wealthiest families in New England, he should have had the world at his feet, but losing his best friend at the tender age of fourteen changed everything. And even though Bennett’s managed to hide behind a mask of contentment as he takes his place at his father’s side in the family business, inside he’s searching for the piece of himself that’s been missing ever since Xander Reed walked out of his life. Bennett’s only saving grace is his work with a group of inner city kids, and when he’s given the chance to show the troubled teens that there’s a bigger world out there waiting for them if they just have the courage to reach for it, he takes it.But when he steps off that bus for what was supposed to be a week of fun and adventure, he’s instantly returned to the past when he discovers their expedition guide is none other than the boy he let go so long ago. Only, the soft-hearted, insecure little boy Bennett once knew is gone, and in his place is a brooding, bitter man who isn’t interested in second chances.People leave. I know that now and nothing Bennett has to say to me will change anything…All Bennett wants is another chance to show Xander that friendship was only the beginning. But when a stubborn Xander refuses to even hear him out, Bennett realizes he’s going to need to fight dirty.Because now that he’s found Xander again, he’s not letting him go a second time…",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Friends To Lovers",
    "Second Chance",
    "LGBT",
    "Enemies To Lovers"
  ],
  "author": "Lucy Lennox",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/50357980-lost-and-found"
}