{
  "title": "President without a Party: The Life of John Tyler",
  "description": "Historians have long viewed President John Tyler as one of the nation’s least effective heads of state. In President without a Party—the first full­-scale biography of Tyler in more than fifty years and the first new academic study of him in eight decades—Christopher J. Leahy explores the life of the tenth chief executive of the United States. Born in the Virginia Tidewater into an elite family sympathetic to the ideals of the American Revolution, Tyler, like his father, worked as an attorney before entering politics. Leahy uses a wealth of primary source materials to chart Tyler’s early political path, from his election to the Virginia legislature in 1811, through his stints as a congressman and senator, to his vice­-presidential nomination on the Whig ticket for the campaign of 1840. When William Henry Harrison died unexpectedly a mere month after assuming the presidency, Tyler became the first vice president to become president because of the death of the incumbent. Leahy traces Tyler’s ascent to the highest office in the land and unpacks the fraught dynamics between Tyler and his fellow Whigs, who ultimately banished the beleaguered president from their ranks and stymied his election bid three years later. Leahy also examines the president’s personal life, especially his relationships with his wives and children. In the end, Leahy suggests, politics fulfilled Tyler the most, often to the detriment of his family. Such was true even after his presidency, when Virginians elected him to the Confederate Congress in 1861, and northerners and Unionists branded him a “traitor president.” The most complete accounting of Tyler’s life and career, Leahy’s biography makes an original contribution to the fields of politics, family life, and slavery in the antebellum South. Moving beyond the standard, often shortsighted studies that describe Tyler as simply a defender of the Old South’s dominant ideology of states’ rights and strict construction of the Constitution, Leahy offers a nuanced portrayal of a president who favored a middle-­of-­the­-road, bipartisan approach to the nation’s problems. This strategy did not make Tyler popular with either the Whigs or the opposition Democrats while he was in office, or with historians and biographers ever since. Moreover, his most significant achievement as president—the annexation of Texas—exacerbated sectional tensions and put the United States on the road to civil war.",
  "genres": [
    "Presidents",
    "Biography",
    "History",
    "Us Presidents",
    "American History",
    "Nonfiction",
    "Politics"
  ],
  "author": "Christopher J. Leahy",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/50314203-president-without-a-party"
}