{
  "title": "Checkmate",
  "description": "Bishop men are nothing but a plague on this planet, a disease that needs eradication before it spreads.They’re murderers. Liars. Thieves.The day I met Colum Bishop, I thought my life was finally turning around.I was led to believe he would be our savior. He was supposed to be our hero, a long awaited reprieve from the hardships life insisted on throwing at my mom and me.But in reality, he was the beginning of the very end.Instead of accepting us, he destroyed us.Instead of saving us, he had us murdered.But before my final moments, I met a girl.My only ally in a savage war that would eventually end my life.Elizabeth Tate was the first and last thought that passed through my mind as I lay in an alleyway and finally closed my eyes.It’s ironic, really, that my name is Gunner Bishop.That makes me his heir, I suppose.But the Bishop kingdom is nothing to aspire toward.I was born to be great, but my name makes it impossible. I was born to lead, but my father made sure I wouldn’t grow to lead him.I have just two more Bishops to take care of, and then I can rest knowing my mother’s death wasn’t in vain.From a child in alleyway, I must shed and eradicate the filth my name implies, then I’ll emerge amongst the flames and rule the empire I was destined to lead.I truly hope Libby’s loyalties are not with the man she calls Uncle.Checkmate is the 8th and final instalment in the Checkmate Series. Please note, reader discretion is advised. Book includes scenes of violence and sexual assault.⭐️⭐️⭐️⭐️⭐️The final installment of the Checkmate series is finally here and Oh Em GEE! It was everything I needed and more! Emilia Finn has done it yet again and she isn’t even sorry about it.⭐️⭐️⭐️⭐️⭐️Holy hell Batman what a ride!⭐️⭐️⭐️⭐️⭐️Wow! Wow! Wow! Just when I thought book 7 was my favorite book in the series with Spencer and Abigail as the main character, this finale kept me as a captive audience from beginning to end. I read it in one day and went back and read it again.⭐️⭐️⭐️⭐️⭐️This is the icing on top of the Checkmate cake. It has humor, passion, brotherhood, and most of all love in places you would never expect to find it. It is the big brother to all the Checkmate books, the wise one or missing puzzle piece that brings all the characters together as well as answering questions from the other Checkmate books. You will once again fall in love with Emilia’s characters and be left feeling you are somehow their family. Well done Emilia, it’s a solid 5!!!⭐️⭐️⭐️⭐️⭐️To be honest, I have been dreading the end of this series. I have loved every single book and did not want it to end. That being said....OMG I loved this book! Amazing end to an amazing series.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Dark"
  ],
  "author": "Emilia Finn",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/50357172-checkmate"
}