{
  "title": "Graves",
  "description": "Behind all my training and searching, I knew this day would come. That I would rescue my sisters from the graves and devils of their past, and we would be a family again.Human again.\nWhen Arianna destroyed the shrine to her old god, she thought she was free to build a new life in the human world. But controlling her new powers and navigating her relationships isn’t as easy as she thought it would be. Her sisters might be the only ones who can truly understand. They are also haunted by their pasts, unable to move on from the graves they left behind as sirens.To help her sister atone for her past, Ari re-awakens the dark god she pushed aside and travels to the world of the dead.If you like inspirational heroines, unique love stories, and some darker thrills and chills this dark fantasy retelling is for you! One-click now to start this emotional and spell-binding journey!GRAVES is the direct sequel to Depths, a darker twist on The Little Mermaid that borrows from Greek/Roman mythology and early Christianity.What are HighTower Fairytales?HighTower Fairytales lean more toward the original sources (NOT Disney) with rich semi-historical settings. They have magic. They have scary monsters. And, most importantly, they have unique and complex characters who are trying hard to improve themselves.They also include plenty of humor and all the heroes marry their prince/princess charming and live happily ever after at the end!Basically, these stories meant to inspire, but have a very difficult and occasionally dark tower to climb. They are conservatively marked at 14+ and are appropriate for teens and young adults.Currently these stories include:Winter Falls: A Tale of the Snow Queen (2017)Cry Wolf: A Tale of Beauty and the Beast (2020)Depths: A Tale of the Little Mermaid (2020)Robin's Hood: A Tale of Sherwood Forest (2021)And more on the way!!!",
  "genres": [],
  "author": "Jacque Stevens",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/50362196-graves"
}