{
  "title": "Doomsday Men: The Real Dr. Strangelove and the Dream of the Superweapon",
  "description": "This is the gripping, untold story of the doomsday bomb—the ultimate weapon of mass destruction. In 1950, Hungarian-born scientist Leo Szilard made a dramatic announcement on American science was on the verge of creating a doomsday bomb. For the first time in history, mankind realized that he had within his grasp a truly God-like power, the ability to destroy life itself. The shockwave from this statement reverberated across the following decade and beyond. If detonated, Szilard's doomsday device—a huge cobalt-clad H-bomb—would pollute the atmosphere with radioactivity and end all life on earth. The scientific creators of such apocalyptic weapons had transformed the laws of nature into instruments of mass destruction and for many people in the Cold War there was little to distinguish real scientists from that “fictional master of megadeath,” Stanley Kubrick’s Dr. Strangelove. Indeed, as PD Smith’s chilling account shows, the dream of the superweapon begins in popular culture. This is a story that cannot be told without the iconic films and fictions that portray our deadly fascination with superweapons, from H.G. Wells’ The War of the Worlds to Nevil Shute’s On the Beach and Kubrick’s Dr. Strangelove How I Learned to Stop Worrying and Love the Bomb . Although scientists admitted it was possible to build the cobalt bomb, no superpower would admit to having created one. However, it remained a terrifying possibility, striking fear into the hearts of people around the world. The story of the cobalt bomb is an unwritten chapter of the Cold War, but now PD Smith reveals the personalities behind this feared technology and shows how the scientists responsible for the twentieth century’s most terrible weapons grew up in a culture dreaming of superweapons and Wellsian utopias. He argues that, in the end, the doomsday machine became the ultimate symbol of humanity’s deepest fears about the science of destruction.",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "War",
    "History Of Science"
  ],
  "author": "P.D.  Smith",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1251610.Doomsday_Men"
}