{
  "title": "Sophomore Winter",
  "description": "Sophomore Winter, the Tenth book in the Lee Corcoran series, follows Lee Corcoran, who has completed his freshman year in college at the University of Michigan. His life does not follow the typical male athlete path.  While the book is written to allow a reader to enjoy it without all of the history, if you want to understand all the characters and dynamics in their lives, reading the previous nine books is the only way. Long-term threads and relationships tie the books together. These books primarily follow Lee and his best friend Darby, a girl.  As a freshman in high school, Lee became involved in a girls cheerleading program as an advisor and trainer where he was reluctantly introduced to crossdressing. Lee found that he enjoyed the softer side of clothing. As high school progressed, circumstances forced Lee to wear a feminine wardrobe in more and more situations.  One of the key elements of the storyline is that Lee enjoys his dressing while still wanting to hang onto his masculinity. It is an internal struggle which is a constant battle throughout the series. He has no doubts about his heterosexuality and loves the woman in his life.  Spoiler alert [if you have not read the other books]  Throughout high school, Lee dated women, participated in cheerleading, was the starting shortstop on the baseball team for four years, and wore women’s underwear and outer clothes virtually all the time in his senior year. He and his friends accomplished a lot. Lee ended up being the head cheerleader.  Over time, his best friend, Darby, learned of Lee’s preferences for certain feminine attire. Attending a major university, with a scholarship for cheerleading, Lee spends 100% of his time as a female student. An active member of a national sorority, participating in three sports in all three seasons, Lee has taken on responsibility for charity activity on campus and nationally for the National Cheerleading Association.  While Darby and he are a couple, they do not present that way in public on campus. On campus, Lee is living in a girl’s dormitory with other cheerleaders.  The previous book ended after the last regular season football game on the Saturday following Thanksgiving. It is time for Competition Cheerleading to begin as the end of the fall semester approaches. Both Lee and Darby have increasing responsibility at their sorority, school and in extracurricular activities.  Lee worked part of the previous summer as a professional baseball trainer and baseball scout. He plans to continue training players for the Detroit Tigers. The pair have done a lot of modeling and surely there will be more requests for their services.  This story deals with a reluctant [less reluctant by book 10] crossdresser who tries not to sacrifice his manhood while enjoying his unusual choice in clothing.  Crossdressing is dealt with as part of a real life.  Given the ages of the characters, the story does not involve explicit sex.  Young adult readers should be comfortable reading this book. ********** The Cheerleader series follows Lee Corcoran as he grows, matures, and experiences life from pre-high school through college. The main characters in this story will be recurring in other installments in the series.  Please leave a review after you are done reading on both Amazon and Goodreads.  Enjoy Daring Diane  Concepts: Cheerleading, Romance, Coming of Age, Young Love, Dating, Sororities, Bullying, Sports, Cross-Dressing, etc.  Disclaimer This story is a work of fiction. Names, characters, businesses, places, events, locales, and incidents are either the products of the author’s imagination or used in a fictitious manner. Any resemblance to actual persons, living or dead, or actual events is purely coincidental.",
  "genres": [
    "Young Adult",
    "Transgender"
  ],
  "author": "Daring Diane",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/50371047-sophomore-winter"
}