{
  "title": "Death and the Maiden",
  "description": "The much-anticipated final installment in Ariana Franklin’s popular Mistress of the Art of Death historical mystery series, finished by the author’s daughter after her death.England. 1191. After the death of her friend and patron, King Henry II, Adelia Aguilar, England’s vaunted Mistress of the Art of Death, is living comfortably in retirement and training her daughter, Allie, to carry on her craft—sharing the practical knowledge of anatomy, forensics, and sleuthing that catches murderers. Allie is already a skilled healer, with a particular gift for treating animals. But the young woman is nearly twenty, and her father, Rowley, Bishop of Saint Albans, and his patron, the formidable Queen Eleanor of Aquitaine, have plans to marry Allie to an influential husband . . . if they can find a man who will appreciate a woman with such unusual gifts.When a friend in Cambridgeshire falls ill, Allie is sent to Ely, where her path will cross with Lord Peverill, a young aristocrat who would be a most suitable match for the young healer. But when Allie arrives, all is chaos. A village girl has disappeared—and she’s not the first. Over the past few months, several girls from the villages surrounding Ely have vanished. When the body of one of the missing is discovered, Allie manages to examine the remains before burial. The results lead her to suspect that a monstrous predator is on the loose. Will her training and her stubborn pursuit of the truth help her find the killer...or make her the next victim?A richly detailed, twisty thriller, Death and the Maiden is historical mystery at its finest—and a superb final episode in Ariana Franklin’s much-loved, much-acclaimed series.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Medieval",
    "Mystery Thriller"
  ],
  "author": "Ariana Franklin",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/50373924-death-and-the-maiden"
}