{
  "title": "Blockchain Chicken Farm: And Other Stories of Tech in China's Countryside",
  "description": "A New York Times Book Review Editors' Choice\"A brilliant and empathetic guide to the far corners of global capitalism.\" --Jenny Odell, author of How to Do NothingFrom FSGO x Logic: stories about rural China, food, and tech that reveal new truths about the globalized worldIn Blockchain Chicken Farm, the technologist and writer Xiaowei Wang explores the political and social entanglements of technology in rural China. Their discoveries force them to challenge the standard idea that rural culture and people are backward, conservative, and intolerant. Instead, they find that rural China has not only adapted to rapid globalization but has actually innovated the technology we all use today.From pork farmers using AI to produce the perfect pig, to disruptive luxury counterfeits and the political intersections of e-commerce villages, Wang unravels the ties between globalization, technology, agriculture, and commerce in unprecedented fashion. Accompanied by humorous “Sinofuturist” recipes that frame meals as they transform under new technology, Blockchain Chicken Farm is an original and probing look into innovation, connectivity, and collaboration in the digitized rural world.FSG Originals × Logic dissects the way technology functions in everyday lives. The titans of Silicon Valley, for all their utopian imaginings, never really had our best interests at heart: recent threats to democracy, truth, privacy, and safety, as a result of tech’s reckless pursuit of progress, have shown as much. We present an alternate story, one that delights in capturing technology in all its contradictions and innovation, across borders and socioeconomic divisions, from history through the future, beyond platitudes and PR hype, and past doom and gloom. Our collaboration features four brief but provocative forays into the tech industry’s many worlds, and aspires to incite fresh conversations about technology focused on nuanced and accessible explorations of the emerging tools that reorganize and redefine life today.",
  "genres": [
    "China",
    "Nonfiction",
    "Technology",
    "Science",
    "Asia",
    "Politics",
    "Essays"
  ],
  "author": "Xiaowei Wang",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/50403472-blockchain-chicken-farm"
}