{
  "title": "150 Glimpses of the Beatles",
  "description": "Winner of the 2020 Baillie Gifford Prize for Non-FictionA distinctive portrait of the Fab Four by one of the sharpest and wittiest writers of our timeIf you want to know what it was like to live those extraordinary Beatles years in real time, read this book. --Alan Johnson, The SpectatorThough fifty years have passed since the breakup of the Beatles, the fab four continue to occupy an utterly unique place in popular culture. Their influence extends far beyond music and into realms as diverse as fashion and fine art, sexual politics and religion. When they appeared on The Ed Sullivan Show in 1964, fresh off the plane from England, they provoked an epidemic of hoarse-throated fandom that continues to this day.Who better, then, to capture the Beatles phenomenon than Craig Brown--the inimitable author of Ninety-Nine Glimpses of Princess Margaret and master chronicler of the foibles and foppishness of British high society? This wide-ranging portrait of the four lads from Liverpool rivals the unique spectacle of the band itself by delving into a vast catalog of heretofore unexamined lore.When actress Eleanor Bron touched down at Heathrow with the Beatles, she thought that a flock of starlings had alighted on the roof of the terminal--only to discover that the birds were in fact young women screaming at the top of their lungs. One journalist, mistaken for Paul McCartney as he trailed the band in his car, found himself nearly crushed to death as fans climbed atop the vehicle and pressed their bodies against the windshield. Or what about the Baptist preacher who claimed that the Beatles synchronized their songs with the rhythm of an infant's heartbeat so as to induce a hypnotic state in listeners? And just how many people have employed the services of a Canadian dentist who bought John Lennon's tooth at auction, extracted its DNA, and now offers paternity tests to those hoping to sue his estate?150 Glimpses of the Beatles is, above all, a distinctively kaleidoscopic examination of the Beatles' effect on the world around them and the world they helped bring into being. Part anthropology and part memoir, and enriched by the recollections of everyone from Tom Hanks to Bruce Springsteen, this book is a humorous, elegiac, and at times madcap take on the Beatles' role in the making of the sixties and of music as we know it.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "History",
    "Audiobook",
    "Biography Memoir",
    "Pop Culture"
  ],
  "author": "Craig  Brown",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/50403474-150-glimpses-of-the-beatles"
}