{
  "title": "Aphasia",
  "description": "Mauro Javier Cárdenas, the critically-acclaimed author of The Revolutionaries Try Again—\"an original, insubordinate novel\" (New York Times)—pens a profound story of literature about a man coming to terms with his dysfunctional Colombian family, as well as his own behavior, as an immigrant in America. Antonio wants to avoid thinking about his sister—even though he knows he won't be able to avoid thinking about his sister—because his sister is on the run after allegedly threatening to shoot her neighbors, and has been claiming that Antonio, Obama, the Pentagon, and their mother are all conspiring against her. Nevertheless, Antonio is going to try his best to be as avoidant as possible, because he worries that what's been happening to his sister might somehow infect his relatively contented, ordered American life, and destabilize the precarious arrangement with his ex-wife that's allowed him to stay close to his two daughters.In fact, he's busy doing everything except facing his problems head-on: transcribing recordings of his mother speaking about their troubled life in Colombia, transcribing recordings of his ex-wife speaking about her idyllic life in the Czech Republic; writing about former girlfriends whose words and deeds still recur in his mind; rereading stories by American writers that allow him to skirt the subject of his sister's state of mind without completely destroying his own.Written in long, unravelling sentences that accommodate all the detritus of thought—scenes real and imagined, headphones and heartache, Toblerones and Thomas Bernhard—Aphasia captures the immensity of the present moment as well as the pain of the past. It cements Mauro Javier Cárdenas‘s place as one of the most innovative and extraordinary novelists working today.",
  "genres": [
    "Fiction",
    "Novels",
    "Literary Fiction",
    "Contemporary",
    "United States",
    "Literature",
    "Mental Illness"
  ],
  "author": "Mauro Javier Cárdenas",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/50403456-aphasia"
}