{
  "title": "Path of the Tiger: Volume I of the Tooth, Claw and Steel epic",
  "description": "When the world was still young and civilisation was but a dream, they walked among us, alternately revered as living gods and feared as powerful demons. Beastwalkers: nearly immortal men and women who could wear the living bodies of animals.  As the empires of humankind grew, the existence of these beings passed from incontrovertible truth to hazy memory, fading in time to legend and eventually crumbling into myth. But the beastwalkers endured, living hundreds of secret lives, drifting surreptitiously through countless centuries and the rise and fall of civilisations, like fireflies travelling through a night forest. Only a few still draw breath, hunted relentlessly by a global cabal bent both on their final extermination and unchallenged dominion over our entire planet.  Now, in the 21st century, the remaining beastwalkers will make their final stand … but unbeknown to us, their struggle is our struggle, and the vicious campaign of extermination directed against them is, ultimately, a war of attrition waged on all living things.  Will the beastwalkers prevail in their last battle and survive the coming storm … or will they, along with humankind and the rest of the living world, face total destruction in a cataclysm of final doom?  The Tooth, Claw and Steel epic is a saga of wonder, violence, magic, tragedy, inspiration, brutality, love and hope, set against the awestriking backdrop of twelve thousand years of history and featuring an enormous cast of characters, ranging from gladiators of ancient Rome to Knights Templar to CEOs of multinational corporations, and many more. Dive headlong J.M. Hemmings’ richly woven tapestry of genre-bending historical fantasy in Path of the Tiger, the first volume of this grandiose and spellbinding story.",
  "genres": [],
  "author": "J.M. Hemmings",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/50394966-path-of-the-tiger"
}