{
  "title": "The Second Chance Club: Hardship and Hope After Prison",
  "description": "A former parole officer shines a bright light on a huge yet hidden part of our justice system through the intertwining stories of seven parolees striving to survive the chaos that awaits them after prison in this illuminating and dramatic book. Prompted by a dead-end retail job and a vague desire to increase the amount of justice in his hometown, Jason Hardy became a parole officer in New Orleans at the worst possible moment. Louisiana’s incarceration rates were the highest in the US and his department’s caseload had just been increased to 220 “offenders” per parole officer, whereas the national average is around 100. Almost immediately, he discovered that the biggest problem with our prison system is what we do—and don’t do—when people get out of prison. Deprived of social support and jobs, these former convicts are often worse off than when they first entered prison and Hardy dramatizes their dilemmas with empathy and grace. He’s given unique access to their lives and a growing recognition of their struggles and takes on his job with the hope that he can change people’s fates—but he quickly learns otherwise. The best Hardy and his colleagues can do is watch out for impending disaster and help clean up the mess left behind. But he finds that some of his charges can muster the miraculous power to save themselves. By following these heroes, he both stokes our hope and fuels our outrage by showing us how most offenders, even those with the best intentions, end up back in prison—or dead—because the system systematically fails them. Our focus should be, he argues, to give offenders the tools they need to re-enter society which is not only humane but also vastly cheaper for taxpayers. As immersive and dramatic as Evicted and as revelatory as The New Jim Crow, The Second Chance Club shows us how to solve the cruelest problems prisons create for offenders and society at large.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Sociology",
    "Crime",
    "True Crime",
    "Social Science"
  ],
  "author": "Jason Hardy",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/50397068-the-second-chance-club"
}