{
  "title": "The Book Collectors: A Band of Syrian Rebels and the Stories That Carried Them Through a War",
  "description": "Award-winning journalist Delphine Minoui recounts the true story of a band of young rebels in a besieged Syrian town, who find hope and connection making an underground library from the rubble of warDay in, day out, bombs fall on Daraya, a town outside Damascus, the very spot where the Syrian Civil War began. In the midst of chaos and bloodshed, a group searching for survivors stumbles on a cache of books. They collect the books, then look for more. In a week they have six thousand volumes. In a month, fifteen thousand. A sanctuary is born: a library where the people of Daraya can explore beyond the blockade.Long a site of peaceful resistance to the Assad regimes, Daraya was under siege for four years. No one entered or left, and international aid was blocked.In 2015, French-Iranian journalist Delphine Minoui saw a post on Facebook about this secret library and tracked down one of its founders, twenty-three-year-old Ahmad, an aspiring photojournalist himself. Over WhatsApp and Facebook, Minoui learned about the young men who gathered in the library, exchanged ideas, learned English, and imagined how to shape the future, even as bombs fell above. They devoured a marvelous range of books--from American self-help like The Seven Habits of Highly Effective People to international bestsellers like The Alchemist, from Arabic poetry by Mahmoud Darwish to Shakespearean plays to stories of war in other times and places, such as the siege of Sarajevo. They also shared photos and stories of their lives before and during the war, planned how to build a democracy, and began to sustain a community in shell-shocked soil.As these everyday heroes struggle to hold their ground, they become as much an inspiration as the books they read. And in the course of telling their stories, Delphine Minoui makes this far-off, complicated war immediate. In the vein of classic tales of the triumph of the human spirit--like All the Beautiful Forevers, A Long Way Gone, and Reading Lolita in Tehran--The Book Collectors will inspire readers and encourage them to imagine the wider world.",
  "genres": [
    "Nonfiction",
    "History",
    "Books About Books",
    "War",
    "Audiobook",
    "Politics",
    "Biography"
  ],
  "author": "Delphine Minoui",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/50403465-the-book-collectors"
}