{
  "title": "Bursting the Limits of Time: The Reconstruction of Geohistory in the Age of Revolution",
  "description": "In 1650, Archbishop James Ussher of Armagh joined the long-running theological debate on the age of the earth by famously announcing that creation had occurred on October 23, 4004 B.C. Although widely challenged during the Enlightenment, this belief in a six-thousand-year-old planet was only laid to rest during a revolution of discovery in the late eighteenth and early nineteenth centuries. In this relatively brief period, geologists reconstructed the immensely long history of the earth-and the relatively recent arrival of human life. Highlighting a discovery that radically altered existing perceptions of a human's place in the universe as much as the theories of Copernicus, Darwin, and Freud did, Bursting the Limits of Time is a herculean effort by one of the world's foremost experts on the history of geology and paleontology to sketch this historicization of the natural world in the age of revolution.Addressing this intellectual revolution for the first time, Rudwick examines the ideas and practices of earth scientists throughout the Western world to show how the story of what we now call \"deep time\" was pieced together. He explores who was responsible for the discovery of the earth's history, refutes the concept of a rift between science and religion in dating the earth, and details how the study of the history of the earth helped define a new branch of science called geology. Rooting his analysis in a detailed study of primary sources, Rudwick emphasizes the lasting importance of field- and museum-based research of the eighteenth and nineteenth centuries.Bursting the Limits of Time , the culmination of more than three decades of research, is the first detailed account of this monumental phase in the history of science.",
  "genres": [
    "History",
    "Nonfiction",
    "Geology",
    "Science"
  ],
  "author": "Martin J.S. Rudwick",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/12516856-bursting-the-limits-of-time"
}