{
  "title": "The Soul of the Rhino: A Nepali Adventure with Kings and Elephant Drivers, Billionaires and Bureaucrats, Shamans and Scientists and the Indian Rhinoceros",
  "description": "Selected as one of the best books of 2008 by Publishers Weekly\nIn early 2006, National Public Radio reported that “A promising conservation effort to save one of Nepal’s signature endangered species is now in serious trouble, due primarily to poachers taking advantage of fighting between government forces and Maoist insurgents.” This was devastating news indeed to author and scientist Hemanta Mishra, who has spent the better part of his adult life struggling to save the Indian Rhino from extinction in his native Nepal.  The Soul of the Rhino is the spirited yet humble account of Mishra’s unique personal journey. Fresh out of university in the 1970s, Mishra embarks on his conservation work with the help of an ornery but steadfast elephant driver, the Nepalese royal family, and handfuls of  like-minded scientists whose aim is to protect the animal in the foothills of the Himalayas. Yet, in spite of decades spent creating nature reserves and moving rhinos to protected areas, arm-wrestling politicians, and raising awareness for the cause, Mishra is still fearful about the future of the Indian Rhino. To this day, Nepal is overrun by armed insurgents, political violence, and poachers who could kill off this magnificent creature for good.   Filled with candor and bittersweet humor, Mishra re-creates his journey on behalf of the rhino, an ugly yet enchanting, terrifying yet delicate creature. The first book of its kind to delve into the multi-layered political labyrinths of South Asian wildlife conservation, and one man’s endurance in the face of it all, The Soul of the Rhino is sure to win over yourheart and soul.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Science",
    "Conservation",
    "Wildlife",
    "Asia",
    "Natural History"
  ],
  "author": "Hemanta Mishra",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/503801.The_Soul_of_the_Rhino"
}