{
  "title": "When Harry Met Minnie: A True Story of Love and Friendship",
  "description": "*An Instant New York Times Bestseller!* A memoir of love and loss, of being in the right place at the right time, and of the mysterious ways a beloved pet can bring people together, from CBS Sunday Morning News correspondent and multi-Emmy-Award-winning Martha Teichner.There are true fairy tales. Stories that exist because impossible-to-explain coincidences change everything. Except in real life, not all of them have conventional, happily-ever-after endings. When Harry Met Minnie is that kind of fairy tale, with the vibrant, romantic New York City backdrop of its namesake, the movie When Harry Met Sally, and the bittersweet wisdom of Tuesdays with Morrie.There's a special camaraderie among early-morning dog walkers. Gathering at dog runs in the park, or strolling through the farmer's market at Union Square before the bustling crowd appears, fellow pet owners become familiar-as do the personalities of their beloved animals. In this special space and time, a chance encounter with an old acquaintance changed Martha Teichner's world. As fate would have it, her friend knew someone who was dying of cancer, from exposure to toxins after 9/11, and desperate to find a home for her dog, Harry. He was a Bull Terrier--the same breed as Martha's dear Minnie. Would Martha consider giving Harry a safe, loving new home?In short order, boy dog meets girl dog, the fairy tale part of this story. But there is so much more to this book. After Martha agrees to meet Harry and his owner Carol, what begins as a transaction involving a dog becomes a deep and meaningful friendship between two women with complicated lives and a love of Bull Terriers in common. Through the heartbreak and grief of Carol's illness, the bond that develops changed Martha's life, Carol's life, Minnie's life, Harry's life. As it changed Carol's death as well.In this rich and touching narrative, Martha considers the ways our stories are shaped by the people we meet, and the profound love we can find by opening our hearts to unexpected encounters.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Animals",
    "Dogs",
    "Biography",
    "Audiobook",
    "Book Club"
  ],
  "author": "Martha Teichner",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/50403494-when-harry-met-minnie"
}