{
  "title": "Black Spartacus: The Epic Life of Toussaint Louverture",
  "description": "A new interpretation of the life of the Haitian revolutionary Toussaint Louverture  Among the defining figures of the Age of Revolution, Toussaint Louverture is the most enigmatic. Though the Haitian revolutionary’s image has multiplied across the globe—appearing on banknotes and in bronze, on T-shirts and in film—the only definitive portrait executed in his lifetime has been lost. Well versed in the work of everyone from Machiavelli to Rousseau, he was nonetheless dismissed by Thomas Jefferson as a “cannibal.” A Caribbean acolyte of the European Enlightenment, Toussaint nurtured a class of black Catholic clergymen who became one of the pillars of his rule, while his supporters also believed he communicated with vodou spirits. And for a leader who once summed up his modus operandi with the phrase “Say little but do as much as possible,” he was a prolific and indefatigable correspondent, famous for exhausting the five secretaries he maintained, simultaneously, at the height of his power in the 1790s.Employing groundbreaking archival research and a keen interpretive lens, Sudhir Hazareesingh restores Toussaint to his full complexity in Black Spartacus. At a time when his subject has, variously, been reduced to little more than a one-dimensional icon of liberation or criticized for his personal failings—his white mistresses, his early ownership of slaves, his authoritarianism —Hazareesingh proposes a new conception of Toussaint’s understanding of himself and his role in the Atlantic world of the late eighteenth century. Black Spartacus is a work of both biography and intellectual history, rich with insights into Toussaint’s fundamental hybridity—his ability to unite European, African, and Caribbean traditions in the service of his revolutionary aims. Hazareesingh offers a new and resonant interpretation of Toussaint’s racial politics, showing how he used Enlightenment ideas to argue for the equal dignity of all human beings while simultaneously insisting on his own world-historical importance and the universal pertinence of blackness—a message which chimed particularly powerfully among African Americans.Ultimately, Black Spartacus offers a vigorous argument in favor of “getting back to Toussaint”—a call to take Haiti’s founding father seriously on his own terms, and to honor his role in shaping the postcolonial world to come.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Race",
    "Politics",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Sudhir Hazareesingh",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/50403504-black-spartacus"
}