{
  "title": "1001 Inventions: Muslim Heritage in Our World",
  "description": "“This glorious book overflows with the great ideas of the Muslim middle ages. . . . I wish I had had this book fifty years ago.\"—Adam Hart-Davis, photographer, writer, and TV science presenter of the BBC series What the Ancients Did for UsWhat do coffee beans, torpedoes, surgical scalpels, arches, and observatories all have in common?Were Leonardo da Vinci’s flight ideas originals?Who devised the casing for pill capsules, and where did Fibonacci learn to flex his mathematical fingers?The answers to these questions and more can be found in this book.1001 Inventions: Muslim Heritage in Our World presents an excellent overview of Muslim heritage written to appeal to the everyday reader and to amaze and redefine many people's current assumptions of medieval times and of their history and roots.This is an essential introduction to the great epoch of Muslim civilization. Readers now have access to one thousand years of missing history, covering medicine, technology, economics, civilization, the environment, and much more. From Spain to China, scholars of different genders, cultures, and various faiths worked together to build upon the knowledge of ancient civilization.Written by a team of internationally renowned experts, the contributions were selected to give the reader reassurance and confidence that the facts presented in the book are from the most reliable and unbiased academic sources.Salim T S Al-Hassani is professor emeritus of mechanical engineering and professorial fellow at the School of Languages, Linguistics, and Cultures at the University of Manchester in the United Kingdom.Sir Roland Jackson is the chief executive of the British Association for the Advancement of Science.",
  "genres": [
    "History",
    "Islam",
    "Nonfiction",
    "Science",
    "Religion",
    "History Of Science",
    "Historical"
  ],
  "author": "Salim T.S. Al-Hassani",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/5042295-1001-inventions"
}