{
  "title": "Her Name Is Murder",
  "description": "Magical musician Murder LaVoe is tired of running. She's been running for almost 500 years. When you don’t age, people take it personally. She has returned 40 years later to her favorite borough in New York City. Her is to finally settle down and hide her secret by taking the identities of falsified heirs. A public attempt on the life of her Rock-N-Roll alter ego, Lady Dreamscapes , and a chance meeting of immortals in need, threaten to take away the life she holds so dear. Can NYPD detective Grant Noble III solve her mysteries in time to save her, or is it him that needs saving? “ The inimitable Murder LaVoe” -Goodreads review“Equal parts, gripping, mesmerizing, and spellbinding, HER NAME IS MURDER is an engrossing, action-packed tale of love and intrigue...” -Halo Scot, author of Edge of the Breach, I Will Kill You.TV pilot script is being developed to be shopped to the top networks!But I need your help! Grab your ebook and join Murder and crew on this adventure that's like no other! Leave a review and let me know what you loved from the book and need to see more of in the series! More music? We can do that? More Levi? Tress? Yep, that too. The show will be diverse and by US for US. And by \"US\" I mean all progressive minded fantasy lovers who love to see diverse characters achieving, loving, and of course, surviving the odds to throttle the bad guys!More Aside from our bisexual leading lady...Black/Gay/ Levi Esmund is a Protector of the Ageless sculpted from Clay by Murder’s mother to be her companion. No one knows how tied the fates of the Protectors are to their charges. Levi wants a good book and a hot guy. Maybe, just maybe, he’d like to be a real boy.Trans/Goth : Tress is also a Protector. A Trans-woman, and white-out Victorian goth who has learned to excel at glamours and wards. The Curse Of the Ageless prevents her from physically becoming a woman permanently. She’s devoted her life to helping trans-girls in need. There is only one problem. She has yet to figure out how to save herself.Mild content I don't usually post content warnings. My books seldom stray too far into the darker thoughts. They are there, but more around the edges. My books aren't excessively violent, nor do they feature explicit sex.I'm making an exception here for pop culture references to a boy wizard who I shall not name. I never followed that author outside of the very mainstream tip of her works and at the time had no idea that those works would become possible trauma for people under the trans umbrella. Mind you, I'm under here too.In the sequel, London Calling, Tress adresses her own complicated relationship with that franchise, which in some ways mirrors my own. Please don't stop reading over a reference! I promise I strive to make it right with even more inclusion as the books progress!",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Mystery",
    "Romance",
    "Witches",
    "M M Romance",
    "Historical Fiction"
  ],
  "author": "A.C. Merkel",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/50416051-her-name-is-murder"
}