{
  "title": "The Doubter's Companion: A Dictionary of Aggressive Common Sense",
  "description": "A long and distinguished tradition of writers have used the form of a satirical dictionary to undermine the received ideas of their day. Voltaire wrote a sharply humorous \"Philosophical Dictionary,\" while Samuel Johnson's dictionary of the English language was derisive and opinionated. These early dictionaries and encyclopedias were really weapons in a struggle for the soul of civilization between forces of humanistic enlightenment and the forces of orthodoxy and dogmatism. Their authors attacked and exposed the half-truths of their day by showing that it was possible to think differently about the social and political arrangements that everyone took for granted.But as John Ralston Saul argues in this decidedly unorthodox book, modern dictionaries have once again been captured by the forces of orthodoxy—albeit this time a rationalist orthodoxy. Our language has become as predictable, fragmented, and rhetorical as it was in the 18th century, divided as it is by special interest groups into dialects of expertise that are hermetically sealed off and inaccessible to citizens. In The Doubter's Companion , a mar­velous subversive contribution to the great 18th century tradition of the humanist dictionary, Saul skewers and discredits the accepted content of common terms like Advertising, Academics, and Air Conditioning (defined as \"an efficient means for spreading disease in enclosed public spaces\"); Cannibal, Conservative, and Croissant; Dandruff, Death, and Dictionary (\"opinions presented as truth in alphabetical order\"); and several hundred others, including Biography (\"a respectable form of pornography\"), Museum (\"safe storage for stolen objects\"), and Manners (\"people are always splendid when they're dead\").There is much in this volume that will stimulate, offend, provoke, perplex, and entertain. But Saul deploys these tactics of guerilla lexicography to advance the more serious purpose of reclaiming public language from the stultifying dialects of modern expertise.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Politics",
    "History",
    "Economics",
    "Reference",
    "Sociology"
  ],
  "author": "John Ralston Saul",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/504113.The_Doubter_s_Companion"
}