{
  "title": "Between Barack and a Hard Place: Racism and White Denial in the Age of Obama",
  "description": "Race is, and always has been, an explosive issue in the United States. In this timely new book, Tim Wise explores how Barack Obama’s emergence as a political force is taking the race debate to new levels. According to Wise, for many white people, Obama’s rise signifies the end of racism as a pervasive social force; they point to Obama not only as a validation of the American ideology that anyone can make it if they work hard, but also as an example of how institutional barriers against people of color have all but vanished. But is this true? And does a reinforced white belief in color-blind meritocracy potentially make it harder to address ongoing institutional racism? After all, in housing, employment, the justice system, and education, the evidence is white privilege and discrimination against people of color are still operative and actively thwarting opportunities, despite the success of individuals like Obama. Is black success making it harder for whites to see the problem of racism, thereby further straining race relations, or will it challenge anti-black stereotypes to such an extent that racism will diminish and race relations improve? Will blacks in power continue to be seen as an “exception” in white eyes? Is Obama “acceptable” because he seems “different from most blacks,” who are still viewed too often as the dangerous and inferior “other”? \"From the Civil Rights struggle, to Dr. King's dream, to Barack Obama's election, Tim Wise provides us with an extremely important and timely analysis of the increasing complexity of race on the American political and social landscape. Between Barack and a Hard Racism and White Denial in the Age of Obama provides an insightful and much needed lens through which we can begin to navigate this current stage in our ongoing quest for a more inclusive definition of who we are as a nation. It's definitely a book for these times!\"—Danny Glover \"Tim Wise has looked behind the curtain. In Between Barack and a Hard Place he explores the real issues of race in the Obama campaign and incoming presidency, issues that the mainstream media has chosen to ignore. His book debunks any notion that the United States has entered a post-racial period; instead he identifies the problems that emerge in the context of the victory of a black presidential candidate who chose to run an essentially non-racial campaign. With this book, Wise hits the bull's eye.\"—Bill Fletcher \"Wise outlines … how racism and white privilege have morphed to fit the modern social landscape. In prose that reads like his lightening rod speeches, he draws from a long list of high-profile campaign examples to define what he calls 'Racism 2.0,' a more insidious form of racism that actually allows for and celebrates the achievements of individual people of color because they're seen as the exceptions, not the rules.\"—Jamilah King, Colorlines \"This book makes an intriguing argument and is packed with insight. Wise clearly explains the complexity of institutional racism in contemporary society. He continuously reminds the reader that Obama's victory may signal the entrenchment of a more complicated, subtle, and insidious form of racism. The jury is still out.\"—Jeff Torlina, Multicultural Review Tim Wise is among the most prominent antiracist writers and activists in the US and has appeared on ABC's 20/20 and MSNBC Live. His previous books include Speaking Treason Fluently and White Like Me .",
  "genres": [
    "Nonfiction",
    "Race",
    "Politics",
    "Anti Racist",
    "Social Justice",
    "Essays",
    "African American"
  ],
  "author": "Tim Wise",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/5043059-between-barack-and-a-hard-place"
}