{
  "title": "The Seventh Mansion",
  "description": "From the author of the story collections Heartbreaker and Rag comes a powerful and propulsive debut novel that examines activism, love, and purpose.When fifteen-year-old Xie moves from California to a rural Southern town to live with his father he makes just two friends, Jo and Leni, both budding environmental and animal activists. One night, the three friends decide to free captive mink from a local farm. But when Xie is the only one caught his small world gets smaller: kicked out of high school, he becomes increasingly connected with nature, spending his time in the birch woods behind his house, attending extremist activist meetings, and serving as a custodian for what others ignore, abuse, and discard.Exploring the woods alone one night, Xie discovers the relic of a Catholic saint - the martyred Pancratius - in a nearby church. Regal and dressed in ornate armor, the skeleton captivates him. After weeks of visits, Xie steals the skeleton, hides it in his attic bedroom, and develops a complex and passionate relationship with the bones and spirit of the saint, whom he calls P. As Xie's relationship deepens with P., so too does his relationship with the woods - private property that will soon be overrun with loggers. As Xie enacts a plan to save his beloved woods, he must also find a way to balance his conflicting - and increasingly extreme - ideals of purity, sacrifice, and responsibility in order to live in this world.Maryse Meijer's The Seventh Mansion is a deeply moving and profoundly original debut novel - both an urgent literary call to arms and an unforgettable coming-of-age story about finding love and selfhood in the face of mass extinction and environmental destruction.",
  "genres": [
    "Horror",
    "Fiction",
    "Young Adult",
    "Contemporary",
    "Fantasy",
    "LGBT",
    "Coming Of Age"
  ],
  "author": "Maryse Meijer",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/50403497-the-seventh-mansion"
}