{
  "title": "Wagnerism: Art and Politics in the Shadow of Music",
  "description": "Alex Ross, renowned New Yorker music critic and author of the international bestseller and Pulitzer Prize finalist The Rest Is Noise, reveals how Richard Wagner became the proving ground for modern art and politics--an aesthetic war zone where the Western world wrestled with its capacity for beauty and violence.For better or worse, Wagner is the most widely influential figure in the history of music. Around 1900, the phenomenon known as Wagnerism saturated European and American culture. Such colossal creations as The Ring of the Nibelung, Tristan und Isolde, and Parsifal were models of formal daring, mythmaking, erotic freedom, and mystical speculation. A mighty procession of artists, including Virginia Woolf, Thomas Mann, Paul Cézanne, Isadora Duncan, and Luis Buñuel, felt his impact. Anarchists, occultists, feminists, and gay-rights pioneers saw him as a kindred spirit. Then Adolf Hitler incorporated Wagner into the soundtrack of Nazi Germany, and the composer came to be defined by his ferocious antisemitism. For many, his name is now almost synonymous with artistic evil.In Wagnerism, Alex Ross restores the magnificent confusion of what it means to be a Wagnerian. A pandemonium of geniuses, madmen, charlatans, and prophets do battle over Wagner's many-sided legacy. As readers of his brilliant articles for The New Yorker have come to expect, Ross ranges thrillingly across artistic disciplines, from the architecture of Louis Sullivan to the novels of Philip K. Dick, from the Zionist writings of Theodor Herzl to the civil-rights essays of WEB Du Bois, from O Pioneers! to Apocalypse Now.In many ways, Wagnerism tells a tragic tale. An artist who might have rivaled Shakespeare in universal reach is undone by an ideology of hate. Still, his shadow lingers over twenty-first century culture, his mythic motifs coursing through superhero films and fantasy fiction. Neither apologia nor condemnation, Wagnerism is a work of passionate discovery, urging us toward a more honest idea of how art acts in the world.",
  "genres": [
    "Music",
    "History",
    "Nonfiction",
    "Art",
    "Politics",
    "Biography",
    "Germany"
  ],
  "author": "Alex  Ross",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/50403493-wagnerism"
}