{
  "title": "Field of Dishonor",
  "description": "HONOR BETRAYEDThe People's Republic of Haven's sneak attack on the Kingdom of Manticore has failed. The Peeps are in disarray, their leaders fighting for power in bloody revolution, and the Royal Manticoran Navy stands victorious.But Manticore has domestic problems of its own, and success can be more treacherous than defeat for Honor Harrington. Now, trapped at the core of a political crisis she never sought, betrayed by an old and vicious enemy she'd thought vanquished forever, she stands alone.She must fight for justice on a battlefield she never trained for in a private war that offers just two choices: death . . . or a ''victory'' that can end only in dishonor and the loss of all she loves.About David Weber and the Honor Harrington series: “. . .everything you could want in a heroine…. Excellent … plenty of action.”–Science Fiction Age “Brilliant! Brilliant! Brilliant!”–Anne McCaffrey “Compelling combat combined with engaging characters for a great space opera adventure.”–Locus“Weber combines realistic, engaging characters with intelligent technological projection . . . Fans of this venerable space opera will rejoice . . .”–Publishers WeeklyAbout Shadow of Freedom, #15 in the Honor Harrington series:“This entry is just as exciting as Weber’s initial offering. . . .The result is a fast-paced and action-packed story that follows [our characters] as they move from reaction to command of the situation. Weber builds Shadow of Freedom to an exciting and unexpected climax.”—Daily News of GalvestonAbout Mission of Honor, #13 in the Honor Harrington series: “Weber combines realistic, engaging characters with intelligent technological projection and a deep understanding of military bureaucracy in this long-awaited Honor Harrington novel … Fans of this venerable space opera will rejoice to see Honor back in action.”–Publishers Weekly “This latest Honor Harrington novel brings the saga to another crucial turning point … Readers may feel confident that they will be Honored many more times and enjoy it every time.”–Booklist Honor Harrington Main Series: On Basilisk StationThe Honor of the Queen The Short Victorious War\nField of Dishonor\nFlag in Exile Honor Among EnemiesIn Enemy Hands Echoes of Honor Ashes of Victory War of Honor The Shadow of Saganami At All Costs Storm from the Shadows Mission of Honor A Rising Thunder Shadow of Freedom",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Military Fiction",
    "Military Science Fiction",
    "Science Fiction Fantasy",
    "Space"
  ],
  "author": "David Weber",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/504369.Field_of_Dishonor"
}