{
  "title": "Missionaries",
  "description": "From the author of the National Book Award-winning short story collection Redeployment comes an astonishing novel of Conradian suspense, set in Colombia among other fronts of America's wars, as four lives become fatally entangled thanks to our country's gift for projecting its power into situations it half understands.Neither Mason, a U.S. Army Special Forces medic, nor Lisette, a foreign correspondent, has emerged from America's long post-9/11 wars in Iraq and Afghanistan unscathed. Yet war also exerts a terrible draw that neither can shake--the noble calling, the camaraderie, the life-and-death stakes. Where else in the world can such a person go? All roads lead to Colombia, where the US, with its patented fusion of intelligence dominance and quick-striking special operators, has partnered with local government to stamp out a vicious civil war and keep the predatory narco gangs at bay. Mason, now a liaison to the Colombian military, is ready for the good war, and Lisette is more than ready to cover it.For Juan Pablo, Mason's counterpart in the Colombian officer corps, translating reality into a language the Americans can understand requires a cartoonist's gift for caricature, but it's child's play next to the challenge of navigating the viper's nest of factions bidding for power, in the capital and far out in the field. And if Juan Pablo's view is dark, the outlook of Abel, a lieutenant in the militia Los Mil Jesuses, which controls territory in rural Norte de Santander, a region on the Venezuelan border where the writ of law scarcely runs, is positively Stygian. Abel has lost everything he loves in the carnage that for his entire life has flowed unceasingly in this region, where the lines between drug cartels, militias, and the state are semi-permeable. It is Abel's cruel fate to find safety only by serving a man he has come to fear and loathe.Missionaries is an astonishment, a novel of extraordinary suspense whose central, unsparing drama is infused by a geopolitical sophistication and a wisdom about the human heart that would be rare even in isolation. As Los Mil Jesuses make their move to fill a power vacuum in Norte de Santander, aided and abetted by the Colombian military for its own reasons, the Americans are made pawns of a game they don't even begin to understand. The result is an unfolding calamity that will leave no character unscathed, and will echo across the planet. A work whose accomplishment calls forth comparisons to Joseph Conrad, Graham Greene, and Robert Stone,  Missionaries ultimately stands apart as its own electrifying new form of artistic reckoning with the forces we have unleashed in our world.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "Politics",
    "Literary Fiction",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Phil Klay",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/50482979-missionaries"
}