{
  "title": "أنشودة المطر",
  "description": "عيناكِ غابتا نخيلٍ ساعةَ السحرأو شرفتانِ راحَ ينأى عنهُما القمر عيناكِ حين تبسمانِ تُورقُ الكروموترقصُ الأضواءُ.. كالأقمارِ في نهريرجُّهُ المجذافُ وَهْناً ساعةَ السحر... كأنّما تنبُضُ في غوريهما النجوم وتغرقان في ضبابٍ من أسىً شفيفكالبحرِ سرَّحَ اليدينِ فوقَهُ المساءدفءُ الشتاءِ فيه وارتعاشةُ الخريفوالموتُ والميلادُ والظلامُ والضياءفتستفيقُ ملء روحي، رعشةُ البكاءونشوةٌ وحشيةٌ تعانق السماءكنشوةِ الطفلِ إذا خاف من القمركأنَّ أقواسَ السحابِ تشربُ الغيوم.. وقطرةً فقطرةً تذوبُ في المطر...وكركرَ الأطفالُ في عرائش الكرومودغدغت صمتَ العصافيرِ على الشجرأنشودةُ المطرمطرمطرمطرتثاءبَ المساءُ والغيومُ ما تزالتسحّ ما تسحّ من دموعها الثقال:كأنّ طفلاً باتَ يهذي قبلَ أنْ ينام بأنّ أمّه - التي أفاقَ منذ عامفلم يجدْها، ثم حين لجَّ في السؤالقالوا له: \"بعد غدٍ تعود\" -لا بدّ أنْ تعودوإنْ تهامسَ الرفاقُ أنّها هناكفي جانبِ التلِ تنامُ نومةَ اللحود،تسفُّ من ترابها وتشربُ المطر كأنّ صياداً حزيناً يجمعُ الشباكويلعنُ المياهَ والقدروينثرُ الغناء حيث يأفلُ القمر مطر، مطر، المطرأتعلمين أيَّ حزنٍ يبعثُ المطر؟وكيف تنشجُ المزاريبُ إذا انهمر؟وكيف يشعرُ الوحيدُ فيه بالضياع؟بلا انتهاء_ كالدمِ المُراق، كالجياع كالحبّ كالأطفالِ كالموتى –هو المطر ومقلتاك بي تطيفان مع المطروعبرَ أمواجِ الخليجِ تمسحُ البروقسواحلَ العراقِبالنجومِ والمحار،كأنها تهمُّ بالشروقفيسحبُ الليلُ عليها من دمٍ دثار أصيحُ بالخيلج: \"يا خليجيا واهبَ اللؤلؤ والمحارِ والردى\"فيرجع الصدى كأنّهُ النشيج:\"يا خليج: يا واهب المحار والردى\"أكادُ أسمعُ العراقَ يذخرُ الرعودويخزنُ البروقَ في السهولِ والجبالحتى إذا ما فضّ عنها ختمَها الرجاللم تترك الرياحُ من ثمود في الوادِ من أثر أكادُ أسمعُ النخيلَ يشربُ المطروأسمعُ القرى تئنّ، والمهاجرينيصارعون بالمجاذيفِ وبالقلوع عواصفَ الخليجِ والرعود، منشدين مطر.. مطر .. مطروفي العراقِ جوعٌوينثرُ الغلال فيه موسم الحصادلتشبعَ الغربانُ والجرادوتطحن الشوان والحجررحىً تدورُ في الحقولِ… حولها بشرمطرمطرمطروكم ذرفنا ليلةَ الرحيل من دموعثم اعتللنا - خوفَ أن نُلامَ - بالمطرمطرمطرومنذ أن كنّا صغاراً، كانت السماءتغيمُ في الشتاءويهطلُ المطر وكلّ عامٍ - حين يعشبُ الثرى- نجوعما مرَّ عامٌ والعراقُ ليسَ فيه جوعمطرمطرمطرفي كلّ قطرةٍ من المطرحمراءُ أو صفراءُ من أجنّة الزهروكلّ دمعةٍ من الجياعِ والعراةوكلّ قطرةٍ تُراقُ من دمِ العبيدفهي ابتسامٌ في انتظارِ مبسمٍ جديدأو حلمةٌ تورّدتْ على فمِ الوليدفي عالمِ الغدِ الفتيّ واهبِ الحياةمطرمطرمطرسيعشبُ العراقُ بالمطر أصيحُ بالخليج: \"يا خليج..يا واهبَ اللؤلؤ والمحار والردى\" فيرجع الصدى كأنه النشيج:\"يا خليج: يا واهب المحار والردى\"وينثرُ الخليجُ من هباته الكثارعلى الرمال، رغوةَ الأجاج، والمحاروما تبقى من عظام بائس غريقمن المهاجرين ظل يشرب الردىمن لجة الخليج والقراروفي العراق ألف أفعى تشرب الرحيقمن زهرة يرُبّها الفرات بالندىوأسمعُ الصدىيرنّ في الخليج:مطرمطرمطرفي كل قطرةٍ من المطرحمراءُ أو صفراءُ من أجنةِ الزهروكلّ دمعةٍ من الجياعِ والعراةوكل قطرةٍ تُراق من دمِ العبيدفهي ابتسامٌ في انتظارِ مبسمٍ جديدأو حلمةٌ تورّدت على فمِ الوليدفي عالمِ الغدِ الفتي، واهبِ الحياة ويهطلُ المطرُ",
  "genres": [
    "Poetry",
    "Literature"
  ],
  "author": "بدر شاكر السياب",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/10264512"
}