{
  "title": "Radical Feminism: A Documentary Reader",
  "description": "A selection of essential writings to understand the radical feminism movement of the 1960s and 1970sThe second wave of feminism was one of the most significant political and cultural developments of the 1960s and 1970s. Yet the role radical feminism played within the women's movement remains hotly contested. For some, radical feminism has made a lasting contribution to our understanding of male privilege, and the ways the power imbalance between men and women affects the everyday fabric of women's lives. For others, radical feminism represents a reflexive hostility toward men, sex, and heterosexuality, and thus is best ignored or forgotten.Rather than have the movement be interpreted by others, Radical Feminism permits the original work of radical feminists to speak for itself. Comprised of pivotal documents written by U.S. radical feminists in the 1960s and 1970s, Radical Feminism combines both unpublished and previously published manifestos, position papers, minutes of meetings, and newsletters essential to an understanding of radical feminism. Consisting of documents unavailable to the general public, and others in danger of being lost altogether, this panoramic collection is organized around the key issues of sex and sexuality, race, children, lesbianism, separatism, and class. Barbara A. Crow rescues the groundbreaking original work of such groups as The Furies, Redstockings, Cell 16, and the Women's Liberation Movement. Contributors include Kate Millet, Susan Brownmiller, Shulamith Firestone, Rosalyn Baxandall, Toni Morrison, Ellen Willis, Anne Koett, and Vivan Gornick.Gathered for the first time in one volume, these primary sources of radical feminism fill a major gap in the literature on feminism and feminist thought. Radical Feminism is an indispensable resource for future generations of feminists, scholars, and activists.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "History",
    "Gender",
    "Womens",
    "Theory",
    "Gender and Sexuality"
  ],
  "author": "Barbara A. Crow",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/504492.Radical_Feminism"
}