{
  "title": "The Doctor Sebi Diet: The Complete Guide to a Plant-Based Diet with 77 Simple, Doctor Sebi Alkaline Recipes & Food List for Weight Loss, Liver Cleansing",
  "description": "Do you want to know how to improve overall health, remove phlegm and mucus, naturally prevent some diseases such as Herpes and Diabetes? Did you know all this can be done by sticking to just ONE diet ? You are in the RIGHT PLACE! BUY this book, find 77 simple RECIPES with PICTURES and Step-by-Step instructions, receive the shopping list of approved Doctor Sebi products on your email in PDF for FREE! This unique diet is called the Doctor Sebi Diet. It is an alkaline plant-based diet that consists of an approved Dr Sebi alkaline food list and a list of Doctor Sebi supplements. Doctor Sebi nutritional guide includes greens, vegetables, and other plants that are intended to create alkaline conditions in your body. According to honduras herbalist Doctor Sebi, this diet raises the alkalinity of your body. This, in turn, prevents the formation of mucus and makes it difficult for infection-causing organisms to survive. Furthermore, on this diet you will experience cell rejuvenation and the elimination of toxic substances from your blood and body. This will promote improved health and stronger resistance to illnesses. The Doctor Sebi Diet is not the easiest diet. However, it helps many people to feel better without taking pills. Please This book is available in 2 Paperback formats - Black and White and Full-color. • Full-color edition - Simply press “See all formats and versions” above the price. Press left from the “paperback” button; • Black and White version - is this one! Finally, you will find 77 easy Doctor Sebi recipes for soups, salads, main dishes, desserts, smoothies, sauces, snacks, and bread based on Doctor Sebi products list. If you buy our book with Doctor Sebi alkaline recipes, you will surprise yourself, your family, and your friends with new, delicious dishes. Well, that’s great, isn’t it? If you are still in doubt, check out some reviews on Doctor Sebi cookbook below. They will definitely dispel all your doubts! Don't click away. Scroll up, hit the “Buy” button and start your journey to a healthy lifestyle!",
  "genres": [],
  "author": "Olivia Shields",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/50455031-the-doctor-sebi-diet"
}