{
  "title": "Storytellers at the Columbia River",
  "description": "“A compelling cast... An intriguing novel about a little-known episode in American history... Includes some wonderfully evocative writing about how globally significant events can affect the lives of everyday people.” ​​​​​​​~ Steve Olson, author of \"The Apocalypse Factory: Plutonium and the Making of the Atomic Age\"Five newcomers arrive at the 1998 Settlers' Reunion at the mid-Columbia River: two anthropologists drawn by the storytelling, two on special missions from their elders, and a Siberian shaman intent on river healing. A Wanapum Indian bus driver angry over salmon losses takes them into the devastated area around the defunct Hanford atomic plant, the scene of the 1943 settler evictions. That view, and the growing threat of nuclear waste from the plant, spark new insights, friendships, and loves. Decades-old anger is swept into vows of action to save the salmon, the Columbia, and the world beyond.\"A rich and complicated story... powerful and important story--in reality many stories. . . told through the concerns of the novel’s characters. . .”~ Dr. Gerald W. McFarland, author of \"The Buenaventura Trilogy\" \t\tand \"A Scattered People: An American Family Moves West\"\"Mendenhall's 'Storytellers at the Columbia River' is a strong voice for the power and importance of place...through a series of carefully constructed interlocking stories that connect the Hanford Reach's different cultures, generations, and (involved) countries. The fate of the salmon is a thread that weaves its way through several of the stories. And in addition, it's a great read.\"~ Jim Lichatowich, \"Salmon, People, and Place: A Biologist's Search for Salmon Recovery\"\"Gripping...Tragic... (Mendenhall) is a wonderful writer (and) writes with much wit so there are also plenty of laughs in this book.\"~ Tim Wheeler, journalist and author of \"News from Rain Shadow Country\"",
  "genres": [
    "Fiction"
  ],
  "author": "Nancy Danielson Mendenhall",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/50518534-storytellers-at-the-columbia-river"
}