{
  "title": "Loathe at First Sight",
  "description": "ONE OF NPR'S BEST BOOKS OF THE YEAR!“Bursts with humor, heart, and great energy. I loved it! Park is a hilarious new voice in women’s fiction.”—Helen Hoang, author of The Kiss Quotient “[A] punchy adult debut set in the world of video game design. Park makes tough topics go down easy by couching them in wry humor and lighthearted romance, and her fierce, snarky heroine is irresistible. This smart rom-com is a winner.”—Publishers Weekly (starred review)In a debut perfect for fans of Jasmine Guillory and Sally Thorne, a junior video game producer finds herself getting closer and closer to the one person she hates most after a mass troll attack online almost ruins her life. Melody Joo is thrilled to land her dream job as a video game producer, but her new position comes with an insufferable CEO; sexist male coworkers; and an infuriating—yet distractingly handsome—intern, Nolan MacKenzie, aka “the guy who got hired because his uncle is the boss.”Just when Melody thinks she’s made the worst career move of her life, her luck changes. While joking with a friend, she creates a mobile game that has male strippers fighting for survival in a post-apocalyptic world. Suddenly Melody’s “joke” is her studio’s most high-profile project—and Melody’s running the show.When Nolan is assigned to Melody’s team, she’s sure he’ll be useless. But as they grow closer, she realizes he’s smart and attractive, which makes Melody want to forget he’s her intern. As their attraction deepens, she knows it’s time to pump the brakes, even with her Korean parents breathing down her neck to hurry up and find a man.With her project about to launch, Melody suddenly faces a slew of complications, including a devastating trolling scandal. Could the man she’s falling hard for help her play the game to win—in work and in love?",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Adult",
    "Contemporary Romance",
    "Audiobook"
  ],
  "author": "Suzanne Park",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/50516420-loathe-at-first-sight"
}