{
  "title": "The Lost Shtetl",
  "description": "A remarkable debut novel—written with the fearless imagination of Michael Chabon and the piercing humor of Gary Shteyngart—about a small Jewish village in the Polish forest that is so secluded no one knows it exists . . . until now.What if there was a town that history missed?For decades, the tiny Jewish shtetl of Kreskol existed in happy isolation, virtually untouched and unchanged. Spared by the Holocaust and the Cold War, its residents enjoyed remarkable peace. It missed out on cars, and electricity, and the internet, and indoor plumbing. But when a marriage dispute spins out of control, the whole town comes crashing into the twenty-first century.Pesha Lindauer, who has just suffered an ugly, acrimonious divorce, suddenly disappears. A day later, her husband goes after her, setting off a panic among the town elders. They send a woefully unprepared outcast named Yankel Lewinkopf out into the wider world to alert the Polish authorities. Venturing beyond the remote safety of Kreskol, Yankel is confronted by the beauty and the ravages of the modern-day outside world – and his reception is met with a confusing mix of disbelief, condescension, and unexpected kindness. When the truth eventually surfaces, his story and the existence of Kreskol make headlines nationwide. Returning Yankel to Kreskol, the Polish government plans to reintegrate the town that time forgot. Yet in doing so, the devious origins of its disappearance come to the light. And what has become of the mystery of Pesha and her former husband? Divided between those embracing change and those clinging to its old world ways, the people of Kreskol will have to find a way to come together . . .  or risk their village disappearing for good.",
  "genres": [
    "Fiction",
    "Jewish",
    "Historical Fiction",
    "Judaism",
    "Audiobook",
    "Literary Fiction",
    "Holocaust"
  ],
  "author": "Max Gross",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/50496905-the-lost-shtetl"
}