{
  "title": "A Taste of Sage",
  "description": "From talented new writer, Yaffa S. Santos, comes this unforgettable, heartwarming, and hilarious rom-com about chefs, cooking, love, and self-discovery that is a cross between The Hating Game and Sweetbitter.\nLumi Santana is a chef with the gift of synesthesia—she can perceive a person’s emotions just by tasting their cooking. Despite being raised by a single mother who taught her that dreams and true love were silly fairy tales, she decides to take a chance and puts her heart and savings into opening a fusion restaurant in Inwood, Manhattan. The restaurant offers a mix of the Dominican cuisine she grew up with and other world cuisines that have been a source of culinary inspiration to her. When Lumi’s eclectic venture fails, she is forced to take a position as a sous chef at a staid, traditional French restaurant in midtown owned by Julien Dax, a celebrated chef known for his acid tongue as well as his brilliant smile. Lumi and Julien don’t get along in the kitchen--to say Lumi is irritated by Julien’s smug attitude is an understatement, and she secretly vows never to taste his cooking. Little does she know that her resolve doesn’t stand a chance against Julien’s culinary prowess. As Julien produces one delectable dish after another, each one tempting Lumi with its overwhelming aromas and gorgeous presentations, she can no longer resist and samples one of his creations. She isn’t prepared for the feelings that follow as she’s overcome with intense emotions. She begins to crave his cooking throughout the day, which throws a curveball in her plan to save up enough money and move on as soon as possible. Plus, there’s also the matter of Esme, Julien’s receptionist who seems to always be near and watching. As the attraction between Lumi and Julien simmers, Lumi experiences a tragedy that not only complicates her professional plans, but her love life as well... Clever, witty, and romantic, A Taste of Sage is sure to delight and entertain readers until the very last page.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Audiobook",
    "Contemporary Romance",
    "Adult",
    "Food"
  ],
  "author": "Yaffa S. Santos",
  "average_rating": "2.97",
  "url": "https://www.goodreads.com/book/show/50512447-a-taste-of-sage"
}