{
  "title": "Bell Hammers: The True Folk Tale of Little Egypt",
  "description": "\"Schaubert recounts a mischievous man's eight decades in Illinois's Little Egypt region in his picaresque debut BELL HAMMERS. Remmy's life of constant schemes and a lifelong feud with the local oil drilling company proves consequential. This is a hoot.\"- Publisher's WeeklyPRANKS. OIL. PROTEST. JOKES BETWEEN NEWLYWEDS.AND ONE HILARIOUS SIEGE OF A MAJOR CORPORATION.Remmy grows up with Beth in Bellhammer, Illinois as oil and coal companies rob the land of everything that made it paradise. Under his Grandad, he learns how to properly prank his neighbors, friends, and foes. Beth tries to fix Remmy by taking him to church. Under his Daddy, Remmy starts the Bell Hammer Construction Company, which depends on contracts from Texarco Oil. And Beth argues with him about how to build a better business. Together, Remmy and Beth start to build a great neighborhood of \"merry men\" carpenters: a paradise of s’mores, porch furniture, newborn babies, and summer trips to Branson where their boys pop the tops off of the neighborhood’s two hundred soda bottles. Their witty banter builds a kind of castle among a growing nostalgia.Then one of Jim Johnstone’s faulty Texarco oil derricks falls down on their house and poisons their neighborhood's well.Poisoned wells escalate to torched dog houses. Torched dog houses escalate to stolen carpentry tools and cancelled contracts. Cancelled contracts escalate to eminent domain. Sick of the attacks from Texaco Oil on his neighborhood, Remmy assembles his merry men:\"We need the world's greatest prank. One grand glorious jest that'll bloody the nose of that tyrant. Besides, pranks and jokes don't got no consequences, right?\"",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Humor",
    "Historical",
    "Coming Of Age",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Lancelot Schaubert",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/50512356-bell-hammers"
}