{
  "title": "Beetlecreek",
  "description": "After several years of silence and seclusion in Beetlecreek’s black quarter, a carnival worker named Bill Trapp befriends Johnny Johnson, a Pittsburgh teenager living with relatives in Beetlecreek. Bill is white. Johnny is black. Both are searching for acceptance, something that will give meaning to their lives. Bill tries to find it through good will in the community. Johnny finds it in the Nightriders, a local gang. David Diggs, the boy’s dispirited uncle, aspires to be an artist but has to settle for sign painting. David and Johnny’s new friendship with Bill kindles hope that their lives will get better. David’s marriage has failed; his wife’s shallow faith serves as her outlet from racial and financial oppression. David’s unhappy routine is broken by Edith Johnson’s return to Beetlecreek, but this relationship will be no better than his loveless marriage. Bill’s attempts to unify black and white children with a community picnic is a disaster. A rumor scapegoats him as a child molester, and Beetlecreek is titillated by the imagined crimes.This novel portraying race relations in a remote West Virginia town has been termed an existential classic. “It would be hard,” said The New Yorker , “to give Mr. Demby too much praise for the skill with which he has maneuvered the relationships in this book.” During the 1960s Arna Bontemps wrote, “Demby’s troubled townsfolk of the West Virginia mining region foreshadow present dilemmas. The pressing and resisting social forces in this season of our discontent and the fatal paralysis of those of us unable or unwilling to act are clearly anticipated with the dependable second sight of a true artist.”First published in 1950, Beetlecreek stands as a moving condemnation of provincialism and fundamentalism. Both a critique of racial hypocrisy and a new direction for the African American novel, it occupies fresh territory that is neither the ghetto realism of Richard Wright nor the ironic modernism of Ralph Ellison. Even after fifty years, more or less, William Demby said in 1998, “It still seems to me that Beetlecreek is about the absence of symmetry in human affairs, the imperfectability of justice the tragic inevitability of mankind’s inhumanity to mankind.”",
  "genres": [
    "Fiction",
    "African American",
    "American Fiction",
    "Classics"
  ],
  "author": "William Demby",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/505027.Beetlecreek"
}