{
  "title": "Suspiros de limeña: Cuitas base 4",
  "description": "¡Qué ganas de morder la vida! ¡De hincar los dientes en la jugosa manzana de la existencia! Miré mi vida hacia atrás, y era como una llanura desierta, sin relieves, sin resaltes, sin esplendores, sin ninguna saliente que rompiera la monotonía del plano horizonte. Había sido un puro producto de mi educación. En mi casa, con el sargento de mi viejo y la sumisa de su mujer. En el colegio, con las monjas castradas mentalmente. No había tenido infancia, ni adolescencia. Literalmente había escapado de esa etapa de mi vida, casándome con una persona mayor, capaz de sustraerme de la tiranía paterna. Pero el amor estuvo ausente en esa relación, desde siempre.Cierto, había habido cosas bellas, recuerdos entrañables que una siempre añora. Por sobre todo estaban mis hijos, lo que más quiero en este mundo. Les había dado todo en mi vida, pero llega un momento en que tienes que pensar en ti, en tu felicidad. Por enésima vez estaba decidido. No más fantasías. Mañana me bajo el calzón. Milichine es una encantadora y empeñosa, pero atolondrada e inestable mujer. Por eso, al alcanzar la madurez, se mira en el espejo y se pregunta: ¿esa de ahí soy yo?, y lo que vio no le gustó. Crisis de la mediana edad, segunda adolescencia… Mil y una explicaciones rondarían su mente en adelante, la cosa es que desde ese momento su vida cambió. Hasta ahora ha sido abnegada hija, madre amorosa, fiel esposa y, sobre todo, ferviente católica. Un ejemplo a seguir para muchas.Rodolfo, su esposo, es un hombre mayor, al que ella ve —una vez pasada la ilusión inicial— como un necio, egoísta y agresivo, pero que le ha enseñado el valor de la unión familiar, que la familia está ante todo. También le hizo ver, que si no cambiaba de inmediato la actitud frente a su hija mayor; para cuando lo hiciera, quizás ella estaría ya demasiado lejos o talvez ya no estaría. Juntos manejan el Anuario, un modelo de negocio pionero en su época, pero que en tiempos de Internet está quedando desfasado. Mango es un buscavidas ambicioso y desubicado abogado, que reaparece en su vida, para proponerle montar un negocio que ella ve como la tabla de salvación en momentos en que el Anuario está naufragando. Lo que no le dijo, fue que el negocio no era la única cosa que pensaba montar.«Suspiros de limeña», tragicomedia erótico romántica en clave de risa, que debieras leer… antes que te pueda suceder.",
  "genres": [],
  "author": "Milichine Ickx",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/50497554-suspiros-de-lime-a"
}