{
  "title": "Visitors: An American Feminist in East Central Europe",
  "description": "A feminist organizer in East Central Europe after the fall of the Berlin Wall reveals the struggles of women fighting for their rights during the rise of the Right in EuropeVisitors tells the story of Ann Snitow’s adventures as a Western feminist helping to build a new, post-communist feminist movement in Eastern Central Europe. Snitow stumbles onto this fast-changing, chaotic scene by chance, but falls in love with the passionate feminists she meets in Poland, the former Czechoslovakia and Yugoslavia, Hungary and Romania. What kinds of feminism should they hope for?Visitors is a book about forging enduring relationships and creating formerly unimaginable institutions—a feminist school, the Network of East-West Women, women’s centers, gender studies programs. It is about unity amid fractiousness and perseverance through uncertainty, Snitow’s flickering lodestar. Visitors moves gracefully between vivid anecdote, political analysis, and unsparing introspection. It is richly peopled with “brilliant” comrades and vexing detractors alike, all described with respect and humor. Every sentence is imbued with the experience and insight of this sui generis feminist activist, writer, and pedagogue of 50 years. Most of all, Visitors is the story of friendship, the heart and sinew of the leaderless feminist movement.Reading like the best historical novel, it is intimate and worldly, resolutely unsentimental yet finally, even as the political skies darken, optimistic in the conviction that feminism can make life meaningful, fascinating, fun, pleasurable—and better for everyone, even as better is redefined again and again.-Ann Snitow was Professor Emerita of Literature and Gender Studies at Lang College, The New School. A longtime activist, Snitow cofounded The Network of East-West Women, No More Nice Girls, Feminist Anti-Censorship Taskforce, Take Back the Future, and New York Radical Feminists. She co-founded the women’s studies program at Rutgers University and gender studies programs at The New School, where she taught for three decades. Snitow’s best-known book is The Feminism of Uncertainty. Visitors is her sixth book.Susan Faludi is a Pulitzer-Prize-winning journalist and the author of the bestselling Backlash: The Undeclared War Against American Women, which won the National Book Critics Circle Award for Nonfiction, Stiffed: The Betrayal of the American Man, and The Terror Dream: Myth and Misogyny in an Insecure America. Her recent memoir, In the Darkroom, won the Kirkus Prize for nonfiction.",
  "genres": [
    "Feminism",
    "Nonfiction"
  ],
  "author": "Ann Snitow",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/50516970-visitors"
}