{
  "title": "Anti-Tech Revolution: Why and How",
  "description": "“There are many people today who see that modern society is heading toward disaster in one form or another, and who moreover recognize technology as the common thread linking the principal dangers that hang over us… The purpose of this book is to show people how to begin thinking in practical, grand-strategic terms about what must be done in order to get our society off the road to destruction that it is now on.” —from the PrefaceIn Anti-Tech Why and How , Kaczynski argues why the rational prediction and control of the development of society is impossible while expounding on the existence of a process fundamental to technological growth that inevitably leads to a universal process akin to biological natural selection operating autonomously on all dynamic systems and determining the long-term outcome of all significant social developments. Taking a highly logical, fact-based, and intellectually rigorous approach, Kaczynski seamlessly systematizes a vast breadth of knowledge and elegantly reconciles the social sciences with biology to illustrate how technological growth in and of itself necessarily leads to disastrous disruption of global biological systems. Together with this new understanding of social and biological change, and by way of an extensive examination of the dynamics of social movements, Kaczynski argues why there is only one route available to avoid the disaster that technological growth a revolution against technology and industrial society. Through critical and comprehensive analysis of the principles of social revolutions and by carefully developing an exacting theory of successful revolution, Kaczynski offers a practical, rational, and realistic guide for preventing the fast-approaching technology-induced catastrophe. This new second edition (2020) contains various updates and improvements over the first edition (2016), including two new appendices. Theodore John Kaczynski does not receive any remuneration for this book.",
  "genres": [
    "Philosophy",
    "Politics",
    "Nonfiction",
    "Technology",
    "Sociology",
    "History",
    "Science"
  ],
  "author": "Theodore John Kaczynski",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/50532267-anti-tech-revolution"
}