{
  "title": "Each of Us Killers",
  "description": "A Foreword INDIES 2020 Book of the Year Winner in the Short Stories category and a finalist in the Multicultural Adult Fiction category.These are stories woven at the intersection of labor and our emotional lives. Set in the American Midwest, England, and India (Mumbai, Ahmedabad, rural Gujarat) the stories in Each of Us Killers are about people trying to realize their dreams and aspirations through their professions. Whether they are chasing money, power, recognition, love, or simply trying to make a decent living, their hunger is as intense as any grand love affair. Straddling the fault lines of race, class, caste, gender, nationality, globalization, and more, they go against sociocultural norms despite challenges and indignities until singular moments of quiet devastation turn the worlds of these characters—auto-wallah, housemaid, street vendor, journalist, architect, baker, engineer, saree shop employee, professor, yoga instructor, bartender, and more—upside down.\"Challenging assumptions, confronting power, manipulating barriers whenever possible-even at grave personal cost-Bhatt's cast surprises, inspires, frightens, beguiles, but never disappoints.\" ~Shelf Awareness (starred review)Most anticipated debuts of 2020 at Electric Literature, Literary Hub, The Millions, Kirkus Reviews, Entropy Magazine, Debutiful, Ms. Magazine, Bustle. Best story collections of 2020 at Bustle and Largehearted Boy. Best collections of 2020 by Asian authors at Book Riot.\". . . rich debut . . . a powerful expression of the hunger for success on one's own terms.\" ~Publishers Weekly\". . . nuanced, clear-eyed tales of unvarnished humanity. [...] A formally diverse collection with exquisitely crafted stories about longing, striving, and learning what we can control.\" ~Kirkus Reviews\"With this powerful, complex work, Bhatt should be launched into a wider readership that is fully deserved, and the literary world should rejoice in discovering a bright new star.\" ~Dallas Morning News. . . you will feel that you have encountered this level of skill, craft, and complexity before in reading the masters of the short story genre--even while the author subverts what we so often encounter in the genre about notions of loss and lonely voices and who gets to tell their own stories.\" ~Texas Public Radio\". . . Bhatt peels back shells of self-awareness, revealing understandings of the often subtle distinctions of gender, race, and family expectations that define and confine them.\" ~The National Book Review\". . . Bhatt gets under the skin of her characters with an ease that is difficult to achieve when creating characters beyond the pale of capital and caste. [. . .] using lively, sculpted language that avoids the stilted, literary English often afflicting Indian English writing.\" ~The Hindu\". . . variety of literary techniques of plot, style, and voice--including the refreshing second-person singular and first-person plural--Bhatt's stories effortlessly straddle class, caste, gender, and race divides spanning the US, England, and India.\" ~Open The Magazine\"Taken together, [the stories] show Bhatt's wide range, both in theme and style, and her ability to inhabit characters who couldn't be more different from each other.\" ~New York Journal of Books\"Interspersing loss and longing, survival and success, in an array of memories, shades, moods, dreams [. . .] Bhatt packs in a powerful compilation, rich in prose and poetry . . .\" ~NRI Pulse\". . . brings a range of lived experience, experimentation, and stylistic variety, which announces a seasoned practitioner rather than a newcomer to fiction.\" ~India Currents\". . . a collection that is as important in the telling as in remembering the times we live in and the times to come.\" ~The Hindu Business Line\"Bhatt's deliberate expansion of established tropes about Indians and the Indian diaspora deserves special accolades.\" ~Leonard Prize 2020 Nominations, National Book Critics Circle\" . . . exploration of South Asian identity in the workplace through a wide lens instead of the traditional representations. . .\" ~Puerto del Sol\". . . characters who are bound to their work, either by choice or circumstance, as they attempt to thwart societal expectations and break down barriers . . .\" ~Phoebe Journal\". . . as compulsively readable as it is sharp and as enjoyable as it is thought-provoking [. . .] an accomplished and impressive debut.\" ~Vagabond City\"[. . .] interact with multiple voices, listening to the struggles of various characters, and enjoying cultural details through the incredible use of language and literary techniques [. . .] the entire collection is an enlightening voyage.\" ~Platform Magazine\"Jenny Bhatt's gorgeous stories in Each of Us Killers remind me why I love to read a good book. It is such a pleasure to be immersed in the worlds of her characters, in their hunger for love or money, and in their local and global struggles to live. With mouth-watering detail, Bhatt serves up a rich and varied feast.\" ~Devi S. Laskar, Author of The Atlas of Reds and Blues\"The potent stories in this collection evoke the complexities of a shifting, multilingual world with great precision. Bhatt moves between countries and realities with tremendous skill and insight.\" ~Idra Novey, author of Those Who Knew\"In a series of thrilling, beautiful stories, Jenny Bhatt moves through the moods, thoughts, subversions involved in the experience of interracial relationships, East-West communications, theft, justice, migration. The collection works brilliantly both as an evocative amalgam of insightful observations about race, class, gender, aspirations, as well as on the sentence level. Bhatt writes, \"polish it carefully, till it glitters with the hope of a false diamond and refracts your stark life into a spectrum of luminous rays, lighting up the darkness briefly\"-referring to a character's particular memory, but could just as well be referring to the collection as a whole.\" ~Chaya Bhuvaneswar, Author of White Dancing Elephants\"In Each of Us Killers, Jenny Bhatt excavates her characters with incisiveness, nuance, and complexity. The cast of vibrant characters in this wonderful collection is absolutely unique and memorable.\" ~Karen E. Bender, author of The New Order\"This is a gorgeous collection. Bhatt weaves together, with the lightest touch, profound themes--work, ambition, displacement, class, and gender, and so much more. Her plots are beautifully rendered and her scope vast; her characters and her settings come to life on the page. These stories are full of bitter heartbreak with a measure of joy--a wonderful collection from a hugely talented writer.\" ~Lydia Kiesling, author of The Golden State\"Sex, death, redemption, betrayal--this collection has it all, from the sordid to the divine. Bhatt's vivid imagination and well-voiced characters will take you on a ride you won't soon forget.\" ~Mathangi Subramanian, author of A People's History of Heaven\"These stories are filled with wisdom and compassion, bristling with dark occurrences and gleaming with quiet moments of joy: an enriching collection.\" ~Mahesh Rao, author of Polite Society\"Moving, haunting stories that explore a wide range of complex social inequities and yet share an undercurrent of a deep and very human kind of longing.\" ~Aatif Rashid, author of Portrait of Sebastian Khan\"Each of Us Killers offers up a complex portrait of our times. From caste-based violence to domestic power play, from yoga to the under-seam of real-estate development, Bhatt uses a dozen devices to examine the lives of people around us, the choices that define them and, ultimately, our selves.\" ~Annie Zaidi, author of Unbound, 2000 Years of Indian Women's Writing\"Ambitious, sensitive, this collection locates some essential Indian truths, especially its hidden violence.\" ~Prayaag Akbar, author of Leila",
  "genres": [
    "Short Stories",
    "Fiction",
    "India",
    "Literary Fiction",
    "Contemporary",
    "Adult",
    "Indian Literature"
  ],
  "author": "Jenny Bhatt",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/50534874-each-of-us-killers"
}