{
  "title": "Love According to Science",
  "description": "Alternative Cover Edition for ASIN B0841FYJ8NFor psychology researcher Hazel Kiegen, science is everything. Her decision to swear off dating? Totally backed by her own calculations. Just don’t ask about her missing orgasms. She hasn’t been able to science her way out of that little conundrum. But her biggest problem? Corban Nash. He’s frustrating. Infuriating. And deliciously adorable, but that’s neither here nor there. He claims to have cracked the code to falling in love, and Hazel is determined to prove him wrong. Corban Nash created the theory of accelerated intimacy after numerous successful tests on his friends and family. Every couple who used his questionnaire fell in love, until Corban found himself the last single guy in his social circle, and a groomsman in dozens of weddings. The only problem is, it’s never worked on him. And science hasn’t explained why.  Despite being the lone aberrant data point, Corban believes in his research, and with his new job, he’ll have the resources to prove it. Verifying his theory right under the nose of his nemesis, Hazel Kiegen? Even better. There isn’t a theory in existence that will make Hazel fall in love with Corban. Not even with his sexy half-smile and temptingly muscular body. But from the moment these two rivals meet, sparks fly. And when they put his questionnaire to the test, the results aren’t what either of them expect.  Author’s note: Stand-alone romcom featuring a hot nerdy hero in hate-lust with his sworn enemy. A heroine with book smarts and a fluffy cat named Erwin. So much awkwardness and geeky banter. Super hot hate sex. Badass lady friendships with a widening circle of trust. And an HEA that will leave you swooning with happiness and your heart exploding with glitter.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Contemporary",
    "Workplace Romance",
    "Adult",
    "Chick Lit"
  ],
  "author": "Claire Kingsley",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/50541991-love-according-to-science"
}