{
  "title": "Cursed Objects: Strange but True Stories of the World's Most Infamous Items",
  "description": "An illustrated compendium that reveals the true stories behind the most infamous, creepy, and bizarre real-life cursed objects throughout history. Spanning decades and continents, subjects range from the opulent Hope Diamond to the humble Busby Stoop chair.They're lurking in museums, graveyards, and private homes around the world. Their stories have inspired countless horror movies, reality TV shows, campfire tales, books, and even chain emails. They're cursed objects, and in order to unleash a wave of misfortune, all they need...is you. As a culture, we can't seem to get enough of cursed objects. But never before have the true stories of these infamous real-life items been compiled into a fascinating and chilling volume.Entries include: • Annabelle the Doll, a Raggedy Ann doll which inspired the acclaimed horror franchise The Conjuring • The Tomb of Tutankhamen, the discovery of which kicked-started media hysteria over a rumored \"Curse of the Pharaohs\" • The Ring of Silvianus, a Roman artifact believed to have inspired J. R. R. Tolkien's The Hobbit • The Hope Diamond, which was owned by kings and inspired the Heart of the Ocean in James Cameron's Titanic • The Dybbuk Box, which was sold on eBay and inspired the horror film The PossessionWhether you believe in curses or not, the often tragic and always bizarre stories behind these objects will fascinate you. Many of them have intersected with some of the most notable events and people in history. But beyond Hollywood and beyond the hysteria, author J. W. Ocker suggests that cursed objects are simply objects which have been witness to great human tragedy, and thereafter operate as mechanisms for remembering and retelling those stories. Cursed Objects will be equally appealing to true believers as well as history buffs, horror fans, and anyone who loves a good spine-tingling tale.",
  "genres": [
    "Nonfiction",
    "History",
    "Horror",
    "Paranormal",
    "Audiobook",
    "Supernatural",
    "Adult"
  ],
  "author": "J.W. Ocker",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/50526540-cursed-objects"
}