{
  "title": "How to Raise Confident Multicultural Children",
  "description": "This guide features expert advice from Dr. Ute Limacher-Riebold, Dr. Brigitte Vittrup, Brian Vassallo, Vivian Chiona, Rita Rosenback, Dr. Mary-Pat O’Malley-Keighran, Beth Hall, Dr. Gina Miranda Samuels, Tamara Yousry, Lisa Ferland, plus an inspiring chapter by a TCK, Yui Mikuriya.The wish of all contributors is that everyone interested in topics related to multilingualism, multiculturalism, identity, diversity, expat/immigrant/multi-mobile life gets to read this book. Thus, an Ebook version which includes many links plus two extra chapters, can be downloaded for FREE in a PDF format at www.maltamum.com. Book chapters:1.\tInventing identities for our multicultural children by Elisavet Arkolaki 2.\tThe debate over multiculturalism and what we can learn from the Canadian model by Elisavet Arkolaki 3.\tMy identity crisis growing up in numerous cultures by Yui Mikuriya 4.\tWhy urging our children to embrace different cultures and learn different languages matters by Dr. Ute Limacher-Riebold 5.\tThe 5 most common challenges a parent faces while raising a multicultural kid and how to address them by Vivian Chiona, Dr. Brigitte Vittrup, Elisavet Arkolaki 6.\t5 mistakes parents make when trying to raise bilingual children by Rita Rosenback 7.\tLanguage delays in multilingual children: what are they and what to do about them by Dr. Mary-Pat O’Malley-Keighran8.\tRaising multilingual children with additional needs abroad by Dr. Ute Limacher-Riebold 9.\tConfident moms raise confident kids - On finding your tribe abroad by Lisa Ferland10.\tMedia influences on children by Dr. Brigitte Vittrup 11.\tThe impact of culture on the education of the young by Brian Vassallo 12.\tPromoting tolerance, practical tips - What we should do to enhance religious tolerance at home (parents) and at school (teachers) by Brian Vassallo 13.\tDealing with racism - perspective of a white transracial adoptive parent by Beth Hall (only available in the eBook edition) 14.\tNot just “white parents” with kids of color” - The importance of racial identity work for parents by Dr. Gina Miranda Samuels (only available in the eBook edition) 15.\tCrossing the Deep Cultural Divide by Tamara Yousry 16.\tThe stories you should tell your multicultural kid every day by Elisavet Arkolaki 17.\tA list of websites and blogs about multilingualism & multiculturalism",
  "genres": [
    "Parenting"
  ],
  "author": "Elisavet Arkolaki",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/50529973-how-to-raise-confident-multicultural-children"
}