{
  "title": "Trak",
  "description": "It seemed like a straightforward agreement: become a mistress to a gorgeous, alien Virilian male until an offspring is produced, then go home with five million dollars.  Desperate for money to continue her brother’s expensive medical treatment, Anna Baker signs the contract to enter herself in the running to produce an heir for one of these alien males. It doesn’t sound so bad, and hey, she’s always wanted to travel. To Anna’s surprise, she is chosen out of hundreds of qualifying women, but she doesn’t expect to be tossed in a transport ship, shuttled to a disreputable space station on the other side of the galaxy, and dropped off in a stranger’s bedroom. Her match is swaggering scoundrel Trak Letu, Prince of the Virilian fleet Exir, who turns out to be as infuriating as he is sexy. All she has to do is have his child and she can go home a rich woman, but the easier time passes with Trak, the harder it is to imagine leaving him, or the child he is desperate for.  Prince Trak’s people are heading for extinction, and honestly, mail-ordering a female from a distant planet isn’t his ideal way of meeting the mother of his future child. He’s willing to do whatever it takes to ensure his species’ survival, but the female chosen for him isn’t just beautiful, she’s opinionated, intelligent, and more passionate than he could have imagined. As time passes, he begins to dread the day Anna does have his baby, for he does not look forward to sending her back to Earth. However, Trak isn’t the only alien who desires her. When a trade deal goes badly and Anna, herself, becomes the currency, Trak must navigate a deadly path that unveils a frightening and dangerous face that all Virilian males strive to keep hidden. Even if he saves her, he could still lose her.  This story can be read alone with no cliffhangers and no cheating. I write what I love to read, so there is always consent and always a happy ending.",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Novella"
  ],
  "author": "Ella Blake",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/50528967-trak"
}