{
  "title": "The Enigma Cube",
  "description": "To secure a dazzling future they must travel to a perilous past. A riveting science-fiction thriller from the three-million copy NY Times bestselling author.\"Richards is an extraordinary writer,\" (Dean Koontz) who can \"keep you turning the pages all night long.\" (Douglas Preston)An alien object with breathtaking capabilities. And a life-and-death struggle for the future of humanity.Dr. Kelly Connolly is part of a top-secret team studying the most important find in human history, the Enigma Cube, an alien artifact of incomprehensible power. A cube whose technology can catapult civilization to dizzying heights--or destroy it entirely.After years of failed attempts to unlock the cube's secrets, all hell suddenly breaks loose. Kelly and a black-ops commando, Justin Boyd, are soon fighting against all odds to stay alive, and to keep the cube out of enemy hands.As the situation quickly goes from bad to worse, Kelly discovers that the cube is far more dangerous than even she had imagined. And that her actions could lead to nightmarish changes to the nature of reality itself.The Enigma Cube is a masterful thriller. One crammed with breakneck action, unexpected twists, mind-blowing science, and ethical dilemmas readers will be contemplating long after they've read the last page.\"Richards is a worthy successor to Michael Crichton.\" (SF Book dot com)NEAR-FUTURE SCIENCE FICTION THRILLERS BY DOUGLAS E. RICHARDS   STANDALONES  QUANTUM LENSGAME CHANGERINFINITY BORNSEEKERVERACITYORACLESERIES    WIRED (Wired 1)AMPED (Wired 2)MIND'S EYE (Nick Hall 1)BRAINWEB (Nick Hall 2)MIND WAR (Nick Hall 3)SPLIT SECOND(Split Second 1)TIME FRAME (Split Second 2)THE ENIGMA CUBE (Alien Artifact 1)A PIVOT IN TIME (Alien Artifact 2)Kids Science Fiction Thrillers (9 and up, enjoyed by kids and adults alike)TRAPPED (Prometheus Project 1)CAPTURED (Prometheus Project 2)STRANDED (Prometheus Project 3)OUT OF THIS WORLDDEVIL'S SWORD",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Thriller",
    "Time Travel",
    "Audiobook",
    "Mystery",
    "Fantasy"
  ],
  "author": "Douglas E. Richards",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/50535129-the-enigma-cube"
}