{
  "title": "Some Wallflowers Do",
  "description": "Some wallflowers do…And some rogues will…  Seven heartfelt tales of willful wallflowers and the rogues they tame.The Wallflower Way by Sue London:Rachel Flowers doesn’t care to marry, preferring that her younger sisters be the focus of their mother’s matchmaking tendencies. A chance encounter with new earl Gabriel Whitestone changes her destiny. Will the bachelor-minded Gabriel and committed spinster Rachel be able to admit their growing love?Eternally My Duke by Dawn Brower:Lady Delilah Everly and Marrok, Duke of Wolfton are an unlikely pair. Through a fate neither could have imagined they cross paths. They learn to lean on each other and along the way they discover the possibility of an eternal love, but only if they're willing to take a leap of faith and accept each other faults and all.A Wallflower's Folly by Amanda Mariel:Lady Olivia Montague's betrothed has ignored her and their contract for years. In the meantime, she has decided to remain unwed, embracing the life of a spinster. The last thing she expects is for her betrothed to come storming back into her life.Captivated by the Wallflower by Aileen Fish:Viscount Knightwick’s scheme to turn his friend’s daughter, Lady Susan, into a Diamond of the Season goes horribly awry when his conscience becomes involved. Thank goodness his heart is safe from falling for the stubborn bluestocking who fights his every move, because he could never love such a willfull, headstrong woman.Romancing a Wallflower by Anna St.ClaireA tragic riding accident leaves Lilian DeLacey unable to walk and restricts her life to books and quiet activities, a life she is resigned to live until she meets John Andrews, the Earl of Harlow. Their chance encounter blossoms into romance, igniting a yearning for a future. An undercover commission for the Crown takes him into the heart of a dangerous smuggling operation on the Cornwall coast, and unseen dangers threaten his life and Lilian’s. Will trust and love be enough to save them and heal the scars that threaten their future?The Spinster’s Alluring Season by Tabetha Waite:Lady Rowena has been invited to the lavish house party of the newly minted baronet, Sir Pierce. He’s mysterious and intriguing, having served the Crown as an English spy, but his only purpose has been to win a certain lady’s affections. When the truth of his past comes to light, will the lady choose society’s approval, or the man who has stolen her heart?The Disappearance of Lady Edith by Christina McKnight:One tragic night changed sensible, proper Lady Edith Pelton’s life: when her best friend fell to her death, pushed down a flight of stairs by a nefarious lord. Now, Edith dedicates her time watching the man she thinks is responsible, while gathering other information to expose other scoundrels posing as gentlemen of honor about London. But when her spying is noticed by a perfect stranger, Edith finds herself with two mysteries—what happened to her friend, and how to win the heart of a brilliantly handsome lord.",
  "genres": [],
  "author": "Sue London",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/50580819-some-wallflowers-do"
}