{
  "title": "A Match Made for Murder",
  "description": "Winner of the 2021 Bony Blithe Light Mystery Award“An intriguing mix of character, plot, time, and place. Highly recommended.” —Ian Hamilton, author of the bestselling Ava Lee novelsLane and Darling's Arizona honeymoon is interrupted by gunshots in the newest instalment in a series Kirkus Reviews calls \"relentlessly exciting.\"It’s November, and Lane and Darling have escaped the chilly autumn in the Kootenays for a honeymoon at the posh and romantic Santa Cruz Inn in sunny Tucson, Arizona. But despite her very best intentions to relax, soon after their arrival Lane’s plans to spend the holiday poolside with a good mystery are interrupted by gunfire. One of the hotel’s wealthy guests has been shot point blank and Lane is second on the scene.Though Lane and Darling attempt to distance themselves from the investigation, the longer they stay at the Santa Cruz Inn, the deeper they are drawn into a web of suspects and bystanders, and a collection of seemingly perfect marriages fraught with jealousy and violence. The situation threatens first their honeymoon and then their lives when Lane puts herself directly in the sights of local criminals who will stop at nothing to get what they want.Back in Nelson, Sergeant Ames has been left in charge of the department during Darling’s absence. As he investigates a case of vandalism at the Van Eyck garage, it seems to lead directly to the death of the suspected vandal himself. Working with Constable Terrell, the new recruit, to piece together what happened in this strange and unsettling murder, Ames finds his romantic interest in mechanic Tina Van Eyck creates complications that are more than awkward; they could be deadly.Fans of Maisie Dobbs and the Kopp sisters will delight in the latest Lane Winslow, a study of matrimony and mirage in the American Southwest.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Canada",
    "Historical Mystery",
    "Audiobook",
    "Historical"
  ],
  "author": "Iona Whishaw",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/50550968-a-match-made-for-murder"
}