{
  "title": "Secrets & Lies",
  "description": "\"Secrets & Lies\" “Sometimes a need for keeping secrets… Can be just as intriguing as a reason for telling lies… “Secrets & Lies” is a provocative, uncensored, character-driven, emotional journey into the private lives of four central characters in a small Texas town. At the heart of the story is a beautiful transgender woman who questions her personal worth as she fights to keep the life and love she has always wanted. Even the elements of true confessions get lost in translation as the details of who these people really are brings them together in a surprising, yet necessary finale that will change their lives forever. -------------- Kennedy “Kenny” Jordan (28, tall, dark hair, blue eyes) is an all American jock turned bank executive with a difficult past and a challenging future that keeps him in the balance between having what he wants versus what others expect of him. The truth for him is a secret but for the most part his secrets are built on lies. Camilla Vargas (25, pretty, petite) is a smart, ambitious, yet slightly naïve, young Latin woman with big dreams of success that she plans to obtain by any means possible. But in her effort to have it all, a major slip in judgment has her standing at the crossroads facing a difficult decision that she never considered to ever have to make. Ulanda Jefferson (25) is a hip, sexy, outspoken Black American fashionista with a fiery attitude. Armored with sharp-wit and an uncensored tongue, she is more than just a force to be reckoned with. Bren Searcy (38) is a grown-up lost in transition, (literally from male to female). There is almost nothing she wouldn’t bear to hang onto the love and happiness she has finally found, but an unexpected truth could bring her whole world tumbling down.",
  "genres": [
    "Romance",
    "Fiction",
    "Relationships"
  ],
  "author": "Tracy James Jones",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/12521093-secrets-lies"
}