{
  "title": "Autumn in the Heavenly Kingdom: China, the West, and the Epic Story of the Taiping Civil War",
  "description": "A gripping account of China’s nineteenth-century Taiping Rebellion, one of the largest civil wars in history. Autumn in the Heavenly Kingdom brims with unforgettable characters and vivid re-creations of massive and often gruesome battles—a sweeping yet intimate portrait of the conflict that shaped the fate of modern China.   The story begins in the early 1850s, the waning years of the Qing dynasty, when word spread of a major revolution brewing in the provinces, led by a failed civil servant who claimed to be the son of God and brother of Jesus. The Taiping rebels drew their power from the poor and the disenfranchised, unleashing the ethnic rage of millions of Chinese against their Manchu rulers. This homegrown movement seemed all but unstoppable until Britain and the United States stepped in and threw their support behind the Manchus: after years of massive carnage, all opposition to Qing rule was effectively snuffed out for generations. Stephen R. Platt recounts these events in spellbinding detail, building his story on two fascinating characters with opposing visions for China’s future: the conservative Confucian scholar Zeng Guofan, an accidental general who emerged as the most influential military strategist in China’s modern history; and Hong Rengan, a brilliant Taiping leader whose grand vision of building a modern, industrial, and pro-Western Chinese state ended in tragic failure.    This is an essential and enthralling history of the rise and fall of the movement that, a century and a half ago, might have launched China on an entirely different path into the modern world.",
  "genres": [
    "History",
    "China",
    "Nonfiction",
    "Asia",
    "War",
    "19th Century",
    "World History"
  ],
  "author": "Stephen R. Platt",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/12520340-autumn-in-the-heavenly-kingdom"
}