{
  "title": "How to Write a Dick: A Guide for Writing Fictional Sleuths from a Couple of Real-Life Sleuths",
  "description": "The private eye genre has come a long way, baby, with new subgenres – from teenage PIs to vampire gumshoes to geriatric sleuths – attracting new readers every year. Although it can be safely said that all fictional sleuths, or private dicks, such as Edgar Allan Poe’s C. Auguste Dupin and Sara Paretsky’s V.I. Warshawski, are thinking machines, depending on their powers of observation, analysis and curiosity, the 21st century has opened up a brave new world of investigative technology, tools and Internet resources that would have made Sherlock Holmes weep with joy.Unfortunately, most writers are not aware of the state-of-the-art developments that shape today’s professional private investigator, which sometimes leave writers floundering with impossible and antiquated devices, characters and methods in stories. Which is why we wrote How to Write a Dick: A Guide for Writing Fictional Sleuths from a Couple of Real-Life Sleuths, whose material we culled from our working a combined 14 years as private investigators (and for one of us, several decades hiring and managing private investigators). As a team, we have taught online classes and presented workshops at writers’ conferences about writing private investigators, and we write the blog Guns, Gams, and Gumshoes on a wide variety of investigative techniques and tools. How to Write a Dick isn’t about how to write a novel, but what you need to know to write an authentic, compelling 21st-century sleuth character or story.Writers, readers, researchers, investigators and publishing professionals can use How to Write a Dick as an aid for:•\tWriting stories/characters in the PI, mystery, suspense and thriller genres•\tUnderstanding the real-world of PIs and their fictional counterparts•\tUsing the book as a reference resource for writing articles and other research •\tResearching the techniques, tools and legalities used by your favorite private eyes in film, books and other media“Forget Google and Bing. When you need to research PI work, go to the experts, Colleen Collins and Shaun Kaufman: they live it, they teach it, they write it. How to Write a Dick is the best work of its kind I’ve ever come across because it covers the whole spectrum in an entertaining style that will appeal to layman and lawmen alike. This will be the industry standard for years to come.”- Reed Farrel Coleman, three-time Shamus Award winner for Best PI Novel of the Year and author of Hurt Machine“If you want authenticity in creating a fictional private investigator for your stories, then this is a must-have reference book. Its authors, Colleen and Shaun, are living breathing PIs with years of actual experience in the PI game.”- R.T. Lawton, 25 years on the street as a federal special agent and author of 4 series in Alfred Hitchcock Mystery Magazine.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Colleen Collins",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/12521800-how-to-write-a-dick"
}