{
  "title": "Red Line: The Unraveling of Syria and America's Race to Destroy the Most Dangerous Arsenal in the World",
  "description": "From the Pulitzer Prize–winning author of Black Flags comes the thrilling unknown story of America’s mission in to find and destroy Syria’s chemical weapons and keep them out of the hands of the Islamic State In August 2012, Syrian president Bashar al-Assad was clinging to power in a vicious civil war. When secret intelligence revealed that the dictator might resort to using chemical weapons, President Obama warned that doing so would cross “a red line.” Assad did it anyway, bombing the Damascus suburb of Ghouta with sarin gas, killing hundreds of civilians and forcing Obama to decide if he would mire America in another unpopular Middle Eastern war. When Russia offered to broker the removal of Syria’s chemical weapons, Obama leapt at the out.So begins an electrifying race to find, remove, and destroy 1,300 tons of chemical weapons in the midst of a raging civil war. The extraordinary little-known effort is a triumph for the Americans, but soon Russia’s long game becomes it will do anything to preserve Assad’s rule. As America’s ability to control events in Syria shrinks, the White House learns that ISIS, building its caliphate in Syria’s war-tossed territory, is seeking chemical weapons for itself, with an eye to attacking the West.Red Line is a classic Joby Warrick true-life a character-driven narrative with a cast of heroes and villains, including weapons hunters, politicians, doctors, diplomats, and spies. Drawing on astonishing original reporting, Warrick reveals how the United States embarked on a bold adventure to prevent one catastrophe but could not avoid a tragic chain of events that empowered America’s enemies.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Terrorism",
    "War",
    "Military Fiction",
    "International Relations"
  ],
  "author": "Joby Warrick",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/50607776-red-line"
}