{
  "title": "The Negro in All Ages",
  "description": "\"Turner was fighting against racialist can---scientific as well as political...would go on to address ethnology and evolution yet again when he gave his lecture 'The Negro in All Ages.'\" - Elizabeth Cady Stanton, Feminist as Thinker (2007)\"His lecture 'The Negro in All Ages' was a product of immersion in the works of the biologists and anthropologists of his time.\" - Bishop Henry McNeal Turner and African-American Religion in the South (1992)\"Turner...opposed evolution on grounds of the uniqueness and permanence of human species and incompatibility between evolution and the Bible's sacred character.\" - The Mount of African American Prophetic Tradition (2012)Noting that \"the forces of error have been marshaled against the most palpable teachings of nature, as ferociously as against the simple revelations of Holy Writ,\" African-American Bishop Henry McNeal Turner set out to dispel racist notions prevalent among 19th century adherents to the theory of evolution.In 1873, Turner would publish one of his popular sermons in defense of the Black race as a short 39-page book titled \"The Negro in All Ages.\"For those who had the opportunity to hear Turner's sermon in person, it would leave a lasting impression. In his book \"From Slavery to the Bishopric in the A.M.E. Church,\" Bishop William Henry Heard \"For the first time I heard Bishop H. M. Turner speak. He spoke on 'The Negro in All Ages.' He spoke for two hours. I was so impressed with the pictures and historic facts he presented of the Race in the past ages, and of the men of the present, that my life is largely what it is because of the impressions made at this meeting.\"About the Henry McNeal Turner (1834–1915) was a minister, politician, and the 12th elected and consecrated bishop of the African Methodist Episcopal Church (AME). An African American, he was a pioneer in Georgia at organizing new congregations of African Americans after the American Civil War. Born free in South Carolina, Turner learned to read and write and became a Methodist preacher. He joined the AME Church in St. Louis, Missouri, in 1858, where he became a minister. Later he had pastorates in Baltimore, Maryland, and Washington, D.C.Other books by the author • The African as a Tradesman and Mechanic• The Civil and Political status of the State of Georgia and Her Relations to the General Government• Fifteenth Amendment; a speech on the benefits accruing from the ratification of the fifteenth amendment and its incorporation into the United States constitution• The genius and theory of Methodist polity• Introduction to Men of Eminent, Progressive and Rising• Only for the bishops' eyes.• Respect Black• A speech on the present duties and future destiny of the negro race",
  "genres": [],
  "author": "Henry McNeal Turner",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/50622830-the-negro-in-all-ages"
}