{
  "title": "Dare to Tease",
  "description": "New York Times and USA Today bestselling author Carly Phillips returns to her sexy Dare world of rich billionaire sports heroes in her new DARE NATION SERIES!She handles cocky jocks for a living, but her love life isn’t as successful.Brianne Prescott, publicist for Dare Nation Sports Agency, grew up the only girl with four brothers, three of whom are sports royalty. She’s a pro not just at work but at being used by men who want access to her famous family. She’s learned the hard way that everyone wants something from her, always.He’s her brother’s best friend and the first man who sees her for who she really is.When Dr. Hudson Northfield rescues Bri from a homeless man outside the clinic where he works, he really notices her for the first time. Soon she’s accompanying him to New York for a family wedding, and despite her siblings’ overprotective protests, they’re falling in love.But Hudson has a secret he can’t reveal. If he wants access to a trust fund in his name, his father demands something in return. Hudson has to marry and provide an heir or his dream of opening a state-of-the-art health center will be destroyed. Suddenly the man who didn’t need anything from her appears to be the biggest user of them all. Unless Hudson can convince her he can live without money but he can’t live without her.**Every 1001 Dark Nights novella is a standalone story. For new readers, it’s an introduction to an author’s world. And for fans, it’s a bonus book in the author’s series. We hope you'll enjoy each one as much as we do.**Books in the Dare Nation series:Book 1: Dare to Resist - ASIN: B0842B31PLBook 2: Dare to Tempt - ASIN: B0844N9LYKBook 3: Dare to Play - ASIN: B087ZRKKX6Book 4: Dare to Stay - ASIN: B089YC13VHBook [4.]5: Dare to Tease (novella) - ASIN: B08F2XQW7T",
  "genres": [
    "Romance",
    "Novella",
    "Sports",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook",
    "Friends To Lovers"
  ],
  "author": "Carly Phillips",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/50643023-dare-to-tease"
}