{
  "title": "The Woman in Battle: The Civil War Narrative of Loreta Janeta Velazquez, Cuban Woman and Confederate Soldier",
  "description": "A Cuban woman who moved to New Orleans in the 1850s and eloped with her American lover, Loreta Janeta Velazquez fought in the Civil War for the Confederacy as the cross-dressing Harry T. Buford. As Buford, she single-handedly organized an Arkansas regiment; participated in the historic battles of Bull Run, Balls Bluff, Fort Donelson, and Shiloh; romanced men and women; and eventually decided that spying as a woman better suited her Confederate cause than fighting as a man. In the North, she posed as a double agent and worked to traffic information, drugs, and counterfeit bills to support the Confederate cause. She was even hired by the Yankee secret service to find \"the woman . . . traveling and figuring as a Confederate agent\"—Velazquez herself.Originally published in 1876 as The Woman in Battle, this Civil War narrative offers Velazquez’s seemingly impossible autobiographical account, as well as a new critical introduction and glossary by Jesse Alemán. Scholars are divided between those who read the book as a generally honest autobiography and those who read it as mostly fiction. According to Alemán’s critical introduction, the book also reads as pulp fiction, spy memoir, seduction narrative, travel literature, and historical account, while it mirrors the literary conventions of other first-person female accounts of cross-dressing published in the United States during wartime, dating back to the Revolutionary War. Whatever the facts are, this is an authentic Civil War narrative, Alemán concludes, that recounts how war disrupts normal gender roles, redefines national borders, and challenges the definition of identity.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "Autobiography",
    "American History",
    "American Civil War",
    "War"
  ],
  "author": "Loreta Janeta Velázquez",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/506294.The_Woman_in_Battle"
}