{
  "title": "Find Her Alive",
  "description": "Josie treads gently, careful not to disturb the pile of perfect white bones laid out in the grass by her feet. Her voice is little more than a whisper.  “No! Not my sister…”   Detective Josie Quinn hasn’t heard from her sister since Trinity stormed out of the house in the heat of an argument three weeks ago. So, when human remains are found at the remote hunting cabin where Trinity was last seen, Josie can only assume the worst.  Gathering her team, Josie feels a surge of relief when the dental records match a different body – that of a missing single mother from a neighboring town. But now Josie’s is not the only broken family desperate for answers.  Dusting the crime scene for prints, a name smudged into the side of a nearby car is the first in a trail of clues Trinity left for Josie. In need of a big story to save her journalism career, it seems Josie’s sister was attempting to make contact with a dangerous serial killer known for creating sculptures with his victim’s bones. And Trinity won’t stop until she’s found him, even if it means becoming his next masterpiece…  Josie is certain there’s a critical clue in the ivory hair comb delivered to Trinity just days before she went missing. But as more bones surface, each set more likely to be Trinity’s than the last, time is running out to find her alive. Can Josie’s team trust her instincts in a case that is so deeply personal? Can she find her sister without putting other innocent lives in danger?   An unputdownable crime thriller from an Amazon, USA Today and Wall Street Journal bestselling author that will have you sleeping with the light on. This gripping rollercoaster ride is perfect for fans of Angela Marsons, Robert Dugoni and Rachel Caine. Prepare to be totally hooked!  \nWhat readers are saying about Lisa Regan:\n‘OMG, they said it was an absolutely gripping crime fiction and they weren't kidding. It reels you in from start to finish. There's plenty of shocks, twists and turns to keep you hooked…. I can't praise it enough and it deserves a lot more than five stars.’ Dawn Clifford, 5 stars  ‘Wow wow wow. This is the book that wow was meant for. So many wonderful twists.’ Rachel Garner, 5 stars  ‘A rollercoaster of a crime thriller. Stayed up till 3am to finish it. If I could I would award this book six stars. One of my favourite reads of this year so far.’ Goodreads reviewer, 5 stars  ‘I read this in three days… I was so engrossed in the story and flipping pages like a mad woman. I immediately turned back to page one to read it again when I was finished… An emotional powerhouse… Best. Book. Ever. An absolute 5-star read! Don’t start this unless you have time to finish it in one sitting because you won’t be able to put it down.’ Goodreads reviewer, 5 stars  ‘MEGA BIG FAN of Lisa Regan's JOSIE QUINN!!! There is nothing that this book does not offer from suspense, crime, love, and characters that become a part of your life.’ Goodreads reviewer, 5 stars  ‘Wow, I loved this book… A must read.",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Lisa  Regan",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/50644626-find-her-alive"
}