{
  "title": "My Lvov: Holocaust Memoir of a twelve-year-old Girl",
  "description": "A powerful notebook laced with raw Holocaust memoriesShe lived through horror and survived to tell the stories of those less fortunate...Poland, 1943. Tragically orphaned Janina Hescheles recited poetry every night against the backdrop of Janowski camp’s burning bodies. Her haunting words catching the attention of the underground movement, she was smuggled to freedom just before the destruction of the site and the mass murder of its forced-labor Jewish captives. Concealed in Cracow and given writing tools to capture the brutal images in her head, the twelve-year-old began to faithfully record events and names of the dead.Hescheles’ report opens in June of 1941 with the ruthless Nazi occupation of her beloved city, Lvov. Through vivid recollections, she meticulously details the enforced imprisonment of her friends, family, and neighbors in the Ghetto. Her unique account recalls a child’s painful longing for the mother and father she lost to the sadistic Third Reich.In this courageous story of innocence taken so young, Hescheles reveals the stark daily realities of the horrific Jewish genocide. She was not afraid to be shot, but to be buried alive - the fate reserved for children. Written with descriptive immediacy during history’s ghastliest episode, this extraordinary notebook is an inspiring example of a Holocaust survivor bearing witness to the memories of a lost people. Complete with a recent forward, Hescheles exemplifies how life and hope can continue beyond unimaginable tragedy.My Holocaust Memoir of a twelve-year-old Girl is a fascinating memoir that brings an appalling event to life. If you like authentic first-hand reports, striking observations, and poignant reads, then you’ll love Hescheles’ childhood narrative.Buy My Lvov to honor the fallen today!",
  "genres": [
    "Holocaust",
    "Nonfiction",
    "World War II",
    "History",
    "War",
    "Historical"
  ],
  "author": "Janina Hescheles",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/50636805-my-lvov"
}