{
  "title": "The Chair Man: A thriller in which a victim of a terrorist attack wreaks vengeance from his wheelchair",
  "description": "Michael Hollinghurst is a successful corporate lawyer living a comfortable, suburban life in leafy North West London. But on 7 July 2005, his life is transformed when he steps on a London underground train targeted by Islamist suicide bombers. While most passengers in his carriage are killed, Michael survives the explosion but is confined to a wheelchair as a result. Coming to terms with his predicament and controlling his own feelings of guilt as a survivor conspire to push him in a direction that is out of character and a tad reckless. In a quest to seek retribution, he resorts to embracing the internet and posing as a radical Islamist in order to snare potential perpetrators. Much to his surprise, his shambolic scheme yields results and is brought to the attention of both GCHQ and a terrorist cell. But before long, dark forces begin to gather and close in on him. There is seemingly no way out for Michael Hollinghurst. He has become, quite literally, a sitting target.   \"'The Chair Man' would make an excellent book club choice, stimulating discussion and lively argument. It contains masses of detailed information, selection from which can justify a wide range of interpretations. Many readers will admire Hollinghurst. He is a good father, particularly to his daughter Natasha, who considers him \"the best frigging dad in the world\", and he possesses \"in spades\" the \"primal need to feel and protect your own flesh and blood.\" His son Ben thinks he \"could always see the good in others.\" But that is exactly how many terrorists are remembered by almost all who knew and loved them.\"The nearest I ever got to a \"terrorist incident\" was in East London, when I heard the IRA bomb go off in Docklands in 1996. I cannot predict my reaction were I to be caught up personally in such events, but I hope I would not go the same way as Michael Hollinghurst, the central figure in this entertaining and elaborately-plotted novel. It is a gripping thriller that repays careful and close reading (and I will certainly read it again).\"  Graham Smith, 2020",
  "genres": [
    "Fiction"
  ],
  "author": "Alex Pearl",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/50638254-the-chair-man"
}