{
  "title": "Broken Greek: A Language to Belong",
  "description": "An American poet, repatriated in the land of her ancestors, Adrianne Kalfopoulou is a consummate storyteller. Lucid, precise, and unflinching, Broken Greek stands up to comparison with previous accounts of the Greek experience, with great style. It's a lively and poignant journey to the gods and demons of present-time Greece. Stratis Haviaras , author of When the Tree Sings and The Heroic Age Unlike other writers on modern Greece, Adrianne Kalfopoulou gives us a powerful non-fiction narrative that goes against the romantic notions that most people have of this country. Her sensitivity to the verbal noise that hovers around the Hellene like a cartoon bubble transforms important decisions (buying that lovely island house, getting into a car accident, applying for a teaching job at the Greek university, raising a hybrid daughter), into a transcendent read. Nicholas Papandreou , author of A Crowded Heart What happens when the common things of everyday life become a constant negotiation of one's place in one's world? This is the predicament of the migrant, of the millions of people who try to make their life in a different place. This book is full of love, and yet also full of frustration and Adrianne Kalfopoulou desires to be a part of this world of ancestry, but is forced to admit she can't, that one cannot enter the same river twice. Jose Itzigsohn , Brown University In Broken Greek, Adrianne Kalfopoulou takes us beyond the whitewash into the heart of Greek culture, as well as its spleen. She guides us through the labyrinth of Athenian and Patmian streets and creates a map of the contradictory Greek psyche. People argue loudly in public, are fatalistic about politics and the law while family and neighbors unconditionally help their own. In her vividly wrought odyssey she learns that \"Greece eats her children,\" but also how to speak \"a language of vulnerability.\" Aliki Barnstone , translator of The Collected Poems of C.P. Cavafy, A New Translation",
  "genres": [
    "Memoir"
  ],
  "author": "Adrianne Kalfopoulou",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/506664.Broken_Greek"
}