{
  "title": "Dublin Murder Squad Series Box Set",
  "description": "Titles in the boxIn the WoodsThe LikenessFaithful PlaceBroken HarbourThe Secret PlaceThe TrespasserIn the WoodsWhen he was twelve years old, Adam Ryan went playing in the woods with his two best friends. He never saw them again. Their bodies were never found, and Adam himself was discovered with his back pressed against an oak tree and his shoes filled with blood.The LikenessStill traumatised by her brush with a psychopath, Detective Cassie Maddox transfers out of the Murder squad and starts a relationship with fellow detective Sam O'Neill. When he calls her to the scene of his new case, she is shocked to find that the murdered girl is her double.Faithful PlaceThe course of Frank Mackey's life was set by one defining moment when he was nineteen. The moment his girlfriend, Rosie Daly, failed to turn up for their rendezvous in Faithful Place, failed to run away with him to London as they had planned.Broken HarbourIn Broken Harbour, a ghost estate outside Dublin - half-built, half-inhabited, half-abandoned - two children and their father are dead. The mother is on her way to intensive care. Scorcher Kennedy is given the case because he is the Murder squad's star detective.The Secret PlaceEven in her exclusive boarding school, in the graceful golden world that Stephen has always longed for, bad things happen and people have secrets. The previous year, Christopher Harper, from the neighbouring boys' school, was found murdered on the grounds.The TrespasserBeing on the Dublin Murder squad is nothing like Detective Antoinette Conway dreamed. Her working life is a stream of thankless cases and harassment. Antoinette is tough, but she's getting close to the breaking point.",
  "genres": [
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Crime",
    "Thriller"
  ],
  "author": "Tana French",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/50654283-dublin-murder-squad-series-box-set"
}