{
  "title": "Music is Not Bound by Time",
  "description": "It would take two women separated by time to complete music with the power to change history. But will it be enough to save the man they care about most?  Adeena Stuart and Katharine Carnegie were born nearly three centuries apart. Yet their music and an ancient cello connect them to each other and to a man doomed by the Battle of Culloden.  In Book I of the Song for A Lost Kingdom series, Adeena receives an untitled musical score from her dying grandmother in Scotland. The music was hidden away for over two hundred and seventy years, as part of a violent family battle between siblings on different sides of the Jacobite rising of 1745.  When the score is played on the oldest surviving cello ever made in the UK, the music connects Adeena directly to the past as Katharine, struggling to find words to complete her symphonic tour-de-force in the midst of 18th Century political rebellion that is threatening to tear apart Scotland and England.  But Adeena is not a scientist or historian. What she wants more than anything is to compose music and to join the National Arts Centre Orchestra in Ottawa. Just as she is about to realize her wish, she’s lifted away, out of her control, and immersed in her ancient family history. As she is buffeted back and forth between the worlds, she grows to want more of the past, even though the promise of her most yearned-for musician dreams is coming true.  Not even her passionate boyfriend can keep her rooted in the present, especially when another man from the past falls for her and her music. Although unsure whether her time travel is a hallucination, she’s willing to steal a five million dollar cello to get back to the 1700’s.  With a clear voice that sets us in modern day Ottawa and old world Scotland, Song for a Lost Kingdom, Book I, begins a journey of discovery between two women who share the same musical soul and love for the same doomed man.",
  "genres": [
    "Fantasy",
    "Time Travel",
    "Historical Fiction",
    "Music",
    "Fiction",
    "Canada",
    "Scotland"
  ],
  "author": "Steve  Moretti",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/50663589-music-is-not-bound-by-time"
}