{
  "title": "Stargazer",
  "description": "For thousands of years, stars have held our attention and imagination. They influence our life—we wish upon them, sing songs about them, navigate by them, write about them, follow them, and even give their name to the actors we love. My memories have revealed a lifetime of navigating by the stars, and moving beyond the fear and anxiety that self-doubt so insidiously cloaks us in. Yes, as Jiminy Cricket sang for us in Walt Disney's Pinocchio, \"when you wish upon a star . . . fate steps in and sees you through.\" Memories and influences have a profound effect on our lives. I look back on my childhood years—the 1940s to mid-'50s—and I can recall the people who were inspirational to me. Mostly it was my family, but there was also Jiminy Cricket. You no doubt recollect the song \"When You Wish Upon a Star,\" with its lyrics that lift the spirit and let you believe anything is possible. I didn't doubt Jiminy for a minute. The early years of my life were a time of innocence, security, adventure, and family love. How quickly my situation changed—one decision by my parents, made with my best interests foremost in their thoughts, shattered the world I had known. Through the fear, torment, isolation, and loss of my own identity, my memories and influences would come to have an overwhelming power on the choices I was to make. My transition from teenager to adult seemed to happen overnight, but my unflappable outward appearance belied the struggles of a boy coming to terms with his guilt, and an irresistible need for his parents to be proud of him. My future was being shaped from the past, but it took me a long time to realise it. I chose the road less travelled, steeped in the wonder of the cinema and accompanied by my beloved animal companions, and it has been intriguing, daunting, rewarding, and, at times, solitary, but I always felt it was the path I was meant to take. Like so many people, I let the emotions attached to memories hold me captive, and I missed opportunities to choose with more clarity. A near-death experience helped me to live a simpler life. Participating in a creative writing course inspired me to engage in script writing, stage work, and novel writing. This is my third book, an autobiography that has revealed more of me than I ever intended to share, and fate has led you to it.",
  "genres": [],
  "author": "David           Scott",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/50669350-stargazer"
}