{
  "title": "Personal Reminiscences Vol. 2",
  "description": "About the Book  This category is about Memoirists who write about a range of events, or about a specific event, that took place during their lives, sometimes in the form of a diary. These events may have been momentous in history, or may have merely been recordings of everyday happenings in their lives, which gain interest as time passes. Sometimes memoirs describe a complete life. Memoirs include those of: Anna Green Winslow, Thomas Hill Green, Brooke Herford, Thomas Thomson, Thomas Minor, Samuel Hopkins Emery, William Wyon, and James Jackson Jr MD. Also in this Book  Books that are Collections of Essays are anthologies of literary works by essayists. The list of essayists who have been active throughout the world and throughout time, is extraordinary.  And in this Book  Titles presenting Biographies or Autobiographies about Literary personages, include authors, poets, screenwriters, journalists, and essayists ranging from the famous to the obscure. These include: Henry David Thoreau, Peter Henry Ling, Elisha Bartlett, Ralph Waldo Emerson, Charles Dickens, Horatio Greenough, John Milton, Christopher Marlowe, Dante, Rousseau, Chateaubriand, Balzac , Stendhal, Sand-Musset, Baudelaire, Flaubert, Verlaine, Zola, Sir Walter Scott, Bentley, Wordsworth, Fitzgerald, Goethe, Robert Louis Stevenson, Byron, Robert Burns, Nathaniel Hawthorne, Oscar Wilde, Amiel, Tolstoy, Pater, Newman, Rabindranath Tagore, Walt Whitman, Shakespeare, Seneca, John Donne, Henry Wotton, Richard Hooker, George Herbert, Victor Hugo and Robert Sanderson. About us Leopold Classic Library’s aim is to provide readers with the highest quality reproductions of fiction and non-fiction literature that has stood the test of time. Our titles are produced from scans of the original books and as a result may sometimes have imperfections. To ensure a high-quality product we have: \t thoroughly reviewed every page of all the books in the catalog \t repaired some of the text in some cases, and \t rejected titles that are not of the highest quality.  \nIf You can't find the book You're looking for, please write to us. We will look for it in our catalog and find the best price for You in our eBay store.\n\nCome home to the books that made a difference!\nThank you for your interest in our books!",
  "genres": [],
  "author": "William Frederick Pollock",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/50656219-personal-reminiscences-vol-2"
}