{
  "title": "The Rhythm Section",
  "description": "\"Have you ever killed anyone? Not in self-defense.\"  \"What are you asking that for?\"Because I'm curious.\" \"You can't know what it feels like by being told.\"  \"I don't want to know what it feels like. I want to know how you actually make the leap from planning to do it to actually pulling the trigger.\"Stephanie Patrick's life is destroyed by the crash of flight NEO027. Her family was on board and there were no survivors. Devastated, she drops out of college and her life spins out of control as she enters a world of drugs and prostitution--until a journalist discovers that the crash wasn't an accident. A bomb was planted on the plane that killed her family. Filled with rage, and with nothing left to loose, she focuses on one goal: revenge.The opportunity to obtain it arrives quickly when Stephanie is approached and recruited by an extremely covert intelligence organization. She is young, smart, and beautiful--and has no family, making her the perfect candidate. The organization offers her a deal. She must undergo rigorous training; learn how to control her heart rate and breathing (\"the rhythm section\"), how to operate various weapons skillfully and efficiently, and she must improve her physical requirements, she will be given a new identity and asked to commit acts of terrorism on behalf of the organization. When she completes these assignments successfully--and proves her loyalty--she will be offered the opportunity to take out the terrorists who brought down flight NEO027. Stephanie agrees to all of the organization's demands without hesitation.As \"Petra,\" a mercenary terrorist based out of Germany, and as \"Marina,\" an international businesswoman based in London, she enters the brutal world of international espionage, and adapts quickly. She is able to numb her feelings and act on instinct alone. But as the stakes get higher, Stephanie begins to question what her value  really is. Is the organization telling her the truth--do they know who caused flight NEO027 to explode? Or are they using her for some other agenda? More important: Is avenging her family worth the price she is paying? And if it isn't--will the organization that created her let her go?Violent, edgy, and unpredictable,  The Rhythm Section takes readers deep into the world of international espionage , it is a nonstop thriller from the first page to the last.RUNNING TIME ➼ 14hrs. and 51mins.©1999, 2018 Text copyright Mark Burnell; Afterword copyright Mark Burnell (P)2018 Macmillan Audio",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Book Club",
    "Audiobook",
    "Suspense"
  ],
  "author": "Mark Burnell",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/50650207-the-rhythm-section"
}