{
  "title": "Life with Father",
  "description": "When the delicious comic tales that make up Life with Father first appeared in the early 1930s, they played a large hand in keeping afloat a fledgling magazine called The New Yorker. Clarence Day's reminiscences of growing up in a turn-of-the-century New York household which keeps wriggling out from under the thumb of a blustering Wall Street paterfamilias are classics of American humor, lively and nostalgic sketches that still manage to evoke the enduring comedy of family life. Father's explosive encounters with horse and cook, servants and shopkeepers, wife and childrento say nothing of his vigorous pursuit of ice!retain their hilarious appeal in no small part because the younger Day never seems put out by the older man's actions, never describes him with less than affectionate amusement. As a result, Life with Father remains as a contemporary critic described it: \"A delightful book alive with energy and collisions and the running water of happiness.\"A bestseller when it was first published in 1935, Life with Father was the inspiration for one of the longest-running hits in Broadway history and was later adapted successfully for both film and television.Clarence Day was born in 1874. After graduation from Yale, he followed his father to Wall Street, but his business career was cut short by illness. Turning to writing and drawing, he became an early contributor to The New Yorker and authored several books, the most famous of which was Life with Father. Day died in December 1935, just a few months after Life with Father was published. Life with Mother appeared posthumously.\"A delightful book alive with energy and collisions and the running water of happiness.\"The New Republic\"One of the most chuckling books of our time.\"The Atlantic\"The only reason for reading Life with Father is the fun of it.\"New York Times\"Such a rich and rounded character as Father has not appeared in literature for many a year. A novelist would be ranked as a genius for inventing him; Clarence Day didn't need to.\"Books\"It won't be so much fun reading Life with Father unless you have someone at hand to whom you can read snatches whenever enjoyment becomes too great to be self-contained any longer.\"Boston Transcript",
  "genres": [
    "Humor",
    "Classics",
    "Nonfiction",
    "Biography",
    "Memoir",
    "History",
    "Biography Memoir"
  ],
  "author": "Clarence Day Jr.",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/506871.Life_with_Father"
}