{
  "title": "The Hacker and the State: Cyber Attacks and the New Normal of Geopolitics",
  "description": "“A must-read…It reveals important truths.”—Vint Cerf, Internet pioneer“One of the finest books on information security published so far in this century—easily accessible, tightly argued, superbly well-sourced, intimidatingly perceptive.”—Thomas Rid, author of Active MeasuresCyber attacks are less destructive than we thought they would be—but they are more pervasive, and much harder to prevent. With little fanfare and only occasional scrutiny, they target our banks, our tech and health systems, our democracy, and impact every aspect of our lives. Packed with insider information based on interviews with key players in defense and cyber security, declassified files, and forensic analysis of company reports, The Hacker and the State explores the real geopolitical competition of the digital age and reveals little-known details of how China, Russia, North Korea, Britain, and the United States hack one another in a relentless struggle for dominance. It moves deftly from underseas cable taps to underground nuclear sabotage, from blackouts and data breaches to election interference and billion-dollar heists.Ben Buchanan brings to life this continuous cycle of espionage and deception, attack and counterattack, destabilization and retaliation. Quietly, insidiously, cyber attacks have reshaped our national-security priorities and transformed spycraft and statecraft. The United States and its allies can no longer dominate the way they once did. From now on, the nation that hacks best will triumph.“A helpful reminder…of the sheer diligence and seriousness of purpose exhibited by the Russians in their mission.”—Jonathan Freedland, New York Review of Books“The best examination I have read of how increasingly dramatic developments in cyberspace are defining the ‘new normal’ of geopolitics in the digital age.”—General David Petraeus, former Director of the CIA“Fundamentally changes the way we think about cyber operations from ‘war’ to something of significant import that is not war—what Buchanan refers to as ‘real geopolitical competition.’”—Richard Harknett, former Scholar-in-Residence at United States Cyber Command",
  "genres": [
    "Technology",
    "Nonfiction",
    "Politics",
    "Science",
    "History",
    "Espionage",
    "Military Fiction"
  ],
  "author": "Ben  Buchanan",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/50672849-the-hacker-and-the-state"
}