{
  "title": "Outbound Train",
  "description": "In 1976, memories from a night near the railroad tracks sixteen years earlier haunt Barbara Parker. She wrestles with past demons every night, then wakes to the train’s five-thirty whistle. Exhausted and dreading the day, she keeps her hands busy working in Bryson City’s textile plant, known as the “blue jean plant,” all the while worrying about her teenage daughter, Carole Anne. The whistle of the train, the hum of those machines, and the struggle to survive drives Barbara. When an unexpected layoff creates a financial emergency, the desperate pressure of poverty is overwhelming.Unbeknownst to Barbara, Carole Anne sneaks out at night to walk the tracks so she can work at Hubert’s Bar. She’s hoarding money with plans to drive her mother’s rusty, unused Oldsmobile out of Bryson City, and never return. She only needs one opportunity … if she can just find it.When Carole Anne goes missing, Barbara finds herself at a crossroad—she must put aside old memories and past hurts to rely on a classmate for help finding her daughter. But this is the same man she blames for the incident years ago. Is she strong enough—or desperate enough—to do anything to keep her daughter safe?In Outbound Train, the Parker women struggle to make frayed ends meet in a town where they never quite do … at least, not without expert weaving and a bit of brute force.Here's what others say about Outbound Train. Renea Winchester's storytelling is as real and authentically Southern as the clear water music of an Appalachian creek and the song of Cicadas on a front porch summer evening.  Lisa Wingate,#1 New York Times Bestselling author of Before We Were Yours and Before and After.I fell in love with the smart, strong, funny characters in this community of make-do women, and I predict you will, too.Pamela Duncan, Author of Plant LifeWith pitch-perfect dialogue and believable characters, Winchester has crafted a story that will make readers stand up and cheer.Michael Morris, Man in the Blue Moon, A Place Called WiregrassA powerful tale of heartache and healing delivered with the skills of a true southern story tellerJulie Cantrell, New York Times and USA TODAY bestselling author of PerennialsOutbound Train is a journey you won't want to miss. It is a thrilling and heartfelt journey into the collective soul of the Parker women from the mountains of North Carolina, who will teach you the meaning of courage, strength and, most important, love. Outbound journey is a novel you will not put down or ever forget.Peter Golden, Author of Nothing Is Forgotten",
  "genres": [
    "Fiction",
    "Southern"
  ],
  "author": "Renea Winchester",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/50690274-outbound-train"
}