{
  "title": "Remembering Ravensbrück. Holocaust to Healing",
  "description": "In her luminous and engrossing memoir, award-winning writer and teacher, Natalie Hess, takes us from a sheltered childhood in a small town in Poland, into, through, and after the horrors of the Holocaust.When her parents are rounded up and perish in the Treblinka concentration camp, a Gentile family temporarily hides six-year-old Natalia. Later, protected by a family friend, she is imprisoned in her city’s ghetto, before she is sent to a forced-labor camp, and finally, Ravensbrück Concentration camp, from which, at nine, she is liberated.Taken to Sweden, by the Swedish White Cross busses, she adapts to and grows to love her new home, becoming a “proper Swedish School girl,” until, at 16, she is claimed by relatives and uprooted to Evansville, Indiana. There, she must start over yet again, mastering English, and ultimately earning a PhD in literature.As a married young mother, she and her husband move to Jerusalem where they and their three children experience life as Israelis, including the bombing of their home during the Six Day War. Back in the States, they settle into life in Arizona until Natalie’s husband dies unexpectedly when a teenager runs a stop sign and hits his car. In her grief, Natalie moves to Philadelphia to be with her daughter and discovers that life still holds surprises for her, including love.Hess’s compelling portrait in which terror is muted by gratitude and gentle humor, shares the story of so many immigrants dislocated by tyranny and war. Through her experience as a child separated from her parents, a teenager, young woman, wife, mother, college professor, and later a widow, Hess shows the power of the human spirit to survive and thrive.",
  "genres": [
    "Holocaust",
    "Historical",
    "War",
    "World War II",
    "Nonfiction",
    "History",
    "Biography"
  ],
  "author": "Natalie B. Hess",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/50671933-remembering-ravensbr-ck-holocaust-to-healing"
}