{
  "title": "Beyond the Moon",
  "description": "A strange twist of fate connects a British soldier fighting in the First World War in 1916 with a young woman living in modern-day England a century later, in this haunting literary time travel novel.Two people, two battles: one against the invading Germans on the battlefields of 1916 France, the other against a substandard, uncaring mental health facility in modern-day England. Part war story, part timeslip, part love story – and at the same time a meditation on the themes of war, mental illness, identity and art, Beyond The Moon is an intelligent, captivating debut novel, perfect for book clubs.In 1916 1st Lieutenant Robert Lovett is a patient at Coldbrook Hall military hospital in Sussex, England. A gifted artist, he’s been wounded fighting in the Great War. Shell shocked and suffering from hysterical blindness he can no longer see his own face, let alone paint, and life seems increasingly hopeless. A century later in 2017, medical student Louisa Casson has just lost her beloved grandmother – her only family. Heartbroken, she drowns her sorrows in alcohol on the South Downs cliffs – only to fall accidentally part-way down. Doctors fear she may have attempted suicide, and Louisa finds herself involuntarily admitted to Coldbrook Hall – now a psychiatric hospital, an unfriendly and chaotic place.Then one day, while secretly exploring the old Victorian hospital’s ruined, abandoned wing, Louisa hears a voice calling for help, and stumbles across a dark, old-fashioned hospital room. Inside, lying on the floor, is a mysterious, sightless young man, who tells her he was hurt at the Battle of the Somme, a WW1 battle a century ago. And that his name is Lieutenant Robert Lovett…*NB Contains graphic descriptions of war violence and injuries, as well as profanity and mild sex.",
  "genres": [
    "Historical Fiction",
    "Time Travel",
    "Romance",
    "Fiction",
    "Historical",
    "Fantasy",
    "Historical Romance"
  ],
  "author": "Catherine    Taylor",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/50701814-beyond-the-moon"
}