{
  "title": "Win Work Politics as a Leader: A Strategy Guide",
  "description": "Discover how to become a better leader and beat office politics in this comprehensive guide!Do you want to uncover powerful, highly effective strategies for navigating the business world? Want to develop better relationships with your co-workers, handle negative work politics, and improve your leadership skills? Then this is the book for you!Every workplace has its fair share of work politics, and if you don’t have the right knowledge then it can quickly become demotivating, draining, and make you feel like you’re not succeeding. So how do you navigate the complex corporate world? And how do you deal with all the different people your career will throw at you?Inside this guide, you’ll discover a breakdown of how you can drastically boost your leadership skills, overcome work politics, and develop better relationships with your boss and co-workers. With reference to career-stalling behaviors to avoid, how to deal with passive-aggressive and over-competitive co-workers, as well as how to avoid being set up to fail, this book is perfect for anyone looking to deal with office politics.Here’s what you’ll discover inside:A Breakdown of Office PoliticsTips and Tricks For Dealing With a Difficult BossDealing With Undermining, Approval-Seeking, and Aggressive Co-WorkersHow to Identify (and Overcome) Passive-Aggressive BehaviorCareer-Stalling Mistakes To Avoid!Powerful Strategies For Maneuvering Work PoliticsTips For Overcoming Competition at WorkSigns You’re Being Set Up To Fail – and How To Prevent ThisAnd Much More!With insightful advice, practical strategies, and a ton of tips and tricks, now you can arm yourself with the knowledge you need to overcome office politics, build your leadership skills, and succeed in the business world!Buy now to discover how to beat office politics today!",
  "genres": [],
  "author": "Marc White",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/50701624-win-work-politics-as-a-leader"
}