{
  "title": "El salón de los artistas exiliados en California: Salka Viertel acogió en su exilio a actores, intelectuales prominentes y personas anónimas huidas del nazismo",
  "description": "\"El salón de los artistas exiliados en California\" es una biografía sobre la figura de Salka Viertel, una actriz judía que emigró a Hollywood y fue popularmente conocida como la guionista de la actriz sueca Greta Garbo. Además, ella tenía un salón en Santa Mónica, California, al que acudía gran parte de la intelectualidad europea en el exilio. Salka fue una mujer muy moderna e interesante para la época que debe ser conocida como se merece. En el libro salen temas como la supuesta bisexualidad de Salka Viertel y la cantidad de amigos reconocidos que tuvo, por citar solo algunos: Albert Einstein, Charles Chaplin, Sergei Eisenstein, F. W. Murnau, Max Reinhardt, Arnold Schönberg, Thomas Mann, Bertolt Brecht, Greta Garbo, Montgomery Clift… Asimismo, al igual que Gertrude Stein y otras mujeres notorias, ella tuvo su propio salón literario por el que pasaron escritores como Truman Capote, Christopher Isherwood, Gore Vidal y un largo etcétera. Otros temas que engloba son el Berlín de los años 20; el paso del cine mudo al hablado, visto desde la meca de Hollywood. Luego, el ascenso de Hitler y lo que ello supuso para la condición judía; el exilio de aquellos intelectuales que no podían regresar a sus respectivos países debido a la Segunda Guerra Mundial. Más adelante, la Guerra Fría y la caza de brujas contra el comunismo. Lo cierto es que el trasfondo de la vida de Salka Viertel y de su círculo de amigos abarca los grandes acontecimientos del siglo XX. Con dicho proyecto la autora obtuvo las becas de residencia Shanghai Writing Program (China, 2016) y Baltic Centre (Suecia, 2017).\"Un relato muy interesante y pienso aun en estos tiempos muy actual, ya que en mis ojos no hemos avanzado mucho en la cuestión de la aceptación de \"los sentimientos interpersonales\" en general. Un gran libro, sumamente interesante sobre el Hollywood en los años treinta y cuarenta y la influencia de artistas de países Europeos como Alemania, Austria, Francia, Suecia, Inglaterra, Ucrania y otros. Un trabajo de investigación enorme y de gran calidad resultando en un relato profundo acerca de muchas personalidades muy conocidas y sus relaciones interpersonales. -Joannes W. M. Groenewege, TraductorSOBRE LA AUTORA: Núria Añó (Lleida, 1973) cursó estudios de Filología Catalana y Lengua Alemana. Es una escritora catalana, traductora y conferenciante en distintos coloquios y congresos especializados, donde suele hablar de su obra, de creación literaria, de cine, de ciudades o de otros autores como Elfriede Jelinek, Patricia Highsmith, Salka Viertel, Alexandre Dumas hijo, Franz Werfel o Karen Blixen. Añó ha expuesto su obra en universidades e instituciones, tales como la Universidad de Lleida (UdL), la Universidad de Túnez, la Universidad de Jaén (UJA), la Universidad Internacional de Andalucía (UNIA), el Consejo Superior de Investigaciones Científicas (CSIC-Madrid), la Biblioteca Sysmän Kirjasto de Finlandia, la Asociación de Escritores de Shanghái (SWA), la Universidad de Fudan, la Universidad Normal de China del Este, Sinan Mansion, el Instituto Cervantes de Shanghái y el Instituto Cervantes de Cracovia, el Festival Conrad, la Librería Massolit o el Bar Baza de Polonia, además de dar charlas en bibliotecas y en centros de enseñanza secundaria y superior. Asimismo, ella es miembro de varios jurados artísticos internacionales. Su obra, que engloba novelas, relatos breves y ensayos, ha sido publicada y traducida al español, francés, inglés, italiano, alemán, polaco, chino, letón, portugués, neerlandés y griego. Su primera novela \"Els nens de l'Elisa\" ([Los niños de Elisa], Omicron, 2006) quedó tercera finalista en el XXIV Premio de las Letras Catalanas Ramon Llull. Siguen \"L'escriptora morta\" ([La escritora muerta], Omicron, 2008), \"Núvols baixos\" ([Nubes bajas], Omicron, 2009) y \"La mirada del fill\" ([La mirada del hijo], Omicron, 2012). Ella ganó el XVIII Premio Joan Fuster de Narrativa Ciutat d'Almenara, el cuarto premio de escritura 2018 Shanghai Get-Together y ha sido galardonada con las prestigiosas becas internacionales: Nuoren Voiman Liitto (Finlandia, 2016), Shanghai Writing Program (China, 2016), Baltic Centre (Suecia, 2017), IWTCR (Grecia, 2017), Krakow UNESCO City of Literature (Polonia, 2018), IWTH (Letonia, 2019) o IWP (China, 2020).La presente biografía sobre Salka Viertel \"El salón de los artistas exiliados en California\" (2020) es el fruto de tres años de investigación y su trabajo más reciente. Más información en: www.nuriaanyo.com.",
  "genres": [
    "Art",
    "LGBT",
    "Bisexual",
    "20th Century",
    "Feminism",
    "Biography",
    "Writing"
  ],
  "author": "Núria Añó",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/50694120-el-sal-n-de-los-artistas-exiliados-en-california"
}