{
  "title": "An Elephant's Advice",
  "description": "Tun Tun is a baby elephantCarefree, healthy and very intelligentJumbo is his strong, brave fatherAnd Ayo his wise, beautiful motherAt six happy years and a halfTun Tun is a forest elephant calfThat’s what elephant babies are calledAnd he’s already more than a metre tallElephants, including African forest elephants like Tun Tun, are under threat. Learn about his life, the danger he faces, and the brave people helping him to survive in this beautifully illustrated rhyming story for ages 4+.An Elephant's Advice won a 2020 Purple Dragonfly Book Award (Honorable Mention for Excellence in Children's Picture Books - Ages 6 and Older). Reviewed by Mamta Madhavan for Readers' Favorite - 5 StarsMeet Tun Tun, the baby elephant, and Jumbo, his strong and brave father, and Ayo, his wise and beautiful mother. Tun Tun is a forest elephant calf and he visits the lake every day with his family for mud baths, fresh water, and playing. They enjoyed covering themselves with mud and protecting their skin from the sun. Tun Tun spied an intruder one day and his father Jumbo trumpeted that they all must go. Jumbo asked Tun Tun to run because the hunter had his gun. Tun Tun and Ayo ran into the wood and he heard a shot from the hunter's rifle. The forest held a dark surprise and Tun Tun and Ayo came face-to-face with another intruder. Ayo told Tun Tun to run and not wait for her.An Elephant's Advice (Wayne Gerard Trotman's Rhyming Stories) by Wayne Gerard Trotman is a meaningful story about the threat faced by elephants when they are shot for their tusks, for greed, profit, and foolish pride. The story also speaks about the friends they make and on whom their survival depends. The illustrations bring the story to life and make it palpable for readers. The rhyming verses and illustrations make it an excellent book for tutors and parents to read out to kids and help them understand how important it is to protect animals from ignorance and greed and not to take more than they need. Stories like this teach children to become kind and compassionate and to help protect wildlife from being killed by poachers.",
  "genres": [],
  "author": "Wayne Gerard Trotman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/50703937-an-elephant-s-advice"
}