{
  "title": "Secret History of Confederate Diplomacy Abroad",
  "description": "One of the South's most urgent priorities in the Civil War was obtaining the recognition of foreign governments. Edwin De Leon, a Confederate propagandist charged with wooing Britain and France, opens up this vital dimension of the war in the earliest known account by a Confederate foreign agent.First published in the New York Citizen in 1867-68, De Leon's memoir subsequently sank out of sight until its recent rediscovery by William C. Davis, one of the Civil War field's true luminaries. Both reflective and engaging, it brims with insights and immediacy lacking in other works, covering everything from the diplomatic impact of the Battle of Bull Run to the candid opinions of Lord Palmerston to the progress of secret negotiations at Vichy. De Leon discusses, among other things, the strong stand against slavery by the French and a frustrating policy of inaction by the British, as well as the troubling perceptions of some Europeans that the Confederacy was located in South America and that most Americans were a cross between Davy Crockett and Sam Slick. With France's recognition a priority, De Leon published pamphlets and used French journals in a futile attempt to sway popular opinion and pressure the government of Napoleon III. His interpretation of the latter's meeting with Confederate diplomat John Slidell and the eventual mediation proposal sheds new light on that signal event. De Leon was a keen observer and a bit of a gossip, and his opinionated details and character portraits help shed light on the dark crevices of the South's doomed diplomatic efforts and provide our only inside look at the workings of Napoleon's court and Parliament regarding the Confederate cause. Davis adds an illuminating introduction that places De Leon's career in historical context, reveals much about his propagandist strategies, and traces the history of the Secret History itself. Together they open up a provocative new window on the Civil War.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Edwin De Leon",
  "average_rating": "2.83",
  "url": "https://www.goodreads.com/book/show/507154.Secret_History_of_Confederate_Diplomacy_Abroad"
}