{
  "title": "The Tycoon’s Pregnant Lover",
  "description": "USA Today Bestseller Leslie North invites you to indulge in a steamy billionaire romance with an unforgettable bad boy billionaire and the smart-talking woman who tames him...  Romance novelist Brandy Jackson is not a one-night-stand kind of girl, but with Maximillian Benton, she’s willing to make an exception. Big mistake. Turns out, the charming, handsome man with a sexy British accent is a jerk who’s only interested in laying claim to Landon Castle, the inheritance Brandy received when her beloved grandmother died. But apparently through a cheating attorney, the castle was purchased at auction by Max. When a judge orders them to both live at the castle until the legal matter is resolved, Brandy reluctantly agrees. As big as the castle is, it turns out to be too small for her and Max, who find themselves spending more and more time together. And even though Brandy knows Max isn’t her happily-ever-after, when the heat becomes too much she still gives in to her passion. Bigger mistake. Now she’s pregnant.  Max’s motives for wanting the castle are simple: revenge. A billionaire software designer, Max was swindled by the man who owned the castle, and now it’s sweet payback owning the thing his nemesis loved most. So when his plans are sent awry by a pretty American, he has no choice but to dig in his heels and make sure the castle remains his. Max tries, rather desperately, to ignore his attraction to Brandy and the way his heart expands whenever they’re together. Despite his cynicism about love, he can’t help wondering if Brandy might be different from all the other women he’s met. But when he believes he’s been duped by her sweet smile and sexy body, Max all too readily decides ending what they have is for the best. Happily ever after just isn’t for him. But he can’t shake the feeling he may have lost the best thing in his life…  This novel contains sexual content and profanity.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Contemporary",
    "Chick Lit"
  ],
  "author": "Leslie North",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/50712160-the-tycoon-s-pregnant-lover"
}