{
  "title": "Sinful Scot",
  "description": "In a time he doesn’t belong, in an alliance she shouldn’t have made, they’ll fall dangerously, hopelessly in love.\n New Orleans, 2020. Billionaire Rhys McCaim doesn’t believe for one second that his missing mother is a time traveler. Still, his father insists that she didn’t leave them willingly but was pulled through time to her true home in medieval Scotland. But when he and his three brothers test out an ancient time-traveling spell to appease their dying father and Rhys is catapulted to thirteenth-century Scotland, he can’t exactly deny it anymore. Suddenly he’s a Highlander in a land on the verge of war. He needs to get back to his time before all hell breaks loose, but first he must find his mother. Luckily, fate drops the perfect guide in his path. She’s brilliant, beautiful and bold, and he’s drawn to her in a way he’s never been drawn to anyone or anything before. But he can’t afford to be distracted from his mission or lower his carefully constructed guard. Scotland, 1286. Maggie Irvine is betrothed to a vicious man who cares only of wealth and power. Marrying him will restore her family’s reputation, however, saving her siblings from lives of misery. She has resigned herself to her fate, but when a mysterious, handsome stranger magically appears before her out of thin air, her plan—and the stranger’s life—are in jeopardy. And the only way to save him is to risk everything. As she comes to learn the shocking truth of what he hides, Maggie discovers what happens when duty collides with desire and long-abandoned dreams rise to the surface.Bound by secrets and lies, Maggie and Rhys are entangled in the brewing battle for the Scottish throne. With his knowledge of the future, Rhys possesses the powerful ability to alter history. Yet, to do so successfully, he must let Maggie past the defenses he’s spent a lifetime building. Now, an alliance that began in desperation becomes a need that will leave them both torn between what they should do and what love demands.\nIf you love sexy bad boy heroes with hearts of gold, heroines with the courage to fight for what they want, and love stories that encompass all time, then you’ll love this sweeping romance series.",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Romance",
    "Historical",
    "Medieval",
    "Audiobook",
    "Time Travel Romance"
  ],
  "author": "Julie Johnstone",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/50706430-sinful-scot"
}