{
  "title": "Seductive Scot",
  "description": "Reikart McCaim doesn’t want to be saved — despite the fact that he’s a time traveler from 2020 New Orleans stuck in medieval Scotland. He holds his jagged secrets close to his chest and wants to keep them that way. Even if he could open up to the incredible woman fate has tossed in his path, they’d both be shredded by the things he can’t let go of. Still, he needs her help. In his time, his father lies in a coma with only one wish: to see Reikart’s mother again, whom he’s always claimed was a time traveler pulled back to her true time. Two of Reikart’s brothers already traveled back to search for her, but they are missing, too. Now, Reikart must find his family and secure the magic cross they need to return to their time. And the lass who is everything he wants but cannot allow himself to have is the only one who can recover it.Deirdre Irvine’s life is a disaster, and it’s about to get a whole lot messier. She’s been betrayed by her brother, and she finds herself unwittingly embroiled in a plot to gain control of the Scottish throne. Not to mention she’s harboring enormous guilt over failing the sister she adores. So when the unexpected chance to prove herself to her sister arises, Deirdre will do anything to use the opportunity to her advantage. It doesn’t matter that it means putting herself in danger and joining forces with a man who claims he’s from the future. But she is woefully unprepared for the jeopardy he puts her heart in.For a scarred man and wounded lass, their greatest obstacle may not be the centuries that divide them, but the walls they’ve erected themselves. As Deirdre’s and Reikart’s lives intertwine and they’re confronted with dangerous enemies, she’s about to discover a strength she never knew she had, and he’s about to learn that facing his ghosts may be the only way to save not only himself but the woman he now loves.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical",
    "Scotland"
  ],
  "author": "Julie Johnstone",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/50706734-seductive-scot"
}