{
  "title": "Finding Finley",
  "description": "FINLEYI may be young, but I know what I want.I yearn to be submissive, both in and out of the bedroom. There's nothing I crave more than being under the control of another man. Handing over power would fulfill a need I feel down to the marrow of my bones.What I don't know is how to get it. This kind of relationship requires complete trust--something I don't give to anyone except my only friend.Then along comes Dr. Aidan Kingsley. For the third time in my life, he helps me, without even knowing it, and someone like that, I can't help but believe in. This is the man I'm meant to be on my knees for. Aidan is meant to be my Sir.AIDANI've never had a full-time submissive.I've certainly never had a houseboy, but when I meet Finley, I can't seem to turn him away.Instead, I decide to keep things simple, showing Finley that he can take pride on his knees but also stand on his own. He takes care of my home, and he gives me control, in a strictly platonic way, even though he wants more. He's so beautiful, so naturally submissive, that I'm having a hard time sticking to my rules.The more he flourishes and the more he craves from me, the tougher I find it to deny him. Before I know it, he's under my skin. In my bed and in my heart. It wasn't supposed to go this far. I was only supposed to give him the tools he needed to find his own strength, yet somehow, in the finding of Finley, I found myself too.But my precious boy is only twenty; nineteen years my junior. And as I've told him, forever is a long time, and nothing in life is guaranteed.*** Finding Finley contains various k*nks, domestic discipline and a nineteen-year age gap. Please take that into consideration before deciding if this book is for you.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Erotica",
    "Audiobook"
  ],
  "author": "Riley Hart",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/50724507-finding-finley"
}