{
  "title": "The Kade & Lacey Collection: The Maxwell Series",
  "description": "Fall in love with Kade & Lacey all over again in this jammed packed box set that includes a never before published Valentine’s bonus scene and over 800 pages in the bestselling Maxwell Series about coming of age, bullying, dating, family, falling in love, marriage, drama, and an eternal love worth waiting for.Starting over is always easier said than done.Lacey Robinson had the perfect life, the perfect family, and the perfect future, until one terrifying night when everything was ripped from her.Now she’s trying to sew back the pieces, but it's hard when she’s haunted by nightmares and faced with a bully who does everything to shatter her future.Then she met him.Kade Maxwell makes her mouth water and her belly tingle. Through his own pain, he shows her that she’s stronger than she thinks. But she’s not so sure when his enemy is determined to use her to get to him.With too many obstacles, too many triggers, and too many demons in her way, she’s on the verge of losing everything good she has left, including the one boy who just might be the key to mending her broken heart.Valentine’s Surprise – Bonus SceneLove is in the air.Kade is full of surprises, but so are the triplets, Kelton, Kross, and Kody. Catch up on the Maxwell family in this short scene packed with funny moments and sweet romance. Included in this box set is Dare to Kiss, Dare to Dream, Dare to Breathe, and Dare to Embrace along with a special bonus scene. The collection contains strong language and mature content and is intended for audiences seventeen years and older.Standalone Books in the Maxwell Dare to Love –Featuring Kelton Maxwell and is a second chance romance.Dare to Dance – Featuring Kross Maxwell and is a second chance romance.Dare to Live – Featuring Kody Maxwell and is a contemporary romance.",
  "genres": [],
  "author": "S.B. Alexander",
  "average_rating": "4.96",
  "url": "https://www.goodreads.com/book/show/50707664-the-kade-lacey-collection"
}