{
  "title": "Lazare: Gaston Leroux's Continued Investigation Concerning the Phantom of the Opera",
  "description": "Erik's story continues in this daring, romantic sequel to Gaston Leroux's timeless novel, The Phantom of the Opera, written in faithful imitation of Leroux's unique style. Following Christine Daae's retreat, Erik watches over the inbound trains to Gare Saint-Lazare, ever hopeful for his beloved's return. His vigil is interrupted after a mute street artist, Achille Fèvre, catches a glimpse of his masked face. Inspired, Achille paints a portrait that threatens to reveal Erik's identity to the elite of Paris, triggering a cascade of events that forges a powerful bond between the two men, who are both reluctant to believe they are worthy of love. When political strife in France induces a rampant terror of spies, Erik fears his many secrets may put his treasured Achille in danger. The Phantom must return.\"This queer sequel to the Leroux novel...is absolutely gorgeous and powerful.\" -\"In this Getting to the Heart of The Phantom of the Opera\" PodcastDear Reader,I must confess, I have discovered firsthand that my conclusions in my previously published work, The Phantom of the Opera, were false. Oh, the Opera ghost was real, as I first asserted; he lived and breathed in the Paris Opera House and haunted the inhabitants for many years in the precise methods I set to paper. I was false, however, in believing his ruse of the skeleton buried near a cellar with a golden ring...Now, I will relate to you the continued story of the Opera ghost, of which I have pieced together the facts with painstaking integrity and delved into the sweeping emotions of love and redemption and madness in turns.With humblest gratitude,Gaston LerouxK. E. Torwood is a pseudonym for author Katherine Forrister. Forrister is also the author of Lodestone, The Hand-Me-Down Maiden, and Curio Citizen.",
  "genres": [],
  "author": "K.E. Torwood",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/50729524-lazare"
}