{
  "title": "Summer on the Bluffs",
  "description": "View cohost Sunny Hostin makes her literary debut with this dazzling novel about a life-changing summer along the beaches of Martha's Vineyard.Welcome to Oak Bluffs, the most exclusive black beach community in the country. Known for its gingerbread Victorian-style houses and modern architectural marvels, this picturesque town hugging the sea is a mecca for the crème de la crème of black society—where Michelle and Barack Obama vacation and Meghan Markle has shopped for a house for her mom. Black people have lived in this pretty slip of the Vineyard since the 1600s and began buying property in the 1800s, making this posh town the embodiment of “old money.”Every summer, Esperenza “Perry” Soto, a beautiful and talented Afro-Latina lawyer, escapes the fetid heat of New York City for the gorgeous weather, cool water, and stunning views Oak Bluffs offers. Sharing a cottage on the beach, owned by her “Ama”, with her husband and two god sisters, Perry is looking forward to trading meetings and clients for days of languor and fun.When Memorial Day arrives and the season begins, some of the nation’s wealthiest, most powerful, and famous from the worlds of politics, art, and entertainment meet to swim, dance, party, and chill. While a few can’t leave work behind, others indulge in a different kind of business affair. But this summer on the Bluffs is different. Ama is moving to the south of France to reunite with her college sweetheart. She is going to give the house to one of her goddaughters and she has invited all three of them to spend the summer with her the way they did when they were kids. Each of the women want the house desperately. Each is grappling with a secret that they fear will make them lose Ama’s approval and the house. . . .",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Contemporary",
    "Chick Lit",
    "Book Club",
    "Historical Fiction"
  ],
  "author": "Sunny Hostin",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/50732413-summer-on-the-bluffs"
}