{
  "title": "Nothing to Lose, Everything to Gain: Being Black and Conservative in America",
  "description": "Conservative political commentator Kathy Barnette shares how liberal leadership has failed the black community and how being a democrat is not synonymous with your skin color. \n\nDuring his first historic run for the presidency in 2016, Donald Trump made an impassioned plea to the black community. \"Give me a chance,\" he said. \"What the hell do you have to lose?\" According to Kathy Barnette, black Americans have nothing to lose, except for crime ridden communities, neighborhoods that have become shooting galleries, more social welfare programs, and the mocking indifference of the Democrat party. Barnette argues that even a cursory look into the black community reveals the destabilizing effect liberal policies have had on the black family. There was a time when Barnette bought into the same lie as everyone else-that if you're black, you must be a democrat. In fact, she was born into the Democrat party just as much as she was born into brown skin. There was no point of separation. Until she began to understand what it truly means to be black in America. Barnette contends that being black is more than just the color of her skin. It's a culture and a consciousness, too. In NOTHING TO LOSE, EVERYTHING TO GAIN, Barnette writes about why liberal policies have failed the black community time and time again - and will fail the larger American community as Democrats rush to the hard Left of the party. From the \"Great Society\" to Kanye West's ongoing war with the liberal establishment, this book provides sharp, eloquent commentary on the most pressing issues facing black Americans today: broken family structure, loss of identity, the legacy of slavery, and more.Barnette argues that President Trump has not been willing to presume that the \"black vote\" is a foregone conclusion resting comfortably in the back pockets of Democrats. With his plainspoken style and willingness to face harsh truths, the president has done more for the black community than any president since Abraham Lincoln. Barnette insists the time is now to get back what has been lost, to fix the brokenness, and to recognize and support those who are actually working in our favor. We have nothing to lose, and even more to gain.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Kathy Barnette",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/50741358-nothing-to-lose-everything-to-gain"
}