{
  "title": "Mistaking Africa: Curiosities and Inventions of the American Mind",
  "description": "For many Americans the mention of Africa immediately conjures up images of safaris, ferocious animals, strangely dressed tribesmen,” and impenetrable jungles. Although the occasional newspaper headline alerts us to genocide, AIDS, malaria, or civil war in Africa, most of us know very little about the continent. However we still carry strong mental images of Africa, which are reflected in American advertising, movies, amusement parks, cartoons, and many other corners of our society.Few think to question these perceptions or how they came to be so deeply lodged in the collective American consciousness. Curtis Keim’s Mistaking Africa looks at the historical evolution of this mindset and examines the role that popular media play in the creation of our mental images of Africa. Keim addresses the most prevalent myths and preconceptions and demonstrates how these prevent a true understanding of the enormously diverse peoples and cultures of Africa. Updated throughout, the second edition includes an entirely revised chapter on Africa in images, which analyzes portrayals of Africa in popular media, including print advertising by corporations such as Dow Chemical, ExxonMobil, IBM, Vogue magazine, Honda, and Snapple. New to the second edition as well is an appendix on learning more about Africa.ContentsPart One: Introduction1. Changing Our Mind about Africa2. How We LearnPart Two: Evolutionism3. The Origins of Darkest Africa”4. Our Living Ancestors”: Twentieth-Century Evolutionism5. Real Africa, Wise Africa6. We Should Help ThemPart Three: Further Misperceptions7. Cannibalism: No Accounting for Taste8. Africans Live in Tribes, Don’t They?9. Safari: Beyond Our Wildest Dreams10. Africa in ImagesPart Four: New Directions11. Race and Culture: The Same and the Other12. From Imagination to DialogueAppendix: Learning More",
  "genres": [
    "Nonfiction",
    "Africa",
    "History",
    "Academic"
  ],
  "author": "Curtis A. Keim",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/5073836-mistaking-africa"
}