{
  "title": "Dumb Luck",
  "description": "Beings of myth and legend exist.  My name’s Jack. I’m a relatively average guy working as an IT consultant. I had some interesting experiences as a soldier before I took up my current profession, but basically, I'm an average normal guy since then.  It was pure dumb luck that I met a gorgeous woman on an airplane, and we hit it off. I’m usually seated next to the fat, talkative guy, sweating alcohol out of his pores. Instead, I got to sit next to an exotic beauty, and she decided to be my companion for the day. You can’t make this stuff up!  It all started with that ‘truth stranger than fiction’ scenario, and yet...that is the least crazy thing about everything that followed in my life after that day. Beings of myth and legend exist. No, really! If you ever read about fantastic beings in a fairy tale or myth, the odds are they exist - or they are based on something equally fantastic. I always enjoyed reading about them, but never dreamed they existed.  What really twisted my noodle is that apparently, I am one. Hold onto your knickers, while I tell you about this crazy ride I’m on.  WARNING: This story is an adult fantasy for mature folks. As such, this story includes unusual interpretations of myth and legends, faerie violence, descriptions of genitalia, descriptions of sexual activities, mixing of US, UK, and Indian idioms, panamorous relationships, harem relationships, romance, bromance, BFFs, cursing, bathroom selfies, off-beat humor, eating food while naked or partially naked, drinking, going to the bathroom, the insurance industry, the IT consulting industry, and many other things that might possibly offend someone in our judgemental society.  If you are offended by any of those things, then go forth to enjoy life elsewhere. I wish you the best.  If you’re not dissuaded, then...",
  "genres": [
    "Harem",
    "Urban Fantasy",
    "Fantasy"
  ],
  "author": "J.G. Jerome",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/50746217-dumb-luck"
}