{
  "title": "All You Have to Do Is Ask: How to Master the Most Important Skill for Success",
  "description": "A set of tools for mastering the one skill standing between us and success: the ability to ask for the things we need to succeed.Imagine you’re on a deadline for a big project, and feeling overwhelmed. Or you're looking for a job, but can't seem to get your foot in the door. Or you're dying for tickets to a sold out concert, and all your leads have gone cold.What do these problems have in common? They can all be solved simply by reaching out to a colleague, friend, or wider network and making an ask.Studies show that asking for help makes us better and less frustrated at our jobs. It helps us find new opportunities and new talent. It unlocks new ideas and solutions, and enhances team performance. And it helps us get the things we need outside the workplace as well. And yet, we rarely give ourselves permission to ask. Luckily, the research shows that asking—and getting—what we need is much easier than we tend to think. Here, Wayne Baker shares a set of strategies—used at companies like Google, GM, and IDEO—that individuals, teams, and leaders can use to make asking for help a personal and organizational habit, including:• A quiz to identify your asking-giving style• SMART criteria for who, when, and how to ask• “Plug-and-play ” routines that make requests a standard component of meetings• Mini-games that incentivize asking within teams• The Reciprocity Ring, a guided activity that allows people to tap into the giving power of a networkPicking up where the bestselling book Give and Take left off, All You Have to Do Is Ask shows us how to ignite the cycle of giving and receiving by asking for the things we need.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Leadership",
    "Psychology",
    "Personal Development",
    "Relationships"
  ],
  "author": "Wayne E. Baker",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/50752149-all-you-have-to-do-is-ask"
}