{
  "title": "The Monkey Wars",
  "description": "The controversy over the use of primates in research admits of no easy answers. We have all benefited from the medical discoveries of primate research--vaccines for polio, rubella, and hepatitis B are just a few. But we have also learned more in recent years about how intelligent apes and monkeys really they can speak to us with sign language, they can even play video games (and are as obsessed with the games as any human teenager). And activists have also uncovered widespread and unnecessarily callous treatment of animals by researchers (in 1982, a Silver Spring lab was charged with 17 counts of animal cruelty). It is a complex issue, made more difficult by the combative stance of both researchers and animal activists.In The Monkey Wars , Deborah Blum gives a human face to this often caustic debate--and an all-but-human face to the subjects of the struggle, the chimpanzees and monkeys themselves. Blum criss-crosses America to show us first hand the issues and personalities involved. She offers a wide-ranging, informative look at animal rights activists, now numbering some twelve million, from the moderate Animal Welfare Institute to the highly radical Animal Liberation Front (a group destructive enough to be placed on the FBI's terrorist list). And she interviews a wide variety of researchers, many forced to conduct their work protected by barbed wire and alarm systems, men and women for whom death threats and hate mail are common. She takes us to Roger Fouts's research center in Ellensburg, Washington, where we meet five chimpanzees trained in human sign language, and we visit LEMSIP, a research facility in New York State that has no barbed wire, no alarms--and no protesters chantingoutside--because its director, Jan Moor-Jankowski, listens to activists with respect and treats his animals humanely. And along the way, Blum offers us insights into the many side-issues the intense battle to win over school kids fought by both sides, and the danger of transplanting animal organs into humans.\"As it stands now,\" Blum concludes, \"the research community and its activist critics are like two different nations, nations locked in a long, bitter, seemingly intractable political standoff....But if you listen hard, there really are people on both sides willing to accept and work within the complex middle. When they can be freely heard, then we will have progressed to another place, beyond this time of hostilities.\" In The Monkey Wars , Deborah Blum gives these people their voice.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Psychology",
    "Biology",
    "Animals"
  ],
  "author": "Deborah Blum",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/507590.The_Monkey_Wars"
}