{
  "title": "Blockchain Bubble or Revolution: The Present and Future of Blockchain and Cryptocurrencies",
  "description": "Some experts say that cryptocurrencies and blockchains are just a scam; others say they're \"the most important invention since the internet.\" It's hard to tell who's right. Authored by Product Managers from Google, Microsoft, and Facebook, Bubble or Revolution cuts through the hype to offer a balanced, comprehensive, and accessible analysis of blockchains and cryptocurrencies.You'll learn the core concepts of these technologies and understand their strengths and weaknesses from real-world case studies; dive deep into their technical, economic, political, and legal complexities; and gain insights about their future from exclusive interviews with dozens of tech industry leaders. No coding or math needed!Are cryptocurrencies and blockchains a bubble or a revolution? We'll help you decide for yourself.What's inside:Bitcoin and the blockchainHow Bitcoin and blockchains work from a technical perspective with no assumed technical knowledgeSatoshi Nakamoto and the history of Bitcoin, the original blockchainA thorough overview of crucial crypto concepts (eg. blocks, keys, mining, nodes, etc.)Frameworks for understanding when it actually makes sense to use blockchainMajor application scenarios for blockchain and cryptocurrencies and where it'll fall flatPublic blockchains and altcoinsEmerging trends in blockchain technologyWhat you should know before buying any cryptocurrencyAn overview of Etherum and smart contractsAn overview of the strengths and weaknesses of the top altcoins and stable coins, including Monero (XMR), Tether (USDT), and Bitcoin Cash (BCH)Alternatives to blockchain and cryptocurrenciesNew kinds of decentralized ledger technology (dlt)The economics of both traditional payment methods and cryptocurrenciesCryptocurrency security best practices and major breach case studiesPrivate blockchainsHow blockchain, cryptocurrencies, and traditional banking and finance will interact with one another in the futurePublic blockchains vs private blockchainsLimitations and shortcomings of public blockchains and cryptocurrenciesThe role of blockchain in the strategy of top tech companies like Facebook and MicrosoftCase studies of how non-tech companies are effectively utilizing blockchain (eg. Walmart using it to prevent foodborne illness)Business blockchain case studies ranging from gaming (e.g. Xbox) to cloud services (e.g. Microsoft Azure's blockchain-as-a-service and Amazon's AWS offering)Blockchain's use for big data, internet of things (IoT), and machine learning (ML)Cryptocurrency regulation and policyICOs vs STOs vs IPOsICOs' status as securitiesThe SEC's STO rules and Reg A+/CF/D/SKYC and AML lawsThe debate over whether cryptocurrencies are securitiesThe official stance of various countries on cryptoAn overview of crypto policy and regulatory hurdlesThe role of crypto in emerging markets and ChinaDigital democracy and voting on the blockchainThe future of decentralized technologyIf, how, and when the tokenization of national currencies will play outFacebook and WhatsApp's upcoming cryptocurrenciesCurrency tokenization and China's efforts to tokenize the yuanBlockchain, IoT, and the tangleCryptocurrencies vs. fiat vs. the gold standardPredictions about the future of money, business, and currencyWhy blockchains would do better on Mars than Earth",
  "genres": [
    "Finance",
    "Nonfiction",
    "Business",
    "Technology",
    "Economics",
    "Science",
    "Politics"
  ],
  "author": "Neel Mehta",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/50746552-blockchain-bubble-or-revolution"
}