{
  "title": "The Gods of Women Have Gone Mad",
  "description": "“A quietly bursting story of a society stuck in the ancient past and in sharp opposition to modernity.” -- Maria Diamond, The Guardian  Rolami is a place of culture, tradition, and gods... and it's a place where young women are circumcised.  Lami, a privileged daughter of a prominent chief, has avoided her forced circumcision for four seasons. But even though she's powerful and determined, she can't escape tradition forever. When her best friend returns from exile to comfort her, Lami discovers that the consequences of her culture's cruel rites of passage are even worse than she had imagined.  Lami and her friends must fight to bring revolution to Rolami. But will their changes be for the better or the worse? That depends on who is telling the story and who is listening...  The Gods of Women Have Gone Mad is at once a raw and candid account of the horrors of female genital mutilation, a heartbreaking coming-of-age dystopian story, and powerful and moving tale of the indomitable spirit of women in the face of immense adversity.  Read The Gods of Women Have Gone Mad with your book club or discussion group and explore some of the most important issues facing women today.   Wole Akosile is a psychiatrist and addiction medicine specialist based on the Gold Coast, Australia. He is also an Afro-Australian author, novelist, and playwright. His works have been performed in several sold-out stage plays at the University of Ibadan and University College Hospital Ibadan, Nigeria. While living in Africa, he founded the theatre groups Christ Act lll and Peacemakers Theatre. When he is not writing, he loves to spend time with his family and he is a gym enthusiast who likes to beast it up. The Gods of Women Have Gone Mad is his debut novel.",
  "genres": [
    "Fiction",
    "Religion"
  ],
  "author": "Wole Akosile",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/50771889-the-gods-of-women-have-gone-mad"
}