{
  "title": "No Filter: The Inside Story of Instagram",
  "description": "Award-winning reporter Sarah Frier reveals an inside, never-before-told, behind-the-scenes look at how Instagram defied the odds to become one of the most culturally defining apps of the decade. Since its creation in 2010, Instagram’s fun and simple interface has captured our collective imagination, swiftly becoming a way of life. In No Filter: The Inside Story of Instagram, technology reporter Sarah Frier explains how Instagram’s founders married art and technology to overcome skeptics and to hook the public on visual storytelling. At first, Instagram initially attracted artisans, but then the platform exploded in popularity among the masses, creating an entire industry of digital influencers that’s now worth tens of billions of dollars. Eighteen months after Instagram’s launch and explosive growth, the founders—Kevin Systrom and Mike Krieger—made the gut-wrenching decision to sell the company to Facebook. For most companies, that would be the end of the story; but for Instagram, it was only the beginning. Instagram borrowed some lessons from Facebook and rejected others, until eventually its success stirred tension with Facebook’s CEO Mark Zuckerberg, just as Facebook became embroiled in a string of public crises. Frier unearths the details that led to the cofounders’ departure, bringing to light dramatic moments unknown to the public until now. At its heart, No Filter draws on unprecedented exclusive access—from the founders of Instagram, as well as employees, executives, and competitors; hedge fund billionaire Ray Dalio; Anna Wintour of Vogue; Kris Jenner of the Kardashian-Jenner empire; and a plethora of influencers, from fashionistas with millions of followers to owners of famous dogs worldwide—to show how Instagram has fundamentally changed the way we communicate, shop, eat, and travel. The book brings readers inside users’ strategies to craft their personal image and fame, explaining how the company’s product decisions have affected the structure of our society. From teenagers to the pope, No Filter tells the captivating story of how Instagram not only created a new industry but also changed our lives.",
  "genres": [
    "Business",
    "Nonfiction",
    "Technology",
    "Biography",
    "Audiobook",
    "History",
    "Science"
  ],
  "author": "Sarah Frier",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/50772888-no-filter"
}