{
  "title": "Smoke and Mistletoe",
  "description": "What do you do when your life finally calms? Celebrate...  Over the last few months, life at Redwood Supernatural University has been busy, overwhelming, and sometimes downright terrifying, but it’s finally winter break. With two and a half weeks of downtime, I'll get the time I've desperately wanted to just hang out with friends, family, and my boyfriends. After everything we've been through this semester, don't we deserve a little time to relax?  When the guys come to my hometown, I'm surrounded by gifts, love, and all the embarrassing mother/boyfriend bonding that I never knew I needed. And, if I'm being honest, the hot chocolate isn't the only thing getting steamy. But my mom doesn't need to know about that part.  Unfortunately, winter break isn’t all mistletoe, magic, and mini marshmallows. As if being kidnapped by my crazy ex-boyfriend and getting stuck as genie-smoke wasn’t bad enough, now I’m finding out that there’s a lot more to my supe identity than I’d ever imagined. At least I have my six guys to help me navigate the craziness that is being home for the holidays.  I got this...I think.  Book 3 of the Best Wishes Series is a holiday novella but is essential to the storyline and must be read between book 2 (Smoke and Survival) and book 4 (Smoke and Betrayal).   The Best Wishes Series is a seven-book WhyChoose/Reverse Harem saga featuring MMFMMMM meaning there is M/M content, and the female main character doesn't have to choose between her love interests. Please note: while the romance is medium burn, the world and magic building will follow a slower pace due to the series’ setting in the human world.  This book contains references involving PTSD, sexual assault recollections, domestic violence, and other themes that some readers may find triggering.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Vampires",
    "Magic",
    "Romance",
    "Fantasy",
    "Demons"
  ],
  "author": "A.J. Macey",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/50753118-smoke-and-mistletoe"
}