{
  "title": "Carved in Darkness",
  "description": "Fifteen years ago, a psychotic killer abducted seventeen-year-old Melissa Walker. For 83 days she was raped, tortured, and then left for dead in a deserted churchyard...but she was still alive.  Melissa begins a new life as homicide inspector Sabrina Vaughn. With a new face and a new name, it's her job to hunt down murderers―a job she does very well.  But when Michael O'Shea, a childhood acquaintance with a suspicious past, suddenly finds her, he brings to life the nightmare Sabrina has long since buried.  Believing his sister was recently murdered by the same monster who attacked Sabrina, Michael is dead set on getting his revenge―using Sabrina as bait.  Praise:  Named a Best Debut of 2013 by Suspense Magazine  Starred Review\"Prepare to be overwhelmed by the tension and moodiness that permeates this edgy thriller. Beaumont's ability to keep the twists coming even when the answer seems obvious is quite potent.\"―Library Journal (starred review) and Debut of the Month  \"Pulse-pounding terror, graphic violence and a loathsome killer.\"―Kirkus Reviews  \"Beaumont knows how to keep you on the edge of your seat...Buckle up for the ride of a lifetime.\"―Suspense Magazine  \"Maegan Beaumont might be new to thriller scene, but her debut thriller, Carved in Darkness, promises to be the first in a long line of novels. Be warned, however, this novel isn't for those who jump a mile every time they hear something go bump in the night. But for anyone who's ever dreamed about enacting a just revenge, this book is for you. Beaumont knows how to cook up and serve a dish called revenge, but she doesn't serve it cold. She serves it sizzling hot.\"―Vincent Zandri, bestselling author of The Remains and Murder by Moonlight",
  "genres": [
    "Thriller",
    "Mystery",
    "Suspense",
    "Mystery Thriller",
    "Romantic Suspense",
    "Dark",
    "Fiction"
  ],
  "author": "Maegan Beaumont",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/50754680-carved-in-darkness"
}