{
  "title": "Feast of Shadows: Part 1",
  "description": "Librarian's Note: this is an alternate cover edition for ASIN B07T7ZYLPT.One part mystery. One part savagery. Three parts magic.Years ago, driven by greed, men penetrated the last soft places on earth. Out of the clear-cut jungle--out of nowhere--a man appeared, eyes rimmed in blue. The last shaman. A man who could make magicNow a recluse, known to modern society only as an eccentric chef, he is locked in an occult battle with an unseen nemesis. Their prize: a most unusual book, penned before the fall of Babylon, said to contain the recipe for eternal night.Across five stories, five victims of inexplicable events narrate their encounters with an enigmatic titan of magic, a man without a past, whose tattooed palms hold the power to alter human history--or to end it.Agony in VioletAs his marriage crumbles around him, a brilliant medical scientist searches for the source of a horrific illness that leaves its victims ashen and wasted. With no apparent connections between them, his only clues are the strange symbols that appear near the bodies after death. When a child is stricken, old traumas resurface and the good doctor turns in desperation to a curious consultant, who reveals that not every labyrinth has walls, and that the horrors you face there are always your own.Curse of the Red Dagger<A troubled young woman, pregnant with a billionaire's baby, disappears without a trace. Determined to save his child, he offers her best friend one million dollars to find her. But following in her friend's footsteps proves more difficult than she expected. Everyone connected to the disappearance seems desperate to hide the truth. As they each fall to mysterious circumstances, death closes around her, and her only chance to save her friend is to sacrifice herself to an ancient power.To the White of the BoneA mangled body floats to the surface of a reservoir with nothing to distinguish the victim save for a binding knot branded under her tongue. The case is routed to the NYPD's resident occultist, an uncompromising homicide detective whose history of unusual and uncertain results has left her career in shambles. Dodging an inquiry into a fatal shooting and pursued by a homicidal witch, she contemplates a devil's bargain to stop the killer, who just may be the Lord of Shadows.The Song on the GreenOne by one, the children of an upscale Pennsylvania neighborhood are found crippled and catatonic, their minds seemingly vanished. As the panicked community searches in vain for a human predator, they neglect the only witness, an eight-year-old boy with a menagerie of strays, who is left to stand alone against the very creature that hunts him.Bright BlackAfter carelessly killing an innocent, a beautiful aristocrat is cursed with eternal youth. Forced to endure as waves of friends and loved ones wither and fade around her, she wanders the ages in search of meaning--from the wars of Napoleon to the Victorians in India, from the Great Depression to the collapse of the Iron Curtain. Recruited as a spy in an occult war, she soon tires of blood and loss and retreats to a small village in the mountains, where an accident reveals missing memories and an unfortunate truth: that the mistakes of five lifetimes are not so easily fled.Part urban fantasy, part hard-boiled whodunit, FEAST OF SHADOWS is a five-course occult mystery and the most devilish meal you'll ever read. The complete epic conundrum will be released in two parts.",
  "genres": [],
  "author": "Rick  Wayne",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/50783078-feast-of-shadows"
}