{
  "title": "Pharma: Greed, Lies, and the Poisoning of America",
  "description": "Award-winning journalist and New York Times bestselling author Gerald Posner traces the heroes and villains of the trillion-dollar-a-year pharmaceutical industry and uncovers how those once entrusted with improving life have often betrayed that ideal to corruption and reckless profiteering—with deadly consequences. Pharmaceutical breakthroughs such as anti­biotics and vaccines rank among some of the greatest advancements in human history. Yet exorbitant prices for life-saving drugs, safety recalls affecting tens of millions of Americans, and soaring rates of addiction and overdose on pre­scription opioids have caused many to lose faith in drug companies. Now, Americans are demanding a national reckoning with a monolithic industry. Pharma introduces brilliant scientists, in-corruptible government regulators, and brave whistleblowers facing off against company exec­utives often blinded by greed. A business that profits from treating ills can create far deadlier problems than it cures. Addictive products are part of the industry’s DNA, from the days when corner drugstores sold morphine, heroin, and cocaine, to the past two decades of dangerously overprescribed opioids. Pharma also uncovers the real story of the Sacklers, the family that became one of America’s wealthiest from the success of OxyContin, their blockbuster narcotic painkiller at the center of the opioid crisis. Relying on thousands of pages of government and corporate archives, dozens of hours of interviews with insiders, and previously classified FBI files, Posner exposes the secrets of the Sacklers’ rise to power—revelations that have long been buried under a byzantine web of interlocking companies with ever-changing names and hidden owners. The unexpected twists and turns of the Sackler family saga are told against the startling chronicle of a powerful industry that sits at the intersection of public health and profits. Pharma reveals how and why American drug com­panies have put earnings ahead of patients.",
  "genres": [
    "Nonfiction",
    "Business",
    "Science",
    "History",
    "Health",
    "Politics",
    "Health Care"
  ],
  "author": "Gerald Posner",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/50785887-pharma"
}