{
  "title": "The Loneliest Vampire in NYC",
  "description": "Stanley is just your average everyday vampire trying to make a go of it in old New York. He doesn’t have much in the way of friends or career prospects and he can’t get a girlfriend. And as if life in New York City wasn’t hard enough, he finds he’s the only thing standing between the vampire overlord and the destruction of Manhattan. He does get some assistance however from Poe, a mysterious Cheshire like cat, a doddering old wizard named Vincent and Harry Bandini the world’s greatest escape artist with an ego to match. Things look up for Stanley on the relationship front when he meets Anika Andrews, a reporter for the New York Press investigating rumors of supernatural and occult phenomenon taking place deep beneath the city’s subway lines. Stanley discovers though that battling evil and dating are tough acts to juggle. He also has the thorny problem of broaching his undead status to the lovely Anika. But worlds collide when Anika is kidnapped by the cabal of evil vampires plotting the city’s destruction – and Stanley’s rescue and escape from the forces of evil take him and his would be girlfriend on an unintended trip across several universes. Fortunately in the course of their adventures they come across the inscrutable Chung Lee Soo the famous Chinese conjurer and inventor. He may have the answer to all their problems if they can decipher his riddles and find the source of his power, the elusive Dark Element. The Loneliest Vampire in NYC is a rollicking adventure/suspense story with a healthy dose of black humour. Best described as The Hitchhikers Guide to the Galaxy meets Interview with a Vampire. An entertaining fast paced read and an antidote to the usual dark, brooding novels of the vampire genre. Well-crafted characters and a clever plot make it an addictive page-turner you won’t want to put down.",
  "genres": [
    "Urban Fantasy",
    "Vampires"
  ],
  "author": "Alan Forsythe",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/12528848-the-loneliest-vampire-in-nyc"
}