{
  "title": "Alenia Bennett: And the earthly death matrix",
  "description": "Alenia Bennett, 32 years old, very clever, long-term student, hobby quantum physicist, spiritual anarchist and beautiful, lands in the earthly death matrix through a brutal attack. Unknown powers want to lead her to the Terran death machine. The goal of these unknown powers is the complete destruction of the consciousness, soul, body and spirit of Alenia Bennett. These unknown powers not only usually want to kill Alenia Bennett, they want to wipe her out in all universes and times. But Alenia Bennett, who is very warm and very friendly, does not give in. Because her spirit, her soul and her consciousness are strong and fight against death. Will Alenia Bennett reach her true goal? Her true goal is eternal life! (…) Could it really be that absolutely everything, without any limitation, is an invention of thought and consciousness? Yes!And if it is not so, what then?Then you have to find or invent what creates reality.Because if you don't find or invent that which creates reality, the earthly death matrix will take care of you.The earthly death matrix is an ancient but outdated program that must be erased; for it was created by forces that have long since been extinguished.But, these extinct powers have propagated in you. That and only that is your real problem. Because the earthly death matrix only wants this: It wants to destroy your life, your happiness, your intelligence, your soul, your beauty, your joy, your love, your freedom and your tenderness; to sink them in a dark sea of unconsciousness.Your only chance is the flame of love and light.The flame of love and light gives you the opportunity to understand everything and live forever.And if it is not the flame of love and light that can save you from the Black Sea of unconsciousness, invent something that can save you from it.",
  "genres": [],
  "author": "Burkhard Voges",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/50805488-alenia-bennett"
}