{
  "title": "Heaven and Hell: A History of the Afterlife",
  "description": "A New York Times bestselling historian of early Christianity takes on two of the most gripping questions of human existence: where did the ideas of heaven and hell come from, and why do they endure?What happens when we die? A recent Pew Research poll showed that 72% of Americans believe in a literal heaven, 58% in a literal hell. Most people who hold these beliefs are Christian and assume they are the age-old teachings of the Bible. But eternal rewards and punishments are found nowhere in the Old Testament and are not what Jesus or his disciples taught. So where did the ideas come from? In clear and compelling terms, Bart Ehrman recounts the long history of the afterlife, ranging from The Epic of Gilgamesh up to the writings of Augustine, focusing especially on the teachings of Jesus and his early followers. He discusses ancient guided tours of heaven and hell, in which a living person observes the sublime blessings of heaven for those who are saved and the horrifying torments of hell for the damned. Some of these accounts take the form of near death experiences, the oldest on record, with intriguing similarities to those reported today. One of Ehrman’s startling conclusions is that there never was a single Greek, Jewish, or Christian understanding of the afterlife, but numerous competing views. Moreover, these views did not come from nowhere; they were intimately connected with the social, cultural, and historical worlds out of which they emerged. Only later, in the early Christian centuries, did they develop into the notions of eternal bliss or damnation widely accepted today. As a historian, Ehrman obviously cannot provide a definitive answer to the question of what happens after death. In Heaven and Hell, he does the next best thing: by helping us reflect on where our ideas of the afterlife come from, he assures us that even if there may be something to hope for when we die, there is certainly nothing to fear.",
  "genres": [
    "Religion",
    "History",
    "Nonfiction",
    "Philosophy",
    "Christianity",
    "Theology",
    "Audiobook"
  ],
  "author": "Bart D. Ehrman",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/50793705-heaven-and-hell"
}