{
  "title": "Awakening the Heroes Within: Twelve Archetypes to Help Us Find Ourselves and Transform Our World",
  "description": "A program for activating and applying Pearson's twelve archetypes to aid inner development and the quest for wholeness\"The heroic quest is about saying 'yes' to yourself and in so doing, becoming more fully alive and more effective in the world.... The quest is replete with dangers and pitfalls, but it offers great rewards: the capacity to be successful in the world, knowledge of the mysteries of the human soul, and the opportunity to find and express your unique gifts in the world.\"In this bold and original work, Carol S. Pearson shows that the heroic quest isn't just for certain people under special circumstances. Exploring the many heroic paths available to each of us, at every point in our lives, her innovative program enables us to live heroically by activating and applying twelve archetypes in our lives.This companion to the bestselling The Hero Within outlines twelve archetypal patterns that can aid inner development and the quest for wholeness.These archetypes are inner guides that can help us prepare for the journey, by learning how to become successful members of society; embark upon the quest, by becoming initiated into the mysteries of the human soul; and return to transform our lives as a result of claiming our uniqueness and personal power.Writing for individuals seeking to realize their full potential and professionals engaged in empowering others, Pearson shows how journeys differ by the age, gender, and cultural background of the seeker, and how archetypes help awaken the capacities of our psyches. A unique diagnostic test, the Heroic Myth Index, and exercises are included to help us understand and awaken our inner guides.AuthorBiography: Carol S. Pearson, Ph.D., is the author of many bestselling and respected works on archetypes, including Awakening the Heroes Within. She is president of CASA: The Center for Archetypal Studies and Applications and is the senior editor of The Inner Edge: A Resource for Enlightened Business Practice.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Writing",
    "Spirituality",
    "Philosophy",
    "Mythology"
  ],
  "author": "Carol S. Pearson",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/50782.Awakening_the_Heroes_Within"
}