{
  "title": "The Hour of Our Death",
  "description": "This remarkable book--the fruit of almost two decades of study--traces in compelling fashion the changes in Western attitudes toward death and dying from the earliest Christian times to the present day. A truly landmark study, The Hour of Our Death reveals a pattern of gradually developing evolutionary stages in our perceptions of life in relation to death, each stage representing a virtual redefinition of human nature.Starting at the very foundations of Western culture, the eminent historian Phillipe Aries shows how, from Graeco-Roman times through the first ten centuries of the Common Era, death was too common to be frightening; each life was quietly subordinated to the community, which paid its respects and then moved on. Aries identifies the first major shift in attitude with the turn of the eleventh century when a sense of individuality began to rise and with it, profound death no longer meant merely the weakening of community, but rather the destruction of self . Hence the growing fear of the afterlife, new conceptions of the Last Judgment, and the first attempts (by Masses and other rituals) to guarantee a better life in the next world. In the 1500s attention shifted from the demise of the self to that of the loved one (as family supplants community), and by the nineteenth century death comes to be viewed as simply a staging post toward reunion in the hereafter. Finally, Aries shows why death has become such an unendurable truth in our own century--how it has been nearly banished from our daily lives--and points out what may be done to \"re-tame\" this secret terror.The richness of Aries's source material and investigative work is breathtaking. While exploring everything from churches, religious rituals, and graveyards (with their often macabre headstones and monuments), to wills and testaments, love letters, literature, paintings, diaries, town plans, crime and sanitation reports, and grave robbing complaints, Aries ranges across Europe to Russia on the one hand and to England and America on the other. As he sorts out the tangled mysteries of our accumulated terrors and beliefs, we come to understand the history--indeed the pathology--of our intellectual and psychological tensions in the face of death.",
  "genres": [
    "History",
    "Nonfiction",
    "Death",
    "Philosophy",
    "Sociology",
    "Religion",
    "Anthropology"
  ],
  "author": "Philippe Ariès",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/507908.The_Hour_of_Our_Death"
}