{
  "title": "Author in Chief: The Untold Story of Our Presidents and the Books They Wrote",
  "description": "Based on a decade of research and reporting, Author in Chief tells the story of America’s presidents as authors—and offers a delightful new window into the public and private lives of our highest leaders. Most Americans are familiar with Abraham Lincoln’s famous words in the Gettysburg Address and the Eman­cipation Proclamation. Yet few can name the work that helped him win the presidency: his published collection of speeches entitled Political Debates between Hon. Abraham Lincoln and Hon. Stephen A. Douglas. Lincoln labored in secret to get his book ready for the 1860 election, tracking down newspaper transcripts, editing them carefully for fairness, and hunting for a printer who would meet his specifications. Political Debates sold fifty thousand copies—the rough equivalent of half a million books in today’s market—and it reveals something about Lincoln’s presidential ambitions. But it also reveals something about his heart and mind. When voters asked about his beliefs, Lincoln liked to point them to his book. In Craig Fehrman’s groundbreaking work of history, Author in Chief, the story of America’s presidents and their books opens a rich new window into presidential biography. From volumes lost to history—Calvin Coolidge’s Autobiography, which was one of the most widely discussed titles of 1929—to ones we know and love—Barack Obama’s Dreams from My Father, which was very nearly never published—Fehrman unearths countless insights about the presidents through their literary works. Presidential books have made an enormous impact on American history, catapulting their authors to the national stage and even turning key elections. Beginning with Thomas Jefferson’s Notes on the State of Virginia, the first presidential book to influence a campaign, and John Adams’s Autobiography, the first score-settling presiden­tial memoir, Author in Chief draws on newly uncovered information—including never-before-published letters from Andrew Jackson, John F. Kennedy, and Ronald Reagan—to cast fresh light on the private drives and self-doubts that fueled our nation’s leaders. We see Teddy Roosevelt as a vulnerable first-time author, struggling to write the book that would become a classic of American history. We see Reagan painstakingly revising Where’s the Rest of Me?, a forgotten memoir in which he sharpened his sunny political image. We see Donald Trump negotiating the deal for The Art of the Deal, the volume that made him synonymous with business savvy. Alongside each of these authors, we also glimpse the everyday Americans who read them. Combining the narrative felicity of a journalist with the rigorous scholarship of a historian, Fehrman delivers a feast for history lovers, book lovers, and everybody curious about a behind-the-scenes look at our presidents.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "Presidents",
    "American History",
    "Writing"
  ],
  "author": "Craig Fehrman",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/50802548-author-in-chief"
}