{
  "title": "Coming to Her Rescue",
  "description": "When Navy SEAL Jake Hendrix attends a charity bachelor/bachelorette auction as a favor for a friend, he’s stunned to see his squad mate’s gorgeous sister, Hanna Masterson, walk across the stage. She’s grown even more stunning in the years since he’d met (and very nearly made out with) her at the end of basic training. When Jake overhears other bidders talking about her, his alpha protector instinct kicks in and he decides to bid on her himself. He thinks he’s saving her. What he didn’t expect was how upset she’d be at him.  Hanna has developed a checklist of qualities she wants in a man. Someone reliable, dependable, and family oriented who can provide for her and their children. She doesn’t need the likes of Jake Hendrix—smoking hot as he is—getting in the way of her man hunt. She’d been hoping the auction might pair her with a potential long-term match, but alas she just got her brother’s hot squad mate who has “one night only” written all over him.  But the date actually goes well—really well. Best sex of her life well. But the following day, Jake immediately pulls back, just as she expected. Romance only gets in the way of doing his job: protection has no room for passion. Resigned to their night together being nothing more than a blip in the road, Hanna’s unsettled when a pregnancy test turns that blip into a major speedbump.  Before she can tell Jake she’s pregnant, something far more unexpected lands on her plate. One of her high-profile clients has been murdered, and because he’s shared certain information with Hanna, the killers will stop at nothing to silence her.  Despite his promises to stay uninvolved, Jake can’t help but protect Hanna, baby bump and all, insisting they go on the run as they dig deeper into the dangerous situation they’ve found themselves in. But as the threat closes in on their secluded safe house, their biggest problem might just be falling in love and losing it all…  This novel contains sexual content, violence, profanity, and scenes with referenced substance abuse.",
  "genres": [
    "Romance",
    "Contemporary",
    "Military Fiction"
  ],
  "author": "Katie Knight",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/50803472-coming-to-her-rescue"
}