{
  "title": "Elijah Wadsworth and the Druid's Dance",
  "description": "\"Would my death save the world? Possibly. But I would never have the courage to die for the world. I would only have courage enough to die for her...\"Elijah Wadsworth lost his parents and twin sister in what he thought was little more than a tragic accident. But five years later, when Elijah begins manifesting strange abilities--which he neither understands nor can control--he discovers his family has been at the center of a cosmic battle for centuries... and his family's death was likely no accident at all. A mysterious \"girl in black\" with dark, magical abilities pursues him, hoping to lure him to her cause. After coming into possession of a mystical stone, which transports Elijah into his deceased father’s ancient memories, Elijah and his closest friends must discover the source of his power together lest his newfound abilities drain his very soul, and open up our world to the blight of Samhuinn. When a girl he loves, however, is threatened he must make a choice to either save her by joining the sorceress, the \"girl in black,\" or save the world. Elijah Wadsworth and the Druid’s Dance is the first book in a modern fantasy that features a thrilling journey into the world of Celtic mythology, shocking plot twists, compelling characters, and an unlikely hero. If you liked the cynical wit of Jim Butcher’s Harry Dresden in the Dresden Files, the love triangle in Stephanie Meyer’s Twilight, or the magical worlds Lev Grossman’s The Magicians and Orson Scott Card’s The Lost Gate in The Mither Mages Trilogy then you will love Theophilus Monroe’s new contemporary fantasy. With an enthralling romance, a compelling adventure, and a magical journey into the world of Celtic myth (including an encounter with an eccentric wizard from Arthurian lore), Monroe’s highly anticipated follow-up series to Druidess has something for everyone.",
  "genres": [
    "Fantasy"
  ],
  "author": "Theophilus Monroe",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/50828619-elijah-wadsworth-and-the-druid-s-dance"
}