{
  "title": "The Seven Lives of Grace",
  "description": "She has only seven days to choose her destiny...\n\n\n\n  Grace leads a fairy-tale-free existence in the rainy Seattle, struggling to provide for her frail mother and younger sister. But when a mysterious package arrives from her eccentric aunt, she is suddenly thrown into a whirlpool of unusual events.\n\n  Named the next \"carrier of the gifts\", she has only one week to sort through her supernatural inheritance or lose it all.\n\n  But in this story crystal slippers don't fit, \"fairy godmothers\" don't show up, and prince might not be so easy to charm.\n\n  As Grace blunders through unpredictable magic that challenges her beliefs and uncovers the wounds of her past, everything she holds dear is put on the line. Will she rise up to her true calling before the clock strikes midnight on her 25th birthday?\n\nThis contemporary fantasy is both fun and inspirational. A fast read suitable for all ages with some intrigue and romance thrown in the mix. Get your copy now.\n\nFrom the readers:\n\n\n\n\"I have never read a book that combined romance, mystery, and spirituality. I couldn’t put it down.\"\n\n\n\n\"I loved this sweet story that takes a very unique approach to the way we view gifts of character in our lives.\"\n\n\n\n\"Thought-provoking and fun at the same time. I laughed and I cried. It had everything you want for a great read.\"\n\n\n\n\"It's a story I'd happily share with any friends from 90 down to 14 years old because the protagonist deals with issues any woman is confronted with at some point in life.\"\n\n\n\n\"There were twists and turns that kept me so intrigued to keep reading how it ends. It did not disappoint!\"\n\n\n\n\"The main character is so relatable. I found it motivational and inspiring to lay excuses aside and fight for my dreams.\"",
  "genres": [
    "Fantasy",
    "Clean Romance",
    "Romance",
    "Christian"
  ],
  "author": "Elena Shelest",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/50831257-the-seven-lives-of-grace"
}