{
  "title": "Galápagos",
  "description": "Vonnegut was in his early sixties and his career, still successful, drawing toward a kind of bitter summation when Galapagos (1985) was published. His early work with its unequivocal statement of absurdity and hopelessness was now almost four decades behind when he completed this meditation on Darwinism, fate and the essential irrelevance of the human condition.Humanity has in the millions of years after inevitable holocaust and exile transmogrified into a race of not-quite-human seals on Darwin's Galapagos Islands. Leon Trotsky Trout, the son of Vonnegut's wretched familiar character Kilgore Trout, watches and broods over his no-longer-human descendants who have made natural selection a matter of debased survivalism. Using a device common in his novels after Slaughterhouse-Five, the material is presented in the form of a transcript or memoir; Trout unhappily witnesses a sad outcome which may nonetheless represent the best of all human possibilities. Trout's father Kilgore, in ghostly form, remains in communication, urging his son to cease observing and exit, but Leon will not take the opportunity, feeling linked to the pathetic, morphed shards of humanity who remain on the Islands. Whether the survival of the seals constitutes human survival, whether Kilgore and his son are imaginary fragments of evolutionary decay lurk as questions beneath a sequence of events which show Vonnegut trapped in the Age of Reagan.Vonnegut is trying to see through (rather than to shape) his material; the theme of the novel represents a kind of apotheosis and never has Vonnegut's ambiguous despair been more clearly revealed or more clearly made the engine of his narrative.ABOUT THE AUTHORKurt Vonnegut (1922-2007) is one of the most beloved American writers of the twentieth century. Vonnegut's audience increased steadily since his first five pieces in the 1950s and grew from there. His 1968 novel Slaughterhouse-Five has become a canonic war novel with Joseph Heller's Catch-22 to form the truest and darkest of what came from World War II.Vonnegut began his career as a science fiction writer, and his early novels--Player Piano and The Sirens of Titan--were categorized as such even as they appealed to an audience far beyond the reach of the category. In the 1960s, Vonnegut became closely associated with the Baby Boomer generation, a writer on that side, so to speak.Now that Vonnegut's work has been studied as a large body of work, it has been more deeply understood and unified. There is a consistency to his satirical insight, humor and anger which makes his work so synergistic. It seems clear that the more of Vonnegut's work you read, the more it resonates and the more you wish to read. Scholars believe that Vonnegut's reputation (like Mark Twain's) will grow steadily through the decades as his work continues to increase in relevance and new connections are formed, new insights made.ABOUT THE SERIESAuthor Kurt Vonnegut is considered by most to be one of the most important writers of the twentieth century. His books Slaughterhouse-Five (named after Vonnegut's World War II POW experience) and Cat's Cradle are considered among his top works. RosettaBooks offers here a complete range of Vonnegut's work, including his first novel (Player Piano, 1952) for readers familiar with Vonnegut's work as well as newcomers.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Classics",
    "Humor",
    "Literature",
    "Novels",
    "American"
  ],
  "author": "Kurt Vonnegut Jr.",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/12529697-gal-pagos"
}