{
  "title": "The Breakup Artist",
  "description": "Love romantic comedies? Enjoy the sizzling new standalone romance from USA Today bestselling author, Lila Monroe!  I’m an expert in break-ups. From the slow fade, to extreme ghosting, to, ‘but you never said I couldn’t send pics of my junk to your step-sister on Instagram’ - I’ve seen it all… and built a mini-empire along the way. My blog, the Break-Up Artist, uses my past heartache to help people move on - and avoid weeping on the floor at 3am consuming their body weight in spray cheese and Oreos. Ahem.  Now, I have a new job that could mean the big-time: helping a famous Hollywood it-couple navigate their tricky break-up. Except not everyone wants them Splitsville. The movie studio needs to keep them together to promote their big movie, and they’ve sent someone to make sure I fail in my first VIP gig.  Wes Baxter. Also known as my ex. Also ALSO known as, the guy who broke my heart so thoroughly, I had to turn myself into a self-help guru just to get over him.  I’m determined to follow my own advice (no drooling over Wes’s perfect abs, or remembering how he rocked my world) but being trapped together at a luxe country retreat isn’t helping things… And neither is Wes’s early-morning naked swim habit. Soon, love is in the air, the sparks between us are hotter than ever, and I’m seriously questioning my ‘no backsies’ policy.  Wes swears he’s changed. He wants to try again, and he’s got an annoyingly sexy way of convincing me. But can second chances really work? Or has the Break-Up Artist finally met her match?  Find out in the sizzling new romantic comedy from USA Bestselling author, Lila Monroe!  Cupids series: 1 Cupids Anonymous 2 What’s Your Sign? 3 The Romeo Effect 4 The Break-Up Artist",
  "genres": [
    "Second Chance",
    "Romance",
    "Contemporary",
    "Humor",
    "Second Chance Romance",
    "New Adult",
    "Contemporary Romance"
  ],
  "author": "Lila Monroe",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/50828542-the-breakup-artist"
}