{
  "title": "Fighting For Her",
  "description": "Beauty and the Beast? Nah…this isn’t some sweet fairy tale. FIGHTING FOR HER is about danger, action, and a whole lot of hot romance.  He’s been called a beast…and he likes the title.   Rick Williams is big, bad, and not someone you want to have as an enemy. As an agent with Wilde Securities, his job is to kick butt and take names. Protecting and defending—that’s part of his package deal, but his cases don’t usually involve him protecting someone like her.  A crime princess with a body made for the sweetest sin.   Kathleen O’Shaughnessy is the daughter of an infamous mob boss. Her father made sure that she was locked away from the world so Kat didn’t exactly have easy street growing up. Now that her father is dead, she’s suddenly out on her own—and she’s the target of every enemy that her father made in his very long career.  Keep the princess alive. Keep his hands off her.  The government wants to use Kat as a witness to take down what’s left of her father’s organization. To do that, though, Kat has to stay alive. She’s not big into the whole witness protection scene. Boring guys in cheap suits aren’t her thing. Kat needs protection that’s a bit…Wilder. Good thing Rick is up for the challenge. One look at Kat, and her protection—and her pleasure—are at the top of his to-do list.  It’s not the beast that needs taming. It’s the princess.   There are seven days until the trial. Seven days in which Rick has to keep Kat at his side day and night. It should be an easy enough task…but when the bullets start flying and they have to go on the run, Rick finds out that the protected “princess” isn’t who he thought. Kat is about to wreck his world, and it’s gonna be one heck of a wild battle.  He’ll do whatever it takes…  He’ll fight hard and he’ll fight dirty to keep her alive. And he’ll also fight with every bit of his strength to win Kat’s heart. The beast is falling hard and fast…and his princess holds his battered heart in the palm of her hand.  Author’s  Are you up for a twisted and hot take on a wild fairytale? Rick might be a fierce beast, but when the man falls, he falls hard. Prepare for an alpha hero, dangerous fun, hot romance, and some bad guys that are on the scary side. FIGHTING FOR HER is a stand-alone read, no cliff-hangers.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Suspense",
    "Contemporary Romance",
    "Adult",
    "Humor"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/50834848-fighting-for-her"
}