{
  "title": "Anxiety",
  "description": "This book of prose and magnificent poetry is Danny’s story as he begins to notice the world around him start to shatter. Yet through all that he offers encouragement and inspiration to those millions of others who also experience anxiety and panic.There are many books on the market about anxiety, yet just a quick glance at these will demonstrate just how chintzy, patronising and condescending they really are. All these books give the impression that a few simple exercises can hold the terrors of tension, misery and dread at bay. If only it was that easy. But it’s not. Anxiety can cripple you! And there’s no easy cure, or magic words, or wrist band that is ever going to work We start the book as Danny takes stock of those around him, and as editor of the book, before we get into more serious matters, I’ve allowed Danny 15 quick-fire poems to introduce himself, his Gypsy lifestyle as a kid and where he finds himself at the moment. He begins to notice loss, although he never phrases it quite like that. But we see loss as children fly the nest, loss of his youthful good looks and energy, a possible loss of income and finally the loss of a friend of ours, Chalkie, who was brutally murdered.Our mate, Chalkie, was a great friend to Danny, and when he was savagely murdered it sent Danny into dark places in his mind that he had trouble escaping from. Danny was very much aware that he was in danger of turning corners in the labyrinth of his mind that he may not be able to find his way out of.Danny has become a student of the human condition, and in this book he does what he does best; write poems about the world around him, and he does this with passion. Even if poems aren’t your preferred treasure, even if they don’t normally grab you, if they’re not your ‘thing,’ I’d still ask that you bear with Danny as he tells his story in his own way, for this, some would say, is what happens when someone with anxiety digs deep down into his own soul, for the book looks into the nitty-gritty of mental health awareness as Danny tells his story in a unique way, as he learns to come to terms with the barbaric and vicious murder of his best mate. Although, of course, he never does come to terms with such a cruel act. You can’t. Sometimes Danny is, to use his own words, all lopsided in his head, which is why I’ve chosen to present the book in the current format, to expose how his thinking bounces around without rhyme or reason. So he discusses anxiety and depression and suicide and then out of the blue he writes a poem, but poetry is Danny’s way of clearing his head.What can I tell you about Danny? He has a ferocious spirit and vigour. He has high moods and an instinctive ability to perceive and understand the world around him. He has a fierce sense of loyalty, he’s romantic, quixotic and starry-eyed. He brings smiles to everyone he meets, a gift I truly believe comes from a higher source. However, there’s no denying that at times he can be restless, carrying the capacity for vastly darker moods, melancholy energies and occasional bouts of madness. Writers, poets, artists, musicians and circus clowns often suffer from boisterous and raucous dispositions. And it’s true they can get into trouble at times. They wear their moods as their ships of passage, and Danny is no different. He suffers from what Lord Byron would term a ‘fine madness.’ He throws out poems in a sparkle of energy. And he puts everything into the words. They just arrive on paper as though a higher being is working through him. I can’t explain this, but it’s how it happensI’ve known Danny for over 40 years, since we shared a room together at a seaside town in the South coast of England. So my opinion? He’s probably a bit of a mad genius, slowly losing his sanity, although he loves the world and everyone in it, and if this book can help just one person then Danny will sleep with a smile on his face tonight. Karl Wiggins",
  "genres": [
    "Poetry",
    "Mental Health",
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Science"
  ],
  "author": "Danny Winter",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/50846763-anxiety"
}