{
  "title": "Capital and Ideology",
  "description": "The epic successor to one of the most important books of the century: at once a retelling of global history, a scathing critique of contemporary politics, and a bold proposal for a new and fairer economic system.Thomas Piketty's bestselling Capital in the Twenty-First Century galvanized global debate about inequality. In this audacious follow-up, Piketty challenges us to revolutionize how we think about politics, ideology, and history. He exposes the ideas that have sustained inequality for the past millennium, reveals why the shallow politics of right and left are failing us today, and outlines the structure of a fairer economic system.Our economy, Piketty observes, is not a natural fact. Markets, profits, and capital are all historical constructs that depend on choices. Piketty explores the material and ideological interactions of conflicting social groups that have given us slavery, serfdom, colonialism, communism, and hypercapitalism, shaping the lives of billions. He concludes that the great driver of human progress over the centuries has been the struggle for equality and education and not, as often argued, the assertion of property rights or the pursuit of stability. The new era of extreme inequality that has derailed that progress since the 1980s, he shows, is partly a reaction against communism, but it is also the fruit of ignorance, intellectual specialization, and our drift toward the dead-end politics of identity.Once we understand this, we can begin to envision a more balanced approach to economics and politics. Piketty argues for a new \"participatory\" socialism, a system founded on an ideology of equality, social property, education, and the sharing of knowledge and power. Capital and Ideology is destined to be one of the indispensable books of our time, a work that will not only help us understand the world, but that will change it.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "History",
    "Philosophy",
    "Business",
    "Finance"
  ],
  "author": "Thomas Piketty",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/50849430-capital-and-ideology"
}