{
  "title": "Trinity: The Treachery and Pursuit of the Most Dangerous Spy in History",
  "description": "'Everything about this story is astounding' Bryan Appleyard, Sunday Times\"Trinity\" was the codename for the test explosion of the atomic bomb in New Mexico on 16 July 1945. Trinity is now also the extraordinary story of the bomb's metaphorical father, Rudolf Peierls; his intellectual son, the atomic spy, Klaus Fuchs, and the ghosts of the security services in Britain, the USA and USSR.Against the background of pre-war Nazi Germany, the Second World War and the following Cold War, the book traces how Peierls brought Fuchs into his family and his laboratory, only to be betrayed. It describes in unprecedented detail how Fuchs became a spy, his motivations and the information he passed to his Soviet contacts, both in the UK and after he went with Peierls to join the Manhattan Project at Los Alamos in 1944. Frank Close is himself a distinguished nuclear physicist: uniquely, the book explains the science as well as the spying.Fuchs returned to Britain in August 1946 still undetected and became central to the UK's independent effort to develop nuclear weapons. Close describes the febrile atmosphere at Harwell, the nuclear physics laboratory near Oxford, where many of the key players were quartered, and the charged relationships which developed there. He uncovers fresh evidence about the role of the crucial VENONA signals decryptions, and shows how, despite mistakes made by both MI5 and the FBI, the net gradually closed around Fuchs, building an intolerable pressure which finally cracked him.The Soviet Union exploded its first nuclear device in August 1949, far earlier than the US or UK expected. In 1951, the US Congressional Committee on Atomic Espionage concluded, 'Fuchs alone has influenced the safety of more people and accomplished greater damage than any other spy not only in the history of the United States, but in the history of nations'. This book is the most comprehensive account yet published of these events, and of the tragic figure at their centre.",
  "genres": [
    "History",
    "Nonfiction",
    "Espionage",
    "Audiobook",
    "Biography",
    "Science",
    "War"
  ],
  "author": "Frank Close",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/50835141-trinity"
}