{
  "title": "Why Fish Don’t Exist: A Story of Loss, Love, and the Hidden Order of Life",
  "description": "A wondrous debut from an extraordinary new voice in nonfiction, Why Fish Don’t Exist is a dark and astonishing tale of love, chaos, scientific obsession, and—possibly—even murder. David Starr Jordan was a taxonomist, a man possessed with bringing order to the natural world. In time, he would be credited with discovering nearly a fifth of the fish known to humans in his day. But the more of the hidden blueprint of life he uncovered, the harder the universe seemed to try to thwart him. His specimen collections were demolished by lightning, by fire, and eventually by the 1906 San Francisco earthquake—which sent more than a thousand of his discoveries, housed in fragile glass jars, plummeting to the floor. In an instant, his life’s work was shattered. Many might have given up, given in to despair. But Jordan? He surveyed the wreckage at his feet, found the first fish he recognized, and confidently began to rebuild his collection. And this time, he introduced one clever innovation that he believed would at last protect his work against the chaos of the world. When NPR reporter Lulu Miller first heard this anecdote in passing, she took Jordan for a fool—a cautionary tale in hubris, or denial. But as her own life slowly unraveled, she began to wonder about him. Perhaps instead he was a model for how to go on when all seemed lost. What she would unearth about his life would transform her understanding of history, morality, and the world beneath her feet. Part biography, part memoir, part scientific adventure, Why Fish Don’t Exist reads like a fable about how to persevere in a world where chaos will always prevail.",
  "genres": [
    "Nonfiction",
    "Science",
    "Memoir",
    "History",
    "Biography",
    "Audiobook",
    "Nature"
  ],
  "author": "Lulu Miller",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/50887097-why-fish-don-t-exist"
}