{
  "title": "Carry Me Away",
  "description": "Inspired by the incredible true story of an Australian shipwreck and those who survived to tell the tale.  When the Black Swallow sinks off the Australian coast in 1877, Australian midshipman Tom Darley rescues English passenger Ada Carmichael from the disaster that claims her entire family. News of the only two survivors enchants the world, but Ada needs to hide before secrets and old foes find her. Tom is chasing big dreams of a crumbling house he will convert into a small hotel ~ but the promising start he’s acquired now sits at the bottom of the sea.  Inexplicably entangled, Ada and Tom lean upon each other to make sense of the tragedy that’s displaced them. But when scheming journalists observe their affection they drag Tom into life-altering riches and a news-worthy romance he cannot resist. So he arranges for Ada’s protection where only he might find her ~ the quiet Phillip Island farm of his friends Shadrach and Finella Jones.  And that’s where real trouble finds them. When heroic promises fail to shelter, and love refuses to be silenced, only surrender will pluck Ada and Tom from where life has wrecked them.   Riveting and masterfully written, Carry Me Away will do just that, immersing you in a devastating storm, a historic shipwreck, and the idyllic hideaway of Phillip Island in Australia. These flesh and blood characters are so finely crafted they feel more like friends, each winning your heart in unique, soul-stretching ways. A poignant, oft suspenseful, and thoroughly romantic journey through the valleys of loss and grief to the heights of healing and hope. –Laura Frantz, Christy Award-winning author of The Lacemaker  A gorgeously written and skillfully rendered tale of rescue, redemption, and the courage required to love. –Siri Mitchell, Author of Chateau of Echoes  Gorgeous and gripping, Carry Me Away is a novel you won’t forget. Ada and Tom’s deep attraction and clashing needs create a poignant love story, and Dorothy Adamek writes about grief and love in a way that is palpable and heartfelt. But the ending—oh, the ending! So sweet and triumphant and affirming that I want to tell everyone—except I want you to discover it for yourself. Let the lovely writing carry you away to picturesque Phillip Island, and be swept away by Tom and Ada’s tale. –Sarah Sundin, Award-winning and bestselling author of The Sea Before Us and The Sky Above Us  Carry Me Away is another beautiful tale from the imagination and heart of Dorothy Adamek. This Australian-born storyteller had me at the first line and secured her hold on me with a hero worth rooting for. Based on true events of a late 19th-century shipwreck off the coast near Melbourne, this lyrical, heartfelt journey of two battered souls finding healing, redemption, and love will keep the pages turning—as will lush descriptions sure to make readers long to take a trip Down Under. –Tamara Leigh, USA Today bestselling author of the Age of Faith and Age of Conquest series  Richly poetic in the tradition of Lori Benton and Laura Frantz with the sensory prose of Joanne Bischof, Carry Me Away marries impeccable research with a stunning love story. The sea-swept canvas of Phillip Island offers a vibrant backdrop to Tom and Ada’s unexpected adventure and resonant themes of faith and endurance amidst tragedy and loss. A beautiful companion to Adamek’s fresh debut, Carry Me Away is an intelligent treatise on the nature of rebuilding, of forging new family, and of finally finding home.",
  "genres": [
    "Historical",
    "Christian Fiction",
    "Fiction"
  ],
  "author": "Dorothy Adamek",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/50887657-carry-me-away"
}