{
  "title": "Missing Mercy",
  "description": "The venture ahead could leave their friendship behind.\n\nMade a safe-haven after the Civil War, Ironwood Plantation is a refuge of equality for former slaves. But twenty years and a new generation later, they have become an isolated community with little contact with the rest of the world.Mercy Carpenter is everything the world thinks she shouldn’t be. Educated and adventurous, she longs to make a life for herself beyond the beautiful prison of Ironwood. When she secretly submits an article to the Boston Globe under a man’s name and receives an enthusiastic response and an offer for employment, she’s determined to take advantage of the opportunity. But she isn’t prepared for a startling world that won’t accept her color or her gender, and her ambitions soon land her in grave danger.The privileged daughter of a plantation owner and an aspiring suffragette, Faith Harper is determined not to marry. Especially not her father’s opportunistic new business partner. She doesn’t want any man telling her what to do, least of all the annoyingly chivalrous Nolan Watson. But when Mercy goes missing, Faith will do anything to find her best friend, even if it means trusting a man she doesn’t understand. In a time where prejudices try to define them, Mercy and Faith must push the boundaries of their beliefs and trust in the God who holds the keys to freedom.*Includes discussion questions Don't miss these other titles from Bestselling Christian Historical author Stephenia H. McGee  \n  Ironwood Plantation Family Saga\n\nThe Whistle WalkHeir of Hope\n\nMissing Mercy\n\nThe Liberator Series\n\nLeveraging LincolnLosing LincolnLabeling Lincoln\n\n\n\nStand Alone Titles\n\nIn His EyesEternity Between Us\n\n\n\nNovellas\n\nThe Heart of HomeHer Place in Time",
  "genres": [
    "Historical",
    "Historical Fiction",
    "Christian Fiction",
    "Christian"
  ],
  "author": "Stephenia H. McGee",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/50878671-missing-mercy"
}