{
  "title": "The Billionaire’s Pregnant Assistant",
  "description": "USA Today Bestseller Leslie North invites you to indulge in a steamy billionaire romance with a unforgettable bad boy billionaire and the smart-talking woman who tames him...  Billionaire Connor McClellan knows the worth of a woman—at least in business dealings. Which is why he depends on Rosalie Bridges, the ever-reliable outreach manager from his Aspen office, to pose as his girlfriend when he woos a potential client. Connor’s next client represents the only business he’s ever lost. Gaining them back would make his record perfect. He assumes that Rosalie is available—only to find that she’s pissed off at him and pregnant…with his baby. Their hookup at a previous business meeting was the hottest of his life, and now it’s the most complicated, too. Still, they need to fake this relationship to land the deal. But Rosalie isn’t interested in playing along.  Rosalie has wanted Connor from a distance for years, and always thought she’d get her chance to impress him when he came to Aspen. After they’d hooked up, she thought she was making headway, but when Connor sent carnations along with a generic note and didn’t call till he needed her again, she decided she was done being used.  With Connor desperately needing to land this deal, and Rosalie no longer willing to be a part of his fake relationship scheme—especially with a baby on the way—a deal of a different kind needs to be struck. She'll be his fake girlfriend one last time, and in exchange she'll get the promotion to head the region’s outreach and out of his life. As much as she wishes to be with Connor and have him help raise their child, she isn’t sure she can risk her heart on a man used to taking others for granted. But Connor isn't planning on letting her get away without a fight. He's got a week while they woo the client together to win her back—and if there's one thing Connor knows how to do, it's win.  As business and pleasure become further intertwined, Connor realizes for once in his life he’d like this fake relationship to be something more. If the two of them can pull this off, they may land the deal, and the love, to last them a lifetime.  This novel contains sexual content and profanity.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Contemporary",
    "Fiction"
  ],
  "author": "Leslie North",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/50875269-the-billionaire-s-pregnant-assistant"
}