{
  "title": "Root & Nourish: An Herbal Cookbook for Women's Wellness",
  "description": "Embrace the ancient healing power of plants with more than 100 whole-food, plant-based, gluten-free herbal recipes, designed around the most common health concerns of modern women. Did you know you have access to the most potent, sophisticated, and scientifically-proven apothecary cabinet—right in your own kitchen? Plants, specifically herbs and spices, have been used for centuries among holistic healing traditions around the world to promote health, longevity, and beauty. And as more people become afflicted with chronic stress-based conditions, from inflammation and food allergies to anxiety and depression and menstrual irregularities, a whole new generation is rediscovering nature’s power for long-term wellness. In Root & Nourish, wellness experts Abbey Rodriguez and Jennifer Kurdyla teach women how to incorporate herbalism into their busy lives to restore and maintain their unique state of health. Expanding the herbal repertoire beyond teas and tinctures to include wholesome breakfasts, satisfying mains, indulgent desserts, and, yes, a full menu of teas and beverages for day and night, it’s the first cookbook of its kind to pair everyday herbal cooking with women’s health concerns—specifically related to digestion, mental health, and female reproductive hormonal health. As you come to learn which herbal ingredients offer you the nourishment you need, whether in the moment or to support chronic conditions, you’ll curate an evolving personal herbal apothecary that will serve you for a lifetime. Alongside these affordable, seasonal, and sustainable recipes, Root & Nourish features mindfulness and holistic lifestyle practices drawn from yoga and Ayurveda that will help incorporate wellness into every part of the day. Once you discover how good you feel when you eat the right foods, at the right time, and in the right way, you will understand your body—and yourself—as you never have before: the way nature intended.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Health"
  ],
  "author": "Abbey Rodríguez",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/50891954-root-nourish"
}