{
  "title": "Tiempos recios",
  "description": "LA NUEVA NOVELA DE MARIO VARGAS LLOSA, PREMIO NOBEL DE LITERATURA\n \n \n \nUna historia de conspiraciones políticas e intereses encontrados durante la Guerra Fría. Una mentira que pasó por verdad y cambió el devenir de América Latina. \n \n«¿Era la historia esa fantástica tergiversación de la realidad?»\n Guatemala, 1954. El golpe militar perpetrado por Carlos Castillo Armas y auspiciado por Estados Unidos a través de la CIA derroca el gobierno de Jacobo Árbenz. Detrás de este acto violento se encuentra una mentira que pasó por verdad y que cambió el devenir de América Latina: la acusación por parte del gobierno de Eisenhower de que Árbenz alentaba la entrada del comunismo soviético en el continente. Tiempos recios es una historia de conspiraciones internacionales e intereses encontrados, en los años de la Guerra Fría, cuyos ecos resuenan hasta la actualidad. Un suceso que involucró a varios países y en el que algunos verdugos acabaron convirtiéndose en víctimas de la misma trama que habían ayudado a construir. En esta novela apasionante, que conecta con la aclamada La Fiesta del Chivo, Mario Vargas Llosa funde la realidad con dos ficciones: la del narrador que libremente recrea personajes y situaciones, y la diseñada por aquellos que quisieron controlar la política y la economía de un continente manipulando su historia. Críticas:«Novela hermosa y turbadora que trata de la maldad y quisiera conjurarla.»José-Carlos Mainer, Babelia «Conecta de varias formas con La Fiesta del Chivo, que todo el mundo celebra como su última gran novela. Tiempos recios me ha parecido incluso mejor.»José María Pozuelo Yvancos, ABC Cultural «Puro Vargas Llosa, en vena y en directo [...]. Con el esquema de A sangre fría, que tanta solvencia y liquidez intelectual le dio a La Fiesta del Chivo, Vargas Llosa hace una mezcla explosiva entre una cosa y otra, transformando la realidad histórica, la documentación histórica, en ficción y la ficción en realidad aparente. Eso es una novela.»J. J. Armas Marcelo, El Cultural  «Bienvenido sea [...] el gran recreador de la novela realista, que leemos con el mismo entusiasmo con el que otros leen los excesos imaginativos -bienvenidos también ellos- del realismo mágico.»J. A. Masoliver Ródenas, La Vanguardia «Como en toda buena novela histórica, la realidad documentada va de la mano de la invención y los sucesos tienen el soporte de unas sólidas historias humanas.»Santos Sanz Villanueva, El Cultural  «Vargas Llosa vuelve a hacer, en Tiempos recios, un retrato histórico de un episodio clave y bastante desconocido en la historia latinoamericana. Con al menos dos personajes fascinantes: Abbes García y Martita. De Premio Nobel.»Luisgé Martín «Literariamente notable y alejada de estereotipos ideológicos, Tiempos recios es la mejor novela de Mario Vargas Llosa desde La Fiesta del Chivo y prueba irrebatible de su vigencia.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Politics",
    "Literature",
    "Spanish Literature",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Mario Vargas Llosa",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/50890188-tiempos-recios"
}