{
  "title": "The Siberian Dilemma",
  "description": "From the award-winning, bestselling author of Gorky Park and Tatiana comes a breathtaking new novel about investigator Arkady Renko—“one of the most compelling figures in modern fiction” ( USA TODAY )—who travels deep into Siberia to find missing journalist Tatiana Petrovna.Journalist Tatiana Petrovna is on the move. Arkady Renko, iconic Moscow investigator and Tatiana’s part-time lover, hasn’t seen her since she left on assignment over a month ago. When she doesn’t arrive on her scheduled train, he’s positive something is wrong. No one else thinks Renko should be worried—Tatiana is known to disappear during deep assignments—but he knows her enemies all too well and the criminal lengths they’ll go to keep her quiet.Renko embarks on a dangerous journey to find Tatiana and bring her back. From the banks of Lake Baikal to rundown Chita, Renko slowly learns that Tatiana has been profiling the rise of political dissident Mikhail Kuznetsov, a golden boy of modern oil wealth and the first to pose a true threat to Putin’s rule in over a decade. Though Kuznetsov seems like the perfect candidate to take on the corruption in Russian politics, his reputation becomes clouded when Boris Benz, his business partner and best friend, turns up dead. In a land of shamans and brutally cold nights, oligarchs wealthy on northern oil, and sea monsters that are said to prowl the deepest lake in the world, Renko needs all his wits about him to get Tatiana out alive.The Washington Post has said “Martin Cruz Smith is that rare a popular and well-regarded crime novelist who is also a writer of real distinction.” In the latest continuation of his unforgettable series, he brings us to the inside world of shadowy political figures and big wig oil oligarchs providing us with an authentic view of contemporary Russia, infused with his trademark wit.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Russia",
    "Crime",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Martin Cruz Smith",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/50892438-the-siberian-dilemma"
}