{
  "title": "Once I Was You: A Memoir of Love and Hate in a Torn America",
  "description": "“Maria’s perspective is powerful and vital. Years ago, when In the Heights was just starting off-Broadway, Maria got the word out to our community to support this new musical about our neighborhoods. She has been a champion of our triumphs, a critic of our detractors, and a driving force to right the wrongs our society faces. When Maria speaks, I’m ready to listen and learn.” —Lin-Manuel Miranda Emmy Award–winning journalist and anchor of NPR’s Latino USA, Maria Hinojosa, tells the story of immigration in America through her family’s experiences and decades of reporting, painting an unflinching portrait of a country in crisis.Maria Hinojosa is an award-winning journalist who has collaborated with the most respected networks and is known for bringing humanity to her reporting. In this beautifully-rendered memoir, she relates the history of US immigration policy that has brought us to where we are today, as she shares her deeply personal story. For thirty years, Maria Hinojosa has reported on stories and communities in America that often go ignored by the mainstream media. Bestselling author Julia Alvarez has called her “one of the most important, respected, and beloved cultural leaders in the Latinx community.”  In Once I Was You, Maria shares her intimate experience growing up Mexican American on the south side of Chicago and documenting the existential wasteland of immigration detention camps for news outlets that often challenged her work. In these pages, she offers a personal and eye-opening account of how the rhetoric around immigration has not only long informed American attitudes toward outsiders, but also enabled willful negligence and profiteering at the expense of our country’s most vulnerable populations—charging us with the broken system we have today.  This honest and heartrending memoir paints a vivid portrait of how we got here and what it means to be a survivor, a feminist, a citizen, and a journalist who owns her voice while striving for the truth. Once I Was You is an urgent call to fellow Americans to open their eyes to the immigration crisis and understand that it affects us all. Also available in Spanish as Una vez fui tú.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Race",
    "History",
    "Biography",
    "Politics"
  ],
  "author": "María Hinojosa",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/50892261-once-i-was-you"
}