{
  "title": "Theory of People: Master Behaviors, Business, Economics, Emotions and Mind in One Simple Way",
  "description": "The Last Business or Self-Help Book You'll Ever Need or a Full Refund. Even After Reading the Whole Book.Einstein’s Theory of Relativity allows us to understand the universe on a macro scale and the relationships between space, time, and gravity. The Theory of People allows us to understand people’s psychology and the relationships between aspects such as behaviors, feelings, business, and learning.• Control your behaviors, such as anger, laziness, and 20 other ones.• Manage your feelings to become happier and overcome stress, shyness, and 15 other ones.• Create a successful business by understanding what the perfect solution looks like and what makes people buy.• Become a visionary, just like Steve Jobs, by learning his motives.• Learn faster and improve your memory by discovering how our minds decide what information to save.• Increase your intelligence, creativity, and wisdom by learning what they are.• Understand what makes one country or person wealthier than other thanks to the golden law of economy.A Unique Book• Quick Read: Theory of People explains people on 2 pages. 70 pages are real-life applications. You would need to read tens of other books to get the same solutions.• Easy to Apply in Life: You do not need a scientific background or have to work hard to understand complicated subjects. It presents knowledge in a simple way.• Money-Back Guarantee: If you are unsatisfied, you can apply for a refund via Amazon within seven days of purchase. No questions asked.If you want to understand yourself and other people and apply that knowledge to real-life, buy the Theory of People now.",
  "genres": [
    "Psychology",
    "Business",
    "Nonfiction",
    "Economics",
    "Science",
    "Sociology",
    "Self Help"
  ],
  "author": "Jakub Lasak",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/50893389-theory-of-people"
}