{
  "title": "Baggage: Confessions of a Globe-Trotting Hypochondriac",
  "description": "An award-winning journalist’s eco-adventures across the globe with his three traveling his fiancée, his OCD, and his chronic anxiety—a hilarious, wild jaunt that will inspire travelers, environmentalists, and anyone with mental illness.Silver Award, 2020 Nautilus Book Awards, Memoir & Personal Journey CategoryGold Award, 2020 Benjamin Franklin Awards, Travel CategoryMost travel narratives are written by superb people who crave adventure, laugh in the face of danger, and rapidly integrate into foreign cultures. But what about someone who is paranoid about traveler’s diarrhea, incapable of speaking a foreign tongue, and hates not only flying but driving, cycling, motor-biking, and sometimes walking in the full sun?In Confessions of a Globe-Trotting Hypochondriac, award-winning writer Jeremy Hance chronicles his hilarious and inspiring adventures as he reconciles his traveling career as an environmental journalist with his severe OCD and anxiety.At the age of twenty-six—after months of visiting doctors, convinced he was dying from whatever disease his brain dreamed up the night before—Hance was diagnosed with OCD. The good news was that he wasn’t dying; the bad news was that OCD made him a really bad traveler—sometimes just making it to baggage claim was a win.Yet Hance hauls his baggage from the airport and beyond. He takes readers on an armchair trek to some of the most remote corners of the world, from Kenya, where hippos clip the grass and baboons steal film, to Borneo, where macaques raid balconies and the last male Bornean rhino sings, to Guyana, where bats dive-bomb his head as he eats dinner with his partner and flesh-eating ants hide in their pants and their drunk guide leaves them stranded in the rainforest canopy.As he and his partner soldier through the highs and the lows—of altitudes and their relationship—Hance discovers the importance of resilience, the many ways to manage (or not!) mental illness when in stressful situations, how nature can improve your mental health, and why it is so important to push yourself to live a life packed with experiences, even if you struggle daily with a mental health issue.With mental illness impacting the lives of millions of people, this timely book will inspire people to step out of their comfort zones and take the road meant to be traveled. Hance proves that we all have baggage--the question is, do we leave it dusty in a closet or do we take it out in full view for others to see?",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Mental Health",
    "Nature",
    "Adventure"
  ],
  "author": "Jeremy Hance",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/50892158-baggage"
}