{
  "title": "Refreshed!: The common-sense guide to taking back the control of your life from anxiety, stress, and fear with science, new thinking, and mother nature.",
  "description": "It’s time to take back control of your life from anxiety, stress, and fear.   The Life Environments Refresh! cognitive wellness program is the number one cognitive wellness life course used today by individuals and companies worldwide. Now you can access this course and get the insights and tools you need to take back control of your life's experience from anxiety and stress safely and build a life experience you love!  There is nothing shaping your life and its experience more profoundly than anxiety, stress, and fear – collectively referred to as stress. You are about to learn what stress really is, how and why it comes to life, and how it devastates minds, bodies, health, cognition, and life’s experience. You are also about to discover how you can short-circuit and beat stress while building a life you love in an easy to understand and fascinating life course you can start putting to work today.  It’s time to take back the control of your health, happiness, and life from stress without pills, gimmicks, or voodoo. It all begins with common-sense knowledge, insight, smarter thinking, and a desire to build and live a life you love with the help of one of the world’s leading cognitive health and wellness experts, Ian Breck. This is the very life course from the world-renowned Refreshed!™ cognitive health and wellness program used by companies and individuals worldwide developed by the scientists, researchers, and physicians of Life Environments Life Sciences.  You are about to be introduced to a new world of actionable thinking, common-sense tools, and advanced insights that will enable you to break the chains of stress and its devastating impacts – and start designing and experiencing a life you will truly love!  You are about to discover... • It’s time to discover more about the leading cause of human mortality and life quality. • Learn exactly what anxiety, stress, and fear really are. • Learn how, when, and why they come to life. • Learn what they do your body and mind. • Learn how they devastate cognition, memory, and performance. • Learn what triggers them. • Learn how you contribute to them. • Learn how they hide and ways to reveal and confront them. • Learn what makes them the leading cause of death and life quality. • Learn why they’re so challenging to manage. • Learn how to reveal what they’re really telling you about your body and lifestyle. • Learn how to short-circuit them in remarkably enjoyable ways. • Learn how to keep them from recurring. • Learn how to live a life you love without them.  It’s time to become Refreshed!",
  "genres": [
    "Nonfiction",
    "Psychology"
  ],
  "author": "Ian Breck",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/50902310-refreshed"
}