{
  "title": "The Neptune Strategy",
  "description": "Former naval officer John J. Gobbell brings to life marine warfare as few others ever have. Now, the author of The Last Lieutenant, A Code For Tomorrow, and When Duty Whispers Low, returns to the fiery panorama of World War II, as Commander Todd Ingram is caught in a living hell.\nIn 1944, the Allies have delivered a stunning blow to Hitler's Western front. In the Pacific, Admiral Raymond A. Spruance's Fifth fleet is poised to eviscerate the Japanese Navy--and begin a new war for the occupied islands.Commander Todd Ingram is on the bridge of his ship, the destroyer USS Maxwell, on radar picket duty on a misty, overcast day when four Japanese Val dive bombers emerge screaming from the overcast. The coordinated attack is sudden and devastating, the ship rocked by massive explosions as the bombers hit their target. The concussions hurtle Ingram overboard and he watches in horror as his embattled ship leaves him behind.Ingram barely lasts the night, clinging to a floating piece of his ship's lifeboat in rough seas. As he begins to lose hope, a periscope cuts through the water and in moments a submarine surfaces nearby. His joy turns to horror as he spots the numbers I-57 on the conning tower. He is now a prisoner of a Japanese U-boat and his troubles have just begun--but so has the race to save him.A secret U.S. Naval Signal Intelligence Service station in Australia intercepts a situation report from the Commander of the submarine to his superiors in Tokyo--they have an American prisoner, Alton C. Ingram. A strategy is developed by the U.S. Navy and a classified plan put in motion: ensure that the I-57 escapes a net of ASW HUK groups (anti-submarine hunter killer) laying across the sub's path to Lorient, France and ambush it when it reaches shore. But the I-57 has other plans as it dodges depth charges and Allied ships in a deadly game whose outcome may effect the balance of power in a war that threatens to consume them all...From the Philippine Sea to the Nazi U-boat pens in Lorient, France, The Neptune Strategy is a complex cat and mouse game between the Japanese submarine I-57 and a U.S. Navy determined to save one of their own and is the most thrilling novel yet by a master of the WWII thriller.",
  "genres": [
    "Fiction",
    "War",
    "Historical Fiction"
  ],
  "author": "John J. Gobbell",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/509083.The_Neptune_Strategy"
}