{
  "title": "Wicked Hearts",
  "description": "*Please note, there is a new, longer version of Wicked Hearts which follows the story of Pearl & Seth on from War Of Hearts. All reviews prior to 20th June 2020 are for the previous version before it was rewritten*I DESTROYED HIM.  Buried his reputation and burned his soul. Shattered his heart into a thousand pieces. And now... He’s out for revenge   Pearl  I’ve always been that girl, the one you want to be deep down. The popular one. Idolised and adored, privileged and perfect in every way.  But saints have sins, so I’ve kept mine well hidden. No one knows the real me. Who I used to be. Who I’ve buried to survive.  I never meant to crush him while I climbed to the top, but he was too easy. Too sweet.  And now he’s back in my life. My study partner and company rival, no less. He may have grown, buffed up and filled out. No longer the geeky kid with glasses, but a gorgeous, sculpted to perfection Adonis.  Still the same boy who loved me. Once.  Only now he looks at me with pure hatred.  I ruined his reputation, scarred his soul. Shattered his heart into a thousand pieces. He wants his revenge...  But this is my life we’re taking about. This is my future. I was the one who made his life hell when we were kids at school. Not now we’re practically adults, at the most prestigious hospitality institute in Europe.  And he might think he knows how to be the bully. But he hasn’t got the sweetest clue...  How to be wicked.  Not like I do.  ***  You’ll love this dark, new adult, bully romance filled with suspense to keep you on the edge, because who doesn’t enjoy a revenge and redemption story at its sweetest? When bullies become the bullied, and the brave become the broken. Will true but tainted love survive?  Get it now.  #justdesserts #revengeissweet #sinservedcold  Publisher Note: This is a stand-alone, coming of age, new adult, teen bully romance, redemption story. Containing adult and dark themes, teen drama, swearing, consensual steamy moments, and potential triggers.",
  "genres": [
    "New Adult",
    "Romance",
    "Dark",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers",
    "College"
  ],
  "author": "Mallory Fox",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/50899595-wicked-hearts"
}