{
  "title": "Where Butterflies Dream",
  "description": "Where Butterflies Dream is the fifth book in the award-winning historical epic series, Exit Unicorns.Each of us carries within a map of memory. The map is worn at the folds¬—sometimes right through—and so place names are missing first letters or last or have a hole through the middle. We carry those maps with us always, and this map is mine—an island on the edge of the world and beyond it a place of dragons and sunken cities with bells that still ring a thousand years on... The story opens in the winter of 1978 when Casey Riordan returns from three years in exile to find the world he left behind has changed. With little knowledge of his past, he fears the secrets which might well bring danger to his family, and the question he must answer for himself—whether a man can ever truly return home when he is no longer the man he once was. Pamela Riordan has grieved her lost husband for three long years but has forged a new life for herself in his absence. Still scarred from the violence which has so recently visited her, she wants only to keep her family safe and to find an oasis of peace in which to raise them. But in Northern Ireland peace always comes at a price. Jamie Kirkpatrick is forced to deal with the ghosts of his past in order to save his present, and the fragile happiness he has only just found. Casey’s return forces all three to confront the ideas of what love means, what makes a family and how one copes with a history that weighs heavily upon the future. Even as they navigate the new territory of their personal lives, history keeps moving onward and all will be drawn into the the political maelstrom of the Irish Troubles. The storm will spread beyond the boundary of family to a new generation caught up in the tides of history, their fates rushing toward a merciless shore. Where Butterflies Dream is the story of a family, a people, a country and of that most mysterious territory of all—the geography of the human soul.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Cindy Brandner",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/50912822-where-butterflies-dream"
}