{
  "title": "Fate's Pawn",
  "description": "Magic can’t solve your problems. It just makes them bigger. Too bad 14-year-old Raziel hasn’t learned that yet.Everyone believes that Raziel’s parents are long dead. Everyone but Raziel. He knows the flying city that took them 9 years ago is real. He is sure that if he can just find it, he can find them too.Using clues left in a journal his father left behind, Raziel’s first step must be contacting a creature living in an ancient, abandoned fortress just a few miles away. To get to it, Raziel will need to use his developing knowledge of magic to find a way past the high walls and knights that guard his town andthrough the twisting forest paths filled with monsters lurking among the trees.Answers to questions that have tormented him for years are just within his reach, but suddenly Raziel is not the only one seeking the creature—someone from his town has made a terrible bargain for power, and the price is the creature’s life.Raziel’s journey to find his family will lead him through a brutal test against a horde of monsters, the demons of his past, and the scorn and disbelief of his community—but he will stop at nothing to discover the truth.Rick Fox’s debut novel Fate’s Pawn is a fast paced ride through a world full of strange creatures, magic that will set your imagination ablaze, and characters that will instantly become your friends; an exciting read that will delight fantasy lovers of all ages.Praise for Fate’s “This book was an incredibly fun read with characters I really cared for. I'm all about characters. If I don't care for the characters, I rarely care about the story. So it was great to get lost in an adventure with characters who felt like friends.”Lindsey Ann, Goodreads reviewer“A strong beginning to a new series! The world is multi-textured and rich. The characters reveal more depth than your typical fantasy novel. And the author answers just enough questions to whet your appetite for the ones he leaves open.”Wade Jones, Amazon reviewer",
  "genres": [],
  "author": "Rick Fox",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/50901964-fate-s-pawn"
}