{
  "title": "Year of the Child",
  "description": "All cops know a mystery starts with a lie ...MISAKI— Two months have passed since the destruction of Harmony dome, and Misaki, guilt ridden over her desperate act of sabotage, returns to the place of healing that she knows best ... the Sadie. Mat accepts a contract on the far flung moon of Ganymede, hoping that time and distance will heal him of the nightmares from his own wrong doing.TETSUYA— Disreputable, former detective Tetsuya Takahashi is reassigned as the Lead Investigator for out-system piracy. Despite his reputation, his work is part of who he is. He knows all mysteries start with a lie, and his investigation begins to lead him closer to finding Misaki Iriyama … who reminds him of his lost daughter. His answers lie at Ganymede.ALEXANDRIA— Her plan has succeeded. The destruction of Apex's plant has caused a loop-hole in the restrictive UN law that once prohibited the selling of raw ore to the Martians. Then suddenly, word comes from the new mining base on Ganymede- something has been found in the ice, something puzzling and unnatural that has been buried since the time of David. More surprising is the fact that Alexandria seems to already know of its existence.SHULTZ— With the construction of the new Apex plant on Deimos, and the end of the ore embargo, Mars is entering a 'bubble economy'. Governor Shultz and Lt. Governor Jung finally feel like they are doing their jobs for the Martian people. But, using the Free Mars Now movement like a tool for their own agenda has made them powerful enemies. Even as Shultz and Jung ride the heady days of making Mars free of UN greed they know those days are numbered. Colonel Compton is slowly putting together the pieces of the puzzle that will link them to the terrorist attacks. They must plan for a future Mars knowing that their own demise is soon to come.COMPTON— The failed attempt to ambush FMN terrorists at Cydonia Depot cost seven of his people their lives, and Compton is facing a possible court-martial. The families and friends of those that died alongside his soldiers do not believe their loved-ones were terrorists, and the news media has ahold of the story. But, the embattled Lieutenant Colonel knows his duty. With no leads in one hand, and a hanging mob in the other, he must somehow find the head of the Free Mars terrorists and cut it off.",
  "genres": [],
  "author": "R.L. Dean",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/50919420-year-of-the-child"
}