{
  "title": "Jackson",
  "description": "Jody Luther is a 15 year-old white girl battling insanity at home and hate-filled 1970 Jackson, Mississippi leading to the Jackson State Massacre.Review by Jackson Free Press:‘Jackson’ Regales a Laborious, History-Packed TaleCindy Marabito's novel \"Jackson\" focuses on dark times in Mississippi. By Carlton McGroneDespite the leaps of progress in our capital city, its less-than-glamorous roots come as no shock to natives or migrants. Often, a forced encounter with that bloody history is met with drastic denial and resistance, especially when experiencing this turmoil through an all-encompassing narrative. However, giving a courageous lens to curious readers can present a reflective commentary on an era overflowing with ignorance. Boasting a digestible, engrossing title, \"Jackson\" aims to portray the titular city at the height of one of its most disastrous moments in history.In this novel, Austin, Texas, resident Cindy Marabito constructs a narrative in the vein of her influencers, namely Harper Lee, Margaret Mitchell and Eudora Welty. At its very core, \"Jackson\" is a novel about smashing prejudice and unburying genuine love for a wide variety of people, despite differences. It examines the treatment of the mentally ill, toxic masculinity and even the maturing lineage of feminism.The story, which is set in 1970 Jackson, follows the aptly named Jody Luther, a 15-year-old white southerner who transfers into Murrah High School on the historic day that black students were finally allowed to attend. Marabito magnificently runs with this initial premise, sketching iconic black-and-white photos of armed soldiers reluctantly escorting children onto the premises. Passive racism and silent hatred ooze from Jody's classmates who are suddenly squashed into a classroom under the care of a black teacher.Jody, herself, presents one of the biggest triumphs and tragic failures of the novel. In some ways she is a cliche white hero; she is strong-willed and not easily bent toward the whim of others, thanks to the enlightened household she grew up in with her forward-thinking mother, Grace. Still, being a high school student, Jody is woefully unaware of her safety and privilege until she is forced to research Emmett Till, the 14-year-old black boy murdered by white men in Money, Miss., with her black classmate.However, in several instances within the book, Jody more closely resembles a rambling object than a human being. Told entirely in first-person, Jody's inner thoughts are strangely analytical and unfeeling in the wake of unfamiliar, morally corrupt occurrences. She comes across as a character who regularly experiences disassociation, which would be understandable considering the life she had lived taking care of her mentally decaying mother.Jody's inner dialogue ironically makes the narrative that much more impersonal, drawing the reader's attention toward her long-winded explanations and away from whatever point she may or may not be making.As Jody mentions early in the novel, she has always been a fan of history, and the author is never afraid to flex this particular muscle through the portrayals of her characters. Marabito's fascination with the various social contracts hidden within Mississippi's climate is what makes this novel so compelling. As his name was mentioned, novelist F. Scott Fitzgerald's influence is also entangled throughout the narrative.Big Jim's family is one worthy of the racially obsessed Tom Buchanan as he is characterized as the most immediate threat Jody faces in her everyday life. Men, in general, play a chaotic role in Jody's story. Marabito capitalizes on the sheer vile nature of the most basic instincts of white, southern men, displaying how the trait contaminates offspring and those within their vicinity.Jody and her younger sister are, both physically and morally, shown as foils to the intolerable Big Jim and Jim Jr. Meanwhile, Jody's \"insane\" mother ends up being the one to teach her the value of equality, while the remaining members of her family idly encouraging racist tendencies only serves to punctuate Marabito's underlying criticism of the social treatment of the mentally ill—however sparse and disconnected that particular storyline feels from the rest of the novel.Despite its various weaknesses, \"Jackson\" achieves, and surpasses, what it sets out to accomplish. While Marabito may not be the most elegant when it comes to her prose and scene construction, her surrounding cast of utterly uncomfortable characters feels unique to this familiar yet out-of-reach world. With it, Marabito has bottled the hopeless despair of a Jackson forced to integrate in 1970.",
  "genres": [],
  "author": "Cindy Marabito",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/50918216-jackson"
}