{
  "title": "Counting on Cole",
  "description": "She was the one who got away. The one who ripped out his heart and took it with her when she left.Cole Vincent never expected to see Evangeline Lake again. Back in the dark and bloody day, he’d been hired by her brother to save her in a mission that went straight to hell. Evangeline had been kidnapped and held for ransom, but he’d been sent in with a covert team to get her out. Thrown together in the dark, a stunning attraction burned through them. But she wasn’t meant to be with an ex-soldier who had a past that was littered with secrets and death. She went back to her fancy world. He went back to hunting. Tried to forget her. Case closed.There are some people you can never forget.Evangeline “Evie” Lake fell hard and fast for her tall, dark, and dangerous rescuer. Then he flew her back to her home, kissed her goodbye on the doorstep, and walked his sexy self away with looking back. He broke her heart into a million little pieces, and she swore off the “bad boys”—they were just trouble she didn’t want. Case closed.She needs help. The kind that only someone like Cole can give to her.The past is coming back to attack. Evie’s kidnapper was never caught, and when she’s nearly abducted in New York, her brother calls in the one man that he knows he can count on…the one man who has proven he can protect Evie from the worst threats out there. The one man that Evie absolutely, positively does not want to see again…The only man she’s ever loved.Cole takes the case. Becomes her bodyguard. Gets far too close to her and stirs memories that should have been dead and buried in a six foot hole. The white-hot attraction burns ever brighter between them, but Evie will not fall for him again. Will not. Except…She is. He is. They are…falling.Cole wants Evie more than anything, and this time, he won’t walk away. This time, there is nothing that can keep them apart. He’ll fight like hell for the woman he’s always loved. He finally has a second chance with Evie. He won’t screw this up. And he will not let her go again…he will prove to Evie that she can always count on him to keep her safe.She is the only one he wants. The one who owns his heart. Anyone who wants to hurt her? They have to go through him. Case closed.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Second Chance",
    "Contemporary",
    "Suspense",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/50914017-counting-on-cole"
}