{
  "title": "Dear Sun, I Am Real",
  "description": "**please read \"Star Rating System - What Makes a 5-star\" book blog before posting your rating and reviewIn Dear Sun, I Am Real science fiction author S. G. Rainbolt, artfully demonstrates the consequences of a boy’s fascination with a computer world. Before U.S. President Barack Obama announced the end of NASA's manned space flight on February 1, 2010, Rainbolt had penned such a development nearly 5 years before with his short story “Dana's Chamber”. Now, the completed novel (Dear Sun, I Am Real) sets future events 160 years after the implosion of NASA and introduction of private-funded civilian space travel.Darkimigraines, a side-effect from his hundred-year sleep, takes over Dana's mind. He bats away many restless nights while losing grip on reality and the key to saving, not only himself, but hundreds on Galaxy, a ship destined to arrive in the center of the universe sometime the next millennium. Doubtful of his abilities, Dana is forced to rely on his computer generated companions to stop a digital paradox from returning to Earth. He must succeed but he falls short of the genius he once was. It is the genius he needs to be to end the unbridled paradox that is unraveling before him. He is destined to fail because he is the one who created it...................................................................................................\tDana's monocle hung on the back of corridor computer’s arm chair, having been snagged out of his pocket during the fight. An approaching red star's rays shone through the nearby window, passed through the Earth relic and focused hot light over his forehead.\tThe ship swayed suddenly, marking a once sanctioned space voyage being overly adjusted. Dana's motionless body rolled to its side, passing under the legless chair with the beaming monocle light following him. Finally, he awoke and jolted to his feet, grabbing his head and leaning forward to brace himself as the ship pitched violently and rolled imminently again.\tThe terminal screen transitioned from standby mode to full-on as it detected a human at the controls again. A route map to the ship’s bridge flashed up. It was at that time, he knew he had to find the girl he loved and ...kill her.***PLEASE READ THIS AUTHOR'S BLOG: \"STAR RATING SYSTEM - WHAT MAKES A 5-STAR\" BOOK BEFORE POSTING YOUR RATING AND REVIEW.***",
  "genres": [],
  "author": "S.G. Rainbolt",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/12533405-dear-sun-i-am-real"
}