{
  "title": "Awkward Is The New Brave: Wipeouts happen, get back up anyway",
  "description": "Ever wanted to be brave and do “your thing”, only to be sucked into the undertow of self-doubt?   Using humour as her shield and honesty as her sword, 40-something single mum Belle Lockerby embarks on a “Year of Bravery” to become a worthiness warrior, putting the ghosts of her painful past to rest. Her touching story powerfully weaves together the many life traumas and tragedies (the least of which is the state of her underwear drawer) while bringing hope, light, joy and, ultimately, bravery to those willing to walk with her.  In the midst of excruciating grief and loss, Belle chose to overcome the arsenal of “adversity wedgies” that have blessed her life. She firmly made up her mind to dust herself off, make some adjustments, get back up and be brave. Her inspiring memoir shows how seemingly insurmountable walls of self-protection can be broken down brick by brick to allow people back in and to experience love once again.  With heart-wrenching vulnerability and raw honesty, some of her deepest secrets are revealed as Belle encourages you to be brave enough to be who you are, awkward enough to try out things that are hard, new and uncomfortable, and kind enough to become the safe space for others doing the same.  She candidly shares life lessons learned from literally finding yourself in the shit and discovering the freedom to just be by travelling to one of the world’s most magnificent natural wonders. Belle shows all of us the power of being seen – fully seen by another human being, with all your vulnerability, all your strength, all your flaws – and still be loved.  More than a life story, her own bravery enabled her to quit running on autopilot and start practicing being kind to herself. Belle takes this passion to remind women they are worthy of fighting for themselves, encouraging you to be brave and step with your “geez I’d love a pedicure” feet into living, not just existing.  Belle knows firsthand the struggle of uncovering who we really want to be instead of trying to fit in the box – leftovers from corporate conditioning. After realising she was trying to achieve someone else’s definition of success, she broke out of the 9-to-5 mould and became a successful lover of life.  If you’ve been knocked down by life’s storms, Belle’s here to remind us that we are worthy of being fighters for AND lovers of ourselves. Why not step into the abyss of awkwardness and see where your feet land? Learn how to get among joy in the sea of life and do the scary thing instead of sitting in the comfortable, growth-stunting safety of sand in your swimsuit familiarity.  Belle’s intensely personal story is the ultimate example of finding the warrior in you and reminds us that we’re all awkwardly brave in one way or another anyway.",
  "genres": [
    "Self Help"
  ],
  "author": "Belle Lockerby",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/50910533-awkward-is-the-new-brave"
}