{
  "title": "Blackout: How Black America Can Make Its Second Escape from the Democrat Plantation",
  "description": "Political activist and social media star Candace Owens explains all the reasons how the Democratic Party policies hurt, rather than help, the African American community, and why she and many others are turning right. What do you have to lose? This question, posed by then-presidential candidate Donald Trump to potential black voters, was mocked and dismissed by the mainstream media. But for Candace Owens and many others, it was a wake-up call. A staunch Democrat for all of her life, she began to question the left’s policies toward black Americans, and investigate the harm they inflict on the community. In Blackout, social media star and conservative commentator Owens addresses the many ways that liberal policies and ideals are actually harmful to African Americans and hinder their ability to rise above poverty, live independent and successful lives, and be an active part of the American Dream. Weaving in her personal story that brought her from the projects to 1600 Pennsylvania Avenue, she demonstrates how she overcame her setbacks and challenges despite the cultural expectation that she should embrace a victim mentality. Owens argues that government assistance is a double-edged sword, that the left dismisses the faith so important to the black community, that Democratic permissiveness toward abortion disproportionately affects the black babies, that the #MeToo movement hurts black men, and much more. Well-researched and intelligently argued, Blackout lays bare the myth that all black people should vote Democrat—and shows why turning to the right will leave them happier, more successful, and more self-sufficient.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Audiobook",
    "History",
    "Race",
    "Biography",
    "Memoir"
  ],
  "author": "Candace Owens",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/50930292-blackout"
}