{
  "title": "Harbor for the Nightingale",
  "description": "A girl’s spy school amid Jane Austen’s high society . . .London, 1814. Emperor Napoleon has forced Europe to its knees, and now he plots to seize control of Britain. Miss Maya Barrington, one of Miss Stranje’s unusual girls, must act as a double agent and rely upon her uncanny gift of persuasion to stop Napoleon.She brought the mystery of India with her . . .Maya is from two different worlds. Her Indian mother died and her father, an English lord, took her away from the warmth of India to cold inhospitable London. She was not welcomed. Especially by her prejudiced stepmother, who sent Maya away to Stranje House, a reform school known for its harsh discipline.The school’s dark reputation hides the fact that the headmistress, Miss Stranje, is actually training these unusual young ladies to enter the dangerous world of spies, diplomacy, and war. Stranje House turns out to be the perfect hiding place for Maya—she finally carves out a sense of belonging among these brilliant outcast girls.But her world turns upside down when Miss Stranje and the girls are drawn into Napoleon’s devious conspiracy.To protect the friends she now holds dear, and to keep Napoleon and his ruthless spies from destroying the world she has grown to love, Maya agrees to play a duplicitous role. She must enter this treacherous game on the arm of the elusive Lord Kinsworth. Maya can read almost everyone—not so with this young rascal. Quick with a jest and armed with lethal charm, Lord Kinsworth remains just beyond her reach. Can she trust him?With Britain’s future at risk and those she loves in deadly peril, Maya questions everything she thought she understood about life, love, and loyalty.",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Romance",
    "Historical",
    "Fantasy",
    "Regency",
    "Historical Romance"
  ],
  "author": "Kathleen Baldwin",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/50934274-harbor-for-the-nightingale"
}