{
  "title": "Echo Burning",
  "description": "There was a time when a US-set crime novel by a British writer (such as James Hadley Chase's No Orchids For Miss Blandish) could get away with a certain carelessness in local detail. Not any more. Since the Englishman Lee Child began writing his superbly authentic novels, few readers on either side of the Atlantic would accept anything other than the gritty authenticity of books such as Child's latest, Echo Burning. He prides himself on the plausibility of his settings and characters, and actually has a more striking sense of the American landscape that many native writers. He never allows the reader to forget just where his hero Jack Reacher is, what he's feeling, smelling, seeing. And Reacher has slowly but surely become one of the most fully rounded protagonists in thriller fiction. It's hardly surprising that the novels have been optioned for filming; what is surprising is the fact that it hasn't happened before.  Jack finds himself suffering the intense heat of a Texas summer, and (leaving behind a messy situation) hardly worries about the dangers of who will pick him up when he hitches a ride. But it's a beautiful young rich girl driving a Cadillac who gives Jack a lift. Carmen tells him she has a little girl who is being observed by unseen and sinister forces. And her brutal, abusive jailed husband is more than likely to kill her when he gets out. It's obviously highly inadvisable for Jack to travel to Carmen's remote ranch in Echo County and become involved in her problems, but (needless to say) he does just that. And he's soon encountering lies, lust and prejudice, with untrustworthy cops and lawyers absolutely no help. Jack finally realises that there is only one way to resolve this lethal situation.  As always with Child, the narrative rattles along with real élan, and the sultry characterisation keeps everything ruthlessly on track. --Barry Forshaw",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Crime",
    "Audiobook",
    "Action",
    "Suspense"
  ],
  "author": "Lee Child",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/509400.Echo_Burning"
}