{
  "title": "المسجد الأقصى والصخرة المشرفة",
  "description": "يعالج هذا الكتاب ما يفعله اليهود والحركة الصهيونية تحت المسجد الأقصى والصخرة المشرفة في فلسطين سعياً وراء تأكيد ما توهموه بأن لهم إرثاً مادياً تحت القبة المقدسية، وحسبما تمليه عليه ظنونهم التاريخية خطأ. في هذا الكتاب تم توصيف لجمة من الحفريات الأثرية التي أجراها اليهود بهدف العثور على بقايا الهيكل المظنون في وجوده تحت الصخرة المشرفة، والمتبناة على انقاض الهيكل. في أبواب الكتاب الثمانية نجد استقراء تفصيلياً لخرائط وحفريات تمتد لعقود طويلة من الزمن. ربطت النفق الكنعاني الذي كان يربط بدوره بين عين سلوان والكتف العلوي من المسجد الأقصى. ثم دراسة النفق الرئيسي الذي يربط النفق الممتد من موقع قوس ولسون حى موقع المدرسة العمرية حالياً. ويدرس المؤلفان معالجات الربط بين شبكة الأنفاق وبين الآبار المنتشرة تحت ساحات المسجد الأقصى. ثم الآبار التي لم ينته حفرها خلال الفترة الهيرودية ويتواصل البحث في المعالجات الحفرية التي تمت للممرات التي كانت تربط بين الآبار وبين خط النفق الممتد عبر الخط الغربي، والذي تبني إسرائيل الآن خلال أرضياته مدينة دينية سياحية. والمقارنة بين الجهة الشمالية والأخرى الجنوبية. ويختم الكتاب أبوابه بدراسة في الوثائق التي تعالج موضوع إقامة مذبح تحت قبة الصخرة في عصر داود. أي ما يسمى قدس الأقداس. إن هذا الكتاب شامل وواسع في استقراءاته ومعالجاته لأوهام اليهود في إيجاد ما يؤكد أحقيتهم في أرض فلسطين، ويضع أمام القارئ حقائق نادرة تتعلق بما يفعله اليهود بحثاً عن أوهامهم الزائفة. إنه كتاب يؤكد زيف إدعاءات الصهيونية بالاعتماد على الحقائق التاريخية والأثرية.. المحتويات: 1. الباب الأولى: قراءة عبر خرائط المساحة ونتائج الحفريات الأثرية التي ربطت بين النفق الكنعاني الذي كان يربط بين عين سلوان والكتف العلوي أي في الجهة الجنوبية من المسجد الأقصى. 2. الباب الثاني: النفق الرئيس الذي كان يربط بين النفق العلوي والجهة الغربية التي تمتد حوالي أربعمائة وثمانية وثمانية متراً أي من موقع قوس ولسون حتى موقع المدرسة العمرية حالياً. برج أنطونيا الذي بناه هيرودوس في بداية القرن الأول قبل الميلاد . 3. الباب الثالث: يعالج تلك الآبار التي لم ينته حفرها عبر تلك الفترة الهيرودية. 4. الباب الرابع: يعالج تلك الممرات التي كانت تربط بين الآبار وخط النفق الممتد. 5. الباب الخامس: يعالج هذا الباب الآبار والأقنية الرئيسة في ساحات المسجد الأقصى التي تحدثت عنها المراجع التاريخية والدينية ووصفتها بأن لها صفة القدسية وجزء من هذه الآبار له صفة أنه أعمق نقطة في ساحات المسجد الأقصى. 6. الباب السادس: المقارنة عبر المعالجة العلمية بين الجهة الشمالية والجهة الجنوبية من المسجد الأقصى. هذه المقارنة تعتمد على مصادر أعمال المساحة الأثرية وقراءة في المصادر التاريخية ومن ثم دراسة نتائج الحفريات التي تمت في المنطقة منذ مائة وعشرين سنة .... 7. الباب السابع: الوثائق التي تعالج نصوص الوثيقة رقم 4.40522 التي تتحدث عن إقامة مذبح تحت قبة الصخرة في عصر داود وقد سمي بقدس الأقداس.",
  "genres": [],
  "author": "إبراهيم الفني",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/12534270"
}