{
  "title": "Victorian Ghost Stories: An Oxford Anthology",
  "description": "\"'I think it must have been two o'clock at least when I thought I heard a sound in that--that odious dark recess at the far end of the bedroom.... Without at first a suspicion of anything supernatural, on a sudden I saw an old man, rather stout and square, in a sort of roan-red dressing-gown, and with a black cap on his head, moving stiffly and slowly in a diagonal direction, from the recess, across the floor of the bedroom, passing my bed at the foot, and entering the lumber-closet at the left. He had something under his arm; his head hung a little at one side; and, merciful God when I saw his face....'\" There's nothing like a good ghost story. And in Victorian Ghost Stories, Michael Cox and R.A. Gilbert bring together thirty-five well wrought tales of haunted houses, vengeful spirits, spectral warnings, invisible antagonists, and motiveless malignity from beyond the grave. The Victorians excelled at the ghost story, it was as much a part of their literary culture as the realistic novel, and it was practiced by almost all the great writers of the age. Cox and Gilbert here provide samples from Charles Dickens, Robert Louis Stevenson, Rudyard Kipling, Sir Arthur Conan Doyle, Henry James, and Wilkie Collins, as well as such classic ghost-story specialists as M.R. James and J.S. Le Fanu (whose \"Account of Some Strange Disturbances in Aungier Street,\" considered one of the best haunted-house story ever written, is excerpted above), plus one or two genuine rarities for the supernatural fiction enthusiast to savor. The editors also reveal the key role played by women in the growth of the genre, including stories by Elizabeth Gaskell, Mrs. Craik, Mrs. Henry Wood, Amelia B. Edwards, Charlotte Riddell, and many others. Finally, they offer an informative introduction, detailed source notes, and an extensive survey of ghost-story collections from 1850 to 1910. Traditional in its forms, but energetically inventive and infused with a relish of the supernatural, these classic ghost stories still retain their original power to unsettle and surprise. Every one is guaranteed to satisfy what Virginia Woolf called \"that strange human craving for the pleasure of feeling afraid.\"Includes:The old nurse's story by Elizabeth GaskellAn account of some strange disturbances in Aungier Street by J.S. Le FanuThe miniature by J.Y. AkermanThe last house in C-Street by Dinah MulockTo be taken with a grain of salt by Charles DickensThe Botathen ghost by R.S. HawkerThe truth, the whole truth, and nothing but the truth by Rhoda BroughtonThe romance of certain old clothes by Henry JamesPichon & Sons, of the Croix Rousse by AnonymousReality or delusion? by Mrs Henry WoodUncle Cornelius, his story by George MacDonaldThe shadow of a shade by Tom HoodAt Chrighton Abbey by Mary Elizabeth BraddonNo living voice by Thomas Street MillingtonMiss Jéromette and the clergyman by Wilkie CollinsThe story of Clifford House by AnonymousWas it an illusion? by Amelia B. EdwardsThe open door by Charlotte RiddellThe captain of the \"Pole-star\" by Sir Arthur Conan DoyleThe body-snatcher by Robert Louis StevensonThe story of the rippling train by Mary Louisa MolesworthAt the end of the passage by Rudyard Kipling\"To let\" by B.M. CrokerJohn Charrington's wedding by E. NesbitThe haunted organist of Hurly Burly by Rosa MulhollandThe man of science by Jerome K. JeromeCanon Alberic's scrap-book by M.R. JamesJerry Bundler by W.W. JacobsAn Eddy on the floor by Bernard CapesThe tomb of Sarah by F.G. LoringThe case of Vincent Pyrwhit by Barry PainThe shadows on the wall by Mary E. WilkinsFather Macclesfield's tale by R.H. BensonThurnley Abbey by Perceval LandonThe kit-bag by Algernon Blackwood",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Classics",
    "Gothic",
    "Ghosts",
    "Victorian"
  ],
  "author": "Michael Cox",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/509395.Victorian_Ghost_Stories"
}