{
  "title": "Ruling Your World: Ancient Strategies For Modern Life",
  "description": "You’re stuck in the airport security line, late for a flight. The line isn’t moving. You’re angry at the security personnel for taking so long, you’re irritated at the other passengers for having so much stuff, you’re mad at your boss for sending you on this trip in the first place. By the time you get to your gate you’re angry, deflated, and exhausted. Then someone cuts in front of you in the line to board and you snap. “There’s a line, you know!” Is that really you, standing in an airport, yelling at a stranger, emotions raging?It happens to most of us more than we’d like to admit. In an instant, our lives seem out of control and overwhelming. It’s always something, isn’t it? But what if you could approach every part of your life—from the smallest decisions to life’s biggest setbacks—with total confidence, clarity, and control?According to Sakyong Mipham, we all have that power. The secret is simple: If you just stop thinking about yourself all the time, happiness and confidence will come naturally. It sounds absurd and, what’s more, impossible. But in Ruling Your World , Sakyong Mipham shares ancient secrets on how to take control of our lives and be successful while cultivating compassion for others and confidence in our own intelligence and goodness. The key to this well-being lies in the ancient strategies of the warrior kings and queens of Shambhala.The kingdom of Shambhala was an enlightened kingdom of benevolent kings and queens and fiercely trained warriors. No one knows for sure whether this kingdom was real or mythical, but there are ancient guidebooks to this land and practical instructions for creating a Shambhala in your own world, bringing peace, purpose, and perspective into your life and environment.Sakyong Mipham, the descendant of a warrior king, has inherited these teachings and gives us the lessons and myths of the great rulers and warriors of Shambhala. He makes these teachings relevant to our twenty-first-century lives in a fresh and witty voice and helps us all to realize our potential for power and control in a seemingly uncontrollable world.For the first time ever, revered spiritual leader Sakyong Mipham brings the lessons of the ancient Shambhala warriors and rulers to the Western world and shows us how to live our lives with confidence.Most of us are living in a haze—sometimes helping others, sometimes helping ourselves, sometimes happy, sometimes sad. We don’t feel in control of our own lives. The ancient teachings of Shambhala rulership show us that we all have the ability to rule our own world and live with confidence. To do this, we need to use our daily lives to be strong, as opposed to aggressive, and to act with wisdom and compassion. This may sound difficult, but when we begin to mix this ancient wisdom of rulership into our everyday life, we have both spiritual and worldly success. We don’t need to abandon our life and become an ascetic or a monk in order to gain confidence and achieve this success. We can live in the world as a ruler no matter what we are doing.—from Ruling Your World",
  "genres": [
    "Buddhism",
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Religion",
    "Philosophy",
    "Psychology"
  ],
  "author": "Sakyong Mipham",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/50967.Ruling_Your_World"
}