{
  "title": "Tempting Fate",
  "description": "JacksonEveryone says what a lucky guy I am. I've got a great kid, an amicable relationship with my ex, and a job working cattle on one of the largest ranches in Eden, Wyoming. Only problem is that \"everyone\" has no clue that I'm living a half-life.Because the other half is a closeted gay man who's got it bad for the young ranch hand he works with day in and day out.But the very straight Travis isn't an option. And even if he were, my sexy co-worker isn't exactly committed to commitment.So it's time for a change and since gay guys aren't exactly falling off trees in Eden, I'm going to need a little help...TravisIt was supposed to be a Friday night like any other. Me and my best friend heading into town to find some female company for a few hours. And even though Jackson usually goes home alone, he's still a great wingman.Unfortunately, between my impatience to get the night started and my bad habit of snooping, I've learned two things about Jackson in the space of five minutes that have left me all kinds of confused.Jackson's gay.And he's placed a classified ad to try and hook up with some guy he can't get his mind off after a brief run-in at a hardware store in the city.Now I can't get my mind off Jackson.Don't get me wrong, I like the ladies, but why can't I stop thinking about my good-looking best friend and the faceless stranger he's ready to start something new with? Jackson doesn't need some random guy right now. Not when he has me...Oh hell. Author's Note: Please note that this story was previously published as part of a charity anthology (Heart2Heart: A Charity Anthology, Volume 3) so it was intended to be a certain length. Although it is a complete story with an HEA, if you don’t care for short stories, Jackson and Travis’s tale may not be for you.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Friends To Lovers",
    "Novella",
    "Short Stories",
    "LGBT"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/50980992-tempting-fate"
}