{
  "title": "My Song: A Memoir",
  "description": "Harry Belafonte is not just one of the greatest entertainers of our time; he has led one of the great American lives of the last century. Now, this extraordinary icon tells us the story of that life, giving us its full breadth, letting us share in the struggles, the tragedies, and, most of all, the inspiring triumphs.   Belafonte grew up, poverty-ridden, in Harlem and Jamaica. His mother was a complex woman—caring but withdrawn, eternally angry and rarely satisfied. His father was distant and physically abusive. It was not an easy life, but it instilled in young Harry the hard-nosed toughness of the city and the resilient spirit of the Caribbean lifestyle. It also gave him the drive to make good and channel his anger into actions that were positive and life-affirming. His journey led to the U.S. Navy during World War II, where he encountered an onslaught of racism but also fell in love with the woman he eventually married. After the war he moved back to Harlem, where he drifted between odd jobs until he saw his first stage play—and found the life he wanted to lead. Theater opened up a whole new world, one that was artistic and political and made him realize that not only did he have a need to express himself, he had a lot to express.   He began as an actor—and has always thought of himself as such—but was quickly spotted in a musical, began a tentative nightclub career, and soon was on a meteoric rise to become one of the world’s most popular singers. Belafonte was never content to simply be an entertainer, however. Even at enormous personal cost, he could not shy away from activism. At first it was a question of personal dignity: breaking down racial barriers that had never been broken before, achieving an enduring popularity with both white and black audiences. Then his activism broadened to a lifelong, passionate involvement at the heart of the civil rights movement and countless other political and social causes. The sections on the rise of the civil rights movement are perhaps the most moving in the book: his close friendship with Martin Luther King, Jr.; his role as a conduit between Dr. King and the Kennedys; his up-close involvement with the demonstrations and awareness of the hatred and potential violence around him; his devastation at Dr. King’s death and his continuing fight for what he believes is right.   But My Song is far more than the history of a movement. It is a very personal look at the people in that movement and the world in which Belafonte has long moved. He has befriended many beloved and important figures in both entertainment and politics—Paul Robeson, Eleanor Roosevelt, Sidney Poitier, John F. Kennedy, Marlon Brando, Robert Kennedy, Nelson Mandela, Fidel Castro, Tony Bennett, Bill Clinton—and writes about them with the same exceptional candor with which he reveals himself on every page. This is a book that pulls no punches, and turns both a loving and critical eye on our country’s cultural past.   As both an artist and an activist, Belafonte has touched countless lives. With My Song, he has found yet another way to entertain and inspire us. It is an electrifying memoir from a remarkable man.",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "Music",
    "Autobiography",
    "History",
    "Politics"
  ],
  "author": "Harry Belafonte",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/12535150-my-song"
}