{
  "title": "The Black Prince",
  "description": "In the war-torn rubble of the human world, can a rebel elf and a lost dragon prince find love, or will a dark threat tear them and their world apart forever?\nA new land, a new court, a new king, but some things never change. Broken in all ways, Akiem fled his life as the amethyst prince only to land at the mercy of the beautiful but deadly diamond king, Luceran. Akiem knows dragons. He knows he’ll die today, tomorrow, whenever Luceran’s executioner brings down his axe, and maybe it’s all he deserves. He’s ready for death, craves it even, like he craves the elf with flame-red hair and a sly smile, the damn elf whose stolen kiss lit Akiem up in ways he didn’t know were possible. Akiem doesn’t do males and he definitely doesn’t do elves. But some things do change.Drifter, mercenary, lover — Zane is all those things. He’ll do almost anything for coin. But he doesn't do dragons and he definitely doesn’t do love. It's not such a bad life for an elf. Better than the rest of his kin, living under the rule and whims of the dragon king, Luceran. Working as a bodyguard in Bayston should have been quick coin in his pocket before moving on. But King Luceran has a new toy he parades at court. A dragon with eyes of gold and scales as black as night. He probably shouldn’t have kissed him. Definitely should have killed him. And now, moving on is the farthest thought from Zane's mind. Because Luceran's new toy is not like the other dragonkin. And maybe, just maybe, the terrible, beautiful beast has the key to freeing all the persecuted elves and unlocking Zane's restless heart. Zane doesn't do love and he doesn't do dragons. But with the arrival of the Black Prince, everything is about to change. ***  The Black Prince is part of the Silk & Steel world and takes place after events in Silk & Steel. It can be read as a standalone.   The publication date is temporary and likely to be brought forward to December 2019. The Black Prince will be in Kindle Unlimited on its release.  Please note: This novel contains a m/m love story and adult content. The Black Prince is intended for mature readers. Triggers: reference to past rape and the psychological aftermath, physical abuse, brief torture, self harm.   An MM Dark Fantasy.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Dragons",
    "Romance",
    "Dark",
    "LGBT",
    "Shapeshifters"
  ],
  "author": "Ariana Nash",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/50979555-the-black-prince"
}