{
  "title": "The Age of Entanglement: When Quantum Physics Was Reborn",
  "description": "A brilliantly original and richly illuminating exploration of entanglement, the seemingly telepathic communication between two separated particles—one of the fundamental concepts of quantum physics.In 1935, in what would become the most cited of all of his papers, Albert Einstein showed that quantum mechanics predicted such a correlation, which he dubbed “spooky action at a distance.” In that same year, Erwin Schrödinger christened this spooky correlation “entanglement.” Yet its existence wasn’t firmly established until 1964, in a groundbreaking paper by the Irish physicist John Bell. What happened during those years and what has happened since to refine the understanding of this phenomenon is the fascinating story told here.We move from a coffee shop in Zurich, where Einstein and Max von Laue discuss the madness of quantum theory, to a bar in Brazil, as David Bohm and Richard Feynman chat over cervejas . We travel to the campuses of American universities—from J. Robert Oppenheimer’s Berkeley to the Princeton of Einstein and Bohm to Bell’s Stanford sabbatical—and we visit centers of European Copenhagen, home to Bohr’s famous institute, and Munich, where Werner Heisenberg and Wolfgang Pauli picnic on cheese and heady discussions of electron orbits.Drawing on the papers, letters, and memoirs of the twentieth century’s greatest physicists, Louisa Gilder both humanizes and dramatizes the story by employing their own words in imagined face-to-face dialogues. Here are Bohr and Einstein clashing, and Heisenberg and Pauli deciding which mysteries to pursue. We see Schrödinger and Louis de Broglie pave the way for Bell, whose work is here given a long-overdue revisiting. And with his characteristic matter-of-fact eloquence, Richard Feynman challenges his contemporaries to make something of this entanglement.",
  "genres": [
    "Science",
    "Physics",
    "Nonfiction",
    "History",
    "Quantum Mechanics",
    "History Of Science",
    "Popular Science"
  ],
  "author": "Louisa Gilder",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/5096882-the-age-of-entanglement"
}