{
  "title": "In Defense of Looting: A Riotous History of Uncivil Action",
  "description": "A radical argument for why rioting and looting are our most powerful tools of dismantling white supremacy.\n\nLooting--a crowd of people publicly, openly, and directly seizing goods--is one of the more extreme actions that take can place in the midst of social unrest. Even self-identified radicals distance themselves from looters, fearing that violent tactics reflect badly on the broader movement.However, in this deftly argued corrective, Vicky Osterweil argues that while looting is often maligned in today's society, it is, and has always been, one of our most powerful tools of dismantling capitalism and white supremacy. Stealing goods and destroying property are a direct means of wealth redistribution and a practical, immediate way of improving life for the working class-- not to mention a brazen message to the police, the state, and an unjust society. All our beliefs about the innate righteousness of property and ownership, Osterweil explains, are built on the history of anti-Black and settler oppression--meaning that belief in the right to own property is innately, structurally white supremacist.From the slave revolts that started a social revolution in the South to the more recent #BlackLivesMatter and climate change movements, Osterweil makes a convincing case for rioting and looting as weapons that bludgeon the status quo while uplifting the poor and marginalized. In Defense of Looting is a history of violent protest sparking social change; a compelling reframing of radical activism; and a practical vision for the redistribution of wealth, a new relationship to property, and a radically restructured society.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Race",
    "Social Justice",
    "Theory",
    "Sociology"
  ],
  "author": "Vicky Osterweil",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/50999303-in-defense-of-looting"
}