{
  "title": "Gilded Dreams",
  "description": "\"Packed with intrigue, textured world-building, and the fascinating rise of the women's rights movement, GILDED DREAMS is a hit!\"-Heather Webb, USA Today Bestselling AuthorFrom the bestselling author of GILDED SUMMERS comes a powerful novel of the last eight years of the American Women’s fight for suffrage.The battle for the vote is on fire in America. The powerful and rich women of Newport, Rhode Island, are not only some of the most involved suffragettes, their wealth - especially that of the indomitable Alva Vanderbilt Belmont - nearly single-handedly funded the major suffrage parties. Yet they have been left out of history, tossed aside as mere socialites. In GILDED DREAMS, they reclaim their rightful place in history.Pearl and Ginevra (GILDED SUMMERS) are two of its most ardent warriors. College graduates, professional women, wives, and mothers, these progressive women have fought their way through some of life’s harshest challenges, yet they survived, yet they thrive. Now they set their sights on the vote, the epitome of all they have struggled for, the embodiment of their dreams.From the sinking of the Titanic, through World War 1, Pearl and Ginevra are once more put to the test as they fight against politics, outdated beliefs, and the most cutting opponent of all... other women. Yet they will not rest until their voices are heard, until they - and all the women of America - are allowed to cast their vote. But to gain it, they must overcome yet more obstacles, some that put their very lives in danger.An emotional and empowering journey, GILDED DREAMS is a historical, action-packed love letter to the women who fought so hard for all women who stand on the shoulders of their triumph.",
  "genres": [
    "Historical Fiction",
    "Womens Fiction",
    "Historical",
    "Fiction",
    "American History",
    "World War I"
  ],
  "author": "Donna Russo Morin",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/51005584-gilded-dreams"
}