{
  "title": "Wicked Earls' Club: Books 1-5",
  "description": "Meet six of the most wickedly sinful earls in all of Regency England. Together they make up the Wicked Earls’ Club. A secret group, marked with a single golden W; it is a place where these deliciously devious earls can indulge in their darkest desires. Though fate may have something else planned for them entirely.The Wicked Earls' Club (prologue)The Earl of Sussex by Tammy AndresenWickedly sinful, the Earl of Sussex, is an unrepentant rake. The Wicked Earls' Club is the perfect place for a man of his station to indulge. That is until his parents force a match that threatens to rob him of his freedom. Unwilling to be tamed, he travels to meet his bride and demand she put a stop to this farce. Except Lady Tabitha is nothing he expected, and everything he never knew he wanted. Too bad this fiery wallflower is equally bent on ending their engagement.Earl of Westcliff by Meara PlattWhen Tynan Brayden, the Earl of Westcliff, rescues Abigail Croft from ruffians one dark night outside the Wicked Earls’ Club, he never expects his carefree life to be upended by this girl with big, brandy-colored eyes and a stubborn determination to save her reckless brother. He doesn’t know why he feels the possessive need to help her. Perhaps it is because she doesn’t ask for his help or seem to want anything from him. But this Wicked Earl wants more from her... nothing less than her heart.Earl of Wainthrope by Collette CameronPierce, the Earl of Wainthorpe didn’t gamble on losing his heart when he won Bianca Salisbury at the gaming tables, but the shameful secret Bianca guards makes it impossible to love a rogue.Earl of Sunderland by Aubrey WynneHe inherits the title of rake… She hides behind her independence… Fateaccepts the challenge…Escaping his late brother’s memory, Lady Grace is a welcomedistraction for Christopher Roker. But as the attraction grows, Kitwavers between his old military life and the lure of an exceptionalbut unwilling woman.Earl of Basingstoke by Aileen FishLady Phoebe has created a fantasy version of her dream man, the Earl of Basingstoke, in her diary, and she ignores the gossip surrounding his wicked ways when he begins to pursue her. But when Basingstoke discovers Lady Phoebe’s diary, he blames her for creating the rumors and wants nothing more to do with her. Heartbroken, she goes in search of the real rumormonger. Can she prove her innocence and regain Basingstoke’s love?",
  "genres": [],
  "author": "Tammy Andresen",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/51029865-wicked-earls-club"
}