{
  "title": "Raise Your Innovation IQ: 21 Ways to Think Differently During Times of Change",
  "description": "Raise Your Innovation IQ - a new book by Leena Patel, a prominent innovation consultant and CEO of Sandbox2Boardroom.com - is a page-turning solution set of twenty-one strategies that will lead you to think differently in times of change.  Chapter by chapter, Leena takes you on a journey that opens your eyes to the big mistake we make that stalls us: our tendency to get stuck in one worldview, perceive innovation through a singular lens, and put all our energy on traditional approaches to innovation to drive revenue. Doing so, we may have unknowingly got stuck and missed many other over-looked areas that are ripe for change.  In this book, the author lays out how innovation comes in many forms and oftentimes in the unlikeliest of places. Incorporating these strategies into your growth plan may just be the key to quickly getting you unstuck, and enabling you to make that much sought after quantum leap.   Flexing this new-and-improved innovation muscle is not easy; if it were, we wouldn’t see so many leaders within so many companies struggling in the world. That’s why for every strategy, Leena has included a series of powerful yet simple actions you can take to think differently, radically expand your creativity, and drive leading-edge innovations within your team or organization. Strategically taking action on these needle-movers on a consistent basis is the fast path to creating a future-ready team or business.  Drawing from a mix of strategies that have stood the test of time, personal anecdotes, and examples from recent events in history, Raise Your Innovation IQ will easily become your go-to resource on the innovation mindset, the strategies, and the heightened level of thinking that are necessary to differentiate yourself, capitalize on new opportunities, and be positioned as a market leader.  P.S. Nothing textbook here. For those that value graphic presentations, you will find a lot to like. There are lots of images, illustrations, and other interesting visuals to make it a fun reading experience.  Raise Your Innovation IQ moves you to unlock your creative power and then hands you the action steps to future-proof your career or business. If you want to make a powerful imprint in the world... get this book!\" – Les Brown, World’s #1 Motivational Speaker  “This is a delightful little book - a fast read, sprinkled with actionable insights and nuggets of wisdom. Don’t just read it; share it with your community of doers, innovators and change agents.” – Navin Kunde, Department Manager, Open Innovation, The Clorox Company  \"Her strategies are practical, specific, measurable, and actionable.\" – Nicholas Bertram, President, GIANT Food Stores",
  "genres": [],
  "author": "Leena  Patel",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/51031374-raise-your-innovation-iq"
}