{
  "title": "America's Game: The NFL at 100",
  "description": "The authors of the New York Times bestseller 50 Years, 50 Moments celebrate the first 100 years of the National Football League, interweaving history, personal stories, memories, and observations of some of its greatest players, coaches, and advocates to chronicle football’s amazing evolution from a fledgling regional fly-by-night operation into a multi-billion global brand and one of America’s leading franchises. Over the past century, professional football has transformed from a game played in leather helmets on cow pastures to one of the most high-tech, popular sports on the planet. In this entertaining and concise history, Jerry Rice and Randy O. Williams celebrate the NFL’s centennial, bringing together colorful memories, insights, and personal experiences and observations from the heroes, losers, innovators, and defining legends who have played the game at its highest level. The NFL at 100 is filled with inside stories of the league’s fiercest rivalries, closest competitions, and most memorable characters, from the early days of Red “The Galloping Ghost” Grange and “Slingin’” Sammy Baugh to Jim Brown and “Broadway” Joe Namath to Lawrence Taylor, Jerry Rice, and Tom Brady.Cowboy fans will never forget how Roger Staubach’s Hail Mary lifted his team to a last-second playoff victory over the Vikings. Patriot followers will always point to The Tuck Rule Game as a franchise landmark where Adam Vinatieri’s two clutch kicks in deep snow propelled his team to victory over the Raiders. Generations of Steelers fans will celebrate James Harrison’s electrifying 100–yard interception return for a touchdown in Super Bowl XLIII. All are among the most memorable moments in NFL history. Divided by increments of twenty-five years, each section of The NFL at 100 includes the authors’ selections for their “All Star” players and teams.Incorporating Rice’s long-standing, insider knowledge with Williams’ interviews with those who made it happen or witnessed it firsthand—from players and coaches to broadcasters and journalists—The NFL at 100 is a unique tribute to this enduring cultural phenomenon, and will become the authoritative tribute to all that is great about the sport Americans—and the world—loves.The book will include more than a dozen photos.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Football",
    "History"
  ],
  "author": "Jerry Rice",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/51031311-america-s-game"
}