{
  "title": "Rodham",
  "description": "From the New York Times bestselling author of American Wife and Eligible, a novel that imagines a deeply compelling what-might-have-been: What if Hillary Rodham hadn’t married Bill Clinton?In 1971, Hillary Rodham is a young woman full of promise. Life magazine covered her Wellesley commencement speech, she’s attending Yale Law School, and she’s on the forefront of student activism and the women’s rights movement. Then she meets a fellow law student named Bill Clinton. A charismatic Southerner, Bill is already laying the groundwork for his political career.In each other, Hillary and Bill find a profound intellectual, emotional, and physical connection that neither has previously experienced. In the real world, Hillary followed Bill back to Arkansas, and he proposed several times. Although she turned him down more than once, she eventually accepted and became Hillary Clinton.But in Curtis Sittenfeld’s powerfully imagined tour de force of fiction, Hillary follows a different path. Listening to her doubts about the prospective marriage, she endures a devastating break-up and leaves Arkansas. Over the next four decades, she blazes her own trail—one that unfolds in public as well as in private, that crosses paths again (and again) with Bill Clinton, that raises questions about the trade-offs all of us must make to build a life.Brilliantly weaving actual historical events into a riveting fictional tale, Sittenfeld delivers an uncannily astute story for our times. In exploring the loneliness, moral ambivalence, and iron determination that characterize the quest for political power, as well as both the exhilaration and painful compromises demanded of female ambition in a world still mostly run by men, Rodham is a singular and unforgettable novel.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Politics",
    "Audiobook",
    "Book Club",
    "Literary Fiction",
    "Feminism"
  ],
  "author": "Curtis Sittenfeld",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/51011665-rodham"
}