{
  "title": "Bad Beat",
  "description": "An assassin too talented to tame.  Silas Deveroux has a problem. He has been a member of the world’s most feared assassin organization, known only as Maman, since he was nothing but a brat living on the streets of Paris. Over the years, he has been honed into a talented, ruthless killer and has claimed the coveted spot of the second most successful assassin in all of Maman. He is deadly, he is ruthless, he is feared… And all of that is perfectly fine by Silas.  The problem is… He’s bored.  He wants out of Maman. Silas wants to live life by his own rules and he’s willing to defy his terrifying superiors to do what no one has done before him- escape Maman’s clutches. Right when he thinks he can finally make his move; he receives a contract from his superior to take the life of a gangster half the world away. Even with this unusual assignment, he doesn’t foresee his boredom lifting any time soon. That is, until he meets his target’s brother.  A gangster with too much attitude and too little time.  Cin Raymes is on the edge. After the brutal murder of his baby brother- the only person that Cin held dear in his shithole of a life- he’s out for blood, bone, and teeth. But he has a problem. He’s been put on a leash by his older brother, Saint, the leader of the gang that Cin was raised in. Cin’s only role is to protect Saint and he is barely even allowed to breathe without Saint’s explicit permission. His impatience and rage are building and he’s about to snap… When an unexpected guest arrives, who shakes the foundation of Cin’s entire world.  Put them together, and what do you get?  Hell. On. Earth.    Bad Beat is a m/m romance thriller which takes place before Downswing- Book One of the Lady Luck series. It can be read as a standalone. Bad Beat is a violent, steamy, action-packed ride with two crazy men who are crazy for each other. Reader discretion is advised.",
  "genres": [
    "M M Romance",
    "Dark",
    "Crime",
    "Abuse",
    "Romance",
    "Action",
    "Dark Romance"
  ],
  "author": "J.J. Anatoliy",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/51032712-bad-beat"
}