{
  "title": "The Fishermen and the Dragon: Fear, Greed, and a Fight for Justice on the Gulf Coast",
  "description": "A gripping, twisting account of a small town set on fire by hatred, xenophobia, and ecological disaster—a story that weaves together corporate malfeasance, a battle over shrinking natural resources, a turning point in the modern white supremacist movement, and one woman’s relentless battle for environmental justice.By the late 1970s, the fishermen of the Texas Gulf Coast were struggling. The bays that had sustained generations of shrimpers and crabbers before them were being poisoned by nearby petrochemical plants, oil spills, pesticides, and concrete. But as their nets came up light, the white shrimpers could only see one culprit: the small but growing number of newly resettled Vietnamese refugees who had recently started fishing.  Turf was claimed. Guns were flashed. Threats were made. After a white crabber was killed by a young Vietnamese refugee in self-defense, the situation became a tinderbox primed to explode, and the Grand Dragon of the Texas Knights of the Ku Klux Klan saw an opportunity to stoke the fishermen’s rage and prejudices. At a massive Klan rally near Galveston Bay one night in 1981, he strode over to an old boat graffitied with the words U.S.S. VIET CONG, torch in hand, and issued a ninety-day deadline for the refugees to leave or else “it’s going to be a helluva lot more violent than Vietnam!” The white fishermen roared as the boat burned, convinced that if they could drive these newcomers from the coast, everything would return to normal. A shocking campaign of violence ensued, marked by burning crosses, conspiracy theories, death threats, torched boats, and heavily armed Klansmen patrolling Galveston Bay. The Vietnamese were on the brink of fleeing, until a charismatic leader in their community, a highly decorated colonel, convinced them to stand their ground by entrusting their fate with the Constitution.  Drawing upon a trove of never-before-published material, including FBI and ATF records, unprecedented access to case files, and scores of firsthand interviews with Klansmen, shrimpers, law enforcement, environmental activists, lawyers, perpetrators and victims, Johnson uncovers secrets and secures confessions to crimes that went unsolved for more than forty years. This explosive investigation of a forgotten story, years in the making, ultimately leads Johnson to the doorstep of the one woman who could see clearly enough to recognize the true threat to the bays—and who now represents the fishermen’s last hope.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Audiobook",
    "Book Club",
    "Politics",
    "American History"
  ],
  "author": "Kirk Wallace Johnson",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/51037254-the-fishermen-and-the-dragon"
}