{
  "title": "63 Job Search Myths: Busted, Confirmed, Plausible, and Sometimes",
  "description": "Have you ever struggled to get a job? Have you sent out numerous resumes and attended multiple interviews with no success? Have you wrung your hands and tried to figure out what you're doing wrong? And have you searched the internet for job search advice or job hunting tips, only to feel like you're drowning in a swamp of conflicting information? If so, then this book is for you! Throughout my career, I’ve spoken with several recruiters, submitted hundreds of job applications, attended dozens of interviews, and even sat on hiring committees. I've also spent many hours reading through job hunting advice online and while some of it is very good, much of it isn't very good at all, and almost all of it is confusing and contradictory. So, I wrote this book to cut through some of the clutter and to help you find the job of your dreams! The 63 job hunt myths in this book will take you through the entire hiring process, from writing your resume, to looking for job ads, applying, interviewing, and finally evaluating the results. For each job hunt myth, I'll tell you whether it's busted, confirmed, plausible, or sometimes busted and sometimes confirmed . . . and then I'll explain why. My hope is that you'll be able to use this book as a lightweight career handbook, providing you with some useful job search tips along your journey to successful employment! And to keep this book easy to follow, I've organized the 63 job search myths into the following 13 Part 1: Resume Writing Part 2: Cover Letter Writing Part 3: Selecting References Part 4: Where to Find Jobs Part 5: Evaluating Job Ads Part 6: How to Apply Part 7: Online Application Forms Part 8: Waiting for a Response After Applying Part 9: Interview Clothing and Makeup Part 10: Interview Questions Part 11: Interview Follow-Up Part 12: Evaluating the Employer Part 13: Results Finding employment can often feel like a daunting and confusing task, but it doesn't need to be. If you follow a handful of simple tips, then you'll soon have the career of your dreams! You CAN have a successful job hunt! And this book will show you how. What are you waiting for? Start your career search today!",
  "genres": [],
  "author": "Pauline Wadley",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/51037974-63-job-search-myths"
}