{
  "title": "Strach. Antysemityzm w Polsce tuż po wojnie. Historia moralnej zapaści",
  "description": "Poland suffered an exceedingly brutal Nazi occupation during the Second World War. Close to five million Poles were killed. Of these, more than half were Jews killed in the Holocaust. Ninety percent of the world's second largest Jewish community was annihilated. But despite the calamity shared by Poland's Jews and non-Jews, anti-Semitic violence did not stop in Poland with the end of the war. Jewish Holocaust survivors returning to their Polish hometowns after the war experienced widespread hostility, including murder, at the hands of their neighbors. The bloodiest peacetime pogrom in twentieth-century Europe took place in Kielce, Poland, a year after the war ended. Jan Gross's Fear is a detailed reconstruction of this pogrom and the Polish reactions to it that attempts to answer a perplexing question: How was anti-Semitism possible in Poland after the war? Gross argues that postwar Polish anti-Semitism cannot be understood simply as a continuation of prewar attitudes. Rather, it developed in the context of the Holocaust and the Communist takeover: Anti-Semitism eventually became a common currency between the Communist regime and a society filled with people who had participated in the Nazi campaign of murder and plunder, people for whom Jewish survivors were a standing reproach. The Polish poet Czeslaw Milosz said that Poland's Communist rulers fulfilled the dream of Polish nationalists by bringing into existence an ethnically pure state. For more than half a century, what happened to Jewish Holocaust survivors in Poland has been cloaked in guilt and shame. Writing with passion, brilliance, and fierce clarity, Gross at last brings the truth to light.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "Jewish",
    "Poland",
    "World War II",
    "Politics"
  ],
  "author": "Jan Tomasz Gross",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/5103864-strach-antysemityzm-w-polsce-tu-po-wojnie-historia-moralnej-zapa-ci"
}