{
  "title": "Wild Open Hearts",
  "description": "“I’ve heard that boys with motorcycles have less-than-noble intentions.”“Not a boy,” Beck said. “And you heard right.”Luna da Rosa is America’s Vegan Best Friend. The self-made billionaire is a flower-crowned hippie whose Instagram feed is as popular as Wild Heart - her vegan makeup company. When she’s not changing the cosmetics industry, she’s dazzling her online fans with kombucha recipes. Until Wild Heart is caught in a scandal – destroying her reputation as a cheerful do-gooder.Beck Mason is the prodigal son of Miami’s most notorious biker gang. But Beck left his criminal family to start Lucky Dog, rescuing dogs who need the most help. Except the surly ex-outlaw never realized leading a struggling nonprofit with a ragtag crew would be so damn hard. They’re in dire need of cash – and fast.Luna believes working at Lucky Dog will fix her image problem and get Beck the money he needs. It’s a win-win, right? Except Beck doesn’t like the sunny, free-spirited…okay beautiful…billionaire. He sure as hell doesn’t trust Luna not to use him just to make herself look good.Sure – Beck’s grumpy, stubborn pride and meat-eating ways irritate Luna. Even though Beck’s big-heart-and-big-beard-combo is dangerously sexy. And they really shouldn’t have shared The Kiss to End All Kisses on the back of his motorcycle one night…But as the bohemian billionaire and the burly biker give into their electrifying attraction – will their differences keep them apart? Or will they finally learn to trust their wild hearts?\nAuthor’s Note: Big, grumpy, bearded hero. Happy-go-lucky, hippie heroine. Snarky banter. Opposites that don’t so much attract as combust. Motorcycle sex. Steamy Miami nights. Four lady billionaire best friends. All the rescue dogs. Major heart-feels.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Humor",
    "Audiobook",
    "Billionaire Romance"
  ],
  "author": "Kathryn  Nolan",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/51051801-wild-open-hearts"
}