{
  "title": "The Best of Elizabeth Bear",
  "description": "From the start of her career, Elizabeth Bear has been one of the most distinctive voices in modern speculative fiction. Her debut novel, Hammered, won the Locus Award for Best First Novel in 2005, the same year she received the John W. Campbell Award for Best New Writer. In the years since, she has produced an impressive array of standalone novels (Undertow) and multi-volume series (The Eternal Sky Trilogy, The New Amsterdam Series), along with a steady stream of stories and novellas, the best of which are gathered in this generous, absolutely necessary volume.The Best of Elizabeth Bear contains 27 stories and novellas, many never before collected, that encompass an astonishing range of themes, settings, ideas and emotions. The collection opens with “Covenant”, a tale of serial murder unlike any you have ever read, and closes with the extraordinary “Erase, Erase, Erase”. The latter is a surrealist tour de force in which the unnamed narrator, a former cult member, reflects on her life, her nebulous but guilty past, and her constantly diminishing sense of self. In between these bookends are more than two dozen carefully crafted tales that never fail to resonate beyond the final page.“Tideline”, winner of both the Hugo and Theodore Sturgeon Memorial Awards, tells the surprisingly moving story of Chalcedony, a former “war machine” determined to preserve the memories of her dead human companions. “Shoggoths in Bloom”, another Hugo winner, offers a fresh take on H.P. Lovecraft’s Mythos, setting the action in a pre-WWII world marked by racism and virulent anti-Semitism. “Faster Gun” is a tale of the Old West in which Doc Holliday and Johnny Ringo encounter an impossible alien artefact. The long novella “In the House of Aryaman, a Lonely Signal Burns” takes place in Bangalore, India fifty years from now and tells the story of a murder in which the victim’s body is literally turned inside out. In the affecting “Sonny Liston Takes a Fall”, we are brought to an entirely new understanding of one of the iconic moments of boxing history.Contents:- Introduction by C.L. Polk- Covenant (2014)- She Still Loves the Dragon (2018)- Tideline (2007)- The Leavings of the Wolf (2011)- Okay, Glory (2018)- Needles (2011)- This Chance Planet (2014)- The Body of the Nation (2012)- Boojum (2008), with Sarah Monette- The Bone War (2015)- In the House of Aryaman, a Lonely Signal Burns (2012)- Shoggoths In Bloom (2008)- Skin in the Game (2015)- Hobnoblin Blues (2008)- Form and Void (2012)- Your Collar (2008)- Terrior (2014)- Dolly (2011)- Love Among the Talus (2006)- The Deeps of the Sky (2012)- Two Dreams on Trains (2005)- Faster Gun (2012)- The Heart's Filthy Lesson (2015)- Perfect Gun (2017)- Sonny Liston Takes the Fall (2008)- Orm the Beautiful (2007)- Erase, Erase, Erase (2019)Cover illustration by Tom Canty",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Short Stories",
    "Collections",
    "Fiction",
    "Time Travel",
    "Dragons"
  ],
  "author": "Elizabeth Bear",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/51065442-the-best-of-elizabeth-bear"
}