{
  "title": "Three Chords of Chaos",
  "description": "Once, lord of lyrics; once, prince of peace...Now a demon let off his leash...No greater musician than Gorge ever lived in the Realm of the Sidhe.No faerie musician ever delved so deeply into the taboo songs and the forbidden music--the Way of the Bone. Yet, Gorge refused to deny himself their temptations.In reward his true love betrayed him, and the faerie kings and queens who once praised him stripped him of his magic and exiled him to the mortal world. Left to go mad and die, Gorge discovered new life in the arms of a mortal woman, Delilah--and new magic in the music that sings in the souls of mortals. Decades later, Gorge walks a dark path through the musical underground of New York City. He lives a secret life, hiding from the fae, waging a guerilla war of punk rock, and wielding his guitar like a weapon as he gathers magic and recharges his power. Until the day he's strong enough to return home and open the Way of the Bone to all the Faerie Kingdoms. But the mortal world is far more dangerous than it seemsGorge never expected to discover such raw power, almost beyond his control, among the mortals who worship his music. Nor did he count on a mortal wizard to discover his secrets or turn the ancient weapons of the fae against him. Caught in a dangerous game of magic, music, and lies, Gorge must find the truth and uncover the source of his enemy's magic. Survival and love hang in the balance. And Gorge has only his music to protect him, only a song for any hope of salvation....Praise for the work of James \"...chillingly evocative writing...\" --Publisher's Weekly\"James Chambers writes stories that are paced fast enough to friction burn a reader's eyeballs.\" --Horror Reader.com\"Three Chords of Chaos is a darkly rich story, starring an exiled faery and his lady love. Mr. Chambers has created a cast of intriguing and charismatic characters in a music and magic fueled world.\" --Bibliophilic Book Blog\"Three Chords of Chaos is a well-written, compelling story interwoven with an authentic description of the famed punk rock culture that developed in the early 80s. A very entertaining and enlightening novella. Highly recommended.\" -Gene O'Neill, The Cal Wild Chronicles\"In this dark urban fantasy James Chambers plays a thrilling riff on the razor's edge where music and magic meet. Sex, drugs, Faustian bargains, and rebellious Fae make Three Chords of Chaos my kind of faery tale.\" -Douglas Wynne, author of The Devil of Echo Lake and Steel Breeze",
  "genres": [
    "Fantasy",
    "Horror"
  ],
  "author": "James  Chambers",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/51063201-three-chords-of-chaos"
}