{
  "title": "Defending the Constitution: Alan Dershowitz's Senate Argument Against Impeachment",
  "description": "“Maybe the question isn’t what happened to Alan Dershowitz. Maybe it’s what happened to everyone else.”—PoliticoIn Defending the Constitution, Alan Dershowitz—New York Times bestselling author and one of America’s most respected legal scholars—makes an impassioned constitutional argument against the impeachment of President Donald Trump, just as he delivered it to the United States Senate.  Alan Dershowitz has been called “one of the most prominent and consistent defenders of civil liberties in America” by Politico and “the nation’s most peripatetic civil liberties lawyer and one of its most distinguished defenders of individual rights” by Newsweek. Yet he has come under intense criticism fire for applying those same principles, and his famed “shoe‑on‑the‑other‑foot test,” to Donald Trump, especially after arguing on the president’s behalf before the U.S. Senate as it deliberated impeachment.Defending the Constitution seeks to refocus the debate over impeachment to the same standard that Dershowitz has upheld for the law of the United States of America, as established by the Constitution. Citing legal examples from a long lineage of distinguished judges and attorneys, and examining the impeachment language in the Constitution itself, Dershowitz proves—first to the U.S. Senate, and now to readers everywhere—that President Trump should not have been impeached, and certainly should not be removed, for causes that do not meet the standards laid out by the founding fathers. This book is Alan Dershowitz’s argument for a return to nonpartisan judgment based on the Constitution, for a preservation of the separation of powers and the checks and balances that make American government great. It is essential reading for anyone interested in or concerned about the impeachment of President Trump, and for everyone who cares about the future of U.S. government and society.",
  "genres": [],
  "author": "Alan M. Dershowitz",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/51064762-defending-the-constitution"
}