{
  "title": "Death in Mud Lick: A True Story of Corporate Pill Pushers in Small Town America",
  "description": "From a Pulitzer Prize–winning reporter from the smallest newspaper ever to win the prize for investigative reporting, an urgent, riveting, and heartbreaking investigation into the corporate and governmental greed that pumped millions of pain pills into small Appalachian towns, decimating communities.Death in Mud Lick is the story of a pharmacy in Kermit, West Virginia, that distributed 12 million opioid pain pills in three years to a town with a population of 382 people—and of one woman, desperate for justice, after losing her brother to overdose. Debbie Preece’s fight for accountability for her brother’s death took her well beyond the Sav-Rite Pharmacy in coal country, ultimately leading to three of the biggest drug wholesalers in the country. She was joined by a crusading lawyer and by local journalist, Eric Eyre, who uncovered a massive opioid pill-dumping scandal that shook the foundation of America’s largest drug companies—and won him a Pulitzer Prize. Part Erin Brockovich, part Spotlight, Death in Mud Lick details the clandestine meetings with whistleblowers; a court fight to unseal filings that the drug distributors tried to keep hidden, a push to secure the DEA pill-shipment data, and the fallout after Eyre’s local paper, the Gazette-Mail, the smallest newspaper ever to win a Pulitzer Prize for investigative reporting, broke the story. Eyre follows the opioid shipments into individual counties, pharmacies, and homes in West Virginia and explains how they hooked thousands on prescription drugs—resulting in the highest overdose rates in the country. But despite the tragedy, there is also hope as citizens banded together to create positive change—and won. A work of deep reporting and personal conviction, Eric Eyre’s intimate portrayal of a national public health crisis illuminates the shocking pattern of corporate greed and its repercussions for the citizens of West Virginia—and the nation—to this day.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Politics",
    "Crime",
    "Audiobook",
    "Medicine"
  ],
  "author": "Eric Eyre",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/51089334-death-in-mud-lick"
}