{
  "title": "The Camorra Chronicles Box Set",
  "description": "Twisted Loyalties: Fabiano was raised to follow in his father’s footsteps as Consigliere of the Chicago Outfit – until the man abandons him. Left to fend for himself, Fabiano is forced to fight for a place in the mafia world. As a ruthless street fighter, he quickly earns his place as the new Enforcer of the Las Vegas Camorra – a man to fear.  Leona wants to build a decent life for herself, away from her drug-addicted mother. But soon she catches the attention of a dangerous man – Fabiano Scuderi. Staying out of trouble and living a normal life are near impossible with a man like him. Leona knows she needs to avoid Fabiano, but men like him aren’t easy to shake off. They always get what they want.  Fabiano cares about only one thing: the Camorra. But his attraction to Leona soon puts his unwavering loyalty to the test. Is Leona worth risking everything he’s fought for, and ultimately his life?  Twisted Emotions: Nino Falcone is genius and monster. As the right hand man and brother of the Capo of the Camorra, his lack of feelings is a blessing, not a curse – until his brother asks him to marry for the sake of the Camorra. Kiara Vitiello, cousin of the Capo of the New York Famiglia, is chosen to marry Nino Falcone to prevent war with the Camorra, but what she hears about Las Vegas makes her veins pulse with terror. After her father betrayed his Capo and paid with his life, her family thinks marriage is her only chance to bring honor to her name; but only Kiara knows she’s a faulty prize given in return for peace. A man incapable of emotions and a woman scarred by the past – an arranged marriage with the potential to unite, or destroy…  Twisted Pride: Remo Falcone is beyond redemption. As Capo of the Camorra he rules with a brutal hand over his territory – a territory the Chicago Outfit breached. Now Remo is out for retribution. A wedding is sacred, stealing a bride sacrilegious. Serafina is the niece of the Boss of the Outfit, and her hand has been promised in marriage for years, but kidnapped in her wedding dress on her way to church by Remo, Serafina quickly realizes that she can’t hope for saving. Yet, even in the hands of the cruelest man she knows, she is determined to cling to her pride, and Remo soon understands that the woman at his mercy might not be as easy to break as he thought. A ruthless man on a quest to destroy the Outfit by breaking someone they are supposed to protect. A woman intent on bringing a monster to his knees. Two families that will never be the same.",
  "genres": [
    "Mafia Romance",
    "Dark Romance",
    "Romance",
    "Crime",
    "Contemporary Romance",
    "Dark"
  ],
  "author": "Cora Reilly",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/51087156-the-camorra-chronicles-box-set"
}