{
  "title": "El Canotier de Steve: La Verdad y la Vida",
  "description": "Amadeo Gastrell es un brillante alumno de doctorado a punto de graduarse de la más prestigiosa universidad de Física y Astronomía, en Seattle. Idealista, de disposición benévola hacia sus congéneres, a quienes inspira sólidos principios éticos —especialmente a su fatalista mejor amigo, Cyrillus—, Amadeo es un alma emancipada del yugo materialista que subordina el pensamiento de sus compañeros y, especialmente, del cuerpo académico de Sphaera; en persecución de la respuesta a la interrogante más antigua y humana de la historia: ¿Cuál es el significado de la vida? Durante la campaña para elegir al “Astro Visionario”, el estudiante que representará a la próxima generación científica ante la NASA, el resto de las agencias espaciales y el mundo entero —a bordo de un lujoso crucero hacia Alaska para contemplar la belleza auroral—, Amadeo se verá obligado a mirar más allá del oscuro velo de la ingenuidad y a poner su resistencia a prueba frente a las consecuencias de ignorar la envidia de los inescrupulosos; enfrentándose a una disyuntiva moral que le traerá un desequilibrio al ser víctima de una de las personas más importantes en su vida, quien cree merecer lo que solo a Amadeo podría pertenecerle.Con una fluida narrativa en segunda persona y el palpitante estilo “cinematográfico” que caracteriza a su ópera prima, Amnistía (2018), la autora, que retoma en la presente novela conceptos como la migración y la xenofobia, plantea, en esta ocasión, un cuestionamiento sobre el verdadero significado de la carrera espacial, y postula, siguiendo algunos preceptos de Schopenhauer, sus propias ideas sobre la veracidad de las cosas; presentando una conflictiva apegada a la Filosofía y a la teoría psicoanalítica de Freud. Acompañe a Amadeo en un auténtico y emotivo viaje, y emprenda una búsqueda de la “verdad auroral” y de un mejor entendimiento de nuestra naturaleza humana.",
  "genres": [],
  "author": "Laura Maria Isabel Ruiz Ocadiz",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/51080367-el-canotier-de-steve"
}