{
  "title": "Siblings Inducted: A Dynami Society Story",
  "description": "Adopted brother and sister Troy and Emma Kline are fortunate enough to be accepted into an elite organization known as Dynami as they begin their freshman year of college. Their parents are members of this very private organization and reveal that it is much more than either of them had at first expected. Unlike any other fraternity or sorority, this organization will remain involved with their lives forever, and as full-fledged members, they are going to experience things others could only dream of! As Troy tries making sense of it all he is surprised by his sister's forwardness as the two must learn to share more with one another to figure things out. What will Dynami bring to their lives? What will they ask in return? Will their close sibling relationship be able to survive in such a unique environment?  Alan Austin is a national award winning author now writing erotic fiction under a new pen name and outside of his established publication outlet in order to delve into some of his deepest desires and fantasies. Alan and his wife are both authors who enjoy the wilder side of life and leverage some of their own experiences along with a healthy dose of imagination to heat things up in their writing.  Alan is a mid-thirties family man from the Midwest United States with an amazing wife and the best kids in the world. He enjoys working out and reading when he has time between family activities and writing. Alan grew up on the west coast before moving his family inland to make a home for himself. He is an active volunteer in his community and loves serving others.  Alan and his wife enjoy sharing their wildest fantasies and he uses his short stories as vehicle to share them with others. It is his hope that his short stories can bring some excitement to others!  Please follow Alan's erotic fantasy author page on Facebook at https://www.facebook.com/AlanAustinAu...",
  "genres": [],
  "author": "Alan   Austin",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/51077104-siblings-inducted"
}