{
  "title": "World's Dirtiest Jokes",
  "description": "Huge compendium of jokes so filthy, so offensive, so disturbing that this book has been BANNED ON CAMPUS!Millenial WorkersA man was warned repeatedly about hiring lazy, know-it-all, crybaby millenials to work in his factory. But he remembered when he was young and just starting out, so he wanted to give them a chance.One morning, one of his tattooed millenials knocked on his office door.“Yes?” he said.“Boss, I have a problem,” she said.“What is it?” the boss asked.“Well, I don’t think it’s appropriate that we test our products on animals. It’s cruel.”“I realize your generation is very sensitive to these things,” the boss said thoughtfully. “But we have to ensure our products are safe before we sell them to consumers. Shampoo companies test on animals, cosmetic companies test on animals. It’s a very common practice.”“But Boss, we make dildoes!” she exclaimed.Medical ProblemA man says to his doctor, “You gotta help me, doc!”The doctor says, \"What's your problem?\" The guy replies, “Every morning I wake up with my 'morning flagpole', so I give the missus a quick one, then go to work. On the way to work, I car pool with the next door neighbor's wife, who gives me a blow job during the ride to work.”The doctor raises his eyebrows.The man continues, “Once I get to work, I do some work, but after about two hours, I go into the photocopy room and haveit off with the one of the young male interns in the office. At lunch I take my secretary out to a hotel and give her a good bonking. Later in the afternoon, I give it to the boss's wife, long and hard.”The doctor’s mouth falls open.The man continues, “Then I go home and slip the maid a few inches, and then at night I give the missus another screw.”\"Oh, I see,\" said the doctor, trying to maintain his composure. \"But what exactly is your problem?\"The man says, \"Well, it hurts when I masturbate.\"",
  "genres": [],
  "author": "mad comedy",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/51112281-world-s-dirtiest-jokes"
}