{
  "title": "First Son : George W. Bush and the Bush Family Dynasty",
  "description": "In one of the most unprecedented developments in the history of national politics, George W. Bush abruptly emerged to lead all presidential aspirants in the national polls for the 2000 election. Yet voters know very little about the man, beyond his famous name and his place in one of the nation's most powerful political dynasties.First Son is a true, riveting family saga about extraordinary power and politics in America and in the unharnessed state--a state of mind--called Texas. The story begins with the turn-of-the-century emergence of the influential Bush-Walker clan and of Prescott Bush, the Connecticut patrician who ingrained in his family an ethos that continues to exert influence on his son, former President George Bush, and his grandsons, George W. and Jeb. How these scions of the Bush dynasty struggle to live up to their enduring legacy is the central theme of this colorful and perceptive portrait the first authentative book on the governor of Texas.In the past year, award-winning Texas writer Bill Minutaglio has met with George W. Bush and interviewed dozens of people close to him, from his brother Governor Jeb Bush of Florida to uncles and cousins, from current and former political advisers to high-ranking insiders from his father's years in the White House. Fraternity buddies, political operatives, George W.'s employers, and even ardent critics of the Bush family bring this story to life--from the society circles in his native Connecticut to the family compound in Maine to the backwaters of his adopted Texas. The result is a book that is nuanced, insightful, and surprising in the contradictions and complexities it reveals about this man.First Son vividly reconstructs George W. Bush's boarding-school days at one of the country's most exclusive institutions; his tenure in one of Yale's secret societies and as president of his unfettered fraternity; his attempts to follow his family's million-dollar path into the wide-open Texas oil patch; his role in major league baseball as the public face and head cheerleader for the Texas Rangers; and, finally, his rise to governor of Texas and national political force, executed with more hard-edged calculation than many people realize.Written with precision, verve, and fair-minded balanace, First Son will be the political story of 2000--the eye-opening tale of a natural-born politician.From the Hardcover edition.",
  "genres": [
    "Biography",
    "History",
    "Presidents",
    "Politics",
    "American History",
    "Nonfiction"
  ],
  "author": "Bill Minutaglio",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/510941.First_Son_"
}