{
  "title": "How to Vex a Vampire",
  "description": "Finn Getting into the vampire-only detective unit was the easy part; what’s going to be more difficult is dealing with my new partner, an ancient vampire who keeps threatening to eat me. The unit has never had a human in it, and Marcus—or as I like to call him, Fangy McFangface—would really prefer to keep it that way. He’s grumpy, short-tempered, and broody, but I have a way with words and I know he’s starting to like me, even if he swears he’s not. But what he doesn’t know is that I didn’t join the unit because I was tired of being a homicide detective, I joined because there is someone after me. They’ve already taken enough from me and I’m afraid they’re going to take all of me if I don’t find someone to help. That’s all Marcus was supposed to be, but now, he’s so much more and I can’t imagine my life without him. Marcus The moment the pesky human walked through that door, I knew I had to get rid of him. He’s charming and almost everyone else instantly loves him, but he doesn’t understand how risky it is being part of this unit as a human. But as I get to know the stubborn man, I learn that perhaps he’s not as naive as I once thought. And maybe he’s what I needed to realize there is more to life than just work and my dog. A group arises who is threatening to disrupt the alliance between the humans and the vampires, but Finn is the one who shows me how strong that alliance can be and reminds me why it’s worth protecting. When threats hit closer to home, I realize I would do anything for Finn because he’s brought so much joy to my life—and because he’s mine. This 105k word book A creative use for undergarments, unintentional splits, a wolfhound who just wants to be a part of things, a vertically challenged human who still manages to wrap every vampire he meets around his little finger, the best date ever, possessiveness, really awkward dancing, some workplace revenge, and just a bite or two. Or three. While the plot of the first book is tied up and completed, there's a minor cliffhanger that will be tied up in the second book.",
  "genres": [
    "M M Romance",
    "Vampires",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Mystery",
    "Urban Fantasy"
  ],
  "author": "Alice  Winters",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/51091136-how-to-vex-a-vampire"
}