{
  "title": "Life in a Faceless World",
  "description": "AWARD-WINNING Finalist in the Fiction: MULTICULTURAL category of the 2019 Best Book Awards by American Book Fest.   When Nila comes to America, she ventures to this strange land on a dependent visa, a wife in an arranged marriage she had no control over. Now faceless in a lonely world, she drifts amongst the clouds and people, learning a culture she never expected while desperately trying to hold on to her own. There is sorrow and joy, adventure, and loss, but above all, there is love.  Written from the heart and mind of the displaced, Nila’s story explores what it means to be a voyager through the unknown, an immigrant in a land of immigrants, each vying for a place and a home. It speaks to a connection while baring the soul of the global society we have created.   Culture, assimilation, love, and pain all come together in a lyrical wonder that will make you cry, warm your heart, and stir your soul… one that will stay with you long after the final page is closed.    \nWho is Nila?\n If you are wondering who Nila is or who she is to me, I have no simple answer. I met her through the lines scribbled on a journal left on a park bench one summer afternoon. Did she leave it on purpose for me to find? I’ll never know… maybe it was fate, that it is destined for something beyond what she could handle.  In my journey through those immersing pages, I wandered through her mind which never seemed to rest. I traveled wherever it took me. I learned a lot about her, in fact, perhaps more than anyone who knew her and maybe even more than she knew herself. Some of those pages carried the scent of jasmine and roses. When I closed my eyes, I could smell the same flower she breathed and felt them blooming all around me. Some of the words she wrote were blurred. Circles of tears had made tiny dents in the paper. I tried to be like her, to see the faces she saw, to listen to the voices she heard. Some pages never wanted to be turned and I would stare at them for hours before I could move on. Along with her childhood memories, Nila had kept a dry banyan tree leaf, and a tiny piece of a peacock feather. She would dream and wish that the feather would split into two and then keep multiplying. The beauty becoming a part of her.  Nila is not just a sari-cladded faceless girl from South Asia. She is beyond any definition of anything that divides us. She is one amongst us and could even be a part of us all. Once we know her, she cannot be separated from us. Let’s give her a face, a face we love and use it to replace the fences we have created between us.  Life in a Faceless World  is a New Age Literary Fiction that is  Enlightening, Uplifting, Motivational and Inspirational Readers can also discover the secret to Happiness, and realize  Personal Transformation through Self-Improvement and Positive Thinking.",
  "genres": [],
  "author": "Cyril Mukalel",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/51094987-life-in-a-faceless-world"
}