{
  "title": "Leave Me Breathless: The Moonflower Collection",
  "description": "The Moonflower symbolizes dreaming of love. The collection will feature brand new stand-alone books from Heather Guimond, Lexi Hart, Kiersten Modglin, A.C. Williams, Samantha Morgan, Barbra Campbell, Lyssa Cole, and M. Piper.  COLLECTION DETAILS:  Break Wave by A.C. Williams, Amazon Bestselling Author (Second Chance Romance) Jordan Stone is a small-town girl with big time dreams. Stepping out of the rubble of a tumultuous past, Jordan spends her days immersed in her music, surrounded by friends and her boyfriend Tyler, and when she's not working odd-jobs on the boardwalk, she's working on a dream: Escaping Break Wave, New Jersey. Achieving that dream will come at a cost, though. The question is, will Jordan Stone risk everything that is dear to her for a one-shot at a better life?  The Plan by Kiersten Modglin (Second Chance Single Parent Romance) Twelve years ago, Darby made a choice to walk away from the future she’d always envisioned with the boy who broke her heart. Now, two failed marriages, four kids, and years of baggage between them, Luke and Darcy are in their hometown again. Can the couple get back on course to live out the plan they once had? Or will the past be enough to make them run once again?  Scars by M. Piper (Second Chance Police Romance) Returning to her small hometown to deal with the loss of her father, Kate doesn't expect to connect with those from her past. She definitely doesn't expect to fall for her high school sweetheart, the boy that pushed her away so many years before. Sparks fly as old flames are reignited, but is Daxon's love enough to keep Kate from returning to the life she left behind?  Training Maisy by Samantha Morgan (Second Chance Romance) After joining a gym, a steamy night with Maisy’s personal trainer leads to more heartbreak when he tells her they can never be an item. He uses the gyms policy as an excuse, but Maisy knows the truth: she’s just not desirable.  Kinky Ink by Heather Guimond (Opposites Attract Romance) Tired of his shallow and pretentious life as the heir to an oil resources empire, Nate Trumbull left Manhattan behind when he bought a chicken ranch just outside Corpus Christi, TX. He knew his life would change for the better, but never bargained on falling for sexy tattoo artist, Roselle Wolfe, when he faints dead away in her chair. They're nothing alike, they come from two different worlds, but there's no denying there's magic between them. When his father comes to call to bring him back into the family fold, it spells trouble for the two. Will Nate stay and fight for his new life and love, or will he return to honor his family duty?  Becoming His World by Barbra Campbell (Second Chance Romance) Samantha struggles to cope with a miscarriage when the baby's daddy finally decides to show back up. Connor apologizes, professes his love, takes care of her, and does all the right things...until he leaves again. He won't come clean about his job, and she can't handle his obsession over her safety. Should she trust his mysterious ways, or follow her own path and live out her dream to sing on Broadway?  One for the Road by Lexi Hart (Bad Boy Romance) After a five year absence, resident bad boy Mason is riding back into his hometown for the weekend. Celeste isn’t the chubby geek who crushed hard on the town’s rebel all through high school anymore. She’s spent the last five years waiting for a chance to purposely bump into the rogue with a reputation for breaking good girls’ hearts. And she has no intention of letting Mason slip away without getting what she craved all through high school.",
  "genres": [
    "Anthologies"
  ],
  "author": "Heather Guimond",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/51107260-leave-me-breathless"
}