{
  "title": "The Berlin Wall: A World Divided, 1961-1989",
  "description": "On the morning of August 13, 1961, the residents of East Berlin found themselves cut off from family, friends and jobs in the West by a tangle of barbed wire that ruthlessly cut a city of four million in two. Within days the barbed-wire entanglement would undergo an extraordinary metamorphosis: it became an imposing 103-mile-long wall guarded by three hundred watchtowers. A physical manifestation of the struggle between Soviet Communism and American capitalism—totalitarianism and freedom—that would stand for nearly thirty years, the Berlin Wall was the high-risk fault line between East and West on which rested the fate of all humanity. Many brave people risked their lives to overcome this lethal barrier, and some paid the ultimate price.In this captivating work, sure to be the definitive history on the subject, Frederick Taylor weaves together official history, archival materials, and personal accounts to tell the complete story of the Wall's rise and fall, from the postwar political tensions that created a divided Berlin to the internal and external pressures that led to the Wall's demise. In addition, he explores the geopolitical ramifications as well as the impact the wall had on ordinary lives that is still felt today. For the first time the entire world faced the threat of imminent nuclear apocalypse, a fear that would be eased only when the very people the Wall had been built to imprison breached it on the historic night of November 9, 1989.Gripping and authoritative, The Berlin Wall is the first comprehensive account of a divided city and its people in a time when the world seemed to stand permanently on the edge of destruction.",
  "genres": [
    "History",
    "Nonfiction",
    "Germany",
    "Politics",
    "European History",
    "German Literature",
    "Historical"
  ],
  "author": "Frederick Taylor",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/510933.The_Berlin_Wall"
}