{
  "title": "Circling Yellowstone: A Tale of Desperate Misadventure",
  "description": "Have you ever wondered what it would be like to work in Yellowstone, this planet's first national park? Well, wonder no longer. Come along with Scott on a summer of adventure punctuated by skydiving, cliff jumping, whitewater rafting, road trips, rappelling, mountain biking, wild west cookouts, rodeos, bears, bison, buffoons, doomed romance, practical jokes, cabin living, far-flung friends, and way too much time spent in a sweltering, compact car. But for now, take a ride down Avalanche Peak atop nothing more than a brand new, black, Hefty garbage bag. Good luck! “Pushed by a stinging wind, we hiked down slope to the first snowfield. It was beat up; looking as if several hundred cows had recently stampeded across it, gotten bored, and then stampeded back. Broken rock beneath the snow’s thin surface could have been responsible for its rough appearance, but I doubt it. That would make what we were doing pretty stupid. When no one would go first, I volunteered. Frankly the first slope didn't look steep enough to get me moving, let alone give me a thrill. Spreading the Hefty bag on the ground, I lay down on my back, pointed my feet downhill, and pulled my knees up to my chest. After I tugged the front edge of the Hefty up against my thighs, I was ready to go. So much for style. Immediately I began moving. The bag was a lot slicker than it looked. Picking up speed, I quickly accelerated beyond any velocity I had ever gone on a Michigan toboggan run. The rough ground began massaging, then battering, and finally brutalizing my body. One long, staccato “Ahhh…!” fled my pain-filled lungs. It was staccato because I felt as if an entire little league team was pummeling me with aluminum bats. Every rock I bounced off added another bruise rib and cut short the flow of air to my mindless yell. Just as I thought it could get no worse, I hit a snowdrift and became airborne. At first it was a relief, but then I came back into contact with the earth. BLAM! Holy crap that hurt! Coming finally to a flat area, I skidded to a halt as my brain struggled to remember what its function was. Wow! That was fun! it groggily lied.”",
  "genres": [
    "Nonfiction",
    "Memoir"
  ],
  "author": "Scott Downing",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/12542990-circling-yellowstone"
}