{
  "title": "Love on Track",
  "description": "Childhood history between a race car driver and a self-made career woman collide in Indianapolis at the Indy 500. He can’t be distracted by romance. And she can’t trust love will last.Stone Crandall wants more than anything to win the Indy 500, but as the race approaches, other things begin to distract him. Not only has his family descended on Indianapolis, but a schoolboy crush in the form of his sister’s best friend appears and changes his focus. Tara Hartman grew up with the Crandall family as her safe haven from a broken family. As an adult she’s grown a successful business planning events for major corporations. Stone’s race car team hires her for the two weeks of the big race, which is a surprise to Stone.At the start of the activities, Tara and Stone make a pact to remain single when they discover neither of them has ever fallen in love. Then when Tara’s father and stepmother invade the festivities, along with her mother, Stone provides her a strong shoulder for comfort. Meddling families and workplace disruptions create tension for the childhood friends.When comfort turns to passion, Stone’s concentration on winning is all but destroyed until he tells Tara she’s a distraction. He also lets the attention of the media expand his ego. Tara is convinced all men are attracted by shiny objects just like her father when he left her mother for another woman. Tara ends things with Stone, just as his career soars.It’s up to Tara and Stone to figure out whether they want to take the leap and find out for themselves.Love on Track is the third novel in the Rivals in Love sweet Chicago family saga romance series. Rivals in Love showcases the Crandall family siblings who are all in successful careers. But they forgot one thing while becoming rising stars. They forgot all about love. Their father a U.S. Senator aspires for high office, but their mother, the heir to a fortune, only wants her children married and with children.Buy your copy of Love on Track to learn how two people conquer the fear of falling in love while pursuing their dreams.",
  "genres": [],
  "author": "P.C. Zick",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/51115153-love-on-track"
}