{
  "title": "The Nicole Graves Mysteries Boxed Set:",
  "description": "The Swap\nWhen Nicole Graves arranges a summer-long swap of her Los Angeles condo for a London couple’s house, she thinks it’s the perfect arrangement. She’s always dreamed of seeing the real London; she’s also hopeful the time away with her husband Brad will be good for their troubled marriage. But things don’t turn out the way Nicole expects: The Londoners fail to arrive in L.A. and appear to be missing. Then people begin following Nicole and making threats, demanding information she doesn’t have. Soon, Nicole realizes she’s in serious trouble––but she can’t get Brad or the police to believe her. When the confrontations turn deadly, Nicole must either solve the case or become the next victim.Winner of the Eric Hoffer Award — Best Micro Press Book of the Year\nThe Bequest\nNicole Graves, still reeling from her London kidnapping in The Swap, is struggling to balance work at L.A.’s most prestigious law firm and a long-distance romance with her English lover. Things go sideways when she tracks down a missing colleague. The murder of the firm’s in-house investigator, his mysterious wealth, and his inexplicable bequest make Nicole a target for the police, the paparazzi, and the killer. When Nicole’s life takes an unexpected turn, she uncovers evil and corruption among the city’s most powerful people. The fast-paced mystery unravels against the backdrop of L.A. with its peculiar mix of balmy weather, the celebrity-crazed media, and a corrupt power structure hidden by the veneer of glamour and wealth.\nLiar Liar\nAs a newly minted private investigator, Nicole Graves expects to take on legal cases for corporate clients. But when her client’s son, Brad Rexton, is killed trying to protect his wife, Ashley, from a home invasion-turned-kidnapping, the firm is hired to investigate. Nicole soon discovers that Ashley is not the person she claims to be, but her real identity remains a mystery. Meanwhile, a long-delayed and undesired inheritance is finally deposited into Nicole’s bank account. Within a few days, someone dear to Nicole is kidnapped in the same manner as Ashley. The perpetrators demand Nicole’s full inheritance as ransom. She’s willing to hand the money over but finds it’s not so easy. The kidnappers have an uncanny ability to track her every move, and they suspect a trap. When their most terrifying threat is delivered to her door, Nicole is faced with a terrible choice: Should she count on the police or risk going it alone?",
  "genres": [
    "Fiction"
  ],
  "author": "Nancy Boyarsky",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/51119762-the-nicole-graves-mysteries-boxed-set"
}