{
  "title": "Teaching Rebellion: Stories from the Grassroots Mobilization in Oaxaca",
  "description": "In 2006, Oaxaca, Mexico, came alive with a broad and diverse movement that captivated the nation and earned the admiration of communities organizing for social justice around the world. The show of international solidarity for the people of Oaxaca was the most extensive since the Zapatista uprising in 1994. Fueled by long ignored social contradictions, what began as a teachers” strike demanding more resources for education quickly turned into a massive movement that demanded direct, participatory democracy. Hundreds of thousands of Oaxacans raised their voices against the abuses of the state government. They participated in marches of up to 800,000 people, occupied government buildings, took over radio stations, called for statewide labor and hunger strikes, held sit-ins, reclaimed spaces for public art and created altars for assassinated activists in public spaces. In the now legendary March of Pots and Pans, two thousand women peacefully took over and operated the state television channel for three weeks. Barricades that were built all over the city to prevent the passage of paramilitaries and defend occupied public spaces, quickly became a place where neighbors got to know each other, shared ideas and developed new strategies for organizing. Despite the fierce repression that the movement faced—with hundreds arbitrarily detained, tortured, forced into hiding, or murdered by the state and federal forces and paramilitary death squads—people were determined to make their voices heard. “Once you learn to speak, you don”t want to be quiet anymore,” an indigenous community radio activist said. Accompanied by photography and political art, Teaching Rebellion is a compilation of testimonies from longtime organizers, teachers, students, housewives, religious leaders, union members, schoolchildren, indigenous community activists, artists, journalists, and many others who participated in what became the Popular Assembly of the Peoples of Oaxaca. This is a chance to listen directly to those invested in and affected by what quickly became one of the most important social uprisings of the 21st century.",
  "genres": [
    "Education",
    "Nonfiction",
    "Politics",
    "Activism"
  ],
  "author": "Diana Denham",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/5111662-teaching-rebellion"
}