{
  "title": "Loveboat Reunion",
  "description": "This companion novel to Abigail Hing Wen’s New York Times bestselling debut, Loveboat, Taipei, follows two fan favorite characters—Sophie and Xavier—as they reconnect and write their own futures on a wild, unexpected Loveboat reunion.Sophie Ha and Xavier Yeh have what some would call a tumultuous past.It’s a classic tale of girl-meets-boy, boy-meets-other-girl, heart-gets-broken, revenge-is-plotted, everything-blows-up. Spectacularly.At least they’re friends now. They’ve left the drama behind them back in Taipei—at their summer program, Loveboat—forever.Now fall is here, and it’s time to focus on what really matters. Sophie is determined to be the best student Dartmouth’s ever had. Forget finding the right guy to make her dreams come true—Sophie is going to make her future happen for herself. Xavier, on the other hand, just wants to stay under his overbearing father’s radar, collect his trust fund when he turns eighteen, and concentrate on what makes him happy, for the first time ever.But the world doesn’t seem to want Sophie and Xavier to succeed. Sophie’s computer science professor thinks her first major project is too feminine. Xavier’s father gives him an ultimatum: finish high school or be cut off from his inheritance.Then Sophie and Xavier find themselves on a wild, nonstop Loveboat reunion, hatching a joint plan to take control of their futures. Can they succeed together . . . or are they destined to combust?Expansive and romantic, glamorous and tender, Loveboat Reunion takes readers back to Taipei through the eyes of Sophie and Xavier, on an unforgettable journey of glittering revelry and self-discovery that’s perfect for fans of Jenny Han and Mary H. K. Choi.",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Audiobook",
    "Asian Literature",
    "Young Adult Romance"
  ],
  "author": "Abigail Hing Wen",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/51127076-loveboat-reunion"
}