{
  "title": "Whistleblower: My Journey to Silicon Valley and Fight for Justice at Uber",
  "description": "The unbelievable true story of the young woman who faced down one of the most valuable startups in Silicon Valley history–and what came after.In 2017, twenty-six-year-old Susan Fowler published a blog post detailing the sexual harassment and retaliation she'd experienced as an entry-level engineer at Uber. The post went viral, leading not only to the ouster of Uber's CEO and twenty other employees, but \"starting a bonfire on creepy sexual behavior in Silicon Valley that . . . spread to Hollywood and engulfed Harvey Weinstein\" (Maureen Dowd, The New York Times).When Susan decided to share her story, she was fully aware of the consequences most women faced for speaking out about harassment prior to the #MeToo era. But, as her inspiring memoir, Whistleblower, reveals, this courageous act was entirely consistent with Susan's young life so far: a life characterized by extraordinary determination, a refusal to accept things as they are, and the desire to do what is good and right. Growing up in poverty in rural Arizona, she was denied a formal education—yet went on to obtain an Ivy League degree. When she was told, after discovering the pervasive culture of sexism, harassment, racism, and abuse at Uber, that she was the problem, she banded together with other women to try to make change. When that didn't work, she went public. She could never have anticipated the lengths to which Uber would go in its efforts to intimidate and discredit her, the impact her words would have on Silicon Valley—and the world—or how they would set her on a course toward finally achieving her dreams.The moving story of a woman's lifelong fight to do what she loves—despite repeatedly being told no or treated as less-than—Whistleblower is both a riveting read and a source of inspiration for anyone seeking to stand up against inequality in their own workplace.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Technology",
    "Business",
    "Feminism",
    "Biography",
    "Audiobook"
  ],
  "author": "Susan Fowler",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/51137754-whistleblower"
}