{
  "title": "Shaking the Gates of Hell: A Search for Family and Truth in the Wake of the Civil Rights Revolution",
  "description": "On growing up in the American South of the 1960s—an all-American white boy—son of a long line of Methodist preachers, in the midst of the civil rights revolution, and discovering the culpability of silence within the church. By the Pulitzer Prize-winning journalist and columnist for The Birmingham News .\"My dad was a Methodist preacher and his dad was a Methodist preacher,\" writes John Archibald. \"It goes all the way back on both sides of my family. When I am at my best, I think it comes from that sermon place.\"Everything Archibald knows and believes about life is \"refracted through the stained glass of the Southern church. It had everything to do with people. And fairness. And compassion.\"In Shaking the Gates of Hell, Archibald Can a good person remain silent in the face of discrimination and horror, and still be a good person?Archibald had seen his father, the Rev. Robert L. Archibald, Jr., the son and grandson of Methodist preachers, as a moral authority, a moderate and a moderating force during the racial turbulence of the '60s, a loving and dependable parent, a forgiving and attentive minister, a man many Alabamians came to see as a saint. But was that enough? Even though Archibald grew up in Alabama in the heart of the civil rights movement, he could recall few words about racial rights or wrongs from his father's pulpit at a time the South seethed, and this began to haunt him.In this moving and powerful book, Archibald writes of his complex search, and of the conspiracy of silence his father faced in the South, in the Methodist Church and in the greater Christian church. Those who spoke too loudly were punished, or banished, or worse. Archibald's father was warned to guard his words on issues of race to protect his family, and he did. He spoke to his flock in the safety of parable, and trusted in the goodness of others, even when they earned none of it, rising through the ranks of the Methodist Church, and teaching his family lessons in kindness and humanity, and devotion to nature and the Earth.Archibald writes of this difficult, at times uncomfortable, reckoning with his past in this unadorned, affecting book of growth and evolution.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Race",
    "Religion",
    "Social Justice",
    "Biography"
  ],
  "author": "John Archibald",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/51151767-shaking-the-gates-of-hell"
}