{
  "title": "The Antiquary: The Works of Sir Walter Scott",
  "description": "The Antiquary is a novel written by Sir Walter Scott, a renowned Scottish author, and is part of his larger body of work, The Works of Sir Walter Scott. The novel is set in the late 18th century and follows the story of an elderly gentleman named Jonathan Oldbuck, who is an amateur antiquary and scholar. Oldbuck spends his days studying and collecting relics from the past, but his peaceful existence is disrupted when a young man named Lovel arrives in town. Lovel is a mysterious figure who seems to have a hidden past, and Oldbuck takes it upon himself to uncover the truth about him. Along the way, Oldbuck becomes embroiled in various intrigues and adventures, including a kidnapping and a love triangle. The Antiquary is a classic work of historical fiction that explores themes of identity, love, and the power of the past. Scott's vivid descriptions of the Scottish countryside and his deep knowledge of history make this novel a must-read for anyone interested in Scottish literature or historical fiction.1906. Sir Walter Scott was a master of diverse talents. He was a man of letters, a dedicated historian and historiographer, a well-read translator of foreign texts, and a talented poet. Deriving most of his material from his native Scotland, its history and its legends, Scott invented and mastered what we know today as the historical novel. First published in 1816 in the aftermath of Waterloo, The Antiquary deals with the problem of how to understand the past in order to enable the future. See the many other works by this author available from Kessinger Publishing.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Classics",
    "Fiction",
    "Historical Fiction",
    "Scotland",
    "Literature",
    "19th Century",
    "Romance"
  ],
  "author": "Walter Scott",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/511596.The_Antiquary"
}