{
  "title": "Ex Libris: 100+ Books to Read and Reread",
  "description": "Pulitzer Prize–winning literary critic Michiko Kakutani shares 100 personal, thought-provoking essays about books that have mattered to her and that help illuminate the world we live in today—with beautiful illustrations throughout.In the introduction to her new collection of essays, Ex Libris: 100+ Books to Read and Reread, Michiko Kakutani writes: \"In a world riven by political and social divisions, literature can connect people across time zones and zip codes, across cultures and religions, national boundaries and historical eras. It can give us an understanding of lives very different from our own, and a sense of the shared joys and losses of human experience.\" Readers will discover novels and memoirs by some of the most gifted writers working today; favorite classics worth reading or rereading; and nonfiction works, both old and new, that illuminate our social and political landscape and some of today’s most pressing issues, from climate change to medicine to the consequences of digital innovation. There are essential works in American history (The Federalist Papers, The Writings and Speeches of Martin Luther King, Jr.); books that address timely cultural dynamics (Elizabeth Kolbert's The Sixth Extinction, Margaret Atwood's The Handmaid's Tale); classics of children's literature (the Harry Potter novels, Where the Wild Things Are); and novels by acclaimed contemporary writers like Don DeLillo, William Gibson, Chimamanda Ngozi Adichie, and Ian McEwan.With richly detailed illustrations by lettering artist Dana Tanamachi that evoke vintage bookplates, Ex Libris is an impassioned reminder of why reading matters more than ever.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Essays",
    "Reference",
    "Literary Criticism",
    "Art",
    "Audiobook"
  ],
  "author": "Michiko Kakutani",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/51151753-ex-libris"
}