{
  "title": "Under a Dark Cloud",
  "description": "Under a Dark Cloud is a gripping emotional story filled with humour, heart and hope. The story focuses on two women battling to emerge from under the dark cloud that has shrouded their lives.....Kelly Henderson returns to Bunreen, a small town nestled in the South East of Ireland, after being banished from her home, by her mother Lorraine when she was only fifteen years of age. Wanting to re-establish a relationship with her sister Niamh after a 14-year absence whilst hoping Lorraine will admit she was wrong to send her away and acknowledge the pain Kelly suffered. However, Lorraine is suspicious of Kelly’s intentions and questions why return now, only weeks after the untimely death of her husband.Kelly’s’ heart is heavy and grief raw, but she is not deterred by Lorraine’s indifference towards her, remaining in Ireland and taking up a job in the local hospital. Her decision to stay having been swayed by her motherly neighbour Roz O'Reilly always treating her as one of her own being delighted by Kelly's return. But will Kelly get the closure she is looking for, as there appears to be a lot of family secrets that even she isn’t aware of.Will Kelly get the closure she is looking for? What is she running from and why is she so desperate to settle ghosts from the past especially the ones that drove her away in the first place? Nessa Quinlan has a simple but happy life with her devoted husband Liam; however, her life is turned upside-down when her estranged brother contacts her to say he is dying of cancer. Nessa had broken all ties with Donald after he had killed Roz O'Reilly's youngest daughter in a road accident showing no remorse.Kind-hearted, Nessa becomes his carer which concerns her family and best friend Clodagh, but Nessa has more to contend with than the disagreeable Donald, with ghosts from her past threatening to cloud her happiness which in turn puts a strain on her marriage. This is not helped by Donald refusing medical treatment until one day Kelly arrives on their doorstep as his new Health Nurse.Can Nessa save her marriage, and should she trust Kelly?Under a Dark Cloud is Mary Crowley’s second Novel following her Debut A Sweet Smell of Strawberries, a heart wrenching tale of a mother’s loss when her son, a talented athlete is killed.",
  "genres": [],
  "author": "Mary  Crowley",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/51157991-under-a-dark-cloud"
}