{
  "title": "Curses Are for Cads",
  "description": "The third installment in Tamara Berry's charmingly quirky paranormal cozy mystery series finds Eleanor Wilde, the American scam psychic who's set up shop as town witch in a quaint English village, summoned to a remote Scottish castle. There, an unusual assignment to locate a haunted trove of treasure threatens Eleanor's budding romance, her livelihood...and her life!Just as fake medium Eleanor Wilde begins falling for Nicholas Hartford III and his endearing family, she's summoned to a remote Scottish castle where an unusual assignment to locate a haunted trove of treasure threatens Eleanor's budding romance, her livelihood...and her life!As Sussex's resident witch and pseudo psychic, Eleanor has grown accustomed to somewhat strange requests for supernatural aid. So when Nicholas's university pal, Sid Stewart, writes from the family's remote castle in Scotland, begging for Ellie's services as a medium, Ellie is only delighted to help.Apparently, the recently deceased patriarch of Sid's family, Glenn Stewart, died before divulging the whereabouts of an important cache of family heirlooms. The Stewart clan hopes a clairvoyant can contact him from beyond the grave. Of course, Ellie can't actually commune with the dead. But faking it is the name of her game. She's not worried, until . . .Aboard the train for Oban, Ellie discovers that fellow medium Birdie White is also heading to the Outer Hebrides to assist the Stewarts. Birdie is a master in the art, serving as a spiritual consultant to royalty and even assisting Scotland Yard on occasion. Ellie might not trust the woman's motivations, but Birdie's skills are unquestionable.But while Birdie is busy speaking with the dead, Ellie plans to talk to living suspects--namely, the other residents and employees of the spooky Stewart estate, who know a lot more than they're letting on. Amid swirling rumors of cursed treasure, whispered tales of ghostly pirates, and a recent spate of preternatural murders, in order to catch the killer Ellie must confront the most terrifying possibility of all--her gift may be real . . .",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Paranormal",
    "Cozy",
    "Romance",
    "Fantasy",
    "Fiction"
  ],
  "author": "Tamara Berry",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/51163672-curses-are-for-cads"
}