{
  "title": "Raise High the Roof Beam, Carpenters & Seymour: An Introduction",
  "description": "This book contains two separate stories: \"Raise High the Roof Beam, Carpenters\" is the first, and \"Seymour: An Introduction\" is the second.\"Raise High the Roof Beam, Carpenters\" is a story about the Glass family, narrated by Buddy, the second oldest brother. Buddy is attending his brother Seymour's wedding to a gal named Muriel, but he's on Army leave during active duty in World War II. At the wedding, everyone is stunned when Seymour does not show up.The action of the story picks up when several characters end up carpooling together following the failed wedding. The others (the Matron of Honor and her husband, and a couple of stragglers) are talking about Seymour and the disappointment of his not showing up, and Buddy never tells them that he is secretly Seymour's brother, so they talk more openly with him than they otherwise would.They criticize Seymour and speculate about his character flaws and deficiencies, but Buddy finds their assessments quite judgmental and biased. He then decides to tell the car who he really is, shaming them for their loose criticisms.He finds Seymour's journal, and he discovers a strange message from their sister Boo Boo for Seymour on their bathroom mirror: \"Raise high the roof beam, carpenters. Like Ares comes the bridegroom/ taller far than a tall man.\" This is a fragment from the Greek poet Sappho.\"Seymour: An Introduction\" is a kind of elegy for Seymour from Buddy, told in the form of an introduction to the reader. The reader makes Seymour's acquaintance while knowing that Seymour technically isn't alive when the story is published, having killed himself in 1948.This portion of the story is told in stream of consciousness, and it discusses Eastern religious mysticism.",
  "genres": [
    "Fiction",
    "Classics",
    "Short Stories",
    "Literature",
    "American",
    "Literary Fiction",
    "Novels"
  ],
  "author": "J.D. Salinger",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/5114.Raise_High_the_Roof_Beam_Carpenters_Seymour"
}