{
  "title": "The Immortality Key: Uncovering the Secret History of the Religion with No Name",
  "description": "A groundbreaking, controversial dive into the role psychedelics have played in the human experience of the Divine throughout Western history, and the answer to a 2,000 year old mystery that could shake the Church to its foundations.The Immortality Key connects the lost, psychedelic sacrament of Greek religion to early Christianity—exposing the true origins of Western Civilization. In the tradition of unsolved historical mysteries like David Grann's Killers of the Flower Moon and Douglas Preston's The Lost City of the Monkey God, Brian Muraresku’s 10-year investigation takes the reader through Greece, Germany, Spain, France and Italy, offering unprecedented access to the hidden archives of the Louvre and the Vatican along the way.In The Immortality Key, Muraresku explores a little-known connection between the best-kept secret in Ancient Greece and Christianity. This is the real story of the most famous human being who ever lived (Jesus) and the biggest religion the world has ever known. Today, 2.4 billion people are Christian. That's one third of the planet. But do any of them really know how it all started?Before Jerusalem, before Rome, before Mecca—there was Eleusis: the spiritual capital of the ancient world. It promised immortality to Plato and the rest of Athens's greatest minds with a very simple formula: drink this potion, see God. Shrouded in secrecy for millennia, the Ancient Greek sacrament was buried when the newly Christianized Roman Empire obliterated Eleusis in the fourth century AD.Renegade scholars in the 1970s claimed the Greek potion was psychedelic, just like the original Christian Eucharist that replaced it. In recent years, vindication for the disgraced theory has been quietly mounting in the laboratory. The rapidly growing field of archaeological chemistry has proven the ancient use of visionary drugs. And with a single dose of psilocybin, the psycho-pharmacologists at Johns Hopkins and NYU are now turning self-proclaimed atheists into instant believers. No one has ever found hard, scientific evidence of drugs connected to Eleusis, let alone early Christianity. Until now.Armed with key documents never before translated into English, convincing analysis, and a captivating spirit of quest, Muraresku mines science, classical literature, biblical scholarship and art to deliver the hidden key to eternal life, bringing us to what clinical psychologist William Richards calls \"the edge of an awesomely vast frontier.\"Featuring a Foreword by Graham Hancock, the New York Times bestselling author of America Before: The Key to Earth's Lost Civilization.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Philosophy",
    "Spirituality",
    "Science",
    "Audiobook"
  ],
  "author": "Brian C. Muraresku",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/51174256-the-immortality-key"
}