{
  "title": "Is Social Justice Just?",
  "description": "\"Anyone concerned with social justice will find this book makes him question his assumptions, rethink his premises, and think!\" —Andrew P. Morriss, professor, Bush School of Government and Public Service, School of Law, Texas A&M UniversityWhat is social justice? In these pages, twenty-one accomplished academics seek to do justice to \"social justice.\" Inequality exists and it obviously causes rifts in societies. But it's not obvious how the government should address those rifts, or if it should address them at all. Have we forgotten the perhaps more efficient power of personal choice—and the corollary to serve our neighbors—to make our society more humane? Beginning with the first political philosophers in ancient Athens, and continuing right through Marx into our post-modern era, men have wrestled with the question of justice; and the answers have been as earnest as they have been varied. Today, our \"expert\" class also claim to have answers—updated answers, more \"equitable\" answers, more technological answers ... in short, answers that are simply better suited to our times.But are those answers in any way correct? Do they work? Are they—just? In these elegant, nuanced essays, the authors use the wisdom of ancient and modern philosophers to shed light on these important questions—and the answers are revealing. Armed with ample evidence from real-world experiences, lessons from history, the wisdom of the classics, modern philosophers, and even the teachings of the world religions, the contributors of \nIs Social Justice Just?\n Illuminate the central role of the individual in achieving justice in all its aspects. Read \nIs Social Justice Just?\n And how to do social justice wrong with the poison of resentment, envy, and ignorance;how to do social justice right with the insights of philosophers and theologians;how to respect people's rights and liberties without sacrificing true equality;and how to reform flawed public policies that just make everything worse. In a world of partisanship, hysteria, maliciousness, and good intentions attached to hellish outcomes, this landmark book enters the public discourse at a critical time. With a foreword by Jordan B. Peterson, a preface by Nicholas Rescher, and a collection of essays by some of the best and brightest scholars of our time, \nIs Social Justice Just?\n is a timely and urgent work. Read it, and you will begin to think about \"social justice,\" and justice, in some surprising new ways.",
  "genres": [],
  "author": "Christopher J. Coyne",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/125444274-is-social-justice-just"
}