{
  "title": "The Mindful Millionaire:  Overcome Scarcity, Experience True Prosperity, and Create the Life You Really Want",
  "description": "\"Leisa has a truly unique gift and has designed a path that will transform your relationship with money.\"--Grant Sabatier, author of Financial Freedom and creator of Millennial Money In the world of personal finance the biggest challenge is the sense that there's never going to be enough. It is this mindset of scarcity, and not the amount spent on lattes, that holds people back the most from achieving their financial dreams.Using techniques she's developed as a financial planner and spiritual coach, Leisa Peterson guides you to dig deeper and discover the root of your financial thinking to change not just the way you save and spend, but the way you live your life.Through powerful practices, compelling stories and extensive research, The Mindful Millionaire meets you wherever you are in your money journey by exploring:*Where your current money habits come from and why you feel the way you do about money and success.*How to break the cycle of fear, grief, and shame that often surrounds your money habits.*How to write a new money story that inspires joy, satisfaction and prosperity.*Why wealth building isn't just about positive thinking and \"manifesting\" things into reality.*How to stop financial self-sabotage and procrastination.*Where practical financial advice misses the mark.*The most effective tools for changing how you think and feel about money.*What true financial independence looks like and how to discover the millionaire within.\"This book helps you realize your intrinsic value so your financial decisions reflect what matters most to you. This is the key to true financial freedom.\"--Ivan R. Misner, Ph.D., Founder of BNI and New York Times bestselling author of Truth or Delusion? Busting Networking's Biggest Myths \"If you've read other finance books and still felt empty, this is the book you've been waiting for.\"--Joe Saul-Sehy, Creator and Co-Host, Stacking Benjamins Podcast \"If you would like to go to the core of your mindset issues once-and-for-all, then this book is a MUST-have for your library.\"--Dana Wilde, bestselling author of Train Your Brain and Host of Positive Mindset for Entrepreneurs",
  "genres": [
    "Finance",
    "Personal Finance",
    "Money",
    "Nonfiction",
    "Self Help",
    "Business",
    "Spirituality"
  ],
  "author": "Leisa Peterson",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/51174393-the-mindful-millionaire"
}