{
  "title": "The Spiritual Brain: A Neuroscientist's Case for the Existence of the Soul",
  "description": "Do religious experiences come from God, or are they merely the random firing of neurons in the brain? Drawing on his own research with Carmelite nuns, neuroscientist Mario Beauregard shows that genuine, life-changing spiritual events can be documented. He offers compelling evidence that religious experiences have a nonmaterial origin, making a convincing case for what many in scientific fields are loath to consider—that it is God who creates our spiritual experiences, not the brain. Beauregard and O'Leary explore recent attempts to locate a \"God gene\" in some of us and claims that our brains are \"hardwired\" for religion—even the strange case of one neuroscientist who allegedly invented an electromagnetic \"God helmet\" that could produce a mystical experience in anyone who wore it. The authors argue that these attempts are misguided and narrow-minded, because they reduce spiritual experiences to material phenomena. Many scientists ignore hard evidence that challenges their materialistic prejudice, clinging to the limited view that our experiences are explainable only by material causes, in the obstinate conviction that the physical world is the only reality. But scientific materialism is at a loss to explain irrefutable accounts of mind over matter, of intuition, willpower, and leaps of faith, of the \"placebo effect\" in medicine, of near-death experiences on the operating table, and of psychic premonitions of a loved one in crisis, to say nothing of the occasional sense of oneness with nature and mystical experiences in meditation or prayer. Traditional science explains away these and other occurrences as delusions or misunderstandings, but by exploring the latest neurological research on phenomena such as these, The Spiritual Brain gets to their real source.",
  "genres": [
    "Science",
    "Psychology",
    "Philosophy",
    "Spirituality",
    "Neuroscience",
    "Nonfiction",
    "Religion"
  ],
  "author": "Mario Beauregard",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/1254461.The_Spiritual_Brain"
}