{
  "title": "DEAD RECKONING",
  "description": "Extensively Revised And Updated!Tom and Jackie Hawks loved their life in retirement, sailing on their yacht, the Well Deserved. But when the birth of a new grandson called them back to Arizona, they put the boat up for sale. Skylar Deleon and his pregnant wife Jennifer showed up as prospective buyers, with their baby in a stroller, and the Hawkses thought they had a deal. Soon after a sea trial and an alleged purchase, however, the older couple disappeared and the Deleons promptly tried to access the Hawkses' bank accounts.As police investigated the case, they not only found a third homicide victim with ties to Skylar, they also uncovered an unexpected and unusual motive: Skylar had wanted gender reassignment surgery for years. By killing the Hawkses with a motley crew of assailants and plundering the couple's assets, the Deleons had planned to clear their $100,000 in debts and still have money for the surgery, which Skylar had already scheduled.Now, in this up-to-the-minute updated edition, which includes extensive new material, New York Times bestselling author Caitlin Rother presents the latest breaking developments in the case. Skylar, who was ultimately sentenced to death row for the three murders, transitioned to a woman via hormones while living in the psych unit at San Quentin prison. Recently, she legally changed her name and gender to female, apparently a strategic step in her quest to obtain taxpayer-subsidized gender confirmation surgery and transfer to a women's prison. Combined with Governor Gavin Newsom's recent moratorium on executions, this only adds insult to injury for the victims' families, who want Skylar to receive the ultimate punishment for her crimes.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Mystery",
    "Audiobook",
    "History"
  ],
  "author": "Caitlin Rother",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/51169330-dead-reckoning"
}