{
  "title": "Our Team: The Epic Story of Four Men and the World Series That Changed Baseball",
  "description": "The riveting story of four men—Larry Doby, Bill Veeck, Bob Feller, and Satchel Paige—whose improbable union on the Cleveland Indians in the late 1940s would shape the immediate postwar era of Major League Baseball and beyond.\n\nIn July 1947, not even three months after Jackie Robinson debuted on the Brooklyn Dodgers, snapping the color line that had segregated Major League Baseball, Larry Doby would follow in his footsteps on the Cleveland Indians. Though Doby, as the second Black player in the majors, would struggle during his first summer in Cleveland, his subsequent turnaround in 1948 from benchwarmer to superstar sparked one of the wildest and most meaningful seasons in baseball history.In intimate, absorbing detail, Our Team traces the story of the integration of the Cleveland Indians and their quest for a World Series title through four key participants: Bill Veeck, an eccentric and visionary owner adept at exploding fireworks on and off the field; Larry Doby, a soft-spoken, hard-hitting pioneer whose major-league breakthrough shattered stereotypes that so much of white America held about Black ballplayers; Bob Feller, a pitching prodigy from the Iowa cornfields who set the template for the athlete as businessman; and Satchel Paige, a legendary pitcher from the Negro Leagues whose belated entry into the majors whipped baseball fans across the country into a frenzy.Together, as the backbone of a team that epitomized the postwar American spirit in all its hopes and contradictions, these four men would captivate the nation by storming to the World Series--all the while rewriting the rules of what was possible in sports.",
  "genres": [
    "Baseball",
    "Sports",
    "Nonfiction",
    "History",
    "Biography",
    "Race",
    "Audiobook"
  ],
  "author": "Luke Epplin",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/51182635-our-team"
}