{
  "title": "Rotten Apple",
  "description": "▪▪▪▪Francis Patrick “FOCUS” Flanagan Sgt. at Arms for the Royal Bastards NYC/Rotten Apple Chapter▪▪▪▪  I knew immediately Nixx’s tough girl game was an act—New Yorker with a rough edge and a decent size chip on her shoulder—I wasn’t buyin’ that mess at all. She has the eyes of a damn angel and lips that’d make the most religious man wanna lay down with Satan himself. She’d make the Bastards a lot of money.  I’d make sure of that.  Rattler thought he’d be the one to pull her in, but she was used to guys like him. She hadn’t been around one like me. My mama always said, “You get more flies with honey than you do with vinegar.” I’d be the honey until Nixx was grindin’ on and openin’ all those flies. Boy, did that girl shock the hell outta me. It was like takin’ candy from a baby. Until, she started to like her job too much.  I told her she’d be a waitress. I swear on my mama it wasn’t a lie. She did waitress. Then she stripped, escorted, did webcams. Then I took her to L.A. to see what she was made of. That’s when I couldn’t take it anymore. She pushed my buttons too many times—smilin’ and teasin’ while she was with all them other dudes.  I wasn’t supposed to fall for any of those girls. Turn ‘em out, keep ‘em high, and make ‘em work those little honey pots until they couldn’t stand—that was my job. Nixx’ s pot never broke or ran dry. For some reason it bugged the ever livin’ piss outta me. Ya know, Eve took the world down by makin’ Adam eat an apple. Either Nixx was the shiniest apple of the bunch or the most rotten apple of ‘em all.  ▪▪▪▪Nicolette Barrett/Nixx Barrit▪▪▪▪  I’m Nixx Barrit—it should be Ni-XXX with three fat ‘X’s considering I’m a fancy hooker. Ya know—an escort. Whatever you wanna call it, I do what I do for the all mighty dollar. Cash is king and it all hits the palms of the most royal, rotten hands in the Big Apple.  It started when FOCUS and Rattler walked into a diner where I worked. Next thing I knew I was a waitress in their place, The Mounds Bar, at least that’s what the Bastards said I’d be. What a joke! It took about a month, until I was crawlin' around on the middle of the stage. The girls tried to feed me meth and liquor but the biggest drug of all was FOCUS. If you piled all of them on a table they wouldn't compare to the high I got bein' around that psycho Irishman.",
  "genres": [
    "Dark",
    "Romance"
  ],
  "author": "B.B. Blaque",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/51188212-rotten-apple"
}