{
  "title": "The Love Songs of W.E.B. Du Bois",
  "description": "A magisterial epic—an intimate yet sweeping novel with all the luminescence and force of Homegoing; Sing, Unburied, Sing; and The Water Dancer—that chronicles the journey of one American family, from the centuries of the colonial slave trade through the Civil War to our own tumultuous era. The great scholar, W. E. B. Du Bois, once wrote about the Problem of race in America, and what he called “Double Consciousness,” a sensitivity that every African American possesses in order to survive. Since childhood, Ailey Pearl Garfield has understood Du Bois’s words all too well. Bearing the names of two formidable Black Americans—the revered choreographer Alvin Ailey and her great grandmother Pearl, the descendant of enslaved Georgians and tenant farmers—Ailey carries Du Bois’s Problem on her shoulders.Ailey is reared in the north in the City but spends summers in the small Georgia town of Chicasetta, where her mother’s family has lived since their ancestors arrived from Africa in bondage. From an early age, Ailey fights a battle for belonging that’s made all the more difficult by a hovering trauma, as well as the whispers of women—her mother, Belle, her sister, Lydia, and a maternal line reaching back two centuries—that urge Ailey to succeed in their stead.To come to terms with her own identity, Ailey embarks on a journey through her family’s past, uncovering the shocking tales of generations of ancestors—Indigenous, Black, and white—in the deep South. In doing so Ailey must learn to embrace her full heritage, a legacy of oppression and resistance, bondage and independence, cruelty and resilience that is the story—and the song—of America itself.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Literary Fiction",
    "Race",
    "Audiobook",
    "Historical",
    "African American"
  ],
  "author": "Honorée Fanonne Jeffers",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/51183428-the-love-songs-of-w-e-b-du-bois"
}