{
  "title": "Strange Bedfellows: Adventures in the Science, History, and Surprising Secrets of STDs",
  "description": "\"Joyful and funny . . . Park uses science, compassion, humor, diverse stories and examples of her own shame-free living to take the stigma out of these infections.\" ― The New York TimesWith curiosity and wit, Strange Bedfellows rips back the bedsheets to expose what really happens when STDs enter the sack.Sexually transmitted diseases have been hidden players in our lives for the whole of human history, with roles in everything from World War II to the growth of the Internet to The Bachelor . But despite their prominence, STDs have been shrouded in mystery and taboo for centuries, which begs the why do we know so little about them?Enter Ina Park, MD, who has been pushing boundaries to empower and inform others about sexual health for decades. With Strange Bedfellows , she ventures far beyond the bedroom to examine the hidden role and influence of these widely misunderstood infections and share their untold stories.Covering everything from AIDS to Zika, Park explores STDs on the cellular, individual, and population-level. She blends science and storytelling with historical tales, real life sexual escapades, and interviews with leading scientists―weaving in a healthy dose of hilarity along the way.The truth is, most of us are sexually active, yet we’re often unaware of the universe of microscopic bedfellows inside our pants. Park aims to change this by bringing knowledge to the masses in an accessible, no-nonsense, humorous way―helping readers understand the broad impact STDs have on our lives, while at the same time erasing the unfair stigmas attached to them.A departure from the cone of awkward silence and shame that so often surrounds sexual health, Strange Bedfellows is the straight-shooting book about the consequences of sex that all curious readers have been looking for.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Medical",
    "Health",
    "Sexuality",
    "Medicine"
  ],
  "author": "Ina Park",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/51182566-strange-bedfellows"
}