{
  "title": "The Bluffs",
  "description": "'Tense, atmospheric and unsettling, this book will stay with you long after you turn the last page, and long after you turn out the lights.' – Christian WhiteWhen a school group of teenage girls goes missing in the remote wilderness of Tasmania’s Great Western Tiers, the people of Limestone Creek are immediately on alert. Three decades ago, five young girls disappeared in the area of those dangerous bluffs, and the legend of ‘the Hungry Man’ still haunts locals to this day.Now, authorities can determine that the teacher, Eliza Ellis, was knocked unconscious, so someone on the mountain was up to foul play. Jordan Murphy, the local dealer and father of missing student Jasmine, instantly becomes the prime suspect. But Detective Con Badenhorst knows that in a town this size – with corrupt cops, small-town politics, and a teenage YouTube sensation – everyone is hiding something, and bluffing is second nature.When a body is found, mauled, at the bottom of a cliff, suspicion turns to a wild animal – but that can’t explain why she was discovered barefoot, her shoes at the top of the cliff, laces neatly tied.'This atmospheric, scenery-rich crime tale embodies both the beauty and brutality of nature – especially human nature... The Bluffs establishes Perry as a fierce new talent.' Apple Books'The narrative races along, pulling the reader from page to page with a freight-train momentum that starts with the first word and ends with the final full stop.' Sunday Examiner‘A riveting story that will give even a seasoned thriller reader goosebumps... The Bluffs is a perfect winter read that will pull you in and won’t let go. Perry has managed to exceed expectations for his debut novel. Full of mystery, crime and a certain hair-raising charm, you won’t be disappointed.' Better Reading",
  "genres": [
    "Thriller",
    "Crime",
    "Mystery",
    "Fiction",
    "Australia",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Kyle  Perry",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/51199465-the-bluffs"
}