{
  "title": "The White Elephant of Panschin",
  "description": "A dark past. A uncertain future. Under Mars’ domed city, four people’s destinies collideNear the Martian north pole, six linked domes form the mining city of Panschin. For generations, they have burrowed into the Martian underworld, digging tunnels, mining ore, and uncovering its secrets.At Panschin’s mining conference, Airik, the daimyo of Shelleen, hopes to find allies to exploit his family’s newly discovered Red Mercury lode. But the prospect of fabulous wealth has drawn a target on Airik’s for con artists and their schemes, companies hoping to scam him, and women wanting to become his wife. Overwhelmed, Airik flees the attention with his aide, secretary and bodyguard, searching for a quiet place to work in peace.For Veronica Bradwell, her family’s disgrace after her father’s financial scandal and suicide forces her to open the doors of their last asset, the mansion nicknamed the White Elephant to boarders. And while Airik and his “cousins” look suspicious, they are well-mannered and, most important, paid in advance.But Veronica has more concerns. Younger sister Shelby wants to become an artist, and her education at Panschin University. requires opening the White Elephant to a gallery showing led by Professor Vitebskin, whose ideas of art clashes with Shelby’s instinct for beauty and color. As Shelby struggles, she forms an attachment with Malcolm Cobb, a young bank executive who masks his mining background with a serious ambition to rise in Panschin’s hierarchy.When a sinister thug approaches Veronica demanding to buy the White Elephant, she learns that old sins cast long shadows, that some people never forget, and that the mysterious guest Airik is hiding secrets of his own.“The White Elephant of Panschin” is the second book in Odessa Moon’s “Steppes of Mars” series. Set on a terraformed Mars hundreds of years from now, the peoples descended from Olde Earthe’s cultures struggle with the planet’s mysteries, the elite’s quest for power, and the longings of their human hearts.",
  "genres": [],
  "author": "Odessa Moon",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/51212087-the-white-elephant-of-panschin"
}