{
  "title": "So We Can Glow: Stories",
  "description": "A lush, glittering short story collection exploring female obsession and desire by an award-winning writer Roxane Gay calls \"a consummate storyteller.\" From Kentucky to the California desert, these forty-two short stories expose the glossy and matte hearts of girls and women in moments of obsessive desire and fantasy, wildness and bad behavior, brokenness and fearlessness, and more.  Teenage girls sneak out on a summer night to meet their boyfriends by the train tracks. A woman escapes suffocating grief through a vivid fantasy life. Members of a cult form an unsettling chorus as they extol their passion for the same man. A love story begins over cabbages in a grocery store. A laundress' life is consumed by obsession for a famous baseball player. Two high school friends kiss all night and binge-watch Winona Ryder movies after the death of a sister. Leesa Cross-Smith's sensuous stories will drench readers in nostalgia for summer nights and sultry days, the intense friendships of teenage girls, and the innate bonds felt between women. She evokes the pangs of loss and motherhood, the headiness and destructive potential of desire, and the pure exhilaration of being female. The stories in So We Can Glow--some long, some gone in a flash, some told over text and emails--take the wild hearts of girls and women and hold them up so they can catch the light.We, moons --The Great Barrier Reef is dying but so are we --Unknown legend --Low, small --A tennis court --Tim Riggins would've smoked --Surreptitious, canary, chamomile --Winona forever --Girlheart cake with glitter frosting --Fast as you --Chateau Marmont, champagne, Chanel --Bearish --All that smoke howling blue --Pink bubblegum and flowers --Knock out the heart lights so we can glow --Get rowdy --Re: little doves --Out of the strong, something sweet --The lengths --Small and high up --Small are dark, some are light, summer melts --Bright --Dark and sweaty and dirty --Home safe --Teenage dreams time machine --Rope burns --Get Faye & Birdie --The Darl Inn --You should love the right things --And down we go! --Crepuscular --Stay and stay and stay --Two cherries under a lavender moon --When it gets warm --Boy smoke --Dandelion light --California, keep us --Cloud report --Downright --You got me --Eine kleine nachmusik --A girl has her secrets --Vincent",
  "genres": [
    "Short Stories",
    "Fiction",
    "Contemporary",
    "Romance",
    "Book Club",
    "Feminism",
    "Literary Fiction"
  ],
  "author": "Leesa Cross-Smith",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/51202686-so-we-can-glow"
}