{
  "title": "Targeted: The Cambridge Analytica Whistleblower's Inside Story of How Big Data, Trump, and Facebook Broke Democracy and How It Can Happen Again",
  "description": "In this explosive memoir, a political consultant and technology whistleblower reveals the disturbing truth about the multi-billion-dollar data industry, revealing to the public how companies are getting richer using our personal information and exposing how Cambridge Analytica exploited weaknesses in privacy laws to help elect Donald Trump—and how this could easily happen again in the 2020 presidential election.When Brittany Kaiser joined Cambridge Analytica—the UK-based political consulting firm funded by conservative billionaire and Donald Trump patron Robert Mercer—she was an idealistic young professional working on her fourth degree in human rights law and international relations. A veteran of Barack Obama’s 2008 campaign, Kaiser’s goal was to utilize data for humanitarian purposes, most notably to prevent genocide and human rights abuses. But her experience inside Cambridge Analytica opened her eyes to the tremendous risks that this unregulated industry poses to privacy and democracy.Targeted is Kaiser’s eyewitness chronicle of the dramatic and disturbing story of the rise and fall of Cambridge Analytica. She reveals to the public how Facebook’s lax policies and lack of sufficient national laws allowed voters to be manipulated in both Britain and the United States, where personal data was weaponized to spread fake news and racist messaging during the Brexit vote and the 2016 election. But the damage isn’t done Kaiser warns; the 2020 election can be compromised as well if we continue to do nothing.In the aftermath of the U.S. election, as she became aware of the horrifying reality of what Cambridge Analytica had done in support of Donald Trump, Kaiser made the difficult choice to expose the truth. Risking her career, relationships, and personal safety, she told authorities about the data industry’s unethical business practices, eventually testifying before Parliament about the company’s Brexit efforts and helping Special Counsel Robert Mueller’s investigation into Russian interference in the 2016 election, alongside at least 10 other international investigations.Packed with never-before-publicly-told stories and insights, Targeted goes inside the secretive meetings with Trump campaign personnel and details the promises Cambridge Analytica made to win. Throughout, Kaiser makes the case for regulation, arguing that legal oversight of the data industry is not only justifiable but essential to ensuring the long-term safety of our democracy.Targeted includes 20-30 photos.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Technology",
    "Memoir",
    "Business",
    "Biography",
    "History"
  ],
  "author": "Brittany Kaiser",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/51215027-targeted"
}