{
  "title": "Succubus Soccer Mom",
  "description": "You know that bitch from hell everybody talks about? That's me. I mean that literally.  I was born in the seventh circle of Hell to two demons of noble lineage. Know what that means? Squat. My brimstone birth certificate and five bucks might get me a cup of coffee from Starbucks. The minute I was born, they handed me off to a wet nurse, sent me to earth, and left me to fend for myself. I suppose, I should thank them. They taught me at an early age that there is nothing in either world more important than self-sufficiency.  To survive, I needed money. So, naturally, I became a stripper.  Don't judge, it paid the bills. A lot of them. And it provided a solution to my particular dietary requirements. I'm a succubus. We eat lust for breakfast. And lunch. And dinner. What better place to get it than a seedy, smoke-filled bar full of horndogs shoving dollar bills in your thong?  Life was good.  Then, I met Ryan and fell in love. He knew what I was and loved me anyway. I loved him so much that we got married and I gave him twin children. And then he died.  And left me alone.  Okay, not completely alone. He left me two kids to raise and a crippling sense of loss.  So, I did what any demon would do, I loaded up the kids and moved a thousand miles to start a new life. Now, my Hell is in suburbia and the most evil things in my life are my home owners' association and the PTA. Maybe it wasn't too late to go back to Hell.  This book is intended for mature audiences. 18+ readers only! It contains graphic language, sexual situations, and inappropriate humor. This is a fast burn reverse harem where the girl gets all the guys. Why Choose? Contains M/M and F/F scenes.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Romance",
    "Demons",
    "Paranormal Romance",
    "Vampires",
    "Magic"
  ],
  "author": "Jacquelyn Faye",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/51230099-succubus-soccer-mom"
}