{
  "title": "Taking After Mudear",
  "description": "Best-Selling author Tina McElroy Ansa returns with her signature ability to tell a good, quirky story and tell it with humor, grace and great respect for the power of the particular (The New York Times Book Review) with her new novel TAKING AFTER MUDEAR. TAKING AFTER MUDEAR, Ansa s fifth novel, is the superbly crafted sequel to her awardwinning best-seller, UGLY WAYS. And it is the book fans have been waiting for. Jill McCorkle calls UGLY WAYS, an absolute beauty...that crackles and sings with life. And although, as TAKING AFTER MUDEAR opens, the matriarch of the Lovejoy family has been dead for months, she and Ansa s newest novel again crackle and sing with life. TAKING AFTER MUDEAR continues to follow the story of the three Lovejoy sisters and their mother Mudear, who is deceased but refuses to die, in the small Georgia town of Mulberry. The baby of the family, Annie Ruth, -- pretty, unmarried and hugely pregnant with the first Lovejoy grandchild -- has moved back to Mulberry and is living with her big sister, Betty, a prosperous businesswoman. The middle girl, Emily, who claims she has taken a leave of absence from her job in Atlanta, has moved in, too, to help out and mostly raise the level of sibling tension and friction. But just as the girls begin to think things have settled down for them, Mudear, their recently deceased, self-centered, self-focused mother, starts to make her presence felt again. And with the birth of Annie Ruth s baby girl, the fragile Lovejoy family situation begins to totter even more. With each piece of evidence that something otherworldly and strange is indeed still hanging around the Lovejoy household, the sisters suspect more and more that they are being haunted by their mother. With various baby s daddies showing up and Lovejoys having signature meltdowns, things soon escalate into a full-flown supernatural Mulberry battle for the very life of the newborn child. Indeed, Mudear has come back for that baby girl!! And the sisters have to discover if they are merely the Lovejoy girls ( Them girls still got some ugly ways about em! Mudear is fond of muttering.) or truly the Lovejoy women!!",
  "genres": [
    "Paranormal"
  ],
  "author": "Tina McElroy Ansa",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/5123002-taking-after-mudear"
}