{
  "title": "Faded Pictures from My Backyard: A Memoir",
  "description": "Sue Carswell grew up with two families: her own and the one comprised of the orphans living in her backyard. Though the Carswells’ house is on the grounds of the Albany Home for Children, where Sue’s father is an administrator and her mother a nurse, Sue and her four rowdy siblings are not permitted to play with the Home’s young residents. Instead, plagued by irrational fears, Sue observes these troubled souls from a distance. As she watches the orphans come and go, she fantasizes that in their unorthodox world a girl as unusual as she might just fit in.Racked with insomnia and panic attacks, Carswell feels increasingly out of step with her so-called normal family. While lauded for her exceptional creativity, behind the gregarious mask is a frightened and depressed girl. Throughout her life, she remains fiercely attached to her gentle, compassionate mother who, like the children next door, grew up without parents.With a structure reminiscent of Michael Cunningham’s The Hours, Sue Carswell’s remarkable book skillfully weaves together stories spanning the decades and capturing generations of both the Carswell family and the Albany Home. Curious about the past, Carswell tracks down some of the Home’s previous inhabitants, searching all the while for the ever-elusive happy ending. In the process, she revisits her own turbulent childhood and discovers the parents she never fully understood. Writing poignantly about the tremendous void left by the death of a mother, Sue Carswell has created an utterly original rendering of family and loss, sharply observed, paradoxically tender, and illuminated by Sue a wry, witty narrative voice. Faded Pictures from My Backyard parlays the literal orphan into a larger story about one woman’s triumph over fear. A study in emotional dislocation held aloft by humor, this is a stirring narrative about the times that matter most and the connections that last. Above all, this is the affecting tale of the lasting love between a mother and daughter.",
  "genres": [],
  "author": "Sue Carswell",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/512626.Faded_Pictures_from_My_Backyard"
}