{
  "title": "The End of the World Is Bigger than Love",
  "description": "She said we didn’t know what the world out there had become. We had been alone there so long on that tiny island, in that tiny church.But in the night, I couldn’t bear it.My chest beat like wings.Identical twin sisters Summer and Winter live alone on a remote island, sheltered from a destroyed world. They survive on rations stockpiled by their father and spend their days deep in their mother’s collection of classic literature—until a mysterious stranger upends their carefully constructed reality.At first, Edward is a welcome distraction. But who is he really, and why has he come? As love blooms and the world stops spinning, the secrets of the girls’ past begin to unravel and escape is the only option.A sumptuously written novel of love and grief; of sisterly affection and the ultimate sacrifice; of technological progress and climate catastrophe; of an enigmatic bear and a talking whale—The End of the World Is Bigger than Love is unlike anything you’ve read before.Davina Bell is an award-winning author of books for young readers of many ages. She writes picture books (including All the Ways to be Smart and Under the Love Umbrella), junior fiction (Lemonade Jones) and middle-grade fiction (the Corner Park Clubhouse series). Davina lives in Melbourne, where she works as a children’s book editor.‘Davina Bell uses the increasingly familiar post-apocalyptic scenario to explore ideas about families, sisters, identity and love. It’s a strange but impressive novel that should resonate with young adult readers.’ Sydney Morning Herald’The most outstanding young adult novel I read in 2020…[Davina Bell] has ascended into another sphere with this intuitive, surreal and assured literary work. The End of the World is Bigger than Love invites multiple readings and will imprint the imagination.’ Australian‘A beautifully imagined, magical new fairy tale that exists in the same realm of sophisticated magical realism that brings to mind the extraordinary skill of writers who excel in the genre, the likes of Angela Carter, Sonya Hartnett and Leanne Hall…We need books like this. We need writers like Bell. Now, more than ever.‘ Readings",
  "genres": [
    "Young Adult",
    "Dystopia",
    "Fiction",
    "Science Fiction",
    "Fantasy",
    "Romance",
    "Post Apocalyptic"
  ],
  "author": "Davina Bell",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/51261210-the-end-of-the-world-is-bigger-than-love"
}