{
  "title": "How to Beg for Cigarettes",
  "description": "How to Beg for Cigarettes provides \"Laugh-a-mile-a-minute\" storytelling from Inner City entrepreneurs.     The hilarious, sidesplitting novel \"How to Beg for Cigarettes\" has just been released by Virtualbookworm.com. The author, Matt Ponticello, drew from his personal experiences and actual events to write this uproarious, exaggerated comedy that follows his exploits through the streets and alleyways of America's inner cities.Ponticello's \"How to Beg for Cigarettes\" is a must-read for business owners, or anyone who has ever had even the slightest aspiration about opening a small business. Most people believe having your own business is a walk in the park. Sure, it can be, if it's a charming little donut shop located in a quaint little country town totally out of the loop. Well, it's not so in this case! Matt Ponticello retires early from the comfort and security of the corporate world and opens an auto body repair shop deep in the city.     \"Yeah, take a walk in the park around here,\" he explains, \"That's if you can find one; and see how long you last before you're mugged for cigarettes and loose change.\"     So begins \"How to Beg for Cigarettes,\" the story of one business owner's \"laugh-a-mile-a-minute\" romp through the bowels of the inner city, where he finds a real and sometimes surreal cast of characters; with a city, a business, and a staff of employees to match. Amidst the daily dangers and confrontations in this harsh environment, he struggles with his own personal battle - whether to stay in business and suffer an inevitable nervous breakdown or return to the calm of retirement.    From petty theft to murder, Ponticello searches for the humor and \"good\" in even the worst-case scenarios, taking a romantic pride in the city's dangers - genuine and predictable - and approaches a six-block walk for coffee every morning as if it's an epic adventure filled with peril.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Matt Ponticello",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/12548278-how-to-beg-for-cigarettes"
}