{
  "title": "Jingle Bell Rock",
  "description": "They're big, they're bad, and they're everywhere -- Brava's national bestselling anthologies continue to delight devoted fans across the country, and the franchise that began with All Through the Night now brings a whole new meaning to the idea of Christmas ecstasy. Featuring a six-pack of top-notch, bestselling romance writers, Jingle Bell Rock will be the next best thing to eggnog to celebrate Christmas cheer. Skip the mistletoe -- you won't need it after you indulge in these six tempting tales of romance filled with the sort of naughty-but-oh-so-nice men who make the season so bright it's downright hot...He Sees You When You're SleepingLori FosterWhat Booker Dean wants for Christmas isn't under the tree, it's right next door. Frances Kennedy is everything Booker desires...and the gift he has planned for her involves a lot of delicious unwrapping...All She Wants for ChristmasJanelle DenisonWhen sexy pediatrician Matthew Carlton plays Santa, pulling Faith Roberts onto his lap, he has no idea what's on her Christmas wish list...or how much he'll enjoy fulfilling every bit of it...Turning Up the HeatSusan DonovanBeing stood up on Christmas Eve is bad enough, but now Valerie's furnace is broken, too. Good thing that sexy repairman is available to raise the temperature dramatically...Baby, It's Cold OutsideDonna KauffmanIt's been ten years since Susanna York left Jace Morgan. Now, as fate reunites them during a holiday snowstorm, they'll have plenty of time to discover that distance only sharperns certain hungers...A Blue ChristmasAlison KentThomas \"Blue\" Miller never expected to see Jessie Buchanan on his Christmas tree farm again. But now that she's here, he's ready to show her exactly what she's been missing...The Nutcracker SweetNancy WarrenCo-workers Daniel and Tara couldn't hate each other more. So when they end up as Secret Santa partners, it's a perfect chance for revenge and a dare that just may ignite the steamiest night of their lives...",
  "genres": [
    "Romance",
    "Anthologies",
    "Christmas",
    "Contemporary",
    "Contemporary Romance",
    "Holiday",
    "Fiction"
  ],
  "author": "Lori Foster",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/513043.Jingle_Bell_Rock"
}