{
  "title": "Trapped in Time",
  "description": "*This is a PLUS length novel--over 100,000 words long*** A woman trapped in the past A dark, intense warrior who claims she is his wife Will Caroline survive her stay in the parallel universe she has fallen into? Or will she be forever...Trapped in Time?  Dr. Caroline Lambert has a PhD in Astro-Temporal Physics but no clue about matters of the heart. Married to her work, she has built a machine called PORTAL, capable of opening a window into other universes. She believes it is only for observation, so imagine her horror when she finds herself sucked through the window and right into a whole other world--a world that seems stuck in the past, around the time of the Victorian era.  Now Caroline must deal with hoop skirts and elaborate etiquette, not to mention all the dangers of the past. It's a minefield of antiquated social mores and poisons used as medicines and cosmetics. But perhaps the most perplexing problem is the husband she has somehow acquired--a tall, dark Blood Kindred named Richard who claims she is his wife and refuses to let her go. For in this universe, the Kindred arrived 200 years earlier than in her own time and they have made their way into polite society...as Richard seems determined to make his way into Caroline's heart.  Will Caroline ever find her way back to her own time and universe? Will she succumb to Richard's charms and give in to the big Blood Kindred who claims her as his own? And what about the scheming mother she has in this world who is determined that she will leave Richard for a Viscount of questionable morals? Caroline doesn't know what to do, she only knows that if she cannot somehow open another window into her own world she will be forever...Trapped in Time.",
  "genres": [
    "Romance",
    "Time Travel",
    "Aliens",
    "Science Fiction",
    "Fantasy",
    "Science Fiction Romance",
    "Audiobook"
  ],
  "author": "Evangeline Anderson",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/51276773-trapped-in-time"
}