{
  "title": "Zoe Rosenthal Is Not Lawful Good",
  "description": "A buttoned-up overachiever works overtime to keep her inner nerd at bay—failing spectacularly—in Nancy Werlin’s hilarious and heartfelt return to contemporary realistic fiction.Planning is Zoe Rosenthal’s superpower. She has faith in a properly organized to-do list and avoids unnecessary risks. Her mental checklist goes something like this: 1) Meet soulmate: DONE! 2) Make commitment: DONE! 3) Marriage: TO COME! (after college). She isn’t sure which college yet, but it will have a strong political science department, since her perfect boyfriend, Simon, plans to “save the country,” as his sister puts it, “and the planet and everything.” Zoe will follow along, the perfect serious, supportive girlfriend. It’s good to have her love life resolved, checked off, done. But speaking of unnecessary risks, Zoe’s on a plane to Atlanta, sneaking off to Dragon Con for the second season premiere of Bleeders. The show is subject to her boyfriend’s lofty scorn, but Zoe is nothing like these colorful hordes “wearing their inside on their outside.” Once her flirtation with fandom is over, she will get back to the important business of planning a future with Simon. The trouble is, right now, Bleeders—and her fellow “Bloodygits”—may just mean the world to her. Will a single night of nerdery be enough?  Best-selling and award-winning author Nancy Werlin is best known for science fiction, fantasy, and suspense, but here she turns her pen to realistic fiction with broad appeal. Confirmed nerds will revel in a diverse cast, zany fandoms, and cosplaying crowds, but this is for any reader seeking a smart, breezy coming-of-age story about finding your friends—and your inconvenient self.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Realistic Fiction",
    "Fiction",
    "Humor",
    "Coming Of Age",
    "Fandom"
  ],
  "author": "Nancy Werlin",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/51284112-zoe-rosenthal-is-not-lawful-good"
}