{
  "title": "Sword-Sworn",
  "description": "The sixth book in the Sword-Dancer saga continues the legendary adventures of Tiger and Del, magic wielders and skilled warriorsThe South had always been Tiger’s home. Left as an infant to die in the desert, his real origins were unknown. When he won his freedom from the tribe who enslaved him by slaying a deadly sandtiger, he joined the elite brotherhood of Southron sword-dancers, swearing a lifelong oath to abide by their code of honor.Del was a woman of the North. She had seen her family brutally murdered and her brother carried away to the South to be sold into slavery. Motivated by revenge, she studied with the greatest of Northern sword-masters and became the deadliest sword-singer in the North.Together these two legendary fighters had forged an unlikely partnership of equals, sharing adventures, danger, and eventually love. But when Tiger forfeited an important sword dance to rescue Del, he broke his sworn code of honor—and his sentence was death.Fugitives from both the North and the South, Tiger and Del flee to the distant island of Skandi. Tiger has been told he resembles the people who comes from this remote land, and now, Tiger seeks his true identity. But Skandi proves no safe haven.Abducted by priest-mages, altered in mind and body, Tiger is forced to acknowledge that he possesses his own special brand of magic. A personal magic that carries its own price: Tiger will only have ten or twelve more years to live.But as Tiger and Del struggle to escape, Tiger’s long-dormant power begins to manifest. He falls victim to visions he cannot dismiss, dreams of a dead woman luring him into the crystal sands of the Punja, the South’s deadliest desert. “Find me,” she bids him, “and take up the sword.”Initially, Tiger rebels, refusing the siren song of his dreams. But at last, helpless to deny the compulsion in his own blood, Tiger must accept his magic and his fate. Yet can he avoid paying the terrible price that they threaten to extract?",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Romance",
    "Sword and Sorcery",
    "Magic",
    "High Fantasy"
  ],
  "author": "Jennifer Roberson",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/513269.Sword_Sworn"
}