{
  "title": "The Devil's Music Master: The Controversial Life and Career of Wilhelm Furtwangler",
  "description": "From 1922 until his death in 1954, Wilhelm Furtwängler was the foremost cultural music figure of the German-speaking world, conductor of both the Berlin and Vienna Philharmonic orchestras. But a cloud still hangs over his reputation, despite his undeniable brilliance as a musician, because ofa fatal and tragic decision. Wilhelm Furtwängler remained in Germany when thousands of intellectuals and artists fled after the Nazis seized power in 1933. His decision to stay behind earned him lasting condemnation as a Nazi collaborator--\"The Devil's Music Master.\" Decades after his death,Furtwängler remains for many not only the greatest but also the most controversial musical personality of our time.In The Devil's Music Master , Sam H. Shirakawa forges the first full-length and comprehensive biography of Furtwängler. He surveys Furtwängler's formative years as a difficult but brilliant prodigy, his rise to pre-eminence as Germany's leading conductor, and his development as a musician,composer, and thinker. Shirakawa also reviews the rich recorded legacy Furtwängler documented throughout his forty-year career--such as the legendary Tristan with Kirsten Flagstad and the famous performances of Beethoven's Ninth Symphony in 1942 and 1951.Equally important, Shirakawa goes backstage and behind the lines to explore how the Nazis seized control of the arts and how Furtwängler single-handedly tried to prevent evil characters as Propaganda Minister Joseph Goebbels and Luftwaffe Chief Hermann Göring from annihilating Germany's musicallife. He shows how Furtwängler, far from being a toady to the Nazis, stood up openly against Hitler and Himmler--at enormous personal risk--to salvage the musical traditions of Bach, Mozart, and Beethoven. Shirakawa also presents moving and overwhelming evidence of Furtwängler's astonishingefforts to save the lives of Jews and other persecuted individuals trapped in Nazi Germany--only to be proscribed at the end of the war and nearly framed as a war criminal.But there was more to Furtwängler than his politics, or even his music, and we come to know this extraordinary man as a reluctant composer, a prolific essayist and diary keeper, a loyal friend, a formidable enemy when crossed, and an incorrigible philanderer. Numerous musical luminaries sharetheir memories of Furtwängler to round out this vivid portrait.Based on dozens of interviews and research in numerous documents, letters, and diaries, many of them previously unpublished, The Devil's Music Master is an in-depth look at the life and times of a unique personality whose fatal flaw lay in his uncompromising belief that music and art must bekept apart from politics, a conviction that transformed him into a tragic figure.",
  "genres": [
    "Music",
    "History",
    "Biography",
    "Nonfiction",
    "Classical Music"
  ],
  "author": "Sam H. Shirakawa",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1254960.The_Devil_s_Music_Master"
}