{
  "title": "Silent Scream",
  "description": "It was a time of innocence, a time of hippies, flower children and the Age of Aquarius. A time when young people felt free to roam about the countryside hitchhiking without fear. A time when law enforcement was trusted by the people they were sworn to protect and serve. That time was shattered by one of law enforcements own. His name was Gerard Schaefer. He was a former Wilton Manors, Florida Police Officer who lied his way into the office of the Martin County Florida Sheriff’s Office. He used his lie to continue to perpetrate his crimes of torture and murder of young women who hitchhiked along Florida’s roads.  Gerard Schaefer shattered the lives of the families of these young girls and destroyed the faith of the public in law enforcement. He killed without pity. He tortured without conscience and he hid the crimes without thought.  Schaefer not only destroyed the lives of as many as 34 young women, he kept trophies of his kills, and he lived the crimes over and over again. He believed he was doing the world and his victims a justice by ridding the world of the “whores” who hitchhiked. Gerard Schaefer was a narcissistic psychopath who wanted his fifteen minutes of fame. He believed he had earned it. Florida Author, Yvonne Mason, in her newest release Silent Scream, has captured not only the essence of evil in Gerard Schaefer, she has also captured his brilliance. But more than that Ms. Mason has finally given a voice to the Silent Screams of Gerard Schaefer’s victims, the known and the unknown. Ms. Mason who has a degree in Criminal Justice and was a Bounty Hunter in Georgia before moving to Florida has given a voice to such victims as Georgia Jessup and Susan Place, the two who were discovered on South Hutchinson Island, April 1, 1973 seven months after they disappeared on Sept 23, 1972 in a shallow grave in pieces. She has also given a voice to Collette Goodenough and Barbara Ann Willcox who were killed in Jan 1973 and whose bones found four years later at C-24 Canal.  Ms. Mason has captured the not only the pain, the agony and the suffering Gerard Schaefer’s victims went through, she has captured the pain, the anger and the hurt which law enforcement suffered at the hands of this killer. Even after thirty four years the ones who were in law enforcement at that time still haven’t forgotten. They still carry the emotional scars of the heinous tortures and murders of Gerard Schaefer on the innocent.  Retired FBI Roy Hazelwood writes after reading Ms. Mason’s book: \"Yvonne Mason has captured the true essence of Gerard Schaefer, a deputy sheriff who enjoyed torturing and killing young women. It is a gripping story and you should prepare to be disturbed. I guarantee that you will find it difficult to put this book down.\"  Retired Oakland Park PD Detective Chuck Hemp who worked the disappearance of Jessup and Place wrote this after reading Silent Scream: “When Gerald Schaefer used his badge and gun to terrorize and kill rather than protect and serve he crossed a line that not only snuffed out the lives of his victims but also affected the lives of their loved ones and the police officers charged with investigating these crimes. In her book “Silent Screams” Yvonne Mason has captured more than just the story, but has also given voices to all of Schaefer’s unknown victims. I’m sure there are many.” Ms. Mason stated this “The victims no longer scream silently, they now have a voice and with that voice comes peace.” Silent Scream is a voice for the victims. It is their way of never being forgotten and of also reminding each of us that at any time or any place we also can become a victim.",
  "genres": [
    "True Crime",
    "Thriller"
  ],
  "author": "Yvonne Mason",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/5133795-silent-scream"
}