{
  "title": "Mom Babble: The Messy Truth about Motherhood",
  "description": "Featured on The Ellen DeGeneres Show sharing her \"Holiday Magic\" viral video.Hope, humor, and spiritual inspiration to families in the trenches of parenthood from the founder of Mom Babble.Mary Katherine Backstrom spends her days mending booboos, conquering the boogie man, comforting heartaches, laughing at knock-knock jokes, cooking pancakes, throwing baseballs, and mopping muddy floors. In other words she spends her days relishing in the beautiful, constant noise that is a life with children.In Mom Babble Mary Katherine (MK) Backstrom, founder and personality behind the Mom Babble online community, offers up hope, humor, and spiritual inspiration to families in the trenches of parenthood. With laughter, crying, and eye-rolls MK's, oh so, real essays about raising littles will delight all the not perfect, not always holy, not completely normal, messy, honest and wonderful moms that read them. MK's conversational approach connects with readers like dear friends cozied up on a coffee date.Praise for Mary Katherine Backstrom\"I love how honest and relatable Mary Katherine is in her writing. When an author is raw, it is easy to make a connection to their work.\"- Meredith Masony, Founder of That's Inappropriate\"One of Facebook's funniest parents!\" - Today Show Parenting Team\"Mary Katherine brings love, wisdom, compassion, humor, and insight to her writing that is a must read for every parent.\"  - Love What Matters\"I have probably read more parenting essays than anyone on the planet, and Mary Katherine's voice still surprises me. I laugh out loud, cry, and recall the magic of being a mother in those fresh early years. She is a friend to the struggling moms in the trenches of motherhood.\"  - Jill Smokler, Founder of Scary Mommy and New York Times Best-selling author\"Thank you for cracking us up.\"  - Today with Hoda & JennaProduct Features:Features funny and relatable personal essays. Expands on Backstrom's already popular Mom Babble community posts and stories. Includes a forward by Meredith Masony, founder of That's Inappropriate and That's Inappropriate Parents online communities with nearly 1 million followers across multiple channels. 4-color photographs throughout. Grain embossed hardcover with ribbon.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Audiobook"
  ],
  "author": "Mary Katherine Backstrom",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/51312919-mom-babble"
}