{
  "title": "United States of Socialism: Who's Behind It. Why It's Evil. How to Stop It.",
  "description": "For those who witnessed the global collapse of socialism, its resurrection in the twenty-first century comes as a surprise, even a shock. How can socialism work now when it has never worked before?In this pathbreaking book, bestselling author Dinesh D’Souza argues that the socialism advanced today by the likes of Alexandria Ocasio-Cortez, Bernie Sanders, Ilhan Omar and Elizabeth Warren is very different from the socialism of Lenin, Mao and Castro. It is “identity socialism,” a marriage between classic socialism and identity politics. America’s typical socialist is not a working-class union man but a Black Lives Matter activist, a transgender militant or a prophet of environmental apocalypse. Today’s socialists claim to model themselves not on Mao’s Great Leap Forward or even Venezuelan socialism but rather on the “socialism that works” in Scandinavian countries like Norway and Sweden.This is the new face of socialism that D’Souza confronts and decisively refutes with his trademark incisiveness, wit and originality. He shows how socialism abandoned the working class and found new recruits by drawing on the resentments of race, gender and sexual orientation. He reveals how it uses the Venezuelan, not the Scandinavian, formula. D’Souza chillingly documents the full range of lawless, gangster, and authoritarian tendencies that they have adopted.United States of Socialism is an informative, provocative and thrilling exposé not merely of the ideas but also the tactics of the socialist Left. In making the moral case for entrepreneurs and the free market, the author portrays President Trump as the exemplar of capitalism and also the most effective political leader of the battle against socialism. He shows how we can help Trump defeat the socialist menace.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Economics",
    "American History",
    "Audiobook",
    "Political Science"
  ],
  "author": "Dinesh D'Souza",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/51333444-united-states-of-socialism"
}