{
  "title": "Running with the Kenyans: Passion, Adventure, and the Secrets of the Fastest People on Earth",
  "description": "“A dusty road stretches into the distance like a pencil line across the arid landscape. Lions, rhino, and buffalo roam the plains on either side. But I haven’t come to Kenya to spot wildlife. I’ve come to run.”Whether running is your recreation, your religion, or just a spectator sport, Adharanand Finn’s incredible journey from the English countryside to the elite training camps of Kenya will captivate and inspire you. Part travelogue, part memoir, this mesmerizing quest to uncover the secrets of the world’s greatest runners—and put them to the test—combines practical advice, a fresh look at barefoot running, and hard-won spiritual insights.As a boy growing up in England, Adharanand Finn was a natural runner. While other kids struggled, he breezed through schoolyard races, imagining he was one of his heroes: the Kenyan long-distance runners exploding into prominence as Olympic and world champions. But as he grew up, pursued a career in journalism, married and had children, those childhood dreams slipped away—until suddenly, in his mid-thirties, Finn realized he might have only one chance left to see how far his talents could take him.Uprooting his family of five, including three small children, Finn traveled to Iten, a small, chaotic town in the Rift Valley province of Kenya—a mecca for long-distance runners thanks to its high altitude, endless running paths, and some of the top training schools in the world. Finn would run side by side with Olympic champions, young hopefuls, and barefoot schoolchildren . . . not to mention the exotic—and sometimes dangerous—wildlife for which Kenya is famous.Here, too, he would meet a cast of colorful characters, including his unflappable guide, Godfrey Kiprotich, a former half marathon champion; smooth-talking Christopher Cheboiboch, one of the fastest men ever to run the New York City Marathon; and Japhet, a poor, bucktoothed boy with unsuspected reservoirs of courage and raw speed. Amid the daily challenges of training and of raising a family abroad, Finn would learn invaluable lessons about running—and about life.Running with the Kenyans is more than one man’s pursuit of a lifelong dream. It’s a fascinating portrait of a magical country—and an extraordinary people seemingly born to run.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Audiobook",
    "Travel",
    "Memoir",
    "Africa",
    "Kenya"
  ],
  "author": "Adharanand Finn",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/51344744-running-with-the-kenyans"
}