{
  "title": "The Oric Trilogy: The Complete Series - Books 1-3",
  "description": "*** BGS Gold Mark Awarded Books ***  Yorkshire’s wild moorland and rugged coastline provide a hauntingly beautiful backdrop for this 13th century, medieval adventure trilogy.   Brought up and educated by an elderly alchemist, orphan boy Oric is content with his life. His happy situation comes to an abrupt and devastating end when a band of marauders sack his home. Oric returns to the manor after an early morning foraging errand, to find the house on fire, the inhabitants dead, and his mentor, Master Deveril, mortally wounded. The old man relinquishes a key, warning Oric that a terrible a disaster will surely occur if the key falls into wrong hands. Deveril also tells of great wealth, but he dies before he can impart any further information.  Evil moneylender, Esica Figg, is hiding behind a wall tapestry in the Great Hall. He hears the exchange between Deveril and Oric and determines to seize the key, even if means killing the boy to achieve his aim. Oric runs into the woods and Figg gives chase, but soon loses his prey amongst the trees and dense undergrowth.  Oric is taken in by Ichtheus, elderly apothecary to Sir Edred, Lord of Bayersby. The old man sets Oric on as an apprentice and a hilarious, heart-warming rivalry develops between the pair. Friendship between Oric and kitchen maid, Dian, turns into an uncomfortable love affair, and Oric wonders if their strained relationship will ever be resolved. Things are brought to a dramatic climax when Dian suddenly disappears.  So begins a rip-roaring series of cat and mouse adventures as Oric seeks to discover the true origins of his birth. Helped, but more often hindered by wolfhound, Parzifal, and recalcitrant donkey, Braccus, Oric, Ichtheus, and Dian face many life-threatening situations as they struggle to resolve the riddle of Deveril’s mysterious key.  A cast of eccentric characters, both good and evil, add charm, intrigue and fear to this medieval adventure series for young adults and young at heart.",
  "genres": [],
  "author": "Lesley  Wilson",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/51349075-the-oric-trilogy"
}