{
  "title": "A Practical Way to Get Rich . . . and Die Trying: A Memoir About Risking It All",
  "description": "\"A scathingly honest memoir of entrepreneurship's dark reality... I would advise every entrepreneur--or anyone who dreams of becoming one--to read this book.\"--Eric Schurenberg - CEO, Fast Company and Inc.A young tech entrepreneur's memoir of building his hugely successful company and the mental and physical price he paid for itAt the age of twenty-six, John Roa was an aspiring but struggling entrepreneur. He was broke, racking up debt, and ready to give up on his dream of being self-made. In a final effort, he founded the design firm ÄKTA, which quickly became one of the fastest growing startups in America, and just five years later, he sold it for a fortune to Salesforce, the largest company in San Francisco.This is his account of rising from a self-described below-average student to becoming a poster boy for the successful young entrepreneur, while nearly destroying himself in the process. His journey is an absurd, twisting, and often comical story of talent, luck, rapidly changing technology, larger-than-life personalities, sex, gambling, and excessive alcohol and drug consumption—which ultimately took their toll, resulting in a spectacular burnout that he almost didn’t survive. As he healed in the aftermath, he began to question the ethos that had brought him to that dark place, and over time, came to realize how common these debilitating issues are in entrepreneurship, even if they are rarely discussed openly.Rather than another glamorous rags-to-riches saga, A Practical Way to Get Rich . . . and Die Trying is a cautionary and deeply honest memoir about the price of success for ambitious young people, who are so often unprepared for the adversity, mental health issues, and abuse that can come along with “making it.” It also serves as the foundation for a campaign of honesty and vulnerability, in an industry that currently lacks both.",
  "genres": [
    "Business",
    "Biography Memoir",
    "Nonfiction",
    "Memoir",
    "Entrepreneurship"
  ],
  "author": "John Roa",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/51375719-a-practical-way-to-get-rich-and-die-trying"
}