{
  "title": "Leading Change",
  "description": "What will it take to bring your organization successfully into the twenty-first century? The world's foremost expert on business leadership distills twenty-five years of experience and wisdom based on lessons he has learned from scores of organizations and businesses to write this visionary guide. The result is a very personal book that is at once inspiring, clear-headed, and filled with important implications for the future. The pressures on organizations to change will only increase over the next decades. Yet the methods managers have used in the attempt to transform their companies into stronger competitors -- total quality management, reengineering, right sizing, restructuring, cultural change, and turnarounds -- routinely fall short, says Kotter, because they fail to alter behavior. Emphasizing again and again the critical need for leadership to make change happen, Leading Change provides the vicarious experience and positive role models for leaders to emulate. The book identifies an eight-step process that every company must go through to acheive its goal, and shows where and how people -- good people -- often derail. Reading this highly personal book is like spending a day with John Kotter. It reveals what he has seen, heard, experienced, and concluded in many years of working with companies to create lasting transformation. The book is an inspirational yet practical resource for everyone who has a stake in orchestrating changes in their organization. In Leading Change we have unprecedented access to our generation's master of leadership. Abbbout the John P. Kotter is the Konosuke Matsushita Professor of Leadership, Emeritus at Harvard Business School and is a frequent speaker at top management meetings around the world",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Management",
    "Buisness",
    "Personal Development",
    "Audiobook"
  ],
  "author": "John P. Kotter",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/51370.Leading_Change"
}