{
  "title": "Burning the Books: A History of the Deliberate Destruction of Knowledge",
  "description": "The director of the famed Bodleian Libraries at Oxford narrates the global history of the willful destruction—and surprising survival—of recorded knowledge over the past three millennia.Libraries and archives have been attacked since ancient times but have been especially threatened in the modern era. Today the knowledge they safeguard faces purposeful destruction and willful neglect; deprived of funding, libraries are fighting for their very existence. Burning the Books recounts the history that brought us to this point.Richard Ovenden describes the deliberate destruction of knowledge held in libraries and archives from ancient Alexandria to contemporary Sarajevo, from smashed Assyrian tablets in Iraq to the destroyed immigration documents of the United Kingdom’s Windrush generation. He examines both the motivations for these acts—political, religious, and cultural—and the broader themes that shape this history. He also looks at attempts to prevent and mitigate attacks on knowledge, exploring the efforts of librarians and archivists to preserve information, often risking their own lives in the process.More than simply repositories for knowledge, libraries and archives inspire and inform citizens. In preserving notions of statehood recorded in such historical documents as the Declaration of Independence, libraries support the state itself. By preserving records of citizenship and records of the rights of citizens as enshrined in legal documents such as the Magna Carta and the decisions of the United States Supreme Court, they support the rule of law. In Burning the Books, Ovenden takes a polemical stance on the social and political importance of the conservation and protection of knowledge, challenging governments in particular, but also society as a whole, to improve public policy and funding for these essential institutions.",
  "genres": [
    "History",
    "Nonfiction",
    "Books About Books",
    "Politics",
    "Philosophy",
    "Historical",
    "Librarianship"
  ],
  "author": "Richard Ovenden",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/51342996-burning-the-books"
}