{
  "title": "Doctor Heartbreaker",
  "description": "The nurses call me Dr. Heartbreaker. They say I put the hot in hot-shot cardiologist.Not that it matters. I never stick my tongue depressor in my co-workers.What can I say? I play by a set of personal rules.Even if those rules eliminate 99.9% of the woman I come in contact with from my dating-pool.Even if those rules land me on a blind date with Emily, my childhood sweetheart, a woman I hadn’t seen since I broke her heart freshmen year of college.Let’s just say the evening was a disaster. She took one look at me, and it was…Date over. Do not pass go. Do not collect your two-hundred dollars.The thing is, I can’t stop thinking about her. She was my first kiss, and every other first that two people can share.She’s the only woman I’ve ever loved.How can I make her understand what really happened between us when she wants nothing to do with me?How can I let her walk away again, when it could mean another ten years wondering…what if?The answer’s simple. I can’t.Unfortunately, the solution to my dilemma is a five-year-old Colombian girl with a deadly heart condition. The same little girl Emily’s non-profit organization brought to the United States to receive life-saving surgery.When the chief of staff informs me, I need to improve my public image because my bedside manner sucks--not THAT bedside manner. I’m just fine between the sheets, thank you very much—I agree to perform the girl’s operation… Because spending more time with Emily is worth the risk.Even if it means I have to break every rule in my playbook.Even if it means destroying myself in the process.I may be a sap, but I’ll do anything for a second chance with the woman who’s owned my heart since the fourth-grade.",
  "genres": [
    "Romance",
    "Second Chance",
    "Audiobook",
    "Contemporary",
    "Contemporary Romance",
    "Doctors",
    "Friends To Lovers"
  ],
  "author": "Kathryn M. Hearst",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/51340947-doctor-heartbreaker"
}