{
  "title": "The Rebels of Ireland",
  "description": "The reigning master of grand historical fiction returns with the stirring conclusion to his bestselling Dublin Saga.  The Princes of Ireland , the first volume of Edward Rutherfurd’s magisterial epic of Irish history, ended with the disastrous Irish revolt of 1534 and the disappearance of the sacred Staff of Saint Patrick. The Rebels of Ireland opens with an Ireland transformed; plantation, the final step in the centuries-long English conquest of Ireland, is the order of the day, and the subjugation of the native Irish Catholic population has begun in earnest.Edward Rutherfurd brings history to life through the tales of families whose fates rise and fall in each generation: Brothers who must choose between fidelity to their ancient faith or the security of their families; a wife whose passion for a charismatic Irish chieftain threatens her comfortable marriage to a prosperous merchant; a young scholar whose secret rebel sympathies are put to the test; men who risk their lives and their children’s fortunes in the tragic pursuit of freedom, and those determined to root them out forever. Rutherfurd spins the saga of Ireland’s 400-year path to independence in all its drama, tragedy, and glory through the stories of people from all strata of society--Protestant and Catholic, rich and poor, conniving and heroic. His richly detailed narrative brings to life watershed moments and events, from the time of plantation settlements to the “Flight of the Earls,” when the native aristocracy fled the island, to Cromwell’s suppression of the population and the imposition of the harsh anti-Catholic penal laws. He describes the hardships of ordinary people and the romantic, doomed attempt to overthrow the Protestant oppressors, which ended in defeat at the Battle of the Boyne in 1690, and the departure of the “Wild Geese.” In vivid tones Rutherfurd re-creates Grattan’s Parliament, Wolfe Tone's attempted French invasion of 1798, the tragic rising of Robert Emmet, the Catholic campaign of Daniel O’Connell, the catastrophic famine, the mass migration to America, and the glorious Irish Renaissance of Yeats and Joyce. And through the eyes of his characters, he captures the rise of Charles Stewart Parnell and the great Irish nationalists and the birth of an Ireland free of all ties to England. A tale of fierce battles, hot-blooded romances, and family and political intrigues, The Rebels of Ireland brings the story begun in The Princes of Ireland to a stunning conclusion.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Ireland",
    "Historical",
    "Irish Literature",
    "Audiobook",
    "Epic"
  ],
  "author": "Edward Rutherfurd",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/51433.The_Rebels_of_Ireland"
}