{
  "title": "My Lady Compelled",
  "description": "This is the first ebook in Shirl Anders continuing, 6 ebook, Erotic Regency romance series, the Archangels.Lady Gabriella St. John is purchased, from a scandalous \"wives sale,\" by her long-ago admirer and now ex-spy the Duke of Kitteridge. Lord Kitteridge intends to command and seduce his newly purchased lady away from her too strict English morals. In their first sortie together he extorts three wriggling climaxes from his, at first blush, reluctant lady.Erotic passions battle amidst adventure when Gabriella's husband returns trying to steal her back. Old secrets are revealed and launch the Archangels into a new mission to save Gabriella. Will the lady find the courage to risk it all for the passion of the man that she has always desired? Exciting sexual encounters with an adventurous story plot. HEA, m/f\"My Lady Compelled is a wonderful piece of erotic romance. I can’t wait to read the stories about the rest of the Archangels!\" Reviewed Shelley, Fallen Angels Reviews.Favorite Drummond lay his other palm in a stinging slap to her pearly white buttocks.Slap!\"Ohhh,\" Gabriella squealed in surprise, then huffing, \"beast,\" once again with less conviction.Slap! Slap!\"Oww,\" she gasped as Drummond watched Gabriella's lush buttocks jiggle with a new pink tint, staining the tender curves from the punishment of his hand. He fondled the pink flesh with his fingers, then he lifted his hand intending to spank her again.\"Drummond, no!\"Slap! Slap! Drummond spanked both wiggling buttocks.\"Please!\" she squealed.Slap! Slap! Gabriella's luscious, squirming ass was beginning to turn red.\"No more!\" Gabriella pleaded.Drummond paused, rubbing his hand over Gabriella's wriggling lush ass cheeks, feeling the heat of her skin on his palm from where he had stung the opulent flesh. \"Your cooperation, madame, or the punishment shall continue.\"\"How can you be so cruel?\" she asked, yelping a moment later when he slapped her pillowed rump once more.\"Ohh, I will do anything-!\" Gabriella cried.Slap! Slap! Slap!",
  "genres": [
    "Historical Romance",
    "Historical",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Regency",
    "Regency Romance"
  ],
  "author": "Shirl Anders",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/5139426-my-lady-compelled"
}