{
  "title": "Dr. Sebi: Complete Alkaline Diets & Herbs to Cure Herpes & HIV",
  "description": "Have you ever heard of Dr. Sebi?Are you battling with stubborn Herpes or deadly HIV?Have you been searching for Alkaline Cure without recurrence?If your response to all the above questions is capital YES! Then the perfect solutions provided to completely cure Herpes and HIV in this Dr. Sebi Alkaline Diets and Herbs Book are for you.Dr. Sebi was a wonderful Naturopath and Medicinal Alkaline diet and Herbs Specialist, who worked acidulously to provide absolute solutions to many depressive diseases which Herpes is one of them and life-threatening diseases which include Human Immunodeficiency Virus (HIV) through the use of therapeutic alkaline constituents.During his lifetime several sufferers suffered for herpes signs and symptoms like vaginal itch or blister, skin blister, rectum inflammation, painful urination, sore, severer muscular pain or itch at every infected site on the body; and also treated HIV were cured and came with an endless great testimony of his curative methodology.\nThe methodology involves detox, cleanser, vitamins, and biominerals fortify electric body from the cell level to systemic level; the various essential nutritious and related healthy Smoothie and Veggie to drink during the curing period with the use of amazing efficacious Dr. Sebi's Alkaline cure formulation that involves base bio-element components like Dandelion, Sarsaparilla, Irish Moss (Sea Moss), Sarsaparilla root ...etc.\nSome of the amazing therapeutic details you will learn in this Book are: Complete Dr. Sebi's Methodology for Herpes and HIVThe fundamental causes and precautionsDr. Sebi's approved medicinal alkaline diets HerpesDr. Sebi's approved alkaline herbal medicineDr. Sebi's detox, cleanser, fast and revitalization of the electric body...and many others.Now take a proactive step in receiving long-lasting healing by moving up and click on the \"BUY NOW\" button, to have your own copy of this DR. SEBI Cure FOR Herpes & HIV BOOK.",
  "genres": [],
  "author": "Ajeh G. Kotah",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/51409048-dr-sebi"
}