{
  "title": "The Royal Pain",
  "description": "In a world nearly identical to ours, the North won the Civil War, Ben and JLo got married, and everyone dresses well to attend the Grammys. Oh, and Russia never sold Alaska to the U.S. Instead, Alaska is a rough, beautiful country ruled by a famously eccentric royal family, including oldest daughter, Princess Alexandria, whose acid wit and bad case of insomnia have turned her into a tabloid darling, a palace problem, and overall... The Royal PainMarine biologist Dr. Shel (\"Never Sheldon\") Rivers has a problem. Some princess expects him to wait on her, hand and dimpled foot. His boss is taken with the royal redhead -- brunette, whatever, it's not like he keeps track of that stuff -- and nobody realizes that he just wants to be left alone in his lab. All alone. All the time. Weekends, holidays -- it's all good. Now here's Miss Royalpants, insisting that he escort her around the marine institute, explain what he s doing, kiss her until her toes curl -- no, wait, that was his idea. She's not even apologetic about being born into a royal family! Says it's his problem to overcome, not hers. Which leaves him with one option: to kiss her again. And again. And...So she's nothing like he expected. In fact, Dr. Rivers can see that this fantastic, exasperating woman has problems no princess should ever have to deal with. And he has an idea to help her get some much-needed sleep. Of course, it involves getting very, very tired beforehand, but if she's up to it, then so is he...In this delightfully madcap sequel to The Royal Treatment, the Baranov family is back and as unpredictable as ever, and a prickly princess and cranky Ph.D. are about to discover that love conquers attitude every time!",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary Romance",
    "Humor",
    "Fiction",
    "Contemporary",
    "Fantasy"
  ],
  "author": "MaryJanice Davidson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/514113.The_Royal_Pain"
}