{
  "title": "Rebel Fay",
  "description": "The Noble Dead Saga has been hailed as “fabulous entertainment wrought with mystery, adventure, and sharp-toothed wit.” * Now the “action-packed” ** adventures of Magiere and Leesil continue as they journey into the dangerous and mysterious Elven Territories...Desperate to free his mother from a caste of ruthless elven assassins, Leesil pushes on through the mountains at the height of a harsh winter. Obsession blinds him to reason, and he and his companions — his beloved Magiere, the sage Wynn, and their canine protector, Chap — find their lives at stake under the hardships of the wilderness. Should they survive, they still face the perils of the Elven Territories, a culture of tranquil beauty, savage customs, and deep-rooted hatred and fear of all humankind.Magiere was created with strange powers by a shadowy, long-forgotten enemy of many names — an enemy whom Leesil was trained from childhood to kill. Unbeknownst to them, Chap brought them together at the command of his kin, the Fay, to forge an alliance that might have the power to stand against the forces of dark magics.In the place of his birth, Chap must guard his companions from enemies and allies alike, though he is not always certain which is which. And as they uncover the truth, they discover just how close the enemy has always been...* Mark Anthony, author of The Last Rune series** Midwest Book Review\"...a hybrid crossing Tolkienesque fantasy with vampire-infused horror...\"    —Publisher's Weekly\"A real page-turner for Noble Dead series newcomers and veterans alike.\"    —Frieda Murray, Booklist: American Library Association.\"Fans of the Hendees' Noble Dead series who have been trying to understand the saga's many unexplained mysteries will be absolutely blown away by the bombshell plot twists revealed in Rebel Fay... Fantasy fans who like their adventures done very rare — fast and bloody &mdash: should definitely check out this addictively readable saga, which seamlessly blends the vampire mythos with high fantasy.\"    —Paul Goat Allen, The Barnes & Noble Review",
  "genres": [
    "Fantasy",
    "Vampires",
    "Fiction",
    "Dark Fantasy",
    "Paranormal",
    "Horror",
    "Science Fiction Fantasy"
  ],
  "author": "Barb Hendee",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/51429.Rebel_Fay"
}