{
  "title": "Bringing Down the House: The Inside Story of Six M.I.T. Students Who Took Vegas for Millions",
  "description": "It's Friday night and you're on a red-eye to the city of sin. Strapped to your chest is half a million dollars; in your overnight bag is another twenty-five thousand in blackjack chips; and your wallet holds ten fake IDs. As soon as you land in Las Vegas, you are positive you are being investigated and followed. To top it all off, the IRS is auditing you, someone has been going through your mail -- and you have a multivariable calculus exam on Monday morning. Welcome to the world of an exclusive group of audacious MIT math geniuses who legally took the casinos for over three million dollars -- while still finding time for college keg parties, football games, and final exams. In the midst of the go-go eighties and nineties, a group of overachieving, anarchistic MIT students joined a decades-old underground blackjack club dedicated to counting cards and beating the system at major casinos around the world. While their classmates were working long hours in labs and libraries, the blackjack team traveled weekly to Las Vegas and other glamorous gambling locales, with hundreds of thousands of dollars duct-taped to their bodies. Underwritten by shady investors they would never meet, these kids bet fifty thousand dollars a hand, enjoyed VIP suites and other upscale treats, and partied with showgirls and celebrities. Handpicked by an eccentric mastermind -- a former MIT professor and an obsessive player who had developed a unique system of verbal cues, body signals, and role-playing -- this one ring of card savants earned more than three million dollars from corporate Vegas, making them the object of the casinos' wrath and eventually targets of revenge. Here is their inside story, revealing their secrets for the first time. Master storyteller Ben Mezrich takes you from the ivory towers of academia to the Technicolor world of Las Vegas, where anything can happen -- and often does. Bringing Down the House launches you into the seedy underworld of corporate Vegas -- deep into the realm of back rooms, ever-present video cameras, private investigators, and the threats and tactics of pit bosses and violent heavies. Equipped with twenty different aliases and disguises, the group of young card counters struggles around these roadblocks to live the high life -- until one fateful day when Vegas violently follows them home to Boston. Suddenly, there can be no more hiding behind false identities; the high life folds like a bad hand of cards. Filled with tense action and incredibly close calls, Bringing Down the House is a real-life mix of Liar's Poker and Ocean's Eleven -- and it's a story Vegas doesn't want you to read.",
  "genres": [
    "Nonfiction",
    "Biography",
    "True Crime",
    "Memoir",
    "Crime",
    "History",
    "Sports"
  ],
  "author": "Ben Mezrich",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/514313.Bringing_Down_the_House"
}