{
  "title": "Witching For Grace",
  "description": "A Paranormal Women's Fiction with a bit of class, and a lot of sass, for anyone who feels like age is just a number!  Welcome to Premonition Pointe, where witches take care of their own.  Grace Valentine had the perfect marriage and a great career managing her husband’s real estate office. Or so she thought until three months ago when she was served with divorce papers. Thanks to her philandering ex, not only is she out of a husband, she’s out of a job, too.  At the age of forty-five with the help of her coven, Grace is ready to pick up the pieces and move on. But her only job prospect is at the rival real estate office, and it’s only for a trial run. She’ll need to prove that she can sell the haunted properties of Premonition Pointe before she’s hired permanently.  But who has time to deal with haunted houses when she’s testing out every anti-perspirant on the market to combat her escalating hot flashes, trying not to succumb to the advances of the hot thirty-four-year-old in her office, and ignoring the urges to hex her ex with erectile disfunction? Okay, maybe she doesn’t ignore the urges. She might be a witch, but she’s only human. Can Grace prove to herself and her new boss she has the magical touch to sell the impossible and find the courage get her groove back… even if her new love interest is a decade younger?  *** Looking for more books in this HOT FLASH of a new genre?  Check out these books available February 18/2020:  Denise Grover Swank \"Let it all Burn\"  KF Breene \"Magical Midlife Madness\"  Eve Langlais \"Halfway There\"  Robyn Peterman \"It's a Wonderful Midlife Crisis\"  Shannon Mayer \"Grave Magic Bounty\"  Jana DeLeon \"Wrong Side of Forty\"  Deanna Chase \"Witching For Grace\"  Kristen Painter \"Sucks to be Me\"  Elizabeth Hunter \"Suddenly Psychic\"  Michelle M Pillow \"Second Chance Magic\"  Mandy M Roth \"Cloudy With a Chance of Witchcraft\"  Darynda Jones \"Betwixt\"  Christine Gael \"Writing Wrongs\"",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Romance",
    "Witches",
    "Paranormal Romance",
    "Magic",
    "Urban Fantasy"
  ],
  "author": "Deanna Chase",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/51419807-witching-for-grace"
}