{
  "title": "Escorpio odia a Virgo",
  "description": "Escorpio odia a Virgo. O, al menos, eso pretende hacernos creer.Percy Freedman, un escorpio sarcástico y apasionado, es buenísimo lanzando pullas. Sobre todo si están dirigidas a su vecino de enfrente. Porque, por muy bueno que esté —y lo está, para desgracia de Percy—, es su némesis y así ha sido siempre.  Callaghan Glover, un virgo sensato y supertrabajador, parece encantado de devolverle todas y cada una de esas pullas. Pero cuando Percy empieza a preparar la casa de su tía para venderla, sus vecinos del cul-de-sac dejan más que claro que no quieren que se vaya. Incluso el citado némesis. Sobre todo, el citado némesis. Y, ahora, todas esas pullas parecen ir cargadas de ese tipo de tensión que te hace estremecer de pies a cabeza y…, por increíble que parezca, Percy se ha hecho adicto a ellas.Pero Callaghan es hetero, ¿no?El cabezota de escorpio necesitará la calidez de virgo para descubrir cómo son las cosas en realidad. Escorpio odia a Virgo es el segundo libro de los Signos de amor, una historia de amor que se cuece a fuego lento, llena de sarcasmo, entre dos vecinos que dicen odiarse. Un romance gay chico-chico con muchas conversaciones sobre dinosaurios y un final de lo más sexi. Todos los libros de la serie Signos de amor son autoconclusivos y pueden leerse de forma independiente.LEO QUIERE A ARIES (bisexualidad recién descubierta, friends-to-lovers, con un protagonista la hostia de despistado)ESCORPIO ODIA A VIRGO (enamorado de mi vecino, un enemies-to-lovers que no se creen ni ellos, confusión de identidad)GÉMINIS SE QUEDA CON CAPRICORNIO (falso noviazgo, friends-to-lovers, amor prohibido) PISCIS PESCA A TAURO (matrimonio de conveniencia, polos opuestos que se atraen, diferencia de edad) CÁNCER SE EMBARCA CON ACUARIO (niñero/canguro, viudo, polos opuestos que se atraen)",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Friends To Lovers",
    "Enemies To Lovers",
    "LGBT",
    "New Adult"
  ],
  "author": "Anyta Sunday",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/51429462-escorpio-odia-a-virgo"
}