{
  "title": "Elton John (Volume 50)",
  "description": "In this momentous 50th book in the critically acclaimed, multimillion-copy best-selling Little People, BIG DREAMS series, discover the life of Elton John, the piano wizard who rocketed to stardom with his music. As a child, Elton started playing his grandmother's piano in Harrow, London. He could pick tunes out by ear and was soon attending lessons at the Royal Academy. After answering an advertisement in a newspaper, Elton teamed up with a lyric-writing buddy: Bernie Taupin. The rest was history. Elton's songwriting talent, musical skill, and dazzling outfits have made him one of the all-time greats. This moving book features stylish and quirky illustrations and extra facts at the back, including a biographical timeline with historical photos and a detailed profile of the musician's life.Little People, BIG DREAMS is a best-selling series of books and educational games that explore the lives of outstanding people, from designers and artists to scientists and activists. All of them achieved incredible things, yet each began life as a child with a dream. This empowering series offers inspiring messages to children of all ages, in a range of formats. The board books are told in simple sentences, perfect for reading aloud to babies and toddlers. The hardcover versions present expanded stories for beginning readers. Boxed gift sets allow you to collect a selection of the books by theme. Paper dolls, learning cards, matching games, and other fun learning tools provide even more ways to make the lives of these role models accessible to children.Inspire the next generation of outstanding people who will change the world with Little People, BIG DREAMS!",
  "genres": [
    "Picture Books",
    "Nonfiction",
    "Biography",
    "Music",
    "Childrens",
    "LGBT",
    "Biography Memoir"
  ],
  "author": "Mª Isabel Sánchez Vegara",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/51475640-elton-john-volume-50"
}