{
  "title": "Joker One: A Marine Platoon's Story of Courage, Leadership, and Brotherhood",
  "description": "After graduating from Princeton, Donovan Campbell, motivated by his unwavering patriotism and commitment, decided to join the service, realizing that becoming a Marine officer would allow him to give back to his country, engage in the world, and learn to lead. In this immediate, thrilling, and inspiring memoir, Campbell recounts a timeless and transcendent tale of brotherhood, courage, and sacrifice.As commander of a forty-man infantry platoon called Joker One, Campbell had just months to train and transform a ragtag group of brand-new Marines into a first-rate cohesive fighting unit, men who would become his family: Sergeant Leza, the house intellectual who read Che Guevara; Sergeant Mariano Noriel, the “Filipino ball of fire” who would become Campbell’s closest confidant and friend; Lance Corporal William Feldmeir, a narcoleptic who fell asleep during battle; and a lieutenant known simply as “the Ox,” whose stubborn aggressiveness would be more curse than blessing. Campbell and his men were assigned to Ramadi, that capital of the Sunni-dominated Anbar province that was an explosion just waiting to happen. And when it did happen–with the chilling cries of “Jihad, Jihad, Jihad!” echoing from minaret to minaret–Campbell and company were there to protect the innocent, battle the insurgents, and pick up the pieces. After seven months of day-to-day, house-to-house combat, nearly half of Campbell’s platoon had been wounded, a casualty rate that went beyond that of any Marine or Army unit since Vietnam. Yet unlike Fallujah, Ramadi never fell to the enemy.Told by the man who led the unit of hard-pressed Marines, Joker One is a gripping tale of a leadership, loyalty, faith, and camaraderie throughout the best and worst of times.",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "History",
    "War",
    "Military History",
    "Memoir",
    "Biography"
  ],
  "author": "Donovan Campbell",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/5146351-joker-one"
}