{
  "title": "Serving Mr. Chamberlain",
  "description": "An MM Service-Oriented BDSM Romance It was so cliché it hurt.    Quentin Davis never expected to crush on his new boss, his new straight boss. It was just that Mr. Chamberlain was everything he’d ever wanted in a man. He was handsome with a quick wit, a dominant attitude, and piercing, gray eyes that could cut you with a look. What wasn’t there to like?  It would never work.    Nolan Chamberlain finds his new secretary a little too tempting. Sometimes, Quentin is all he can think about. With one best friend heavily entrenched in the BDSM lifestyle and the other recently finding happiness in an alternative relationship, Nolan decides it’s his turn—which means leaving his painfully polite, vanilla, sexy secretary alone.  An accidental encounter.   During his first night out with his friends at the local BDSM club, Nolan locks eyes with the impossible. Quentin dressed in nothing but a few scraps of lace, combat boots, and gold highlighter serving the crowded room. And not because he works there, but because he likes it. Maybe Quentin isn’t so off-limits after all.  WARNING: This book is intended for Adult (18+) readers. This book features service-oriented BDSM. I understand this kind of content is not for everyone. If this is not your cup of tea, feel free to skip this book. I try to write all the books so that they can be read and understood as stand-alone stories. However, reading them all together will create a more complete and rich experience as past characters can and will make surprise appearances.   ~61k words  Story Contains: MM Sexual Content, Service-Oriented BDSM, Kink, Power Exchange Relationships, Bondage, Fast Feelings, Sweetness Overload, Happily Ever Afters, and Some Angst in Relation to Family Dynamics.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Contemporary",
    "Romance",
    "LGBT",
    "Gay",
    "Contemporary Romance"
  ],
  "author": "Izaia Winter",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/51450018-serving-mr-chamberlain"
}