{
  "title": "Zenith: The Science, History and Mythology of the Northern Lights",
  "description": "#1 New Release on Amazon (Arctic and Antarctic History, Feb. 2020)#1 New Release on Amazon (History of Astronomy, Feb. 2020)\"An astounding tale that showcases humankind's desire to cure curiosity and understand the heavens.\"- Glossop Chronicle\"A must-read for anybody eager to learn more about this astonishing wonder of the world.\"- Around Saddleworth and Tameside Magazine ***In the year 28,000BC an enraptured caveman witnessed the Northern Lights for the first time in documented history. From that moment forth, a worldwide obsession was born. Have you ever wondered about the Northern Lights? Pondered what they are and where they come from? Well, you’ll be happy to hear you’re in good company, as many people have asked exactly the same questions throughout history. From scruffy French cavemen to Aristotle, and from some of the world’s most audacious scientists to the Vikings and Arctic tribes, these questions have set imaginations alight for tens of thousands of years giving birth to theories, facts, and ideas that stretch the imagination to the ends of the Earth.Explorers have sought their source, scientists questioned their beginnings, and philosophers contemplated their meaning. Even today, some people fear them, others worship them, and many travel thousands of miles to catch a glimpse of their enthralling beauty. This is the book of that obsession. This is the story of the Northern Lights from beginning to end. Who saw them first? What did they say? And how did the myths they created stand the test of time? But, after the invention of science the questions started to change: how were they formed? Where did they come from? And what effect did they have upon Earth and its inhabitants? Should we be concerned?Zenith answers all the above whilst seamlessly intertwining ancient mythology, Arctic exploration, and scientific endeavour, into an enthralling, exhilarating, and inspiring read. It’s light-hearted, edifying, and sure to satisfy your need for escapism. This is the Northern Lights as you’ve never seen them before.",
  "genres": [
    "Nonfiction",
    "Science"
  ],
  "author": "Liam Devonport",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/51458165-zenith"
}