{
  "title": "Temptation",
  "description": "Colton Davidson knew what his life was supposed to be like. Sports after school, Church on Sundays, meet a nice girl someday, get married, have children. He knew that his attraction to the other boys was nothing more than God testing him. He knew that if he just kept to his faith, he’d overcome the temptation of sin. If only he were stronger…  After being sent to a camp to fix boys like him, Colton knew his only chance for survival was to run. He didn’t know where the streets would take him, and he certainly didn’t think he’d end up at a place like Ted House, where boys like him were nurtured and cared for. Colton never thought he would amount to much, but Sage and Derek Osbourne never let him believe otherwise. And it was with a place he could call home that Colton let himself believe he had a future. If only that future involved the ridiculously attractive, much older man who just breezed into Fairfield. At nineteen, Colton knows he’s young, and he knows his life isn’t easy, but he also knows what he wants. If only Marcel would trust him to make those decisions. He’s ready to be with someone, to lose his virginity, to fall in love. He just needs that someone to trust him.  Marcel Tremblay’s life has been a strange juxtaposition of privilege and struggle. His wealthy parents in their nomadic lifestyle ensured that Marcel and his twin brother would want for nothing. But being born legally blind also meant that Marcel was under pressure from both his parents and society to perform far above average to prove his worth.  Marcel has never wanted anything more than average. A husband, a simple job, a house with a picket fence, and maybe a dog. All of that seems so far out of his reach, though, when in spite of how hard he works, he’s rarely given a chance to be just like everyone else. Marcel resigned himself to his part-time job as a yoga instructor, and his inattentive boyfriend in their relationship which has a very clear expiration date. But when Brad suggests relocating a thousand miles away in Fairfield, Colorado, Marcel sees it as a chance for something new. What he doesn’t expect is for his entire life to blow up in a matter of weeks. Marcel goes out for a drink to forget, and walks away with an attachment to a younger man who has no business wanting to be with someone as messy as Marcel. Colton insists he knows what he’s getting into, but Marcel likes him far too much to subject him to all the ways Marcel’s life will hurt him—whether he wants it to or not.  Will the two men find a way to come together, or will Marcel let his assumptions of what will be eclipse the joy and bliss of what could?  Temptation is the second book in the Breaking the Rules series, an Irons and Works spin-off. This book contains no cheating with an HEA.",
  "genres": [
    "M M Romance",
    "Romance",
    "Disability",
    "Contemporary",
    "LGBT",
    "Queer",
    "Abuse"
  ],
  "author": "E.M. Lindsey",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/51456283-temptation"
}