{
  "title": "Deep Time Reckoning: How Future Thinking Can Help Earth Now",
  "description": "A guide to long-term thinking: how to envision the far future of Earth.We live on a planet careening toward environmental collapse that will be largely brought about by our own actions. And yet we struggle to grasp the scale of the crisis, barely able to imagine the effects of climate change just ten years from now, let alone the multi-millennial timescales of Earth's past and future life span. In this book, Vincent Ialenti offers a guide for envisioning the planet's far future—to become, as he terms it, more skilled deep time reckoners. The challenge, he says, is to learn to inhabit a longer now.Ialenti takes on two overlapping crises: the Anthropocene, our current moment of human-caused environmental transformation; and the deflation of expertise—today's popular mockery and institutional erosion of expert authority. The second crisis, he argues, is worsening the effects of the first. Hearing out scientific experts who study a wider time span than a Facebook timeline is key to tackling our planet's emergency. Astrophysicists, geologists, historians, evolutionary biologists, climatologists, archaeologists, and others can teach us the art of long-termism.For a case study in long-term thinking, Ialenti turns to Finland's nuclear waste repository “Safety Case” experts. These scientists forecast far future glaciations, climate changes, earthquakes, and more, over the coming tens of thousands—or even hundreds of thousands or millions—of years. They are not pop culture “futurists” but data-driven, disciplined technical experts, using the power of patterns to construct detailed scenarios and quantitative models of the far future. This is the kind of time literacy we need if we are to survive the Anthropocene.",
  "genres": [
    "Nonfiction",
    "Climate Change",
    "Environment",
    "Science",
    "Philosophy",
    "Futurism",
    "Sociology"
  ],
  "author": "Vincent Ialenti",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/51456673-deep-time-reckoning"
}