{
  "title": "The Mist Rises Over Notchey Creek: A Harley Henrickson Mystery",
  "description": "In book one of the Harley Henrickson Cozy Mystery series, whiskey distiller Harley Henrickson's life is upended when a famous rock star moves to town and murders start occurring.  It's Halloween in Notchey Creek, Tennessee, and whiskey distiller Harley Henrickson is in the midst of preparations for the town's autumn harvest festival. Harley lives a quiet life of books and hard work, an introvert who is dismissed by many as the town nerd. Her life is changed when she and her best friend, Tina Rizchek discover a disoriented stranger in the ditch, mumbling about a lost boy who was \"innocent.\" When the man disappears into the woods, Harley is left with many unanswered questions. Who was the mysterious man, and what happened to the innocent boy?  As she digs deeper, she discovers the stranger, in reality, was no stranger at all, and had ties to many highly-esteemed citizens in town. When one of those citizens, a wealthy history professor, is murdered on Halloween night, Harley decides to investigate. What she discovers is a multitude of secrets, lies, and sins, dating back decades, and revolving around a handsome and brooding rock star who has chosen Notchey Creek as his new home.  In addition to sleuthing, other issues are causing problems for Harley. Professional football player-turned sheriff, Jed Turner, doesn't appreciate her interference in the murder investigation. The mayor and Chamber of Commerce president are convinced her pet pig, Matilda, is trying to ruin Pioneer Days. Her great-aunt, Wilma True--in between her hair emergencies--is on a mission to create matching festival outfits for Harley and her pig. And thanks to her great-uncle, Tater, she finds herself hauling a giant model cupcake, a pig, and an antique toilet in her truck--all in one week.  Filled with humor, heart-rending moments, and a cast of complex and eccentric characters, The Mist Rises Over Notchey Creek is sure to please cozy mystery fans and those who enjoy books about small-town life.  *Includes drink recipes!",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Crime",
    "Cozy"
  ],
  "author": "Liz S. Andrews",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/51449803-the-mist-rises-over-notchey-creek"
}