{
  "title": "The Summer of 1787: The Men Who Invented the Constitution",
  "description": "The successful creation of the Constitution is a suspense story. The Summer of 1787 takes us into the sweltering room in which delegates struggled for four months to produce the flawed but enduring document that would define the nation -- then and now.  George Washington presided, James Madison kept the notes, Benjamin Franklin offered wisdom and humor at crucial times. The Summer of 1787 traces the struggles within the Philadelphia Convention as the delegates hammered out the charter for the world's first constitutional democracy. Relying on the words of the delegates themselves to explore the Convention's sharp conflicts and hard bargaining, David O. Stewart lays out the passions and contradictions of the often painful process of writing the Constitution.  It was a desperate balancing act. Revolutionary principles required that the people have power, but could the people be trusted? Would a stronger central government leave room for the states? Would the small states accept a Congress in which seats were alloted according to population rather than to each sovereign state? And what of slavery? The supercharged debates over America's original sin led to the most creative and most disappointing political deals of the Convention.  The room was crowded with colorful and passionate characters, some known -- Alexander Hamilton, Gouverneur Morris, Edmund Randolph -- and others largely forgotten. At different points during that sultry summer, more than half of the delegates threatened to walk out, and some actually did, but Washington's quiet leadership and the delegates' inspired compromises held the Convention together.  In a country continually arguing over the document's original intent, it is fascinating to watch these powerful characters struggle toward consensus -- often reluctantly -- to write a flawed but living and breathing document that could evolve with the nation.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "American Revolution",
    "Politics",
    "Historical",
    "Law"
  ],
  "author": "David O. Stewart",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/514565.The_Summer_of_1787"
}