{
  "title": "The Last Eligible Bachelor",
  "description": "A ruse can only last so long…  Tillie Sherbrooke was born a lady, but lost her place in society by her father’s folly. Quiet, resourceful, and loyal, she now makes the perfect lady’s maid for her mistress Sophia. When Sophia's parents give her no choice but to travel across England to be matched with a mysterious young bachelor, Mr. Hill, she has no interest, especially since there are several other ladies vying for him. Who better to send in her place than Tillie? What gentleman would notice a maid, even one disguised as a lady? So when Sophia asks this favor of Tillie, or rather—threatens her into it, Tillie must rely on her past, the life of a proper lady, if she hopes to keep her position at Sedgwick Manor.  Disguised as her mistress, Tillie takes a coach across the country to a new place, one both unfamiliar and frightening. With so much at stake, she does all she can to stay quiet and invisible. But when she inadvertently catches Mr. Hill’s attention, she realizes she may have more to lose than her livelihood. She may very well lose her heart.  The Last Eligible Bachelor is a sweet/clean regency romance stand-alone novel, book two in the Seasons of Change series.  Other books in the series include:Book One: The Road Through Rushbury by Martha KeyesBook Two: A Forgiving Heart by Kasey Stockton Book Three: (Coming soon) The Last Eligible Bachelor by Ashtyn NewboldBook Four: (Coming soon) A Well-Trained Lady by Jess HeilemanBook Five: (Coming soon) from Deborah M. HathawayBook Six: (Coming soon) A Haunting at Havenwood from Sally BrittonBook Seven: (Coming soon) His Disinclined Bride from Jennie Goutet",
  "genres": [
    "Regency",
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Historical",
    "Clean Romance",
    "Regency Romance"
  ],
  "author": "Ashtyn Newbold",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/51476616-the-last-eligible-bachelor"
}