{
  "title": "GenderQueer:  A Story from a Different Closet",
  "description": "Derek is a girl. He wasn't one of the boys as a kid; he admired, befriended, and socialized with the girls and always knew he was one of them, despite being male. That wasn't always accepted or understood, but he didn't care: he knew who he was.Now he's a teenager and boys and girls are flirting and dating and his identity has become a lot more complicated: he's attracted to the girls. The other girls. The female ones.This is Derek's story, the story of a different kind of male hero — a genderqueer person's tale. The century's first decade saw many LGBT centers and services rebranding themselves as LGBTQ.The \"Q\" in LGBTQ is a new addition. It represents other forms of \"queer\" in an inclusive wave-of-the hand towards folks claiming to vary from conventional gender and orientation, such as genderqueer people. People who are affirmatively tolerant on gay, lesbian and transgender issues still ask \"Why do we need to add another letter to the acronym? Isn't anyone who isn't mainstream already covered by 'gay' or 'lesbian' or 'bisexual' or 'trans'? I'm all in favor of people having the right to call themselves whatever they want, but seriously, do we need this term?\"Derek's tale testifies to the real-life relevance of that \"Q\" - this is a genderqueer coming-of-age and coming-out story from an era long before genderqueer was trending.This story follows Derek from his debut as an 8th grader in Los Alamos NM until his unorthodox coming out at the age of 21 on University of New Mexico campus in Albuquerque.The author lived in New Mexico from 1973-1984 before emigrating to New York to become a gender activist. He received a degree in Women's Studies and graduate degrees in Sociology and Social Work and worked with psychiatric patients' rights groups and gender identity support groups before reaching an impasse with the graduate programs at SUNY / Stony Brook over their hostility towards radical feminist theory. He later worked as elder abuse case worker in the Bronx. His truncated academic career included publication of a short but groundbreaking theory piece, \"Same Door Different Closet: A Heterosexual Sissy's Coming-Out Party\" in a peer-reviewed journal, Feminism & Psychology.",
  "genres": [
    "Nonfiction",
    "LGBT",
    "Memoir",
    "Queer"
  ],
  "author": "Allan D. Hunter",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/51480656-genderqueer"
}