{
  "title": "Enemies of Doves",
  "description": "On a summer night in 1932, twelve-year-old Joel Fitchett wanders into an East Texas diner badly beaten and carrying his unconscious brother, Clancy. Though both boys claim they have no memory of what happened, the horrific details are etched into their minds as deep as the scar left across Joel's face.Thirteen years later, both men still struggle with the aftershocks of that long-ago night and the pact they made to hide the truth. When they find themselves at the center of a murder investigation, they make a decision that will change everything. A second lie, a second pact and for a time, a second chance.In 1991 college student, Garrison Stark, travels to Texas chasing a rumor that Clancy Fitchett is his biological grandfather. Though Clancy has been missing since 1946, Garrison plans to find him and discover the truth. But after unearthing sixty years of secrets, Garrison realizes the truth may be more than he bargained for.Told in alternating timelines from World War II to 1992, Enemies of Doves is a tale of family secrets, jealousy and deception perfect for fans of Kate Morton and Allen Eskens. \"Enemies of Doves weaves a timeline of events that makes for compelling reading. It's an ecological system of interlocking decisions, discoveries, and circumstances that spans some sixty years of love, danger, and revelations.\" -D. Donovan, Senior Reviewer, Midwest Book Review\"Some books are so easy to read, to fall into the words, that you lose track of time and sense of place. I fell easily into the world Shanessa Gluhm painted. Between snappy, witty banter, and intriguing mystery, I devoured Enemies of Doves in a single sitting.\" -Jennifer Silverwood, Author of The Borderlands Saga",
  "genres": [
    "Mystery",
    "Mystery Thriller",
    "Thriller",
    "Book Club",
    "Fiction",
    "Suspense",
    "Historical Fiction"
  ],
  "author": "Shanessa Gluhm",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/51494449-enemies-of-doves"
}