{
  "title": "Divergence",
  "description": "The twenty-first book in the beloved Foreigner saga continues the adventures of diplomat Bren Cameron, advisor to the atevi head of state.The overthrow of the atevi head of state, Tabini-aiji, and the several moves of enemies even since his restoration, have prompted major changes in the Assassins' Guild, which has since worked to root out its seditious elements—a clandestine group they call the Shadow Guild. With the Assassins now rid of internal corruption, with the birth of Tabini's second child, and with the appointment of an heir, stability seems to have returned to the atevi world. Humans and atevi share the space station in peaceful cooperation, humans and atevi share the planet as they have for centuries, and the humans' island enclave is preparing to welcome 5000 human refugees from a remote station now dismantled, and to do that in unprecedented cooperation with the atevi mainland. In general Bren Cameron, Tabini-aiji's personal representative, returning home to the atevi capital after securing that critical agreement, was ready to take a well-earned rest—until Tabini's grandmother claimed his services on a train trip to the smallest, most remote and least significant of the provinces, snowy Hasjuran—a move concerning which Tabini-aiji gave Bren a private instruction: protect her. Advise her. Advise her—perhaps. As for protection, she has a trainload of high-level Guild. But since the aiji-dowager has also invited a dangerously independent young warlord, Machigi, and a young man who may be the heir to Ajuri, a key northern province—the natural question is why the dowager is taking this ill-assorted pair to Hasjuran and what on this earth she may be up to.  With a Shadow Guild attack on the train station, it has become clear that others have questions, too. Hasjuran, on its mountain height, overlooks the Marid, a district that is part of the atevi nation only in name—a district in which Machigi is one major player, and where the Shadow Guild retains a major stronghold. Protect her? Ilisidi is hellbent on settling scores with the Shadow Guild, and her reasons for this trip and this company now become clear.  One human diplomat and his own bodyguard suddenly seem a very small force to defend her from what she is setting in motion.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Aliens",
    "Politics",
    "Speculative Fiction",
    "Fantasy"
  ],
  "author": "C.J. Cherryh",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/51479929-divergence"
}