{
  "title": "Fatal Infatuation",
  "description": "Shy Felicity never expected to attract the attention of a handsome young man... or a vampire, but if she can keep them both from killing each other she’ll need all the help she can get to navigate discoveries of desire; perils of zombies and vampires; and struggles with friendship, morality and...college.Cain is an elder vampire who displays quiet confidence even as he struggles to overcome sins of his past. Surprisingly, he found that in losing his life he gained his faith and a purpose. His find the hostile vampires that inhabit this small college town, and educate them to live in peace with humans. Their leader, Sindy, is a wicked temptress who has set her sights on Felicity's new friend Ben. She will be difficult to control, but after meeting Felicity, Cain's most difficult task lies in controlling himself.“You will get addicted to this series; it will keep you captivated and wanting more.” - Amy's Bookshelf Reviews“An emotional rollercoaster that should be read slowly and savored.” - Night Owl Reviews“The storyline captures your attention and keeps it. Melanie Nowak has a vision all her own, that is fun and enjoyable.” - ParanormalRomance.org“The characters keep developing before your eyes, and keep you guessing as to what is going to happen next.” - 2ReadOrNot2Read.com“I am officially making ALMOST HUMAN my must-read vampire series of the year! The story is excellent, and I am seriously impressed that the level has remained so consistently outstanding with each book. If you aren’t reading this series, you should be!” - NerdGirlOfficial.com*Please note - while there is no graphic sex in the first book, there is mature subject matter, and there are some graphic (but tasteful) sex scenes in subsequent books of the series.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Fiction",
    "Urban Fantasy",
    "Romance",
    "Fantasy"
  ],
  "author": "Melanie Nowak",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/5149967-fatal-infatuation"
}