{
  "title": "The Seven Epaulettes of Leadership",
  "description": "Shawn Abrams is the host of YouTube series, \"Next 5 Minutes with Shawn Abrams.\" He also serves as a member of Pace University - Lubin School of Business Executive Education Advisory Board. His book, The Seven Epaulettes of Leadership is a first of its kind. It effectively addresses and shines a light on the two areas of your life that can cost you the most. They are Leadership and Relationships. If you are leading people without the benefit of relationship, you could be bullying them, and if you are loving people without the benefit of relationship, you could be lonely. Most people will tell you they are a leader, but few people can define leadership. How can we maintain the integrity of it or even recognize it without being able to define it? More importantly, how can we teach it if we cannot define it? Your organization has multiple levels of people and there must be Continuity of Leadership through them. This represents an intangible ‘through line’ that your profits and productivity will follow because the people that work for you are affected by it. I do not lead with words. I coach my team with words, I mentor them with Statement challenges, and lead with compassion. In this book, you will learn how to employ Applied Leadership to coach and mentor people to reach their next level. In turn, they will help you to reach your next level. Establishing relationships with those we lead will keep them engaged with our vision long after the meeting has ended. Your vision of tomorrow is bigger than today, and the potential of you people is greater than their problems. You must believe this because aside from an extreme shortage of resources, the only reason teams fail is because of their leader. Know this, before you get people to change the way they think you must change the way you think. I will share that in detail with you. Finally, I cover Emotional Intelligence. Leadership skills and emotional intelligence parallel each other, but they are not the same. People are more inclined to follow relationships than a leader! If you can occupy both these spaces in someone’s life at the same time, you possess The Seven Epaulettes of Leadership.",
  "genres": [
    "Leadership"
  ],
  "author": "Shawn Abrams",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/51485110-the-seven-epaulettes-of-leadership"
}