{
  "title": "A Hacker, I Am",
  "description": "This book is not your normal cybersecurity book, it’s not meant to be read from front to back chapter by chapter, you open it up and pick which chapter piques your interest the most and read that one first. Then choose your next one and read that and continue the process until you have finally read all of them. You may have enjoyed them enough to go back and read your favourites again or you may prefer the last two fantasy chapters at the end of the book. These were created to introduce you to the future hacker fantasy series that is currently being written and give you my readers a bit of a fun finish to “A Hacker, I Am”. By all means though if you want to stick to the old fashioned method of reading a book, knock yourself out and read it from the front to the back, hey you bought the book you should be able to read it however you want too. This book is a collation of previous work, rewritten and adapted for this book. I have then written a lot of new content just for the book, including those fantasy book teasers which I hope you all enjoy. The book as you would have probably guessed it by now is all about Cyber Security but it’s not written to be overly technical, it’s written so that it can be understood by anyone who wants to learn more about how to better protect themselves. It covers many topics in cybersecurity including IoT, autonomous cars, hackers and many more that I have an opinion on. This book will be great at helping introduce individuals to the area and help them get a better understanding of what to look out for, what problems we are all going to face in the future but also have a bit of fun while we are at it. Or if you are already in the industry then it will be still an entertaining read that can help give you a different perspective on a few things. Buy the book you will like it but once you have read it leave a review so that everyone else that is considering the book, know they will love it as well. Maybe even tell me your thoughts on the hacker fantasy teasers, let me know if you want to read them. It will give me some encouragement to get on and finish writing them.",
  "genres": [],
  "author": "Craig  Ford",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/51503320-a-hacker-i-am"
}