{
  "title": "22 Minutes of Unconditional Love",
  "description": "A harrowing, compulsively readable novel about breaking free of sexual obsession\"No one found Howard Rose interesting, that is, but me.\" Judith is an ambitious book editor in her late twenties living and working in New York City. Inexperienced with romantic love, she works hard, sees a small group of friends, and visits Dr. Munch, her beloved therapist, on whom she is dependent. Three weeks after her therapist's death, Judith reluctantly attends a cocktail party. Her life changes the instant she meets Howard Rose, a charismatic and commanding lawyer thirteen years her senior with whom she becomes sexually obsessed.Swept off her feet, everything she does is now about Howard: He calls her at work, instructs her on what to wear to dinner, and takes control of her body and sexuality with complete ownership. Judith becomes dependent on the push-pull of their sexual entanglement and on Howard's attention and approval, convinced she's found the man of her dreams. Until, that is, she understands he's the man of her nightmares: hostile, reckless, and manipulative, he seems intent on obliterating any sense of self and autonomy that Judith possesses. Escaping Howard's grasp--and her own perverse enjoyment of being under his control--becomes her mission.Narrated by a Howard-free Judith years later, Daphne Merkin's Twenty-Two Minutes of Unconditional Lovecharts the persistent hold our pasts have on us. Stylistically varied and punctuated by provocative ruminations on love, family, sex, gender, and relationships, Twenty-Two Minutes of Unconditional Love is a psychologically voracious descent into sexual obsession, the story of the hazardous extent to which one woman will go to achieve erotic bliss, and of her resolve to reclaim her agency.",
  "genres": [
    "Fiction",
    "Romance",
    "Literary Fiction"
  ],
  "author": "Daphne Merkin",
  "average_rating": "2.74",
  "url": "https://www.goodreads.com/book/show/51542000-22-minutes-of-unconditional-love"
}