{
  "title": "The Quotable Runner: Great Moments of Wisdom, Inspiration, Wrongheadedness, and Humor",
  "description": "ContentsIntroductionThe Starting LineVoices from the Midpack (and Elsewhere)CoachesEat, Drink, But Be WaryTrainingFearRacingRecordsCross-CountryHillsIn the Footsteps of AtalantaThe MarathonThe MileMind Over MatterThe International RunnerPainThe OlympicsMedals and MoneyThe Finish RetirementVictories and DefeatsWho's WhoA few of our favorite \"Bid me run and I will strive with things impossible.\" —Shakespeare\"Long distance running is particularly good training in perseverance.\" —Chairman Mao\"Without ice cream there would be darkness and chaos.\" —Don Kardong\"Mental will is a muscle that needs exercise, like the muscles of the body.\" —Lynn Jennings\"If you want to win a race you have to go a little berserk.\" —Bill Rodgers\"Running is the greatest metaphor for life, because you get out of it what you put into it.\" —Oprah Winfrey \"The mile has all the elements of drama.\" —Roger Bannister\"Mind is everything. Muscle — pieces of rubber. All that I am, I am because of my mind.\" —Paavo Nurmi\"The will to win means nothing without the will to prepare.\" —Juma Ikangaa\"Start slowly, then taper off.\" —Walt Stack\"Records are made to be broken.\" —AnonymousIntroduction by Mark Will-WeberCompiling a book of quotations is a bit like prospecting. For long, unrewarded hours you sift through the silt, murk, and bottom mud which comprise the great body of sports literature and journalism—all for that rare nugget of gold.I began work on The Quotable Runner without actually realizing that I was doing it. (I highly recommend this method for any lengthy task if you can arrange it.) The first few hundred quotations that I gathered were used at the bottom of race results, in batches of five or six quotes per race, which I passed on to the cross-country runners at Moravian College in Bethlehem, Pennsylvania. As their coach, I thought it might be a fun way to jazz up the results sheets and inspire the runners to train with diligence and a new spark. Maybe a line from Zatopek, Nurmi, or Benoit would ignite a dre",
  "genres": [
    "Nonfiction",
    "Sports"
  ],
  "author": "Mark Will-Weber",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/5153154-the-quotable-runner"
}