{
  "title": "From What Is to What If: Unleashing the Power of Imagination to Create the Future We Want",
  "description": "The founder of the international Transition Towns movement asks why true creative, positive thinking is in decline, asserts that it’s more important now than ever, and suggests ways our communities can revive and reclaim it.In these times of deep division and deeper despair, if there is a consensus about anything in the world, it is that the future is going to be awful. There is an epidemic of loneliness, an epidemic of anxiety, a mental health crisis of vast proportions, especially among young people. There’s a rise in extremist movements and governments. Catastrophic climate change. Biodiversity loss. Food insecurity. The fracturing of ecosystems and communities beyond, it seems, repair. The future—to say nothing of the present—looks grim.But as Transition movement cofounder Rob Hopkins tells us, there is plenty of evidence that things can change, and cultures can change, rapidly, dramatically, and unexpectedly—for the better. He has seen it happen around the world and in his own town of Totnes, England, where the community is becoming its own housing developer, energy company, enterprise incubator, and local food network—with cascading benefits to the community that extend far beyond the projects themselves.We do have the capability to effect dramatic change, Hopkins argues, but we’re failing because we’ve largely allowed our most critical tool to languish: human imagination. As defined by social reformer John Dewey, imagination is the ability to look at things as if they could be otherwise. The ability, that is, to ask What if? And if there was ever a time when we needed that ability, it is now.Imagination is central to empathy, to creating better lives, to envisioning and then enacting a positive future. Yet imagination is also demonstrably in decline at precisely the moment when we need it most. In this passionate exploration, Hopkins asks why imagination is in decline, and what we must do to revive and reclaim it. Once we do, there is no end to what we might accomplish.From What Is to What If is a call to action to reclaim and unleash our collective imagination, told through the stories of individuals and communities around the world who are doing it now, as we speak, and witnessing often rapid and dramatic change for the better.source: https://www.chelseagreen.com/product/...",
  "genres": [
    "Nonfiction",
    "Environment",
    "Sustainability",
    "Climate Change",
    "Audiobook",
    "Politics",
    "Philosophy"
  ],
  "author": "Rob Hopkins",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/51525845-from-what-is-to-what-if"
}