{
  "title": "I Hold a Wolf by the Ears: Stories",
  "description": "An urgent and unsettling collection of women on the verge from Laura van den Berg, author of The Third Hotel\n\n\n\nI Hold a Wolf by the Ears, Laura van den Berg's first story collection since her acclaimed and prizewinning Isle of Youth, draws readers into a world of wholly original, sideways ghost stories that linger in the mouth and mind like rotten, fragrant fruit. Both timeless and urgent, these eleven stories confront misogyny, violence, and the impossible economics of America with van den Berg's trademark spiky humor and surreal eye. Moving from the peculiarities of Florida to liminal spaces of travel in Mexico City, Sicily, and Spain, I Hold a Wolf by the Ears is uncannily attuned to our current moment, and to the thoughts we reveal to no one but ourselves.In \"Lizards,\" a man mutes his wife's anxieties by giving her a La Croix-like seltzer laced with sedatives. In the title story, a woman poses as her more successful sister during a botched Italian holiday, a choice that brings about strange and violent consequences, while in \"Karolina,\" a woman discovers her prickly ex-sister-in-law in the aftermath of an earthquake and is forced to face the truth about her violent brother.I Hold a Wolf by the Ears presents a collection of women on the verge, trying to grasp what's left of life: grieving, divorced, and hyperaware, searching, vulnerable, and unhinged, they exist in a world that deviates from our own only when you look too close. With remarkable control and transcendent talent, van den Berg dissolves, in the words of the narrator of \"Slumberland,\" \"that border between magic and annihilation,\" and further establishes herself as a defining fiction writer of our time.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Horror",
    "Contemporary",
    "Fantasy",
    "Literary Fiction",
    "Book Club"
  ],
  "author": "Laura van den Berg",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/51540889-i-hold-a-wolf-by-the-ears"
}