{
  "title": "How God Found Me: Memoirs of an American Guru",
  "description": "“You got the wrong house, I’m Jewish.” With these words, Ma Jaya greeted Jesus Christ when he appeared in her home in Brooklyn. She ran away from him, but he came again, and he told her she must teach: “Teach all ways, for all ways are mine.”   She followed that instruction for the rest of her life. She became a leader in the Interfaith movement, meanwhile personally caring for many people affected by the AIDS epidemic. She was a fearless advocate for marginalized people, especially the LGBTQ community.  This long-awaited memoir leads us through Ma’s adventurous childhood under the Coney Island Boardwalk, her awakening as a spiritual guru, and her life of fearless love and devotion.   As an eight-year-old hanging out with homeless junkies and prostitutes under the Boardwalk, she learned to treat everyone with dignity, simply because “There are no throwaway people.”   By the time Christ appeared to her, she was living happily as a Brooklyn housewife. She wrote, “Before finding God, I had tasted the love of a husband and the love of my children. There was never a happier woman, but from the second I met the Christ I knew I had no joy whatsoever before. There was no comparison. It was worlds and worlds and worlds apart….From the very first intimate moments of God and me, when the fear was so great, I felt the joy of God. And nothing remained the same, for all the Earth became the joy of God.”  Ma’s evolution from housewife to guru was unpredictable, sometimes joyful, often terrifying. She wrote: “In India, yogis have experiences like this in the jungles, or they are initiated by their guru. Me, it happened driving on the Belt Parkway. And I had no idea what was happening.” Ma eventually came to know her Guru, Neem Karoli Baba, an Indian holy man who had left his body a year before. With Baba’s guidance, she began to share more and more., gradually moving from her bathroom temple to the world stage. She was funny and profane, sometimes controversial, often loud, sometimes silent, but always deeply caring. In her presence, many felt the essence of shakti, the feminine power of God the Mother.",
  "genres": [],
  "author": "Ma Jaya Sati Bhagavati",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/51533429-how-god-found-me"
}