{
  "title": "Austen Years: A Memoir in Five Novels",
  "description": "An astonishingly nuanced reading of Jane Austen that yields a rare understanding of how to live\"About seven years ago, not too long before our daughter was born, and a year before my father died, Jane Austen became my only author.\"In the turbulent period around the birth of her first child and the death of her father, Rachel Cohen turned to Jane Austen to make sense of her new reality. For Cohen, simultaneously grief-stricken and buoyed by the birth of her daughter, reading Austen became her refuge and her ballast. She was able to reckon with difficult questions about mourning, memorializing, living in a household, paying attention to the world, reading, writing, and imagining through Austen's novels.Austen Years is a deeply felt and sensitive examination of a writer's relationship to reading, and to her own family, winding together memoir, criticism, and biographical and historical material about Austen herself. And like the sequence of Austen's novels, the scope of Austen Years widens successively, with each chapter following one of Austen's novels. We begin with Cohen in Cambridge, Massachusetts, where she raises her small children and contemplates her father's last letter, a moment paired with the grief of Sense and Sensibility and the social bonds of Pride and Prejudice. Later, moving with her family to Chicago, Cohen grapples with her growing children, teaching, and her father's legacy, all refracted through the denser, more complex Mansfield Park and Emma.With unusual depth and fresh insight into Austen's life and literature, and guided by Austen's mournful and hopeful final novel, Persuasion, Rachel Cohen's Austen Years is a rare memoir of mourning and transcendence, a love letter to a literary master, and a powerful consideration of the odd process that merges our interior experiences with the world at large.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Books About Books",
    "Biography Memoir",
    "Biography",
    "Essays",
    "Audiobook"
  ],
  "author": "Rachel Cohen",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/51542554-austen-years"
}