{
  "title": "When a Flower Is Reborn: The Life and Times of a Mapuche Feminist",
  "description": "A pathbreaking contribution to Latin American testimonial literature, When a Flower Is Reborn is activist Rosa Isolde Reuque Paillalef’s chronicle of her leadership within the Mapuche indigenous rights movement in Chile. Part personal reflection and part political autobiography, it is also the story of Reuque’s rediscovery of her own Mapuche identity through her political and human rights activism over the past quarter century. The questions posed to Reuque by her editor and translator, the distinguished historian Florencia Mallon, are included in the text, revealing both a lively exchange between two feminist intellectuals and much about the crafting of the testimonial itself. In addition, several conversations involving Reuque’s family members provide a counterpoint to her story, illustrating the variety of ways identity is created and understood.A leading activist during the Pinochet dictatorship, Reuque—a woman, a Catholic, and a Christian Democrat—often felt like an outsider within the male-dominated, leftist Mapuche movement. This sense of herself as both participant and observer allows for Reuque’s trenchant, yet empathetic, critique of the Mapuche ethnic movement and of the policies regarding indigenous people implemented by Chile’s post-authoritarian government. After the 1990 transition to democratic rule, Reuque collaborated with the government in the creation of the Indigenous Development Corporation (CONADI) and the passage of the Indigenous Law of 1993. At the same time, her deepening critiques of sexism in Chilean society in general, and the Mapuche movement in particular, inspired her to found the first Mapuche feminist organization and participate in the 1996 International Women’s Conference in Beijing. Critical of the democratic government’s inability to effectively address indigenous demands, Reuque reflects on the history of Mapuche activism, including its disarray in the early 1990s and resurgence toward the end of the decade, and relates her hopes for the future.An important reinvention of the testimonial genre for Latin America’s post-authoritarian, post-revolutionary era, When a Flower Is Reborn will appeal to those interested in Latin America, race and ethnicity, indigenous people’s movements, women and gender, and oral history and ethnography.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Rosa Isolde Reuque Paillalef",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/1255416.When_a_Flower_Is_Reborn"
}