{
  "title": "The Vapors: A Southern Family, the New York Mob, and the Rise and Fall of Hot Springs, America's Forgotten Capital of Vice",
  "description": "The incredible true story of America's original—and forgotten—capital of viceBack in the days before Vegas was big, when the Mob was at its peak and neon lights were but a glimmer on the horizon, a little Southern town styled itself as a premier destination for the American leisure class. Hot Springs, Arkansas was home to healing waters, Art Deco splendor, and America’s original national park—as well as horse racing, nearly a dozen illegal casinos, countless backrooms and brothels, and some of the country’s most bald-faced criminals.Gangsters, gamblers, and gamines: all once flocked to America’s forgotten capital of vice, a place where small-town hustlers and bigtime high-rollers could make their fortunes, and hide from the law. The Vapors is the extraordinary story of three individuals—spanning the golden decades of Hot Springs, from the 1930s through the 1960s—and the lavish casino whose spectacular rise and fall would bring them together before blowing them apart.Hazel Hill was still a young girl when legendary mobster Owney Madden rolled into town in his convertible, fresh off a crime spree in New York. He quickly established himself as the gentleman Godfather of Hot Springs, cutting barroom deals and buying stakes in the clubs at which Hazel made her living—and drank away her sorrows. Owney’s protégé was Dane Harris, the son of a Cherokee bootlegger who rose through the town’s ranks to become Boss Gambler. It was his idea to build The Vapors, a pleasure palace more spectacular than any the town had ever seen, and an establishment to rival anything on the Vegas Strip or Broadway in sophistication and supercharged glamour.In this riveting work of forgotten history, native Arkansan David Hill plots the trajectory of everything from organized crime to America’s fraught racial past, examining how a town synonymous with white gangsters supported a burgeoning black middle class. He reveals how the louche underbelly of the South was also home to veterans hospitals and baseball’s spring training grounds, giving rise to everyone from Babe Ruth to President Bill Clinton. Infused with the sights and sounds of America’s entertainment heyday—jazz orchestras and auctioneers, slot machines and suited comedians—The Vapors is an arresting glimpse into a bygone era of American vice.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Crime",
    "American History",
    "Historical",
    "Biography"
  ],
  "author": "David           Hill",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/51542010-the-vapors"
}