{
  "title": "Scandinavian Noir: In Pursuit of a Mystery",
  "description": "An in-depth and personal exploration of Scandinavian crime fiction as a way into Scandinavian culture at largeFor nearly four decades, Wendy Lesser's primary source of information about three Scandinavian countries--Sweden, Norway, and Denmark--was mystery and crime novels, and the murders committed and solved in their pages. Having never visited the region, Lesser constructed a fictional Scandinavia of her own making, something between a map, a portrait, and a cultural history of a place that both exists and does not exist. Lesser's Scandinavia is disproportionately populated with police officers, but also with the stuff of everyday life, the likes of which are relayed in great detail in the novels she read: a fully realized world complete with its own traditions, customs, and, of course, people.Over the course of many years, Lesser's fictional Scandinavia grew more and more solidly visible to her, yet she never had a strong desire to visit the real countries that corresponded to the made-up ones. Until, she writes, \"between one day and the next, that no longer seemed sufficient.\" It was time to travel to Scandinavia.With vivid storytelling and an astonishing command of the literature, Wendy Lesser's Scandinavian Noir: In Pursuit of a Mystery illuminates the vast, peculiar world of Scandinavian noir--first as it appears on the page, then as it grows in her mind, and finally, in the summer of 2018, as it exists in reality. Guided by sharp criticism, evocative travel writing, and a whimsical need to discover \"the difference between existence and imagination, reality and dream,\" Scandinavian Noir is a thrilling and inventive literary adventure from a masterful writer and critic.",
  "genres": [
    "Nonfiction",
    "Mystery",
    "Books About Books",
    "Crime",
    "Travel",
    "History",
    "Literary Criticism"
  ],
  "author": "Wendy Lesser",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/51542618-scandinavian-noir"
}