{
  "title": "Owls of the Eastern Ice: A Quest to Find and Save the World's Largest Owl",
  "description": "A field scientist and conservationist tracks the elusive Blakiston's Fish Owl in the forbidding reaches of eastern Russia.I saw my first Blakiston’s fish owl in the Russian province of Primorye, a coastal talon of land hooking south into the belly of Northeast Asia . . . No scientist had seen a Blakiston’s fish owl so far south in a hundred years . . . When he was just a fledgling birdwatcher, Jonathan C. Slaght had a chance encounter with one of the most mysterious birds on Earth. Bigger than any owl he knew, it looked like a small bear with decorative feathers. He snapped a quick photo and shared it with experts. Soon he was on a five-year journey, searching for this enormous, enigmatic creature in the lush, remote forests of eastern Russia. That first sighting set his calling as a scientist.Despite a wingspan of six feet and a height of over two feet, the Blakiston’s fish owl is highly elusive. They are easiest to find in winter, when their tracks mark the snowy banks of the rivers where they feed. They are also endangered. And so, as Slaght and his devoted team set out to locate the owls, they aim to craft a conservation plan that helps ensure the species’ survival. This quest sends them on all-night monitoring missions in freezing tents, mad dashes across thawing rivers, and free-climbs up rotting trees to check nests for precious eggs. They use cutting-edge tracking technology and improvise ingenious traps. And all along, they must keep watch against a run-in with a bear or an Amur tiger. At the heart of Slaght’s story are the fish owls themselves: cunning hunters, devoted parents, singers of eerie duets, and survivors in a harsh and shrinking habitat.Through this rare glimpse into the everyday life of a field scientist and conservationist, Owls of the Eastern Ice testifies to the determination and creativity essential to scientific advancement and serves as a powerful reminder of the beauty, strength, and vulnerability of the natural world.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Science",
    "Birds",
    "Animals",
    "Russia",
    "Environment"
  ],
  "author": "Jonathan C. Slaght",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/51542211-owls-of-the-eastern-ice"
}