{
  "title": "Snowflakes over Moondance Cottage",
  "description": "When Jess Rigby lost her dad, the family coped in different ways, alone in their grief. Now, her mum seems to be going off the rails and her sister, Isla, who moved to France, is now back and determined to get the old family home on the market. But the last thing Jess wants this Christmas is for renovations to start on the house. It's sure to stir up old memories she's desperate to forget. And to make things worse, Isla seems to have hired the most obnoxious builder in the world to do the work. Jess could ignore the fact that women seem to be putty in his hands. But what she finds harder to ignore is the frisson she gets every time she squeezes past him in the mess that is now their beloved family home! Soon, the house begins to give up its secrets, some of them shocking. Can the family finally start talking and find a way to move on from the past this Christmas?  Rosie Green is the author of the much-loved, best-selling novellas in the LITTLE DUCK POND CAFE series. This is her first full-length Christmas book.  READERS HAVE COMPLETELY FALLEN IN LOVE with Rosie Green's LITTLE DUCK POND CAFE series:  'A heart-warming story and one to make your heart sing. The perfect book to get cosy on the sofa with and lose yourself . . . can't wait for the next instalment. Please, Rosie, do not stop writing about the girls and Sunnybrook!' - Zoe, Goodreads  'Worth waiting for! I have loved every one of the Little Duck Pond Cafe books and this was just as good' - Mrs T, Amazon  'A captivating read. Really reels you in and the characters are so believable. This author is so good at what she does. Roll on the next episode!' - Jules King, Amazon  'Loved this book! The author keeps you hooked with the storyline and characters you care about. Looking forward to the next instalment.' - Lesley T, Amazon  'A can't-put-it-down read. Another brilliant episode of these wonderful stories.' - Sue S, Amazon  'Another beautiful little book I couldn't put down. It's so lovely to return to the Little Duck Pond Cafe once again and catch up with all the friends there.' - Sue, Amazon  'Light-hearted, funny, with just enough tension. I really enjoyed this book, as I have with the whole series.' - Karen, Amazon  'Fabulous! What a great read - kept me hooked from start to finish. I love the visits to the Little Duck Pond Cafe and can't wait for the next book.' - Miss Leica Waldron, Amazon  'I love this series so much! And with this latest instalment, I'm in love with it and the inhabitants of Sunnybrook even more!' - Karen Mace, Amazon  'Each instalment is like visiting your best friends. It's such a delightful series, with stories that are light and dark, full of the highs and lows of life and love in a glorious village in the English countryside. As always, author Rosie Green injects much warmth and charm within the storyline and you feel very much involved in village life. I hope the author continues to revisit the Little Duck Pond Cafe as I feel she has so much more to give to her readers.' - Adele, Amazon",
  "genres": [
    "Christmas",
    "Holiday",
    "Romance",
    "Fiction"
  ],
  "author": "Rosie Green",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/51554632-snowflakes-over-moondance-cottage"
}