{
  "title": "Natural History",
  "description": "From Carlos Fonseca comes a dazzling, kaleidoscopic epic of art, politics, and hidden realitiesJust before the dawn of the new millennium, a curator at a New Jersey museum of natural history receives an unusual invitation from a celebrated fashion designer. She shares the curator's fascination with the hidden forms of the animal kingdom--with camouflage and subterfuge--and she proposes that they collaborate on an exhibition, the form of which itself remains largely obscure, even as they enter into a strange relationship marked by evasion and elision.Seven years later, after the death of the designer, the curator recovers the archive of their never-completed project. During a long night of insomnia, he finds within the archive a series of clues to the true story of the designer's family, a mind-bending puzzle that winds from Haifa, Israel, to bohemian 1970s New York to the Latin American jungle. On the way, he discovers a cast of characters whose own fixations interrogate the unstable frontiers between art, science, politics, and religion: an aging photographer, living nearly alone in an abandoned mining town where subterranean fires rage without end, who creates models of ruined cities; a former model turned conceptual artist--and a defendant in a trial over the very nature and purpose of art; a young indigenous boy who has received a vision of the end of the world. Reality is a curtain, as the curator realizes, and to draw it back is to reveal the theater of obsession.Natural History is the portrait of a world trapped between faith and irony, between tragedy and farce. A defiantly contemporary and impressively ambitious novel in the tradition of Italo Calvino and Ricardo Piglia, it confirms Carlos Fonseca as one of the most daring writers of his generation.",
  "genres": [
    "Fiction",
    "Art",
    "Literary Fiction",
    "Contemporary",
    "Novels",
    "Mystery",
    "Literature"
  ],
  "author": "Carlos  Fonseca",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/51542633-natural-history"
}