{
  "title": "The Fifth Revolution: Reinventing Workplace Happiness, Health, and Engagement Through Compassion",
  "description": "The Fifth Revolution: Reinventing Workplace Happiness, Health, and Engagement Through Compassion is an invitation to rediscover the power of human consciousness both in and out of the workplace. Readers will gain a deep understanding of what compassion means and will explore compassion skills to incorporate into their lives as individuals, influencers and leaders. The book shows how to practically apply the 9-pillars of workplace compassion - self-compassion, people-first thinking, abundance mindset, mindfulness, embracing oneness, compassionate communication, vulnerability, big-picture thinking and gratitude - to create meaningful shifts toward happiness, kindness and empowered living.The Fifth Revolution shows you- Why compassion is the key to creating amazing workplace experiences- How the 9-Pillars can transform your inner world and your work relationships- How you can influence and direct your company's culture through compassion- How you can help your company become a force of good- How compassionate workplaces are the foundations of a fifth industrial revolution- one that is powered by the human spirit.People from many walks of life- Engineers, Educators, Scientists, Doctors, and changemakers from Google, Facebook, Shell, VMWare, and other companies big and small - have shared their incredible stories of compassion in this book.In an age of artificial intelligence, as our jobs and professional identities are gradually being redefined by technology, compassion can be the standout skill that defines our uniqueness and propels our professional success. The Fifth Revolution is all about practical compassion -- part information, part stories, part workbook and all transformation.",
  "genres": [
    "Business"
  ],
  "author": "Immanual Joseph",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/51582677-the-fifth-revolution"
}