{
  "title": "Ghost of a Chance",
  "description": "How well do you know the lover in your bed?\nIt was the hottest hookup of her life. When Tess Barrett spent the night in the arms of the too sexy to be real stranger, she knew she was walking on the wild side. Sex with James Smith was the best EVER. How was she supposed to walk away from that? From him? So…she didn’t. They planned secret dates. More body-melting hookups. The white-hot sex should have been enough.So why does she start wanting more?But they have rules. She has rules. No emotions. No ties. She has a past that is dark and twisted, and she’s worked hard to become a new person. She’s a doctor now. Respected. Controlled. Except…there is no control when she’s around James.A bad guy…might be falling for the good girl.James can’t keep his hands off his sexy little doctor. She’s buttoned down for everyone else but goes absolutely wild for him. Sure, she doesn’t know his history. Doesn’t know that the man she lets touch every inch of her body used to spend his days working for Uncle Sam and doing some seriously dirty deeds. What she doesn’t know can’t hurt her, right? And if she ever did learn the truth about him, he knew it would terrify his sweet doc right to her core. Terror would make her run. He doesn’t want her running. He just wants her in his bed.But then…something happens. Danger sneaks up on Tess. She needs help—a very particular expertise and protective skill set. She needs someone lethal and strong…and James is just the man for the job. After all, lethal is his middle name.Hello, dangerous times.When James steps in, Tess doesn’t know if she should be grateful or scared to death. Because her gorgeous lover? Turns out he has plenty of mad and dangerous skills. She’s been hooking up with a superhero or…maybe a super villain. It’s sort of hard to tell the difference.For the moment, she’s going to go with feeling grateful…but as she learns all of his secrets, Tess wonders what will happen next between them. Will they crash and burn? Burn, baby, burn. Or maybe, just maybe, they’ll actually have a GHOST OF A CHANCE at getting a happily ever after ending. Author’s James Smith is one mad, bad, dangerous guy…but sometimes, bad guys fall hard for good girls. GHOST OF A CHANCE is super hot, charged with lots of feels, and, it’s got some pulse-pounding action for you. Dirty words and dirty deeds are dead ahead. Oh, and there’s plenty of fun thrown in, too. Mystery, humor, sexy times, and danger—all of my favorite things in a book.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Suspense",
    "Adult",
    "Erotica"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/51545102-ghost-of-a-chance"
}