{
  "title": "Swan Song: An Odyssey",
  "description": "A new novel, funny, wise, moving, true, as only Lisa Alther can write (\"she had me laughing at 4 in the morning\" --Doris Lessing), set on a cruise ship, about a woman, a doctor in charge of the ship's clinic, recovering from the loss of her longtime female lover, a much-admired writer, and coping with the high-wire madcappery of cruise ship life as she reckons with her past and feels her way into the future.Dr. Jessie Drake, in her mid-sixties, following the sudden deaths of her parents and Kat, her partner of twenty years, has fled the Vermont life she has known for decades.In an effort to escape the oppressive constancy of grief, she accepts a job from an old flame from her residency in New York City's Roosevelt Hospital, and agrees to assist Ben as the ship's doctor on a British liner. Jessie boards in Hong Kong, and, as the Amphitrite sails throughout Southeast Asia and the Middle East, cruise ship antics ensue. Jessie is lulled back into a long-ago romance with the ship's co-doctor, and both she and her new/old beau become enmeshed with the ship's lead (female) singer/entertainer. Among the passengers who fling socialized behavior aside on the high a former Florida beauty queen (Miss Florida Power and Light) on a second honeymoon with her husband, as she causes high-velocity scandal, while juggling onboard affairs with a suicidal golf pro, and a defrocked priest hired as one of the liner's gentleman hosts, until she vanishes--poof!--from the ship off the coast of Portugal . . . As the ship sails through the Gulf of Aden and into a possible hijacking by Somali pirates, Jessie retreats into her lover's journals, written during her final months, journals filled with sketches of potential characters, observations on life and love--as well as drafts of a long new poem in progress, \"Swan Song,\" that seems to be about being in love with someone else, someone new. As Jessie's grief turns to suspicion about the woman she thought she knew so well, her illumination of the poem's meaning begins to lift the constraints of the past and make clear the way toward the future.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer"
  ],
  "author": "Lisa Alther",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/51578617-swan-song"
}