{
  "title": "Man's Most Dangerous Myth: The Fallacy of Race",
  "description": "Man's Most Dangerous Myth was first published in 1942, when Nazism flourished, when African Americans sat at the back of the bus, and when race was considered the determinant of people's character and intelligence. It presented a revolutionary theory for its time; breaking the link between genetics and culture, it argued that race is largely a social construction and not constitutive of significant biological differences between people. In the ensuing 55 years, as Ashley Montagu's radical hypothesis became accepted knowledge, succeeding editions of his book traced the changes in our conceptions of race and race relations over the 20th century. Now, over 50 years later, Man's Most Dangerous Myth is back in print, fully revised by the original author. Montagu is internationally renowned for his work on race, as well as for such influential books as The Natural Superiority of Women, Touching, and The Elephant Man. This new edition contains Montagu's most complete explication of his theory and a thorough updating of previous editions. The Sixth Edition takes on the issues of the Bell Curve, IQ testing, ethnic cleansing and other current race relations topics, as well as contemporary restatements of topics previously addressed. A bibliography of almost 3,000 published items on race, compiled over a lifetime of work, is of enormous research value. Also available is an abridged student edition containing the essence of Montagu's argument, its policy implications, and his thoughts on contemporary race issues for use in classrooms. Ahead of its time in 1942, Montagu's arguments still contribute essential and salient perspectives as we face the issue of race in the 1990s. Man's Most Dangerous Myth is the seminal work of one of the 20th century's leading intellectuals, essential reading for all scholars and students of race relations.",
  "genres": [
    "Nonfiction",
    "Science",
    "Race",
    "Sociology",
    "History",
    "Anthropology",
    "Philosophy"
  ],
  "author": "Ashley Montagu",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/51561.Man_s_Most_Dangerous_Myth"
}