{
  "title": "Ashes",
  "description": "Reviews :\"Prepare to lose sleep when you enter Vega's dark literary landscape.\" - Scott Nicholson, The Red Church\"Estevan Vega is a fabulous storyteller. He's highly prolific and young. I can't wait to watch his career roll out; I have a feeling he's going to be a major force in fiction.\"--Robert Liparulo, bestselling author of The Dreamhouse Kings and The 13th Tribe\" Arson is not to be missed. It is densely layered, tense, packed with surprising compassion, and written with great courage...Groundbreaking!\"-- Salt Lake City Examiner\"[ Arson ] could be compared to other young adult books such as Jumper or even a young coming of age super-hero genre story. And even at times flecks of the Twilight series.\"-- Title Trakk* * *PRODUCT DESCRIPTION : ASHES is a YA paranormal thrill-ride. Book 2 in the gripping Arson trilogy. MORE THAN THREE MONTHS HAVE PASSED SINCE ARSON AND EMERY WERE SUDDENLY TAKEN. TAKEN AND THEN SEPARATED. AND EXPERIMENTED ON.The minds running Salvation Asylum have abducted them for a dark purpose. A campaign has been set in motion to genetically alter mankind. Unknowingly, Arson has become the most vital instrument in this global scheme, initiated by a select group of brilliant scientists and cunning world leaders. Confused, trapped, and unable to fully manifest his abilities, Arson faces a new existence crawling with questions. Will he ever see Emery again? Is Grandma still alive? Can the fate of the human race really hang in the balance of one choice?Nightmare and reality collide in Ashes , book two in the gripping ARSON trilogy. Love will be tested. Powers will shift. And the past will invade the here and now as Arson discovers a part of himself he has never before known and fights against his own shocking origins. Will this boy who once tempted fire be able to take on a fearful future? When the struggle intensifies and secrets come to light, will Arson be ready to accept the haunting revelation that there may be others out there, others like him? * * *Other Books By ESTEVAN ArsonAshesThe Forsaken (A Thriller)Music Box (Short)When Colors Bleed (Short Story Collection)     Baby Blue (Short)     Vanilla Red (Short)     The Man in the Colored Room (Short)* * ** * *ESTEVAN released his first book at fifteen. ARSON, his third and most popular novel, is the beginning of a series, followed by its sequel, ASHES. Just released is THE FORSAKEN, a supernatural thriller, which has had over 23,000 Kindle downloads since its release in the Spring of 2012.",
  "genres": [
    "Young Adult"
  ],
  "author": "Estevan Vega",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/12554876-ashes"
}