{
  "title": "Urban Legends: The South Bronx in Representation and Ruin",
  "description": "A cultural history of the South Bronx that reaches beyond familiar narratives of urban ruin and renaissance, beyond the “inner city” symbol, to reveal the place and people obscured by its myths.For decades, the South Bronx was America’s “inner city.” Synonymous with civic neglect, crime, and metropolitan decay, the Bronx became the preeminent symbol used to proclaim the failings of urban places and the communities of color who lived in them. Images of its ruins—none more infamous than the one broadcast live during the 1977 World Series: a building burning near Yankee Stadium—proclaimed the failures of urbanism.Yet this same South Bronx produced hip hop, arguably the most powerful artistic and cultural innovation of the past fifty years. Two narratives—urban crisis and cultural renaissance—have dominated understandings of the Bronx and other urban environments. Today, as gentrification transforms American cities economically and demographically, the twin narratives structure our thinking about urban life.A Bronx native, Peter L’Official draws on literature and the visual arts to recapture the history, people, and place beyond its myths and legends. Both fact and symbol, the Bronx was not a decades-long funeral pyre, nor was hip hop its lone cultural contribution. L’Official juxtaposes the artist Gordon Matta-Clark’s carvings of abandoned buildings with the city’s trompe l’oeil decals program; examines the centrality of the Bronx’s infamous Charlotte Street to two Hollywood films; offers original readings of novels by Don DeLillo and Tom Wolfe; and charts the emergence of a “global Bronx” as graffiti was brought into galleries and exhibited internationally, promoting a symbolic Bronx abroad.Urban Legends presents a new cultural history of what it meant to live, work, and create in the Bronx.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Peter L'Official",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/51579311-urban-legends"
}