{
  "title": "The Double X Economy: The Epic Potential of Women's Empowerment",
  "description": "\"Linda Scott shines a light on women's essential and often invisible contributions to our global economy--while combining insight, analysis, and interdisciplinary data to make a compelling and actionable case for unleashing women's economic power.\" --Melinda Gates, author of The Moment of Lift: How Empowering Women Changes the World A leading thinker's groundbreaking examination of women's economic empowermentFor the past fifteen years, the scholar and activist Linda Scott has played a central role in the rise of the women's economic empowerment movement. A coalition made up of activists, multinational corporations, global NGOs, and governments, it arose in the mid-2000s in response to new global data sets that revealed sobering conclusions about women in the economy, namely that gender inequality is a global problem, and that women's economic subordination drags down national economies and fosters global crises, from severe poverty to human trafficking.In The Double X Economy: The Epic Potential of Women's Empowerment,  Scott argues that women's systematic exclusion from economic participation has created an alternate system that she calls \"the Double X Economy\" having suffered from a consistent list of severe and worldwide economic exclusions applied throughout history, women have been shaped into an entirely different economic practice. Yet while the women's economy, taken as a whole, is restricted and constantly under threat, when empowered it is more careful, cooperative, and focused on long-term outcomes than the economic order under which the world lives now.Building on the momentum of the female empowerment movements currently mobilizing worldwide, The Double X Economy presents an entirely new conceptual schema for women's rights based on economic liberty. Accessible and convincing, Scott's groundbreaking study is an assessment of women's historic subjugation, a demonstration of how that subjugation has resulted in myriad intractable problems, and a call to action to once and for all place women on an equal footing with men in order to create a better world.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Economics",
    "Business",
    "Politics",
    "Womens",
    "Audiobook"
  ],
  "author": "Linda M.  Scott",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/51542640-the-double-x-economy"
}