{
  "title": "Tales of a Shaman's Apprentice: An Ethnobotanist Searches for New Medicines in the Amazon Rain Forest",
  "description": "The fascinating account of a pioneering ethnobotanist’s travels in the Amazon—at once a gripping adventure story, a passionate argument for conservationism, and an investigation into the healing power of plants, by the author of The What Everyone Needs to KnowFor thousands of years, healers have used plants to cure illness. Aspirin, the world's most widely used drug, is based on compounds originally extracted from the bark of a willow tree, and more than a quarter of medicines found on pharmacy shelves contain plant compounds. Now Western medicine, faced with health crises such as AIDS, Alzheimer's disease, and cancer, has begun to look to the healing plants used by indigenous peoples to develop powerful new medicines. Nowhere is the search more promising than in the Amazon, the world's largest tropical forest, home to a quarter of all botanical species on this planet—as well as hundreds of Indian tribes whose medicinal plants have never been studied by Western scientists. In Tales of a Shaman's Apprentice , ethnobotanist Mark J. Plotkin recounts his travels and studies with some of the most powerful Amazonian shamans, who taught him the plant lore their tribes have spent thousands of years gleaning from the rain forest.For more than a decade, Dr. Plotkin raced against time to harvest and record new plants before the rain forests' fragile ecosystems succumb to overdevelopment—and before the Indians abandon their own culture and learning for the seductive appeal of Western material culture. Tales of a Shaman's Apprentice relates nine of the author's quests, taking the reader along on a wild odyssey as he participates in healing rituals; discovers the secret of curare, the lethal arrow poison that kills in minutes; tries the hallucinogenic snuff epena that enables the Indians to speak with their spirit world; and earns the respect and fellowship of the mysterious shamans as he proves that he shares both their endurance and their reverence for the rain forest.",
  "genres": [
    "Nonfiction",
    "Science",
    "Anthropology",
    "Nature",
    "Travel",
    "Medicine",
    "Health"
  ],
  "author": "Mark J. Plotkin",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/515466.Tales_of_a_Shaman_s_Apprentice"
}