{
  "title": "Frisk",
  "description": "À treize ans, Dennis, le narrateur, découvre une série de photographies représentant un garçon dont le corps a été incroyablement mutilé. Ces images, au lieu de le terrifier, lui font entrevoir la complexité et le mystère de ses propres désirs. Pour lui, le corps, l'enveloppe charnelle, contiendrait tous les secrets qu'il faudrait révéler : \"À la télé, j'ai vu ces criminels qui ont méthodiquement tué quelqu'un, et ils sont libres. Ils savent quelque chose d'inimaginable. Vous pouvez en être sûr.\" Dans une succession de scènes allant crescendo commence alors une balade hallucinée, un voyage dans la violence, dont le meurtre serait l'apogée : des faits divers, des coupures de journaux, des rêves, des extraits de films \"gore\", des fantasmes s'entrecroisent, se sur-impriment, se chevauchent, mettant en scène des personnages à la recherche de sensations de plus en plus extrêmes. Et composant le paysage dévasté et terrifiant d'une société sans repères. Cerné par ces images, mais toujours obsédé par sa recherche, Dennis part en Europe, en Hollande. De là, il écrit à l'un de ses premiers amants, Julian, une longue lettre (le point culminant du livre en terme de violence et d'horreur) ou il décrit méthodiquement les meurtres qu'il y a perpétrés, les sensations et la jouissance qu'ils lui ont procurés. Julian le rejoint et découvre... que tout était faux. Il n'y a pas de cadavres, pas de morts... mais de l'écriture. Le livre peut se refermer sur lui-même avec les mêmes photographies qu'au début : c'était un trucage, un maquillage, d'ailleurs, si vous regardez bien, sur la dernière photo : cette blessure n'est qu'\"un mélange de peinture, d'encre, de scotch, de coton, de tissus et de papier mâché [...] et vous pouvez même distinguer les empreintes de celui qui l'a fabriquée\".",
  "genres": [
    "Fiction",
    "Horror",
    "Queer",
    "LGBT",
    "Gay",
    "Dark",
    "American"
  ],
  "author": "Dennis Cooper",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/51590.Frisk"
}