{
  "title": "Betraying the Nobel: The Secrets and Corruption Behind the Nobel Peace Prize",
  "description": "A revelatory examination of the Nobel Peace Prize—the most prestigious, admired, and controversial honor of our time.The Nobel Prize, regardless of category, has always been surrounded by politics, intrigue, even scandal. But those pale in comparison to the Peace Prize.In Betraying the Nobel, Norwegian writer Unni Turrettini completely upends what we thought we knew about the Peace Prize—both its history and how it is awarded.As 1984’s winner, Desmond Tutu, put it, “No sooner had I got the Nobel Peace Prize than I became an instant oracle.” However, the Peace Prize as we know it is corrupt at its core.In the years surrounding World War I and II, the Nobel Peace Prize became a beacon of hope, and, through its peace champions, became a reference and an inspiration around the world. But along the way, something went wrong. Alfred Nobel made the mistake of leaving it to the Norwegian Parliament to elect the members of the Peace Prize committee, which has filled the committee with politicians more loyal to their political party’s agenda than to Nobel’s prize's prerogative. As a result, winners are often a result of political expediency.Betraying the Nobel will delve into the surprising, and often corrupt, history of the prize, and examine what the committee hoped to obtain by its choices, including the now-infamously awarded Cordell Hull, as well as Henry Kissinger, Al Gore, and Barack Obama. Turrettini shows the effects of increased media attention, which have turned the Nobel into a popularity prize, and a controversial and provocative commendation.The selection of winners who are not peace champions according to the mandates of Alfred Nobel’s will creates distrust. So does lack of transparency in the selection process. As trust in leadership and governance reaches historic lows, the Nobel Peace Prize should be a lodestar. Yet the modern betrayal of the Nobel’s spirit and intentions plays a key role in keeping societal dysfunctions alive.But there is hope. Betraying the Nobel will show how the Nobel Peace Prize can again become a beacon for leadership, a catalyst for change, and an inspiration for rest of us to strive for greatness and become the peace champions our world needs.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Unni Turrettini",
  "average_rating": "3.04",
  "url": "https://www.goodreads.com/book/show/51601870-betraying-the-nobel"
}