{
  "title": "Reflections of the Moon on Water: Healing Women's Bodies and Minds through Traditional Chinese Wisdom",
  "description": "One of Canada’s most trusted and beloved health practitioners introduces Western women to the wisdom of traditional Chinese medicine and the time-tested practices that have helped optimize physical and emotional health for centuries.Since establishing her practice in Canada twelve years ago, Dr. Xiaolan Zhao has treated thousands of women suffering from fatigue, PMS, infertility, depression, menopausal symptoms and other gynecological disorders — health problems that are all too common in the West but less so in China, where traditional Chinese medicine (TCM) has been an integral part of women’s lives for thousands of years. As a physician originally trained in Western medicine who later took up the practice of TCM, Dr. Zhao has seen how effective the Chinese approach is for her patients, and she’d like to see more Canadian women incorporating its wisdom and practices in their own lives, as a complement to their regular health care.In Reflections of the Moon on Water , she explains the unique philosophy behind the healing tradition, a way of thinking that is liberating and empowering for women. Sharing stories from her own life and the lives of her patients, Dr. Zhao shows that we have nothing to reject about our feminine selves, and explains how we can develop new relationships with our bodies and our emotions. There is so much every woman can do in terms of ongoing and preventative self-care to improve her health and vitality and prevent illness. By making simple changes in diet, exercise routine, sex life and the way we deal with stress and our emotions, we can profoundly improve our health now and into the future.\" Many Westerners think Chinese medicine sounds too complicated or too esoteric. They find discussions of yin and yang, or the life energy known as qi intimidating. In fact, Chinese medicine is very simple and accessible. Many of the herbs we use are ordinary ones. Sometimes, I might treat a patient’s sinus condition with eucalyptus or other familiar herbs, and she’ll say, \"Oh that smells just like what my grandmother used to give me.\" So much of Chinese medicine is based on intuition and common sense. Although the history behind TCM is 5,000 years old — 4,500 years older than our scientific traditions — it is knowledge open to anyone.\"—excerpt from Reflections of the Moon on Water",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help",
    "Feminism"
  ],
  "author": "Xiaolan Zhao",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/516079.Reflections_of_the_Moon_on_Water"
}