{
  "title": "The Long Walk Home",
  "description": "When forty-three-year-old Fiona Edwards first sees the lanky backpacker striding up the lane toward her award-winning farmhouse bed-and-breakfast in the remote mountains of North Wales, she’s puzzled. She’s used to unexpected strangers, but few arrive on foot. The man to whom she opens her door ismiddle-aged, unshaven, sweat-soaked . . . and arrestingly handsome. What neither of them knows at that moment is that their lives are about to change forever.American Alec Hudson has carried the ashes—and the memory—of his late ex-wife, Gwynne, all the way from London’s Heathrow Airport, honoring her request that he scatter them atop a mountain they had climbed together years before—the same brooding peak whose jagged cliffs rise to the sky from the back pastures of Fiona’s farm. But the weather doesn’t cooperate, and as Fiona and Alec wait for it to clear, they are drawn together by mutual loss, longing, and the miracle of love at midlife.On the day he finally reaches the summit, Alec is caught in a vicious hailstorm. As he struggles to descend, he stumbles upon the body of a man he recognizes from a photograph at the it is Fiona’s ailing and reclusive husband, David, and he is close to death.Will North’s debut novel, The Long Walk Home , is a story about grief and hope, about love and loss, and about two people struggling with the agonizing complexities of fidelity—to a spouse, to a moral code, to each other, and to a passion neither thought would ever appear again. By turns lyrical and gripping, set amid a landscape of breathtaking beauty and unpredictable danger, this is a story you will not soon forget.For news, reviews, and a visual walking tour, visit WillNorthOnline.com.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Adult Fiction",
    "Contemporary Romance",
    "Amazon",
    "Audiobook"
  ],
  "author": "Will North",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/516026.The_Long_Walk_Home"
}