{
  "title": "Leading Meaningful Change: Capturing the Hearts, Minds, and Souls of the People You Lead, Work With, and Serve",
  "description": "“Straightforward and practical, this book is a must-read for any leader or change practitioner.” ―Mark Porter, Executive Vice President People & Culture, WestJet AirlinesLeading Meaningful Change is an essential guide for executives, leaders, managers, consultants, and other professionals who need to go beyond applying tactics in a change plan to truly capture the hearts, minds, and souls of the people they lead. Based on her research and 30 years of experience helping people lead and manage meaningful change, Beverley Patwell offers a new framework to guide and enhance the change journey. This approach is humanizing, engaging, and results in the belief in a higher purpose that permeates throughout the organization while at the same time achieves outcomes that are far greater than one person’s single contribution. Patwell’s framework is effective • creating a shared vision that compels people to be engaged and involved in the change journey; • developing internal leaders and strong, cohesive and aligned teams to lead, manage and support the changes; and • developing strategies to effectively lead, manage and evaluate the human side of change. At the core of the framework are the Use-of-Self principles applied to the change process as seen through interviews with 24 multi-generational emerging, current and long-service leaders who explain why Use-of-Self remains a key element in successfully leading and managing change. The book also includes practical tools to help leaders and managers across the globe address change leadership challenges. Of special note is a two-year case study of the Senior Leadership Team in the City of Ottawa who led a significant city-wide culture shift using the framework.",
  "genres": [
    "Business"
  ],
  "author": "Beverley Patwell",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/51604878-leading-meaningful-change"
}