{
  "title": "The League of Extraordinary Gentlemen, Vol. 1",
  "description": ".As the Victorian era draws to a close, Allan Quatermain, Captain Nemo, Hawley Griffin, Dr. Henry Jekyll, Mr. Edward Hyde and Mina Murray have been gathered together to save their nation. Now, the original adventures of this group have been collected and sourced from the original art for the first time ever in The League Of Extraordinary Gentlemen: Kevin O'Neill Gallery Edition. This Smythe-sewn hardcover edition includes all of Kevin O'Neill's artwork from the original six-issue The League Of Extraordinary Gentlemen miniseries Vol. I, scanned in full colour from the original art boards. Also included are the covers and various League artwork that showcase Kevin's incredible craftsmanship. This Gallery Edition replicates the look, feel and attitude of the artwork. Every page is reproduced at original size on heavy paper stock to provide the fan and collector with museum-quality reproductions that are obtainable nowhere else. This edition, with color scans of the original art, captures the intricacy of Kevin's artwork as never seen before. His collaboration with writer Alan Moore resulted in a timeless tale set in an era in desperate need of champions. A more enjoyable presentation of this fine tale has never before been seen. Each high-quality, Smythe-sewn hardcover book in this series captures every detail of the art at actual-size, and is printed at 200 lines-per-inch screen on a rich, heavy paper stock. Replicating the original art experience is our goal. This is the next best thing to holding the original art in your hands—and easier on the wallet, too!Author: Alan MooreArtist: Kevin O'NeillPublisher: DC/Graphitti Designs, January 2016 First EditionNumber of pages: 184Format: Hard Cover; Full Colour illustrationsSize: 12\" x 17\" (305mm x 432mm)ISBN: 9781401261900",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Fantasy",
    "Fiction",
    "Steampunk",
    "Graphic Novels Comics",
    "Science Fiction"
  ],
  "author": "Alan             Moore",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/51594222-the-league-of-extraordinary-gentlemen-vol-1"
}