{
  "title": "Do You Feel Like I Do?: A Memoir",
  "description": "From his early rise to fame to battles with his health, this revelatory memoir by legendary guitarist Peter Frampton celebrates the life of a rock icon.Do You Feel Like I Do? is the incredible story of Peter Frampton's positively resilient life and career told in his own words for the first time. His monu-mental album Frampton Comes Alive! spawned three top-twenty singles and sold eight million copies the year it was released (more than seventeen million to date), and it was inducted into the Grammy Hall of Fame in January 2020.Frampton was on a path to stardom from an early age, first as the lead singer and guitarist of the Herd and then as cofounder—along with Steve Marriott—of one of the first supergroups, Humble Pie. Frampton was part of a tight-knit collective of British '60s musicians with close ties to the Rolling Stones, the Beatles, and the Who. This led to Frampton playing on George Harrison's solo debut, All Things Must Pass, as well as to Ringo Starr and Billy Preston appearing on Frampton's own solo debut. By age twenty-two, Frampton was touring incessantly and finding new sounds with the talk box, which would become his signature guitar effect.Frampton remembers his enduring friendship with David Bowie. Growing up as schoolmates, crossing paths throughout their careers, and playing together on the Glass Spider Tour, the two developed an unshakable bond. Frampton also shares fascinating stories of his collaborative work with Harry Nilsson, Stevie Wonder, B. B. King, and members of Pearl Jam. He reveals both the blessing and curse of Frampton Comes Alive!, opening up about becoming the cover boy he never wanted to be, his overcoming sub-stance abuse, and how he has continued to play and pour his heart into his music despite an inflammatory muscle disease and his retirement from the road.Peppered throughout his narrative is the story of his favorite guitar, the Phenix, which he thought he'd lost in a fiery plane crash in 1980. But in 2011, it mysteriously showed up again—saved from the wreckage. Frampton tells of that unlikely reunion here in full for the first time, and why the miraculous reappearance is emblematic of his life and career as a quintessential artist.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Peter Frampton",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/51623934-do-you-feel-like-i-do"
}