{
  "title": "Outlander Kitchen: To the New World and Back Again: The Second Official Outlander Companion Cookbook",
  "description": "The author of the fan favorite Outlander Kitchen returns with more than 100 new easy-to-prepare recipes in this official cookbook inspired by Diane Gabaldon's beloved Outlander novels and the hit Starz original series. \"If you thought Scottish cuisine was all porridge and haggis washed down with a good swally of whiskey, Outlander Kitchen's here to prove you wrong.\"--\nEntertainment Weekly\nFrom Jenny Fraser's first delighted taste of light and fluffy flapjacks from Written in My Own Heart's Blood, to a mouthwatering ragout of beef with oysters at the Beefsteak in The Scottish Prisoner, or a batch of quick-fermented cabbage inspired by Minnie Rennie in \"A Fugitive Green,\" this cookbook brings the world of Diana Gabaldon's beloved literary universe to life with more than 100 delicious, easy-to-follow recipes accompanied by full-color photos.Drawing inspiration from the latest novels in the Outlander series, which relocates the series to the American colonies, as well as the Lord John books and the stories in Seven Stones to Stand and Fall,  Theresa Carle-Sanders delivers an entertaining and mouthwatering mix of authentic historical recipes, twenty-first century interpretations of traditional foods, and character-inspired dishes. Each recipe is preceded by the passage that first introduced or inspired it, including:Breakfast: Mrs. Figg's Flapjacks; Simon Fraser's Grits with HoneySoups:  Leek and Potato Soup with Harry Quarry; Annie's Chicken Noodle Soup Appetizers:  Cheesy Savouries; Sardines on Toast for Lady JoffreyMains:  Benedicta's Steak and Mushroom Pie; The Cheerful Chicken Tavern's Poulet au Miel; Roast Pork Tenderloin with Cider Sauce; Claire's Beans and Sass Sides:  Tobias Quinn's Colcannon; Fried Plantains; Cornbread and Salt Pork Stuffing Breads: Lord John's Yorkshire Pudding; Cornbread; Scones with Preserved LemonSweets:  Mistress Abernathy's Apple Pandowdy; Blancmange en Paris; Almond Biscuits",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Scotland",
    "Foodie",
    "Adult"
  ],
  "author": "Theresa Carle-Sanders",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/51620141-outlander-kitchen"
}