{
  "title": "Scandalous Scotsman",
  "description": "One trip down the stairs, caused by a lone Lego, while wrapped in a towel, spewing a plethora of profanities, and my cell phone went flying.I landed on my ass, and then the ER.Between those two occurrences was a FaceTime call, placed by a bouncing phone, to the number of a man I didn’t even truly look at, who had now seen more of my body than anyone had since my Tinder days, over a year ago.Three declined calls later, I limped out the door to get myself to the ER before starting my hectic day.The ER was packed, but when I saw Nurse Bridget, one of my students’ mothers, I pleaded my case and she hurried me into an examination room.An hour later, I left on crutches with a bruised ass, a fractured ankle, and an appointment to see an orthopedic surgeon at four p.m.Arriving fifteen minutes late for that appointment, I heard the sexy yet very brash accent of a man who clearly had an obsession with punctuality and, apparently, no bedside manner.Dr. Ethan Stewart, tall, copper-haired, sinfully sexy … was a total ass.After a tongue-lashing about how irresponsible I was to, first, leave the ER with such an injury, and second, be late, I put him in his place … or so I thought.Turned off by his arrogant attitude, turned on by the roguish glint in his green eyes and the way he spoke, I left his office a hot … and wet mess.Upon exiting, my phone rang again. It was the same number from before, and I couldn’t help answering to give the caller a piece of my mind.Once in my car, I hung up, tossed my phone on the passenger seat, and then looked out the window to see him with his phone to his ear and a grin spread across his far too handsome face.It couldn’t be …Could it?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Enemies To Lovers",
    "Doctors",
    "Humor"
  ],
  "author": "M.J. Fields",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/51627090-scandalous-scotsman"
}