{
  "title": "The High Crown Chronicles",
  "description": "When a crown is at stake, blood will be shed…The High Crown Chronicles is cinematic storytelling at its best. With stunning imagery, dynamic characters, and a slow-burn romance, Jodi Gallegos has built a fantastical world. Coupled with a strong female heroine who’s both relatable and fierce, this seamlessly layered plot pours the foundation for an epic fantasy series that readers will devour before asking for more.  Malory is bound by blood to ensure the High Crown is returned to her kingdom—be it the blood that runs through her veins or the blood spilled at her feet. The eldest heir of the kingdom of Devlishire, Malory is destined to be the first reigning queen in a hundred years, though she’d prefer to spend her days sparring in the courtyard or reading tales of the long-forgotten gods rather than studying languages and royal lineage. But an upset in the balance of power between the Unified Kingdoms is about to disrupt peace in the land and promote unquenchable greed amongst its rulers.  A jealous younger brother—and a salacious rumor—leaves Malory as a pawn in her father’s plot to overthrow the new ruling king. She’s forced to participate or risk the life of her best friend Esmond, a knight in the King’s Guard. Betrayed by her family, sent away from her home, and denied her birthright, Malory will navigate the courts of her new kingdom to protect it against any who threaten it—even her. Her journey will reawaken the warrior inside herself, and the gods who have lain dormant for a hundred years.  The High Crown Chronicles is a young adult fantasy that embraces the spirit of betrayal, deception, and political intrigue that is at the core of Philippa Gregory novels, with the dark vengeance of George R.R. Martin. With heart-stopping action, relatable characters, and impeccable writing, the first novel in The High Crown Chronicles by Jodi Gallegos is sure to leave readers hungry for more.  The High Crown Chronicles by Jodi Gallegos - The High Crown Chronicles, Book 1 (Summer 2020)- Queen of Ruins, Book 2 (Winter of 2020)- The Battle of Gods and Men (Summer of 2021)",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Amazon",
    "Romance",
    "Fiction",
    "Romantasy"
  ],
  "author": "Jodi Gallegos",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/51659140-the-high-crown-chronicles"
}