{
  "title": "The Panzer Killers: The Untold Story of a Fighting General and His Spearhead Tank Division's Charge into the Third Reich",
  "description": "A general-turned-historian reveals the remarkable battlefield heroics of Major General Maurice Rose, the World War II tank commander whose 3rd Armored Division struck fear into the hearts of Hitler's panzer crews.\nTwo months after D-Day, the Allies found themselves in a stalemate in Normandy, having suffered enormous casualties attempting to push through hedgerow country. Troops were spent, and American tankers, lacking the tactics and leadership to deal with the terrain, were losing their spirit. General George Patton and the other top U.S. commanders needed an officer who knew how to break the impasse and roll over the Germans--they needed one man with the grit and the vision to take the war all the way to the Rhine. Patton and his peers selected Maurice Rose.The son of a rabbi, Rose never discussed his Jewish heritage. But his ferocity on the battlefield reflected an inner flame. He led his 3rd Armored Division not from a command post but from the first vehicle in formation, charging headfirst into a fight. He devised innovative tactics, made the most of American weapons, and personally chose the cadre of young officers who drove his division forward. From Normandy to the West Wall, from the Battle of the Bulge to the final charge across Germany, Maurice Rose's deadly division of tanks blasted through enemy lines and pursued the enemy with a remarkable intensity.In The Panzer Killers, Daniel P. Bolger, a retired lieutenant general and Iraq War veteran, offers up a lively, dramatic tale of Rose's heroism. Along the way, Bolger infuses the narrative with fascinating insights that could only come from an author who has commanded tank forces in combat. The result is a unique and masterful story of battlefield leadership, destined to become a classic.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "World War II",
    "War",
    "Military History",
    "Biography"
  ],
  "author": "Daniel P. Bolger",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/51637955-the-panzer-killers"
}