{
  "title": "Conquistadores: A New History of Spanish Discovery and Conquest",
  "description": "A sweeping, authoritative history that aims to deepen our understanding of the campaigns and conquests that propelled a small European kingdom to become one of the greatest empires in the worldOver the few short decades that followed Christopher Columbus's first landing in the Caribbean in 1492, Spain conquered the two most formidable civilizations of the Americas: the Aztecs of Mexico and the Incas of Peru. Hernán Cortés, Francisco Pizarro, and the other explorers and soldiers that took part in these expeditions dedicated their lives to seeking political and religious glory, helping to build an empire unlike any the world had ever seen.Centuries later, two dominant narratives about these conquests have prevailed--one of the romance and exoticism of adventure, the other of cruelty and exploitation of innocent people at the service of politics and religious bigotry. In The Conquistadors, Mexican historian Fernando Cervantes--himself a descendent of one of the conquistadors--tells the complete story of the conquests while steering a middle course between these two viewpoints. He argues that, while the conquistadors had undeniable faults, the tendency to condemn them tells us more about our modern sense of shame than it does about their original intentions.Drawing upon previously untapped primary sources that include diaries, letters, chronicles, and polemical treatises, Cervantes reframes the story of the Spanish conquest of the New World, examining the late medieval world from which the conquistadors emerged. At the heart of the story are the conquistadors themselves, whose epic ambitions and moral contradictions defined an era, as well as their supporters and detractors. Cervantes helps us understand them on their own terms and shows us how their achievements still have much to tell us in our increasingly post-nationalist world.",
  "genres": [
    "History",
    "Nonfiction",
    "Spain",
    "World History",
    "Audiobook",
    "European History",
    "The Americas"
  ],
  "author": "Fernando Cervantes",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/51672739-conquistadores"
}