{
  "title": "The Order of Time",
  "description": "2021 Reader’s Favorite Gold Medal Winner - Childrens Mythology/Fairy Tale“If you’re into secret societies, time-travel, dangerous artifacts, deadly assassins, evil priests, and vengeful gods then I’ve got a story for you...”  Anastasia and Edward Upston are eleven year old twins who are different in almost every way. Despite this they are inseparable and the best of friends. They tackle the highs and lows of sixth grade together whether they are fending off bullies at the elite Blake Academy or examining rare antiquities at the Smithsonian Museum of Natural History. Then: life gets complicated.  They discover that their friend and mentor, Dr. Gregorian, is part of a secret society called the Order of Time. It turns out that time is not fixed, it’s a fluid continuum where changes to the past can create ripples all the way through to the present. It unwittingly falls to the twins to travel back through time to ancient Egypt where they must overcome deadly assassins, evil high priests and vengeful gods in order to prevent disaster. Together Anastasia and Edward must navigate all obstacles to preserve the past and find their way back home.  “The Order of Time is fast-paced, featuring compelling characters, a great setting, and a cleverly written plot. It is a delightful read for fans of young adult fantasy and time travel.” 5 Stars Reader’s Favorite“If you are looking for an action packed chapter book for your teen or preteen this is an excellent choice.” childrens_bookshelf  “I could not get enough of this book and the language presented really will speak to young readers and I can not wait to share it with our community.” Meghan S. Librarian NetGalley review  \"The Order of Time is a fabulous debut. Totally captivating!\" 5 Stars The Burgeoning Bookshelf",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Time Travel",
    "Science Fiction",
    "Young Adult",
    "Childrens",
    "Fiction"
  ],
  "author": "Scott P. Southall",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/51645415-the-order-of-time"
}