{
  "title": "Mercedes Sosa - More than a Song,  A tribute to \"La Negra\",  the voice of Latin America,",
  "description": "With her powerful voice and compelling stage presence, the Argentine folk singer, Mercedes Sosa, was a world-class performer, whose influence went far beyond the borders of music. Blacklisted as being one the most dangerous people to the regime in Argentina in the 1970s, she became the underground reference point for the poor and oppressed, and an icon of democracy who fought South America’s dictators with her voice. Alongside her lifelong career, which earned her four Grammy Awards, Sosa also worked as Goodwill Ambassador for the children in Latin America and in the Caribbean, and was granted the prestigious position of Vice President of the Earth Council. Nicknamed, “The Voice of the Voiceless”, Sosa emerged as a legend and a much-loved mother of Latin America. Although Mercedes Sosa was one of the most recognized artists in international music, and collaborated with musicians ranging from Luciano Pavarotti, Sting and Joan Baez, she remained an unsung hero outside of Latin America. However, now ten years after her death, Sosa’s legacy continues to shine. Her example of integrity and solidarity lives on and make her a role model who points out the path to a more emphatic and compassionate world. But how did a girl raised in a poor Indian working class family gain such influence? Mercedes Sosa – More than a Song explores the secret behind Sosa’s remarkable impact and reveals how her upbringing, political circumstances and personal tragedies formed her life and her career. You are about to meet a woman who will inspire you by her courage and authenticity.“In her voice, life becomes a song with a scent of hope as sweet and beautiful as the flower that grows in the paths of those who looks forward.”This edition is published to mark the 10th anniversary of Mercedes Sosa’s death and contains the biographical part of the original title, Mercedes Sosa - The Voice of Hope.",
  "genres": [],
  "author": "Anette Christensen",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/51635486-mercedes-sosa---more-than-a-song-a-tribute-to-la-negra-the-voice-o"
}