{
  "title": "Black Tea",
  "description": "Black Tea is a book about Russia that starts in London at the height of the Cold War and ends on a beach in Crimea forty years later. It takes those elements of the writer's life that were forged into something new during the disruption and breakup of the Soviet Union and its aftermath, to create a different kind of memoir based on reflections, memory, and a narration that starts in England and leads the reader on a journey through Russia from the White Sea to the Caucasus.It tells two stories, one that begins in suburban England in the 70s, and one that traces the course of a love affair in Moscow twenty years later. They are narrated during the course of a journey through Russia at the time of the commemorations for the hundred-year anniversary of the revolution in 2017.The book comes to terms with what has been described as the central lacuna in twentieth-century thought - the tacit support for communism by Western intellectuals. It describes the author's father's support of Russia and his activism on behalf of nuclear disarmament in the 1970s, and contrasts this with his grandmother's stark warnings of the evils of socialism, and his own ambiguous position growing up in the suburbs outside London, a position that was for many years dominated, in spirit, by a huge military map of the Soviet Union tacked to his bedroom wall.In the first section of the book the author leaves England to visit his family in Russia. They go on a camping trip to the White Sea, driving north on the Archangel Road to the old labour camp on the island of Solovki.The camping holiday comes to an end in the breakfast bar of a chalet-hotel. And so begins an extended journey alone. Morris drives back to Moscow, to the flat where he once lived and which is now empty but still full of memories. He tells the story of the August coup of 1991 and the October disturbances two years later, of the tanks on the streets, the bombardment of the Russian parliament building, and the partisan welcome he received during the nights of troubles from those people who felt they were fighting against the reactionary forces of repression.From Moscow he takes a train south to the Caucasus. He reflects on the emotional end of his own marriage and on the death of his father and grandmother. Morris travels to Astrakhan, the failed final destination of Hitler's sixth army who were desperate to reach the oil fields. From Astrakhan he takes a bus to Elbrus, the highest peak in the Caucasus and then continues on to Grozny, a destroyed city, now rebuilt but still festering from its wounds. The final stage in the journey takes him to Crimea, the scene of his own love-story, and the destination over years of countless Russian and Soviet lovers and would-be lovers, looking for happiness in the coves and dark-sand beaches along the Black Sea coast.Highly informed with a unique perspective, Black Tea chronicles the changing face of Russia over his thirty years there. A reflection and a travelogue, Steve Morris hauntingly explores love and identity, commitment and family.",
  "genres": [],
  "author": "Stephen    Morris",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/51618338-black-tea"
}