{
  "title": "School and My Bully Experience",
  "description": "Have You Or Someone You Know Ever Been Bullied? If “YES”, School and My Bully Experience, A New Anti-Bullying Book, is the perfect read for anyone in need of guidance. “School and My Bully Experience”, a new book about combating bullying by author Frank Joseph Minichetti, blends delightful stories with helpful tips for middle schoolers and young adults who may feel like they are alone or afraid and are in need of help. Join Joseph Minnow as he travels back in time to the year 1965, to his early years in school and his various encounters with bullies. Most of Joseph’s memories are happy ones; however, bullies have inflicted their damage and left some rather bad memories, too. Thirteen-year old Joseph is good-natured, extremely timid and very trusting of everyone. Given these personality traits, Joseph soon discovers he is the perfect target for bullies, like the mean-spirited Butch Barotti, his first bully encounter. Joseph feels like he has a sign on his back, “Please Bully Me.” However, being bullied is not Joseph’s only concern, he also has to deal with his 8th grade teacher, the dreaded Sister Superior, who rules her class with an iron first. Despite her diminutive stature (four foot, five inches tall), Sister is terrifying. Wearing a black habit, her eyes are dark black, like the eyes you see on some stuffed animals, and her voice is a high-pitched shrill comparable to the mythological monster “the Banshee.” The students called her “TNT.” (For the unfamiliar, TNT is a highly explosive substance). School and My Bully Experience contain stories detailing the numerous antics of Sister Superior and other teachers that have a major impact on Joseph and his classmates. After graduating from 8th grade, Joseph encounters new challenges in high school. In fact, the young man must deal with a whole new wave of bullies. He is presented with the opportunity to face his fears and overcome his shy and timid personality by standing up to and fighting his nemesis, the bully Xavier Steele (alias, Xman). This is Joseph’s first fight, which has a surprise ending that leaves his friends and classmates shaking their heads in disbelief. He experiences other firsts as well, his first dance, first class trip, first job, first boy/girl party, and more importantly to a young boy his first girlfriend and first kiss. Unfortunately, Joseph realizes that bullies will inevitably have a negative impact on most of his firsts. School and My Bully Experience tells the story of Joseph Minnow as he goes through adolescence into young adulthood. Eventually, the story morphs into the present time when Joseph becomes a father and works as a substitute teacher. As an adult, Joseph realizes that bullying has reached epidemic proportions and discovers that his daughter Emma has also become a victim. Moreover, he is dismayed when he witnesses the latest form of bullying –“Cyberbullying.” Now anyone can become a bully. The Internet can empower people and encourage cruel, thoughtless behavior, like the “Cyber Girls”, a group of teens that ban together to bully others.Although bullying is a serious subject, School and My Bully Experience contains funny and moving stories, while highlighting the quirky characteristics and unique personalities of people who played pivotal roles in Joseph’s journey. Finally, School and My Bully Experience addresses such topics as “Why People Bully” and “What To Do If You Become a Victim.” It is this combination that young readers will find both entertaining and informative, which makes School and My Bully Experience unique amongst books written on this subject.“School and My Bully Experience” is a chapter book written for ages 9-13, and for the young at heart who want to help themselves or someone they know rise above the personal struggle of being bullied.",
  "genres": [],
  "author": "Frank Joseph Minichetti",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/51628713-school-and-my-bully-experience"
}