{
  "title": "Little Fires Everywhere",
  "description": "From the bestselling author of Everything I Never Told You, a riveting novel that traces the intertwined fates of the picture-perfect Richardson family and the enigmatic mother and daughter who upend their lives.In Shaker Heights, a placid, progressive suburb of Cleveland, everything is planned--from the layout of the winding roads, to the colors of the houses, to the successful lives its residents will go on to lead. And no one embodies this spirit more than Elena Richardson, whose guiding principle is playing by the rules.Enter Mia Warren--an enigmatic artist and single mother--who arrives in this idyllic bubble with her teenaged daughter Pearl, and rents a house from the Richardsons. Soon Mia and Pearl become more than tenants: all four Richardson children are drawn to the mother-daughter pair. But Mia carries with her a mysterious past and a disregard for the status quo that threatens to upend this carefully ordered community.When old family friends of the Richardsons attempt to adopt a Chinese-American baby, a custody battle erupts that dramatically divides the town--and puts Mia and Elena on opposing sides. Suspicious of Mia and her motives, Elena is determined to uncover the secrets in Mia's past. But her obsession will come at unexpected and devastating costs.Little Fires Everywhere explores the weight of secrets, the nature of art and identity, and the ferocious pull of motherhood--and the danger of believing that following the rules can avert disaster.Named a Best Book of the Year by: People, The Washington Post, Bustle, Esquire, Southern Living, The Daily Beast, GQ, Entertainment Weekly, NPR, Amazon, Barnes & Noble, iBooks, Audible, Goodreads, Library Reads, Book of the Month, Paste, Kirkus Reviews, St. Louis Post-Dispatch, and many more...Perfect for book clubs! Visit celesteng.com for discussion guides and more.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Literary Fiction",
    "Adult",
    "Adult Fiction"
  ],
  "author": "Celeste Ng",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/51704136-little-fires-everywhere"
}