{
  "title": "The Product Manager's Desk Reference",
  "description": "THE 2nd EDITION of THE PMDR is NOW Go   bit.ly/PMDR2If you loved the first edition of The Product Manager's Desk Reference - You'll want to get a copy of the 2nd edition.  The Product Manager's Desk Reference 2nd Edition greatly expands on the body of knowledge, with new tools, graphics, and emphasis on areas that \" The Product Manager's Desk Reference is outstanding in covering the breadth of the tasks and thought processes involved in product and innovation management.\"-George Castellion, SSC Associates\"Every product manager will greatly benefit from having this reference manual in their office as they live through the exciting twists and turns of product management.\"-David Anderson , Managing Director, B2B Channels, United Airlines\"An excellent tool for beginners and experts alike. Steven Haines's practical experience and knowledge shine through at every step.\"-David Rosshirt , Director of Product Management, First Data International\"From now on, this book will stand as an important reference point for all product management teams.\"-Mark Elliott , Vice President Product Management, Smiths Detection\" The Product Manager's Desk Reference is the book all product managers have been waiting for. It is concise, to the point, and comprehensive.\"-Jeff Anderson , Senior Vice President Product Management, Franklin Covey\"Steven Haines covers this multifaceted topic in a systemic manner that makes the book easy to navigate. His groundbreaking proposal that Product Management become a formal disciple is an accurate reflection of the acute need for these skills in the business community.\"-Dan O'Day , Senior Director Product Management, Thomson ReutersAbout the BookWhether a business sells tangible goods or services, product management holds a critical position in the organization's pursuit of profits. Because traditional departmental roles continually evolve, and because the business climate is so competitive, the job of product manager has become exceedingly critical--yet it remains very complex. The Product Manager's Desk Reference is the first book to lay down a comprehensive body of knowledge for this critical function, and it is the only book that can effectively guide product managers so that they can establish and build a successful career in product management.Here, product management expert and practitioner Steven Haines clearly illustrates the entire product life cycle, from beginning to end. This outstanding work is packed with an array of best practices and helpful hints which are critical to the efficient management of products.The Product Manager's Desk Reference is punctuated with useful diagrams, tables, and templates and will help The Product Manager's Desk Reference embodies everything \"Product Management.\" It is a comprehensive, versatile, must-have resource for anyone who works in any company, in any industry, who seeks to successfully and profitably market and manage products and services.",
  "genres": [
    "Business",
    "Management",
    "Nonfiction"
  ],
  "author": "Steven Haines",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/5172847-the-product-manager-s-desk-reference"
}