{
  "title": "Articles on the 39 Clues, Including: The Maze of Bones, One False Note, the Sword Thief, Beyond the Grave, the Black Circle, the 39 Clues Cards, in Too Deep (the 39 Clues), the Viper's Nest, the Emperor's Code, Storm Warning",
  "description": "Please note that the content of this book primarily consists of articles available from Wikipedia or other free sources online. Hephaestus Books represents a new publishing paradigm, allowing disparate content sources to be curated into cohesive, relevant, and informative books. To date, this content has been curated from Wikipedia articles and images under Creative Commons licensing, although as Hephaestus Books continues to increase in scope and dimension, more licensed and public domain content is being added. We believe books such as this represent a new and exciting lexicon in the sharing of human knowledge. This particular book is a collaboration focused on The 39 Clues.More info: The 39 Clues is a series of adventure books, combining reading, online gaming, and card collecting. Published by Scholastic, the main part of the series consists of ten books about the adventures of siblings Amy and Dan Cahill trying to thwart the other Cahills to get the Clues. Continuing books will be about the rising of a new family, the Vespers. They agree to the challenge in their grandmother Grace Cahill's will and search for 39 Clues scattered around the world. Rick Riordan wrote the first book and the main story arc, however, other authors wrote the remainder of the books in the series. All of the ten books have been written and published, the authors being Rick Riordan, Gordon Korman, Peter Lerangis, Jude Watson, Patrick Carman, Jude Watson (again), Peter Lerangis (again), Gordon Korman (again), Linda Sue Park, and Margaret Peterson Haddix. Card packs are also being sold which contain 16 different cards that can be used in searching for Clues. Each book contains 6 cards, and the total number of cards is currently 438. Also, its official website offers missions that will lead to clues.",
  "genres": [],
  "author": "Wikipedia",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/12556358-articles-on-the-39-clues-including"
}