{
  "title": "Worlds Unseen",
  "description": "Beauty and terror await beyond the veil in this classic Christian fantasy.The Council for Exploration Into Worlds Unseen believed there was more to reality than the Empire had taught them—but when they came a little too close to the truth, tragedy ended their work, leaving the terrifying and beautiful world behind their own still hidden.Forty years later, one of the last Council members entrusts an ancient relic to the orphaned young woman Maggie a scroll that reveals the truth at last. Along with Nicolas Fisher, a Gypsy who hears things no one else can, Maggie sets out on a journey across the Seventh World to deliver the scroll to those who can use it.But the price of truth may be too for Maggie and Nicolas are tearing at the Veil between the seen and the unseen, between good and evil, between forgotten past and treacherous future. Monstrous forces are already on their trail.And when the Veil grows thin enough, it's anyone's guess what may come through.WORLDS UNSEEN is the first book in The Seventh World Trilogy, a Christian fantasy adventure with hints of steampunk and depths of spiritual truth. If you love page-turning action, memorable characters, and inspirational fiction that confronts darkness, reveals breathtaking beauty, and moves your heart to connect more deeply with God, this series is for you.Buy WORLDS UNSEEN now!Life-Changing, Inspirational Christian From the AuthorHey, my name is Rachel Starr Thomson. I love Jesus and believe wholeheartedly in the power of fiction to change our lives. While nonfiction may teach us something, fiction allows us to experience it. When we're experiencing truth, beauty, struggle, and triumph, we find our lives enriched and deepened by what we read.That's why I write. I want my readers to discover depths of truth about themselves, about the world, and about God that stretch and inspire them. My stories are always clean, but I don't shy away from hard questions and honest characters.Whoever you are, I believe in you. I believe your life has immeasurable worth. I believe you were personally handcrafted by a loving Creator with a vision and purpose for your life. I believe your struggles, your dreams, and your hurts matter. I believe you walk a path no one else does, one that is intended to benefit the world. I hope you'll enjoy what you read and come back for more.Most of all, I hope that through my stories, you'll forge a new depth of connection with the God who truly loves you.  Genre-Bending Christian Biblical, Historical, Suspense, Fantasy—Always Lyrical, Always Christian, Always Changing the GameReaders would be forgiven for asking what genre exactly Rachel Starr Thomson writes. Her work is described as spiritual, visionary, biblical, fantasy—and literary, poetic, and anchored in the real world.Always a clean read, her books are suitable for teens but have the depth, beauty, and characterization to keep adults riveted.They",
  "genres": [
    "Fantasy",
    "Fiction",
    "Christian Fiction",
    "Christian Fantasy",
    "Christian",
    "Young Adult",
    "Paranormal"
  ],
  "author": "Rachel Starr Thomson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/5170684-worlds-unseen"
}