{
  "title": "The Hookup Equation",
  "description": "Teach me everything .My whole life, I’ve been a good girl. I follow rules like nobody’s business. I obey guidelines like I was born to it. Show me a line, and I’ll toe it.I’m even a twenty-two-year-old virgin. Good is my middle name.And then, I break one tiny little rule. Miniscule. Inconsequential.Next thing I know, I’m trapped with an incredibly handsome stranger. He’s got eyes like cut emeralds, biceps that makes my head spin, and a smile that has me rethinking all my life choices.We escape a bar bathroom together. We go on an impromptu date. We share the hottest kiss I’ve ever had, one that leaves me panting for more. We promise to see each other again.Turns out, we see each other the next morning.In my calculus class.Which he’s teaching.My handsome, sexy date is Professor Loveless, and we’ll be seeing each other plenty. Every Monday, Wednesday, and Friday all semester.There’s no choice but to call it off. We both have too much at I could lose my scholarship, and he could lose his entire career.But I can’t call off the way I feel.I can’t call off the way he looks when he rolls up his sleeves and explains imaginary numbers.I can’t call off the heated glances, or the way our hands touch when I hand in my homework, or the memory of his body pressing against mine that night.I’m a virgin.He’s my professor.If we give in, it could cost us both everything.But I’m so tired of being a good girl.The Hookup Equation is the fourth book in the Loveless Brothers series, and can be read as a total standalone. It's for fans of high-heat, low-angst romantic comedies and anyone who's ever been hot for teacher. This one's got tons of forbidden steam, a high-stakes secret relationship, sibling banter, a heroine who really enjoys her first time, and a college setting that will make you feel like you're back on campus. There's an HEA, of course. (And yes, it bangs.)",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "College",
    "New Adult",
    "Adult",
    "Fiction"
  ],
  "author": "Roxie Noir",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/51726149-the-hookup-equation"
}