{
  "title": "Grace O'Malley: The Biography of Ireland's Pirate Queen 1530-1603",
  "description": "She was married twice, divorced once, took a lover when she wanted, and gave birth to one of her sons on the deck of her own ship. She was Grace O'Malley, the sixteenth-century Irish woman who provoked awe, anger, admiration, and fear in the English men who, by persuasion and by the sword, came to conquer the land of her birth.Born in 1530, the daughter of an Irish chieftain, she inherited her father's taste for the seafaring life and eventually took command of his fleet of galleys and their hard-bitten, all-male crews. For fifty years she traded the clan's produce in Ireland, Scotland, and Spain, skillfully practiced the time-honored craft of piracy and plundering, and led rebellions against the invading English. On land and sea she was a fearless leader, a political pragmatist, a ruthless mercenary, and a shrewd negotiator -- as shown in her fabled meeting with her rival and protector, Queen Elizabeth. And yet, as thrilling and fascinating as her life story is, what happened to her after her life is equally instructive.  She was literally \"disappeared\" from the pages of history, ignored by the official chroniclers and omitted from the great books of Irish and English history. Obviously, a woman who challenged the might of England and the traditional power of men -- a woman who did not let religious, social, or political convention get in her way -- could not be tolerated. But Grace O'Malley could not be erased from the hearts of her countrymen. Granuaile became a beloved figure in Irish folklore, the subject of countless stories, songs, and poems (several of which are included in this book's appendix). In the mid-1970s, aspiring author Anne Chambers decided to discover the truth behind the legends. After spending several years researching historical manuscripts and deciphering the swirls and flourishes of sixteenth-century handwriting, she published the first edition of this book. It became an international best-seller. Now she offers this updated edition of her work, enriched by further research that has revealed new documents and new details about the extraordinary woman know as Granuaile, Ireland's Pirate Queen.About the AuthorANNE CHAMBERS is a biographer, novelist, and screenplay writer. She holds an M.A. in History from the National University of Ireland. Her other books include Ranji: Maharajah of Connemara, As Wicked a Woman: Eleanor Countess of Desmond, and Adorable Diva, the biography of Margaret Burke Sheridan. She has also contributed articles to many books and magazines, including The Irish Arts Review.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Ireland",
    "Pirates",
    "Historical",
    "Irish Literature"
  ],
  "author": "Anne Chambers",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/51740647-grace-o-malley"
}