{
  "title": "Isolationism: A History of America's Efforts to Shield Itself from the World",
  "description": "In his Farewell Address of 1796, President George Washington admonished the young nation \"to steer clear of permanent alliances with any portion of the foreign world.\" Isolationism thereafter became one of the most influential political trends in American history. From the founding era until the Japanese attack on Pearl Harbor, the United States shunned strategic commitments abroad, making only brief detours during the Spanish-American War and World War I. Amid World War II and the Cold War, Americans abandoned isolationism; they tried to run the world rather than run away from it. But isolationism is making a comeback as Americans tire of foreign entanglement. In this definitive and magisterial analysis-the first book to tell the fascinating story of isolationism across the arc of American history-Charles Kupchan explores the enduring connection between the isolationist impulse and the American experience. He also refurbishes isolationism's reputation, arguing that it constituted dangerous delusion during the 1930s, but afforded the nation clear strategic advantages during its ascent.Kupchan traces isolationism's staying power to the ideology of American exceptionalism. Strategic detachment from the outside world was to protect the nation's unique experiment in liberty, which America would then share with others through the power of example. Since 1941, the United States has taken a much more interventionist approach to changing the world. But it has overreached, prompting Americans to rediscover the allure of nonentanglement and an America First foreign policy. The United States is hardly destined to return to isolationism, yet a strategic pullback is inevitable. Americans now need to find the middle ground between doing too much and doing too little.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "United States",
    "American History",
    "International Relations",
    "Political Science"
  ],
  "author": "Charles A. Kupchan",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/51751606-isolationism"
}