{
  "title": "The Alchemy of Us: How Humans and Matter Transformed One Another",
  "description": "In the bestselling tradition of Stuff Matters and The Disappearing Spoon a clever and engaging look at materials, the innovations they made possible, and how these technologies changed us. In The Alchemy of Us, scientist and science writer Ainissa Ramirez examines eight inventions--clocks, steel rails, copper communication cables, photographic film, light bulbs, hard disks, scientific labware, and silicon chips--and reveals how they shaped the human experience. Ramirez tells the stories of the woman who sold time, the inventor who inspired Edison, and the hotheaded undertaker whose invention pointed the way to the computer. She describes, among other things, how our pursuit of precision in timepieces changed how we sleep; how the railroad helped commercialize Christmas; how the necessary brevity of the telegram influenced Hemingway's writing style; and how a young chemist exposed the use of Polaroid's cameras to create passbooks to track black citizens in apartheid South Africa. These fascinating and inspiring stories offer new perspectives on our relationships with technologies.Ramirez shows how materials were shaped by inventors, but also how those materials shaped culture, chronicling each invention and its consequences--intended and unintended. Filling in the gaps left by other books about technology, Ramirez showcases little-known inventors--particularly people of color and women--who had a significant impact but whose accomplishments have been hidden by mythmaking, bias, and convention. Doing so, she shows us the power of telling inclusive stories about technology. She also shows that innovation is universal--whether it's splicing beats with two turntables and a microphone or splicing genes with two test tubes and CRISPR.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Audiobook",
    "Technology",
    "Book Club",
    "Chemistry"
  ],
  "author": "Ainissa Ramirez",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/51777430-the-alchemy-of-us"
}