{
  "title": "Thicker than Blood",
  "description": "The murder of one old friend and the revelation of a secret life by another leads Dr. Bailey Pogue to risk his life by going undercover for the CIA. But when he exposes a plot by an international crime syndicate that threatens to upset the balance of power in the Middle East, the revelation comes at a the syndicate has kidnapped his daughter. Now he must stop the trafficking of young girls and rescue his daughter while remaining undercover.Is saving those you love worth committing treason?GodFamilyCountryWill Pogue's loyalties prove too high a price to pay?I’m not qualified to serve in the CIA. I’ll admit it. But when asked to help expose an international crime syndicate plotting to upset the balance of power in the Middle East, the call of duty leaves me with no choice. We live in a time when duty, patriotism, and the freedoms so many of us enjoy is under both from abroad and at home. So let me if your daughter was kidnapped, how would you respond? If you had the chance to stop a sex trafficking ring of young girls would you step up and serve? Is saving those you love worth committing treason? We wrap ourselves in the American flag and swear before God that we will protect our family and country. But if we refuse to do our duty? What becomes of \"liberty and justice for all,\" then?Thicker than Blood is, or was for a time, a popular medical thriller and new release in Contemporary fiction during the month of February, 2020. Some readers of crime thrillers and psychological thrillers have called my story men's action adventure, a military thriller, and popular spy, CIA novel. It has also been shelved as a terrorism thriller novel and kidnapping suspense fiction. In my work I catalog infections, diseases, treatments and look for trends. Some readers have asked that I do the same with my story.Time Contemporary, 2020 African Bush, Congo, EncampmentsCharacter in the Doctor, Terrorists, Kidnap victim, Human traffickers, Murderer, Daughter, Mother, Tribal chiefStory Suspenseful, Terrifying, Captivating, Life and death situations, Heroism, Sacrifice– Dr. Bailey Pogue",
  "genres": [
    "Thriller",
    "Fiction",
    "Amazon",
    "Crime"
  ],
  "author": "Don Brobst",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/51786476-thicker-than-blood"
}