{
  "title": "Privacy is Power: Why and How You Should Take Back Control of Your Data",
  "description": "As the data economy grows in power, Carissa Véliz exposes how our privacy is eroded by big tech and governments, why that matters and what we can do about it. The moment you check your phone in the morning you are giving away your data. Before you’ve even switched off your alarm, a whole host of organisations have been alerted to when you woke up, where you slept, and with whom. As you check the weather, scroll through your ‘suggested friends’ on Facebook, you continually compromise your privacy. Without your permission, or even your awareness, tech companies are harvesting your information, your location, your likes, your habits, and sharing it amongst themselves. They're not just selling your data. They’re selling the power to influence you. Even when you’ve explicitly asked them not to. And it's not just you. It's all your contacts too. Digital technology is stealing our personal data and with it our power to make free choices. To reclaim that power and democracy, we must protect our privacy. What can we do? So much is at stake. Our phones, our TVs, even our washing machines are spies in our own homes. We need new regulation. We need to pressure policy-makers for red lines on the data economy. And we need to stop sharing and to adopt privacy-friendly alternatives to Google, Facebook and other online platforms. Short, terrifying, Privacy is Power highlights the implications of our laid-back attitude to data and sets out how we can take back control. If you liked The Age of Surveillance Capitalism , you’ll love Privacy is Power because it provides a philosophical perspective on the politics of privacy, and it offers a very practical outlook, both for policymakers and ordinary citizens.",
  "genres": [
    "Nonfiction",
    "Technology",
    "Politics",
    "Sociology",
    "Philosophy",
    "Science",
    "Business"
  ],
  "author": "Carissa Véliz",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/51781479-privacy-is-power"
}