{
  "title": "On Vanishing: Mortality, Dementia, and What It Means to Disappear",
  "description": "For fans of Atul Gawande’s Being Mortal, Eula Biss’s On Immunity, and Paul Kalanithi’s When Breath Becomes Air, On Vanishing offers an essential, empathic exploration of dementia, and in the process asks searching questions about what it means to face our own inevitable vanishingAn estimated 50 million people in the world suffer from dementia. Diseases such as Alzheimer’s erase parts of one’s memory but are also often said to erase the self. People don’t simply die from such diseases; they are imagined, in the clichés of our era, as vanishing in plain sight, fading away, or enduring a long goodbye. In On Vanishing, Lynn Casteel Harper, a Baptist minister and nursing home chaplain, investigates the myths and metaphors surrounding dementia and aging, addressing not only the indignities caused by the condition but also by the rhetoric surrounding it. Harper asks essential questions about the nature of our outsize fear of dementia, the stigma this fear may create, and what it might mean for us all to try to “vanish well.”Weaving together personal stories with theology, history, philosophy, literature, and science, Harper confronts our elemental fears of disappearance and death, drawing on her own experiences with people with dementia both in the U.S. health-care system and within her own family. In the course of unpacking her own stories and encounters—of leading a prayer group on a dementia unit; of meeting individuals dismissed as “already gone” and finding them still possessed of complex, vital inner lives; of witnessing her grandfather’s final years with Alzheimer’s and discovering her own heightened genetic risk of succumbing to the disease—Harper engages in an exploration of dementia that is unlike anything written before on the subject.Expanding our understanding of dementia beyond progressive vacancy and dread, On Vanishing makes room for beauty and hope, and opens a space in which we might start to consider better ways of caring for, and thinking about, our fellow human beings. It is a rich and startling work of nonfiction that reveals cognitive change as an essential aspect of what it means to be mortal.",
  "genres": [
    "Nonfiction",
    "Science",
    "Memoir",
    "Psychology",
    "Medicine",
    "Medical",
    "Health"
  ],
  "author": "Lynn Casteel Harper",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/51803274-on-vanishing"
}