{
  "title": "The Happily Ever After: A Memoir of an Unlikely Romance Novelist",
  "description": "A memoir about writing a novel about searching for love.Is romance dead? Is that why there are so many vampires in today's romance novels? When Avi Steinberg's love life took a grim turn, he did what he always does: He consulted his old books, the usual cast of Great (Very Serious, Usually Male) Authors. And he immediately realized that these books were part of the problem. Instead, he began to read romances, the books he--like so many of us--have been conditioned to dismiss as \"trashy.\" What he discovered was a genre that was tremendously diverse and daring, along with a vast network of innovative writers who were keeping the novel as alive as ever. His own relationship problems, he realized, came down to a failure of his imagination. And so he set out on a quest to write and publish a romance novel and to find real-life love.A hybrid of memoir, travelogue, and critical essay, The Happily Ever After chronicles an adventure in a brave new world of literature. Steinberg offers a report from the trenches of romance, moving between major industry conferences and writing groups at the local bar as he works and reworks his romance novel idea. He reveals the inside scoop from a major romance publishing house, crisscrosses the country meeting mysterious ghostwriters and Fabio's great unsung rival, and offers a running take on the fascinating history of romance writing, the genre that invented, and continues to reinvent, the modern novel. Along the way he meets many readers, each of whom sheds light on why we are so fascinated by--and phobic of--romance fiction and what the vitality and fractiousness of our biggest genre says about us.With quirky wit and disarming honesty, Steinberg captures an often misunderstood literary culture and learns, from its devoted practitioners, how to take the Happily Ever After seriously in his own life.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Writing",
    "Romance",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Avi Steinberg",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/51788763-the-happily-ever-after"
}