{
  "title": "Bloody Spade",
  "description": "A girl full of heartA thief touched by darknessA wayward golden boyAn unwitting servant of evilThe era of magic was thought to be a myth until the Reemergence unleashed powers both dark and light upon the mundane world. Now those touched by this strange magic—a specialized group of Empowered dubbed Jokers, known collectively as Cardplay—must defend their world from the malevolent forces that threaten to consume it, all the while fighting for equality in a society clinging to normalcy.But the Reemergence was only the beginning.When another influx occurs on the seventh anniversary of that fateful event, a clash at ground zero lands Iori Ryone, a teenage boy in possession of a corrupt legendary magic, in the care of recent Joker graduate Ellen Amelia Jane. From him, she learns the Reemergence may not have been the unforeseeable natural disaster it first seemed.Someone is behind these incidents, and with the criminal organization Blackjack as the prime suspect, it's up to Cardplay to find out what they're planning and stop them before it's too late.Bloody Spade is the first installment in an urban fantasy duology that follows a cat-eared thief and a scythe-wielding girl as they try to navigate his wild magic, her hotheaded brother, a sinister plot, and the feelings they're developing for each other.________________Content Warning- Coarse language- Blood and violence, some gore- Moments of graphic violence/torture- On-page character death- Body horror - Harassment/bullying- Vomiting- Poisoning- Amnesia- Grief/bereavement- Anxiety, PTSD, panic attacks- Trauma related to kidnapping/physical abuse- Parent death (discussed, glimpsed in flashbacks)- Car accident (discussed, glimpsed in flashbacks)- One instance of a forced kiss (not intended to be romantic or sexual)",
  "genres": [
    "Fantasy",
    "Queer",
    "Romance",
    "Young Adult",
    "LGBT",
    "Urban Fantasy",
    "Asexual"
  ],
  "author": "Brittany M. Willows",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/51804726-bloody-spade"
}