{
  "title": "She Came to Slay: The Life and Times of Harriet Tubman",
  "description": "In the bestselling tradition of The Notorious RBG comes a lively, informative, and illustrated tribute to one of the most exceptional women in American history—Harriet Tubman—a heroine whose fearlessness and activism still resonates today.Harriet Tubman is best known as one of the most famous conductors on the Underground Railroad. As a leading abolitionist, her bravery and selflessness has inspired generations in the continuing struggle for civil rights. Now, National Book Award nominee Erica Armstrong Dunbar presents a fresh take on this American icon blending traditional biography, illustrations, photos, and engaging sidebars that illuminate the life of Tubman as never before. Not only did Tubman help liberate hundreds of slaves, she was the first woman to lead an armed expedition during the Civil War, worked as a spy for the Union Army, was a fierce suffragist, and was an advocate for the aged. She Came to Slay reveals the many complexities and varied accomplishments of one of our nation’s true heroes and offers an accessible and modern interpretation of Tubman’s life that is both informative and engaging. Filled with rare outtakes of commentary, an expansive timeline of Tubman’s life, photos (both new and those in public domain), commissioned illustrations, and sections including “Harriet By the Numbers” (number of times she went back down south, approximately how many people she rescued, the bounty on her head) and “Harriet’s Homies” (those who supported her over the years), She Came to Slay is a stunning and powerful mix of pop culture and scholarship and proves that Harriet Tubman is well deserving of her permanent place in our nation’s history.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Feminism",
    "Audiobook",
    "Biography Memoir",
    "Historical"
  ],
  "author": "Erica Armstrong Dunbar",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/51788120-she-came-to-slay"
}