{
  "title": "How Beautiful We Were",
  "description": "From the celebrated author of the New York Times bestseller Behold the Dreamers, comes a sweeping, wrenching story about the collision of a small African village and an America oil company.\"We should have known the end was near.\" So begins Imbolo Mbue’s powerful second novel, How Beautiful We Were. Set in the fictional African village of Kosawa, it tells the story of a people living in fear amidst environmental degradation wrought by an American oil company. Pipeline spills have rendered farmlands infertile. Children are dying from drinking toxic water. Promises of clean-up and financial reparations to the villagers are made—and ignored. The country’s government, led by a brazen dictator, exists to serve its own interest. Left with few choices, the people of Kosawa decide to fight back. Their struggle would last for decades and come at a steep price. Told through the perspective of a generation of children and the family of a girl named Thula who grows up to become a revolutionary, How Beautiful We Were is a masterful exploration of what happens when the reckless drive for profit, coupled with the ghost of colonialism, comes up against one community’s determination to hold onto its ancestral land and a young woman’s willingness to sacrifice everything for the sake of her people’s freedom.\"The unforgettable story of a community on the wrong end of Western greed, How Beautiful We Were will enthrall you, appall you, and show you what is possible when a few people stand up and say this is not right. A masterful novel by a spellbinding writer engaged with the most urgent questions of our day.”—David Ebershoff, bestselling author of The Danish Girl",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Africa",
    "Literary Fiction",
    "Contemporary",
    "Book Club",
    "Audiobook"
  ],
  "author": "Imbolo Mbue",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/51795089-how-beautiful-we-were"
}