{
  "title": "The Long Roll Home",
  "description": "Cassie Blake lives a simple life on a ranch with her family. Although she hates having to go to the city, when a dear friend makes plans to come visit, Cassie makes the drive to the airport to get her friend. While waiting at the airport, an event occurs that will change her life forever. She is over a hundred miles from home when the power fails, cell phones die, cars cease working, and planes begin falling from the skies. As a disabled veteran who relies on an electric wheelchair to get around, Cassie and her service dog, Petra, must find a way to get home in spite the challenges of distance, lawlessness, and weather. She knows getting home might be the biggest challenge of her life. Will she be able to overcome the challenges to see her family again or will she become yet another victim? Excerpt Cassie reached over and turned the knob on the radio until music floated through the van. “There’s enough bad news in the world right now, and I’m tired of hearing about it,” she told the passenger sitting in the front seat. The passenger just looked at her without responding. “What’s the matter, Petra? You didn’t want to listen to that, did you? I know you’d rather listen to music while we’re driving.” Petra gave a small bark and went back to watching out the window. Cassie reached over and gave Petra a fond scratch behind her ears, causing the three-year-old German Shepherd to bark again. “What do you think, Petra, should we sing along to the music?” Petra barked once in response, bringing a grin to Cassie’s face. “That sounded like a yes to me.” Cassie began to sing along with the radio, and soon Petra was howling along with her. Petra was so much more than just a dog to Cassie. She was a best friend, a companion, and at times, a lifesaver. As a result, Cassie often treated Petra more like a human than a pet. She would hold long conversations with Petra, talking through some of her problems. Petra was a great listener, and even offered a bark or two in response to whatever her human was saying. After a while, the song ended and both Cassie and Petra became quiet. “We’re almost there, girl. Not too much longer now. Are you ready to get some breakfast and see Jen?” Petra barked with excitement, although Cassie wasn’t really sure if it was at the thought of breakfast or seeing Cassie’s friend. The sun was barely over the horizon as Cassie turned into the airport parking garage. Jen’s flight was not due to arrive for about an hour and a half, but Cassie liked to get places early. She hated being late, and she especially hated having to rush. Her plan was to settle down in one of the restaurants near the baggage claim area and enjoy a good breakfast while she waited. Traffic in the airport was light and Cassie was happy to find a handicapped parking space right up front next to the baggage claim area. After parking her van, she took a minute to look in the mirror. The face looking back at her was pleasant enough in a wholesome sort of way. She wore no make-up, but her deep blue eyes were shining with excitement. Her nose was straight, and lightly dusted with freckles. She wore her long dark hair in a single braid down her back. Dressed in a flannel shirt, jeans, and boots, Cassie was slender, but muscular. She quickly adjusted a few stray hairs and applied lip gloss, and decided she was as ready as she was going to get. She quickly activated the controls on her electric wheelchair and undid the safety strap that held it in place on the driver’s side of the vehicle. After turning the chair around, she opened the door and pressed the button for the ramp to deploy. Petra remained quietly in her seat until Cassie called, “Petra, come.” At that command, Petra jumped over the seat and hopped out of the van.",
  "genres": [
    "Post Apocalyptic"
  ],
  "author": "Diana E. Anderson",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/51793896-the-long-roll-home"
}