{
  "title": "The Crimson Pact Volume Two",
  "description": "The digital Special Edition of Volume 2 includes eleven bonus behind-the-scene \"about the stories\" essays from the authorsThe Pact is back and demons are as devious as ever in The Crimson Pact Volume 2.Read 28 original stories (over 500 pages in print!), including many sequels to stories in volume one. Suzzanne Myers’s powerful flash fiction piece, “Withered Tree” continues with the exceptional short story, “Seven Dogs.” Chanté McCoy’s “Inside Monastic Walls” is followed by the literally gut-wrenching follow-up short story, “Body and Soul.” Urban fantasy mayhem is off the charts with rising star Patrick Tomlinson’s “Monsters in the Closet” and D. Robert Hamm’s “Karma.” Steampunk your thing? EA Younker’s steampunk apocalypse tale “Stand,” Sarah Hans’ sequel about professor Campion, “A More Ideal Vessel,” and Elaine Blose’s steampunk Western “Wayward Brother” will whet your appetite.The dark fantasy and adventure continues in “Dark Archive,” Sarah Kanning writes how Danielle from “Hidden Collection” must deal with the lingering effects of being possessed by a demon. Volume two mixes sequels from Gloria Weber, Justin Swapp, and Isaac Bell with new stories from Lester Smith, K.E. McGee, Adam Israel, Valerie Dircks, T.S. Rhodes, Elizabeth Shack, Daniel Alonso, and Nayad Monroe.New York Times Bestselling author and Campbell award nominee Larry Correia presents an exclusive short story, “Son of Fire, Son of Thunder” co-authored by Steven Diamond, about an FBI paranormal investigator and a bad ass marine who knows the exact moment of his own death. Travel to the alternate history Earth of the “Red Bandanna Boys” by Patrick M. Tracy and find out how ruthless you have to be to survive the slums of St. Nikolayev. Follow “The Trail of Blood” by Alex Haig, a horrifying Western about a bounty hunter who wants vengeance, not money. Hunt for Nazis in a disturbing 1950’s America in “Hunters Incorporated” by Kelly Swails. Patrol the steaming jungles of Vietnam with a squad of soldiers in Lon Prater’s “Last Rites in the Big Green Empty.” Then enter the mind of a godlike demon in Donald J. Bingle’s ambitions tale, “Dark Garden,” or visit the creepy shadow world created by Richard Lee Byers in “Light and Dark.”",
  "genres": [
    "Anthologies",
    "Horror",
    "Fantasy",
    "Science Fiction"
  ],
  "author": "Paul Genesse",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/12558575-the-crimson-pact-volume-two"
}