{
  "title": "Double Trouble: Two Werewolves for Brian",
  "description": "Can one human handle two alpha werewolves? Brian Holt is about to find out...\nBrian never fantasized about being claimed by a werewolf. The appeal is obvious--werewolves tend toward unfairly attractive in that whole ruggedly handsome and muscle-bound way--but being chosen is the kind of thing that only happens to people on the news. It's like winning the lottery or falling into a sinkhole. It's not something that would realistically happen to him. Except it did, and then the werewolf changed his mind.Three years after being told that choosing him was a mistake, Brian is trying to get on with his life when news spreads that there's a werewolf on campus. Hiding away in his apartment, the very last thing Brian expects is for the stud to come knocking on his door...(This 100k word romance novel features two scorching hot alpha werewolves with a kink-list three pages long, a confused young man, and more secrets than you can shake a stick at. The story contains BDSM, a well equipped playroom, and questionable werewolf anatomy. It has a guaranteed HEA.)***There was a knock at the door. Expecting his best friend Luke, Brian put the dish towel down and walked across the room to open it.It was the werewolf. He was tall, head reaching almost to the top of the door, with wide shoulders and a trim waist, his boulder-like biceps making the sleeves of his leather jacket bulge.He was huge.Looking up, Brian took in the man's mountainous pectorals and the thick neck exposed by his unzipped jacket. He had thin lips and a dimpled chin, with a strong jaw and sharp cheekbones that landed him on just the right side of too pretty. Meeting the werewolf's eyes for a fraction of a second, blue so pale they almost looked gray, Brian had to look away at the sight of sheer want in the other man's eyes.His belly tingled with heat like it hadn't done since... since the last time a werewolf had looked at him like that.Brian ducked his head, staring at the werewolf's denim clad legs and huge boots before forcing himself to look up again. The werewolf's expression was still heated, his eyes locked on Brian with an intensity that made his insides squirm.\"Can I come in?\"",
  "genres": [
    "BDSM",
    "M M Romance",
    "Omegaverse",
    "M M M",
    "Shapeshifters",
    "Paranormal",
    "Menage"
  ],
  "author": "D.J. Heart",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/51809462-double-trouble"
}