{
  "title": "The Ring",
  "description": "From the New York Times bestselling author Sandi Lynn comes a brand new romance about the lives of two people bound by destiny.  Adalyn  It all started with a ring. A beautiful ring I found at the bottom of the ocean while scuba diving on vacation. From the moment the ring was in my possession, bad luck followed me everywhere and turned my entire life upside down.  On the inside of the band there was an inscription: To my darling Mary. My soulmate for eternity.  After a string of tragic events, the ring led me to New York hoping to return it to its rightful owner. That’s where I met Harrison Grant. The man who swooped in and saved me from my near brush with death on the busy streets of New York City. He was handsome, rich, arrogant and unavailable emotionally. The last thing I wanted was any further contact with him. But by the hand of fate, the two of us were thrown together into a working relationship. It was an offer I couldn’t refuse since I’d lost everything after finding the ring. My name is Adalyn Banks, and this is my story of how one ring changed my life forever.  Harrison  I was living my life the way I wanted by being successful, rich, and dating a multitude of beautiful women whenever I wanted. I wasn’t tied down in a relationship, and I didn’t answer to anybody but myself. Then I met Adalyn Banks. A woman who almost got run down in the middle of the busy New York City street. She was beautiful and innocent. The short time I spent with her, I felt a pull that I’d never felt before. I got away from her as fast as I could, and just when I thought it was safe, my sister hired her as my interior designer for the new townhome I purchased. I blamed the ring. If she never would have found it, she never would have come to New York, and I wouldn’t be fighting the demons inside me I never had to fight before. My name is Harrison Grant, and this is my story of how one woman and a ring changed my life forever.  18+",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Erotica",
    "Adult",
    "Enemies To Lovers"
  ],
  "author": "Sandi Lynn",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/51806934-the-ring"
}