{
  "title": "The Marilians",
  "description": "Her determination will save humanity. Her power will save the universe.Melanie is shocked to discover her unborn baby has wings and extraordinary powers. But that doesn’t stop her from joining the fight against the blood-thirsty Marilians.When they discover a Marilian scout hiding near the human’s quarters, Mel realizes the invasion is imminent.  This means all the surviving humans must train and prepare for battle.  Including her husband and four children.  But there’s no choice if they hope to stop the alien invasion.As the angels and human survivors train for the battle of a lifetime, Mel wonders about the child growing inside her, a child like no other in the universe. Amid their hectic preparations, friendships build between not only survivors but also humans and angels. Unconventional love forms between races while facing a tragic loss. However, there is no time to grieve.Meanwhile, Earth’s angels make their own plans when they summon both their elders and an ancient alien race of dragons to help defend Earth.Angels, dragons, and humans fight for Earth and the survival of humankind in a war where aliens control fire, and their bite or scratch transforms any lifeform into one of them.“I must say this book is very-timely, relevant, beautiful, gripping, astonishing and just the story that I need for me to go back to reading more on the fantasy genre. I’m giving this book my 5-star rating for all the emotions, the beautiful scenes, the ending that I never expected, and the new world that it opens to my imagination time and again. Definitely, I will be reading the last book of this series as I will not miss being part of this story of the alien angels and human survivors.” The Book Estuary on The Marilians.“Great Book. I loved getting to know the characters and seeing how they overcame this exciting journey. I look forward to the next book.” Author Lyndsay Whitlock on The Marilians.“It's a celebration of supernatural and folklore that will keep you yearning for more. Beth Worsdell will set your world on fire with her latest exciting addition to the Earth's Angels Trilogy Series. With her ceaseless efforts to entice her readers: she will set your heart ablaze, blending your imagination with a spark of folklore and science fiction.” The Book Info on The Marilians.\"Beautifully written and full of feeling, this book and series as a whole gives us a compelling tale with a truly unique premise. It is quite unlike any other type of book in the genre, both due to its imaginative content as well as writing style. Beth Worsdell gives us an apocalyptic, science fiction, environmental fantasy tale that seamlessly blends everything together and tops it all off with a hell of a lot of feeling. Anger, guilt and frustration, relief and compassion, you'll get to experience all of these through this book.\" The Book Dragon on The Marilians.",
  "genres": [],
  "author": "Beth Worsdell",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/51803905-the-marilians"
}