{
  "title": "Faith",
  "description": "Wyatt Walker won't fall victim to the same spell that ensnared his twin brother and cousin. Whatever force compelled both men to become whipped by their mates, Wyatt wants nothing to do with. He has his hands full with his bar, and their ever-growing wolf pack. Besides, someone needed to stay available to the single population of Walker County.  When he meets Kansas, a customer just passing through, it’s Wyatt’s job, his duty, to show Kansas a good time for the night—or a few hours. Then Wyatt wakes up in a daze, his bar has been robbed, and Kansas is gone.  Kansas hasn't regretted his way of life in a long time. He's also never used his mysterious powers to take from someone quite as alluring as Wyatt Walker. But Kansas operates under a strict set of morals. He never takes from a person who can’t afford to lose a little and he never dips in the same well twice. That Kansas even considers returning to Wyatt’s bar proves how dangerous he is. There was something different about that man, a fact that only proves true when Wyatt becomes the first person to ever catch him.  And now, he’s demanding that Kansas pays up.  Wyatt’s got everything under control. He’ll handle the cunning robber, without developing the F word—feelings. He’ll handle the elders’ latest attack. Those cowards couldn’t intimidate Wyatt’s family so now they were using pack politics to attempt to control them.  When a horrible crime rocks the Walker County wolf pack, all eyes look to Wyatt, the last man to fight with the elders. More importantly, that F word went and became a whole heck of a lot more and Wyatt will have to figure out not only how to keep his family’s freedom, but how to keep his mate. Stubborn determination didn’t work. He’s gonna need faith.  Faith is the third book in the Wolves of Walker County series. It is packed with fun, humor, and steam. A playboy finds his mate, a man in need of help finds his family, and the Walker cousins fight once more for their freedom. For maximum enjoyment, this quartet should be read in order.  Wolves of Walker County: Truth Hope Faith Love",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Omegaverse",
    "Fantasy",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/51827426-faith"
}