{
  "title": "Riviera Gold",
  "description": "Mary Russell and Sherlock Holmes turn the Riviera upside down to crack their most captivating case yet in the New York Times bestselling series that Lee Child called \"the most sustained feat of imagination in mystery fiction today.\"It's summertime on the Riviera, and the Jazz Age has come to France's once-sleepy beaches. From their music-filled terraces, American expatriates gaze along the coastline at the lights of Monte Carlo, where fortunes are won, lost, stolen, and sometimes hidden away. When Mary Russell and Sherlock Holmes arrive, they find their partnership pulled between youthful pleasures and old sins, hot sun and cool jazz, new affections and enduring loyalties.Russell falls into easy friendship with an enthralling American couple, Sara and Gerald Murphy, whose golden life on the Riviera has begun to attract famous writers and artists--and some of the scoundrels linked with Monte Carlo's underworld. The Murphy set will go on to inspire everyone from F. Scott Fitzgerald to Pablo Picasso, but in this summer of 1925, their importance for Russell lies in one of their circle's recent additions: the Holmeses' former housekeeper, Mrs. Hudson, who hasn't been seen since she fled England under a cloud of false murder accusations.When a beautiful young man is found dead in Mrs. Hudson's front room, she becomes the prime suspect in yet another murder. Russell is certain of Mrs. Hudson's innocence; Holmes is not. But the old woman's colorful past has been a source of tension between them before, and now the dangerous players who control Monte Carlo's gilded casinos may stop at nothing to keep the pair away from what Mrs. Hudson's youthful history could bring to light.The Riviera is a place where treasure can be false, where love can destroy, and where life, as Mary Russell and Sherlock Holmes will discover, can be cheap--even when it is made of solid gold.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Audiobook",
    "Adventure"
  ],
  "author": "Laurie R. King",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/51825104-riviera-gold"
}