{
  "title": "The Spymasters: How the CIA Directors Shape History and the Future",
  "description": "From the New York Times bestselling author of The Gatekeepers, a remarkable, behind-the-scenes look at what it’s like to run the world’s most powerful intelligence agency—the CIA—as well as a sobering glimpse at the espionage and surveillance challenges of the future.Only fourteen men and one woman are alive today who have made the life-and-death decisions that come with running the world’s most powerful and influential intelligence service. With unprecedented, deep access to all these individuals, Chris Whipple tells the story of an agency that answers to the United States president alone, but whose activities—spying, espionage, and covert action—take place on every continent.Since its inception in 1947, the Central Intelligence Agency has been a powerful player on the world stage, operating largely in the shadows to protect American interests. For The Spymasters, Whipple conducted extensive, exclusive interviews with nearly every living CIA director, pulling back the curtain on the world’s elite spy agencies and showing how the CIA partners—or clashes—with counterparts in Britain, France, Germany, Israel, Jordan, Saudi Arabia, and Russia. He covers every topic from the influence of the White House on intelligence activity to simmering problems in the Middle East and Asia to rogue nuclear threats and cyberwarfare.A revelatory look at the CIA’s impact across the globe, The Spymasters uncovers the inside stories behind the CIA’s seven decades of activity and elicits predictions about which issues—and threats—will occupy the espionage and surveillance landscape of the future. Including eye-opening interviews with George Tenet, John Brennan, Leon Panetta, and David Patraeus, as well as those who’ve just recently departed the Agency, this is a timely, essential, and important contribution to current events.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Espionage",
    "Biography",
    "Audiobook",
    "American History"
  ],
  "author": "Chris Whipple",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/51811923-the-spymasters"
}