{
  "title": "Everything Beautiful in Its Time: Seasons of Love and Loss",
  "description": "Jenna Bush Hager, the former first daughter and granddaughter, bestselling author, and coanchor of the Today show, shares moving, funny stories about her beloved grandparents and the wisdom they passed on that has shaped her life.To the world, George and Barbara Bush were America’s powerful president and influ­ential first lady. To Jenna Bush Hager, they were her beloved Gampy and Ganny, who taught her about respect, humility, kindness, and living a life of passion and meaning—timeless lessons that continue to guide her.In Midland, Texas, Jenna’s maternal grandparents, Harold and Jenna Welch—Pa and Grammee—a home builder and homemaker, lived a quieter life outside the national spotlight. Yet their influence was no less indelible to their granddaughter. Throughout Jenna’s childhood and adolescence, the Welches taught her the name of every star in the sky, the way a dove uses her voice—teaching her to appreciate the beauty in the smallest things.Now the mother of three young children, Jenna pays homage to her grandparents in this collection of heartwarming, intimate personal essays. Filled with love, laughter, and unforgettable stories, Everything Beautiful in Its Time captures the joyous and bittersweet nature of life itself. Jenna reflects on the single year in which she and her family lost Barbara and George H. W. Bush, and Jenna Welch. With the light, self-deprecating charm of the bestselling Sisters First—cowritten with her twin sister, Barbara—Jenna reveals how they navigated this difficult period with grace, faith, and nostalgic humor, uplifted by their grandparents’ sage advice and incomparable spirits.In this moving book, Jenna remembers the past, cherishes the present, and prepares for the future—providing a wealth of anecdotes and lessons for her own children and all of us. Poignant and humorous, intimate and sincere, Everything Beautiful in Its Time is a warm and wonderful celebration of the enduring power of family and an exploration of the things that truly matter most.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Family",
    "History"
  ],
  "author": "Jenna Bush Hager",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/51822870-everything-beautiful-in-its-time"
}