{
  "title": "Constellation Planet",
  "description": "Enter Jason Falloon's spectacular Dreamerverse for the first time in his dystopian fantasy epic, Constellation Planet - the opening episode of the Dreamerverse saga.Two contradicting dimensions must never cross paths, a mysterious entity hopes to accomplish just that, and three Dreamers have been selected at random to extinguish the chaos. Their success can only be achieved by procuring a rare, almighty resource. In a distraught near-future, such a powerful mineral is craved by all humanity, who have endured the wars and shortcomings of a redundant and crippling existence. This broken reality is the world these reluctant heroes left behind, and their greatest trial of all may be overcoming its influences...Drifting to sleep one night, Oscar, Samuella and Camson materialise on Constellation Planet – a paradisiacal nirvana in the Dreamerverse, collectively piloted by their own versatile imaginations. On awakening there, the unlikely trio establish that they’ve been enlisted as Night Dreamers by the Stellar Gods, the unseen authority of this spectacular dimension. As Night Dreamers, they have been ordained with the responsibility of dealing with the Drag-in, an inter-dimensional nightmare that re-emerges once every generation to devour the mental void separating the Dreamerverse from reality.Back home, their real world (Mankind’s World, 2058) encapsulates a despondent humanity, torn by many years of resource wars between East and West. It is a civilisation that has long since succumbed to an advanced digital age and is divided into eight sovereignly independent Nations. For decades, these territories have been presided over by vain dictators who yearn for the capitulation of their foreign neighbours and under whom their antisocial citizens are subdued by persecution from the cruel A.I. law force. But now a strange and unprecedented political alliance is in motion between two enemy tyrants and their prospects for power may be the final straw for co-existence.Will the Night Dreamers live up to their duty and defeat the Drag-in for another generation? And how much will the repercussions of their quest affect reality? But, most importantly of all, why have they been chosen and what mysterious force has brought all three of them together?Constellation Planet is the first installment of the Dreamerverse Series and the debut novel from Jason Falloon. High-stakes and visually absorbing from start to finish, Constellation Planet marks the beginning of a fascinating journey into an alternate reality. This initial breath-taking chapter in the Dreamerverse Series explores the frightening potential of humanity's furthest sociopolitical extremes, where individual beliefs are shaken, old and new philosophies are challenged, and the edge of civility is met by even the most rational of characters. This thrilling introduction to the unpredictable Mankind's World highlights a riveting conflict - both physical and metaphysical - that paints a speculative microcosm for the sociopolitical battle between contemporary liberalism and traditionalism.",
  "genres": [],
  "author": "Jason Falloon",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/51822189-constellation-planet"
}