{
  "title": "Fire Maidens: Ireland",
  "description": "Magic, shifters, and a pot of gold at the end of the rainbow. Inheriting a cottage in Ireland seems like a stroke of pure luck to Grace Connolly — as is a chance meeting with her mysterious (and hot) new neighbor. Soon, Boston’s most up-and-coming harpist finds herself mixing business with pleasure and getting to know Finn Hurley — intimately.But all is not as it seems with the alluring man from next door, nor in the seaside village of Ballyfianna. Magic, shapeshifters, and legendary pots of gold? The surprises don’t end there — not when Grace’s family secrets come to light. Before she knows it, her mini adventure — and sizzling romance — become a fight between good and evil. Ruthless enemies are muscling in on Finn’s home turf, and Grace will need more than the luck of the Irish to survive. Does she dare unleash the hidden power within her — a force she’s been warned never to use?After a decade of military service, dragon shifter Finn Hurley is finally free to track down the elusive beauty he’s secretly loved for years. When he discovers her in his home town, it seems like destiny is smiling on him. He should have known nothing in life comes easy — especially love.Because Ballyfianna is no longer the peaceful, sleepy place it once was, and Grace has unwittingly become involved in its troubles. Bitter enemies from beyond its borders plot to seize power, while traitors conspire within. But they are mere puppets to an even more treacherous enemy lurking in the background. Can this battle-weary warrior defeat evil and finally find his happy end? Don't miss Anna Lowe’s FIRE MAIDENS: Billionaires & Bodyguards series! Danger lurks over Europe, where a ruthless dragon clan plots to seize power in the grandest, most glamorous cities. The guardians of old have summoned a new generation of shifter heroes to protect the castles, cathedrals, and cobblestoned streets of their ancestral homes — and to seek out the last of the Fire Maidens, women coveted by the dark lords for their royal blood. Those women are absolutely off-limits to the young warriors tasked with protecting them. But destiny, of course, has other ideas…",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Suspense",
    "Romance",
    "Dragons",
    "Shapeshifters"
  ],
  "author": "Anna Lowe",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/51818874-fire-maidens"
}