{
  "title": "Here for It; Or, How to Save Your Soul in America: Essays",
  "description": "From the creator of \n\nElle\n\n's \"Eric Reads the News,\" a poignant and hilarious memoir-in-essays about growing up seeing the world differently, finding his joy, and every awkward, extraordinary stumble along the way. \nR. Eric Thomas didn't know he was different until the world told him so. Everywhere he went—whether it was his rich, mostly white, suburban high school, his conservative black church, or his Ivy League college in a big city—he found himself on the outside looking in.In essays by turns hysterical and heartfelt, Eric redefines what it means to be an \"other\" through the lens of his own life experience. He explores the two worlds of his childhood: the barren urban landscape where his parents' house was an anomalous bright spot, and the verdant school they sent him to in white suburbia. He writes about struggling to reconcile his Christian identity with his sexuality, about the exhaustion of code-switching in college, accidentally getting famous on the internet (for the wrong reason), and the surreal experience of covering the 2016 election as well as the seismic change that came thereafter.Ultimately, Eric seeks the answer to the ever more relevant question: Is the future worth it? Why do we bother when everything seems to be getting worse? As the world continues to shift in unpredictable ways, Eric finds the answers to these questions by re-envisioning what \"normal\" means, and in the powerful alchemy that occurs when you at last place yourself at the center of your own story.For fans of Samantha Irby, Michael Arceneaux, and David Sedaris, Here for It will resonate deeply and joyfully with everyone who has ever felt pushed to the margins, struggled with self-acceptance, or wished to shine more brightly in a dark world. Stay here for it—the future may surprise you.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Essays",
    "Audiobook",
    "Humor",
    "LGBT",
    "Queer"
  ],
  "author": "R. Eric Thomas",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/51844401-here-for-it-or-how-to-save-your-soul-in-america"
}