{
  "title": "The Backgammon Chronicles: A Pro's Adventures on Tour, Volume 2 of 2",
  "description": "This volume rejoins the backgammon epic in mid-2011, just as its carnival years were winding down. The projects of online money backgammon and television series on the poker model were failing; and with their demise a new landscape came in to view: drawn in deeper hues, it revealed a backgammon geography with centers of power in Japan, Denmark, Turkey and the United States and a re-imagination of the game itself--from its traditional role as a gambling recreation to that of a true mind sport--with a player's excellence no longer judged by his \"earn\" but by the rating assigned him by artificial-intelligence programs (\"bots\") that were stronger than any human. A hustler no longer, the hero of the second decade of the 21st century emerged as a dedicated statistical scientist, training with the same AI that would judge him in his noble quest for backgammon truth.This fresh paradigm led to the staging of several exceptional events, the most eminent of which was an annual team match that pitted Denmark against \"the rest of the world.\" This might sound like an unfair contest, but it was hardly so, for that small Scandinavian nation was undoubtedly (for reasons carefully explained in Chronicles) by far the world's strongest. The author made the World team four times, in 2011, 2012, 2014 and 2015, and did his best to record not only the decisions that were eventually made by the teams but also the passionate debates that led to them. Disciples of the analysis programs that these masters of the game may have been, they were far from robotic themselves--and this volume faithfully reproduces some of the fascinating ground-zero interplay, under terrific pressure, of visceral emotion and brilliant intelligence. To further emphasize the players' humanity: when at last they could not agree with one another, they frequently relieved the tension with bets!The author followed the tour as it continued with new sponsors and destinations. His travels took him to Gibraltar, the legendary British fortress at the southern tip of Spain that has lately become a gaming and offshore banking haven; to the exotic Black-Sea republic of Georgia, where, as in most Middle-Eastern countries, backgammon is the national game, played by everyone--young, old, rich, poor, male and female; and to North Cyprus, which nowadays is to nearby Islamic lands something like what Cuba used to be to the USA: an offshore refuge for gamblers whose preferred recreations are prohibited at home. And the island's casinos treat their customers as Vegas did theirs 40 years ago: with cheap rooms, 24-hour buffets, and open bars where the free alcohol never stops flowing. The weather is fine, so it's no surprise that the turnout for Cyprus is always huge. Full disclosure: though contrary to the author's principles, this volume contains a baklava food-porn photo (there are about 15 varieties on offer every day, all day long).",
  "genres": [],
  "author": "Robert H Wachtel",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/51830955-the-backgammon-chronicles"
}