{
  "title": "Heaven On Earth: A Reality of Life",
  "description": "Find Your Purpose. This is Why You’re Here!Whether atheist, agnostic, religious or sceptic, every person has a deep, intuitive knowledge or perception of the existence of God. For those who haven’t found Him yet, it’s like a void in their lives that just needs to be filled. Journeying through life, searching for something to satisfy that spiritual inadequacy is discouraging.Religion has always been mankind’s endeavour to reach this God, but in the end, it’s a man-made effort. It is humanity’s way of filling the void in their lives which, nevertheless, culminates in one-sided rituals. Tradition and culture are no different, they help provide a sense of solidarity in this lost endeavour. There is, however, a common thread in all this searching. A thread that binds all people together — Relationship.Mankind was created for relationship. It is in our DNA. Although people try to fill the void through inter-personal relationships, the truth is — this void is God-shaped. It can only be filled by God Himself. You can only be made complete through a relationship with Him.Eternity is a reality that, in truth, cannot be called 'endless’ or 'vast.' Simply because it is not confined to time or space. Jesus said, \"I am the way and the truth and the life. No one comes to the Father except through me.\" The Father brought us into Him by placing us in Jesus. Jesus is the perfect relationship we enjoy with the Father.In the Father, we don’t grow into higher levels of understanding. It really isn’t about understanding to begin with. It’s about 'knowing God.' It’s about growing into a deeper, more intimate and personal relationship with the Father, through Jesus. We don’t go higher, we go deeper into the Heart of the Father. The deeper we go, the more personal He makes it. The deeper we get, the more of Himself He reveals.Eternity is about relationship with God.Go Deeper Still…To know more visit LifeDeeperStill.com",
  "genres": [],
  "author": "Kurt daSilva",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/51831560-heaven-on-earth"
}