{
  "title": "Cruising the Mississippi: From New Orleans to Memphis on a Genuine Paddlewheeler",
  "description": "In crossing another travel adventure off their bucket list, two retirees take a fascinating river cruise and find the heart and soul of the American South.Born travelers Al and Sunny Lockwood seized their dreams of exploring America's natural wonders. From hiking Sierra Nevada mountain trails to photographing wildflowers in Death Valley, they've documented their fascinating journeys to critical acclaim.A serious car wreck changed their lives. They stopped postponing their dreams of ocean cruises.Now, these veteran travelers embrace a new travel adventure: a river cruise up the magnificent Mississippi.Join Al and Sunny on the decks of an antebellum paddle-wheel riverboat as they experience the culinary delights, rich architecture, breathtaking vistas, and famous hospitality of southern culture.You'll visit lavish plantation mansions, honor the fallen at Civil War memorials, and be swept away by the magical beat of authentic New Orleans jazz. Before the journey ends, you'll witness how the couple's first impressions are challenged, changing their hearts forever.In Cruising the Mississippi, you'll discover:-Fascinating histories of riverside cities-Little-known facts about famous landmarks-Personal reflections and insights from their daily experiences-Tested travel tips and advice for embarking on your own river cruise adventure-The lifelong benefits of immersing yourself in different customs and cultural experiences-A detailed tour of the historic paddle-wheel riverboat, and much, much more!If you like cultural exploration, American history, practical travel insights, colorful characters, and authentic personal stories, you'll love Al and Sunny Lockwood's illuminating exploration of America's mightiest waterway.Buy Cruising the Mississippi today and embark on a breathtaking adventure for the young at heart!",
  "genres": [
    "Nature",
    "Nonfiction"
  ],
  "author": "Sunny Lockwood",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/51851809-cruising-the-mississippi"
}