{
  "title": "America (The Book): A Citizen's Guide to Democracy Inaction",
  "description": "From Publishers WeeklyCheeky, irreverent and playfully ingenuous, this abbreviated history of democracy is everything one would expect from the writers of Comedy Central's fake news program, which recently (and somewhat scandalously) won the Television Critics Association's award for outstanding news and public affairs series. The book is laid out like a textbook, with \"Discussion Questions\" (\"Why do you think the Framers made the Constitution so soul-crushingly boring?\"), \"Classroom Activities\" (\"Using felt and yarn, make a hand puppet of Clarence Thomas. Ta-da! You're Antonin Scalia!\") and plenty of amusing graphics, including a board game that resembles the game Life but which follows a presidential term: \"Optimistic press release on economy ineffective. Spin again.\" No one evades the authors' scrutiny, not even the Pilgrims, who came to America \"to escape religious persecution... create a society where they could worship as they pleased and one day, God willing, even do some persecuting of their own.\" The media fares the worst, however. An entire chapter is devoted to telling the \"inspirational\" story of how the media \"transformed itself from a mere public necessity into an entertaining profit center for ever-expanding corporate empires.\" But if this and other criticisms kindle a few unpatriotic feelings, a section describing how worse off the rest of the world is should buoy spirits. From its dedication (\"To the huddled masses—Keep yearnin'!\") to its final chapter, which lampoons the 2004 presidential candidates, this humorous sendup of American politics never fails to entertain, poke fun and provoke thought. Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Politics",
    "Comedy",
    "History",
    "Audiobook",
    "American History"
  ],
  "author": "Jon   Stewart",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/518428.America_The_Book_"
}