{
  "title": "The Backgammon Chronicles: A Pro's Adventures on Tour, Volume 1 of 2",
  "description": "The Backgammon Chronicles: A Pro's Adventures on Tour  is a lush, two-volume, full-color cornucopia of gambling stories, character sketches, historical essays and tournament drama that takes the reader on an insider's odyssey through backgammon's last whirlwind decade--with its author, one of the game's elite competitors, as guide.Introducing you to the game's stars even as he narrates his clashes with them in a score of exotic venues, Robert Wachtel frames the action against an overview of the events and crises that have defined contemporary backgammon: the advent of the artificial-intelligence programs and their virtual extinction of the game's traditional role as a gambling recreation; the ecstatic birth and untimely death of online play; the burst of investment and enthusiasm brought to the game by the poker boom; and current trends: the outreach of Western backgammon culture back towards the game's birthplace, the Middle East; and the efforts of the federations of the major nations to establish a viable global community.Volume 1 begins in 2008, when the formulas that had fueled a worldwide poker boom were being tested in Europe and the Middle East on the internationally more popular and beloved game of backgammon. The scene was intoxicating: games for every stake, from pennies to thousands of dollars, were available 24/7 online, with live tournaments held year-round in lavish resorts, their prize pools fortified by great dollops of money added by casinos, hotels, and assorted gambling platforms. Entrepreneurs--their eyes starry with visions of the sort of high-stakes tours, galas, books, films and TV series that had reaped easy profits for media and gaming concerns in promoting poker--were taking meetings and arranging financing.The author is both a peer and a friend of backgammon's best and brightest. The reader will meet those brilliant, quirky characters up close in these pages as Robert faces off against them in tournament play and engages them in a special entertainment of his own device, dubbed by ex-world #1 Mike Natanzon (trade name: Falafel) \"The Chronicles.\"Chronicles are histories; and so these volumes are aptly named, for they are indeed episodes of the author's backgammon adventures. But the title has a double meaning: the books are chronicles in Falafel's sense as well, for the special entertainment mentioned above figures prominently in many of their tales. At a major tournament the author would gather together as many top players as possible and ask them to solve backgammon dilemmas he'd encountered over the board--and often gotten wrong. The format always aroused the experts' competitive instincts, provoking them to argue, bluster, and challenge one another as they backed their opinions with hefty side bets. A lover of the game could hardly hope for a more exciting experience than watching these sparks fly.This volume is a travelog as well, for the tournament trail the players followed was well worth photographing: Stockholm; Prague; Copenhagen; Paris; Velden (Austria); Montreux (Switzerland); Oulu (Finland); Oslo; Majorca; North Cyprus; and finally as the volume ends, to a freezing outdoor tournament at an altitude of almost 3000 meters in the French Alps amidst the peaks overlooking the ski village of Meribel!",
  "genres": [],
  "author": "Robert H Wachtel",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/51830870-the-backgammon-chronicles"
}