{
  "title": "Ace: What Asexuality Reveals About Desire, Society, and the Meaning of Sex",
  "description": "An engaging exploration of what it means to be asexual in a world that's obsessed with sexual attraction, and what we can all learn about desire and identity by using an ace lens to see the worldWhat exactly is sexual attraction and what is it like to go through the world not experiencing it? What does asexuality reveal about consent, about compromise, about the structures of society? This exceedingly accessible guide to asexuality shows that the issues that aces face—confusion around sexual activity, the intersection of sexuality and identity, navigating different needs in relationships—are conflicts that all of us need to address as we move through the world.Through interviews, cultural criticism, and memoir, ACE invites all readers to consider big-picture issues through the lens of asexuality, because every place that sexuality touches our world, asexuality does too.Journalist Angela Chen uses her own journey of self-discovery as an asexual person to unpretentiously educate and vulnerably connect with readers, effortlessly weaving analysis of sexuality and societally imposed norms with interviews of ace people. Among those included are the woman who had blood tests done because she was convinced that \"not wanting sex\" was a sign of serious illness, and the man who grew up in an evangelical household and did everything \"right,\" only to realize after marriage that his experience of sexuality had never been the same as that of others. Also represented are disabled aces, aces of color, non-gender-conforming aces questioning whether their asexuality is a reaction against stereotypes, and aces who don't want romantic relationships asking how our society can make room for them.",
  "genres": [
    "Nonfiction",
    "LGBT",
    "Queer",
    "Audiobook",
    "Sexuality",
    "Feminism",
    "Psychology"
  ],
  "author": "Angela  Chen",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/51840338-ace"
}