{
  "title": "Robin's Hood",
  "description": "Noblewoman by day. Legendary thief by night. Who is the girl under the hood?\nOrphaned at five and widowed at sixteen, Marian is the sole heir of Locksley keep and the Earldom of Huntingdon. Her husband, Robin of Locksley, never returned from the crusades, leaving her at the mercy of the sheriff. He chooses her a new husband among his brutal lackeys and taxes her people to rags and starvation. Marian is sidelined and powerless, but rumors spread of a charismatic thief who could change everything. Clever, brave, and strong, his followers claim that the hooded rogue is Robin’s spirit back from the grave. Only Marian knows the truth. Her husband is dead, but under his hood, she could be invincible.\nThe King of Thieves is dead. Long live the Queen.\nROBIN’S HOOD is the first novella in the High Tower Robin Hood YA medieval fantasy series. If you like strong female characters, friends-to-lovers romance, and non-stop twists and turns, then you’ll love this gender-bent twist on the Legends of Sherwood.Buy Robin’s Hood to join the adventure!This lightning-quick read was originally written for the Enchanted Kingdoms Anthology (2021).What are HighTower Fairytales?HighTower Fairytales lean more toward the original sources (NOT Disney) with rich semi-historical settings. They have magic. They have scary monsters. And, most importantly, they have unique and complex characters who are trying hard to improve themselves.They also include plenty of humor and all the heroes marry their prince/princess charming and live happily ever after at the end!Basically, these stories meant to inspire, but have a very difficult and occasionally dark tower to climb. They are conservatively marked at 14+ and are appropriate for teens and young adults.Currently these stories include:Winter Falls: A Tale of the Snow Queen (2017)Cry Wolf: A Tale of Beauty and the Beast (2020)Depths: A Tale of the Little Mermaid (2020)Letters by Cinderlight: A Tale of Cinderella (2021)Robin's Hood: A Tale of Sherwood Forest (2021)And more on the way!!!",
  "genres": [
    "Fantasy",
    "Retellings",
    "Young Adult",
    "Fairy Tales",
    "Romance",
    "Fiction",
    "Fairy Tale Retellings"
  ],
  "author": "Jacque Stevens",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/51892950-robin-s-hood"
}