{
  "title": "Hitwoman",
  "description": "ASSASSIN JULIA HAMPTON IS READY TO QUIT THE GAME AND RETURN TO HER SCHOOLTEACHER ROOTS — ONLY TO LEARN SHE'S MARKED FOR DEATH.  Primary teacher Julia Hampton’s quiet life in Oregon upends with the murder of her parents and sister. Julia seeks revenge against those responsible, and against all odds, she succeeds. Her success is noticed by an organization dedicated to the same task on a grand scale: eliminate anyone importing and selling narcotics. Julia accepts assignments as a contract killer for The Company and makes a name for herself as J. Settling in rural Idaho to live alone as a substitute teacher offers a low-profile base for assignments. Dawson Pelletier owns a nearby farm and looks after Julia’s place when J is away. All goes well until she’s wounded and barely makes it home. She finds her neighbor is much more than a gentleman farmer when only one of his many hidden resources is to become her expert caregiver. Her thirst for vengeance sated and faced with her mortality, Julia notifies The Company that the assignment she barely survives is her last, and she’ll return to teaching fulltime, but her resignation is rejected unless she fulfills a final contract. Against previous rules of engagement, her target is outside US borders, and she must leave her familiar firearm behind and find alternate means to terminate a giant ex-athlete responsible for importing tons of drugs stateside each week. J must take on a brute three times her size if she is to have a chance to return to the quiet life and budding romance wants.  “Pitts is a highly skilled storyteller. Riveting - action filled - yet woven with love and unforgettable characters. Can't wait for the next one!”—Judy Schwartz, Educator  “Pitts is one of those authors who makes readers feel as if they have lived all their lives in the settings of what he writes, and can move from an exciting, dangerous scene on one page to a sensitive, personal, and touching moment on the next. His dialogue always rings true.”—Jim Tevis - Professor and Historian “I love Jeffrey A. Pitts' books! He takes care to develop multiple characters and entwine their storylines. When you get done reading you feel like you know these people as neighbors and miss them. I can't wait to read and find out where Jeffrey will take us in his next book!”—Amy Garrison, K-12 Reading Specialist  “You can easily fall in love with Jeffrey A. Pitts' writing. The real lifelike characters are developed so well they pull you in with their flaws and integrity. I cannot put Jeffrey's books down until I've read to the last page!”—Terin Heye—Bookkeeper, Olympia, WA   My initial dispatching of the Sanchez woman and three of her henchmen were as routine as my daily practice knocking bowling pins off fence posts, but no drill can prepare a person for an actual gun battle. For the first time in my life, I felt the shock of a bullet. My hand explored my stomach and slipped through wetness before pain set in. Dropping to one knee, I exchanged my nearly empty magazine. Two men remained who planned to end my life. I needed every round now in my gun.  Hearing the telltale sounds of magazines ejected and the fumbling to reload in the dining room, I stepped through the doorway with my eye locked over the sights. Both men looked in my direction, clumsily releasing their slides to chamber rounds.  Diligent practice with the nearly silent and recoilless Mark IV .22/45 behind my house paid off. The men wanting to kill me now became no more than wobbling bowling pins, and I simply squeezed the trigger once, then again. Both men fell faster than I can tell it. None of the seven were moving, and I took the extra seconds needed to shoot each one again.",
  "genres": [],
  "author": "Jeffrey A. Pitts",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/51884449-hitwoman"
}