{
  "title": "Capitalism and Freedom",
  "description": "\"Milton Friedman, dikkat çekici analitik yetenekleri ve teknik ustalığıyla diğerlerinden ayrılan, ABD’nin olağanüstü iktisatçılarından biri. Her zaman aydınlatıcı, özgür, cesur, zeki ve en önemlisi de ufuk açıcı.”Henry Hazlitt, Newsweek“Kendi meslektaşlarının düşünüş şeklini büyük ölçüde değiştirebilen bir profesör çok nadirdir. Dünyanın değişmesine etki edeni daha da nadirdir. Friedman ikisini de başardı.”Stephen Chapman, Chicago TribuneKapitalizm ve Özgürlük’ün ilk baskısı 1962 yılında yayınlandığında, Büyük Buhran’ın acı hatıraları Amerikan halkının önemli bir kısmının hafızasında halen canlıydı. O dönemde, entelektüellerin yanı sıra hem Cumhuriyetçi hem Demokrat siyasetçilerin de tercihleri Keynesyen politikalardı. Böyle bir atmosferde yayınlanan Kapitalizm ve Özgürlük’te Friedman, devlet müdahalesinin niyet edilmemiş kötü sonuçlarına dikkat çekti. Rekabetçi kapitalizmin teorik ve pratik üstünlüklerini açık ve kuvvetli bir şekilde izah etti.Friedman, bu kitapta, ekonomik özgürlükler ile siyasî özgürlükler arasındaki bağıntıyı net bir şekilde ortaya koymuştur. Friedman’ın iktisat felsefesinde merkezî bir tema olan rekabetçi kapitalizm, hem iktisadî özgürlüğe ulaşmak için bir araç hem de siyasî özgürlük için gerekli bir koşuldur.Güncelliğini o zamandan bu yana dünyanın pek çok yerinde koruyan önemli pratik konulara rekabetçi kapitalizm perspektifinden yaklaşımlar sunan Friedman, devletin, duhul ettiği alanlardaki olumsuz etkilerini araştırmış ve bunlara çözüm önerileri getirmiştir. Devlet müdahalesinin etkilerinin yoğun bir şekilde hissedildiği uluslararası ticaret, malî politika, eğitim sistemi, ayrımcılık, tekeller, ruhsatlandırma, gelir dağılımı, sosyal refah politikaları ve yoksulluk gibi konular bu kitabın odaklandığı alanlardandır.Kapitalizm ve Özgürlük, 20. Yüzyıl’ın en etkili ve etkileyici kitaplarından birisi olarak gösterilmektedir. İlk edisyonundan sonra birkaç kez revize edilen kitap, onlarca dile çevrilmiş, tüm dünyada yüzbinlerce okura ulaşmıştır. Kitap, birçok ülkenin iktisat politikasını etkileyen fikirleri yaymasının yanı sıra Friedman’ın 1976 yılında Nobel İktisat Ödülü almasında etkili olmuştur.",
  "genres": [
    "Economics",
    "Politics",
    "Nonfiction",
    "Philosophy",
    "Business",
    "History",
    "Finance"
  ],
  "author": "Milton Friedman",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/51877.Capitalism_and_Freedom"
}