{
  "title": "Caramboles",
  "description": "French/English Bilingual poetry.“The most cockeyed, twitching, wobbliest gait eventually becomes so ungainly, so weirdly lopsided that it dances. This book would rather linger in the confines, if it can, wherever the one becomes the other. I assault the French language, my second; I clutter it with l’on-lit and qu’on-con, unthinkable infractions, maim it with impossible malaprops. I torment and overthrow my other second language, English; I embrace every solecism, bludgeon with blunders every ear within eyeshot; I merrily reduce the English language to a frenzied shuffle. Or else I unhinge language, dislocate it, as though I were a gnome in a museum tilting picture-frames for a good laugh, just enough to discompose the patrons. Aficionados object; campaigns are launched against the the virtuous demand redress.” A.D.Alexander Dickow, an American poet and translator, was born in 1979. He lives in New Jersey. A student of French literature, he travelled to France in 2003-2004 to study in Nantes, where he completed a French degree in literature. He is currently pursuing dissertation research devoted to 20th-Century French poetry. He has published poems in French and American journals. Caramboles is his first book.***************Poésie bilingue anglais/français« Il n’existe pas encore de nom pour désigner ce point limite où le brimbalement le plus farfelu, le plus absurde dandinement devient soudain de la danse. Mais je l’ai cherché dans ce livre, ce point limite. J’ai assailli ma langue étrangère, le français, j’y ai semé les l’on-lit et les qu’on-con, les maladresses, toutes les belles entorses impossibles. Puis j’ai infiltré, sapé, envahi mon autre langue étrangère, l’américain ; je n’ai craint aucun solécisme, j’ai hérissé l’oreille de ma matraque malapropiste, allègrement j’ai fait clopiner la langue anglaise. J’ai tenté en somme de raccorder la langue de travers, comme un lutin de musée qui pencherait les cadres un peu de côté, pour rire. Ça gêne l’œil, l’amateur s’indigne ; on mène la chasse aux injustesses ; on veut rajuster. » A.D.Alexander Dickow, poète et traducteur américain, est né en 1979. Il vit au New Jersey. Étudiant en littérature française, il est venu en 2003-2004 poursuivre ses études à Nantes, où il a obtenu un DEA en lettres modernes. Il prépare actuellement une thèse sur la poésie française du XXe siècle. Il a publié des poèmes dans des revues, en France et aux États-Unis. Caramboles est son premier livre.",
  "genres": [
    "Poetry"
  ],
  "author": "Alexander Dickow",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/5189656-caramboles"
}