{
  "title": "Moral Minority: Our Skeptical Founding Fathers",
  "description": "In her lively refutation of modern claims about America's religious origins, Brooke Allen looks back at the late eighteenth century and shows decisively that the United States was founded not on Christian principles at all but on Enlightenment ideas. Moral Minority presents a powerful case that the unique legal framework the Founding Fathers created was designed according to the humanist ideals of Enlightenment God entered the picture only as a very minor player, and Jesus Christ was conspicuous by his absence. The guiding spirit of the Declaration of Independence and the U.S. Constitution, Ms. Allen explains, was not Jesus Christ but John Locke. In direct and accessible prose, she provides fascinating chapters on the religious lives of the six men she considers the key Founding Franklin, Washington, John Adams, Jefferson, Madison, and Hamilton. Far from being the conventional pious Christians we too often imagine, these men were skeptical intellectuals, in some cases not even Christians at all. Moral Minority presents unforgettable images of our iconic Jefferson taking a razor to the Bible and cutting out every miraculous and supernatural occurrence; Washington rewriting speeches others had crafted for him, so as to omit all references to Jesus Christ; Franklin and Adams confiding their doubts about Christ's divinity; Madison expressing deep disapproval over the appointment of chaplains to Congress and the armed forces, and of what we would now call \"faith-based\" initiatives. Enlivened by generous portions of the founders' own incomparable prose, Moral Minority makes an impassioned and scintillating contribution to the ongoing debate—more heated now than ever before—over the separation of church and state and the role (or lack thereof) of religion in government.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Politics",
    "American History",
    "Philosophy",
    "Biography"
  ],
  "author": "Brooke Allen",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/518944.Moral_Minority"
}