{
  "title": "This Is What America Looks Like: My Journey from Refugee to Congresswoman",
  "description": "An intimate and rousing memoir by progressive trailblazer Ilhan Omar—the first African refugee, the first Somali-American, and one of the first Muslim women, elected to Congress.Ilhan Omar was only eight years old when war broke out in Somalia. The youngest of seven children, her mother had died while Ilhan was still a little girl. She was being raised by her father and grandfather when armed gunmen attacked their compound and the family decided to flee Mogadishu. They ended up in a refugee camp in Kenya, where Ilhan says she came to understand the deep meaning of hunger and death. Four years later, after a painstaking vetting process, her family achieved refugee status and arrived in Arlington, Virginia.Aged twelve, penniless, speaking only Somali and having missed out on years of schooling, Ilhan rolled up her sleeves, determined to find her American dream. Faced with the many challenges of being an immigrant and a refugee, she questioned stereotypes and built bridges with her classmates and in her community. In under two decades she became a grassroots organizer, graduated from college and was elected to congress with a record-breaking turnout by the people of Minnesota—ready to keep pushing boundaries and restore moral clarity in Washington D.C.A beacon of positivity in dark times, Congresswoman Omar has weathered many political storms and yet maintained her signature grace, wit and love of country—all the while speaking up for her beliefs. Similarly, in chronicling her remarkable personal journey, Ilhan is both lyrical and unsentimental, and her irrepressible spirit, patriotism, friendship and faith are visible on every page. As a result, This is What America Looks Like is both the inspiring coming of age story of a refugee and a multidimensional tale of the hopes and aspirations, disappointments and failures, successes, sacrifices and surprises, of a devoted public servant with unshakable faith in the promise of America.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Biography",
    "Audiobook",
    "History",
    "Feminism"
  ],
  "author": "Ilhan Omar",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/51927994-this-is-what-america-looks-like"
}