{
  "title": "Wicked Earls' Club: Books 6-11",
  "description": "Meet six of the most wickedly sinful earls in all of Regency England. Together they make up the Wicked Earls’ Club. A secret group, marked with a single golden W; it is a place where these deliciously devious earls can indulge in their darkest desires. Though fate may have something else planned for them entirely.  Earl of Weston by Anna St. Claire  Edward Hunter, confirmed bachelor, returns from an assignment with the Crown to find his brother killed and himself the new Earl of Weston—a position he never wanted. Hattie Longbottom is an aging, sheltered spinster who suddenly finds herself forced to leave her home with her beloved parrot, Archie, and travel to her brother’s home. Can a reluctant earl revenge his brother’s murder and save a spinster in the process?  Earl of Davenport by Maggie Dallen  The Devil of Davenport is in need of a bride. Everyone knows the wicked earl is looking to wed, but only his childhood friend Anne knows his secret. Despite what society believes, he's not a devil—not really. Not at all. Of course, he's no saint either. He's all man. And while Anne's less scandalous sister might be the logical choice for a wife, she's not the one who makes his pulse race. To win his angel, this earl may just have to live up to his devilish title.  Earl of Grayson by Amanda Mariel  Charlotte is a true lady and Damien a determined rake. When their paths cross they have every reason to turn in the opposite direction, and yet they cannot seem to avoid one another. Passions flare, putting them both at risk. They stand not only to lose their reputations, but more importantly, their hearts.  Earl of Pembroke by Lauren Smith  Gillian Beaumont is no lady, as the bastard daughter of an earl and working as a lady's maid, the last thing she needs is to fall in love with an earl. But when the sweetly seductive Earl of Pembroke mistakes her for her mistress, he falls head over heels for her in this upstairs-downstairs romance.  Earl of St. Seville by Christina McKnight  After the untimely death of her bareknuckle boxing mother from injuries sustained in the ring, Lady Patience Lane thinks she’ll never return to that world. Until she meets the devilishly tempting Sinclair Chambers, the Earl of St. Seville. If he’s going to get the prize purse and save his people from starvation, he needs training before his next match. Together, Sin and Patience will fight not just to win the prize purse, but for the love of a lifetime.",
  "genres": [],
  "author": "Anna St. Claire",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/51907256-wicked-earls-club"
}