{
  "title": "Fire in Paradise: An American Tragedy",
  "description": "The harrowing story of the most destructive American wildfire in a century.There is no precedent in postwar American history for the destruction of the town of Paradise, California. On November 8, 2018, the community of 27,000 people was swallowed by the ferocious Camp Fire, which razed virtually every home and killed at least 85 people. The catastrophe seared the American imagination, taking the front page of every major national newspaper and top billing on the news networks. It displaced tens of thousands of people, yielding a refugee crisis that continues to unfold.Fire in Paradise is a dramatic and moving narrative of the disaster based on hundreds of in-depth interviews with residents, firefighters and police, and scientific experts. Alastair Gee and Dani Anguiano are California-based journalists who have reported on Paradise since the day the fire began. Together they reveal the heroics of the first responders, the miraculous escapes of those who got out of Paradise, and the horrors experienced by those who were trapped. Their accounts are intimate and unforgettable, including the local who left her home on foot as fire approached while her 82-year-old father stayed to battle it; the firefighter who drove into the heart of the inferno in his bulldozer; the police officer who switched on his body camera to record what he thought would be his final moments as the flames closed in; and the mother who, less than 12 hours after giving birth in the local hospital, thought she would die in the chaotic evacuation with her baby in her lap. Gee and Anguiano also explain the science of wildfires, write powerfully about the role of the power company PG in the blaze, and describe the poignant efforts to raise Paradise from the ruins.This is the story of a town at the forefront of a devastating global shift—of a remarkable landscape sucked ever drier of moisture and becoming inhospitable even to trees, now dying in their tens of millions and turning to kindling. It is also the story of a lost community, one that epitomized a provincial, affordable kind of Californian existence that is increasingly unattainable. It is, finally, a story of a new kind of fire behavior that firefighters have never witnessed before and barely know how to handle. What happened in Paradise was unprecedented in America. Yet according to climate scientists and fire experts, it will surely happen again.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Audiobook",
    "Nature",
    "Environment",
    "Adult"
  ],
  "author": "Alastair Gee",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/51926961-fire-in-paradise"
}