{
  "title": "Spice Road",
  "description": "The first book in an epic fantasy series for fans of Sabaa Tahir, Hafsah Faizal and Elizabeth Lim, set in an Arabian-inspired land. Raised to protect her nation from the monsters lurking in the sands, seventeen-year-old Imani must fight to find her brother whose betrayal is now their greatest threat.In the hidden desert city of Qalia, secret spice magic awakens affinities in those who drink the misra tea. With an affinity for iron, seventeen-year-old Imani wields a dagger like no other warrior, garnering her the reputation as the next greatest Shield for battling the dangerous djinn, ghouls, and other monsters that lurk in the sands beyond city limits.Her reputation has been overshadowed, however, by her brother who tarnished the family name after he was discovered stealing their nation's coveted spice - a tell-tale sign of magical obsession. He disappeared soon after, believed to have died beyond the Forbidden Wastes, and leaving Imani reeling with both betrayal and grief.But when Imani uncovers evidence her brother may be alive and spreading their nation's magic beyond the desert, she strikes a deal with the Council to find him and bring him back to Qalia before he can reveal the city's location. Accompanied by Qayn, a roguish but handsome djinni, and Taha, a powerful beastseer whose magical talents are matched only by his arrogance, they set out on their mission.Imani will soon discover there are many secrets that lie beyond the Forbidden Wastes - and in her own heart - but will she find her brother before his betrayals endanger the fate of all of Qalia?In this epic and action-packed fantasy, one young heroine navigates the treacherous road between protecting the ones you love and staying loyal to the place you call home.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Young Adult Fantasy",
    "Mythology",
    "Romance",
    "Magic",
    "Fiction"
  ],
  "author": "Maiya Ibrahim",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/51939798-spice-road"
}