{
  "title": "Think Like a Monk: Train Your Mind for Peace and Purpose Every Day",
  "description": "Jay Shetty, social media superstar and host of the #1 podcast On Purpose, distills the timeless wisdom he learned as a monk into practical steps anyone can take every day to live a less anxious, more meaningful life.When you think like a monk, you’ll understand:- How to overcome negativity- How to stop overthinking- Why comparison kills love- How to use your fear- Why you can’t find happiness by looking for it- How to learn from everyone you meet- Why you are not your thoughts- How to find your purpose- Why kindness is crucial to success- And much more...Shetty grew up in a family where you could become one of three things—a doctor, a lawyer, or a failure. His family was convinced he had chosen option three: instead of attending his college graduation ceremony, he headed to India to become a monk, to meditate every day for four to eight hours, and devote his life to helping others. After three years, one of his teachers told him that he would have more impact on the world if he left the monk’s path to share his experience and wisdom with others. Heavily in debt, and with no recognizable skills on his résumé, he moved back home in north London with his parents.Shetty reconnected with old school friends—many working for some of the world’s largest corporations—who were experiencing tremendous stress, pressure, and unhappiness, and they invited Shetty to coach them on well-being, purpose, and mindfulness. Since then, Shetty has become one of the world’s most popular influencers. In 2017, he was named in the Forbes magazine 30-under-30 for being a game-changer in the world of media. In 2018, he had the #1 video on Facebook with over 360 million views. His social media following totals over 38 million, he has produced over 400 viral videos which have amassed more than 8 billion views, and his podcast, On Purpose, is consistently ranked the world’s #1 Health and Wellness podcast.In this inspiring, empowering book, Shetty draws on his time as a monk to show us how we can clear the roadblocks to our potential and power. Combining ancient wisdom and his own rich experiences in the ashram, Think Like a Monk reveals how to overcome negative thoughts and habits, and access the calm and purpose that lie within all of us. He transforms abstract lessons into advice and exercises we can all apply to reduce stress, improve relationships, and give the gifts we find in ourselves to the world. Shetty proves that everyone can—and should—think like a monk.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Audiobook",
    "Personal Development",
    "Spirituality",
    "Philosophy",
    "Psychology"
  ],
  "author": "Jay Shetty",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/51942513-think-like-a-monk"
}