{
  "title": "Catherine House",
  "description": "A story about a dangerously curious young undergraduate whose rebelliousness leads her to discover a shocking secret involving an exclusive circle of students . . . and the dark truth beneath her school’s promise of prestige.You are in the house and the house is in the woods.You are in the house and the house is in you . . . Catherine House is a school of higher learning like no other. Hidden deep in the woods of rural Pennsylvania, this crucible of reformist liberal arts study with its experimental curriculum, wildly selective admissions policy, and formidable endowment, has produced some of the world’s best minds: prize-winning authors, artists, inventors, Supreme Court justices, presidents. For those lucky few selected, tuition, room, and board are free. But acceptance comes with a price. Students are required to give the House three years—summers included—completely removed from the outside world. Family, friends, television, music, even their clothing must be left behind. In return, the school promises its graduates a future of sublime power and prestige, and that they can become anything or anyone they desire.Among this year’s incoming class is Ines, who expects to trade blurry nights of parties, pills, cruel friends, and dangerous men for rigorous intellectual discipline—only to discover an environment of sanctioned revelry. The school’s enigmatic director, Viktória, encourages the students to explore, to expand their minds, to find themselves and their place within the formidable black iron gates of Catherine. For Ines, Catherine is the closest thing to a home she’s ever had, and her serious, timid roommate, Baby, soon becomes an unlikely friend. Yet the House’s strange protocols make this refuge, with its worn velvet and weathered leather, feel increasingly like a gilded prison. And when Baby’s obsessive desire for acceptance ends in tragedy, Ines begins to suspect that the school—in all its shabby splendor, hallowed history, advanced theories, and controlled decadence—might be hiding a dangerous agenda that is connected to a secretive, tightly knit group of students selected to study its most promising and mysterious curriculum.",
  "genres": [
    "Dark Academia",
    "Fiction",
    "Horror",
    "Mystery",
    "Gothic",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Elisabeth    Thomas",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/51934838-catherine-house"
}