{
  "title": "The Soul Reader: A Novel of Suspense",
  "description": "The Soul Reader is the exciting sequel to Gerard Websters award-winning debut novel, In-Sight.The two people Ward McNulty most wished he could forget were the woman he once loved and the man he still hated. He succeeded sometimes by smothering their memory under mounds of activityhis physical rehabilitation, looking for a job, and staving off foreclosure. But try as he might, it was always therejust under the surface, like smoldering embers embedded in layers of ash, needing only a breath of oxygen to burst into flame. And thats exactly what happens one sunny Saturday afternoon, when Carrie Hope unexpectedly breezes back into his life.It is a year after his fathers murder when Carrie asks Ward to assist her in writing a book about the North Beach Project, the money-laundering scheme that led to his fathers death. Ward initially turns her down. He knows that reopening the investigation would be dangerous for three reasons. First, it could cost them their livesthe identity of the man behind the scheme remains a mystery, and he would do almost anything to keep it that way. Secondly, it may cost Ward his very soul if he gets sucked back into the vortex of hatred and revenge that he has just escaped. And finally, Ward does not know if he or Carrie could survive falling in love and hurting each other yet again.But when Carrie decides to pursue the investigation without him, Ward is faced with a difficult he can allow her to go it alone and possibly get killed or he can join her in hopes of being able to protect her. Wards uncanny insight might give him an edgeand allow him to see the evil coiled in the jumbled foliage of the North Beach Project before it has a chance to strike. He decides to collaborate with her on the book, but on his terms, and thereby launches a series of events that span the globefrom Colombia to Romeand make Ward and Carrie the target of the most dangerous assassin in the western hemisphere, a man known only as Culebra. It is in seeking justice that Ward discovers mercyand loveonce again.",
  "genres": [],
  "author": "Gerard D. Webster",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/12561229-the-soul-reader"
}