{
  "title": "Safe Haven Books 1 to 3",
  "description": "From the multi-award-winning author Christopher Artinian, come the first three books in the post-apocalyptic zombie series people are calling, \"Gripping\", \"fast paced and full of action\", \"very realistic\", \"captivating\", \"inventive\", and \"emotional\".  Safe Haven - Rise of the RAMs  The planet has succumbed to a monstrous virus. Those who die from the infection return as savage predators hell-bent on spreading the virus to the rest of the human population. The UK and Ireland are the last hold-outs, but when the infrastructure supporting their self-imposed quarantine collapses, it's everyone for themselves.  Mike Fletcher and his sister Emma live in Leeds. With the city’s streets overrun by the dead, their only option is to flee. They take their younger siblings and set off to find their last remaining relative in the far north-west of Scotland.  As they travel north they encounter other survivors – but who can they trust? Their terrifying journey will require them to confront horrors both human and inhuman, in the outside world and within themselves. Will they ever find a safe haven?  Safe Haven: Realm of the Raiders  A virus has swept across the planet turning people into flesh-craving zombies. The UK and Ireland were the last to fall, but now the virus has won. Cities are infested with the undead. To stay is to die.  Having fled Leeds, Mike Fletcher and his family thought they had found a safe haven in the island village of Candleton. But their peace was fleeting and others want what they have. Now they find themselves in a fresh fight for their lives; battling armies of vicious raiders and fast, relentless zombies.  Horror and tyranny reign in this new world and a war is looming on the horizon that only the bravest will choose to fight. The time has come to take a stand. The time has come to find a new kind of hero.  Safe Haven - Reap of the Righteous  Civilisation has crumbled in a matter of months. Now, fast-moving zombies and merciless raiders wreak havoc over the post-apocalyptic wasteland. Nowhere is safe. Death and terror lurk in shadow and daylight. The weak will fall, and only the strongest will survive.  Mike Fletcher and his family have battled through this dystopian wilderness to try and find sanctuary in the northwest region of Scotland. They thought they had succeeded. But now, a new horror has found them.  When the odds are insurmountable...when the fear is uncontrollable...when the pain of loss is unbearable, there are just two choices: fall to your knees or stand taller than you ever have before.  This war will decide the future. This war will decide everything.",
  "genres": [
    "Zombies"
  ],
  "author": "Christopher Artinian",
  "average_rating": "4.66",
  "url": "https://www.goodreads.com/book/show/51943694-safe-haven-books-1-to-3"
}