{
  "title": "Tsunami",
  "description": "Tsunami , the gripping third volume of the five-novel Marq’ssan Cycle, opens in early 2086, immediately after the signing of the Madrid Accords at the conclusion of the Global War. Many countries, including the US, have been devastated by war, and some of them turn to the Free Zones and the Marq’ssan for assistance in rebuilding their infrastructure. In the US, the Executive, which has turned its attention to reconsolidating its power, meets with growing resistance to executive rule; and in the Pacific Northwest Free Zone, the Co-op faces an internal crisis when ugly, long-buried secrets are dragged into the light of day. Meanwhile, the lives of three very different women—executive Elizabeth Weatherall, anarchist Martha Greenglass, and human rights lawyer Celia Espin—become entangled as each strives to bring about the change she so passionately desires. Praise for Tsunami “The third volume of the Marq’ssan cycle, Tsunami , confirms what the second volume, Renegade , made the narrative drive and sheer invention of the work is more than up to the size, scope, and ambition of this extraordinary project. What a grand job! What a great read! It’s been a long time since I’ve read science fiction with such a dramatic grip on the political complexities of our slow progress toward the better world we all wish for.”— Samuel R. Delany, author of Dhalgren and Trouble on Triton Reviews “[T]hose with a serious interest in dystopias and particularly the feminist version thereof should find L. Timmel Duchamp’s Marq’ssan Cycle a rewarding experience.” —Michael Levy, New York Review of Science Fiction, December 2005 “Duchamp’s powerful use of language and her gift for creating unforgettable and complex characters make this novel a dark and suspenseful read… The author’s sense of irony and her unflinching understanding of human nature add much-needed wryness (and an occasional flash of romance) to the mix.”— A. M. Dellamonica, Science Fiction Weekly , Jan 10, 2007 “Duchamp’s work challenges its audience with a perhaps uncomfortably on-target vision of our extrapolated social, political, and economic structures as well as with a decidedly leftist, feminist message. It is definitely a work heavy on the ‘cognitive pleasures’ that Robert Scvholes identified as proper to good sf. But, for those willing to accept its challenges, the narrative experience of the Marq’ssan Cycle, now totaling some 1500 pages with the appearance of its third volume, Tsunami , fulfills our need for both cognition and for sublimation as well… “…[Duchamp] overwhelmingly rises to the challenges she sets herself through the nuanced development of strong characters over the course of these first three volumes of the Marq’ssan Cycle.”— Amy J. Ransom, New York Review of Science Fiction , April, 2007 “The old US government is attempting to reassert its authority, but discovering that not everyone is welcoming them with open arms. This lengthy, thoughtful, and intelligent novel examines the social, political, and personal consequences, seen chiefly through the eyes of three women—a lawyer, a businesswoman, and a political activist—all of whose ambitions become intertwined. The series is an ambitious project that is probably just a shade too intellectual for the mainstream commercial SF market, but which should appeal to readers who like something a little more thoughtful than the latest military SF or post-apocalyptic dystopia.”— Donald D’Ammassa, Critical Mass",
  "genres": [
    "Science Fiction",
    "Fiction"
  ],
  "author": "L. Timmel Duchamp",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/519521.Tsunami"
}