{
  "title": "Wandering in Strange Lands: A Daughter of the Great Migration Reclaims Her Roots",
  "description": "From the acclaimed cultural critic and New York Times bestselling author of This Will Be My Undoing comes this powerful story of her journey to understand her northern and southern roots, the Great Migration, and the displacement of black people across America.Between 1916 and 1970, six million black Americans left their rural homes in the South for jobs in cities in the North, West, and Midwest in a movement known as The Great Migration. But while this event transformed the complexion of America and provided black people with new economic opportunities, it also disconnected them from their roots, their land, and their sense of identity, argues Morgan Jerkins. In this fascinating and deeply personal exploration, she recreates her ancestors’ journeys across America, following the migratory routes they took from Georgia and South Carolina to Louisiana, Oklahoma, and California.Following in their footsteps, Jerkins seeks to understand not only her own past, but the lineage of an entire group of people who have been displaced, disenfranchised, and disrespected throughout our history. Through interviews, photos, and hundreds of pages of transcription, Jerkins braids the loose threads of her family’s oral histories, which she was able to trace back 300 years, with the insights and recollections of black people she met along the way—the tissue of black myths, customs, and blood that connect the bones of American history.Incisive and illuminating, Wandering in Strange Lands is a timely and enthralling look at America’s past and present, one family’s legacy, and a young black woman’s life, filtered through her sharp and curious eyes.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Race",
    "Biography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Morgan Jerkins",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/51934207-wandering-in-strange-lands"
}