{
  "title": "HomoAmerican - The Secret Society",
  "description": "HomoAmerican - The Secret Society: This eBook has been carefully reformatted from the original 509 page hardcover edition and includes the addition of 35 full-color plates.  In this current climate of post truth and subjective realities, of grappling for social recognition and change, it is important that we recognize our past and the challenges that ignited the gay rights movement. With the 50th Anniversary of the Stonewall Rebellion just behind us, HomoAmerican - The Secret Society remembers that time through the eyes of a witness who grew up in a world where we were invisible ...not merely the tale of a gay man growing up in America, but a firsthand, disturbing and yet often hilarious portrait of those turbulent and confusing times. In ghettos and in stereotypes there is an underlying thread of a war, not with society at large, but with ourselves ...the cost of acceptance is always denial. We see the past being whitewashed and erased to conform to popular tastes. As a result of conspicuous rebellion, that of simply being and not living in disguise, HomoAmerican presents another society -- a Secret Society - of people who have grown up and survived, despite a world where lies of omission shape our destiny and keep us apart. For those who, despite the dangers, lived defiantly and openly through those dark times, free of convention we wander along dangerous paths in search our own; we confront the confines of society and pursue the promise and myths of sexual liberation at our own peril. As an openly gay man in Iran, as witness to the lavish extravagances and social horror of apartheid South Africa, arrested for murder in Paris and for prostitution in New York, reinvented and reborn in silence he recounts a very personal journey of that man, being pieced together, bit-by-bit, out of shadows.",
  "genres": [
    "LGBT",
    "History",
    "Nonfiction"
  ],
  "author": "Michael K. Dane",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/51948126-homoamerican---the-secret-society"
}