{
  "title": "New Bride Taken: A Dynami Society Story",
  "description": "Flashback sixteen years as Dan and Traci Kline's experiences with other members of the Dynami organization take center stage in the Dynami saga. Before Troy and Emma were adopted, and long before their induction into the society, their parents had some steamy adventures of their own. Dan is asked to help another member out on her wedding day and cannot believe his luck when she wants him to take her roughly in front of her new husband. Things heat up even more when the same young bride runs into the couple at another event and they invite her to join in some late night fun. Things don't always go as planned though, and the events from the Kline family past are sure to impact the children as their story continues in the next chapter of this tale!  Alan Austin is a national award winning author now writing erotic fiction under a new pen name and outside of his established publication outlet in order to delve into some of his deepest desires and fantasies. Alan and his wife are both authors who enjoy the wilder side of life and leverage some of their own experiences along with a healthy dose of imagination to heat things up in their writing.  Alan is a mid-thirties family man from the Midwest United States with an amazing wife and the best kids in the world. He enjoys working out and reading when he has time between family activities and writing. Alan grew up on the west coast before moving his family inland to make a home for himself. He is an active volunteer in his community and loves serving others.  Alan and his wife enjoy sharing their wildest fantasies and he uses his short stories as vehicle to share them with others. It is his hope that his short stories can bring some excitement to others!  Please follow Alan's erotic fantasy author page on Facebook at https://www.facebook.com/AlanAustinAu...",
  "genres": [],
  "author": "Alan   Austin",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/51955238-new-bride-taken"
}