{
  "title": "Defy or Defend",
  "description": "A vampire hive descending into madness. A beautiful spy with a sparkly plan. The bodyguard who must keep them from killing each other.New York Times bestselling romantic comedy author Gail Carriger brings you a charming story of love, espionage, and Gothic makeovers set in her popular Parasolverse.SPYDimity Plumleigh-Teignmott, code name Honey Bee, is the War Office's best and most decorative fixer. She's sweet and chipper, but oddly stealthy, and surprisingly effective given the right incentives.VERSUS KNIGHTSir Crispin Bontwee was knighted for his military service, but instead of retiring, he secretly went to work for the War Office. Mostly he enjoys his job, except when he must safeguard the Honey Bee.Neither one is a vampire expert, but when the Nottingham Hive goes badly Goth, only Dimity can stop their darkness from turning bloody. And only Crispin can stop an enthusiastic Dimity from death by vampire.In a battle for survival (and wallpaper), Dimity must learn that not all that sparkles is good, while Cris discovers he likes honey a lot more than he thought.\"This intoxicatingly witty parody will appeal to a wide cross-section of romance, fantasy and steampunk fans.\" ~ Publishers Weekly, starred review (Soulless)Spinning off from the Finishing School series, featuring deadly ladies of quality, this story stands alone, but chronologically follows Poison or Protect before the start of the Parasol Protectorate Series. It's Cold Comfort Farm meets Queer Eye meets What We Do In The Shadows from the hilarious author of the Parasol Protectorate books, perfect for fans of Julia Quinn, Jodi Taylor, or Meljean Brook.Delicate Sensibilities?Contains fraternizing vampires and one very curious young lady, who asks about seduction, sometimes in detail but mostly in retrospect. May also involve excessive use of velvet, melodramatic poetry, and the strategic application of interpretive ballet.",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Vampires",
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Gail Carriger",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/51969905-defy-or-defend"
}