{
  "title": "Name Drop: The Really Good Celebrity Stories I Usually Only Tell at Happy Hour",
  "description": "From Ross Mathews, the nationally bestselling author of Man Up!, judge on RuPaul’s Drag Race, and alum of Chelsea Lately, a collection of hilarious and irreverent essays about his experience with Hollywood’s most talked-about celebrities.Pretend it’s happy hour and you and I are sitting at the bar. I look amazing and, I agree with you, much thinner in person. You look good, too. Maybe it’s the candlelight, maybe it’s the booze. Either way, let’s just go with it. Keep this all between you and me, and do me a favor? Don’t judge me if I name drop just a little.Television personality Ross Mathews likes telling stories. He was always outrageous and hilariously honest, even when the biggest celebrity he knew was his favorite lunch lady in the school cafeteria. Now that he has Hollywood experience—from interning behind the scenes at The Tonight Show with Jay Leno to judging RuPaul’s Drag Race—he has a lot to talk about.In Name Drop, Ross dishes about being an unlikely insider in the alternate reality that is showbiz, like that time he was invited by Barbara Walters to host The View—only to learn his hero did not suffer fools; his Christmas with the Kardashians, which should be its own holiday special; and his news-making talk with Omarosa on Celebrity Big Brother, which, as it turns out, was just the tip of the iceberg. Holding nothing back, Ross shares the most treasured and surprising moments in his celebrity-filled career, and proves that while exposure may have made him a little bit famous, he is still as much a fanboy as ever.Filled with tales ranging from the horrifying to the hilarious—and with just the right “Rossipes” and cocktails to go along with them—Name Drop is every pop culture lover’s dream come true.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Humor",
    "Audiobook",
    "LGBT",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Ross Mathews",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/51977848-name-drop"
}