{
  "title": "Mike & Jonah",
  "description": "Mike - I trust my police partner Sam Miller with my life. Not only have we been friends for fifteen years, he’s a great cop and I know I can trust him to watch my back. So I’m less than thrilled when I hear that he’ll be on sick leave for six weeks due to a minor surgery. What’s worse? I’m being paired up with a man who is not only relatively new to the job, but according to his old precinct, can’t be trusted. Jonah is transferring from the Springfield Police Department, and they’ve warned me that he is a shrimpy troublemaker who is trying to disgrace and entrap a well respected senior officer. I’ve decided to keep my guard up and Jonah at arm’s length for my own good, even if he is the most gorgeous man I’ve ever met. Not that it matters; being gay is only one of the many secrets I hold.  Jonah - I’m transferring to Princeton Police Department after being attacked by another officer. I caught the incident on tape and am pressing charges, which only made my old precinct hate me more than they already did due to the fact that I play by the rules and expect others to do the same. Luckily, I have friends in Princeton and the force welcomes me with open arms; well, everyone except my temporary partner Mike. The gorgeous man gives me the cold shoulder and zero respect. Though we start off on the wrong foot, I see secrets in his eyes that I yearn to unlock. Maybe it will be the beginning of a beautiful partnership that extends beyond the badge. *This M/M romance is for readers 18 and up! It contains sexy cops and their hilariously feisty best friends. It has no cheating or cliffhangers, an age gap and a very happy HEA. **Author’s note: This is the third installment of the Arrested Hearts series, featuring Mike and Jonah’s story. This low-angst, enemies to lovers book features sexy cops, major insta-love vibes and lots of heat! Be on the lookout for light BDSM elements, humor and heart. On a side note, I would never claim to be an expert on police regulations, protocols or legal procedures. Though I’ve researched all of those things to make this series feel more true to life, these books are strictly for romantic entertainment. I hope you enjoy!",
  "genres": [
    "M M Romance",
    "BDSM",
    "Contemporary",
    "Romance",
    "Crime"
  ],
  "author": "Jayda Marx",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/52021672-mike-jonah"
}