{
  "title": "James Monroe: A Life",
  "description": "The extraordinary life of James Monroe: soldier, senator, diplomat, and the last Founding Father to hold the presidency, a man who helped transform thirteen colonies into a vibrant and mighty republic. Monroe lived a life defined by revolutions. From the battlefields of the War for Independence, to his ambassadorship in Paris in the days of the guillotine, to his own role in the creation of Congress's partisan divide, he was a man who embodied the restless spirit of the age. He was never one to back down from a fight, whether it be with Alexander Hamilton, with whom he nearly engaged in a duel (prevented, ironically, by Aaron Burr), or George Washington, his hero turned political opponent.    This magnificent new biography vividly recreates the epic sweep of Monroe’s life: his near-death wounding at Trenton and a brutal winter at Valley Forge; his pivotal negotiations with France over the Louisiana Purchase; his deep, complex friendships with Thomas Jefferson and James Madison; his valiant leadership when the British ransacked the nation’s capital and burned down the Executive Mansion; and Monroe’s lifelong struggle to reckon with his own complicity in slavery. Elected the fifth president of the United States in 1816, this fiercest of partisans sought to bridge divisions and sow unity, calming turbulent political seas and inheriting Washington's mantle of placing country above party. Over his two terms, Monroe transformed the nation, strengthening American power both at home and abroad.  Critically-acclaimed author Tim McGrath has consulted an extensive array of primary sources, many rarely seen since Monroe's own time, to conjure up this fascinating portrait of an essential American statesman and president.",
  "genres": [
    "Biography",
    "Presidents",
    "History",
    "American History",
    "Nonfiction",
    "Us Presidents",
    "Politics"
  ],
  "author": "Tim  McGrath",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/52012383-james-monroe"
}