{
  "title": "Death at a Country Mansion",
  "description": "“First in a new series…this lively cozy has glamour, intrigue, and romance.” – BooklistFans of Agatha Christie won’t want to miss this delightful new mystery set in the charming village of Edgemead in Surrey, England, where you’ll find the latest styles, the juiciest gossip — and the most tantalizing murder clues… No one would ever accuse famous opera star Dame Serena Levanté of lacking a flare for the dramatic. Unfortunately, it’s curtains down on the dysfunctional diva when she’s found dead at the bottom of a staircase in her elegant home. Solving an opera singer’s murder may not be the typical hairdresser’s aria of expertise. But Dame Serena was the mother of Daisy’s best friend Floria, so Daisy must do-or-dye her best to get to the roots of the case. When a priceless Modigliani painting in the house is reported missing, the mystery gets even more tangled. Even though the gruff but handsome Detective Inspector Paul McGuinness tells the stylist to stay out of his hair, Daisy is determined to make sure the killer faces a stern makeover—behind bars. “A promising debut with scads of interesting characters, a spirited heroine, and a hint of romance.” — Kirkus Reviews“Enjoyable…will appeal to readers of Elizabeth J. Duncan’s 'Penny Brannigan' mysteries.” —Library Journal“Death at a Country Mansion has more twists than a French braid.” —Sherry Harris “If you enjoy British manor houses, a touch of budding romance, and a good mystery (like I do), I highly recommend Death at a Country Mansion.” —Vikki Walton “A little romance, a little art history, and a gorgeous mansion . . . a page-turner that is fun and intriguing.” —ACF Bookens",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Fiction",
    "Audiobook",
    "Historical Fiction",
    "British Literature"
  ],
  "author": "Louise R. Innes",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/52009115-death-at-a-country-mansion"
}