{
  "title": "Because He's Jeff Goldblum: The Movies, Memes, and Meaning of Hollywood's Most Enigmatic Actor",
  "description": "An irreverent yet deeply researched biography about the always offbeat, suddenly meme-able, and wildly popular actor When did you first encounter Jeff Goldblum? Maybe as a deranged killer in his 1974 screen debut in Death Wish? Maybe as a cynical journalist in 1983s The Big Chill? Or a brilliant if egotistical scientist-turned-fly in 1986s The Fly? Perhaps as the wise-cracking skeptical mathematician in 1993s Jurassic Park? Or maybe you're not a film buff but noticed his face as part of one of the Internet's earliest memes. Who knows?Whenever it was, you've probably noticed that Goldblum has become one of Hollywood's most enduring actors, someone who only seems to grow more famous, more heralded, more beloved through the decades, even though he's always followed his own, strange muse. The guy primarily plays jazz music these days, but is more famous than ever. Actor, pianist, husband, father, style icon, meme. Goldblum contains multitudes, but why? What does he mean?The Washington Post's Travis M. Andrews decided to find out. And so he set out on a journey through Goldblum's career, talking to directors like Lawrence Kasdan and Philip Kaufman, colleagues like Harry Shearer and Billy Crudup, and pop culture experts like Chuck Klosterman and Sean Fennessey, to get to the bottom of this whole Goldblum thing. And then he took what he learned and he wrote this book, which is titled Because He's Jeff Goldblum and is the best thing written since The Brothers Karamazov and slightly easier to follow. But you should already know that. In this new semi-biography, semi-rumination, and semi-ridiculous look at the career of Goldblum, Andrews takes you behind the scenes of his iconic movies, explores the shifting nature of fame in the twenty-first century, and spends far too much time converting Goldblum's name into various forms of speech.Want to hear how Goldblum saved a script supervisor from an amorous baboon? Or what he would write on the mirror after taking showers when he was a teenager? How about his feelings on various brands of throat lozenges? (That one could be an entire book unto itself.) Then this is the book for you!",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Biography Memoir",
    "Humor",
    "Adult",
    "Pop Culture"
  ],
  "author": "Travis M. Andrews",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/52021722-because-he-s-jeff-goldblum"
}