{
  "title": "Harenberg Buch der 1000 Bücher",
  "description": "Schon allein das Gewicht dieses Werkes ist mit über drei Kilogramm beeindruckend -- mehr als 1.200 Seiten mit Texten über große, wichtige Bücher, die Nationen, Zeitalter oder Denkströmungen geprägt haben: von grundlegenden Religionstexten (Bibel, Koran) und den Autoren der griechischen und römischen Antike über all die Klassiker der Literaturgeschichte bis hin zu aktuellen Literaturnobelpreisträgern wie Grass oder Naipaul. Geordnet sind die Beiträge nach Autoren, wobei jeweils nach einer kurzen Einführung in Leben und Werk ein oder mehrere Bücher vorgestellt werden: in bis zu einer Seite langen Texten wird verständlich und erhellend auf Inhalt, Aufbau und Wirkung des jeweiligen Werkes eingegangen. Obwohl 150 Mitarbeiter für die Beiträge verantwortlich waren, ist die Qualität gleich bleibend hoch. Das Buch der 1000 Bücher möchte aber noch mehr sein als ein Kanon der hohen Literatur. Auch wenn der Schwerpunkt eindeutig auf der Belletristik liegt, wird auch auf große Werke der Wissenschaft, vor allem der Geisteswissenschaft, hingewiesen. Hier wird es freilich interessant: Kann man in ein paar Zeilen Einsteins Relativitätstheorie oder Kants Kritik der reinen Vernunft zusammenfassen oder erklären? Der Versuch, auch solche Meilensteine der Geistesgeschichte zu berücksichtigen, ist ehrenhaft und auch grundsätzlich zu begrüßen, hat aber Sätze zur Folge, die unverständlich bleiben müssen. Z.B.: \"Das raum-zeitliche Kontinuum ist in der allgemeinen Theorie nicht mehr euklidisch wie in der speziellen Theorie.\" Wirklich fragwürdig ist allerdings die Entscheidung, auch Werke der Trivialliteratur aufzunehmen. Da findet sich gleich neben Nobelpreisträger Claude Simon, einem der wortmächtigsten lebenden Schriftsteller, Johannes Mario Simmel, der es mit seinen Büchern zwar regelmäßig in die Bestsellerlisten schaffte, aber in einem Kanon bedeutender Bücher fehl am Platz ist. Beispielsweise ist die kleinste Erzählung eines Franz Kafka, von dem nur drei Werke hier Erwähnung finden, bedeutender und wirkmächtiger als jeder noch so auflagenschwere Bestsellerroman. Das ist andererseits das Spannende an jedem Kanon: Dass es Vergnügen macht, sich aufzuregen, an der jeweiligen Auswahl zu reiben, Gegenvorschläge zu überlegen. Von Petitessen dieser Art abgesehen, ist Das Buch der 1000 Bücher ein sehr gut gemachtes, faszinierendes Werk, in dem man sich nur allzu leicht festliest. --Christian Stahl",
  "genres": [
    "Books About Books"
  ],
  "author": "Joachim Kaiser",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/5200426-harenberg-buch-der-1000-b-cher"
}