{
  "title": "Midwinter",
  "description": "Winter comes to the land only once in a hundred years. But the snow covers ancient secrets that could topple a kingdom. Mauritaine was a war hero, a captain in the Seelie Army. Then he was accused of treason and sentenced to life without parole at Crere Sulace, a dark and ancient prison in the mountains, far from the City Emerald. But now the Seelie Queen – Regina Titania herself – has offered him one last chance to redeem himself, an opportunity to regain his freedom and his honor. Unfortunately, it's a suicide mission, which is why only Mauritaine and the few prisoners he trusts enough to accompany him, would even dare attempt Raieve, beautiful and harsh, an emissary from a foreign land caught in the wrong place at the wrong time; Perrin Alt, Lord Silverdun, a nobleman imprisoned as a result of political intrigues so Byzantine that not even he understands them; and Brian Satterly, a human physicist, apprehended searching for the human victims of the faery changeling trade. Meanwhile, dark forces are at work at home and abroad. In the Seelie kingdom, the reluctant soldier Purane-Es burns with hatred for Mauritaine, and plots to steal the one thing that remains to his wife. Across the border, the black artist Hy Pezho courts the whim of Mab, offering a deadly weapon that could allow the Unseelie in their flying cities to crush Titania and her army once and for all. With time running out, Mauritaine and his companions must cross the deadly Contested Lands filled with dire magical fallout from wars past. They will confront mounted patrols, brigands, and a traitor in their midst. And before they reach their destination, as the Unseelie Armies led by Queen Mab approach the border, Mauritaine must decide between his own freedom and the fate of the very land that has forsaken him.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Urban Fantasy",
    "High Fantasy",
    "Audiobook",
    "Magic",
    "Science Fiction Fantasy"
  ],
  "author": "Matthew Sturges",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/5200548-midwinter"
}