{
  "title": "Controlling Desires: Sexuality in Ancient Greece and Rome",
  "description": "Historians of ancient Greece and Rome are sometimes hesitant to engage with the well-documented fact that Greek and Roman men regularly engaged in same-sex sexual relations with younger men. In a similar vein, scholars have constructed elaborate social explanations for Sappho, a 6th-century woman from the island of Lesbos who wrote passionate poetry about her erotic relations with a number of women, in order to avoid her apparent sexual orientation. On the other hand, in recent times the Greeks and Romans have occasionally been idealized as prototypes of modern homosexuality or bisexuality. In this engaging, cross-disciplinary book, Ormand argues that the Greeks and Romans thought of sex and sexuality in ways fundamentally different from our own. Ormand's exploration of Greek and Roman sexual practice allows readers the opportunity to see how attitudes and beliefs about sex―sexuality, in short―functioned in the early civilizations of the West, and how those attitudes reveal the unspoken rules that defined public and private behavior.Ormand treats Greece and Rome in separate sections, with ample cross-references and comparisons. Within each section, individual chapters focus on different types of texts and visual arts. Just as sexuality is presented differently in our legal cases than it is on television sitcoms, or supermarket tabloids, the reader will naturally find that the Greeks and Romans talk one way about sex, love, and marriage in legal speeches and another way in comedies, satires, and philosophical texts. Ormand's analysis takes into account changes in attitude over time, as well as different modes of presenting a complex and interconnected set of social beliefs and behaviors.",
  "genres": [
    "History",
    "Nonfiction",
    "LGBT",
    "Classics"
  ],
  "author": "Kirk Ormand",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/5200412-controlling-desires"
}