{
  "title": "What We Don't Talk About When We Talk About Fat",
  "description": "From the creator of Your Fat Friend, an explosive indictment of the systemic and cultural bias facing plus-size people that will move us toward creating an agenda for fat justice.Anti-fatness is everywhere. In What We Don't Talk About When We Talk About Fat, Aubrey Gordon unearths the cultural attitudes and social systems that have led to people being denied basic needs because they are fat and calls for social justice movements to be inclusive of plus-sized people's experiences. Unlike the recent wave of memoirs and quasi self-help books that encourage readers to love and accept themselves, Gordon pushes the discussion further towards authentic fat activism, which includes ending legal weight discrimination, giving equal access to health care for large people, increased access to public spaces, and ending anti-fat violence. As she argues, I did not come to body positivity for self-esteem. I came to it for social justice.By sharing her experiences as well as those of others--from smaller fat to very fat people--she concludes that to be fat in our society is to be seen as an undeniable failure, unlovable, unforgivable, and morally condemnable. Fatness is an open invitation for others to express disgust, fear, and insidious concern. To be fat is to be denied humanity and empathy. Studies show that fat survivors of sexual assault are less likely to be believed and less likely than their thin counterparts to report various crimes; 27% of very fat women and 13% of very fat men attempt suicide; over 50% of doctors describe their fat patients as awkward, unattractive, ugly and noncompliant; and in 48 states, it's legal--even routine--to deny employment because of an applicant's size.Advancing fat justice and changing prejudicial structures and attitudes will require work from all people. What We Don't Talk About When We Talk About Fat is a crucial tool to create a tectonic shift in the way we see, talk about, and treat our bodies, fat and thin alike.",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "Feminism",
    "Social Justice",
    "Health",
    "Memoir",
    "Essays"
  ],
  "author": "Aubrey Gordon",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/52011076-what-we-don-t-talk-about-when-we-talk-about-fat"
}