{
  "title": "A Short Life of Jonathan Edwards (Library of Religious Biography",
  "description": "Jonathan Edwards is one of the most extraordinary figures in American history. Arguably the most brilliant theologian ever born on American soil, Edwards (1703–1758) was also a pastor, a renowned preacher, a missionary to the Native Americans, a biographer, a college president, a philosopher, a loving husband, and the father of eleven children.George M. Marsden -- widely acclaimed for his magisterial large study of Edwards -- has now written a new, shorter biography of this many-sided, remarkable man.  A Short Life of Jonathan Edwards  is not an abridgment of Marsden's earlier award-winning study but is instead a completely new narrative based on his extensive research. The result is a concise, fresh retelling of the Edwards story, rich in scholarship yet compelling and readable for a much wider audience, including students.Known best for his famous sermon “Sinners in the Hands of an Angry God,” Jonathan Edwards is often viewed as a proponent of fire, brimstone, and the wrath of God. As Marsden shows, however, the focus of Edwards's preaching was not God's wrath but rather his overwhelming and all-encompassing love. Marsden also rescues Edwards from the high realms of intellectual history, revealing him more comprehensively through the lens of his everyday life and interactions. Further, Marsden shows how Edwards provides a window on the fascinating and often dangerous world of the American colonies in the decades before the American Revolution.Marsden here gives us an Edwards who illumines both American history and Christian theology, an Edwards that will appeal to readers with little or no training in either field. This short life will contribute significantly to the widespread and growing interest in Jonathan Edwards.",
  "genres": [
    "Biography",
    "History",
    "Christian",
    "Audiobook",
    "Nonfiction",
    "Theology",
    "Church History"
  ],
  "author": "George M. Marsden",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/5204524-a-short-life-of-jonathan-edwards-library-of-religious-biography"
}