{
  "title": "WolfWalkers: The Graphic Novel",
  "description": "An enchanting graphic novel about a feud, a friendship, and two girls forever changed. Based on the beautifully hand-crafted animated adventure, WolfWalkers, this graphic novel features an introduction and exclusive original art from film co-creator Tomm Moore and co-Art Director Maria Pareja. Watch the stunning, Golden Globe-nominated film available on Apple TV+ now.In a time of superstition and magic, a young apprentice hunter, Robyn Goodfellowe, journeys to Ireland with her father whose job it is to wipe out the last wolf pack. Robyn, unable to hunt with her father and sick of being confined, sneaks out to explore the forbidden lands outside the city walls. There, Robyn befriends a free-spirited girl, Mebh, a member of a mysterious tribe of WOLFWALKERS rumored to have the ability to transform into wolves by night.After learning that WOLFWALKERS aren't to be feared, Robyn decides she must protect Mebh and her pack from the hunters. As the girls search for Mebh’s missing mother, Robyn uncovers a secret that draws her further into the enchanted world of the WOLFWALKERS and risks turning her into the very thing her father is tasked to destroy.This graphic novel makes a great gift for readers of all ages and includes a special introduction, written and illustrated by film cocreator, Tomm Moore, and co-Art Director, Maria Pareja.WolfWalkers is created by Cartoon Saloon, the award-winning Irish studio behind some of the industry's most renowned animated films including Song of the Sea and The Secret of Kells.Praise for WolfWalkers:\"Lovely to behold.\" -- The New York Times\"A visually dazzling, richly imaginative, emotionally resonant production....\" -- The Hollywood Reporter\"Kids need movies like this that respect their intelligence, center strong female characters and question policies of blind obedience.... [Moore] brings everything together...leaving audiences with another stunning artwork for the ages\" -- Variety\"Enchanting...intoxicating.\" -- The LA TImes\"Offers an alternative vision of what popular art for children might be.\" -- The New Yorker\"Likely to captivate viewers young and old.\" -- WSJ\"It's glorious, gorgeous, and more than a little profound.\" -- Vulture This title will be simultaneously available in paperback.  © 2020 Wolfwalkers",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Middle Grade",
    "Historical Fiction",
    "Fiction",
    "Childrens",
    "Magic"
  ],
  "author": "Tomm Moore",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/52038958-wolfwalkers"
}