{
  "title": "We Keep the Dead Close: A Murder at Harvard and a Half Century of Silence",
  "description": "Dive into a true crime narrative of an unsolved 1969 murder at Harvard, of obsession and love for a girl who dreamt of rising among men.You have to remember, he reminded me, that Harvard is older than the U.S. government. You have to remember because Harvard doesn't let you forget.1969: the height of counterculture and the year universities would seek to curb the unruly spectacle of student protest; the winter that Harvard University would begin the tumultuous process of merging with Radcliffe, its all-female sister school; and the year that Jane Britton, an ambitious twenty-three-year-old graduate student in Harvard's Anthropology Department and daughter of Radcliffe Vice President J. Boyd Britton, would be found bludgeoned to death in her Cambridge, Massachusetts apartment.   Forty years later, Becky Cooper a curious undergrad, will hear the first whispers of the story. In the first telling the body was nameless. The story was this: a Harvard student had had an affair with her professor, and the professor had murdered her in the Peabody Museum of Archaeology and Ethnology because she'd threatened to talk about the affair. Though the rumor proves false, the story that unfolds, one that Cooper will follow for ten years, is even more complex: a tale of gender inequality in academia, a 'cowboy culture' among empowered male elites, the silencing effect of institutions, and our compulsion to rewrite the stories of female victims. We Keep the Dead Close is a memoir of mirrors, misogyny, and murder. It is at once a rumination on the violence and oppression that rules our revered institutions, a ghost story reflecting one young woman's past onto another's present, and a love story for a girl who was lost to history.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Mystery",
    "Crime",
    "History",
    "Audiobook",
    "Memoir"
  ],
  "author": "Becky Cooper",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/52041387-we-keep-the-dead-close"
}