{
  "title": "Fifty-Two Stories",
  "description": "From the celebrated, award-winning translators of Anna Karenina and War and Peace a lavish, masterfully rendered volume of stories by one of the most influential short fiction writers of all time.Chekhov's genius left an indelible impact on every literary form in which he wrote, but none more so than short fiction. Now, renowned translators and longtime house authors Richard Pevear and Larissa Volokhonsky give us their peerless renderings of fifty-two Chekhov stories--a full deck! These stories, which span the full arc of his career, reveal the extraordinary variety and unexpectedness of his work, from the farcically comic to the darkly complex, showing that there is no one type of \"Chekhov story.\" They are populated by a remarkable range of characters who come from all parts of Russia, all walks of life, and who, taken together, have democratized the short story. Included here are a number of never-before-translated stories, including \"Reading\" and \"An Educated Blockhead.\" Here is a collection that promises profound delight.Contains:Joy--Fat and Skinny--At the Post Office--Reading--The Cook Gets Married--In a Foreign Land--Corporal Whompov--Grief--The Exclamation Point--An Educated Blockhead--A Slip-Up--Anguish--A Commotion--The Witch--A Little Joke--Agafya--Spring--A Nightmare--Grisha--Ladies--Romance with a Double Bass--The Chorus Girl--The First-Class Passenger--Difficult People--On the Road--The Beggar--Enemies--The Letter--Volodya--Luck--The Siren--The Shepherd's Pipe--Costly Lessons--The Kiss--Boys--Kashtanka--The Name-Day Party--A Breakdown--The Bet--The Princess--After the Theater--History of a Business Enterprise--Neighbors--Fear--Big Volodya and Little Volodya--The Teacher of Literature--In a Country House--The Pecheneg--In the Cart--About Love--Ionych--The New Dacha--",
  "genres": [
    "Short Stories",
    "Fiction",
    "Classics",
    "Russia",
    "Russian Literature",
    "Literature",
    "19th Century"
  ],
  "author": "Anton Chekhov",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/52024701-fifty-two-stories"
}