{
  "title": "Alien Protector's Rescued Bride",
  "description": "When hope is dimmest, a ray of light breaks through...\n\n\n\n\nDaisy...\n\n\nBeing abducted from Earth was terrifying. When the fish-headed, aquatic aliens took me I knew I was in trouble. Thankfully I was raised to be a fighter!\nI've struggled against my captors at every turn but how many times can a girl get beat down before coming to realize you can't win? It's wearing me down and I'm finally coming to realise there's no Prince Charming coming to rescue me!\nI can't give up though, not yet. In a desperate attempt I join up with another girl from Earth and this time I'm either getting free or else. There is no other option, I can't live like this!\nThen the floor shakes and winged demons from hell invade. At least they're fighting the aquatics but is this a rescue or am I trading one master for another?\n\n\nIn this battle it's not just my life at stake, this time my heart is on the line too.\n\n\n\n\nDarnok...\n\n\nAnother mission, one more battle. Maybe this will be my last, maybe not. I can't bring myself to care anymore...\nBeing bigger than all the other warriors my entire life has been one lone string of abuse. The other males pick fights with me to prove how tough they are and the Queens abuse me because I'm so big I always stand out. All they see is the giant, none of them see the person I am!\nNone of them see my dreams or my desire to be accepted. How I want someone to love me for me. Even my one friend barely sees, because in this world, I have to hide that part of me away...\nThere is no compassion in my world. There is nothing to live for except to fight. Go to the next battle and see if this time it's my last. It doesn't matter; there is no other end for me. Sooner or later, it will happen and I've accepted it. At least then my suffering will end...\nUntil this mission. Until I meet the human female Daisy. Then everything changes. I'll fight all of them to save her, to make her mine. She is the light in my universe and I'm not going to let it fade!",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Romance",
    "Paranormal Romance",
    "Science Fiction Romance",
    "Paranormal"
  ],
  "author": "Juno Wells",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/52054362-alien-protector-s-rescued-bride"
}