{
  "title": "Leave Me Breathless: The Black Rose Collection",
  "description": "The darker side of Leave Me Breathless...When the daylight fades and time stands still.The feeling of flying from just one touch.Moving slowly, kissing softly.The flash of fever, becoming lost in the flames.Surrendering. Going under.These are the moments that leave us breathless.Introducing a brand-new collection of romance books by independently published and USA Today bestselling authors whose words will leave you breathless!The Black Rose symbolizes rejuvenation or rebirth, but it can also symbolize death and farewell. The collection will feature brand new stand-alone books from Patricia Eddy, Dakota Willink, Elizabeth Knox, Sierra Hill, Sienna Snow, Sonya Jesus, Cayce Poponea, Pepper North, Crimson Syn, Jo-Anne Joseph and Sin Silverfall.INCLUDED IN THIS COLLECTION:The Sound of Silence by Dakota Willink (Dark Romantic Suspense)There’s a common expression I remind myself of every day: that which does not kill us, makes us stronger. People think I live an idyllic life with my perfect husband, but they don’t know what lies beneath the façade. I’ve learned to accept what is, but I won’t let it destroy me. Instead, I do the only thing I can to survive—I run.Forbidden Love by Elizabeth Knox (Irish Mafia Dark Romance)Caprice DiGiovanni has made the decision to run from her father, who runs the Italian Mafia. He's arranged for her to marry a Russian arms dealer. Only, she's not going to. She's running to the only place where she feels that she can be safe - Ireland, straight into the territory of the Mackenzies.Master of Control by Sienna Snow (Dark Romantic Suspense)I'm a prize, a treasure, something to cherish. Or so I've been told.But I know the truth. I'm a commodity recently sold to the highest bidder.Sebastian Weber is ruthless, heartless, calculating, and my new husband. Power is the weapon he wields and control is his game. I should fear him, resent him, but instead I'm drawn to him, craving his slightest touch, wanting every part of him. Leaving him isn't an option, and staying means shattering his world.Crimson Dahlia by Patricia D. Eddy, Amazon Top 100 Bestselling Author (Dark BDSM Romantic Suspense)His failure cost a good man his life. Now, years later, he has one chance at redemption. Kidnap the man’s daughter.The Bullet Theory by Sonya Jesus (Dark Romantic Suspense)There’s a theory about a bullet and a tortured heart: when both exist, the only variable is opportunity­, which The Bullet Man willingly provides. The killer carefully chooses Ellie, the survivor of a vicious crime, and manipulates his way into her heart. When he gives her a chance at revenge, will she take the shot or turn him in?Marked by Cayce Poponea (Mafia Romantic Suspense)Doing the right thing should never leave a scar...MARKED is the latest Mafia romance from bestselling author Cayce Poponea. Join her as she shares the story of Giovanni Vitale and Kristine Smith, two people from dramatically different backgrounds whose lives become woven together through deception and lies. Can Kristine follow the three simple rules for working in the Family? What happens when her loyalty is questioned by the one she trusts the most?Dare Dark by Pepper North, Amazon Bestselling Erotic Romance Author (Dark BDSM Romance)Are there some dreams that should never come true? Some fantasies that should never be pursued?Precious Gems by Sierra Hill (Dark Romance)She has what he wants, but in order to give it to him, she'll pay the ultimate price.Dark Desires by Jo-Anne Joseph (Dark Psychological Romance)Many know me, yet none have seen my face.I’m the topic of conversation, but nobody knows my name. I am a life thief.A soul destroyer. An invisible plague. And still, you want to know me.My darkness reminds you of the desires that lurk inside you.Insidious Love by Crimson Syn (Dark Romantic Suspense)When Rose Blackthorne witnesses a heinous murder, her only choice is to run. But the events of one night force her into the arms of a stranger. Jake Cavanaugh has been hired to find Rose and keep her quiet, even if it means having to dispose of her dead body. Rose’s only hope is a stranger who has a dark secret, and there’s no escaping him without being consumed by his darkness. Jake’s rules are simple, get the job done and never get too close. But what happens when his obsession for this woman blemishes his plans?Mia by Sin SilverfallVenezuelan drug lord, Dantes Belisario, is no stranger to high-risk rewards. Running drugs and weapons is just another day’s work. But Mia Bernard is a prize that’s not only out his league, but she’s also off-limits. She’s gorgeous and vulnerable, and just so happens to be the city Sheriff’s daughter. Just the kind of trouble he doesn’t need.Mia has always been the good girl in her family, but she has crappy taste in men. When she meets Dantes, she knows he’s the sort of man her father warned her about, but it only makes her want him more. When their worlds collide, passion and danger follow. Playing it safe is no longer an option.",
  "genres": [
    "Dark Romance",
    "Dark"
  ],
  "author": "Sienna Snow",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/52059310-leave-me-breathless"
}