{
  "title": "The Rules",
  "description": "Author's note: The Summer Nights Series books are full-length, character-driven, adult contemporary romance novels. They can each be read as stand-alones, or read in order to experience the story chronologically. More rom than com, they're perfect for fans of Abby Jimenez, Kate Clayborn, or Helena Hunting's single-titles!Dani Petrillo’s friends are settling down faster than she can escape her latest one-night stand. After her best friend’s wedding, she decides it’s time to leave the single life behind and find true love. She joins a dating site that makes a bold promise—Eight Dates to Your Soulmate—if you can follow their dating bootcamp rules. The first one? No sleeping with any of your matches until the eight dates are over. Sure, she wants to find a good guy, but she also knows that no sex for months isn’t going to work for her. Luckily, she’s always been good at bending the rules.Dylan Pierce doesn’t do commitment, and if his genes are any indication, he wasn’t made for it anyway. He’s also been trying to get his hot friend Dani into bed for years, so he’s ecstatic when she suggests a friends with benefits arrangement while she’s participating in some dating bootcamp nonsense. She gets her, um, needs taken care of while she looks for love, and he gets to sleep with Dani, no strings attached. Win/win.But when lines start to blur, their arrangement feels more and more like dating and Dylan feels less and less like sending her off to some other guy when they’re done. It might mean breaking some of his own dating rules, but he wants Dani for himself. Convincing her he’s worth it is a lot harder than being her stand-in, though. Add in keeping the entire thing a secret from their tight group of friends, and the rules of the game just got a lot more complicated.",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Adult",
    "Fiction"
  ],
  "author": "Lauren H. Mae",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/52053080-the-rules"
}