{
  "title": "Stop Surviving Start Fighting",
  "description": "Jazz Thornton first attempted to take her own life at the age of 12. Multiple attempts followed and she spent time in psychiatric wards and under medical supervision as she rode the rollercoaster of depression and anxiety through her teenage years – yet the attempts continued.Find out what Jazz learned about how her negative thought patterns came to be, and how she turned those thoughts – and her life – around. Who and what helped, and what didn't help. The insights she gives will help create a greater understanding of those grappling with mental illness, and those around them who desperately want to help.Jazz went on to attend film school, and to co-found Voices of Hope, a non-profit organization dedicated to helping those with mental health issues and show them there is a way forward. She creates online content to provide hope and help.Her first video Dear Suicidal Me has had over 80 million views all around the world. She went on to create Jessica's Tree, a web series that follows the 24 hours between a friend, Jess, going missing and the discovery of her body. It provides insights into Jessica's strug­gles, to help people better understand those suffering from depression. https-//www.youtube­.com/watch?v=7QFU_qg­7Msk Jessica's Tree was viewed more than 230,000 times in the two months following its release in March 2019 and immediately began winning international recognition and awards, including the Huawei Mate30 Pro New Zealand Television Awards 2019 Best Web Series.The process and the delicate decisions that had to be made to create Jessica's Tree have themselves been documented in a film about Jazz called The Girl on the Bridge, due for release early in 2020.",
  "genres": [
    "Nonfiction",
    "Mental Health",
    "Self Help",
    "Memoir",
    "Psychology",
    "Audiobook",
    "Personal Development"
  ],
  "author": "Jazz Thornton",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/52071336-stop-surviving-start-fighting"
}