{
  "title": "Dominus: A tale of a slave's revenge in ancient Rome",
  "description": "Cursed as a child after he unknowingly gave away Hera’s crown jewel to Athena, Pliny Beleanius was condemned and sold into prostitution after his family’s demise as a punishment by the gods.In his master’s brothel, Pliny was trained to endure pain and to seduce and satisfy any man. His cruel life experiences have honed his instincts on nothing but survival. Intelligent and with a ruthless streak, he is desperate to climb his way out of slavery.Sabina Borealis is the pampered daughter of the wealthy and influential senator Fidecius, patriarch of one of the most respected noble families in Rome. Owing to her father's influence, she is betrothed to Draconius, a nephew of the emperor and the heir to the throne.One fated night brings Pliny and Sabina together and sets in motion a series of events that brings Pliny into the service of the young tribune Fortinus Flovios, Sabina’s uncle.While Sabina’s family stay as guests in Fortinus’s lavish summer villa, Fortinus becomes obsessed with the young slave. He turns Pliny into his private plaything while determined to keep it a secret from his resentful pregnant wife. For Pliny, to serve one master is better than to serve many. Under Fortinus’s protection, his life improves, until a visit of Draconius and the birth of his master’s child brings him in mortal danger.Meanwhile, Sabina is forced to reconsider if Draconius is truly the noble gallant prince she once so desires to marry.This is the second book of the ancient Rome fantasy series - The Empress and the Vagabond - about a love that is predestined by the gods. This MMF series combines all the decadence, intrigue, and ruthlessness of HBO Rome and Game of Thrones with the dark sensuality of Fifty Shades of Grey.",
  "genres": [
    "Historical",
    "M M Romance",
    "Historical Fiction",
    "Abuse"
  ],
  "author": "Alan Florine",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/52089601-dominus"
}