{
  "title": "A Little Bit Wicked",
  "description": "A captivating new standalone romance by New York Times bestselling author Melissa Foster. When the Dark Knights at Bayside and the cast of Bayside Summers collide, sparks fly, and trouble—or maybe love—is not far behind.Set on the sandy shores of Cape Cod, the Wickeds feature fiercely protective heroes, strong heroines, and unbreakable family bonds. If you think bikers are all the same, you haven't met the Dark Knights. The Dark Knights are a motorcycle club, not a gang. Their members stick together like family and will stop at nothing to keep their communities safe. Their stories are told in the same loving, passionate voice readers have come to adore from Melissa. Some of the Wickeds' love stories will be hilariously fun, others will tear at your heartstrings with injections of humor, but they will all leave you wishing you could climb between the pages and join them!In USA Today Bestseller A LITTLE BIT WICKED...What do a cocky biker and a businesswoman who has sworn off dating bad boys have in common? According to Chloe Mallery, not much. But she couldn't be more wrong...Justin came into the Wicked family after a harsh upbringing by a thieving father. He’s gone through a lot to become a true Wicked, and he’s made them proud. Now he’s ready to show the woman he loves exactly what type of man he is. But Chloe has worked hard to move past her difficult upbringing, and she’s wary of getting involved with a man who looks like he’s walked right out of it. When tragedy strikes, will their trying pasts draw them together, or will Justin’s protective nature be too much for Chloe’s independent heart to accept?**MORE WICKED LOVE STORIES COMING SOON!Crazy, Wicked LoveThe Wicked AftermathThe Wicked TruthHis Wicked WaysMEET THE WHISKEYS (cousins of the Wickeds)! Available for your binge-reading pleasure!Tru BlueTruly, Madly, WhiskeyDriving Whiskey WildWicked Whiskey LoveMad About MoonTaming My WhiskeyThe Gritty TruthIn for a PennyRunning on DieselFind out more about these and many other steamy romance series in Melissa Foster’s big-family contemporary romance collection, Love in Bloom, featuring characters from all walks of life, from billionaires to blue-collar workers. You’ll love her fun, sexy, and relatable characters, and their real-life issues. Best of all, you’re always guaranteed a happily ever after.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Friends To Lovers",
    "Fiction",
    "Audiobook",
    "Family"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/52076654-a-little-bit-wicked"
}