{
  "title": "Can I Give My Husband Back?",
  "description": "My sisters call my ex-husband Satan. That tells you everything you need to know about him.  I thought I was sorted on the life front. I was a heart surgeon with a loving partner and two gorgeous little girls. Except my husband’s version of ‘loving’ is lying, cheating and sleeping his way around London. Which means I definitely deserve a refund.  Unfortunately, moving on isn’t that simple. Just because I know how to operate on a heart doesn’t mean I know how to fix my broken one. Plus, I lost the receipt for him years ago so I’m definitely getting short changed.  But now I’m single, am I ready to mingle? There are a few minor  1) The last time I went on a date double denim was in fashion and my eyebrows were horrendously overplucked. 2) Men wear stupidly skinny jeans now. 3) I don’t know how to use dating apps but at least I don’t have to get changed out of my pyjamas. 4) Sometimes the most promising thing you have in common with a guy is a shared love of prawns. 5) I don’t know whether to open a date with ‘hi’ or ‘hello’ or ‘hey’ and once I ended up saying ‘howdy’.  Everything happens for a reason, they say. There’s plenty more fish in the sea. But what happens when everything falls apart and you haven’t got a clue how to go fishing?  An absolutely hilarious and utterly relatable tale for anyone who has ever survived a nightmare relationship, felt a little lonely or nursed a broken heart with wine and carbs. This feel-good novel will get you back on your feet and genuinely laughing out loud. Perfect for fans of Why Mummy Drinks, Sophie Ranald and Sophie Kinsella.  \nReaders love Kristen \n‘Absolutely hilarious!! Seriously, I haven’t been able to put this one down!… I have not stopped laughing… One of those books which is perfect after a stressful day because you are guaranteed to laugh out loud… Loved it… Devoured this book in just a few hours… Impossible to put down.’ Little Miss Book Lover 87, ⭐⭐⭐⭐⭐  ‘One of the funniest books I have read. Ever!… I absolutely LOVED this.’ Star Crossed Reviews, ⭐⭐⭐⭐⭐  ‘I can’t even count all of the times I burst out laughing… I laughed so hard my cat jumped out of his bed scared out of his mind and gave me an evil look for disturbing his sleep… If you love a good laugh-out-loud story full of heart, love and banter and are not afraid to be that crazy person in public laughing like a total maniac, then this is definitely the book for you!’ Sinfully Wicked Book Reviews, ⭐⭐⭐⭐⭐  ‘I’ve read books which have made me laugh before – but this time I couldn't stop!… I giggled hysterically… It's so very, very funny! My long suffering other-half is used to me giggling maniacally when I'm reading, but this took things to a whole new level… A right good laugh… Absolutely hilarious… Yes, it's THAT funny! Without a doubt, worth a full house of stars.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Comedy",
    "Humor"
  ],
  "author": "Kristen Bailey",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/52076869-can-i-give-my-husband-back"
}