{
  "title": "Dating Nashville",
  "description": "Becks:\n\n\nHow does a straight guy accidentally come out as gay to the entire country music world? I’ll get back to you when I know the answer. It all happened so fast. One moment, my best friend’s little brother is standing in a sea of people as his boyfriend breaks his heart. Again. The next, I’m jumping off stage mid-concert to give him the kiss of his life—or maybe the kiss of my life. I’m Beckett Anderson. Yes, that Beckett. The one who never does the smart thing, messes up daily, and somehow ended up with millions of screaming fans. Fans who now think I’m dating Nicky St. Germaine. The label says I can’t come out as straight (Is that even a thing?), that I can’t tell the world I lied. But this lie of mine… it doesn’t hold a candle to the one I tell myself.\n\nNicky:\n\n\nHow does the quiet gay guy end up kissing the straight country music star in front of thousands of his screaming fans?I still can’t fathom what he was thinking when he jumped off that stage, but that kiss… None of it was real, but it felt like it. At least to me. I’m Nicky St. Germaine, son of a football Hall of Famer, best friends with rock star, Nari Won Song—and whatever I am to country music sensation, Beckett Anderson. The jury’s still out on that one. What does a small town kid do when so many of his friends and family are famous? He hides. Frequently. Now the spotlight is on me, and there is nowhere left to hide. I’m supposed to pretend to be Beckett’s adoring boyfriend for a few weeks, but that’s not so easy when I’d give almost anything for it to be true.\n\n\nBook one in the Discovering Me series, Dating Nashville is a sweet M/M romance with a cocky country star, a shy small-town boy, and enough sparks betweent them to make you swoon.",
  "genres": [
    "Romance",
    "M M Romance",
    "Contemporary",
    "Music",
    "LGBT",
    "Fiction",
    "Friends To Lovers"
  ],
  "author": "Ann Maree Craven",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/52086961-dating-nashville"
}