{
  "title": "Lured: Call of the Vikings Book 1",
  "description": "Sex may be shunned in the English villages of East Anglia, but the Viking settlers nearby are more than happy to show the women what a real man is capable of and how pleasurable sex can be with the right lover!  The lurid truth of the Vikings comes to light in the tale of Earl Thorstein Bjornson, a Norse settler of East Anglia. His men have been given lands to settle peaceably, but when the women of the nearby villages begin to seek out his men for sexual pleasure, he is all too happy to further shame the weak and pathetic Englishmen in such an exciting way. He himself has never been with a woman in order to fulfill his destiny, but it appears that destiny may come for him in the most unexpected of places.  Hilda is the youngest daughter of a humble farmer in the village who is about to be married after many years looking for a suitable match after her intended was killed in battle. She discovers that something strange is happening in the village at night and goes out into the wilderness to investigate only to come across a scene she could've never prepared herself for. New feelings overcome her and her confusion and arousal compete with the shame of what she'd witnessed and how far it strays from the teachings of the church she is supposed to keep as a good Christian woman!  Alan Austin is a national award winning author now writing erotic fiction under a new pen name and outside of his established publication outlet in order to delve into some of his deepest desires and fantasies. Alan and his wife are both authors who enjoy the wilder side of life and leverage some of their own experiences along with a healthy dose of imagination to heat things up in their writing.  Alan is a mid-thirties family man from the Midwest United States with an amazing wife and the best kids in the world. He enjoys working out and reading when he has time between family activities and writing. Alan grew up on the west coast before moving his family inland to make a home for himself. He is an active volunteer in his community and loves serving others.  Alan and his wife enjoy sharing their wildest fantasies and he uses his short stories as vehicle to share them with others. It is his hope that his short stories can bring some excitement to others!  Please follow Alan's erotic fantasy author page on Facebook at https://www.facebook.com/AlanAustinAu...",
  "genres": [],
  "author": "Alan Austin",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/52084076-lured"
}