{
  "title": "The World Treasury of Science Fiction",
  "description": "Table of contentsIntroduction 1988 essay by David G. HartwellHarrison Bergeron 1961 story by Kurt Vonnegut JrForgetfulness 1937 story by John W. Campbell JrSpecial Flight 1939 story by John BerrymanChronopolis 1960 story by J.G. BallardTriceratops 1974 story by Kono TenseiThe Man Who Lost the Sea 1959 story by Theodore SturgeonOn the Inside Track 1986 story by Karl Michael ArmerThe Golem 1983 story by Avram DavidsonThe New Prehistory 1972 story by René Rebetez-CortesA Meeting With Medusa 1972 novella by Arthur C. ClarkThe Valley of Echoes 1973 story by Gérard KleinThe Fifth Head of Cerberus 1972 novella by Gene WolfeThe Chaste Planet 1983 story by John UpdikeThe Blind Pilot 1960 story by Nathalie-Charles HennebergThe Men Who Murdered Mohammed 1958 story by Alfred BesterPairpuppets 1974 story by Manuel van LoggemTwo Dooms 1958 story by C.M. KornbluthThe Tale of the Computer That Fought a Dragon 1977 story by Stanislaw LemThe Green Hills of Earth 1947 story by Robert A. HeinleinGhost V 1957 story by Robert SheckleyThe Phantom of Kansas 1976 story by John VarleyCaptain Nemo's Last Stand 1973 story by Josef NesvadbaInconstant Moon 1971 story by Larry NivenThe Gold at the Starbow's End 1971 story by Frederik PohlA Sign In Space 1968 story by Italo CalvinoThe Spiral 1968 story by Italo CalvinoThe Dead Past 1956 story by Isaac AsimovThe Lens 1977 story by Annemarie van EwyckThe Hurkle Is a Happy Beast 1949 story by Theodore SturgeonZero Hour 1947 story by Ray BradburyNine Lives 1969 story by Ursula K. LeGuinThe Muse 1964 story by Anthony BurgessThe Public Hating 1955 story by Steve AllenPoor Superman 1951 story by Fritz LeiberAngouleme 1974 story by Thomas M. DischStranger Station 1956 story by Damon KnightThe Dead Fish 1955 story by Boris VianI Was the First to Find You 1977 story by Kirill BulychevThe Lineman 1957 novella by Walter M. Miller JrTlon, Uqbar, Orbis Tertius 1962 story by Jorge Luís BorgesCodemus 1968 story by Tor Age BringsvaerdA Kind if Artistry 1962 story by Brian AldissSecond Variety 1953 story by Philip K. DickWeihnachtsabend 1972 story by Keith RobertsI Do Not Love Thee, Doctor Fell 1955 story by Robert BlochAye, & Gomorrah... 1967 story by Samuel R. DelanyHow Erg the Self-Inducting Slew a Paleface 1977 story by Stanislaw LemNobody's Home 1972 story by Joanna RussParty Line 1973 story by Gérard KleinThe Proud Robot 1943 story by Lewis PadgettVintage Season 1946 story by Henry Kuttner & C.L. MooreThe Way to Amalteia 1984 novella by Arkady & Boris Strugatsky",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Science Fiction Fantasy",
    "Collections",
    "Fantasy"
  ],
  "author": "David G. Hartwell",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/520723.The_World_Treasury_of_Science_Fiction"
}