{
  "title": "Plague of Corruption: Restoring Faith in the Promise of Science",
  "description": "“Kent Heckenlively and Judy Mikovits are the new dynamic duo fighting corruption in science.” —Ben Garrison, America’s #1 political satirist Dr. Judy Mikovits is a modern-day Rosalind Franklin, a brilliant researcher shaking up the old boys’ club of science with her groundbreaking discoveries. And like many women who have trespassed into the world of men, she uncovered decades-old secrets that many would prefer to stay buried. From her doctoral thesis, which changed the treatment of HIV-AIDS, saving the lives of millions, including basketball great Magic Johnson, to her spectacular discovery of a new family of human retroviruses, and her latest research which points to a new golden age of health, Dr. Mikovits has always been on the leading edge of science. With the brilliant wit one might expect if Erin Brockovich had a doctorate in molecular biology, Dr. Mikovits has seen the best and worst of science. When she was part of the research community that turned HIV-AIDS from a fatal disease into a manageable one, she saw science at its best. But when her investigations questioned whether the use of animal tissue in medical research were unleashing devastating plagues of chronic diseases, such as autism and chronic fatigue syndrome, she saw science at its worst. If her suspicions are correct, we are looking at a complete realignment of scientific practices, including how we study and treat human disease. Recounting her nearly four decades in science, including her collaboration of more than thirty-five years with Dr. Frank Ruscetti, one of the founders of the field of human retrovirology, this is a behind the scenes look at the issues and egos which will determine the future health of humanity.",
  "genres": [
    "Science",
    "Nonfiction",
    "Health",
    "Politics",
    "Medical",
    "Medicine",
    "History"
  ],
  "author": "Kent Heckenlively",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/52092854-plague-of-corruption"
}