{
  "title": "In Pain: A Bioethicist's Personal Struggle with Opioids",
  "description": "A bioethicist’s eloquent and riveting memoir of opioid dependence and withdrawal—a harrowing personal reckoning and clarion call for change not only for government but medicine itself, revealing the lack of crucial resources and structures to handle this insidious nationwide epidemic.Travis Rieder’s terrifying journey down the rabbit hole of opioid dependence began with a motorcycle accident in 2015. Enduring half a dozen surgeries, the drugs he received were both miraculous and essential to his recovery. But his most profound suffering came several months later when he went into acute opioid withdrawal while following his physician’s orders. Over the course of four excruciating weeks, Rieder learned what it means to be “dope sick”—the physical and mental agony caused by opioid dependence. Clueless how to manage his opioid taper, Travis’s doctors suggested he go back on the drugs and try again later. Yet returning to pills out of fear of withdrawal is one route to full-blown addiction. Instead, Rieder continued the painful process of weaning himself.Rieder’s experience exposes a dark secret of American pain management: a healthcare system so conflicted about opioids, and so inept at managing them, that the crisis currently facing us is both unsurprising and inevitable. As he recounts his story, Rieder provides a fascinating look at the history of these drugs first invented in the 1800s, changing attitudes about pain management over the following decades, and the implementation of the pain scale at the beginning of the twenty-first century. He explores both the science of addiction and the systemic and cultural barriers we must overcome if we are to address the problem effectively in the contemporary American healthcare system.In Pain is not only a gripping personal account of dependence, but a groundbreaking exploration of the intractable causes of America’s opioid problem and their implications for resolving the crisis. Rieder makes clear that the opioid crisis exists against a backdrop of real, debilitating pain—and that anyone can fall victim to this epidemic.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Medicine",
    "Health",
    "Science",
    "Medical",
    "Audiobook"
  ],
  "author": "Travis Rieder",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/52090718-in-pain"
}