{
  "title": "Headliners",
  "description": "Sparks fly when two feuding TV presenters are thrown together to host a live morning show in Lucy Parker’s latest enemies-to-lovers contemporary romance.He might be the sexiest man in London, according to his fan site (which he definitely writes himself), but he’s also the most arrogant man she’s ever met.She might have the longest legs he’s ever seen, but she also has the sharpest tongue.For years, rival TV presenters Sabrina Carlton and Nick Davenport have traded barbs on their respective shows. The public can’t get enough of their feud, but after Nick airs Sabrina’s family scandals to all of Britain, the gloves are off. They can barely be in the same room together—but these longtime enemies are about to become the unlikeliest of cohosts.With their reputations on the rocks, Sabrina and Nick have one last chance to save their careers. If they can resurrect a sinking morning show, they’ll still have a future in television. But with ratings at an all-time low and a Christmas Eve deadline to win back the nation’s favor, the clock is ticking—and someone on their staff doesn’t want them to succeed.Small mishaps on set start adding up, and Sabrina and Nick find themselves—quelle horreur—working together to hunt down the saboteur…and discovering they might have more in common than they thought. When a fiery encounter is caught on camera, the public is convinced that the reluctant cohosts are secretly lusting after one another.The public might not be wrong.Their chemistry has always been explosive, but with hate turning to love, the stakes are rising and everything is on the line. Neither is sure if they can trust these new feelings…or if they’ll still have a job in the New Year.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Fiction",
    "Audiobook",
    "Adult"
  ],
  "author": "Lucy  Parker",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/52069082-headliners"
}