{
  "title": "Elite Power: Rhett",
  "description": "~ ~ ~ ~ ~ ~ Earl Rhett Kaiser ~ ~ ~ ~ ~ ~ ~  My three-night stand is more than I thought.  She collides with my world, making it rock on its axis.   Yeah, she’s the one that I can’t seem to forget.  I need to ignore my soul’s roar.  She’s part of the web of deception that I need to make right.   She’s wild; she’s beautiful, she’s completely untamed and smart.   She runs from my grasp, fearing for her life.   She doesn't grant me chance, but I’m here to save her.  The King seeks justice, and the underworld war needs to end.  The bloodshed, the Capo, is dead.  The Lord is out of control; he’s eager to wage war and claiming her as his reward.  ~ ~ ~ ~ ~ ~ Isabelle Napolitano ~ ~ ~ ~ ~ ~  My world has changed; who knew it would.   My Papà, the Capo of the largest criminal underworld, is dead.  The war has to end!  My brothers are gone and nowhere to be found.  The Lord in Europe seeks revenge, claiming me as his.  I don’t think so, I would rather die.  I have to run; I have to hide.  I’m petrified, and I’m going insane.  What should I do?  My three-night stand unexpectedly shows back up in my life.  He’s not who I thought.  He’s an Elite, much more than a Capo in the underworld.  Who would have thought?  He wants to protect me, but is that a lie?  My heart aches; my soul weeps.  I’m running, not looking, not listening to him.  Nobody can help me; I can’t stay here.  I must hide, I pray that I’ll survive.  ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~  Experience the world of the ruthless masters, the Elite Supreme Power dictating society and the world.  Taste the excitement and the mysterious allure of falling in love.  Enjoy the opulence, the adventure, the power wars, the suspense, the corruption, the drama, lies, secrets, and the omnipresent danger cloaking their life.  The Elite power is supreme, but love brings them to their knees!  Note ~ Elite Power, Supreme Legacy Series are also standalone stories and no cliffhangers. (Dark Mafia Romance . . . . . . HEA)",
  "genres": [],
  "author": "P.T. Macias",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/52067662-elite-power"
}