{
  "title": "Antkind",
  "description": "The bold and boundlessly original debut novel from the Oscar-winning screenwriter of Being John Malkovich, Adaptation, Eternal Sunshine of the Spotless Mind, and Synecdoche, New York.B. Rosenberger Rosenberg, neurotic and underappreciated film critic (failed academic, film-maker, paramour, shoe salesman who sleeps in a sock drawer), stumbles upon a hitherto unseen film made by an enigmatic outsider—a film he's convinced will change his career trajectory and rock the world of cinema to its core. His hands on what is possibly the greatest movie ever made—a three-month-long stop-motion masterpiece that took its reclusive auteur ninety years to complete—B. knows that it is his mission to show it to the rest of humanity. The only problem: The film is destroyed, leaving him the sole witness to its inadvertently ephemeral genius.All that's left of this work of art is a single frame from which B. must somehow attempt to recall the film that just might be the last great hope of civilization. Thus begins a mind-boggling journey through the hilarious nightmarescape of a psyche as lushly Kafkaesque as it is atrophied by the relentless spew of Twitter. Desperate to impose order on an increasingly nonsensical existence, trapped in a self-imposed prison of aspirational victimhood and degeneratively inclusive language, B. scrambles to recreate the lost masterwork while attempting to keep pace with an ever-fracturing culture of \"likes\" and arbitrary denunciations that are simultaneously his bete noire and his raison d'etre.A searing indictment of the modern world, Antkind is a richly layered meditation on art, time, memory, identity, comedy, and the very nature of existence itself—the grain of truth at the heart of every joke.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Humor",
    "Literary Fiction",
    "Novels",
    "Literature",
    "Film"
  ],
  "author": "Charlie Kaufman",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/52111503-antkind"
}