{
  "title": "The Captain's Lady (Author's Cut Edition): Historical Romance",
  "description": "Revenge, Love, and the Struggle of a Fledgling Nation Collide in The Captain's Lady by Jo Goodman--Circa 1812, Island of Tortola; Washington--It's revenge that Alex Danty seeks after British Naval officer, Captain Travers, brings terror and murder to her Caribbean island home. Gravely injured protecting her loved ones, she's rescued by an American ship's crew. Devastated by the loss of her loved ones, Alex swears an oath to find and kill Travers.Captain Tanner Cloud, understands why Alex doesn’t thank him for his interference, but he refuses to return to her home and begin what he believes is a mad search for Travers. He's also deeply attracted to the beautiful Alex Danty and takes her from her island home to protect her.While the attraction between Alex and Tanner grows aboard his ship, she never stops promising to escape while he never stops promising to stop her. She wins, and sets out to do exactly as she'd vowed.Two years later, Alex has Travers in her sights when Tanner once again interferes, this time at the behest of Washington. Although furious with Tanner, Alex agrees to accompany him to Washington to aid government officials against England.But a surprise awaits them both in Washington when they discover treasonous schemers. Now, caught up in a fledgling nation's battle for survival, what tears them apart may ultimately bring them together.Publisher Note: For new and old fans of Jo Goodman comes one of her classic works, freshly edited by Jo Goodman for today's audience. Fans of Mary Jo Putney, Kat Martin, Jo Beverley, Courtney Milan and Kaki Warner will enjoy this spirited adventure and romance.“Delightful and exciting…Goodman holds the suspense as well as the surprises and never lets up on the passion.” ~RT Book Reviews“Goodman is a thoughtful and intelligent writer who can make her characters live and breathe on the page.” ~All About Romance“A perfect treat for readers who enjoy smart, sensual love stories à la Amanda Quick.” ~Book List“A tender, engaging romance and a dash of risk in a totally compelling read.” ~Library Journal“For the pure joy of reading a romance, this book comes close to perfection.” ~Dear Author",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Pirates",
    "Fiction",
    "Historical Fiction",
    "Forced Proximity"
  ],
  "author": "Jo Goodman",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/52104728-the-captain-s-lady-author-s-cut-edition"
}