{
  "title": "Reluctant Gods",
  "description": "Sorry to all 40,000, or so of you, that got the unedited file I mistakenly placed on Goodreads and all other book sites. The proper edited file was uploaded on 4/23/14. My apologies for this gross oversight. A.J.Become a supernatural immortal?...Reluctantly.Book one of this fantasy series about reincarnated lovers.Review by Danita Dyess for Readers' FavoriteAuthor A.J. Aaron is a genius. I loved this book! Although it had fantastical images, the real story was about Sevilen accepting his power. I understood that everything is as it should be but the author’s depiction of this concept is exceptional. The laid-back dialogue and cool characters helped mix fantasy with what is usually considered a serious, esoteric subject. Leyna’s mindset and sexual exploits are tastefully done. Quotes from Einstein, Toffler and Drucker reinforced the message.“Reluctant Gods” asks you to imagine waking up one Saturday morning and learning that you are literally a god with the power to save the world. Your grandmother, Aysel, is an ancient mystic who showed you the secrets behind the trap door. Well, this scenario happened to Sevilen, an engineer with a back problem. Within 24 hours of Aysel’s death, his health is restored. Then, he inherits $77 billion and learns he can telepathically transport to another dimension. He meets Alexander, a trusted servant and four new angels - Raphael, Michael, Gabriel and Auriel. Together, these super humans will help him reunite with his one great love, Leyna, a gorgeous narcissist who misused her power and died in her past lives. But there is one catch: Sevilen must accomplish this before Leyna’s next birthday and the proverbial clock is ticking.Author’s DescriptionPast lives and past mistakes echo themselves for over five hundred years until an ancient agreement with four archangels manifests itself to remind a witch and a wizard of their destiny. This is Leyna and Sevilen’s last chance to reunite and achieve the godlike powers meant for them.Sevilen, a former engineer, reluctantly takes on his role to try to save his love Leyna from his past life, since in this life, as in her past lives, she will be dead in months if he doesn’t. In today’s life, he doesn’t even like her, and doesn’t care to save her.Leyna, a powerful, cruel, and callus executive, runs from Sevilen and the thoughts of becoming a goddess, or falling in love with a man.The two are dumped into a world of magic where they gain abilities to create and destroy universes, throw a bolt of lightning, change into another body, or use their ESP to read minds.What are the other characters like?Laugh with the sexy great grandmother goddess, who keeps making passes at her great grandson. Marvel at the ancient, loving, manservant Alexander that makes Jeeve’s look like a houseboy. Love the archangels, Michael (Mike), Gabriel (Gabby), Raphael (Rapper), and Auriel (Aurie), who look and act like no archangels you ever heard of.What kind of a read will it be?You will be engulfed in this tale of romance, denial, and disbelief, among an outrageous cast of characters. The comedic antics of the diverse and colorful characters will make you laugh while they become as familiar to you as your best friends, in this blend of fantasy, humor, mystery, and romance. Science, beliefs, and real life references will make you wonder, could this happen?How is it written?Detailed pictures are created in the reader’s mind as they flow through this tale, vividly told. Journey through Prague in the Czech republic and walk the streets of Mala Strana and Stare Mesto. Visit the fully restored mansion in Chardon, Ohio where they all live.This witch and wizard series, fantasy romance is like no other you will ever read. Is it really fiction that they attained their psychic powers? Or any of their powers?",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Romance",
    "Mystery"
  ],
  "author": "A.J. Aaron",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/12566076-reluctant-gods"
}