{
  "title": "Empire City",
  "description": "The author of the “urgent and deeply moving” (The New York Times) Youngblood returns with this bold and provocative novel following a group of super-powered soldiers and civilians as they navigate an imperial America on the precipice of a major upheaval—for fans of The Fortress of Solitude and The Plot Against America. Thirty years after its great triumph in Vietnam, the United States has again become mired in an endless foreign war overseas. Stories of super soldiers known as the Volunteers tuck in little American boys and girls every night. Yet domestic politics are aflame. Violent protests erupt throughout the nation; an ex-military watchdog group clashes with police while radical terrorists threaten to expose government experiments within the veteran rehabilitation colonies.  Halfway between war and peace, the Volunteers find themselves waiting for orders in the vast American city-state, Empire City. There they encounter a small group of civilians who know the truth about their powers, including Sebastian Rios, a young bureaucrat wrestling with survivor guilt, and Mia Tucker, a wounded army pilot-turned-Wall Street banker. Meanwhile, Jean-Jacques Saint-Preux, a Haitian-American Volunteer from the International Legion, decides he’ll do whatever it takes to return to the front lines.  Through it all, a controversial retired general emerges as a frontrunner in the presidential campaign, promising to save the country from itself. Her election would mean unprecedented military control over the country, with promises of security and stability—but at what cost?  Featuring Gallagher’s “vital” (The Washington Post), “evocative” (The Wall Street Journal) prose, Empire City is a rousing vision of an alternate—yet all too familiar—America on the brink.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Matt Gallagher",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/52117249-empire-city"
}