{
  "title": "Sweet Things",
  "description": "This bad boy Chef just lost the only home he’s ever had. I spent the last decade building a restaurant and running a kitchen I’m proud of, but with one selfish choice, my brother destroys it all. I’ve sacrificed everything—including any chance at a love life—and I’ve ended up with nothing.Well, not exactly nothing.Inheriting part ownership of a dilapidated inn and sprawling lavender farm in a wacky river town with four other guys I’ve never met is not exactly my idea of a great career change. But I’ve got to cook somewhere and Rainbow River isn’t Portland, but the town’s got a brisk tourist trade and my new business partners have the skills to whip the inn and land into shape as long as I can bring the kitchen up to snuff. It’ll be a new start. And this time, I’ll take the lesson my brother’s betrayal taught me to heart and trust no one. I’m resolved. I’m determined. Then Liam Tindall walks back into my life. And all that resolve? Out the damn window. This sweet Baker is all about hearth and home. I never expected to see the sad-eyed Chef I’d spent a steamy and delicious night with again. But just days after I get home to Rainbow River after my better-than-chocolate encounter with Clay and there he is: standing on the old inn’s steps and telling me that he’s part owner of the place. Which means Clay is one of my best friend’s new business partners. More than anything, my best friend wants the inn to succeed. Which means I can’t be flirting with the Chef who’s going to be a big part of that success. So now I’ve got a man hotter-than-scorched-sugar living right down the road from me and I shouldn’t even be looking, let alone thinking about touching. I tell myself I can stay away from temptation. That it’s the kind of messy even I won’t get involved in. Next thing I know, Clay’s in my bakery every day making lunches for the inn’s construction crew and getting me to school him on the finer quirks of our illustrious town council in exchange for meat-smoking lessons (no, not that kind of meat, get your mind out of the gutter!), plus being all irresistible and stuff. So when one kiss leads to another…well, you know the deal. Some sweet things are hard to resist and even harder to keep secret. But secrets in a small town don’t stay secret for long. And when this secret gets out?Whoo, boy. Rainbow River is never going to be the same. SWEET THINGS is 92K and is the first book in the Rainbow River Series, where five very different men receive an unexpected inheritance and come together to bring a beloved friend’s old Inn back to its former glory—while finding love and a new home in the quirky town of Rainbow River, where true love is never lost without being found again.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary"
  ],
  "author": "Mia  Scott",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/52096284-sweet-things"
}