{
  "title": "The Lost Diary of Venice",
  "description": "Two impossible love stories are fatefully connected by one artistic legacy in a stunning debut that leaps between the mysteries of late-Renaissance Venice and the dramas of present-day America.“Enchanting from the first page.”—Sarah Jio,  New York Times  bestselling author of  All the Flowers in ParisIn the wake of her father’s death, Rose Newlin finds solace in her work as a book restorer. Then, one rainy Connecticut afternoon, a struggling painter appears at her door. William Lomazzo brings with him a sixteenth-century treatise on art, which Rose quickly identifies as a palimpsest: a document written over a hidden diary that had purposely been scraped away. Yet the restoration sparks an unforeseen challenge when William—a married man—and Rose experience an instant, unspoken attraction.Five centuries earlier, Renaissance-era Venetians find themselves at the mercy of an encroaching Ottoman fleet preparing for a bloody war. Giovanni Lomazzo, a portrait artist grappling with tragedy, discovers that his vision is fading with each passing day. Facing the possibility of a completely dark world, Gio begins to document his every encounter, including what may be his final artistic feat: a commission to paint the enchanting courtesan of one of Venice’s most powerful military commanders. Soon, however, Gio finds himself enraptured by a magnificent forbidden love.Spellbound by Gio’s revelations, Rose and William are soon forced to confront the reality of their own mystifying connection.A richly detailed page-turner shadowed by one of history’s darkest times, The Lost Diary of Venice weaves a heartbreakingly vivid portrait of two vastly different worlds—and two tales of entrancing, unrelenting love.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Italy",
    "Historical",
    "Art",
    "Italian Literature"
  ],
  "author": "Margaux Deroux",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/52135102-the-lost-diary-of-venice"
}