{
  "title": "Dark Stranger Trilogy: The Children Of The Gods",
  "description": "\"This has been the best paranormal series I have ever read. It is better than vampire stories and better than reverse harem stories. It has lots of adventure, mystery, crime, justice, lust, love, romance, all mixed in to create much entertainment that I can't put the books down. I have been reading the series from book 1 and can't wait for the next book. All the books are generously written. A lot goes on in each book so you get your money's worth. And I haven't been disappointed yet. This trilogy introduces the main characters. So if you want to get to know more about all the other characters you will want to read the other books. I highly recommend this trilogy and the entire series. I am hooked because it is so entertaining that it makes me forget my worries as it takes me into another world in my mind.\"Book 1--Dark Stranger The Since the dawn of human civilization, two warring factions of near-immortals - the descendants of the gods of old - have been secretly shaping its destiny. Leading the clandestine battle from his luxurious L.A. high-rise, Kian is surrounded by his clan, yet alone. Descending from a single goddess, clan members are forbidden to each other. And as the only other immortals are their hated enemies, Kian and his kin have been long resigned to a lonely existence of fleeting trysts with human partners. That is, until his sister makes a game-changing discovery - a mortal seeress who she believes is a dormant carrier of their genes. Ever the realist, Kian is skeptical and refuses Amanda's plea to attempt Syssi's activation.Syssi's paranormal foresight lands her a job at Dr. Amanda Dokani's neuroscience lab, but it fails to predict the thrilling yet terrifying turn her life will take. Syssi has no clue that her boss is an immortal who'll drag her into a secret, millennia-old battle over humanity's future. Nor does she realize that the professor's imposing brother is the mysterious stranger who's been starring in her dreams.Book 2--Dark Stranger While sheltered in the clan's stronghold, Syssi is unaware that Kian and Amanda are not human, and neither are the supposedly religious fanatics that are after her. She feels a powerful connection to Kian, and as he introduces her to a world of pleasure she never dared imagine, his dominant sexuality is a revelation. Considering that she's completely out of her element, Syssi feels comfortable and safe letting go with him. That is, until she begins to suspect that all is not as it seems. Piecing the puzzle together, she draws a scary, yet wrong conclusion...Book 3--Dark Stranger When Kian confesses his true nature, Syssi is not as much shocked by the revelation as she is wounded by what she perceives as his callous plans for her. If she doesn't turn, he'd be forced to erase her memories and let her go. His family's safety demands secrecy - no one in the mortal world is allowed to know that immortals exist. Resigned to the cruel reality, Syssi is determined to enjoy what little time she has with Kian, one day at a time.Goddess's Part 1--The Children of the Gods Origins series.Promised to the power-hungry God Mortdh, the young Annani is determined to find a way out of the prearranged political union that would one day put Mortdh on the throne.The handsome young God Khiann is a much better choice, even though he is a trader and not a member of one of the leading families. Now all she has to do is convince him that she is worth chancing an all-out civil war over succession and possibly his very life.",
  "genres": [
    "Romance",
    "Fantasy",
    "Fiction",
    "Contemporary",
    "Gods",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "I.T. Lucas",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/52122325-dark-stranger-trilogy"
}