{
  "title": "Written in Blood",
  "description": "Vampires are coming!Excerpt from Written in Blood:“It haunted me from a distance. Swathed in a thick veil of fog, with but a few old trees looming above, the island appeared desolated and dead.An overwhelming sense of despair crept behind my neck as we reached the shore. Thousands of men, women, and children had been condemned to live the last of their days here, infected by the plague. Dragged away from their homes, here, they suffered their agonizing illness, shunned by society, exiled from everything they knew and held dear.”Fans of Anne Rice and Cassandra Clare will love The Unnatural Brethren series!Praise for Written in Blood: Where do I start? It's gonna be a challenge, I want to gush a fountain of spoilers! This book should be filed away under \"Guilty Pleasures.\" Our hero, Ivan, is a field of wild oats, begging to be sown. While his sister Alisa is the calm and the storm.There were so many minor characters with unforgettable personalities, I found myself getting attached to every new person that popped up. (Except one, he knows who he is, and take it from me, he had it coming)The writing style is solid. The author's style was passionate and fast-paced, I sailed through this book... partly because of the pace, and partly because the drama and intrigue kept me hooked all the way through.I especially appreciated all of the traveling in this book. I enjoyed taking a tour of London, Paris, and Venice all from the comfort of my couch.☆☆☆☆☆, I loved this book! Now if you'll excuse me, I have a sequel to buy.--Ivan Lockhart is the definition of a romantic anti-hero. His heart is the right place, his life is a constant strife to do the right thing, yet circumstances have shaped him into something he abhors.There's a sense of cruel fate that haunts him. Even as a child, surviving death becomes a curse of sorts, and, in his need to be loved and accepted, he forges unconventional relationships, dragging those who hold near and dear into his dark world. And this all happens before the supernatural even shows up in this story.--An amazing read from an amazing author. I love how she combines the paranormal with the historical. So perfect and I can't wait for her next read!!",
  "genres": [
    "Vampires",
    "Audiobook",
    "Paranormal",
    "Fantasy",
    "Romantasy",
    "Paranormal Romance",
    "Romance"
  ],
  "author": "Silvana G. Sánchez",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/52121594-written-in-blood"
}