{
  "title": "Money for Nothing: The Scientists, Fraudsters, and Corrupt Politicians Who Reinvented Money, Panicked a Nation, and Made the World Rich",
  "description": "The sweeping story of how the greatest minds of the Scientific Revolution applied their new ideas to people, money, and markets--and along the way, invented modern finance.Money for Nothing chronicles the moment when the needs of war, discoveries of natural philosophy, and ambitions of investors collided. It's about how the Scientific Revolution intertwined with finance to set England--and the world--off in an entirely new direction.At the dawn of the eighteenth century, England was running out of money due to a prolonged war with France. Parliament tried raising additional funds by selling debt to its citizens, taking in money now with the promise of interest later. It was the first permanent national debt, but still they needed more. They turned to the stock market--a relatively new invention itself--where Isaac Newton's new mathematics of change over time, which he applied to the motions of the planets and the natural world, were fast being applied to the world of money. What kind of future returns could a person expect on an investment today? The Scientific Revolution could help. In the hub of London's stock market--Exchange Alley--the South Sea Company hatched a scheme to turn pieces of the national debt into shares of company stock, and over the spring of 1720 the plan worked brilliantly. Stock prices doubled, doubled again, and then doubled once more, getting everyone in London from tradespeople to the Prince of Wales involved in money mania that consumed the people, press, and pocketbooks of the empire.Unlike science, though, with its tightly controlled experiments, the financial revolution was subject to trial and error on a grand scale, with dramatic, sometimes devastating, consequences for people's lives. With England at war and in need of funds and \"stock-jobbers\" looking for any opportunity to get in on the action, this new world of finance had the potential to save the nation--but only if it didn't bankrupt it first.",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "Finance",
    "Business",
    "Politics",
    "Audiobook"
  ],
  "author": "Thomas Levenson",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/52128986-money-for-nothing"
}