{
  "title": "Jackie and the Giant",
  "description": "He's big and green and looking for a mate...Jackie works as hard as she can to provide for her younger sister, but they’re barely surviving. When she comes home to find that her sister has traded their COW (Comestible Organic Wafer machine) to an alien trader in return for a worthless bean, she is both worried and hurt. She thought she could trust the intriguing male hidden behind the forbidding armor.When a giant beanstalk grows overnight, Jackie is desperate enough to climb to the top and demand the return of her COW. Instead, she finds a whole new world - and a very large surprise. Beneath the armor is a massive alien who seems to be as much plant as man.Cormac is enchanted by the little human female who trades with him each quarter and makes his sap rise. He devises a plan to bring her into his domain, even though he knows he may not be able to keep her. But now that she’s here, how can he let her go?A big green alien, a feisty heroine, an evil storekeeper, and some helpful plants - this sweet and steamy fairy tale is not the story you remember! (Intended for mature audiences only!)----------------------Cosmic Fairy Tales is a collaboration in which several authors are retelling beloved tales with a science fiction romance twist. Each book is a standalone, containing its own Happily Ever After, and they can be read in any order. Be sure to explore the other titles in the collection:The Hunchback by Regine AbelThe Frog Prince by Tracy LaurenContaminated by Amanda MiloThe Ugly Dukeling by Bex McLynnJackie and the Giant by Honey PhillipsEscaping Wonderland by Tiffany RobertsRampion by Susan TrombleyThe Lion and the Mouse by Emmy Chandler",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Fantasy",
    "Science Fiction Romance",
    "Paranormal Romance",
    "Fairy Tales"
  ],
  "author": "Honey Phillips",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/52139517-jackie-and-the-giant"
}