{
  "title": "The Great Terror: A Reassessment",
  "description": "The definitive work on Stalin's purges, Robert Conquest's The Great Terror was universally acclaimed when it first appeared in 1968. Harrison Salisbury called it \"brilliant...not only an odyssey of madness, tragedy, and sadism, but a work of scholarship and literary craftsmanship.\" And in recent years it has received equally high praise in the former Soviet Union, where it is now considered the definitive account of the period. When Conquest wrote the original volume, he relied heavily on unofficial sources. With the advent of glasnost, an avalanche of new material became available, and Conquest mined this enormous cache to write, in 1990, a substantially new edition of his classic work, adding enormously to the detail. Both a leading historian and a highly respected poet, Conquest blends profound research with evocative prose, providing not only an authoritative account of Stalin's purges, but also a compelling and eloquent chronicle of one of this century's most tragic events. He provides gripping accounts of everything from the three great \"Moscow Trials,\" to methods of obtaining confessions, the purge of writers and other members of the intelligentsia, life in the labor camps, and many other key matters.  On the fortieth anniversary of the first edition, in the light of further archival releases, and new material published in Moscow and elsewhere, it remains remarkable how many of Conquest's most disturbing conclusions have continued to bear up. This volume, featuring a new preface by Conquest, rounds out the picture of this huge historical tragedy, further establishing the book as the key study of one of the twentieth centurys most lethal, and longest-misunderstood,offenses against humanity.",
  "genres": [
    "History",
    "Russia",
    "Nonfiction",
    "Politics",
    "Russian History",
    "European History",
    "World History"
  ],
  "author": "Robert Conquest",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/52137.The_Great_Terror"
}