{
  "title": "Dark Enemy Taken",
  "description": "Since the dawn of human civilization, two warring factions of near-immortals - the descendants of the gods of old - have been secretly shaping its destiny. Amanda's small clan champions progress and peace, while their powerful enemy, the Doomers, propagates ignorance and war.Descending from a single goddess - the only one to survive the ancient cataclysm that wiped out her kind - Amanda's clan members are forbidden to each other. And as the only other known immortals are their hated enemies, they've been long resigned to a lonely existence of fleeting trysts with human partners. That is, until Amanda, the goddess's youngest daughter and a researcher of paranormal abilities - makes a game-changing discovery; two of her test subjects might be dormant carriers of the immortal gene. But before she can prove it, she gets snatched off a Beverly Hills street by a huge Doomer.Dalhu can't believe his luck when he stumbles upon the beautiful immortal professor. Presented with a once in a lifetime opportunity to grab an immortal female for himself, he kidnaps her and runs. If he ever gets caught, either by her people or his, his life is forfeit. But for a chance of a loving mate and a family of his own, Dalhu is prepared to do everything in his power to win Amanda's heart, and that includes leaving the Doom brotherhood and his old life behind.Amanda soon discovers that there is more to the handsome Doomer than his dark past and a hulking, sexy body. But succumbing to her enemy's seduction, or worse, developing feelings for a ruthless killer is out of the question. No man is worth life on the run, not even the one and only immortal male she could claim as her own...Her clan and her research must come first...Adult only Paranormal Romance.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Urban Fantasy",
    "Vampires",
    "Adult"
  ],
  "author": "I.T. Lucas",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/52120778-dark-enemy-taken"
}