{
  "title": "The Bipolar Child: The Definitive and Reassuring Guide to Childhood's Most Misunderstood Disorder",
  "description": "Since it first appeared on bookshelves, The Bipolar Child has made an indelible mark on the field of psychiatry and has become the resource that families rely upon. Now, with more than 200,000 copies sold, the first book about early-onset bipolar disorder is completely revised and expanded.Bipolar disorder—manic depression—was once thought to be rare in children. Now researchers are discovering not only that bipolar disorder can begin early in life, but that it is much more common than ever imagined. Yet the illness is often misdiagnosed and mistreated with medications that can exacerbate the symptoms. Why? Bipolar disorder manifests itself differently in children than in adults, and in children there is an overlap of symptoms with other childhood psychiatric disorders. As a result, these kids may be labeled with any of a number of psychiatric “ADHD,” “depression,” “oppositional defiant disorder,” “obsessive-compulsive disorder,” or “generalized anxiety disorder.” Too often they are treated with stimulants or antidepressants—medications that can actually worsen the bipolar condition.Since the publication of its first edition, The Bipolar Child has helped many thousands of families get to the root cause of their children’s behaviors and symptoms and find what they need to know. The Papoloses comprehensively detail the diagnosis, explain how to find good treatment and medications, and advise parents about ways to advocate effectively for their children in school. In this edition, a greatly expanded education chapter describes all the changes in educational law due to the 2004 reauthorization of IDEA (Individuals with Disabilities Education Act), and offers a multitude of ideas for parents and educators to help the children feel more comfortable in the academic environment. The book also contains crucial information about hospitalization, the importance of neuropsychological testing (with a recommended battery of tests), and the world of insurance. Included in these pages is information on promising new drugs, greater insight into the special concerns of teenagers, and additional sections on the impact of the illness on the family. In addition, an entirely new chapter focuses on major advances taking place in the field of molecular genetics and offers hope that researchers will better understand the illness and develop more targeted and easier-to-tolerate medicines.The Bipolar Child is rich with the voices of parents, siblings, and the children themselves, opening up the long-closed world of the families struggling with this condition. This book has already proved to be an invaluable resource for parents whose children suffer from mood disorders, as well as for the professionals who treat and educate them, and this new edition is sure to continue to light the way.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Parenting",
    "Mental Health",
    "Mental Illness",
    "Reference",
    "Self Help"
  ],
  "author": "Demitri Papolos",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/521376.The_Bipolar_Child"
}