{
  "title": "Symbiosis",
  "description": "The Compton Crook Award-winning author weaves her trademark blend of science fiction and dark humor in this dazzling story that continues the imaginative saga begun in \nEscaping Exodus\n, in which a society lives in the belly of a beast—and an entire civilization's survival depends on a pair of uneasy allies who must come together for one epic battle.Nearly a thousand years removed from Earth, the remnants of humanity cling to existence inside giant, space faring creatures known as the Zenzee. Abused and exploited by humans for generations, these majestic animals nearly went extinct, but under the command of its newly minted ruler, Doka Kaleigh, life in the Parados I has flourished. Thanks to careful oversight and sacrifice by all of its crew, they are now on the brink of utopia, and yet Doka's rivals feel threatened by that success.The Senate allowed Doka to lead their people believing he'd fail spectacularly—a disaster that would cement the legitimacy of their long-standing matriarchy. Despite vocal opposition and blatant attacks on his authority, Doka has continued to handle his position with grace and intelligence; he knows a single misstep means disaster. When a cataclysmic event on another Zenzee world forces Doka and his people to accept thousands of refugees, a culture clash erupts, revealing secrets from the past that could endanger their future. For Doka, the stakes are bigger and more personal than ever before—and could cost him his reign and his heart.He has fallen for the one woman he is forbidden to his wife, Seske.Doka and Seske must work closely together to sway the other Zenzee worlds to stop their cycles of destruction. But when they stumble upon a discovery that can transform their world, they know they must prepare to fight a battle where there can be no winners, only survivors.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Queer",
    "Fiction",
    "Space Opera",
    "LGBT",
    "Adult"
  ],
  "author": "Nicky Drayden",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/52163500-symbiosis"
}