{
  "title": "Operation Vengeance: The Astonishing Aerial Ambush That Changed World War II",
  "description": "The New York Times bestselling author of Viper Pilot delivers an electrifying narrative account of the top-secret U.S. mission to kill Isoroku Yamamoto, the Japanese commander who masterminded Pearl Harbor.In 1943, the United States military began to plan one of the most dramatic secret missions of World War II. Its code name was Operation Vengeance. Naval Intelligence had intercepted the itinerary of Admiral Isoroku Yamamoto, the Commander-in-Chief of the Japanese Combined Fleet, whose stealth attack on Pearl Harbor precipitated America’s entry into the war. Harvard-educated, Yamamoto was a close confidant of Emperor Hirohito and a brilliant tactician who epitomized Japanese military might. On April 18th, the U.S. discovered, he would travel to Rabaul in the South Pacific to visit Japanese troops, then fly to the Japanese airfield at Balalale, 400 miles to the southeast.Set into motion, the Americans’ plan was one of the most tactically difficult operations of the war. To avoid detection, U.S. pilots had to embark on a circuitous, 1,000-mile odyssey that would test not only their skills but the physical integrity of their planes. The timing was also crucial: the slightest miscalculation, even by a few minutes—or a delay on the famously punctual Yamamoto’s end—meant the entire plan would collapse, endangering American lives. But if these remarkable pilots succeeded, they could help turn the tide of the war—and greatly boost Allied morale. Informed by deep archival research and his experience as a decorated combat pilot, Operation Vengeance focuses on the mission’s pilots and recreates the moment-by-moment drama they experienced in the air. Hampton recreates this epic event in thrilling detail, and provides groundbreaking evidence about what really happened that day.Operation Vengeance includes 30 black-and-white images.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military History",
    "War",
    "Aviation",
    "Military Fiction"
  ],
  "author": "Dan Hampton",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/52167180-operation-vengeance"
}