{
  "title": "Humankind: Changing the World One Small Act At a Time",
  "description": "HumanKind is the heartwarming, feel-good book that we all need right now.Brad Aronson’s life changed in an instant when his wife, Mia, was diagnosed with leukemia. Following her diagnosis, Brad spent most of the next two-and-a-half years either by her side as she received treatment or trying to shield their five-year-old son, Jack, from the worst of Mia’s illness. Amid the stress and despair of waiting for the treatment to work, Brad and Mia were met by an outpouring of kindness from friends, family, and even complete strangers.Inspired by the many demonstrations of \"humankindness\" that supported their family through Mia's recovery, Brad began writing about the people who rescued his family from that dark time, often with the smallest of gestures. But he didn't stop there. Knowing that simple acts of kindness transform lives across the globe every day, he sought out these stories and shares some of the best ones here.In HumanKind you’ll meet the mentor who changed a child’s life with a single lesson in shoe tying, the six-year-old who launched a global kindness movement, the band of seamstress grandmothers who mend clothes for homeless people, and more.Brad also provides dozens of ways you can make a difference through the simplest words and deeds. You’ll discover how buying someone a meal or sharing a little encouragement at the right time can transform someone’s world, as well as your own.The resource section at the back of the book provides guidance and organizations that will help you channel and amplify your own acts of kindness. Here you'll discover:•\tHow you can fund a surgery to cure someone's blindness with a donation of less than $200.•\tOrganizations through which you can provide a birthday gift for a child who otherwise wouldn't receive one.•\tMultiple places where you can send letters of encouragement to support hospitalized kids, lonely seniors, refugees, veterans and others.•\tAnd over fifty more ways you can change a life.HumanKind will touch your heart. You’ll laugh, you’ll cry, and you’ll be reminded of what really matters.",
  "genres": [
    "Nonfiction",
    "Inspirational",
    "Self Help",
    "Spirituality",
    "Mental Health",
    "Relationships",
    "Philosophy"
  ],
  "author": "Brad Aronson",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/52162353-humankind"
}