{
  "title": "The Lasaran",
  "description": "New York Times bestselling author Dianne Duvall brings readers the first novel in a thrilling new sci-fi series full of action, intrigue, humor, and romance.Taelon searches the galaxy for his younger sister, who mysteriously disappeared while on a diplomatic mission. When an ally reveals that she was seized and is being held prisoner on Earth, Taelon descends upon the blue planet, intent on freeing her and exacting vengeance. However, all does not go as planned. Before he can find her, Taelon is captured and becomes the subject of torturous experiments. For what feels like an eternity, all he knows is pain and fury… until a mind tentatively touches his own and a woman’s voice forever changes his world.After suffering tragic losses, Lisa is finally beginning to carve out a future for herself when chance sends her to the Anomalous Cognition Research Institute. What at first appears to be a benign organization seeking participants for a psychic study instead turns out to be a government facility harboring a much darker intent. Lisa discovers this too late and soon becomes the unwilling subject of a terrifying experiment. Just as fear and desperation threaten to consume her, a deep, compelling voice penetrates the looming insanity and lends her hope.Having seen only the worst of humanity, Taelon is shocked when Lisa risks everything to free him. Together the two make their escape, and Taelon finds himself fascinated by the small human woman who—despite all she’s suffered—can still laugh and tease and lure smiles from him. Friendship swiftly grows between them as they work together to evade soldiers intent on capturing them and find themselves hunted by mystifying preternatural beings. Through it all, Lisa steadfastly remains by his side, stealing more of his heart each day while she helps him unravel the mystery of his sister’s fate. Can they find his sister before the hunters find them? If they survive their quest, will Taelon have to bid Lisa farewell… or can he coax her into leaving her planet and joining him for the adventure of a lifetime?",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance",
    "Audiobook"
  ],
  "author": "Dianne Duvall",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/52172135-the-lasaran"
}