{
  "title": "The Bible Code",
  "description": "The Barnes & Noble Review October 1997 The Bible Code is the first full account of a scientific discovery that may change the world, told by a skeptical secular reporter who became part of the story. During Drosnin's five-year investigation of the 3,000-year-old code in the Bible that may reveal our future, he interviewed all the experts, here and abroad. He spent many weeks with the world-class mathematician who discovered the code, Dr. Eliyahu Rips, and he met with famous mathematicians at Harvard, Yale, and Hebrew University. He also talked to a senior code breaker at the top-secret U.S. National Security Agency, who replicated the code and confirmed its messages.  More than just a simple skip code, the Bible code crisscrosses the entire known text of the Bible to find a complex network of words and phrases. For example, after it finds a keyword (\"Yitzhak Rabin\"), the computer then looks for related information (\"assassin,\" \"Amir,\" \"Tel Aviv\"). Time after time it finds connected names, dates, and places encoded together. With \"Bill Clinton,\" \"President.\" With \"Hitler,\" \"Nazi.\" With the moon landing, \"spaceship\" and \"Apollo 11.\" A code that has information about significant earthquakes that already happened warns of a major earthquake in Los Angeles early in the next century. It also warns of a nuclear war triggered by an act of nuclear terrorism against Israel.  The Bible code raises a critical question: Does the code describe an inevitable future or a series of possible futures whose ultimate outcome we can still decide? In any event, the Bible code forces us to accept whattheBible itself can only ask us to believe: that we are not alone. As Drosnin states, \"If the Bible code proves one thing, it is that a nonhuman intelligence does exist, or at least did exist at the time the Bible was written. No human could have looked thousands of years ahead and encoded in that ancient book the details of today's world.\"",
  "genres": [
    "Nonfiction",
    "Religion",
    "Christian",
    "History",
    "Spirituality",
    "Philosophy",
    "Christianity"
  ],
  "author": "Michael Drosnin",
  "average_rating": "2.88",
  "url": "https://www.goodreads.com/book/show/521542.The_Bible_Code"
}