{
  "title": "A Witch's Tale",
  "description": "The witch’s heart is cold, filled with a cauldron of secrets untold. Eyes a brilliant hue of blue shed tears of sorrow. Where once there was happiness, he’s tortured by grief. Trapped in a witch’s lair of loneliness, only the pure of heart will set him free. In dreams, amber eyes bring a crystal spirit of light and happiness. Secrets revealed will change his destiny and be rewarded with a heart of gold.  Seth Wolfington’s fate was sealed at the age of 13 when he heard the poem being chanted by his aunt Queenie, kneeling in the center of a pentagram. As the disguised master illusionist, The Devil Knight, he performed his greatest illusion, making himself permanently disappear when he’s questioned in the death of his assistant.  Trying to live a normal life with his young daughter, someone who knows the secrets from his past turns his life into a living nightmare. Now, only the pure of heart can set him free.  Elaine Madison is a widow raising her two young children. Despite having to work two jobs to support her family, she’s content and very happy with her life. Her cheating husband was killed in a freak accident, with his girlfriend, so she’s hanging back from starting a new relationship.  Her well-ordered life changes when she goes to a tricky tray at her children’s school. Fate has her winning a tea leaf reading at Tahlia’s Mystical Teas, the new tea shop in town. Reluctant to take a chance, her friend pushes her into going and having a little fun.  Not one to believe in silly fortune-telling, she’s skeptical of anything the gypsy might reveal. She’s shocked to learn two men with blue eyes will come into her life. Both are facing life-challenging situations. The gypsy gives Elaine an evil-eye talisman to wear for the next eleven days to keep away evil spirits. That’s the number of days she’ll have to decide on which man to bring everlasting happiness.",
  "genres": [],
  "author": "Judy Kentrus",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/52153346-a-witch-s-tale"
}