{
  "title": "Minds behind the Brain: A History of the Pioneers and Their Discoveries",
  "description": "Now in a more affordable paperback version! A best seller!Attractively illustrated with over a hundred halftones and drawings, this volume presents a series of vibrant profiles that trace the evolution of our knowledge about the brain.Beginning almost 5000 years ago, with the ancient Egyptian study of \"the marrow of the skull,\" Stanley Finger takes us on a fascinating journey from the classical world of Hippocrates, to the time of Descartes and the era of Broca and Ramon y Cajal, to modern researchers such as Sperry. Here is a truly remarkable cast of characters. We meet Galen, a man of titanic ego and abrasive disposition, whose teachings dominated medicine for a thousand years; Vesalius, a contemporary of Copernicus, who pushed our understanding of human anatomy to new heights; Otto Loewi, pioneer in neurotransmitters, who gave the Nazis his Nobel prize money and fled Austria for England; and Rita Levi-Montalcini, discoverer of nerve growth factor, who in war-torn Italy was forced to do her research in her bedroom. For each individual, Finger examines the philosophy, the tools, the books, and the ideas that brought new insights. Finger also looks at broader topics--how dependent are researchers on the work ofothers? What makes the time ripe for discovery? And what role does chance or serendipity play? And he includes many fascinating background figures as well, from Leonardo da Vinci and Emanuel Swedenborg to Karl August Weinhold--who claimed to have reanimated a dead cat by filling its skull with silver and zinc--and Mary Shelley, whose Frankenstein was inspired by such experiments.Wide ranging in scope, imbued with an infectious spirit of adventure, here are vivid portraits of giants in the field of neuroscience--remarkable individuals who found new ways to think about the machinery of the mind.",
  "genres": [
    "Science",
    "Neuroscience",
    "Nonfiction",
    "History",
    "Psychology",
    "Medicine"
  ],
  "author": "Stanley Finger",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/521475.Minds_behind_the_Brain"
}