{
  "title": "The Cancer Code: A Revolutionary New Understanding of a Medical Mystery",
  "description": "Our understanding of cancer is slowly undergoing a revolution, allowing for the development of more effective treatments. For the first time ever, the death rate from cancer is showing a steady decline … but the ‘War on Cancer’ has hardly been won. In The Cancer Code, Dr Jason Fung offers a revolutionary new understanding of this invasive, often fatal disease – what it is, how it manifests and why it is so challenging to treat. In this rousing narrative, Dr Fung identifies the medical community’s many missteps in cancer research – in particular, its focus on genetics, or what he terms the ‘seed’ of cancer, at the expense of examining the ‘soil,’ or the conditions under which cancer flourishes. Dr Fung – whose ground-breaking work in the treatment of obesity and diabetes has won him international acclaim – suggests that the primary disease pathway of cancer is caused by the dysregulation of insulin. In fact, obesity and type 2 diabetes significantly increase an individual’s risk of cancer.In this accessible read, Dr Fung provides a new paradigm for dealing with cancer, with recommendations for what we can do to create a hostile soil for this dangerous seed. One such strategy is intermittent fasting, which reduces blood glucose, lowering insulin levels. Another, eliminating intake of insulin-stimulating foods, such as sugar and refined carbohydrates.For hundreds of years, cancer has been portrayed as a foreign invader we’ve been powerless to stop. By reshaping our view of cancer as an internal uprising of our own healthy cells, we can begin to take back control. The seed of cancer may exist in all of us, but the power to change the soil is in our hands.",
  "genres": [
    "Health",
    "Nonfiction",
    "Science",
    "Medicine",
    "Audiobook",
    "Nutrition",
    "Medical"
  ],
  "author": "Jason Fung",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/52163526-the-cancer-code"
}