{
  "title": "WANTED",
  "description": "Are you struggling with your faith in God, feeling lost, and not wanted?From the author of the highly acclaimed The Potter and the Clay, Ellis Lucas reveals the story behind the story in the second installment of his Christian inspirational books—from personal salvation to family reconciliation and spiritual healing. Wanted is an inspirational account of transformation filled with personal and spiritual truths, and the stories of people Lucas has helped to find their salvation in God. Wanted is a beautiful testimony related to a constant flow of Scripture. Like a mighty river filling the hearts of its readers, you will be refreshed and encouraged to step deeper into the river of God’s amazing love and the truth of his Word. Through the eyes of God we are all in need of guidance and salvation.This book invites the reader to come home to Jesus Christ and to enter that secret place of the humbled heart where you can live everyday with Jesus. We can often rush ahead in life without seeking God’s words—motivated only by habitual, selfish plans and desires that hurt those we love most. Lucas provides solid, scriptural reasons to follow in Jesus’ footsteps with true-life stories to inspire the reader to seek out God and make healthy choices. We are all prone to pride and hard-heartedness and Wanted will teach you that nobody is without hope, whether through addiction, emotional abuse, abandonment or disillusionment in life.It will also challenge all Christians to do everything they can to reach out to those who are considered by many to be unreachable, consider how great is your love for those around you, and to know the true depth of God’s grace in your suffering. Lauded as a seminal work in Christian books, readers will come away with a view of the world bigger than themselves. We are all WANTED.“The personal testimony of Ellis Lucas, and the testimonies of others he shares, give living proof that God loves YOU; regardless of where you have been, what you have done, God not only loves you and WANTS YOU, He can take your life and turn it around, and make you a living witness of His Love and His Grace, and His Power to change the life of anyone who comes to Him.” – George W. Westlake, Jr, D. Min.",
  "genres": [
    "Christian",
    "Nonfiction"
  ],
  "author": "Ellis Lucas",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/52184882-wanted"
}