{
  "title": "Ship of Dreams",
  "description": "In this original and meticulously researched narrative history, Gareth Russell utilises the sinking of the Titanic as a prism through which to look at the end of the Edwardian era and the seismic shift of modernity the 1910s have come to mark in the West.Had she survived her first voyage, the Titanic probably would have dated like other ocean liners. Instead, within a week of setting sail on 10th April 1912, the disaster of her sinking had turned her into one of the biggest news stories of the century. Writing in his signature prose, Gareth Russell peers through the portholes of six first-class travellers to immerse us into the Edwardian era while demonstrating how modernity shook up the class system of the age.Lucy Leslie, Countess of Rothes; 'son' of the British Empire Tommy Andrews; captain of the industry John Thayer and his son Jack; Jewish immigrant Ida Straus; and model and movie star Dorothy Gibson. Each subject’s unique story offers insights into the established hierarchy during the fin de siècle of prewar Britain and America, the Titanic’s respective spiritual and economic homelands. Through these entwining lives, Russell investigates social class - its mores, its foibles, its accents, its etiquette, its benefits, its casual or intentional cruelties, its potential nobility. Those nuances also invite analyses of the shipping trade, the birth of the movie industry, the aristocracy, the American Gilded Age, the Irish Home Rule crisis, and Jewish-American communities.The Titanic is the vessel in which we can extrapolate lessons on hubris, folly, greed, love, class, magnificent courage and pitiable weakness. She carried thousands of people, and, in that way, she still has thousands of stories to tell. Drawing on brand-new and unpublished materials, journal entries and film archives from the time, The Darksome Bounds of a Failing World focuses on the symbolism of the Titanic as the floating symbol of Anglo-American success, its clientele an apt illustration of the limitless - technological, financial - possibilities of its time.",
  "genres": [
    "History",
    "Nonfiction",
    "Historical",
    "Audiobook",
    "Biography",
    "Travel",
    "American History"
  ],
  "author": "Gareth Russell",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/52182659-ship-of-dreams"
}