{
  "title": "Called by Darkness",
  "description": "“Love love love!!!! I can't wait to read more from this series!” —Crystal, Amazon Reviewer ★★★★★There’s a darkness inside her, and an evil only she can stop…Skylar’s world is comprised of a few things: Getting out from under her famous mother’s shadow. Making it through the Academy of Magic without getting herself killed. And trying not to murder the devilishly handsome, so-infuriating-she-wants-to-strangle-him Asher, once they’re partnered with each other.So when she discovers a new baddie gathering power in her city, someone with insane magic and a powerful grudge against her family, Skylar knows it’s her chance to step up to stop them. The only problem? She’s got magic of her own. Dark magic. Uncontrollable magic. Magic she has to keep hidden.As maddening as Asher is, she’ll have to work with him if she wants any chance at stopping this new threat. But with her darkness growing more powerful by the day, hiding what she is will likely be impossible. And soon, her biggest enemy just might be herself…------------ ★★★★★ ------------Shifters, vampire, magic, romance, and twists you won’t see coming. Love snarky heroines, slow-burn romance and incredible magic? Jump into this fast-paced YA urban fantasy and a paranormal world unlike any you’ve ever imagined…These are urban fantasies you won’t want to put down!“Intensely captivating! Sean hits this baby out da park with this nerve racking, action packed, heart pounding, pulse racing, page flipping bombshell.” —Kaye, Amazon Reviewer ★★★★★“WOW. This is a fast paced, action packed urban fantasy read that once you start you will be glued to your seat and be unable to move, it’s that good!”—Debbie, Amazon Reviewer ★★★★★“This definitely has to be read…I’m a true fan of this series and I just absolutely adore the characters that have been created.” ~Tassi, Amazon Reviewer ★★★★★",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Young Adult",
    "Vampires",
    "Paranormal",
    "Magic",
    "Romance"
  ],
  "author": "Sean Fletcher",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/52190538-called-by-darkness"
}