{
  "title": "Nameless",
  "description": "THE WULFRITHS. IT ALL BEGAN WITH A WOMAN. A battle. A crown. The conqueror. The conquered. Medieval England—forever changed by the Battle of Hastings. And the rise of the formidable Wulfriths.A NAMELESS NORMANBorn of scandal, Sir Dougray of the family D’Argent defies his illegitimacy by championing the oppressed—until the prospect of winning the hand of a lady persuades him to join the Duke of Normandy in conquering Saxon-ruled England. When an injury sustained at the Battle of Hastings causes the woman he loves to reject him, an embittered Dougray turns his efforts to uprooting Saxons resistant to their new king. But among those he must bring to heel is Em, an escaped slave-turned-rebel whose suffering at the hands of a fellow Norman tempts him to reclaim the man he was before he betrayed his conscience. And captivates him though he vowed never again to fall prey to a woman. Might yet another D’Argent warrior take a Saxon bride? Or will the one who made a possession of Em destroy what remains of her?A FUGITIVE SAXONForced into slavery to ensure her siblings’ survival following the Norman invasion, Em escapes her abusive master and joins the Saxon resistance. Now trained in the ways of the warrior, she is determined to never again suffer the depravity of men. And will not, providing she can stay ahead of the one intent on recovering his property—and the usurping King William’s warrior scout, Sir Dougray, who also seeks to capture her. But when he appoints himself Em’s savior, thwarting an attempt to once more enslave her, she glimpses an honorable man beyond the conqueror and begins to feel that which is forbidden enemies—worse, forbidden one as ruined as she. Or so she believes until his kiss more thrills than frightens. And threatens to break a heart she would not have believed capable of being touched by a Norman.\n\n\nFrom the Saxon victory at York, portending the fateful Harrying of the North, to the walls of Wulfen Castle, Sir Dougray and Em’s tale unfolds in the third book in the AGE OF CONQUEST series revealing the origins of the Wulfriths of the bestselling AGE OF FAITH series. Watch for HEARTLESS: Book Four releasing Spring 2020.",
  "genres": [
    "Medieval",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Historical Romance",
    "Romance"
  ],
  "author": "Tamara Leigh",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/52200140-nameless"
}