{
  "title": "Eight Perfect Murders",
  "description": "A chilling tale of psychological suspense and an homage to the thriller genre tailor-made for fans: the story of a bookseller who finds himself at the center of an FBI investigation because a very clever killer has started using his list of fiction’s most ingenious murders.Years ago, bookseller and mystery aficionado Malcolm Kershaw compiled a list of the genre’s most unsolvable murders, those that are almost impossible to crack—which he titled “Eight Perfect Murders”—chosen from among the best of the best including Agatha Christie’s A. B. C. Murders, Patricia Highsmith’s Strangers on a Train, Ira Levin’s Death Trap, A. A. Milne's Red House Mystery, Anthony Berkeley Cox's Malice Aforethought, James M. Cain's Double Indemnity, John D. Macdonald's The Drowner, and Donna Tartt's A Secret History.But no one is more surprised than Mal, now the owner of the Old Devils Bookstore in Boston, when an FBI agent comes knocking on his door one snowy day in February. She’s looking for information about a series of unsolved murders that look eerily similar to the killings on Mal’s old list. And the FBI agent isn’t the only one interested in this bookseller who spends almost every night at home reading. The killer is out there, watching his every move—a diabolical threat who knows way too much about Mal’s personal history, especially the secrets he’s never told anyone, even his recently deceased wife.To protect himself, Mal begins looking into possible suspects . . . and sees a killer in everyone around him. But Mal doesn’t count on the investigation leaving a trail of death in its wake. Suddenly, a series of shocking twists leaves more victims dead—and the noose around Mal’s neck grows so tight he might never escape.",
  "genres": [
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Fiction",
    "Audiobook",
    "Crime",
    "Suspense"
  ],
  "author": "Peter  Swanson",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/52225186-eight-perfect-murders"
}