{
  "title": "Almond",
  "description": "This story is, in short, about a monster meeting another monster. One of the monsters is me.Yunjae was born with a brain condition called Alexithymia that makes it hard for him to feel emotions like fear or anger. He does not have friends—the two almond-shaped neurons located deep in his brain have seen to that—but his devoted mother and grandmother aren’t fazed by his condition. Their little home above his mother’s used bookstore is decorated with colorful post-it notes that remind him when to smile, when to say \"thank you,\" and when to laugh. Yunjae grows up content, even happy, with his small family in this quiet, peaceful space.Then on Christmas Eve—Yunjae’s sixteenth birthday—everything changes. A shocking act of random violence shatters his world, leaving him alone and on his own. Struggling to cope with his loss, Yunjae retreats into silent isolation, until troubled teenager Gon arrives at his school and begins to bully Yunjae. Against all odds, tormentor and victim learn they have more in common than they realized. Gon is stumped by Yunjae’s impassive calm, while Yunjae thinks if he gets to know the hotheaded Gon, he might learn how to experience true feelings. Drawn by curiosity, the two strike up a surprising friendship. As Yunjae begins to open his life to new people—including a girl at school—something slowly changes inside him. And when Gon suddenly finds his life in danger, it is Yunjae who will step outside of every comfort zone he has created to perhaps become a most unlikely hero. The Emissary meets The Curious Incident of the Dog in the Nighttime in this poignant and triumphant story about how love, friendship, and persistence can change a life forever.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Young Adult",
    "Literary Fiction",
    "Mental Health",
    "Asian Literature",
    "Coming Of Age"
  ],
  "author": "Sohn Won-Pyung",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/52219386-almond"
}