{
  "title": "Red Mars / Green Mars",
  "description": "Two eBooks in One! Red In his most ambitious project to date, award-winning author Kim Stanley Robinson utilizes years of research and cutting-edge science in the first of three novels that will chronicle the colonization of Mars. For eons, sandstorms have swept the barren, desolate landscape of the red planet. For centuries, Mars has beckoned to mankind to come and conquer its hostile climate. Now, in the year 2026, a group of one hundred colonists is about to fulfill that destiny. John Boone, Maya Toitovna, Frank Chalmers, and Arkady Bogdanov lead a mission whose ultimate goal is the terraforming of Mars. For some, Mars will become a passion driving them to daring acts of courage and madness; for others it offers an opportunity to strip the planet of its riches. And for the genetic \"alchemists,\" Mars presents a chance to create a biomedical miracle, a breakthrough that could change all we know about life ... and death. The colonists place giant satellite mirrors in Martian orbit to reflect light to the planet's surface. Black dust sprinkled on the polar caps will capture warmth and melt the ice. And massive tunnels, kilometers in depth, will be drilled into the Martian mantle to create stupendous vents of hot gases. Against this backdrop of epic upheaval, rivalries, loves, and friendships will form and fall to pieces--for there are those who will fight to the death to prevent Mars from ever being changed. Brilliantly imagined, breathtaking in scope and ingenuity, Red Mars is an epic scientific saga, chronicling the next step in human evolution and creating a world in its entirety. Red Mars shows us a future, with both glory and tarnish, that awes with complexity and inspires with vision.Green Nearly a generation has passed since the first pioneers landed, but the transformation of Mars to an Earth-like planet has just begun. In Green Mars the colonists will attempt to turn the red planet into a lush garden for humanity. They will bombard the atmosphere with ice meteorites to add moisture. They will seed the red deserts with genetically engineered plants. Then they will tap the boiling planetary core to warm the planet's frozen surface. But their heroic efforts don't go unchallenged. For their plan to transform Mars is opposed by those determined to preserve the hostile and barren beauty of Mars. Led by rebels like Peter Clayborne, these young people are the first generation of children born on Mars, and they will be joined in their violent struggle by original settlers Maya Toitovna, Simon Frasier, and Sax Russell. Against this cosmic backdrop, passions, rivalries, and friendships will explode in a story as big as the planet itself. A novel of breathtaking scope and imagination, of lyric intensity and social resonance, Kim Stanley Robinson employs years of research and state-of-the-art science to create a prophetic vision of where humanity is headed--and of what life will be like on another world. Nebula Award® Winner, Hugo Award Winner",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Novels",
    "Hugo Awards"
  ],
  "author": "Kim Stanley Robinson",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/5222300-red-mars-green-mars"
}