{
  "title": "The Patient Man",
  "description": "Jackman and Evans’ most dangerous enemy is back to finish things off The domestic bliss of Detective Inspector Rowan Jackman> of Fenland Constabulary doesn’t last long. His nemesis, serial killer Alistair Ashcroft, is back in town and ready to tidy up unfinished business. Ashcroft sends a sinister text to DS Marie Evans. His opening move in what will prove to be a lethal game of cat-and-mouse. Yet for all his taunts, where is he? In a county crawling with police on the lookout for him, Ashcroft is nowhere to be found. Everyone Jackman cares about is in dangerAlongside the hunt for Ashcroft, normal police work must continue. The separate thefts of guns, six pigs, a thoroughbred stallion and some oil lead Jackman’s crew to the notorious Lorimer family, ruled over on their farm by the fearsome matriarch Rachel.Meanwhile, a seemingly routine break-in at the home of gun-club owner Kenneth Harcourt quickly becomes more complicated when the man long held responsible for having killed Harcourt’s young daughter in a hit-and-run is shot dead in a carpark — by a sniper.A killer is on the loose in the quiet streets of Saltern-le-Fen and he isn’t going to stop at claiming one life. But why is he focusing on young Kevin, so close to promotion to detective? A lethal game with a very patient man And the sniper, like Ashcroft, takes to taunting the police: they’ll never catch him, they need to respect him, they shouldn’t be side-tracked looking for their old adversary. In a stunning conclusion, Jackman and Evans race against time to catch the sniper and track down their deadly adversary. Full of twists and turns, this is a crime thriller that will keep you turning the pages until the shocking ending. Set in the atmospheric Lincolnshire Fens whose towns and isolated villages hide many dark secrets. Can they finally stop Alistair Ashcroft?",
  "genres": [
    "Audiobook",
    "Crime",
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Detective"
  ],
  "author": "Joy Ellis",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/52231421-the-patient-man"
}