{
  "title": "Never Gonna Happen",
  "description": "No. Absolutely not. He will not fall in love with his best-friend’s little sister. He is not that guy.So…yeah, okay, Alyssa Kyle is gorgeous and funny, and she’s slipped into more than a few of his fantasies over the years, but Sebastian Ridgeway is not about to cross that particular line. No way. No day.Today is the day.Alyssa’s in trouble. Someone shot at her—actually shot at her—and now she’s getting all kinds of threatening messages. Messages that say she’s about to pay for her brother’s crimes. Only her brother is a computer gaming designer, not some secret agent. The bad guys out there have obviously made a mistake.There is no mistake.Sebastian and Alyssa’s brother, Antony, have been working the spy game for years. They started as hacking teens but graduated to the big leagues—and their gaming company is just their cover. Apparently, their cover has been blown. Now some of the bad guys they’ve taken down want payback—and Alyssa is being targeted. Her brother is out of the country, gone dark on an assignment, and Sebastian can’t just leave Alyssa on her own to face the wolves. Not happening. So…Time to get close.He moves Alyssa into his home. Provides twenty-four seven protection for her. He figures he can keep his secret desire for her in check—he’s done it for years, after all—or at least, that’s the initial plan. Until he finds out that Alyssa has been longing for him. That he’s starred in more than a few of her fantasies, too.All bets are off.He’s held back for years, thinking he was doing the right thing. Thinking he’d never truly deserve a woman like her. But if Alyssa wants him, if Alyssa needs him, nothing will stop him from claiming the woman who owns his heart. Not the bad guys who are closing in, not the government who wants his tech, and not even Alyssa’s big brother.Keep his hands off her? Stay away from Alyssa? Sorry, that’s…NEVER GONNA HAPPEN.Absolutely, one hundred percent…Sebastian will not let her go, and he will prove that he is the guy—the only one—for her.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Mystery",
    "Chick Lit",
    "Suspense"
  ],
  "author": "Cynthia Eden",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/52237870-never-gonna-happen"
}