{
  "title": "Feeling My Existence",
  "description": "This is a collection of 60 poems divided into three chapters. The chapters Of Love, Of Beliefs and Of Existence will move readers with feelings as they play an infinite role in this collection of poems. The poems reveal a very deep insight into the call of humanity for the breeding of the feeling of our existence in life. Are you a lover having very strong feelings of affection towards someone who you are romantically or sexually attracted to, no matter, from a rejected boy, to a foolish man, a poor, a beggar, a sinner, a refugee, a rich man, an owner or to God this book “Feeling My Existence” by “Shawn Akrawi” offers the best resolution of your sorrows and sufferings. This gallant effort, “Feeling MY Existence” by “Shawn Akrawi” comprises of 92 pages including three chapters that are consisting of 60 poems.Chapter 1: Of Love (poems)Chapter 2: Of Beliefs (poems)Chapter 3: Of Existence (poems) As the reader moves along the three parts of the book it reveals a prominent feature that “feelings” play an infinite role in this collection of poems. According to Shawn Akrawi feelings that emerge out of happiness, hunger, pain, rejection or sadness lead to reflection, as a result, reflection strengthens our faiths or beliefs and consequently faith builds up our character that gives green light to our existence.Furthermore, the audience receives an eminent concept that all of the characters come down from the frame of real life. As the poet quotes in the Introduction of the book:“We can sense and gather information from our surroundings but we only learn things through our feelings and that is how we create our existence in our minds.” Here due to the characterization he appears to be like Chaucer in his Canterbury Tales. In this script “Feeling My Existence” Shawn Akrawi a Swedish with Assyrian roots, who seems to be the embodiment of his name; being under the influence of both of the Lebanese American poets and philosophers Gibran Khalil Gibran and Elia Abu Madi displays an appreciable sympathy and empathy on each end every execution of this piece of art. Moreover he reveals a very deep insight of the call of humanity for the breeding of the feeling of our existence in life. In this fashion, the flight of poet’s imagination makes off so recklessly that he takes no time to feel being in the state of self to selflessness and from selfless to back in his self and furthermore mortality to immortality. Therefore, it comes forth as a proof of his strong hold on his feelings and existence. While on the other hand social issues are not left over to be discussed here. Henceforth the three parts of this book manifest the three phases of the poetic maturity that is quite inevitable. The use of language in this script is quite simple, easy and common even when the poetic device of free verse is brought forth into practice it sounds like T.S Eliot. Here, to close my words I, Emilia Johnson, while enjoying my experience as a chief editor of a local journal (AESTHETICS) being published annually; personally feel as if there is no match of these lyrics in their lucidity and they are the recording of a heart that can never be borne by angels or no one else other than a true human being. Accordingly, I like the poems: In your eyes, My Angel, Secret Love and Stay.",
  "genres": [],
  "author": "Shawn Akrawi",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/52234693-feeling-my-existence"
}