{
  "title": "The Foley Artist: Stories",
  "description": "\"A collection like a circus of daredevils. . . . A bravura debut.\" —Alexander Chee, author of How to Write an Autobiographical NovelA compelling debut for fans of the Filipino America brought to life in fiction by Elaine Castillo and Mia Alvar.At once deliciously bizarre and painfully familiar, The Foley Artist introduces a vital new voice to Asian American literature. Ricco Villanueva Siasoco's powerful debut collection opens new regions of American feeling and thought as it interrogates intimacy, foreignness, and silence in an absurd world.These nine stories give voice to the intersectional identities of women and men in the Filipino diaspora in America: a straight woman attends her ex-boyfriend's same-sex marriage in coastal Maine; a college-bound teenager encounters his deaf uncle in Manila; Asian American drag queens duke it out in the annual Iowa State Fair; a seventy-nine-year-old foley artist recreates the sounds of life, but is finally unable to save himself.\"A collection like a circus of daredevils, but with the determined charm of a Chinese drag queen making her home in Iowa. Siasoco takes us on a trip through the world we know by way of characters I've not seen in fiction before, or at least, not enough of--characters with stories I have been waiting for. A bravura debut.\" —Alexander Chee, author of How to Write an Autobiographical Novel\"The Foley Artist is Ricco Villanueva Siasoco's book of wonders--filled with compelling and unpredictable stories that alternate between dark and light. It marks the exciting debut of a bold and brilliant new writer. A kickass read!\" —Jessica Hagedorn, author of Dogeaters and Toxicology\"Clever, vivid, and poignant, The Foley Artist is a treasure. Ricco Villanueva Siasoco nimbly guides us from drag shows in Des Moines to wrestling rings in greater Boston, from wet markets in Manila to porn shops in West Hollywood, in prose that sings with tenderness, humor, and insight. Here are Filipino-American lives and queer lives in all their glorious complexity, and here is a debut author in full command of his wide-ranging imagination.\" —Mia Alvar, award-winning author of In the Country\"These captivating and interconnected stories about fusion and friction--familial, cultural, racial, and sexual--read like quiet punches in the gut. A poignant and, at times, heart-stabbing, collection that offers stunning twists to the familiar.\" —R. Zamora Linmark, author of The Importance of Being Wilde at Heart and Leche\"Siasoco writes the kind of emotionally complex observation that makes you say, ah, this is life . . . Each of the stories in The Foley Artist is funny, affectionate, tough, brainy, and subversive, and each one lingers a long, long time. I couldn't put it down and I already want to go back.\" —Paul Lisicky, author of Later and The Narrow Door\"Siasoco performs more than a little magic in the pages of The Foley Artist. Nine stories, seemingly straightforward. But there are worlds within worlds here. Ricco is suave with his sentences, nimble in his ability to move from humor to pathos. More than anything, he can explore the universal unknown that is the human heart. It was a joy to read and learn from The Foley Artist.\" —Charles Bock, bestselling author of Alice & Oliver\"Siasoco takes us to Des Moines, Boston, Manila, Los Angeles, and all the other places where Filipinos are, and centers our stories with beautiful, powerful, and complicated characters at their most intimate, life-shifting moments. Siasoco's writing constantly pushes towards the truth of a moment, even when we want to look away. His writing is compassionate, generous, funny, and exuberant. The Foley Artist is Siasoco's debut, but this is the book of a writer who has taken their time to publish extraordinary, brave stories exploring our human experience.\" —Grace Talusan, author of The Body Papers",
  "genres": [
    "Short Stories",
    "Fiction",
    "LGBT"
  ],
  "author": "Ricco Villanueva Siasoco",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/52228417-the-foley-artist"
}