{
  "title": "Think Outside the Box",
  "description": "~ #1 International Bestseller ~\"Here’s to raising creative, passionate, problem-solving humans that are ready to take on the world.\" —The Children's Book Review( ¡Ahora en ediciones en español y bilingüe! — Piensa fuera de la caja )For the artist, the free thinker, the uniquely inventive individual in each of us, Think Outside the Box unlocks the key to applying creativity to daily life and turning any problem or worry inside out.Designed to define out-of-the-box thinking for the youngest of us, this fun and unique illustrative journey reminds us all how simple and practical it can be to apply a new perspective to even the most daunting challenges.Think Outside the Box is an at-home library must-have for any future idealist, instigator, activist, maverick, or mover and shaker—and every individual .************************************************************Goodreads Choice Awards Semi-Finalist for Best Picture BookThe US Review of Books RECOMMENDED Silver Seal recipientStory Monsters Ink, Purple Dragonfly Awards First Place recipient for Educational Children's BooksThe Incipere Awards First Place recipient for books for Young ChildrenNational Parenting Product Award recipient************************************************************\"Creates passionate children and excellent problem solvers. ... A winner with its unique illustrations and motivating spirit.\" (Entrada Publishing)\"Ingenious, clever, and very creative ... A personal journey of self-discovery and looking deep into our inner creative forces\" (Readers' Favorite)\"Timely and on target ... Supports the work of teachers and parents ... Bold advice and encouraging reminders ... Children will be motivated and moved ... RECOMMENDED.\" (The US Review of Books)",
  "genres": [
    "Picture Books",
    "Childrens",
    "Nonfiction",
    "Art"
  ],
  "author": "Justine Avery",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/52273976-think-outside-the-box"
}