{
  "title": "Mindf*ck: Cambridge Analytica and the Plot to Break America",
  "description": "For the first time, the Cambridge Analytica whistleblower tells the inside story of the data mining and psychological manipulation behind the election of Donald Trump and the Brexit referendum, connecting Facebook, WikiLeaks, Russian intelligence, and international hackers.Mindf*ck goes deep inside Cambridge Analytica's \"American operations,\" which were driven by Steve Bannon's vision to remake America and fueled by mysterious billionaire Robert Mercer's money, as it weaponized and wielded the massive store of data it had harvested on individuals in--excess of 87 million--to disunite the United States and set Americans against each other through psychological manipulation. Bannon had long sensed that deep within America's soul lurked an explosive tension. Cambridge Analytica had the data to prove it, and in 2016 Bannon had a presidential campaign to use as his proving ground.Christopher Wylie might have seemed an unlikely figure to be at the center of such an operation. Canadian and liberal in his politics, he was only twenty-four when he got a job with a London firm that worked with the U.K. Ministry of Defense and was charged putatively with helping to build a team of data scientists to create new tools to identify and combat radical extremism online. In short order, those same military tools were turned to political purposes, and Cambridge Analytica was born. Wylie's decision to become a whistleblower prompted the largest data crime investigation in history. His story is both exposé and dire warning about a sudden problem born of very new and powerful capabilities. It has not only exposed the profound vulnerabilities and profound carelessness in the enormous companies that drive the attention economy, it has also exposed the profound vulnerabilities of democracy itself. What happened in 2016 was just a trial run. Ruthless actors are coming for your data, and they want to control what you think.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Technology",
    "History",
    "Psychology",
    "Business",
    "Science"
  ],
  "author": "Christopher Wylie",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/52269471-mindf-ck"
}