{
  "title": "Leave Me Breathless: The Lilac Collection",
  "description": "When the daylight fades and time stands still.The feeling of flying from just one touch.Moving slowly, kissing softly.The flash of fever, becoming lost in the flames.Surrendering.Going under.These are the moments that leave us breathless.Introducing a brand-new collection of romance books by independently published and USA Today bestselling authors whose words will leave you breathless!THE LILAC COLLECTIONThe Lilac symbolizes the first emotion in love. This collection will feature already published, first in series books. It's perfect for those looking to try out new authors for the first time!INCLUDED IN THIS COLLECTION:Royal Atlas by HJ Bellus, USA Today Bestselling AuthorI hid my love for years. But now he's back. Guy Webb returned a broken soldier after serving his country all over the atlas. And now it's my job to help him heal.Heart of Stone by Dakota Willink, Amazon Top 100 Bestselling AuthorHe's a New York City real estate tycoon. Driven. Determined. Dominant. And he has a secret. I pulled, he pushed. Our game of tug-of-war didn’t last long before I quickly learned that Pandora's Box was better left unopened. Emotional surrender was my hard limit and he gave more than I bargained for. Dirty Lies by Tamara Lush, RITA FinalistLuca Rossi lost everything when he wrote a bestselling expose on the Mafia. Now he's hiding out in Florida, plotting his next move. But when a curvy and inquisitive journalist stumbles into his backyard looking for a scoop, his long-buried desires are awakened. Skylar Shaw doesn't have time for men. She's too busy making a name for herself at a small paper so she can jump to a better job. When she meets Luca she's convinced she can can keep things casual, but she soon discovers that dark forces want both of them dead…Love Hurts by Samantha MorganFor Luka, life had become one thing; waiting. For a cure, for a miracle, for the end. With one look at the gorgeous Melia, he allowed himself the one thing he’d never allowed himself to feel, not since that final diagnosis. Hope. Could this crazy plan really work though? Would Melia be able give Luka this one last wish, something more profound, more precious than he ever deserved?Her Last Love by H.C. BentleyLynn Johnston returns to her small Kentucky hometown with a secret to keep and a desire to find peace. She hopes she can forge a new path, one that would heal her heart and help to put her past behind her. Those hopes are dashed when she discovers Carter Mathis, her former fiancé, has also returned. Does she confront her feelings and move forward, or leave behind the life she's always wanted?31 Kisses by Sonya Jesus, Amazon BestsellerShe's not the little princess her dad raised anymore. She's the assassin the Beneventis created. The ruthless mob boss adopted Kelsie when her heart was breaking and promised her vengeance for her father's murder. With every life she takes, there’s a little less of her left… the only thing keeping her from losing her soul is #31 on the Beneventi hit list.Malt Me by DL GallieI'm given a second chance at happiness...there's no way I'll let him take that from me. I am Mackenzie Merlot. I am strong. I am a survivor. And this time...he'll lose.One Chance by KL Donn, International Bestselling AuthorOne word that could ruin a person. One word that can change a life. One word that can destroy a mind.One Wild Weekend with Connor by Lexi HartConnor Slade wasn't supposed to turn her world upside down and make her wish he'd stay. He was meant to be one reckless, impulsive weekend fling that no one would ever find out about. But if she’s ever going to see Connor outside of a jail cell, Evelyn will have to decide if proving his innocence is worth destroying her squeaky-clean reputation.Just Say Yes by Samantha LindWhat will it take for her to Just Say Yes?Until the Stars Fade by Kim LoraineI've never believed in love at first sight. Insta-lust? Definitely. But it's impossible to fall in love in a day. So when I meet a sexy as hell Frenchman at a music festival the summer before my senior year of college, I'm determined to keep him from stealing my heart. I didn't plan on Luc. He's got the stars on his side and won't let me go without a fight.Black Horse by A.C. Williams, Amazon Top 100 Bestselling AuthorWhat would you do if the only man you ever loved was the son of the man that turned your world upside down? Averi Ford and Colt McClain are star-crossed lovers with a twisted past. Twenty years after Colt's father went to prison for murdering Averi's parents, Black Horse is being released back into the free world, and coming for the girl that testified against him: Averi Ford, herself. Colt McClain will stop at nothing to protect his long time love from the wrath of his father, even if he has to spill his own father's blood in her defense.",
  "genres": [],
  "author": "Kim Loraine",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/52252773-leave-me-breathless"
}