{
  "title": "Cocky Captain",
  "description": "Based upon the New York Times Bestselling series by Vi Keeland and Penelope Ward, Cocky Captain is a sexy new standalone novel in the Cocky Hero World.Ex-fighter pilot, Logan Reid, is exactly the kind of man I despise. He’s a cocky jet jock, a former Navy Blue Angel, and full of all the arrogance that comes with being the best of the best. I’m an ex-Zoomie, a female Air Force tanker pilot. The rivalry between our sister services is nothing compared to that between fighter jocks and tanker pilots. We’re bitter rivals and I’m low-man (woman) on the totem poleThe last thing I need is to spend six hours at thirty-five thousand feet locked in a cockpit with the cocky captain. But I have no choice. I’m his co-pilot, and we’re taking the CEO of Montague Enterprises, and his family, on a mini-vacation to the Grand Caymans.We have three days on the ground before we fly back.Three long days in paradise and he wants to spend them with me.I have a thing for fighter pilots.It isn’t animosity, exactly, but rather a deep-seated dislike. They get all the glory while the rest of us sit at the butt end of their jokes and wither beneath their ridicule.I hate fighter pilots. There, I said it. I hate the arrogant pricks with a passion.But after one look into those magnetic eyes, and the devastating wink which follows, I’m thinking of throwing caution to the wind. What harm can come from some innocent flirting? I’m not prepared for the air to sizzle when he’s close.I’m not ready for our explosive chemistry when he touches my skin.I’m not equipped for the fallout when our three days come to an end.Nothing can prepare me when I have to walk away.And I’m not ready for what comes next.He’s arrogant. He’s cocky. He’s determined to get what he wants.And he refuses to let this end.He’s fighting for a forever…with me.But, what if I’m not ready for our beginning?He's arrogant enough to prove me wrong.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Enemies To Lovers",
    "Forced Proximity",
    "Military Romance"
  ],
  "author": "Ellie Masters",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/52256743-cocky-captain"
}