{
  "title": "Leave Me Breathless: The Ivy Collection",
  "description": "When the daylight fades and time stands still.The feeling of flying from just one touch.Moving slowly, kissing softly.The flash of fever, becoming lost in the flames.Surrendering.Going under.These are the moments that leave us breathless.The Ivy CollectionThe Ivy symbolizes dependence, endurance, and faithfulness. This collection will feature brand new stand-alone books from KL Donn, Evan Grace, Ashley Lane, C.M. Lally, Michelle Windsor, Sophia Henry, K.L. Humphreys, and Natalie Hill.THIS COLLECTION INCLUDES:Command by KL Donn, International Bestselling Author (Mafia Romance)A picture says a thousand words. Hers gives me a lifetime of peace. I am Viktor Vashchenko.Faceoff by Sophia Henry (Sports Romance)I was rocking the single dad thing, until my mom's sudden move to take care of my grandfather. When the most beautiful—and outspoken—woman at my daughter's daycare volunteers to be our live-in nanny, I want to say no, but I leave for training camp in two days, so I don’t have a choice. I knew our personalities would clash, but I didn’t expect a full-blown face-off.Anti-Venom: Vipers MC by Ashley Lane (MC Romance)Alone we're dangerous. Together we'll be deadly. They should know better than to mess with a viper in a bed of poison ivy, but it's a lesson some still need to learn.Saint's Angel by K.L. Humphreys & Natalie Hill (MC Romance)They call me Saint; I'm anything but. When a 5'4 angel crashes into my life, everything changes. Can she be the one to save me?Legend by C.M. Lally (Sports Romance)I have it all. Fame. Money. Respect. All a man could want from a pair of golden feet on the soccer field. But one moment can make or break you. For me, that moment has arrived. I. An. Legend.Catching Chase by Michelle Windsor (Sports Romance)Jasper Chase is in town for a weekend playoff game. Megan Lewis is in town for the week on business. Two strangers in the right place at the right time. After three passion-filled nights, they go their separate ways. No regrets, no fake promises, and no looking back. Until fate intervenes, reuniting them four years later. Except, she’s not very happy to see him. And he’s just figured out why. It’s clinging to her leg and has eyes just like his. So much for no regrets... The Change Up by Evan Grace (Sports Romance)Two years ago I slept with my best friend after being drafted to the Chicago Hawks MLB team. I left her without saying goodbye and I've regretted it ever since. I've drowned out thoughts of her in random women ever since, but nothing helps me forget. A chance encounter brings us back together, but there's something she's never told me...we have a son. Now I'll fight to keep him and to keep her--that's if she can forgive me for leaving and if I can forgive her for keeping my boy from me.",
  "genres": [
    "Anthologies"
  ],
  "author": "Ashley Lane",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/52252833-leave-me-breathless"
}