{
  "title": "Darkmore Penitentiary",
  "description": "“We're going to own you.”“We're going to break you.”“When we're through with you, you won’t remember life before you were ours.”That’s what they whisper as I pass their cells. Ha. Guess what bastardos? I’m Rosalie Oscura, champion underground cage-fighter and freaking Alpha Werewolf from the infamous Oscura Clan. My family wrote the book on criminal organisations and I’ll be ruling this place by the time the next moon rises. Papà always said my hot head would land me in here one day. The supernatural prison they call Darkmore Penitentiary. Where they send the cruellest, most dangerous Fae in Solaria. Like me apparently. I’ve always had a thing for Alpha males, but the ones in here don’t have a thing for me. Especially after what I did to them…I accidentally insulted a ruthless Lion Shifter and riled up his army of cutthroat followers.I may have enraged the sinful Incubus who’s been condemned to isolation for committing an unspeakable crime.Despite my better judgement, I taunted the sinister Vampire guard who has a dark vendetta against me.And I kinda deceived the black-hearted Werewolf who rules over my sworn enemies. Though I blame fate for that one – bitch never was on my side. I don’t know why I’m surprised, I always did have a knack for getting into trouble. Just look at my criminal record:Driving Under the Influence of the Moon (I’m a Werewolf, I’m always under the influence of the moon, duh)One count of MIPS - Minor in Possession of Stardust (I’m just glad they never figured out why I was using it)Bedazzlement (I can’t help it if I dazzle people into giving me their money)Alpha Wolf Status Abuse (It’s calling being a leader, idiotas)Hijacking a Pegasus and riding him through a rainbow on private property (Totally his idea)Coercing two members of law enforcement to dance naked on the top of their vehicle for seven hours (What’s not hilarious about that?)Bank Robbery (All that gold was getting lonely stuck in that vault)Murdering a security guard (Alright I regret that one, but it was a total accident)So maybe I deserve to be in prison, but do you want to know a secret?I planned to get sent to Darkmore Penitentiary.I’ve come to break out the most notorious criminal in Solaria. The trouble is, I need the help of the four Alpha males to get out of here. And they happen to hate each other almost as much as they hate me.But I always did love a challenge.How hard could it be to make them accept me as their leader?This is an RH set in the world of Solaria after the events of Zodiac Academy and Dark Fae and contains some character crossover but can be read as a standalone series without having read the other books.",
  "genres": [
    "Fantasy",
    "Reverse Harem",
    "Paranormal",
    "Romance",
    "Fae",
    "Enemies To Lovers",
    "Romantasy"
  ],
  "author": "Caroline Peckham",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/52271882-darkmore-penitentiary"
}