{
  "title": "定海浮生录 [Dinghai Fusheng Lu]",
  "description": "仙术、法宝、神通，以及天地间浩浩瀚瀚的灵气，一夜之间消踪匿迹，众多驱魔师尽成凡人。三百年后，五胡入关，拉开了华夏大地一场大动荡的序幕，亦随之带来了千魃夜行，神州覆灭的末日。幸而在这万法归寂的长夜里，尚有一枚星辰，在地平线上熠熠生辉。心灯现世，光耀四野，一名年方十六，并将在二十岁那天结束自己生命的少年，踏上了找回被封印的天地灵气的道路——只剩四年时间前路荆棘重重，看上去不太像能成功的样子。陈星：“关键现在全天底下就只有我一个驱魔师，唯一能用的法术就是发光，我能怎么办？”耐心等候吧，待定海珠再现人间之际，众生浮沉的命运轨迹，将被彻底打乱重新交汇。陈星：“给我配个正常点的护法武神行吗？”你的护法不是很能打吗？陈星：“能打是能打，可他疯起来连我都打……”这没办法，怪就怪你自己色令智昏吧。\"Dinghai Fusheng Records\"Immortal arts, magic weapons, magical powers*, and the boundless spiritual Qi between heaven and earth vanished into obscurity overnight, and all the exorcists became mere mortals.300 years later, the Five Barbarians traversed the pass, a prelude to an era of great turmoil in China. They heralded the end of the world, where thousands of drought fiends stalked the night and the collapse of the Divine Land** was imminent.Fortunately, within this long, dark night*** where silence had fallen on all magic, a lone star still glistened brightly on the horizon.The Heart Lamp appeared, illuminating the vast expanse around it. A 16-year-old young man, who will end his life on his 20th birthday, embarked on a journey of reclaiming the spiritual Qi of the heavens and earth that had been sealed away — only four years remain.The road ahead was filled with countless thistles and thorns, and it seemed improbable for him to succeed.Chen Xing, “The important thing is that I’m the last exorcist in this world, yet the only magic I am capable of is emitting light. What can I do?”Wait patiently then. When the Dinghai pearl reappears on earth, the uncertain trajectory of everyone’s fates will be completely disrupted before converging once more.Chen Xing, “Could I be partnered with a more normal Protector martial god?”Isn’t your Protector really skilled in fighting?Chen Xing, “He is good at fighting, but when he loses it he’ll hit even me……”There’s nothing that can be done about that, you can only blame yourself for losing yourself to lust.—*: Buddhist term: Abhijñā, a mysterious force that surpasses the limits of mortals gained through meditation**: old name for China***: figurative meaning: long period of misery and oppression(English translation from novelupdates.com)",
  "genres": [
    "Fantasy",
    "Romance",
    "Historical",
    "LGBT",
    "Historical Fiction",
    "M M Romance",
    "Fiction"
  ],
  "author": "Arise Zhang",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/52289185-dinghai-fusheng-lu"
}