{
  "title": "Alice: Alice Roosevelt Longworth, from White House Princess to Washington Power Broker",
  "description": "At the dawn of the twentieth century and the age of media celebrity, a new figure in the White House gave Americans a larger-than-life idol to root for, full of color and character. It wasn't the rough-riding new president, Teddy Roosevelt, but his outrageous and outrageously charming teenage daughter, Alice. From the moment she strode into town- carrying a snake and dangling a cigarette- to the image of her seven decades later, entertaining Republican and Democrat presidents in Washington's most celebrated salon, Alice Roosevelt Longworth was literally a legend in her own time. This new biography-the first in twenty years- is a richly entertaining portrait of America's most memorable first daughter. Alice in fact strode across the whole twentieth century, living her entire life on the political stage and in the public eye, earning the nickname \"the other Washington monument.\" She grew up knowing Civil war veterans, lived through two world wars, helped put the roar in the Roaring Twenties, and campaigned against her cousin Franklin's New Deal. Smoking, gambling, and dressing flamboyantly, she flouted social connections and opened the door for other women to do the same. Her barbed tongue was infamous, but whenever she talked, powerful people listened, as she was one of the most astute political minds of her age. She advised her father; her husband, Nicholas Longworth, who was the Speaker of the House, and her lover William Borah, the chair of the Senate Foreign Relations Committee and the most powerful man in Washington. Using love letters and other documents disclosed for the first time, Stacy Cordery provides scandalous proof of the real father of Alice's child as well as evidence of her other previously unknown love affairsAlice Roosevelt Longworth was for eight decades the social doyenne in a town where socializing was state business. Politicians, diplomats, journalists, and the famous and infamous of every stripe clamored to be invited to her teas. Meetings in her drawing room helped to change the course of history, from undermining the Leagues of Nations to boosting Richards Nixon's fortunes.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Biography Memoir",
    "Politics",
    "American History",
    "Book Club"
  ],
  "author": "Stacy A. Cordery",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/522943.Alice"
}