{
  "title": "Destination Dark Zone: Six Twisted Tales",
  "description": "Don't travel here if you're afraid of the dark!\n\nSix twisted tales of suspense\n\n⭐⭐⭐⭐⭐ \nThese tales will blow your mind!!\n Welcome to Destination Dark Zone! Take your ticket and dive into this exciting collection of short fiction and novellas. Enjoy six twisted tales that will both delight and surprise as they travel into the dark realms of supernatural, paranormal suspense and science fiction.  Follow an odd, quirky fellow in \nLucky This Time\n, a man who is slave to his routine until one day he tries something new, spinning his world right out of control. Journey on the luxurious New Dawn cruise liner in the poignant \nBeyont\n, where an uninvited guest means no one is disembarking anytime soon. Or ride along in \n291\n in a rookie cop’s haunted cruiser that’s driving him half-crazy. Take a trip into the alternate world of \nSalvation\n, where Charles Darwin’s Origin of Species has never been published, so now the Church rules the world, and God is not all-forgiving. In \nSoul Survivor\n, walk in the shoes of a parent the day after fire destroys his children’s school, as he follows a man who cannot be there and learns a secret that cannot be true.  And in the prequel to Susan May’s most beloved book \nThe Troubles Keeper\n, meet a seven-year-old Rory Fine and his mama as they board an evening commuter train that will never reach its final destination. \nDrift\n is a 150-plus-page wild ride that will keep you on the edge of your seat.  From Susan May, the international bestselling author, who has spent the last decade keeping readers up way past their bedtime and too scared to look under the bed, comes a volume of six suspenseful tales that will take you to dark and fascinating places you’ll not soon forget.   WHAT READERS ARE SAYING  ⭐⭐⭐⭐⭐ “Wish there were a dozen more stories!  I adore the writing and turn of phrase, not to mention all the twists.” Susie Woodbury (Amazon Reviewer), ⭐⭐⭐⭐⭐ “Destination Dark Zone is a marvelous collection of macabre short stories and one novella… I loved my front row seat” Ami Agner (GoodReads Reviewer) ⭐⭐⭐⭐⭐ “Trust me, this collection deserves the five-star rating and your attention. You'll be glad you read it.” Bill Schmidt (Amazon Reviewer)",
  "genres": [
    "Horror",
    "Anthologies"
  ],
  "author": "Susan May",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/52283472-destination-dark-zone"
}