{
  "title": "The Nightland Express",
  "description": "In antebellum America, two teens bury their secrets and join the historic Pony Express, and soon discover the mortal world is not the only one on the brink of war. Young, poor, and orphaned in rural Missouri, Jessamine Murphy frets over her very pregnant sister, not at all sure how to feed their family until the baby is born, let alone after. When Jessamine comes across a recruitment poster reading \"Pony Express Special Assignment: St. Joseph, Missouri to California. Two riders wanted. Orphans preferred,\" her tomboy heart skips a beat: not only for the ample risk wage, but for the adventure and the chance to track down their wayward father in California. Jessamine cuts her hair, dons a pair of pants, and steps into the world as Jesse. At the Pony Express station, Jesse meets Ben Foley, a quiet but determined boy, so secretive about his origin story there is little doubt it must be turbulent, and they become partners. They are an odd pair—one excitedly navigating the world as a boy for the first time, the other a mixed-race young man trying to defend his freedom—yet their esteem for each other grows as they head west across the United States. As they encounter mysterious portals that carry them miles in an eyeblink and unusual creatures with uncanny glowing eyes, it becomes clear that this is no normal mission. A second, magical realm exists just below the surface of the mortal one, intertwined since the beginning of time—but the divisive violence of colonization and war are tearing the two worlds apart. As Ben and Jesse struggle to find themselves, they discover their unlikely alliance may be the only thing that will save them . . . and the creatures and environment of two struggling worlds.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Historical Fiction",
    "LGBT",
    "Fiction",
    "Queer",
    "Historical"
  ],
  "author": "J.M.   Lee",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/52276616-the-nightland-express"
}