{
  "title": "The First Actress",
  "description": "The tumultuous life of the legendary French star Sarah Bernhardt--the world's first modern actress and international celebrity--dazzles in this stunning novel for readers of Love and Ruin and Mistress of the Ritz.From her beginnings as the daughter of a high-class courtesan to her extraordinary transformation into the most celebrated actress of her era, Sarah Bernhardt is brought to life by an internationally bestselling author praised for his historical novels featuring famous women.Her highly dramatic professional life begins when Sarah's mother pulls her out of convent school to set Sarah up in her own trade as a sexual companion to a rich elderly gentleman. Despite her desire to pursue a career in stage acting, her mother cuts her off and Sarah has no choice but to comply. Pregnant and unmarried at sixteen, she is expected to give up her baby to the nuns, but she refuses to let him go.A natural talent and darkly beautiful, Sarah gets a few theatrical roles, thanks to her bold, innovative acting style that attracts both admiration and scorn. Audiences want to see this controversial young actress, and amazingly, she is hired by the famed Comédie Française--only to have her life torn asunder in the savagery of the 1870 Siege of Paris. Amidst the ruins of the city, Sarah nurses wounded soldiers while falling passionately in love with her leading man.Rising to the height of her fame as the toast of Paris, shocking audiences with her uninhibited acting style and portrayal of male characters, Sarah becomes world famous, touring America and Europe to sold-out crowds. Told in her own voice, this is Sarah Bernhardt's incandescent story--a fascinating, intimate account of a woman whose wholly original talent and indomitable spirit has enshrined her in history as the Divine Sarah.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "France",
    "Audiobook",
    "Adult",
    "19th Century"
  ],
  "author": "C.W. Gortner",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/52301693-the-first-actress"
}