{
  "title": "Hunter: Desert Hunter / Alien Hunter / Galactic Gladiator Christmas",
  "description": "From the dangerous desert sands to the deadly glitz of the city, the lawless desert planet of Carthago is filled with lethal hunters risking it all for the women who capture their hearts. HUNTER contains two novellas and one short story all set in the Galactic Gladiators series.Desert Hunter: Desert Hunter Bren will do whatever it takes to protect the smart, beautiful Mersi from his darkest secrets.NOTE: previously released as part of the 2018 Pets in Space AnthologyBorn, raised, and sold into servitude on the desert world of Carthago, Mersi Kassar has finally found her freedom and her place on the Corsair Caravan, leading travelers from the gladiator city of Kor Magna through the desert. She also works side by side with her friend—the big, silent Bren—a man she’s desperately in love with. But stubborn Bren shuts down her every attempt to deepen the feelings they have for each other and Mersi isn’t sure she can take the pain anymore.Desert hunter Bren Hahn hides a terrifying darkness within, and will protect the few people he cares about. That includes Mersi—a woman who sparks a simmering passion he finds harder and harder to ignore. On a perilous journey in the heart of the desert, Mersi and Bren rescue a strange alien creature. Working together to heal the big, shaggy canine, their smoldering desire ignites, but their feelings turn out to be the least of their concerns. A deadly enemy is hunting their new pet. An enemy that threatens Bren’s darkest secret and all they hold dear.Alien Hunter: head of security Tannon Gi lets no one get close, until a feisty cocktail waitress explodes into his orderly life.NOTE: this is a brand-new, never-before-published storyMina Lan’Gar left the desert for a new life in the glitzy heart of Kor Magna known as the District. As a brand-new cocktail waitress at the hottest casino, the Dark Nebula, she’s just trying to get ahead, but all she seems to do is lock horns with the casino’s taciturn head of security, Tannon Gi. The man’s hard body, neat suits, and serious face make her want to mess him up a bit. When she overhears people conspiring to strike a private gladiator party the casino is hosting, she knows she needs to help Tannon stop the attack.Once a deadly alien hunter assassin, Tannon finally left the life that was destroying him one kill at a time, and made a life for himself at the Dark Nebula Casino. Nothing and no one causes trouble on his watch, and that includes the mysterious woman from the desert who stirs feelings in him that he’s never felt before. When he and Mina find themselves swept up in a fierce passion and a deadly plot, they will soon learn that nothing is quite what it seems…Includes the short story: A Galactic Gladiators ChristmasNOTE: this is a free read on my websiteMistletoe, Santa Claus, and eggnog. Cyborg Imperator Magnus Rone finds himself in the middle of party filled with rescued humans from Earth, gladiators, cyborgs, and children, trying to understand the strange traditions of Christmas.",
  "genres": [
    "Romance",
    "Science Fiction",
    "Aliens",
    "Fantasy",
    "Science Fiction Romance",
    "Novella",
    "Short Stories"
  ],
  "author": "Anna Hackett",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/52299893-hunter"
}