{
  "title": "Southbound",
  "description": "Rarely will you find books that explore the human emotions of a long-distance trek so honestly and clearly. --Roger Williamson, Campmor, Inc. \"Highly recommended.\" --trailsbib.blogspot.com From the \"We stood for a moment before the venerable signpost marking the summit. Scored with graffiti and the constant onslaught of weather, it stands perhaps three feet high, a wooden A-frame painted Forest Service brown with recessed white KATAHDIN 5268 ft.Northern Terminus of the Appalachian TrailBelow this were a few Thoreau Spring, 1.0, Katahdin Stream Campground, 5.2. At the bottom of the Springer Mountain, Georgia, 2160.2. More than two thousand miles. It was simply a number, too large and incomprehensible to have any bearing on me. The farthest I had ever walked in a day was ten miles and that was with a daypack. Now I was contemplating a journey of months, covering thousands of miles. All of a sudden, there on the summit with the clouds screaming past us, it didn't seem like such a great idea.I turned to my sister, half-expecting to see the same doubt mirrored in her face. But her eyes were shining, and she smiled with an almost feral intensity. It was a look I would come to know all too well over the next year and a half, and it meant, I am going to do this and no one had better try to stop me. 'We're really doing this,' she shouted over the wind's howl and the lashing rain. 'We're hiking the Appalachian Trail!'\" At the ages of twenty-five and twenty-one, Lucy and Susan Letcher set out to accomplish what thousands of people attempt each thru-hike the entire 2,175 miles of the Appalachian Trail. The difference between them and the others? They decided to hike the trail barefoot. Quickly earning themselves the moniker of the Barefoot Sisters, the two begin their journey at Mount Katahdin and spend eight months making their way to Springer Mountain in Georgia. As they hike, they write about their adventures through the 100-mile Wilderness, the rocky terrain of Pennsylvania, and snowfall in the Great Smoky Mountains--a story filled with humor and determination. It's as close as one can get to hiking the Appalachian Trail without strapping on a pack.Listen to the Barefoot Sisters read excerpts from their book and",
  "genres": [
    "Nonfiction",
    "Travel",
    "Memoir",
    "Adventure",
    "Outdoors",
    "Biography",
    "Nature"
  ],
  "author": "Lucy Letcher",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/5231258-southbound"
}