{
  "title": "Mickey Mouse, Vol. 1: Race to Death Valley",
  "description": "Today everyone knows Mickey Mouse as the cheerful ambassador ofall things Disney. But back in the 1930s, Mickey gained fame as a rough-and-tumble, two-fisted epic hero — an adventurousscrapper matching wits with mobsters, kidnappers, spies, and even (gulp!) city slickers! And Mickey’s greatestfeats of derring-do took place in his daily comic strip, written and drawn by one of the greatest cartoonists of the 20thcentury — Floyd Gottfredson.For its first quarter-century, Gottfredson’s Mickey Mouse was a rip-roaring serial: the most popular cartoon-basedcomic of its time, a trendsetting adventure continuity aimed at both kids and grown-ups, and the foundation on whichall later Disney comics grew — including the adventures of Donald Duck and Uncle Scrooge by Gottfredson’s Disneycolleague Carl Barks.Glimpses of Floyd Gottfredson’s masterpiece have been reprinted over the years, most famously in Bill Blackbeard’sclassic Smithsonian Collection of Newspaper Comics. But the whole strip has never been comprehensively collected inEnglish — until now! Fantagraphics Books is proud to bring this classic Disney creation to a 21st century audience inits entirety, starting from the strip’s 1930 launch. Relive Mickey’s race to a gold mine with Pegleg Pete hot on his heels;Mickey’s life on the lam after being framed for bank robbery; even Mickey’s ringside battle with a hulking heavyweightchamp! The premiere volume features a dozen different adventures starring Mickey, his gal Minnie and her uncle Mortimer,his pals Horace Horsecollar and Butch, the villainous Pegleg Pete, and the mysterious and shrouded Fox.Gottfredson’s vibrant visual storytelling has never been more beautifully reproduced; we promise the best reprintingthe strip has ever seen, with each daily lovingly restored from Disney’s original negatives and proof sheets. “DeathValley” also includes more than 50 pages of fascinating supplementary features, including rare behind-the-scenes art andvintage publicity material from the first two years of the strip. Critics, scholars, seasoned Disney archivists, and fellowcartoonists provide commentary and historical essays on the strip’s creation and execution.Walt Disney often said that his studio’s success “all started with a Mouse” — Walt himself wrote the Mickey Mousestrip before turning it over to the able hands of Gottfredson — and today Mickey is among the world’s most recognizableicons. Now it’s time to rediscover the wild, unforgettable personality behind the icon: Floyd Gottfredson’s MickeyMouse.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Humor",
    "Fiction",
    "Adventure",
    "Comic Strips",
    "Graphic Novels Comics"
  ],
  "author": "Floyd Gottfredson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/10269605-mickey-mouse-vol-1"
}