{
  "title": "HACKER",
  "description": "Bhanu Srivastav's novel Hacker 404 Happiness not found is a Compelling Story of a Mysterious Billionaire’s Past. When the enigmatic and shadowy billionaire, known only as Surya, emerges from a self-imposed exile to an expectant and attentive world, the media and general population go into a frenzied meltdown that was impatient for information.Surya was a person shrouded in mystery and nobody had any palpable information about him. Surya’s story was big news for everyone but finding any information about this wealthy businessman was almost impossible. With nothing available in official records, online or in traditional news outlets, he was like a ghost that many refuses to believe even exists. It seemed that someone erased his past just like the history of an Internet Browser.Everybody was asking questions and wondering Where has he been for the past 7 years?What has he been doing?Why did he vanish without a trace?What does he even look like?How he became a billionaire… Until Sargam, a young and ambitious journalist decided to find out his secrets. She desperately wanted to find the truth about Surya because she sees this as the only way to save her failing career. Sargam, who was on the verge of losing everything, the sudden re-emergence of Surya was a bigger deal than it was for most and could be what could save her career. She starts the journey of her most complicated and problematic pursuits of a story as she searches for the answers to the elusive and reticent billionaire’s past, in a desperate race to reveal the secrets he has been concealing from the outside world. Little did she know that this will be the most mysterious and twisted case of her life. She managed to reveal Surya's secrets to the world through painful but inspirational and heartwarming rags-to-riches story. But that was a ruse, and the real truth was still hidden away.Here's what this thriller book can offer you:•Compelling story: This is a perfect book for people who are looking to stimulate their minds and have a pleasant read.•Adrenaline, thrill, and suspense: Enjoy the thrilling and suspenseful plot that is guaranteed to keep you always on your toes.•Unique story delivered skillfully: Uncover the incredible twists and prepare to have your mind blown.Sargam hopes that her revelations will resurrect her own fortunes. But what is the reality of Surya’s rags to riches story? What pain is he still carrying in his heart? And is there a sinister truth behind the wealth and lifestyle of this perplexing individual? Enjoy the thrill, suspense, and the skillfully crafted twists, and find out what secret mystery billionaire hides!",
  "genres": [],
  "author": "Bhanu Srivastav",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/52342779-hacker"
}