{
  "title": "In the Company of Rebels: A Generational Memoir of Bohemians, Deep Heads, and History Makers",
  "description": "Meetings with remarkable activists since the 1960sAmerican social change movements dominated the 1960s and 1970s, an era brought about and influenced not by a handful of celebrity activists but by people who cared. These history makers together transformed the political and spiritual landscape of America and laid the foundation for many of the social movements that exist today.Through a series of 43 vignettes―tight biographical sketches of the characters and intimate memories of her personal encounters with them―the author creates a collective portrait of the rebels, artists, radicals, and thinkers who through word and action raised many of the issues of justice, the environment, feminism, and colonialism that we are now familiar with.From Berkeley to Bolivia, from New York to New Mexico, a complex, multi-layered radical history unfolds through the stories and lives of the characters. From Marty Schiffenhauer, who fought through the first rent-control law in the United States, to Ponderosa Pine, who started the All-Species Parade and never wore shoes, to Dan and Patricia Ellsberg, who released the Pentagon Papers and became life-long anti-war and antinuclear activists, the portraits bring out some of the vibrant, irreverent energy, the unswerving commitment, and the passion for life of these generations of activists.In our present moment, as many people find themselves in the streets protesting for the first time in their lives, In the Company of Rebels makes the connection to this relatively recent rebellious era.As the author comments on her own twenty-year old self, sitting at the counter of Cody’s Books in Berkeley in the early 1970s, thrilled about the times but oblivious of the work that came “I didn’t know anything about this courageous and colorful past. But now I know.”",
  "genres": [],
  "author": "Chellis Glendinning",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/52340564-in-the-company-of-rebels"
}