{
  "title": "Warrior Woman: The Exceptional Life Story of Nonhelema, Shawnee Indian Woman Chief",
  "description": "A bestselling master of historical fiction, James Alexander Thom has brought unforgettable Native American figures to life for millions of readers, powerfully dramatizing their fortitude, fearsomeness, and profound fates. Now he and his wife, Dark Rain, have created a magnificent portrait of an astonishing woman–one who led her people in war when she could not persuade them to make peace.Her name was Nonhelema. Literate, lovely, imposing at over six feet tall, she was the Women’s Peace Chief of the Shawnee Nation–and already a legend when the most decisive decade of her life began in 1774. That fall, with more than three thousand Virginians poised to march into the Shawnees’ home, Nonhelema’s plea for peace was denied. So she loyally became a fighter, riding into battle covered in war paint. When the Indians ran low on ammunition, Nonhelema’s role changed back to peacemaker, this time tragically.Negotiating an armistice with military leaders of the American Revolution like Daniel Boone and George Rogers Clark, she found herself estranged from her own people–and betrayed by her white adversaries, who would murder her loved ones and eventually maim Nonhelema herself.Throughout her inspiring life, she had many deep and complex relationships, including with her daughter, Fani, who was an adopted white captive . . . a pious and judgmental missionary, Zeisberger . . . a series of passionate lovers . . . and, in a stunning creation of the Thoms, Justin Case–a cowardly soldier transformed by the courage he saw in the female Indian leader.Filled with the uncanny period detail and richly rendered drama that are Thom trademarks, Warrior Woman is a memorable novel of a remarkable person–one willing to fight to avoid war, by turns tough and tender, whose heart was too big for the world she wished to tame.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Native American",
    "Historical",
    "Westerns",
    "Native American History",
    "18th Century"
  ],
  "author": "James Alexander Thom",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/52327.Warrior_Woman"
}