{
  "title": "African American Poetry: 250 Years of Struggle and Song",
  "description": "A literary landmark: the biggest, most ambitious anthology of black poetry ever published, gathering 250 poets from the colonial period to the presentOnly now, in the 21st century, can we fully grasp the breadth and range of African American poetry: a magnificent chorus of voices, some familiar, others recently rescued from neglect. Here, in this unprecedented anthology expertly selected by poet and scholar Kevin Young, this precious living heritage is revealed in all its power, beauty, and multiplicity. Discover, in these pages, how an enslaved person like Phillis Wheatley confronted her legal status in verse and how an antebellum activist like Frances Ellen Watkins Harper voiced her own passionate resistance to slavery. Read nuanced, provocative poetic meditations on identity and self-assertion stretching from Paul Laurence Dunbar to Amiri Baraka to Lucille Clifton and beyond. Experience the transformation of poetic modernism in the works of figures such as Langston Hughes, Fenton Johnson, and Jean Toomer. Understand the threads of poetic history—in movements such as the Harlem and Chicago Renaissances, Black Arts, Cave Canem, Dark Noise Collective—and the complex bonds of solidarity and dialogue among poets across time and place. See how these poets have celebrated their African heritage and have connected with other communities in the African Diaspora. Enjoy the varied but distinctly Black music of a tradition that draws deeply from jazz, hip hop, and the rhythms and cadences of the pulpit, the barbershop, and the street. And appreciate, in the anthology's concluding sections, why contemporary African American poetry, amply recognized in recent National Book Awards and Poet Laureates, is flourishing as never before. Taking the measure of the tradition in a single indispensable volume, African American Poetry: 250 Years of Struggle and Song sets a new standard for a genuinely deep engagement with Black poetry and its essential expression of American genius.",
  "genres": [
    "Poetry",
    "African American",
    "Anthologies",
    "Nonfiction",
    "Race",
    "History",
    "American"
  ],
  "author": "Kevin Young",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/52337432-african-american-poetry"
}