{
  "title": "Reaper's Pack",
  "description": "One grim reaper. Three hellhounds who refuse to bow down to her. A monster hunting them in the shadows… \nTen years ago, I was judged worthy of life after death and returned to the mortal realm as a grim reaper. Scythe in hand, I guide souls to deliverance—and it’s time for a promotion.My new territory is triple the size of any I’ve worked before. High death rates mean one busy reaper, and the only way to keep up is with a pack of hellhounds. Faithful. Strong. Merciless. Hellhound shifters are a reaper’s right hand in the field, shepherding and guarding souls until they can be reaped.We get our pick of the litter from the best breeders in Hell, but for some reason, I’m drawn to the pack no one wants.An alpha who refuses to yield.A beta who doesn’t take me seriously.A runt who flinches at every command.I want them—even if they don’t want me.Because the hunger in their eyes tells a different story. But the fact that they can’t decide whether to love me or hate me, fight me or screw me, is making our situation way too complicated.Still, I refuse to give up. If this infuriatingly handsome trio can’t be trained, if we don’t pass the trials, they go back to a cage and a cruel demon master.Yeah. Not happening.Reapers and hellhounds are natural allies, and the sooner we secure our bond, the better, because as it turns out…All our lives depend on it.Reaper’s Pack is a standalone why-choose paranormal romance and is part of the ALL THE QUEEN’S MEN series. Each book in the series is a full-length standalone featuring layered heroes and a headstrong heroine who never has to settle for just one happily-ever-after. The books can be read in any order and are part of the same supernatural universe.",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Demons",
    "Paranormal Romance"
  ],
  "author": "Rhea Watson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/52322847-reaper-s-pack"
}