{
  "title": "Stick and Poke",
  "description": "Mat Harlow had his life figured out. He married his college sweetheart, and his residency at the hospital was showing a promising career ahead. Then, at the hands of a reckless driver, all of it changed. A traumatic brain injury derails his life, and Mat finds himself dumped by his wife, out of a job, and rejected by his family. He escapes into the world of tattooing, settling in Fairfield, Colorado, surrounded by the only people who had ever offered him unconditional support. But as comforting as the guys at Irons and Works are, he can’t deny that he’s lonely. His inability to read, aphasia, and stammer make it difficult for him to maintain any semblance of normal when it comes to relationships.  Wyatt Adley has dealt with his fair share of disaster when it comes to marriage. When his husband is involved in a scandal with a student, Wyatt spends all of his energy to clear his name, then quickly escapes Canada for the US. He settles in a sleepy little town just outside of Denver, renting a small house from the local mechanic, and trying to lay low until he figures out what he wants to do with his life. But it’s not that easy to start over, and his ability to keep himself isolated is strained when he meets the young tattoo artist recovering from a head injury. Wyatt falls quickly and deeply, but there’s one problem—as far as he knows, Mat is straight.  Except, that might not be entirely true. Mat’s been holding tight to a secret, afraid to take up space in a lane that never belonged to him. But with every French pick-up line Wyatt teases him with, every second he spends in the other man’s company, Mat starts to realize he can’t hide that part of himself anymore. He’s enamored with the other man—from Wyatt’s love of old westerns and Tombstone, to the way he lives his life unapologetically. Once Mat leaps, he knows there’s no going back.  If only it were so easy. Wyatt is afraid that his past ruined him for any future, and Mat’s afraid that his inabilities make him impossible to love, but with the support of their friends and family, they just might find their way to their happily ever after.  Stick and Poke is the fifth book in the Irons and Works series. The book contains no cheating, and guaranteed HEA. Stick and Poke can be read as a stand-alone novel, but is best understood in the context of the previous books in Irons and Works.",
  "genres": [
    "M M Romance",
    "Romance",
    "Disability",
    "Contemporary",
    "LGBT",
    "Queer",
    "Friends To Lovers"
  ],
  "author": "E.M. Lindsey",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/52330247-stick-and-poke"
}