{
  "title": "Learning German",
  "description": "\"Not many know and love Europe, and our complex relationship with it, like Luscombe. And no one can communicate that with such fantastically self-deprecating wit.\" Federay Holmes, Associate Artist at the Globe Theatre London. With the possibility looming that the referendum might get passed and he'll lose easy access to his German partner and Germany, British stage director Tim Luscombe must get a German passport. To apply he must first pass his German language test. To do that, he must first learn German. It goes badly. An ode to a potential union, a lament for lost citizenship and a celebration of life, Tim Luscombe’s comic diary charms as it enlightens. Apparently secure in the cosmopolitan bubble of Berlin, Tim seeks to win citizenship by returning to school to learn German. However, his twenty international classmates are not as focussed on study as he would wish. Karole from Botswana, Mervyn from Estonia and Jang-Mi from Korea become his new unlikely friends as together they grapple with mind-bending grammar, the art of integration and baffling immigration paperwork. As their flawed but valiant teacher attempts to coral her ship of fools towards an understanding of the dative, some prosper while others move on.As well as reflecting the anarchy of the class, Learning German (badly) records Tim’s despair watching from afar the build-up to the referendum to leave the European Union - Brexit. And then its aftermath when the UK votes to leave the EU. His sense of himself as a European is threatened when a new England is born, heralded by Teresa May’s conference speech damning ‘citizens of nowhere’. As an old England dies and Tim mourns and feels a sense of loss and confusion, his father also faces his own death in Teddington Hospital, forcing priorities to shift and the comedy to darken. As a European political union is torn apart, a new personal union deepens when Tim’s peregrinations end and he falls in love with his newly adoptive country and marries his German boyfriend.This comedy of manners is as much about the dynamics of a classroom as it is about a union of countries – as much about feelings of isolation among unfamiliar people-places-and-things as it is about how those feelings ultimately transform into renewal. Its central interests are transience, identity, community – and how not to learn German.",
  "genres": [
    "Nonfiction",
    "Memoir"
  ],
  "author": "Tim Luscombe",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/52322977-learning-german"
}