{
  "title": "The Dead Writer",
  "description": "Anna is a middle-aged writer who has brought up her daughter all alone. Now that her daughter, Berta, is all grown up she wants to meet the unknown father she’s only ever seen in a photograph. Berta has a boyfriend called Hans, and as their relationship reaches crisis point, her need to connect with her father grows stronger. Hans works in a factory and has a sister named Clara. Clara is lonely and misunderstood, and has a bit of an obsession with this guy who rides a motorbike.All these lives intertwine, but within them is the story of Anna Flieder, a woman who decides to write a story based on her life. Her inspiration? A shadowy form of the man who she abandoned all those years ago…“The story shows the process of creation of a literary work (...) It’s a novel aimed at those who like to read, those who let themselves be absorbed into the reading because it requires a lot of imagination and there are lots of things which are just hinted at.” -Review in La Mañana“This book tells the story of Anna, a writer, and the world and lives of the people around her. Anna lives her literary life as her real one, suffering from a kind of schizophrenia as the characters in her books collide with her life in their desire to see the light. The original was published in Spain in 2008.” -Debbie Garrick, Translator“The Dead Writer” is, in essence, an invitation to all those who enjoy the way that literature reflects itself within a literary work. But it also represents the opportunity to follow other characters with feelings in situations that inevitably provoke recognition. [...] A delightful literary text which stands out with metaphorical language and suggests images that are capable of depicting daily scenes containing a multitude of possibilities that often, life does not let us see.” -Dr Alexandra Santos Pinheiro, in the magazine Resonancias Literarias, no. 153“The Dead Writer, a novel which not only demonstrates the author's skill but also how we see her handling of the essential tool of all writers, language. [...] This novel is also an insightful literary artefact which is sure to satisfy the diverse enjoyment of the modern reader.\" -Letralia, Tierra de Letras\"The author Núria Añó masterfully weaves a tale that delves deep into an exploration of the modern individual.\" -Noury Bakrim, Traductor",
  "genres": [
    "Fiction",
    "Spanish Literature",
    "Spain",
    "Novels",
    "Cultural"
  ],
  "author": "Núria Añó",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/52323226-the-dead-writer"
}