{
  "title": "The Year 1000: When Explorers Connected the World—and Globalization Began",
  "description": "From celebrated Yale professor Valerie Hansen, a groundbreaking work of history showing that bold explorations and daring trade missions connected all of the world’s great societies for the first time at the end of the first millennium.In history, myth often abides. It was long assumed that the centuries immediately prior to AD 1000 were lacking in any major cultural developments or geopolitical encounters, that the Europeans hadn’t yet discovered North America, that the farthest anyone had traveled over sea was the Vikings’ invasion of Britain. But how, then, to explain the presence of blonde-haired people in Mayan temple murals in Chichen Itza, Mexico? Could it be possible that the Vikings had found their way to the Americas during the height of the Mayan empire?Valerie Hansen, a much-honored historian, argues that the year 1000 was the world’s first point of major cultural exchange and exploration. Drawing on nearly thirty years of research on medieval China and global history, she presents a compelling account of first encounters between disparate societies. As people on at least five continents ventured outward, they spread technology, new crops, and religion. These encounters, she shows, made it possible for Christopher Columbus to reach the Americas in 1492, and set the stage for the process of globalization that so dominates the modern era.For readers of Jared Diamond’s Guns, Germs, and Steel and Yuval Noah Harari’s Sapiens, The Year 1000 is an intellectually daring, provocative account that will make you rethink everything you thought you knew about how the modern world came to be. It will also hold up a mirror to the hopes and fears we experience today.",
  "genres": [
    "History",
    "Nonfiction",
    "World History",
    "Audiobook",
    "Historical",
    "Medieval History",
    "Economics"
  ],
  "author": "Valerie  Hansen",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/52322053-the-year-1000"
}