{
  "title": "Community Spirit",
  "description": "From the shadowy streets of the Longcroft Estate comes another gritty story. New to the area single mother Tracy finds herself falling upon hard times. She has no friends or support network only her sweet little boy Tom.When money troubles become too much for her she finds herself turning to the wrong person for help. Will she escape from the clutches of despair or sink beyond redemption?Elsewhere on the Estate what shocking surprise awaits the Mayor?Darren Sant brings you another stand alone story in this believable setting that could be just down the road from you. Sant's tales bring you realism, hope and heart as he brings the Longcroft Estate kicking and screaming to life one story at a time.Praise for the first Longcroft Tale A Good “In ‘A Good Day’, Darren tackles difficult and emotive issues head on. He doesn’t flinch from showing us the grim horror of life for the underclass he’s writing about, neither sugars the pill nor dwells on the horror. He just tells it like it is. What I really love about this story is how Darren manages to give such a need-driven, self-obsessed waster as the main character layers and complexities, and yet to contain those within the essentially flawed nature of that character.” – Julie Morrigan.“This book has a prologue and an epilogue that work spectacularly well as bread for the meat in this wonderful sandwich. Excellent.” – Nigel P. Bird.A Good Day by Darren Sant has that characteristic. It’s set in a colourless, hopeless world at the bottom of the heap. In a place as dark as the abyss. So dark that the abyss has a clearer view of things than the people existing there.” – AJ Hayes.“You're in for a treat - a story with a story! This author grabs the reader's attention from the first opening hook and doesn't let go until the very last word.” – Leona Bodie.“Well, Darren Sant has the ability to convey a true human someone who has made some wrong turns but isn't entirely rotten to the core. This portrayal is well written and balanced, representing humanity in a way that many mainstream stories can't.” – Victoria Watson.“The brave use of the anti-hero is really refreshing to read; as the reader I was left needing more, which is perfect for the first in a series. The author has an interesting and, in my experience, unique way of setting the scene and bringing the reader into the story which I loved.” – Martin G. Dale",
  "genres": [],
  "author": "Darren Sant",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/12576160-community-spirit"
}