{
  "title": "How to Live: Or a Life of Montaigne in One Question and Twenty Attempts at an Answer",
  "description": "This question obsessed Renaissance writers, none more than Michel Eyquem de Montaigne, perhaps the first recognizably modern individual. A nobleman, public official, and winegrower, he wrote free-roaming explorations of his thought and experience, unlike anything written before. He called them essays, meaning “attempts” or “tries.” He put whatever was in his head into his tastes in wine and food, his childhood memories, the way his dog’s ears twitched when it was dreaming, as well as the appalling events of the religious civil wars raging around him. The Essays was an instant bestseller and, over four hundred years later, Montaigne’s honesty and charm still draw readers to him. They come in search of companionship, wisdom, and entertainment—and in search of themselves. This audiobook, a spirited and singular biography, relates the story of Montaigne’s life by way of the questions he posed and the answers he explored. It traces his bizarre upbringing, his youthful career and sexual adventures, his travels, and his friendships with the scholar and poet Étienne de La Boétie and with his adopted “daughter,” Marie de Gournay. And we also meet his readers—who for centuries have found in Montaigne an inexhaustible source of answers to the haunting question, “How to live?” “Lively and fascinating... How to Live takes its place as the most enjoyable introduction to Montaigne in the English language.” — Times Literary Supplement “Splendidly conceived and exquisitely written...enormously absorbing.” — Sunday Times “[Bakewell reveals] one of literature’s enduring figures as an idiosyncratic, humane, and surprisingly modern force.” — Publishers Weekly (starred) “A bright, genial, and generous introduction to the master’s methods.” — Kirkus Reviews “It is ultimately [Montaigne’s] life-loving vivacity that Bakewell succeeds in communicating to her readers.” — The Observer “ How to Live will delight and illuminate.” — The Independent “This subtle and surprising book manages the trick of conversing in a frank and friendly manner with its centuries-old literary giant, as with a contemporary, while helpfully placing Montaigne in a historical context. The affection of the author for her subject is palpable and infectious.” —Phillip Lopate, author of The Art of the Personal Essay “An intellectually lively treatment of a Renaissance giant and his world.” — Saturday Telegraph “Like recent books on Proust, Joyce, and Austen, How to Live skillfully plucks a life-guide from the incessant flux of Montaigne’s prose...Superb.” — The Guardian",
  "genres": [
    "Philosophy",
    "Biography",
    "Nonfiction",
    "History",
    "Essays",
    "Biography Memoir",
    "France"
  ],
  "author": "Sarah Bakewell",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/10270423-how-to-live"
}