{
  "title": "The vicissitudes of a soldier's life; or, A series of occurrences from 1806 to 1815",
  "description": "Excerpt: ... Pedrogos is a pleasant village, having plenty of wood and good water within half a mile of the town; so that we were well situated for the winter, which is very cold and rainy, but scarcely any frost or snow, except on the mountains, where it lies all the year. In this place we received our provisions regularly: our daily allowance was as follows: one pound of beef, one pound of biscuit or one pound and a half of bread, one-third of a pint of rum, and two ounces of rice. Our beef was better than I had ever seen it before, for there was good pasture and rest for the cattle, which gave them time to fatten. Very frequently in the summer season, when we had been some time on the march, our meat was literally like carrion; and if twenty pounds had been offered for a small quantity of suet, it would have been impossible to obtain it. chap. viii. While we lay at Pedrogos, General Castanos, with his baggage and suite, passed through on his way to the Spanish frontier. There was nothing remarkable in his appearance; in person he was below the middle stature. I and several others were placed as a guard of honour to receive this celebrated Spanish hero: the guard was drawn up in the market-place, and waited nearly two hours for him: at length he arrived, and we presented arms and conducted him to the quarters of the commanding officer, who invited him to partake of refreshment; but he politely refused, and passed through without alighting from his carriage. While at this place, I mounted guard: during the day we received as prisoners two Portuguese peasants, who had been employed in the commissary department, having in charge several fine bullocks for the army: but these two rascals had contrived to exchange some of the fattest and best for some...",
  "genres": [],
  "author": "John  Green",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/52377085-the-vicissitudes-of-a-soldier-s-life-or-a-series-of-occurrences-from-1"
}