{
  "title": "The Crusader: Ronald Reagan and the Fall of Communism",
  "description": "Based on extraordinary research: a major reassessment of Ronald Reagan's lifelong crusade to dismantle the Soviet Empire–including shocking revelations about the liberal American politician who tried to collude with USSR to counter Reagan's effortsPaul Kengor's God and Ronald Reagan made presidential historian Paul Kengor's name as one of the premier chroniclers of the life and career of the 40th president. Now, with The Crusader, Kengor returns with the one book about Reagan that has not been written: The story of his lifelong crusade against communism, and of his dogged–and ultimately triumphant–effort to overthrow the Soviet Union.Drawing upon reams of newly declassified presidential papers, as well as untapped Soviet media archives and new interviews with key players, Kengor traces Reagan's efforts to target the Soviet Union from his days as governor of California to the fall of the Berlin Wall and the collapse of what he famously dubbed the \"Evil Empire.\" The result is a major revision and enhancement of what historians are only beginning to realize: That Reagan not only wished for the collapse of communism, but had a deep and specific understanding of what it would take––and effected dozens of policy shifts that brought the USSR to its heels within a decade of his presidency.The Crusader makes use of key sources from behind the Iron Curtain, including one key memo that implicates a major American liberal politician–still in office today–in a scheme to enlist Soviet premier Yuri Andropov to help defeat Reagan's 1984 reelection bid. Such new finds make The Crusader not just a work of extraordinary history, but a work of explosive revelation that will be debated as hotly in 2006 as Reagan's policies were in the 1980s.",
  "genres": [
    "History",
    "Biography",
    "Politics",
    "Nonfiction",
    "Presidents",
    "Audiobook",
    "American History"
  ],
  "author": "Paul Kengor",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/5237.The_Crusader"
}