{
  "title": "The Treasure of Netherstrand",
  "description": "He set out to find a treasure. But he found so much more! A legendary poem whispers words of mystery about a long-hidden treasure in Netherstrand Hall: an extravagant resort in Victorian North Devon. That is why Charles Hannover, a miserly businessman, bought the ancient castle in the first place. Money is always foremost on his mind as he watches the sightseers pour in by the droves to visit his grand estate. Too caught up in business to even think of searching for the hidden treasure, he has every reason to hope for riches as the owner of such an attraction. But when Hannover finds and hires a street urchin as his errand boy, everything in his life begins to change. Breaking into Hannover’s gloomy, stressful life, Timothy becomes a mystery almost as deep to Hannover as the legend of the treasure itself. What is it that keeps joy shining in the child’s eyes? What makes life so delightful to him? As time goes on, Hannover has to wonder, could it be that this penniless waif has what his heart has always secretly craved? The riches of a soul which is full of the peace and joy of God. And, when Timothy begins stumbling upon old riddles throughout the castle, could it be that this plucky little boy is the only one capable of solving Netherstrand’s mystery? Teaming up, the money-loving businessman and his sunny-natured errand boy delve into the depths of the castle’s secrets. But there are footsteps in the shadows; and unnerving scenarios make Hannover fear that they are not the only ones getting close to finding the treasure. As he races to solve the mystery before any other hand can touch his treasure, Hannover finds himself gaining a far greater prize than money. And as Timothy’s nature and zeal for Christ draws his heart, he finds himself longing for much more than silver or gold. The question is, will he find what he’s really searching for?",
  "genres": [],
  "author": "Theresa Stinnett",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/52379161-the-treasure-of-netherstrand"
}