{
  "title": "The Last Protector",
  "description": "From the No.1 Sunday Times bestselling author of The Ashes of London comes the next book in the phenomenally successful series following James Marwood and Cat Lovett.A dangerous secret lies beneath Whitehall Palace… Brother against brother. Father against son. Friends turned into enemies. No one in England wants a return to the bloody days of the Civil War. But Oliver Cromwell’s son, Richard, has abandoned his exile and slipped back into England. The consequences could be catastrophic. James Marwood, a traitor’s son turned government agent, is tasked with uncovering Cromwell’s motives. But his assignment is complicated by his friend – the regicide’s daughter, Cat Lovett – who knew the Cromwells as a child, and who now seems to be hiding a secret of her own about the family. Both Marwood and Cat know they are putting themselves in great danger. And when they find themselves on a top secret mission in the Palace of Whitehall, they realize they are risking their lives…and could even be sent to the block for treason.Praise for Andrew Taylor‘One of the best historical crime writers today’ \nThe Times\n‘If you like C. J. Sansom, or Hilary Mantel, you’ll love Andrew Taylor’ Peter James‘Effortlessly authentic…gripping…moving and believable. An excellent work’ C. J. Sansom‘This is historical crime fiction at its dazzling best’ \nGuardian\n‘One of the best historical novelists around’ \nSunday Times\n‘A breathtakingly ambitious picture of an era’ \nFinancial Times\n‘A masterclass in writing for the genre’ Ann Cleeves‘Andrew Taylor is one of our finest storytellers' Antonia Hodgson‘Vivid and compelling’ \nObserver\n‘A novel filled with intrigue, duplicity, scandal and betrayal, whose author now vies with another master of the genre, C. J. Sansom’ \nSpectator\n‘Taylor brings the 17th century to life so vividly that one can almost smell it’ \nGuardian\n‘A most artful and delightful book, that will both amuse and chill’ \nDaily Telegraph",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "Crime",
    "Historical Mystery",
    "17th Century"
  ],
  "author": "Andrew  Taylor",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/52430073-the-last-protector"
}