{
  "title": "The Last Angel To Fall",
  "description": "Good vs. Evil is not what you thought it was.  Get ready to challenge your entrenched beliefs.  \n\n Kirkus Reviews call this novel \"an extremely winning variation on the ... model of Dan Brown’s 2003 bestseller The Da Vinci Code that offers a compelling combination of interagency thriller and supernatural fantasy. Federal Agent Jubal Stone was put on a desk after the death of his wife and the disappearance of his best friend. Given a chance to redeem his career, the former Diplomatic Security Service 'top gun' is assigned to apprehend a special target: a Fallen Angel who was imprisoned inside a meteorite that struck south-central Michigan.Paired with his former mentor and antagonist, Jubal learns the shocking truth about a top-secret agreement between the State Department and the ruler of Hell, who demands the Fallen Angel be delivered to him immediately. Jubal is torn between duty and faith when he learns the reason Lucifer is desperate to have this Fallen Angel delivered to him.What is the surprising truth behind the origin of Hell? Jubal Stone is about to find out! With his elusive prey on a killing spree, a beautiful and mysterious 'Angel expert' joins Jubal's hunt – a woman born and raised in Hell – but a rogue CIA agent is also in pursuit, and he has a very different plan for the Fallen Angel.Jubal Stone is caught in the middle of the never-ending war between God and Satan, but things are not what they seem. To make matters worse, Jubal's teammates are keeping secrets from him – secrets that could get them all killed. Jubal has been ordered to capture the Fallen Angel and deliver him to a top-secret transfer station where he will be sent to Lucifer to avoid war.\n\nWar between the United States of America – and Hell.\n\n\nIf you like James Rollins, you will love this story.",
  "genres": [],
  "author": "Brian G.  Walsh",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/52405029-the-last-angel-to-fall"
}