{
  "title": "Rumor of a Werewolf",
  "description": "September: Sleepy Hollow, New York, The Daily CrawlerHorrified law enforcement officials investigating the gruesome death of Candee Brenneman claim a wolf or some other large animal killed her. Brenneman, age 32, an avid jogger and fitness instructor, was found by an employee of RIP's Restaurant under a bridge in Rockefeller State Park. Brenneman's throat was savagely ripped apart. Large misshapen paw prints were found around the body. There were also bite marks on her hands, and arms. Some have suggested that her death, occurring during a full moon, indicates that a werewolf may be running loose in Sleepy Hollow. The investigation is on-going. In Sleepy Hollow, New York Nick Caden uncovers the clues surrounding the murder of Candee Brenneman ... and other deadly secrets! But as the last full moon of the month rises over Raven Rock, Nick is about to learn that monsters are real. And the worst kind of monster is the one you never see coming. Awards for the Caden Chronicles mystery series \n   Winner of the Selah award for tween / teens  \n   INSPY Award nominee (runner up) \n   Moonbeam Children's Book Award nominee (runner up -- tagged out at third :) \n Did you know: \n   According to the National Assessment of Education Progress' latest report, 64% of all eighth-grade students are unable to read proficiently. \n   82% percent of black students and 77% of Hispanic students are not reading proficiently. \n   More than 30 million Americans cannot read or write above a third-grade level. \n   85% of the juveniles in the court system are functionally illiterate, as are 60% of prison inmates. \n   The reading gap between boys and girls increases as they age. By 12th grade girls are two times more likely to score higher on reading tests than boys. \n Readers Are Leaders - Buy a Boy a Book!\"I wrote the 'Caden Chronicles' series with boys in mind,\" says author Eddie Jones. \"The 'Caden Chronicles' books are short murder mysteries with a spiritual supernatural element. Dead Man's Hand addresses the myth of ghosts. Skull Creek Stakeout addresses the myth of vampires (it started in the Upper Room). Dead Low Tide addresses the myth of zombies and the walking dead. Rumor of a Werewolf deals with powerful men who refuse to honor God and are turned into beast-like creatures (Book of Daniel).\"Immediately his body was drenched with the dew of heaven until his hair grew like the feathers of an eagle and his nails like the claws of a bird. Let him live with the animals of the earth. Let his mind be changed from that of a man and let him be given the mind of an animal.\" ~ the Bible \"werewolf\"",
  "genres": [
    "Mystery",
    "Christian Fiction",
    "Young Adult"
  ],
  "author": "Eddie       Jones",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/52419478-rumor-of-a-werewolf"
}