{
  "title": "Heart of a Slave",
  "description": "A warrior’s daughter should never show weakness even when the earth falls apart under her feet...Siwhetta, an African girl, is captured and sold into the slave trade in 1814 and shipped to the West Indies. Despite her initial resistance, she is ensnared in a steamy love affair with the young, noble aristocrat, Dimitri. However, as the daughter of a chieftain warrior, Siwhetta is defiant, passionate, and determined to return to her homeland.  Dimitri, on the other hand, enamored of this nubile, ebony beauty is possessive and takes what he wants, and thus far, his eyes are set on Siwhetta. Intent on possessing her, he will stop at nothing to get her into his arms even if it meant breaking every rule in the book.Disclaimer: Please note that this book includes information that may be upsetting to some persons. ExcerptSiwhetta inhaled and looked into his cobalt eyes and pointed out calmly, “I am a slave and you are the slave master’s grandson.” Siwhetta repeated then began to sob. “This is not what I want. I would like to experience true love like my parents did. One day, I would like to live a normal life again. I don’t want this!” She began pushing at him again. Defeated, Dimitri rolled on his back next to her on the ground. He looked at the canopy of trees hanging over their heads. There was no doubt that he cared for her. He wished he knew how he could make her trust him. “I will take you home with me.”Horrified, Siwhetta gasped then turned to look at him. She searched his eyes curiously.As if he knew that she doubted him, he repeated: “I will take you home with me.”Siwhetta sat up with relief, heart palpitating. She finally felt like there was hope; that she could finally have a life of freedom again; a chance to fall in love; a chance to have a family; to start a new life somewhere new. Tears of joy finally ran down her cheeks. “I can finally be free again?” she placed her hand on her chest in disbelief. “Maybe,” she paused, biting on her lower lip then whispered in awe, “maybe someday go back home?” Dimitri tensed, he scowled. “You will remain with me.”As if wounded, Siwhetta grimaced then lowered her head in confusion. She lifted her chin proudly and with blazing eyes yelled, “I would never!”Dimitri said, firmly, “You will remain with me.”",
  "genres": [
    "Historical",
    "Historical Romance",
    "Interracial Romance"
  ],
  "author": "Verna Cyril",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/52452269-heart-of-a-slave"
}