{
  "title": "The Greatest Speeches of Ronald Reagan",
  "description": "With twenty-eight speeches spanning the Reagan era, The Greatest Speeches of Ronald Reagan provides readers with a direct source into President Reagan’s profound belief in God, freedom, individualism, limited government, and his great love for his country.  Ronald Wilson Reagan, the fortieth president of the United States, was also one of America's greatest orators. Known as “The Great Communicator,” he shared his vision of the greatness of America while guiding the nation to an unprecedented prosperity and renewed vigor. When President Reagan assumed the presidency in 1981, America’s economy ebbed with 12 percent inflation and 8 million unemployed. Reagan’s predecessor spoke of a national “malaise”. Abroad, America’s adversary, the Soviet Union, was expanding its influence. The Soviet Union’s nuclear weapons capability surpassed that of the United States and previous nuclear arms treaties were failures. President Reagan’s goals were When President Reagan left office in 1989, these goals had been From the time he arrived on the political scene in 1964-throughout his presidency and beyond, Ronald Reagan used his speeches to inspire and reinvigorate America. When he spoke, Reagan said he was preaching a sermon. The American people saw his vision of America and his dreams for the future, and they overwhelmingly responded; he was re-elected in 1984 by the largest number of electoral votes in the nation’s history. In this collection of twenty-eight speeches spanning the Reagan era, with an Introduction from his son, Michael Reagan, you may read for yourself his inspirational sermons. From his first speech in the political arena in 1964 to his Last Letter to America, informing Americans of his Alzheimer’s disease, Ronald Reagan’s words show a profound belief in God, freedom, individualism, limited government, and his great love for his country.",
  "genres": [
    "Politics"
  ],
  "author": "Ronald Reagan",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/524633.The_Greatest_Speeches_of_Ronald_Reagan"
}