{
  "title": "Tarnished Scalpels: The Court-Martials of Fifty Union Surgeons",
  "description": "\"Amid the flood of Civil War books that washes over us each year, Dr. Thomas Lowry's works have long stood out for their brilliant research, originality, and insight. Now, with his accomplished co-author Dr. Jack Welsh, he has produced a work as fascinating to the average reader as it is useful to the specialist. Tarnished Scalpels offers us a richer portrait of our greatest war's reality than could any other ten books on the subject. These are tales of folly, fear, and shame, well told by men who understand both medicine and good writing.\" -Owen Parry, author of Faded Coat Of Blue As in his previous book, Tarnished Eagles (0-8117-1597-3), Thomas Lowry-this time with Jack Welsh-brings to light the various misdeeds of Union officers. In this new book, the authors examine the relationship between the principles of the medical profession and the often byzantine regulations of the army. As a result, the courts-martial in this book primarily fall into two categories: failure to practice proper medicine and failure to follow the procedures and administrative rules that govern army life, with some overlap. As usual, Lowry peppers many of these accounts with his dry wit, but he also offers penetrating analyses of the problems faced by many of these doctors, who often were forced to work under intolerable conditions. Thomas Lowry, a retired psychiatrist, is the author of several books on the Civil War, including the controversial The Story the Soldiers Wouldn't Tell: Sex in the Civil War (0-8117-1515-9). Jack D. Welsh, professor of medicine emeritus at University of Oklahoma, has written for and edited many medical journals, including the New England Journal of Medicine. He is also theauthor of Medical Histories of Confederate Generals and Medical Histories of Union Generals.",
  "genres": [
    "Civil War",
    "History",
    "Medicine"
  ],
  "author": "Thomas P. Lowry",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/524726.Tarnished_Scalpels"
}