{
  "title": "Chief Inspector Gamache: Still Life / A Fatal Grace / The Cruellest Month / A Rule Against Murder / The Brutal Telling",
  "description": "Please Note That The Following Individual Books As Per Original ISBN and Cover Image In this Listing shall be Dispatched Collectively:  Chief Inspector Gamache Book Series 1-5 Collection 5 Books Set:  Still Life:  The discovery of a dead body in the woods on Thanksgiving Weekend brings Chief Inspector Armand Gamache and his colleagues from the Surete du Quebec to a small village in the Eastern Townships. Gamache cannot understand why anyone would want to deliberately kill well-loved artist Jane Neal, especially any of the residents of Three Pines - a place so free from crime it doesn't even have its own police force.  A Fatal Grace:  Winter in Three Pines, and the sleepy village is carpeted in snow. It's a time of peace and goodwill - until a scream pierces the biting air. A spectator at the annual Boxing Day curling match has been fatally electrocuted. Despite the large crowd, there are no witnesses and - apparently - no clues.  The Cruellest Month: It's Easter, and on a glorious Spring day in peaceful Three Pines, someone waits for night to fall. They plan to raise the dead...When Chief Inspector Gamache of the Surete du Quebec arrives the next morning, he faces an unusual crime scene.  A Rule Against Murder: It's the height of summer, and the wealthy Finney family have gathered at the Manoir Bellechasse to pay tribute to their late father. But as the temperature rises, old secrets and bitter rivalries begin to surface.  The Brutal Telling:  As Gamache and his colleagues start to dig under the skin of this peaceful haven for clues, they uncover a trail of stolen treasure, mysterious codes and a shameful history that begins to shed light on the victim's identity - and points to a terrifying killer...",
  "genres": [
    "Fiction"
  ],
  "author": "Louise Penny",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/52459887-chief-inspector-gamache"
}