{
  "title": "Brothers: The Hidden History of the Kennedy Years",
  "description": "For decades, books about President John F. Kennedy or his brother Robert Kennedy have woven either a tale of Camelot or a tawdry tale of ambition & reckless personal behavior. But the real story of the Kennedys in the 1960s has been submerged. \"Brothers\" sheds light on the inner life of the Kennedy presidency & its aftermath. Talbot, founder of Salon.com, has written a political history sure to be talked about. It begins on the afternoon of November 22, 1963, as a stricken Robert urgently demands answers about his brother's assassination. His suspicions focus on the nest of CIA spies, gangsters & Cuban exiles who'd long plotted a violent regime change in Cuba. The Kennedys had struggled to control this swamp of anti-Castro intrigue based in South Florida, but with little success. It then shifts back in time, revealing the shadowy conflicts that tore apart the Kennedy administration, pitting the president & his brother against their own national security apparatus. The brothers & a small circle of their trusted advisors -- men like Theodore Sorensen, Robert McNamara & Kenny O'Donnell, who were so close as to be regarded as family -- repeatedly thwarted Washington's warrior caste. These hard-line generals & spymasters were hell-bent on a showdown with Communism -- in Berlin, Laos, Vietnam & especially Cuba. But the Kennedys frustrated their militaristic ambitions, pushing for a peaceful resolution to the Cold War. The tensions within the administration were headed for an explosive climax, when gunfire in Dallas terminated JFK's presidency. Based on over 150 interviews -- including many of the Kennedys' aging band of brothers, whose testimony here may be their final word on this political story -- as well as newly released government documents, \"Brothers\" reveals the untold story of those years, including JFK's efforts to keep the USA out of war & RFK's secret quest to solve his brother's murder. Bobby's subterranean search was a dangerous one & led, in part, to his own campaign in 1968 leading to his own death. RFK may have been the victim of the same plotters he suspected of killing his brother. This is history at its best -- meticulously researched, movingly told. It's a sprawling narrative about the clash of powerful men & the darker side of the Cold War -- a tale of tragic grandeur that will change understandings of the Kennedy saga.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "Presidents",
    "American History",
    "The United States Of America"
  ],
  "author": "David Talbot",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/524654.Brothers"
}