{
  "title": "Simply Ming: Easy Techniques for East-Meets-West Meals",
  "description": "As the chef and owner of the acclaimed Blue Ginger restaurant in Wellesley, Massachusetts, and an Emmy award-winning television personality, Ming Tsai has become the standard-bearer of East-West cuisine, the innovative blending of Eastern flavors and techniques with Western ingredients and presentations.Now, in Simply Ming , he presents a breakthrough technique for bringing East-West flair to everyday cooking, making it possible to transform a handful of fresh ingredients into a delicious meal in a matter of minutes. The genius of Simply Ming is a versatile array of master recipes—intensely flavored sauces, pestos, salsas, dressings, rubs, and more that eliminate much of the last-minute prep work. So sophisticated dishes such as Tea-Rubbed Salmon with Steamed Scallion-Lemon Rice, Grilled Miso-Citrus Scallop Lollipops, and Green Peppercorn Beef Tenderloin with Vinegar-Glazed Leeks can be on the table in less than 30 minutes.Even casual dishes such as spaghetti, burgers, fried calamari, and chicken wings get a boost of East-West excitement in Ming’s creative hands, becoming Asian Pesto Turkey Spaghetti, Salmon Burger with Tomato-Kaffir Lime Salsa, Blue Ginger Crispy Calamari, and Soy-Dijon Chicken Wings. This is food that is simple enough to serve on a weeknight, but special enough to share with guests. And desserts get the Simply Ming treatment, too, with tempting ways to transform basic shortbread dough, chocolate ganache, and crème anglaise into a range of show-stopping finales.Filled with color photographs that motivate and inspire, beverage suggestions to complement each dish, and helpful tips for cooking with unfamiliar ingredients, Simply Ming makes the excitement and innovation of East-West cooking easily accessible to all home cooks.",
  "genres": [
    "Cookbooks",
    "Nonfiction",
    "Cooking",
    "Food",
    "Culinary"
  ],
  "author": "Ming Tsai",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/524449.Simply_Ming"
}