{
  "title": "The Killer Clown Calamity",
  "description": "Charlie Rhodes’ life is in turmoil. Her relationship with her boyfriend Jack is going well but Casey, the newest member of the Legacy Foundation, has dropped a bombshell and Charlie feels as if things are spinning out of control. While waiting for DNA results to prove (or disprove, for that matter) Casey’s identity, the team gets called out on a weird case.It seems sadistic clowns with magical abilities are killing people in the suburbs surrounding Nashville, and the deaths are bloody and horrible. Upon arriving on the scene, Charlie and Jack stumble across an entire cadre of clowns hanging out at the fairgrounds and the game is afoot.Mystic Caravan Circus isn’t what it appears to be on the surface. Poet Parker, second in command for the circus, is front and center as Jack and Charlie start digging for answers. It seems both sides are keeping secrets, though, and discovering the truth isn’t going to be easy.Charlie has always zealously guarded her supernatural secret and it seems she’s not the only one, because the moment she crosses the threshold to the circus she senses she’s surrounded by a magical group of otherworldly individuals.Trust takes time but that’s a precious commodity as the clowns ramp up their attacks. It’s going to take everyone working together to figure out what’s happening… and who is behind it.Poet and Charlie make a fearsome twosome but they might not be enough to take on this particular threat. Everybody hates a clown, and when this trio declares war, the horror that follows will haunt an entire city.Charlie is determined to deal with the clowns before focusing on her personal life. She has to survive to find answers, though, and it’s going to take every ounce of power she has to come out safely on the other side.Fear is the name of the game, and two heroes are about to collide.",
  "genres": [
    "Paranormal",
    "Cozy Mystery",
    "Paranormal Mystery",
    "Mystery",
    "Magic",
    "Audiobook",
    "Fantasy"
  ],
  "author": "Amanda M. Lee",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/52486975-the-killer-clown-calamity"
}