{
  "title": "The Knucklehead of Silicon Valley",
  "description": "Comedic-spy thriller examines Silicon Valley's unbridled innovation culture.Ralph Gibsen isn’t your typical spy. In fact, he may not be a spy at all. He's lumpy, blundering and abysmal at chatting up the fairer sex. Yet, he is attracting a significant amount of attention from the intelligence community. After all, as a 30-year Silicon Valley mainstay, he can phish your passwords, bust firewalls, and has developed software used by millions to circumvent government censorship. And now, he thinks he has stumbled upon a cabal who is pushing to misuse his own technology for world domination.Ralph helps create an educational Tool that maps a learner’s neurological processes and pinpoints the exact moment a student learns. But the Tool can also manipulate people’s beliefs. At least, that what several influential people think. Soon, Ralph finds himself the target of increasingly complex attacks on his businesses, reputation, freedom, and life.Ralph enlists an eclectic group of ‘frenemies’ to thwart this nefarious plot. McKenna may or may not still work for the CIA. Beautiful Eva may work for the Chinese government, who wants the Tool for themselves. Even Ralph’s lovely wife Jen could be involved... Ralph simply isn’t equipped to figure it out. And the world is closing in.Early reviews of the ARC include: \"It's all too rare to find a fun, seat-of-your-pants, literary romp like this. I got wonderfully lost with Ralph in the many cultures as he travels around the planet. And kudos for the author in the entertaining explanation of how investors examine entrepreneurial ventures for investment. As an investor myself, a lot of the anecdotes and stories resonated with me...wonderful reading\". Raz Zia [Managing Director of Aldrich Capital / Former MD at Goldman Sachs].“If a major amusement park ever wanted to build the ultimate spy-adventure ride with mystery, suspense, white-knuckle twists and turns, comedy, and romance, 'The Knucklehead of Silicon Valley' would be the perfect blueprint. Not only did I love the ride, but as with all great adventures, I learned a hell of a lot. I thought I knew what went on in the mythological land of Silicon Valley, but I had no idea how insane it truly is.” Bill Scott Glasser [Former Producer of Fox Television's America's Most Wanted]This thriller takes us through an insider's view of high-tech Silicon Valley culture, authentically capturing its brilliance and ambition, as well as its silliness and hubris. Smart and captivating, it follows the protagonist who is at times ham-fisted and dim, other times deft and clever, through a fascinating journey of intrigue along the cutting edge of tech. Filled with humor, suspense, whimsy, whit and moments of pure heart, this read is fascinating, educational, and a heck of a lot of fun.- Jordy Berson, Head of BitTorrent IncKnucklehead is like being shot out of an Ethernet cable lined with exotic travel and baroque paintings and landing on a sea of electricity\" Peterson Conway [Adventurer, Farmer, PayPal mafia]“This novel’s topic is so important: We stand in the middle of a storm – not just a geopolitical one, but a cyberpolitical one. It feels as if no one trusts anyone any more, and suspicion and confusion reign across our delicate cyberworld. Which way do we turn?” Eugene Kaspersky [Hacker-hunter and CEO of Kaspersky Labs]\"A terrific yarn with characters just absurd enough that they might be fictional, but not quite so absurd that the reading is left wondering who they really are or who they were based on - and that maybe she ought to be paying more attention to the promise and perils of technology. A fun and funny fictional look behind the Silicon Valley curtain at a world or misfits, schemers, brilliant visionaries, and accidental heroes.\" Peter Loge {Associate professor, School of Media and Public Affairs at The George Washington University, Director, Project on Ethics in Political Communication, Author, Soccer Thinking for Management Success]“A modern day ‘Being There’ – if Peter Sellers' Chauncey were a Silicon Valley tech investor! You will not only be thoroughly entertained but thoroughly educated as to the insanity that is the world of IPOs, internet privacy and the potential of high-tech's misuse.” Brian Frazer [Author, Cartoons With my Dad: How art drew us together]“A wonderfully exciting and comedic tale of Ralph, a venture capitalist and unlikely spy that leads us through an international tale of intrigue while unlocking the secrets of Silicon Valley. Fascinating and an absolute joy to read!” Tim Martin [CEO of Lifeprint]",
  "genres": [],
  "author": "G. Craig Vachon",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/52491548-the-knucklehead-of-silicon-valley"
}