{
  "title": "The Motion of the Body Through Space",
  "description": "In Lionel Shriver’s entertaining send-up of today’s cult of exercise—which not only encourages better health, but now like all religions also seems to promise meaning, social superiority, and eternal life—an aging husband’s sudden obsession with extreme sport makes him unbearable.After an ignominious early retirement, Remington announces to his wife Serenata that he’s decided to run a marathon. This from a sedentary man in his sixties who’s never done a lick of exercise in his life. His wife can’t help but observe that his ambition is “hopelessly trite.” A loner, Serenata disdains mass group activities of any sort. Besides, his timing is cruel. Serenata has long been the couple’s exercise freak, but by age sixty, her private fitness regimes have destroyed her knees, and she’ll soon face debilitating surgery. Yes, becoming more active would be good for Remington’s heart, but then why not just go for a walk? Without several thousand of your closest friends?As Remington joins the cult of fitness that increasingly consumes the Western world, her once-modest husband burgeons into an unbearable narcissist. Ignoring all his other obligations, he engages a saucy, sexy personal trainer named Bambi, who treats Serenata with contempt. When Remington sets his sights on the legendarily grueling triathlon, MettleMan, Serenata is sure he’ll end up injured or dead. And even if he does survive, their marriage may not.The Motion of the Body Through Space is vintage Lionel Shriver written with psychological insight, a rich cast of characters, lots of verve and petulance, an astute reading of contemporary culture, and an emotionally resonant ending.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Book Club",
    "Marriage",
    "Literature"
  ],
  "author": "Lionel Shriver",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/52514450-the-motion-of-the-body-through-space"
}