{
  "title": "New Deal or Raw Deal?: How FDR's Economic Legacy Has Damaged America",
  "description": "A sharply critical new look at Franklin D. Roosevelt's presidency reveals government policies that hindered economic recovery from the Great Depression -- and are still hurting America today. In this shocking and groundbreaking new book, economic historian Burton W. Folsom exposes the idyllic legend of Franklin D. Roosevelt as a myth of epic proportions. With questionable moral character and a vendetta against the business elite, Roosevelt created New Deal programs marked by inconsistent planning, wasteful spending, and opportunity for political gain -- ultimately elevating public opinion of his administration but falling flat in achieving the economic revitalization that America so desperately needed from the Great Depression. Folsom takes a critical, revisionist look at Roosevelt's presidency, his economic policies, and his personal life. Elected in 1932 on a buoyant tide of promises to balance the increasingly uncontrollable national budget and reduce the catastrophic unemployment rate, the charismatic thirty-second president not only neglected to pursue those goals, he made dramatic changes to federal programming that directly contradicted his campaign promises. Price fixing, court packing, regressive taxes, and patronism were all hidden inside the alphabet soup of his popular New Deal, putting a financial strain on the already suffering lower classes and discouraging the upper classes from taking business risks that potentially could have jostled national cash flow from dormancy. Many government programs that are widely used today have their seeds in the New Deal. Farm subsidies, minimum wage, and welfare, among others, all stifle economic growth -- encouraging decreased productivity and exacerbating unemployment. Roosevelt's imperious approach to the presidency changed American politics forever, and as he manipulated public opinion, American citizens became unwitting accomplices to the stilted economic growth of the 1930s. More than sixty years after FDR died in office, we still struggle with the damaging repercussions of his legacy.",
  "genres": [
    "History",
    "Economics",
    "Politics",
    "Nonfiction",
    "American History",
    "Biography",
    "Political Science"
  ],
  "author": "Burton W. Folsom Jr.",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/5249492-new-deal-or-raw-deal"
}