{
  "title": "A Mansion of Illusions: Romance, Psychology and Illusions",
  "description": "Are voodoo, witchcraft, black magic and shadow world, etc. things are true and in existence or are they just the creation of the human mind? Would there be any change in the behavior of the human mind in faraway, odd and lonely places? Are the souls are separate from the human bodies and would they go on journeys leaving the bodies somewhere and come back into them again? Can human mind memorize things and reproduce them with the same clarity and clearness even after fifty, sixty years also? Almost an answer to all these questions, 'A Mansion Of Illusions', a suspense, romantic and psychological thriller. Two young girls, two young boys, two middle aged women and two middle aged men were entered into that palace in which one more than hundred years aged old woman was bedridden. Neither Dr.Rajesh nor Dr.Malathi among those people, to their surprise, could find anything wrong with the old woman. Her breathing was normal, all the other body functions were normal but she was in a comatose state lying on the bed like that. All those eight people were forced to believe the rumor that was in circulation that the soul of the old woman was on a journey leaving the body there. Not just the old woman, but the palace was also an enigma to them. Almost all of them have faced different bizarre and eerie experience in that palace. The people who were long back dead came before them in that palace. They heard eerie voices, laughter but could not see the bodies. Even Vinod, the psychologist among them, was also subjected to such experiences. They could not understand whether they were real or all they were just subjected to hallucinations and imaginations. Vinod's repeated saying that it was quite natural that human mind undergoes different sorts of experiences in odd places like these did not put them at ease. The old woman was a big puzzle even to her own grandson, to Rajesh, himself. It was not understood to anyone why she always kept her grandson away from her, confined herself into that palace. The murders of her husband and her lover in each other hands in the massacre that took place in that palace some eighty years or so back made them shivered with fear when they heard even so long back that incident took place. The other rumor that the old woman had kept the dead bodies of her husband and lover in one of the upstairs locked rooms in that palace created lot of fear in their hearts even they did not know whether it was true or not. But they could not dare to open the doors of that room because of fear. It was not just all the negative in that palace. The attitude of the girl Sameera, who had lot of anger and hate on her parents, changed dramatically after entering into that palace. Situation turned out like that by the end she understood her parents and started loving them. Her anger and indifferent attitude towards Aravind also quite surprisingly changed into one strong love and she decided to marry him to which her parents happily agreed as they also liked Aravind a lot. Aravind, who also loved and liked Sameera and wanted to marry her, as well has changed and gave the promise that he would sure try to get rid of his addiction to shadow world. Anand, who tortured his wife for the small wrongs that she had committed at one time in the past, changed surprisingly and started loving her. The parents of Sunanda felt so happy as there has come such a good change in their son in law. All the misunderstandings cleared, disputes settled, they were all a happy union loving and liking one another by the end of the story. A suspense, romantic and psychological thriller with 1,07,815 words. Ten romantic and suspense thrillers of this author, ‘A Mansion Of Illusions’, ‘Across The River…Under The Bridge…’, ‘Chasing Butterflies’, ‘Rain Flower’, ‘Mystery Behind Suicide’, ‘The Village, Forest And An Old Mansion’ &lsqu",
  "genres": [],
  "author": "Kotra Siva Rama Krishna",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/52539702-a-mansion-of-illusions"
}