{
  "title": "Mercy for the Wicked",
  "description": "From Bestselling Paranormal Romance Author Lisa Olsen - Book Two of The Fallen\"How do you tell a guy you're being stalked by demons without sounding like a fruitcake? Even if he really cares about you, there's bound to be that moment when he looks at you like you're a total nutbar, right?\"Mercy is back, and in a world of trouble as factions from above and below vie for her attention, pulling her from the carefully constructed 'normalcy' of her life. After confessing all to boyfriend Ben, Mercy is counting on fallen angel Samael to help protect her while she deals with the sting of Adam's abandonment. But self control has never been Adam's strong suit. When Mercy is pursued from all sides, will Adam be able to resist playing the hero? Or will Mercy get tired of waiting and save herself? In the end, Mercy must decide, is the enemy of her enemy her friend? Or just a worse enemy?Editorial ReviewLisa Olsen turns up the heat with this sequel to Angel of Mercy. Mercy for the Wicked gets off to a running start, as we pick up right where the last book left off with Mercy finally filling in dependable boyfriend Detective Ben Gates on her trouble with angels. Of course she glosses over the fact that she's still secretly lusting over sexy, fallen angel Adam and we can count on Adam not to stay away for too long, despite his best intentions for keeping her safe. It's encouraging to see Mercy take more of an active role in her plight, no longer the damsel in distress. Mercy for the Wicked introduces a cast of new characters including fallen angel Azazael who wants to use Mercy to escape his dark prison, and a host of demons who kidnap Mercy for their own agenda. We find answers to many lingering questions left by Angel of Mercy, but just as many new ones surface for an eagerly awaited sequel.",
  "genres": [
    "Angels",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Urban Fantasy",
    "Contemporary"
  ],
  "author": "Lisa Olsen",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/12580051-mercy-for-the-wicked"
}