{
  "title": "The Vanishing at Loxby Manor",
  "description": "A story of second chances and secrets, this mysterious Regency romance will transport you to 19th-century England as one young lady reunites with her childhood love to find his missing sister. Her friend is missing.After five years abroad, Charity Halliwell finally returns to Loxby Manor, the home of dear friends--and her lost love. No longer a young girl, she is now haunted by a painful secret and the demise of her dreams. Instead of the healing and happiness she hopes to find, she encounters a darkness lurking in the shadows of the once-familiar house. When her friend, Seline, disappears the very night of her arrival, Charity is determined to uncover the truth. Her only hope is the man who broke her heart.Branded a coward, Piers Cavanaugh has lived the last five years as an outcast far from his family home. When his sister presumably elopes with a stable hand, Piers joins forces with an unlikely partner--the one woman he thought he'd never see again. Together they launch an investigation that leads to strange nightly meetings in the ruins of an old abbey and disturbing whispers of a secret organization. The more they learn, the more desperate the situation becomes.The house seems determined to keep its secrets.As they struggle to piece together the clues, Charity and Piers also endeavor to rebuild their friendship. One cryptic letter changed everything between them. To find happiness they will have to overcome the grief and shame keeping them apart. But first they must discover why Seline vanished and confront the growing fear that she may never return.Settle in, because once you start The Vanishing at Loxby Manor, you won't be able to put it down.Praise for The Vanishing at Loxby Manor \"Vanishing at Loxby Manor cleverly combines Regency romance with Gothic intrigue, and the result is a suspenseful, thoroughly entertaining read. Charming and lovely.\"--Tasha Alexander, New York Times bestselling author of In the Shadow of Vesuvius \"Abigail Wilson's latest Gothic romance hits the notes readers have come to expect from her talented romance, shadows and intrigue and a brilliantly executed atmosphere. She is a master at her craft and a rare stand-out in a popular genre.\"--Rachel McMillan, author of The London Restoration\"Weaving a shadow of mystery among the gilded countryside of Regency England, Wilson's tale of love lost, buried shame, and secret societies is a delicious blend of romance and intrigue. Splash in gorgeous historical Regency details, and murder brewing around every stone, and readers will be burning through the pages until the riveting end.\"--J'nell Ciesielski, author of The SocialiteSweet but mysterious Regency Romance with Gothic tonesA stand-alone novelBook approximately 90,000 wordsIncludes discussion questions for book clubs",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Romance",
    "Regency",
    "Historical",
    "Fiction",
    "Gothic"
  ],
  "author": "Abigail Wilson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/52540107-the-vanishing-at-loxby-manor"
}