{
  "title": "The Silence",
  "description": "Combining the emotional power and dual narrative style of Before We Were Yours with the nuanced, layered, and atmospheric mystery of The Dry, a powerful debut novel revolving around a shocking disappearance, two neighbor families, and shameful secrets from the past that refuse to stay buried. It is 1997, and in a basement flat in Hackney, Isla Green is awakened by a call in the middle of the night: her father phoning from Sydney.  30 years ago, in the suffocating heat of summer 1967, the Greens’ next-door neighbour Mandy disappeared. At the time, it was thought she had fled a broken marriage and gone to start a new life; but now Mandy’s family is trying to reconnect, and there is no trace of her. Isla’s father Joe was allegedly the last person to see her alive, and now he’s under suspicion of murder. Isla unwillingly plans to go back to Australia for the first time in a decade to support her father. The return to Sydney will plunge Isla deep into the past, to a quiet street by the sea where two couples live side by side. Isla’s parents, Louisa and Joe, have recently emigrated from England—a move that has left Louisa miserably homesick while Joe embraces this new life. Next door, Steve and Mandy are equally troubled. Mandy doesn’t want a baby, even though Steve—a cop trying to hold it together under the pressures of the job—is desperate to become a father.   The more Isla asks about the past, the more she learns: about both young couples and the secrets each marriage bore. Could her father be capable of doing something terrible? How much does her mother know? What will happen to their family if Isla’s worst fears are realized? And is there another secret in this community, one which goes deeper into Australia’s colonial past, which has held them in a conspiracy of silence?Deftly exploring the deterioration of relationships and the devastating truths we keep from those we love, The Silence is a stunning debut from a promising literary star.",
  "genres": [
    "Mystery",
    "Fiction",
    "Australia",
    "Thriller",
    "Crime",
    "Historical Fiction",
    "Audiobook"
  ],
  "author": "Susan  Allott",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/52518111-the-silence"
}