{
  "title": "What We Inherit: A Secret War and a Family's Search for Answers",
  "description": "In the wake of her mother’s death, Jessica Pearce Rotondi uncovers boxes of letters, declassified CIA reports, and newspaper clippings that bring to light a family ghost: her uncle Jack, who disappeared during the CIA-led Secret War in Laos in 1972. The letters lead her across Southeast Asia in search of the truth that has eluded her family for decades.In 1943, 19-year-old Edwin Pearce jumps from a burning B-17 bomber over Germany. Missing in action for months, his parents finally learn he is a prisoner of war in Stalag 17. Ed survives nearly three years in prison camp and a march across the Alps before returning home. Ed’s eldest son and namesake, Edwin “Jack,” follows his father into the Air Force. But on the night of March 29, 1972, Jack’s plane vanishes over the mountains bordering Vietnam and Ed’s past comes roaring into the present. \"What We Inherit\" is Rotondi’s story of her own hunt for answers as she retraces her grandfather’s 1973 path across Southeast Asia in search of his son. An excavation of inherited trauma on a personal and national scale, \"What We Inherit\" reveals the power of a father’s refusal to be silenced and a daughter’s quest to rediscover her voice in the wake of loss. As Rotondi nears the last known place Jack was seen alive, she grows closer to understanding the mystery that has haunted her family for generations—and the destructive impact of a family secret so big it encompassed an entire war. Praise for \"What We Inherit\":\"Jessica Pearce Rotondi brilliantly probes the mysteries of a secret war while simultaneously exploring the secrets of her own family, to give us a book about coming to terms with many kinds of loss. Exceptional.\"—Salman Rushdie, Booker Prize-winning author of \"Midnight's Children\"“A beautiful amalgam of memoir, travelogue, and investigative report that moves with the propulsive forward energy of a thriller. A haunting chronicle of loss and redemption.\" —Ron Chernow, Pulitzer Prize-winning author of \"Alexander Hamilton\" “'What We Inherit' is a strikingly original debut, a moving saga of love and grief that shows how world events reshaped three generations of one American family. Jessica Pearce Rotondi discovers that courage exists not only on battlefields, but even in the most ordinary kitchens.” —Kate Bolick, bestselling author of \"Spinster: Making a Life of One's Own\" “Written like a spy novel and delivered like a whistleblower’s account of government deception, I felt like I was holding my breath until the very last page... This book shook my deepest assumptions about America.\" —Sebastian Junger, award-winning author of \"The Perfect Storm\" \"An inspiring and revealing story of one family’s pursuit of the truth about their son.\" -Kirkus Reviews, STARRED REVIEW\"'What We Inherit' is a powerful book about how we make sense of unfathomable loss—and about the realization that all loss is unfathomable. In our current world, with so much war and pain, this is the book we need.\" —Eva Hagberg, author of \"How to Be Loved: A Memoir of Life-Saving Friendship\"  “A triumph of investigative family history. A skillful and lyrical retelling of a mystery discovered largely upon her mother's death, this book is a reminder of how the suffering that remains after war can haunt us for generations.” —Joel Whitney, author of \"Finks: How the CIA Tricked the World’s Best Writers\" and a founder of Guernica \"I devoured this book in one breathless gulp. A seamless blend of love, loss and legacy, this utterly gripping account of one woman's search to uncover a family mystery in the wake of her mother's death is at once heartbreaking and gorgeously hopeful. This is exactly the kind of compulsively-readable memoir I'm always hoping to find, but so rarely do.\" —Claire Bidwell Smith, author of \"The Rules of Inheritance\"\"In her powerful, heartbreaking, and gut-wrenching first book, Rotondi explains how in 2009, after her mother's death, she found boxes of files, newspaper clippings, and declassified CIA reports regarding her Uncle Jack and the family's search for him.\"—Booklist",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Biography",
    "Biography Memoir",
    "World War II",
    "War"
  ],
  "author": "Jessica Pearce Rotondi",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/52529654-what-we-inherit"
}