{
  "title": "Poems of a Spectrum-Autist",
  "description": "The term Spectrum-Autist is how I describe one who is diagnosed with Autism-Spectrum Disorder.  Since I do not think of Autism as a \"disorder, I prefer \"Spectrum-Autist.\"  Being a Spectrum-Autist is to live in the in-between.  In-between a typical person and a profound Autist.  The in-between is a difficult place to be.  People can see me both as normal and as strange.  At first meeting me, there are not obvious signs and people often assume that I am like conventional humans.  The more time they spend in conversation with me, however, that view can rapidly deteriorates, but they do not quite know why.  They often recognize introversion, though I have been told by other introverts that I am \"off the chart\" introverted.  For a while, \"painfully introverted\" suited me for a label.  It is quite literally painful, to be among a group of people, expected to interact, and also to be alone, unable to be the person that I want to be.  At times I thought that I would slip into deep autism, never to emerge.  Meanwhile, I somehow got through school, college, graduate school, and a doctorate.  I learned other languages as part of my educational requirements.  Autistic people are not supposed to be good at language, right?  It was only later that I discovered, with the help of a brilliant and compassionate psychologist, Doctor James Pallas, that I have (what was then called) Asperger's Syndrome.  \"What is that?\", I asked.  He first put it in simple terms.  \"You are a verbal-autistic.\"  A verbal autist.  Who knew?  He took me through the diagnostic criteria, and it explained so much of my life, my behavior, and the way that I express myself.Recently I reviewed poetry and prose that I had labored over across decades.  The Autism Spectrum Disorder glared back at me and I saw my work in a new light.  I offer the following collection all readers of poetry, but particularly those who seek to further understanding of the spectrum-autist mind and inner life. My autism has been a gift.  While I often fail to recognize what typical humans recognize without effort, I have also found the transverse to be true.  I have the ability to peer deeply and interpret uniquely.  Because it can be a gift (to the point that some of us are called \"savants\"), I think of ourselves as being of an \"alternative order\" rather than as having a \"dis-order.\"  Though it is a mistake to assume we are all savants, which tends to be the image most portrayed on television.",
  "genres": [],
  "author": "Marcus  Holmes",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/52524575-poems-of-a-spectrum-autist"
}