{
  "title": "Four Countries One Life",
  "description": "This story is about a girl born in the city of Kiev in the Soviet Union. She lives as one of fourteen relatives in the tightness of a four-room apartment. We meet Lilli at age four. Her mother is sick a lot, having numerous surgeries over the years. Her father is working at home, making goods from leather hides to supplement his meager legitimate salary. It's punishable by prison sentence if he's caught. The little girl knows that they are a Jewish family and when she is outside playing with other kids she learns that being Jewish is bad. Does it mean that she is bad as well?  Her dad is strict with her mischievous brother whom she adores and their conflicts tear her up. She starts school but to study isn't easy, her head is full with the problems going on at home. Lilli turns eighteen. She graduates high school and goes to work at the first job that finds her. Her mother dies. Lilli is bitter; she blames her dad. He was a poor husband to her long-suffering mother. Between her mother's death and one boring job after another, Lilli's life isn't worthwhile. She meets Sergey and when a week later he proposes, she believes that her life is anchored at last. But that is not to be.  Their beautiful son is born and without giving the young mother any respite, her husband and his parents convince her that they all should immigrate to Israel. Confused and outraged, not given a choice, Lilli follows their decision. Her father stays behind in Kiev. Lilli loves Israel, but here once again, she is being moved away.  First it's to Brussels, Belgium to await the American visas and then, pregnant with her second boy, to the USA. There are plenty of would-be happy moments in Lilli's life, but she can't shed the dread which is as much part of her being as any of her organs. At one point she is on the brink of going mad. She goes to the Subway, planning to cut a hanging thread from a woman's coat. She runs out from the train station but can't run away from the truth — she needs help.  Lilli gets better with a therapy, and travels to Kiev after her beloved brother dies. Only then and there, does she realize that she is OK and doesn't need her parents' or brother's approval. She is a survivor.",
  "genres": [],
  "author": "Lydia Cutler",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/52535041-four-countries-one-life"
}