{
  "title": "PMO Governance: Practical Strategies to Govern Portfolio, Program, and Project Delivery",
  "description": "A practical guide to maximize your benefits, and improve delivery of your corporate strategy!  To stay competitive, companies need not only forward-thinking vision, but to effectively execute that vision. In this book, Eugen Spivak focuses on excellence in execution of corporate initiatives and serves as a strategic partner for establishing, improving, and running world-class PMO.  The book is written from a business-transformation perspective, offering an abundance of specific recommendations, extraordinarily practical tips, and effective advice on establishing and improving Project Management Office. In addition to counsel on the setup of PMO, the book features real-world examples extracted from the more than a hundred initiatives Eugen has carried out. Further, the book highlights the practical tips on how to improve delivery of portfolios, programs, and projects, and thus offers a range of time-tested best practices for managing portfolios, programs, and projects.  Using PMO Governance as a guide, you will receive:  • Proven techniques to improve execution of your corporate strategy. • An effective approach for streamlining decision-making, transparency, and oversight. • Proactive insights about all the areas that make PMO successful. • Handy tips for how to spot delivery problems and what to do about them. • Efficient techniques for better running your portfolios, programs, and projects. • Guidelines to managing different types of programs and projects, including megaprojects. • Practical recommendations for making you a more effective leader.  By applying principles in this book, your organization will improve maturity of its governance and achieve more desired performance results for the portfolio of program and projects it runs.",
  "genres": [
    "Business",
    "Nonfiction",
    "Economics"
  ],
  "author": "Eugen Spivak",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/52521517-pmo-governance"
}