{
  "title": "The Way We Live Now",
  "description": "The Way We Live Now, by Anthony Trollope, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. Ruthless greed, relentless self-promotion, corporate swindles and scandals on a grand scale—indeed this sounds like “the way we live now.” Though Anthony Trollope’s title actually refers to 1870s England, his scathing satire of a money-mad culture cuts close to the contemporary bone. At its center stands Augustus Melmotte, a crooked financier whose enormous schemes ensnare an array of avaricious aristocrats, politicians, and “important people.” Among them are Lady Carbury, who earns the family bread by churning out fatuous potboilers (as did Trollope’s mother) and her spendthrift, ne'er-do-well son, Felix, who sets his sights on Melmotte’s dangerously beautiful daughter, Marie. Meanwhile, Felix’s sister, Hetta, falls for Melmotte’s partner, Paul, who’s encumbered with an American fiancée, herself a widow who may have shot her husband. As the frauds expand and the romantic entanglements grow ever more complex, Trollope revels in the antics of his characters while pillorying the corruption of their morally bankrupt society. Nathaniel Hawthorne said it best, praising Trollope for putting England “under a glass case, with all its inhabitants going about their daily business, and not suspecting that they were made a show of.” Karen Odden received her M.A. from the University of Michigan-Ann Arbor and her Ph.D. in English literature from New York University. Her dissertation on the medical, legal, and literary discourses that surrounded Victorian railway disasters discusses works by Trollope and his contemporaries, Wilkie Collins, Charles Dickens, M. E. Braddon, and Mrs. Henry Wood. Chapters and articles have appeared in books of literary criticism, anthologies, the Journal of Victorian Culture, and Studies in the Novel; she has taught at the University of Michigan, New York University, and University of Wisconsin-Milwaukee. Currently a freelance writer and assistant editor for Victorian Literature and Culture, she resides in Arizona with her husband and two children.",
  "genres": [
    "Classics",
    "Fiction",
    "Victorian",
    "19th Century",
    "Literature",
    "Novels",
    "British Literature"
  ],
  "author": "Anthony Trollope",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/525642.The_Way_We_Live_Now"
}