{
  "title": "Half",
  "description": "What if two people were so close they shared everything? Paula and Artis are thirty-year-old identical twins who speak in one voice--until they can't anymore. Their father's sudden death threatens their uncanny bond. Growing up, they believed he possessed magical powers, but they also lived in fear of him. At his funeral, they retrace their early life., one year at a time. Will they find their way back to each other? Or finally discover the singularity of their true selves?Written in spare, lyrical prose, Half is an achingly beautiful story of intimacy and loss, revealing the complexity—and cost—of sharing your life entirely with someone else. Sharon Harrigan deftly explores how fierce love can also be the very thing that leads to heartbreak and betrayal.“Fans of Jeffrey Eugenides, Andre Dubus III, and Jane Smiley will adore Harrigan’s suspenseful, lyrical, and consuming exploration of two difficult lives, intertwined. The adjective \"haunting\" can be overused to describe dynamic and poignant literary fiction, but it couldn’t be more fitting here. Raw and powerful, Half will stay with you.” ─Booklist STARRED review “Harrigan’s bold stylistic choices and memorable voice lend the novel a sense of mystery and magic, well suited to the themes of childhood fears and adult disillusionment. Riveting and inventive, this is a cut above the average coming of age tale.” ─Publishers Weekly “Gripping … Harrigan’s novel will leave you eagerly turning pages to discover what happens next.” ─ForeWord Reviews“Half is a bright and inventive novel like no other. I was swept away, mesmerized, pulled into the conspiracy that is twindom, with its exquisite sweetness and cruelty. The mystery that propels the story forward artfully reflects the mystery of twindom itself.”—Bonnie Jo Campbell, author of Mothers Tell Your Daughters“I loved this book. I couldn’t put it down. In its (nearly) collective narration by sisters, Half reminds me of Jeffrey Eugenides’s The Virgin Suicides, but the story is dazzling, startling, and fresh. Half proves irresistible page after lyrical page.”—Jesse Lee Kercheval, author of Underground Women“Innovative and inventive, this novel does the impossible. It makes us believe two people can be so close they are virtually the same person. Harrigan’s magic trick is so convincing that when the twins lose their bond, we feel ourselves being broken in half too.”—Bret Anthony Johnston, author of Remember Me Like This",
  "genres": [
    "Fiction",
    "Novels",
    "Contemporary"
  ],
  "author": "Sharon Harrigan",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/52564617-half"
}