{
  "title": "L'Exploration du monde - Une autre histoire des Grandes Découvertes",
  "description": "Voici une histoire par dates du VIIe au XXe siècle, riche en surprises, qui rend compte des profonds renouvellements qui ont transformé notre vision de ce qu'on appelait autrefois les \" Grandes Découvertes \". Les dates \" canoniques \", revisitées à l'aune d'une réflexion critique sur les raisons de leur élection par les chronologies officielles, alternent avec les dates \" décalées \" qui font surgir des paysages et des personnages méconnus. Il est ici question de détricoter le discours qui, associant exploration du monde et \" entrée dans la modernité \", en réserve le privilège et le bénéfice à l'Europe, et, pour ce faire, de documenter d'autres voyages au long cours – extra-européens. Il est également question, prenant le contre-pied d'une histoire héroïque des expéditions lointaines qui en attribue le mérite à quelques singularités, de rappeler qu'il faut beaucoup d'illusions, et plus encore d'intérêts, pour faire un \" rêve \", et que Christophe Colomb n'aurait jamais appareillé sans les vaisseaux des frères Pinzón. Il s'agit ainsi de substituer des lieux, des instants et des visages aux cultures en carton-pâte et aux croyances en papier mâché ; de donner à voir les échecs autant que les réussites, les naufrages dans les estuaires de la même façon que les entrées triomphales dans les cités soumises ; d'inclure amiraux ottomans, navigateurs chinois, interprètes nahuatls et pilotes arabes dans le musée imaginaire de l'histoire globale ; de mettre en lumière tout un petit peuple d'assistants et d'auxiliaires, de sherpas et de supplétifs (que serait Magellan sans le Malais Enrique ? ou Cortés sans la Malinche ?) ; de passer outre une histoire au masculin en rendant droit de cité aux voyageuses et aux exploratrices ; et enfin de prêter une égale attention aux êtres et aux choses, sachant que, s'il faut une nef pour traverser un océan, une vague ou un bacille suffisent à la vider de ses occupants. Ce sont donc à la fois une autre histoire du monde et une autre histoire de l'Europe qui se dévoilent au fil des 90 récits d'aventures proposés par 80 des meilleurs historiennes et historiens de ces questions.   Directeur d'ouvrage : Romain Bertrand est directeur de recherche au CERI (Sciences Po-CNRS). ​Coordination : Hélène Blais est professeure d'histoire contemporaine à l'École normale supérieure de la rue d'Ulm ; Guillaume Calafat est maître de conférences en histoire moderne à l'Université Paris 1 Panthéon-Sorbonne (IHMC) ; Isabelle Heullant-Donat est professeure d'histoire du Moyen Âge à l'Université de Reims Champagne-Ardenne.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Various",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/52559951-l-exploration-du-monde---une-autre-histoire-des-grandes-d-couvertes"
}