{
  "title": "Days of Steel Rain: The Epic Story of a WWII Vengeance Ship in the Year of the Kamikaze",
  "description": "An intimate true account of Americans at war, Days of Steel Rain is an epic drama about an unlikely group of men forced to work together in the face of an increasingly desperate enemy during the final year of World War II.Sprawling across the Pacific, this untold story follows the crew of the newly-built \"vengeance ship\" USS Astoria, named after her sunken predecessor lost earlier in the war. At its center lies U.S. Navy Captain George Dyer, who vowed to return to action after suffering a horrific wound. He accepted the ship's command in 1944, knowing it would be his last chance to avenge his injuries and salvage his career. Yet with the nation's resources and personnel stretched thin by the war, he found that just getting the ship into action would prove to be a battle.Tensions among the crew flared from the start. Astoria's sailors and Marines were a collection of replacements, retreads, and older men. Some were broken by previous traumatic combat, most had no desire to be in the war, yet all found themselves fighting an enemy more afraid of surrender than death.The reluctant ship was called to respond to challenges that its men never could have anticipated. From a typhoon where the ocean was enemy to daring rescue missions in the Philippines, a gallant turn at Iwo Jima, and the ultimate crucible against the Kamikaze at Okinawa, they endured the worst of the final year of the war at sea.Days of Steel Rain brings to life more than a decade of research and firsthand interviews, depicting with unprecedented insight the singular drama of a captain grappling with a prospective mutiny amidst some of the most brutal fighting of World War II. Throughout, Brent Jones fills the narrative with secret diaries, memoirs, letters, interpersonal conflicts, and the innermost thoughts of the Astoria men. Days of Steel Rain weaves an intimate, unforgettable portrait of leadership, heroism, endurance, and redemption.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Naval History",
    "Military Fiction",
    "American History"
  ],
  "author": "Brent E. Jones",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/52588559-days-of-steel-rain"
}