{
  "title": "We Were Dreamers: An Immigrant Superhero Origin Story",
  "description": "Marvel's newest recruit shares his own inspiring and unexpected origin story, from China to the bright lights of Hollywood. An immigrant who battles everything from parental expectations to cultural stereotypes, Simu Liu struggles to forge a path for himself, rising from the ashes of a failed accounting career (yes, you read that right) to become Shang-Chi.Our story begins in the city of Harbin, where Simu's parents have left him in the care of his grandparents while they seek to build a future for themselves in Canada. One day, a mysterious stranger shows up at the door; it's Simu's father, who whisks him away from the only home he had ever known and to the land of opportunity and maple syrup.  Life in the new world, however, is not all that it was cracked up to be; Simu's new guardians lack the gentle touch of his grandparents, resulting in harsh words and hurt feelings. His parents, on the other hand, find their new son emotionally distant and difficult to relate to - although they are related by blood, they are separated by culture, language, and values.  As Simu grows up, he plays the part of the pious son well; he gets A's, crushes national math competitions, and makes his parents proud. But as time goes on, he grows increasingly disillusioned with the expectations placed on his shoulders, and finds it harder and harder to keep up the charade.  Barely a year out of college, his life hits rock bottom when he is laid off from his first job as an accountant. Unemployed, riddled with shame and with nothing left to lose, Simu finds an ad on Craigslist that will send him on a wildly unexpected journey, into the mysterious world of show business.  Through a swath of rejections and comical mishaps, it is ultimately Simu's determination to carve out a path for himself that leads him to not only succeed as an actor, but also open the door to reconciling with his parents. After all, the courage to pursue his ambitions at all costs is something that he inherited from his parents, who themselves defied impossible odds in order to come to Canada. We Were Dreamers is more than a celebrity memoir - it's a story about growing up between cultures, finding your family, and becoming the master of your own extraordinary circumstance.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Biography",
    "Autobiography",
    "Biography Memoir",
    "Canada"
  ],
  "author": "Simu Liu",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/52582665-we-were-dreamers"
}