{
  "title": "Waging Peace in Vietnam: Us Soldiers and Veterans Who Opposed the War",
  "description": "How American soldiers opposed and resisted the war in VietnamWhile mainstream narratives of the Vietnam War all but marginalize anti-war activity of soldiers, opposition and resistance from within the three branches of the military made a real difference to the course of America’s engagement in Vietnam. By 1968, every major peace march in the United States was led by active duty GIs and Vietnam War veterans. By 1970, thousands of active duty soldiers and marines were marching in protest in US cities. Hundreds of soldiers and marines in Vietnam were refusing to fight; tens of thousands were deserting to Canada, France and Sweden. Eventually the US Armed Forces were no longer able to sustain large-scale offensive operations and ceased to be effective. Yet this history is largely unknown and has been glossed over in much of the written and visual remembrances produced in recent years.Waging Peace in Vietnam shows how the GI movement unfolded, from the numerous anti-war coffee houses springing up outside military bases, to the hundreds of GI newspapers giving an independent voice to active soldiers, to the stockade revolts and the strikes and near-mutinies on naval vessels and in the air force. The book presents first-hand accounts, oral histories, and a wealth of underground newspapers, posters, flyers, and photographs documenting the actions of GIs and veterans who took part in the resistance. In addition, the book features fourteen original essays by leading scholars and activists. Notable contributors include Vietnam War scholar and author, Christian Appy, and Mme Nguyen Thi Binh, who played a major role in the Paris Peace Accord.The book originates from the exhibition Waging Peace , which has been shown in Vietnam and the University of Notre Dame, and will be touring the eastern United States in conjunction with book launches in Boston, Amherst, and New York.",
  "genres": [
    "Politics",
    "Social Justice"
  ],
  "author": "Ron Carver",
  "average_rating": "4.90",
  "url": "https://www.goodreads.com/book/show/52579808-waging-peace-in-vietnam"
}