{
  "title": "Ancient Memories",
  "description": "Taylor Hardin and her daughter lived an idyllic life on a farm in the beautiful Shenandoah Valley of Virginia. She was a newly discovered landscape artist, her paintings suddenly in demand and regularly on display at one of Washington DC's most exclusive galleries. Her name was becoming a household word throughout the art world and, most of all, her paintings regularly sold for thousands of dollars. The newly found fame and money allowed Taylor to live happily with her 14-year-old daughter, Diana.Her life was perfect.Then it changed forever.An elderly couple, who lived in the countryside near her home, was found dead in their homes, massacred by a bloody knife. A chill ripped up her spine when she learned of the killings, because this was second double murder in less than a week.In the next few days her life became a nightmare. The murders continued. Aserial killer was in her hometown. Worst of all, all of the killings seemed centered around her farm. Her daughter was frightened. The two of them were being ripped apart by suspicions, anger and a stranger who suddenly appeared at the base of a nearby mountain and watched their farm from a distance.For reasons she could not comprehend, Taylor found herself a suspect in the murders. The Chief Deputy Sheriff was certain she was guilty, while only an FBI agent from outside the community believed there was more to this case than any person could fathom. He knew this serial killer had killed before and begun killing again after a forty-year hiatus. Never in the history of the FBI had a serial killer committed multiple murders in one decade, disappeared for over forty years, then appeared again half a continent away and nearly half a century later to resume killing. This was an impossible scenario and he knew it. If it were true, this community had a geriatric serial killer who was targeting the elderly. But there was something else that only he knew, something he could not reveal to anyone - not even the local police. The secret was something that could not possibly be true, unless the entire world of science was completely wrong.During the investigation Taylor found her life revealed and ripped her life, her being, her very soul was peeled away one layer at a time until all that was left was an ancient memory that would rip the happiness out of her life, dash it against the rocks scattered in the sands of time, and wash her peace away, much as the sand on the seashore is washed away into the bottom of the sea and lost forever.",
  "genres": [
    "Suspense",
    "Fiction"
  ],
  "author": "Youngblood Hawke",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/12581260-ancient-memories"
}