{
  "title": "Humor, Seriously: Why Humor Is a Secret Weapon in Business and Life",
  "description": "Anyone--even you!--can learn how to harness the power of humor in business (and life), based on the popular class at Stanford's Graduate School of Business.Working professionals have fallen off a humor cliff. In fact, around the time we enter the workforce, the number of times we laugh and smile on an average day statistically starts to plummet.And yet, research shows that humor is one of the most powerful tools we have for accomplishing serious work. Studies reveal that humor makes us appear more competent and confident, strengthens relationships, unlocks creativity, and boosts our resilience during difficult times. Plus, it fends off a permanent and unsightly frown known as \"resting boss face\".Top executives are in on the secret: 98 percent prefer employees with a sense of humor, and 84 percent believe that these employees do better work. But even for those who intuitively understand humor's power, few know how to wield it with intention. As a result, humor is vastly underleveraged in most workplaces today, impacting our performance, relationships, and health.That's why Jennifer Aaker and Naomi Bagdonas teach the popular course Humor: Serious Business at the Stanford Graduate School of Business, where they help some of the world's most hard-driving, blazer-wearing business minds build levity into their organizations and lives. In Humor, Seriously, they draw on findings by behavioral scientists, world-class comedians, and inspiring business leaders to reveal how humor works and--more important--how you can use it more often and effectivelyAaker and Bagdonas unpack the theory and application of humor: what makes something funny and how to mine your life for material. They show how to use humor to make a strong first impression, deliver difficult feedback, persuade and motivate others, and foster cultures where levity and creativity can thrive--not to mention, how to keep it appropriate and recover if you cross a line.President Dwight David Eisenhower once said, \"A sense of humor is part of the art of leadership, of getting along with people, of getting things done.\" If Eisenhower, the second least naturally funny president ever (after Franklin Pierce), thought humor was necessary to win wars, build highways, and warn against the military-industrial complex, then you might consider learning it too.Seriously.",
  "genres": [
    "Business",
    "Nonfiction",
    "Humor",
    "Self Help",
    "Psychology",
    "Leadership",
    "Personal Development"
  ],
  "author": "Jennifer Aaker",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/52578860-humor-seriously"
}