{
  "title": "The Influence of Soros: Politics, Power, and the Struggle for an Open Society",
  "description": "A seasoned journalist probes one of the right-wing’s favorite targets, Hungarian-American investor and philanthropist George Soros, to explore the genesis of his influence and the truth of the conspiracies that surround him.For years, hedge fund tycoon George Soros has been demonized by GOP politicians, fringe outlets, and right-wing media personalities, who claim Soros often manipulates the global economy and masterminds the radical left. He has been accused of using his billions to foment violence, support “white genocide,” and pay migrants to seek asylum in the United States. Right-wing media personalities have described him as working to hijack our democracy and undermine sovereignty. Left-leaning outlets, meanwhile, have suggested that his philanthropy is a distraction from the economic misery he himself has made. But who is George Soros? How did he make his money? What causes does he actually support? How did this billionaire become the right’s favorite target—used by elected officials sympathetic to the idea that their country’s opposition can be blamed on one man in the endless messaging war? How much of the hatred is driven by rising antisemitism? Though his name appears often in the media, most people know little about Soros. Weaving biography, cultural commentary, and investigative reporting, Emily Tamkin brings into focus the man and his myth to examine how much influence he actually has on politics. Is Soros simply a left-wing version of the Koch brothers? Or is he genuinely trying to make the world a better place? The Influence of Soros offers an understanding of the man and his money, his contributions and donations, and his true sway over our politics, elections, and our societies. Ultimately, Tamkin asks, can a truly open society exist if any one man can have the kind of power Soros wields?",
  "genres": [
    "Politics",
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Audiobook",
    "Antisemitism"
  ],
  "author": "Emily Tamkin",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/52585214-the-influence-of-soros"
}