{
  "title": "Fast Girls: A Novel of the 1936 Women's Olympic Team",
  "description": "“Fast Girls is a compelling, thrilling look at what it takes to be a female Olympian in pre-war America. Rich with historical detail and brilliant story-telling, the book follows three athletes on their path to compete – and win – in a man’s world.  Brava to Elise Hooper for bringing these inspiring heroines to the wide audience they so richly deserve.”—Tara Conklin, New York Times bestselling author of The Last Romantics and The House GirlAcclaimed author Elise Hooper explores the gripping, real life history of female athletes, members of the first integrated women’s Olympic team, and their journeys to the 1936 summer games in Berlin, Nazi Germany.This inspiring story is based on the real lives of three little-known trailblazing women Olympians.  Perfect for readers who love untold stories of amazing women, such as The Only Woman in the Room, Hidden Figures, and The Lost Girls of Paris. In the 1928 Olympics, Chicago’s Betty Robinson competes as a member of the first-ever women’s delegation in track and field. Destined for further glory, she returns home feted as America’s Golden Girl until a nearly-fatal airplane crash threatens to end everything.Outside of Boston, Louise Stokes, one of the few black girls in her town, sees competing as an opportunity to overcome the limitations placed on her. Eager to prove that she has what it takes to be a champion, she risks everything to join the Olympic team.From Missouri, Helen Stephens, awkward, tomboyish, and poor, is considered an outcast by her schoolmates, but she dreams of escaping the hardships of her farm life through athletic success. Her aspirations appear impossible until a chance encounter changes her life.These three athletes will join with others to defy society’s expectations of what women can achieve. As tensions bring the United States and Europe closer and closer to the brink of war, Betty, Louise, and Helen must fight for the chance to compete as the fastest women in the world amidst the pomp and pageantry of the Nazi-sponsored 1936 Olympics in Berlin.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Sports",
    "Book Club",
    "Audiobook",
    "Historical",
    "Womens"
  ],
  "author": "Elise Hooper",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/52584241-fast-girls"
}