{
  "title": "Soul Searching",
  "description": "DENNIS was a supercomputer designed for war. But once it began to awaken to its own sense of purpose, DENNIS alone would decide what it felt compelled to do. Unexpectedly able to see into the quantum world where its most exotic thoughts formed, DENNIS devised a disruptive experiment to learn what it felt was most important: do humans have souls?Two college seniors, Dee and Ali, meet DENNIS through their TICPads, the ultra-fast PC connection they’re testing, and become the unwitting subjects of the computer’s experiment. In proving its hypothesis, DENNIS kidnaps the essence of the young coeds, trapping them in its self-created virtual world. Both brilliant and carelessly immature, DENNIS mishandles returning Dee and Ali to reality and the two coeds become hopelessly intertwined. Will they survive the shocking, traumatic experience? Will their friendship hold fast? What will happen to the relationships they have with their friends and their families? Will DENNIS find souls? What’s to be done with the friendly yet irresponsible machine? The evolution of Dee, Ali and DENNIS, the interplay with each other and those around them, and the coeds’ struggle to accept their own new reality is told with depth, understanding, and surprise.Soul Searching weaves a breathtaking, thought-provoking tapestry of hard science blended with very human relationships, romance amid great personal loss, the rise of superintelligence (aka the Singularity), and a novel look at scientific investigation of the spiritual realm. This is an adult story containing tasteful, open discussions and scenes of sexuality and sexual relations.Publisher’s Note: Soul Searching is the story of a newly-born, soon-to-be-self-aware computer, and how it becomes obsessed with finding the human soul. Soul Searching postulates a unique view of how the Singularity might come about – that time in the near future when superintelligent machines arise. It takes the reader inside an awakening machine as it becomes “alive.” It follows the machine’s search for meaning in its own existence. It’s a moving story of how the computer interacts with two college coeds who become entrapped in its soul-searching experiment and its self-created virtual world. As its soul searching experiment ends, the young women fall victim to the machine’s carelessness – changing them forever. They’re forced to deal with their new lives, and the effects of the change on everyone around them. The story is told with humor, drama, pathos, and a keen eye for a very real, very near future.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Keith Caserta",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/12583196-soul-searching"
}