{
  "title": "The Long Game: China's Grand Strategy to Displace American Order",
  "description": "For more than a century, no US adversary or coalition of adversaries - not Nazi Germany, Imperial Japan, or the Soviet Union - has ever reached sixty percent of US GDP. China is the sole exception, and it is fast emerging into a global superpower that could rival, if not eclipse, the UnitedStates. What does China want, does it have a grand strategy to achieve it, and what should the United States do about it?In The Long Game, Rush Doshi draws from a rich base of Chinese primary sources, including decades worth of party documents, leaked materials, memoirs by party leaders, and a careful analysis of China's conduct to provide a history of China's grand strategy since the end of the Cold War. Takingreaders behind the Party's closed doors, he uncovers Beijing's long, methodical game to displace America from its hegemonic position in both the East Asia regional and global orders through three sequential strategies of displacement. Beginning in the 1980s, China focused for two decades onhiding capabilities and biding time. After the 2008 Global Financial Crisis, it became more assertive regionally, following a policy of actively accomplishing something. Finally, in the aftermath populist elections of 2016, China shifted to an even more aggressive strategy for undermining UShegemony, adopting the phrase great changes unseen in century. After charting how China's long game has evolved, Doshi offers a comprehensive yet asymmetric plan for an effective US response. Ironically, his proposed approach takes a page from Beijing's own strategic playbook to undermine China'sambitions and strengthen American order without competing dollar-for-dollar, ship-for-ship, or loan-for-loan.",
  "genres": [
    "China",
    "Politics",
    "History",
    "Nonfiction",
    "International Relations",
    "Economics",
    "Political Science"
  ],
  "author": "Rush Doshi",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/52617647-the-long-game"
}