{
  "title": "The Incredible Winston Browne",
  "description": "Beloved writer Sean Dietrich—also known as Sean of the South—will warm your heart with this rich and nostalgic tale of a small-town sheriff, a mysterious little girl, and a good-hearted community pulling together to help her.Folks in Moab live for ice cream socials, baseball, and the local paper’s weekly gossip column. For decades, Sheriff Winston Browne has watched over Moab with a generous eye, and by now he’s used to handling the daily dramas that keep life interesting for Moab’s quirky residents.But just after Winston receives some terrible, life-altering news, a seemingly mute runaway with no clear origin arrives in Moab.  The residents do what they believe is right and take her in—until two suspicious strangers arrive and begin looking for her. Suddenly Winston has a child in desperate need of protection—as well as a secret of his own to keep.With the help of Moab’s goodhearted townsfolk, the humble and well-meaning Winston Browne still has some heroic things to do. He finds romance, family, and love in unexpected places. He stumbles upon adventure, searches his soul, and grapples with the past. In doing so, he just might discover what a life well-lived truly looks like.Sometimes ordinary people do the most extraordinary things of all.Praise for the Incredible Winston Browne:“Sean Dietrich has written a home run of a novel with The Incredible Winston Browne. Every bit as wonderful as its title implies, it’s the story of Browne—a principled, baseball-loving sheriff—a precocious little girl in need of help, and the community that rallies around them. This warm, witty, tender novel celebrates the power of friendship and family to transform our lives. It left me nostalgic and hopeful, missing my grandfathers, and eager for baseball season to start again. I loved it.” —Ariel Lawhon, New York Times bestselling author of I Was Anastasia“Make no mistake. [The Incredible Winston Browne] is a classic story, told by an expert storyteller.” —Shawn Smucker, author of Light from Distant StarsStand-alone historical novel set in the 1950sIncludes discussion questions for book clubsAlso from Sean Dietrich: Stars of Alabama",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Audiobook",
    "Mystery",
    "Humor",
    "Southern"
  ],
  "author": "Sean Dietrich",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/52610674-the-incredible-winston-browne"
}