{
  "title": "Becoming My Daddy: First Impressions",
  "description": "How could he talk to her like that? And why did she like it so much? The reviews are in! \"What a Sensuous Book!\" \"Highly Arousing!\" \"I want to be Mr. Edwards!\" \"Do you like the spankings, Abigail?” Mr. Edwards asked. “No!” Abby hissed her answer quickly. “No sir, Abigail. Don’t forget how to address me.” “No sir. It hurts,” she said, still through gritted teeth. “Don’t lie to me Abigail. You can never lie to me or we will most certainly need to part ways. Did you like it when I spanked you?” Abby was silent for a moment as she processed what was happening. “Yes sir,” she said, feeling as though her body was betraying everything she had believed about herself. “Good girl, Abigail.” Graduation seems like it was just yesterday and the summer is slipping away, but Abby agrees to babysit for her father's boss on Friday night. She would rather not, but the money is good and it is just a one time arrangement. Abby is used to getting a lot of attention and enjoys seeing men respond to her youth and beauty, but she could not have prepared herself for Mr. Edwards. He has a confidence about him like no one she has ever met, and even when he talks down to her she finds herself craving more! Her night in his house ends up being full of surprises and she is left with a lot to think, and dream about when she finally makes it home. Abby needs him to become her daddy! Alan Austin is a national award winning author now writing erotic fiction under a new pen name and outside of his established publication outlet in order to delve into some of his deepest desires and fantasies. Alan and his wife are both authors who enjoy the wilder side of life and leverage some of their own experiences along with a healthy dose of imagination to heat things up in their writing. Alan is a mid-thirties family man from the Midwest United States with an amazing wife and the best kids in the world. He enjoys working out and reading when he has time between family activities and writing. Alan grew up on the west coast before moving his family inland to make a home for himself. He is an active volunteer in his community and loves serving others. Alan and his wife enjoy sharing their wildest fantasies and he uses his short stories as vehicle to share them with others. It is his hope that his short stories can bring some excitement to others!",
  "genres": [],
  "author": "Alan   Austin",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/52635117-becoming-my-daddy"
}