{
  "title": "Post York",
  "description": "Set in New York City after the melting of the polar ice caps, an independent loner along with his cat and only friend, navigates the flooded city as he tries to live another day.Each morning he sails in search of food, crossing paths with others from this makeshift community--from outsiders like himself to the depraved and ruthless elite--all struggling to maintain a sense of normalcy in a city drowned in its past.But everything changes when he encounters both a mysterious woman and a trapped blue whale. Will they be each other's salvation . . . or destruction?An eco-fiction fable of epic proportions, POST YORK is an expansion of the Eisner nominated one-shot, and includes an environmental fact sheet, and other bonus material.JAMES ROMBERGER is an Eisner-nominated cartoonist, fine artist and artist of the graphic novels 7 Miles a Second , The Late Child and Other Animals , Bronx Kill and Aaron and Ahmed .\"James Romberger...is in the highest horror-comics tradition.\"--The New York Times Book Review\"Romberger's art is a fine version of bony realism - his figures are so casually realistic, you can almost see the joints moving.\"--Entertainment Weekly\"James Romberger's Post York is a set of three alluvial nightmares that talk about what small changes can do in the New York we are heading to all too quickly. It makes one aspect of climate change distressingly real... it's good to see a fine artist drawing about it seriously.\"--Samuel R. Delany, Dhalgren and Through the Valley of the Nest of Spiders\"Told in a brutal use of light and shadow, this desolate tale of post-apocalypse sucker-punches you with...of all things...hope.\"-- Matt Kindt, Bang! , Ether , Dept.H\" Post York casts deep human drama against an epic canvas with wonderful artwork by James Romberger. Highy recommended.\"--Jeff Lemire, Sweet Tooth , Black Hammer and Old Man Logan\"( Post York is) beautiful on multiple levels. It shouldn't be this rare to see sequential art be so precise and open-hearted at the same time. We also shouldn't be seeing this world burn and drown, but here we are.\"--Ales Kot, Zero, Winter Soldier and Material",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Horror",
    "Comics Manga"
  ],
  "author": "James Romberger",
  "average_rating": "2.57",
  "url": "https://www.goodreads.com/book/show/52636290-post-york"
}