{
  "title": "The Hindus: An Alternative History",
  "description": "From one of the world's foremost scholars on Hinduism, a vivid reinterpretation of its historyAn engrossing and definitive narrative account of history and myth that offers a new way of understanding one of the world's oldest major religions, The Hindus elucidates the relationship between recorded history and imaginary worlds.Hinduism does not lend itself easily to a strictly chronological account: many of its central texts cannot be reliably dated even within a century; its central tenets—karma, dharma, to name just two—arise at particular moments in Indian history and differ in each era, between genders, and caste to caste; and what is shared among Hindus is overwhelmingly outnumbered by the things that are unique to one group or another. Yet the greatness of Hinduism—its vitality, its earthiness, its vividness—lies precisely in many of those idiosyncratic qualities that continue to inspire debate today.Wendy Doniger is one of the foremost scholars of Hinduism in the world. With her inimitable insight and expertise Doniger illuminates those moments within the tradition that resist forces that would standardize or establish a canon. Without reversing or misrepresenting the historical hierarchies, she reveals how Sanskrit and vernacular sources are rich in knowledge of and compassion toward women and lower castes; how they debate tensions surrounding religion, violence, and tolerance; and how animals are the key to important shifts in attitudes toward different social classes.The Hindus brings a fascinating multiplicity of actors and stories to the stage to show how brilliant and creative thinkers—many of them far removed from Brahmin authors of Sanskrit texts—have kept Hinduism alive in ways that other scholars have not fully explored. In this unique and authoritative account, debates about Hindu traditions become platforms from which to consider the ironies, and overlooked epiphanies, of history.",
  "genres": [
    "History",
    "Religion",
    "India",
    "Nonfiction",
    "Hinduism",
    "Philosophy",
    "Indian Literature"
  ],
  "author": "Wendy Doniger",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/5263037-the-hindus"
}