{
  "title": "Basic Life Support",
  "description": "Features • Complies with the latest AHA guidelines • Covers adult, child, and infant CPR • Subjects include 1 and 2 rescuer CPR, AED Defibrillators & Airway Management • Effective, user-friendly and adapted for Kindle • Review Questions • Save on BLS certification when you certify online through National Health Care Provider Solution. Discount code included in your purchase.  NEWLY UPDATED! NHCPS has just released an update to its Basic Life Support (BLS) course. This course is based on the latest life support guidelines published by the American Heart Association and is designed to train people everywhere to provide high quality basic life support. The book covers how to provide adult, child, and infant CPR by one or two rescuers, as well as use of Automated External Defibrillators (AEDs). Airway management and obstructed airway relief is also covered. This is one of the most effective and user-friendly training manuals on the market because it was created by a team dedicated to life support education with the goal of training people to help save lives. Each topic is broken down into critical decisions to make and steps to take. This book will give you the confidence you need to respond to medical emergencies. This course is written by Dr. Karl F. Disque, a board certified anesthesiologist and registered pharmacist. Dr. Disque has certified thousands of healthcare professionals with his courses in Advanced Cardiac Life Support (ACLS), Pediatric Advanced Life Support (PALS), and Basic Life Support (BLS). This manual is the primary training material for BLS certification courses provided by National Health Care Provider Solutions (www.nhcps.com). While it is originally created for use during certification courses, the handbook is excellent reference material for both anyone to keep their basic life support skills sharp. Available in paper or Kindle editions, this manual can help you study CPR, AED, and First Aid anywhere.",
  "genres": [],
  "author": "Karl Disque",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/52622410-basic-life-support"
}