{
  "title": "A Lady Compromised",
  "description": "“Wilde's heroine is not only a useful woman but a highly entertaining one.”—Kirkus Reviews on And Dangerous to KnowFans of Jane Austen have fallen in love with Darcie Wilde's mystery series featuring Rosalind Thorne, a young woman adept at helping ladies of the ton navigate the darker corners of Regency England--while revealing Society's most shocking secrets...Rosalind is pleased when she's invited to Cassel House to help her friend, Louisa, prepare for her upcoming wedding. But that's not the only event on her agenda. The trip will also afford Rosalind the chance to see Devon Winterbourne, the newly minted Duke of Casselmaine. Devon and Rosalind were on the verge of betrothal before the infamous Thorne family scandal derailed their courtship. Now Rosalind wonders if there's a chance their love might reignite.Devon is as handsome as Rosalind remembers and it's clear the attraction they once shared hasn't waned. But their time together is interrupted by one crisis after another--not the least of which is an awkwardly timed request for help from Louisa's friend, Helen Corbyn.Not long ago, the untimely death of Helen's brother, William, was ruled a suicide, but few people truly believe he took his own life. Helen needs to know what really happened--especially since she's engaged to the man some suspect of secretly killing William.While Rosalind desperately wants to help, she fears her efforts might cast a pall over Louisa's nuptials, not to mention her reunion with Devon. But when another untimely death rocks the ton, Rosalind has no choice but to uncover the truth before more people die...even if her actions threaten her future with Devon.“A complex, enthralling mystery that rivals those of Anne Perry and Agatha Christie.”—New York Journal of Books",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Fiction",
    "Audiobook",
    "Regency"
  ],
  "author": "Darcie Wilde",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/52635896-a-lady-compromised"
}