{
  "title": "Reconsidering Reagan: Racism, Republicans, and the Road to Trump",
  "description": "A long-overdue and sober examination of President Ronald Reagan's racist politics that continue to harm communities today and helped shape the modern conservative movement.Ronald Reagan is hailed as a transformative president and an American icon, but within his 20th century politics lies a racial legacy that is rarely discussed. Both political parties point to Reagan as the \"right\" kind of conservative but fail to acknowledge his political attacks on people of color prior to and during his presidency. Reconsidering Reagan corrects that narrative and reveals how his views, policies, and actions were devastating for Black Americans and racial minorities, and that the effects continue to resonate today.Using research from previously untapped resources including the black press which critically covered Reagan's entire political career, Daniel S. Lucks traces Reagan's gradual embrace of conservatism, his opposition to landmark civil rights legislation, his coziness with segregationists, and his skill in tapping into white anxiety about race, riding a wave of \"white backlash\" all the way to the Presidency. He argues that Reagan has the worst civil rights record of any President since the 1920s--including supporting South African apartheid, packing courts with conservatives, targeting laws prohibiting discrimination in education and housing, and launching the \"War on Drugs\"--which had cataclysmic consequences on the lives of Black and Brown people.Linking the past to the present, Lucks expertly examines how Reagan set the blueprint for President Trump and proves that he is not an anomaly, but in fact the logical successor to bring back the racially tumultuous America that Reagan conceptualized.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Presidents",
    "Political Science"
  ],
  "author": "Daniel S. Lucks",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/52636999-reconsidering-reagan"
}