{
  "title": "Wild Women and the Blues",
  "description": "A Fascinating and Innovative Novel of Historical FictionIn a stirring and impeccably researched novel of Jazz-age Chicago in all its vibrant life, two stories intertwine nearly a hundred years apart, as a chorus girl and a film student deal with loss, forgiveness, and love…in all its joy, sadness, and imperfections. “Why would I talk to you about my life? I don't know you, and even if I did, I don't tell my story to just any boy with long hair, who probably smokes weed. You wanna hear about me. You gotta tell me something about you. To make this worth my while.”1925: Chicago is the jazz capital of the world, and the Dreamland Café is the ritziest black-and-tan club in town. Honoree Dalcour is a sharecropper’s daughter, willing to work hard and dance every night on her way to the top. Dreamland offers a path to the good life, socializing with celebrities like Louis Armstrong and filmmaker Oscar Micheaux. But Chicago is also awash in bootleg whiskey, gambling, and gangsters. And a young woman driven by ambition might risk more than she can stand to lose. 2015: Film student Sawyer Hayes arrives at the bedside of 110-year-old Honoree Dalcour, still reeling from a devastating loss that has taken him right to the brink. Sawyer has rested all his hope on this frail but formidable woman, the only living link to the legendary Oscar Micheaux. If he’s right—if she can fill in the blanks in his research, perhaps he can complete his thesis and begin a new chapter in his life. But the links Honoree makes are not ones he’s expecting... Piece by piece, Honoree reveals her past and her secrets, while Sawyer fights tooth and nail to keep his. It’s a story of courage and ambition, hot jazz and illicit passions. And as past meets present, for Honoree, it’s a final chance to be truly heard and seen before it’s too late. No matter the cost...",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "Adult",
    "Music",
    "Book Club"
  ],
  "author": "Denny S.  Bryce",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/52649899-wild-women-and-the-blues"
}