{
  "title": "The Life I'm In",
  "description": "The powerful and long-anticipated companion to The Skin I'm In, Sharon Flake's bestselling modern classic, presents the unflinching story of Char, a young woman trapped in the underworld of human trafficking.My feet are heavy as stones when I walk up the block wondering why I can't find my old self.  In The Skin I'm In, readers saw into the life of Maleeka Madison, a teen who suffered from the ridicule she received because of her dark skin color. For decades fans have wanted to know the fate of the bully who made Maleeka's life miserable, Char. Now in Sharon Flake's latest and unflinching novel, The Life I'm In, we follow Charlese Jones, who, with her raw, blistering voice speaks the truths many girls face, offering insight to some of the causes and conditions that make a bully. Turned out of the only home she has known, Char boards a bus to nowhere where she is lured into the dangerous web of human trafficking. Much is revealed behind the complex system of men who take advantage of vulnerable teens in the underbelly of society. While Char might be frightened, she remains strong and determined to bring herself and her fellow victims out of the dark and back into the light, reminding us why compassion is a powerful cure to the ills of the world. Sharon Flake's bestselling, Coretta Scott King Award-winning novel The Skin I'mIn was a game changer when it was first published more than twenty years ago. It redefined young adult literature by presenting characters, voices, and real-world experiences that had not been fully seen. Now Flake offers readers another timely and radical story of a girl on the brink and how her choices will lead her to either fall, or fly.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Realistic Fiction",
    "Contemporary",
    "Teen",
    "Social Issues",
    "Friendship"
  ],
  "author": "Sharon G. Flake",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/52664754-the-life-i-m-in"
}