{
  "title": "Business Made Simple: 60 Days to Master Leadership, Sales, Marketing, Execution, Management, Personal Productivity and More",
  "description": "Is this blue book more valuable than a business degree?Most people enter their professional careers not understanding how to grow a business. At times, this makes them feel lost, or worse, like a fraud pretending to know what they're doing.It's hard to be successful without a clear understanding of how business works. These 60 daily readings are crucial for any professional or business owner who wants to take their career to the next level.New York Times and Wall Street Journal bestselling author, Donald Miller knows that business is more than just a good idea made profitable - it's a system of unspoken rules, rarely taught by MBA schools. If you are attempting to profitably grow your business or career, you need elite business knowledge--knowledge that creates tangible value.Even if you had the time, access, or money to attend a Top 20 business school, you would still be missing the practical knowledge that propels the best and brightest forward. However, there is another way to achieve this insider skill development, which can both drastically improve your career earnings and the satisfaction of achieving your goals.Donald Miller learned how to rise to the top using the principles he shares in this book. He wrote Business Made Simple to teach others what it takes to grow your career and create a company that is healthy and profitable.These short, daily entries and accompanying videos will add enormous value to your business and the organization you work for. In this sixty-day guide, readers will be introduced to the nine areas where truly successful leaders and their businesses excel:Character: What kind of person succeeds in business?Leadership: How do you unite a team around a mission?Personal Productivity: How can you get more done in less time?Messaging: Why aren't customers paying more attention?Marketing: How do I build a sales funnel?Business Strategy: How does a business really work?Execution: How can we get things done?Sales: How do I close more sales?Management: What does a good manager do?Business Made Simple is the must-have guide for anyone who feels lost or overwhelmed by the modern business climate, even if they attended business school. Learn what the most successful business leaders have known for years through the simple but effective secrets shared in these pages.Take things further: If you want to be worth more as a business professional, read each daily entry and follow along with the free videos that will be sent to you after you buy the book.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Entrepreneurship",
    "Productivity",
    "Management",
    "Self Help"
  ],
  "author": "Donald Miller",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/52650944-business-made-simple"
}