{
  "title": "New Formations: Czech Avant-Garde Art and Modern Glass from the Roy and Mary Cullen Collection",
  "description": "In 1928 Czech artistis Jindrich Štyrský and Toyen published the  Artificielismus (Artificialism) manifesto, calling for \"new formations\" in contemporary art. The term aptly reflects the spirit of adventure that Houston philanthropists Roy and Mary Cullen brought to forming a comprehensive collection devoted to the radical developments of Czech art in the first decades of the twentieth century. New  Czech Avant-Garde Art and Modern Glass from the Roy and Mary Cullen Collection profiles this endeavor, highlighting more than 150 examples from this extraordinary collection, which encompasses paintings, drawings, prints, collages, photographs, artist-produced books, and rare examples of modern glass. Generously illustrated with over 350 full-color plates, this catalogue highlights the major figures of the Czech avant-garde, including Josef Šíma, Karel Teige, Jindrich Štyrský, and Toyen, among many others. Scholars Karel Srp and Lenka Bydžovská bring to light the complex evolution and artistic exchanges of this era, which saw the emergence of the uniquely Czech movements of Devetsil, Poetism, and Artificialism, as well as these artists' engagements with Surrealism and other major intellectual currents of the time. Particular attention is given to artists' publications, and a number of period texts have been translated for this catalogue as well. The authors also place the Czech avant-garde in a larger historical context, as World War II and cold war shifts in the political landscape doomed many of these artists to decades of obscurity and exile. In addition, the publication features an extended interview with Roy and Mary Cullen conducted by Museum of Fine Arts, Houston, curator Alison de Lima Greene and an insightful essay by Jan Mergl, an expert in Bohemian glass, discussing the stylistic and technical evolution of modern Czech glass reflected by works in the Cullen collection.Distributed for the Museum of Fine Arts, HoustonExhibition The Museum of Fine Arts, Houston (11/06/11-02/05/12)",
  "genres": [
    "Art"
  ],
  "author": "Alison De Lima Greene",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/12584011-new-formations"
}