{
  "title": "The Highlanders",
  "description": "Never underestimate the heart of a Highlander.Night FoxAfter the failed Jacobite Rebellion of 1715, war-weary Deven McLendon returns home to discover a thief creating chaos on his lands. But this thief isn't like any other. When Rooney Corsen sets out to steal jewels to repay her family’s debts and keep a roof over her little sisters’ heads, never does she imagine snagging the laird's heart instead.A Tender SiegePontiac’s War, August 1763: “I beg Ye to take me.” Wounded in battle in the American wilderness, Lachlan McRea of His Majesty’s 42nd Highlanders pleads with God, yearning to be reunited with his lost wife and child. As death hovers near, he is discovered by Wenonah, a native widow doing all she can to survive alone while avoiding the attentions of a dangerous Shawnee warrior. In aiding one another, their perils increase. If Lachlan can let go of the woman he once loved, he might find healing for both body and soul.The Year without SummerShoved off his family’s land in Scotland in 1816, Grant Cummings looks for work in Ulster, Ireland. He needs money and a home to raise his young brother. Molly MacGregor loses her father and his income, but she has no time to grieve as she sews and spins to earn enough to keep her and her young brother alive. Renting out the hut on their land might be the answer, but only if she can overcome her prejudice against the handsome Highlander who moves in. Her heart might soften toward him, but not when he plans to set sail for America.The ViolinistIn 1915 Idaho, homesick lumberjack Callan MacTavish despairs of ever seeing his Scottish homeland again. With kindness and patience, music teacher Rose Marchmont reaches a part of Callan’s heart he’d long ago locked away. She sees beyond his rough exterior to the artistic heart beneath. He longs for more than he can offer her, but she doesn’t know about the secret trauma that keeps him from crossing the sea.",
  "genres": [
    "Historical",
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Anthologies",
    "Historical Romance",
    "Inspirational"
  ],
  "author": "J'nell Ciesielski",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/52645503-the-highlanders"
}