{
  "title": "The Kraken In Love",
  "description": "True love is lurking in the water.Kate’s boyfriend has left her in financial ruin. After gambling away all their money, he skips town leaving her and his mess behind. Kate is in desperate need of money, with no way to pay off the debt left in his wake.When her sister swoops in with an unexpected job offer, Kate is in no place to turn it down. Even if it means living in the middle of nowhere for the next few years. Kate packs up her life in Vegas and moves to northern Washington to become the property manager of her brother-in-law’s newly inherited lake house. What starts out as a simple job quickly turns into so much more.With every day that passes, Kate discovers more and more secrets hidden within the lake house. It doesn’t take long for her to realize that she might not be the only person living on the lake. When a mysterious stranger appears in the water, Kate must decide if she is ready to open her heart again.Sam has spent the past fifteen years trapped on earth, with no hope of ever returning to his home world. He was raised at the remote lake house by John, an eccentric millionaire who was kind enough to keep Sam hidden from the eyes of the world. After John passes away, Sam is truly alone. Sam is convinced that humans cannot be trusted. After all, that is what John always told him. John had done everything in his power to keep Sam isolated from the evils of humanity, so Sam has never gotten to meet another person. He is terrified that if he does, he will be sentenced to a life of experimentation and torture. When a beautiful human female wanders into his lake house, the first one he has ever seen up close, a part of Sam that has long been forgotten starts to awaken. He must decide if he can trust her or let his one opportunity for love and companionship slip away forever.Can Kate find love with someone from out of this world?This novella contains a love story between a tentacled Kraken and a human woman. HEA, no cliff-hanger.This book contains sexually explicit content that is suitable only for mature readers.",
  "genres": [
    "Aliens",
    "Monsters",
    "Science Fiction",
    "M F Romance",
    "Science Fiction Romance",
    "Romance"
  ],
  "author": "Annie Beth Rider",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/52647134-the-kraken-in-love"
}