{
  "title": "Imperfect Saint",
  "description": "Millie Turner is a master at compartmentalizing. She’s put her past in a box and she doesn’t talk, or even think about it. She’s managed to avoid her lying, cheating, manipulative ex-boyfriend for months. Unfortunately, avoidance is no longer an option. Her brother is getting married and his Best Man is none other than the ex that nearly destroyed her.She doesn’t trust herself to spend an entire weekend in his presence. Not on her own. She needs a date, a distraction, a buffer, someone to keep him away from her… but she never expected her savior to come in the form of a saint.Hunter St. James has been fascinated by the mysterious Millie since the moment they met. Despite his efforts to get her to open up though, she’s kept their relationship strictly professional. When their boss asks him to act as Millie’s date for a big family event, it seems like the perfect chance to get to know the girl that’s been keeping him at arms-length.He thought a weekend of playing lovers would be all fun and games but he soon finds out Millie’s more than just mysterious. She has secrets and her picture-perfect facade is just as fake as their relationship is supposed to be. Only the more he learns, the more he wants to know and the less their relationship feels like a lie.Can Hunter convince Millie to trust him with the truth? And if Millie comes clean about her past, will Hunter still want a future with her? Neither of them is perfect but maybe that’s exactly what makes them perfect for each other.*Warning - This book contains scenes that could be triggering to some, including discussion of domestic violence situations, and on and off page violence. If you are sensitive to story-lines that involve abusive relationships, please take care when deciding to read this novel. It is important also to note that these scenes do NOT involve the main hero and that our heroine finds her HEA and a healthy relationship with our hero after confronting her past. Still, caution is recommended to avoid triggers for some readers. *",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Abuse",
    "M F Romance"
  ],
  "author": "Jess Bryant",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/52646746-imperfect-saint"
}