{
  "title": "The Capital",
  "description": "It’s a classic fairytale: Knight meets necromancer. They argue. They fight. They…make out?Prince Roland comes home from the war to bury his father and see his sister on the throne. He sneaks out to his favorite tavern for nostalgia’s sake. It’s the place where he kissed a man for the first time, the place where he used to carouse with the lover he buried on a battlefield.Roland expects to enjoy some anonymity and perhaps flirt with a few strangers for old time’s sake. He does not expect to find a fascinating scholar from out of town—a lonely young man with beautiful eyes and an obvious longing to be touched, buried beneath a prickly demeanor. The man clearly has his secrets, but so does Roland, and their unexpected chemistry makes him feel alive for the first time in months.Roland exerts all his knightly charm and is rewarded by the promise of a second date. He figures he’ll need something to look forward to tomorrow, since he must spend the day in council with his family’s sworn enemy—a necromancer whom his sister has rashly invited to consult about the war.Sairis is a necromancer with a price on his head. He knows that he will have to bargain for his life tomorrow. He’s never been this far from his tower. He’s good with magic, not people. He’s frightened, although he doesn’t want to admit it.Sairis knows he’s doing something foolish by visiting a tavern the evening before his meeting with the royals—a tavern that caters to men of certain tastes. But Sairis wants things. Things a hunted outlaw can never have.He tells himself that he’ll just watch—see what ordinary people enjoy every day. Sairis is confident in his ability to intimidate anyone who comes too close.He’s shocked when a dazzling mountain of a man is not intimidated in the slightest. Sairis knows a knight when he sees one. He has killed plenty of knights. But this knight is funny and kind. Sairis finds his defenses melting in spite of his best efforts. Maybe he could go on a second date with this person.Of course, he’ll have to get through tomorrow first…when he must bargain with the hated royals who have persecuted him all his life.The Knight and the Necromancer is a trilogy with satisfying HEA at the end of book 3. Steamy scenes, adults only.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "Magic",
    "LGBT",
    "Paranormal",
    "Historical"
  ],
  "author": "A.H. Lee",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/52651076-the-capital"
}