{
  "title": "Surviving Ophelia: Mothers Share Their Wisdom In Navigating The Tumultuous Teenage Years",
  "description": "Raising a teenage girl can be frightening and overwhelming for the most important female figure in her life: her mother. From handling the often delicate situations surrounding academic performance, athletics, friendships, sexual activity, and drug and alcohol experimentation to instilling (or restoring) a healthy body image and providing a strong role model, mothers often feel alone in their struggle to find ways of coping with all that they must do for their daughters. To provide the community that these women so desperately crave-and all that comes with it: the guidance, the solace, the inspiration, and the hope -Cheryl Dellasega has written Surviving Ophelia, a book of profound wisdom and compassion. Dellasega's own story of raising her teenage daughters is punctuated by the collective experience of hundreds of other mothers, from all walks of life, who have been there or are there, in the trenches, experiencing and chronicling the daily joys and trials of raising their teenage girl. Enlightening, heartfelt, and hopeful, Surviving Ophelia is a must-read for \"Ophelia's mother.\"To find [this book] is like an answer to a prayer. I've had a hard time finding someone who understands what I'm going through, and knows the kind of pain a mother feels when her child is hurting herself.\"-Jane, Reno, Nevada\"This is for all the mothers who sat at coffee break with their peers passing pleasantries while trying to sedate their feelings…[of] anger, rage, disappointment (sadness)…. While they share information on Ivy League colleges their children will be attending in the fall, I just pray that my daughter stays alive.\"-Lori, Detroit, Michigan\"The realization stung me as if I'd been slapped hard across my face: I'd been betrayed. My seventeen-year-old daughter Sara had lied to me, and, in needing to believe her, I lied to myself.\"-Amanda, Albany, New York\"It's always assumed you want your kids to walk in your footsteps. For me, it's the last thing I wanted. I raised my girls to be everything I was not: outgoing, brave, bold, and independent.\"-Sandra, Marblehead, Massachusetts\"As the mother of an anorexic, I have spent the past four years reliving the choices I have made in my life, searching to find the cause of my daughter's life-threatening illness.\"-Carolyn, Amherst, Massachusetts",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology"
  ],
  "author": "Cheryl Dellasega",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/526796.Surviving_Ophelia"
}