{
  "title": "Flashpoint",
  "description": "A heart-pounding new series from the #1 best-selling post-apocalyptic author   If your life dissolved in a flash, would you be strong enough to survive?  Half of the earth's population has been wiped out. Impossible to predict or stop, the Gamma Ray Burst tore through the Earth like a bullet, its radiation wave killing hundreds of millions and the aftereffects ensuring the deaths of billions more.  Now, as the world crumbles around them, a ragtag group of survivors make for the only home they know - the small town of Mercy. Spared the worst of the GRB's effects, the town is isolated, safe and self-sufficient - for now. The flash hasn't just decimated the Earth's population, though. It's brought out the worst in many of those who are still alive.  Survival in this new world doesn't just depend on preparedness - it depends on strength.  *****  It's the one disaster no one can plan for. A rogue cosmic event called a Gamma Ray Burst, sending a spike of radiation through the earth like a .50 caliber bullet through a ripe watermelon. It's speculated that such an event hit the Earth at some point in the past, causing a mass extinction event. With two potential sources for a GRB pointed directly at our heads, the chances of another one happening in our lifetime is remote... but still possible.  In Flashpoint, we explore such an event and the havoc it would wreak across the entire planet. From destroying our atmosphere to millions dying from incredibly painful radiation exposure, a GRB would be unpredictable and unavoidable for everyone, rich and poor, prepared and unprepared alike.  Flashpoint is a six-book miniseries-like event, written by Tara Ellis and #1 best-selling post-apocalyptic author Mike Kraus. This thrilling post-apocalyptic survival series will have you second-guessing the very nature of post-apocalyptic disaster scenarios and leave you breathless with every turn of the page.",
  "genres": [
    "Post Apocalyptic",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Tara Ellis",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/52671325-flashpoint"
}