{
  "title": "In the Heart of the Sea: The Tragedy of the Whaleship Essex",
  "description": "The ordeal of the whaleship Essex was an event as mythic in the nineteenth century as the Titanic disaster was in the twentieth. Nathaniel Philbrick now restores this epic story—which inspired the climactic scene in Herman Melville's Moby-Dick—to its rightful place in American history.In 1819, the 238-ton Essex set sail from Nantucket on a routine voyage for whales. Fifteen months later, the unthinkable happened: in the furthest reaches of the South Pacific, the Essex was rammed and sunk by an enraged sperm whale. Its twenty-man crew, fearing cannibals on the islands to the west, decided instead to sail their three tiny boats for the distant South American coast. They would eventually travel over 4,500 miles. The next three months tested just how far humans could go in their battle against the sea as, one by one, they succumbed to hunger, thirst, disease, and fear.Nathaniel Philbrick brings an incredible story to life, fro the intricacies of Nantucket's whaling economy and the mechanics of sailing a square-rigger to the often mysterious behavior of whales. But it is his portrayal of the crew of the Essex that makes this a heart-rending book. These were not romantic adventurers, but young working men, some teenagers, just trying to earn a living in the only way they knew how. They were a varied lot: the ambitious first mate, Owen Chase, whose impulsive nature failed at a crucial moment, then drew him to a more dangerous course; the cabin boy, Thomas Nickerson, whose long-lost account of the ordeal, written at age seventy-one, provides new insights into the story; and Captain George Pollard, who was forced to take the most horrifying step if any of his men were to survive.This is a timeless account of the human spirit under extreme duress, but it is also a story about a community, and about the kind of men and women who lived in a forbidding, remote island like Nantucket—a pioneer story that explores how we became who we are, and our peculiar blend of spiritualism and violence. It is also a tragic tale of survival against all odds. Its richness of detail, its eloquence, and its command of history make In the Heart of the Sea a vital book about America.",
  "genres": [
    "History",
    "Nonfiction",
    "Adventure",
    "Survival",
    "Historical",
    "American History",
    "Book Club"
  ],
  "author": "Nathaniel Philbrick",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/526788.In_the_Heart_of_the_Sea"
}