{
  "title": "Reading Matters: What the Research Reveals about Reading, Libraries, and Community",
  "description": "Drawing upon data published in a variety of scholarly journals, monographs in education, cultural studies, media studies, and libraries and information studies, as well as their own research findings, these authors shatter some of the popular myths about reading and offer a cogent case for the library's vital role in the life of a reader. By providing a road map to research findings on reading, reader-response, audiences, genres, the value of popular culture, the social nature of reading, and the role of libraries in promoting literacy and reading, this guide offers a clear rationale for making pleasure reading a priority in the library and in schools.The authors assert that reading for pleasure is as vital as ever; and that it is, and should be, woven into the majority of activities librarians consider fundamental: reference, collection building, provision of leisure materials, readers' advisory services, storytelling programs, adult literacy programs, and the like. Reading Matters covers myths about reading, the boy problem, reading and identity, how readers select books, and reading as a social activity. An essential resource for library administrators and personnel, the book will help them convey a message about the importance of reading to grant-funding agencies and others. It contains powerful proof that can be used to justify the establishment, maintenance, and growth of fiction (and other pleasure reading) collections, and of readers' advisory services. It is also of interest to LIS faculty who wish to establish/maintain courses in readers' advisory, and can be used as supplemental reading in these classes. Finally, it is a great model and aide for additional research on this topic.",
  "genres": [
    "Nonfiction",
    "Library Science",
    "Librarianship",
    "Books About Books",
    "School",
    "Adult",
    "Unfinished"
  ],
  "author": "Lynne (E.F.) McKechnie",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/1258548.Reading_Matters"
}