{
  "title": "Entangled Life: How Fungi Make Our Worlds, Change Our Minds & Shape Our Futures",
  "description": "There is a lifeform so strange and wondrous that it forces us to rethink how life works…Neither plant nor animal, it is found throughout the earth, the air and our bodies. It can be microscopic, yet also accounts for the largest organisms ever recorded, living for millennia and weighing tens of thousands of tonnes. Its ability to digest rock enabled the first life on land, it can survive unprotected in space, and thrives amidst nuclear radiation.In this captivating adventure, Merlin Sheldrake explores the spectacular and neglected world of fungi: endlessly surprising organisms that sustain nearly all living systems. They can solve problems without a brain, stretching traditional definitions of ‘intelligence’, and can manipulate animal behaviour with devastating precision. In giving us bread, alcohol and life-saving medicines, fungi have shaped human history, and their psychedelic properties, which have influenced societies since antiquity, have recently been shown to alleviate a number of mental illnesses. The ability of fungi to digest plastic, explosives, pesticides and crude oil is being harnessed in break-through technologies, and the discovery that they connect plants in underground networks, the ‘Wood Wide Web’, is transforming the way we understand ecosystems. Yet they live their lives largely out of sight, and over ninety percent of their species remain undocumented.Entangled Life is a mind-altering journey into this hidden kingdom of life, and shows that fungi are key to understanding the planet on which we live, and the ways we think, feel and behave. The more we learn about fungi, the less makes sense without them.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Biology",
    "Audiobook",
    "Environment",
    "Ecology"
  ],
  "author": "Merlin Sheldrake",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/52668915-entangled-life"
}