{
  "title": "Slab Steele and the Venusian Exchange",
  "description": "Two Flytrap fans had a plan. But unfortunately for them, they kidnapped the wrong guy. Or did they?In the near future, the invention of the Io Mega-Zip Drive has allowed humanity to spread throughout the Solar System. This new age of discovery brought with it a bold new sport: craterball. Played in low gravity on massive domed craters, craterball has taken the System by storm and made all other Terran sports all but obsolete.Slab Steele was once the hottest craterback prospect coming out of Texas Space University, but a series of self-engineered screw ups have left him without the hope of joining the greatest craterback to ever play the game, Mirt “The Whip” Ballfeather, in the Craterball Hall of fame.Once reduced to playing backup for the worst team in the league, the Venus Flytrap, Slab has finally got his life back on track. Slab Steele—through no significant achievement of his own—is on the verge of winning the Crater Bowl. On the eve of the biggest match of his life, the deciding Match Seven of the Solar Craterball Finals, Slab Steele is knocked out and taken captive by two die-hard fans of the rival team. There’s only one problem: Slab isn’t even the starter.Suddenly, Slab Steele is thrust into an adventure that forces him to confront a ghost from his past, meet a hero from his present, and ultimately come to terms with a future unlike any he has ever known, all while trying to make it to Venus in time for the Crater Bowl.Featuring copious amounts of dad jokes, shameless puns, a sentient slice of cheese, and a bipedal urinal, Slab Steele and the Venusian Exchange is a perfect read for fans of Guardians of the Galaxy, the Galactic Football League, Space Team and the greatest sports films of the 80s and 90s.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Ron Starke",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/52683820-slab-steele-and-the-venusian-exchange"
}