{
  "title": "Frida and Me: Art, and One Woman’s Triumph Over PTSD",
  "description": "\"An inherently absorbing....truly extraordinary memoir.” –Midwest Book Review  “I cried when I read this book. Eli Weintraub grabs you with a memoir that reads like a novel, and just doesn’t let go. This is a powerful story!” – Connie Shelton, USA Today bestselling author  In 1976 Nancy Weintraub was a rebellious teen, a child of the 60s, a free spirit. She and a friend set out, against her parents’ wishes, to spend a year in San Miguel de Allende attending art school and perfecting their Spanish. Nancy was in heaven as she experienced international travel and the art scene, but a horrific accident in a lonely Mexican desert took away her life as she knew it. As her family, friends, many doctors, and complete strangers made heroic efforts to save her life, many of her hopes were dashed forever.  Unknowingly suffering from Post Traumatic Stress Disorder, Nancy spent the next 10 years running from one bad situation to the next. Trying to reinvent herself, she changed her name to Eli. Her healing really began after learning about the Mexican artist, Frida Kahlo, whose life mirrored her own in so many ways, and meeting an art therapist. Through art therapy, she came to realize that Nancy had died in the wreckage on that rain-slick road, and she didn’t know the person who had emerged. It seemed her free-spirited gypsy self was gone. Gradually, the artist and writer Eli emerged from the shell of Nancy, and through art she found her way back to life and love.  Frida and Me takes the reader through this remarkable woman’s journey, from the giddy days of her once-in-a-lifetime adventure, through the darkest abyss imaginable, putting her on a new path toward helping others recognize art as a tool to heal. Her inspiring presentations have helped trauma victims and clinicians alike, and readers of her story cannot help but be affected by her courage and determination.  Praise for Frida and Me: “An inherently absorbing, singularly fascinating, completely compelling, and truly extraordinary memoir that is as deftly crafted as it is impressively candid.” – Midwest Book Review  “Frida and Me movingly describes the process Eli and her therapist undertook in their work together… the art Eli created during her healing journey is beautifully displayed in the book, helping readers better understand her inner experience. Eli poignantly describes the confusion, disorientation and disconnection from self a person with PTSD lives with, and how lost they feel when they don't understand what has happened to them. I found this personal and inspiring account beautifully written and hard to put down.” —Laurel Parnell, Ph.D., director, Parnell Institute for EMDR, and author of Rewiring the Addicted Brain  “A must-read! Eli is courageous in revealing her deep soul searching experiences and years of healing, ultimately with the help of her compassionate counselor and art therapist.” – Judy Wright, MS, Program Manager of the University of New Mexico’s Employee Health Promotion Program (retired)  “An astonishing story of art’s abilities to heal physical and psychic trauma. The artwork and accompanying narrative of Frida and Me carry the reader through the artist/author’s difficult journey following a horrific bus accident. The account courageously highlights the witness of art in service of the soul.” – Linney Wix, Ph.D.",
  "genres": [],
  "author": "Eli N. Weintraub",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/52691832-frida-and-me"
}