{
  "title": "Irreversible Things",
  "description": "Fiction. Literary Nonfiction. Brimming with wit and heart, IRREVERSIBLE THINGS follows three decades in the life of author-qua-narrator Lisa and her charismatic Mormon family, from childhood to puberty to adulthood. From a young girl grappling with early friendships, first crushes, and a beloved neighbor's shocking murder, to a young woman beginning her own family, dealing with infertility, and caring for a father with Alzheimer's, this work expands our understanding of the novel form, weaving together memoir, fiction, and the fiction of remembering.\"In Lisa Van Orman Hadley's novel-through-stories IRREVERSIBLE THINGS, a family moves from a Florida beach town to a Utah mountain town, trading in a dark situation next door for life with their Mormon family and transitioning from surfing to skiing. Lisa Van Orman is also the lead character's name; she narrates all of these changes. Her family's stories are tight and composed, delivered with such gravity that they can stand on their own, though together they form a heartbreaking tale about growing up and growing into an understanding of your family...Thoughtful and funny, IRREVERSIBLE THINGS plays with the forms of short stories, novels, and memoirs, resulting in hybrid text that articulates change across a lifetime.\"--Camille-Yvette Welsch, Foreword Reviews\"This hybrid approach is integral to the content--Van Orman Hadley's implicit and explicit interrogation of memory--as well as to the overall structure. Fans of Tim O'Brien's The Things They Carried, Sandra Cisneros' The House on Mango Street, and Justin Torres' We Are the Animals will also appreciate IRREVERSIBLE THINGS. But a fair warning: don't be fooled by the ease of this read or by the sheer joy of following this narrator into adulthood. The heartbreak catches you off guard with such force that you drop even your loudest, most intrusive questions.\"--Rachel Rueckert, Columbia Journal",
  "genres": [
    "Fiction",
    "Lds",
    "Religion"
  ],
  "author": "Lisa Van Orman Hadley",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/52694589-irreversible-things"
}