{
  "title": "The Remember Box",
  "description": "I stroked the satin wood in delight and confusion. Why should Uncle Stephen send it to me? The Remember Box was Aunt Kate's private place, the one we were sternly forbidden to open. Suddenly I was reluctant, even fearful--a modern Pandora, about to let out our own lost world. That box held one year I'd spent a lifetime trying to forget.Summer in Job's Corner meant big trees, cool grass, and sweltering afternoons stretching endlessly under the Southern sun. Those were the days without plastic, microwaves, television, or air conditioning, a time when clocks ticked comfortingly in the night and a cool breeze was a gift. But as the long sultry summer of 1949 comes to an end, events will transform this sleepy Southern crossroads.After losing her mother to polio, eleven-year-old Carley Marshall comes to Job's Corner to make a new start, along with her Aunt Kate and Uncle Stephen Whitfield and her cousins Abby and John. The family is welcomed warmly by this small North Carolina community as Stephen takes up the post of pastor to Bethel Church, a Presbyterian congregation. But their welcome begins to wear thin and covert criticism runs rampant as Stephen challenges age-old beliefs and traditions.As Job's Corner confronts national struggles for civil rights, coal strikes, and hysteria over Communism, Stephen's voice of reason gets lost in the growing hostility of a vocal minority. Though this quintessential Southern community seems to be filled with people who are the salt of the earth, secrets and lies are hidden beneath the easy-going surface--and the truth must be revealed before an innocent man is convicted of murder.With the dawning of a new decade, Carley learns to face her own family secrets. And discovers that we all must make the journey to truth alone.",
  "genres": [
    "Fiction",
    "Christian Fiction",
    "Mystery",
    "Historical",
    "Southern",
    "Adult Fiction",
    "Book Club"
  ],
  "author": "Patricia Sprinkle",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1258616.The_Remember_Box"
}