{
  "title": "The Secret Keeper",
  "description": "This book will be released June 1st 2013 as The Keeper of Secrets by HarperCollins Daniel Horowitz wins a prestigious music competition and stands on the brink of a stunning career as a virtuoso violinist. But he’s also a fourteen year old Jewish kid who loves to play baseball with his friends. His talent has come to the attention of famed Spanish classical conductor and competiton judge, Rafael Santamaria Gomez, and he takes a special interest. He invites Daniel to his annual Symposium for young talented musicians in Washington D.C. But when his parents forbid him his hobby, Daniel refuses to play the violin. Daniel’s great-grandparents were wealthy Berlin bankers and owned a superb collection of musical instruments, including a rare 1742 Guarneri del Gesu violin, but lost them when their home was looted in 1939. Their son, Daniel's grandfather, Simon, shares with Rafael the story of his family's destruction at the hands of the Nazis and his six year struggle to survive in Dachau. The conductor begins to suspect that the magnificent del Gesu violin owned by his friend and powerful arts patron, billionaire Russian ex-pat Sergei Valentino, is the same instrument. Sergei's grandfather was a Russian General who helped to liberate Berlin in 1945 and he brought the violin back for Sergei's beloved aunt, Yulena, who was a concert violinist. She fought the Stalinist regime at every turn and when they suspected she was planning to defect, she was murdered by the KGB whilst in London on tour.So who does the violin belong to? The family who owned it for 150 years or the family who have owned it for the last 65? Both have suffered huge losses and survived the darkest times in human history and both have enormous emotional attachments to the instrument. How does Rafael prove its provenance? Then how does he get it back and what will that cost him? And will Daniel agree to play it? So many secrets, held tight for so many years, the shocking revelations will be explosive.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Music",
    "Holocaust",
    "World War II",
    "Book Club",
    "Historical"
  ],
  "author": "Julie  Thomas",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/12585680-the-secret-keeper"
}