{
  "title": "Letters from Father Christmas",
  "description": "Published to celebrate the first ever ‘letter from Father Christmas’ in 1920, this beautiful oversized edition of Tolkien’s famous illustrated letters from ‘Father Christmas’, includes a wealth of charming letters, pictures and decorated envelopes, and promises to be a festive feast for Tolkien fans of all ages.Every December an envelope bearing a stamp from the North Pole would arrive for J.R.R. Tolkien’s children. Inside would be a letter in strange spidery handwriting and a beautiful coloured drawing or some sketches.The letters were from Father Christmas.They told wonderful tales of life at the North Pole: how all the reindeer got loose and scattered presents all over the place; how the accident-prone Polar Bear climbed the North Pole and fell through the roof of Father Christmas’s house into the dining-room; how he broke the Moon into four pieces and made the Man in it fall into the back garden; how there were wars with the troublesome horde of goblins who lived in the caves beneath the house!Sometimes the Polar Bear would scrawl a note, and sometimes Ilbereth the Elf would write in his elegant flowing script, adding yet more life and humour to the stories. No reader, young or old, can fail to be charmed by the inventiveness and ‘authenticity’ of Tolkien’s Letters from Father Christmas.This classic festive book of Tolkien’s enchanting Father Christmas letters, written to his children between the 1920s and the 1940s, has been reworked into a sumptuous, new standard hardback edition. It contains high-quality digital reproductions of his wonderful letters and pictures, including a number of them appearing in this format for the first time, and a revised introduction by Baillie Tolkien.",
  "genres": [
    "Christmas",
    "Fantasy",
    "Fiction",
    "Classics",
    "Childrens",
    "Holiday",
    "Book Club"
  ],
  "author": "J.R.R. Tolkien",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/52710989-letters-from-father-christmas"
}