{
  "title": "Women of Means: The Fascinating Biographies of Royals, Heiresses, Eccentrics and Other Poor Little Rich Girls",
  "description": "A deep dive into the lives of rich and famous women in history. \"Wild and witty, gossipy, and glamorous. A sheer delight.\" --Becca Anderson, author of Badass Women Give the Best Advice and The Book of Awesome Women#1 Bestseller in Women's Studies and Rich & Famous & Royalty BiographiesFrom the author of Great Second Acts and Behind Every Great Man, we now have Women of Means, vignettes of the women who were slated from birth--or marriage--to great privilege, only to endure lives which were the stuff of Russian tragic heroines.Women of Means is full of the best biographies of all time. Some of the women whose silver spoons rusted  - Almira Carnarvon, the real-life counterpart to Lady Cora of Downton Abbey  - Liliane Bettencourt, whose chemist father created L'Oreal . . . and was a Nazi collaborator  - Peggy Guggenheim, who had an insatiable appetite for modern art and men  - Nica Rothschild, who traded her gilded life to become the Baroness of Bebop  - Jocelyn Wildenstein, who became a cosmetology-enhanced cat-woman  - Ruth Madoff, the dethroned queen of Manhattan  - Patty Hearst, who trod the path from heiress to terrorist\"If you've ever wished you had all the money in the world, read Women of Means by Marlene Wagman-Geller. Written in her usual witty prose, these enthralling but petrifying mini-biographies show that when a woman is too wealthy, it can be a curse rather than a blessing.\"--Jill G. Hall, author of The Green Lace Corset\"Wagman-Geller's stories made me gasp and lodged my chin firmly on my chest as she chronicled the lives of women without a financial care in the world, whose appetites led so often to disaster.\"--R. D. Kardon, author of Flygirl",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Feminism",
    "Historical",
    "Memoir"
  ],
  "author": "Marlene Wagman-Geller",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/52719077-women-of-means"
}