{
  "title": "One Hot Holiday",
  "description": "She’s running for her life. He’s the safe haven she never expected to find. The holiday season is about to get HOT. Hiding out for the holiday season in the heart of the South? Not something that Haley Quick ever expected to have on her to-do list but then…she never expected her ex to want her dead, either. Turns out, life is full of surprises. Time to deal. Haley has ditched New York for a crazy little dot on the map known as Point Hope, Alabama. It’s a town gone extra crazy for the holidays, and Haley is sticking out like a sore thumb with her very much Grinch-self.But enter sexy sheriff Spencer Lane…Tall, muscled, and made with an extra dose of sex appeal, he is exactly the kind of man that Haley should be avoiding. He’s charming, he looks way too good in a Santa hat, and, oh, yes, he’s her new landlord. The hits just keep coming. She can’t afford to let Spencer learn all of her secrets, a tough job since she is living with the man. No sex, though. It’s purely a business relationship. Except…the holidays in the South sure do get HOT. Or maybe that’s just sexy Spencer. Usually, Haley falls for the bad guy. It’s the whole reason she’s running for her life. She can’t help but wonder…What would it be like to fall for a man like Spencer?He just got his Christmas wish. Sheriff Spencer Lane can’t believe his luck. The most beautiful, fascinating woman he’s ever seen has just dropped into his life like a gift from, well, the big guy in red. Only the problem is that Haley seems to think Spencer is some by-the-book, nice guy. Probably because of the badge. And if she wants him to be the hero, that’s a role that he’s happy to play for her. But the truth is, Spencer has plenty of darkness inside, too. An ex Navy SEAL, he knows how to get sh—um, stuff done. He also knows how to be very, very naughty.When danger threatens his Haley, all bets are off. No one is going to hurt her. No one is going to threaten her. Not in his town. Not on his watch. The nice guy will show Haley just how bad he can be.Fake snow, a parade of wild elves, and a stalker ex don’t make for the merriest of times, but in Point Hope, anything can happen—and it usually does. Ready for a steamy story that will get you in the ho-ho-ho spirit? Settle back, curl up with Spencer, and have yourself a jolly old time.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Christmas",
    "Holiday",
    "Contemporary",
    "Contemporary Romance",
    "Suspense"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/52709394-one-hot-holiday"
}