{
  "title": "Sexy Scot",
  "description": "A ᴍᴏᴅᴇʀɴ ᴍᴀɴ, ᴀ ᴍᴇᴅɪᴇᴠᴀʟ ᴡᴏᴍᴀɴ. Fᴀᴛᴇ ʙʀᴏᴜɢʜᴛ ᴛʜᴇᴍ ᴛᴏɢᴇᴛʜᴇʀ, ʙᴜᴛ ᴡɪʟʟ ʜɪsᴛᴏʀʏ ᴛᴇᴀʀ ᴛʜᴇᴍ ᴀᴘᴀʀᴛ?When his older brother disappears in front of his eyes, Greyson McCaim is determined to find him—even if he has to travel back in time. Because it turns out their “crazy” father was right: their mother didn’t leave them willingly. She’s a time traveler, and someone pulled her back to her original home in medieval Scotland. Now Rhys is there too, and the other McCaim brothers are stuck in modern-day New Orleans. They keep repeating the chant that sent Rhys back, and it finally works—but only for Greyson. Miserably unprepared for medieval life, he is saved by fate’s choice to dump him at the feet of the uncle he never knew he had. The two set off to learn what happened to Greyson’s mother, but their journey is derailed when they encounter an earl’s daughter in need of help.Marian is sent from the only home she’s ever known to marry a stranger—a Scottish noble with a poor reputation. But her fear of the unknown is soon replaced by a completely different terror when her group is viciously attacked by reivers. The Scot who saves her is unlike anyone she’s ever met—his accent is strange, his words stranger, and he’s completely ignorant to etiquette. And yet this man awakens something in her, as does her newfound freedom from her father.Greyson’s secret opens a whole new world for Marian, and her love makes him a stronger man. But can they possibly find a happy ending? Because his family is at the center of a conspiracy that promises to change Scotland forever, and from the perspective of history, he knows it doesn’t turn out well.Titles & Release Dates: Sinful Scot: February 2020Sexy Scot: March 2020Seductive Scot: April 2020Scandalous Scot: May 2020",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical",
    "Fantasy",
    "Historical Romance",
    "Medieval"
  ],
  "author": "Cecelia Mecca",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/52732165-sexy-scot"
}