{
  "title": "Shuggie Bain",
  "description": "Shuggie Bain is the unforgettable story of young Hugh \"Shuggie\" Bain, a sweet and lonely boy who spends his 1980s childhood in run-down public housing in Glasgow, Scotland. Thatcher's policies have put husbands and sons out of work, and the city's notorious drugs epidemic is waiting in the wings. Shuggie's mother Agnes walks a wayward path: she is Shuggie's guiding light but a burden for him and his siblings. She dreams of a house with its own front door while she flicks through the pages of the Freemans catalogue, ordering a little happiness on credit, anything to brighten up her grey life. Married to a philandering taxi-driver husband, Agnes keeps her pride by looking good--her beehive, make-up, and pearly-white false teeth offer a glamourous image of a Glaswegian Elizabeth Taylor. But under the surface, Agnes finds increasing solace in drink, and she drains away the lion's share of each week's benefits--all the family has to live on--on cans of extra-strong lager hidden in handbags and poured into tea mugs. Agnes's older children find their own ways to get a safe distance from their mother, abandoning Shuggie to care for her as she swings between alcoholic binges and sobriety. Shuggie is meanwhile struggling to somehow become the normal boy he desperately longs to be, but everyone has realized that he is \"no right,\" a boy with a secret that all but him can see. Agnes is supportive of her son, but her addiction has the power to eclipse everyone close to her--even her beloved Shuggie.A heartbreaking story of addiction, sexuality, and love, Shuggie Bain is an epic portrayal of a working-class family that is rarely seen in fiction. Recalling the work of Edouard Louis, Alan Hollinghurst, Frank McCourt, and Hanya Yanagihara, it is a blistering debut by a brilliant novelist who has a powerful and important story to tell.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Literary Fiction",
    "Scotland",
    "LGBT",
    "Audiobook"
  ],
  "author": "Douglas   Stuart",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/52741293-shuggie-bain"
}