{
  "title": "Into The Druid's Lair",
  "description": "A SECONDGREAT QUEST, EVEN MORE DANGEROUS THAN THE FIRST  With the Scepter in his possession, Tristan, still posing as Prince Neil, leads the Company across a continent rife with magical entrapments, enemy armies, and ancient barriers. His goal—to seek Elyon’s second great gift that will lift the darkness from the Celtic world of Erde.  After their battle with the arch druid Faolukan, the Company seeks respite in the high mountain refuge of Ard Cúl Dín. But when priests translate the scroll that Tristan also brought back from Schwarzburg’s subterranean maze, they discover a secret lost for millennia—the nature and location of Elyon’s second legacy to the world, another artifact Tristan’s people failed to keep safe.  Coveting the incredible power of Elyon’s first gift, the priests seize the Scepter. Days later, as trebuchets pound the high walls, Faolukan’s armies swarm the slopes below the city. With the city’s fall imminent, one priest steals the Scepter and flees into the mountains.  AN IMPOSSIBLE JOURNEY INTO THE DRUID’S LAIR  As enemy armies close in, Caitir, Tristan’s newly betrothed, Ewan, his squire, and Machar, the Cloaked Rider, join him to again retrieve the Scepter before they can undertake the second journey. For only when both of Elyon’s bequests to the world are secure in Ewhain Macha’s Tower will light and hope return to Ériu.  Blocking their way is an army of shapeshifters and soldiers mesmerized by the Deamhan Lord’s spells. Somewhere beyond the distant Sfarsit Mountains lies their goal—in Cathair Duvh, a foul city on the slopes of volcanic Drochcarn; in dread Drochtar, a bleak land where Faolukan, the arch druid, reigns with magic and terror. In that realm, all serve the Deamhan Lord, a spirit of darkness whose presence strips even the bravest warrior of all courage and hope.  Thus begins the second great quest, a journey even more difficult than the first.  IN THE GREAT HIGH FANTASY TRADITION  This second novel of the Scepter and Tower Trilogy strives to continue the epic high fantasy tradition of J.R.R. Tolkien’s Lord Of The Rings, David Farland’s The Rune Lords, and Robert Jordan’s The Wheel Of Time series.",
  "genres": [],
  "author": "Mark E. Fisher",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/52728607-into-the-druid-s-lair"
}