{
  "title": "Mess with Death",
  "description": "\"In Russia, you can bribe a police officer, a judge, a lawyer, but you can't bribe your conscience.\"\"After reading this book, I'll never visit Russia.\"🌟Russian society splits apart. A sense of hopelessness has spread among the population. Slava is a lonely young man who barely makes a living. At some point, realizing he has nothing to lose, Slava stops paying his bills and loans. He is ready to become a criminal.Suddenly, he meets a famous YouTube vlogger and his extraordinary friends who would do everything for the sake of pleasure and hype. Hanging out with them, Slava doesn't realize that death becomes part of his everyday life. 🌟\"The novel is about how the government and the lawless society make you enjoy being a criminal. Tense and twisty \nurban crime thriller\n.\"\"Friendship, betrayal, and mysterious murder. Along with political rallies, social injustice, corrupt judicial system. \nDisturbing psychological thriller\n.\"\"Luxurious supercars, hot pursuits, expensive restaurants, lots of leisure time, and law-breaking - that's Russian freedom.\"\"A young man survives in a corrupt Russian society. Heavy reading.\"\"The book kept me gripped from beginning to end. The characters are vivid, compelling, and memorable. The ending shocked. Absolutely tantalizing crime thriller.\"\"A grey, rainy city. All that abandoned factories, deserted blocks, bumpy roads, cemeteries, old garages... \nCreepy,\n urban thriller.\"\"Poor people are seeking love and happiness. Rich people are craving for emotions, and find them in criminal activity.\"\"I remembered Orhan Pamuk's novel 'Snow' about an unfair life in Turkey. Here we have Russia - the largest country in the world where the government pushes young people to become desperate lawbreakers. \nSuspenseful, emotional thriller.\n\"\"Dostoevsky wrote about young people of the 19th century. Raskolnikov killed the older woman and suffered then. Nowadays, the Russian government shows human life means nothing to them. The young people are totally selfish. The characters even use deaths to hype themselves up. \"Mess with Death\" is a very realistic fiction novel.\"☝\nDon't forget to 'Look Inside' the book and read several chapters!\n ☺️ Have a nice day! ❣️\nUS\n\nUK",
  "genres": [],
  "author": "Aleksandr Shulginov",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/52739204-mess-with-death"
}