{
  "title": "Last Seen in Massilia",
  "description": "In this mystery set in Marseilles in 49 B.C., master detective Gordianus the Finder is on a personal quest to learn the truth about his missing son, Meto. Plunged into the midst of the bloody Roman civil war, the well-connected Gordianus and his son-in-law Davus survive adventure after adventure as they penetrate the Gaulic city Massilia, which is walled against Roman invasion. From the first pages, author Steven Saylor is on sure ground with his distinguished protagonist. Gordianus's careful, thoughtful musings are infused with real pathos as he seeks out information about his son whom, he has been informed, is dead. There is some speculation that Meto betrayed Caesar and that death was his punishment. Lacking a corpse, Gordianus cannot bring himself to believe that Meto is really dead.Indeed, bonds between fathers and children—their betrayals, promises, and legacies—play a key role in the twisting plot of Last Seen in Massilia. Literally the title refers to Meto, but the motif extends to other key characters as well. Apollonides, the imperious ruler of Massilia, has a peculiar bond with his horribly deformed daughter. The city's \"scapegoat\", Hieronymus, lives out the legacy of his parents' illegal double suicide by being the human repositor of Massilia's collective sins. He is expected to hurl himself from Sacrifice Rock to appease vengeful gods.Sacrifice Rock is central to the book, the site of a tussle between man and woman that ends, provocatively, in the woman's death. Was it suicide or murder? The three witnesses—Gordianus, Davus, and Hieronymus—are sharply divided on exactly what they saw. Gordianus pursues the truth of this mystery almost as a diversion from the more compelling mystery of his son's disappearance.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Crime",
    "Roman"
  ],
  "author": "Steven Saylor",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/102716.Last_Seen_in_Massilia"
}