{
  "title": "Bayside Fantasies",
  "description": "Fall in love at Bayside, where sandy beaches, good friends, and true love come together in the sweet small towns of Cape Cod. Bayside Summers is a series of standalone steamy romance novels featuring alpha male heroes and sexy, empowered women. They’re fun, flirty, flawed, and easy to relate to. In USA Today bestseller BAYSIDE FANTASIES...Tegan Fine has never had a plan—life, business, or otherwise. But she’s always had goals—to laugh daily and to pay it forward as often as she is able, just like her favorite uncle always did. After inheriting her great-uncle’s amphitheater, Tegan makes a risky move to a charming small town on Cape Cod to carry on her uncle’s legacy and hopefully expand the business with her new friend, Harper. Unfortunately, those goals aren’t doing much to help her plan a business strategy for her new endeavor. With Harper counting on her and her uncle’s legacy at stake, she swears off all distractions, determined to succeed. If only she could stop bumping into a certain arrogant, witty, and excruciatingly hot businessman who tweaks her nerves and invades her every thought. Including her late-night fantasies.Self-professed workaholic Jett Masters never slows down. He lives life with no attachments—except to his clients, to whom he gives his all. A reluctant trip to his hometown has him itching to shake the ghosts of his past and get back to spinning deals and adding to his investments. But when he comes face-to-face with a gorgeous, handsy woman who is quite possibly the snarkiest and most disorganized person he’s ever met, sparks fly, and his sharp mind stumbles. He doesn’t even know her name, but he can’t get her out of his mind.A chance encounter turns into a wild, sexy night, and their chemistry is off the charts—even if their ideals, and their lives, are worlds apart. Neither Jett nor Tegan is looking for more. Becoming friends with benefits seems like the perfect solution. But when they are trapped together in torrential weather, they work side by side in the aftermath, and every passionate kiss deepens their connection. Secrets are shared, trust is built, and no promises dare be made. As their lives move on, lines begin to blur, hearts get hurt, and their true selves come into focus. Tegan and Jett are left wondering if they make the perfect storm, or if they’ve reached the end of their bayside fantasy.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Family",
    "Small Town Romance"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/52730710-bayside-fantasies"
}