{
  "title": "The Black Cabinet: The Untold Story of African Americans and Politics During the Age of Roosevelt",
  "description": "In the early 20th century, most African Americans still lived in the South, disenfranchised, impoverished, terrorized by white violence, and denied the basic rights of citizenship. As the Democrats swept into the White House on a wave of black defectors from the Party of Lincoln, a group of African American intellectuals--legal minds, social scientists, media folk--sought to get the community's needs on the table. This would become the Black Cabinet, a group of African American racial affairs experts working throughout the New Deal, forming an unofficial advisory council to lobby the President. But with the white Southern vote so important to the fortunes of the Party, the path would be far from smooth.Most prominent in the Black Cabinet were Mary McLeod Bethune, an educator close to Eleanor Roosevelt, and her \"boys\" Robert Weaver, a Harvard-educated economist who pioneered enforcement standards for federal anti-discrimination guidelines (and, years later, the first African American Cabinet secretary); Bill Hastie, a lawyer who would become a federal appellate judge; Al Smith, head of the largest black jobs program in the New Deal at the WPA; and Robert Vann, a newspaper publisher whose unstinting reporting on the administration's shortcomings would keep his erstwhile colleagues honest. Ralph Bunche, Walter White of the NAACP, A. Philip Randolph, and others are part of the story as well. But the Black Cabinet was never officially recognized by FDR, and with the demise of the New Deal, it disappeared from history.Jill Watts's The Black Cabinet is a dramatic full-scale examination of a forgotten moment that speaks directly to our own.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "American History",
    "Social Justice",
    "Biography"
  ],
  "author": "Jill  Watts",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/52746469-the-black-cabinet"
}