{
  "title": "Queen of Twilight",
  "description": "BOOK UPDATED/EDITED/EXPANDED ON: August 1st 2020Abducted from Earth and dropped on an alien planet, Inoxia finds herself the accidental guardian of a six year old girl. As a single woman in her thirties whose only worries are the plants in her greenhouse this is a monumental challenge. The two of them aren’t alone for long when two hulking, neon aliens with quills on their heads and color changing eyes happen upon them.As a Darkborn Dauur, Aquilian has spent his life being seen as a curse by his people. The fact that he is also a twin doesn’t help matters at all. With the deck stacked against him, he spends most of his time in the forest where there are no judgemental eyes. While on the hunt for a rare medicinal bloom, Aquilian finds himself trapped within a dome with some of the ugliest creatures he has ever met. Even worse is the fact that one of them happens to be his mate.Although Ettrian is a Lightborn Dauur, he hasn’t always lived an easy life. Growing up as a twin in a society that believes them to be unlucky, the male has had his share of stares and gossip. When he is abducted from the forest and taken to an alien lab to be tested on, Ettrian is told to do something unthinkable. After being reunited with his twin, the male is shocked to find that Aquilian has located their mate. The only problem? She is the most hideous creature he has ever laid eyes on.With everything around them coming undone, can this unconventional family pull together to create their own happily ever after?This is a M/F/M romance.This is rated for those who are 18+ years old.This book may contain some triggers, and may not be suitable for all readers. If you have triggers this may not be the book for you. There is a slight series cliffhanger, but the couple and story is complete itself.Disclaimer: This book comes after Ecstasy from the Deep that was published in From the Depths anthology. It is not important to read Ecstasy from the Deep before this book, but they share the same world. Humans in this world have already been invaded and dealt with the aftermath of that invasion. You will be able to read more about that in our extended version of Ecstasy from the Deep!",
  "genres": [
    "Aliens",
    "Reverse Harem",
    "Romance",
    "Monsters",
    "Science Fiction",
    "M F M",
    "Science Fiction Romance"
  ],
  "author": "Octavia Kore",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/52751995-queen-of-twilight"
}