{
  "title": "Penric's Travels",
  "description": "TALES OF A NEW HERO IN FANTASY FROM LOIS McMASTER BUJOLD, TOGETHER FOR THE FIRST TIME! Includes Penric’s Mission, Mira’s Last Dance, and The Prisoner of Limnos. He does it his way! FOLLOW-UP TO COLLECTION PENRIC'S  PROGRESS. Penric’s Mission  Learned Penric, a sorcerer and divine of the Bastard’s Order, has faced danger and intrigue many times before. Now, he finds himself on his first covert diplomatic mission. Penric must travel across the sea to Cedona in an attempt to secure the services of the Cedonia General Arisaydia for the Duke of Adria. But nothing is as it seems. No sooner than he has arrived, Penric finds himself tossed into a dungeon. If Penric is to survive, he’ll have to navigate treacherous politics—and his own feelings for the young widowed sister of the General.  Mira’s Last Dance  Penric, suffering from injuries attained while escaping from the Cedonian dungeon in which he was imprisoned, must now guide General Arisaydia and his widowed sister, Nikys, across the last hundred miles of hostile Cedonia to safety in the Duchy of Orbas. In the town of Sosie, the fugitive party encounters unexpected delays, and even more unexpected opportunities and hazards, as the courtesan Mira of Adria, one of the ten dead women whose imprints make up the personality of the chaos demon Desdemona, comes to the fore with her own special expertise.  The Prisoner of Limnos  Penric and Nikys have reached safety in the Duchy of Orbas when a secret letter from a friend brings frightening news: Nikys's mother has been taken hostage by her brother's enemies at the Cedonian imperial court and confined in a precarious island sanctuary. Now, Nikys, Penric, and Desdemona must infiltrate the hostile country once more, finding along the way that family relationships can be as unexpectedly challenging as any rescue scheme.  About Penric's Demon:  “A novella filled with a satisfying blend of strong characters and wry humor.”—Publishers Weekly  About Lois McMaster Bujold: \"The pace is breathless, the characterization thoughtful and emotionally powerful, and the author's narrative technique and command of language compelling. Highly recommended.\"—Booklist  \"If you love solid space opera rooted in strong character, you can't go wrong . . . The Warrior's Apprentice already displays the craft and the heart which would soon make Lois McMaster Bujold one of the most feted talents in SF.\"—SF Reviews  “Bujold is adept at worldbuilding and provides a witty, character-centered plot, full of exquisite grace notes . . . fans will be thoroughly gripped and likely to finish the book in a single sitting.”—Publishers Weekly on Diplomatic Immunity",
  "genres": [
    "Fantasy",
    "Novella",
    "Fiction",
    "Romance",
    "Adventure",
    "Science Fiction Fantasy",
    "Short Stories"
  ],
  "author": "Lois McMaster Bujold",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/52759180-penric-s-travels"
}