{
  "title": "Sunny Days: The Children's Television Revolution That Changed America",
  "description": "One of the “Best Books” of the year from The Smithsonian, The Washington Independent Review, and more!From bestselling writer David Kamp, the “fun, fascinating, and surprisingly touching,” ( People ) behind-the-scenes story of the cultural heroes who created the beloved children’s TV programs Sesame Street , The Electric Company , Mister Rogers’ Neighborhood , Free to Be…You and Me , and Schoolhouse Rock! —which transformed American childhood for the better, teaching kids about diversity, the ABCs, and feminism through a fun, funky 1970s lens.With a foreword by Questlove.In 1970, on a soundstage on Manhattan’s Upper West Side, a group of men, women, and Muppets of various ages and colors worked doggedly to finish the first season of a children’s TV program that was not yet assured a second Sesame Street . They were conducting an experiment to see if television could be used to better prepare disadvantaged preschoolers for kindergarten. What they didn’t know then was that they were starting a cultural revolution that would affect all American kids.In Sunny Days , bestselling author David Kamp captures the unique political and social moment that gave us not only Sesame Street , but also Fred Rogers’s gentle yet brave Mister Rogers’ Neighborhood ; Marlo Thomas’s unabashed gender politics primer Free to Be…You and Me ; Schoolhouse Rock! , an infectious series of educational shorts dreamed up by Madison Ave admen; and more, including The Electric Company and ZOOM. It was a unique time when an uncommon number of media professionals and thought leaders leveraged their influence to help children learn—and, just as notably, a time of unprecedented buy-in from American parents.“ Sunny Days is full of such nostalgic jolts…it makes the era a pleasure to revisit” ( The Wall Street Journal ) and captures a wondrous period in the US when a determined few proved that, with persistence and effort, they could change the lives of millions. It is “a lively and bewitching recounting of a particularly ripe period in television and cultural history” ( The New York Times Book Review ) and, as the Los Angeles Times notes, “a sublime book about a variety of creative people coming together not in the pursuit of fame or money, but to enrich the lives of children.”",
  "genres": [
    "Nonfiction",
    "History",
    "Audiobook",
    "Education",
    "Tv",
    "Pop Culture",
    "Adult"
  ],
  "author": "David Kamp",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/52756405-sunny-days"
}