{
  "title": "Brontë’s Mistress",
  "description": "This dazzling debut novel for fans of Mrs. Poe and Longbourn explores the scandalous historical love affair between Branwell Brontë and Lydia Robinson, giving voice to the woman who allegedly corrupted her son’s innocent tutor and brought down the entire Brontë family.Yorkshire, 1843: Lydia Robinson—mistress of Thorp Green Hall—has lost her precious young daughter and her mother within the same year. She returns to her bleak home, grief-stricken and unmoored. With her teenage daughters rebelling, her testy mother-in-law scrutinizing her every move, and her marriage grown cold, Lydia is restless and yearning for something more. All of that changes with the arrival of her son’s tutor, Branwell Brontë, brother of her daughters’ governess, Miss Anne Brontë and those other writerly sisters, Charlotte and Emily. Branwell has his own demons to contend with—including living up to the ideals of his intelligent family—but his presence is a breath of fresh air for Lydia. Handsome, passionate, and uninhibited by social conventions, he’s also twenty-five to her forty-three. A love of poetry, music, and theatre bring mistress and tutor together, and Branwell’s colorful tales of his sisters’ elaborate play-acting and made-up worlds form the backdrop for seduction. But Lydia’s new taste of passion comes with consequences. As Branwell’s inner turmoil rises to the surface, his behavior grows erratic and dangerous, and whispers of their passionate relationship spout from her servants’ lips, reaching all three protective Brontë sisters. Soon, it falls on Lydia to save not just her reputation, but her way of life, before those clever girls reveal all her secrets in their novels. Unfortunately, she might be too late. Meticulously researched and deliciously told, Brontë’s Mistress is a captivating reimagining of the scandalous affair that has divided Brontë enthusiasts for generations and an illuminating portrait of a courageous, sharp-witted woman who fights to emerge with her dignity intact.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "British Literature",
    "Victorian",
    "Adult"
  ],
  "author": "Finola Austin",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/52760782-bront-s-mistress"
}