{
  "title": "The Vanished Seas",
  "description": "MAJOR BHAAJAN RETURNS. Book three in the Skolian Empire Major Bhaajan series by Catherine Asaro.SURVIVE THE CITY OF CRIES  Bhaajan grew up in the Undercity, a community hidden in the ruins buried beneath the glittering City of Cries. Caught between the astonishing beauty and crushing poverty of that life, and full by wanderlust, she enlisted in the military. Now retired, Major Bhaajan is a private investigator who solves cases for the House of Majda, a royal family centered in Cries. The powerful elite of the City of Cries are disappearing, and only Bhaajan, who grew up in the Undercity, can find them—if she isn’t murdered first.  About the Major Bhaajan series:  “. . . riveting. . . . The world is rich and vivid, with two distinct cultures in the Undercity and the aboveground City of Cries. This exciting novel stands alone for anyone who enjoys science fiction adventure.”—Publishers Weekly (starred review)  \"Asaro plants herself firmly into that grand SF tradition of future history franchises favored by luminaries like Heinlein, Asimov, Herbert, Anderson, Dickson, Niven, Cherryh, and Baxter . . . They don't write em like that anymore! Except Asaro does, with . . . up-to-the-minute savvy!\"—Locus  \"Baahjan, who starts out keeping an emotional distance from the people in the Undercity soon grows to think of them as her community once more. Asaro . . . returns to the Skolian empire's early history to tell Bhaajan's story.\"—Booklist  \"Asaro delivers a tale rich with the embedded history of her world and bright with technical marvels. Her characters are engaging and intriguing and there is even a bit of romance. What really touched my heart was Bhaaj's interaction with the children of the aqueducts. I spent the last fifty pages of the book sniffling into a tissue.\"—SFcrowsnest  \"I'm hooked, both on her writing and her Skolian universe. This book had everything I wanted: strong characters, a new and unique world, and a plot that isn't as simple as it first appears.\"—TerryTalk  About the Skolian Saga: “Entertaining mix of hard SF and romance.”—Publishers Weekly   “Asaro’s Skolian saga is now nearly as long and in many ways as compelling as Dune, if not more so, featuring a multitude of stronger female characters.”—Booklist  “Rapid pacing and gripping suspense.”—Publishers Weekly",
  "genres": [
    "Science Fiction",
    "Mystery",
    "Fiction",
    "Audiobook",
    "Science Fiction Fantasy",
    "Adventure",
    "Suspense"
  ],
  "author": "Catherine Asaro",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/52759192-the-vanished-seas"
}