{
  "title": "Somewhere Summer: 26 Kisses; How My Summer Went Up in Flames",
  "description": "Morgan Matson meets Kasie West in this perfect summertime read that includes two sizzling romances, 26 Kisses and How My Summer Went up in Flames, in one charming package!After heartbreak, the road back to redemption—and romance—can always be found… somewhere .In 26 Kisses , getting dumped by her boyfriend is not how Veda planned on starting her summer. Veda is heartbroken and humiliated—but, more importantly, she’s inspired. So she sets out on the love quest of a use the summer to move on and move up. All she has to do is kiss twenty-six boys with twenty-six different names—one for each letter of the alphabet.From the top of the Ferris wheel at her hometown carnival to the sandy dunes of Lake Michigan, Veda takes every opportunity she can to add kisses (and boys) to her list, and soon the break-up doesn’t sting quite as much. But just when Veda thinks she has the whole kissing thing figured out, she meets someone who turns her world upside down.In How My Summer Went up in Flames , Rosie’s always been impulsive. She didn’t intend to set her cheating ex-boyfriend’s car on fire. And she never thought her attempts to make amends could be considered stalking. So when she’s served with a temporary restraining order on the first day of summer vacation, she’s heartbroken—and furious.To put distance between Rosie and her ex, Rosie’s parents send her on a cross-country road trip with responsible, reliable neighbor Matty and his two friends. Forget freedom of the road, Rosie wants to hitchhike home and win back her ex. But her determination starts to dwindle with each passing mile. Because Rosie’s spark of anger? It may have just ignited a romance with someone new…Whether it’s somewhere in the alphabet, or somewhere on the open road—romance awaits!",
  "genres": [
    "Young Adult",
    "Romance"
  ],
  "author": "Anna Michels",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/52758913-somewhere-summer"
}