{
  "title": "The Heist",
  "description": "Her name is Michelle Dixon, but amongst the notorious smugglers of priceless artifacts, gems and artwork, in the world she is often to referred to as Chocolat. She is the oldest daughter of Pops’ Dixon, a notorious jewel thief with a vice for drinking and gambling. Thanks to her father’s unorthodox method of parenting, she’s learned the cruel double standards that being the best in thievery brings and longs for the day when she can leave the family business behind. After an unexpected tragedy freedom does come. The sudden death of Pops Dixon releases Michelle and her sister from his illegal legacy and she is determined to make a life change. Her desire for a straight life is within her grasp as she works at a small diner and waits for news on her acceptance into medical school. Then the bottom falls out of Michelle’s world.Pictures arrive of her sister bound and gagged. Kidnapped by a mobster known as Leith ‘Lee’ Sullivan. The man she's loved and loathed since she was sixteen. To keep her sister alive and pay off the debt of her now deceased father left behind, Michelle must once again enter the world she vowed to never return to.Lee is hell bent on drawing the Dixon sisters into his organization and fill the void Pops Dixon's death left in the business. Once he has Michelle under his control, he decides on yet another goal: to have her in his bed as well. Though a tide of lies, deceit, and uncharted passion what starts as revenge becomes an obsession that binds him to the elusive dark beauty. The more she resists the life he wants to offer her, the more determined he is to have her. Imperfect and unapologetic, Lee struggles with actions of the past that could drive her from him permanently.As the battle of love and hate between them wages on Michelle and Lee both learn more of her Pops Dixon motivations and why their fates were always destined. The Heist is the first installment in a trilogy packed with danger, adrenaline laced adventure, and heated passionate exploits that are certain to make your toes curl.",
  "genres": [
    "Romance",
    "Crime",
    "Interracial Romance"
  ],
  "author": "Sienna Mynx",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/12588368-the-heist"
}