{
  "title": "Fallout: The Hiroshima Cover-up and the Reporter Who Revealed It to the World",
  "description": "New York Times bestselling author Lesley M.M. Blume reveals how one courageous American reporter uncovered one of the deadliest cover-ups of the 20th century—the true effects of the atom bomb—potentially saving millions of lives. Just days after the United States decimated Hiroshima and Nagasaki with nuclear bombs, the Japanese surrendered unconditionally. But even before the surrender, the US government and military had begun a secret propaganda and information suppression campaign to hide the devastating nature of these experimental weapons. The cover-up intensified as Occupation forces closed the atomic cities to Allied reporters, preventing leaks about the horrific long-term effects of radiation which would kill thousands during the months after the blast. For nearly a year the cover-up worked—until New Yorker journalist John Hersey got into Hiroshima and managed to report the truth to the world.  As Hersey and his editors prepared his article for publication, they kept the story secret—even from most of their New Yorker colleagues. When the magazine published “Hiroshima” in August 1946, it became an instant global sensation, and inspired pervasive horror about the hellish new threat that America had unleashed. Since 1945, no nuclear weapons have ever been deployed in war partly because Hersey alerted the world to their true, devastating impact. This knowledge has remained among the greatest deterrents to using them since the end of World War II. Released on the 75th anniversary of the Hiroshima bombing, Fallout is an engrossing detective story, as well as an important piece of hidden history that shows how one heroic scoop saved—and can still save—the world.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Japan",
    "War",
    "Journalism",
    "Politics"
  ],
  "author": "Lesley M.M. Blume",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/52764193-fallout"
}