{
  "title": "The Other Madisons: The Lost History of a President's Black Family",
  "description": "\"A Roots for a new generation, rich in storytelling and steeped in history.\" —Kirkus Reviews, Starred Review \"A compelling saga that gives a voice to those that history tried to erase...Poignant and eye-opening, this is a must-read.\"—Booklist In The Other Madisons, Bettye Kearse—a descendant of an enslaved cook and, according to oral tradition, President James Madison—shares her family story and explores the issues of legacy, race, and the powerful consequences of telling the whole truth.   For thousands of years, West African griots (men) and griottes (women) have recited the stories of their people. Without this tradition Bettye Kearse would not have known that she is a descendant of President James Madison and his slave, and half-sister, Coreen. In 1990, Bettye became the eighth-generation griotte for her family. Their credo—“Always remember—you’re a Madison. You come from African slaves and a president”—was intended to be a source of pride, but for her, it echoed with abuses of slavery, including rape and incest.  Confronting those abuses, Bettye embarked on a journey of discovery—of her ancestors, the nation, and herself. She learned that wherever African slaves walked, recorded history silenced their voices and buried their footsteps: beside a slave-holding fortress in Ghana; below a federal building in New York City; and under a brick walkway at James Madison’s Virginia plantation. When Bettye tried to confirm the information her ancestors had passed down, she encountered obstacles at every turn.  Part personal quest, part testimony, part historical correction, The Other Madisons is the saga of an extraordinary American family told by a griotte in search of the whole story.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Memoir",
    "African American",
    "American History",
    "Politics"
  ],
  "author": "Bettye Kearse",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/52772978-the-other-madisons"
}