{
  "title": "Kings County",
  "description": "Seven years in the making, from critically acclaimed novelist and memoirist David Goodwillie, Kings County is an ambitious, exuberant, and wholly unforgettable tale of two star-crossed lovers in 21st-century Brooklyn, whose lives are torn apart after their deepest secrets come to light. It’s the early 2000s and like generations of intrepid young hopefuls before her, Audrey Benton arrives in New York City on a bus in the dead of winter, eager to escape her troubled past. Broke but resourceful, she soon finds a home for herself amid the burgeoning music scene in Williamsburg, Brooklyn. But the city’s freedom comes with risks, and Audrey makes dangerous compromises to survive. As she becomes a minor celebrity in indie music circles, she finds an unlikely match in Theo Gorski, a shy but idealistic mill-town kid—the first in his family to attend college—who’s struggling to establish himself in the still-patrician world of books. As artistic “Brooklyn” explodes around them, the young lovers forge a bond as unlikely as it is unbreakable. But when an old friend from Audrey’s past disappears under mysterious circumstances, it sparks a dangerous series of escalating crises that force her and Theo to confront, head on, a shocking secret that threatens not just their relationship, but their very lives. From the raucous protests of Occupy Wall Street to the hushed halls of the publishing world, from million-dollar art auctions to late-night Bushwick drug dens, Kings County captures New York City at a heightened moment of cultural reckoning. Confronting the resonant issues and themes of our time—sex and violence, art and commerce, friendship and family—it’s a new kind of love story, both coolly classic and vividly contemporary, that dazzles with wit and moral resonance, with two unforgettable characters at its core. Richly plotted and deeply humane, Kings County is an epic coming-of-age tale about bravery, consequences, and finding one’s place in an ever-changing world.",
  "genres": [
    "Fiction",
    "New York",
    "Romance",
    "Literary Fiction",
    "Contemporary",
    "Music",
    "Audiobook"
  ],
  "author": "David Goodwillie",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/52768117-kings-county"
}