{
  "title": "The Book of Lost Names",
  "description": "10 hours, 50 minutesInspired by an astonishing true story from World War II, a young woman with a talent for forgery helps hundreds of Jewish children flee the Nazis in this unforgettable historical novel from the international bestselling author of the “epic and heart-wrenching World War II tale” (Alyson Noel, #1 New York Times bestselling author) The Winemaker’s Wife.Eva Traube Abrams, a semi-retired librarian in Florida, is shelving books one morning when her eyes lock on a photograph in a magazine lying open nearby. She freezes; it’s an image of a book she hasn’t seen in sixty-five years—a book she recognizes as The Book of Lost Names. The accompanying article discusses the looting of libraries by the Nazis across Europe during World War II—an experience Eva remembers well—and the search to reunite people with the texts taken from them so long ago. The book in the photograph, an eighteenth-century religious text thought to have been taken from France in the waning days of the war, is one of the most fascinating cases. Now housed in Berlin’s Zentral- und Landesbibliothek library, it appears to contain some sort of code, but researchers don’t know where it came from—or what the code means. Only Eva holds the answer—but will she have the strength to revisit old memories and help reunite those lost during the war? As a graduate student in 1942, Eva was forced to flee Paris after the arrest of her father, a Polish Jew. Finding refuge in a small mountain town in the Free Zone, she begins forging identity documents for Jewish children fleeing to neutral Switzerland. But erasing people comes with a price, and along with a mysterious, handsome forger named Rémy, Eva decides she must find a way to preserve the real names of the children who are too young to remember who they really are. The records they keep in The Book of Lost Names will become even more vital when the resistance cell they work for is betrayed and Rémy disappears. An engaging and evocative novel reminiscent of The Lost Girls of Paris and The Alice Network, The Book of Lost Names is a testament to the resilience of the human spirit and the power of bravery and love in the face of evil.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "World War II",
    "Historical",
    "Audiobook",
    "Romance"
  ],
  "author": "Kristin Harmel",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/52771450-the-book-of-lost-names"
}