{
  "title": "The Thirty Names of Night",
  "description": "Five years after a suspicious fire killed his ornithologist mother, a closeted Syrian American trans boy sheds his birth name and searches for a new one. He has been unable to paint since his mother’s ghost has begun to visit him each evening. As his grandmother’s sole caretaker, he spends his days cooped up in their apartment, avoiding his neighborhood masjid, his estranged sister, and even his best friend (who also happens to be his longtime crush). The only time he feels truly free is when he slips out at night to paint murals on buildings in the once-thriving Manhattan neighborhood known as Little Syria.  One night, he enters the abandoned community house and finds the tattered journal of a Syrian American artist named Laila Z, who dedicated her career to painting the birds of North America. She famously and mysteriously disappeared more than sixty years before, but her journal contains proof that both his mother and Laila Z encountered the same rare bird before their deaths. In fact, Laila Z’s past is intimately tied to his mother’s—and his grandmother’s—in ways he never could have expected. Even more surprising, Laila Z’s story reveals the histories of queer and transgender people within his own community that he never knew. Realizing that he isn’t and has never been alone, he has the courage to officially claim a new name: Nadir, an Arabic name meaning rare.  As unprecedented numbers of birds are mysteriously drawn to the New York City skies, Nadir enlists the help of his family and friends to unravel what happened to Laila Z and the rare bird his mother died trying to save. Following his mother’s ghost, he uncovers the silences kept in the name of survival by his own community, his own family, and within himself, and discovers the family that was there all along.  Featuring Zeyn Joukhadar’s signature storytelling, The Thirty Names of Night is a timely exploration of how we all search for and ultimately embrace who we are.",
  "genres": [
    "Fiction",
    "LGBT",
    "Queer",
    "Historical Fiction",
    "Contemporary",
    "Literary Fiction",
    "Transgender"
  ],
  "author": "Zeyn Joukhadar",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/52764801-the-thirty-names-of-night"
}