{
  "title": "Realm of Dragons",
  "description": "“Has all the ingredients for an instant success: plots, counterplots, mystery, valiant knights, and blossoming relationships replete with broken hearts, deception and betrayal. It will keep you entertained for hours, and will satisfy all ages. Recommended for the permanent library of all fantasy readers.” --Books and Movie Reviews, Roberto Mattos (re The Sorcerer’s Ring)  “The beginnings of something remarkable are there.” --San Francisco Book Review (re A Quest of Heroes)  From #1 bestseller Morgan Rice, author of A Quest of Heroes (over 1,300 five star reviews) comes the debut of a startlingly new fantasy series.  REALM OF DRAGONS (Age of the Sorcerers—Book One) tells the story of the epic coming of age of one very special 16 year old boy, a blacksmith’s son from a poor family who is offered no chance of proving his fighting skills and breaking into the ranks of the nobles. Yet he holds a power he cannot deny, and a fate he must follow.  It tells the story of a 17 year old princess on the eve of her wedding, destined for greatness—and of her younger sister, rejected by her family and dying of plague.  It tells the tale of their three brothers, three princes who could not be more different from each other—all of them vying for power.  It tells the story of a kingdom on the verge of change, of invasion, the story of the dying dragon race, falling daily from the sky.  It tells the tale of two rival kingdoms, of the rapids dividing them, of a landscape dotted with dormant volcanoes, and of a capital accessible only with the tides. It is a story of love, passion, of hate and sibling rivalry; of rogues and hidden treasure; of monks and secret warriors; of honor and glory, and of betrayal and deception.  It is the story of Dragonfell, a story of honor and valor, of sorcerers, magic, fate and destiny. It is a tale you will not put down until the early hours, one that will transport you to another world and have you fall in in love with characters you will never forget. It appeals to all ages and genders.  Books two--THRONE OF DRAGONS--is also now available!  “A spirited fantasy ….Only the beginning of what promises to be an epic young adult series.” --Midwest Book Review (re A Quest of Heroes)  “Action-packed …. Rice's writing is solid and the premise intriguing.” --Publishers Weekly (re A Quest of Heroes)",
  "genres": [
    "Fantasy",
    "Dragons",
    "Fiction",
    "Audiobook",
    "Young Adult",
    "High Fantasy",
    "Magic"
  ],
  "author": "Morgan Rice",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/52764828-realm-of-dragons"
}