{
  "title": "Don't Ask Me Where I'm From",
  "description": "First-generation American LatinX Liliana Cruz does what it takes to fit in at her new nearly all-white school. But when family secrets spill out and racism at school ramps up, she must decide what she believes in and take a stand.Fifteen-year-old Liliana is fine, thank you very much. It’s fine that her best friend, Jade, is all caught up in her new boyfriend lately. It’s fine that her inner-city high school is disorganized and underfunded. It’s fine that her father took off again—okay, maybe that isn’t fine, but what is Liliana supposed to do? She’s fifteen! Being left with her increasingly crazy mom? Fine. Her heathen little brothers? Fine, fine, fine. But it turns out Dad did leave one thing behind besides her crazy family. Before he left, he signed Liliana up for a school desegregation program called METCO. And she’s been accepted. Being accepted into METCO, however, isn’t the same as being accepted at her new school. In her old school, Liliana—half-Guatemalan and half-Salvadorian—was part of the majority where almost everyone was a person of color. But now at Westburg, where almost everyone is white, the struggles of being a minority are unavoidable. It becomes clear that the only way to survive is to lighten up—whiten up. And if Dad signed her up for this program, he wouldn’t have just wanted Liliana to survive, he would have wanted her to thrive. So what if Liliana is now going by Lili? So what if she’s acting like she thinks she’s better than her old friends? It’s not a big deal. It’s fine. But then she discovers the gutting truth about her father: He’s not on one of his side trips. And it isn’t that he doesn’t want to come home…he can’t. He’s undocumented and he’s been deported back to Guatemala. Soon, nothing is fine, and Lili has to make a choice: She’s done trying to make her white classmates and teachers feel more comfortable. Done changing who she is, denying her culture and where she came from. They want to know where she’s from, what she’s about? Liliana is ready to tell them.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Realistic Fiction",
    "Audiobook",
    "Social Justice",
    "Race"
  ],
  "author": "Jennifer  De Leon",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/52766921-don-t-ask-me-where-i-m-from"
}