{
  "title": "The Secret Messenger",
  "description": "The highly awaited new novel from the USA Today bestselling author of The German Midwife.Venice, 1943The world is at war, and Stella Jilani is leading a double life. By day she works in the lion’s den as a typist for the Reich; by night, she risks her life as a messenger for the Italian resistance. Against all odds, Stella must impart Nazi secrets, smuggle essential supplies and produce an underground newspaper on her beloved typewriter.But when German commander General Breugal becomes suspicious, it seems he will stop at nothing to find the mole, and Stella knows her future could be in jeopardy.London, 2017Years later, Luisa Belmont finds a mysterious old typewriter in her attic. Determined to find out who it belonged to, Luisa delves into the past and uncovers a story of fierce love, unimaginable sacrifice and, ultimately, the worst kind of betrayal…Set between German-occupied 1940s Venice and modern-day London, this is a fascinating tale of the bravery of everyday women in the darkest corners of WWII, for readers of The Tattooist of Auschwitz by Heather Morris and The Lost Girls of Paris by Pam Jenoff.Praise for The Secret Messenger:‘Intriguing, pacy and fascinating.’ Suzanne Goldring, author of My Name is Eva‘Unique, emotional and life-affirming.’ Melanie Hudson, author of The Last Letter from Juliet‘A beautifully written novel, perfect for historical fiction lovers.’ Soraya M. Lane, bestselling author of The Girls of Pearl Harbor‘Another fantastic page-turner.’ LP Fergusson, author of A Dangerous Act of Kindness‘I felt I was walking alongside Stella over bridges and along canals at every heartstopping moment… Wonderful.’ Molly Green, author of An Orphan’s Wish‘One of the stronger novels that pays homage to the women involved in the movements of resistance.’ Reader review‘Refreshingly different. Even if you think you have read enough war books this year I strongly recommend you read this one.’ Reader review‘If you like WWII stories, this is a must read.’ Reader review‘Marvellous and highly recommended story on a little known aspect of WWII.’ Reader review",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "War",
    "Romance",
    "Audiobook"
  ],
  "author": "Mandy  Robotham",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/52762957-the-secret-messenger"
}