{
  "title": "The Steps: 12 Secrets To Raising Happy and Successful Kids",
  "description": "As parents, we are always searching for ways to raise our children smarter, better and happier.   In The Steps: 12 Secrets to Raising Happy and Successful Kids, authors and child development experts Andrew Watson, MD and Charles Watson, MD, Ph.D draw on decades of experience helping countless of struggling new parents to write an engaging translation of the best research in the field of positive parenting and child development.  Whether you are an expecting mother, new Mom or new Dad, or you are the experienced parent of a difficult teenager, you will find comfort and encouragement in this enlightening anecdote. While investigating the education system for an article, a journalist named Estela discovers The Steps, Dr. Michael Jansen’s innovative parenting protocol based on the recent advances of neuroscience and child psychology. The Steps targets the development of communication and language of the child, early reading, creativity, self-control, positive discipline, grit, and values, among other things, to give the right tools to promote the cognitive, psycho-motor, and affective skills of the baby, the child and the adolescent, producing highly successful adults with above-average abilities.Dr. Michael Jansen decides to share with Estela the 12 Steps from the protocol. In the meantime, she finds out about her own unplanned pregnancy. What better time to find out if The Steps really work?Although Estela and Dr. Jansen are fictional characters in this book, the child development research discussed in the book and its real-world value to parents are factual.   The 12 Steps contain vital parenting tips that any Mom or Dad can use to: \n   Increase the probability of your children being well-adjusted, self-confident and above average in school and social situations \n   Teach children to read and to love books at any early age and to advance faster than their peers \n   How to raise children with values and morals \n   Understand how babies learn and how positive reinforcement accelerates school success \n   How to encourage creativity for kids \n   Feel more confident in yourselves as parents and ensure that you are ready for your newborn baby \n   Set goals for children that guarantee success and teach your child the grit needed to achieve them \n   Deal with difficult parenting issues, like ADHD, lack of focus, antisocial behavior and low self-esteem",
  "genres": [
    "Parenting"
  ],
  "author": "Andrew    Watson",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/52775419-the-steps"
}