{
  "title": "White Too Long: The Legacy of White Supremacy in American Christianity",
  "description": "Drawing on history, public opinion surveys, and personal experience, Robert P. Jones delivers a provocative examination of the unholy relationship between American Christianity and white supremacy, and issues an urgent call for white Christians to reckon with this legacy for the sake of themselves and the nation.As the nation grapples with demographic changes and the legacy of racism in America, Christianity’s role as a cornerstone of white supremacy has been largely overlooked. But white Christians—from evangelicals in the South to mainline Protestants in the Midwest and Catholics in the Northeast—have not just been complacent or complicit; rather, as the dominant cultural power, they have constructed and sustained a project of protecting white supremacy and opposing black equality that has framed the entire American story. With his family’s 1815 Bible in one hand and contemporary public opinion surveys by Public Religion Research Institute (PRRI) in the other, Robert P. Jones delivers a groundbreaking analysis of the repressed history of the symbiotic relationship between Christianity and white supremacy. White Too Long demonstrates how deeply racist attitudes have become embedded in the DNA of white Christian identity over time and calls for an honest reckoning with a complicated, painful, and even shameful past. Jones challenges white Christians to acknowledge that public apologies are not enough—accepting responsibility for the past requires work toward repair in the present. White Too Long is not an appeal to altruism. Drawing on lessons gleaned from case studies of communities beginning to face these challenges, Jones argues that contemporary white Christians must confront these unsettling truths because this is the only way to salvage the integrity of their faith and their own identities. More broadly, it is no exaggeration to say that not just the future of white Christianity but the outcome of the American experiment is at stake.",
  "genres": [
    "Nonfiction",
    "Religion",
    "History",
    "Race",
    "Politics",
    "Christianity",
    "Christian"
  ],
  "author": "Robert P. Jones",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/52764767-white-too-long"
}