{
  "title": "The Zoologist's Guide to the Galaxy: What Animals on Earth Reveal about Aliens – and Ourselves",
  "description": "DISCOVER HOW LIFE REALLY WORKS - ON EARTH AND IN SPACEWe are unprepared for the greatest discovery of modern science. Scientists are confident that there is alien life across the universe yet we have not moved beyond our perception of 'aliens' as Hollywood stereotypes. The time has come to abandon our fixation on alien monsters and place our expectations on solid scientific footing.Using his own expert understanding of life on Earth and Darwin's theory of evolution - which applies throughout the universe - Cambridge zoologist Dr Arik Kershenbaum explains what alien life must be like: how these creatures will move, socialise and communicate.For example, by observing fishes whose electrical pulses indicate social status, we can see that other planets might allow for communication by electricity. As there was evolutionary pressure to wriggle along a sea floor, Earthling animals tend to have left/right symmetry; on planets where creatures evolved mid-air or in soupy tar they might be lacking any symmetry at all.Might there be an alien planet with supersonic animals? Will they scream with fear, act honestly, or have technology? Is the universe swarming with robots? Dr Kershenbaum uses cutting-edge science to paint an entertaining and compelling picture of extra-terrestrial life.The Zoologist's Guide to the Galaxy is the story of how life really works, on Earth and in space.***'If you don't want to be surprised by extraterrestrial life, look no further than this lively overview of the laws of evolution that have produced life on earth'  - Frans de Waal, author of Mama's Last Hug - Animal Emotions and What They Tell Us about Ourselves'A fun, and thoroughly biological, exploration of possible and impossible alien beings. If you'd love to know what real aliens from other planets might really be like, this is the book for you'  - Susan Blackmore, author of Seeing Myself'Surveying the deep-time of evolution on Earth and his own cutting-edge research into animal communication, Kershenbaum provides a fascinating insight into the deepest of questions: what might an alien actually look like'- Lewis Dartnell, author of Origins'Arik Kershenbaum takes us on a joyous voyage of animal diversity and illustrates the singular importance of natural selection in explaining life - here on Earth - and what will likely be discovered throughout the galaxy. A stimulating read!' - Daniel T. Blumstein, Professor of Ecology and Evolutionary Biology, University of California Los Angeles",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Nature",
    "Animals",
    "Space",
    "Evolution"
  ],
  "author": "Arik Kershenbaum",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/52770736-the-zoologist-s-guide-to-the-galaxy"
}