{
  "title": "Gage & Tyson",
  "description": "Tyson- Every Saturday morning during my shift at the diner, I’m graced with the presence of the most gorgeous man on the planet; Officer Gage Langston. The problem? I’ve always had a bit of verbal diarrhea when I get nervous, and Officer Langston makes me extremely nervous. Not because he’s a cop; I respect law enforcement, but I don’t fear them. No, my mouth becomes a geyser of stupidity when he’s around because I’ve had a raging crush on the man since the first time I saw him walk into the diner. The even bigger problem? Even if the sexy older man weren’t obviously straight, he’s way out of my league.  Gage- I have a problem; I’m borderline obsessed with the gorgeous man who waits on me every Saturday at the diner. I don’t even know that much about Tyson, except there is something about him that calls to me. I’m pretty sure he doesn’t feel the same way about me, though. Every week, I enjoy our conversations so much, even if I don’t know what the hell is happening half the time. He’ll ramble on and go off on wild tangents when he speaks. I love it; it’s like going on a car trip and taking all the detours to see the fun pit stops. But it always seems like he doesn’t enjoy our interactions as much as I do; I think I make him nervous. Probably because he can sense I like him, and he’s not too keen on having some old fart perving on him. Tyson is so young and precious and free-spirited. The last thing he needs is a predictable, graying, softening old man. He’s way out of my league.  *This M/M May-December romance is for readers 18 and up! It contains a sexy, loving cop, his bow tie wearing angel and their feisty best friends. It has no cheating or cliffhangers, and a very happy HEA. **My stories tend to be low on angst because it hurts my heart. They are, however, packed with sexy scenes, heartwarming moments and a healthy dose of humor.  Author’s Note   Thank you for your interest in my book! My stories tend to be low angst because it hurts my heart; I like getting to the good stuff and live for fluff. If “instalove” isn’t your thing, my books may not be for you. I want my readers to finish my books with a smile on their face and a fierce case of the warm and fuzzies. Laughter is guaranteed, and each read delivers its own type of drama. Thanks again for taking a look and happy reading!",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Humor",
    "Gay",
    "LGBT",
    "Found Family"
  ],
  "author": "Jayda Marx",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/52764588-gage-tyson"
}