{
  "title": "Winter Magnolia",
  "description": "In life we all experience some sort of point of no return. Now you may not realize it in the moment itself for they could be very adept at hiding their true nature and some only reveal themselves long after they have happened. They are the chameleons of the universe and they have mastered time itself. They could come to you in moments you least expect. As that stranger you sat next to on your way to work, or that one time you decided to say hello first to someone, or they could be hiding in the first book you have ever read. They could be small ripples or great storms that wash everything away you know leaving you with nothing to go back to. They are a force of creation hiding in moments of destruction.  To the author, it came as a thief in the night, who in one single moment, took away everything she had ever known. One moment she was a daughter with a mother and in the next she was not. One moment she was a sister with siblings and in the next she was not.  One moment she had a normal life and in the next she had not.  This book contains a collection of words written over a time period of one year whilst the author was living in a women's shelter after having escaped from a lifetime of living with an abusive family. In this period of darkness she found the light not by swimming to the surface, but by letting herself drown in the seas of her deepest fears. The writings found within this book are but an attempt of trying to capture an undefinable journey. Nevertheless, it is the author's hope that by sharing her journey one might be inspired to go on their own. \"Someone once asked me if I thought I had changed a lot after that year in the shelter. If I thought I had become a different person. I said no. For I only came home to the person I have always already been. It was as simple and difficult as that.\"",
  "genres": [],
  "author": "M.M. van der Reijden",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/52780530-winter-magnolia"
}