{
  "title": "Lift Her Up",
  "description": "All the ghosts of Wes’s past are coming back to haunt him in a big way. A handwritten letter changes everything when he finds out his brother, Sam, is alive after Wes has thought him dead for years. The one who has tracked him down? The love of Wes’s life, Summer, but when she shows up on his doorstep, she isn’t the bright and cheery girl he left all those years ago. Summer is different now--tough, snarly, independent, angry, and wrestling with an animal side that is relentless. Nothing can hide the dark beauty that radiates from her though. Her anger is Wes’s fault, but he had good reason. And now she is sending him on a mission to avenge his brother and set Sam free from a dominant pack of werewolves that thrive in war. His only ally is the woman who hates him the most.Summer isn’t so summery anymore. There are no happy rainbows hovering over her life right now as she struggles to control the savage wolf inside of her. She loved hard once, and got really burned, and now she’s back to send Wes on a fool’s mission that will probably get him killed. All she has to do is not get attached to the charming alpha of the Kaid Pack. That man was trouble since the day he was born, but there is something about Wes that calls to her. The more he reveals about the reasons he left her, the more she thinks she might have been wrong about everything, and now sending him on a mission to fight an entire pack doesn’t seem like such a good idea. If something bad happens to him, her heart might just get broken…again.The time has come. Time to heal, time to rise up, time to protect the throat of the man she once loved. Even if it means the end of her.Content Warning: Explicit love scenes, naughty language, and piles of sexy shifter secrets. Intended for mature audiences.",
  "genres": [
    "Shapeshifters",
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Westerns",
    "Fantasy",
    "Supernatural"
  ],
  "author": "T.S. Joyce",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/52805435-lift-her-up"
}