{
  "title": "Code Name Hélène",
  "description": "BASED ON THE THRILLING REAL-LIFE STORY OF SOCIALITE SPY NANCY WAKE, comes the newest feat of historical fiction from the New York Times bestselling author of I Was Anastasia, featuring the astonishing woman who killed a Nazi with her bare hands and went on to become one of the most decorated women in WWII.Told in interweaving timelines organized around the four code names Nancy used during the war, Code Name Hélène is a spellbinding and moving story of enduring love, remarkable sacrifice and unfaltering resolve that chronicles the true exploits of a woman who deserves to be a household name.It is 1936 and Nancy Wake is an intrepid New Zealand expat living in Paris who has bluffed her way into a reporting job for Hearst newspaper. She is fighting to cover the disturbing reports of violence coming out of Vienna and Berlin when she meets the wealthy French industrialist Henri Fiocca. No sooner does Henri sweep Nancy off her feet and convince her to become Mrs. Fiocca than the Germans invade France and she takes yet another name: a code name.As LUCIENNE CARLIER she smuggles people and documents across borders under the guise of an oblivious mistress. Soon enough the Gestapo hears of a female operative with a remarkable ability to evade capture, and Nancy earns a new nickname: THE WHITE MOUSE. But this one carries with it a five million franc bounty on her head. Forced to escape France and leave Henri behind for the safety of both of them, Nancy enters training with the Special Operations Executives, who transform her into HÉLÈNE. Finally, with mission in hand, Nancy is airdropped back into France as the deadly MADAM ANDRÉE. She soon becomes one of the most powerful leaders in the French Resistance, known for her ferocious wit, her signature red lipstick, and her ability to summon weapons straight from the Allied Forces. But no one can protect Nancy if the enemy finds out these four women are one and the same, and the closer to liberation France gets, the more exposed she--and the people she loves--will become.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "Book Club",
    "Audiobook",
    "War"
  ],
  "author": "Ariel Lawhon",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/52791659-code-name-h-l-ne"
}