{
  "title": "The Golden Oldies Guesthouse",
  "description": "‘Dee MacDonald’s books are so heart-warming. They make you laugh-out-loud one minute, and then have you crying the next… they’re really emotional and tug at the heart strings but are fun, life-affirming reads!’ Stardust Book Reviews  Tess and Simon Sparrow may have a few more grey hairs and wrinkles than they used to, but that doesn’t stop them being swept up in a whirlwind romance and starting over again. Swapping their city lives for an escape to the countryside, they fall in love with a crumbling hotel and impulsively buy it as their forever home to grow old in together…  Renovating the glorious, wisteria-clad property on the gorgeous cliff-tops of Cornwall was meant to be a delightful retirement project. But the dream soon turns into reality and practical Tess and optimist Simon are faced with leaky bathrooms, creaky stairs and a roof that’s just about holding up.  Running out of money fast, the couple decide to rent out a few rooms to save their new home.  Along come mysterious Celia, hapless romantic Benedict and tarnished, lovelorn actress Titania – all looking for a fresh start. Everyone in this eclectic group has their own reasons for being in Cornwall and across the summer they each go on a journey of self-discovery at The Golden Oldies Guesthouse as they realise there is still plenty of time for love, life, friendship… and a few unexpected surprises.  From the bestselling author of The Runaway Wife and The Silver Ladies of Penny Lane, this is a completely uplifting page-turner about embracing new friendships, finding love and making each day count. Perfect for fans of The Best Exotic Marigold Hotel and The Single Ladies of Jacaranda Retirement Village.  What readers are loving The Golden Oldies Guesthouse:  ‘Five golden stars for Dee McDonald’s latest… charming…The Golden Oldies Guesthouse features humor with a deft touch, charm, fun, love and romance…’ Jena Books, 5 stars  ‘Utterly charming!... It’s gentle, humorous, heart-warming and packed full of characters that you will remember long after the book is finished. I adored every word and my only complaint is that the story ended!’ NetGalley Reviewer, 5 stars  ‘Laugh out loud funny!! Such a light and charming book!! If you need a feel good, keeps your attention book then pick this one up!’ Goodreads Reviewer  ‘Absolutely loved everything about this book. It was charming and fun. I loved the characters and settings. Will be recommending.’ Goodreads Reviewer, 5 stars  ‘Loved this book, the characters, the setting. A really special read one I didn’t want to end. I will be recommending this special read.’ NetGalley Reviewer, 5 stars  ‘I loved every word of this delightful book! I fell in love with the story, the setting and the characters - what a fun place this be for a get-away!’ Meanderings and Muses  ‘A hilarious romp… larger than life characters…To",
  "genres": [
    "Fiction",
    "Audiobook",
    "Humor",
    "Chick Lit"
  ],
  "author": "Dee MacDonald",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/52837959-the-golden-oldies-guesthouse"
}