{
  "title": "Naughty Temptations: Collection One",
  "description": "A collection of BESTSELLING PARANORMAL STORIESFeaturing NY Times, USA Today, Amazon & International bestselling authors!Written by the Naughty Literati™Belle Scarlett, Berengaria Brown, Katherine Kingston, Nicole Austin, and N.J. WaltersSEX ME UP by Nicole AustinOne night at a Paris sex club—no-strings, complications or inhibitions—just lots of fantasy sex. But in the morning I forgot the most important rule. Never run from a feline predator—they live for the chase.ONE NIGHT WITH THE ALPHA KING by Belle ScarlettWhen Senator Anya Fortune snubs His Royal Majesty’s wedding offer, Shade wonders what an Alpha King has to do to get the woman to notice him… Claim the one, hot night he’s given by law to change her mind, naturally. Let the game of hearts begin. Winner take all.TAKE ME HOME by Nicole AustinGoing home isn’t easy, but my new stepbrother has me aching for the kind of love my sisters have found. Can I really have it all?DOGGED PURSUIT by Berengaria BrownDwyer’s nose is telling him Nelson is his mate. But werewolf tradition says a male’s mate is always a female.YOUR ONE AND ONLY by Nicole AustinMy day from hell took a delightful turn when I woke up naked next to the most gorgeous man. But he’d bitten me and claimed I was his mate. Oh my!PHANTOM AFFAIR by Katherine KingstonRobert is the best lover Kelly’s ever had, even though he’s a ghost. If he could return, could reality live up to the fantasy?DRAKON’S TREASURE by N.J. WaltersAfter five years as a slave, Eartha flees when an opportunity arises. Pursued by guards, she finds refuge with a tall stranger—Arrik Varkas Drakon, a drakon lord who is half-dragon, half-man. Danger follows them into the mountains. But their pursuers soon discover that a drakon always guards and keeps his treasure.HOW THE ALIEN STOLE CHRISTMAS by Belle ScarlettOn board a deep space station Christmas Trent learns her sexy cyber lover, who may not be human, wants to steal her for his own.KAHN’S HAVEN by Nicole AustinAnita Bennett’s fight to solve the mystery of eight lost days leads to a hunt for the jaguar-man who haunts her fractured memories. Her plan is simple—find and seduce him. What she didn’t anticipate is his resistance.WERE THE HELL? By Berengaria BrownSeptimus has to learn why no female weres have been born into his pack. When he walks into the meeting room he smells his mate. A male.WEAPON OF CHOICE by Katherine KingstonSelvya’s gift for controlling fire made her a weapon in the hands of unscrupulous men. The king’s commander offers a chance for revenge and redemption, but it’s a risk she’s not sure she can take.Publisher’s This is a collection of previously published stories.",
  "genres": [],
  "author": "Berengaria Brown",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/52843104-naughty-temptations"
}