{
  "title": "Screw",
  "description": "This book is a Hell's Handlers MC (#8) series / No Prisoners MC (#6) series -- crossover story.One biker in denial.One woman with secrets.One enforcer with something to prove.Three parts of one uncertain future . . .Jazmine lives with secrets she buries beneath conservative clothing and avoidance of relationships. Those secrets are just one reason she spends months resisting the advances of the Hell’s Handlers’ resident flirt, Screwball. Mostly, she can’t stand Screw’s constant parade of one-night stands and inability to be serious. But the man is charming, and her resolve is only so strong. When Gumby, a romantic interest from Jazz’s past, returns to her life, she suddenly finds herself stuck between two men who hate each other on sight yet seem inexplicably drawn together.As the new enforcer for the Hell’s Handlers Motorcycle Club, Screwball faces a challenge he’s avoided his entire life: the heavy weight of leadership. Now he’s in charge of protecting his club as threats from an enemy MC mount. Even though he doubts himself, Screw wants the opportunity to prove his worth to his brothers. Meanwhile, he also finds himself attracted to Jazz in a way he’s never experienced. When Jazz’s eye-catching biker from Arizona shows up in town, Screw finds himself wondering if a future full of commitment might be worth leaving his comfort zone.Having grown up with a brutal father who spoke with his fists, Gumby learned early to suppress certain sides of himself. When he crosses the country in search of a woman he can’t shake from his head, he not only finds her in danger but the object of one very appealing enforcer’s desire. He soon discovers denying his true identity can be impossible when faced with real temptation.Can three wounded souls overcome their baggage in time to save the Hell’s Handlers MC and their relationship?**This book is an MMF story, containing scenes of M/F, M/M, and MMF. Enjoy!",
  "genres": [
    "Romance",
    "Menage",
    "M M F",
    "Erotica",
    "Contemporary",
    "Crime",
    "M M Romance"
  ],
  "author": "Lilly Atlas",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/52816269-screw"
}