{
  "title": "The Courage to be Happy: True contentment is within your power",
  "description": "This book is a compass. Navigate and discover along your path the courage to be happy. The Courage to be Happy presents profound insights into living life courageously and finding happiness along the way. It has already sold more than a million copies in Japan and is a sequel to The Courage to be Disliked, which has changed lives across the globe as an international bestselling sensation. As in The Courage to be Disliked, we follow a Socratic dialogue between a philosopher and a young man. The philosopher believes that the key to a life of happiness and fulfilment is offered to us by the theories of Alfred Adler, a forgotten giant of 19th century psychology who has long been overshadowed by his two contemporaries, Freud and Jung. The young man is full of doubt that life can be genuinely improved by simply changing his thinking. Patiently, the philosopher explains the essence of Adler's 'psychology of courage', taking the young man through the mental steps necessary to achieve it, and demonstrating to the young man and to us the changes this psychology will bring to the way we live our lives. This is a work that is truly life-changing in its power and universally applicable in its scope. Author BiographyIchiro Kishimi was born in Kyoto, where he still lives, in 1956. He has aspired to become a philosopher since his days in high school. Since 1989, while specialising in Classical Western philosophy, with a special focus on Platonic philosophy, he has researched Adlerian psychology; he writes and lectures on the subject, and provides counselling for youths in psychiatric clinics as a certified counsellor and consultant for the Japanese Society of Adlerian Psychology. He is the translator, into Japanese, of selected writings by Alfred Adler: Kojin Shinrigaku Kogi (The Science of Living) and Hito wa Naze Shinkeisho ni Naru no ka (Problems of Neurosis), and he is the author of Adora Shinrigaku Nyumon (Introduction to Adlerian Psychology), in addition to",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Philosophy",
    "Personal Development",
    "Audiobook",
    "Spirituality"
  ],
  "author": "Ichiro Kishimi",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/52834772-the-courage-to-be-happy"
}