{
  "title": "American Prophets: The Religious Roots of Progressive Politics and the Ongoing Fight for the Soul of the Country",
  "description": "From one of the country's most respected religion reporters, a paradigm-shifting discussion of how the Religious Left is actually the moral compass that has long steered America’s political debates, including today.Since the ascendancy of the Religious Right in the 1970s, common wisdom holds that it is a coalition of fundamentalist powerbrokers who are the \"moral majority,\" setting the standard for conservative Christian values and working to preserve the status quo.But, as national religion reporter Jack Jenkins contends, the country is also driven by a vibrant, long-standing moral force from the left. Constituting an amorphous group of interfaith activists that goes by many names and takes many forms, this coalition has operated since America's founding — praying, protesting, and marching for common goals that have moved society forward. Throughout our history, the Religious Left has embodied and championed the progressive values at the heart of American democracy — abolition, labor reform, civil rights, environmental preservation.Drawing on his years of reporting, Jenkins examines the re-emergence of progressive faith-based activism, detailing its origins and contrasting its goals with those of the Religious Right. Today's rapidly expanding interfaith coalition  — which includes Christians, Jews, Muslims, Buddhists, and other faiths  —  has become a force within the larger \"resistance\" movement. Jenkins profiles Washington political insiders — including former White House staffers and faith outreach directors for the campaigns of Barack Obama, John Kerry, and Hillary Clinton — as well as a new generation of progressive faith leaders at the forefront today, including:Rev. William Barber II, leader of North Carolina's Moral Mondays and co-chair of the nationwide Poor People's campaignLinda Sarsour, co-chair of the Women's MarchRev. Traci Blackmon, a pastor near Ferguson, Missouri who works to lift up black liberation efforts across the countrySister Simone Campbell, head of the Catholic social justice lobby and the \"Nuns on the Bus\" tour organizerNative American \"water protectors\" who demonstrated against the Dakota Access Pipeline in Standing RockBishop Gene Robinson, the first openly gay Episcopal bishopAn exciting reevaluation of America's moral center and an inspiring portrait of progressive faith-in-action, American Prophets will change the way we think about the intersection of politics and religion.",
  "genres": [
    "Religion",
    "Politics",
    "History",
    "Nonfiction",
    "American History",
    "Faith",
    "Theology"
  ],
  "author": "Jack Jenkins",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/52852738-american-prophets"
}