{
  "title": "The Scream: The Music, Myths and Misbehaviour of Primal Scream",
  "description": "'We just want to make beautiful music. Whatever it takes to do that we’ll do it, by any means necessary' – Bobby Gillespie, 1991 In 1991 a Scottish band called Primal Scream, who had been knocking around the music scene in London to little acclaim, released their third album. It was called Screamadelica. With its hazy fusion of punk, rock, dance and psychedelia it became an instant classic, a cutting edge monster that slayed anyone in its path, be they indie-kid or dance loony. Rock journalist, DJ and dedicated muso Kris Needs went to interview singer Bobby Gillespie at the offices of Creation records. It was a meeting of minds and before long Kris was aboard the Scream carousel, joining the band on tour and opening as DJ at their gigs. An insider with their notorious entourage, despite some riotous living Needs recounts the evolution of Screamadelica with remarkable clarity and the fervour of a true enthusiast, combining a wry take on the band’s recreational habits with detailed knowledge of their music. He credits the input from DJ/producers Andrew Weatherall and Alex Paterson of The Orb, who took tracks such as Higher than the Sun, already a beatific drugs anthem, “wrapped it in technicolour gossamer and booted it into the orbit, shimmering and reeling in a hallucinogenic mind-warp”. Others came along for the ride – Jah Wobble of Public Image Ltd, bass player Mani of the Stone Roses and fellow Scot Irvine Welsh. Primal Scream wrote and performed the title track for the hit film of his novel Trainspotting, thereby securing their place in alternative modern culture. Screamadelica is now considered a seminal work, appearing in countless lists of top albums ever made and one of only 21 chosen for BBC4’s series on the making of classic albums. Unlike so many other successful bands Primal Scream have remained together, despite the tragic death of original guitarist Throb. They have produced further hit albums and continue to tour, led by charismatic, articulate founding member Bobby Gillespie. Originally published in 2003, this edition has a 2019 foreword by Kris, now a legendary rock journo, and is the definitive biography of this iconic British band. ‘The surprisingly coherent tale of some of rock music’s most exciting underlying ideals – scattershot dissent, mind expansion through chemical excess – recurrently colliding with an intuitive need to experiment. Better still, as the songs pile up and their owners approach 40, the music becomes angrier, yet more out-there and often simply better’ - Q Magazine ‘The arrival of the Scream is like the breaking open of the heavens. At last there’s a rock band onstage, blasting through their greatest hits at 500 miles an hour’ - New Musical Express 'A rollicking tale driven by the author's unbridled enthusiasm for the group and their music' - Q magazine 'The High Priest of Scream, Needs, admits us to the Inner Temple of holy hedonism' - X-RAY Magazine 'A highly entertaining picture of the 24-hour party inside the silver Scream machine' - Mojo Magazine After running Mott The Hoople's fan club, veteran rock journalist Kris Needs wrote for NMEand Sounds, edited the seminal Zigzag, and was UK correspondent for Creem. He spent the 90s as a DJ and record producer before returning to writing.",
  "genres": [],
  "author": "Kris Needs",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/52850546-the-scream"
}