{
  "title": "The Last Honey Bee",
  "description": "Look at me, I'm wild and free. Look at me, I'm Manderlee. Manderlee, that's me. Manderlee, the last honey bee.Learn about Manderlee, an adventurous honey bee, and the challenges she must overcome in this beautifully illustrated rhyming story for ages 3+.When her hive is destroyed, Manderlee must find a new home. Learn about the importance of honey bees, and join Manderlee on her perilous journey to a foreign land. Will the last honey bee survive?The Last Honey Bee was a finalist in The Wishing Shelf Book Awards 2019.Reviewed by Michelle Stanley for Readers' Favorite - 5 StarsThe Last Honey Bee is a children’s picture book from Wayne Gerard Trotman’s Rhyming Stories series. Manderlee is a very sad honey bee. Humans destroyed the thriving bee colony she lived in with fire and poison. The queen bee, drones, and worker bees perished, but Manderlee survived. She had to travel far to seek a new colony and was almost made into honey bee cake by Kala Kaghee, an angry seagull. As she searches for a new hive to live in, Manderlee explains the importance of bees and why humans shouldn’t tear their wings or harm them. They produce tasty honey and pollinate the plants so our favorite fruits like pears, mangoes and strawberries can grow. Manderlee’s wings are very tired from flying too long. She’s also lonely, hungry and misses her honey-making job. Will she ever find a new colony of bees to start a new life and make friends?Manderlee is such an adorable bee. I felt her sorrow at losing her entire colony. The Last Honey Bee is a superb children’s book containing beautiful illustrations to match the adventure. Manderlee expresses her fears and concerns about colonies and offers advice to humans. It’s written in a moderately paced rhyming sequence that’s rather moving. The story is educational and is a great way for children to learn about nature and its importance to everyone. You will also meet other lovable characters such as Paddy McFly, and Romeo Cassanova. This is one of the cleverly written novellas from Wayne Gerard Trotman’s Rhyming Stories that will attract young readers. They will love it.",
  "genres": [],
  "author": "Wayne Gerard Trotman",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/52844904-the-last-honey-bee"
}