{
  "title": "The Crollalanzas",
  "description": "“I have seen the day I am to die.And I have seen the man who will murder me— he who will, one day, snuff out my flame. It is an odd thing to foresee one’s departure from life and the face of the man with the means to bring it about. I can only hope I have some time yet before he comes to find me.But what is worse: knowing one’s fate in advance and worrying over it, at the cost of all present and possible joys, or being ignorant of what is to come and waking each day without that cloud above; to be allowed excitement without restriction; to live without limitation, until the very end?” So writes Truzia Crollalanza inside me: her diary.She had a vision, you see, and she knows the face of her cursed enemy as well as she knows her own reflection. And that is before they ever meet in person. Unfortunately for Truzia, this man—the harbinger of her doom— turns out to be far more amusing and tempting company than she expected.Her life, and her death, are about to become complicated. * * *In Renaissance Venice, the sisters Crollalanza are raised by their mother to walk with their heads high, question everything, settle for nothing and always fight for justice. But as women ahead of their time, they are curiosities to their gossiping neighbors, and a dangerous— even deadly— menace to the men who would control them. Some claim these prideful women keep dark secrets and strange customs. In their presence, more than one flying flower pot has struck a man’s head. Entirely, it seems, by its own power, without the ladies’ hands being seen to propel it.They ought to be stopped; their outspoken ways must be suppressed, before other women are encouraged to rebellion. Everybody knows the world is best managed by men.But these eccentric females are determined to manage their own affairs, including love, magic and vengeance. Now they embark upon a journey to a new land, a new life, and it’s wise not to get in their way. You might find yourself trapped in the privy, thrashed about the kneecaps by a flying ladle, or elf-locked by an inexplicable desire.All this wickedness you will find confessed within me: the youngest sister’s diary. If you can believe what you read within my pages. She does, after all, enjoy story-telling, games and trickery. Here, in this new country, she tries to outrun the fate she long ago foresaw, while living every moment she has left to its fullest. And I, her diary, try to keep up with it all, in… The Partially Comical and Oft-Times Tragical History of Three Sisters and a truffle pig, told with select examples of drollery, dignified into scenes by way of dialogue, arranged for the pleasure and benefit of all curious persons.Modernized, henceforth, in spelling and punctuation. The main of it translated, for better or worse.The like never before published (mayhap with reason sound, if good profit be the aim).",
  "genres": [],
  "author": "Jayne Fresina",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/52861417-the-crollalanzas"
}