{
  "title": "Woody Notes, and Heat Sneaking up Fast",
  "description": "Danny Winter is a student of the human condition, and in this book, he does what he does best; write poems with passion and pizazz. What can I tell you about Danny? He has a ferocious spirit and vigour. He has high moods and an instinctive ability to perceive and understand the world around him. He has a fierce sense of loyalty, he’s romantic, quixotic and starry-eyed, all of which is a gift from his Gypsy heritage. These are all talents, of course, which have given Gypsies a lot of survival skills to match their really dark sense of humour.But Danny also brings smiles to everyone he meets, a gift I truly believe comes from a higher source. There is no denying, however, that at times he can be restless, carrying the capacity for vastly darker moods, melancholy energies and occasional bouts of madness. Writers, poets, artists, musicians and circus clowns often suffer from boisterous and raucous dispositions. And it’s true they can get into trouble at times. They wear their moods as their ships of passage, and Danny is no different. He suffers from what Lord Byron would term a “fine madness.” He throws out poems in a sparkle of energy. And he puts everything into the words. They just arrive on paper as though a higher being is working through him. I can’t explain this, but it’s how it happensI’ve known Danny for over 40 years, since we shared a room together at a seaside town in the South coast of England. So my opinion? He’s probably a bit of a mad genius, although he loves the world and everyone in it, and if just one person enjoys this book then Danny will sleep with a smile on his face tonight. Danny is a stargazer who tells fortunes with his poetry,As we publish this book we’re right in the middle of a pandemic, but we’ll get over it. It’s just another crisis. And Danny has written several poems on this subject, some of which are actually very funny. And in the book you’ll also find poems on a variety of subjects; England, football, religion, Alzheimer’s, alcoholism, drug abuse, homelessness, ageing, the love of pets, the military, boxers, kindness and, of course, Gypsies and Travellers. I'm also grateful to Danny for allowing me to contribute a few poems myself We hope you enjoy Karl Wiggins",
  "genres": [
    "Poetry"
  ],
  "author": "Danny Winter",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/52848979-woody-notes-and-heat-sneaking-up-fast"
}