{
  "title": "Man of Tomorrow: The Relentless Life of Jerry Brown",
  "description": "Visionary. Iconoclast. Political Survivor. \"A powerful and entertaining look\" (Governor Gavin Newsom) at the extraordinary life and political career of Governor Jerry Brown.Jerry Brown is no ordinary politician. Like his state, he is eclectic, brilliant, unpredictable and sometimes weird. And, as with so much that California invents and exports, Brown's life story reveals a great deal about this country.   With the exclusive cooperation of Governor Brown himself, Jim Newton has written the definitive account of Jerry Brown's life. The son of Pat Brown, who served as governor of California through the 1960s, Jerry would extend and also radically alter the legacy of his father through his own service in the governor's mansion. As governor, first in the 1970s and then again, 28 years later in his remarkable return to power, Jerry Brown would propound an alternative menu of American values: the restoration of the California economy while balancing the state budget, leadership in the international campaign to combat climate change and the aggressive defense of California's immigrants, no matter by which route they arrived. It was a blend of compassion, far-sightedness and pragmatism that the nation would be wise to consider.  The story of Jerry Brown's life is in many ways the story of California and how it became the largest economy in the United States. Man of Tomorrow traces the blueprint of Jerry Brown's off beat risk-taking: equal parts fiscal conservatism and social progressivism. Jim Newton also reveals another side of Jerry Brown, the once-promising presidential candidate whose defeat on the national stage did nothing to diminish the scale of his political, intellectual and spiritual ambitions.  To the same degree that California represents the future of America, Jim Newton's account of Jerry Brown's life offers a new way of understanding how politics works today and how it could work in the future.",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "History"
  ],
  "author": "Jim Newton",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/52879252-man-of-tomorrow"
}