{
  "title": "On Herring Cove Road: Mr. Rosen and His 43Lb Anxiety",
  "description": "A troubled old man, his doting but ill wife, and the salvation that follows his friendship with the lonely child of his racist neighbor. Once an amusing extrovert with a reputation as a prankster, Mr. Rosen is entering his senior years as a stoic thirty-year converted introvert who has little to no interest in people, hates change, and is more than content to have his wife gently take the navigator's seat of his life. Since becoming a practicing introvert, there have been only a few changes in his life, and for each of those changes his wife had walked him through them, including their recent move to a much smaller home in a middle-class neighborhood where he lives next to a racist whose pint-sized son addresses him as Mr. Jew.Mr. Rosen had seen the move coming and he's very much aware of the enormous change to come that will force him to chart his own life's route, though he refuses to think about it, but he's not aware of the change that will come from the child next door. A change that could offer him a second chance at life... if he would allow himself to take it.This cozy story of an unlikely friendship offers a roller coaster of emotion as Mr. Rosen's comfortable world begins to implode while on a collision course with the chaotic world of a boy, his troubled mother and vengeful father.ABOUT THE SERIESTaking place in Halifax, Nova Scotia, the series follows the sometimes amusing, sometimes heartwarming, sometimes heartbreaking and sometimes terrifying events that follow an introverted old Jewish man’s retirement as he reluctantly befriends a naive and lonely boy, his struggling single mother, and lastly, a boy streetwise beyond his years.\"I don't usually enjoy books in a series but this was an exception. It was uplifting, and interesting with some twists I didn't see coming...It wasn't all sweet and goody two shoes either. It had some dark and realistic moments and characters. Very well written.\" -(Amazon Customer)Volume 1) On Herring Cove Road: Mr. Rosen and His 43Lb AnxietyVolume 2) Still on Herring Cove Road: Hickory, Dickory, DeathVolume 3) Off Herring Cove Road: The Problem Being BlueVolume 4) Before Herring Cove Road: Ruth Goldman and the Nincompoop",
  "genres": [
    "Fiction",
    "Book Club",
    "Jewish",
    "Canada",
    "Modern"
  ],
  "author": "Michael Kroft",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/52878955-on-herring-cove-road"
}