{
  "title": "Death in Her Hands",
  "description": "A novel of haunting metaphysical suspense about an elderly widow whose life is upturned when she finds a cryptic note on a walk in the woods that ultimately makes her question everything about her new home. While on her normal daily walk with her dog in the forest woods, our protagonist comes across a note, handwritten and carefully pinned to the ground with a frame of stones. \"Her name was Magda. Nobody will ever know who killed her. It wasn't me. Here is her dead body\". Our narrator is deeply shaken; she has no idea what to make of this. She is new to area, having moved her from her longtime home after the death of her husband, and she knows very few people. And she's a little shaky even on best days. Her brooding about this note quickly grows into a full-blown obsession, and she begins to devote herself to exploring the possibilities of her conjectures about who this woman was and how she met her fate. Her suppositions begin to find echoes in the real world, and with mounting excitement and dread, the fog of mystery starts to form into a concrete and menacing shape. But as we follow her in her investigation, strange dissonances start to accrue, and our faith in her grip on reality weakens, until finally, just as she seems be facing some of the darkness in her own past with her late husband, we are forced to face the prospect that there is either a more innocent explanation for all this or a much more sinister one - one that strikes closer to home.A triumphant blend of horror, suspense, and pitch-black comedy, 'Death in Her Hands' asks us to consider how the stories we tell ourselves both guide us closer to the truth and keep us at bay from it. Once again, we are in the hands of a narrator whose unreliability is well earned, only this time the stakes have never been higher.",
  "genres": [
    "Fiction",
    "Mystery",
    "Horror",
    "Thriller",
    "Literary Fiction",
    "Contemporary",
    "Mystery Thriller"
  ],
  "author": "Ottessa Moshfegh",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/52878453-death-in-her-hands"
}