{
  "title": "Humankind: A Hopeful History",
  "description": "From the author of Utopia For Realists, a revolutionary argument that the innate goodness and cooperation of human beings has been the greatest factor in our successIf one basic principle has served as the bedrock of bestselling author Rutger Bregman's thinking, it is that every progressive idea -- whether it was the abolition of slavery, the advent of democracy, women's suffrage, or the ratification of marriage equality -- was once considered radical and dangerous by the mainstream opinion of its time. With Humankind, he brings that mentality to bear against one of our most entrenched ideas: namely, that human beings are by nature selfish and self-interested.By providing a new historical perspective of the last 200,000 years of human history, Bregman sets out to prove that we are in fact evolutionarily wired for cooperation rather than competition, and that our instinct to trust each other has a firm evolutionary basis going back to the beginning of Homo sapiens. Bregman systematically debunks our understanding of the Milgram electrical-shock experiment, the Zimbardo prison experiment, and the Kitty Genovese \"bystander effect.\"In place of these, he offers little-known true stories: the tale of twin brothers on opposing sides of apartheid in South Africa who came together with Nelson Mandela to create peace; a group of six shipwrecked children who survived for a year and a half on a deserted island by working together; a study done after World War II that found that as few as 15% of American soldiers were actually capable of firing at the enemy.The ultimate goal of Humankind is to demonstrate that while neither capitalism nor communism has on its own been proven to be a workable social system, there is a third option: giving \"citizens and professionals the means (left) to make their own choices (right).\" Reorienting our thinking toward positive and high expectations of our fellow man, Bregman argues, will reap lasting success. Bregman presents this idea with his signature wit and frankness, once again making history, social science and economic theory accessible and enjoyable for lay readers.",
  "genres": [
    "Nonfiction",
    "History",
    "Psychology",
    "Philosophy",
    "Science",
    "Audiobook",
    "Politics"
  ],
  "author": "Rutger Bregman",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/52879286-humankind"
}