{
  "title": "The Viscount and the Vixen",
  "description": "A Deadly Debutante  Twice engaged and twice bereaved, Rose d'Aubrey is prime fodder for the gossips of London. Though she has resigned herself to a spinster's life in service of her family, she has agreed to return for one final Season, to ensure her beloved cousin has the perfect debut.  When it is revealed that there will be no debut at all, but rather a hasty marriage to a wealthy viscount, Rose is tasked with managing the explosive fallout within her family, and rescuing her cousin from a life she does not want.  A Venerable Viscount Lord Gideon Somers has dedicated his life to rebuilding his family's honor, often at the expense of his own happiness. When his wild little sister finds herself compromised out of wedlock, he must find a way to mitigate the damage.  An old marriage contract, engineered by his drunken wastrel of a father, might be the only way to save House Somers from ruin. What he didn't foresee was the involvement of Rose d’Aubrey, a favorite of the gossip sheets and the only woman he's ever truly wanted.  Scandals Upon Scandals An unwilling bride, an explosive secret, and an unresolved infatuation drive Gideon to his breaking point. No longer able to deny his desires, he strikes a devil’s bargain with Rose, a proposition that will change both of their lives forever.  A mad flight under the cover of darkness sends them racing toward elopement and the unknown. Thrown together, away from the demands of their families and the judgmental eyes of Society, Rose and Gideon find themselves with no one's wants to consider but their own. Years of restraint are tested, secrets unravel, and temptation burns hot in this steamy adventure of duty and desire.  The Viscount and the Vixen is Ava Devlin’s debut novel, and the first installment in The Somerton Scandals series.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Friends To Lovers",
    "Amazon"
  ],
  "author": "Ava Devlin",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/52886879-the-viscount-and-the-vixen"
}