{
  "title": "High Life at the End of the World",
  "description": "High Life at the End of the World – book 1 of 3 in the Preppers series by C&V GuyerThe end of the world started the day the alien spaceships appeared in the sky. They killed the men and took the women. Doing things to their minds, taking away their memories and intelligence, turning them into mindless sex slaves. The men that escaped their death rays went underground, living as mole people. And I’m the only woman left on the planet.Okay, so I’m totally messing with you. I don’t have a clue how the end of the world happened. No one does. Could have been a terrorist attack or it could have just been mother nature finally fed up with taking all the crap the humans were dishing. All I know is that for the first time in my 19 years on this planet, I got lucky. Real damn lucky.While the Ragers (that’s what I call them, anyway, feel free to make up your own name) stumble about the world, growling, snarling and looking generally angry, I am sipping my iced lemonade on my pool floatie. Working on my tan and just catching some rays.Yeah, the universe decided I would survive the end of the world when it had my cousin ditch her job to spend the weekend with her boyfriend. She begged me to cover her shift as a maid for some million-dollar house in a gated community. Me, being the good cousin I am, agreed to poke through a millionaire’s things under the pretense of cleaning. Don’t deny it, you would snoop too if you had the chance.So yeah, there’s a pool, a giant library, an entertainment room and a state-of-the-art bunker completely stocked with food and supplies. Yup, you read that right! The millionaire is a super prepper! It’s seriously like the universe saved up all my good luck for one big life changing lucky break. But really, it can’t possibly get any better, right?Oh, yeah, did I forget to mention the five hot guys that live in the community that could make even a female Rager stop and stare in awe? And did I mention the only other woman in the community is an old lady?I’ll just be living the High Life at the End of the World if you need me.",
  "genres": [
    "Reverse Harem",
    "Zombies",
    "Humor",
    "Post Apocalyptic",
    "Dystopia",
    "Comedy",
    "Romance"
  ],
  "author": "C.V. Guyer",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/52881550-high-life-at-the-end-of-the-world"
}