{
  "title": "Caged Kitten",
  "description": "I don’t belong here. Seriously. I don’t.For as long as I can remember, supernatural clans took care of their own bad apples. Shifters, fae, vampires, elves, witches—we handled our crap quietly, efficiently, and within the confines of our community’s law.Until now, apparently.How else am I supposed to explain doing inventory in my café one minute, then waking up the next in a processing cell, cuffed and shackled to a chair, wearing a collar that mutes my magic?I’ve never gotten so much as a parking ticket before. I’m a witch without a coven, but I play by the rules. I don’t start beef with other supers. Me and my familiar—we don’t make waves. We like cozy, rainy Sunday afternoons and the smell of freshly baked bread.So, whatever they’ve got on me, it’s nonsense.I know, I know. That’s what everyone in Xargi Penitentiary says. Innocent. Innocent. Innocent.Only the creatures around me aren’t always so innocent, and even inside these four walls, trapped by wards and warlocks and wolves, my past is determined to damn me.Until I find a non-magical way out of this, my wits are all I’ve got.Well, my wits… and the gruff dragon shifter who looks at me like I’m treasure he’s desperate to hoard. The gorgeous fae who delights in the fact that I’m not impressed with him. Oh, and the brooding vampire who could tempt me into darkness with his smile.But I’m not here to make friends or fall in love.I don’t belong in Xargi Penitentiary, and if it’s the last thing I ever do, I’m getting out.Or… I just might die trying.Caged Kitten is a standalone why-choose paranormal romance and is part of the ALL THE QUEEN’S MEN series. Each book in the series is a full-length standalone featuring layered heroes and a headstrong heroine who never has to settle for just one happily-ever-after. The books can be read in any order and are part of the same supernatural universe.",
  "genres": [
    "Reverse Harem",
    "Vampires",
    "Dragons",
    "Fantasy",
    "Fae",
    "Paranormal",
    "Romance"
  ],
  "author": "Rhea Watson",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/52874823-caged-kitten"
}