{
  "title": "Born With a Bang: The Universe Tells Our Cosmic Story",
  "description": "The big bang is where it all started! Kids will learn it all in this scientifically accurate book telling the story of the universe up until the formation of young Earth. Gorgeous and ethereal illustrations and a story that brings children into a state of connectedness with the universe makes this an amazing cosmology book for parents and teachers who want to instill in kids a deep appreciation for themselves, their community, and the need to protect this planet that we all reside. When we take the time to learn about the beginnings of the universe, the miraculous conditions that make our existence possible, and how we are physically part of everything around us, a sense of connection forms and hopefully results in a desire to do good for the world around us and everyone in it. This book begins by reminding readers of our beginning. We start as a tiny speck inside our mother as the universe began as a tiny speck. \"It's hard to imagine that I started out so small. But I did. And if you ask me where I came from, I would tell you that I don't know. It's the greatest of all mysteries.\" And like babies do not stay small inside the mother, the universe could not stay small either. As we move through the pages, the science is apparent, but there is a narrative coming from the universe telling of all of it's dreams and desires. It is fun and easy for readers to absorb the basic facts of the development of the universe, sun and planets and also remain engaged to the beautiful mystery of everything around us. We move from the early grapefruit size particles and then the massive explosions developing into galaxies. The tiny particles formed from energy soon became atoms of hydrogen, then came carbon and oxygen. All the planets were born and Earth, too. A perfect book",
  "genres": [
    "Science",
    "Picture Books",
    "Childrens",
    "Space",
    "History",
    "Prehistory",
    "Nonfiction"
  ],
  "author": "Jennifer Morgan",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/528716.Born_With_a_Bang"
}