{
  "title": "A Novel Idea",
  "description": "Do you dream of writing a novel? Has anyone ever said, \"You should write a story about that.\" If so, you may have a novel idea within you. Start your novel today. This quick study guide helps you learn the basic elements of novel writing, so you can make real progress on your novel today. The print copy makes a great gift for anyone who dreams of a becoming a published author.\nA Novel Idea\n includes instructional materials, notes, and handouts from workshops taught by the author over the past 10 years at writers' conferences. The intent of this book is to PRESENT the basic elements of novel writing in UNDER 60 MINUTES. Do not expect lengthy explanations or examples of how to use these techniques. Think of this book as Cliff's Notes© for a novelist. When your plot sags, dialogue drags, or scenes feel stale, pull out this book and re-read sections. Chances are, a quick review of the basics will inspire you to push on.Topics include:How To Write PlotWe remember characters; we pitch plot. In this section you'll learn how to map your story using the \"passage markers\" that shape every story's journey. From introduction and motivation to your Lead's moment of maximum angst, you'll see how easy it is to develop a story that keeps your characters on the path to a confrontational climax.How To Write Scenes!Making a scene is as easy as: ABCD - Action, Backstory, Conflict, Decision. A good scene reveals information that moves the story forward (new goals, old secrets, hidden motives), shows conflict between characters (adds tension), deepens your characters' development, and creates suspense (introduces a new wrinkle that leaves the reader hanging). Learn the three keys to scene summary, how to create memorable moments in your story, and what four questions you should ask of each scene.How To Write DialogueDialogue can breathe life into any fiction or non-fiction story. In this section we examine what a scene is: Doing (Action), Thinking (Narrative), and Talking (Dialogue). Learn when to add tags, when to skip tags, and where to place tags. Explore the types of dialogue -- Direct, Reflective, Misdirected, Modulated, Descriptive, Breathless, and Compressed.How To Create Compelling CharactersCompelling characters are larger than life. They risk more, laugh often and love with passion. In this section you'll learn how to invent both likable and loathsome main characters, heroes and heroines, reflection, nemesis and supporting characters. Examine your Lead's motivation, focus on his or her flaws, and explore the feelings of your hero/heroine. You'll see how conflict, crisis, and consequences shape your characters.How to Write Romance & Romantic ComedyRomantic comedies are stories with light-hearted, humorous plots that demonstrate how true love can overcome all obstacles. In a typical romantic comedy, the two lovers tend to be young, likable, and apparently meant for each other, yet they are kept apart by complicating circumstances. A happy ending is always the result. Learn the basic story structure of romance and romantic comedies in less than ten minutes.How to Write Cozy MysteriesDespite changes within the book publishing industry, cozy mysteries remain popular. Cozy mysteries allow readers to fall in love with a quirky sleuth while at the same time solving a puzzle. Cozies avoid profanity, graphic violence, and overt sexual scenes. For readers, the payoff has less to do with \"who done it\" and more to do with \"how the who done it.\" Learn the basic story structure of cozy mysteries in less than ten minutes. Note: much of the information in this section can also be adapted to general murder mysteries, suspense, and thrillers.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Eddie       Jones",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/52896746-a-novel-idea"
}