{
  "title": "The Lies That Bind",
  "description": "In the irresistible new novel from the #1 New York Times bestselling author of All We Ever Wanted and Something Borrowed, a young woman falls hard for an impossibly perfect man before he disappears without a trace. . . . It's 2 A.M. on a Saturday night in the spring of 2001, and twenty-eight-year-old Cecily Gardner sits alone in a dive bar in New York's East Village, questioning her life. Feeling lonesome and homesick for the Midwest, she wonders if she'll ever make it as a reporter in the big city--and whether she made a terrible mistake in breaking up with her longtime boyfriend, Matthew.As Cecily reaches for the phone to call him, she hears a guy on the barstool next to her say, \"Don't do it--you'll regret it.\" Something tells her to listen, and over the next several hours--and shots of tequila--the two forge an unlikely connection. That should be it, they both decide the next morning, as Cecily reminds herself of the perils of a rebound relationship. Moreover, their timing couldn't be worse--Grant is preparing to quit his job and move overseas. Yet despite all their obstacles, they can't seem to say goodbye, and for the first time in her carefully constructed life, Cecily follows her heart instead of her head.Then Grant disappears in the chaos of 9/11. Fearing the worst, Cecily spots his face on a missing-person poster, and realizes she is not the only one searching for him. Her investigative reporting instincts kick into action as she vows to discover the truth. But the questions pile up fast: How well did she really know Grant? Did he ever really love her? And is it possible to love a man who wasn't who he seemed to be?The Lies That Bind is a mesmerizing and emotionally resonant exploration of the never-ending search for love and truth--in our relationships, our careers, and deep within our own hearts.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Audiobook",
    "Book Club",
    "Contemporary",
    "Adult Fiction"
  ],
  "author": "Emily Giffin",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/52909027-the-lies-that-bind"
}