{
  "title": "April Witch",
  "description": "“No excuses will do anymore. Time to put my sisters in motion.”Desirée lies in a hospital bed thinking, dreaming. One of the children born severely disabled in 1950s Sweden and then routinely institutionalized for life—and one of a very few to survive nearly to the century’s end—she cannot walk or talk, but she has other capabilities. Desirée is an April witch, clairvoyant and omniscient, leaving her own body and traveling into the world denied her.The working-class woman who gave Desirée up at birth took in three foster daughters several years later, and even as adults they know nothing of the existence of their fourth “sister.” Christina, abused by her psychotic birth mother and burdened by a sense of inferiority, is now a physician; Margareta, the onetime foundling, an astrophysicist who can never manage to complete her dissertation, is as restless and sensual as she was in her youth; and Birgitta, in her day the fastest, sexiest teen queen in town, is now a derelict alcoholic and substance abuser.In spite of her physical disabilities, Desirée possesses tremendous intelligence, and she observes the world around her with great acumen. She has developed a very special relationship with her primary care physician, Dr. Hubertsson, who realizes that she could and should know something about her own background. Unbeknownst to him, she goes on to make supernatural use of this information.Sensing that her own time is drawing to a close, Desirée also feels that one of the others has lived the life that should have been hers. One day, each of the three women—Christina, Margareta, Birgitta —receives a mysterious letter that inspires her to examine her past and her present, setting into motion a complex fugue of memory, regret, and confrontation that builds to a shattering climax.April Witch created a furor upon its original publication in Sweden, where it was an immense bestseller. Addressing themes of mother-daughter relationships, competition between women, and the failures of Sweden’s postwar welfare state, it is foremost a thrillingly written and fascinating story.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Swedish Literature",
    "Magical Realism",
    "Sweden",
    "Scandinavian Literature",
    "Contemporary"
  ],
  "author": "Majgull Axelsson",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/528912.April_Witch"
}