{
  "title": "Writing Los Angeles: A Literary Anthology: A Library of America Special Publication",
  "description": "Los Angeles has always been a place of paradisal promise and apocalyptic undercurrents. Simone de Beauvoir saw a kaleidoscopic \"hall of mirrors,\" Aldous Huxley a \"city of dreadful joy.\" Jack Kerouac found a \"huge desert encampment,\" David Thomson imagined \"Marilyn Monroe, fifty miles long, lying on her side, half-buried on a ridge of crumbling rock.\"In Writing Los Angeles, The Library of America presents a glittering panorama in fiction, poetry, essays, journalism, and diaries by more than seventy writers. Beginning with Helen Hunt Jackson's romantic portrayal of the city's early days, the anthology covers a century's worth of Los Angeles writing. It brings to life the entrancing surfaces and unsettling contradictions of The City of Angels, from Raymond Chandler's evocation of murderous moods fed by the Santa Ana winds to John Gregory Dunne's affectionate tribute to \"the deceptive perspectives of the pale subtropical light.\" Here are fascinating strata of Los Angeles history, from the 1920s oil boom and the 1940s Zoot Suit Riots to 1950s beat culture and 1980s graffiti art, from flamboyant evangelist Aimee Semple McPherson to surf music genius Brian Wilson. The pleasures and discontents of the Hollywood movie colony are parsed by such observers as Nathanael West, F. Scott Fitzgerald, and Christopher Isherwood.Fragile ecosystems, architectural splendors, and social chasms are examined by writers as various as M.F.K. Fisher, William Faulkner, Bertolt Brecht, Evelyn Waugh, Octavio Paz, Joan Didion, Ray Bradbury, Charles Bukowski, Walter Mosley, Mona Simpson, and Charles Mingus. Art Pepper discovers the Central Avenue jazz scene of the 1940s; Salka Viertel recalls her circle of German émigré intellectuals; Garrett Hongo navigates the complexities of the city's racial patchwork; Tom Wolfe celebrates the sub-culture of custom car aficionados; John McPhee investigates the devastation of Los Angeles mud slides; screenwriter Robert Towne reflects on Chinatown's origin; David Hockney teaches himself to drive; James Ellry delineates the world of hard-bitten homicide cops; Pico Iyer finds at LAX \"as clear an image as exists today of the world we are about to enter.\"Writing Los Angeles is an incomparable literary tour guide to a city of shifting identities and endless surprises.Contents:from Echoes in the city of the angels by Helen Hunt JacksonThe land by Mary Austinfrom The rules of the game by Stewart Edward Whitefrom Sixty years in Southern California, 1853-1913 by Harris NewmarkCalifornia and America by Vachel Lindsayfrom Laughing in the jungle by Louis AdamicLos Angeles. A rhapsody by Aldous HuxleySister Aimee by H.L. Menckenfrom Oil! by Upton Sinclairfrom Queer people by Carroll and Garrett Grahamfrom God sends Sunday by Arna BontempsThe City of Our Lady the Queen of the Angels by Edmund WilsonParadise by James M. CainGolden land by William FaulknerPacific village ; A thing shared by M.F.K. Fisherfrom Promised land by Cedric BelfrageRed wind by Raymond Chandlerfrom Ask the dust by John Fantefrom The day of the locust by Nathanael Westfrom Diaries by Christopher IsherwoodLast kiss by F. Scott Fitzgeraldfrom Autobiography : Hollywood by Charles ReznikoffA table at Ciro's by Budd SchulbergLandscape of exile ; Hollywood elegies ; Californian autumn ; The democratic judge ; The fishing-tackle ; Garden in progress ; from Journals by Bertolt Brechtfrom If he hollers let him go by Chester Himesfrom America is in the heart by Carlos Bulosanfrom Southern California country : an island on the land ; from North from Mexico by Carey McWilliamsfrom America day by day by Simone de BeauvoirHollywood by Truman CapoteDeath in Hollywood by Evelyn Waughfrom The labyrinth of solitude by Octavio PazThe pedestrian by Ray BradburyThe mattress by the tomato patch by Tennessee Williamsfrom The barbarous coast by Ross Macdonaldfrom On the road by Jack Kerouacfrom \"Ocian in view\" by Lawrence Clark PowellThe slide area by Gavin Lambertfrom Slum by the sea by Lawrence Liptonfrom Superman comes to the supermarket by Norman MailerThe lost world by Randall JarrellThe kandy-kolored tangerine-flake streamline baby by Tom WolfeGoodbye surfing, hello God! by Jules SiegelLos Angeles notebook ; The Getty ; Quiet days in Malibu ; Fire season by Joan Didionwaiting ; betting on now ; The death of my father by Charles Bukowskifrom The kindness of strangers by Salka Viertelfrom Los Angeles : the architecture of four ecologies by Reyner Banhamfrom Beneath the underdog by Charles Mingusfrom Bike riding in Los Angeles by Marc NormanAutopia by Cees NooteboomThe city of robots by Umberto Ecofrom David Hockney by David Hockney by David HockneyLos Angeles : the know-how city by Jan Morrisfrom The sexual outlaw by John RechyEureka! by John Gregory Dunnefrom Straight life by Art Pepperfrom Seeing is forgetting the name of the thing one sees ; L.A. glows by Lawrence WeschlerPreface and postscript to Chinatown by Robert TowneAugust, Los Angeles, lullaby by Carol MuskeAngel baby blues by Wanda Colemanfrom Anywhere but here by Mona SimpsonNight song of the Los Angeles basin by Gary Snyderfrom Golden days by Carolyn Seefrom I was looking for a street by Charles WillefordGoing up in L.A. by Ruben Martinezfrom The control of nature by John McPheefrom City of quartz by Mike DavisCity of specters by Lynell Georgefrom Devil in a blue dress by Walter MosleyLas vistas by Mary Helen PonceComing home to Van Nuys by Sandra Tsing LohThe tooth of crime by James Ellroyfrom Volcano by Garrett HongoWhere worlds collide by Pico IyerBurl's by Bernard Cooperfrom The atlas by William T. Vollmannfrom Holy land by D.J. WaldieBeneath Mulholland by David Thomson",
  "genres": [
    "Short Stories",
    "Essays",
    "Fiction",
    "Anthologies",
    "Poetry",
    "School",
    "Literature"
  ],
  "author": "David L. Ulin",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/529171.Writing_Los_Angeles"
}