{
  "title": "The Fitzgeralds of Dublin: Books 1-3",
  "description": "This Kindle box set contains the novels A Scarlet Woman, A Suitable Wife and A Discarded SonA Scarlet Woman: The Fitzgeralds of Dublin Book 1Dublin, Ireland, 1880. Tired of treating rich hypochondriacs, Dr Will Fitzgerald left his father’s medical practice and his home on Merrion Square to live and practice medicine in the Liberties. His parents were appalled and his fiancée broke off their engagement. But when Will spends a night in a brothel on the eve of his best friend’s wedding, little does he know that the scarred and disgraced young woman he meets there will alter the course of his life.Isobel Stevens was schooled to be a lady, but a seduction put an end to all her father’s hopes for her. Disowned, she left Co Galway for Dublin and fell into prostitution. On the advice of a handsome young doctor, she leaves the brothel and enters domestic service. But can Isobel escape her past and adapt to life and the chance of love on Merrion Square? Or will she always be seen as a scarlet woman?Please note that this novel contains sexually explicit and sensitive content and is intended for readers aged eighteen and over.A Suitable Wife: The Fitzgeralds of Dublin Book 2Dublin, Ireland, 1881. Will and Isobel Fitzgerald settle into number 30 Fitzwilliam Square, a home they could once only have dreamed of. A baby is on the way, Will takes over the Merrion Street Upper medical practice from his father and they are financially secure. But when Will is handed a letter from his elder brother, Edward, stationed with the army in India, the revelations it contains only serves to further alienate Will from his father.Isobel is eager to adapt to married life on Fitzwilliam Square but soon realises her past can never be laid to rest. The night she met Will in a brothel on the eve of his best friend’s wedding has devastating and far-reaching consequences which will change the lives of the Fitzgerald family forever.A Discarded Son: The Fitzgeralds of Dublin Book 3Dublin, Ireland, 1881. Isobel Fitzgerald’s mother, Martha, marries solicitor James Ellison but an unexpected guest overshadows their wedding day. Martha’s father is dying and he is determined to clear his conscience before it is too late. Lewis Greene’s confession ensures the Ellisons’ expectation of a quiet married life is gone and that Isobel’s elder brother, Alfie Stevens, will be the recipient of an unwelcome inheritance.When a bewildering engagement notice is published in The Irish Times, the name of one of the persons concerned sends Will and Isobel on a race against time across Dublin and forces them to break a promise and reveal a closely guarded secret.",
  "genres": [
    "Historical Fiction",
    "Ireland",
    "Victorian",
    "Fiction"
  ],
  "author": "Lorna Peel",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/52914864-the-fitzgeralds-of-dublin"
}