{
  "title": "Fortitude: A Novel",
  "description": "For fans of Toni Adayemi's Children of Blood and Bone or of course Diana Gabaldon's Outlander fans comes the third in the heavily culturally imbued Deliverance series. This one delves deeply into Kanienke (Mohawk) and Haudenosaunee (Six Nations or Iroquois) culture and explores a different timeline where magic changes how colonists and the First Nations interacted.Once a gregarious little girl, Fortitude has followed in her older sister Liberty’s footsteps to become a strong, competent woman. Although still viewed as a young girl by many due to her lack of magic manifestation, she has soldiered on to become Liberty’s battle sister and the Westland’s only expert on magic ecology. When she finally gets the chance to strike out on her first real mission with her sister, she finds herself faced with more insurmountable odds then she ever imagined. Arcanton forces, led by a mysterious Admiral from Thomas’s past and the nefarious Ned Turner’s half-sister Veronica, mount an assault on the Westlands when they find a rift in the magic ecosystem. Armed with their vastly superior military technology, Arcanton wastes no time using the magic void to rip through in a deadly onslaught. Meanwhile the Westlands Militia scrabbles to hold their territory on the fleeting long shot that Fortitude, the girl with no magic, will be able to figure out how to mend the rift in the ethersphere. Can she do it?Once again, the descendant women of Nar find themselves in a position to learn what it means to live up to the power in a name.Praise for the Deliverance \"This story was told so expertly, I just couldn't put it down!\" -- Author Amy Proebstel\"Every part of the worldbuilding in this story was so beautifully done that I felt as if I was right there beside Deliverance.\"-- Author Kayla Krantz\"Riveting tale of YA fantasy!\"-- Author M.L. Tompsett\"A story filled with magic, tales of lore, action, adventure...we are swept away on an adventure!\" -- Author Susan A. BuchananAdventure FantasyHistoric FantasyHistorical FantasyMagical RealismYA fantasy to adult fantasyDystopianAlternate RealityWitchesMagic adventureBy ordering this book, you are supporting small, disabled veteran owned business. Thank you for your support!",
  "genres": [],
  "author": "Dr. Samantha Schinder",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/52951087-fortitude"
}