{
  "title": "My Boat",
  "description": "Our screenwriter narrator Jim is lunching with his agent Milt, describing a series idea: This crazy blonde girl has withdrawn from the world after a terrible shock. She decorates her slum apartment like a fantasy world and walks around barefoot in dresses made of tie-dyed sheets. Oh, all right, lousy idea. What Jim really wants is to tell Milt—anyone—a story from his own life. Then Milt can tell Jim if he’s nuts or not.It’s Jim’s senior year in high school on Long Island, 1952. Integration’s underway, and the school’s accepted five black students. One, Cissie Jackson, enters the same drama program as Jim and his friend Alan Coppolino. She’s a tiny, rabbit-timid fifteen-year-old who at five saw a white policeman shoot her father. She has a history of withdrawing from reality, and numerous psychiatric hospitalizations. Even now she mutes her voice to a whisper, forgets cues, wanders offstage in the middle of scenes. Jim and Alan complain to the principal—they don’t mind that Cissie’s black, just that she’s crazy. The principal says Cissie’s smarter and more talented than either of them, and details her traumatic history. Alan has a fit of empathy. He’s a bit of a nut himself, after all, addicted to weird fiction.Cissie begins to show her genius, displaying enormous presence in roles like the Queen of Sheba. She and Alan become friends. Jim tags along. One day Cissie tells Jim, as if from a pulpit, that the main thing is belief.Alan loans Cissie his weird books. He tells Jim about her rigid Christian upbringing and the mother who prohibits parties, dancing, makeup. Mrs. Jackson would beat Cissie for studying theater, so they all have to keep mum about that.One day Cissie and Alan tell Jim a secret—Cissie owns a rowboat, called My Boat, docked at Silverhampton. If Jim drives, they can take it out Sunday while her mom’s away. My Boat turns out to be a leaky wooden affair with one oar, its name scrawled in orange paint on the bow. Jim bails with a leaky bucket, then notices the name is actually brass letters set into the wood. Other things change, or else he’s seen them wrong the first time. The canopy isn’t drama shop cheesecloth but striped silk. A crate becomes a luxuriously appointed cabin. Cissie wears brilliant robes, an amber-studded belt, and a crescent-shaped knife with gem-encrusted hilt; Alan looks like Francis Drake in his purple cape, silver-and-black doublet and pointed beard. Jim tells Cissie she looks like the Queen of Sheba. The Queen of Saba, she corrects him in a West Indian accent; when they meet the queen he must remember. You see, Cissie’s traveled to many ancient lands, even to Atlantis where she’ll soon learn how to sail My Boat up into the stars. Alan says he can show her other places: Celephais and Kadath and Ulthar.Cissie tells Jim to release My Boat from its mooring. Jim descends from what’s now an ebony wood yacht. As he unties the ship, he thinks of his mundane life and plans. He looks up to see veils swim over his friends’ faces: other expressions, souls, pasts and futures. Jim doesn’t want that knowledge. He doesn’t want to go that deep.A hand clamps his shoulder. The epitome of red-necked Southern sheriffs demands to know what’s up with that rowboat there. There isn’t any rowboat, however, nor any Cissie and Alan. The cop himself soon disappears, an illusion Cissie conjured as a joke or distraction.Mrs. Jackson is the opposite of the “Aunt Jemima” Jim imagined: thin as Cissie and meticulously groomed in her threadbare gray suit. Jim wonders if Cissie left him behind as the fool white liberal racist he was. Mrs. Jackson thinks Alan raped and murdered her daughter, but as no sign of him or Cissie or My Boat is ever found, the case goes unsolved.But, Jim tells Milt, he’s finally seen Alan again, the day before, still a skinny seventeen-year-old. He accompanied Alan to his old home to grab a copy of The Dream-Quest of Unknown Kadath...read on :https://www.tor.com/2016/05/04/lovecr...",
  "genres": [
    "Short Stories",
    "Fantasy"
  ],
  "author": "Joanna Russ",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/52946700-my-boat"
}