{
  "title": "Only When It's Us",
  "description": "**Revised and Expanded 2021 Edition**\nPrepare for an emotional rollercoaster brimming with laughter, tears, and slow-burn sexiness in this new adult romance that tackles the vulnerability of love with humor and heart.RyderEver since she sat next to me in class and gave me death eyes, Willa Sutter’s been on my shit list. Why she hates me, I don't know. What I do know is that Willa is the kind of chaos I don’t need in my tidy life. She’s the next generation of women’s soccer. Wild hair, wilder eyes. Bee-stung lips that should be illegal. And a temper that makes the devil seem friendly.She’s a thorn in my side, a menacing, cantankerous, pain-in-the-ass who’s turned our Business Mathematics course into a goddamn gladiator arena. I'll leave this war zone unscathed, coming out on top…And if I have my way with that crazy-haired, ball-busting hellion, that will be in more than one sense of the word.WillaRather than give me the lecture notes I missed like every other instructor I’ve had, my asshole professor tells me to get them from the silent, surly flannel-wearing mountain man sitting next to me in class. Well, I tried. And what did I get from Ryder Bergman? Ignored. What a complete lumbersexual neanderthal. Mangy beard and mangier hair. Frayed ball cap that hides his eyes. And a stubborn refusal to acknowledge my existence.I’ve battled men before, but with Ryder, it's war. I’ll get those notes and crack that Sasquatch nut if it’s the last thing I do, then I’ll have him at my mercy. Victory will have never tasted so sweet.Only When It’s Us is a frenemies-to-lovers, college sports romance about a women’s soccer star and her surly lumberjack lookalike classmate, complete with a matchmaking professor, juvenile pranks, and a smoking slow burn. This standalone is the first in a series of new novels about a Swedish-American family of five brothers, two sisters, and their wild adventures as they each find happily ever after.",
  "genres": [
    "Romance",
    "Contemporary",
    "Sports Romance",
    "Sports",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Audiobook"
  ],
  "author": "Chloe Liese",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/52949964-only-when-it-s-us"
}