{
  "title": "Hymns of the Republic: The Story of the Final Year of the American Civil War",
  "description": "Uncorrected Proof-Not for Sale... ARC/galleyFrom the New York Times bestselling, celebrated, and award-winning author of Empire of the Summer Moon and Rebel Yellcomes the spellbinding, epic account of the dramatic conclusion of the Civil War.The fourth and final year of the Civil War offers one of that era’s most compelling narratives, defining the nation and one of history’s great turning points. Now, S.C. Gwynne’s Hymns of the Republic addresses the time Ulysses S. Grant arrives to take command of all Union armies in March 1864 to the surrender of Robert E. Lee at Appomattox a year later. He breathes new life into the epic battle between Lee and Grant; the advent of 180,000 black soldiers in the Union army; William Tecumseh Sherman’s March to the Sea; the rise of Clara Barton; the election of 1864 (which Lincoln nearly lost); the wild and violent guerrilla war in Missouri; and the dramatic final events of the war, including the surrender at Appomattox and the murder of Abraham Lincoln.Hymns of the Republic offers angles and insights on the war that will surprise many listeners. Robert E. Lee, known as a great general and southern hero, is presented here as a man dealing with frustration, failure, and loss. Ulysses S. Grant is known for his prowess as a field commander, but in the final year of the war he largely fails at that. His most amazing accomplishments actually began the moment he stopped fighting. William Tecumseh Sherman, Gwynne argues, was a lousy general, but probably the single most brilliant man in the war. We also meet a different Clara Barton, one of the greatest and most compelling characters, who redefined the idea of medical care in wartime. And proper attention is paid to the role played by large numbers of black union soldiers—most of them former slaves. They changed the war and forced the South to come up with a plan to use its own black soldiers. Popular history at its best, with Hymns of the Republic Gwynne reveals the creation that arose from the destruction in this thrilling read.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "War",
    "American Civil War",
    "Military History"
  ],
  "author": "S.C. Gwynne",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/52941245-hymns-of-the-republic"
}