{
  "title": "To Wake the Giant: A Novel of Pearl Harbor",
  "description": "The New York Times bestselling master of military historical fiction tells the story of Pearl Harbor as only he can in the first novel of a gripping new series set in World War II’s Pacific theater. In 1941, President Franklin D. Roosevelt watches uneasily as the world heads rapidly down a dangerous path. The Japanese have waged an aggressive campaign against China, and they now begin to expand their ambitions to other parts of Asia. As their expansion efforts grow bolder, their enemies know that Japan’s ultimate goal is total conquest over the region, especially when the Japanese align themselves with Hitler’s Germany and Mussolini’s Italy, who wage their own war of conquest across Europe. Meanwhile, the British stand nearly alone against Hitler, and there is pressure in Washington to transfer America’s powerful fleet of warships from Hawaii to the Atlantic to join the fight against German U-boats that are devastating shipping. But despite deep concerns about weakening the Pacific fleet, no one believes that the main base at Pearl Harbor is under any real threat. Told through the eyes of widely diverse characters, this story looks at all sides of the drama and puts the reader squarely in the middle. In Washington, Secretary of State Cordell Hull must balance his own concerns between President Roosevelt and the Japanese ambassador, Kichisaburo Nomura, who is little more than a puppet of his own government. In Japan, Admiral Isoroku Yamamoto wins skeptical approval for his outrageous plans in the Pacific, yet he understands more than anyone that an attack on Pearl Harbor will start a war that Japan cannot win. In Hawaii, Commander Joseph Rochefort’s job as an accomplished intelligence officer is to decode radio signals and detect the location of the Japanese fleet, but when the airwaves suddenly go silent, no one has any idea why. And from a small Depression-ravaged town, nineteen-year-old Tommy Biggs sees the Navy as his chance to escape and happily accepts his assignment, every sailor’s dream: the battleship USS Arizona. With you-are-there immediacy, Shaara opens up the mysteries of just how Japan—a small, deeply militarist nation—could launch one of history’s most devastating surprise attacks. In this story of innocence, heroism, sacrifice, and unfathomable blindness, Shaara’s gift for storytelling uses these familiar wartime themes to shine a light on the personal, the painful, the tragic, and the thrilling—and on a crucial part of history we must never forget.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "War",
    "Military Fiction",
    "Historical",
    "Audiobook"
  ],
  "author": "Jeff Shaara",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/52956654-to-wake-the-giant"
}