{
  "title": "Corporate Undertaker: Business Lessons from the Dead and Dying",
  "description": "\"Not since first reading Stephen Covey my freshman year in university, have I read such a life-changing, inspiring business book....A brilliant book and one I recommend to every single business owner and entrepreneur.\" —N.N. Light, Top 500 Amazon Reviewer & Verified Influencer\n\nFor more than 25 years, Domenic Aversa has actively assisted companies in dramatic operational transition. It’s grueling work in highly stressed conditions. He has had chairs thrown at his head and guns pointed at his heart. He has watched fortunes built and butchered. He often goes to work with a police escort. Occasionally, he's able to pull off a miracle and save a company. Most of the time, though, he simply tries to ease the pain.In Corporate Undertaker, Aversa puts his many years of experience to work for entrepreneurs and business owners. He will show you how to navigate the most critical stages of your company’s growth: life, adversity, crisis, death, and rebirth.Through each of these stages, Aversa will provide lessons and tools to help you deal with the inevitable challenges you will face. He will show you how to avoid problems, manage them or recover from them. You see, companies don’t fail because of one mistake. When companies are in deep trouble it’s usually because management has made many bad decisions over a long period of time. Then, one day, something unexpected happens, small problems suddenly become big ones, and things spin out of control. It doesn’t have to be that way.Aversa’s firsthand account of his life as a Corporate Undertaker is filled hard-earned wisdom. It’s a book about hope that will save you from days and years of unnecessary suffering and loss. By taking you to the frontlines of the battles he has fought, Aversa will show you that you don’t have to take every punch or walk into every tornado. There is an easier path toward happiness and prosperity.",
  "genres": [
    "Business",
    "Memoir"
  ],
  "author": "Domenic Aversa",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/52941371-corporate-undertaker"
}