{
  "title": "Talking to GOATs: The Moments You Remember and the Stories You Never Heard",
  "description": "A riveting, insightful memoir of never-before-told stories from Jim Gray, twelve-time Emmy Award-winner, Hall of Fame sports broadcaster, and renowned interviewer— that explores the author's career and the inside stories and memorable moments of the famous legends he has covered including, Muhammad Ali, Tom Brady, Kobe Bryant, LeBron James, Michael Jordan and Mike Tyson.Jim Gray looks back at his four decades of sports reporting from the unparalleled perspective of one of the world’s most respected and skilled interviewers.  A journalist who many iconic athletes have trusted to tell their stories (of both triumph and disgrace), Jim has had unprecedented access to the people, places and extraordinary events in the world of sports. Asking fair but tough questions, he has broken numerous stories, and landed squarely in the middle of others, from the Ben Johnson and Barry Bonds steroid scandals, to Michael Jordan’s surprise retirement, to the off-the-court Kobe/Shaq feud which led to their on-the-court break up, to being part of the live broadcast for twenty-two Super Bowls.  He’s climbed into the ring to interview Mike Tyson after he bit off a chunk of Evander Holyfield’s ear, and stood next to Ron Artest when the  “Malice at the Palace” melee erupted, and was on site at the bombing of the Atlanta Olympics.Anyone who has watched Jim effortlessly engage his subjects at the precise moment of triumph or tragedy has little idea what it takes to secure the interview, or what actually happens when the camera cuts away.  These are real, mesmerizing, and previously untold stories. The book features numerous world-class athletes, including Muhammed Ali, Tom Brady, Kobe Bryant, LeBron James, Michael Jordan, Floyd Mayweather, Michael Phelps, Mike Tyson and Tiger Woods, and world leaders George W. Bush, Barack Obama, Mikhail Gorbachev, and many more. On each page, Jim gives the reader a coveted all-access pass as he reviews the best interviews, the best athletes, and the best games in modern sports history. It’s like a personal introduction to the characters and careers of these heroes and villains we’ve known since childhood. He examines how money, celebrity, the media, and power interact, and how sports, more than any other institution, has led to momentous transformations in American society.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Memoir"
  ],
  "author": "Jim       Gray",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/52940539-talking-to-goats"
}