{
  "title": "This Brilliant Darkness",
  "description": "A brooding monster. A quirky professor. A small Indiana town with a soul of its own. Imagine if the writers of Northern Exposure sat down with Stephen King and decided to craft a dark fantasy thriller starring absent-minded academians, every day goofballs, and a dark fantasy creature for good measure. Pondering big picture questions like “Why am I here?” and “Does Love Conquer All?” has never been so fun. That's THIS BRILLIANT DARKNESS, the top-rated dark fantasy debut novel by the author of TROLL OR DERBY, Red Tash. Nothing is as it seems to be, and no one behaves in ways characters are “supposed” to act. How will it end? It's anyone's guess, in a book that keeps you turning pages, racing to find out what will happen next. Christine Grace finds her predictable scholarly life comforting, if a bit boring. Her live-in boyfriend presses her for marriage, but she's too philosophically inclined to take an interest. So, really, why does she suddenly start imagining things in the window's reflection? Is time truly starting and stopping all around her, or is she inexplicably cracking up?Greachin is an age-old being so tortured by his own karmic cycle that he no longer knows how to connect, except to identify potential threats through the cosmic ripples of space. When he zeroes in on Christine Grace, he experiences second thoughts for the first time in millenia. Will he go through with his grisly plan of murder and destruction?And what of these other characters—an aging physicist of ill-repute, a stubborn monk who takes his vow of silence too far, and a time-shifting star visible only from Bloomington? What a tangled web we weave, when monsters practice to deceive. Dive into This Brilliant Darkness, and follow the journeys of these characters, from Britain to the Heartland, from January's snowfall to Halloween's costumed festivities.THIS BRILLIANT DARKNESS is a smart, karmic mystery populated by lovable brainy characters. Climb on, strap in, and hold tight.Readers are \"This is a fast-paced, exciting book that keeps you guessing until the very end. With an eclectic cast of characters, time travel and a karmic mystery, how can you go wrong?\" ~Zombie Bedtime Stories author Thea Gregory **\"By midnight, I had not put the book down, and had no intention of putting it down. At 12:15am, my fourteen-year-old son stumbled out to get a drink of water. \"You're still up?\" he asked. \"Go to bed.\" I looked up from my Nook, smiled, and said, \"Not on your life, dude. Not until this ends.\" ~Librarian Amy Marshall **“The way the author weaves fantasy, humor, science fiction, and mystery is, for lack of a better word, brilliant. I read the entire thing with admiration/envy, taking notes and thinking 'THIS is how you write a novel.' Remember when Scream blew the horror world away by actually using technology in a realistic way? Well here's blogging and online forums and long distance cyber friendships, honestly depicting the way we live in the 21st century.” ~Poet Christina Grey** AN OFFICIAL JAMES MASON COMMUNITY BOOK CLUB MUST READ “The atmosphere of this book, so hard to simply label horror or paranormal…how about simply...A GREAT READ, is the true star. Ms. Tash so finely weaves a path of intrigue, terror, humor and suspense, that the reader is taken with each character, so very finely drawn. THIS BRILLIANT DARKNESS is that rare book that one truly does not want to end!! When it does...next question is ‘What else by Red Tash can I get my hands on? QUICK!!!’”~ Rick Friedman",
  "genres": [
    "Horror",
    "Paranormal",
    "Science Fiction",
    "Mystery",
    "Dark Fantasy",
    "Fiction",
    "Thriller"
  ],
  "author": "Red Tash",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/12595959-this-brilliant-darkness"
}