{
  "title": "EMPATH: A Self-Discovery Journey for Highly Sensitive People to Gain Control over Emotions, overcome Negative Mindsets and develop Self-Confidence",
  "description": "Sensing everything around you too deeply and always being attuned to other people's feelings can be a burden: it can drain your energy, you can feel overwhelmed and you can lose focus on what's really important: YOURSELF. But you must be aware that you actually have a special talent: you are an empath!I know it can be difficult, a very challenging task, however, being capable to deeply sense other's people feelings is one of the greatest blessings you could have ever received!Empathy can be extremely powerful: it provides you with the unique ability to truly and deeply understand people, and to help them. This wonderful gift needs to be controlled and managed carefully, since it can be physically and emotionally exhausting. Don't worry. This book will be your Survival Guide: it will help you manage all these feelings, to leverage the power of your emotions, to understand how to better channel your energy and it will also help you to find your true self, to focus on your true needs and to develop your full potential.I will give you a complete overview of what it feels like to be an empath. With simple, clear and precise actions, I will support you on developing and optimizing your core skills. You will understand how to manage the empath gift and get the most out of it, focusing on your positive energy and not on the negative downsides of this quality. Moreover, in this book you will discover: \n   effective strategies to nurture, develop and get the most from this quality \n   how you can channel your energy \n   the #1 tactic to use to influence your emotions \n   5 tricks you can set up right now to set boundaries to protect yourself and to preserve your energy \n   how to unleash your full potential with actionable strategies \n ... and much more!Are you ready to take advantage of your gift and learn to live your life to the full, making a difference also to everyone you come across? Don't wait any longer, click the \"Buy Now\" button, embrace your gift and let's begin this journey together!",
  "genres": [],
  "author": "David Larson",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/52956403-empath"
}