{
  "title": "Separated: Inside an American Tragedy",
  "description": "A story every American should reckon with—a tale of love and heartbreak, cruelty and determination.In June 2018, Donald Trump’s most notorious decision as president—the systematic separation of thousands of desperate migrant families at the US-Mexico border—had secretly been in effect for months before most Americans became aware of the astonishing inhumanity being perpetrated by their own government. Jacob Soboroff was among the first journalists to expose this reality after seeing firsthand the living conditions of the children in custody. His influential series of reports ignited public scrutiny that contributed to the president reversing his own policy and earned Soboroff the Cronkite Award for Excellence in Political Broadcast Journalism and, with his colleagues, the 2019 Hillman Prize for Broadcast Journalism.But beyond the headlines, the complete, multilayered story lay untold. How, exactly, had such a humanitarian tragedy—now deemed “torture” by physicians—happened on American soil? Most important, what has been the human experience of those separated children and parents?Soboroff has spent the past two years reporting the many strands of this complex narrative, developing sources from within the Trump administration who share critical details for the first time. He also traces the dramatic odyssey of one separated family from Guatemala, where their lives were threatened by narcos, to seek asylum at the U.S. border, where they were separated—the son ending up in Texas, and the father thousands of miles away, in the Mojave desert of central California. And he joins the heroes who emerged to challenge the policy, and who worked on the ground to reunite parents with children.In this essential reckoning, Soboroff weaves together these key voices with his own experience covering this national issue—at the border in Texas, California, and Arizona; with administration officials in Washington, DC, and inside the disturbing detention facilities. Separated lays out compassionately, yet in the starkest of terms, its human toll, and makes clear what is at stake in the 2020 presidential election.From award-winning NBC News and MSNBC correspondent Jacob Soboroff comes a powerful and deeply reported journey to lay bare the full truth behind the defining moral crisis of the Trump years.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Audiobook",
    "Social Justice",
    "Race",
    "Journalism"
  ],
  "author": "Jacob Soboroff",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/52940544-separated"
}