{
  "title": "KISS and Make-up",
  "description": "You wanted the truth, you got the truth—the hottest book in the world!Fueled by an explosive mix of makeup, costumes, and attitude, KISS burst onto the music scene thirty years ago and has become a rock institution. The band has sold more than eighty million records, has broken every concert attendance record set by Elvis Presley and the Beatles, stands behind the Beatles alone in number of gold records from any group in history, and has spawned more than 2,500 licenses.There would have been no KISS without Gene Simmons, the outrageous star whose superlong tongue, legendary sexual exploits, and demonic makeup have made him a rock icon. KISS and Make-Up is the wild, shocking, unbelievable story, from the man himself, about how an immigrant boy from Israel studied to be a rabbi, was saved by rock and roll, and became one of the most notorious rock stars the world has ever seen.Before Gene Simmons there was Chaim Witz, a boy from Haifa, Israel, who had no inkling of the life that lay ahead of him. In vivid detail Gene recounts his childhood growing up in Haifa under the watchful eye of his beloved, strong-willed mother, a concentration camp survivor; his adolescent years attending a Jewish theological center for rabbinical studies in Brooklyn; his love of all things American, including comic books, superheroes, and cowboys; and his early fascination with girls and sex, which prompted him to start a rock band in school after he saw the Beatles on The Ed Sullivan Show.KISS and Make-Up is not just the classic story of achieving the American dream through the eyes of an immigrant boy making good, but a juicy, rollicking rock and roll read that takes you along for the ride of your life with KISS, from the 1970s, when they were the biggest band in the world, through the ’80s, when they took off their world-famous war paint, and into the ’90s, when they came back bigger and badder than ever to become the number one touring band in the world.In his own irreverent, unapologetic voice, Gene talks about the girls (4,600 of them and counting); his tight bond with KISS cofounder Paul Stanley; the struggles he and Paul had with Ace Frehley and Peter Criss and their departures from the group; the new band members and Eric Carr’s untimely death; the enormous love and affection he has for the people who put him there in the first place—the KISS Army and the ever-loyal KISS fans around the world; his love life, including stories about his relationships with Cher and Diana Ross and with Shannon Tweed, Playmate of the Year, mother of his son and daughter, and his companion of eighteen years; and much more.Full of dozens of photographs, many never-before-seen pictures from Gene’s private collection, KISS and Make-Up is a surprising, intimate look at the man behind the mask. For the first time Gene reveals all the facets of his complex personality—son, rock star, actor, record producer, businessman, ladies’ man, devoted father, and now author.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Memoir",
    "History",
    "Audiobook"
  ],
  "author": "Gene Simmons",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/529922.KISS_and_Make_up"
}