{
  "title": "The Romantic Generation",
  "description": "What Charles Rosen's celebrated book The Classical Style did for music of the Classical period, this new, much-awaited volume brilliantly does for the Romantic era. An exhilarating exploration of the musical language, forms, and styles of the Romantic period, it captures the spirit that enlivened a generation of composers and musicians, and in doing so it conveys the very sense of Romantic music. In readings uniquely informed by his performing experience, Rosen offers consistently acute and thoroughly engaging analyses of works by Schubert, Schumann, Mendelssohn, Bellini, Liszt, and Berlioz, and he presents a new view of Chopin as a master of polyphony and large-scale form. He adeptly integrates his observations on the music with reflections on the art, literature, drama, and philosophy of the time, and thus shows us the major figures of Romantic music within their intellectual and cultural context.Rosen covers a remarkably broad range of music history and considers the importance to nineteenth-century music of other cultural the art of landscape, a changed approach to the sacred, the literary fragment as a Romantic art form. He sheds new light on the musical sensibilities of each composer, studies the important genres from nocturnes and songs to symphonies and operas, explains musical principles such as the relation between a musical idea and its realization in sound and the interplay between music and text, and traces the origins of musical ideas prevalent in the Romantic period. Rich with striking descriptions and telling analogies, Rosen's overview of Romantic music is an accomplishment without parallel in the literature, a consummate performance by a master pianist and music historian.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Classical Music",
    "Romanticism",
    "Philosophy",
    "Art"
  ],
  "author": "Charles Rosen",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/529757.The_Romantic_Generation"
}