{
  "title": "Hellbound",
  "description": "Persephone's story takes a delicious turn when she meets Lucifer himself in the debut of the erotic new series, \"Hellbound.\" This quick paced story is made to be devoured in one bite.  ‘Hello,’ a voice calls out from inside the fireplace. I sit up and blink my eyes into focus. The wine wore off two hours ago and I’m too sober for this shit. I take another sip of water. “Who are you?” The fireplace says, the flames beginning to move unusually slow and rhythmically, forming themselves into the shape of a man’s face with two curved horns protruding from his head. I spit my water out. “Why have you called me here?” The horned man made of flames asks me. I open my mouth to speak, but my brain refuses to comply, so I just kind of gawk at him like a hungry baby bird. “Who are you?” He says slower and slightly louder than the last time. “Percy,” I answer aloud, after internally struggling with the fact I may or may not be hallucinating. “I’m sorry, I’ve never had a fireplace speak to me before.” At this point, I’m unsure of what constitutes as reality in any capacity, but I am intrigued. After all, every great story starts out with something kind of fucked up happening. “I’m not a sentient fireplace,” he says sardonically. “Then what are you,” I ask, mesmerized by the fire’s deep shades of burnt oranges and reds creating the entities sharp cheekbones, the lighter yellows at his mouth and brow. “You’ve summoned me yet you don’t know my name?” He asks in a way that suggests I’m teasing him. The flames curl back into a smile. “Are you a demon?” I ask. It’s the best guess I have based off of my extensive Netflix research. His laugh is deep and rich against the crackling from the firewood. “You’ve watched too much ‘Supernatural, Percy.’” Damn, he is good. “That’s a weird thing for a demon to say.” I squint my eyes at the flames. “How so?” he asks, “It’s the number one watched show in Hell.” “See, now that sounds more like something a demon would say.” In an instant, the face in the flames disappears as a column of black smoke pours from the fireplace and fills the room.   Lilith Mara has devoured erotic stories since she was a teenager, sneaking her mother’s Anne Rice novels from the bookshelf at night. Now, after reading what feels like everything that the internet has to offer, she’s began capturing her imagination’s own vivid stories in writing to share with fellow lovers of naughty words. This is her debut novelette, with many more to come.",
  "genres": [],
  "author": "Lilith Mara",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/52969803-hellbound"
}