{
  "title": "Bowraville",
  "description": "A true crime story cannot often be believed, at least at the beginning. In Bowraville, all three of the victims were Aboriginal. All three were killed within five months, between 1990 and 1991. The same white man was linked to each, but nobody was convicted.More than two decades later, homicide detective Gary Jubelin contacted Dan Box, asking him to pursue this serial killing. At that time, few others in the justice system seemed to know – or care – about the murders in Bowraville. Dan spoke to the families of the victims, Colleen Walker-Craig, Evelyn Greenup and Clinton Speedy-Duroux, as well as the lawyers, police officers and even the suspect involved in what had happened. His investigation, as well as the families’ own determined campaigning, forced the authorities to reconsider the killings. This account asks painful questions about what ‘justice’ means and how it is delivered, as well as describing Dan’s own shifting, uncomfortable realisation that he was a reporter who crossed the line.Praise for the Bowraville podcast:'It is a gripping true crime tale and an essay on racism; a challenge to the lies Australia tells itself about its treatment of Aboriginal and Torres Strait Islander people told through the voices of three Aboriginal families who have been indisputably let down … The podcast has galvanised the public in a way that two decades of print and television reporting on the Bowraville murders have not.’ \nThe Guardian\n'A masterful example of crime reporting which forensically details the worst of human nature, inexplicably compounded by the gross negligence of the only people who could provide justice. It’s stirred thousands, including the prime suspect, to re-engage with the case after trusting the journalist to take them to dark places.’ Walkley judges’ comments ‘Outstanding.’ Leigh Sales‘Moving, brilliant.’ Annabel Crabb'If you haven't listened to Bowraville by Dan Box, then you should.’ David Campbell",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Crime",
    "Australia",
    "Mystery"
  ],
  "author": "Dan Box",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/52960899-bowraville"
}