{
  "title": "The Billionaire Prince’s Nanny",
  "description": "Katie Crestley is in a world of trouble. A blacklisted journalist and desperate for money, Katie takes the only other job she’s remotely qualified for: nanny to the two adopted daughters of the youngest prince of Stolvenia. But just as she’s given up on her dream of becoming a legitimate journalist, the editor of a major Stolvenian newspaper approaches her. With a new anti-royalist movement growing in the small country, getting the dirt on the royal family could lead to big things for Katie’s career. She’s reluctant, but if she’d rather stick to her morals, then the editor will just have to let the royal family know about her scandalous past—ensuring she’ll be fired.  With little other choice, Katie caves to the blackmail and agrees to spy on her boss. Problem is, the longer she works for Prince Armin Albericht Von Roth, the more she realizes what a good, selfless man he is. Worse, she’s falling hard for him and knows he’ll never forgive her if he finds out what she’s done…  Armin always does what is right and believes everyone else should follow suit. Structure, rules, and protocol are what’s important. So he’s taken aback when he learns his late best friend named him guardian of his two little girls. What does he know about children? He’d thought a nanny would set things straight, but Katie is far too pretty, far too free spirited, far too distracting. She doesn’t follow rules. She doesn’t understand the importance of structure. She’s getting under his skin, disrupting not only his life, but his very thoughts—which seem to be centered more and more on her…  But as Armin begins to fall for his daughters’ beautiful nanny, can he forgive her once he finds out what she’s really doing in the palace? Or will it be best for him and his daughters to forget the pretty American who made their lives a little brighter?  This novel contains sexual content and profanity.",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Leslie North",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/52967913-the-billionaire-prince-s-nanny"
}