{
  "title": "The Spare",
  "description": "\"I'm publicly bisexual now, I'll make all the musical theatre references I please. I'll belt Cole Porter songs prancing on top of this bar if I want to.\" -His Royal Highness Prince Edward Nicholas William Desmond, second son of Her Majesty Queen Victoria II of England and the Commonwealth\nThe second son of the Queen of England has certain responsibilities. Dress well, smile at public events, uphold the family honor, be straight. At sixteen, Edward Kensington had been convinced that hiding his bisexuality was a small price to pay to protect his mother and siblings from yet another tabloid scandal in the wake of his parents’ high-profile divorce. But over ten years later, even a closet the size of Buckingham Palace feels small, and his secrets have only gotten harder to keep. Like being in love with his bodyguard—a man by the name of Isaac Cole.Then he’s outed by the press.The official schedule has no time for an identity crisis, even though every member of the royal family seems to be having one at once. Eddie’s estranged father shows up. His sister flirts with the reporter hired to write their grandmother’s biography. His older brother, harboring a secret of his own, is more reluctant than ever to take up public-facing duties, and Her Majesty is considering going out on a date. And now the Public Relations Office has set Eddie the task of finding himself a suitable fiancée.But when Eddie learns that Isaac returns his decidedly inconvenient feelings, keeping calm and carrying on becomes impossible. Prince Charming never wished harder for a men’s size 12 glass slipper, but life in the spotlight isn’t a fairy tale, and there are some dragons not even a prince can fight alone. For any one of them to steal a happily ever after, the Kensingtons will have to pull together for the first time since the Second World War.Hold on to your tiaras. It’s going to be a bumpy ride.",
  "genres": [
    "Romance",
    "Contemporary",
    "LGBT",
    "Queer",
    "M M Romance",
    "Fiction",
    "Gay"
  ],
  "author": "Miranda Dubner",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/52974857-the-spare"
}