{
  "title": "David Bowie: My First David Bowie",
  "description": "This board book version of David Bowie – from the critically acclaimed, multimillion-copy bestselling Little People, BIG DREAMS series – introduces the youngest dreamers to the incredible life of this starman who dazzled audiences with his music.  As a child, young David lived with his family in a tiny house on an ordinary street, but he had a head full of songs and ideas. At school he was loved music and dance, and he was inspired by his brother's rock and jazz records to pick up the saxophone and start writing his own songs. After earning his stripes in some of the coolest bands in London, David splashed onto the solo scene. David knew that to be a star, he had to combine great songs with great performace, and so from this point on he took on a range of shapeshifting personas, from Ziggy Stardust to the Thin White Duke, but really, he was just being himself, expressing his art on the stage. His songwriting talent and musical skill made him one of rock and roll's all-time greatest artists. Babies and toddlers will love to snuggle as you read to them the engaging story of this fascinating star, and will also enjoy exploring the stylish and quirky illustrations of this sturdy board book on their own.Little People, BIG DREAMS is a best-selling series of books and educational games that explore the lives of outstanding people, from designers and artists to scientists and activists. All of them achieved incredible things, yet each began life as a child with a dream. This empowering series offers inspiring messages to children of all ages, in a range of formats. The board books are told in simple sentences, perfect for reading aloud to babies and toddlers. The hardcover versions present expanded stories for beginning readers. Boxed gift sets allow you to collect a selection of the books by theme. Paper dolls, learning cards, matching games, and other fun learning tools provide even more ways to make the lives of these role models accessible to children.Inspire the next generation of outstanding people who will change the world with Little People, BIG DREAMS!",
  "genres": [
    "Picture Books",
    "Nonfiction",
    "Biography",
    "Music",
    "Childrens",
    "Art",
    "History"
  ],
  "author": "Mª Isabel Sánchez Vegara",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/53004500-david-bowie"
}