{
  "title": "A Brush With Fame",
  "description": "This edition is no longer available. See current edition here.What if by chance you met a famous person? And he wanted you…I showed up to the movie set bright and early Monday for a one-day sub position on a blockbuster sequel. It was crucial to prove myself as a makeup artist to break into the Hollywood scene.While waiting on the obnoxious actor assigned to me to finish a phone call, it suddenly happened. I saw him standing in the doorway—Evan Hutchinson. Never mind I’d already fallen into his lap when someone knocked into me earlier. We’d gotten past that little embarrassment. But why did the movie’s famous British heartthrob request me for touch-ups? Either way, I did them, of course. Who wouldn’t jump at the chance to touch his face—but with a makeup brush? What I didn’t expect was for him to talk to me—to borderline flirt with me.Once I was home and talking on the phone with my long-distance boyfriend about nothing important, the call came. Evan Hutchinson requested me to finish the movie as his personal makeup artist. After nearly dropping the phone from shock, I’d accepted.It’s now Wednesday night, and the other actors have left. For some reason, Evan asked me to stay. We were alone in his apartment, seated on his couch. Somehow, we ended up discussing what it’s like to do a movie kiss with someone you aren’t romantically involved with.Before finally leaving for home, I lowered my car window to say good night. Then the craziest thing happened—Evan offered to show me what a kiss is like. And he suggested I let him know if I’d ever like him to practice with me.Now I don’t know what to do because I can’t stop thinking about Evan Hutchinson kissing me…*** This is a contemporary romance/new adult standalone novel. No cliffhanger. It contains moderate steam and sensitive subject matter. Recommended for 18+. ***",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Contemporary",
    "Love Story",
    "Realistic Fiction",
    "Fiction",
    "Humor"
  ],
  "author": "Melinda Hazen",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/53002835-a-brush-with-fame"
}