{
  "title": "Postwar: A History of Europe Since 1945",
  "description": "Europe in 1945 was prostrate. Much of the continent was devastated by war, mass slaughter, bombing and chaos. Large areas of Eastern Europe were falling under Soviet control, exchanging one despotism for another. Today, the Soviet Union is no more and the democracies of the European Union reach as far as the borders of Russia itself. Postwar tells the rich and complex story of how we got from there to here. It tells of Europe's recovery from the devastation; of the decline and fall of Soviet Communism and the rise of the EC and EU; of the end of Europe's empires; and of Europe's uneasy and changing relationships with the memory of the war and with the two great powers that bracket it, Russian and America. With clarity and economy, he tells of developments across the continent as a whole, as well as of the contrasting experiences of Eastern and Western Europe. Along the way, we learn of Greece's Civil War, of Scandinavian social democracy, the stresses of multilingual Belgium, the struggles of Northern Ireland and the Basque country. And this is a history of people as well as of peoples, Churchill and Mitterand, General Franco and General Jaruzelski, Silvio Berlusconi and Joseph Stalin. And Postwar also has cultural and social histories to of French and Czech cinema, of the rise of the fridge and the decline of the public intellectual, of immigration and gastarbeiters , existentialism and punk rock, Monty Python and brutalist architecture. Running right up to the Iraq War and the election of Benedict XVI, Postwar makes sense of Europe's recent history and identity, of what Europe is and has been, in what can only be described as a Europe in our time.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "European History",
    "World War II",
    "War",
    "World History"
  ],
  "author": "Tony Judt",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1259820.Postwar"
}