{
  "title": "Echolocation",
  "description": "Sometimes the voices that call you home lead you astray…Cheri and Geneva grew up on “a little patch of nothing made up of dairy farms in the valleys and boarded up iron-ore mines in the mountains, a town of old folks waiting to die and young people dying to leave.” Now, Cheri has fled that life for the city, leaving Geneva behind to care for their aunt as she succumbs to cancer. Her death draws them back together, forcing them to face their past–and each other. When Cheri’s mother turns up with a strange baby and a dangerous secret close behind, the choices that follow will push all of them beyond boundaries they never thought they’d cross.In this stunning debut novel, Myfanwy Collins lays bare the hearts of three lost women called together by their own homing instincts in a season that will change their lives–and the place they call home–forever.What people are saying about Echolocation:“Myfanwy Collins tells a deep and resonant story about people she loves, and along the way shows us how to love them as well.”—Dorothy Allison, author of Bastard Out of Carolina and Cavedweller“Fearless, elegant, and accessible, Echolocation is literary fiction at its best. With heartbreakingly beautiful prose, Myfanwy Collins tells a gripping and tender tale of broken souls yearning for wholeness. These are characters who will stay with you long after you turn the last page. It’s a dazzling debut!”—Ellen Meister, author of The Other Life“Myfanwy Collins has the goods. It’s that simple. Echolocation is about love in all its magnificent slipperiness; it’s about how secrets bind us rather than rend us; it’s about the endless series of personal reinventions we call a lifetime. And these are things we had all better be thinking–and reading–about, if we plan to try and get out of this alive.” —Ron Currie Jr., author of God is Dead and Everything Matters!“Myfanwy Collins’ debut novel calls to mind the grim and radiant work of Daniel Woodrell. From page one, I was chilled by the landscape, caught up in the trouble, and riveted by these women of northernmost New York who slam back together and figure out how live with what’s missing.” —Pia Z. Ehrhardt, author of Famous Father and Other Stories“A moving and delicate novel, tracing the poignant destinies of women who long for a home they never had.” —Laila Lalami, author of Hope and Other Dangerous Pursuits and Secret Son“Get ready to fall madly, sadly in love with the fiction of Myfanwy Collins.” —Benjamin Percy, author of The Wilding and Refresh, Refresh",
  "genres": [
    "Fiction",
    "Novels"
  ],
  "author": "Myfanwy Collins",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/12598301-echolocation"
}