{
  "title": "Trick or Treat Me",
  "description": "It's time to unwrap some man candy. TRICK OR TREAT ME contains six hot and humorous contemporary romance novellas perfect for Halloween from authors Sophie Brooks, EmKay Connor, M. K. Hale, B. R. Curry, Sara Whitney, and Carrie Lomax.Halloween has never been so hot.BEHIND THE MASK by Sophie BrooksAt the university Halloween party she's dragged to, wallflower Kaylee accidentally gushes about her crush on her TA, Carter, while the man himself is in earshot. Mortified, she flees, leaving Carter to track down the shy but intriguing young woman. Will he scold her for endangering his scholarship or make her fantasies come true?COSTUME MISCONDUCT by M. K. HaleWhen Tara is caught breaking into her friend's cheating ex's apartment while dressed as a cop for Halloween, she has two options: 1. Come clean to the incredibly handsome officer who caught her. 2. Pretend to be a cop and stick by his side for the night. She chooses 2.TEMPTING TREAT by Sara WhitneyTessa thinks Daniel ghosted her, while Daniel’s sure Tessa was the one who vanished six months ago. Now the two attorneys find themselves face-to-face again, fighting over the last bag of Halloween candy and squaring off in court. But how long can they ignore the reasons for their falling-out—or their still frighteningly good chemistry?ANY WITCH WAY HE CAN by EmKay ConnorTripp Wallace has finally returned home for a long overdue visit but discovers everything about the small town of Beau's Folly has changed... everything except Sadie Brandt, who still adores all things Halloween. Tripp has one chance to convince Sadie of his feelings, and he vows to boo—er, woo her any which way he can.BIG BAD WOLFE by B. R. CurryDressed as Little Red Riding Hood at her parents' annual Halloween party, Zoe spies the big bad wolf from across the room and is thrilled that it's none other then Travis Wolfe, her father's best friend and her hardcore crush. Is it finally her chance to introduce him to the woman she's become so he'll forget about the little girl he remembers?CHARMING MR. X by Carrie LomaxWhen reclusive billionaire Xavier Cortes invites struggling actress Lily Smith to be his assistant, she isn't sure whether his offer is a trick, or the treat she needs to jump-start her career and her love life.Note: Behind the Mask was previously released as Against the Rules by Sophie Brooks.",
  "genres": [
    "Halloween",
    "Anthologies",
    "Romance",
    "Holiday"
  ],
  "author": "Sophie Brooks",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/53017414-trick-or-treat-me"
}