{
  "title": "House of Ash & Brimstone",
  "description": "Hell has come to collect, but Gisele Walker has no plans to pay the debt.\n\nBeing a paranormal bounty hunter is flirting with death, even for a half-demon like Gisele Walker. An orphan with no memories of her childhood, she’s spent the last decade working for the foster father who saved her from the city’s streets. But when she’s partnered with Shade, an infuriatingly handsome demon who’s keeping secrets, her jobs spin sideways.Determined to ditch Shade, Gisele takes a contract to steal a mysterious curio and accidentally opens a portal to Hell. As a nightmarish ghoul hunts her down, and parts of Baltimore burn to the ground, she finds joining forces with Shade may be the only way to undo her unleashed mess.A white-hot attraction ignites between them, until Shade’s secret is exposed. The contract bringing them to Hell is nothing more than a ploy to lure Gisele to Hell’s royal court, where her devilish brother and aunt lie in wait. It’s a family reunion that has her wishing she’d remained an amnesiac orphan.To save herself and Shade, Gisele must face her past and venture into the twisted heart of the demon court where she was nearly murdered a lifetime ago.\n “Starks doesn’t waste a moment launching readers into the heady, paranormal world of her action-packed debut. The complex mythology and feisty characters will hold readers’ attention. An enjoyable fantasy from an author with a lot of promise.” – Publishers Weekly\n\n \nAUTHOR INTERVIEW\n\n Why do you write?\n I write because I enjoy it, and I want to provide entertainment for others. My top goal is always for my stories to add joy to my life and yours.\n What do you write?\n Urban fantasy and paranormal romance.\n Why should readers pick up your books?\n I've been reading Urban Fantasy novels from the time I was 15. I love stories that follow strong, capable female protagonists. In my book, I also wanted to add an element of “girl saves boy” because I grew up with mostly stories where the heroine was the damsel in distress. I always wished in some of the stories that it was the girl who rescued everyone, instead. Shade, our hero is a physical and magical powerhouse, but he's completely tangled up in the plot and incapable of saving himself without Gisele’s help. He's also a dragon guard who wants to serve her—but, against his will, must obey the prince who wants her dead. So, while they're both alpha-type personalities, I think there's a nice twist, sort of a reversal regarding the power dynamics in the romance that you don't see as often. It's pretty spicy and unique. :) \nBe sure to scroll up and hit that BUY NOW button to enter a world of fantasy, romance, and intrigue!",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Fantasy",
    "Demons"
  ],
  "author": "Megan Starks",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/53011672-house-of-ash-brimstone"
}