{
  "title": "Hello I Want to Die Please Fix Me: Depression in the First Person",
  "description": "NATIONAL BESTSELLER\n\n\n\nAward-winning journalist Anna Mehler Paperny's stunning memoir chronicles with courageous honesty and uncommon eloquence her experience of depression and her quest to explore what we know and don't know about this disease that afflicts almost a fifth of the population--providing an invaluable guide to a system struggling to find solutions. As fascinating as it is heartrending, as outrageously funny as it is serious, it is a must-read for anyone impacted by depression--and that's pretty much everybody. \nDepression is a havoc-wreaking illness that masquerades as personal failing and hijacks your life. After a major suicide attempt in her early twenties, Anna Mehler Paperny resolved to put her reporter's skills to use to get to know her enemy, setting off on a journey to understand her condition, the dizzying array of medical treatments on offer and a medical profession in search of answers. Charting the way depression wrecks so many, she maps competing schools of therapy, pharmacology, cutting-edge medicine, the pill-popping pitfalls of long-term treatment, the glaring unknowns and the institutional shortcomings that both patients and practitioners are up against. She interviews leading medical experts across Canada and the US, from psychiatrists to neurologists, brain-mapping pioneers to family practitioners, and others dabbling in strange hypotheses--and shares compassionate conversations with fellow sufferers.Hello I Want to Die Please Fix Me tracks Anna's quest for knowledge and her desire to get well. Impeccably reported, it is a profoundly compelling story about the human spirit and the myriad ways we treat (and fail to treat) the disease that accounts for more years swallowed up by disability than any other in the world.",
  "genres": [
    "Nonfiction",
    "Mental Health",
    "Memoir",
    "Psychology",
    "Self Help",
    "Audiobook",
    "Mental Illness"
  ],
  "author": "Anna Mehler Paperny",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/53020734-hello-i-want-to-die-please-fix-me"
}