{
  "title": "Lawns into Meadows: Growing a Regenerative Landscape",
  "description": "Landscape designer Owen Wormser explains how to replace the deadscape we call lawn with low-maintenance, eco-friendly meadows. This is a how-to book on meadow-making that's also about sustainability, regeneration, and beauty.In a world where lawns have wreaked havoc on our natural ecosystems, meadows offer a compelling solution. It is garden landscaping that is beautiful, all year round. Meadows establish wildlife and pollinator habitats, are low-maintenance and low-cost, have a built-in resilience that helps them weather climate extremes, and can draw down and store far more carbon dioxide than any manicured lawn. Wormser describes how to plant an organic meadow garden or traditional meadow, that’s right for your site. His book includes guidance on:-Preparing your plot-Designing your meadow-Planting without using synthetic chemicals-Growing 21 starter native grasses and wildflowers, including butterfly weed, smooth blue aster, purple coneflower, wild bergamot, and many more.He also includes tips on building support in neighborhoods where a tidy lawn is the standard, and how to become a meadow activist. To illuminate the many joys of meadow-building, Wormser draws on his own stories, including how growing up off the grid in northern Maine, with no electricity or plumbing, prepared him for his work.\"It’s time to rebuild meadows wherever we can, including the deadscape we call lawn. Owen Wormser explains why, and how to do this, with oodles of highly readable, ecologically sound advice.\"  -Douglas W. Tallamy, Professor of Entomology, author of Bringing Nature Home and Nature's Best Hope\"The author tells us how to grow a meadow, and become a positive force on behalf of the planet. I highly recommend this book.\"  -Dr. John Todd, Ecologist, author of Healing Earth",
  "genres": [
    "Gardening",
    "Nonfiction",
    "Nature",
    "Environment",
    "How To",
    "Plants",
    "Conservation"
  ],
  "author": "Owen Wormser",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/53034189-lawns-into-meadows"
}