{
  "title": "Booksellers To The Savage West",
  "description": "It is 1849, and writers Jed Bradford and Jack Norris embark on an odyssey across the wild North American continent, headed for Gold Rush California - not to mine for gold, but to mine for stories. Join them in their epic journey through the wild west and meet the wonderful, unique, and funny folks living in the frontier mining community of Placerville (or Hangtown as the miners preferred to call it). Mixing history, humor, and a fair bit of mythology, BOOKSELLERS TO THE SAVAGE WEST follows Jed and Jack as they become the old west's first bonafide detectives, come together with a famous theater troupe to save their new community, engage in a perilous race against the warlords of the Central Pacific Railroad, meet Snowshoe Thompson and brave the deadly snows of the Sierra Nevada, and discover that a ghost town may actually have some resident spooks.The first TALES book, TALES OF BIG DOIN'S AT THE CHINESE BAPTIST CHURCH, was compared to the novels of Garrison Keillor, Jean Shepherd, Tom Bodett, and Patrick McManus. Reviews for the first TALES book said; \"Laughing from the first chapter...,\" \"...witty plays on small town politics, family dynamics, and even ancient Roman dictators. The rivalry between McKinleyville and its neighboring town of Centerton over a century-old statue of President William McKinley (the statue is in Centerton, not McKinleyville) leads to one of the craziest heist stories you'll ever read. Reminded me a lot of the old Lake Wobegon stories...,\" \"...a great comic novel about a small town...,\" \"...a funny story and an interesting premise. It would make a hilarious movie...\"TALES OF BOOKSELLERS TO THE SAVAGE WEST is written by Perry Bradford-Wilson, author of the bestselling humor novel TALES OF BIG DOIN'S AT THE CHINESE BAPTIST CHURCH and co-author of the fantasy novel MIDNIGHT IN NEVER LAND.",
  "genres": [],
  "author": "Perry Bradford-Wilson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/12598836-booksellers-to-the-savage-west"
}