{
  "title": "طوق الحمامة في الألفة والألاف",
  "description": "كتاب طوق الحمامة أو طوق الحمامة في الألفة والألاف هو كتاب لابن حزم الأندلسي وصف بأنه أدق ما كتب العرب في دراسة الحب ومظاهره وأسبابه. ترجم الكتاب إلى العديد من اللغات العالمية.واسم الكتاب كاملاً طوق الحمامة في الألفة والأُلاف. ويحتوي الكتاب على مجموعة من أخبار وأشعار وقصص المحبين، ويتناول الكتاب بالبحث والدَّرس عاطفة الحب الإنسانية على قاعدة تعتمد على شيء من التحليل النفسي من خلال الملاحظة والتجربة. فيعالج ابن حزم في أسلوب قصصي هذه العاطفة من منظور إنساني تحليلي. والكتاب يُعد عملاً فريدًا في بابه.Ibn Hazm's Tawq al-Hamama ('The Ring of the Dove')The famous Arabic book on love and lovers, Tawq al-hamâma ('the Ring of the Dove'), is a splendid witness to the high age of Islamic culture in Spain. The book was written in or around 1022 CE in Játiva, south of Valencia, by Abu Muhammad `Ali Ibn Hazm al-Andalusi (Córdoba, 994-1064 CE). It is a youth work by this famous Andalusian poet, philosopher, jurist and scholar of comparative religion.In thirty chapters Ibn Hazm treats thirty moments or personages that are of relevance to love relationships, such as the signs of love, love at first sight, amorous allusions, correpondence between lovers, the messenger between the lovers, being together, fidelity and unfidelity, separation, death. Ibn Hazm alternates from theoritical observations to anecdotes of daily life and he ornates his essays with an abundance of appropriate poetry. The anecdotes are often very peronal and they give the reader a enthralling view on life and love in Islamic Córdoba. All poetry in the Ring of the Dove is Ibn Hazm's own.The Ring of the Dove has been preserved in only one manuscript, which is, since 1665, part of the Oriental collections of Leiden University Library (where it is registered as Or. 927). It was copied in 1338 CE, most probably in Egypt or Syria, from an original that is now lost. The manuscript was first acquired in Istanbul in the middle of the 17th century by the learned and bibliophile Dutch ambassador to the Sublime Porte, Levinus Warner (1619-1665). After his death his entire collection of books and manuscripts came to Leiden.The first edition of the Arabic text was made by the Russian D.K. Pétrof and was published in Leiden in 1914. Before that R.P.A. Dozy (1820-1883) had already published several fragments. All later editions and the numerous translations of the book are directly, or, mostly, indirectly based on the Leiden manuscript. Together they are proof to the fact that Ibn Hazm in his book on love and lovers treats themes that are for all humans in all times.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Poetry",
    "Islam",
    "Classics",
    "Literature",
    "Romance"
  ],
  "author": "Abu Muhammad Ali ibn Hazm",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/53023790"
}