{
  "title": "Family First: A Dynami Society Story",
  "description": "Includes Books 1-6 of the Dynami Society Story Series  \"This book had me so glued to it! I was literally fanning myself while reading the HOT HOT steamy scenes!\" - Stephanie Miller \"Love this story! It's an amazing twist of wanting, hope, tension and lust! It is an easy read and will keep you coming back for more of Alan's works! The plot is killer!\" - Caitlyn Kirby \"Great read. Good plot. Wonderful characters\" - Amazon Reader  Sex, parties, power, and danger.  Not how most eighteen year old's begin their college experience, but for Troy and Emma Kline, that is exactly what awaited them as they left home for college. The siblings were about to be inducted into a powerful organization that all but guaranteed their long term success in life, but there were things about Dynami and their family's past with the society that neither of them were prepared for.  How will they navigate new feelings, insane sexual experiences, and manage to protect themselves when their parents sins come back to haunt the family so many years later? Only time will tell...  Alan Austin is a national award winning author now writing erotic fiction under a new pen name and outside of his established publication outlet in order to delve into some of his deepest desires and fantasies. Alan and his wife are both authors who enjoy the wilder side of life and leverage some of their own experiences along with a healthy dose of imagination to heat things up in their writing.  Alan is a mid-thirties family man from the Midwest United States with an amazing wife and the best kids in the world. He enjoys working out and reading when he has time between family activities and writing. Alan grew up on the west coast before moving his family inland to make a home for himself. He is an active volunteer in his community and loves serving others.  Alan and his wife enjoy sharing their wildest fantasies and he uses his short stories as vehicle to share them with others. It is his hope that his short stories can bring some excitement to others!",
  "genres": [],
  "author": "Alan Austin",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/53023731-family-first"
}