{
  "title": "All the Frequent Troubles of Our Days: The True Story of the American Woman at the Heart of the German Resistance to Hitler",
  "description": "Born and raised in Milwaukee, Mildred Harnack was twenty-six when she enrolled in a PhD program in Germany and witnessed the meteoric rise of the Nazi party. In 1932, she began holding secret meetings in her apartment — a small band of political activists that by 1940 had grown into the largest underground resistance group in Berlin. She recruited working-class Germans into the resistance, helped Jews escape, plotted acts of sabotage, and collaborated in writing leaflets that denounced Hitler and called for revolution. Her co-conspirators circulated through Berlin under the cover of night, slipping the leaflets into mailboxes, public restrooms, phone booths. When the first shots of the Second World War were fired, she became a spy, couriering top-secret intelligence to the Allies. On the eve of her escape to Sweden, she was ambushed by the Gestapo. At a Nazi military court, a panel of five judges sentenced her to six years at a prison camp, but Hitler overruled the decision and ordered her execution. On February 16, 1943, she was strapped to a guillotine and beheaded.Historians identify Mildred Harnack as the only American in the leadership of the German resistance, yet her remarkable story has remained almost unknown until now.Harnack’s great-great-niece Rebecca Donner draws on her extensive archival research in Germany, Russia, England, and the U.S. as well as newly uncovered documents in her family archive to produce this astonishing work of narrative nonfiction. Fusing elements of biography, real-life political thriller, and scholarly detective story, Donner brilliantly interweaves letters, diary entries, notes smuggled out of a Berlin prison, survivors’ testimony, and a trove of declassified intelligence documents into a powerful, epic story, reconstructing the moral courage of an enigmatic woman nearly erased by history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "World War II",
    "Germany",
    "Audiobook",
    "Historical"
  ],
  "author": "Rebecca Donner",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/53023523-all-the-frequent-troubles-of-our-days"
}