{
  "title": "You Ought to Do a Story About Me: Addiction, an Unlikely Friendship, and the Endless Quest for Redemption",
  "description": "The heartbreaking and redemptive story of a fallen-from-grace NFL player discovered by a Pulitzer Prize-winning photojournalist on the streets of New Orleans, and the transformative friendship that binds them.In 1990, while covering a story about homelessness for the New Orleans Times-Picayune, Ted Jackson encountered a half-naked drug addict sleeping under a bridge. After snapping a photo, Jackson woke the man. Pointing to the daily newspaper by his feet, the homeless stranger looked the photojournalist in the eye and said, “You ought to do a story about me.” When Ted asked why, he was stunned by the answer. “Because, I’ve played in three Super Bowls.”That chance meeting was the start of Ted’s thirty-year relationship with Jackie Wallace, a former NFL star who rose to the pinnacle of fame and fortune, only to crash and lose it all. Getting to know Jackie, Ted learned the details of his life, and how he spiraled into the “vortex of darkness” that left him addicted and living on the streets of New Orleans. Ted chronicles Jackie's life from his teenage years in New Orleans through college and the NFL to the end of his pro career and the untimely death of his mother—devastating events that led him into addiction and homelessness. Throughout, Ted pays tribute to the enduring friendship he shares with this man he has come to help and also look at as an inspiration. But Ted is not naïve; he speaks frankly about the risk that such a relationship poses: Can a man like Jackie recover, or is he destined to roam the streets until his end? Tragic and triumphant, inspiring and infuriating, You Ought to Do a Story About Me offers a rare glimpse into the precarious world of homelessness and the lingering impact of systemic racism and poverty on the lives of NOLA’s citizens. Lyrical and evocative, Ted's account is pure, singular, and ambitious—a timeless tale about loss, redemption, and hope in their multifarious forms.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Biography",
    "Football",
    "Adult",
    "Biography Memoir",
    "Memoir"
  ],
  "author": "Ted  Jackson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/53066570-you-ought-to-do-a-story-about-me"
}