{
  "title": "The Distant Dead",
  "description": "A body burns in the high desert hills. A boy walks into a fire station, pale with the shock of a grisly discovery. A middle school teacher worries when her colleague is late for work. By day’s end, when the body is identified as local math teacher Adam Merkel, a small Nevada town will be rocked to its core by a brutal and calculated murder. Adam Merkel left a university professorship in Reno to teach middle school in Lovelock seven months before he died. A quiet, seemingly unremarkable man, he connected with just one of his students: Sal Prentiss, a lonely sixth grader who lives with his uncles on a desolate ranch in the hills. The two outcasts developed a tender, trusting friendship that brought each of them hope in the wake of tragedy. But it is Sal who finds Adam’s body, charred almost beyond recognition, half a mile from his uncles’ compound. Nora Wheaton, the middle school’s social studies teacher, dreamed of a life far from Lovelock only to be dragged back on the eve of her college graduation to care for her disabled father, a man she loves but can’t forgive. She sensed in the new math teacher a kindred spirit--another soul bound to Lovelock by guilt and duty. After Adam’s death, she delves into his past for clues to who killed him and finds a dark history she understands all too well. But the truth about his murder may lie closer to home. For Sal Prentiss’s grief seems heavily shaded with fear, and Nora suspects he knows more than he’s telling about how his favorite teacher died. As she tries to earn the wary boy’s trust, she finds he holds not only the key to Adam’s murder, but an unexpected chance at the life she thought she’d lost.Weaving together the last months of Adam’s life, Nora’s search for answers, and a young boy’s anguished moral reckoning.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Audiobook",
    "Suspense"
  ],
  "author": "Heather   Young",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/53064090-the-distant-dead"
}