{
  "title": "Wordslut: A Feminist Guide to Taking Back the English Language",
  "description": "“I get so jazzed about the future of feminism knowing that Amanda Montell’s brilliance is rising up and about to explode worldwide.”—Jill SolowayA brash, enlightening, and wildly entertaining feminist look at gendered language and the way it shapes us.The word bitch conjures many images, but it is most often meant to describe an unpleasant woman. Even before its usage to mean “a female canine,” bitch didn’t refer to women at all—it originated as a gender-neutral word for “genitalia.” A perfectly innocuous word devolving into an insult directed at females is the case for tons more terms, including hussy, which simply meant “housewife”; and slut, which meant “an untidy person” and was also used to describe men. These are just a few of history’s many English slurs hurled at women.Amanda Montell, reporter and feminist linguist, deconstructs language—from insults, cursing, gossip, and catcalling to grammar and pronunciation patterns—to reveal the ways it has been used for centuries to keep women and other marginalized genders from power. Ever wonder why so many people are annoyed when women speak with vocal fry or use like as filler? Or why certain gender-neutral terms stick and others don’t? Or where stereotypes of how women and men speak come from in the first place?Montell effortlessly moves between history, science, and popular culture to explore these questions—and how we can use the answers to affect real social change. Montell’s irresistible humor shines through, making linguistics not only approachable but downright hilarious and profound. Wordslut gets to the heart of our language, marvels at its elasticity, and sheds much-needed light on the biases that shadow women in our culture and our consciousness.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Audiobook",
    "Linguistics",
    "Language",
    "History",
    "Womens"
  ],
  "author": "Amanda Montell",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/53066379-wordslut"
}