{
  "title": "Exit Rostov",
  "description": "Travelling through Central Asia in 1996, Frederick Lyre learns of his best friend's disappearance and changes plans to go and find him. Picking up the trail in Moscow, he ventures south to the post Soviet depths of Rostov-on-Don and further into the hinterlands of the fragmented Soviet Union, where he is led deeper into the tangled fate of his oldest friend.Uncovering hidden characteristics and unexpected motives, Frederick fears that his friend, presumed dead, has been caught up in a tragic sequence of events leading to his destruction. As a rite of passage, a journey of discovery, a travelogue and a psychological portrait of friendship, the novel draws the reader into the hidden world of being which beats beneath the semblance of reality.The story is intricate and evokes another world, of suburban Rostov tenements, of dachas in the Steppe, of Tashkent, Khiva, Bukhara, Samarkand, Moscow, the Nyeskuchniy Gardens, the River Don, making love in Tanais, of the sea of Asov, the northern Caucasus, of Stavropol, of refugee camps in Ingushetia, mountains, and field hospitals in the Caucasus, of fin de siecle London, and Aquitaine. From the viewpoint of Frederick, a young man of 23yrs, seeking his friend Cazimir, in the Northern Caucasus in 1996, the narrative blends observation about Russian people and culture, the Don Steppe, post-Soviet urbanscapes at the turn of the century with intimate and sensitive meditations on love, sex, death, religion, God, one's place in society and money, and investigates the potent forces of sexual desire, attraction and adolescent mental health, coming to terms with the powerful subconscious drives of lust, desire, and obsession.Written as an interior dialogue, with reported conversation, notebook extracts, poems and transcriptions, the text is varied, raw and sometimes uncomfortable. The voice of the narrator Frederick is constant, but on discovery of notebooks written by Cazimir, we learn from Cazimir's first-hand writings, which illuminate his thoughts, despairs, motivations and obsessions. Exit Rostov is a story of friendship and the ends to which one will go to save it. A story of love in its various forms, of the unrequited, the fulfilled, of new love and love that has run its course. A story of how individuals and companies took over ex-Soviet assets and territories, in the aftermath of the Soviet Union's demise, with Public-Private Partnerships. A story of intelligence gathering, Sufi-Islam, of art's supremacy over politics and how other people seek to control others at any cost. A story of how setting out with the best intentions can be fatal. It's a story of discovery, learning how to find people hiding in the layered depths of their divided and most essential, secret selves.",
  "genres": [
    "Contemporary",
    "Book Club",
    "Fiction",
    "Drama"
  ],
  "author": "Henry Virgin",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/53056333-exit-rostov"
}