{
  "title": "I Escaped the California Camp Fire: California's Deadliest Fire",
  "description": "A gripping look at the 2018 California Camp Fire disaster through the eyes of one brave boy—written by Northern California native and popular mystery author SD Brown and bestselling children's historical fiction author, Scott Peters.When 14-year-old Troy’s parents leave him in charge overnight, he has no idea his life in Paradise is about to change. Unaware of any danger, Troy and his kid sister dive into a huge junk-food-feast and watch movies until 2 am. When Troy's dog, Rascal, jerks him awake at 9 am, he's shocked to see that it's black as night outside. How can that be? Then he gets a bunch of panicked texts from his best friend.The first reads—i see flamesThe second—get out of townThe last—NOW!!!!!!Terror slingshots down Troy's spine. He sprints to the neighbor’s house, only to have Mrs. Jones tell him to stay put. Wildfires happen all the time. The firemen will come.But will they?He can see flames racing toward their homes.Unable to reach his parents, and with a kid sister, a dog, and a cat to protect, he knows he has to act. How can he get them all to safety? They'll never be able to outrun the fire on foot. He has to make a decision, fast.Does he have what it takes to escape?Set in Paradise, Butte County, California during the November 2018 wildfire natural disaster, this kids' inspirational book is based on witness accounts and hours of research. The Camp Fire was California's biggest forest fire, and the sixth biggest wildfire in American history.A study guide is availableFor readers 9 and up.This is the 2nd book in the I Escaped Series about brave kids who face real world challenges and find ways to escape.If you like New York Times Bestseller Lauren Tarshis's I Survived Series, you'll love the I Escaped Series.",
  "genres": [
    "Childrens",
    "Young Adult"
  ],
  "author": "S.D. Brown",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/53052133-i-escaped-the-california-camp-fire"
}