{
  "title": "Love & Other Crimes: Stories",
  "description": "“Sara Paretsky is a genius.” —LEE CHILDFrom New York Times bestselling author Sara Paretsky, a collection of thrilling crime and detective short stories, many featuring legendary detective V.I. Warshawski—including a brand-new V.I. story.New York Times bestselling author Sara Paretsky is the master of twisting suspense and compelling plots. She has been hailed by the crime community as “a legend” (Harlan Coben) and “one of the all-time greats” (Karin Slaughter). Her acclaimed novels featuring detective V.I. Warshawski have become one of the most celebrated series in modern fiction. Now in this spellbinding collection, Paretsky showcases her extraordinary talents with fourteen short stories, including one new V.I. story and seven other classics featuring the indomitable detective.In “Miss Bianca,” a young girl becomes involved in espionage when she befriends a mouse in a laboratory that is conducting dark experiments. Ten-year-old V.I. Warshawski appears in “Wildcat,” embarking on her very first investigation to save her father. A hardboiled New York detective and elderly British aristocrat team up to reveal a murderer in Chicago during the World’s Fair in “Murder at the Century of Progress.” In the new title story, “Love & Other Crimes,” V.I. treads the line between justice and vengeance when the wrongful firing of a family friend makes him a murder suspect.For longtime fans of V.I. Warshawski, new readers discovering her for the first time, or any lover of crime and bone-chilling suspense, Love & Other Crimes is a celebration of Paretsky’s exceptional storytelling skill and a searing exploration of the dark conspiracies and desperate human acts hiding in plain sight.",
  "genres": [
    "Mystery",
    "Short Stories",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Thriller"
  ],
  "author": "Sara Paretsky",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/53066567-love-other-crimes"
}