{
  "title": "Beast in Shining Armor",
  "description": "An alternative cover edition for this ASIN can be found here.Beauty vs. Beast…Contestant One: Avenant is a handsome prince with a dark side. There’s a beast inside of him, always waiting to get out. All his life, he’s been labeled a monster and he’s done his best to live up to his Bad reputation. His parents hated him, his fairytale kingdom fears him, and now he’s been dragged into court. Again. His newest legal troubles are all because Belle Ashman stole his throne. The beautiful bookshop owner is the one woman Avenant longs for. The two of them have been in competition since childhood and the contest just became winner-take-all.Contestant Two: Tired of Avenant ruining her dates, firing Mother Goose, and tearing down Humpty Dumpty’s wall, Rosabella Aria Ashman decided to depose the tyrant. Eight months ago, Belle led a rebellion and had Avenant thrown in prison. Now, the Beast has returned, demanding his kingdom back. Avenant might be gorgeous, but he’s also arrogant, selfish and he’s been mean to her since kindergarten. This time, Belle’s determined vanquish him, once and for all.The Ultimate Showdown: In the farthest corner of the Northlands, there is an impenetrable labyrinth. Made of ice and stone, no one has ever entered it and emerged alive. Now, Belle, Avenant, and other storybook contenders for the crown are heading into the maze. Whoever solves its riddles gets the kingdom. In order to win, Belle and Avenant are going to have to work together. Considering their lifelong feud, that would be challenging enough, but they’re also dealing with an angry minotaur, an unknown killer, miles of twisting corridors… and the fact that these two mortal enemies might just make a perfect team.",
  "genres": [
    "Fantasy",
    "Romance",
    "Enemies To Lovers",
    "Fantasy Romance",
    "Paranormal",
    "Retellings",
    "Beauty and The Beast"
  ],
  "author": "Cassandra Gannon",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/53042477-beast-in-shining-armor"
}