{
  "title": "Obsessed",
  "description": "I wanted him from the moment I laid eyes on him and from that point on, the question wasn’t if I’d have him but when…Thirty-five-year-old Matias de la Vega is good at one thing and one thing only. Though he doesn’t officially carry the title of killer when it comes to his role in an underground vigilante group, he’s got no problem getting his hands dirty if it means getting justice for those who can’t get it on their own.Such is the case when single dad Sam Wittier is confronted by a stalker bent on murder. While neutralizing the threat is all in a day’s work for Matias, what comes after is anything but. Although Matias isn’t particularly surprised by his attraction to the older Sam, his inability to walk away from the still-grieving widower is a complication.An unexpected and dangerous complication…Nothing about the mysterious Matias makes sense to me. The emotionally distant soldier says what he means and takes what he wants. And for whatever reason, what he wants is me. That should have me running for the hills. It should, but it doesn’t…For forty-eight-year-old Sam Wittier, life is as good as it’s been since he lost the man of his dreams more than two decades earlier. After handing the reins of his successful business over to his older son, Sam is happy to settle into the quiet, simple life of being a full-time single dad to his newly adopted little boy.Unfortunately, life didn’t get the message. After nearly losing everything to a deranged stalker, Sam finds himself face to face with a man who is anything but quiet and simple. There’s no reason he should want the unpredictable, take-no-prisoners Matias in his life or his bed, but just like life, his body isn’t getting the message.One night with Sam is all I need to get him out of my head for good. One night will be enough to end my obsession with him. It has to be…While Sam and Matias share a white-hot chemistry that neither has ever known before, that’s about all they have in common. But as one passionate encounter leads to another and the line between obsession and need begins to blur, will Matias and Sam find that maybe they aren’t so different after all? And what will that mean for the ghosts of the past that have haunted each man for so long?The ghosts that are willing to be buried as well as the ones that aren’t…",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Military Fiction",
    "Gay",
    "Audiobook"
  ],
  "author": "Sloane Kennedy",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/53067966-obsessed"
}