{
  "title": "Vampire Close",
  "description": "Fiona MacPhee is a woman with a mission--and a very dark secret. Sidekick to Joan Armstrong, a famous demon hunter, Fiona must scour Edinburgh for the answer to a cryptic prophecy before an ancient evil rends the veil between the worlds at Samhain. She can't afford any distractions. Especially not from Rory MacLaren. A handsome, charming rogue, Rory has also been a vampire for 260 years. When Rory catches Fiona in a deserted wynd after midnight, his offer of help could not be better--or more suspiciously--timed.Vampire Close - Voted # 7 in All About Romance's Top Ten E-Books PollVampire Close was a finalist in the Best Heroine category of the Ancient City Romance Writers' Anne Bonney Readers' Choice AwardRated 4 Stars in Romantic Times BOOKreviews\"This is a wonderfully imaginative story with intriguing characters, two romances, a bit of mystery and even some horror. The relationships that grow among the main characters are well defined, and their accents have an authentic sound. The ending leaves you longing for more.\" - Susan Mobley, Romantic Times\"Susanne Saville tells a tale of ancient history and old battles and how they are affecting the future of the world as we know it.\" - Candy, Sensual Ecataromance.com\"This is a very exciting and fast moving vampire story.... The characters are very vivid as is the author's description of Edinburgh both above and below ground. ... This is a team that I would love to see more of.\" - Maura Frankman, The Romance Studio\"In Vampire Close, Ms. Saville gave her vampire more life than he had any right to lay claim to. Rory was a rascal of the first order with as much natural charm as a woman could want from a Scottish vamp. ... Vampire Close was a lovely novel to pass the time with, and would make a perfect read for readers that love witty banter between protagonists.\" - Tara, LoveRomances.com\"Vampire Close is full of suspense and exciting scenes that will have your jaw dropping to the ground. ... Ms. Saville is definitely an author to watch out for!\" - Klarissa, JoyfullyReviewed.comFIVE Flags from Euro-Reviews!\"Not only is this a book of twists and intrigue, but [of] love and forgiveness. Miss Saville's use of the Gaelic language as well as the modern day language of the Scottish shows a great depth of research and knowledge of their speech.\" - Debbie, Fallen Angel Reviews",
  "genres": [
    "Paranormal Romance",
    "Vampires",
    "Urban Fantasy"
  ],
  "author": "Susanne Saville",
  "average_rating": "3.09",
  "url": "https://www.goodreads.com/book/show/5306998-vampire-close"
}