{
  "title": "Charlie Sunshine",
  "description": "Sometimes love is a lot closer to home than you think.Charlie Burroughs can’t keep a man. All he wants is a good relationship like the ones he sees his friends having, but none of the men he picks ever work out. Despite him trying to be the perfect boyfriend, the men are either threatened by his looks or his epilepsy or a combination of the two. It’s lucky that he has his best friend Misha to turn to. The two of them are closer than peas in a pod and fiercely loyal to each other. He can’t imagine his life without Misha in it.Misha Lebedinsky is the complete opposite of his best friend. Being the support system for his mum and twin sisters leaves Misha with neither the time nor the inclination for a relationship. Quick and frequent hook-ups are his favourite means of communication and any other pesky emotional needs he has are met by Charlie, who he’s devoted to. He lives a life of happy compartmentalization with no intention of ever changing.All of this changes when the two best friends move in together. Being in close proximity means that they suddenly start to see each other in a very different light. But Charlie struggles when his drive to be the perfect partner clashes with the fact that he’s in love with a man who knows every little thing about him. And even if he can get past that, can a relationship ever work with a man who’d need a dictionary to tell him what love means? From bestselling author Lily Morton comes a love story about a sunny librarian who has relationship written all over him and a cynical banker who doesn’t even have it in his blurb.This is the second book in the Close Proximity series but it can be read as a standalone.",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "LGBT",
    "Disability",
    "Contemporary Romance"
  ],
  "author": "Lily Morton",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/53083224-charlie-sunshine"
}