{
  "title": "The Mahabharata: A Modern Rendering, Vol 1",
  "description": "The Mahabharata is the more recent of India's two great epics, and by far the longer. First composed by the Maharishi Vyasa in verse, it has come down the centuries in the timeless oral tradition of guru and sishya, profoundly influencing the history, culture, and art of not only the Indian subcontinent but most of south-east Asia. At 100,000 couplets, it is seven times as long as the Iliad and the Odyssey far and away the greatest recorded epic known to man.The Mahabharata is the very Book of in its variety, majesty and, also, in its violence and tragedy. It has been said that nothing exists that cannot be found within the pages of this awesome legend. The epic describes a great war of some 5000 years ago, and the events that led to it. The war on Kurukshetra sees ten million warriors slain, brings the dwapara yuga to an end, and ushers in a new and sinister this present kali yuga, modern times.At the heart of the Mahabharata nestles the Bhagavad Gita, the Song of God. Senayor ubhayor madhye, between two teeming armies, Krishna expounds the eternal dharma to his warrior of light, Arjuna. At one level, all the restless action of the Mahabharata is a quest for the Gita and its sacred stillness. After the carnage, it is the Gita that survives, immortal lotus floating upon the dark waters of the final secret!With its magnificent cast of characters, human, demonic, and divine, and its riveting narrative, the Mahabharata continues to enchant readers and scholars the world over. This new rendering brings the epic to the contemporary reader in sparkling modern prose. It brings alive all the excitement, magic, and grandeur of the original-for our times.",
  "genres": [
    "Mythology",
    "India",
    "Religion",
    "Classics",
    "Philosophy",
    "Fantasy",
    "Spirituality"
  ],
  "author": "Ramesh Menon",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/1260131.The_Mahabharata"
}