{
  "title": "Black Water: The Book of Fantastic Literature",
  "description": "This huge anthology offers a kaleidoscope of brilliant writing from the Magi of the imagination. Alberto Manguel has selected 72 fantastic tales from life on the edge of the twilight zone, with stories from Marguerite Yourcenar, Herman Hesse, Italo Calvino, Vladimir Nabokov, and many, many more. This is a collection of irresistible masterpieces, many of which have never before appeared in the English language.Fantastic literature Manguel writes in his introduction, makes use of our everyday world as a facade through which the undefinable appears, hinting at the half-forgotten dreams of our imagination. Unlike tales of fantasy, fantastic literature deals with what can be best defined as the impossible seeping into the possible, what Wallace Stevens calls black water breaking into reality. Fantastic literature never really explains everything, it thrives on surprise, on the unexpected logic that is born from its own rules.Contents:House taken over by Julio CortázarHow love came to Professor Guildea by Robert S. HichensClimax for a ghost story by I.A. IrelandThe mysteries of the Joy Rio by Tennessee WilliamsPomegranate seed by Edith WhartonVenetian masks by Adolfo Bioy CasaresThe wish house by Rudyard KiplingThe playground by Ray BradburyImportance by Manuel Mujica LáinezEnoch Soames by Max BeerbohmA visitor from down under by L.P. HartleyLaura by SakiAn injustice revealedA little place off the Edgware Road by Graham GreeneFrom \"A School Story\" by M.R. JamesThe signalman by Charles DickensThe tall woman by Pedro Antonio de AlarcónA scent of mimosa by Francis KingDeath and the gardener by Jean CocteauLord Mountdrago by W. Somerset MaughamThe sick gentleman's last visit by Giovanni PapiniInsomnia by Virgilio PiñeraThe storm by Jules VerneA dream (from The Arabian Nights Entertainments)The facts in the case of M. Valdemar by Edgar Allan PoeSplit second by Daphne du MaurierAugust 25, 1983 by Jorge Luis BorgesHow Wang-Fo was saved by Marguerite YourcenarFrom \"Peter and Rosa\" by Isak DinesenTattoo by Jun'ichirō TanizakiJohn Duffy's brother by Flann O'BrienLady into fox by David GarnettFather's last escape by Bruno SchulzA man by the name of Ziegler by Hermann HesseThe Argentine ant by Italo CalvinoThe lady on the grey by John CollierThe queen of spades by Alexander PushkinOf a promise kept by Lafcadio HearnThe wizard postponed by Juan ManuelThe monkey's paw by W.W. JacobsThe bottle imp by Robert Louis StevensonThe rocking-horse winner by D.H. LawrenceCertain distant suns by Joanne GreenburgThe third bank of the river by João Guimarães RosaHome by Hilaire BellocThe door in the wall by H.G. WellsThe friends by Silvina OcampoEt in sempiternum pereant by Charles WilliamsThe captives of Longjumeau by Léon BloyThe visit to the museum by Vladimir NabakovAutumn Mountain by Ryūnosuke AkutagawaThe sight by Brian MooreClorinda by André Pieyre de MandiarguesThe pagan rabbi by Cynthia OzickThe fisherman and his soul by Oscar WildeThe bureau d'echange de maux by Lord DunsanyThe ones who walk away from Omelas by Ursula K. LeGuinIn the penal colony by Franz KafkaA dog in Durer's etching \"The Knight, Death and the Devil\" by Marco DeneviThe large ant by Howard FastThe lemmings by Alex ComfortThe grey ones by J.B. PriestleyThe feather pillow by Horacio QuirogaSeaton's aunt by Walter de la MareThe friends of the friends by Henry JamesThe travelling companion by Hans Christian AndersenThe curfew tolls by Stephen Vincent BenetThe state of grace by Marcel AyméThe story of a panic by E.M. ForsterAn invitation to the hunt by George HitchcockFrom the \"American Notebooks\" by Nathaniel HawthorneThe dream by O. Henry",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Fiction",
    "Horror",
    "Anthologies",
    "Magical Realism",
    "Speculative Fiction"
  ],
  "author": "Alberto Manguel",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/53080.Black_Water"
}