{
  "title": "The Day The World Sneezed: March 12, 2020",
  "description": "This summer one man will travel miles ... to a forgotten people ... to save a nation ... and honor his wife.  \n\"The Day The World Sneezed\" is a story of hope, helping others, and finding the \"light-hearted\" moments in the midst of tragedy.\nThe story covers news reports as they happened from March 14 through April 6. This is by design. Years from now readers may wonder what all the fuss was about. Part of Elmer's story is to document events as they happened during his journey in the weeks following the spread COVID across America. As with all things in life, Elmer faced a choice: work for the good of others or serve and save himself. \"The Day The World Sneezed\" is one man's account of how he lived out the Golden Rule. Watch Elmer's Film Trailer at: amazon.com/author/eddiejones ★ ★ ★ ★ ★ \"Eddie Jones does a remarkable job of leaping into the current (as of early 2020) Coronavirus crisis with a tale that would have been completely believable as a \"cozy dystopian\" Sci Fi novel had he released it just a few years ago. The book remains uncannily on track with its observations. And, as far as I know, it's one of the first works of fiction released that directly addresses the crisis. Recommended.\" - Amazon review★ ★ ★ ★ ★ \"A true tale of the heart. A ride full of suspense, laughter, and heartbreak. My praise to the ending because I was getting angry that he might serve time.On the porch, on his farm. I guess no harm no foul. Great story, God bless America. I gave it 5 stars.\" - Amazon review★ ★ ★ ★ ★ \"A very entertaining and timely read. Great character development for all the main characters and especially Elmer. A man who only tried to do what he thought best. Well done and recommended. \" - Amazon review★ ★ ★ ★ ★ \"A humorous look at a dark time. I did enjoy this book. The voice was strong throughout, and in clueless but good-natured Elmer, our main character, the author truly has struck gold. I'd give this a solid 4.5 stars (if Amazon allowed for such things).\" - Amazon review",
  "genres": [
    "Contemporary",
    "Fiction"
  ],
  "author": "Eddie       Jones",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/53080032-the-day-the-world-sneezed"
}