{
  "title": "A War Like No Other: How the Athenians & Spartans Fought the Peloponnesian War",
  "description": "Provocative military historian Victor Davis Hanson has given painstakingly researched & pathbreaking accounts of wars ranging from classical antiquity to the 21st century. Now he juxtaposes an ancient conflict with modern concerns to create his most engrossing work to date, A War Like No Other. Over the course of a generation, the Hellenic poleis of Athens & Sparta fought a bloody conflict that resulted in the collapse of Athens & the end of its golden age. Thucydides wrote the standard history of the Peloponnesian War, which has given readers throughout the ages a vivid & authoritative narrative. But Hanson offers something new: a complete chronological account that reflects the political background of the time, the strategic thinking of the combatants, the misery of battle in multifaceted theaters & insight into how these events echo in the present. He compellingly portrays the ways Athens & Sparta fought on land & sea, in city & countryside, & details their employment of the full scope of conventional & nonconventional tactics, from sieges to targeted assassinations, torture & terrorism. He also assesses the crucial roles played by warriors such as Pericles & Lysander, artists, among them Aristophanes, & thinkers including Sophocles & Plato. Hanson’s perceptive analysis of events & personalities raises many thought-provoking questions: Were Athens & Sparta like America & Russia, two superpowers battling to the death? Is the Peloponnesian War echoed in the endless, frustrating conflicts of Vietnam, Northern Ireland & the current Middle East? Or was it more like America’s own Civil War, a brutal rift that rent the fabric of a glorious society, or even this century’s “red state—blue state” schism between liberals & conservatives, a cultural war that manifestly controls military policies? Hanson daringly brings the facts to life & unearths the often surprising ways in which the past informs the present. Brilliantly researched, dynamically written, A War Like No Other is like no other history of this important war.",
  "genres": [
    "History",
    "Nonfiction",
    "Ancient History",
    "War",
    "Military History",
    "Military Fiction",
    "Greece"
  ],
  "author": "Victor Davis Hanson",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/531.A_War_Like_No_Other"
}