{
  "title": "Written in Blood",
  "description": "IF HE WRITES YOUR NAME DOWN, IT'S A DEATH SENTENCE . . .  Los Angeles, December 4th - exactly three weeks until Christmas day.  Angela Wood, a master in the art of pickpocket, has just finished for the day - six hundred and eighty-seven dollars – not bad for less than fifteen minutes work.   As she celebrates her profitable day with a cocktail, one of the patrons in the lounge she’s in catches her attention by being rude to an old man.  Angela decides to teach him a lesson, and steals the man’s expensive-looking leather bag. Inside is no money ... no laptop computer ... nothing of any value ... at least not to Angela. Just a black, leather-bound book, surprisingly heavy.  Curiosity takes over and in the comfort of her apartment, Angela quickly leafs through the pages.   That is when the worst nightmare of her life begins. This is no ordinary book.Read it at your own peril. The compulsive new thriller from the author of the Sunday Times Number One bestseller Hunting Evil. \nWhat the reviewers are saying about Chris Carter:\n 'Carter has a background in criminal psychology and the killers at the centre of his novels are all the more terrifying for it' Mail on Sunday, chosen for 'If You Only Pack One' 'Carter is one of those authors who makes writing look effortless ... I couldn't put it down' Crime Squad 'An insanely good crime series. Extraordinarily well written, high quality and high drama all the way' Liz Loves Books 'An intriguing and scary thriller' Better Reading 'A gripping feast of thrills' Shots 'A gripping psychological thriller' Breakaway 'This is a chilling, compulsive portrait of a psychopath, and proves that Carter is now in the Jeffery Deaver class' \nDaily Mail\n 'Punchy and fast paced' \nSunday Mirror\n 'There's a touch of the Patricia Cornwell about Chris Carter's plotting' \nMail on Sunday",
  "genres": [
    "Thriller",
    "Crime",
    "Mystery",
    "Audiobook",
    "Fiction",
    "Horror",
    "Mystery Thriller"
  ],
  "author": "Chris Carter",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/53096454-written-in-blood"
}