{
  "title": "Reticence",
  "description": "From New York Times bestselling author Gail Carriger comes the final book in the Custard Protocol series.  Percy is off to Japan, but will Japan survive Percy? Bookish and proper Percival Tunstell finds himself out of his depth when floating cities, spirited plumbing, and soggy biscuits collide in this delightful conclusion the Custard Protocol series. Percival Tunstell loves that his sister and friends are building themselves a family of misfits aboard their airship, the Spotted Custard. Of course, he'd never admit that he belongs among them. Percy has always been on the outside - dispassionate, aloof, and hatless. But accidental spies, a trip to Japan, and one smart and beautiful doctor may have him renegotiating his whole philosophy on life. Except hats. He's done with hats. Thank you very much. “Carriger’s prose is playful and droll, with frequent laugh-worthy moments, tongue-in-cheek humor, and sparkling repartee.” ~ Publisher's Weekly The Custard Protocol series is Firefly goes steampunk fantasy and it’s perfect for fans of Lindsay Broker, Richelle Mead, or Genevieve Cogman. If you like Percy and Arsenic’s awkward but sweet dynamic and want more romantic comedy of manners, then you should also try Carriger’s Poison or Protect. The Custard Protocol Series  Prudence  Imprudence  Competence  Reticence   Also by Gail Carriger set in the Parasolverse  The Finishing School series (start with Etiquette & Espionage) The Delightfully Deadly novellas The Parasol Protectorate series (start with Soulless) The Supernatural Society novellas  The Claw & Courtship novellas (try How to Marry a Werewolf)   As G L Carriger  The San Andreas Shifter series (start with The Sumage Solution)  The 5th Gender",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Historical Fiction",
    "Fiction",
    "Audiobook"
  ],
  "author": "Gail Carriger",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/53100600-reticence"
}