{
  "title": "Guarding the Single Mother",
  "description": "Retired Navy SEAL, Clint Backwater, enjoys his solitary life as owner of the Ask Questions Later gun range. It’s the kind of place you find because you know a guy. So when Leila Ortiz, a petite woman with a “baby on board” sticker on the back of her car—and an 18-month-old boy in her arms—shows up at the range, panicked and desperate for a gun, he knows something is wrong. Having grown up in the foster system, Clint has seen what happens when you let yourself get too invested—things get messy, people leave. He made himself a promise to never get emotionally involved again, but the former SEAL in him feels the tug to help this woman and her child.  Leila’s ex-husband is being released from prison early on good behavior and she found out too late. He was supposed to serve five years, not two, and Leila is unprepared to protect herself and her son. She promised him they’d never run again—they’ve made a nice life for themselves and the last thing she wants to do is leave it all behind.  When Clint refuses to give Leila a gun without lessons, she agrees to return to the range to learn. At first, Leila won’t say why she’s so desperate for protection, but when the threats from her ex escalate, it becomes clear what she’s afraid of.  Clint is a loner. Always has been, always will be. So when Leila and her little son enter his life, it hits him—hard—that maybe being alone isn’t what he needs. Still, having his solitary life disrupted when he invites the little family into his home is a bit tougher to take than he thought. With Leila and her son in danger, though, he’ll do whatever it takes to keep them safe—even putting up with stray toys and changing a diaper or two.  But the biggest danger might be to his heart, when it starts to look like the safest thing for Leila and her baby might be to leave her problems—and her budding relationship with Clint—behind.  This novel contains sexual content, violence, profanity, and scenes with referenced substance abuse.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Military Romance",
    "Contemporary Romance",
    "Contemporary",
    "Novella",
    "Romantic Suspense"
  ],
  "author": "Leslie North",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/53089280-guarding-the-single-mother"
}