{
  "title": "At First Sight",
  "description": "Tucker: I’m fine. I don’t need any help. I only have these bandages on my eyes for a week. I’ve never needed anyone, and I don’t plan on changing that now. But then my neighbor knocked on my door. I’ve never met her before, but I want to now. Her soft, sweet voice hits me right in the chest. I feel an ache deep inside, a profound emptiness I didn’t know I had. I’m broken, bitter, and a bastard to boot. Try as I might to shake off my intrusive yet intoxicating neighbor, she keeps showing up and taking care of me. I might have to see if I can make her stay forever.Mila: I like to keep to myself. People tend to judge me by my weight, my scars, and my general lack of people skills. When I have to leave my apartment for food and supplies, I stick to the shadows, trying to navigate life unnoticed. But that doesn’t mean I don’t notice other people, especially my tall, dark, and stupidly handsome neighbor. I wouldn’t say I’ve been stalking him. I mean, I know his schedule, when he checks his mail, and where he keeps his spare key hidden. Under the doormat. Seriously? I know all about hiding places, and that one sucks. When I hear him take a spill through our shared wall, I have to go over and see if he’s okay. I somehow find myself over at his place day after day, falling more and more for the grumpy butt with the surprisingly sweet streak. Will he still want to be with me when his bandages come off, or will he run away like everyone else in my life?AT FIRST SIGHT is all about a quirky, curvy woman caring for her grumpy, growly alpha of a neighbor, and in turn, letting him heal her scars that are more than skin deep. As always, there's plenty of sweet, lots of heat, and just enough drama to keep things interesting.",
  "genres": [
    "Romance",
    "Contemporary",
    "Plus Size",
    "Novella",
    "Contemporary Romance",
    "Adult",
    "Friends To Lovers"
  ],
  "author": "Cameron Hart",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/53088853-at-first-sight"
}