{
  "title": "Raghi der Schatten",
  "description": "Junger Mörder, hast du je in Betracht gezogen, dass du besser in ein anderes Zeitalter passen könntest als in die Gegenwart?Unter den Lehrlingen der Mördergilde ist Raghi der Außenseiter - der verantwortungslose Nichtsnutz. Als er verschwinden muss, schleicht er sich wie ein Dieb die Treppen der Ewigkeit in die Vergangenheit hinab.Raghi findet Zuflucht bei einem geheimnisvollen Clan von Fahrenden, dessen positive Philosophie schmerzhaft mit seinem selbstmörderischen Leichtsinn kollidiert. Das uralte magische Volk führt ihn in den Zauber des Lebens und der Freundschaft ein und ahnt nichts von den tödlichen Gefahren, die Raghi mit sich trägt.Gewissenlose Mächte nehmen jedoch sofort Notiz. Raghi muss sich schnellstens seinem Schicksal stellen, sonst verdammt er seine neue Familie und die gesamte Schöpfung zu ewiger Dunkelheit - und vergibt sich alle Chancen auf eine einzigartige Liebe direkt aus den Legenden der Vorzeit.___«Raghi der Schatten» ist der zweite Band in der positiven Fantasy-Reihe «Die Treppen der Ewigkeit» von Isa Day.Die spannende, romantische und magische Geschichte spielt in ihrer eigenen Fantasy-Welt. Inspiriert von Elementen aus der Yoga-Philosophie, erzählt sie von der Suche nach dem Sinn des Lebens und dem Mut, sich einem außergewöhnlichen Schicksal zu stellen. Wer Elemente wie eine Mörderzunft, Zeitreisen, Romantik, magische Tiere, Liebe und eine Prise Humor mag sollte auf seine Kosten kommen.Jeder Band der Serie «Die Treppen der Ewigkeit» hat eigene Protagonisten, kann für sich allein gelesen werden und sollte (gemäß Konzept) in sich abgeschlossen sein. «Raghi der Schatten» bildet diesbezüglich eine Ausnahme. Die Geschichte hat sich so faszinierend entwickelt, dass daraus eine Dilogie wurde. Der vorliegende Band ist erste von zweien, also Band 2.1 in der Serie. Band 2.2 befindet sich in Vorbereitung.___WEITERE BÜCHER VON ISA DAYFantasy-Serie «Die Treppen der Ewigkeit»- Wolf des Südens (Band 1)Fantasy-Serie «Der Weg des Heilers»- Der verletzte Himmel (Band 1)- In den Tiefen der Ewigkeit (Band 2)- Bis das Eis bricht: Tantans Geschichte (Band 3)- Die Nacht des Vergessens: Tantans Geschichte (Band 4)[Weitere Bände in Vorbereitung]",
  "genres": [],
  "author": "Isa Day",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/53106741-raghi-der-schatten"
}