{
  "title": "Crossroads: I Live Where I Like: A Graphic History",
  "description": "Drawn by South African political cartoonists the Trantraal brothers and Ashley Marais, I Live Where I Like is a graphic nonfiction history of women-led movements at the forefront of the struggle for land, housing, water, education, and safety in Cape Town over half a century. Drawing on over sixty life narratives, it tells the story of women who built and defended Crossroads, the only informal settlement that successfully resisted the apartheid bulldozers in Cape Town. The story follows women’s organized resistance from the peak of apartheid in the 1970s to ongoing struggles for decent shelter today. Importantly, this account was workshopped with contemporary housing activists and women’s collectives who chose the most urgent and ongoing themes they felt spoke to and clarified challenges against segregation, racism, violence, and patriarchy standing between the legacy of the colonial and apartheid past and a future of freedom still being fought for. Presenting dramatic visual representations of many personalities and moments in the daily life of this township, the book presents a thoughtful and thorough chronology, using archival newspapers, posters, photography, pamphlets, and newsletters to further illustrate the significance of the struggles at Crossroads for the rest of the city and beyond. This collaboration has produced a beautiful, captivating, accessible, forgotten, and in many ways uncomfortable history of Cape Town that has yet to be acknowledged. I Live Where I Like raises questions critical to the reproduction of segregation and to gender and generational dynamics of collective organizing, to ongoing anticolonial struggles and struggles for the commons, and to new approaches to social history and creative approaches to activist archives.",
  "genres": [
    "Graphic Novels",
    "Nonfiction",
    "Comics",
    "South Africa",
    "History"
  ],
  "author": "Koni Benson",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/53125734-crossroads"
}