{
  "title": "The Divide Boxed Set: Darkness Descends & The Between Times",
  "description": "Marta Moran Bishop’s Darkness Descends is powerful, gripping work! It’s a compelling, sometimes scathing prequel to her first series title, The Between Times. Set in a dystopian city-state, Bishop indicts a patriarchal oligarchy that feeds a rape culture at the same time as it plots the overthrow of the rule of law with the anarchic rule of a well-managed mob psyche. The Roman people were given bread and circuses. The crowds in Darkness Descends are handed Rebecca, Jewell’s mother, and a crucial charter character of the series, who faces public torture, humiliation, assault, and finally, auto-da-fé, burning at the stake, which she accepts as her fate as the ultimate sacrifice for a greater good. Bishop pulls no punches. The blows land all the harder when one realizes she is not working solely from imagination. She has incorporated into her literary tapestry the warp of today’s culture, with the weft of actual history, including a chilling early Twentieth Century plot by brutal American financial moguls to overthrow the United States government. Who knew?! This book is devastating. I’m praying for an uplifting third installment to arrive in my Kindle soon, but given Bishop’s dim view of humanity and history, I’m not holding out too much hope for a Pixar ending. Every win in Bishop’s world comes at a great price, and the brilliant Darkness Descends is no exception. Of course, I absolutely can’t wait to see what Bishop will come up with next! Robert Blake Whitehill, Author/Screenwriter - The Ben Blackshaw Series  What if...for the first time in the history of the United States we took a social and economic nose dive into oblivion? THE BETWEEN TIMES is just such a scenario. A story that reads like a folk tale from the past, but in reality is a fantastic possibility based on the choices available to us today.  The premise is nothing short of an incredible imagination as modern day Chicago fades into an evil darkness separated by a wall. A separateness ruled by the upper society that isolates and mistreats the poor. These less fortunate people, in a short amount of time find themselves forced to live in the lower communities suffering from mistreatment comparable only to the concentration camps during WWII. Women are no longer human beings, but are nothing more than breeding animals kept only to prevent extinction of the race. The conditions are bleak and seemingly hopeless.  It is the belief in a Legend that becomes the driving force behind the survival. A young girl named Jewel, living in the captivity of this devastating socioeconomic environment, is the dream. She manifests hope and magic from within this beautiful tale.  Fantastical, Magical, & Mystical in a story that will make you believe it is about a long forgotten past, but in reality is a possible future! I wholeheartedly recommend this remarkable highly imaginative novel!",
  "genres": [],
  "author": "Marta Moran Bishop",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/53113056-the-divide-boxed-set"
}