{
  "title": "Cry Wolf",
  "description": "I looked between the monster and the man, and I knew at once who was the beast.\nIsabelle Berger grew up hearing stories of a legendary beast who killed over a hundred people. When a new wolf is spotted near the forest, the men of her village are convinced that another monster is on the rise. Isabelle is less certain, until her father is killed in the hunt.Alone and hungry for revenge, Isabelle strikes out on her own to face the dreaded beast. But in this darker twist of a timeless fairytale, things might not be what they seem.Can Isabelle find beauty in the beast?If you like inspirational heroines, unique love stories, and some darker thrills and chills this paranormal/shifter romance is for you! One-click now to start the magic, romance, and heart-pounding adventure!CRY WOLF is a retelling of Beauty and the Beast, inspired by the Beast of Gévaudan and the French Revolution. An early version of this novel was published in the Kingdom of Mirrors and Roses Anthology (2019).What are HighTower Fairytales?HighTower Fairytales lean more toward the original sources (NOT Disney) with rich semi-historical settings. They have magic. They have scary monsters. And, most importantly, they have unique and complex characters who are trying hard to improve themselves.They also include plenty of humor and all the heroes marry their prince/princess charming and live happily ever after at the end!Basically, these stories meant to inspire, but have a very difficult and occasionally dark tower to climb. They are conservatively marked at 14+ and are appropriate for teens and young adults.Currently these stories include:Winter Falls: A Tale of the Snow Queen (2017)Cry Wolf: A Tale of Beauty and the Beast (2020)Depths: A Tale of the Little Mermaid (2020)Letters by Cinderlight: A Tale of Cinderella (2021)Robin's Hood: A Tale of Sherwood Forest (2021)And more on the way!!!",
  "genres": [
    "Fantasy",
    "Beauty and The Beast",
    "Retellings",
    "Young Adult",
    "Fairy Tale Retellings",
    "Audiobook",
    "Paranormal"
  ],
  "author": "Jacque Stevens",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/53112069-cry-wolf"
}