{
  "title": "The Last Lone Inventor: A Tale of Genius, Deceit, and the Birth of Television",
  "description": "Selected for \" 100 Biographies & Memoirs to Read in a Lifetime \" - Amazon includes The Last Lone Inventor on its all-time best list.In a story that is both of its time and timeless, Evan I. Schwartz tells a tale of genius and greed, innocence and deceit, and corporate arrogance versus independent brilliance. In other words, the very qualities that have made this country -- for better or for worse -- what it is.Many men have laid claim to the title \"The Father of Television\" but Philo T. Farnsworth is the true genius behind what may be the most influential invention of our time. Farnsworth may have ended up a footnote in history, yet he was the first to demonstrate an electronic process for scanning, transmitting and receiving moving images, a discovery that changed the way we live.Growing up on a small farm in Idaho, Farnsworth was fascinated by anything scientific, especially the newest thing on the market -- radio. Wouldn't it be even more miraculous to project images along with the sound? Driven by his obsession, Farnsworth found a local philanthropist willing to fund his dream. By the age of twenty, in 1926, Farnsworth was operating his own laboratory above a garage in San Francisco and filing his first patent applications. The resulting publicity brought him to the attention of David Sarnoff, the celebrated founder of the NBC radio network, whose own RCA laboratories soon began investigating -- without much success -- a way to transmit a moving image. Determined to control television the way he monopolized radio -- by owning all the royalty producing patents--Sarnoff, from the lofty heights of his office in a New York skyscraper, devised a plan to steal credit for Farnsworth's designs.Vividly written, and based on original research, including interviews with surviving members of the Farnsworth family The Last Lone Inventor is the story of the epic struggle between two equally passionate adversaries and how their clash symbolized a turning point in the culture of creativity.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Science",
    "Audiobook",
    "Engineering",
    "Technology"
  ],
  "author": "Evan I. Schwartz",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/531174.The_Last_Lone_Inventor"
}