{
  "title": "How to Get the Best from Life: Explore Hidden Realities and Make Better Choices",
  "description": "Pinocchio wanted to stop being a wooden puppet and become a child. This was his greatest desire, his profound goal. But when he meets Lamp-Wick, or the Cat and the Fox, he forgets his goal and follows what seems most important at the moment. In both cases, Pinocchio follows a secondary target, more pleasant but not in line with his deep desire. The result is that he deviates from his major goal or, at least, sets it aside until new, disappointing experiences bring it back to mind.The many parts of us have each a different wish: One part urges going in one direction while the others disagree. It happens, for example, when we shift our attention from one wish to another because the need to satisfy a new wish appears more urgent. (Introspectivity. How to get the best from life, pages 173-174)Choose your goals.It is utmost important to choose our goals in life. They should correspond to our deep desires. If this happens, life will be satisfactory.Explore hidden realities.But how can we detect our deep desires to match them with our goals? Looking inside us. So, we can make contact, listen to the claims and desires of hidden parts of us, and decide our goals.Get the best from life.By becoming more conscious, we can choose which emotions to live and which ones let go. We can choose what life we want to live.Make better choices to master your life!The book consists of 3 parts:We choose, but how? There are many wrong ways to make important decisions.Choosing well-being. Why do many of our choices not aim to well-being?Making the right decision (choosing well).We are split in many parts with different goals. The book shows:How to explore the different parts of usHow to manage themHow to work with them to achieve a common goal.Paintings of Introspective Art.Everyday life examples and paintings of introspective art complete the explanation and increase its usefulness.",
  "genres": [],
  "author": "Luis Pisoni",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/53123663-how-to-get-the-best-from-life"
}