{
  "title": "Jesus and John Wayne: How White Evangelicals Corrupted a Faith and Fractured a Nation",
  "description": "A scholar of American Christianity presents a seventy-five-year history of evangelicalism that identifies the forces that have turned Donald Trump into a hero of the Religious Right.How did a libertine who lacks even the most basic knowledge of the Christian faith win 81 percent of the white evangelical vote in 2016? And why have white evangelicals become a presidential reprobate’s staunchest supporters? These are among the questions acclaimed historian Kristin Kobes Du Mez asks in Jesus and John Wayne, which delves beyond facile headlines to explain how white evangelicals have brought us to our fractured political moment. Challenging the commonly held assumption that the “moral majority” backed Donald Trump for purely pragmatic reasons, Du Mez reveals that Donald Trump in fact represents the fulfillment, rather than the betrayal, of white evangelicals’ most deeply held values.Jesus and John Wayne is a sweeping account of the last seventy-five years of white evangelicalism, showing how American evangelicals have worked for decades to replace the Jesus of the Gospels with an idol of rugged masculinity and Christian nationalism, or in the words of one modern chaplain, with “a spiritual badass.” As Du Mez explains, the key to understanding this transformation is to recognize the role of culture in modern American evangelicalism. Many of today’s evangelicals may not be theologically astute, but they know their VeggieTales, they’ve read John Eldredge’s Wild at Heart, and they learned about purity before they learned about sex—and they have a silver ring to prove it. Evangelical books, films, music, clothing, and merchandise shape the beliefs of millions. And evangelical popular culture is teeming with muscular heroes—mythical warriors and rugged soldiers, men like Oliver North, Ronald Reagan, Mel Gibson, and the Duck Dynasty clan, who assert white masculine power in defense of “Christian America.” Chief among these evangelical legends is John Wayne, an icon of a lost time when men were uncowed by political correctness, unafraid to tell it like it was, and did what needed to be done.Trump, in other words, is hardly the first flashy celebrity to capture evangelicals’ hearts and minds, nor is he the first strongman to promise evangelicals protection and power. Indeed, the values and viewpoints at the heart of white evangelicalism today—patriarchy, authoritarian rule, aggressive foreign policy, fear of Islam, ambivalence toward #MeToo, and opposition to Black Lives Matter and the LGBTQ community—are likely to persist long after Trump leaves office.A much-needed reexamination, Jesus and John Wayne explains why evangelicals have rallied behind the least-Christian president in American history and how they have transformed their faith in the process, with enduring consequences for all of us.",
  "genres": [
    "Nonfiction",
    "History",
    "Religion",
    "Politics",
    "Audiobook",
    "Christian",
    "Christianity"
  ],
  "author": "Kristin  Kobes Du Mez",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/53121662-jesus-and-john-wayne"
}