{
  "title": "The Depression and Anxiety Workbook: 5 Ways to Raise the Spirit and Experience Joy",
  "description": "Transform your life on day one!   5 brilliant methods to IMPROVE your MOOD and FEEL BETTER!  \n   Are you tired of Big Pharma and want to feel better with fewer toxic chemicals in your body? \n   Do you want to learn different approaches to treat the depression and anxiety that weigh you down? \n   Do you want a simple guide of 5 incredible ways to get started feeling better within an hour of reading the book? \n  \n  Yes, you can change your life by changing your thoughts in 5 days!\nIn my short book, you will learn what you need to know of Neuroscience, Mindfulness, Positive Psychology, Dialectical Behavior Therapy and Cognitive Behavioral Therapy.The intent of this book is to overcome depression and anxiety by providing a series of steps and tips to:\nDay One: Exercise your mind with Neuroscience\nDay Two: Try Mindful meditation\nDay Three: Practice gratitude and enjoyment in Positive Psychology\nDay Four: Explore your senses and emotions with Dialectical Behavior Therapy\nDay Five: Make your life more courageous with Cognitive Behavioral Therapy\nPhrases: Help you counteract and balance your depression and anxiety and feel joy again. \n Thus, you can develop a healthier lifestyle and raise your spirit. I believe that, if practiced every day, these steps can provide you with a set of skills that research has found to help people with depression and anxiety feel much better. You will learn what they are and how to use them to treat your depression and anxiety and start feeling like you again.This book is meant for beginners, with no prior knowledge of the five methodologies of healing.You will learn the basics of: \n   Neuroscience \n   Mindful meditation \n   Positive Psychology \n   Dialectical Behavior Therapy \n   Cognitive Behavioral Therapy \n   How to use them for healing \n   Phrases to help you counteract and balance your depression and anxiety \n   + FREE BONUS \n   Much more \n  Are you ready to feel like a new person and experience joy again? Press the \"Buy Now\" button now and get started right away! This book is meant for people interested in: health, self-improvement, self-help books, mental health, easy reads, worry, sadness, short books, self-control, education, happiness, affirmations, inspiration, personal growth, personal transformation, motivation, stress, psychiatry, adolescent psychiatry, social anxiety, panic attacks, motivational books, spiritual meditation, self-esteem, train your mind, pragmatism, intrusive thoughts, choose joy, among others.",
  "genres": [],
  "author": "Leibny Hope",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/53115790-the-depression-and-anxiety-workbook"
}