{
  "title": "Outcast",
  "description": "When I entered the lottery to have my application fee waived for a shot at attending Wiltshire University I never thought I would get in. I mean, Wiltshire University is THE University; you know, the one that people would literally cut off their left arm to get into. No really, it was a thing. There was this whole expose a decade ago about a kid who cut off their left arm thinking it would make them a shoo-in with the admissions board. It didn’t. He ended up at Duke. It's a real cautionary tale. Anyways, when the acceptance packet arrived, I thought it was a fluke, or I was on a reboot of Punkd; I was totally not signing that release. Well, either Ashton 2.0 is playing the long game, or my acceptance was real. Either way, I left my two best friends behind to become a Gryphaera; everything was falling into place for me to have an amazing life. Was. I’ve been at Wiltshire for a few weeks now and my only friends here are the ladies who swipe my ID card in the dining hall. I mean, you know us girls with our besties, we are always all “Next.” “Hi! Sorry, I had my ID just a second ago. Boiling out there today, huh? Ok, well, thanks. Have a nice day!”. I dare you to claim I'm not killing it in the friend department. Fine, it's pathetic; I know. Not as pathetic as lying to everyone back home about how great things are here at Wiltshire. Oh, and I somehow got myself evicted from my dorm, like, while I was at class; or I walked right into a quarantined building. I'm a little fuzzy on the details. Is that a side effect of the plague? I should google that... Plus, bonus, someone is leaving me taunting voicemails and cryptic notes. See! Killing it in the friend department! That's how I found myself scouring the isolated underground tunnel of Wiltshire’s historic bell tower, because a note told me to. Have I mentioned I'm totes brilliant? That’s where I meet him; in the tunnel, not in the blinding light of my brilliance. That’s where my life really changes. Outcast is the first book in the new Wiltshire University series; a New Adult/Young Adult, slow burn, reverse harem.585 pagesAvailable on Kindle, Amazon, Barnes & Noble, Kobo, and Google Play Books. The links for Barnes & Noble, Kobo, and Google Play Books are currently connecting you to the respective storefront. Search: Outcast (Wiltshire University Book 1) to get to the book or follow these links:Barnes & Noble https://www.barnesandnoble.com/w/outc... Kobohttps://www.kobo.com/us/en/ebook/outc...Google Play Bookshttps://play.google.com/store/books/d...",
  "genres": [
    "Reverse Harem",
    "Slow Burn",
    "College",
    "Contemporary",
    "Mystery Thriller",
    "Contemporary Romance"
  ],
  "author": "Lucie V. Ande",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/53116703-outcast"
}