{
  "title": "Hong on the Range",
  "description": "In this science fiction satire of westerns, after the American West was destroyed in a series of biological disasters, rebuilding it is a lot like building it in the first place, but there are crucial differences. For example, new, partly mechanical cattle with computer brains are called steerites. They speak and sing a lot more than the original steers.  Most of the cowboys, outlaws, and lawmen are partly mechanical, too, except for those few humans called control-naturals. That group has to keep all their original equipment, just like the original cowboys. Louie Hong is one of those control-naturals, and life isn't easy for him. Most folks look down on a man who doesn't have at least one bionic hand.  Yet Louie Hong is determined to make his way in the new Wild West.  All Hong has to do is explain to the bounty hunters who are after him for robbing a bank, and the outlaw gang that is after him for stealing the loot, that he hadn't done any of it.  With a little bit of luck, and the help of Chuck, his steerite companion, Hong hopes to find a home on the range that nobody can take away—not outlaws, not bounty hunters, not cyborgs, not even singing steerites.  In Hong on the Range, William F. Wu has returned to the high-tech Wild West world of his Hugo and Nebula Award finalist short story, \"Hong's Bluff,\" and written a rousing, funny science fiction saga complete with cyborg cowboys and outlaws. It is an exciting and witty subgenre of science fiction: The cyber western.  This novel was chosen by the American Library Association, Booklist, and the Library Journal for their recommended and best of the year lists.  ~ Excerpt ~  First I could only see that something large was displacing the tall buffalo grass ahead. Then I reached the spot and found a steerite lying down with his steel legs neatly folded underneath him. They gleamed silver in the sun and his hinged metal tail swished back and forth, its brush swatting the flies that buzzed around the natural hide of his meaty, biological middle. As I pulled my battered hat off by the brim and squinted at the steerite, he turned his steel bovine head toward me, short horns and all.  \"Hi, there,\" I said.  \"Hello,\" he answered pleasantly. He had been programmed with excellent enunciation and a trace of a Boston accent. \"Good day to you. Where are you bound?\"  I untied my red bandana and wiped off my forehead with it. \"I'm going to Femur to look for a job. Pardon my asking, but ... have you lost your herd? What are you doing here?\"  \"I am merely waiting. Have I lost my herd? More accurately, my herd has been rustled.\"  \"Rustled?\"  \"I dutifully escaped. None of my comrades succeeded in this endeavor. Since our trail crew ran off, I have no trail boss to whom I must report. Nor am I honor bound to join the herd after it has been rustled.\"  I nodded toward the mark stamped onto the shining metal base of his tail, where it extended from his natural hindquarters. \"Waiting for what? You still have your serial number.\"  \"Oh, yes. I am fully programmed and ready to report to any authority who can restore me to my legal owner.\"  \"Who's that?\"  \"I don't know. We get basic programming for herding, pasturing, and speech, but little precise data. Of course, we can accumulate information as we go, but no one ever told me the owner's name or where to locate him.\"  \"I guess the trail crew was supposed to get you there?”  \"Indeed they were, those cowardly louts.",
  "genres": [
    "Audiobook",
    "Science Fiction",
    "Fiction",
    "Westerns"
  ],
  "author": "William F. Wu",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/53124339-hong-on-the-range"
}