{
  "title": "wild spirit, soft heart",
  "description": "My first collection of my poetry, quotes, thoughts, and feelings... just little pieces of my soul. I feel so much and so deeply about self-love, spirit, healing, love, connection, and life, and soul things... and then I wrap those feelings up in words, and write them out. \"wild spirit, soft heart.\" This book title comes from a quote I put out a few years ago, \"wild spirit, soft heart, sweet soul,\" which is a shortened version of another quote of mine, and before I even truly knew whether or not I was capable of writing this book, I knew this title was meant to be if I ever could. It all comes from a dynamic of wild and soft within me, and within my life. It's this combination of fierce independence and a strong need for my own individual soul's journey that I have, but also a magnetic pull to the energy of love and soulmates and connection that I have always felt. It has been the most powerful dynamic in my soul's journey on so many levels. It's been part of my journey in really beautiful and magical ways, and in heartbreaking and complicated ways, too. So, when you read this book, you'll see the energies of wild and soft, of passion and tenderness, and of self-love and soulmate love running through it all; along with the energy of what it is to be a soft and sensitive soul who has gone through hard things. It all has to do with the many layers that I hold within myself, and with the soft and hard parts of my journey, and also to do with a deep connection I have to the dance between feminine and masculine energies. The combination of flowers and fire is so much a part of who I am and the things I've been through, that it just spills out into my writing. These words truly are pieces of my soul. So, I hope that when you read this book that my heart and soul come through. And I also hope that maybe my words speak to your heart and soul in some way, too.",
  "genres": [
    "Poetry"
  ],
  "author": "butterflies rising",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/53116061-wild-spirit-soft-heart"
}