{
  "title": "Suffer the Knight",
  "description": "Jude Adair is a Dragon Knight to his brother Duncan, The Dragon King. He lives at the Gatehouse on top of the mountain outside Laramie, Wyoming, with the rest of the Dragon Inner Circle. Jude watched as Clan Keith and his brother Knights found their forever mates and wondered when his forever love would present itself. He wouldn’t have to wait long. The circle had a problem on their hands. They owned the entire mountain on which they built their compound, except for 20 acres at the base of the mountain on the South side. The dragon circle and Clan Keith had tried for years to secure the purchase of that land and were met with failure each time. The owner refused to sell and maintained near-complete isolation. After dealing with the jackals who had come threatening Rafe’s mate, they got too close to that 20-acre property and caused damage, causing the owner to file a complaint with the Dragon King.  Jude found himself sent to clean up the mess his brother Grey had made. Grey had further antagonized the owner, a wolf shifter, causing him to involve his Alpha Premier and the paranormal council. As Jude confronts the wolf shifter, he finds his dragon strangely drawn to the man. Jude can’t figure out why his dragon is so restless and attracted to the man, Kai Beckett. Jude can’t smell anything that stands out other than the scent of a wolf. What Jude doesn’t understand is that Kai is hiding a secret that runs to the very core of them both. He’s a man sheltered from the world, haunted by his father’s words and his mother’s actions. Jude and Kai Beckett are mates, but Kai is hiding with the aid of magic. Kai believes that he has to hide to protect himself from being bonded to an all-powerful mate who would own him and destroy him. Kai lives in fear of finding his mate and ending up like his father. What Kai doesn’t know is that he’s living in the shadow of his father’s lies, and only through Jude will he ever find his way out of the darkness. Can Jude figure out the truth and win over his skittish mate? His very life and the harmony of the Dragon Circle will depend on it.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Dragons",
    "M M Paranormal"
  ],
  "author": "B.A. Stretke",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/53121930-suffer-the-knight"
}