{
  "title": "All the Colors of Night",
  "description": "Listening Length \t9 hours and 28 minutesTwo psychics plunge into a dark world of deadly secrets in this second installment of the Fogg Lake trilogy by New York Times bestselling author Jayne Ann Krentz.North Chastain possesses a paranormal talent that gives him the ability to track down the most dangerous psychic criminals. When his father suddenly falls into a coma, North is convinced it was caused by a deadly artifact traced back to the days of a secret government laboratory known only as the Bluestone Project. North knows his only hope of saving his father is to find the artifact. He is good when it comes to tracking down killers but to locate the relic, he's going to need help from a psychic who knows the shadowy world of obsessive collectors, deceptive dealers, and ruthless raiders…With her reputation in ruins after a false accusation, antique expert Sierra Raines is looking for a fresh start. She turns to the murky backwaters of the paranormal artifacts trade, finding and transporting valuable objects with a psychic provenance. When North Chastain approaches her for help, Sierra takes him on as a client, though not without reservations. North represents the mysterious Foundation, the secretive organization established to police the underworld populated by psychic criminals and those, like Sierra, who make a living in the shadows of that world. North and Sierra soon find themselves at the scene of The Incident that occurred decades ago in Fogg Lake. The town and its residents were forever changed by the disaster in the nearby Bluestone Project labs. The pair unearth shocking truths about what happened that fateful night, but they are playing with fire—someone in town knows what they’ve discovered and will do anything to make sure the secrets stay buried.",
  "genres": [
    "Romance",
    "Paranormal",
    "Mystery",
    "Romantic Suspense",
    "Paranormal Romance",
    "Fiction",
    "Fantasy"
  ],
  "author": "Jayne Ann Krentz",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/53112512-all-the-colors-of-night"
}