{
  "title": "Tales from the Ant World",
  "description": "Edward O. Wilson recalls his lifetime with ants, from his first boyhood encounters in the woods of Alabama to perilous journeys into the Brazilian rainforest.“Ants are the most warlike of all animals, with colony pitted against colony,” writes E.O. Wilson, one of the world’s most beloved scientists, “their clashes dwarf Waterloo and Gettysburg.” In Tales from the Ant World, two-time Pulitzer Prize-winner Wilson takes us on a myrmecological tour to such far-flung destinations as Mozambique and New Guinea, the Gulf of Mexico’s Dauphin Island and even his parent’s overgrown backyard, thrillingly relating his nine-decade-long scientific obsession with over 15,000 ant species.Animating his scientific observations with illuminating personal stories, Wilson hones in on twenty-five ant species to explain how these genetically superior creatures talk, smell, and taste, and more significantly, how they fight to determine who is dominant. Wryly observing that “males are little more than flying sperm missiles” or that ants send their “little old ladies into battle,” Wilson eloquently relays his brushes with fire, army, and leafcutter ants, as well as more exotic species. Among them are the very rare Matabele, Africa’s fiercest warrior ants, whose female hunters can carry up to fifteen termites in their jaw (and, as Wilson reports from personal experience, have an incredibly painful stinger); Costa Rica’s Basiceros, the slowest of all ants; and New Caledonia’s Bull Ants, the most endangered of them all, which Wilson discovered in 2011 after over twenty years of presumed extinction.Richly illustrated throughout with depictions of ant species by Kristen Orr, as well as photos from Wilsons’ expeditions throughout the world, Tales from the Ant World is a fascinating, if not occasionally hair-raising, personal account by one of our greatest scientists and a necessary volume for any lover of the natural world.",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "Animals",
    "Biology",
    "Memoir",
    "Natural History"
  ],
  "author": "Edward O. Wilson",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/53121658-tales-from-the-ant-world"
}