{
  "title": "La favorita del Marqués: Saga Beldades problemáticas",
  "description": ".....A veces el amor no muestra su verdadero rostro, cubriéndose de embustes y máscaras......      Un amor que nacerá de la venganza.      Una novela entretenida y ligera   Los secretos de Brandon, marqués de Suffolk, llevarán a Sophia a convertirse en un instrumento de venganza. Sophia es joven, cautivadora y exquisitamente casadera. Eternamente coqueta, se desliza por el jardín de su propiedad para llegar a la de su vecino, Brandon. Lo que ella no sabe es que su misterioso vecino es un trabajador clandestino del gobierno,  un espía sin normas ni moral  que la usará para vengarse de su peor enemigo. Brandon es un libertino empedernido  con gustos peculiares que no tendrá más remedio que pedirle matrimonio a esa mujer que ha usado para sus fines vengativos. Pero ella, tras saberse engañada, no se dejará convencer tan fácilmente. Así empezará un ardiente cortejo en el que la pasión no será suficiente para apaciguar los corazones de estos dos amantes.   Sobre la autora   Escritora de la Saga Devonshire. Ha publicado más de diez libros robando el corazón de miles de lectores. Ganó el premio a la \"Mejor Novela Histórica\" en 2018 por la editorial Readers Crew.   Testimonios de lectores   \"Ojalá hubiera descubierto a esta escritora mucho antes. Tiene una forma especial de transmitir los sentimientos y de describir las personalidades de los personajes.  ¡Muy recomendable!\". Laura Frañez ★★★★★  \"Definitivamente un 100 . Todas las novelas que ha escrito MaribelSolle me encantan. Me transportan a esa época , muchas gracias por darnos la oportunidad de leer tu magia.\" Roberto Fontana ★★★★★  \"Todos tenemos corazón, solo hay que encontrar la manera de llegar a el, déjate cautivar por esta historia, de un villano detrás de un alma pura e inocente, que harías si el amor de tu vida no tiene sentimientos, descubre que hizo Sophia para colarse en lo mas profundo de su ser ...\" Pierina ★★★★★",
  "genres": [],
  "author": "Maria Isabel Salsench Ollé",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/53133667-la-favorita-del-marqu-s"
}