{
  "title": "A Most Beautiful Thing: The True Story of America's First All-Black High School Rowing Team",
  "description": "Now a documentary narrated by Common, produced by Grant Hill, Dwyane Wade, and 9th Wonder, from filmmaker Mary Mazzio The moving true story of a group of young men growing up on Chicago's West side who form the first all-black high school rowing team in the nation, and in doing so not only transform a sport, but their lives.Growing up on Chicago's Westside in the 90's, Arshay Cooper knows the harder side of life. The street corners are full of gangs, the hallways of his apartment complex are haunted by drug addicts he calls \"zombies\" with strung out arms, clutching at him as he passes by. His mother is a recovering addict, and his three siblings all sleep in a one room apartment, a small infantry against the war zone on the street below.Arshay keeps to himself, preferring to write poetry about the girl he has a crush on, and spends his school days in the home-ec kitchen dreaming of becoming a chef. And then one day as he's walking out of school he notices a boat in the school lunchroom, and a poster that reads \"Join the Crew Team\".Having no idea what the sport of crew is, Arshay decides to take a chance. This decision to join is one that will forever change his life, and those of his fellow teammates. As Arshay and his teammates begin to come together to learn how to row--many never having been in water before--the sport takes them from the mean streets of Chicago, to the hallowed halls of the Ivy League. But Arshay and his teammates face adversity at every turn, from racism, gang violence, and a sport that has never seen anyone like them before.A Most Beautiful Thing is the inspiring true story about the most unlikely band of brothers that form a family, and forever change a sport and their lives for the better.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Sports",
    "Audiobook",
    "History",
    "Book Club",
    "Biography"
  ],
  "author": "Arshay Cooper",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/53137900-a-most-beautiful-thing"
}