{
  "title": "Snow",
  "description": "A Reverse Harem Fairytale Romance Series Fairy Tale Princesses Like You’ve Never Seen Them Before…10 Champions destined to defeat an evil that threatens to wipe out the land of Fantasia...Book 1: SNOWHair black as night, lips red as blood, skin white as snow. Beautiful. Ethereal. Enchanting. Profitable.Bought and sold for male entertainment, Neva Valkoinen, or Snow White, as patrons know her, dances for the wealthy and lecherous at the Wicked Lyre Tavern in the city of Ascor. Void of her memories, Neva’s life before the age of twelve, is a mystery she has no time to solve, chained as she is to the cruel whims of her master. Enter Herrick Vorst. The most handsome stranger Neva’s ever seen. Herrick purchases a night with Neva but doesn’t touch her. Instead, he asks her questions she can’t answer and reveals his belief that she’s a witchling capable of great magic. When Neva is purchased by another stranger a few nights later, she learns this one wants her heart. To carve out. Narrowly escaping certain death, Herrick comes to Neva’s rescue and brings her back to his cottage where she meets his brothers, Reve and Malvolo. Reve is currently stuck in the land of dreams, courtesy of a curse. And Malvolo is surly, letting it be known he wants nothing to do with Neva. Well, he might want something to do with her body…With no other options, Neva is forced to put her trust and hope into these three sinfully sexy brothers who hide a secret of their own…Searching for answers to her past, the four embark on a journey into the shadowy world of magic and monsters, wars and treachery, and lustful desire. Something dark brews on the horizon. A huntsman lurks in every shadow. But nothing can keep Neva’s mind from her burning need for Reve’s touch in the land of dreams, for Herrick’s stolen kisses and for Malvolo’s all-consuming hunger. The Happily Never After Reverse Harem Series Features: Snow White, Goldilocks, Rose Red, Sleeping Beauty, Tinkerbell, Cinderella, Bo Peep, Belle, The Little Mermaid, & Red Riding Hood.The Happily Never After Series:1. Snow2. Goldy 3. Aria4. Rose",
  "genres": [
    "Fantasy",
    "Romance",
    "Reverse Harem",
    "Paranormal Romance",
    "Paranormal",
    "Magic",
    "Fairy Tales"
  ],
  "author": "Plum Pascal",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/53134897-snow"
}