{
  "title": "Shelter in Place",
  "description": "I'm stuck in a straight guy's apartment. How am I supposed to deal with this?I hadn't planned on living with Ross very long. I just needed a place to stay to get on my feet after a bad break up, and happened to be friends with his sister. But when the shelter in place order comes down, not only do I lose any chance of finding my own space; my bartending job dries up, too.And Ross is taking this order very seriously. He grew up in a family of Montana doomsday preppers, and his rules are very clear: we've got three months of food, and neither of us is leaving—for any reason.I don't have a ton of money, and there are bills to pay. But there are a few different ways to make some cash online—especially when the rest of the world is shut inside, too, and need something to entertain them. Who would have imagined I would end up on a cam site entertaining guys from all over the world just by being myself and having fun? So long as I wait until Ross goes to sleep before I log on, anyway—I definitely do not want him to know what I'm up to on his couch.But Ross is full of surprises, it turns out. And I guess I am too. Because what I end up sharing with him is something I've never shared with anyone before. I just worry that things are about to get very complicated. Because every gay boy knows the cardinal rule:Never, ever fall for the straight guy.Shelter in Place is the first book of the Shelter series, a light hearted, low angst story about a kinky little family as it grows over three books. This book involve a low-protocol exploration of Dom/sub dynamics, humiliation play, exhibitionism, a brief experiment with urination, and non stop scorching hot dialogue throughout. It ends with a HFN ending with no cliffhanger. If you can't tell this is a steamy M/M story from the description, then Simon Strange can't help you.",
  "genres": [
    "M M Romance",
    "Forced Proximity",
    "BDSM",
    "Erotica",
    "Romance",
    "Gay For You",
    "Contemporary"
  ],
  "author": "Simon Strange",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/53132024-shelter-in-place"
}