{
  "title": "Coming Back: How to Win the Job You Want When You’ve Lost the Job You Need",
  "description": "\"Bestselling author and four-time Pulitzer Prize-nominee Fawn Germer offers advice about how to present yourself in the best possible way and make sure you stay relevant and valuable as an employee.\" —NewsweekA street smart, inspiring, practical, and utterly honest book for renewing or resuming your career. Millions of mid- to late-career professionals are wondering why our careers are dying. We've been fired, downsized, job-eliminated, or we've left work voluntarily to raise children, care for loved ones, or go to school It takes twice as long to get hired, and usually for far less money than we were making. Is it age discrimination? Maybe. But it’s not that simple.So many of us have lagged on skills and technology, shrugged off social media, or ignored the rate of change and let younger people become the face of our profession’s future. Our “track record” really doesn’t matter. We want to come back, but we aren’t ready. Coming Back offers clear advice, including:• STOP PLAYING THE VICTIM, even if you are one.• BRAND YOURSELF AS A CHANGE DRIVER who studies trends and studies independently so you are diving into change, not reacting to it.• CALL IN THE CHITS. It is time to go guerrilla and bluntly ask for help from people who can get you what you want and need.• TELL INTERVIEWERS about what you will do—don’t rely on what you have done.• STOP GROUSING about “those millennials” and start working with them.• BOUNCE BACK from a layoff or firing.Coming Back shows how you can save a career if still employed or get one back if cast out. Fawn Germer, one of the nation’s most popular leadership experts and global motivational speakers, has personally interviewed more than three hundred CEOs, senior executives, professors, lawyers, organizational experts, industry leaders, and professionals. The result is a tactical, tough-love call to action: to learn, re-tool, connect, grow, and get ready to work again.",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "Fawn Germer",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/53138145-coming-back"
}