{
  "title": "Justice Is Coming: How Progressives Are Going to Take Over the Country and America Is Going to Love It",
  "description": "A manifesto that outlines the progressive vision, recent history and worldview ― by the founder of The Young Turks and co-founder of Justice Democrats.The media can't stop talking about the gridlock in Washington, as if a handful of stubborn Republicans are the only thing standing between us and a fully-functional democracy. The reality is that our government was taken over by big business and their allies in both political parties. The getaway driver in this heist was corporate media. The good news is that the American people are very progressive. And soon progressives will take over Washington as well! And when they do, the great majority of Americans will love it.In Justice Is Coming , The Young Turks founder Cenk Uygur presents two ideas that counter everything we hear from pundits and politicians on a daily one, progressives are correct on all issues, and two, America is actually a very progressive country. Millions of us know that we are a part of something larger, a movement that is already transforming Washington.This compulsively readable manifesto seeks to apply the momentum we have already built to a concrete progressive agenda that activists, voters, and citizens can all rally around. It looks beyond Trump to the larger historical forces that have given us this unique political moment, and explains why we should fight, how we should fight, and how we will win.Sharp-witted, persuasive, and inspiring, calling out toxic Republicans, politely-ineffectual Democrats, and mealy-mouthed media mavens in equal measure, Justice is Coming will give heart to Democrats and progressives who seek to change our politics and society for the better.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Audiobook",
    "Economics",
    "Social Issues",
    "Activism"
  ],
  "author": "Cenk Uygur",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/53138134-justice-is-coming"
}