{
  "title": "Beyond the Sand and Sea: One Family's Quest for a Country to Call Home",
  "description": "From Ty McCormick, winner of the Robert F. Kennedy Journalism Award, an epic and timeless story of a family in search of safety, security, and a place to call home.When Asad Hussein was growing up in the world’s largest refugee camp, nearly every aspect of life revolved around getting to America―a distant land where anything was possible. Thousands of displaced families like his were whisked away to the United States in the mid-2000s, leaving the dusty encampment in northeastern Kenya for new lives in suburban America. When Asad was nine, his older sister Maryan was resettled in Arizona, but Asad, his parents, and his other siblings were left behind. In the years they waited to join her, Asad found refuge in dog-eared novels donated by American charities, many of them written by immigrants who had come to the United States from poor and war-torn countries. Maryan nourished his dreams of someday writing such novels, but it would be another fourteen years before he set foot in America.The story of Asad, Maryan, and their family’s escape from Dadaab refugee camp is one of perseverance in the face of overwhelming adversity. It is also a story of happenstance, of long odds and impossibly good luck, and of uncommon generosity. In a world where too many young men are forced to make dangerous sea crossings in search of work, are recruited into extremist groups, and die at the hands of brutal security forces, Asad not only made it to the United States to join Maryan, but won a scholarship to study literature at Princeton―the first person born in Dadaab ever admitted to the prestigious university.Beyond the Sand and Sea is an extraordinary and inspiring book for anyone searching for pinpricks of light in the darkness. Meticulously reported over three years, it reveals the strength of a family of Somali refugees who never lost faith in America―and exposes the broken refugee resettlement system that kept that family trapped for more than two decades and has turned millions into permanent exiles.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Politics",
    "Memoir",
    "History",
    "Biography",
    "Book Club"
  ],
  "author": "Ty McCormick",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/53137998-beyond-the-sand-and-sea"
}