{
  "title": "Personal Effects: What Recovering the Dead Teaches Me About Caring for the Living",
  "description": "The owner of the world's leading disaster management company chronicles the unseen world behind the yellow tape, and explores what it means to be human after a lifetime of caring for the dead.You have seen Robert A. Jensen--you just never knew it. As the owner of the world's largest disaster management company, he has spent most of his adult life responding to tragedy. From the Oklahoma City bombing, 9/11, the Bali bombings, the 2004 South Asian Tsunami, Hurricane Katrina to the 2010 Haitian Earthquake and the Grenfell Tower Fire, Jensen is at the practical level of international incidents, assisting with the recovery of bodies, identifying victims, and repatriating and returning their personal effects to the surviving family members. He is also, crucially, involved in the emotional recovery that comes after a disaster: helping guide the families, governments, and companies involved, telling them what to expect and managing the unmanageable. As he puts it, \"If journalists write the first rough draft of history, I put the punctuation on the past.\"Personal Effects is an unsparing, up-close look at the difficult work Jensen does behind the yellow tape and the lessons he learned there. The chronicle of an almost impossible and grim job, Personal Effects also tells Jensen's own story, how he came to this line of work, how he manages the chaos that is his life, and the personal toll the repeated exposure to mass death brings, in becoming what GQ called \"the best at the worst job in the world.\"A rare glimpse into a world we all see but many know nothing about, Personal Effects is an inspiring and heartwarming story of survival and the importance of moving forward. Jensen allows his readers to see over his shoulder as he responds to disaster sites, uncovers the deceased, and cares for families to show how a strong will and desire to do good can become a path through the worst the world can throw at us.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "True Crime",
    "History",
    "Biography",
    "Adult"
  ],
  "author": "Robert A.  Jensen",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/53137995-personal-effects"
}