{
  "title": "Robert E. Lee and Me: A Southerner's Reckoning with the Myth of the Lost Cause",
  "description": "In a forceful but humane narrative, former soldier and head of the West Point history department Ty Seidule's Robert E. Lee and Me challenges the myths and lies of the Confederate legacy—and explores why some of this country’s oldest wounds have never healed.Ty Seidule grew up revering Robert E. Lee. From his southern childhood to his service in the U.S. Army, every part of his life reinforced the Lost Cause myth: that Lee was the greatest man who ever lived, and that the Confederates were underdogs who lost the Civil War with honor. Now, as a retired brigadier general and Professor Emeritus of History at West Point, his view has radically changed. From a soldier, a scholar, and a southerner, Ty Seidule believes that American history demands a reckoning.In a unique blend of history and reflection, Seidule deconstructs the truth about the Confederacy—that its undisputed primary goal was the subjugation and enslavement of Black Americans—and directly challenges the idea of honoring those who labored to preserve that system and committed treason in their failed attempt to achieve it. Through the arc of Seidule’s own life, as well as the culture that formed him, he seeks a path to understanding why the facts of the Civil War have remained buried beneath layers of myth and even outright lies—and how they embody a cultural gulf that separates millions of Americans to this day.Part history lecture, part meditation on the Civil War and its fallout, and part memoir, Robert E. Lee and Me challenges the deeply-held legends and myths of the Confederacy—and provides a surprising interpretation of essential truths that our country still has a difficult time articulating and accepting.",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Civil War",
    "Biography",
    "American History",
    "Politics"
  ],
  "author": "Ty Seidule",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/53138120-robert-e-lee-and-me"
}