{
  "title": "T: The Story of Testosterone, the Hormone that Dominates and Divides Us",
  "description": "Testosterone: Misunderstood. Mythologized. Controversial.A Harvard evolutionary biologist debunks the myths and cultural stereotypes surrounding testosterone and reveals its far-reaching effects on gender and sexuality, sports, relationships, and many more aspects of our everyday lives.The biological source of virility and masculinity has inspired fascination, investigation, and controversy since antiquity. From the eunuchs in the royal courts of ancient China to the booming market for “elixirs” of youth in nineteenth-century Europe, humans have been obsessed with identifying and manipulating what we now know as testosterone. And the trends show no signs of slowing down—the modern market for testosterone supplements is booming. Thanks to this history and the methods of modern science, today we have a rich body of research about testosterone’s effects in both men and women.The science is clear: testosterone is a major, invisible player in our relationships, sex lives, athletic abilities, childhood play, gender transitions, parenting roles, violent crime, and so much more. But there is still a lot of pushback to the idea that it does, in fact, cause sex differences and significantly influence behavior.Carole Hooven argues in T that acknowledging testosterone as a potent force in society doesn’t reinforce stifling gender norms or patriarchal values. Testosterone and evolution work together to produce a huge variety of human behavior, and that includes a multitude of ways to be masculine or feminine. Understanding the science sheds light on how we work and relate to one another, how we express anger and love, and how we can fight bias and problematic behavior to build a more fair society.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Psychology",
    "Gender",
    "Health",
    "Audiobook"
  ],
  "author": "Carole Hooven",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/53138024-t"
}