{
  "title": "Every Last Fear",
  "description": "“They found the bodies on a Tuesday.”So begins this twisty and breathtaking novel that traces the fate of the Pine family, a thriller that will both leave you on the edge of your seat and move you to tears.After a late night of partying, NYU student Matt Pine returns to his dorm room to devastating news: nearly his entire family—his mom, his dad, his little brother and sister—have been found dead from an apparent gas leak while vacationing in Mexico. The local police claim it was an accident, but the FBI and State Department seem far less certain—and they won’t tell Matt why.The tragedy makes headlines everywhere because this isn’t the first time the Pine family has been thrust into the media spotlight. Matt’s older brother, Danny—currently serving a life sentence for the murder of his teenage girlfriend Charlotte—was the subject of a viral true crime documentary suggesting that Danny was wrongfully convicted. Though the country has rallied behind Danny, Matt holds a secret about his brother that he’s never told anyone: the night Charlotte was killed Matt saw something that makes him believe his brother is guilty of the crime.When Matt returns to his small hometown to bury his parents and siblings, he’s faced with a hostile community that was villainized by the documentary, a frenzied media, and memories he’d hoped to leave behind forever. Now, as the deaths in Mexico appear increasingly suspicious and connected to Danny’s case, Matt must unearth the truth behind the crime that sent his brother to prison—putting his own life in peril—and forcing him to confront his every last fear.Told through multiple points-of-view and alternating between past and present, Alex Finlay's Every Last Fear is not only a page-turning thriller, it’s also a poignant story about a family managing heartbreak and tragedy, and living through a fame they never wanted.",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Audiobook",
    "Suspense",
    "Crime"
  ],
  "author": "Alex Finlay",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/53138046-every-last-fear"
}