{
  "title": "What's Worth Keeping",
  "description": "A book as wise and unflinching as an old growth forest, filled with the capricious beauty and brutality of life. Kaya McLaren gives us a powerful, deeply moving story of a family in desperate need of healing and the paths each of them must walk to find it, and shows us how we might all find hope if we can pause long enough to listen to the whispers of nature. --Barbara O'Neal, Wall Street Journal, Washington Post, and Amazon Charts #1 bestselling author of When We Believed in Mermaids In Kaya McLaren's What's Worth Keeping, during one unforgettable summer, three generations of one family receive the best gift of all time: a second chance...The day her doctor says the one word that no one wants to hear, Amy Bergstrom discovers a secret that her husband of 25 years has been keeping from her. Now that the months of treatment and surgeries are behind her, she escapes her claustrophobic life seeking healing, peace and clarity in an ancient forest in Washington State, a forest that holds memories of her childhood summers.After dropping off his daughter at Amy's Aunt Rae's horse ranch in the mountains of New Mexico, Officer Paul Bergstrom visits the fixer-upper he had bought years ago as a place to retire with his family. Although it appears fine on the outside, the inside is a disaster--just like his marriage. When he finds himself with more off-duty time than he expected, he lovingly repairs his dream home, building the future he so desperately wants.Witnessing her mother's health crisis had been terrifying enough, but learning the cause was genetic leaves Carly with the sense that all of her dreams are pointless. With the help of her eccentric great aunt and a Clydesdale named T. Rex, Carly just may find her faith in her future again.Amy, Paul, and Carly discover that love and family are worth keeping in this powerful, emotional, and hopeful novel.",
  "genres": [
    "Fiction",
    "Family",
    "Contemporary",
    "Adult",
    "Womens Fiction"
  ],
  "author": "Kaya McLaren",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/53138128-what-s-worth-keeping"
}