{
  "title": "Veritas: A Harvard Professor, a Con Man and the Gospel of Jesus's Wife",
  "description": "From National Book Critics Circle Award-winning author Ariel Sabar, the gripping true story of a sensational religious forgery and the scandal that engulfed Harvard.\nIn 2012, Dr. Karen King, a star professor at Harvard Divinity School, announced a blockbuster discovery at a scholarly conference just steps from the Vatican: She had found an ancient fragment of papyrus in which Jesus calls Mary Magdalene \"my wife.\" The tattered manuscript made international headlines. If early Christians believed Jesus was married, it would upend the 2,000-year history of the world's predominant faith, threatening not just the celibate, all-male priesthood but sacred teachings on marriage, sex and women's leadership. Biblical scholars were in an uproar, but King had impeccable credentials as a world-renowned authority on female figures in the lost Christian texts from Egypt known as the Gnostic gospels. \"The Gospel of Jesus's Wife\"--as she provocatively titled her discovery--was both a crowning career achievement and powerful proof for her arguments that Christianity from its start embraced alternative, and far more inclusive, voices.As debates over the manuscript's authenticity raged, award-winning journalist Ariel Sabar set out to investigate a baffling mystery: where did this tiny scrap of papyrus come from? His search for answers is an international detective story--leading from the factory districts of Berlin to the former headquarters of the East German Stasi before winding up in rural Florida, where he discovered an internet pornographer with a prophetess wife, a fascination with the Pharaohs and a tortured relationship with the Catholic Church.",
  "genres": [
    "Nonfiction",
    "Religion",
    "History",
    "True Crime",
    "Crime",
    "Audiobook",
    "Christianity"
  ],
  "author": "Ariel Sabar",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/53146675-veritas"
}