{
  "title": "Cows Can't Quack",
  "description": "Cows Can't Quack (featuring animal sounds) is part of the Cows Can't Series, which also includes Cows Can't Jump (animal actions), Cows Can't Spin Silk (animal creations), Cows Can’t Blow Bubbles (shapes animals make) and Las vacas no pueden saltar (bilingual Spanish/English edition of Cows Can't Jump). By listening to and reading aloud these fun, educational and engaging picture books, young children will learn the names of dozens of animals — and their actions, sounds, creations and shape-making skills — reinforcing early reading skills and a love of books! The Cows Can't Series is perfect for young listeners and beginning readers ages newborn to six years old. Cows Can't Quack is available in multiple formats: Stubby & Stout™ Board-book (chunky-style format ideal for small hands), Glossy Paperback (for older children), Hardcover (full size format with board-book covers/pages) and Kindle eBook. Cows Can't Jump is featured on the Recommended Children's Books list of the award-winning early literacy organization Parent-Child+ and has received high praise including \"Perfect for my early reader\", \"Excellent bedtime story\", \"Every home with small children needs a copy”, “Just as adorable and fun as ‘Cows Can’t Jump’” and “Incredibly charming. A big hit with preschoolers and early readers”. The Series is published by Jumping Cow Press, which actively supports early literacy programs and partners with a direct-impact foundation to provide tens of thousands of copies of the Series at no cost to Reach Out and Read, Parent-Child Home+, Pajama Program, Read to Grow, Raising a Reader, Kids Need to Read, Get Georgia Reading, Literacy, Inc. (LINC) and Read by 4th, all of which integrate the Cows Can't Series into their early childhood literacy programs.From the Back Cover of Cows Can't Quack: Come inside and sing, laugh and howl with the lively and diverse animals of Cows Can't Quack. Young listeners and early readers, ages six weeks to six years, will be enchanted by the bright and expressive illustrations and the rhythmic and engaging text. This companion to Cows Can't Jump, Cows Can't Spin Silk and ￼Cows Can’t Blow Bubbles ￼imparts a humorous and empowering tale of tolerance, respect and humility and is bound to become a beloved bedtime and storytimeLearn more about the Series, and download free printable activity sheets and learning guides, at JumpingCowPress.com. Follow Jumping Cow Press on Twitter (@cowscantjump) and Facebook (/jumpingcowpress).",
  "genres": [
    "Animals"
  ],
  "author": "Dave Reisman",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/53153035-cows-can-t-quack"
}