{
  "title": "Feast: Food to Celebrate Life",
  "description": "If you consider eating with friends and family a joyful, indulgent celebration chances are you love a good feast. And who better to carefully guide you through the daunting task of preparing that Feast than the domestic goddess herself Nigella Lawson. Written in the tradition of Nigella Bites and How to Eat, Feast is a cookbook for the sensualist that wants to eat very well, but also wants to spend time enjoying the company of their guests instead of struggling with the creation of the meal. What sets Lawson apart is not that she's a good cookbook writer, but a strong writer period. Similar to her other books, Nigella's Feast is presented as part personal memoir, part educational, and part recipe presentation. There is a nice blend of occasions including the obvious (Thanksgiving, Christmas, New Year's, and Easter), a few culturally specific ones (Rosh Hashanah, Georgian Feast, and Venetian Feast), feasts for kids, for vegetarians, and an elegant cocktail party. Each chapter begins with an overview of that particular \"Feast.\" Generally, there is a personal story and experience told, an overview of the cultural importance of the feast, and a description of foods that are associated with each occasion. Impressively, every recipe begins with a personal anecdote giving that impression Nigella didn't just throw it in the book, but is experienced with the recipe and has used it with success. Take her twist on the decadent Chocolate Guinness Cake for example: \"I wanted to make a cream cheese frosting to echo the pale head that sits on top of a glass of stout. It's unconventional to add cream but it makes it frothier and lighter which I regard as aesthetically and gastronomically desirable.\" Who can argue? The cake is to die for. So next time you need to prepare a dinner party let the goddess be your guide, and remember: Keep the preparation simple, use easily available ingredients, and take time to enjoy your guests and your meal. Feast may not be the most advanced cookbook you will own, but if you want to create excellent food with relative ease in a short amount of time, you can not beat Nigella. --Rob BraccoNote: this is a UK edition of this cookbook.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Food and Drink",
    "Foodie"
  ],
  "author": "Nigella Lawson",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/531452.Feast"
}