{
  "title": "Long Road Home",
  "description": "Bestselling author J.W. Ashley brings you a story packed with heat, heart, and laugh out loud moments that will leave you desperate for more.They say that time heals all wounds. But in Macey's experience, all time does is allow the anger to fester.When her grandmother falls and breaks her hip, Macey makes the decision to return home and take over her family's small, Italian café. With her dad in a wheelchair and her grandmother now in a hospital bed, it's up to Macey to keep things running smoothly so her family doesn't lose everything. But when she returns home, her family's hidden secrets come to light. Starting with their new handyman.Lincoln's spent the last few years trying to erase nearly a decade of horrible decisions that all stemmed from the night he broke the heart of the only girl who'd ever been there for him. With no where else to go, her family are the ones who offer him room and board, giving him the chance to get his life on the right track. And when Macey returns home, Lincoln finds himself desperate for her forgiveness. Unfortunately, she's always been good at holding a grudge.Old sparks light new flames as these two are forced together, and soon, Macey begins to see the Lincoln she fell in love with all those years ago. But as his past collides with their present, the impact could be devastating.She's not looking for another heartbreak.He's a walking disaster.Together they could soar...but based on their pasts, it's more than likely they'll crash and burn.Perfect for fans of Meghan Quinn, Harloe Rae, Nora Roberts, Kandi Steiner, Rebecca Yarros, and K.K. Allen, Long Road Home is a swoon-worthy standalone that will have you aching for more even as you turn the last page.",
  "genres": [
    "Second Chance",
    "Romance",
    "Friends To Lovers",
    "Second Chance Romance",
    "Enemies To Lovers",
    "Slow Burn",
    "Small Town Romance"
  ],
  "author": "Carmen Bishop",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/53146882-long-road-home"
}