{
  "title": "The Girl in Kyoto: Bittersweet Memories of One Traditional Family in Japan",
  "description": "Memoirs and essays of a girl who was born as the 63rd successor of a landlord’s 1000-year-long family in Kyoto that was the most traditional and formal city in Japan. How her family and people in her community strived through conflict between Japanese old ways of life according to ancient customs and waves of a new era is depicted with full of humor and pathos along with the girl’s feelings into coming of age. Japanese original seasonal events and what and why Japanese people think in particular ways are also explained in the course. In the end, what her family had really inherited and preserved generation after generation is unveiled, and finally there comes the end of the family that brought over 1000 years of prosperity to naught.  The house was built when I was nine years old at the place where our old house was torn down because it was too old to live in. That old house was built about 100 years ago. My ancestors lived at exactly the same spot generation after generation for over 1000 years since my family used to be a landlord of the area. We are here for around 63 generations. My father succeeded the family from my grandfather, and I would have been the next successor if I hadn’t left home to be a musician. Because my father failed the family business and didn’t have the next successor for help, he had sold pieces of our ancestor’s land one by one. Now his money has finally dried up and he can’t afford to keep the last land where the house stands. When I dropped out college and left home for Tokyo to be a musician a long time ago, I thought I would never come back to this house again. I have made unplanned visits since then, but I assumed it would be the last visit each time. I was accustomed to a farewell feeling toward the house in a way and I departed with no particular emotions this time either. The cab was running through my familiar neighborhood where I spent my entire childhood. It was still shabby as it used to be. The cab drove through old houses of my childhood friends where I used to play with them, and under the overhead train bridge where I ran into perverts so many times. From the window, I saw the elementary school I went to, and the sidewalk my first song came to me while I was walking on. The bookstore where my father bought me my first English dictionary and also where he spotted his missing cousin. A place where a milk factory used to be that I waved to its plastic cows beside the gate every time I passed by in my father’s car. The old temple where my late grandparents used to take me and let me feed doves. Then something struck me and I suddenly realized. It wasn’t just the house I was losing. I was losing my hometown and departing from my childhood. I would never be in this neighborhood again because it was going to be an unrelated, foreign place from now on. Although I had always hated my neighborhood, that thought brought a lump to my throat and soon I found myself crying. I was stunned at this unexpected feeling. If I hadn’t been inside a cab, I would have wailed.",
  "genres": [],
  "author": "Hidemi Woods",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/53147884-the-girl-in-kyoto"
}