{
  "title": "Dark Descent into Desire",
  "description": "Hiding his past behind a veneer of sophistication and mystique, billionaire Blake Sinclair is extremely handsome, and by his own admission, an ineligible bachelor who doesn’t do relationships. Romance for him is art and beauty. But sex is sex. And he needs lots of it. He doesn’t connect the two. He’s never witnessed love in its finer form, for his youth was crippled by a difficult upbringing. But no one knows that. When he encounters Penelope Green at an art exhibition selling her work, he’s not only spellbound by her beauty, but by her art which speaks to his soul. It’s not just smoldering attraction that they share, but also difficult pasts. While her upbringing took place in a rundown estate caring for her troubled mother, Blake’s, although brought up in a picturesque village, was just as dark. He grew up around the windswept moors in a gothic castle with walls stained in secrets, and where his mother worked as a maid. Leading her into a world of opulence, taste, and raw lust, Blake Sinclair with eyes that flit from moody to stormy blue, manages to seduce Penelope. Her entry into his bedroom, other than eliciting steamy passion, opens up a part of him hidden even from himself. He soon finds himself swimming in uncharted waters. Although he’s not new to addiction, this time it’s not just sex that’s got Sinclair in its tantalizing grip, but something deeper and more powerful. Penelope’s not only a hot temptress, but a kindred spirit, and even more profoundly, she knows what “dark” feels like. When he learns that she too has secrets, Penelope becomes his obsession. Even if his need for control is constantly challenged by her feisty independence: a quality that not only feeds his sudden unhealthy need to possess her but also places a wedge between them. Dylan Fox is a nefarious character that shadows this story. As the son of Lord William Fox, Blake’s late mother’s employer, Fox grew up terrorizing the young Blake. Believing that Blake stole from him, Dylan Fox, who runs a criminal empire, drags Blake into the center of a scandal involving the rich and powerful, a private island, and teenage girls. Blake Sinclair has one powerful weapon: a clear conscience. But he has to convince Penelope and the world around him first. Faced with criminal gangs, while working behind the scenes on a dangerous exposé involving big names, Blake flexes his considerable muscles to save Penelope and his reputation.",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "J.J. Sorel",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/53148042-dark-descent-into-desire"
}