{
  "title": "Tell Me Your Names and I Will Testify: Essays",
  "description": "The compassionate and redemptive story of a prominent Black woman in the Twin Cities literary community Carolyn Holbrook’s life is peopled with ghosts—of the girl she was, the selves she shed and those who have caught up to her, the wounded and kind and malevolent spirits she’s encountered, and also the beloved souls she’s lost and those she never knew who beg to have their stories told. “Now don’t you go stirring things up,” one ghostly aunt counsels. Another smiles encouragingly: “Don’t hold back, child. Someone out there needs to hear what you have to say.”Once a pregnant sixteen-year-old incarcerated in the Minnesota juvenile justice system, now a celebrated writer, arts activist, and teacher who helps others unlock their creative power, Holbrook has heeded the call to tell the story of her life, and to find among its chapters—the horrific and the holy, the wild and the charmed—the lessons and necessary truths of those who have come before. In a memoir woven of moments of reckoning, she summons stories born of silence, stories held inside, untold stories stifled by pain or prejudice or ignorance. A child’s trauma recalls her own. An abusive marriage returns to haunt her family. She builds a career while raising five children as a single mother; she struggles with depression and grapples with crises immediate and historical, all while countenancing the subtle racism lurking under “Minnesota nice.”Here Holbrook poignantly traces the path from her troubled childhood to her leadership positions in the Twin Cities literary community, showing how creative writing can be a powerful tool for challenging racism and the healing ways of the storyteller’s art.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Essays",
    "Race",
    "Writing",
    "Biography Memoir"
  ],
  "author": "Carolyn Holbrook",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/53164528-tell-me-your-names-and-i-will-testify"
}