{
  "title": "Mary, Everything",
  "description": "\"Combines elements of time travel, mystery, and classic romance in a way that feels both fresh and unconventional...Details of life in the ’20s are both vivid and accurate, creating a moody sense of nostalgia. [...] A genre-bending ride featuring fun and unconventional characters.\" - Kirkus ReviewsA young woman born in the wrong reality.A destiny that will lead her into the past.And a love so enduring it reaches across time - and existence itself - to bring her home.A gripping tale of best friends and romance, sorcery and survival, at the dawn of the Roaring 20s.Courtney is a lonely undergrad at secluded Braddock College in 2004, working a drowsy summer job in the Archives. Assigned to a new project, she becomes haunted by a college yearbook from the 1920s - filled with familiar faces and memories of times she never experienced. A chance encounter with a mysterious girl named Sadie - dressed in long-outdated clothes - alters her reality. But if you were never meant to be born, that reality can expel you like an infection - or kill you outright. While Courtney struggles against forces she cannot comprehend, a psychopathic stalker smells blood and closes in for the kill.Sadie, now in 1921, races against the clock to save her friend, joined by some remarkable allies - an American combat sorceress and veteran of World War I, an enigmatic professor who specializes in piercing the veil between realities, and two young women who insist they’re Courtney’s oldest friends - one of them even claiming to be her truest love.Time is running out for Courtney, and a terrifying wilderness - haunted by the dead from centuries past - may hold the key to her salvation. But none who enter have ever returned...Cassandra Yorke's groundbreaking debut brings Magical Realism home to the Midwest in an explosive new style, blending Midwestern Gothic and historical fiction with a warm lesbian love story to create a riveting, deeply immersive epic you won't be able to put down. It's the world of Boardwalk Empire and Gatsby, with an urgent, immersive narrative about what it means to belong, what it means to be hated, what it means to be loved, and ultimately what it means to come home.",
  "genres": [
    "Historical Fiction",
    "Dark Academia",
    "Time Travel",
    "LGBT",
    "Lesbian",
    "Fiction",
    "Fantasy"
  ],
  "author": "Cassandra Yorke",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/53181134-mary-everything"
}