{
  "title": "Children Under Fire: An American Crisis",
  "description": "Based on the acclaimed series—a finalist for the Pulitzer Prize—an intimate account of the devastating effects of gun violence on our nation’s children, and a call to action for a new way forwardIn 2017, seven-year-old Ava in South Carolina wrote a letter to Tyshaun, an eight-year-old boy from Washington, DC. She asked him to be her pen pal; Ava thought they could help each other. The kids had a tragic connection—both were traumatized by gun violence. Ava’s best friend had been killed in a campus shooting at her elementary school, and Tyshaun’s father had been shot to death outside of the boy’s elementary school. Ava’s and Tyshaun’s stories are extraordinary, but not unique. In the past decade, 15,000 children have been killed from gunfire, though that number does not account for the kids who weren’t shot and aren’t considered victims but have nevertheless been irreparably harmed by gun violence.In Children Under Fire, John Woodrow Cox investigates the effectiveness of gun safety reforms as well as efforts to manage children’s trauma in the wake of neighborhood shootings and campus massacres, from Columbine to Marjory Stoneman Douglas. Through deep reporting, Cox addresses how we can effect change now, and help children like Ava and Tyshaun. He explores their stories and more, including a couple in South Carolina whose eleven-year-old son shot himself, a Republican politician fighting for gun safety laws, and the charlatans infiltrating the school safety business.In a moment when the country is desperate to better understand and address gun violence, Children Under Fire offers a way to do just that, weaving wrenching personal stories into a critical call for the United States to embrace practical reforms that would save thousands of young lives.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Psychology",
    "Social Justice",
    "Sociology",
    "Audiobook",
    "True Crime"
  ],
  "author": "John Woodrow Cox",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/53175315-children-under-fire"
}