{
  "title": "Our Final Warning: Six Degrees of Climate Emergency",
  "description": "This book must not be ignored. It really is our final warning.\nMark Lynas delivers a vital account of the future of our earth, and our civilisation, if current rates of global warming persist. And it’s only looking worse.We are living in a climate emergency. But how much worse could it get? Will civilisation collapse? Are we already past the point of no return? What kind of future can our children expect? Rigorously cataloguing the very latest climate science, Mark Lynas explores the course we have set for Earth over the next century and beyond. Degree by terrifying degree, he charts the likely consequences of global heating and the ensuing climate catastrophe.  At one degree – the world we are already living in – vast wildfires scorch California and Australia, while monster hurricanes devastate coastal cities. At two degrees the Arctic ice cap melts away, and coral reefs disappear from the tropics. At three, the world begins to run out of food, threatening millions with starvation. At four, large areas of the globe are too hot for human habitation, erasing entire nations and turning billions into climate refugees. At five, the planet is warmer than for 55 million years, while at six degrees a mass extinction of unparalleled proportions sweeps the planet, even raising the threat of the end of all life on Earth. These escalating consequences can still be avoided, but time is running out. We must largely stop burning fossil fuels within a decade if we are to save the coral reefs and the Arctic. If we fail, then we risk crossing tipping points that could push global climate chaos out of humanity’s control. This book must not be ignored. It really is our final warning.",
  "genres": [
    "Climate Change",
    "Nonfiction",
    "Science",
    "Environment",
    "Sustainability",
    "Nature",
    "Audiobook"
  ],
  "author": "Mark Lynas",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/53174738-our-final-warning"
}