{
  "title": "Wicked Liaison",
  "description": "Eight all-new heart-pounding historical romance novellas from USA Today and Bestselling Authors. These historical paranormal and historical gothic tales are sure to send shivers through you and keep you flipping pages!Genalynn by Meara PlattGideon Croft had vowed this would be his last assignment for the Crown, but now that he’s been shot and left to die in a cave in Devonshire, he knows his vow is about to come true, and not in the way he expected. What troubles him most is dying before he can take down the vicious rebels plotting against the royal family. What he does not expect is to be rescued and nursed back to health by Lady Genalynn Winthrop. Her family is at the heart of the conspiracy he was sent here to destroy, so why is she helping him? Can he protect her when they discover her betrayal?The Secrets of Colchester Hall by Sophie BarnesAs one of six possible candidates vying for Viscount Sterling’s hand, Lady Angelica has been invited to stay at his grand manor for a week-long house party. But an unpleasant feeling lurks within Colchester Hall and while Angelica tries to explain the chill creeping up behind her as merely a draft, she can’t shake the feeling that something disturbing might be at play.When Sterling decides she’s the woman he wants, will Angelica accept her new home and the sinister secrets she fears it might hold, or will she give up on true love because of something she might be imagining?Duchess of Darby by Amanda MarielElspeth Price, Duchess of Darby finds herself on alone and abandoned in the Lancashire moors. That is, until she makes her way to the scarred and angry Earl of Thornton’s ramshackle estate. Can a man branded a monster and a woman known as a murder find love in each others arms?The Bride of Dundaire by Angelique ArmaeWhen American Naturalist, Sarina Ogilvy, travels to Dundaire, Scotland to collect her late father’s belongings, she uncovers a chilling secret that thrusts her into the world of a mysterious yet tempting lord whose clan is haunted by centuries of darkness.Campbell MacHendrie, The Marquess of Lycansay, is on the edge of madness when the beguiling Sarina Ogilvy storms into his life. Her presence at Lycansay Hall offers him the chance to escape a lifelong torment, but not without paying the ultimate price.Will love rescue Sarina and Campbell before the darkness of Dundaire claims them both?Always Your Love by Ellie St. ClairWhen their parents decree that Hannah and Edmund must marry, Hannah does what she always does -- what she’s told. Little does she know she is marrying a man who has no wish for a wife. But when the two of them spend days alone in Hollingwood Estate solving the mystery of decades-old lovers, they find themselves becoming closer than they ever would have imagined.Vision of Love by Dawn BrowerLady Anya Montgomery wakes up one day twenty years in the past, in a different body, with a controlling father, and an unwanted fiancé. Each day brings a new surprise, but she has one goal: to return to where she belongs. However, when she starts to fall in love, she wonders if she is exactly where she is supposed to be…The Ghost and Miss Miranda by Jane CharlesMiss Miranda Vail had set her cap on Wesley Claxton, Marquess Epworth during her first Season, even though he considered her feather-brained for believing in ghosts. However, she hadn’t let his opinion deter her and the two became grand friends, though Miranda secretly wished for more. * Miranda’s quirkiness captured Wesley’s passion, and heart, despite himself. He was, after all, a reasonable gentleman of logic, and could not accept the existence of ghosts. It simply wasn’t scientific. Unfortunately, his denial of the possibility might just cost Miranda her life.The Wicked One by Nadine MillardWidowed Philip Everwood, Earl of Breton is hoping that escaping to the quiet countryside will help his son recover from a recent tragedy. Something is plaguing the boy, and Philip is desperate to save them both from the nightmares of the past.A chance encounter with the gypsy woman who lives in the woods may change things for them both. They call her The Wicked One. But for Philip and his child, she might just be salvation.",
  "genres": [
    "Gothic",
    "Anthologies",
    "Historical Romance"
  ],
  "author": "Meara Platt",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/53184433-wicked-liaison"
}