{
  "title": "My Prison Without Bars",
  "description": "PETE ROSE HOLDS MORE MAJOR LEAGUE BASEBALL RECORDS THAN ANY OTHER PLAYER IN HISTORY. He stands alone as baseball's hit king having shattered the previously \"unbreakable\" record held by Ty Cobb. He is a blue-collar hero with the kind of old-fashioned work ethic that turned great talent into legendary accomplishments.Pete Rose is also a lifelong gambler and a sufferer of oppositional defiant disorder. For the past 13 years, he has been banned from baseball and barred from his rightful place in the Hall of Fame-- accused of violating MLB's one taboo. Rule 21 states that no one associated with baseball shall ever gamble on the game. The punishment is no less than a permanent barring from baseball and exclusion from the Hall of Fame.Pete Rose has lived in the shadow of his exile. He has denied betting on the game that he loves. He has been shunned by MLB, investigated by the IRS, and served time for tax charges in the U.S. Penitentiary in Marion, Illinois.But he's coming back.Pete Rose has never been forgotten by the fans who loved him throughout his 24-year career. The men he played with have stood by him. In this, his first book since his very public fall from grace, Pete Rose speaks with great candor about all the outstanding questions that have kept him firmly in the public eye. He discloses what life was like behind bars, discusses the turbulent years of his exile, and gives a vivid picture of his early life and baseball career. He also confronts his demons, tackling the ugly truths about his gambling and his behavior.MY PRISON WITHOUT BARS is Pete Rose's full accounting of his life. No one thinks he's perfect. He has made mistakes-- big ones. And he is finally ready to admit them.",
  "genres": [
    "Sports",
    "Baseball",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Pete Rose",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/531867.My_Prison_Without_Bars"
}