{
  "title": "Game On",
  "description": "CARTERRelationships--who needs 'em? As a personal-assistant-extraordinaire to one of the top PR firms in Los Angeles, I've dedicated most of my life to errand-running and people-pleasing. But when it comes to men, as much as I love to please them in the bedroom, I'm way too busy to give more than that. Fortunately, as far as my options go...well, let's just say I'm used to getting what I want, whenever I want it.Unless your name happens to be Sawyer Burke.I haven't been in Fever Falls long, but the more time I spend here, the more intrigued I've become by the guy with the sexy auburn locks and the no-nonsense attitude. He plays the quiet, bookish part well, but he's got a problem--I have a talent for reading people, and if there's one thing I'm certain about, it's that there's a wild sex-beast hiding under his clever facade. He thinks screwing around is all a big game to me, but games can be fun, right?SAWYERI've always been a relationship guy. I never understood the urge to bed a different guy every night. But it hasn't worked out well for me. The one time I let my guard down with a guy, he crushed me. Broke me. That's not something I'm eager to risk again, so I focus on my friends, my brother, and my bookstore. Really, it's better for me. I'm not the kind of guy most men want anyway.Unfortunately, I can't get Carter James out of my head. I told myself I hate him--and I should. He's everything I'm not--loud, sassy...and more than a little annoying. But I want him too, and he's made no secret of wanting me. I refuse to get caught up in one of his games, but I'm also learning there's more to Carter than meets the eye. He unleashes something inside me I never knew was there--this dominant sex-god that somehow makes me feel more like me than I ever have.I can't let myself fall in love with him. Easier said than done. Carter challenges me in ways I didn't know I needed. What we share becomes a game of sorts, but not the kind I first thought, and the longer we play, the more likely it is that the losers will be our hearts. We should stop. We should know better. But even if there's the unlikeliest chance that we might win--well, then--GAME ON.Game On is part of the Fever Falls series but can be read and enjoyed on its own.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "LGBT",
    "Contemporary Romance",
    "Gay"
  ],
  "author": "Riley Hart",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/53171779-game-on"
}