{
  "title": "One of Us Is Lying / One of Us Is Next / Two Can Keep a Secret",
  "description": "Please Note That The Following Individual Books As Per Original ISBN and Cover Image In this Listing shall be Dispatched Collectively:Karen McManus 3 Books Collection Set (One Of Us Is Lying, One Of Us Is Next, Two Can Keep a Secret):One Of Us Is Lying:Five students go to detention. Only four leave alive. Yale hopeful Bronwyn has never publicly broken a rule. Sports star Cooper only knows what he's doing in the baseball diamond. Bad boy Nate is one misstep away from a life of crime. Prom queen Addy is holding together the cracks in her perfect life. And outsider Simon, creator of the notorious gossip app at Bayview High, won't ever talk about any of them again.One Of Us Is Next:The sequel to the international bestseller One of Us is Lying. Welcome back to Bayview High . . . It's been a year since the events of One Of Us Is Lying. But nothing has settled for the residents of Bayview. Not now someone has started playing a sinister game of Truth or Dare. Choose truth? You must reveal your darkest secret. Choose dare? Well, that could be even more dangerous. Even deadly. When the game takes an even darker turn, suddenly no one at Bayview High knows who to trust. But they need to find out who is behind the game, before it's too late.Two Can Keep a Secret:From the author of the international bestselling One of Us is Lying. A perfect town is hiding secrets. Secrets that somebody would kill to keep hidden. Ellery's never been to Echo Ridge, but she's heard all about it. It's where her aunt went missing at age sixteen, never to return. Where a Homecoming Queen's murder five years ago made national news. And now she has to live there with her estranged grandmother, after her mother lands in rehab. Malcolm grew up in the shadow of the Homecoming Queen's death.",
  "genres": [
    "Mystery",
    "Crime",
    "Thriller",
    "Murder Mystery",
    "Young Adult",
    "Mystery Thriller",
    "Fiction"
  ],
  "author": "Karen M. McManus",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/53201724-one-of-us-is-lying-one-of-us-is-next-two-can-keep-a-secret"
}