{
  "title": "Risk Intelligence: How to Live with Uncertainty",
  "description": "“With an arsenal of studies and statistics, Evans covers fascinating topics, including battlefield strategies, overconfidence, lies, and the tendency to follow the crowd…a valuable manual” (Publishers Weekly) introducing the recently discovered type of intelligence. “Risk Intelligence is really a great contribution for dealing with the biggest challenge we have in an interconnected world: complexity, velocity, and uncertainty” (Klaus Schwab, Founder and Executive Chairman, World Economic Forum).As acclaimed author and lecturer Dylan Evans reveals in his latest work, there is a special kind of intelligence for dealing with risk and uncertainty. But shockingly, many people in positions that require high risk intelligence—doctors, financial regulators, and bankers, for instance—seem unable to navigate what Evans calls the “darkened room,” the domain of doubt and uncertainty. Risk Intelligence is a traveller’s guide to the twilight zone of probabilities and speculation. Evans shows us how risk intelligence is crucial to making good decisions, from dealing with climate change to combating terrorism. He argues that we can all learn a lot from expert gamblers, not just about money, but about how to make decisions in all aspects of our lives. Introducing a wealth of fascinating research findings and using a wide range of real-life examples—from the brilliant risk assessment skills of horse race handicappers to the tragically flawed evaluations of risk that caused the 2009 financial crisis—Evans reveals the common errors in our thinking that undermine our risk intelligence. Both highly engaging and truly mind-changing, Risk Intelligence shows how we can improve our thinking in order to enhance our lives.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Business",
    "Economics",
    "Leadership",
    "Finance",
    "Self Help"
  ],
  "author": "Dylan Evans",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/12606415-risk-intelligence"
}