{
  "title": "Owning Beauty",
  "description": "Hard. Dominant. Overbearing & Insufferable.The man I agreed to marry.My biggest mistake has a name.Tobias Moretti. Tall, dark and dangerous and the head of the largest crime family this area has ever seen.Brooding, mysterious and so hot he melts the resolve of any woman he meets.Marry him and escape my hated past.Play the trophy wife in public and then get on with my day - alone.No other men and a life with everything I want - except love.How can I miss what I never had in the first place?At least I'd have my freedom - think again.It turns out my freedom is the last thing I can have. Guarded by men in black suits and forbidden to go out alone.A trapped bird in a cage filled with luxury.Then it changes.The terms of our contract have been re-written. He wants a wife in every sense of the word.Yes, my biggest mistake wants it all. He wants to own my mind, body and soul and I don't get a say in the matter.Tobias.I like to own the best that money can buy.I like to surround myself with beauty and Art.I want the best and don't care how far I go to own it.She's about to discover that I always go a step too far.She gave up everything to be my wife but there is still one valuable asset she owns that causes the feral beast in me to growl.Her innocence.My world is a dark and dangerous place full of nightmares that never go away.My beauty is about to wake up and discover the prince who rescued her from the tower is a beast in disguise and she will hear me roar as I claim the innocence of my virgin bride.Yes, I can live without love but I can't live without that and nothing is going to stand in my way because what Tobias Moretti wants - he gets, over and over again.From the Amazon top 100 bestselling Author Stella Andrews, a dark tale of love, lust and twisted happy ever afters. Full of heat and no holding back. Fast-paced and thrilling, delving into a world where the shadows claim your soul. One wild ride with a HEA guaranteed. Lock the door and put your feet up - you're going nowhere.",
  "genres": [
    "Mafia Romance",
    "Romance",
    "Dark",
    "Contemporary",
    "Dark Romance",
    "Enemies To Lovers"
  ],
  "author": "Stella Andrews",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/53207349-owning-beauty"
}