{
  "title": "Prisoner Prodigal Pawn: Is Life Pulled By Fate Or Pushed By Luck?",
  "description": "Tribal politics and a family torn apart are at the root of compelling conflicts revolving around the thought-provoking question “Do you believe life is pulled by fate or pushed by luck?” that keeps this tale moving in several directions. Who’s being manipulated, and who’s pulling the strings?Prisoner Prodigal Pawn is a complex murder mystery, set in Albuquerque, New Mexico that revolves around a law firm, an Indian casino, and tribal politics. The story unravels with Elton Mozingo, as the main suspect in the murder of his colleague at the Baxter and Baxter law firm, going on the run. Bill Baxter is the ambitious and successful lawyer who is preparing to run for political office. His equally ambitious wife, Liz, is going to take his place as head of the family firm. As the story continues, we learn that Elton’s father, who also worked for Baxter, is in jail serving a sentence for murder, eerily the same situation Elton finds himself in.The Mozingo brothers, Elton and Charles, as well as their convicted-felon father, BP, are the eponymous prisoner, prodigal son, and pawn caught up in an elaborate scheme that its perpetrators would kill to keep hidden. Elton and his estranged brother, a tribal police officer, have individually set out to investigate their father’s case, and are on a quest to clear his name. The quest will open a Pandora’s box of murder, betrayal and greed. When Elton seeks the aid of a childhood friend who uses him to pursue an agenda of her own, the brothers soon discover that there is virtually nobody around them whom they can trust.Prisoner Prodigal Pawn infuses a unique blend of family, intrigue, and corruption, with shocking twists. It is fast paced and full of adventure with an intricate plot, flawlessly woven with many interesting characters that will keep the reader turning those pages.",
  "genres": [],
  "author": "Robert Sparkman",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/53208110-prisoner-prodigal-pawn"
}