{
  "title": "Love Him Free",
  "description": "Socially awkward, thirty-six-year-old virgin, Simon Kadish, knows he wants more from life than a failing bakery and an empty apartment. He just doesn’t know how to get it. From an early age, Simon’s life has been marked by loss. After the death of his father, Simon and his infant brother are ripped from their home in Tel Aviv and forced to settle in a small mountain town in the US where no one speaks his language. By the age of twelve, Simon is an orphan. By the age of twenty-one, Simon finds himself the unwilling owner of his bubbe’s bakery, and the hesitant guardian of his little brother. Terrified of losing what little he has left, Simon dedicates himself to his faith, sacrificing everything to keep the fragile scraps of his broken family.But, when Simon’s favorite film star’s life suddenly falls apart on social media, Simon makes a choice. He goes against every one of his instincts and fires up his camera, sending a message in rusty ASL. He doesn’t expect anything from it, of course. After all, Simon’s life has been anything but charmed.Deaf film star, Rocco Moretti, had anyone's fantasy life, and he wouldn’t change it for the world.When he was in college, Rocco decided to corner the market as a Deaf man in adult films as a quick way to make cash. Fifteen years later, and he’s rich with a house in Malibu, a boyfriend of almost two-decades, and a body that’s constantly in demand. His life was charmed, and he wouldn’t have it any other way. But when Rocco wakes up to his boyfriend leaving, he has nowhere to turn. People are starving for the drama, but no one cares that Rocco’s life has just fallen apart. His job is on the line, and he’s lost his interpreter, and all people want is the story. Rocco realizes in that moment, he wants something more. He’s not sure where to find it, but he thinks maybe the shy video in shaky ASL in his DMs is a good place to start. After all, Cherry Creek is in the middle of nowhere, and since seeing that video, Rocco hasn’t been able to stop thinking about that shy baker’s long fingers, shy smile, and the constellation of freckles on his pale cheeks.Rocco isn’t sure leaving his life behind is the right choice, and Simon isn’t sure he belongs in Rocco’s world. But the one thing they do know, is that this love has a chance to set them both free.Love Him Free is Book One of the series On The Market. It contains no cheating, light angst, and has a HEA.The series, On The Market, has become Running in Circles, and this novel was retitled Make You Mine. It has been completely revamped and re-written with names, places, characters, and major plot points changed.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Disability",
    "Audiobook",
    "LGBT",
    "Mental Health"
  ],
  "author": "E.M. Lindsey",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/53206552-love-him-free"
}