{
  "title": "The Seven Sayings of the Saviour on the Cross",
  "description": "BiographyPink was born in Nottingham, England on April 1, 1886 and became a Christian in 1908, at the age of 22. Though born to Christian parents, prior to conversion he migrated into a Theosophical society (an occult gnostic group popular in England during that time), and quickly rose in prominence within their ranks. His conversion came from his father's patient admonitions from Scripture. It was the verse, Proverbs 14:12, 'there is a way which seemeth right unto a man, but the end thereof are the ways of death,' which particularly struck his heart and compelled him to renounce Theosophy and follow Jesus.Desiring to grow in knowledge of the Bible, Pink immigrated to the United States to study at Moody Bible Institute. In 1916 he married Vera E. Russell (January 8, 1893 - July 17, 1962), who was from Kentucky. However, he left after just two months for Colorado, then California, then Britain. From 1925 to 1928 he served in Australia, including as pastor of two congregations from 1926 to 1928, when he returned to England, and to the United States the following year. He eventually pastored churches in Colorado, California, Kentucky, and South Carolina.In 1932 he started a monthly magazine entitled Studies in the Scriptures which circulated among English-speaking Christians worldwide, though only to a relatively small circulation list of around 1,000.In 1934 Pink returned to England, and within a few years turned his Christian service to writing books and pamphlets. Pink died in Stornoway, Scotland on July 15, 1952. The cause of death was anemia.After Pink's death, his works were republished by a number of publishing houses, among them, Banner of Truth Trust, Baker Book House, Christian Focus Publications, Moody Press, Truth for Today, and reached a much wider audience as a result. Biographer Iain Murray observes of Pink, \"the widespread circulation of his writings after his death made him one of the most influential evangelical authors in the second half of the twentieth century.\" His writing sparked a revival of expository preaching and focused readers' hearts on biblical living. Yet, even today, Pink is left out of most biographical dictionaries and overlooked in many religious histories.[edit]",
  "genres": [
    "Theology",
    "Christian",
    "Christianity",
    "Nonfiction",
    "Christian Living",
    "Faith",
    "Religion"
  ],
  "author": "Arthur W. Pink",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/532071.The_Seven_Sayings_of_the_Saviour_on_the_Cross"
}