{
  "title": "Nothing to Lose: Unlikely Allies in the Struggle for a Better Black America",
  "description": "\"Great new book by @PastorDScott called 'Nothing to Lose.' The Pastor is a winner and a great guy. Much can be learned from him. Buy the book. Make him a Big Deal Author!” – President Donald J. TrumpPastor Darrell Scott demolishes entrenched stereotypes and political boundaries with his candid, revealing, and often surprising how a devout Christian and African American has become one of President Donald Trump’s leading supporters and advisors.“What makes you think black people will vote for you? Because the word on the street is, you’re a racist.”With those blunt words to then-presidential candidate Donald Trump, Pastor Darrell Scott began a journey he never expected to take—becoming the future president’s most prominent African-American supporter and advisor. In Nothing to Lose, Pastor Scott recounts how and why he boarded “the Trump Train,” revealing the considerable difficulties he experienced along the way. As his story progresses, Pastor Scott highlights the accomplishments he, his allies, and members of the Trump administration have worked so hard to earn on behalf of the black community in the United States. Pastor Scott holds absolutely nothing back as he • His transformation from a life of drugs and crime on the streets of Cleveland to a life leading a thriving community church.• Behind-the-scenes stories of Trump’s historic campaign, inauguration, and first term as president.• The blistering criticism he, his family, and his church endured from members of the black community and mainstream media.• Intimate portraits of Trump’s ever-evolving inner circle, including the Trump children, Michael Cohen, Corey Lewandowski, Steve Bannon, Jared Kushner, and Omarosa.• What he truly thinks of former president Barack Obama, and why.• His experience with leading national media figures on both ends of the political spectrum, including Sean Hannity, Don Lemon, and Van Jones.Lastly, Pastor Scott provides a surprising portrait of President Donald Trump himself—his candor; his support for policies, issues, and initiatives important to the African-American community; and his little-understood relationship with Christianity.",
  "genres": [],
  "author": "Pastor Darrell Scott",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/53206620-nothing-to-lose"
}