{
  "title": "Stray Witch",
  "description": "WINNER OF THE 2020 INTERNATIONAL VAMPIRE FILM & ARTS FESTIVAL SILVER STAKE AWARD.Clueless Witch Meets Quirky Vampire: an enchanting tale of love and magic.“The highly original plot combines the best of paranormal with the best of romance: a tantalizing, unputdownable read.” —The Booklife Prize critic’s report.A magical story about a lost witch recovering her self-esteem and overcoming a terrible mistake, a seemingly cheerful vampire with a tortured past, and finding love in the most unexpected of places.Alba is about to lose everything after her divorce... until she meets The Vampires of Emberbury, who dwell under an abandoned graveyard, stuck in Victorian times. They will make her a very interesting job offer, and she will get to meet Clarence, a mysterious vampire gentleman who thinks cloaks and top hats are still in fashion. With his help, Alba will figure out that, sometimes, the scariest monster isn’t the one with fangs.This is a slow-burn paranormal vampire romance and magical realism novel that deals with worldly issues in a magical, humorous way and guarantees to make you laugh, cry, and gasp as you follow Alba and Clarence on their quest to solve Alba’s real-life troubles in a fairy-tale setting.Stray Witch is the first book in The Vampires of Emberbury series. It can also be read as a stand-alone story.Praise for Stray Witch:“I loved this story! The pacing was steady, and the characters were well-developed and realistic. I found it very easy to relate to Alba, to sympathize with her, and to cheer her on as she fought to protect her daughters and start a new life. I really liked Clarence, the mysterious gentlemanly vampire. I was especially intrigued by his dark past and wanted to know more. I also enjoyed the slow-burn romantic subplot between Alba and Clarence.” —Angela’s Book Addiction.“The highly original plot combines the best of paranormal with the best of romance. (…) Each character is lovingly detailed, vivid in perspective. The slow teasing out of each’s history allows for a tantalizing, unputdownable read.” —The Booklife Prize critic’s report.“Written in the alternating first-person perspective of Alba and Clarence, the reader is allowed a glimpse into their intertwined lives as two people who shouldn't have fallen in love try to discover their feelings and themselves. (...) Self-discovery, romance, heartbreak, and challenges fill this sweet romance in which you can't help but root for the main characters.” —Reader’s Favorite.Other titles in The Vampires of Emberbury series:Stray Witch (Book 1)Witch’s Mirror (Book 2)Witches Masquerade (Book 3)The Vampire's Assistant (Julia and Francesca's story: a novella)A Winter's Cobalt Kiss (A Vampire Christmas Novelette in the World of Stray Witch)",
  "genres": [
    "Fantasy",
    "Vampires",
    "Romance",
    "Paranormal",
    "Witches",
    "Paranormal Romance",
    "Magic"
  ],
  "author": "Eva Alton",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/53241003-stray-witch"
}