{
  "title": "Dying for Dominoes",
  "description": "Meet four ambitious women who risk losing it all when they play to win... while the husband dies trying.It’s all fun and games until Amy’s best friend wants her husband gone and then he’s found dead.Now Amy fears a not-so-innocent game of dominoes has turned into premeditated murder with a little help from some friends. Scrambled evidence and sketchy alibis compel Amy to uncover the truth before they all land in jail for murder.How does a game of dominoes turn so deadly? And who killed the husband? If she can’t solve the crime in time, there’s more at stake than Amy realizes. She knows what she has to do -- find the courage to face her doubts and learn the true meaning of friendship. All while hunting down a killer on the run.Will she unravel the facts and the fibbery fast enough to keep them safe? Not if her misadventure through the back roads of Arkansas keeps derailing her plans. Amy risks everything to hunt down the truth, but what she doesn’t know might kill her, too.If you like playing games, puzzle mysteries with unexpected twists and turns, and amateur sleuths with southern sass that’s anything but cookie-cutter sweet, then you’ll love Jane Elzey’s fast-paced whodunnit.Buy Dying for Dominoes and join in the fun with this adventurous sisterhood today! The first book in the Cardboard Cottage Mystery series. Join Jane Elzey's VIP Club for players for Swag and Brag at the author's website at CardboardCottageMystery or JaneElzey. Join the author's email list for gossip and updates on upcoming books. Look for Dice on a Deadly Sea next.Jane Elzey writes from her cottage in the Ozarks Mountains of Arkansas surrounded by the beauty of The Natural State. A career journalist, Jane now writes not-so-cozy mysteries about four friends on the other side of 50. \"I'm not yet 50, so don't say I am,\" Zelda Carlisle.",
  "genres": [
    "Cozy Mystery"
  ],
  "author": "Jane Elzey",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/53246856-dying-for-dominoes"
}