{
  "title": "Beyond Red Lines",
  "description": "Theo Collin is trapped, forced to train as a mercenary for a cause he doesn't believe in. Will he be able to escape and find his wife and daughter before it's too late?As a young conscript, Theo Collin is noticed by his superior officer for his unique abilities. Luckily, a freak accident saves him from being sent to the front in Iraq, but his officer will never forget him.A decade later, married and the father of a little girl, Theo is offered a prestigious position as Chief Computer Scientist in Mexico. What he doesn't know is that behind this unexpected promotion lies a deadly trap.In the New York offices of his multinational corporation, Gregory Cheston is dead set on avenging his brother, the victim of an Islamist terrorist attack. Head of a colossal fortune and convinced that political correctness is hindering democracy's fight against terrorism, Gregory takes thing into his own hands. Born is the White Cells organization, a group free to do what it takes to get justice.With unlimited resources and the help of the local mafia, the White Cells set up secret training camps in the Sierra Madre, recruiting thousands of mercenaries. But how many of them are really mercenaries? And how many were recruited against their will?It's in one of these camps that Theo experiences hell on earth. After months of vigorous training in subhuman conditions, all he can think of is his family. All he wants to do is find his wife and daughter at all cost. Nothing will stop him, not even the White Cells or Gregory Cheston. He will take them all down if he has to.If you enjoy Military Action Fiction, then Beyond Red Lines is for you.Order your copy now.\"Everyone is asking the same questions: How should we respond to terrorism? Should we be afraid of it? What does it mean for our future? Pierre Rehov, by no means purports to answer all of these questions.\" - Amanda Schuster - European Weekly\"Pierre Rehov has written a doozy of a thriller. This is a globe-trotting novel in which suspense is everywhere and the surprises are non-stop. The intrigues keep the reader turning the pages for the next fateful encounter. The pay-offs are perfectly timed and so very satisfying.\" - Novelist Jack Engelhard (author of Indecent Proposal)",
  "genres": [],
  "author": "Pierre Rehov",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/53231895-beyond-red-lines"
}