{
  "title": "We Thought We Knew You: A Terrifying True Story of Secrets, Betrayal, Deception, and Murder",
  "description": "New York Times bestselling author, television personality, and host of the #1 podcast \"Paper Ghosts,\" M. William Phelps is one of America's most celebrated true crime authorities. In WE THOUGHT WE KNEW YOU, he takes readers deep into the murder of Mary Yoder, a popular wife, mother, and healer in Upstate New York -- telling a gripping tale of a family drama, a determined investigation, and a killer with the face of an angel.In July 2015, Mary Yoder returned home from the chiropractic center that she operated with her husband, Bill, complaining that she felt unwell. Mary, health-conscious and vibrant, was suddenly vomiting, sweating, and weak. Doctors in the ER and ICU were baffled as to the cause of her rapidly progressing illness. Her loved ones--including Bill and their children, Adam, Tamryn, and Liana--gathered in shock to say goodbye.In the weeks that followed Mary's death, the grief-stricken family received startling news from the medical examiner: Mary had been deliberately poisoned. The lethal substance was colchicine, a chemical used to treat gout but extremely toxic if not taken as prescribed. Mary did not have gout. Another bombshell followed when the local sheriff's office received a claim that Adam Yoder had poisoned his mother. But Adam was not the only person of interest in the case. Pretty and popular Kaitlyn Conley, Adam's ex-girlfriend, worked at the Yoders' clinic. She'd even been at Mary's bedside during those last terrible hours. Still, some spoke of her talent for manipulation and a history of bizarre, rage-fueled behavior against anyone who dared to reject her. Had Kaitlyn and Adam conspired to kill Mary Yoder, or was the killer someone else entirely?In another twist, accusations were hurled at Bill Yoder himself, ricocheting blame in still another direction...Renowned investigative journalist M. William Phelps details this incredible story piece by piece, revealing a heartless plan of revenge--a scheme that would tear a family apart, divide a community, and result in two gripping, high-profile trials.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Mystery",
    "Thriller",
    "Biography"
  ],
  "author": "M. William Phelps",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/53239913-we-thought-we-knew-you"
}