{
  "title": "Daddy Long Legs",
  "description": "Daddy Long Legs is a classic novel written by Jean Webster. The story is about a young orphan girl named Jerusha Abbott who is sent to college by an anonymous benefactor who she calls \"\"Daddy Long Legs\"\" because of his long shadow. The novel is written in the form of letters from Jerusha to Daddy Long Legs, where she shares her experiences and feelings about college life, her relationships with her roommates, and her growing affection for a young man named Jervis Pendleton. As Jerusha navigates college, she also learns about her mysterious benefactor and discovers surprising truths about her own past. Through her letters, the reader gets a glimpse into the mind of a young woman coming of age, struggling with her identity, and finding her place in the world. Daddy Long Legs is a heartwarming and charming novel that has captured the hearts of readers for generations. It is a timeless tale of love, friendship, and self-discovery that continues to resonate with readers today.1912. Webster was a grandniece of Mark Twain. She was interested in social work, especially the fields of childcare and prison reform, but her main occupation was writing. She wrote a number of short stories and novels for younger readers including her most famous work, Daddy- Long-Legs. In Daddy-Long-Legs Jerusha Abbot is an orphan with a wicked pen and penetrating insight. Lately of the John Grier Home for orphans, of which too little good cannot be said, Miss Abbott embarks upon a course of college study funded by an anonymous benefactor. This epistolary story contains her charming letters to her unknown Daddy-Long-Legs, named by Miss Abbott because only once at the orphanage did she see his shadow drawn out in the headlights of the car toward which he walked. The insight and wit in this little book are priceless. See other titles by this author available from Kessinger Publishing.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Fiction",
    "Young Adult",
    "Romance",
    "Classics",
    "Historical Fiction",
    "Novels",
    "Childrens"
  ],
  "author": "Jean Webster",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/53240.Daddy_Long_Legs"
}