{
  "title": "Amari and the Night Brothers",
  "description": "Quinton Peters was the golden boy of the Rosewood low-income housing projects, receiving full scholarship offers to two different Ivy League schools. When he mysteriously goes missing, his little sister, 13-year-old Amari Peters, can’t understand why it’s not a bigger deal. Why isn’t his story all over the news? And why do the police automatically assume he was into something illegal?  Then Amari discovers a ticking briefcase in her brother’s old closet. A briefcase meant for her eyes only. There was far more to Quinton, it seems, than she ever knew. He’s left her a nomination for a summer tryout at the secretive Bureau of Supernatural Affairs. Amari is certain the answer to finding out what happened to him lies somewhere inside, if only she can get her head around the idea of mermaids, dwarves, yetis and magicians all being real things, something she has to instantly confront when she is given a weredragon as a roommate. Amari must compete against some of the nation’s wealthiest kids—who’ve known about the supernatural world their whole lives and are able to easily answer questions like which two Great Beasts reside in the Atlantic Ocean and how old is Merlin? Just getting around the Bureau is a lesson alone for Amari with signs like ‘Department of Hidden Places this way, or is it?’ If that all wasn’t enough, every Bureau trainee has a talent enhanced to supernatural levels to help them do their jobs – but Amari is given an illegal ability. As if she needed something else to make her stand out. With an evil magican threatening the whole supernatural world, and her own classmates thinking she is an enemy, Amari has never felt more alone. But if she doesn’t pass the three tryouts, she may never find out what happened to Quinton.",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Audiobook",
    "Fiction",
    "Mystery",
    "Magic",
    "Young Adult"
  ],
  "author": "B.B. Alston",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/53240817-amari-and-the-night-brothers"
}