{
  "title": "Space at the Speed of Light: The History of 14 Billion Years for People Short on Time",
  "description": "From the big bang to black holes, this fast-paced illustrated tour of time and space for the astro-curious unlocks the science of the stars to reveal fascinating theories, surprising discoveries, and ongoing mysteries in modern astronomy and astrophysics.Before the big bang, time, space, and matter didn’t exist. In the 14 billion years since, scientists have pointed their telescopes upward, peering outward in space and backward in time, developing and refining theories to explain the weird and wonderful phenomena they observed. Through these observations, we now understand concepts like the size of the universe (still expanding), the distance to the next-nearest star from earth (Alpha Centauri, 26 trillion miles) and what drives the formation of elements (nuclear fusion), planets and galaxies (gravity), and black holes (gravitational collapse). But are these cosmological questions definitively answered or is there more to discover?Oxford University astrophysicist and popular YouTube personality Dr. Becky Smethurst presents everything you need to know about the universe in ten accessible and engagingly illustrated lessons. In Space at the Speed of Light: The History of 14 Billion Years for People Short on Time, she guides you through fundamental questions, both answered and unanswered, posed by space scientists. Why does gravity matter? How do we know the big bang happened? What is dark matter? Do aliens exist? Why is the sky dark at night? If you have ever looked up at night and wondered how it all works, you will find answers–and many more questions–in this pocket-sized tour of the universe!",
  "genres": [
    "Nonfiction",
    "Science",
    "Physics",
    "Space",
    "Astronomy",
    "Popular Science",
    "Audiobook"
  ],
  "author": "Becky Smethurst",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/53233410-space-at-the-speed-of-light"
}