{
  "title": "Shadow Fall",
  "description": "Perfect for fans of Secondborn, The Hunger Games, and Maze Runner, this dark dystopian tale of survival, intrigue, and slow-burn romance will grip you until the very last page.My name is Maia Graystone: prisoner, rebel, and reluctant savior of a dying world.In exactly 552 hours, an asteroid will end life as we know it. Not that I'm counting or anything. Trapped inside a hellish prison with thieves and murderers, I have more current worries.Like the brother I left behind or the not-so-friendly inmates or the fact that I'm wanted by the most powerful man in existence. Then a mysterious benefactor breaks me out and offers the impossible: a spot in the Shadow Trials. Win and I'll receive a coveted place for my brother and I on the space station in the stars.But the opportunity comes at a steep price. Partner with a dashing psychopath, enter the court that once condemned me to death, survive the ruthless trials created by my own mother, and kill the Emperor--the very man who's hunting me.In this cunning game of life and death, nothing is as it seems and everyone expects me to fail. But they forgot one tiny detail.Never underestimate the girl with nothing left to lose.  Dare to enter the gritty world of Shadow Fall where tyrants rule, misfits reign, and anti-heroes are tasked with saving the world. If you like enemies-to-lovers romance, high-octane action, and epic themes of good versus evil, you'll binge this rollercoaster of emotions late into the night! WARNING. This series is dark, raw, and intense. If you prefer your books full of rainbows and unicorns and random sprinkles of happiness, this might not be your kind of story. But, if you like gritty stories with heart, I promise the ending of the final (third) book will have a happily ever after!",
  "genres": [
    "Fantasy",
    "Dystopia",
    "Young Adult",
    "Science Fiction",
    "Romance",
    "Enemies To Lovers",
    "Dark"
  ],
  "author": "Audrey  Grey",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/53246057-shadow-fall"
}