{
  "title": "The Sum of Us: What Racism Costs Everyone and How We Can Prosper Together",
  "description": "Heather McGhee's specialty is the American economy--and the mystery of why it so often fails the American public. From the financial crisis to rising student debt to collapsing public infrastructure, she found a common root problem: racism. But not just in the most obvious indignities for people of color. Racism has costs for white people, too. It is the common denominator of our most vexing public problems, the core dysfunction of our democracy and constitutive of the spiritual and moral crises that grip us all. But how did this happen? And is there a way out?McGhee embarks on a deeply personal journey across the country from Maine to Mississippi to California, tallying what we lose when we buy into the zero-sum paradigm--the idea that progress for some of us must come at the expense of others. Along the way, she meets white people who confide in her about losing their homes, their dreams, and their shot at better jobs to the toxic mix of American racism and greed. This is the story of how public goods in this country--from parks and pools to functioning schools--have become private luxuries; of how unions collapsed, wages stagnated, and inequality increased; and of how this country, unique among the world's advanced economies, has thwarted universal healthcare.But in unlikely places of worship and work, McGhee finds proof of what she calls the Solidarity Dividend: gains that come when people come together across race, to accomplish what we simply can't do on our own.McGhee marshals economic and sociological research to paint a story of racism's costs, but at the heart of the book are the humble stories of people yearning to be part of a better America, including white supremacy's collateral victims: white people themselves. With startling empathy, this heartfelt message from a Black woman to a multiracial America leaves us with a new vision for a future in which we finally realize that life can be more than a zero-sum game.",
  "genres": [
    "Nonfiction",
    "Race",
    "History",
    "Politics",
    "Social Justice",
    "Audiobook",
    "Anti Racist"
  ],
  "author": "Heather  McGhee",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/53231851-the-sum-of-us"
}