{
  "title": "Bullies & Guns",
  "description": "Bullies & Guns is the fifth book in the Drew Leighton series of novels. These books are a fun easy read with engaging characters. Ripped from the headlines, students will appear at high school with guns. Fair Warning, NO STUDENTS OR TEACHERS DIE, but students do bring guns to school and there is shooting in the school office.After bullying and harassing Drew and friends at school, several students were expelled. As their lives are crashing around them, those students want to blame someone other than themselves. They gather guns and head to school to get even with Drew and his friends for accusing them and helping the police. This story is a realistic portrayal of students who have access to guns using said guns in an effort to attack or hurt people they want to blame.Drew and his best friend Lacy will assist in the evacuation of students and teachers. Later, Drew will negotiate to trade himself in order to save a shooting victim. Of course, the shooters have no idea about Drew’s martial arts skills.In the second part of this story, Drew is asked to help authorities protect a high profile daughter of an elected official. Drew is finding out who he is in the world and helping others is high on the list. Along the way, Drew and Lacy decide to investigate a more personal relationship and go out on a few dates. In this book, Drew uses his skills to resolve several cases of assault involving guns. Near the end of the book, we will see how government authorities can sometimes bully innocent people in a thirst for their own definition of justice. Bullies look for weakness or something that sets someone apart from others. Anything unusual can draw the attention of a bully. High school is an environment ripe with opportunity for bullies. As children grow up body changes lead to physical changes and hygiene requirements. Big kids and little kids, athletes and nerds, heritage or specialized interests which may be unusual can all result in a student being isolated or identified as a victim of opportunity for a bully.Drew Leighton, a high school sophomore, was born male and experienced a case of gynecomastia which resulted in real breasts that do not seem to be going away. He is under a doctor’s care now and is attending school as a female student with a doctor’s note explaining that he is transgendered in his pocket. No one at the school is aware of Drew’s true gender except for his friend Lacy. Drew is trying to understand his body and his sexuality in different ways than all the other high school students around him.Together, Drew and Lacy have encountered and helped resolve a number of cases of bullying.While this book can be read as a standalone, it is the fifth book in the Drew Leighton series.Thank you for readingDaring DianeDisclaimerThis story is a work of fiction. Names, characters, businesses, places, events, locales, and incidents are either the products of the author’s imagination or used in a fictitious manner. Any resemblance to actual persons, living or dead, or actual events is purely coincidental.",
  "genres": [
    "Young Adult"
  ],
  "author": "Daring Diane",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/53257824-bullies-guns"
}