{
  "title": "The House on Firefly Beach",
  "description": "Nothing beats falling in love under the sun, with the sand beneath your feet. This gorgeous, feel-good, and heartwarming summer escape from the bestselling author of The Summer House is perfect for fans of Mary Alice Monroe, Susan Mallery and Nancy Thayer.For Sydney Flynn, her treasured family home, Starlight Cottage, is her sanctuary. The house on the beach, surrounded by glittering turquoise waters, is the perfect place for her fresh start, piecing her life back together after it fell apart. That’s until her knees almost buckle at the sight of Nate Henderson.As teenagers, Sydney and Nate spent their summers whispering sweet nothings and promising “forever” to each other. Sydney never imagined that her childhood sweetheart was going to break her heart, driving away from her and Firefly Beach, never looking back.Now, when Sydney spots him at her sister’s wedding, their eyes meeting across the rows of guests, she barely recognizes him. The down-to-earth son of a fisherman, forever in beach t-shirts and flip flops, is replaced with a successful songwriter in a designer suit, a superstar in the country music scene. Yet despite everything, his dazzling blue eyes and easy smile stir up all the feelings she thought she’d left behind.Nate is back to make it up to Sydney, but can she forgive him for all the heartbreak he caused? And it’s not only about her – Sydney is a single mother to Robby, her whole world, and she won’t let just anyone into their lives. Can she trust that Nate has really changed?As if worrying about Nate wasn’t enough, a new development threatens Starlight Cottage, the safe haven that saved her when she had nothing else. Can Nate and Sydney overcome their past to save Firefly Beach and the house that holds so many memories for them? Or will the town they adore, and the love they have for one another, be lost forever?",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Fiction",
    "Contemporary Romance",
    "Second Chance Romance",
    "Second Chance"
  ],
  "author": "Jenny  Hale",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/53257168-the-house-on-firefly-beach"
}