{
  "title": "Walking through the Wall",
  "description": "Updated in 2020. Winner of an International Peace Writing Award.Long before reality television shows like Survivor, some people walked across the United States and Europe to Russia on real-life, Survivor-like projects. This is the inside story of one of those break-down-the-walls projects during the height of the 1980s Cold War by a journalist trained to be as objective as possible.Called \"A Walk of the People - A Pilgrimage for Life,\" the project was the longest group march in modern history, covering about 7,000 miles across the United States and Europe in 1984 and 1985. Covered by more than 2,000 newspapers, radio stations, television outlets, and other media, the walk appealed to a wide range of people as a nonpartisan, people-to-people project. Moderate to liberal President Jimmy Carter and conservative Alabama Gov. George Wallace were among those submitting letters of commendation or welcome. Members met with officials from the Reagan administration at the White House, as well as Democrats such as Rev. Jesse Jackson during the first Reagan-Gorbachev summit in Geneva in 1985. They also met with officials and individuals in Russia, Hungary, Poland, Romania, Yugoslavia, and the former Czechoslovakia and East Germany to distribute hundreds of letters and drawings depicting people's desires to end the Cold War.Walking through the Wall details the sometimes intense internal conflicts of this project and others. The book covers the dangers that included one participant of a 1987-88 march in India being hit by a bus and almost dying. The account incorporates humor at times, as it unflinchingly presents a study of a group trying to maintain its own peace in difficult circumstances.The book is a timeless story of not just trying to walk through barriers like the Berlin Wall, but of attempting to break through internal walls, unseen walls between fellow human beings, walls between one's self.",
  "genres": [],
  "author": "Kevin James Shay",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/53253605-walking-through-the-wall"
}