{
  "title": "Sentence: Ten Years and a Thousand Books in Prison",
  "description": "A memoir of a decade in prison by a well-educated young addict known as the \"Apologetic Bandit\"In 2003 Daniel Genis, the son of a famous Soviet émigré writer, broadcaster, and culture critic, was fresh out of NYU when he faced a serious heroin addiction that led him into debt and ultimately crime. After he was arrested for robbing people at knifepoint, he was nicknamed the “apologetic bandit” in the press, given his habit of expressing his regret to his victims as he took their cash. He was sentenced to twelve years—ten with good behavior, a decade he survived by reading 1,046 books, taking up weightlifting, having philosophical discussions with his fellow inmates, working at a series of prison jobs, and in general observing an existence for which nothing in his life had prepared him. Genis describes in unsparing and vivid detail the realities of daily life in the New York penal system. In his journey from Rikers Island and through a series of upstate institutions he encounters violence on an almost daily basis, while learning about the social strata of gangs, the “court” system that sets geographic boundaries in prison yards, how sex was obtained, the workings of the black market in drugs and more practical goods, the inventiveness required for everyday tasks such as cooking, and how debilitating solitary confinement actually is—all while trying to preserve his relationship with his recently married wife. Written with empathy and wit, Sentence is a strikingly powerful memoir of the brutalities of prison and how one man survived then, leaving its walls with this book inside him, “one made of pain and fear and laughter and lots of other books.”",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Biography",
    "Books About Books",
    "Adult",
    "True Crime"
  ],
  "author": "Daniel Genis",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/53267455-sentence"
}