{
  "title": "Eden",
  "description": "Dark secrets and psychological suspense unfold over a half-century in the lives of a deeply troubled yet tightly woven Louisiana family.It has been thirty years since Evelyn Yates's sister disappeared mysteriously from their home in tiny rural Eden, Louisiana, and twenty since Evelyn fled Louisiana trying to escape the demons of her childhood. In present-day California, she struggles to care for her teenage daughter and manage the considerable stressors of her own complicated life. She is stunned to receive a call from the sheriff in Eden.Construction crews working on the site of her childhood home have made a hideous discovery. They have unearthed the decades-old remains of a girl, strands of hair and clothing still attached to the bones. Evelyn is devastated by the phone call. The Eden coroner informs her officials there suspect the remains may be those of her sister.Evelyn, who has mentally reduced her childhood to a series of blotchy Images and fragmented memories, fears something sinister may await her in Eden. Perhaps something she is unable to remember. She has no desire to return. Her fragile internal world is suddenly threatened with collapse by this discovery and the pressure to return home to help identify the remains.The discovery of the body sets in motion a series of events leading inevitably to the uncovering of secrets dating back multiple generations; terrible events that may involve the entire town of Eden. As Evelyn pursues the answers to the mysteries presented she finds her sanity, her life, and the life of her daughter threatened. She must face truths about her mother, Gwen, and her father as well as the rest of her family. Ultimately she must peel back the layers of her own consciousness, face her memories, and delve deeper into painful questions about her sister, and finally herself.Eden is a complex novel. Set against a background thick and sensuous with Southern beauty and imagery-the the live oak and Spanish moss and cypress swamps play roles nearly as big as the characters themselves-the book explores the devastating nature of secrets When played as a silent conspiracy between generations and yet the ultimate power of love to overcome.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Thriller",
    "Mystery Thriller",
    "Mystery"
  ],
  "author": "W.A. Schwartz",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/53269681-eden"
}