{
  "title": "Dominion: An Anthology of Speculative Fiction from Africa and the African Diaspora",
  "description": "Dominion is the first anthology of speculative fiction and poetry by Africans and the African Diaspora. An old god rises up each fall to test his subjects. Once an old woman’s pet, a robot sent to mine an asteroid faces an existential crisis. A magician and his son time-travel to Ngoni country and try to change the course of history. A dead child returns to haunt his grieving mother with terrifying consequences. Candace, an ambitious middle manager, is handed a project that will force her to confront the ethical ramifications of her company’s latest project—the monetization of human memory. Osupa, a newborn village in pre-colonial Yorubaland populated by refugees of war, is recovering after a great storm when a young man and woman are struck by lightning, causing three priests to divine the coming intrusion of a titanic object from beyond the sky.A magician teams up with a disgruntled civil servant to find his missing wand. A taboo error in a black market trade brings a man face-to-face with his deceased father—literally. The death of a King sets off a chain of events that ensnare a trickster, an insane killing machine, and a princess, threatening to upend their post-apocalyptic world. Africa is caught in the tug-of-war between two warring Chinas, and for Ibrahim torn between the lashings of his soul and the pain of the world around him, what will emerge? When the Goddess of Vengeance locates the souls of her stolen believers, she comes to a midwestern town with a terrible past, seeking the darkest reparations. In a post-apocalyptic world devastated by nuclear war, survivors gather in Ife-Iyoku, the spiritual capital of the ancient Oyo Empire, where they are altered in fantastic ways by its magic and power.",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Science Fiction",
    "Anthologies",
    "Fiction",
    "Africa",
    "Speculative Fiction"
  ],
  "author": "Zelda Knight",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/53257232-dominion"
}