{
  "title": "Everybody Has a Podcast (Except You): A How-to Guide from the First Family of Podcasting",
  "description": "From the #1 New York Times bestselling McElroy Brothers, creators of the hit podcasts My Brother, My Brother and Me and The Adventure Zone, comes a helpful and hilarious how-to podcast guide covering everything you need to know to make, produce, edit, and promote a podcast…and get rich* doing it! (*Results not guaranteed.)Justin, Travis, and Griffin McElroy made their names as “advice giving brothers who have no business giving advice” (New York Times) on the hit podcast My Brother, My Brother and Me. But while they may not have the best relationship or workplace advice, they certainly make you laugh, and they do know a thing or two about podcasting.In fact, the McElroy Brothers have spent the last decade making podcasts, including My Brother, My Brother and Me; The Adventure Zone; Sawbones; and more. From their start, independently producing and releasing the early episodes of My Brother, My Brother and Me, to their eleven currently available podcasts, the McElroys have become experts in creating successful podcasts. And now, they want to share what they’ve learned with you.In Everybody Has a Podcast (Except You), the McElroy Brothers will walk you through the process of turning an idea into ear-candy for legions of fans, sharing their expertise on everything from deciding on an effective name (definitely not something like My Brother, My Brother and Me), what type of microphone to use (definitely not one from the video game Rock Band), to making lots and lots of money (spoiler: you probably won’t).A must-read for anyone interested in podcasting, Everybody Has a Podcast (Except You) shares the keys to success as well as the mistakes to avoid and draws on the vast experiences of three of the funniest and most successful podcasters working today.",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "Humor",
    "Business",
    "Self Help",
    "How To",
    "Entrepreneurship"
  ],
  "author": "Justin McElroy",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/53287275-everybody-has-a-podcast-except-you"
}