{
  "title": "With Her Fist Raised: Dorothy Pitman Hughes and the Transformative Power of Black Community Activism",
  "description": "The first biography of Dorothy Pitman Hughes, a trailblazing Black feminist activist whose work made children, race, and welfare rights central to the women's movement.Dorothy Pitman Hughes was a transformative community organizer in New York City in the 1970s who shared the stage with Gloria Steinem for 5 years, captivating audiences around the country. After leaving rural Georgia in the 1950s, she moved to New York, determined to fight for civil rights and equality. Historian Laura L. Lovett traces Hughes's journey as she became a powerhouse activist, responding to the needs of her community and building a platform for its empowerment. She created lasting change by revitalizing her West Side neighborhood, which was subjected to racial discrimination, with nonexistent childcare and substandard housing, where poverty, drug use, a lack of job training, and the effects of the Vietnam War were evident. Hughes created a high-quality childcare center that also offered job training, adult education classes, a Youth Action corps, housing assistance, and food resources. Her realization that her neighborhood could be revitalized by actively engaging and including the community was prescient.As her stature grew to a national level, Hughes spent several years traversing the country with Steinem and educating people about feminism, childcare, and race. She moved to Harlem in the 1970s to counter gentrification and bought the franchise to the Miss Greater New York City pageant to demonstrate that Black was beautiful. She also opened an office supply store and became a powerful voice for Black women entrepreneurs and Black-owned businesses. Throughout every phase of her life, Hughes understood the transformative power of activism for Black communities.With expert research, which includes Hughes's own accounts of her life, With Her Fist Raised is the necessary biography of a pivotal figure in women's history and Black feminism whose story will finally be told.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "History",
    "Biography",
    "Race",
    "Social Justice",
    "Biography Memoir"
  ],
  "author": "Laura L. Lovett",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/53285748-with-her-fist-raised"
}