{
  "title": "Aria",
  "description": "Fairy Tale Princesses Like You’ve Never Seen Them Before…10 Champions destined to defeat an evil that threatens to wipe out the land of Fantasia...Book 3: AriaA pirate wounded on the open water and left for dead… A loyal friend and merman destined to keep her safe…And a royal prince contracted to be her husband…Finding a human adrift after a vicious battle with a kraken, Aria breaches her banishment to save the brave pirate, Captain Hook. Though Aria knows she has no business involving herself in human affairs, she can’t help her attraction to the roguishly handsome pirate with a silver tongue, a body riddled with muscle, and a mouth made for sin. Aria’s life is quickly uprooted when her aunt announces that in order for Aria to reclaim the throne from her cruel father, King Triton, she will need allies. And, in this case, allies = marriage to a man she doesn’t even know, Prince Andric. Meanwhile Aria’s heart and body belongs to the legendary Captain Hook, a man who teaches Aria the very meaning of desire.The seas continue to rage, with new and violent monsters creeping from the deeps to attack at every turn. Accompanied by her devoted friend and bodyguard, the incredibly handsome merman, Bastion, Aria must face the man who brought her to ruin and threatens to destroy everyone she loves. Can Aria make it out of the battlefield with her life and loves intact? Or will her heart be just another casualty of war?Find out in the third book in the Happily Never After Series!The Happily Never After Reverse Harem Series Features: Snow White, Goldilocks, Rose Red, Sleeping Beauty, Tinkerbell, Cinderella, Bo Peep, Belle, The Little Mermaid, & Red Riding HoodOther Reverse Harem Series from Plum Pascal and HP Mallory:The Happily Never After Series:1. Snow2. Goldy3. Aria 4. Rose (Coming Soon!)The Sacred Oath Series1. Angel2. Dragan3. Baron4. Cambion5. Variant6. Theren (Coming Soon!)",
  "genres": [
    "Retellings",
    "Mermaids",
    "Fantasy"
  ],
  "author": "Plum Pascal",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/53286575-aria"
}