{
  "title": "Homecoming",
  "description": "Adelaide Hills, Christmas Eve, 1959: At the end of a scorching hot day, beside a creek on the grounds of the grand and mysterious mansion, a local delivery man makes a terrible discovery. A police investigation is called and the small town of Tambilla becomes embroiled in one of the most shocking and perplexing murder cases in the history of South Australia.Sixty years later, Jess is a journalist in search of a story. Having lived and worked in London for almost twenty years, she now finds herself laid off from her full-time job and struggling to make ends meet. A phone call out of nowhere summons her back to Sydney, where her beloved grandmother, Nora, who raised Jess when her mother could not, has suffered a fall and been raced to the hospital.Nora has always been a vibrant and strong presence: decisive, encouraging, young despite her years. When Jess visits her in the hospital, she is alarmed to find her grandmother frail and confused. It’s even more alarming to hear from Nora's housekeeper that Nora had been distracted in the weeks before her accident and had fallen on the steps to the attic—the one place Jess was forbidden from playing in when she was small.At loose ends in Nora's house, Jess does some digging of her own. In Nora's bedroom, she discovers a true crime book, chronicling the police investigation into a long-buried tragedy: the Turner Family Tragedy of Christmas Eve, 1959. It is only when Jess skims through the book that she finds a shocking connection between her own family and this once-infamous crime—a crime that has never been resolved satisfactorily. And for a journalist without a story, a cold case might be the best distraction she can find…An epic novel that spans generations, Homecoming asks what we would do for those we love, and how we protect the lies we tell. It explores the power of motherhood, the corrosive effects of tightly held secrets, and the healing nature of truth. Above all, it is a beguiling and immensely satisfying novel from one of the finest writers working today.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Book Club",
    "Thriller",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Kate Morton",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/53287003-homecoming"
}