{
  "title": "Where Foxes Hunt with Wolves",
  "description": "--- You are responsible for what you tame ---Yevhen. Forest ranger. Werewolf. Stifled by pack rules.Radek. Foxy ginger brat. Changeling. Will avoid responsibility at all cost.Banished from his pack for being gay, Yev has one last chance to redeem himself in the eyes of his family. He needs to stick to the rules for a year, and bury his sexuality forever. Shouldn’t be so hard, since he can’t have a relationship with a human without revealing his werewolf nature.That is until one night, a drunk ginger brat points a rifle in his face.Radek finished University months ago but thinking about the future is not on his agenda. Life would be great if he could just avoid any and all responsibilities.He doesn’t want to be his mom’s caregiver, doesn’t want to take over the family fox farm, doesn’t want to return to his village, and doesn’t want a steady boyfriend.His world turns upside down when he’s arrested by an infuriatingly attractive forest ranger. If that wasn’t bad enough, he’s now hunted by werewolves for discovering their drug smuggling operation, and… he turned into a fox!?Helpless and wounded, he seeks sanctuary with the very man who got him into this mess, but what’s a fox to do? If there’s someone who can help him understand his changeling origin, it’s Yev. A werewolf.POSSIBLE SPOILERS:Genre: Paranormal M/M romance with dark elementsContains scorching hot, emotional, explicit scenes with a hint of kink and lots of biting!Themes: Folklore, forbidden love, hurt/comfort, little town, homophobia, coming out, fish out of water, shifters, discovering magic, age gap, size difference, changeling, animal rights activism, growing up, werewolf, family issuesLength: ~ 120,000 words (standalone)WARNING: This story contains scenes of violence, offensive language, bodily harm, animal cruelty, and morally ambiguous characters.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "Magic",
    "Audiobook"
  ],
  "author": "K.A. Merikan",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/53283142-where-foxes-hunt-with-wolves"
}