{
  "title": "Rock Me on the Water: 1974—The Year Los Angeles Transformed Movies, Music, Television and Politics",
  "description": "In this exceptional cultural history, Atlantic Senior Editor Ronald Brownstein tells the kaleidoscopic story of one monumental year that marked the city of Los Angeles’ creative peak, a glittering moment when popular culture was ahead of politics in predicting what America would become. Los Angeles in 1974 exerted more influence over popular culture than any other city in America. Los Angeles that year, in fact, dominated popular culture more than it ever had before, or would again. Working in film, recording, and television studios around Sunset Boulevard, living in Brentwood and Beverly Hills or amid the flickering lights of the Hollywood Hills, a cluster of transformative talents produced an explosion in popular culture which reflected the demographic, social, and cultural realities of a changing America. At a time when Richard Nixon won two presidential elections with a message of backlash against the social changes unleashed by the sixties, popular culture was ahead of politics in predicting what America would become. The early 1970s in Los Angeles was the time and the place where conservatives definitively lost the battle to control popular culture.Rock Me on the Water traces the confluence of movies, music, television, and politics in Los Angeles month by month through that transformative, magical year. Ronald Brownstein reveals how 1974 represented a confrontation between a massive younger generation intent on change, and a political order rooted in the status quo. Today, we are again witnessing a generational cultural divide. Brownstein shows how the voices resistant to change may win the political battle for a time, but they cannot hold back the future.",
  "genres": [
    "History",
    "Music",
    "Nonfiction",
    "Politics",
    "Film",
    "Pop Culture",
    "Media Tie In"
  ],
  "author": "Ronald Brownstein",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/53287261-rock-me-on-the-water"
}