{
  "title": "Sanctuary: A Memoir",
  "description": "\"Congratulations on the resurrection of your life,\" a colleague wrote to Emily Rapp Black when she announced the birth of her second child. The line made Rapp Black pause. Her first child, a boy named Ronan, had died from Tay-Sachs disease before he turned three years old, an experience she wrote about in her second book, The Still Point of the Turning World. Since that time, her life had changed utterly: She left the marriage that fractured under the terrible weight of her son's illness, got remarried to a man who she fell in love with while her son was dying, had a flourishing career, and gave birth to a healthy baby girl. But she rejected the idea that she was leaving her old life behind--that she had, in the manner of the mythical phoenix, risen from the ashes and been reborn into a new story, when she still carried so much of her old story with her. More to the point, she wanted to carry it with her. Everyone she met told her she was resilient, strong, courageous in ways they didn't think they could be. But what did those words mean, really?This book is an attempt to unpack the various notions of resilience that we carry as a culture. Drawing on contemporary psychology, neurology, etymology, literature, art, and self-help, Emily Rapp Black shows how we need a more complex understanding of this concept when applied to stories of loss and healing and overcoming the odds, knowing that we may be asked to rebuild and reimagine our lives at any moment, and often when we least expect it. Interwoven with lyrical, unforgettable personal vignettes from her life as a mother, wife, daughter, friend, and teacher, Rapp Black creates a stunning tapestry that is full of wisdom and insight.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Grief",
    "Biography",
    "Biography Memoir",
    "Audiobook",
    "Death"
  ],
  "author": "Emily Rapp Black",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/53285044-sanctuary"
}