{
  "title": "How To Hold a Cockroach: A book for those who are free and don't know it",
  "description": "How to Hold a Cockroach is about discovering and freeing ourselves from the beliefs that cause us to suffer. With a message both surprising and simple, it is a love letter to humankind, a book for those who are free and don't know it.An Inspirational Tale with 42 Beautiful Illustrations In this story for all ages, a struggling boy begins a life-changing journey when a disgusting guest disturbs his dinner. As he encounters more sources of suffering, the boy must investigate fundamental truths he has believed about himself, love, and life. He confronts some of life's most persistent questions:Described as \"a children's book for adults,\" How to Hold a Cockroach was written for adults but is suitable for thoughtful teenagers and children. For Readers Who Are... ✓ Looking for contemplative and inspirational books about philosophy, spirituality, or psychology.✓ Facing challenging circumstances, heartbreak, low self-esteem, or resentment towards others. ✓ Finding it difficult to accept the past or fearing what the future will bring.✓ Fans of the works of Paulo Coelho, Kobi Yamada, or Charlie Mackesy; books like The Alchemist , The Tao of Pooh , The Little Prince , and The Untethered Soul ; or spiritual teachers like Tara Brach, Thich Nhat Hanh, Eckhart Tolle, and Cheri Huber. Regardless of your birthplace, background, or spiritual beliefs -- Christian, Buddhist, Hindu, atheist, Muslim, Jewish, Latter-day Saint, or anything else - this book invites you to explore how you see yourself and the world, re-examine your perspectives, and free yourself to experience more joy, peace, and love. Choose Your Edition The hardcover edition is 7x10 inches and contains full-color illustrations.The paperback edition is 6x9 inches and contains black-and-white illustrations.The Kindle edition contains full-color illustrations (or black-and-white if your device does not support color).",
  "genres": [
    "Fiction",
    "Philosophy",
    "Audiobook",
    "Self Help",
    "Psychology",
    "Mental Health",
    "Spirituality"
  ],
  "author": "Matthew  Maxwell",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/53279827-how-to-hold-a-cockroach"
}