{
  "title": "Searching for Love",
  "description": "Discover the magic of New York Times bestseller Melissa Foster's writing and see why millions of readers have fallen in love with the fiercely loyal and sassily sexy characters in the Love in Bloom big-family romance collection. Love in Bloom novels are written to stand alone or may be enjoyed as part of the larger series, so dive right into this fun, sexy romance.  In USA Today Bestseller SEARCHING FOR LOVE... Zev Braden and Carly Dylan were childhood best friends, co-explorers, and first loves. Their close-knit families were sure they were destined to marry—until a devastating tragedy struck, breaking the two lovers apart. Over the next decade Zev, a nomadic treasure hunter, rarely returned to his hometown, and Carly became a chocolatier and built a whole new life across the country. When a chance encounter brings them back into each other’s lives, can they find the true love that once existed, or will shattered dreams and broken hearts prevail? Find out in Searching for Love, a deliciously sexy, funny, and emotional second-chance romance.  ** Love in Bloom novels feature alpha male heroes and smart, empowered women. They're flawed, funny, passionate, and relatable to readers who enjoy contemporary romance and women's fiction.  THE BRADENS & MONTGOMERYS (Pleasant Hill - Oak Falls). Order of future books is subject to change. Embracing Her HeartAnything For LoveTrails of LoveWild Crazy HeartsMaking You MineSearching for LoveHot for LoveSweet Sexy HeartOur Wicked HeartsClaiming Her HeartRocked by Love **  \"When it comes to contemporary romances with realistic characters, an emotional love story and smokin' hot sex, author Melissa Foster always delivers!\" The Romance Reviews  \"You can always rely on Melissa Foster to deliver a story that's fresh, emotional and entertaining. Make sure you have all night, because once you start you won't want to stop reading. Every book's a winner!\" New York Times Bestselling Author Brenda Novak  \"With her wonderful characters and resonating emotions, Melissa Foster is a must-read author!\" New York Times Bestseller J. Kenner  \"Melissa Foster is synonymous with sexy, swoony, heartfelt romance!\" New York TimesBestseller Lauren Blakely  \"Melissa Foster writes her romance novels similarly to my favorite adult romance author, Danielle Steel: the perfect blend of drama, romance, friendship, love and passion.\"- Andrea Buginsky, author  \"I highly recommend this book to fans of Nora Roberts (one of my personal faves) and fans of a sweet story filled with heat and heart.\" - Tia Bach, author  \"Melissa Foster is quickly becoming one of my favorites. Fated For Love was amazing. It kind of reminds me of Jill Shalvis' books and they are my benchmark for contemporary romance awesomeness.\" --Books Like Breathing (on Fated for Love)  \"I highly recommend the Snow Sisters all the Braden and Remington books....I am sure there are going to be other family's that intertwine and that is what I love most about these books. They remind me of the McCarthy of Gansett series and The Green Mountain series. I am a huge fan of Marie Force. And now Melissa Foster has joined her ranks....\" - I Love NY, Reviewer",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Second Chance",
    "Family",
    "Second Chance Romance"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/53306489-searching-for-love"
}