{
  "title": "The Longing of Lone Wolves",
  "description": "A beauty from our time. A fae beast from the future. A curse only she can break... if he lets her close to his heart.Rush is a Fae Guardian, a wolf-shifter whose enhanced abilities have made him a ruthless protector of Elphyne. His job is to protect the realm from the human enemy, and to ensure the sins of the past never come to pass again lest magic die forever. Well... it was his job until half a century ago when he allowed one night of weakness to distract him from his job. His punishment was a curse worse than death. Now a ghost, he spends his lonely time longing to be part of the living, once again protecting them from monsters… until one washes up on the shores of his lake.Clarke is beautiful, feisty, fierce, and she's the only person who can see him.If he hands her over to the Order, she’s his ticket to having his curse removed, but the more he learns about this human, the more he realizes maybe she’s not the monster he’s trained to believe. In fact, she’s capable of inciting passion he’d never dreamed possible again, but Clarke has a message from the past… sins are already repeating. This time, if they don’t stop the coming evil, it won’t just be magic that dies. It will be everything.The Witcher meets Beauty and the Beast in this gripping, heart-stopping new epic fantasy romance featuring a band of brothers, shifters, fae protectors and their strong willed women from our time. If you love your books full of page turning action, intrigue, and romantic tension then this book is for you. For fans of Kristen Ashley's Fantastical series or Sarah J Maas's adult fantasy romance.More in the Fae Guardians SeriesThe Longing of Lone WolvesThe Solace of Sharp Claws The Dreams of Broken Kings",
  "genres": [
    "Fantasy",
    "Romance",
    "Fae",
    "Paranormal",
    "Fantasy Romance",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "Lana Pecherczyk",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/53303848-the-longing-of-lone-wolves"
}