{
  "title": "New Startup Mindset: Ten Mindset Shifts to Build the Company of Your Dreams",
  "description": "Sandra Shpilberg will show you a new way to succeed as an entrepreneur! This provocative startup tale of success exposes Silicon Valley’s startup myths and sets forth a new approach for aspiring and current founders to build companies that make an impact.In New Startup Mindset, Sandra Shpilberg, founder and CEO of Seeker Health, introduces a new mindset for starting and building a successful company. Shpilberg shows that Silicon Valley’s startup formula—a few young male cofounders attempting to build a unicorn funded by venture capital—is a broken system that puts excessive emphasis on hype and improbable outsized outcomes, disregards real results such as revenue and profit, and promotes limiting beliefs for the next generation of entrepreneurs.In 2015, Shpilberg founded Seeker Health, a digital patient-finding platform. The company grew rapidly to serve over sixty biotechnology companies, connect millions of patients with serious diseases to clinical trials, and achieve great financial success. From the start, Shpilberg did almost everything differently than the blazed path: she chose to be a solo founder, didn’t pursue an incubator, didn’t accept outside funding, led development of software despite not being a programmer, and charged customers from month one. Instead of creating hype about fundraising based on fictitious valuations, Shpilberg focused on customer needs, yielding a startup with revenue, profit, and impact; and in September 2018, a large life science services company acquired her startup while she was still the sole owner.In New Startup Mindset, Shpilberg shares her success story of starting, building, and exiting her startup and provides readers with sage insights and practical tools to follow this approach. This book is simultaneously a needed dose of reality for Silicon Valley and a large serving of inspiration for those who want to create something from nothing. It is a must-read for aspiring startup founders and current entrepreneurs, especially those who may think they don’t fit the mold of a Silicon Valley founder and are open to a new way of making a definitive and profound impact with the companies they create.",
  "genres": [
    "Business",
    "Self Help",
    "Nonfiction",
    "Education",
    "Productivity",
    "How To",
    "Inspirational"
  ],
  "author": "Sandra Shpilberg",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/53297993-new-startup-mindset"
}