{
  "title": "Maliki",
  "description": "Betrayal.When it comes at the hands of family, betrayal destroys lives. His reputation destroyed and career as a surgeon shattered, Harrison M. Boswell, VI, vanishes, and the alter-ego of Dr. Maliki Blue arises. His employer, Guardian Security, knows who he had been—but they are the only ones. Too bad pasts don’t stay buried. A distress call from the one person he couldn’t ignore drags him back to a place and time he’d sworn to forget and embroils him in a tangled web of small-town drama and three deaths. With one foot out of the door, Mal is ready to leave and never return, when the deputy sheriff appeals to him for the kind of help only he, and Guardian can provide.Desire.Dr. Maliki Blue exploded into her world at the scene of what would have been a successful murder—had the good doctor not intervened so swiftly and effectively to save the life of the gunshot victim. As Senior Deputy Sheriff of Pleasant County, VA, Poet Campbell’s instinct told her Dr. Maliki Blue was more than who he said he was. Checking out the gorgeous, sexy doctor will be one of life’s unexpected pleasures. Then life—and a suspicious set of unrelated circumstances—complicates everything, including her attraction to the sexy doctor.Destiny.He didn't want to acknowledge his past or examine the reasons he left, but fate forced that hand. Fate also dropped Poet Campbell onto his lap. However, other than for his access to Guardian, she doesn’t need him, although neither would deny the gravitational pull between them. Not a fertile field to grow a meaningful relationship no matter how insatiable their physical attraction. Add corrupt officials and a psychotic serial killer and a tragic ending is almost preordained—almost.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Military Fiction",
    "Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Kris Michaels",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/53304085-maliki"
}