{
  "title": "Sex and Vanity",
  "description": "The iconic author of the bestselling phenomenon Crazy Rich Asians returns with a glittering tale of love and longing as a young woman finds herself torn between two worlds–the WASP establishment of her father’s family and George Zao, a man she is desperately trying to avoid falling in love with.On her very first morning on the jewel-like island of Capri, Lucie Churchill sets eyes on George Zao and she instantly can’t stand him. She can’t stand it when he gallantly offers to trade hotel rooms with her so that she can have the view of the Tyrrhenian Sea, she can’t stand that he knows more about Curzio Malaparte than she does, and she really can’t stand it when he kisses her in the darkness of the ancient ruins of a Roman villa and they are caught by her snobbish, disapproving cousin, Charlotte. “Your mother is Chinese so it’s no surprise you’d be attracted to someone like him,” Charlotte teases. Daughter of an American-born-Chinese mother and blue-blooded New York father, Lucie has always sublimated the Asian side of herself in favor of the white side, and she adamantly denies having feelings for George. But several years later, when George unexpectedly appears in East Hampton where Lucie is weekending with her new fiancé, Lucie finds herself drawn to George again. Soon, Lucy is spinning a web of deceit that involves her family, her fiancé, the co-op board of her Fifth Avenue apartment, and ultimately herself as she tries mightily to deny George entry into her world–and her heart. Moving between summer playgrounds of privilege, peppered with decadent food and extravagant fashion, Sex and Vanity is a truly modern love story, a daring homage to A Room with a View, and a brilliantly funny comedy of manners set between two cultures.",
  "genres": [
    "Fiction",
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Audiobook",
    "Book Club",
    "Adult"
  ],
  "author": "Kevin Kwan",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/53298177-sex-and-vanity"
}