{
  "title": "Survivor",
  "description": "They say there’s nothing wrong with me, but I can’t walk.At least not more than a couple of feet at a time. Like from bed to my wheelchair.I crawled out of the wreckage of our family car seconds before it burst into flame at the base of the cliff, killing my parents. I screamed my lungs raw for help, even though I knew they couldn’t be saved, but nobody came for nearly twenty-four hours. It rained, and I shivered in the chill, the scent of burned upholstery and other things filling my nose. My aunt cared for me for a short while, but when she also died in an accident—a house fire that nearly took me out as well—I was placed in the care of a hired nurse who made sure I took my meds and waited on me hand and foot. Over time I lost what little strength I had, until I never left my room, almost bedridden, my only contact with the outside world online classes.But when I turned eighteen, I had to make a change or I’d end up dying here, old and alone and without any hope. So now I have my small apartment in a new town, living on my own for the first time and attending classes at the local community college. My parents’ insurance is running out, but I have a job in the school library, and as long as I take my pills every day, I seem to do all right.It’s not much of a life, but so much more than I ever had.When Brandon Graves knocked on my door, the look of shock on his face was priceless. Apparently, he’d never seen a shifter in a wheelchair before. He said I was on pack lands and therefore had to meet with the Alpha, his brother. So much for staying under the radar. Survivor is the first book in a paranormal reverse harem shifter series featuring a badly injured female wolf shifter and the four male wolf shifters who all want to be her fated mate. It is a why choose werewolf romance with a slow burn buildup sure to make your toes curl. Relationships develop over the course of this supernatural series and, of course, Mazzy guarantees an HEA.",
  "genres": [
    "Reverse Harem",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Paranormal Romance",
    "Werewolves"
  ],
  "author": "Mazzy J. March",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/53302663-survivor"
}