{
  "title": "I Want to Kiss You in Public",
  "description": "The new, reedited version of this book is available for free on the author's website. Louis thought he had it all figured out. He couldn’t have been more wrong.​​​​​​​If you ask Louis, he’s a rock star.Just the right amount of sarcastic, cute, and only slightly delusional. He attends the best high school, in Paris no less, has got the coolest best friend, the fiercest girlfriend, and more importantly, he’s absolutely, a hundred per cent straight.So no, Michael, the new British student, with his dark curls and sweet smiles, doesn’t interest him whatsoever. And when a teacher pairs the two to write an essay together, Louis’s not exactly excited about it, but he can always tell himself he doesn’t have a choice.Slowly and inevitably, Louis and Michael become friends, and perhaps a little more. Soon, they’re close enough that Louis is becoming increasingly confused. There’s something about Michael, something powerful enough that his mere presence in his life makes Louis question everything: his lifestyle, his friendships, his values, and whether or not he actually ever liked girls.In this coming-of-age love story, Louis, a snarky student at an International High School in Paris struggles to admit the truth to himself and his loved ones as he wrestles with his sexuality. Will he find the courage to accept who is he before it's too late?I Want To Kiss You In Public is a story about friendship, love, truth and heartbreak, with a hint of over-the-top comedy, suitable for fans of Skam, Sex Education, Heartstopperand Boyfriend Material.\"The Michael Edition\" is 300 pages long and was reedited in February 2023. The ebook version also contains an extract from Colette International Book 2 as a bonus. To get this reedition for free, head over to the author's website.",
  "genres": [
    "LGBT",
    "Young Adult",
    "Romance",
    "Queer",
    "M M Romance",
    "Gay",
    "Contemporary"
  ],
  "author": "Zelda French",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/53320264-i-want-to-kiss-you-in-public"
}