{
  "title": "The Copenhagen Trilogy",
  "description": "Called a masterpiece by The New York Times, the acclaimed trilogy from Tove Ditlevsen, a pioneer in the field of genre-bending confessional writingTove Ditlevsen is today celebrated as one of the most important and unique voices in twentieth-century Danish literature, and The Copenhagen Trilogy (1969-71) is her acknowledged masterpiece. Childhood tells the story of a misfit child's single-minded determination to become a poet; Youth describes her early experiences of sex, work, and independence. Dependency picks up the story as the narrator embarks on the first of her four marriages and goes on to describe her horrible descent into drug addiction, enabled by her sinister, gaslighting doctor-husband.Throughout, the narrator grapples with the tension between her vocation as a writer and her competing roles as daughter, wife, mother, and drug addict, and she writes about female experience and identity in a way that feels very fresh and pertinent to today's discussions around feminism. Ditlevsen's trilogy is remarkable for its intensity and its immersive depiction of a world of complex female friendships, family and growing up--in this sense, it's Copenhagen's answer to Elena Ferrante's Neapolitan Novels. She can also be seen as a spiritual forerunner of confessional writers like Karl Ove Knausgaard, Annie Ernaux, Rachel Cusk and Deborah Levy. Her trilogy is drawn from her own experiences but reads like the most compelling kind of fiction.Born in a working-class neighborhood in Copenhagen in 1917, Ditlevsen became famous for her poetry while still a teenager, and went on to write novels, stories and memoirs before committing suicide in 1976. Having been dismissed by the critical establishment in her lifetime as a working-class, female writer, she is now being rediscovered and championed as one of Denmark's most important modern authors, with Tove fever gripping readers.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Classics",
    "Biography",
    "Denmark",
    "Audiobook",
    "Feminism"
  ],
  "author": "Tove Ditlevsen",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/53317528-the-copenhagen-trilogy"
}