{
  "title": "The Free World: Art and Thought in the Cold War",
  "description": "In his follow-up to the Pulitzer Prize-winning The Metaphysical Club, Louis Menand offers a new intellectual and cultural history of the postwar yearsThe Cold War was not just a contest of power. It was also about ideas, in the broadest sense--economic and political, artistic and personal. In The Free World, the acclaimed Pulitzer Prize-winning scholar and critic Louis Menand tells the story of American culture in the pivotal years from the end of World War II to Vietnam and shows how changing economic, technological, and social forces put their mark on creations of the mind.How did elitism and an anti-totalitarian skepticism of passion and ideology give way to a new sensibility defined by freewheeling experimentation and loving the Beatles? How was the ideal of \"freedom\" applied to causes that ranged from anti-communism and civil rights to radical acts of self-creation via art and even crime?With the wit and insight familiar to readers of The Metaphysical Club and his New Yorker essays,  Menand takes us inside Hannah Arendt's Manhattan, the Paris of Jean-Paul Sartre and Simone de Beauvoir, Merce Cunningham and John Cage's residences at North Carolina's Black Mountain College, and the Memphis studio where Sam Phillips and Elvis Presley created a new music for the American teenager. He examines the post war vogue for French existentialism, structuralism and post-structuralism, the rise of abstract expressionism and pop art, Allen Ginsberg's friendship with Lionel Trilling, James Baldwin's transformation into a Civil Right spokesman, Susan Sontag's challenges to the New York Intellectuals, the defeat of obscenity laws, and the rise of the New Hollywood.Stressing the rich flow of ideas across the Atlantic, he also shows how Europeans played a vital role in promoting and influencing American art and entertainment. By the end of the Vietnam era, the American government had lost the moral prestige it enjoyed at the end of the Second World War, but America's once-despised culture had become respected and adored. With unprecedented verve and range, this book explains how that happened.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "Politics",
    "Philosophy",
    "American History",
    "Music"
  ],
  "author": "Louis Menand",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/53317422-the-free-world"
}