{
  "title": "Why the Innocent Plead Guilty and the Guilty Go Free: And Other Paradoxes of Our Broken Legal System",
  "description": "A senior federal judge's incisive, unsettling exploration of some of the paradoxes that define the judiciary today, Why the Innocent Plead Guilty and the Guilty Go Free features essays examining why innocent people plead guilty, why high-level executives aren't prosecuted, why you won't get your day in court, and why the judiciary is curtailing its own constitutionally mandated power.How can we be proud of a system of justice that often pressures the innocent to plead guilty? How can we claim that justice is equal when we imprison thousands of poor Black men for relatively modest crimes but rarely prosecute rich white executives who commit crimes having far greater impact? How can we applaud the Supreme Court's ever-more-limited view of its duty to combat excesses by the president?The federal judge Jed S. Rakoff, a leading authority on white-collar crime, explores these and other puzzles in Why the Innocent Plead Guilty and the Guilty Go Free, a startling account of our broken legal system. Grounded in Rakoff's twenty-four years as a federal trial judge in New York in addition to the many years he worked as a federal prosecutor and criminal defense lawyer, Rakoff 's assessment of our justice system illuminates some of our most urgent legal, social, and political issues: plea deals and class-action lawsuits, corporate impunity and the death penalty, the perilsof eyewitness testimony and forensic science, the war on terror and the expanding reach of the executive branch. A fundamental problem, he reveals, is that the judiciary is constraining its own constitutional powers.Like few others, Rakoff understands the values that animate the best aspects of our legal system--and has a close-up view of our failure to live up to these ideals. But he sees within this gap great opportunities for practical reform, and a public mandate to make our justice system truly just.",
  "genres": [
    "Nonfiction",
    "Law",
    "Politics",
    "Crime",
    "True Crime",
    "Social Justice",
    "Sociology"
  ],
  "author": "Jed S. Rakoff",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/53317482-why-the-innocent-plead-guilty-and-the-guilty-go-free"
}