{
  "title": "Places of Mind: A Life of Edward Said",
  "description": "A New York Times Book Review Editors' ChoiceThe first comprehensive biography of the most influential, controversial, and celebrated Palestinian intellectual of the twentieth century As someone who studied under Edward Said and remained a friend until his death in 2003, Timothy Brennan had unprecedented access to his thesis adviser's ideas and legacy. In this authoritative work, Said, the pioneer of postcolonial studies, a tireless champion for his native Palestine, and an erudite literary critic, emerges as a self-doubting, tender, eloquent advocate of literature's dramatic effects on politics and civic life.Charting the intertwined routes of Said's intellectual development, Places of Mind reveals him as a study in opposites: a cajoler and strategist, a New York intellectual with a foot in Beirut, an orchestra impresario in Weimar and Ramallah, a raconteur on national television, a Palestinian negotiator at the State Department, and an actor in films in which he played himself. Brennan traces the Arab influences on Said's thinking along with his tutelage under Lebanese statesmen, off-beat modernist auteurs, and New York literati, as Said grew into a scholar whose influential writings changed the face of university life forever. With both intimidating brilliance and charm, Said melded these resources into a groundbreaking and influential countertradition of radical humanism, set against the backdrop of techno-scientific dominance and religious war. With unparalleled clarity, Said gave the humanities a new authority in the age of Reaganism, one that continues today.Drawing on the testimonies of family, friends, students, and antagonists alike, and aided by FBI files, unpublished writings, and Said's drafts of novels and personal letters, Places of Mind synthesizes Said's intellectual breadth and influence into an unprecedented, intimate, and compelling portrait of one of the great minds of the twentieth century.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Politics",
    "History",
    "Memoir",
    "Philosophy",
    "Society"
  ],
  "author": "Timothy Brennan",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/53317435-places-of-mind"
}