{
  "title": "Wild Coast: Travels on South America's Untamed Edge",
  "description": "Guyana, Suriname, and French Guiana are among the least-known places in South nine hundred miles of muddy coastline giving way to a forest so dense that even today there are virtually no roads through it; a string of rickety coastal towns situated between the mouths of the Orinoco and Amazon Rivers, where living is so difficult that as many Guianese live abroad as in their homelands; an interior of watery, green anarchy where border disputes are often based on ancient Elizabethan maps, where flora and fauna are still being discovered, where thousands of rivers remain mostly impassable. And under the lens of John Gimlette—brilliantly offbeat, irreverent, and canny—these three small countries are among the most wildly intriguing places on earth.On an expedition that will last three months, he takes us deep into a remarkable world of swamp and jungle, from the hideouts of runaway slaves to the vegetation-strangled remnants of penal colonies and forts, from “Little Paris” to a settlement built around a satellite launch pad. He recounts the complicated, often surprisingly bloody, history of the region—including the infamous 1978 cult suicide at Jonestown—and introduces us to its from the world’s largest ants to fluorescent purple frogs to head-crushing jaguars; from indigenous tribes who still live by sorcery to descendants of African slaves, Dutch conquerors, Hmong refugees, Irish adventurers, and Scottish outlaws; from high-tech pirates to hapless pioneers for whom this stunning, strangely beautiful world (“a sort of X-rated Garden of Eden”) has become home by choice or by force.In Wild Coast, John Gimlette guides us through a fabulously entertaining, eye-opening—and sometimes jaw-dropping—journey.",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Adventure",
    "Memoir",
    "Travelogue",
    "Reportage"
  ],
  "author": "John Gimlette",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/10274127-wild-coast"
}