{
  "title": "Hair Transplant Real: Revealing the Illusion",
  "description": "Patient breaks 35 year silence to reveal the illusion Uncover the secrets of the hair transplant industry. Are you thinking about getting a hair transplant, but you want to know what secrets the industry hides from you? Looking for a detailed, inside look into the hair transplant industry, based on four decades of research and observation? Then keep reading. Touted as a simple solution to balding and receding hairlines, the hair transplant industry holds many secrets that consumers need to know. Nobody understands this better than Michael Petrus, who at the age of 23, underwent a hair transplant but didn’t fully understand the procedure, the extreme limitations and the marketers and doctors who are drawn to this lucrative area of medicine. Now at the age of 57, Michael shares his story in a powerful account, drawing on four decades of research, observation, and actual consumer experience to offer a detailed and comprehensive look at these secrets and shortcomings of the hair transplant industry. Far too many people who suffer disastrous hair transplants are too ashamed to speak out which keeps much of it hidden. Shame is a powerful prison but silence is no longer an option. Now, you can arm yourself with the essential knowledge you need. Here’s what you’ll discover How The Hair Transplant Industry Keeps Consumers In The Dark and Conceals Information About Its Procedures Why Bad Decisions and Impulse Operations Can Lead To Disastrous Results A Breakdown of Common Hair Transplant Drawbacks Understanding the Math The Marketing Machine Which Keeps The Industry Running and How the Game is Played How Online Research is Filled With Deception and Can Easily Become a Form of Mind Control Hair Transplant Horror Stories Some Followed By Thoughts of Suicide – What You Need To Know The Truth About Hair Tattoos, Hair Loss Drugs, and More Reflections on The Industry And Much More… With insightful comments, real science, and a down-to-earth breakdown of the hair transplant industry, join Michael Petrus as he shares his story and provides vital information that you need to consider before signing up for surgery.",
  "genres": [],
  "author": "Michael Petrus",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/53315690-hair-transplant-real"
}