{
  "title": "Hometown Heroes: A Small Town Romantic Suspense Anthology",
  "description": "High stakes in a small town bring out the best in these heart stopping heroes. Nine full length stories where the only thing that will get your heart pumping harder than the romance is the suspense that will have you turning pages well into the night. Cora Seton: Issued to the Bride: One Navy SEAL (Brides of Chance Creek #1) Going rogue on his last mission landed Navy SEAL Brian Lake on a fast track out of the Navy, so when Army general Augustus Reed steps in with an intriguing new mission--marry his daughter and earn a share of his Montana ranch--he can't say no. But Brian's not the only one who wants Two Willows--or Cass. Will falling in love be the most dangerous mission of all? JH Croix: Take Me Home (Last Frontier Lodge #1) Marley moves back home to find security in the aftermath of a brutal robbery. She feels an instant connection with her new neighbor, a smoldering Navy SEAL. The danger Marley is trying to escape is chasing her, and Gage finds he'll do anything to protect her. He never considered his own heart might be at risk. A first in series small town romance suspense story. Lori Ryan: Love and Protect (Heroes of Evers, Texas #1) In serious danger and on the run in a desperate attempt to save her child, Laura seeks refuge at a Texas ranch. She finds an instant connection with gorgeous rancher Cade -- but there's no hiding from the past. Her past will hunt her no matter where she goes. This pulse pounding romance is the first book in the Heroes of Evers, TX Series. PJ Fiala: Ford: Finding His Fire (Big 3 Security #1) Ford Montgomery is on the trail of the arsonist who killed his parents. When that trail leads him to sexy waitress Megan Marshall, things take an unexpected turn. Megan is being hunted by a deadly cartel, Ford is now in their sights, and the arsonist is still running free. Their only chance of survival is if Ford and Megan learn to trust each other quickly and walk into the fire together. Kait Nolan: If I Didn't Care (Wishing for a Hero #1) Autumn and Judd are two friends bound by blood. When the nightmare from their past returns, will it rip them apart or cement the bonds forged years ago? A romance-heavy, small-town suspense that's first in a series. Kelsey Browning: Going Hard (Steele Ridge #2) Wealthy sports agent Grif Steele returns to North Carolina when his hometown falls on hard times and needs his help. When a stalker targets his ex-lover Carlie Beth Parrish, will Grif step in to protect her, or will the fourteen-year-old secret she's keeping tear them apart forever? Valerie J. Clarizio: Taken by Surprise Police Chief Jack Ricco's heart is set ablaze when his teenage crush, Clare Ulster, returns to the remote, laid-back Upper Peninsula of Michigan. Unfortunately, Clare's big-city problems follow her creating chaos in the small town Jack has vowed to protect. Will Clare and Jack be able to survive the deceptively peaceful Iron City? Janie Crouch: Cyclone (Linear Tactical #1) Zac Mackay. Military codename: CYCLONE. He's the town's returned hero--a man forged in battle, now working to help others be safe. So why is Anne, the quiet doctor he never thought he'd see again, afraid of *him*?Elle James: Soldier's Duty (Iron Horse Legacy #1) Home in Eagle Rock, Montana to search for his missing father, Delta Force soldier Angus McKinnon runs interference in murder attempts on his former flame whose secret could destroy them both. *****Nine full length standalone novels from NY Times and USA Today Bestselling and award-winning authors! Available for a limited time only. Grab them FREE before this deal is gone for good!",
  "genres": [],
  "author": "Lori Ryan",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/53313316-hometown-heroes"
}