{
  "title": "Burning Man: The Trials of D. H. Lawrence",
  "description": "An electrifying, revelatory new biography of D. H. Lawrence, with a focus on his difficult middle years \"Never trust the teller,\" wrote D. H. Lawrence, \"trust the tale.\" Everyone who knew him told stories about Lawrence, and Lawrence told stories about everyone he knew. He also told stories about himself, again and again: a pioneer of autofiction, no writer before Lawrence had made so permeable the border between life and literature. In Burning Man: The Trials of D. H. Lawrence, acclaimed biographer Frances Wilson tells a new story about the author, focusing on his decade of superhuman writing and travel between 1915, when The Rainbow was suppressed following an obscenity trial, and 1925, when he was diagnosed with tuberculosis.Taking after Lawrence's own literary model, Dante, and adopting the structure of The Divine Comedy,  Burning Man is a distinctly Lawrentian book, one that pursues Lawrence around the globe and reflects his life of wild allegory. Eschewing the confines of traditional biography, it offers a triptych of lesser-known episodes drawn from lesser-known sources, including tales of Lawrence as told by his friends in letters, memoirs, and diaries. Focusing on three turning points in Lawrence's pilgrimage (his crises in Cornwall, Italy, and New Mexico) and three central adversaries--his wife, Frieda; the writer Maurice Magnus; and his patron, Mabel Dodge Luhan--Wilson uncovers a lesser-known Lawrence, both as a writer and as a man.Strikingly original, superbly researched, and always revelatory, Burning Man is a marvel of iconoclastic biography. With flair and focus, Wilson unleashes a distinct perspective on one of history's most beloved and infamous writers.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "British Literature",
    "21st Century",
    "Memoir"
  ],
  "author": "Frances Wilson",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/53317487-burning-man"
}