{
  "title": "Plunder: Napoleon's Theft of Veronese's Feast",
  "description": "One of The Christian Science Monitor 's Ten Best Books of May\"A highly original work of history . . . [Saltzman] has written a distinctive study that transcends both art and history and forces us to explore the connections between the two.” ―Roger Lowenstein, The Wall Street JournalA captivatingstudy of Napoleon’s plundering of Europe’s art for the Louvre, told through the story of a Renaissance masterpiece seized from VeniceCynthia Saltzman’s Plunder recounts the fate of Paolo Veronese’s Wedding Feast at Cana , a vast, sublime canvas that the French, under the command of the young Napoleon Bonaparte, tore from a wall of the monastery of San Giorgio Maggiore, on an island in Venice, in 1797. Painted in 1563 during the Renaissance, the picture was immediately hailed as a masterpiece. Veronese had filled the scene with some 130 figures, lavishing color on the canvas to build the illusion that the viewers’ space opened onto a biblical banquet taking place on a terrace in sixteenth-century Venice. Once pulled from the wall, the Venetian canvas crossed the Mediterranean rolled on a cylinder; soon after, artworks commandeered from Venice and Rome were triumphantly brought into Paris. In 1801, the Veronese went on exhibition at the Louvre, the new public art museum founded during the Revolution in the former palace of the French kings.As Saltzman tells the larger story of Napoleon’s looting of Italian art and its role in the creation of the Louvre, she reveals the contradictions of his character: his thirst for greatness―to carry forward the finest aspects of civilization―and his ruthlessness in getting whatever he sought. After Napoleon’s 1815 defeat at Waterloo, the Duke of Wellington and the Allies forced the French to return many of the Louvre’s plundered paintings and sculptures. Nevertheless, The Wedding Feast at Cana remains in Paris to this day, hanging directly across from the Mona Lisa .Expertly researched and deftly told, Plunder chronicles one of the most spectacular art appropriation campaigns in history, one that sheds light on a seminal historical figure and the complex origins of one of the great museums of the world.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "France",
    "Art History",
    "European History",
    "Italy"
  ],
  "author": "Cynthia Saltzman",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/53317466-plunder"
}