{
  "title": "The Scapegoat",
  "description": "A mesmerizing postmodern debut novel, The Scapegoatis a propulsive and destabilizing literary mystery that follows a man at a university in the San Francisco Bay area as he investigates his father's deathN is employed at a prestigious California university, where he has distinguished himself as an aloof and somewhat eccentric presence. His meticulous, ordered life is violently disrupted by the death of his estranged father--unanticipated and, as it increasingly seems to N, surrounded by murky circumstances. His investigation leads him to a hotel built over a former Spanish mission, a site with a dark power and secrets all its own. On campus, a chance meeting with a young doctor provokes uncomfortable feelings on the direction of his life, and N begins to have vivid, almost hallucinatory daydreams about the year he spent in Ottawa, and a shameful episode from his past.Meanwhile, a shadowy group of fringe academics surfaces in relation to his father's death. Their preoccupation with a grim chapter in California's history runs like a surreal parallel to the staid world of academic life, where N's relations with his colleagues grow more and more hostile. As he comes closer to the heart of the mystery, his ability to distinguish between delusion and reality begins to erode, and he is forced to confront disturbing truths about himself: his irrational antagonism toward a young female graduate student, certain libidinal impulses, and a capacity for violence. Is he the author of his own investigation? Or is he the unwitting puppet of a larger conspiracy?With this inventive, devilish debut, saturated with unexpected wit and romanticism, Sara Davis probes the borders between reality and delusion, intimacy and solitude, revenge and justice. The Scapegoat exposes the surreal lingering behind the mundane, the forgotten history underfoot, and the insanity just around the corner.",
  "genres": [
    "Fiction",
    "Mystery",
    "Contemporary",
    "Mystery Thriller",
    "Thriller",
    "Horror",
    "Literary Fiction"
  ],
  "author": "Sara Davis",
  "average_rating": "3.07",
  "url": "https://www.goodreads.com/book/show/53317481-the-scapegoat"
}