{
  "title": "The Man with the Iron-On Badge",
  "description": "\"As dark and twisted as anything Hammett or Chandler ever dreamed up....\" Kirkus, Starred Review\"Approaching the level of Lawrence Block is no mean feat, but Goldberg succeeds with this engaging PI novel.\" Publishers WeeklyHarvey Mapes is a 26-year-old security guard who spends his nights in a guard shack outside a gated community in Southern California, reading detective novels, watching reruns, and waiting for his life to finally start... which happens when Cyril Parkus, one of the wealthy residents, asks Harvey to follow his beautiful wife Lauren.The lowly security guard jumps at the opportunity to fulfill his private eye fantasies and use everything he's learned from Spenser, Magnum, and Mannix. But things don't exactly go according to the books...or the reruns. As Harvey fumbles and stumbles through his first investigation, he discovers that the differences between fiction and reality can be deadly.With the help of his mortgage broker neighbor and occasional lover Carol, Harvey uncovers a blackmail plot that takes a sudden and unexpectedly tragic turn...plunging him into a world of violence, deception and murder... and forcing him to discover what it really takes to be a private eye.( This hardcover edition of this book is now out-of-print.  New Kindle and paperback editions have now been released under the title WATCH ME DIE).CRITICAL ACCLAIM FOR \"WATCH ME DIE\"\"A wonderfully fresh voice in the mystery genre, Goldberg will delight fans of Janet Evanovich and Robert Crais,\" - Rick Riordan, author of \"Percy Jackson & the Olympians\"\"Lee Goldberg bravely marches into territory already staked out by some fierce competition--Donald Westlake, Lawrence Block, the early Harlan Coben--and comes out virtually unscathed.\" The Chicago Tribune\"Goldberg has a knack for combining just the right amount of humor and realism with his obvious love for the PI genre and his own smart ass sensibilities. [...]A terrific read. Goldberg is the real deal and should be on everyone's must read list.\" Crimespree Magazine\"A quick, fun read with a satisfying and unexpected ending. Harvey Mapes is a hero I hope we see in a sequel.\" -- Phillip Margolin, author of \"Gone But Not Forgotten\"",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Humor",
    "Crime",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "Lee Goldberg",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1261330.The_Man_with_the_Iron_On_Badge"
}