{
  "title": "Chatter: The Voice in Our Head, Why It Matters, and How to Harness It",
  "description": "NATIONAL BESTSELLER • An award-winning psychologist reveals the hidden power of our inner voice and shows how to harness it to combat anxiety, improve physical and mental health, and deepen our relationships with others.LONGLISTED FOR THE PORCHLIGHT BUSINESS BOOK AWARD • “A masterpiece.”—Angela Duckworth, bestselling author of Grit • Malcolm Gladwell, Susan Cain, Adam Grant, and Daniel H. Pink’s Next Big Idea Club Winter 2021 Winning SelectionOne of the best new books of the year—The Washington Post, BBC, USA Today, CNN Underscored, Shape, Behavioral Scientist, PopSugar • Kirkus Reviews, Publishers Weekly, and Shelf Awareness starred reviewsIs talking to yourself normal? The truth is that we all have a voice in our head. When we talk to ourselves, we often hope to tap into our inner coach but find our inner critic instead. When we’re facing a tough task, our inner coach can buoy us up: Focus—you can do this. But, just as often, our inner critic sinks us entirely: I’m going to fail. They’ll all laugh at me. What’s the use?In Chatter, acclaimed psychologist Ethan Kross explores the silent conversations we have with ourselves. Interweaving groundbreaking behavioral and brain research from his own lab with real-world case studies—from a pitcher who forgets how to pitch, to a Harvard undergrad negotiating her double life as a spy—Kross explains how these conversations shape our lives, work, and relationships. He warns that giving in to negative and disorienting self-talk—what he calls “chatter”—can tank our health, sink our moods, strain our social connections, and cause us to fold under pressure.But the good news is that we’re already equipped with the tools we need to make our inner voice work in our favor. These tools are often hidden in plain sight—in the words we use to think about ourselves, the technologies we embrace, the diaries we keep in our drawers, the conversations we have with our loved ones, and the cultures we create in our schools and workplaces.Brilliantly argued, expertly researched, and filled with compelling stories, Chatter gives us the power to change the most important conversation we have each day: the one we have with ourselves.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Audiobook",
    "Science",
    "Mental Health",
    "Personal Development"
  ],
  "author": "Ethan Kross",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/53330118-chatter"
}