{
  "title": "The Power of Discipline: How to Use Self Control and Mental Toughness to Achieve Your Goals by Daniel Walter",
  "description": "https://amzn.to/3bdYlR3 Have you spent weeks, months, or even years trying to achieve your goals but keep failing?Have you given up on becoming successful because your futile efforts have led you to believe that success is only for the select few?If you have answered “yes” to any of these questions—don’t worry, there is still hope for you!Before you can achieve anything in life, you need a solid foundation of self-discipline. Talent, intelligence, and skill are only a part of the equation. Positive thinking, affirmations, and vision boards are only a part of the equation. If you want to turn your dreams into reality, you need self-discipline.Self-discipline is what will keep you focused when all hell is breaking loose and it looks like you are one step away from failure. It will give you the mental toughness required to dismantle the limitations you have placed on yourself and break through all obstacles standing in the way of your goals.How would you feel if I told you that your inability to achieve your goals does not arise because you are lazy or lack drive, but rather it’s a problem because you have never been taught how to practice self-discipline?People are not born with self-discipline. Like driving or playing tennis, it’s a skill that you learn. In The Power of Discipline you will gain access to easy-to-read, scientific explanations about self-discipline including:How to master self-discipline by targeting certain areas of the brainThe Navy SEALs’ secrets to self-disciplineThe Zen Buddhists’ secrets to self-disciplineHow to make hard-work excitingHow to ditch your bad habits and adopt the habits of successful peopleStrategies to keep going when your motivation runs outAnd much, much moreBy applying the principles in this book, you will develop your self-discipline, bulldoze through toward your goals, become an unstoppable force of nature, and start living the life you know you deserve!It’s impossible to buy back the time you have lost, but you can take control of your future.  Click the link below to view the book on Amazon! https://amzn.to/3bdYlR3",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Productivity",
    "Business",
    "Audiobook"
  ],
  "author": "Daniel Walter",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/53335614-the-power-of-discipline"
}