{
  "title": "Consent: A Memoir",
  "description": "Already an international literary sensation, an intimate and powerful memoir of a young French teenage girl’s relationship with a famous, much older male writer—a universal #MeToo story of power, manipulation, trauma, recovery, and resiliency that exposes the hypocrisy of a culture that has allowed the sexual abuse of minors to occur unchecked.Sometimes, all it takes is a single voice to shatter the silence of complicity. Thirty years ago, Vanessa Springora was the teenage muse of one of the country’s most celebrated writers, a footnote in the narrative of a very influential man in the French literary world.At the end of 2019, as women around the world began to speak out, Vanessa, now in her forties and the director of one of France’s leading publishing houses, decided to reclaim her own story, offering her perspective of those events sharply known.Consent is the story of one precocious young girl’s stolen adolescence. Devastating in its honesty, Vanessa’s painstakingly memoir lays bare the cultural attitudes and circumstances that made it possible for a thirteen-year-old girl to become involved with a fifty-year-old man who happened to be a notable writer. As she recalls the events of her childhood and her seduction by one of her country’s most notable writers, Vanessa reflects on the ways in which this disturbing relationship changed and affected her as she grew older. Drawing parallels between children’s fairy tales and French history and her personal life, Vanessa offers an intimate and absorbing look at the meaning of love and consent and the toll of trauma and the power of healing in women’s lives. Ultimately, she offers a forceful indictment of a chauvinistic literary world that has for too long accepted and helped perpetuate gender inequality and the exploitation and sexual abuse of children.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Feminism",
    "France",
    "Biography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Vanessa Springora",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/53327897-consent"
}