{
  "title": "I Know Jesus Christ Is Real: King of Kings, and Lord of Lords",
  "description": "I Know Jesus Christ Is Real, is a candid, spiritual and philosophical memoir aimed at adults. There is no doubt in my mind that Jesus Christ is real. Time after time, he has appeared to me to comfort, challenge, rebuke, encourage, provide, heal, rescue, or gave me a message to deliver. Hoping to bring others to a relationship with their Lord and Savior, I have opened up my life in my memoir, sharing both the bad and the good as honestly as possible, witnessing the ongoing presence and activity of God in my everyday experiences.From my earliest childhood onward, I have met Jesus, heard God's Voice, and been swept up in the power of the Holy Spirit through dreams, visions, internal conversations, and encounters with others, many of which I have described in vivid detail in my book. I have seen miraculous things. In both my native Jamaica and in my adopted homeland, the USA, God has impacted mightily on my life, and I know that God wants to do the same for others. It is my prayer that this book can serve as a vehicle for bringing God's love and saving grace to as many as can be reached. I've told my story hoping you'll believe that God loves you too. God can provide for you, help you, heal you, befriend you, reform you, and fill your heart with joy in some truly wondrous ways because Jesus Christ is not just some fairy tale or some ancient person in a book who lived way back when. Jesus Christ is real. And he's here and now.I Know Jesus Christ Is Real is my attempt to enable the Holy Spirit to reveal himself all over again in a way that can impact your journey with God, drawing you ever closer to the one who longs to be your Lord and Savior and fill your life with good things. I pray that my story can help you look at your own with eyes wide open to God's glory and goodness.",
  "genres": [],
  "author": "Melinda T. Deir-Boyette",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/53335176-i-know-jesus-christ-is-real"
}