{
  "title": "And Now For The Good News...: The much-needed tonic for our frazzled world",
  "description": "'I think at this point in time we're all in need of as much good news as we can get! Ruby can always be guaranteed to lift your spirits' - Annie Lennox on Twitter'I adored interviewing Ruby: she has such a fizzing, uniquely vibrant and clever way of thinking about things. And I've wanted her on the podcast for ages because she does such important work' - Elizabeth Day______________You would be forgiven for thinking 2020 was not the year for a book about good news. But now might be the time we need it most. Ruby Wax is here to reassure us with her brand new book, And Now For The Good News. This is her positivity prescription, showing us the green shoots of optimism and change forcing their way up and into the sunlight.She has spent the last three years speaking to the inspiring people who are spearheading the latest innovation and influencing a brighter future for humanity. From the communities being designed to eradicate loneliness and the companies putting their employees' happiness first, to the AI technology teaching children with learning difficulties and taking literacy to levels higher than ever before.Ruby's here to show you that behind the clouds, the sun still shines. So, do you want the good news?______________'A new book by Ruby is in itself Good News! It sounds like a tonic for the universal malaise' - Ian McKellen on Twitter 'In a world of relentlessly worrying news, finally a moment of good. I adored reading And Now for the Good News - truly there is hope' - Emma Freud on Twitter 'This book couldn't be more needed right now!' - Nigella Lawson on Twitter 'I am reading and finding on every page a delicious morsel' - Celia Imrie on Twitter",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Audiobook",
    "Health",
    "Book Club"
  ],
  "author": "Ruby Wax",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/53346460-and-now-for-the-good-news"
}