{
  "title": "Brutal Heir",
  "description": "Never trust a campus god.Knight Reed is a devil heir with a chip on his shoulder. The arrogant a-hole I love to hate.His name may be Knight, but that armor is black as coal. He’s a beautiful god with a wicked heart. I know because my mom used to work for his family. An act of brutal violence in the woods and he gets my mom fired, ultimately leaving us homeless. That was the last time I saw him face-to-face.At least, until recently. He’s frat boy royalty at my new university, a campus god amongst the rich and elite. There’s little interest in a freshman like me.But then I cross him, putting an end to me being invisible here in his world. At a party, I see something I shouldn’t have seen. Now, suddenly, the campus god has me tackled on a bed with his hand around my throat. He tells me to forget what I witnessed. Do that or the end result will be bad for me. He’s hellbent on crushing my little dove wings and all I see is that cruel boy from the woods that day.When it comes to Knight, I can’t seem to stay out of his way or keep my trap shut around him, no matter how hard I try. He tells me my little mouth will get me in trouble, but I think he’s wrong.I’m not afraid what will happen if I spill his secrets. What terrifies me is how badly I want to see what might be beyond all that coal-black armor...It’s possible that, to some small measure, I’m tempted to give in to the only devil I’ve ever known.The dark knight himself. Warning:  Brutal Heir is an NA bully romance that contains dubious content and situations some may find triggering. It’s recommended for readers 17+ and is a standalone novel with no cliffhanger. It’s book one in a series of standalones titled Court University, which is a spin-off series about characters featured in Eden O’Neill’s Court High books. Reading the Court High books first is not necessary for the enjoyment of Court University. The characters' origin stories merely begin in Court High and can be referred to at any time if the reader so chooses.",
  "genres": [
    "Romance",
    "Dark Romance",
    "Enemies To Lovers",
    "Dark",
    "College",
    "New Adult",
    "Contemporary Romance"
  ],
  "author": "Eden O'Neill",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/53354209-brutal-heir"
}