{
  "title": "Broken Dawn",
  "description": "Delve into an exciting new stand-alone novel in New York Times bestselling author Dianne Duvall's \"fast-paced and humorous\" (Publishers Weekly), \"utterly addictive\" (RT Book Reviews) Immortal Guardians series.Nick Belanger can't stop thinking about the single mother who lives next door. She's smart. She's funny. She's so beautiful he can't stare at her too long for fear his eyes will start to glow. But Kayla thinks he's just an ordinary guy who works in security. Finding out he instead is a powerful immortal warrior who hunts and slays psychotic vampires for a living may not go over well, particularly since she has a daughter she doesn't want to endanger.Kayla Dorman can keep neither her gaze nor her thoughts from straying to the man next door. Who can blame her really? He is the epitome of tall, dark, and handsome with smart, charming, and honorable thrown in. He's also a few years younger than her and surely would not be interested in a single mom who hasn't dated since her divorce. At least that's what she thinks until an accident nearly takes her life and Nick risks all to save her.The dynamics of their relationship swiftly change. The friendship they've developed over the years deepens into love as the two spend every minute they can together, laughing and teasing, never suspecting a threat may lurk in the shadows. But that threat soon strikes, making it clear that Nick is the target and his enemy doesn't care if Kayla gets caught in the cross fire. Though Kayla bravely rises to the occasion and is determined to do whatever it takes to help Nick defeat his enemy, Nick is terrified of losing her. Can he identify and eliminate his new nemesis before the man takes everything from him?",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Vampires",
    "Audiobook",
    "Fantasy",
    "Urban Fantasy"
  ],
  "author": "Dianne Duvall",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/53343680-broken-dawn"
}