{
  "title": "Hoax: Donald Trump, Fox News, and the Dangerous Distortion of Truth",
  "description": "The urgent and untold story of the collusion between Fox News and Donald Trump from the New York Times bestselling author of Top of the Morning.While other leaders were marshaling resources to combat the greatest pandemic in modern history, President Donald Trump was watching TV. Trump watches over six hours of Fox News a day, a habit his staff refers to as “executive time.” In January 2020, when Fox News began to downplay COVID-19, the President was quick to agree. In March, as the deadly virus spiraled out of control, Sean Hannity mocked “coronavirus hysteria” as “new hoax” from the left. Millions of Americans took Hannity and Trump's words as truth—until some of them started to get sick.In Hoax, CNN anchor and chief media correspondent Brian Stelter tells the twisted story of the relationship between Donald Trump and Fox News. From the moment Trump glided down the golden escalator to announce his candidacy in the 2016 presidential election to his acquittal on two articles of impeachment in early 2020, Fox hosts spread his lies and smeared his enemies. Over the course of two years, Stelter spoke with over 250 current and former Fox insiders in an effort to understand the inner workings of Rupert Murdoch's multibillion-dollar media empire. Some of the confessions are alarming. “We don't really believe all this stuff,” a producer says. “We just tell other people to believe it.”At the center of the story lies Sean Hannity, a college dropout who, following the death of Fox News mastermind Roger Ailes, reigns supreme at the network that pays him $30 million a year. Stelter describes the raging tensions inside Fox between the Trump loyalists and the few remaining journalists. He reveals why former chief news anchor Shep Smith resigned in disgust in 2019; why a former anchor said “if I stay here I’ll get cancer;” and how Trump has exploited the leadership vacuum at the top to effectively seize control of the network.Including never before reported details, Hoax exposes the media personalities who, though morally bankrupt, profit outrageously by promoting the President’s propaganda and radicalizing the American right. It is a book for anyone who reads the news and wonders: How did this happen?",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Journalism",
    "Audiobook",
    "Business",
    "American History"
  ],
  "author": "Brian Stelter",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/53345186-hoax"
}