{
  "title": "Team Zero Series 1-3 Boxed Set",
  "description": "A sociopath meets a hitman who deals with a mafia bossThis limited edition boxset contains the first three full-length novels of Team Zero series as well as never seen before scenes and other bonus content.Three dark, filthy cruel men.Three women who give as much as they take.If you want dark romance with a touch of mafia and alpha hitmen then you should dip into Team Zero’s world.Warning: Everything is NOT what it seems.Another warning: The entire series is as steamy as it’s filled with endless twists and turns.LuredHe's madness and I'm tired of being sane.I watched him. Studied him. Became obsessed with him.Doctor Dominic Johnson is a social anomaly. A monster in plain sight.A sociopath.Beneath the expensive clothes and well-crafted facade lurks a predator who’s searching for his next prey.It fascinates me how he manipulates everyone and everything with a blinding smile on his face.I got caught.Now he wants one thing. Me.CrowedShe wished for death. A killer showed up at her door.EloiseLife left me when my family died.I thought I wanted to die, too, until death comes knocking on my door.Only, instead of killing me, he breathes new life into me.For the first time in my existence, I'm scared. Because when that life is taken from me, I'll have nothing left.CrowI have one rule: leave no traces behind.She compromised my identity and needs to be eliminated.So simple, right?Not even close.When she welcomes death with open arms, I can't pull the trigger.Breaking my one rule would not only put my life in danger, but it would completely destroy hers.GhostedHe was born a weapon. She became one to destroy him.Dark. Dangerous. Deadly.Those facts should’ve kept me away from this underground world where people disappear and never return.They didn’t.His mistake: Taking Zoe, someone I consider a sister. I will stop at nothing to get her back. Even if it means infiltrating a notorious organised crime ring in search of the faceless ghost who plucked her away.My mistake: Not expecting him. Julian—the guard surrounded by a shroud of darkness and mystery. I'm helplessly and dangerously drawn to the man within. The more I get lost in him, the riskier my mission becomes.What if Julian is more than a mere guard?What if he’s related to this man called Ghost?Aside from the three already published books, the Boxed Set will contain:•\tSpecial Epilogues for every book.•\tNever seen before character charts.•\tTeam Zero's reading order.Each book can be read as a standalone. No cheating. All have their happy endings.",
  "genres": [
    "Collections",
    "Dark Romance"
  ],
  "author": "Rina Kent",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/53346834-team-zero-series-1-3-boxed-set"
}