{
  "title": "Dangerous Deceptions: Christian Romantic Suspense Novels",
  "description": "Lives...and hearts...are on the line in eight brand-new Christian Romantic Suspense novels from the genre’s most explosive authors.Lethal Outbreak: Lisa Harris & Lynne GentryVirus hunter Aiden Ballinger believes the source of the lethal outbreak that decimated a remote Tibetan village came from disturbing the permafrost. Desperate to rebury it before it buries the world, Aiden enlists Rachel Scott, a beautiful epidemiologist. But while Aiden and Rachel pursue the cure—and their feelings for each other—someone is hunting them. Whoever wants them dead will not stop until they are silenced.Collision Course: Elizabeth GoddardHis cover blown, FBI Special Agent Reg Jacobson finds refuge on the other side of the country, but trouble follows him when he faces off with a woman from his past. Private Investigator Nicole Weatherly, hired to catch a thief, suspects Reg. When the bullets fly, Reg and Nicole must escape secrets from their pasts before their futures collide.Glimmer in the Darkness: Robin PatchenWhen Cassidy learns another child has been kidnapped from her hometown, she's convinced the man who took the girl she’d been babysitting seven years earlier is behind the recent abductions. She alone holds the key to finding him. Though James blames Cassidy for his sister’s death, he’ll help if there’s a chance to save a child’s life. Can Cassidy and James identify the serial killer in time to rescue his latest victim?Expired Plot: Lisa PhillipsA man after justice. A local crime boss. The woman caught between. Undercover FBI agent Will Briar is working his way to the top of an illegal operation. But when he discovers the identity of the boss, everything changes. Hollis knows nothing is as it seems. Now she must either save her father and doom herself, or take a chance on the man who could be the answer…to everything.Ice: Lynnette BonnerCamryn Hunt witnessed a murder. Now she’s in the protective custody of handsome sheriff Holden Parker. The small-town life might be pleasant if the sheriff wasn’t so demanding. Determined that no harm come to Camryn, Holden secludes her at his fishing cabin. He wishes she wasn’t so intriguing. He must not divide his focus. Especially when a local busybody discovers Camryn!Never A Traitor: Jan ThompsonThe last thing Private Investigator Earl Young expects is to pose as a fake boyfriend to a whistleblower. His driving need to solve problems forces him to work with paranoid Sienna Halstead as she draws him deeper into her corporate world of secrets and subterfuge. The more time they spend together, the more attraction grows. When another whistleblower is murdered, Sienna knows she's next. How far will Earl go to protect her?Ben in Love: Luana EhrlichIs CIA operative Ben Mitchell really in love with the daughter of a Turkish dissident? Titus Ray, his mentor, isn’t buying it; he thinks Ben needs intel on a Muslim cleric. But when Titus follows Ben to northern Virginia, he discovers Ben’s deception is more dangerous than he thought. With their lives on the line, can Titus convince Ben to abandon his plans before it’s too late?Liar Like Her: D.L. WoodWhen disbarred attorney Quinn Bello discovers a body that inexplicably vanishes, no one in her seaside town believes her—no one, that is, except newcomer Ian Wolfe, who for his own mysterious reasons doesn’t hold Quinn’s past against her. Together they search for the truth, but doubts about Quinn’s sanity and innocence increase as the danger escalates. Will they expose the heart of the deception before Quinn becomes the next victim?",
  "genres": [
    "Christian Fiction",
    "Mystery Thriller",
    "Thriller",
    "Romantic Suspense",
    "Contemporary",
    "Christian",
    "Suspense"
  ],
  "author": "Lisa          Harris",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/53350098-dangerous-deceptions"
}