{
  "title": "Where There's Smoke",
  "description": "A picturesque mountain town, sparks of romance, a threatening mystery, and a secret society of devious women…“Wonderful characters, a real mix of women with varied strength and foibles” -Goodreads review 5 stars“I loved the first book in the Sugar Mountain series so I was really second to read the second installment and get back to investigating with the Sugar Mountain Ladies Historical Society” – Goodreads review 5 starsThe cozy community of Sugar Mountain, NC harbors an underground society of women. The society itself is not secret—it’s the actual mission of the group that is concealed.Sugar Mountain is a sleepy town bursting with tourists. If you like quirky shops and original artwork, you’ll want to visit. But the local kindergarten teacher, Sarah has a mystery on her hands. All she did was try to help the fire department and now she’s receiving threatening notes. Of course, she takes the frightening messages to her friends in the Sugar Mountain Ladies Historical Society, but even their investigative skills fall short. How will they be able to find the person intent on holding back the fire department and frightening Sarah? Hugh Brockman, the second in command at the firehouse, is taking extra shifts to cope with the shortage of firefighters. When he visits Sarah’s classroom to talk to her students about fire safety, he gets caught up with the lovely teacher and her cryptic mystery. He’s not happy that someone in town is threatening her with bodily harm, and he intends to find out who it is. With every lead shot down and tensions running high, it’s up to the ladies of the society to go undercover in their own town to flush out the culprit. If they’re not successful, the fire department will continue to be undermanned, leaving Sugar Mountain is in danger and Sarah in peril. Join in the continuing antics of the Sugar Mountain Ladies Historical Society and fall in love along with Hugh and Sarah in this heartfelt and comical romantic mystery.",
  "genres": [
    "Fiction",
    "Cozy Mystery",
    "Romance",
    "Contemporary",
    "Mystery"
  ],
  "author": "Kirsten Fullmer",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/53354670-where-there-s-smoke"
}