{
  "title": "How to Thrive in the 21st Century - By Avoiding Porn and Other Distractions",
  "description": "Most people aspire to achieve something deep down. For every porn video we watch, our chance of living our dreams is diminished. Porn use provides false positives. This affects willpower, discipline, motivation, courage, social skills – basically every attribute required to accomplish something. Did you know that watching porn will affect your neurotransmitters responsible for happiness, leaving you depressed and unhappy? If you squander hours looking for the perfect scene, years can go by, and you can find yourself being the same person 10 years later, missing out on life. Nobody told the author about the dangers of this when he was young. This book is written to be the resource we wish we had at age 15. With all the stimulation we regularly encounter through social media, the Internet, TV, commercials, porn, news and so on, we must regain control amidst the chaos. Porn affects us subtly and it can be difficult to notice the consequences. Many people don’t connect the dots between issues in their life and porn use. In this book, you will uncover how porn affects your life and why you should quit immediately! Havard Mela will show you how to take conscious control of your life! You will find a gripping tale based on personal experience and extensive research on the topic. Havard provides a blueprint for beating your unwanted habits. He'll show you, step by step, how to regain control of your focus and ultimately, your life. You will learn the reasons you are unable to regulate your porn use, along with actionable advice on how to quit. How to Thrive in the 21st Century talks about leaving porn from a psychological perspective. You will uncover and resolve deeply rooted psychological issues that give lasting results instead of finding tips and tricks that don't work. You will find a multidisciplinary approach about the topic that draws in the latest science from psychology, neuroscience, heuristics, willpower, self-control, philosophy, the science behind addiction, purpose, perspectives and much more.",
  "genres": [
    "Productivity",
    "Self Help",
    "Nonfiction",
    "Science",
    "Psychology",
    "Personal Development"
  ],
  "author": "Havard Mela",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/53363672-how-to-thrive-in-the-21st-century---by-avoiding-porn-and-other-distracti"
}