{
  "title": "Anatomy of a Massacre: The Destruction of Gnadenhutten, 1782",
  "description": "An Act of Unfathomable Cruelty that Presaged Post-Revolutionary America’s Treatment of Native Americans  On March 8, 1782, a group of western settlers killed nearly one hundred unarmed and peaceful Indians who had converted to Christianity under the tutelage of missionaries from the Church of the United Brethren. The murders were cold-blooded and heartless; roughly two-thirds of those executed were women and children. Its brutality stunned Benjamin Franklin in far-away France. He wrote: “the abominable Murders committed by some of the frontier People on the poor Moravian Indians, has given me infinite Pain and Vexation. The Dispensations of Providence in this World puzzle my weak Reason. I cannot comprehend why cruel Men should have been permitted thus to destroy their Fellow Creatures.” Since that maelstrom of violence struck the small Indian village of Gnadenhutten, history has treated the episode as a simple morality tale. While there were ample incidents of good and evil on March 8, that summation does not explain what brought murderers and victims together on the banks of the Muskingum River in today’s Ohio. It was actually the culmination of a series of events among different Indian tribes, the British, Congressional authorities at Pittsburgh, the Pennsylvania militia, and key individuals, all of which are lost in contemporary explanations of the massacre.     Gnadenhutten, 1782 fills that void by examining the political maneuvering among white settlers, Continental officials, British officers, western Indian tribes, missionaries, and the Indians practicing Christianity that culminated in the massacre. Uniquely, it follows the developing story from each perspective, using first-person accounts from each group to understand how they saw and experienced the changes on the American frontier. Along the way it profiles some of the key individuals responsible for the way the war unfolded. It is a fresh look at an often mentioned, but seldom understood, episode in the American Revolution.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Eric Sterner",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/53357947-anatomy-of-a-massacre"
}