{
  "title": "EXPONENTIAL PROGRESS: Mind-Bending Technologies to Evolve Over the Next Decade and Dominate the Century",
  "description": "Authored by London-based Researcher from Imperial, Exponential Progress takes readers on a journey through over seven decades of progress , as technology has shaped and controlled everything from banking and business to education, medicine, and the very basis of the human genome. It is a must read for anyone looking to learn about fascinating emerging technologies that will disrupt our lives over the next ten years. ★★★★★Humanity is progressing towards a world that will be dominated by the end-results the scientific inventions that will evolve over the next decade. Technological progress has accelerated over the past decade – it was slow and buggy at the beginning, but the rate of improvement is now exponential. The growth is accelerating faster than we could have ever imagined.From a business perspective, these ground-breaking technologies are expected to be the best investments for the next decade . That is why investors and entrepreneurs are tenacious to grow rapidly. But where did it all start? How far have we come in the past 70 years since we developed the first digital computer? Thousands of innovators are in the process of developing the building blocks of these technologies, that will radically grow over the next decade and potentially dominate the century. But now, civilisation has reached a point when this progress cannot be controlled. The author cuts to the core of what humanity has achieved since the invention of the digital computer, where the new jaw-dropping technological innovation will come from, and where the line is drawn between fact and fad. ★★ This nonfiction meticulously looks back at the history, analyse current progress and what the researchers have achieved until now. The author attempts to comprehend the need for advancement and in parallel, the potential over the next decade, and reflecting on the necessity of control. If you are interested in new technologies, this will be one of the best books to read. ◆◆ Prepared to be mind-blown with the ideas you are going to find.◆◆Farabi, the author of Exponential Progress , is the Head of Research at IntelXSys™ and working as one of the Research Experience Leads for Clinical Research and Innovation (CRI) module at the Imperial College London. He has worked with over 100 companies as a technology consultant and spoken at a number of international conferences around the world.",
  "genres": [],
  "author": "Farabi Shayor",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/53386495-exponential-progress"
}