{
  "title": "Seeing Ghosts: A Memoir",
  "description": "For readers of Helen Macdonald and Elizabeth Alexander, an intimate and haunting portrait of grief and the search for meaning from a singular new talent as told through the prism of three generations of her Chinese American family. Born two years after her parents' only son died just hours after his birth, Kat Chow became unusually fixated with death. She worried constantly about her parents dying -- especially her mother. One morning, when Kat was nine, her mother, a vivacious and mischievous woman, casually made a morbid joke: When she eventually dies, she said laughing, she'd like to be stuffed and displayed in Kat's future apartment in order to always watch over her.Four years later when her mother dies unexpectedly from cancer, Kat, her two older sisters, and their father are plunged into a debilitating, lonely grief. With a distinct voice that is wry and heartfelt, Kat weaves together what is part ghost story and part excavation of her family's history of loss spanning three generations and their immigration from China and Hong Kong to America and Cuba. This redemptive coming-of-age story uncovers the uncanny parallels in Kat's lineage, including the strength of sisterhood and the complicated duty of looking after parents, even after death.Seeing Ghosts asks what it means to claim and tell your family's story: Is writing an exorcism or is it its own form of preservation? What do we owe to our families in our grief, and how does it shape us? In order to answer these questions and to understand her family's ghosts, Kat unearths their sorrow and challenges the power structures of race, class, and gender. The result is an extraordinary new contribution to the literature of grief and the American family, and a provocative and transformative meditation on who we become under the specter of loss.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography Memoir",
    "Biography",
    "Grief",
    "Asian Literature"
  ],
  "author": "Kat Chow",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/53376379-seeing-ghosts"
}