{
  "title": "Pictures from Italy",
  "description": "A delightful travelogue in the unique style of one of the greatest writers in the English languageIn 1844, Charles Dickens took a break from novel writing to travel through Italy for almost a year and Pictures from Italy is an illuminating account of his experiences there. He presents the country like a magic-lantern show, as vivid images ceaselessly appear before his - and his readers' - eyes. Italy's most famous sights are all to be found here - St Peter's in Rome, Naples with Vesuvius smouldering in the background, the fairytale buildings and canals of Venice - but Dickens's chronicle is not simply that of a tourist. Avoiding preconceptions and stereotypes, he portrays a nation of great between grandiose buildings and squalid poverty, and between past and present, as he observes everyday life beside ancient monuments. Combining thrilling travelogue with piercing social commentary, Pictures from Italy is a revealing depiction of an exciting and disquieting journey. In her introduction, Kate Flint discusses nineteenth-century travel writing, and Dickens's ideas about perception, memory and Italian politics. This edition also includes a chronology, further reading, notes and an appendix. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
  "genres": [
    "Classics",
    "Travel",
    "Nonfiction",
    "Italy",
    "History",
    "Victorian",
    "British Literature"
  ],
  "author": "Charles Dickens",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/5340.Pictures_from_Italy"
}