{
  "title": "Smalltime: A Story of My Family and the Mob",
  "description": "Best-selling author Russell Shorto, praised for his incisive works of narrative history, never thought to write about his own past. He grew up knowing his grandfather and namesake was a small-town mob boss but maintained an unspoken family vow of silence. Then an elderly relative prodded: You’re a writer—what are you gonna do about the story?Smalltime is a mob story straight out of central casting—but with a difference, for the small-town mob, which stretched from Schenectady to Fresno, is a mostly unknown world. The location is the brawny postwar factory town of Johnstown, Pennsylvania. The setting is City Cigar, a storefront next to City Hall, behind which Russ and his brother-in-law, “Little Joe,” operate a gambling empire and effectively run the town.Smalltime is a riveting American immigrant story that travels back to Risorgimento Sicily, to the ancient, dusty, hill-town home of Antonino Sciotto, the author’s great-grandfather, who leaves his wife and children in grinding poverty for a new life—and wife—in a Pennsylvania mining town. It’s a tale of Italian Americans living in squalor and prejudice, and of the rise of Russ, who, like thousands of other young men, created a copy of the American establishment that excluded him. Smalltime draws an intimate portrait of a mobster and his wife, sudden riches, and the toll a lawless life takes on one family.But Smalltime is something more. The author enlists his ailing father—Tony, the mobster’s son—as his partner in the search for their troubled patriarch. As secrets are revealed and Tony’s health deteriorates, the book become an urgent and intimate exploration of three generations of the American immigrant experience. Moving, wryly funny, and richly detailed, Smalltime is an irresistible memoir by a masterful writer of historical narrative.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "True Crime",
    "Biography",
    "History",
    "Crime",
    "Biography Memoir"
  ],
  "author": "Russell Shorto",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/53404754-smalltime"
}