{
  "title": "If the Boot Fits",
  "description": "A Bustle Best Books of Fall 2020 SelectionAn Amazon Best of the Month SelectionA Library Journal Best Book of 2020An Apple Books Best of the Month SelectionA Best Book of Fall 2020 by NPR’s Boston AffiliateA Bookish Most Anticipated Books Selection“An adorable retelling, engaging and character-rich...this kind of mutual empowering is one of Weatherspoon’s hallmarks.” –The New York Times“Heart-melting…a perfect fit for fans of contemporary romance authors Jasmine Guillory and Alexa Martin.”—Booklist From award-winning author Rebekah Weatherspoon comes a thoroughly modern take on the timeless tale of a struggling Cinderella who finds her prince charming at the eleventh hour—and the adventure that ensues the morning after . . . Working as the personal assistant to one of Hollywood’s cruelest divas has left Amanda Queen more determined than ever to sell her screenplay and gain her independence. In the meantime, she’ll settle for a temporary escape. When her employer is felled by the flu on Hollywood’s biggest night of the year, Amanda gets her glam on, struts out the door, and parties with the glitterati. But she never expects to come face to face—and closer than close—with one of the hottest stars in the game . . . Following up his first Oscar win with a steamy after-hours romp with an enigmatic woman seems like the perfect way for actor Sam Pleasant to celebrate—until she suddenly disappears. Worse, she’s vanished with the wrong swag bag: the one containing his Oscar statue, leaving Sam even more intrigued about the beauty’s identity—and wondering if a repeat performance of their amazing night is in the stars. And when a second chance encounter happens, only a trip to Sam’s family ranch—and revealing the whole, not-always-glamorous, truth about themselves—will give them a chance to turn one magical night into forever . . . “Wonderfully inventive…Uniting a heart-stopping hero and a plus-size heroine who knows her own worth, this steamy fairy tale shines.”—Publishers Weekly STARRED REVIEW “One of romance’s brightest stars…[this is] a thoroughly modern Cinderella story.”—Bookpage, Starred Review “Another winner from rising star Weatherspoon.”—Library Journal, Starred Review",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Adult",
    "Audiobook",
    "Westerns"
  ],
  "author": "Rebekah Weatherspoon",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/53410379-if-the-boot-fits"
}