{
  "title": "Covered with Night: A Story of Murder and Indigenous Justice in Early America",
  "description": "On the eve of a major treaty conference between Iroquois leaders and European colonists in the distant summer of 1722, two white fur traders attacked an Indigenous hunter and left him for dead near Conestoga, Pennsylvania. Though virtually forgotten today, this act of brutality set into motion a remarkable series of criminal investigations and cross-cultural negotiations that challenged the definition of justice in early America.In Covered with Night, leading historian Nicole Eustace reconstructs the crime and its aftermath, bringing us into the overlapping worlds of white colonists and Indigenous peoples in this formative period. As she shows, the murder of the Indigenous man set the entire mid-Atlantic on edge, with many believing war was imminent. Isolated killings often flared into colonial wars in North America, and colonists now anticipated a vengeful Indigenous uprising. Frantic efforts to resolve the case ignited a dramatic, far-reaching debate between Native American forms of justice—centered on community, forgiveness, and reparations—and an ideology of harsh reprisal, unique to the colonies and based on British law, which called for the killers’ swift execution.In charting the far-reaching ramifications of the murder, Covered with Night—a phrase from Iroquois mourning practices—overturns persistent assumptions about “civilized” Europeans and “savage” Native Americans. As Eustace powerfully contends, the colonial obsession with “civility” belied the reality that the Iroquois, far from being the barbarians of the white imagination, acted under a mantle of sophistication and humanity as they tried to make the land- and power-hungry colonials understand their ways. In truth, Eustace reveals, the Iroquois—the Six Nations of the Haudenosaunee, as they are known today—saw the killing as an opportunity to forge stronger bonds with the colonists. They argued for restorative justice and for reconciliation between the two sides, even as they mourned the deceased.An absorbing chronicle built around an extraordinary group of characters—from the slain man’s resilient widow to the Indigenous diplomat known as “Captain Civility” to the scheming governor of Pennsylvania—Covered with Night transforms a single event into an unforgettable portrait of early America. A necessary work of historical reclamation, it ultimately revives a lost vision of crime and punishment that reverberates down into our own time.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Indigenous",
    "American History",
    "Native American",
    "Crime"
  ],
  "author": "Nicole Eustace",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/53404235-covered-with-night"
}