{
  "title": "The Children's Blizzard",
  "description": "The New York Times bestselling author of The Aviator's Wife reveals a little-known story of courage on the prairie: the freak blizzard that struck the Great Plains, threatening the lives of hundreds of immigrant homesteaders--especially their children.The morning of January 12, 1888, was unusually mild, following a long cold spell, warm enough for the homesteaders of the Dakota territory to venture out again, and for their children to return to school without their heavy coats--leaving them unprepared when disaster struck. At just the hour when most prairie schools were letting out for the day, a terrifying, fast-moving blizzard struck without warning. Schoolteachers as young as sixteen were suddenly faced with life and death decisions: keep the children inside, to risk freezing to death when fuel ran out, or send them home, praying they wouldn't get lost in the storm?Based on actual oral histories of survivors, the novel follows the stories of Raina and Gerda Olsen, two sisters, both schoolteachers--one who becomes a hero of the storm, and one who finds herself ostracized in the aftermath. It's also the story of Anette Pedersen, a servant girl whose miraculous survival serves as a turning point in her life and touches the heart of Gavin Woodson, a newspaperman seeking redemption. It is Woodson and others like him who wrote the embellished news stories that lured immigrants across the sea to settle a pitiless land. Boosters needed immigrants to settle territories into states, and they didn't care what lies they told them to get them there--or whose land it originally was.At its heart, this is a story of courage, of children forced to grow up too soon, tied to the land because of their parents' choices. It is a story of love taking root in the hard prairie ground, and of families being torn asunder by a ferocious storm that is little remembered today--because so many of its victims were immigrants to this country.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "Audiobook",
    "Survival",
    "Adult"
  ],
  "author": "Melanie Benjamin",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/53425138-the-children-s-blizzard"
}