{
  "title": "The Christina Lauren Getaway Collection: The Unhoneymooners, Twice in a Blue Moon, The Honey-Don't List",
  "description": "Celebrate the best of New York Times bestselling author Christina Lauren with this boxed set featuring the “joyful, warm, touching” (Jasmine Guillory, New York Times bestselling author) The Unhoneymooners , the “emotional, sweet, and surprising” (Shondaland) Twice in a Blue Moon , and the “touching romantic comedy” ( Shelf Awareness ) The Honey-Don’t List .In The Unhoneymooners , unlucky twin Olive Torres is not looking forward to her lucky sister’s glamorous wedding. She’s especially dreading being forced to spend the day with the best man (and her nemesis), Ethan Thomas. But when the entire wedding party gets food poisoning—except for Olive and Ethan—her sister’s free Hawaiian honeymoon is up for grabs. Agreeing to a temporary truce, Olive and Ethan head to Maui pretending to be newlyweds…but soon realize that pretending isn’t so hard, after all.In Twice in a Blue Moon , Tate Jones confesses her deepest secret—that she is the hidden child of a famous movie star—to her first love Sam Brandis. But when it becomes clear that her trust was misplaced, her world is shattered. Fourteen years later, Tate, now an up-and-coming actress, walks onto the set of her first big film and is shocked to find Sam there as well. Forced to confront the man who betrayed her, Tate wonders if “once in a lifetime” can come around twice.The Honey-Don’t List follows Carey Duncan—assistant to home remodeling gurus Melissa and Rusty Tripp—as she helps bring her bosses to superstardom with a new TV show and book. The only America’s favorite couple despises each other. Meanwhile, James McCann, recently hired as an engineer for the Tripps, is trapped in a job he hates. Neither Carey nor James can afford to quit, so they agree to work together and keep their bosses’ secret for at least a few more weeks. But if they stop playing along—and start playing for keeps—they may have the chance to build something beautiful together.Charming, witty, and full of heart, this boxed set proves once again that “you can never go wrong with a Christina Lauren novel” ( Entertainment Weekly ).",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Chick Lit"
  ],
  "author": "Christina Lauren",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/53428291-the-christina-lauren-getaway-collection"
}