{
  "title": "The Loss of Sadness: How Psychiatry Transformed Normal Sorrow Into Depressive Disorder",
  "description": "Depression has become the single most commonly treated mental disorder, amid claims that one out of ten Americans suffer from this disorder every year and 25% succumb at some point in their lives. Warnings that depressive disorder is a leading cause of worldwide disability have been accompanied by a massive upsurge in the consumption of antidepressant medication, widespread screening for depression in clinics and schools, and a push to diagnose depression early, on the basis of just a few symptoms, in order to prevent more severe conditions from developing.In The Loss of Sadness, Allan V. Horwitz and Jerome C. Wakefield argue that, while depressive disorder certainly exists and can be a devastating condition warranting medical attention, the apparent epidemic in fact reflects the way the psychiatric profession has understood and reclassified normal human sadness as largely an abnormal experience. With the 1980 publication of the landmark third edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM-III), mental health professionals began diagnosing depression based on symptoms—such as depressed mood, loss of appetite, and fatigue—that lasted for at least two weeks. This system is fundamentally flawed, the authors maintain, because it fails to take into account the context in which the symptoms occur. They stress the importance of distinguishing between abnormal reactions due to internal dysfunction and normal sadness brought on by external circumstances. Under the current DSM classification system, however, this distinction is impossible to make, so the expected emotional distress caused by upsetting events—for example, the loss of a job or the end of a relationship—could lead to a mistaken diagnosis of depressive disorder. Indeed, it is this very mistake that lies at the root of the presumed epidemic of major depression in our midst.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Psychiatry",
    "Science",
    "Medicine",
    "Sociology"
  ],
  "author": "Allan V. Horwitz",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/534209.The_Loss_of_Sadness"
}