{
  "title": "K-The ultimate truth",
  "description": "कहानी की शुरुआत वहीँ से होती है जहाँ पिछली महागाथा 'K-The last warrior' का अंत हुआ था। क्या कली के अंत के बाद इस अनंत ब्रह्माण्ड के सभी रहस्यों के ऊपर से पर्दा हट चुका था….क्या हम ब्रह्माण्ड के सभी राज़ जान गए थे…क्या ब्रह्माण्ड का पूरा सच वो ही था जो हमारे सामने आया था या अभी भी कुछ ऐसे रहस्य थे जिनसे हम अब तक अनजान थे। क्या कलि के अंत के बाद ब्रह्माण्ड के ऊपर से ख़तरा ख़त्म हो गया था या उससे भी भयानक आपदा ब्रह्माण्ड के सामने आने वाली थी। क्या फिर से इस सृष्टि को एक महायोद्धा की ज़रुरत पड़ने वाली थी…..क्या कलियुग के बाद सच में सत्ययुग का प्रारम्भ हो गया था या यह एक बहुत बड़ा भ्रम था। क्या सच में कहानी के अंत में सब कुछ ठीक हो जाता है, क्या इस महागाथा के अंत में सब कुछ ठीक हो चुका था या दुनिया को एक बहुत बड़ा धोका मिला था। यह कहानी ऐसे ही कुछ सवालों का जवाब ढूंढ़ती है।कहानी की शुरुआत वर्ष 2022 में होती है जहाँ शिवाय की बहन मोनिका अपने आप को कल्पना और सच के भंवर में उलझा हुआ पाती है। मोनिका एक ऐसी बिमारी का शिकार है जिसमे वो कल्पना और सच के बीच का अंतर नहीं कर पाती, डॉक्टरों के अनुसार अपने भाई शिवाय की मौत के सदमें को मोनिका सह नहीं पाई, और उसने शिवाय की कहानियों को सच मान कर अपने इर्दगिर्द उन्हीं कल्पनाओं का माया जाल बुन लिया, उसने अपने दिमाग में ऐसी दुनिया की रचना कर ली जहाँ उसका भाई मौत के मुंह से एक महायोधा बन के वापिस लौटता है और भगवान् विष्णु अवतार ‘कल्कि’ के रूप में ब्रह्माण्ड की रक्षा करता है। क्या पिछली महागाथा सिर्फ मोनिका की कल्पना मात्र थी या इस सबके पीछे भी कोई गहरा रहस्य छिपा था……क्या सच में किसी कल्कि ने इस सृष्टि की रक्षा की थी या वो मोनिका की कल्पनाओं का ही एक माया जाल था....क्या मोनिका की कल्पना सच बन के दुनिया के सामने आएगी.....क्या एक बार फिर सच में वापिस लौटेगा K-The last warrior......एक बार फिर तैयार हो जाईये ब्रह्माण्ड के कुछ और अनसुलझे रहस्यों को जानने के लिए.....इस बार 'K' लौटा है 'भगवान् और ब्रह्माण्ड की रचना' के अनंत चक्र का रहस्य उजागर करने…. 'K-The ultimate truth' में…..",
  "genres": [],
  "author": "Tarun Jolly",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/53427168-k-the-ultimate-truth"
}