{
  "title": "Love Him Breathless",
  "description": "Born and raised in Cherry Creek, Edmund Fitzgerald was the sort of man who tried to find the good in all things. As a natural leader, Fitz reclaimed his trauma after half his body burned in a fire and worked his way up to Fire Chief at the local department. He had a good home, and good friends, even if his romantic life left something to be desired. In spite of his bad luck in love, he managed to keep a cheerful smile on for everyone. At least, until Antoine Tremblay crashed into town.Literally.As the older twin with absent parents and a chip on his shoulder, Antoine and his brother grew up nomadic—the inconvenient offspring of traveling teachers who wanted nothing more than to spend their lives seeing the world. While his friends were dreaming of road trips, Antoine was dreaming of a home to call his own. Retreating into his consulting career, Antoine dedicates his life to stabilizing small town economies, and doesn’t hesitate to take a job in Cherry Creek—a town that makes it very clear it doesn’t want Antoine there. Before he even crosses the city limits, Antoine is run off the road by a wild goat, and he’s forced to accept a rescue by a wary man who makes it very clear that Antoine’s presence in Cherry Creek is not welcome.And what’s worse, the ridiculously attractive, absolutely infuriating Fire Chief seems to be at the center of every single one of his disasters that happens after—and unfortunately there are many. All Antoine wants is to do his job and go home, but Cherry Creek seems to have it in for him, and Edmund Fitzgerald seems thrilled to watch him fall apart. It might be real hatred, or it might just be pigtail pulling, but Antoine isn’t sure which, and he’s not really sure he wants to know. After all, a place like Cherry Creek will never be his home.Fitz has never found someone worth fighting for, and Antoine has never found a reason to stay, but they know that looking at each other leaves them absolutely breathless. Will that be enough to make a relationship work, or will they decide that their love isn’t worth the fight?Love Him Breathless is the second book in the series On The Market. It contains no cheating and a happily ever after.The series, On The Market, has become Running in Circles, and this novel was retitled Light My Fire. It has been completely revamped and re-written with names, places, characters, and major plot points changed.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Audiobook",
    "Disability",
    "LGBT"
  ],
  "author": "E.M. Lindsey",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/53446507-love-him-breathless"
}