{
  "title": "Master of the Revels",
  "description": "In this brilliant sequel to The Rise and Fall of D.O.D.O.—an enthralling, history-bending adventure traversing time and space, fact and fiction, magic and science co-written with #1 New York Times bestselling author Neal Stephenson—a daring young time traveler must return to Jacobean England to save the modern world.This fast-paced sequel to the New York Times bestselling near-future adventure The Rise and Fall of D.O.D.O. picks up where the original left off, as Tristan Lyons, Mel Stokes, and their fellow outcasts from the Department of Diachronic Operations (D.O.D.O.) fight to stop the powerful Irish witch Gráinne from using time travel to reverse the evolution of all modern technology. Chief amongst Gráinne’s plots: to encrypt cataclysmic spells into Shakespeare’s “cursed” play, Macbeth. When her fellow rogue agents fall victim to Gráinne’s schemes, Melisande Stokes is forced to send Tristan’s untested, wayward sister Robin back in time to 1606 London, where Edmund Tilney, the king’s Master of Revels, controls all staged performances in London.And now Gráinne controls Tilney. While Robin poses as an apprentice in Shakespeare’s Globe Theatre, Mel travels to the ancient Roman Empire and, with the help of double-agent Chira in Renaissance Florence, untangles the knotted threads of history while the diabolical Gráinne jumps from timeline to timeline, always staying frustratingly one stop ahead—or is it behind?Historical objects disappear, cities literally rise and fall, and nothing less than the fate of humanity is at stake. As Gráinne sows chaos across time and space, the ragtag team of ex-D.O.D.O. agents must fix the past—in order to save the future.Critically acclaimed author Nicole Galland brings her deep knowledge of history and signature wit to this gripping romantic adventure.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Magic"
  ],
  "author": "Nicole Galland",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/53441123-master-of-the-revels"
}