{
  "title": "His Truth Is Marching On: John Lewis and the Power of Hope",
  "description": "An intimate and inspiring portrait of civil rights icon and longtime U.S. congressman John Lewis, linking his life to the quest for justice in America from the 1950s to the present--from the Pulitzer Prize-winning author of The Soul of America John Lewis, who at age twenty-five marched in Selma, Alabama, and was beaten on the Edmund Pettus Bridge, is a visionary and a man of faith. Drawing on decades of wide-ranging interviews with Lewis and deep research into the history of the civil rights movement, Jon Meacham writes of how this great-grandson of a slave and a son of an Alabama tenant farmer was inspired by the Bible and his teachers in nonviolence, Reverend James Lawson and Martin Luther King, Jr., to put his life on the line in the service of what Abraham Lincoln called \"the better angels of our nature.\" A believer in hope above all else, Lewis learned from a young age that nonviolence was not only a tactic but a philosophy, a biblical imperative, and a transforming reality. At the age of four, Lewis, ambitious to become a minister, practiced by preaching to his family's chickens. When his mother cooked one of the chickens, the boy refused to eat it--his first act, he wryly recalled, of nonviolent protest. Integral to Lewis's commitment to bettering the nation was his faith in humanity and in God--and an unshakable belief in the power of hope.Meacham calls Lewis \"as important to the founding of a modern and multiethnic twentieth- and twenty-first-century America as Thomas Jefferson and James Madison and Samuel Adams were to the initial creation of the nation-state in the eighteenth century. He did what he did--risking limb and life to bear witness for the powerless in the face of the powerful--not in spite of America, but because of America, and not in spite of religion, but because of religion.\" In many ways Lewis made his vision a reality, and his example offers Americans today a map for social and political change.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "Race",
    "Biography Memoir",
    "American History"
  ],
  "author": "Jon Meacham",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/53431510-his-truth-is-marching-on"
}