{
  "title": "Let Me Be Frank: A Book About Women Who Dressed Like Men to Do Shit They Weren't Supposed to Do",
  "description": "In this entertaining and eye-opening collection, writer, actor, and feminist Tracy Dawson showcases trailblazers throughout history who disguised themselves as men and continuously broke the rules to gain access and opportunities denied them because they were women.“This book will surprise, astonish, and hopefully anger you on the lengths women have had to go to pursue their dreams. Tracy has such a gift for storytelling and making history leap off the page. Her book has a wit that suggests it was written by a man since everyone knows women aren't this funny.”—Kay Cannon, writer, producer, director (Pitch Perfect, Cinderella)“A smart, funny journey through history that introduces us to the rule breakers who made history worth traveling through.”—Patton Oswalt“I came up with Tracy as a fellow sketch comedian on the vomit-soaked stages of the Toronto comedy scene. And like the brilliant, resourceful, rule-breaking, damn-well-stubborn sisters in Let Me Be Frank, Tracy is someone who gets the job done, and gets it done well.”—Samantha Bee \"This spirited feminist history entertains and enlightens.\"—Publishers WeeklyLet Me Be Frank illuminates with a wry warmth the incredible stories of a diverse group of women from different ethnicities and cultural backgrounds who have defied the patriarchy, refusing to allow men or the status quo to define their lives or break their spirit. An often sardonic and thoroughly impassioned homage to female ingenuity and tenacity, the women profiled in this inspiring anthology broke the rules to reach their goals and refused to take “no” for an answer. These women took matters into their own hands, dressing—sometimes literally, sometimes figuratively—as men to do what they wanted to do. This includes competing in marathons, publishing books, escaping enslavement, practicing medicine, tunneling deep in the earth as miners, taking to the seas as pirates and serving on the frontlines in the military, among many other pursuits. Not only did these women persist, many unknowingly made history and ultimately inspired later generations in doing so. This compendium is an informative and enthralling celebration of these revolutionary badasses who have changed the world and our lives.Let Me Be Frank is filled with more than two dozen specially commissioned, full-color illustrations and hand-lettering by artist Tina Berning, whose multi-award-winning work has been published in numerous publications and anthologies worldwide, and is designed by Alex Kalman.WOMEN PROFILED INCLUDE: Jeanne Baret * Anne Bonny and Mary Read * Christian Caddell * Ellen Craft * Catalina De Erauso * Louise Augustine Gleizes * Hatshepsut * Annie Hindle and Florence Hines* Pili Hussein * Joan of Arc * Rena “Rusty” Kanokogi * Margaret King * Dorothy Lawrence * Tarpé Mills * Hannah Snell * Kathrine Switzer * Maria Toorpakai * Dr. Mary Edwards Walker * Cathay Williams",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Biography",
    "LGBT",
    "Audiobook",
    "Historical"
  ],
  "author": "Tracy  Dawson",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/53440837-let-me-be-frank"
}