{
  "title": "The New Climate War: The Fight to Take Back Our Planet",
  "description": "A renowned climate scientist shows how fossil fuel companies have waged a thirty-year campaign to deflect blame and responsibility and delay action on climate change, and offers a battle plan for how we can save the planet. Recycle. Fly less. Eat less meat. These are some of the ways that we've been told can slow climate change. But the inordinate emphasis on individual behavior is the result of a marketing campaign that has succeeded in placing the responsibility for fixing climate change squarely on the shoulders of individuals.Fossil fuel companies have followed the example of other industries deflecting blame (think \"guns don't kill people, people kill people\") or greenwashing (think of the beverage industry's \"Crying Indian\" commercials of the 1970s). Meanwhile, they've blocked efforts to regulate or price carbon emissions, run PR campaigns aimed at discrediting viable alternatives, and have abdicated their responsibility in fixing the problem they've created. The result has been disastrous for our planet.In The New Climate War, Mann argues that all is not lost. He draws the battle lines between the people and the polluters-fossil fuel companies, right-wing plutocrats, and petrostates. And he outlines a plan for forcing our governments and corporations to wake up and make real change, including:A common-sense, attainable approach to carbon pricing- and a revision of the well-intentioned but flawed currently proposed version of the Green New Deal;Allowing renewable energy to compete fairly against fossil fuelsDebunking the false narratives and arguments that have worked their way into the climate debate and driven a wedge between even those who support climate change solutionsCombatting climate doomism and despair-mongeringWith immensely powerful vested interests aligned in defense of the fossil fuel status quo, the societal tipping point won't happen without the active participation of citizens everywhere aiding in the collective push forward. This book will reach, inform, and enable citizens everywhere to join this battle for our planet.",
  "genres": [
    "Nonfiction",
    "Science",
    "Climate Change",
    "Environment",
    "Politics",
    "Sustainability",
    "Nature"
  ],
  "author": "Michael E.  Mann",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/53441709-the-new-climate-war"
}