{
  "title": "He Owns My Heart",
  "description": "Only true love can free a captive heart.\nLandon Jenks, retired four-time Golden Glove-winning shortstop for the Chicago Cubs, is lonely, heartbroken, and in need of simple human contact. Trapped in the sticky fine print of an ironclad contract that forbids him from revealing his very-much-single status until the season finale of his reality show airs, he calls an elite male escort service that caters to the rich and desperate.Accustomed to servicing his often less than savory clients at more upscale locales, twenty-six-year-old Toby Carmichael is surprised when his handler sends him to a run-down motel off I-55. But “surprise” doesn’t come close to describing the shock that rocks his system when a delightful stuttering mess covered in tattoos and nearly ten years his senior stumbles into the room—and right into his heart.For the first time since Toby was forced into the life of prostitution, a kiss sparks a desire that has nothing to do with money and everything to do with genuine chemistry and the faintest beginnings of something so much more. But Toby’s dark past and troubled present make it impossible to see a future with Landon. And when the truth comes to light, a horrified and helpless Landon is determined to save Toby at all costs.Content Warnings: Some content in He Owns My Heart may be triggering for some readers, due to the depiction of traumatic topics or other subjects or themes that may be difficult to read. Content warnings include the following:•\tA main character with childhood history of physical and verbal abuse by a parental figure—discussed by character as an adult, nothing depicted on page.•\tHomophobia from a close family member of a main character.•\tDiscussion of previous self-harm/cutting behaviors by an adult survivor—presence of physical scars and mental ramifications discussed.•\tA main character involved in prostitution with dub-con/non-con aspects—all interactions between the main characters contain full consent and there are no graphic on-page depictions. More graphic experiences are alluded to via inner monologue narrative.•\tA main character involved as a victim in human trafficking associated with the illegal drug trade.•\tConsensual Domination/submission relationship between the main characters—including light bondage, tease and denial, edging, the use of toys, and mild pain play (i.e. slapping and predicament bondage).•\tDepiction of moderate on-page violence between main characters and antagonists—no blood depicted.•\tDepiction of stalking activities by an ex-partner of a main character.•\tConsumption of alcohol by main characters and side characters.•\tGraphic portrayals of consensual penetrative cis male/cis male sex with condom usage. Oral sex scenes without use of condom shown with first instance occurring prior to reader’s knowledge of previous health check by both parties with both parties fully aware of the other’s health status before oral sex occurred.As always, if any of these topics could potentially impact your mental health or wellbeing, please consider skipping this read. Your emotional and mental safety are always the top priority.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "LGBT",
    "Erotic Romance"
  ],
  "author": "Evie Drae",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/53441013-he-owns-my-heart"
}