{
  "title": "The Removed",
  "description": "Steeped in Cherokee myths and history, a novel about a fractured family reckoning with the tragic death of their son long ago—from National Book Award finalist Brandon HobsonIn the fifteen years since their teenage son, Ray-Ray, was killed in a police shooting, the Echota family has been suspended in private grief. The mother, Maria, increasingly struggles to manage the onset of Alzheimer’s in her husband, Ernest. Their adult daughter, Sonja, leads a life of solitude, punctuated only by spells of dizzying romantic obsession. And their son, Edgar, fled home long ago, turning to drugs to mute his feelings of alienation.With the family’s annual bonfire approaching—an occasion marking both the Cherokee National Holiday and Ray-Ray’s death, and a rare moment in which they openly talk about his memory—Maria attempts to call the family together from their physical and emotional distances once more. But as the bonfire draws near, each of them feels a strange blurring of the boundary between normal life and the spirit world. Maria and Ernest take in a foster child who seems to almost miraculously keep Ernest’s mental fog at bay. Sonja becomes dangerously fixated on a man named Vin, despite—or perhaps because of—his ties to tragedy in her lifetime and lifetimes before. And in the wake of a suicide attempt, Edgar finds himself in the mysterious Darkening Land: a place between the living and the dead, where old atrocities echo.Drawing deeply on Cherokee folklore, The Removed seamlessly blends the real and spiritual to excavate the deep reverberations of trauma—a meditation on family, grief, home, and the power of stories on both a personal and ancestral level.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Indigenous",
    "Magical Realism",
    "Fantasy",
    "Literary Fiction",
    "Native American"
  ],
  "author": "Brandon Hobson",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/53441181-the-removed"
}