{
  "title": "Live Not by Lies: A Manual for Christian Dissidents",
  "description": "The New York Times bestselling author of The Benedict Option draws on the wisdom of Christian survivors of Soviet persecution to warn American Christians of approaching dangers.For years, émigrés from the former Soviet bloc have been telling Rod Dreher they see telltale signs of \"soft\" totalitarianism cropping up in America—something more Brave New World than Nineteen Eighty-Four. Identity politics are beginning to encroach on every aspect of life. Civil liberties are increasingly seen as a threat to \"safety\". Progressives marginalize conservative, traditional Christians, and other dissenters. Technology and consumerism hasten the possibility of a corporate surveillance state. And the pandemic, having put millions out of work, leaves our country especially vulnerable to demagogic manipulation.In Live Not By Lies, Dreher amplifies the alarm sounded by the brave men and women who fought totalitarianism. He explains how the totalitarianism facing us today is based less on overt violence and more on psychological manipulation. He tells the stories of modern-day dissidents--clergy, laity, martyrs, and confessors from the Soviet Union and the captive nations of Europe--who offer practical advice for how to identify and resist totalitarianism in our time. Following the model offered by a prophetic World War II-era pastor who prepared believers in his Eastern European to endure the coming of communism, Live Not By Lies teaches American Christians a method for resistance:  - SEE: Acknowledge the reality of the situation. - JUDGE: Assess reality in the light of what we as Christians know to be true. - ACT: Take action to protect truth.Aleksandr Solzhenitsyn famously said that one of the biggest mistakes people make is assuming totalitarianism can't happen in their country. Many American Christians are making that mistake today, sleepwalking through the erosion of our freedoms. Live Not By Lies will wake them and equip them for the long resistance.",
  "genres": [
    "Nonfiction",
    "Christian",
    "Politics",
    "History",
    "Christianity",
    "Christian Living",
    "Cultural"
  ],
  "author": "Rod Dreher",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/53438190-live-not-by-lies"
}