{
  "title": "Apollo's Song",
  "description": "Better to have loved and lost...The gods with their poetic justice, can be unrelenting. Just ask the young cynic Shogo, who sinned against love. Electroshock therapy was only meant to bring him face to face with his own violent misdeeds, but instead landed him in the court of a stern goddess. If the encounter was a hallucination, then it's a hallucination that starts to encroach on reality in this unforgettable tale penned by manga-god Osamu Tezuka and inspired by Greek myths of divine unforgiving. Sharing with his longer work Phoenix the themes of recurrence and retribution as well as the spirit of high invention, Apollo's Song explores the meaning of love and the consequences of its absence. Shogo's mother is a bar hostess, his father could be any one of a dozen of her regular patrons. Growing up, he learns nothing of genuine love and tenderness, and when he witnesses his mother in the nearest approximation of which she's capable--lustful embrace--he receives a merciless beating soon afterwards. Shogo comes to hate the very notion of love. But goddesses, who are neither the Buddha nor Christ, do not excuse misfortunes of upbringing. Apollo's Song reaches Olympian heights of tragedy as the story proceeds from a boxcar bound for a Nazi concentration camp to a dystopian future where human beings are persecuted by an ascendant race of their own clones. Will Shogo ever attain redemption, or, like the human race itself, will he have to relearn the lessons of love forever? Is it better to have loved and lost if the heartbreak must recur eternally?Love, propagation, nature, war, death--Tezuka holds his trademark cornucopia of concerns together with striking characterizations, an unfailing sense of pacing, and of course, stunning imagery. Though marked by a salty pessimism, this unique masterpiece from Tezuka's transitional period is also unabashedly romantic--and, at times, profoundly erotic. Combining a classic tale of thwarted love with cognitive ambiguities reminiscent of the work of Philip K. Dick, Apollo's Song is guaranteed to plumb new depths of the human heart with each rereading.",
  "genres": [
    "Manga",
    "Graphic Novels",
    "Fiction",
    "Fantasy",
    "Romance",
    "Japan",
    "Science Fiction"
  ],
  "author": "Osamu Tezuka",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/534308.Apollo_s_Song"
}