{
  "title": "Money Game: A Wealth Manifestation Guide. Level Up Your Mindset Step-By-Step & Create An Abundant Life",
  "description": "The Money Game eBook: A Wealth Manifestation Guide. Level Up Your Mindset Step-By-Step & Create An Abundant LifeDon't let your limiting beliefs and stories around wealth & abundance hold you back any more! Start manifesting money or any form of abundance today, regardless of your current status or intended goal. The Money Game eBook uses the proven strategy of Micro-Shifting to create alignment between the power of your subconscious and your dream life.This easy to follow guide from best selling author, life coach and inspirational speaker Dan Mangena; will help create and lock in the foundational principals of your own wealth manifestation. Starting small and making advances that are within the parameters of your belief system, we will anchor in your ability to manifest infinite wealth.•A simple & straight forward guide, helping you to lock in each level as you go for a strong foundation.•Easy & quick exercises that fit around your lifestyle & schedule, helping you make the most of your time.•Broken down into bite-sized stages that will reveal your 'edge' & then expand it in confidence building baby steps.•No confusing language or time pressures that create frustration or make you feel stupid. This is about removing resistance, not introducing more through shame.•Learn to clear mental & emotional blocks that are holding you back, through practicing gratitude & seeing evidence that what you want is possible.•Step into a whole new level of possibility and create true alignment with the life that you have always wanted.About the author: Daniel Mangena is a best-selling author, life coach and inspirational speaker. Like you, he has faced adversity and set backs in his journey to success and abundance. Through his extensive experience of business and studying with the very best mentors, he has created his own unique programs and workbooks. Every single one he has put in to practice, perfected and proven extensively, ensuring that you get the very best coaching that works.",
  "genres": [
    "Nonfiction",
    "Book Club",
    "Inspirational",
    "How To",
    "Education",
    "Finance",
    "Self Help"
  ],
  "author": "Daniel Mangena",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/53436164-money-game"
}