{
  "title": "The Oleander Sword",
  "description": "\"Alluring, action-packed, and gut-wrenching,\" (Publishers Weekly, starred review), The Oleander Sword continues Tasha Suri's acclaimed Burning Kingdoms trilogy,in which a powerful priestess and a vengeful princess will change the fate of an empire. **The prophecy of the nameless god—the words that declared Malini the rightful empress of Parijatdvipa—has proven a blessing and curse. She is determined to claim the throne that fate offered her. But even with the strength of the rage in her heart and the army of loyal men by her side, deposing her brother is going to be a brutal and bloody fight.The power of the deathless waters flows through Priya’s blood. Thrice born priestess, Elder of Ahiranya, Priya’s dream is to see her country rid of the rot that plagues both Parijatdvipa's poisonous rule, and the blooming sickness that is slowly spreading through all living things. But she doesn’t yet understand the truth of the magic she carries.Their chosen paths once pulled them apart. But Malini and Priya's souls remain as entwined as their destinies. And they soon realize that coming together is the only way to save their kingdom from those who would rather see it burn—even if it will cost them.Praise for the Burning Kingdoms \"Will undoubtedly reshape the landscape of epic fantasy for years to come.\"—Booklist (starred review)\"Lush and stunning…this sapphic fantasy will rip your heart out.\" —BuzzFeed News\"Raises the bar for what epic fantasy should be.\" —Chloe Gong, author of These Violent Delights\"This cutthroat and sapphic novel will grip you until the very end.\" —Vulture (Best of the Year)\"It left me breathless.\" —Andrea Stewart, author of The Bone Shard Daughter\"I loved it.\" —Alix E. Harrow, Hugo award-winning author of The Once and Future Witches\"Suri's incandescent feminist masterpiece hits like a steel fist inside a velvet glove.\" —Shelley Parker-Chan, author of She Who Became the Sun",
  "genres": [
    "Fantasy",
    "Lesbian",
    "LGBT",
    "Queer",
    "Fiction",
    "Romance",
    "Adult"
  ],
  "author": "Tasha Suri",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/53446712-the-oleander-sword"
}