{
  "title": "A Midsummer Night's Romance",
  "description": "An Invitation to the Ball…By Fifteen of Your Favorite Historical Romance Authors!You are cordially invited to the most anticipated event of the Season—Lord and Lady Whitwell’s annual ball! This year’s theme is the most extravagant yet…A Midsummer Night’s Dream, filled with fairytale gardens and fantastical costumes, sparkling champagne, and heartwarming romance.Opportunities abound for secret trysts in the shadows of moonlit walks, mistaken identities, delicious unmaskings, and perhaps even a magical spell or two. But one thing is certain—fifteen pairs of hearts will never be the same again. Enjoy this collection of never-before-released novellas by your favorite historical romance authors!Season of Scandal by Alyssa AlexanderSecond son Noah Clarke expected to have a long career in the military. When he loses his brother to illness, Noah must return home and take his place as the new Earl of Parkwood. Yet Noah is not the same man he once was. Ton gatherings are now insipid and foolish—that is, until Noah makes the acquaintance of a masked lady scandalously clad as a soldier.But after six years on the Marriage Mart, Miss Prudence Chapman is too outspoken, too plain, and too intelligent to have received an offer of marriage. Deciding she is most firmly on the shelf, Prue is determined to spend her last spring as a Season of Scandal and doing exactly as she pleases before retiring to life as a spinster, including engaging in a battle of wits and stolen kisses with a masked stranger... assuming he is a stranger.A Kiss for Luck by Jennifer AshleyLord Guy Lovell, an avowed bachelor, has no interest at all in the married state. But when young, thrice-widowed Gemma Cooke suddenly rushes into his sanctuary, seeking rescue from a boorish swain, Guy’s life changes forever.Love Disguised by Grace BurrowesRupert, Earl of Esterly, kits himself out as a footman, hoping to avoid the matchmakers’ notice at a masquerade. His lordship catches the eye, not of the proper lady he’s supposed to start courting, but of Mary, a chamber maid who has no use for titled men. He’s not what she thinks he is, but then, she’s not what she appears to be either!Until You by Gina ConkleAn encounter with a smoldering Scot in a curiosity shop sets Emma’s heart aflutter. His stunning offer intrigues her—it could mean freedom. Her parents want her suitably wed, and she wants more of the dark-eyed Scot, Mr. Ramsay. But an air of mystery follows him... until Lord and Lady Whitwell’s ball, where Emma dances in a private garden grotto and sets herself free.Ill Met by Moonlight by Eileen DreyerWhen she sneaks into the conservatory at the Whitwell’s ball, all Anastasia Dunn wants is to escape the relentless fortune-hunters. Even her engagement to an absent duke hasn’t helped. Not that she is so anxious to meet him either. She’d rather just play amid flowers, even if they aren’t hers. So when she is joined by an unknown reveler, she expects to be annoyed. Maybe it is the fact that she can’t see his face beneath the ass’s head that is part of his costume, but she wants him to stay. Until she realizes just who he is. And why he is there.She Walks in Scandal by Elizabeth EssexNicholas Gowan is forced to make his way in the world with his sword, teaching fencing to young lordlings with more money than sense. But when he takes on a remarkable—and remarkably attractive—new student, his prospects begin to change.The Honorable Miss Violet Worth has always known exactly what she wants and isn’t afraid to fight for it. Crossed swords soon lead to crossed hearts, but a viscount’s daughter can’t fall in love with a penniless swordsmen. But Violet devises a plan to parry those determined to keep them apart with a clever feint at the Midsummer Night’s Ball.The Awakening of Lady Flora by Bronwen EvansWidowed Lady Flora Stanton is attending the Whitwell's annual masquerade ball for one thing only: to finally have a little fun and find herself a paramour. A man who she can share everything with, except her heart. Her dead husband owns that, and it’s locked safely away. But is she brave enough to admit she’s lonely? The rest of her life is a long time to be without pleasure.Attending the Whitwell’s ball, James Tennison, Earl of Battling, recognizes the lady in the Grecian Goddess disguise. How could he not? She’s owned his heart for many, many years, and tonight, he’s putting the memory of his dead best friend to rest and going after what he wants—what he needs. He might never win Lady Flora’s heart, but he’s not prepared to step aside and let her take any other man into her bed.One Enchanted Evening by Anna HarringtonMason Granger is a victim of proximity. Although the wealthy businessman spurns all society events, his townhouse sits next to Lord and Lady Whitwell’s, which means he’s caught up in their ball against his will—and with their guests, when a little girl sneaks into his rear garden to watch the fireworks and her alluring mother, Nora, chasing after. Emmeline hasn’t spoken a word since the carriage accident that killed her father, but with the help of his shaggy hound, Brutus, Mason helps Emmeline speak again—that is, to the dog. Stubbornly, she refuses to speak to anyone else.As Mason and Nora help Emmeline find the courage to overcome the past’s tragedies, can they also find the courage to embrace their future’s happiness?Her Wildest Dreams by Jade LeeWhen his cousin ensnares a young woman in a nefarious plot, the future Duke of Birchhill must fix the disaster. Who else will protect the biracial Su Yi Phillips? What Anthony discovers is that Su Yi is not helpless, doesn’t want his rescue, and is an enchanting woman in her own right. But even she needs help now and then, and Su Yi is confused by this foreign land. Can Anthony convince her to trust what she feels? Not if his ducal family has anything to say about it. He’ll need to lay his heart bare before Su Yi risks it all for love.Unmasking the Earl by Madeline MartinLady Cecelia Stopford has asked her aunt, a notorious matchmaker, to help find her a husband and is expecting someone more reserved, just like her. But what she gets is a charmer who flirts with a roguish grin and utterly sweeps her off her feet. When opposites attract and mistaken identities come into play, this matchmaking gone awry appears to be a duplicitous matchmaking gone exactly right.A Prince in the Pantry by May McGoldrickPersian Prince Timour Mirza, visiting London on a diplomatic mission, has been invited to attend Lord and Lady Whitwell’s masquerade ball. Pearl Smith, down on her luck and desperate after her father’s fall from grace, is working below stairs during the same event. Timour is curious about London life and trades places with his companion before entering the ball. After Pearl comes to his aid during a moment of conflict in the Servants’ Hall, the two embark on a journey that takes them from Covent Garden to Pall Mall, knowing that all they have is this one romantic evening.A Moonlight Kiss by Ella QuinnAt the tender age of twelve, Lord Octavius Trevor was sent to serve in the Royal Navy and never looked back. Now, on the cusp of getting his own ship, they run into a storm that damages the ship and kills the captain. His short stay in Tortola becomes much longer. A fate he’d not looked forward to until he meets the captivating Miss Marcella Calder.For Marcella, falling in love with Octavius was the easy part, and she’s shocked when her mother refuses her permission to marry him. Duty demands he depart the island, but he promises to return. Before he does, her father sends Marcella to her sister in England where she and Octavius re-unite. But his father, the Duke of Somerset, has another marriage in mind.A Match Unmasked by Erica RidleyMiss Kitty Stanley’s childhood boy-next-door—the arrogant, entirely too handsome daredevil, Nathaniel Baxter—was supposed to stand up with her for the first dance the night of her come-out. The rotter went off to war, instead.Now, she’s a spinster of means, enjoying her freedom at the masquerade ball of the season. Kitty has forgotten that old foolish tendre. She has no need for Brigadier Baxter. Which is a good thing, since she hasn’t seen him in five long years.But wait... who is the handsome man behind that mask?Lovers and Madmen by Heather SnowLord Edward Phillip Thomas George Walpole, Marquess of Burbridge, is as stodgy as his very English name—and a night spent at a ball fashioned after a ridiculous romp of a play, is his own personal version of hell. But balls are where deals are made, and it is vital he have Lord Whitwell’s political support in brokering a treaty with France that will end more than a decade of war. Therefore, he must attend.But will Lady Calliope Hughes, as free-spirited as Edward is staid, open his eyes to what magic can be made in the moonlight?One Simple Kiss by Sabrina YorkSold off in marriage to a wealthy lord to save her family from penury, now-widowed Lady Rose de Vreis has no intention of marrying again. Why should she? She’s wealthy, free and, best of all, not required to attend to any man’s carnal needs. Not that she didn’t enjoy being married to Count Eddard de Vreis. Ed was a kind man, but the love she felt for him was hardly passionate. In fact, the thought of passion strikes her as ridiculous.When Liam Mackinnon returns to England to discover that Rose—the woman by whom he has measured all others—is available, he is determined to win her. When she confides she has no interest in marriage, or the physical falderal that goes with it, he knows he can change her mind. If only he can convince her to give him one simple kiss.",
  "genres": [],
  "author": "Alyssa Alexander",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/53456439-a-midsummer-night-s-romance"
}