{
  "title": "My Holocaust: A Novel",
  "description": "Maurice and Norman Messer, father-and-son business partners, know a good product when they see it. That product is the Holocaust, and Maurice, a Holocaust survivor with an inflated personal history, and Norman, enjoying vicarious victimhood as a participant in the second-generation movement, proceed to market it enthusiastically. Not even the disappearance of Nechama, Norman's daughter and Maurice's granddaughter, into the Carmelite convent at Auschwitz, where she is transformed into a nun, Sister Consolatia of the Cross, deters them from pushing their agenda. Father and son embark on a tour of the Auschwitz-Birkenau death camp, which Maurice—now the driving force behind the most powerful Holocaust memorialization institution in America—organizes to soften up a potential major donor, and which Norman takes advantage of to embark on a surrealistic search for his daughter. At the death camp they run into assorted groups and individuals all clamoring for a piece of the Holocaust, including Buddhist New Agers on a retreat, Israeli schoolchildren on a required heritage pilgrimage, a Holocaust artifact hustler, filmmakers, and an astonishing collection of others. All hell breaks loose when Maurice's museum is taken over by a coalition of self-styled victims seeking Holocaust status, bringing together a vivid cast of all-too-human characters, from Holocaust professionals to Holocaust wannabees of every persuasion, in the fevered competition to win the grand prize of owning the Holocaust. An inspiringly courageous and shockingly original tour-de-force, My Holocaust dares to penetrate territory until now considered sacrosanct in its brilliantly provocative and darkly comic exploration of the uses and abuses of memory and the meaning of human suffering.",
  "genres": [
    "Fiction",
    "Holocaust",
    "World War II",
    "Judaica",
    "Jewish",
    "Humor"
  ],
  "author": "Tova Reich",
  "average_rating": "2.89",
  "url": "https://www.goodreads.com/book/show/534536.My_Holocaust"
}