{
  "title": "The Crooked Path to Abolition: Abraham Lincoln and the Antislavery Constitution",
  "description": "An award-winning scholar uncovers the guiding principles of Lincoln’s antislavery strategies. The long and turning path to the abolition of American slavery has often been attributed to the equivocations and inconsistencies of antislavery leaders, including Lincoln himself. But James Oakes’s brilliant history of Lincoln’s antislavery strategies reveals a striking consistency and commitment extending over many years. The linchpin of antislavery for Lincoln was the Constitution of the United States. Lincoln adopted the antislavery view that the Constitution made freedom the rule in the United States, slavery the exception. Where federal power prevailed, so did freedom. Where state power prevailed, that state determined the status of slavery, and the federal government could not interfere. It would take state action to achieve the final abolition of American slavery. With this understanding, Lincoln and his antislavery allies used every tool available to undermine the institution. Wherever the Constitution empowered direct federal action―in the western territories, in the District of Columbia, over the slave trade―they intervened. As a congressman in 1849 Lincoln sponsored a bill to abolish slavery in Washington, DC. He reentered politics in 1854 to oppose what he considered the unconstitutional opening of the territories to slavery by the Kansas–Nebraska Act. He attempted to persuade states to abolish slavery by supporting gradual abolition with compensation for slaveholders and the colonization of free Blacks abroad. President Lincoln took full advantage of the antislavery options opened by the Civil War. Enslaved people who escaped to Union lines were declared free. The Emancipation Proclamation, a military order of the president, undermined slavery across the South. It led to abolition by six slave states, which then joined the coalition to affect what Lincoln called the \"King’s cure\": state ratification of the constitutional amendment that in 1865 finally abolished slavery.",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "Politics",
    "American History",
    "Race",
    "Biography"
  ],
  "author": "James Oakes",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/53447250-the-crooked-path-to-abolition"
}