{
  "title": "Really Saying Something: Sara & Keren – Our Bananarama Story",
  "description": "_______________________________________ 'This book is like something from a movie' DERMOT O'LEARY '[A] brilliant autobiography' MARTIN KEMP A Sunday Times Best Music Book of 2020 A HuffPo Book That Got Us Through 2020 A Daily Mail Best Showbiz Memoir _______________________________________ MUSIC, FAME AND A LIFELONG FRIENDSHIP. Sara Dallin and Keren Woodward met in the school playground when they were four. They became international stars, first as a trio, then, for almost three decades, as a duo. After finishing school, Sara studied journalism at the London College Of Fashion, while Keren worked at the BBC. They lived in the YWCA before moving into the semi-derelict former Sex Pistols rehearsal room and immersing themselves in Soho's thriving club scene. A year later they teamed up with Siobhan Fahey to form Bananarama. A string of worldwide hits followed, including 'Cruel Summer', 'I Heard a Rumour and 'Venus'. In a male-dominated industry, they were determined to succeed on their own terms and inspired a generation with their music, DIY-style and trailblazing attitudes. Narrated with humour and authenticity, and filled with never before seen photos Really Saying Something takes us from the early days to the world tours, to party games with George Michael, a close friendship with Prodigy's Keith Flint, hanging out with Andy Warhol in New York and a Guinness World Record for the most worldwide chart entries of any all-female group. As well as the highs, Sara and Keren speak frankly about the flip side side of fame, revealing their personal struggles and the challenges of juggling family life with a demanding professional schedule. Really Saying Something is the story of two friends who continue to pursue their dreams their way - and have a great time doing it. It's a celebration of determination and a lifelong friendship, with an unbeatable soundtrack. _______________________________________ 'A wonderful, pantomime-like story of self-invention and continuous reinvention.' LITERARY REVIEW 'Their friendship has seen them through their school years, adolescence, bad breakups, motherhood and comebacks, all of which is beautifully captured in their memoir Really Saying Something, which I devoured ... what a nostalgia-fest' KATE THORNTON 'Brilliant, of course, absolutely wonderful' EAMONN HOLMES 'This cheery memoir showed how luck and canny shoe choices propelled Bristol school friends Dallin and Woodward to megastardom' UNCUT",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Autobiography"
  ],
  "author": "Sara Dallin",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/53458612-really-saying-something"
}