{
  "title": "Monsters",
  "description": "The year is 1964. Bobby Bailey doesn’t realize he is about to fulfill his tragic destiny when he walks into a US Army recruitment office to join up. Close-mouthed, damaged, innocent, trying to forget a past and looking for a future, it turns out that Bailey is the perfect candidate for a secret U.S. government experimental program, an unholy continuation of a genetics program that was discovered in Nazi Germany nearly 20 years earlier in the waning days of World War II. Bailey’s only ally and protector, Sergeant McFarland, intervenes, which sets off a chain of cascading events that spin out of everyone’s control. As the titular monsters of the title multiply, becoming real and metaphorical, literal and ironic, the story reaches its emotional and moral reckoning.Monsters is the legendary project Barry Windsor-Smith has been working on for over 35 years. A 380-page tour de force of visual storytelling, Monsters’ narrative canvas is both vast and deep: part familial drama, part political thriller, part metaphysical journey, it is an intimate portrait of individuals struggling to reclaim their lives and an epic political odyssey across two generations of American history. Trauma, fate, conscience, and redemption are just a few of the themes that intersect in the most ambitious graphic novel of Windsor-Smith’s career. Monsters is rendered in Windsor-Smith’s impeccable pen-and-ink technique, the visual storytelling with its sensitivity to gesture and composition is the most sophisticated of the artist’s career. There are passages of heartbreaking tenderness, of excruciating pain, and devastating violence. It is surely one of the most intense graphic novels ever drawn.",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Horror",
    "Fiction",
    "Science Fiction",
    "Fantasy",
    "Historical Fiction"
  ],
  "author": "Barry Windsor-Smith",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/53458056-monsters"
}