{
  "title": "Ireland and the Magdalene Laundries: A Campaign for Justice",
  "description": "Between 1922 and 1996, over 10,000 girls and women were imprisoned in Magdalene Laundries, including those considered 'promiscuous', a burden to their families or the state, those who had been sexually abused or raised in the care of the Church and State, and unmarried mothers. These girls and women were subjected to forced labour as well as psychological and physical maltreatment.Using the Irish State's own report into the Magdalene institutions, as well as testimonies from survivors and independent witnesses, this book gives a detailed account of life behind the high walls of Ireland's Magdalene institutions. The book offers an overview of the social, cultural and political contexts of institutional survivor activism, the Irish State's response culminating in the McAleese Report, and the formation of the Justice for Magdalenes campaign, a volunteer-run survivor advocacy group.Ireland and the Magdalene Laundries documents the ongoing work carried out by the Justice for Magdalenes group in advancing public knowledge and research into Magdalene Laundries, and how the Irish State continues to evade its responsibilities not just to survivors of the Magdalenes but also in providing a truthful account of what happened. Drawing from a variety of primary sources, this book reveals the fundamental flaws in the state's investigation and how the treatment of the burials, exhumation and cremation of former Magdalene women remains a deeply troubling issue today, emblematic of the system of torture and studious official neglect in which the Magdalene women lived their lives.The Authors are donating all royalties in the name of the women who were held in the Magdalenes to EPIC (Empowering People in Care).",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Ireland",
    "Sociology",
    "Religion"
  ],
  "author": "Claire McGettrick",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/53470683-ireland-and-the-magdalene-laundries"
}