{
  "title": "I Came As a Shadow: An Autobiography",
  "description": "The long-awaited autobiography from Georgetown University's legendary coach, whose life on and off the basketball court threw America's unresolved struggle with racial justice into sharp relief.John Thompson was never just a basketball coach and I Came As A Shadow is categorically not just a basketball autobiography.After three decades at the center of race and sports in America, the first Black head coach to win an NCAA championship makes the private public at last. Chockful of stories and moving beyond mere stats (and what stats! three Final Fours, four times national coach of the year, seven Big East championships, 97 percent graduation rate), Thompson's book drives us through his childhood under Jim Crow segregation to our current moment of racial reckoning. We experience riding shotgun with Celtics icon Red Auerbach, and coaching NBA Hall of Famers like Patrick Ewing and Allen Iverson. How did he inspire the phrase \"Hoya Paranoia\"? You'll see. And thawing his historically glacial stare, Thompson brings us into his negotiation with a DC drug kingpin in his players' orbit in the 1980s, as well as behind the scenes of his years on the Nike board.Thompson's mother was a teacher who couldn't teach because she was Black. His father could not read or write, so the only way he could identify different cements at the factory where he worked was to taste them. Their son grew up to be a man with his own life-sized statue in a building that bears his family's name on a campus once kept afloat by the selling of 272 enslaved people. This is a great American story, and John Thompson's experience sheds light on many of the issues roiling our nation. In these pages--a last gift from \"Coach\"--he proves himself to be the elder statesman whose final words college basketball and the country need to hear.I Came As A Shadow is not a swan song, but a bullhorn blast from one of America's most prominent sons. Huddle up.",
  "genres": [
    "Sports",
    "Biography",
    "Nonfiction",
    "Basketball",
    "Memoir",
    "Autobiography",
    "Race"
  ],
  "author": "John             Thompson",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/53470668-i-came-as-a-shadow"
}