{
  "title": "31 Nights of Halloween",
  "description": "October the 31st - All Hallows’ Eve The full moon is bright, The werewolves are in sight. The mummies are out of their tombs, To find you, hiding in your rooms. The witches and ghosts and ghouls are here, To become the nightmares that you fear. They march and stride to give us all a fright, We know many dreadful things happen on Halloween night. But what can be more fun? For there to be thirty-one. 31 Nights of Halloween brings together thirty-one frightful tales from the worlds most talented ghouls. Each story is guaranteed to send chills down your back and make your blood run cold. With one chilling tale for each night in the month of October, you won’t want to go out trick-or-treating this Halloween. So turn off the lights, crawl into your beds and begin to read, if you think you can survive. Table of Contents 1st A Pity Party of Monstrous Proportions By Patrick Shand 2nd Middleton’s Gym By Terry Alexander 3rd Four Nights By Rebecca Carter 4th Candy Ban By Maurice Vaughan 5th A Night’s Work By Diandra Linnemann 6th Zombies Don’t Trick or Treat By Rusty Fischer 7th Driving Alone By Jimalyn Lawless 8th The Spell By Lyle Perez-Tinics 9th Lights Out Kevin Walsh 10Th Lorelie By J. Rodimus Fowler 11th Wretched By R. M. Cochran 12th Peter, Peter Pumpkin Eater By S.J. Caunt 13th The Journey Home By Shawn M. Riddle 14th The Bully Minder By S. S. Michaels 15th Something is Out there By Nathan Correll 16th The Licked Hand By Mark Goddard 17Th Chewy Ones By Jeff Szpirglas 18Th The Initiation By Michael C. Dick 19th The Life and Loss of Miss Elizibeth Prince By J. Rodimus Fowler20th The Ghost of Gertrude Garvey By Patrick Shand 21st The Heart Fixer By Rhiannon Mills 22nd Equinox By Geoffery Crescent 23rd Trick or Cheat By Rebecca Snow 24th Bets Beware By L.J. Landstrom 25th The Damned By Shawn M. Riddle 26th In a Cat’s Eye By Louise Herring-Jones 27th The Full Moon By Stuart Conover 28th Check Your Candy By Eloise J. Knapp 29th Lighthouse By Benny Alano 30th Bloody Bones By Diandra Linnemann 31st Wail By Kate Jonez Bonus Stories In the Dead House By S. S. MichaelsThe Monster Under my Bed By Bryan Medof Thirteen By Joe Dibuduo & Kate Robinson",
  "genres": [
    "Halloween",
    "Horror"
  ],
  "author": "Lyle Perez-Tinics",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/12617593-31-nights-of-halloween"
}