{
  "title": "White Boy in Watts",
  "description": "British Grit-LitThe world of the Cab Driver is uncertain and dangerous. It is populated by oddballs, weirdoes, comedians, eccentrics, head cases, prima donnas and hard cases. But no more so than when you're a white English guy working Watts, Compton and Inglewood, home to the infamous Bloods and Crips. I truly never knew what to expect next, and during my time driving cab in South-Central L.A. in the 1980's I got myself into some scrapes. I’ve intended to paint an ominous picture of a community destroyed by drugs, guns and violence. You’ll almost smell the omnipresent whiff of cheap wine, and feel the dirty lino under your feet. Read the true life adventures of an English lad as I struggled to make a living amongst ‘gangstas’ who are arguably the most violent in the United States. If you enjoy True Gangsta Books, or books about the Bloods or Crips, then take a chance on this one People have always told me I’m a natural storyteller. Comments on my writing style warn that I \"talk to the reader with all the confidence of a man in touch with his own reality, in a voice which is seasoned with a hint of world weariness that is so telling of a writer who has written what he knows and written it with disarming fearlessness.\" And that I guess is true. You’ll be able to hear my characters, see them and, in some instances, actually smell them. They’ll leave their stain on you. You may well be able to relate to guys who used their fists and their wits, you may laugh at their humour and get their jokes, but it’ll be the thugs with guns and no soul who will unsettle you. I want you to be scared of them. Come and have a look at the world through my eyes in the 1980's, and, like me, marvel that I got out of there alive.“Can I just say I'm not a real big sit down and read sort of guy.... But this book had me hooked from the 1st few lines. I've never finished a book this quickly. Highly recommended to anyone!!”“Absolutely incredible! I read the sample and had to buy the book. I usually never buy books and just find them online but I had to make the exception for this due to the author's eloquence. The stories are really funny and serious when they need to be. I definitely would recommend this to anyone that is looking for a genuinely straight up genius work. Karl Wiggins is like a contemporary Socrates.” (BLIMEY!)“White Boy in Watts is rather like driving what Karl might term a ‘dodgy motor’. You climb in and then before you know it you are coasting in fifth, Ray-Bans on, wind in your hair, lovely! Suddenly you grind to a disturbing, hissing halt. Karl drops a spanner in the works, a bag of sugar into his cavernous tank of diesel fuelled wisdom and you stall in awestruck wonder at his incredible insight. So there you are, stranded in Watts with a dozen members of the Bounty Hunters or the Mad Swan Bloods trying to rock your car over, with no option but to stop, gather your thoughts, catch your breath and carry on reading, because by this time you’re unstoppable.”“Karl Wiggins is a natural storyteller, and ‘White Boy in Watts’ is a compulsive read, bringing to life all the not-so-ordinary people and places that are generally under-represented in literature. His direct, easy-going style and zest for living are infectious.”This is a very short book, 50 pages or so, that's all, but these are stories that need to be told. Scroll up and click on the cover of the book to ‘Look inside’",
  "genres": [],
  "author": "Karl Wiggins",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/53460418-white-boy-in-watts"
}