{
  "title": "Two Under the Indian Sun",
  "description": "In November 1914 two small sisters, Jon and Rumer Godden, returned to India. They had spent a year in London being \"brought up\" by austere aunts, but now the zeppelins were expected, and so they were summoned back to their home in East Bengal. Jon was only seven and a half and Rumer six.\"Two Under the Indian Sun\", a unique collaboration, is a remembrance of the five years that followed, in the village of Narayangunj--where their father worked as a steamship agent--on a bustling river that feeds the great Brahmaputra. It is an evocation of a few years that will always be timeless for these two, and it is as true an account as memory can accomplish. India, for them, was sun-baked dust between their toes, colored robes in the market place, the chanting of coolies, the deep hoot of steamers on the river, and the smells of thorn trees, mustard, and coconut oil: smells redolent of the sun.India was also people, people of every kind, each different from the other and bringing a trail of other differences, of place, custom, religion, even of skin. It was not an ordinary life for young girls, and later they agreed that it might have been better had they been raised in the simplicity of their Quaker forbears. \"Better,\" Jon was to say, \"but not nearly as interesting.\"Above all, those five years were \"a time when everything was clear: each thing was itself: joy was joy, hope was hope, fear and sorrow were fear and sorrow.\" Jon and Rumer have written of that time with a single voice, perhaps because during those years the two sisters grew so close that \"between them was a passing of thought, of feeling, of knowing without any need for words.\"[From the front inside jacket.]",
  "genres": [
    "India",
    "Memoir",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Asia",
    "Childrens"
  ],
  "author": "Jon Godden",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/534694.Two_Under_the_Indian_Sun"
}