{
  "title": "The York Patrol: The Real Story of Alvin York and the Unsung Heroes Who Made Him World War I's Most Famous Soldier",
  "description": "\"Exceptional military history worthy of its heroic subject.\" —Matthew J. Davenport In the vein of Band of Brothers and American Sniper , a riveting history of Alvin York, the World War I legend who killed two dozen Germans and captured more than 100, detailing York's heroics yet also restoring the unsung heroes of his patrol to their rightful place in history—from renowned World War I historian James Carl Nelson.October 8, 1918 was a banner day for heroes of the American Expeditionary Force. Thirteen men performed heroic deeds that would earn them Medals of Honor. Of this group, one man emerged as the single greatest American hero of the Great Alvin Cullum York. A poor young farmer from Tennessee, Sergeant York was said to have single-handedly killed two dozen Germans and captured another 132 of the enemy plus thirty-five machine guns before noon on that fateful Day of Valor.  York would become an American legend, celebrated in magazines, books, and a blockbuster biopic starring Gary Cooper. The film, Sergeant York, told of a hell-raiser from backwoods Tennessee who had a come-to-Jesus moment, then wrestled with his newfound Christian convictions to become one of the greatest heroes the U.S. Army had ever known. It was a great story—but not the whole story. In this absorbing history, James Carl Nelson unspools, for the first time, the complete story of Alvin York and the events that occurred in the Argonne Forest on that day. Nelson gives voice, in particular, to the sixteen “others” who fought beside York. Hailing from big cities and small towns across the U.S. as well as several foreign countries, these soldiers included a patrician Connecticut farmer whose lineage could be traced back to the American Revolution, a poor runaway from Massachusetts who joined the Army under a false name, and a Polish immigrant who enlisted in hopes of expediting his citizenship. The York Patrol shines a long overdue spotlight on these men and York, and pays homage to their bravery and sacrifice.  Illustrated with 25 black-and-white images, The York Patrol is a rousing tale of courage, tragedy, and heroism.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "War",
    "World War I",
    "Military History",
    "American History"
  ],
  "author": "James Carl Nelson",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/53487129-the-york-patrol"
}