{
  "title": "She Never Told Me About the Ocean",
  "description": "\"I’ve always admired the writing of Elisabeth Sharp McKetta, and her beautiful, ambitious first novel demonstrates why. She Never Told Me about the Ocean is a heroine’s journey through forgiveness, birth and rebirth, all the while treading the line between honoring the dead and feeling paralyzed by them. She has offered us a complicated portrait of mothers and daughters, cupped inside one another like nesting dolls.\"― Arthur Golden, author of Memoirs of a Geisha \" She Never Told Me About the Ocean is a tidal and intimate book, brimming over with wonders and terrors and the watery echoes that bind generations of women. What a pleasure this book is from start to finish. McKetta maps the dark portals through which her women continuously reinvent themselves, newborn at every age.\"― Karen Russell, author of Swamplandia! and Orange World and Other Stories Told by four women whose stories nest together, She Never Told Me about the Ocean is an epic about a rite of passage that all humans undergo and none remember: birth.Eighteen-year-old Sage has been mothering her mother for as long as she can remember, and as she arrives on the shores of adulthood, she learns a secret: before she was born, she had an older brother who drowned. In her search to discover who he was and why nobody told her, Sage moves to tiny Dragon Island where her mother grew up. There, she embarks on a quest to learn the superstitions of the island, especially its myths involving her mother. Gathering stories from Ilya, a legendary midwife who hires Sage as her apprentice; Marella, Sage’s grieving mother who was named for the ocean yet has always been afraid of it; and Charon, the Underworld ferrywoman who delivers souls to the land of the dead, Sage learns to stop rescuing her mother and simply let go. But when her skill as Ilya’s apprentice enables her to rescue her mother one final time, in a way that means life or death, Sage must shed her inherited fears and become her own woman.",
  "genres": [
    "Fiction"
  ],
  "author": "Elisabeth Sharp McKetta",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/53485013-she-never-told-me-about-the-ocean"
}