{
  "title": "BEYOND RED LINES: An action-thriller novel",
  "description": "What would you do if you were an innocent man entangled in a dark conspiracy plot that took everything away from you…except your soul?It was an unexpected offer, the job of a lifetime. Who wouldn't want to lead a team of computer experts on a top-secret project in the heart of Mexico?I thought they'd forgotten about my gift my CO noticed when I was a young conscript, but destiny wouldn't let them use it. Instead of sending me to the front in Iraq, they had to send me home… but someone hadn't forgotten about me.Ten years later… how could I know that my talent would change my destiny and strip me from my humanity…They call themselves the “White Cells” and are hell-bent on exacting revenge on terrorists… that's why they have these secret camps where they recruit and train mercenaries to fight for their cause – the base where I am stuck too…That job I was offered was a lure that would bring me here to this hell-on-earth place with my wife and my daughter… I've lost everything and they think they are training me for their cause, but I have my revenge to exact…Who are the people behind the White Cells Organization, and why did they target Theo?Follow Theo as he tries to survive the inhumane conditions of the training camp as he searches for the puzzle pieces that would help him give the solution to the greater-than-the-world conspiracy plot that landed him in a hell-on-earth camp in the Sierra Madre.With a delicate blend of political fiction, military action, and his factual worldviews combined with a journalistic approach, author Pierre Rehov will take you on a unique journey filled with thrill and suspense.In Beyond the Red Lines, nothing is what it seems…If you are a political and military novel lover – then this book is a must-have for your collection. Sit back and revel in the magnificent story that will keep you glued with every turn of the page. What are you waiting for?",
  "genres": [],
  "author": "Pierre Rehov",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/53498901-beyond-red-lines"
}