{
  "title": "Regrets",
  "description": "Healing after a tragedy is hard enough. Doing it when you’re haunted by past betrayal and so many things left unsaid? Feels nearly hopeless.  Is it impossible to come back from so much anguish and all the regrets? Can you ever truly mend your heart and move on? Or are Penelope and Linc destined for a life of punishment and pain? They're about to find out whether the line between love and hate is clear. And if moving on after loss and the sting of deception is even possible. ***Reviews*** Holy heartache. \"Regrets slayed my heart. Angst-lovers, this book is not to be missed. Brilliant writing from Nicole Dykes. I couldn't ask for more in a book!\" - LJ Shen, USA Today and #1 Amazon bestselling author “Tears flowed, my heart ached, and I could feel the anguish in my soul.” -Keri, Goodreads “This is not your sweet, tragic love story. It’s got hard edges that keep you turning pages.” -Rmederios, Goodreads “Nicole (Dykes) went really deep for this one and she didn’t disappoint. I highly recommend this book if you’re looking for forbidden love, love triangle, tragedy, and just a great love story.” -Alexandra, Goodreads “It’s got heartbreak, betrayal, guilt, and forgiveness. Yes, all that emotion packed into one book. Absolutely phenomenal.” -Emma, Ever Growing Book Obsession “Nicole Dykes delivers with Regrets. It is an emotional roller coaster of a book and it takes you for a ride and the best angsty/dark way. Five out of five enthusiastic stars.” -Ash, Goodreads “This is a love triangle story. Don’t let the blurb fool you. Prepare yourself. And what you think you know... Just prepare yourself.” -Jessica, Goodreads “This book just proves why Nicole Dykes is my favorite author.” -Stacy, Goodreads “This book hits the ground running. The intensity is real. Buckle up, buttercup, you have no idea what you’re in for!” -Elle, @Literary.ya “Nicole Dykes is a new to me author, and what a punch to the heart this book was for a first timer... I’m still slightly in recovery mode, but I can’t get over how much I felt while reading this book!” - Elizabeth, The Book Boutique “Powerful, emotional, all consuming, painfully beautiful and worthy of more than 5 stars.” -The Book Fairy Reviews “Regrets is everything I love about Nicole Dykes’ writing dialed up to the next level! It’s darker, edgier, and more deliciously addictive than anything she’s written before. A forbidden romance full of angst, lust, and passion I couldn’t devour quickly enough.” -Ari, The Red Hatter Book Blog",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Friends To Lovers",
    "Dark",
    "Contemporary Romance",
    "Second Chance",
    "Audiobook"
  ],
  "author": "Nicole Dykes",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/53499552-regrets"
}