{
  "title": "Narco Noir: A Detective Emilia Cruz Novel",
  "description": "A bitter past drives Acapulco’s first female police detective into a Hollywood film starring lies and murder when she goes undercover to catch a killer. As the camera rolls, Detective Emilia Cruz will face her toughest case yet.After witnessing the execution-style murder of a taxi driver, Emilia replaces him behind the wheel. Undercover with a false identity, her target is a shadowy gang extorting protection money from the upscale taxi service.Oddly enough, no one in Acapulco has heard of the gang. Yet the threat of another murder has all the drivers, including Emilia, scared to death.But when Emilia’s worst enemy gets into her taxi, both her life and the murder case accelerate out of control.Next stop, a movie set where a second undercover role awaits.The script is a nightmare. The director’s cut is a double-cross. The leading man has looks that could kill.Can Emilia act her way out of murder?Could you?\"A thrilling series\" - National Public RadioPoison Cup award, Outstanding Series 2019 and 2020 -- CrimeMasters of AmericaAcapulco, once the glittering playground of Hollywood’s Rat Pack, now has the highest homicide rate in Mexico. Loaded with intrigue and action, the Detective Emilia Cruz police procedural mystery series takes on cartels, corruption and social inequality.Carmen Amato's 30-year career as a CIA intelligence officer with counterdrug experience serves up authentic and thrilling mystery crime fiction loaded with danger and deception. Fans of police procedural murder mystery series by Ian Rankin, Jo Nesbo, Ann Cleeves, and Peter May, as well as the Department Q novels and Don Winslow's cartel and border thrillers set in Mexico, also love Detective Emilia Cruz’s complex plots, fast action, pulse-pounding suspense, and exotic location.“Carmen Amato knows how to bring Acapulco to life . . . Emilia is definitely a character that is close to my heart.” – Mystery SequelsPRAISE FOR THE AWARD-WINNING DETECTIVE EMILIA CRUZ SERIESCLIFF DIVER \"Consistently exciting.\" ― Kirkus ReviewsHAT DANCE “Emilia . . . is a force to be reckoned with.” ― MysterySequels.comDIABLO NIGHTS “Amato's unique setting, realistic characters, and intriguing plot set her apart.” ― OnlineBookClub.orgKING PESO \"Danger and betrayal never more than a few pages away.\"― Kirkus Reviews",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Amazon",
    "Crime"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/53506558-narco-noir"
}