{
  "title": "Ray By Ray: A Daughter's Take on the Legend of Nicholas Ray",
  "description": "Nicholas Ray was cinema. The legendary director of such classic films as Rebel Without a Cause was an innovative force who dramatically changed the Hollywood landscape. He was also Nicca Ray’s dad, Nick. After he disappeared from her life in 1964, Nicca began to imagine her father as a hero who would return and whisk her away from a life in LA where she never felt safe. However, the man who finally reappeared was not the legendary figure she dreamed of. Through his movies and letters along with her intimate interviews of family members and Hollywood icons, Nicca stitches together the seemingly disparate pieces of the real Nicholas Ray: A man so devoted to his craft he insisted on spending the last hours of his life surrounded by a film crew; a man who lost everything to drugs and gambling; an absentee father she longed to connect with.Both well-researched and deeply personal, Ray by Ray: A Daughter's Take on the Legend of Nicholas Ray unravels the lives entangled in Nick’s, including those of Gloria Grahame, Dennis Hopper, Wim Wenders, and the Ray family itself. Nicca tracks her father’s whereabouts during the years he was missing from her life and works to reconcile his artistry with his persona. In discovering the truth about her father, she navigates her own path beyond the shadows cast by the Golden Age of Hollywood. An essential new perspective on Nicholas Ray, with more than 50 photos and letters from the author's personal archive, Ray by Ray redefines this legendary figure through the eyes of a daughter searching for the truth about her father.\"In this intimate blend of memoir and biography, [Nicholas Ray's] daughter, Nicca, a filmmaker and writer, explores her father’s complex life and artistic legacy as well as their own complicated relationship and his impact on her life. ... This contemplative, deeply personal portrait of both Rays will appeal to readers interested in mid-century Hollywood.\" \n―Library Journal\nNicca Ray is film director Nick Ray’s daughter and as her marvelous memoir unspools, she could be a genetically engineered female protagonist of an imaginary Nick Ray picture. … [Ray by Ray] is the screamingly sad, wise, drug-fueled, hilarious tale of a daughter’s coming to light from under an immense paternal shadow. A deep dark shadow, by mortal standards, a shadow’s shadow; for Nick Ray is himself a burnt-out case, an artist swallowed whole by the bottle, the spoon and the syringe.\" —Amos Poe, Filmmaker, The Blank Generation\"If you diagrammed Nicca Ray's family tree, going back only two generations, it would resemble a web spun by a spider on acid. RAY BY RAY is the story of a search for home, for family, for identity, for the understanding of personal demons. Nicca's journey is one of courage and harrowing honesty. She doesn't gloss over the ugly bits, of which there are many. Despite her recreation of the trauma, the confusion of her childhood and teen years, she holds onto a grace, compassion and unconditional love for all of her family members, particularly her famous genius father, a filmmaker ultimately sabotaged by his own fears via alcohol, drugs, generational abuse and mental health issues. Nicca connects the dots, emotional links resonating in not only her parents' erratic behavior, but in her father's cinematic masterpieces.\" —Chris D., author, former American Cinematheque programmer and singer/songwriter of the bands, The Flesh Eaters and Divine Horsemen\"Nicholas Ray invented the meme of teenage anguish. His daughter Nicca lived it. The first miracle is that she survived. The second is that she created this beautiful, heart-breaking book, in which she maps the intersecting arcs of her life and her father's, creating a dazzling geometry of self-creation and self-destruction.\" —Peter Trachtenberg, author, Another Insane Devotion",
  "genres": [
    "Memoir",
    "Biography",
    "Nonfiction"
  ],
  "author": "Nicca Ray",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/53500114-ray-by-ray"
}