{
  "title": "The Waiting Mortuary Series: Books 1-3",
  "description": "The first three chilling horror books in the best-selling L.V. Pires The Waiting Mortuary, Vigil Black, and Death Watch.\"Gripping from the opening chapter, I breezed through the pages with great gusto, devouring each word as an ever-thickening story grew before my eyes.\" – Amazon ReviewerA serial-killer series that keeps you on the edge of your seat.Meet Bash Trawler, a high-school kid who just wants an easy summer job. When he discovers an advertisement in the local paper for night watch at a nearby funeral home, he jumps at the chance to make quick money. But staying up all night watching corpses for an eccentric war vet turns into something out of his worst nightmares.Meet Casey McClair, a girl with a serious past. Kidnapped, tortured, abandoned, Casey needs to find peace. Her worst fears revolve around the waiting mortuary and what happened to her there last summer, but when she finally musters the courage to return, she finds her worst nightmares still waiting for her. Casey’s memories go back much farther and her fears much deeper than she could have ever realized.Meet Jack Skilton, a reporter who wants to get to the bottom of things. After taking a long break from work to search for his missing son, Jack finally returns and is assigned to cover the story about a supposed haunting at the waiting mortuary. His first step inside the abandoned home sends shivers down his spine, but that won’t stop Jack from finding out the true power of the waiting mortuary and what he discovers will definitely make front-page news if only he can live long enough to write about it.Don’t miss THE WAITING MORTUARY series, three books in one that are sure to keep you reading.Available in digital, print and audiobook.What readers are ★★★★★ \"Sick, twisted, thrilling, engrossing. I was unable to put it down! I loved it...especially the twist at the end!\"★★★★★ \"The Waiting Mortuary has a lot of twists & turns & just when you think it's over...it grabs you again.\"★★★★★ \"My heart was racing for the entire last half of the book and it still didn't slow down for quite a while after I finished.\"★★★★★ \"All 3 characters are brought together with their own stories to tell in this intriguing book. It all comes together in a fast-paced story.\"★★★★★ \"One of my new favorites. Tense and well-paced, it's definitely something I would suggest to others.\"★★★★★ \"I loved this book. I was guessing until the end and the implications of the final pages chilled me to the bone! I look forward to more from this author!\"Buy the box set and start a series you won’t want to put down! For fans of Stephen King, Dean Koontz, Richard Laymon, Bentley Little, and horror and mystery authors such as Dan Simmons, Jack Ketchum, Robert McCammon, Brian Keene, Darcy Coates, Amy Cross, Jeff Strand, Ambrose Ibsen, Jeremy Robinson, Nick Cutter, Blake Crouch,",
  "genres": [],
  "author": "L.V. Pires",
  "average_rating": "4.85",
  "url": "https://www.goodreads.com/book/show/53530315-the-waiting-mortuary-series"
}