{
  "title": "The Mystique of Enlightenment: The Radical Ideas of U.G. Krishnamurti",
  "description": "An underground spiritual classic distributed widely for the first time in the U.S., this is the story of one of the most unusual figures in contemporary spirituality, U.G. Krishnamurti, in his own words. The Mystique of Enlightenment is a scathing critique of contemporary spirituality. In a world in which spiritual techniques, teachers, concepts, and organizations are legion, U. G. stands nearly alone in his rejection of it all: \"I am only interested in describing this state, in clearing away the occultation and mystification in which those people in the 'holy business' have shrouded the whole thing. Maybe I can convince you not to waste a lot of time and energy looking for a state that does not exist except in your imagination... The natural state is acausal: it just happens.\" The author does not equate the natural state with enlightenment, which he describes as an illusion created by our culture. He states emphatically that one can do nothing to attain the natural state. In fact, any movement towards it separates one from it. U. G. Krishnamurti is an original voice in which much of contemporary spirituality is understood in a new way. For those interested in the full spectrum of modern spiritual thought, this is a \"must read.\" In the well-known history of J. Krishnamurti, few names have been so strongly associated with his message as U. G. Krishnamurti, who shared a close but contentious relationship with him over many years. U.G. was raised to take on the mantle of guru, much like J. Krishnamurti. When the two men eventually met, each had rejected the guru role, and for years they conversed regularly, struggling to uncover the nature of truth, before a falling out led each in a different direction. It is fairly common in reading modern spiritual books to find references to U. G. Krishnamurti's influence on both teachers and their students. His books have been translated into nearly every European language, as well as Chinese and Japanese. Widely regarded in India and Europe, The Mystique of Enlightenment is considered by U.G.'s closest associates to be the best summary of his ideas. The book consists of transcripts of informal talks with those who come to ask him questions. In one of these talks, he relates his life story, including the events leading up to and comprising what he calls his \"calamity,\" or his entry into the natural state. Since his own experience of coming into the natural state at age 49, he has spent his time traveling throughout the world, staying with friends or in rented apartments for a few months at a time. He gives no public talks, but meets with people who come to see him. What he offers is not hope or encouragement, but stark reality: \"Of one thing I am certain. I cannot help you solve your basic dilemma or save you from self-deception, and if I can't help you, no one can.\" His message is simple: he has no message. Nevertheless, his words can inspire you to face your own assumptions and motivations and discover for yourself what is true.",
  "genres": [
    "Philosophy",
    "Spirituality",
    "Nonfiction",
    "Religion",
    "Self Help"
  ],
  "author": "U.G. Krishnamurti",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/53526.The_Mystique_of_Enlightenment"
}