{
  "title": "The Vampire Debt",
  "description": "It is a truth universally acknowledged that a single Vampire in possession of a good fortune, must be in want of a mortal snack. Dracula & Beauty and the Beast, meet Pride and Prejudice in THE VAMPIRE DEBT, a new adult, gothic fantasy paranormal, slow burn, romance.His kiss could mean her undoing.Every year the vampire court visits human cities for the Claiming. And any human claimed will live a half-life as a food source to one of those demon-cursed monsters.Vampires tore her life apart thirteen years ago. Since then, her father’s squandering has cast them into financial ruin, forcing Clara to steal, cheat, and kill to survive. Now, her father’s debts will cost Clara her life.To settle her father’s debts, she finds herself under the guardianship of the unearthly handsome Lord, Alaric Devereaux. Not only is he a vampire—he knows what she did, and he’s determined to make her pay for the crime.She refuses to sit idly by and wait for death, provoking Alaric at every turn…Until he offers her a deal: Use his dagger to draw a single drop of his blood and she will win her freedom. But for every failed attempt, she must pay with a kiss.His kisses are more deadly than a blade’s edge.Each one threatens to change everything she’s ever believed while slowly ensnaring her heart. Outmatched and unable to win, her only options are to run or risk losing herself to him completely.But Alaric doesn’t plan to let her escape so easily.Fans of Tricia Levenseller's The Shadows Between Us, Shelby Mahurin's Serpent and Dove, and Holly Black's The Cruel Prince, will love THE VAMPIRE DEBT.* Books 1-4 end in cliffhangers * Enemies to lovers * Slow burn romance * Fantasy world inspired by many different locations and time periods * A loose BATB retelling with themes common to BATB retellings * Massively flawed characters * The Vampire Debt will have 5 books in the main series *",
  "genres": [
    "Fantasy",
    "Vampires",
    "Romance",
    "Paranormal",
    "Enemies To Lovers",
    "Retellings",
    "Adult"
  ],
  "author": "Ali Winters",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/53513735-the-vampire-debt"
}