{
  "title": "The German Cookbook: A Complete Guide to Mastering Authentic German Cooking",
  "description": "Now in a celebratory fiftieth anniversary edition, The German Cookbook is the definitive authority on German cuisine, from delicious soups and entrees to breads, desserts, and the greatest baking specialties in the world. In addition to easy-to-follow recipes, renowned food writer Mimi Sheraton also includes recommendations for restaurants at home and abroad, as well as tips on ordering traditional fare. Historically, German influence on the American diet, from hamburgers and frankfurters to jelly doughnuts and cakes, has been enormous. But, as the author writes in a brand-new Preface, “Americans have begun to realize that Austrian and German cooks have long been adept at preparing foods that are newly fashionable here, whether for reasons of health, seasonality, economy or just pure pleasure.” Many standards foreshadowed the precepts of new cooking, such as pickling, and combining sweet with savory. Alongside old Bavarian favorites, The German Cookbook includes recipes for nose-to-tail pork, wild game, and organ meats; hearty root vegetables and the entire cabbage family; main-course soups and one-pot meals; whole-grain country breads and luscious chocolate confections; and lesser-known dishes worthy of rediscovery, particularly the elegant seafood of Hamburg. Since Mimi Sheraton first began her research more than fifty years ago, she has traveled extensively throughout Germany, returning with one authentic recipe after another to test in her own kitchen. Today, The German Cookbook is a classic in its field, a testament to a lifetime of spectacular meals and gustatory dedication. So Prosit and gut essen : cheers and good eating!",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "German Literature",
    "Food and Drink",
    "Germany"
  ],
  "author": "Mimi Sheraton",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/535158.The_German_Cookbook"
}