{
  "title": "Rosalee the Seeker: A Sensory Processing Disorder Story",
  "description": "Rosalee's a little sensory seeker with a BIG heart... except she sometimes does things she doesn't mean to do. This children's picture book, written and illustrated by Nicole Filippone, with a Foreword by Carol Stock Kranowitz (author of The Out-of-Sync Child), introduces sensory seeking SPD in a way that has never been done before. Read more about the book in the following review by Sheri Hoyte. \"Rosalee the A Sensory Processing Disorder Story” written and illustrated by Nicole Filippone is an empowering story of a little girl with a heart as pure as gold and an endless supply of enthusiasm. Rosalee is expressive and passionate about the things she enjoys, things like drawing and creating, singing and playing. Sometimes she does things she’s not supposed to do – but, “not on purpose!” Rosalee has Sensory Processing Disorder (SPD), and that means she just needs a little bit of help learning certain things, like personal space and organizing herself and her belongings. When Rosalee starts seeing Ms. Kat she learns so many things that help her get the sensory stimulation she needs – and this makes all the difference for Rosalee! Wow. There are so many positives going on in this book! I first learned that Sensory Processing Disorder was even a “thing” when author Nicole Filippone started talking about her plans for “Rosalee the Seeker” in a Facebook group for children’s authors and illustrators. I remember being impressed with such an undertaking, but I specifically remember thinking that if anyone is going to be successful bringing SPD to center stage for parents it is going to be Nicole. Though I don’t know her personally, I feel like I’ve gotten to know exactly the kind of person she is through this social media venue and what I’ve learned is that she puts her whole heart – no, her whole being – into her work. That said, I was excited for the opportunity to read, “Rosalee the Seeker.” Nicole brings SPD to the forefront in a manner both educational and engaging. Using specific examples, she shows how an everyday children’s activity is taken to the next level with a child who has SPD. In one particular instance, Rosalee goes from drawing on paper to drawing on walls. While this seems like extreme behavior, it is a perfect example of how a behavior could naturally accelerate with a child who has SPD. Reading this story really caused me to pause and consider all sorts of things - from my own childhood to ways I might have done things differently with my own son had I been aware of such things. In a humble capacity, “Rosalee the Seeker” calls attention to what may look like a child “misbehaving,” but who actually has special needs. It inspires the message that one shouldn’t be so quick to assume that a child acting-out has a discipline issue. This book will resonate with children and parents alike. Kids with SPD, or who know someone with SPD, will be able to point out specific behaviors, perhaps even indicating, “Hey, I do that too” or “So-and-so does that.” Being able to identify and relate to the story in a way that assures them there are other kids just like them is so important, and this story does just that. The same for parents – this story will produce several “aha” moments and cause for consideration. The illustrations are bright and playful and Rosalee’s personality jumps off the pages. The style is contemporary, irresistible and appealing to kids and adults. Little ones will engage in the story through the artwork and relate to Rosalee’s vibrancy.",
  "genres": [],
  "author": "Nicole Filippone",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/53551574-rosalee-the-seeker"
}