{
  "title": "Saving Dr. Warren",
  "description": "Steve O'Dell loves to write and does it well. But as an eighth-grade student at Needham Middle School, his talent sometimes seems more an embarassment than a blessing.Then, on Veterans Day 2001, Steve’s award-winning essay propels him into an adventure twisting through Revolutionary battles and bloodshed. Thanks to the bizarre bequest of a manuscript and a musket ball from a long-lost family war hero, Steve’s journey with the Revolutionary War hero Dr. Joseph Warren begins.A time-traveling talisman missing from the archives of one of Boston’s oldest historical societies takes Steve through portals of history, where he walks side by side with a real Boston patriot. He makes house calls with Dr. Warren on March 5, 1770 and stumbles onto the bloodstained streets of the Boston Massacre. From the killings of March 5, to boarding tea ships in 1773, Steve’s history book explodes to life as he helps Dr. Warren and forges a friendship with Boston’s True Patriot. Steve watches Dr. Warren launch Paul Revere on his midnight ride, and he helps Dr. Warren dodge British musket balls in the first battles of the War for Independence. With each adventure, Steve tastes the light that ignites The Revolution.Steve will eventually convince others that the Revolutionary relic he was given really does open portals through time, but he faces his most difficult quest alone—saving Dr. Warren from the onslaught at Bunker Hill. Can he do it? And if he fails, will he ever return to this century?Saving Dr. Warren...A True Patriot rips through the pages of history. From the Revolutionary War to the vanishing veterans of World War II, to the ashes of September 11, 2001, Saving Dr. Warren demonstrates to both old and young that patriotism, standing like an old oak tree on a grandfather’s farm, has and will endure.★ ☆ ★ ☆Author's NoteI love Historical fiction; it is a wonderful tool for learning. Saving Dr. Warren...A True Patriot is a historical fiction novel written for younger readers and middle school teachers. Within these pages are resources that junior high school teachers can use to help their class explore the impact of September 11th, World War II and the beginnings of the American Revolution.Through historical fiction, the author is able to provide young readers a perspective on what it would be like to experience 9-11 and the War on Terror as a middle school student, allowing history to come alive.Combat stories as told by a United States Marine and Medal of Honor recipient give middle school teachers the opportunity to share with students the Battle of Okinawa and impress upon them the sacrifices made for freedom. The importance of Veterans Day is also impressed upon Steve, the teenage protagonist, as he learns about his great uncle’s experience as a World War II Marine.Finally, Steve’s experiences with Dr. Joseph Warren will propel middle school readers into the beginnings of the American Revolution. All Americans have heard of Paul Revere, but how many know that it was Dr. Warren who sent his best friend out on the famous midnight ride? Junior high school students and teachers can experience the Boston Massacre, the Boston Tea Party, the battles of Lexington, Concord and Menotomy, as well as the Battle of Bunker Hill, through the lens of Dr. Joseph Warren, America’s forgotten hero.Saving Dr. Warren...A True Patriot was written to help teachers connect with these important historical events, while providing a fun adventure through history for teenage readers.",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Time Travel"
  ],
  "author": "Jeffery McKenna",
  "average_rating": "4.84",
  "url": "https://www.goodreads.com/book/show/53533476-saving-dr-warren"
}