{
  "title": "Beating Back the Devil: On the Front Lines with the Disease Detectives of the Epidemic Intelligence Service",
  "description": "IN THE WAR AGAINST DISEASES, THEY ARE THE SPECIAL FORCES. They always keep a bag packed. They seldom have more than twenty-four hours' notice before they are dispatched. The phone calls that tell them to head to the airport, sometimes in the middle of the night, may give them no more information than the country they are traveling to and the epidemic they will tackle when they get there.The universal human instinct is to run from an outbreak of disease. These doctors run toward it.They are the disease detective corps of the U.S. Centers for Disease Control and Prevention (CDC), the federal agency that tracks and tries to prevent disease outbreaks and bioterrorist attacks around the world. They are formally called the Epidemic Intelligence Service (EIS) -- a group founded more than fifty years ago out of fear that the Korean War might bring the use of biological weapons -- and, like intelligence operatives in the traditional sense, they perform their work largely in anonymity. They are not household names, but over the years they were first to confront the outbreaks that became known as hantavirus, Ebola virus, and AIDS. Now they hunt down the deadly threats that dominate our headlines: West Nile virus, anthrax, and SARS.In this riveting narrative, Maryn McKenna -- the only journalist ever given full access to the EIS in its fifty-three-year history -- follows the first class of disease detectives to come to the CDC after September 11, the first to confront not just naturally occurring outbreaks but the man-made threat of bioterrorism. They are talented researchers -- many with young families -- who trade two years of low pay and extremely long hours for the chance to be part of the group that has helped eradicate smallpox, push back polio, and solve the first major outbreaks of Legionnaires' disease, toxic shock syndrome, and \"E. coli\" O157.Urgent, exhilarating, and compelling, \"Beating Back the Devil\" goes with the EIS as they try to stop epidemics -- before the epidemics stop us.",
  "genres": [
    "Science",
    "Nonfiction",
    "Medical",
    "Medicine",
    "Health",
    "History",
    "Disease"
  ],
  "author": "Maryn McKenna",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/535383.Beating_Back_the_Devil"
}