{
  "title": "Daughter of Ethos",
  "description": "When the Star Daughter arrived in the Indorino universe she asked her First Commander to conduct health checks on Warriors sent on missions by the Emperor of Jenersar. Just as well he had Darby to help him. The one thing a world does not want to do is ignore a health check from Hawk Roeah. Elite Commander of Maikonia’s military, when he asks on behalf of the Star Daughter about the health of his Warriors stationed on their world. Oh, look, someone did, fools! And yet the world of Oraintarre or more precisely the Matriarch and the sisters of the house Oraintarre did exactly that when they were asked about the welfare of four hundred and fifty Warriors stationed on their world. Now we know that is not going to end well! Once again Peyton is forced to leave Prime with her family to find out why the planet Oraintarre is not answering questions about the Warriors. Peyton and her sisters are taking Heathers absence hard, so she is not in the best of moods already! Obviously the sisters from the house of Oraintarre have an attitude which will not serve them well. Especially when Peyton discovers what has befallen her Warriors. The Matriarch has instigated harsh disciplines for the Warriors who disagree with her policies. She and her sisters have also compromised some of the Warriors, reducing them to pets. The humiliation suffered from these strong, honorable males inflames the Star Daughter’s temper, and she shuts down the planet. Who never saw that coming? In the meantime Melody has a new gift emerging and finds she is a Tocho or matchmaker. And surprisingly she discovers she is bonded to Bacon, the Turquall kit Peyton named, in book two. Melody has her hands full, not only with Bacon but matching other Turquall to their bonded. It’s a race to see who’s more surprised, her or Rage. At the same time Rage is grappling with the notion Turqualls can and are bonding. He realizes he needs to give the Turquall of Maikonia their own identity, and so the Prowlers are created. Didn’t Peyton mention that name to him earlier? Within the pages of this book is intrigue, action, near deaths betrayal and unexpected romance as well as friendship new and renewed. Once again Peyton and her ever growing family, find themselves embroiled in initiating the Star Childs justice one planet at a time. It’s just what they do!",
  "genres": [],
  "author": "L.M. Lacee",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/53556666-daughter-of-ethos"
}