{
  "title": "Chase After Me",
  "description": "It’s an undercover mission. Get in. Get close to the woman. Get the intel. Get out. Should be easy enough. Right?Wrong.Chase Durant’s newest assignment goes wrong from the moment he meets Vivian Wayne. She’s not cold and calculating. The scientist is charming, funny, and absolutely freaking gorgeous. He’s supposed to be seducing secrets out of her. She’s supposed to be a selling classified intel. She’s supposed to be bad.She’s the best thing he’s ever seen.Doesn’t take long for the Wilde agent to realize that Vivian has been set-up, and the folks setting her up thought they could use Wilde to do their dirty work. Thought they could use Chase in order to make Vivian vulnerable so that she’d be the perfect target.Wrong.Instead of using her, Chase is determined to protect Vivian. The only problem? He’s been lying to her from day one, and things have…heated up between them. More like gone molten. Because Chase wants her more than he’s ever wanted anyone, and he’s not about to step back and let another agent take over her case. Vivian needs protecting, and he’s just the man for the job.Correction—he’s just the man for Vivian. He just has to prove that he can be the right one for her.Wrong.But when Vivian finds out that he’s been lying, how can she trust him? Time is running out, and Vivian’s heart is in tatters. She fell for the wrong man, and now she might pay for that mistake with her life. Chase seemed perfect. He flew past her defenses, and she thought he seemed might be just—Right.Chase won’t back down. He won’t give up. He’ll prove to Vivian that she can count on him. Prove to her that he will always put her first. Prove to her that he can be the right man for her. He simply has to destroy her all of enemies and convince Vivian to fall for him once more. Only this time, she’ll be falling for the real man. Not the lie.All in a day’s work for a Wilde agent…right?Author’s Note: Opposites don’t just attract—they explode. Sparks are gonna fly, lust is gonna burn, and Mr. Cocky and Confident Chase is about to fall hard for a woman who snuck right past his guard. Bam. There may be groveling involved before the book is done. And, of course, lots of scorching scenes. Happy ending guaranteed, no cliff-hangers—just fun, hot romance, and plenty of action.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Suspense",
    "Humor",
    "Adult"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/53539898-chase-after-me"
}