{
  "title": "The Junkyard Druid Series, Books 1-4",
  "description": "With over 1,000 pages of urban fantasy action and suspense, these novels have 680+ 5-star reviews.MEET COLIN MCCOOL.Reluctant druid, and sole apprentice of the last living master druid on earth. Heir to Fionn MacCumhaill’s legacy. Hunted and feared by the Fae, and cursed with Cú Chulainn’s ríastrad. All he wants is to live in his junkyard in peace... but the gods have other plans for the young druid apprentice!JUNKYARD DRUID #1When a reluctant druid gets blackmailed into working for an evil faery queen, he'll walk through fire to complete one last job⁠—come hell or high magic!GRAVEYARD DRUID #2When the local vampire coven hires him to stop an undead outbreak at the city graveyard, it sounds like money in the bank to everyone’s favorite down on his luck druid, Colin McCool. But when you’re cursed by an ancient Fae sorceress with a score to settle, nothing is ever as it seems…MOONLIGHT DRUID #3When a Fae child goes missing, Colin is hired to bring him back. Now he has to crack the case, all while learning to control his shifter abilities under the watchful eye of the local werewolf alpha. But with half the pack against him and enemies at every turn, will his next misstep be his last?UNDERGROUND DRUID #4Colin is hellbent on bringing vengeance to the doorstep of the Fae. To do so, he’ll have to complete an impossible task to earn passage into the mystical realm of Underhill. Will he outwit the Fae and survive this deadly undertaking? Or, will he be trapped in Underhill… forever?>>>If you enjoy urban fantasy novels that feature snarky male protagonists, grab a copy and start reading this 1,000+ page urban fantasy box set today! ​What Readers Are \"I was afraid that The Junkyard Druid was going to be another cheap Harry Dresden knockoff, but boy am I glad to be so wrong. It's hard to put into words why I enjoy this series so much. Maybe it's the humanity or the author's willingness to take on very real subjects like sex trafficking. I don't know. Whatever the reason, I'm hooked on the series.\" ~Matt S.\"I absolutely loved these books from the 1st sentence of the beginning of book one, to the last period... Great writing. On your seat throughout each chapter. Addictive. Never want to put the book down. And you think of it when not reading. Thank you for writing these amazing books for us humans to read!\" ~Laurie H.\"In a genre that has become saturated by new authors, I never have a doubt about Michael’s books. They’re always exciting and give me hours of entertainment. My only complaint is he doesn’t pop out one epic novel a month!\" ~Kenneth B.",
  "genres": [
    "Paranormal",
    "Urban Fantasy"
  ],
  "author": "M.D. Massey",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/53576344-the-junkyard-druid-series-books-1-4"
}