{
  "title": "Soul of the Age: A Biography of the Mind of William Shakespeare",
  "description": "“One man in his time plays many parts,His acts being seven ages.”In this illuminating, innovative biography, Jonathan Bate, one of today’s most accomplished Shakespearean scholars, has found a fascinating new way to tell the story of the great dramatist. Using the Bard’s own immortal list of a man’s seven ages in As You Like It , Bate deduces the crucial events of Shakespeare’s life and connects them to his world and work as never before.Here is the author as an infant, born into a world of plague and syphillis, diseases with which he became closely familiar; as a schoolboy, a position he portrayed in The Merry Wives of Windsor , in which a clever, cheeky lad named William learns Latin grammar; as a lover, married at eighteen to an older woman already pregnant, perhaps presaging Bassanio, who in The Merchant of Venice won a wife who could save him from financial ruin. Here, too, is Shakespeare as a soldier, writing Henry the Fifth’s St. Crispin’s Day speech, with a nod to his own monarch Elizabeth I’s passionate addresses; as a justice, revealing his possible legal training in his precise use of the law in plays from Hamlet to Macbeth ; and as a pantaloon, an early retiree because of, Bate postulates, either illness or a scandal. Finally, Shakespeare enters oblivion, with sonnets that suggest he actively sought immortality through his art and secretly helped shape his posthumous image more than anyone ever knew.Equal parts masterly detective story, brilliant literary analysis, and insightful world history, Soul of the Age is more than a superb new recounting of Shakespeare’s experiences; it is a bold and entertaining work of scholarship and speculation, one that shifts from past to present, reality to the imagination, to reveal how this unsurpassed artist came to be.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Biography Memoir",
    "Literature",
    "Literary Criticism",
    "British Literature"
  ],
  "author": "Jonathan Bate",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/5357813-soul-of-the-age"
}