{
  "title": "Through the Fire: Omnibus Edition",
  "description": "Even burned by a dragon’s fire, Ruethwyn refuses to give up on those who were stolen from her.This is a collection of three novels, The Avatar’s Flames, Queen of Ice, and The Obsidian Palace, as well as several side stories primarily set after the events of the books.The Avatar’s by the attack of a dragon, Ruethwyn was only spared by the grace of the mercurial dark elf Essryl, who gave Ruethwyn two years to save her beloved from captivity or risk losing her forever.Whisked away to the premier mage academy of Selwyn, Ruethwyn finds herself among those who believe she is useless, but she refuses to give up. Her determination propels her through all obstacles in her path, and she is joined by an aspiring mage-knight, an enthusiastic kitsune, and a quiet but loyal healer.Opponents may threaten all Ruethwyn hopes to achieve, but they don’t know something important.They don’t know that nothing will stop Ruethwyn from rescuing those she loves, not even having half her body burnt away.Queen of and her friends survived Midwinter Night and the attack of demons, but it’s only the start of her journey. If Ruethwyn wishes to restore her body and rescue her beloved from a dragon, there is much she must do beyond finishing her first year at Selwyn’s mage academy. Her path leads to the Frostglades to the north and the temperamental fair folk within, along with the unknown power they possess.The hopes of many others lay on her shoulders, and Ruethwyn is willing to brave the threat of assassins and the machinations of a dark elf to succeed. Yet even still, she does not know what it is she will find at the Frostglades’ heart, or what it is capable of.The Obsidian the blessing of the fey and others who she barely dares dream of, Ruethwyn’s body is whole once more. Turning to the future, she sets her sight on her beloved who was stolen away by a dragon. Yet even with all her magic at her command, Ruethwyn stands little chance against such a powerful foe, so she must tread lightly.Other foes threaten to halt Ruethwyn’s efforts even now, though, foes that would kill her or imprison her. With her friends at her side, Ruethwyn will face any threats that stand in her way, especially since her friends have become dearer than she’d imagined. Still, any romance will have to wait, for at long last Ruethwyn can act.The only question is if she’s ready for an unexpected figure from her past. A figure she thought gone forever.Also included in this volume are three short stories, exploring Ruethwyn’s youth and what comes after The Obsidian Palace.",
  "genres": [
    "Fantasy"
  ],
  "author": "Benjamin Medrano",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/53584890-through-the-fire"
}