{
  "title": "The Royal Trials: Complete Series",
  "description": "THE ROYAL COMPLETE SERIES is all three books in The Royal Trials trilogy as well as an EXCLUSIVE BONUS EPILOGUE SCENE. Book 1: IMPOSTER Three trials. Three weeks. Three Royal Princes.It should have been an easy task, for a skilled mercenary like Rybet Waise. Simply break into the royal palace, and rescue her friend from the executioner's block. But when Rybet accidentally qualifies for the Trials, she finds herself with little choice but to see them through.A thin veil of etiquette, elegance and glamour hides the true nature of the Trials. Behind closed doors, they are brutal and bloody, and to fail means to forfeit her life.Thrust into the limelight and forced to compete with the Kingdom's elite sweethearts, unlikely allies emerge and bonds are formed. But someone will stop at nothing to see her fail.After all, she's nothing but a dirty pond-dweller.Rybet will do whatever it takes to survive until the Golden Ball, Princes be damned.Book 2: SEEKER One quest. One crown. One shattered heart.The Royal Trials were never meant to be easy, not even for an imposter like Rybet Waise. But nothing could have prepared her for the magical storms, mutated animals and malicious gods standing in her way.There is no time for tears, mere hours after being bathed in Prince Alexander’s blood, Rybet must embark on a quest. The second trial dictates she find a missing magical artefact--Queen Ophelia's crown.Released from the overbearing confines of the royal palace, Rybet competes not only with the other remaining ladies, but also with the land itself. Magic is more volatile than ever, and the gods have come out to play.Royal love interests who don’t know how to share only make things harder for this dirty pond-dweller--if that’s really all she is.Rybet will do whatever it takes to make it out alive, and with her heart unbroken.Book 3: HEIR A corrupt King. A murdered Queen. A missing Princess… Found.Once upon a time, The Royal Trials were a sacred ritual designed for a queen to select her king. But nothing is as it was in the kingdom of Tiech. Not since the brutal murder of beloved Queen Ophelia.The town of Ironforge revealed important secrets, but it all came at an unbearable cost. The streets run red with the blood of innocents and Rybet's heart is heavy as she returns to Lakehaven.Facing court and her mother's murderer will require more than just a brave face. She will need the skill, intellect and support of those who love her. Or what's left of them.Torn between love and duty, Rybet faces decisions she never thought she would have to make.This long lost princess will do whatever it takes to make it to the Golden Ball, even at the cost of her own happiness.**PLEASE This is a reverse harem romance, meaning the leading lady ends up with 3+ love interests and does not choose between them. If that's not your cup of tea, this isn't the series for you!**",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Magic",
    "New Adult",
    "Romance",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "Tate James",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/53634857-the-royal-trials"
}