{
  "title": "The filthy Hands and other Poems",
  "description": "REVIEWS ABOUT THE BOOK“After studying thirty-nine of the poems in the collection, The Filthy Hands & Other Poems, I am left with a feeling of joy, happiness, accomplishment, and peace. The journey took me to a faraway land in Nigeria. Words, images, culture, and dreams came to life in the poetry. The author did an amazing job of creating vivid scenes and colorful lives. The narration is well crafted and shows the versatility of the author as they were able to create many characters with varying character traits and ambitions. I would highly recommend reading the entire collection on more than one occasion. It has been an interesting ride through the poetic mind of Steve Anc.”Katina Woodruff Borgersen USA“I like poetry that makes me think and reason through the artist's mind, and that is exactly what Steve's poems urge us to do. His collection in this book presents a dare to discover and to embrace a moment in time that he wants the reader to mull over for a while and come to a conclusion after reflection. In my opinion, that is the mark of an excellent writer. I thoroughly enjoyed Steve's gift of poetry to evoke contemplation of life.” Cherie Leigh Sumner, North Carolina, United States of America“The Filthy hands exposes the true nature of situations in most areas of life. I can relate this message to the injustice and cruelty that affects our society today politically, economically, educationally, environmentally, health-wise and, so forth.” Utti Adaeze Ifeanyichukwu, Dubai, UAE“I loved all of his poems. He has the great taste of poetry and literature. Most of his poems reflect the nature of beauty, love, and romance. Steve Anc is an addition to the assets of literature. I wish his work get acceptance and attention it deserves. Best of luck.” Ahsan Siddiqui, Pakistan“I’ve never been attached to poems until I came across this series. It’s entertaining and very informative at the same time. My favorite poem in this book is “A joyful heart”. This poem is tailored to good people like you so that we can help make this world a better place. Understanding other people’s feelings and placing ourselves in their shoes can make them feel better. Steve Anc is indeed a lover of words.” Amos Gikunda, Kenya“I read all his poems and I’d say that poet Steve Anc is a beautiful addition in the world of literature. His poems inspire the reader more to know the modern way of poetry. Love as usual is the soul of every poetry and Steve Anc's poems are a blend of love, romance and also an attraction towards nature. In his first attempt, he has achieved what most poets don’t. He is a shining star in the world of poetry. May his work renowned & he make progress by leaps and bounds in his work.” Muhammad Azad, Pakistan“A deep and thoughtful writer. When first read I was not sure of its meaning until I rationalized it could be a rape victims’ dilemma. You have a vast vocabulary that you draw upon. The deepness of the poem stems from hidden feelings that she cannot escape. It lives within her. Good work Steve.” Dennis Borgersen, United States of America“I enjoyed reading the poems by Steve Anc and look forward to seeing more from this talented writer.” Karl-Heinz Limberg, GermanyBOOK DESCRIPTIONThe inspiration for writing the collection came from my quest for a deep understanding of poetry. The desire to bring my numerous works to a unique collection came to me after immersing myself in the deep ocean of poetry and drenched by its beauty and joy of been called a poet.",
  "genres": [],
  "author": "Steve Anc",
  "average_rating": "4.94",
  "url": "https://www.goodreads.com/book/show/53605057-the-filthy-hands-and-other-poems"
}