{
  "title": "Fallout: Nuclear Bribes, Russian Spies, and the Washington Lies that Enriched the Clinton and Biden Dynasties",
  "description": "\"This book is a MUST BUY!\" – President Donald J. Trump   \"The Russia and Ukraine scandals are unraveled, corruption and greed exposed. No one is better at uncovering the truth than these two investigative journalists.\" – Gregg Jarrett, FOX News legal analyst and author of the #1 NYT bestsellers The Russia Hoax and Witch Hunt   An exhaustively researched book that reads like an investigative thriller, Fallout reveals how Obama’s “Russian Reset” led to corruption, scandal, and a desperate bid to impeach Donald Trump.In 2015, a major story broke exposing Hillary Clinton’s role in approving the sale of American uranium assets to the Russian state nuclear agency, Rosatom. Not only did the sale of Uranium One put 20 percent of America’s domestic uranium supply under the control of Vladimir Putin, there was also evidence that the Clintons themselves had hugely profited from the deal.  When presidential candidate Donald Trump made Uranium One the centerpiece of his “Crooked Hillary” attacks, the Clinton team feared its potential to damage Hillary’s campaign. Others in the Obama-Biden camp worried that if elected, Trump would expose their role in selling out America’s security to Putin. Their desperate need to neutralize the issue led them to launch an unprecedented investigation into the Trump campaign’s purported ties to Russia.  The infamous Steele dossier, produced by Clinton-connected Fusion GPS, sparked an investigation under FBI Director James Comey. Instead of ending after the election, the investigation grew bigger, eventually leading to Comey’s firing and the appointment of Special Counsel Robert Mueller. When Mueller failed to find grounds for impeachment, Democrats seized on an ambiguous phone call with the Ukrainian president as a pretext to remove Trump from office. This gambit blew up in their faces when it exposed the secrets that Democrats tried hard to keep buried.  An indispensable guide to the hidden background of recent events, Fallout shows how Putin’s bid for nuclear dominance produced a series of political scandals that ultimately posed one of the greatest threats to our democracy in modern American history.",
  "genres": [
    "Politics",
    "Audiobook",
    "History",
    "Nonfiction",
    "Crime",
    "American",
    "Political Science"
  ],
  "author": "John Solomon",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/53638080-fallout"
}