{
  "title": "Crave Me",
  "description": "Four strong minded best friends find their own mysterious, tall, dark and handsome forever-men in this steamy romance collection.Four best selling books that'll keep you turning the pages .Submitting To The BillionaireNikolaiWhen people look into my eyes they realize instantly that there is more pity to be found looking into the eyes of a cobra.I'm ruthless, heartless, and I have the Midas touch.Everything I touch turns to gold. There is not one thing I wanted that I have not ultimately conquered and made mine.Star belongs to another man, but I have to have her.Some will wait for fate. I don't. I make things happen.When I want something. There are no rules... All's fair in lust and war. RedemptionRavenI haven't dated in years. I've been too busy raising my niece.The death of my sister left me heartbroken. God knows if it hadn't been for the child I don't know how I would have coped. Anyway, I didn't have time for men. Non stop work and caring for Janna has been my life.Until he came...Konstantin Milosevic.The mysterious, enigmatic man that fate so unexpectedly delivered to me. He is so charismatic and breathtakingly handsome that I can't believe that such a god would want plain ole me. He ignites fires in me that no one has lit before. He's in my thoughts every waking moment. I can't stop thinking of him. He always seems to turn up wherever I go and there's something dark and dangerous lurking in his eyes.My friend Cindy urges me to seize this chance. \"You need this girl,\" she says, but I'm scared. I'm afraid that this man has the power to uncover my darkest, most secret desires.He could destroy me...but I can't help myself.I'm as drawn to him as the moth is to the flame.The Heir - RosaWith those searing whiskey eyes, chiseled face, and cocky attitude it was pretty obvious he was a player. Ordinarily, I would have been able to resist him, but it was my best friend's wedding, and I'd had a lot of alcohol, so I thought, what the hell. At the very least he'd have the skills, and judging by that huge swell in his pants, the equipment to give a bridesmaid a good time.Of course, we used a condom, actually, a few, but one month later I'm sitting on my bathroom floor looking at five pregnancy sticks all lined up. Each one telling me the same thing: Girl, you're pregnant.Clearly, he won't want to know, being a player and everything, but my best friend says telling him is the right thing to do. Looks like I'll have to go to Italy to give him the bad news.-Nice Day For A White Wedding-CindyMy three best friends are hitched and deliriously happy, and sometimes I wonder if I'm missing out, but then I tell myself I have a different dream. It's on the back burner because I'm saving up. One day I won't be the manager of someone's casino I'll be the manager of my own casino.I'm not greedy. Even a small casino, something like the one where I'm working at presently would do.And then a man, a dangerous, mysterious, delicious man, walks into the casino.He dangles my dream right in front of me. The problem is he is two dreams mixed up in one.Suddenly the other dream, the one I had buried deep in my heart took a big gasping breath and pushed its way to the surface.Suddenly, all I wanted was what my best friends wanted.But all he was offering was the other casino dream.Not the secret dream...",
  "genres": [],
  "author": "Georgia Le Carre",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/53615716-crave-me"
}