{
  "title": "One Hundred Years of Exile: A Romanov’s Search for Her Father’s Russia",
  "description": "Winner Gold for Memoir , Northern California Publishers & Authors Awards\"A vividly intense and personal saga... It  stirred such powerful emotions ... \"--Marina Romanov, grandniece of Tsar Nicholas II of Russia\"A gripping family account...couples cinematic drama with both tragedy and triumph .\"--Kirkus ReviewsOne woman's journey through 100 years of history to find peace with her father . Tania Romanov Amochaev and her father were both exiled from their homelands as infants; both knew life in refugee camps. Their shared fate does not lead to mutual understanding.The family's immigration to San Francisco heralded a promising new future―but while Tania just wanted to be an American, her father could not trust that this was his final asylum. His fears and his resistance to assimilation leave Tania with deep resentment toward him and her Russian heritage. Decades later, his unexpected death exposes Tania's open wounds and a host of unanswered questions about her father and his story.A serendipitous meeting with a last surviving member of the Russian royal family, followed by a baffling error that miraculously connects her with unknown relatives, catapults Tania on a quest for answers in her father's homeland.Tania's story proves inseparable from Russia's, featuring Cossacks who fled revolution, a family who survived Stalin, and a family of royal exiles, culminating in a meeting between princess and peasant.One Hundred Years of Exile is a moving story of how revisiting the past can bring not only forgiveness and redemption, but something far more powerful as well.\"Romanov has situated her absorbing story exactly at the intersection of history and memoir. It's a wonderful read .\"- Tamim Ansary, author of Destiny A History of the World Through Islamic Eyes",
  "genres": [
    "Memoir",
    "Nonfiction",
    "History",
    "Russia",
    "Biography",
    "Travel"
  ],
  "author": "Tania Romanov",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/53608528-one-hundred-years-of-exile"
}