{
  "title": "Sparking Magic",
  "description": "Three sexy elemental mages, a shifter and a magic freak who sparks their magic in weird ways. Yeah, what could go wrong in this scenario? Welcome to the Protectors Academy!I don’t know who I am. I don’t know how I got here. But I know if I stop running, I will never be free.When I burst from the woods into a rush of headlights and asphalt and open night sky, I think I’ve made it. I’m safe. Then a blinding burst of energy explodes in front of me and the last thing I see before it all goes dark is a handsome face hovering over mine. Yay me, right?But when I open my eyes, I find myself magicked to a hospital bed with some non-handsome guy telling me they’ve never seen my kind of magic before. At least, not in this world. The way they see it, the choice is simple: enroll in their magic academy and learn to manage my power or spend the rest of my life in a cage. And that’s how I land at Protectors Academy, a cut-throat magic boarding school where the heirs of the rich and important rule while they compete for an elite position on the borderlands.But I am not safe here, either. I’m being followed, a group of mean girls is on my case and four of the hottest guys on campus don’t know what to do with me. And that’s before someone comes after me and the entire school blames me for burning down my own dorm room. All I want to do is pass their tests and get out of here. But first, I have to survive. Reverse Harem Academy readers will want to scroll up and one-click to this action-packed, mystery-filled steamy romance. Publisher’s Note: Protectors Academy: Sparking Magic is a full-length reverse harem supernatural fantasy academy series with magic and steam meant for mature readers.",
  "genres": [
    "Reverse Harem",
    "Fae",
    "Fantasy",
    "Romance",
    "Magic",
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "Nika Gray",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/53612199-sparking-magic"
}