{
  "title": "Island in a Storm: A Rising Sea, a Vanishing Coast, and a Nineteenth-Century Disaster that Warns of a Warmer World",
  "description": "“[F]ast-moving narrative… He makes it all vivid and immediate and very human...\"-- Susan Larson, USA Today and New Orleans Times Picayune\"Sallenger provid(es) us with a window into the tragedy as if we are standing on the beach feeling the sand sting our eyes and the waters rise up our bodies... It's a riveting account of a horrible disaster.\"-- Chere Coen, Lafayette Advertiser“I simply could not put the book down. It is a riveting story, made all the more so because it is fully factual. Further, it could happen to Southwest Florida and our own barrier islands. …[T]he potential for this is very real.”-- Lisa Fasulo, Naples Daily News“[T]he book unwinds compelling narrative about life in mid-1800s Louisiana, the storm itself, all while integrating an important public policy message about the vulnerability of living on unprotected coastlines. [A] finely written narrative, I highly recommend the book…”-- Eric Berger, Houston Chronicle, SciGuy Blog“[F]or those who like a good read about historical events, the prose [of Island in a Storm] is elegant and fast-moving. Abby Sallenger tells a more than 150 year old story brilliantly. Not only does he spin a good historical tale, he inspires some deep thinking about the future of our fragile coastline.”-- Diane Moore, A Word’s Worth blog\"Throughout Island in a Storm, Sallenger maintains a degree of narrative suspense, and he effectively captures multiple points of view. With his focus on factual details, human reactions to the storm and ... sense of empathy, the author achieves a gripping synthesis of storytelling and history.\"-- Thomas Uskali, Louisiana Cultural Vistas Magazine“One of the best parts of this book was the connection I felt to the characters. Knowing that they were real people, and that they had LIVED through this hurricane, made the pages turn even faster. I could hardly put it down, and took it with me everywhere until I finished it (within a DAY! YES, it is that good). One thing that good writing possesses is the ability to draw the reader in. This book has it in spades.”-- Dr. Jessie Voigts, Wandering Educators, Book Reviews“Rarely does a book combine fascinating story-telling, regional history, and a science lesson in one compelling package. Island in a Storm does just that. The tale is more than 150 years old, but there are real lessons to be learned for coastal communities on today’s vulnerable barrier islands.”-- Robert S. Young PhD, director, Program for the Study of Developed Shorelines, Western Carolina University, co-author of The Rising Sea“Island in a Storm tells the riveting story of one of America's greatest hurricane disasters… Sallenger's first-class story-telling of the remarkable tales of survival … make this a book well worth reading.”-- Jeff Masters, PhD, Director of Meteorology, Weather Underground, Wunder Blog[A]n absorbing book that reads more like fiction than fact. The book is a great read for geo-novices, fans of science history and anyone who likes a good adventure tale… Sallenger’s… discussions on a range of scientific topics … are explained in such plain language that nonscientists may not even realize they are learning the basics of coastal geology.-- Erin R. Wayman, Earth Magazine“Few authors have been able to convey with such clarity and power the complex geologic processes of coastal waters under storm conditions, particularly the chaotic commingling of ocean waves, tidal currents, storm surges, sand erosion, and elevated sea level that can at times cause wholesale destruction of such fragile, low-lying landforms of sand.”-- P.R. Pinet, Choice: Current Reviews for Academic Libraries“Abby Sallenger expertly combines the history of a hurricane and its disastrous impact with the fascinating science of hurricanes and coastal geology. He illustrates the dangers that a rising sea, a subsiding coast, and hurricanes pose to populated shores, and with a loud wake up call, he warns policymakers and home owners who insist on building or rebuilding on barrier islands.”-- Ellen Prager, PhD, chief scientist, Aquarius Reef Base and author of Chasing Science at Sea“This is a wonderful book, a must-read for anyone interested in our future, which shows how historic tragedies can be lessons, especially as climate change speeds along its merry way.”-- Ivor van Heerden, PhD, author of The Storm: What Went Wrong and Why During Hurricane Katrina—the Inside Story from One Louisiana Scientist“A masterful page-turner juxtaposing the remarkable parallel tales of the survival by a 19th century Creole maiden of a catastrophic hurricane with the staggering geological perils confronting the residents of the fragile Gulf coastline today.”-- Bethany Ewald Bultman, author of Reflections of the South, Compass New Orleans, and Compass Gulf South, and the descendent of thirteen victims of the 1856 Isle Dernier Hurricane“By weaving the stories of the people on Last Island with facts on history, erosion, sea levels, weather patterns and how hurricanes form, Sallenger penned a book that is both interesting and educational.”-- Pam Bordelon, Baton Rouge Advocate\"In ISLAND IN A STORM one of America's top oceanographers—Abby Sallenger—documents the perils of coastal erosion. Using Isle Derniere as case-study, Sallenger brilliantly explains what happens when the sea rises and land disappears. A very important book!\"-- Douglas Brinkley, Professor of History, Rice University and author of The Great Deluge: Hurricane Katrina, New Orleans, and the Mississippi Gulf Coast“Sallenger goes into wonderful detail about the geography of the Last Island, how and when it formed and what happened to it in the storm... “[R]eally good book… \"-- Greg Langley, Baton Rouge Advocate",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Environment",
    "United States"
  ],
  "author": "Abby Sallenger",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/5360601-island-in-a-storm"
}