{
  "title": "Initiate",
  "description": "Dindi yearns to dance. But will her tribe allow it?Dancing is forbidden......except for those who pass the secret rites of Initiation.Because dancing creates magic. And magic is dangerous.But not as dangerous as the lithe and lethal Warrior-Dancer who saved her life.He’s the son of the Last Fae.He’s forbidden.He’s an exile.And War and Death radiate from him like the colors in his aura.Will she pass the Initiation?What if the price turns the man she loves into an enemy?* * *READERS RAVE ABOUT THE UNFINISHED SONG SERIES!“There is a wonderful harmony about this world, intriguing characters, and a great plot! I am a huge fan of fantasy novels and this one is the beginning of an epic tale.” - Star“This book is totally unique, and a great fantasy read. I have never read anything quite like this. The world-building is well thought out. The two main characters are resourceful and memorable… I really enjoyed this book, and cannot wait to read the rest of the series.” - Karyn-Anne Brown \"Mad for Romance\"“Wow. Holy smoking wow. This is one of the few books I've read that I can honestly say was totally, 100% original.” - Oktopus Ink“In the first book Unfinished Initiate, Tara Maya deftly introduces her characters. Dindi-the troubled misfit, Kavio-the exiled son of a great leader, Rthan-A war leader bent on revenge, Gwenika-the ill daughter of Zavaedi Brena, just to name a few… She also introduces us to Faearth. A wondrous world of faeries and magic. While reading her descriptions of the land, and its tribes, it reminded me of The People Books by W.Michael and Katheleen O'NealGear.” - AimeeKay“Don't let the girly fro-fro cover fool you. Behind the rich, detailed world-building lies the heart-beat of a epic fantasy tale that rises above the bounds of mythology and into a coming-of-age novel that will leave the reader yearning for more. The author clearly dips her plot and characters in several different mythologies, yet the book has a distinctive voice that tugs at your heartstrings.” - Anthony Pacheco \"Tony\"“I liked that Dindi, our heroine, is not only conscious of her differences but embraces them despite insurmountable criticism from her clan. She beats to the tune of her own drums and doesn't give up on her dreams no matter how others might view them.” - Soleil Noir \"S. Noir\"“The author creates an intriguing world of fractious tribes and complex societal rules that a young girl must learn to survive and navigate if she's ever to achieve her potential with magic.” - Alex Binkley“I absolutely loved it, could not put it down. The character development is deep, the descriptions of the environment make you feel like you are there. I am waiting for this series to go big--it deserves to.” - M. DeTuri“Maya's wit is quick and clever.” - Joshua G. VanDerWouden“Tara Maya has gifted us with a wonderful new world of epic fantasy.” - David“The magic here is subtle, a natural extension of the world, but lovely to behold. The fairies, Dindi's visions, the dance of the Tavaedi, and all the other magical elements are a nice counterpoint to the realities of a life amidst ancient tribes. As for the use of a civilization not far removed from the stone age, it's a nice change from the standard medieval-tinged fantasy upon which so many authors seem to dwell.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Fairies",
    "Fiction",
    "Paranormal",
    "Fae"
  ],
  "author": "Tara Maya",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/10275728-initiate"
}