{
  "title": "To Love a Prince",
  "description": "Daffodil Caron is not a princess, even though she once dreamed of being one. After all, she grew up as a playmate to royal princes, running through the halls of Perrigwynn Palace and dining with the queen. But the day she stumbled upon a royal secret, everything changed.Flash forward eighteen years, and Daffy’s living a sweet, non-royal life. A skilled art curator for the Royal Trust, she has friends, a flat in the heart of the city, and a handsome, successful fiancée. The last person on her mind is Gus, a prince she once called her best mate.HRH Prince Augustus is no longer “Prince Pudgy,” as caricaturized by the press, he’s charming and gorgeous, possessing a world-famous smile. But when he’s jilted at the altar by an American heiress as millions of people around the world watched, the spare heir to Lauchtenland’s ancient House of Blue escapes, finding solace on a Florida beach.A year as a regular bloke allows him to rethink his purpose. He’s half decided his calling is to pour pints at a tiki bar, rather than serving his country and the Family.Until an accident on the beach with a Frisbee changes his course.Despite his long hair and beard, Daffy recognizes her prince, and their childhood friendship is renewed. She assures Gus Lauchtenland needs him, giving him the courage to return home.When Daffy and Gus find themselves on assignment to Hadsby Castle in preparation for his brother’s wedding, their friendship blooms into affection.But Gus cannot, will not, trust his heart again. Daffy’s engaged. And she also remains a royal family outcast because she knows the Queen’s secret.When affection grows into love and secrets are exposed, trust is destroyed. Gus must choose which is stronger: the lies of his past or the hope of his future. And Daffy must face every fear to prove she will forever love a prince.",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Contemporary",
    "Fiction",
    "Christian Romance",
    "Christian",
    "Audiobook"
  ],
  "author": "Rachel Hauck",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/53627673-to-love-a-prince"
}