{
  "title": "A Loser's Revenge",
  "description": "I watch from the shadows of trees against the cars lining the street. Invisible to the three I keep under my anger filled glare.Dressed in black, I have the hood of my zip-up hoodie pulled over my head and drawn closed as I fade into the afternoon shadows to observe and plan my revenge. They probably wouldn’t recognize me if they did see me standing here. I’ve changed a lot over the past nine years and I’m no longer the slightly chubby kid who wore overalls or t-shirts and jeans everyday of the week until I was thirteen and everything changed. Everything. When my best friends became my worst enemies.I watch as Seamus, Hayden, and Axel laugh and joke around in their front yard and toss a football back and forth between one another. We’re only a five minute walk from the college we all attend, a college I just transferred to mid semester of our senior year. They don’t know I’m here and that’s the way I want to keep it for a little bit longer. I patiently watch, waiting for them to leave for the football game so I can begin my plan.I will get my revenge.Barretta Dawn Bowers thought she had the three best friends in the whole world. There was nothing and no one that could come between them. Never in a million years did she think that they would be the reason for their friendship to be torn apart and her heart to break. Having moved to Florida with her aunt when her whole life had been turned upside down it isn't until nine years of being gone and a family emergency calls her home does she return to Oklahoma.Transferring to the local college and moving into an apartment close to campus with her best friend who tagged along for support, old memories and anger start rising to the surface when she soon finds herself face to face with her ex-friends turned enemies. To keep her mind off the troubles at home she begins to plot the revenge she promised herself so long ago.*Trigger Warnings*This Contemporary college-age romance is a medium/fast burn RH and contains several themes that readers should be aware of: swearing (shocking, I know), flashbacks of bullying, present revenge, and sexual themes suitable for 18+",
  "genres": [
    "Reverse Harem",
    "Contemporary",
    "Romance",
    "College",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Dark Romance"
  ],
  "author": "Tammi Lynn",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/53644085-a-loser-s-revenge"
}