{
  "title": "The Third Reich in Power",
  "description": "The definitive account of Germany's malign transformation under Hitler's total rule and the implacable march to war.  By the middle of 1933, the democracy of the Weimar Republic had been transformed into the police state of the Third Reich, mobilized around the cult of the leader, Adolf Hitler. If this could happen in less than a year, what would the future hold? Only the most fervent Nazi party loyalists would have predicted how radical the transformation ahead would be.  In The Third Reich in Power, Richard J. Evans tells the story of Germany's radical reshaping under Nazi rule. Every area of life, from literature, culture, and the arts to religion, education, and science, was subordinated to the relentless drive to prepare Germany for war. His book shows how the Nazis attempted to penetrate and reorder every aspect of German society, encountering many kinds and degrees of resistance along the way but gradually winning the acceptance of the German people in the long run.  Those who were seen as unfit to be counted among the German people were dealt with in increasingly brutal terms. The Nazi regime took more and more radical measures against the racially \"unfit,\" including Germany's Jews, Gypsies, homosexuals, mentally ill, \"asocial\" and \"habitual\" criminals. After six years of foreign policy brinkmanship that took the Nazi regime from success to success, Hitler's drive to prepare Germany for the war he saw as its destiny reached its fateful hour in September 1939. The war he unleashed was to plunge the world into a maelstrom of genocide and destruction. The Third Reich in Power is the fullest and most authoritative account yet written of how, in six years, Germany was brought to the edge of that terrible abyss.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Germany",
    "War",
    "Politics",
    "European History"
  ],
  "author": "Richard J. Evans",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/536788.The_Third_Reich_in_Power"
}