{
  "title": "Gita Abhyas : Bhagavad Gita In Practice - Inspirational book to change your life",
  "description": "Many of you might have read Bhagavad Gita but after reading it, are you able to keep it in practice? Are you able to follow what is told in Bhagavad Gita in your daily life? If you are not able to keep Bhagavad Gita in practice then mere reading will not help.In Bhaja Govindam Jagadguru Adi Shankaracharya mentioned that by practicing even a little of Bhagavad Gita one can get out of the life and death cycle and attain moksha. By this we can understand how important it is to keep Bhagavad Gita in practice.Now you want to practice what is told in the Bhagavad Gita and change your life? But don’t know how to keep it in practice?Then the story GITA ABHYAS – Bhagavad Gita in Practice will teach you how to keep Bhagavad Gita in practiceGita Abhyas is the story of a regular boy, Partha, who wanted to become an IAS officer. But, after his last failed attempt, he gets depressed and doesn't know how to proceed further. Until one day, when he met someone (Guru) who changed his life forever...This book is mostly aboutWhat Guru teaches Partha?How Partha practiced themWhat are the difficulties Partha faces while practicing themAt the end will Partha be able to crack civils?How Partha grown as a person with the Guru’s teachingWho is the Guru?In this book concepts of Bhagavad Gita like Karma yoga, Bhakthi yoga, Indriya nigraha, karma phala sanyasa yoga etc are explained in an easy and simple way by giving many practical examples. After reading this book you will not only understand the concepts of Bhagavad Gita but also you will be able to practice them as its clearly mentionedThis book is for people- Who want to understand and keep Bhagavad Gita in Practice- Who want to achieve great things and success in life- Who are seeking spiritual and religious knowledge",
  "genres": [],
  "author": "Venkataramana Modi",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/53667733-gita-abhyas"
}