{
  "title": "Five Little Indians",
  "description": "Canada Reads 2022 Governor General’s Literary Award for Fiction Amazon First Novel Award Kobo Emerging Author Prize  Scotiabank Giller Prize Atwood Gibson Writers Trust Prize BC & Yukon Book Prize Indigenous Voices AwardsNational Bestseller; A Globe and Mail Top 100 Book of the Year; A CBC Best Book of the Year; An Apple Best Book of the Year; A Kobo Best Book of the Year; An Indigo Best Book of the YearTaken from their families when they are very small and sent to a remote, church-run residential school, Kenny, Lucy, Clara, Howie and Maisie are barely out of childhood when they are finally released after years of detention.Alone and without any skills, support or families, the teens find their way to the seedy and foreign world of Downtown Eastside Vancouver, where they cling together, striving to find a place of safety and belonging in a world that doesn’t want them. The paths of the five friends cross and crisscross over the decades as they struggle to overcome, or at least forget, the trauma they endured during their years at the Mission.Fuelled by rage and furious with God, Clara finds her way into the dangerous, highly charged world of the American Indian Movement. Maisie internalizes her pain and continually places herself in dangerous situations. Famous for his daring escapes from the school, Kenny can’t stop running and moves restlessly from job to job—through fishing grounds, orchards and logging camps—trying to outrun his memories and his addiction. Lucy finds peace in motherhood and nurtures a secret compulsive disorder as she waits for Kenny to return to the life they once hoped to share together. After almost beating one of his tormentors to death, Howie serves time in prison, then tries once again to re-enter society and begin life anew.With compassion and insight, Five Little Indians chronicles the desperate quest of these residential school survivors to come to terms with their past and, ultimately, find a way forward.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Indigenous",
    "Book Club",
    "Canada",
    "Audiobook",
    "Historical"
  ],
  "author": "Michelle Good",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/53676126-five-little-indians"
}