{
  "title": "The Show Must Go On, Seeing Someone, If Walls Could Talk.",
  "description": "The first play, THE SHOW MUST GO ON, cleverly mixes up sitcoms and real life by presenting us with an ostensibly authentic suburban family in which all the members read their lines from a stilted and hilariously dismal script. Trouble develops when someone shows up who is not in the script. Furthermore, she (the part was supposed to call for a burly telephone repairman) is both fetching and given to improvisation that throws the others completely. And when the father of the family is lured into trying his hand at \"winging it,\" he ends up being fired and facing divorce from his jealous wife-while the substitute father who is rushed in to replace him arrives with the wrong script! (4 men, 2 women.) In the second play, SEEING SOMEONE, a young man finds it difficult to shake off obsessive thoughts of his former girlfriend and build a new relationship with her successor, because every time he starts to embrace his current lady, he is immediately besieged with a clear vision (across the stage) of what his old flame is up to and with whom-the latter being a stupid, clumsy lout who breaks her china and pops the buttons off her clothes! (2 men, 2 women.) In the third play, IF WALLS COULD TALK, a husband and wife, Gilbert and Arlene, pay a reluctant visit to the bedside of the dying grandfather, a thoroughly pompous, tyrannical sort who has always managed to make his grandson feel inadequate while boring him with endless stories about his deprived youth in the old country and his subsequent great success in the new. But as Gilbert ruminates about what \"Grandgaggy\" might really be like, a series of deceased family members and former friends miraculously materialize, one by one, and neatlydemolish any myths that the dying man might have hoped to perpetuate. In fact, he was, it turns out, a thoroughly unsavory character-and the others are hardly elated by the thought that the time has come for him to join them again-this time forever! (7 men, 4 women.)",
  "genres": [
    "Plays"
  ],
  "author": "Laurence Klavan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/536663.The_Show_Must_Go_On_Seeing_Someone_If_Walls_Could_Talk_"
}