{
  "title": "Murder at the Snowed Inn",
  "description": "Murder in the cozy snow-capped mountainsAnd heart-warming romance to boot!Heartbroken after her beloved husband’s death, Claire Andersen—proud foster mom, dog mom, and culinary artisan—decides to try her hand at a new beginning, renovating an old B&B in idyllic Galway, Maryland on the edge of the enchanted Appalachian Mountains. She knew her fresh start would be exciting, but she never expected it to be tinged with enthralling adventure, romance that’s sweet as sweet can be … and murder!Adorable and resilient, former NYC chef Claire Andersen is no stranger to second chances. She and her stock trader husband George had decided long ago to trade in their life of ambition for one of quaint & quiet adventure—by opening up a cozy neighborhood coffee shoppe on the ground floor their Brooklyn brownstone. He was the coffee-connoisseur, she was the baker extraordinaire. Claire was so happy, she could just die. But fate had other plans—it came for her husband instead.After George’s passing, Claire decides (with a nudge from her doting foster daughter Al) to trade in her life of brews and baked goods for breakfast—bed and breakfast, that is! And what better setting in which to start over than Galway, Maryland—a charming, snowy mountain town (and favorite cross-county ski destination of Claire’s youth).All is well in Claire’s new B&B venture—and with her new oven constantly in use, it’s mouth-watering, even—until her first guest is murdered in-house. It’s not long until one of the suspects Claire questions about the murder winds up dead, too. Suddenly, Claire finds herself starting over yet again—and trading in her hostess hat (she’d just dusted it off, too!) for a secret life as an amateur sleuth.But it’s not all B&B business and bodies: Claire also finds herself in the throes of not one, but two potential romances—each more toe-curling and butterflies-in-the-stomach inducing than the other.Alongside her trusty new pal Evelyn (who’s feisty enough to make anyone blush) and her faithful bloodhound Rupert, Claire races the clock to get to the next victim—before the killer does. And she knows she’d better hurry. Because if the killer catches her first, she might run out of second chances.Author's Note: This book contains a non-binary character whose preferred pronouns are they/them. If the notion of a non-binary character (and its resultant use of grammar) is offensive, then this book is not for you!",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Christmas",
    "Cozy",
    "Fiction",
    "Holiday",
    "Contemporary"
  ],
  "author": "Imogen Plimp",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/53653660-murder-at-the-snowed-inn"
}