{
  "title": "The Complete Plant-Based Cookbook: 500 Inspired, Flexible Recipes for Eating Well Without Meat",
  "description": "2021 IACP Award Winner in the Health & Nutrition Category Make any recipe vegan or vegetarian to suit your preferencePlant-based cooking means different things to different people. We all come to plant-based eating with different goals in mind. ATK's diverse, modern guide offers foolproof recipes for every occasion that you can tailor to suit your own needs, choosing whether to make any dish vegan or vegetarian. From building a plant-centric plate to cooking with plant-based meat and dairy, you'll find everything you need here to create varied, satisfying meals.The 500-plus recipes are vegan but flexible. You can choose whether to make the Rancheros with Avocado with tofu or eggs, the Farro Salad with Cucumber, Yogurt, and Mint with plant-based or dairy yogurt, the Vegetable Fried Rice with Broccoli and Shiitake Mushrooms with or without eggs, and the No-Bake Cherry-Almond Crisp using coconut oil or butter.ATK's plant-based eating strategy is easy, budget-friendly, and inclusive--cuisines around the world are rich with boldly flavored, naturally vegan dishes. Drawing inspiration from them, these recipes showcase produce, beans and grains, and vegan (and vegetarian) protein sources.The Complete Plant-Based Cookbook is packed with ingenious tips for cooking with plant-forward ingredients and also showcases ATK's practical techniques. Rethink how you use vegetables (blend leeks into a silky pasta sauce, use beets to transform a burger from the \"vegan option\" into the best option); discover how to boost umami flavor using tomato paste, dried mushrooms, and miso; and more. A thorough opening section delves into the details of modern plant-based eating, addressing shopping and storage strategies, the plethora of plant-based meat and dairy options, and how to meet nutritional needs.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Self Help",
    "Health",
    "Vegan"
  ],
  "author": "America's Test Kitchen",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/53714028-the-complete-plant-based-cookbook"
}