{
  "title": "The Lies You Told",
  "description": "From the acclaimed author of Blood Orange, a dark new psychological thriller about the perfect mother, the perfect wife, the perfect family -- and the perfect murder.In the playground it's the law of the jungleBut at the school gate, there are no rules at all...When Sadie Roper moves back to London, she's determined to pick up the pieces of her shattered life. First, she needs to get her daughter settled into a new school-one of the most exclusive in the city. Next, she's going to get back the high-flying criminal barrister career she sacrificed for marriage ten years earlier. But nothing goes quite as planned. The school is not very welcoming newcomers, her daughter hasn't made any friends yet and the other mothers are as fiercely competitive as their children. Sadie immediately finds herself on the outside as she navigates the fraught politics of the school gate.But the tide starts to turn as Sadie begins to work on a scandalous, high-profile case that's the perfect opportunity to prove herself again, even though a dangerous flirtation threatens to cloud her professional judgment. And when Liza, queen of the school moms, befriends Sadie, she draws her into the heart of the world from which she was previously excluded. Soon Sadie and her family start to thrive, but does this close new friendship prevent her from seeing the truth? Sadie may be keeping her friends close, but what she doesn't know is that her enemies are closer still...Dark, addictive and compelling, The Lies You Told is a compulsive psychological thriller from a master storyteller. \"An extremely well-written and unsettling novel . . . Full of intrigue and menace, it creeps up on you until that final explosive twist. A great read\" -- Alex Michaelides, #1 New York Times author of The Silent Patient \"I read The Lies You Told in two days, barely able to turn the pages fast enough. It's spare and taut, the sense of wrongness building in chilling, skillfully written layers, with a jaw dropping last-line twist.\" -- Lisa Jewell, New York Times bestselling author of The Family Upstairs",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Audiobook",
    "Mystery Thriller",
    "Psychological Thriller",
    "Crime"
  ],
  "author": "Harriet Tyce",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/53694539-the-lies-you-told"
}