{
  "title": "The Social Distance King: Introducing queens and kings to social distancing",
  "description": "Teach Your Children About the Importance of Social Distancing Social distancing is a new word and lifestyle for all of us. Sports and activities have been postponed, school is different, everyone is wearing masks and we haven’t been able to visit with our friends and family members for a long time. It can be a frightening and confusing world for a child as they experience this pandemic. It can be very difficult as a parent or guardian to teach a little one why we have to act this way. Social distancing is a confusing concept for children, who are experiencing the most crucial developmental years of their life. Explaining this concept in a positive and educational manner is one of the most important things you can do as a mother, father, grandparent or guardian. This groundbreaking picture book teaches your boy or girl about how we can slow the spread in a creative, imaginative and educational way. It will teach your child the foundational terms and concepts of social distancing. Give them the imagination of being a King or Queen of Social Distancing. This fictional children’s book will encourage your little one to keep partaking in this world-wide effort to end this pandemic. What Will the Social Distance King Teach My Child? • The Importance of Caring for Others – Social distancing is not just about protecting yourself… it is about protecting the people around us. Your toddler or grade school child will learn that if we all partake in these drastic actions, we will save our friends, loved ones and fellow humans from sickness and harm. • Enthusiasm & Hope About the Future – This pandemic won’t last forever! It is critical for all children and young minds to understand this. Give your little one the hope and dreams about all they will accomplish and we beat this virus. • How Their Small Acts Can Save the World – Children need to know how important each and every action they take is to the world. Every time we wear a mask, wash our hands or avoid large gathering is another huge step in the right direction to saving the world. This bedtime story will teach children how to become the King or Queen of Social Distancing!",
  "genres": [],
  "author": "Eric DeSio",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/53698724-the-social-distance-king"
}