{
  "title": "Harbor Falls Romance Box Set",
  "description": "Welcome to Harbor Falls! This two-book bundle is your series starter into the 15-Book Harbor Falls Romance Series! In this set you are getting All of My Heart, Book 1, and Take My Heart, Book 2.All of My Heart - When Suzie Hart inherits the lakeside Victorian cottage that eventually becomes Sweet Hart Inn, she imagines life planned out ahead of her. She will run the inn, write her cookbooks, and pick up an occasional catering job with her cousin, who owns the local bakery. Her life in Harbor Falls is predictable--a welcome change from the chaos of recent months (when her sister ran off with her fiancé)--and that's the way she likes it. Until chaos rides his bad ass Harley up to her bed and breakfast doorstep--and her perfect, predictable, and well-planned world starts crumbling like yesterday's blueberry muffins.Brad Matthews has other ideas. When Suzie worked as his sous chef in Asheville months earlier, he had no intention of falling in love with the sassy chef--no room in his life for romance. But when she disappeared and took Brad's heart with her, his good intentions shattered. Even though Brad's plan to win Suzie back involves making the people of Harbor Falls a bit angry (Suzie included), it is part of his bigger plan to get his life and career on track, and to win Suzie Hart back into his arms--permanently.But can Suzie let go of their muddled past, and her well-planned future, in order to find happiness with hunky Chef Brad? Can Brad alter his own plan, in order to win Suzie back? Take My Heart - When Shelley Hart ran off and married her sister, Suzie's, fiancé, the whole town of Harbor Falls was in a twitter. A few years later, her husband deceased and with two little girls in tow, her only recourse is to go home for the holidays. Will Suzie, forgive her? What about that boy she left behind?Harbor Falls Police Officer Matt Branson values being alone. Dubbed the town hermit, he prefers the solitude of his mountain cabin to socializing with friends--friends who say he still pines after the woman who got away. But the snowy day he pulls over an older model sedan speeding into Harbor Falls, things change. His gut slams against his backbone as a tearful woman rolls down the car window. His heart melts when she looks up into his eyes.Shelley Hart is back in town--the woman who sent him into his cave in the first place.",
  "genres": [
    "Contemporary Romance",
    "Second Chance",
    "Small Town Romance",
    "Romance",
    "Anthologies",
    "Contemporary"
  ],
  "author": "Maddie James",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/53683577-harbor-falls-romance-box-set"
}