{
  "title": "Detective Emilia Cruz Mystery Series Box Set Books 1-6: The Acapulco police procedural series",
  "description": "Acapulco’s first female police detective takes on drug cartels, official corruption, and social inequality in the award-winning Detective Emilia Cruz mystery series. Dive into her first cases of murder, lies, and deception.“A thrilling series” -- National Public Radio2019 and 2020 Poison Cup Award, Outstanding Series, Crime Masters of AmericaGet the first 6 riveting complete novels : CLIFF DIVER, HAT DANCE, DIABLO NIGHTS, KING PESO, PACIFIC REAPER, and 43 MISSING. You’ll walk shoulder-to-shoulder with Detective Emilia Cruz, hearing your heart race in rhythm with the ocean as you calculate an honest cop's odds of survival in today's Mexico.Once Hollywood’s playground, Acapulco is now the homicide capital of Mexico . As she investigates the city’s darkest crimes, Emilia also copes with a police department riddled with corruption and colleagues who want to force her out.Emilia’s family secrets provide more heart-stopping drama , as does her rocky relationship with American hotel manager Kurt Rucker.Exclusive Bonus Content ! In addition to 6 complete murder mystery novels, you get 2 exclusive Detective Emilia Cruz Short Acapulco Sugar and Emilia’s Circle.Fans of international mystery series crime fighters like Armand Gamache, Harry Hole, Guido Brunetti, Vera Stanhope, and the Department Q series team, as well as Don Winslow’s Mexican cartel and border thrillers, have embraced Detective Emilia Cruz. Just check out the stars and reviews!Readers love the complex plots, pulse-pounding suspense, and Acapulco’s iconic Pacific setting.Author Carmen Amato uses her own counterdrug and espionage experiences from a 30-year career in national intelligence to craft intrigue-filled crime fiction. She is a recipient of both the National Intelligence Award and the Career Intelligence Medal.CLIFF DIVERWhen her crooked lieutenant is murdered, Emilia is assigned to lead the investigation. Soon the man’s sordid sex life, money laundering, and involvement in a kidnapping double-cross combine to create an ugly mess no one wants exposed.Consistently exciting. - Kirkus ReviewsHAT DANCEEmilia battles her own worst fears as she hunts for a missing girl and an arsonist targeting Acapulco’s upscale restaurants.A story far richer than the thriller factories of the big publishing houses. - LibraryThingDIABLO NIGHTSA religious relic from Mexico’s history propels Emilia into the labyrinth of a brutal and bewildering crime.Unique and gripping. - OnlineBookClub.orgKING PESOIs Emilia the next target of a ruthless cop killer? It’s a serial killer thriller with a spicy Mexican twist.Danger and betrayal never more than a few pages away. - Kirkus ReviewsPACIFIC REAPEREmilia feels the wrath of a voodoo-like cult in a riveting thriller that takes her into dangerously uncharted cartel territory.A brilliant character-driven detective story. - Artisan Book Reviews43 MISSINGIt’s a heart-stopping alternative history novel as Emilia investigates Mexico’s most notorious true crime.Astounding . . . a haunting page-turner . . . The tragedy of decent members of society caught in the crossfire stayed with me long after I finished the book. - Nightstand Reviews",
  "genres": [
    "Fiction",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/53746325-detective-emilia-cruz-mystery-series-box-set-books-1-6"
}