{
  "title": "Liar",
  "description": "Liar is a wicked comedy that exposes the degenerate underbelly of stately Beverly Hills. Sex for barter, lowlife scams, sleazy date-rapes, trashy pick ups - it’s a bustle. Salacious and hilarious, yet starkly poignant, Liar depicts the greed and depravity woven in our culture of go-get.Joel’s a small-time hustler masquerading the big shot. Claudia the voluptuous model’s desperate for a fast buck. As this money-grubbing duo heap on the class act, Allison offers a scathing parody of L.A.’s bogus glamour. Steamy sex turns to murderous hate. Who will win this diabolical war - evil bitch or monstrous liar? Allison casts a pair of preposterously perverse villains and twists their situation into the absurd. It’s delightfully rude, burlesque and full of nasty surprises.Excerpt 1I’m standing at the street corner, idly wishing I’d won the lottery, when the black Carrera skids to a stop. Then she slithers out.One look at her, and I get a triple-organ attack. My diaphragm seizes up and squeezes out a weird strangled whistle; my heart hammers like some psycho beat-box; and my stomach, it literally flies into the air, like a mad acrobat going for one of those crazy quadruple flips.Dark gold hair, rippling and springing in what must be twenty different shades, all in a riot and tumbling in what they call a bedroom tangle to her waist. Lazy, black, tilted eyes. Strawberry lips like little puffy marshmallows. But, oh, slightly parted. Indecent bitch.Stacked with twin Himalayan peaks, begging for fingers to scale them; gym toned arms that guarantee an energetic tussle in the sack; scarlet vampire nails that’ll scratch long and deep. A total sex-beast.She’s got an hourglass figure - the real deal - waist pinched in like somebody’s scraped out every ounce of fat, all trussed into the skimpiest black top and a leather mini skirt that just covers her scandalous little ass. Cheeks round as full moons hovering high in the air. Oh yeah, just lemme grab a handful of that. Her thighs and calves are athletic and taut, wrapped in skin that looks like shimmering caramel cream. Those legs, they don’t wanna stop, they shoot right up to those liquid velvet shoulders. And she’s got black spiked-heeled fuck-me sandals on those dainty fuck-me feet. The kind with fuck-me straps that bind up those fuck-me ankles. 38 - 22 -36 inches of total come-on. Goddammit, this piece of ass has turned me into a poet.I’m like a magnifying glass, I hone in on every little detail, right down to the tiny round dots of blood red polish on her itsy-bitsy toenails. I pin my eyes on her as she slinks towards the building, like some kinda curvy snake writhing to the charmer’s flute. Tok, tok, tok, those stilettos hit the pavement. And yeah, yeah, yeah, those luscious hips sway. Something in my groin wakes up and wriggles like a worm. Wait a minute. I don’t even remember the last time I had a hard-on without the magic of thblue pill.What the hell?Excerpt 2Just at this crucial moment, the babe glides up to the booth. The ugly Frenchie’s bug eyes instantly change direction and shoot like a pair of darts to my honey-bun’s full stacks. Hey, wanna compete?“Ca va, cherie?” The swamp-thing croaks, trying to hide the pornographic leer on his face. I surreptitiously angle my sightline to the same spot he’s eyeballing. Now that’s what I call a real pair of tits. Miss, may I, er, pinch them, just a little? “Cloudea, Joel’s a great ruby expert...” The pond-rodent rattles off like a machine gun, pretending to sing my praises. “And ee speaks French too, ee went to school in Switzerland...” That sonofabitch, he’s using it as a ruse while he’s trying to stick his blackhead infested nose into my hottie’s cleavage. “Ah, yes...” Of course I smile modestly. No need to frighten the babe with my distinguished credentials. So she’s French? Well then, gimme a dish of them Frogs’ Legs a la Spread. Cream sauce, please.“Oh, really?” She turns to me, eyes all bright and interested. “I have a ruby ring I want to sell. Would you like to look at it?” Bingo. Jackpot. Royal flush.“Sure.” I fight down my excitement and keep a poker face. “Always ready to buy.” That’s it, proper and business-like.“I don’t know much about rubies, maybe you can tell me what it’s worth?” But of course. I’ll tell you what it’s worth, I’ll even buy it, as long as you let me suck your delicious little toes. Er, if the ruby’s cheap enough, that is. Your pussy’s extremely important, but so",
  "genres": [],
  "author": "J.R. Allison",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/12624512-liar"
}