{
  "title": "The Lowering Days",
  "description": "An emotionally powerful saga, set in 1980s Maine, that explores family love, the power of myths and storytelling, survival and environmental exploitation, and the ties between cultural identity and the land we live onIf you paid attention, you could see the entire unfolding of human history in a story . . .Growing up, David Almerin Ames and his brothers, Link and Simon, believed the wild patch of Maine where they lived along the Penobscot River belonged to them. Running down the state like a spine, the river shared its name with the people of the Penobscot Nation, whose ancestral territory included the entire Penobscot watershed--the land upon which the Ames family eventually made their home.The brothers' affinity for the natural world derives from their iconoclastic parents, Arnoux, a romantic artist and Vietnam War deserter who builds boats by hand, and Falon, an activist journalist who runs The Lowering Days, a community newspaper which gives equal voice to indigenous and white issues.But the boys' childhood reverie is shattered when a bankrupt paper mill, once the Penobscot Valley's largest employer, is burned to the ground on the eve of potentially reopening. As the community grapples with the scope of the devastation, Falon receives a letter from a Penobscot teenager confessing to the crime--an act of justice for a sacred river under centuries of assault.For the residents of the Penobscot Valley, the fire reveals a stark truth. For many, the mill is a lifeline, providing working class jobs they need to survive. Within the Penobscot Nation, the mill is a bringer of death, spewing toxic chemicals and wastewater products that poison the river's fish and plants.As the divide within the community widens, the building anger and resentment explodes in tragedy, wrecking the lives of David and those around him.Evocative and atmospheric, pulsating with the rhythms of the natural world, The Lowering Days is a meditation on the flow and weight of history, the power and fragility of love, the dangerous fault lines underlying families, and the enduring land where stories are created and told.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Audiobook",
    "Native American",
    "Family",
    "Contemporary"
  ],
  "author": "Gregory     Brown",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/53746792-the-lowering-days"
}