{
  "title": "Watch Her",
  "description": "“Quirky characters complement the suspenseful plot. Readers will agree that a failing school makes a grade-A mystery.” —Publishers Weekly“Complex…a masterly mystery.” —Kirkus ReviewsFans of Ruth Ware and B.A. Paris won’t want to miss this complex psychological thriller from an acclaimed author about a powerful Boston family desperate to keep their darkest secrets from coming to light. While attending a gala at Prescott University’s lavish new campus, Hester Thursby and fellow guest, Detective Angela White, are called to the home of the college’s owners, Tucker and Jennifer Matson. Jennifer claims that someone broke into Pinebank, their secluded mansion on the banks of Jamaica Pond. The more Hester and Angela investigate, the less they believe Jennifer’s story, leaving Hester to wonder why she would lie.When Hester is asked by the college’s general manager to locate some missing alumni, she employs her research skills on the family and their for-profit university. Between financial transgressions, a long-ago tragedy, and rumors of infidelity, it’s clear that the Matsons aren’t immune to scandal or mishap. But when one of the missing students turns up dead, the mystery takes on new urgency.Hester is edging closer to the truth, but as a decades-old secret collides with new lies, a killer grows more determined to keep the past buried with the dead. . . .“Hits that elusive sweet spot yet again with an impeccable blend of intelligent and relatable characters confronted with a dangerous and complex crime in a fascinating setting. Hill masterfully ratchets up the tension until it's impossible to look away. Hester Thursby fans will not be disappointed!” —Karen Dionne, award-winning bestselling author of The Wicked Sister“Suspenseful…a grade-A mystery.”— Publishers Weekly",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Edwin   Hill",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/53750924-watch-her"
}