{
  "title": "The Twelve Strippers of Christmas",
  "description": "Sometimes the best presents unwrap themselves! With a twist… and a thrust… and some break away snaps.  Grab some holiday cheer the naughty way with the bite-sized Christmas stories. Have fun with a sexy Santa Strip-O-Gram. Party with sassy strippers and skilled shifters. Get ready for surprises such as nude zero-grav ballet, and a Celtic drum band that bares all. And in every story? The romance you’ve been waiting for.  Ranging from short and sweet, to longer and *a-hem* hotter, this collection of holiday stories will bring you joy any time of year.   Partridge in Her Pear Tree Sexy? Yes! HR nightmare? Definitely! But what else would you expect from a Christmas party at a personal pleasure device company?  Perfect Cup All Alexa wants is an attractive, British man named Tom, who drinks tea. Steamy.  Three French Cockerels Welcome to Belvoir County Kentucky where they know not everyone celebrates Christmas, but everyone loves chicken, and they still argue over the secret of that famous secret recipe.  Calling Bird Ava is torn between one sexy rocker with a troubled past, and one responsible hunk who places her firmly in the friend zone.  Five Glowing Rings Past life regression meets sexy hoop dancer. Amy is in Vegas to lick her wounds, instead she ends up licking a set of perfect abs.  Blaze and Glori Whats a girl to do when she’s stuck on a holiday cruise with her family? Faced with douche-boys and cougar-hunts, Glori’s vacation is not off to a promising start. Fortunately, she keeps running into handsome passenger Blaze, who is definitely making her trip more interesting.  Burlesque Cygnus Innuendo will leave you reading between the lines in this super short tale with a paranormal twist.  More Than Want Transporter St. Cyr picks up a passenger she cannot resist. Things heat up in outer space where its literally sex or death, when biology acts against St. Cyr.  Nine Ladies Dancing Kyra is so done with what other people want from her, and she is tired of the fantasy where the gorgeous millionaire rescues the poor stripper. That only ever happens in the movies.  XXLL X-treme X-rated Lascivious Lords A night out with friends is what Clary needs to take her mind off her failing relationship. But can she lose herself in the moment with a masked stripper and not think about Josh?  Piper’s Daughter Rose finds out she is not free from her dead father’s control when its discovered his will requires her to be married by the end of the year of his death, or she’ll be homeless. High school crush Jimmy comes to the rescue with only two days left to the year.  Bang a Drummer Cross dressing Lettie has the hots for a celtic drummer who is hiding an even bigger, hairier secret than the one she is.",
  "genres": [],
  "author": "Lulu M. Sylvian",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/53727292-the-twelve-strippers-of-christmas"
}