{
  "title": "Perversion of Justice: The Jeffrey Epstein Story",
  "description": "Dauntless journalist Julie K. Brown recounts her uncompromising and risky investigation of Jeffrey Epstein's underage sex trafficking operation, and the explosive reporting for the Miami Herald that finally brought him to justice while exposing the powerful people and broken system that protected him.For many years, billionaire Jeffrey Epstein's penchant for teenage girls was an open secret in the high society of Palm Beach, Florida and Upper East Side, Manhattan. Charged in 2008 with soliciting prostitution from minors, Epstein was treated with unheard of leniency, dictating the terms of his non-prosecution. The media virtually ignored the failures of the criminal justice system, and Epstein's friends and business partners brushed the allegations aside. But when in 2017 the U.S Attorney who approved Epstein's plea deal, Alexander Acosta, was chosen by President Trump as Labor Secretary, reporter Julie K. Brown was compelled to ask questions.Despite her editor's skepticism that she could add a new dimension to a known story, Brown determined that her goal would be to track down the victims themselves. Poring over thousands of redacted court documents, traveling across the country and chasing down information in difficult and sometimes dangerous circumstances, Brown tracked down dozens of Epstein's victims, now young women struggling to reclaim their lives after the trauma and shame they had endured.Brown's resulting three-part series in the Miami Herald was one of the most explosive news stories of the decade, revealing how Epstein ran a global sex trafficking pyramid scheme with impunity for years, targeting vulnerable teens, often from fractured homes and then turning them into recruiters. The outrage led to Epstein's arrest, the disappearance and eventual arrest of his closest accomplice Ghislaine Maxwell, and the resignation of Acosta. The financier's mysterious suicide in a New York City jail cell prompted wild speculation about the secrets he took to the grave-and whether his death was intentional or the result of foul play.Tracking Epstein’s evolution from a college dropout to one of the most successful financiers in the country—whose associates included Donald Trump, Prince Andrew, and Bill Clinton—Perversion of Justice builds on Brown's original award-winning series, showing the power of truth, the value of local reportage, and the tenacity of one woman in the face of the deep-seated corruption of powerful men.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "Journalism",
    "Audiobook",
    "History",
    "Politics"
  ],
  "author": "Julie K. Brown",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/53746799-perversion-of-justice"
}