{
  "title": "They Never Let a Crisis Go to Waste: The Truth About Disaster Liberalism",
  "description": "Why did the left think they could solve the pandemic with burning cities, closed beaches, blue state budget bailouts, and mail-in ballots nobody asked for? The coronavirus has been a disaster for America, but it’s been an unprecedented opportunity for the left. In They Never Let a Crisis Goes to Waste, Jason Chaffetz delves into progressive efforts to leverage crises to force their priorities into law. Whether the crisis is legitimate, fabricated, or exaggerated, the solution is always the same: more government, less individual freedom, higher spending, higher taxes.He explores how disaster liberalism subjugates individual freedoms to political expediency in times of crisis, and how Republicans need to be ready for next time.  Because when we allow government power to become unlimited in a crisis, the crises will become unlimited. Across the board, Democrat leaders exploited the pandemic to achieve their agenda, invoking disaster liberalism to justify unpopular and unconstitutional power grabs. Virginia Governor Ralph Northam signed a gun control bill on April 10—three weeks into pandemic—because he wouldn’t have to put up with tens of thousands of protestors. Wisconsin Governor Tony Evers announced he was making it a criminal offense to attend church or go to work, only to see his overreach struck down by the state supreme court. Nancy Pelosi rammed through a $3 trillion liberal wish list filled with proposals unrelated to COVID-19, that immediately died in the Senate.If not for the courts and local media, many of the Democrats’ schemes would have successfully been implemented. As it was, many were—and many of the most egregious violations of Americans’ rights were celebrated across the left.In They Never Let a Crisis Go to Waste, Chaffetz uncovers Democrats’ game plan and calls upon all Americans to protect ourselves against future incursions. If we don’t pay attention, the left will use every crisis to implement its radical plan, steadily eroding the freedoms we all hold dear. Only the American people have the power to stop the left’s next power grab, as Chaffetz shows in this powerful, thoroughly-researched call to action.",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "Jason Chaffetz",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/53746031-they-never-let-a-crisis-go-to-waste"
}