{
  "title": "The United States of Arugula: How We Became a Gourmet Nation",
  "description": "One day we woke up and realized that our “macaroni” had become “pasta,” that our Wonder Bread had been replaced by organic whole wheat, that sushi was fast food, and that our tomatoes were heirlooms. How did all this happen, and who made it happen? The United States of Arugula is the rollicking, revealing chronicle of how gourmet eating in America went from obscure to pervasive, thanks to the contributions of some outsized, opinionated iconoclasts who couldn’t abide the status quo.Vanity Fair writer David Kamp chronicles this amazing transformation, from the overcooked vegetables and scary gelatin salads of yore to our current heyday of free-range chickens, extra-virgin olive oil, Iron Chef , Whole Foods, Starbucks, and that breed of human known as the “foodie.” In deft fashion, Kamp conjures up vivid images of the “Big Three,” the lodestars who led us out of this culinary James Beard, the hulking, bald, flamboyant Oregonian who made the case for American cookery; Julia Child, the towering, warbling giantess who demystified French cuisine for Americans; and Craig Claiborne, the melancholy, sexually confused Mississippian who all but invented food journalism at the New York Times . The story continues onward with candid, provocative commentary from the food figures who prospered in the Big Three’s Alice Waters and Jeremiah Tower of Berkeley’s Chez Panisse, Wolfgang Puck and his L.A. acolytes, the visionary chefs we know by one name (Emeril, Daniel, Mario, Jean-Georges), the “Williams” in Williams-Sonoma, the “Niman” in Niman Ranch, both Dean and DeLuca, and many others.A rich, frequently uproarious stew of culinary innovation, flavor revelations, balsamic pretensions, taste-making luminaries, food politics, and kitchen confidences, The United States of Arugula is the remarkable history of the cultural success story of our era.",
  "genres": [
    "Food",
    "Nonfiction",
    "History",
    "Food Writing",
    "Foodie",
    "Cooking",
    "Food and Drink"
  ],
  "author": "David Kamp",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/126258.The_United_States_of_Arugula"
}