{
  "title": "Risk",
  "description": "USA Today Bestselling Author Allie Juliette Mousseau delivers a sexy, quick-witted, and sassy enemies-to-lovers second-chance romance featuring one smoldering alpha attorney; a feisty, determined social worker; and three young orphans in trouble… Saint Sophia the Mother of Orphans, help us!Connor Callahan, once a North House teen who shed his own blood to become a Brother of Ink and Steel, is now a powerful attorney and the Twin Cities’ most eligible bachelor. He challenges stereotypes and melts panties with his rugged good-looks, colorful tattoos, and brazen piercings. When he’s handed the case of a lifetime with the promise of partnership in the firm he’s dedicated his career to, he knows his destiny is close. Then he gets a glimpse of the familiar Saint Sophia pendant his opposing council wears, and he finds himself wondering… could it really be her, the girl he met as a teenager? He never thought he’d see the blond whirlwind again after she blew in and out of his life, but she was wholly unforgettable. Like a tattoo over his heart. If only he could get close enough to be sure it’s really her… but she’s never going to let that happen.Elle Hayes despises the formidable Mr. Callahan and everything he stands for. Though he puts on an immensely charming act—and is hotter than the desert sun—she knows he’s a fake. There’s no way she’s going to let Callahan interfere with her objective: finding a home for the vulnerable orphans his client has torn apart. Then an unexpected set-up has Connor and Elle playing house together for a week…As the tension—and heat—revs up between them, they discover that they each have a whole lot more to lose than just a court case. Their hearts are on the line—and so much more.To experience the greatest things in life, we have to take the greatest risks. But will they decide those risks are worth taking?",
  "genres": [
    "Contemporary",
    "Enemies To Lovers"
  ],
  "author": "Allie Juliette Mousseau",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/53831207-risk"
}