{
  "title": "Kushiel's Chosen",
  "description": "Following hard on the heels of Kushiel's Dart, Jacqueline Carey's spectacular debut novel, comes Kushiel's Chosen, a glittering and riveting historical fantasy.The land of Terre d'Ange is a place of unsurpassed beauty and grace. It is said that the angels found the land and saw it was good, and the ensuing race that rose from the seed of angels and men live by one simple Love as thou wilt.Phèdre nó Delaunay is a young woman who was born with a scarlet mote in her left eye and sold into indentured servitude as a child. Her bond was purchased by Anafiel Delaunay, a nobleman with a very special mission--and the first to recognize her for who and what she one pricked by Kushiel's Dart, chosen to forever experience pain and pleasure as one.Phèdre has trained in the courtly arts and the talents of the bedchamber, but, above all, the ability to observe, remember, and analyze. Having stumbled upon a plot that threatened the very foundations of her homeland, she gave up almost everything she held dear to save it. She survived, and lived to have others tell her story, and if they embellished the tale with fabric of mythical splendor, they weren't far off the mark.The hands of the gods weigh heavily upon Phèdre's brow, and they are not yet done with their charge--for while the young queen who sits upon the throne is well loved by the people, there are those who believe that other heads should wear the crown. And those who escaped the wrath of the mighty are not yet done with their schemes for power and revenge. To protect and serve, Phèdre will once again leave her beloved homeland.From the sun-drenched villas of La Serenissima to the wilds of old Hellas, from a prison designed to drive the very gods mad to an island of immutable joy. Phèdre will meet old friends and new enemies and discover a plot so dreadful as to make the earth tremble, masterminded by the one person she cannot turn away from.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fiction",
    "Epic Fantasy",
    "Erotica",
    "High Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Jacqueline Carey",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/5382205-kushiel-s-chosen"
}