{
  "title": "Securing Jane",
  "description": "From New York Times and USA Today bestselling author Susan Stoker comes a new story in her SEAL of Protection: Legacy Series…Over the years, Storm North has witnessed two teams of Navy SEALs under his command find true love. He doesn’t expect the same for himself. He’s too old. Too jaded. Too set in his ways. Until a woman who’s been right in front of him for years manages to impress Storm in a way very few women—or men—ever have.Jane Hamilton knows it’s ridiculous to have a crush on the charismatic and handsome admiral. She’s the divorced mother of a twenty-six-year-old daughter. Too old for crushes. Too old for a lot of things. There’s no chance she’ll ever catch the eye of a man like Storm North.Until someone delivers a bomb to the base.As the civilian contractor in charge of the mail room, Jane finds herself in the direct line of fire, enduring a series of events that leads to a budding relationship with the very man she’s been longing for. She couldn’t be happier, and Storm feels the same.The only one unhappy, in fact, is the thwarted bomber. Unhappy enough to do something drastic. Now Storm and Jane have to work together to save innocent sailors—and themselves—from an explosive situation threatening their happily ever after.**Securing Jane is the 7th and final book in the SEAL of Protection: Legacy Series and a part of the 1001 Dark Nights collection. Each book is a stand-alone, with no cliffhanger endings.**Every 1001 Dark Nights novella is a standalone story. For new readers, it’s an introduction to an author’s world. And for fans, it’s a bonus book in the author’s series. We hope you'll enjoy each one as much as we do.**",
  "genres": [
    "Military Fiction",
    "Romantic Suspense",
    "Romance",
    "Military Romance",
    "Contemporary",
    "Contemporary Romance",
    "Novella"
  ],
  "author": "Susan Stoker",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/53830689-securing-jane"
}