{
  "title": "The Constant Princess",
  "description": "An alternate cover for this isbn can be found here.\"I am Catalina, Princess of Spain, daughter of the two greatest monarchs the world has ever known...and I will be Queen of England.\"  Thus, bestselling author Philippa Gregory introduces one of her most unforgettable heroines: Katherine of Aragon. Daughter of Queen Isabella and King Ferdinand of Spain, Katherine has been fated her whole life to marry Prince Arthur of England. When they meet and are married, the match becomes as passionate as it is politically expedient. The young lovers revel in each other's company and plan the England they will make together. But tragically, aged only fifteen, Arthur falls ill and extracts from his sixteen-year-old bride a deathbed promise to marry his brother, Henry; become Queen; and fulfill their dreams and her destiny. \"They tell me nothing but lies here and they think they can break my spirit. I believe what I choose and say nothing. I am not as simple as I seem.\"  Widowed and alone in the avaricious world of the Tudor court, Katherine has to sidestep her father-in-law's desire for her and convince him, and an incredulous Europe, that her marriage to Arthur was never consummated, that there is no obstacle to marriage with Henry. For seven years, she endures the treachery of spies, the humiliation of poverty, and intense loneliness and despair while she waits for the inevitable moment when she will step into the role she has prepared for all her life. Then, like her warrior mother, Katherine must take to the battlefield and save England when its old enemies the Scots come over the border and there is no one to stand against them but the new Queen. \"It was my dying husband's hope, my mother's wish, and God's will that I should be Queen of England; and for them and for the country, I will be Queen of England until I die.\"  Raised on the battlefield and in the most beautiful Moorish palace in the world, sent to England alone at the age of sixteen to take her place in a court where she couldn't speak the language, and abandoned and forced to endure poverty after the death of her husband, Katherine remained a woman of indomitable spirit, unwavering faith, and extraordinary strength. Philippa Gregory brings to life one of history's most inspiring women and creates one of the most compelling characters in historical fiction.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "Tudor Period",
    "British Literature",
    "Adult"
  ],
  "author": "Philippa Gregory",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/538206.The_Constant_Princess"
}