{
  "title": "Healthcare From The Trenches: An Insider Account of the Complex Barriers of U.S. Healthcare from the Providers and Patients' Perspective",
  "description": "As Americans, we’re facing serious problems – not only with skyrocketing healthcare costs but also lack of patient access and inefficient delivery. Now with the frightening Coronavirus pandemic that is further taxing our healthcare system – and consequently, our economy – we are seeing these issues amplified. Despite all the political debates and media coverage on healthcare policy and reform, there is always one glaring feedback from the people in the trenches – the doctors and other healthcare professionals who actually provide care to the patients.  This book is written from a doctor’s perspective, by Alejandro Badia, M.D., F.A.C.S. He didn’t want to write this book but felt he had to because of the incredible problems he sees every day in getting the patient the care they need; and, as an expert, his treatment plans are constantly second-guessed and obstructed by the system which has a near-zero understanding of the problem that the patient faces. It became unbearable for Dr. Badia to continue to practice without calling out what is happening, every day, as the norm, and not the exception anymore. Dr. Badia has been a practicing orthopedic surgeon for three decades and is the founder of OrthoNOW® clinics in South Florida. He has been in the trenches with our broken healthcare system since 1989. Medicine, once a noble calling, as evidenced by The Hippocratic Oath (Do No Harm), has transformed into an oppressive burdensome system for both doctors and patients. Non-Medical Experts hired by the Insurance Companies with zero medical training, and without any degrees or knowledge (in most cases) are calling the shots and continue to interfere with the doctor-patient relationship, delay and prevent the delivery of care, and present an obstacle to innovations that would improve patient outcomes and reduce overall healthcare costs. Since the implementation of Obamacare, healthcare in America has devolved into a bureaucratic nightmare. What began as incremental interference in the relationship between doctor and patient with the passage of The Medicare Act of 1965 is now an impenetrable barrier made up of governmental and healthcare insurance industry red tape. The result? Higher costs and unnecessary inefficiencies. What can we do about it? First, we must understand and recognize the underlying problems. Healthcare from the Trenches will give you an in-depth behind the scenes look at our system from a practicing doctors’ perspective along with contributors ranging from fellow colleagues to beleaguered patients, who offer their insights and share their personal stories to illustrate the inherent shortcomings in the U.S. healthcare industry as well as proposed solutions and suggestions for actions every one of us can take to enact positive, long-lasting change. It’s time for every American to understand and be educated about the root causes of our healthcare crisis and demand meaningful reform to improve healthcare efficiencies in America.",
  "genres": [
    "Medicine",
    "Nonfiction",
    "Health",
    "Medical",
    "Politics"
  ],
  "author": "Alejandro Badia",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/53814042-healthcare-from-the-trenches"
}