{
  "title": "American Passage: The History of Ellis Island",
  "description": "For most of New York's early history, Ellis Island had been an obscure little island that barely held itself above high tide. Today the small island stands alongside Plymouth Rock in our nation's founding mythology as the place where many of our ancestors first touched American soil. Ellis Island's heyday—from 1892 to 1924—coincided with one of the greatest mass movements of individuals the world has ever seen, with some twelve million immigrants inspected at its gates. In American Passage, Vincent J. Cannato masterfully illuminates the story of Ellis Island from the days when it hosted pirate hangings witnessed by thousands of New Yorkers in the nineteenth century to the turn of the twentieth century when massive migrations sparked fierce debate and hopeful new immigrants often encountered corruption, harsh conditions, and political scheming.American Passage captures a time and a place unparalleled in American immigration and history, and articulates the dramatic and bittersweet accounts of the immigrants, officials, interpreters, and social reformers who all play an important role in Ellis Island's chronicle. Cannato traces the politics, prejudices, and ideologies that surrounded the great immigration debate, to the shift from immigration to detention of aliens during World War II and the Cold War, all the way to the rebirth of the island as a national monument. Long after Ellis Island ceased to be the nation's preeminent immigrant inspection station, the debates that once swirled around it are still relevant to Americans a century later.In this sweeping, often heart-wrenching epic, Cannato reveals that the history of Ellis Island is ultimately the story of what it means to be an American.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "New York",
    "American",
    "The United States Of America",
    "Travel"
  ],
  "author": "Vincent J. Cannato",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/5387357-american-passage"
}