{
  "title": "A Vigil in the Mourning",
  "description": "Listening Length: 10 hours and 7 minutes. The devil you know is never the one you should trust. Special Agent Patrick Collins is dispatched to Chicago, chasing a lead on the Morrígan’s staff for the joint task force. Needing a cover for his presence in the Windy City, Patrick is ordered to investigate a politician running for mayor. In the lead up to election day, not everything is what it seems in a city where playing to win means appeasing the gods first and the electorate second. But Chicago brings its own set of problems outside the case: a stand-offish local god pack, a missing immortal, and Patrick’s twin sister. Fighting Hannah and the Dominion Sect provides Patrick with a sinister reminder that some blood ties can never be cut. Left behind in New York City, Jonothon de Vere finds himself targeted by hunters who will go through anyone to kill him—including the packs under his protection. With a bounty on his head, Jono is forced to make a choice that Patrick would never approve of. Doing so risks breaking the trust he’s built with the man he loves, but not acting will give the rival New York City god pack leverage Jono can’t afford to give up. When Patrick and Jono reunite in Chicago, Patrick must confront the fraying of a relationship he’s come to rely on for his own sanity. But fixing their personal problems will have to wait—because Niflheim is clawing at the shores of Lake Michigan and the dead are hungry. A Vigil in the Mourning is a 102k word m/m urban fantasy with a gay romantic subplot and a HFN ending. It is a direct sequel to A Crown of Iron & Silver. Listening the first book in the series would be helpful in enjoying this one.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "M M Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Magic"
  ],
  "author": "Hailey Turner",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/53864165-a-vigil-in-the-mourning"
}