{
  "title": "Stuttering Heart: Matt and Taylor Book One",
  "description": "Matt has never had a way with words. A debilitating stutter has plagued him his entire life, causing him to shy away from social situations. After the unexpected death of his brother, Matt stops fighting his anxiety and withdraws from the world. He moves into his brother’s house, hoping that the place will help him stay connected to the one person that saw him for more than just the way he spoke.Matt has long since given up on finding love and intimacy. He has come to terms with the fact that his stutter and social anxiety are not qualities that women look for in a man. To make matters worse, his anxiety around beautiful women makes his stutter so bad that he can barely force a word out. He could have never anticipated meeting a woman like his new neighbor, Taylor Pierce. The stunning woman looks at him like he isn’t broken, something that he thought could only happen in his fantasies. Around Taylor, Matt finally feels like he might have a chance for something more than the isolated world he has created for himself.Taylor has completely given up on her social life. Her spirit is slowly being crushed under the weight of her crippling student loan debt, and for the past two years, she has had to work close to eighty-hour weeks to stay financially afloat. Her busy schedule hasn’t left her any time for love, even just the kind that only lasts one night. She has finally had enough of her self-induced celibacy. But she barely has enough time to sleep, so how is she supposed to find the perfect hook-up? She turns her eyes to her shy, mysterious neighbor whose good looks could rival those of a Norse God.Will she be able to convince silent Matt to come out of his shell? Thankfully, luck is on her side (or much more likely, her dyscalculia). When a mislabeled package forces Matt to knock on her door, Taylor is ready to take whatever chance she can get. But will it be enough to convince Matt to put his Stuttering Heart on the line?",
  "genres": [
    "Romance",
    "Contemporary",
    "Disability",
    "Fiction"
  ],
  "author": "Annie Day",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/53867567-stuttering-heart"
}