{
  "title": "Einstein in Berlin",
  "description": "In a book that is both biography and the most exciting form of history, here are eighteen years in the life of a man, Albert Einstein, and a city, Berlin, that were in many ways the defining years of the twentieth century.Einstein in BerlinIn the spring of 1913 two of the giants of modern science traveled to Zurich. Their to offer the most prestigious position in the very center of European scientific life to a man who had just six years before been a mere patent clerk. Albert Einstein accepted, arriving in Berlin in March 1914 to take up his new post. In December 1932 he left Berlin forever. “Take a good look,” he said to his wife as they walked away from their house. “You will never see it again.”In between, Einstein’s Berlin years capture in microcosm the odyssey of the twentieth century. It is a century that opens with extravagant hopes--and climaxes in unparalleled calamity. These are tumultuous times, seen through the life of one man who is at once witness to and architect of his day--and ours. He is present at the events that will shape the journey from the commencement of the Great War to the rumblings of the next one.We begin with the eminent scientist, already widely recognized for his special theory of relativity. His personal life is in turmoil, with his marriage collapsing, an affair under way. Within two years of his arrival in Berlin he makes one of the landmark discoveries of all a new theory of gravity--and before long is transformed into the first international pop star of science. He flourishes during a war he hates, and serves as an instrument of reconciliation in the early months of the peace; he becomes first a symbol of the hope of reason, then a focus for the rage and madness of the right.And throughout these years Berlin is an equal character, with its astonishing eruption of revolutionary pathways in art and architecture, in music, theater, and literature. Its wild street life and sexual excesses are notorious. But with the debacle of the depression and Hitler’s growing power, Berlin will be transformed, until by the end of 1932 it is no longer a safe home for Einstein. Once a hero, now vilified not only as the perpetrator of “Jewish physics” but as the preeminent symbol of all that the Nazis loathe, he knows it is time to leave.From the Hardcover edition.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Science",
    "Physics",
    "History Of Science",
    "Germany"
  ],
  "author": "Thomas Levenson",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/538521.Einstein_in_Berlin"
}