{
  "title": "The Breast Mountains Of All Time",
  "description": "Named after Naasa Hablood, the twin mountains resembling breasts, The Breast Mountains Of All Time (Are In Hargeisa) is the debut poetry collection by the Eastern answer to Anaïs Nin, writer and blogger Malab, The Komorébi.In her debut, the Somali-British-Dutch writer strives to depict the 'woman experience'. Inspired by writers like Warsan Shire and Ntozake Shange, she focuses specifically on the diaspora/immigrant experience, sex positivity, feminism and feminine energy.In the chapter titled 'the sexy, sensual, sex-positive', Komorébi speaks on the so-called obsession with virginity in the poem 'hoor al ayn''but no matter what,if i do have my hymen intact when i marry someone,that man need ta know this was never for his benefit'Komorébi also uses the shunning around sex in religious and cultural communities to become her frame around poems. In 'florentine' she says,'say بسماللهbefore you eat me'She also uses her native language itself to cause uncomfortableness even more by writing,'so,niin malabkii oo sidiisaa,yar kalaay oo,make me feel hell in my receptors&heaven in my moans'Komorébi focuses on the repression on sexuality that she personally experienced, having written poems on female genital mutilation and the inferiority towards sex education in cultural communities.She has said 'it hasn't helped us become more aware of what we're going to experience anyway, since we're encouraged to get married but everyone acts like sex doesn't exist. Whenever they do mention it, they just talk about negative things, like rape or abortion or fornicating. It was always something to be feared and I wanted to shine a different light on sexuality. A better way that doesn't only scare us, but makes us confident in our being.'Komorébi is what she calls a 'lipstick feminist'. She supports gender roles but is advocates against sexism because in her opinion, feminism means to do whatever you want, regardless of gender.Komorébi is passionate about both feminism and femininity, and doesn't believe we have to give it up in order to be taken seriously. 'At the same time, we shouldn't hyper sexualise ourselves. To be honest and confident about who we are is more than enough'In addition to sex positivity and feminine energy/essence, The Breast Mountains Of All Time (Are In Hargeisa) contains poems about womanhood, toxic masculinity, toxic femininity, friendship, love, religion, spirituality, motherhood and the childfree-by-choice lifestyle as well as the first generation, diaspora and immigrant experience.DISCLAIMER: THIS BOOK IS INDENDED FOR 18+ AUDIENCES.",
  "genres": [],
  "author": "Malab, The Komorébi",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/53860850-the-breast-mountains-of-all-time"
}