{
  "title": "When the Wind Chimes",
  "description": "From international bestselling, award-winning author Mary Ting comes a heartwarming page-turner about the beauty of being with family, second chances, and the magic of Christmas, when anything is possible ... A gorgeous and festive island treat for fans of Debbie Macomber, Sheila Roberts, and Jenny Hale.\"The sweeping island scenery and romance left me feeling refreshed. This was a mini escape!\" ~First for Women MagazineSOMETIMES ANGELS COME IN HUMAN FORM.When Kaitlyn Chang receives an invitation to spend Christmas with her family on the Hawaiian island of Kauai, she feels it may be the perfect medicine for everything wrong this holiday season. She immediately throws herself into helping her sister's struggling art gallery. She even begins to paint again. It's tempting to just move to Kauai, but she has obligations back in Los Angeles.Life gets complicated when circumstances keep putting her close to Leonardo Medici. Not only is he a local celebrity, he's drop-dead gorgeous. But Kaitlyn can't shake the feeling he's hiding something.Should she believe the rumors that he's romancing half the island's single women?Or is the random sound of wind chimes when he's close-by a sign that an angel is near and the key to her happily ever after?“When the Wind Chimes is more than a romance novel. It’s a heart-warming, feel-good read that will leave readers wanting more.” – Chanticleer Reviews\"I didn't know I needed this book until it landed in my lap. When you need a break from reality and just want to snuggle in with a cup of tea, some romance, and laughs; this book is perfect.\" ~Erin, Bookseller at Barnes and Noble\"Mary Ting captures the spirit of Christmas in her new romance that promises to leave you in laughs and tears all the while reminding you that those you've lost are never as far as you might think.\" ~Tanya Roberts CER Indigo Books, Quebec Canada*Romantic Fiction Grand Prize Winner, Chatelaine Book Awards*Bronze Medal Winner, Independent Publisher Book Awards (IPPY)*Gold Award Winner in Romance, Kops-Fetherling International Book Awards",
  "genres": [
    "Romance",
    "Christmas",
    "Holiday",
    "Contemporary",
    "Fiction"
  ],
  "author": "Mary Ting",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/53872718-when-the-wind-chimes"
}