{
  "title": "Quo Vadis",
  "description": "This glorious saga unfolds against the backdrop of ancient Rome--from the Forum to the Coliseum, from banquet halls to summer retreats in Naples, from the luxurious houses of the nobility to the hovels of the poor, Quo Vadis richly depicts a place and time still captivating to the modern imagination. This radiant translation by W.S. Kuniczak restores the original glory and richness of master storyteller Henryk Sienkiewicz's epic tale.Set at a turning point in history (A.D. 54-68), as Christianity replaces the era of corruption and immorality that marked Nero's Rome, Quo Vadis abounds with compelling characters, including:Vinicius, the proud centurion who has fallen deeply in love with a mysterious young woman who disappears the night they meet;Ligia, the elusive beauty. Vinicius will not easily win her love, for she is a Christian, one of the group of dedicated believers led by the apostle Peter. Christians are rare in pagan, hedonistic Rome, and suffer great persecution;Petronius, uncle to Vinicius, an elegant, witty courtier who scoffs at love and religion but finds his nephew's passion charming; andNero himself, enemy of all Christians, a despotic emperor who plunges Rome deeper and deeper into depravity. The decadence of his banquets is staggering; and even worse, his mad laughter is heard echoing in the amphitheater as gladiators duel to the death.As Nero's appalling plans for the Christians become ever clearer, time appears to be running out for the young lovers. Vinicius must come to understand the true meaning of Ligia's religion before it is too late.Grand in scope and ambition, Quo Vadis explores the themes of love, desire and profound moral courage. Lavish descriptions, vivid dialogue and brilliantly drawn characters make this one of the world's greatest epics. Beloved by children and adults the world over, Quo Vadis has been the subject of five films, two of them in English.",
  "genres": [
    "Classics",
    "Historical Fiction",
    "Fiction",
    "Polish Literature",
    "Historical",
    "School",
    "Romance"
  ],
  "author": "Henryk Sienkiewicz",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/538845.Quo_Vadis"
}