{
  "title": "Summer Fling",
  "description": "For a Good Time Call by Vi Keeland and Penelope WardEver see For a good time call  scribbled on the bathroom wall of a bar? Sure you have. Ever wonder what would happen if you had a few too many drinks and actually called the number? Well now you don’t have to wonder anymore, because I’ll tell you… It blows up in your face when you suddenly realize who Mr. Good Time is.Eternal Sunshine by L.J. ShenAdam Mackay is my brother's best friend, turned Hollywood heartthrob, who is now my brand new, infuriating boss.Sounds complicated? You have no idea...Stay Right Here with Me by Willow WintersI can’t tell you how many mistakes I’ve made sitting in this very spot in this small town bar. Watching the iron doors swing closed as the broad-shouldered man who just walked in sits across from me, I already know he’s on that list of, “I shouldn’t have done that...”Damsel Dude in Distress by Helena HuntingI thought I was helping a damsel in distress. Turns out my damsel was actually a hot dude with some bad luck. It started with a broken down car and ended with a gross motel, an indoor campout and a set of Kama Sutra sheets. The Beach R.S. GreyI’m not supposed to be on vacation with my best friend’s older brother. I’ve wanted him for so long, and now we’re unexpectedly alone in a tropical paradise. Naturally, I packed a lot of bikinis, but I should have brought armor if I want to have any hope of surviving my week away with Noah Martin…or should I say, Dr. Martin. Lucky Shot by Sarina BowenRookie sports agent Bess Beringer gets a real education on the night of her first glitzy New York business dinner. But the things she learns have nothing to do with roster rules or contract negotiation. Luckily, rookie hockey player Mark \"Tank\" Tankiewicz is a pro-level teacher...",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary",
    "Contemporary Romance",
    "Short Stories",
    "Novella",
    "New Adult"
  ],
  "author": "Vi Keeland",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/53900953-summer-fling"
}