{
  "title": "Jdu s hlavou vztyčenou: Příběh rodiny Milady Horákové",
  "description": "Slavná slova Milady Horákové, napsaná v posledním dopisu adresovaném svým nejbližším, jsou titulem knihy publicisty Daniela Anýže věnované neobyčejnému životu rodiny české právničky a političky zavražděné komunistickým režimem v roce 1950. Čtivá a napínavá kniha vychází k 70. výročí komunistické vraždy Milady Horákové.Co formovalo Miladu Horákovou? A kde brala tolik síly, odvahy a energie, aby dokázala přežít nacistické věznění a nepodala se ani svým komunistickým vrahům?Čtenářům se poprvé předkládá ucelený příběh celé její rodiny – statečných lidí, kteří krutě zaplatili za to, že se odmítali smířit se zlem a nesvobodou. To platí o Miladě Horákové, jejím manželovi Bohuslavu Horákovi i jejich dceři Janě Kánské, která se kvůli dvěma totalitním režimům musela obejít bez rodičů. Skutečný domov našla až jako dospělá žena v USA.V mimořádně otevřených osobních rozhovorech se Jana Kánská svěřila autorovi s pozoruhodnými detaily, které má více než 70 let stále před očima. Třeba když vzpomíná na poslední setkání s maminkou pár hodin před popravou, které ona i teta se strýcem proplakali, zatímco odsouzená Milada jim dodávala odvahu. Nebo když rekapituluje osudy své rodiny, jejíž členové byli komunistickým režimem systematicky pronásledováni a trestáni.Čtenáře v knize čekají i doposud nezveřejněné vzpomínky Bohuslava Horáka, jemuž se podařilo před zatčením dramaticky utéct. Za první republiky byl známým novinářem s vlastním, velmi populárním rozhlasovým pořadem. Po emigraci do Německa a poté do USA pracoval pro Moravcovu skupinu bývalých československých agentů. Opakovaně kontaktoval rodinu v Praze, několik agentů chodců mělo dokonce hned několikrát za úkol převést Janu přes hranici. Proč se tak ale nestalo? Jak žila dcera popravené političky v komunistickém Československu? Jak vypadalo shledání otce a dcery po osmnácti letech odloučení? A jak v osmasedmdesáti letech stále vitální Jana Kánská vzpomíná na svou maminku, tatínka a na pár let, které prožili svobodně a dohromady jako rodina? I na tyto otázky kniha Daniela Anýže Jdu s hlavou vztyčenou odpovídá a je tak zároveň silným svědectvím o 20. století s apelem k současnosti. Kniha české veřejnosti připomene, že zlo nelze přehlížet, že je potřeba na zlo ukázat. Bránit to, za co proti dvěma totalitám bojovali manželé Milada a Bohuslav Horákovi. Demokracii a svobodu.Jdu s hlavou vztyčenou",
  "genres": [
    "Biography",
    "Nonfiction"
  ],
  "author": "Daniel Anýž",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/53915179-jdu-s-hlavou-vzty-enou"
}