{
  "title": "Before We Disappear",
  "description": "The Prestige meets What If It’s Us in Before We Disappear, a queer ahistorical fantasy set during the 1909 Seattle Alaska–Yukon–Pacific Exposition, where the two assistants of two ambitious magicians find themselves falling in love amidst a bitter rivalry designed to tear them apart.Jack Nevin’s clever trickery and moral flexibility have served him well his entire life—making him the perfect assistant to the Enchantress, one of the most well-known stage magicians in early-twentieth-century Europe. Without Jack’s steady supply of stolen tricks and copycat sleight-of-hand illusions, the Enchantress’s fame would have burned out long ago—not that she would ever admit it.But when they’re forced to flee the continent for America, the Enchantress finds a new audience in Seattle at the 1909 Alaska–Yukon–Pacific World’s Fair Exposition. She and Jack are set to make a fortune until a new magician arrives on the scene. Performing tricks that defy the imagination, Laszlo’s act threatens to overshadow the Enchantress and co-opt her audience. Jack has no choice but to hunt for the secrets behind Laszlo’s otherworldly illusions—but what he uncovers isn’t at all what he expected.What makes Laszlo’s tricks possible is, unbelievably, a boy that can seemingly perform real magic. Wilhelm’s abilities defy all the laws of physics. His talents are no clever sleights-of-hand. But even though Laszlo and Wilhelm’s act threatens to destroy the life Jack and the Enchantress have built, Jack and Wilhelm have near-instant connection. As the rivalry between the Enchantress and Laszlo grows increasingly dangerous and dire, Jack finds he has to choose between the woman who gave him a life and the boy who is offering him love. It's a new star-crossed romance about the magic of first love from acclaimed author Shaun David Hutchinson.",
  "genres": [
    "Fantasy",
    "LGBT",
    "Romance",
    "Young Adult",
    "Historical Fiction",
    "Queer",
    "Historical"
  ],
  "author": "Shaun David Hutchinson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/53914336-before-we-disappear"
}