{
  "title": "Gay Bar: Why We Went Out",
  "description": "National Book Critics Circle Award WinnerNAMED ONE OF THE BEST BOOKS OF THE YEAR The New York Times * NPR * Vogue * Gay Times * Artforum *“ Gay Bar is an absolute tour de force.” –Maggie Nelson\"Atherton Lin has a five-octave, Mariah Carey-esque range for discussing gay sex.” – New York Times Book ReviewAs gay bars continue to close at an alarming rate, a writer looks back to find out what’s being lost in this indispensable, intimate, and stylish celebration of queer history.Strobing lights and dark rooms; throbbing house and drag queens on counters; first kisses, last  the gay bar has long been a place of solidarity and sexual expression—whatever your scene, whoever you’re seeking. But in urban centers around the world, they are closing, a cultural demolition that has Jeremy Atherton Lin What was the gay bar? How have they shaped him? And could this spell the end of gay identity as we know it?In Gay Bar,  the author embarks upon a transatlantic tour of the hangouts that marked his life, with each club, pub, and dive revealing itself to be a palimpsest of queer history. In prose as exuberant as a hit of poppers and dazzling as a disco ball, he time-travels from Hollywood nights in the 1970s to a warren of cruising tunnels built beneath London in the 1770s; from chichi bars in the aftermath of AIDS to today’s fluid queer spaces; through glory holes, into Crisco-slicked dungeons and down San Francisco alleys. He charts police raids and riots, posing and passing out—and a chance encounter one restless night that would change his life forever. The journey that emerges is a stylish and nuanced inquiry into the connection between place and identity—a tale of liberation, but one that invites us to go beyond the simplified Stonewall mythology and enter lesser-known battlefields in the struggle to carve out a territory. Elegiac, randy, and sparkling with wry wit, Gay Bar is at once a serious critical inquiry, a love story and an epic night out to remember.",
  "genres": [
    "Nonfiction",
    "Queer",
    "LGBT",
    "History",
    "Memoir",
    "Gay",
    "Audiobook"
  ],
  "author": "Jeremy Atherton Lin",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/53915332-gay-bar"
}