{
  "title": "Doesn't Hurt to Ask: Using the Power of Questions to Communicate, Connect, and Persuade",
  "description": "Former congressman and prosecutor Trey Gowdy teaches you how to effectively communicate and persuade on the issues that matter most to you, drawing on his experience in the courtroom and the halls of Congress.\"A must-read for people who want to learn how best to succeed.\"--Dana Perino, Fox News host and bestselling author of And the Good News Is . . .You do not need to be in a courtroom to advocate for others. You do not need to be in Congress to champion a cause. From the boardroom to the kitchen table, opportunities to make your case abound, and Doesn't Hurt to Ask shows you how to seize them. By blending gripping case studies from nearly two decades in a courtroom and four terms in national politics with personal stories and practical advice, Trey Gowdy walks you through the tools and the mindset needed to effectively communicate your message.Along the way, Gowdy reflects on the moments in his life when he learned the most about how to argue and convince. He recounts his missteps during his first murder trial, the conversation that changed his view on criminal justice reform, and what he learned while questioning James Comey and Secretary Hillary Clinton.Sharing the techniques he perfected advocating in law and politics, Gowdy helps you identify your objective, understand your personal jury, and engage in the art of questioning so you can be heard, be understood, and, ultimately, move others. Whether it's getting a boss to take a chance on your idea, convincing someone to support your cause, or urging a child to invest more effort in an important task, movement requires persuasion. Doesn't Hurt to Ask shows you how to persuade, no matter the jury and no matter the cause.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Communication",
    "Politics",
    "Leadership",
    "Personal Development"
  ],
  "author": "Trey Gowdy",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/53919987-doesn-t-hurt-to-ask"
}