{
  "title": "White Knights in the Black Orchestra: The Extraordinary Story of the Germans Who Resisted Hitler",
  "description": "They were a small group of conspirators who risked their lives by plotting relentlessly to obstruct and destroy the Third Reich from within. The Gestapo nicknamed this shadowy confederation of traitors the “Black Orchestra.” This is their tension-filled story. As the “Final Solution” unfolds, a loose network of German military officers, diplomats, politicians, and civilians are doing everything in their power to undermine the Third Reich from the reporting troop movements to the Allies, feeding disinformation to the Nazi high command, plotting to assassinate Adolf Hitler, and more. The Gestapo nicknames this shadowy confederation of traitors the “Black Orchestra.” Its players include Dietrich Bonhoeffer, a dissident Lutheran pastor, and his brother-in-law Hans von Dohnanyi, a staff attorney at the Abwehr, the German military intelligence service. In this tension-filled narrative, Tom Dunkel traces the perilous movements of these “white knights” as they and their families face constant danger of being exposed and executed. Some act out of moral outrage and patriotism. Some want to atone for their own Nazi sins. When their treasonous activities are finally discovered, Hitler’s SS and the Gestapo are hell-bent on taking bloody revenge as the end of the war rapidly approaches and lives hang in the balance. White Knights in the Black Orchestra is a tautly written, meticulously reported account of men and women heroically resisting Hitler’s ruthless regime. It packs the punch of the best espionage thrillers, but the cat-and-mouse drama and plot twists are grounded firmly in fact. This is a stirring story of people willing to risk all by doing the right thing in a country gone mad, a story that may prompt readers to ask themselves “What would I have done?”",
  "genres": [
    "Nonfiction",
    "History",
    "World War II",
    "Historical",
    "War",
    "Politics",
    "European History"
  ],
  "author": "Tom Dunkel",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/53915252-white-knights-in-the-black-orchestra"
}