{
  "title": "‫ألف ليلة وليلة: Complete, Arabian Nights‬",
  "description": "القصة الإطار لحكايات «ألف ليلة وليلة» هي قصة ملك يدعى شهريار، حيث بدأت القصة عندما اكتشف الملك أن زوجة أخيه كانت خائنة وقد صُدم لذلك الأمر، وما زاد ذلك اكتشاف خيانة زوجته له أيضاً، فقد كان أمراً لا يّحتمل بالنسبة إليه، لذا قرّر إعدامها، ورأى أن الخيانة في كل النساء. تزوج الملك شهريار من عذراء كل يوم، حيث يقتلها ليلة العرس، قبل أن تخونه. بلغ الحد بأن لا يجد الوزير عروسا للملك. عندها عرضت ابنته شهرزاد نفسها لتكون عروساً للملك، فوافق أبوها على مضض. في ليلة زواجهما، بدأت شهرزاد تحكي حكاية للملك ولكن لا تنهيها، حيث أثار هذا فضول الملك لسماع نهاية الحكاية، مما دفعه إلى تأجيل إعدامها للاستماع إلى نهاية الحكاية. وفي الليلة التالية، عندما تنتهي من حكاية ما تبدأ بحكاية جديدة، تشوق الملك لسماع نهايتها هي الأخرى وهكذا، حتى أكملت لديه ألف ليلة وليلة.تختلف الحكايات فهي متنوّعة، وتشمل القصص التاريخية والغرامية والتراجيدية والكوميدية، والشعرية، والخيالية، والأسطورية، بالإضافة إلى عدة أنواع من القصص الجنسية. وهناك قصص عديدة تصف الجن والغيلان والقردة، كما أن هناك قصصاً عن السحرة والمشعوذين والأماكن الأسطورية، والتي غالباً ما تتداخل مع أناس حقيقيين وأماكن موجودة على أرض الواقع، ولكنها ليست دائما منطقية.ألف ليلة وليلة هو عبارة عن قصص وردت في غرب وجنوب آسيا بالإضافة إلى الحكايات الشعبية التي جُمِعت وتُرجمت إلى العربية خلال العصر الذهبي للإسلام. يعرف الكتاب أيضاً باسم الليالي العربية في اللغة الإنجليزية، منذ أن صدرت النسخة الإنجليزية الأولى منه سنة 1706، واسمه العربي القديم \"أسمار الليالي للعرب مما يتضمن الفكاهة ويورث الطرب\"وفقاً لناشره وليم ماكنجتن.جُمع العمل على مدى قرون، من قِبل مؤلفين ومترجمين وباحثين من غرب ووسط وجنوب آسيا وشمال أفريقيا. تعود الحكايات إلى القرون القديمة والوسطى لكل من الحضارات العربية والفارسية والهندية والمصرية وبلاد الرافدين. معظم الحكايات كانت في الأساس قصصاً شعبية من عهد الخلافة، وبعضها الآخر، وخاصة قصة الإطار، فعلى الأرجح تم استخلاصها من العمل البهلوي الفارسي «ألف خرافة» (بالفارسية: هزار أفسان) والتي بدورها اعتمدت جزئياً على الأدب الهندي. بالمقابل هناك من يقول أن أصلها هذه الروايات بابلي.ما هو شائع في جميع النُّسخ الخاصة بالليالي هي البادئة، القصة الإطارية عن الحاكم شهريار وزوجته شهرزاد، التي أدرجت في جميع الحكايات. حيث أن القصص تنطلق أساساً من هذه القصة، وبعض القصص مؤطرة داخل حكايات أخرى، في حين تبدأ أخرى وتنتهي من تلقاء نفسها. بعض النُّسخ المطبوعة لا تحتوي سوى على بضع مئات من الليالي، والبعض الآخر يتضمن ألف ليلة وليلة أو أكثر. الجزء الأكبر من النص هو بأسلوب النثر، على الرغم من استخدام أسلوب الشعر أحياناً للتعبير عن العاطفة المتزايدة، وأحياناً تستخدم الأغاني والألغاز. معظم القصائد هي مقاطع مفردة أو رباعيّة، كما أن بعضها يكون أطول من ذلك.هناك بعض القصص المشهورة التي تحتويها ألف ليلة وليلة، مثل \"علاء الدين والمصباح السحري\"، و\"علي بابا والأربعون لصاً\"، و\"رحلات السندباد البحري السبع\"، كما أن هناك بعض الحكايات الشعبية في منطقة الشرق الأوسط التي تعتبر شبه مؤكدة تقريباً، وليست جزءاً من ألف ليلة وليلة الموجودة في الإصدارات العربية، ولكنها أضيفت من قبل المستشرق الفرنسي أنطوان غالان ومترجمين أوروبيين آخرين، وكان أنطوان غالان قد عمل على ترجمة الكتاب إلى الفرنسية سنة 1704.تُرجِم كتاب ألف ليلة وليلة إلى عدّة لغات، وقد طبع بالعربية لأول مرة في ألمانيا سنة 1825م بإشراف «المستشرق هايخت» فأنجز منه ثمانية أجزاء، مع ترجمته إلى الألمانية، وتوفي قبل إتمام الكتاب، فأنجز الباقي تلميذه هاينريخ فلايشر المتوفي سنة 1888م ثم طبع مرات عدّة، أهمها طبعة مصطفى البابي الحلبي بمصر سنة 1960م. وقد عمِل محسن مهدي على توثيق النسخ العربية في عمل صدر له في ليدن سنة 1984م. هناك مجموعة من الرسومات صاحبت الترجمات الغربية لألف ليلة وليلة في كتاب (ألف ليلة وليلة: مقالات نقدية وببلوغرافية) الصادر باللغة الإنجليزية، و(ديوان ألف ليلة وليلة) تحقيق عبد الصاحب العقابي: كتاب التراث الشعبي، ويقع الكتاب في 577 صفحة مزودة بلوحات فنية. أما مؤلف الكتاب فلا يعرف حتى الآن من هو واضع كتاب \"ألف ليلة وليلة\"، وقد ذهب «الشرواني» في مقدمة الطبعة الإيرانية إلى أن واضع الكتاب شامي الأصل، جعله في لغة مبسطة متوخياً تعليم اللغة العربية إلى الراغبين فيها أكثر ما توخى الاقتراب من إفهام الناس. وقد لحقه الرأي دي ساسي الذي لا يستبعد أن يكون قد زاد على الأصل السوري النقلة والحكاؤون، في كل زمان ومكان أخباراً وحكايات من عندهم.",
  "genres": [],
  "author": "Anonymous",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/53918267"
}