{
  "title": "Band of Sisters",
  "description": "A group of young women from Smith College risk their lives in France at the height of World War I in this sweeping novel based on a true story—a skillful blend of Call the Midwife and The Alice Network—from New York Times bestselling author Lauren Willig.A scholarship girl from Brooklyn, Kate Moran thought she found a place among Smith’s Mayflower descendants, only to have her illusions dashed the summer after graduation. When charismatic alumna Betsy Rutherford delivers a rousing speech at the Smith College Club in April of 1917, looking for volunteers to help French civilians decimated by the German war machine, Kate is too busy earning her living to even think of taking up the call. But when her former best friend Emmeline Van Alden reaches out and begs her to take the place of a girl who had to drop out, Kate reluctantly agrees to join the new Smith College Relief Unit.Four months later, Kate and seventeen other Smithies, including two trailblazing female doctors, set sail for France. The volunteers are armed with money, supplies, and good intentions—all of which immediately go astray. The chateau that was to be their headquarters is a half-burnt ruin. The villagers they meet are in desperate straits: women and children huddling in damp cellars, their crops destroyed and their wells poisoned. Despite constant shelling from the Germans, French bureaucracy, and the threat of being ousted by the British army, the Smith volunteers bring welcome aid—and hope—to the region. But can they survive their own differences? As they cope with the hardships and terrors of the war, Kate and her colleagues find themselves navigating old rivalries and new betrayals which threaten the very existence of the Unit.With the Germans threatening to break through the lines, can the Smith Unit pull together and be truly a band of sisters?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "World War I",
    "War",
    "France"
  ],
  "author": "Lauren Willig",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/53914953-band-of-sisters"
}