{
  "title": "Hero",
  "description": "Mercenaries. Outcasts. Alphas.Knox knows all the five of them have left now is each other. That, and the driving desire to find who had slaughtered their pack and make that person pay.But investigating a tragedy with only rubble as evidence requires money and time. Knox can find one and use it to buy the other. They may be the last remaining members of a once thriving pack, but they are no strangers to taking the types of jobs that would keep lesser men awake at night.Finding and returning some young punk to his rich, asshole father shouldn’t be all that difficult.Jazz Whitten lives as he likes, always. Since leaving home when he was young, he’s operated under a single rule, never stay where you aren’t wanted. Using his unique ability and the sleight of hand he’s perfected over the years, life as a fugitive isn’t that bad. It’s lonely at times, but freedom is more important than companionship.But when Jazz comes head to head with the latest team hired by his father, he forgets his own rule. He knows it is money, not affection that keeps the team on his tail. Their leader, Knox, is merciless and focused, but there’s something else about the man. It isn’t his kindness—Knox is a brute and unfortunately for Jazz, he’s smart too—but Knox radiates a type of pain that Jazz is all too familiar with.Jazz is as slippery as he is sexy and it takes every trick Knox has to catch up with him. But when he does, how will the stone-cold mercenary ever give him up?Hero is the first book in the Wolves of Royal Paynes series. It is an action-packed, swelteringly hot, mpreg romance that introduces a world of intrigue, mystery, and magic. For maximum enjoyment, this series should be read in order.Wolves of Royal Paynes is the second series in the Wolves of World. Though the series are connected, they may be read on their own for maximum enjoyment..",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Omegaverse",
    "Fantasy",
    "Romance",
    "Magic"
  ],
  "author": "Kiki Burrelli",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/53928636-hero"
}