{
  "title": "The Sum of Us: What Racism Costs Everyone and How We Can Prosper Together",
  "description": "A powerful new exploration about the self-destructive bargain of white supremacy and its rising cost to all of us--including white people--from one of today's most insightful and influential thinkers.Heather C. McGhee's specialty is the American economy--and the mystery of why it so often fails the American public. As she dug into subject after subject, from the financial crisis to declining wages to collapsing public infrastructure, she found a common problem at the bottom of them racism--but not just in the obvious ways that hurt people of color. Racism has costs for white people, too. It's the common denominator in our most vexing public problems, even beyond our economy. It is at the core of the dysfunction of our democracy and even the spiritual and moral crises that grip us. Racism is a toxin in the American body and it weakens us all. But how did this happen? And is there a way out?To find the way, McGhee embarks on a deeply personal journey across the country from Mississippi to Maine, tallying up what we lose when we buy into the zero-sum paradigm--the idea that progress for some of us must come at the expense of others. Along the way, she collects the stories of white people who confide in her about losing their homes, their dreams and their shot at a better job to the toxic mix of American racism and greed. This is the story of how public goods in this country--from parks and pools to functioning schools--have become private luxuries; of how unions collapsed, wages stagnated, and inequality increased; and of how this country, unique among the world's advanced economies, has thwarted universal healthcare. It's why we fail to prevent environmental and public health crises that require collective action. But in unlikely places of worship and work, McGhee also finds proof of what she calls the Solidarity gains that come when people come together across race, to the benefit of all involved.The Sum of Us is a brilliant analysis of how we arrived divided and self-destructing, still the richest country in the world, but spiritually starved and vastly unequal. At the heart of the book are the humble stories of Americans yearning to be a part of a better America, including white supremacy's collateral white people themselves. With startling empathy, this heartfelt message from a Black woman to a multiracial America leaves us with a vision for the future of our country--one whose population has ties to every place on the globe--where we finally realize that life can be so much more than zero-sum.",
  "genres": [
    "Nonfiction",
    "Race",
    "History",
    "Politics",
    "Social Justice",
    "Audiobook",
    "Anti Racist"
  ],
  "author": "Heather  McGhee",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/53928578-the-sum-of-us"
}