{
  "title": "Django: The Life and Music of a Gypsy Legend",
  "description": "Django Reinhardt was arguably the greatest guitarist who ever lived, an important influence on Les Paul, Charlie Christian, B.B. King, Jerry Garcia, Chet Atkins, and many others. Yet there is no major biography of Reinhardt.Now, in Django , Michael Dregni offers a definitive portrait of this great guitarist. Handsome, charismatic, childlike, and unpredictable, Reinhardt was a character out of a picaresque novel. Born in a gypsy caravan at a crossroads in Belgium, he was almost killed in a freak fire that burnedhalf of his body and left his left hand twisted into a claw. But with this maimed left hand flying over the frets and his right hand plucking at dizzying speed, Django became Europe's most famous jazz musician, commanding exorbitant fees--and spending the money as fast as he made it. Dregni not onlychronicles this remarkably colorful life--including a fascinating account of gypsy culture--but he also sheds much light on Django's musicianship. He examines his long musical partnership with violinist Stéphane Grappelli--the one suave and smooth, the other sharper and more dissonant--and he tracesthe evolution of their novel string jazz ensemble, Quintette du Hot Club de France . Indeed, the author spotlights Django's amazing musical diversity, describing his swing-styled Nouveau Quintette, his big band Django's Music, and his later bebop ensemble, as well as his many compositions, includingsymphonic pieces influenced by Ravel and Debussy and his unfinished organ mass inspired by Bach. And along the way, the author offers vivid snapshots of the jazz scene in Paris--colorful portraits of Josephine Baker, Bricktop, Louis Armstrong, Coleman Hawkins, and countless others--and of Django'svagabond wanderings around France, Europe, and the United States, where he toured with Duke Ellington.Capturing the extraordinary life and times of one of the great musicians of the twentieth century, Django is a must-read portrait of a true original.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Jazz",
    "History",
    "Memoir",
    "France"
  ],
  "author": "Michael Dregni",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/539553.Django"
}