{
  "title": "Too Good To Be Forgotten: Changing America in the '60s and '70s",
  "description": "\"Whether it be My Lai, Watergate, The Pentagon Papers, or any of the other tumultuous events of that era, Obst seems to be in the middle of it. To understand this period, Too Good To Be Forgotten is a must read.\" —Seymour M. Hersh \"Hooray and Hallelujah! David Obst is finally telling all of his secrets about publishing, politics, and the kind of journalism spawned by Watergate. Read this book and head for the bunker.\" —Kitty Kelley \"David Obst is as crazy as the period he writes about. His stories make me both proud and ashamed to be part of his generation.\" —P. J. O'Rourke \"Occasionally lucid. Doubtless the most compelling book about David Obst yet written in this century.\" —Taylor Branch \"God knows many of them are fools, and most of them will be sellouts, but they're a better generation than we were. Since when are youths not allowed to be asses?\" —Lillian Hellman on the '60s Generation Few people saw as much or knew as many of the primary figures of the '60s and '70s as David Obst. A journalist in the maelstrom of the anti-war movement, he helped break Seymour Hersh's Pulitzer Prize-winning My Lai Massacre story. A behind-the-scenes operator, he baby-sat the Pentagon Papers for Daniel Ellsberg. And as the hottest literary agent of the period, Obst quickly sewed up deals with the Watergate intelligentsia, including Bob Woodward, Carl Bernstein and John Dean. Given his insider status, Obst offers some intriguing speculation on the identity of Deep Throat. Obst's knack for being at the center of every interesting story makes Too Good To be Forgotten a rare, you-are-there joy ride across the political and cultural frontier of that era. Surviving a youth of nuclear drop drills, Sputnik, and the Cuban Missile Crisis, Obst went on to study Chinese in Taipei. There, while working as an impromptu translator for GIs trying to pick up women in a local bar, he heard the truth about what was happening in the Vietnam War. Returning to America, he immersed himself in the anti-war movement and the countercultural zeitgeist of the '60s. Through Obst's eyes, we see the casual mix of idealism and excitement of the the 1968 Democratic Convention, where he barely escapes the beatings of Chicago police in Lincoln Park; the People's Park protests in Berkeley where he gets a face full of tear gas while trying to impress a comely woman; the Black Panther rally, where he receives a \"Honkies for Huey\" button; and the 1972 Republican Convention where Abbie Hoffman slips him an illegal substance that hits at the very moment Richard Nixon steps to the podium to accept the nomination. A definitive look at the baby boomers' coming of age, Too Good To be Forgotten puts you right in the thick of some of the defining moments of the time the kids tried to take the country away from the grown-ups. David Obst provides us with the memoir of a generation.",
  "genres": [
    "Nonfiction"
  ],
  "author": "David Obst",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/1262975.Too_Good_To_Be_Forgotten"
}