{
  "title": "Sweetest in the Gale",
  "description": "3 stories + 3 couples = 6 lonely hearts finding happily-ever-after at last.\"Sweetest in the Gale\": Much ado about love...Candy Albright has always stomped confidently through the halls of Marysburg High, passionate and loud and entirely devoted to her students and her various English department initiatives. From his first day as her colleague, Griff Conover couldn't look away, despite his best efforts.After a summer apart, though, Candy returns to school a changed woman. Muted. Dimmed. Bowed by a grief Griff recognizes all too well, but doesn't yet understand. And when they're thrown together to coordinate a poetry project, he can't resist the urge to read between her lines once and for all--even if doing so means he'll have to confront his own loss...and his own lonely, longing heart.\"Unraveled\": The more tightly wound a man is, the faster he unravels...Math teacher Simon Burnham--cool, calm, controlled--can't abide problems with no good solution. Which makes his current work assignment, mentoring art teacher Poppy Wick, nothing short of torture. She's warm but sharp. Chaotic but meticulous. Simultaneously the most frustrating and most alluring woman he's ever known. And in her free time, she makes murder dioramas. Murder dioramas, for heaven's sake. But the more tightly wound a man is, the faster he unravels--and despite his best efforts, he soon finds himself attempting to solve three separate mysteries: a murder in miniature, the unexplained disappearance of a colleague...and the unexpected theft of his cold, cold heart.\"Cover Me\": First comes marriage...Elizabeth Stone has no health insurance. No savings. No one to turn to when she finds a lump on her breast...except James Magnusson, her friend of over twenty years. When he offers her a marriage of convenience for healthcare coverage, she'd be a fool to say no. But given the emotions she's buried for so long, saying yes might lead to a broken heart.James won't take no for an answer. Not when marriage could save Elizabeth's life, and not when he's finally realized how much he needs her. Even during his doomed first marriage, James considered Elizabeth a special friend--one he had to keep at a safe distance. Now he's free, and Elizabeth is his wife...but will they finally have the chance to be together, only to have everything torn apart?Content guidance for \"Cover Me\": This story contains discussions of breast cancer, an on-page mammogram and biopsy, and a definite happily-ever-after.This book contains one entirely new story (\"Sweetest in the Gale\") and two stories previously published in the He's Come Undone and Rogue Acts anthologies. The latter stories have been lightly edited since their original publication, and \"Unraveled\" has a new epilogue.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook",
    "Fiction",
    "Novella",
    "Adult"
  ],
  "author": "Olivia Dade",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/53950329-sweetest-in-the-gale"
}