{
  "title": "مجموع فتاوى شيخ الإسلام أحمد بن تيمية: العقيدة الجزء 1 من 5 أجزاء يحتوي على كتب العقيدة الثمانية",
  "description": "قال ابن القيم:شيخ الاسلام والمسلمين القائم ببيان الحق ونصرة الدين الداعي إلى الله ورسوله المجاهد في سبيله الذي أضحك الله به من الدين ما كان عابسا وأحيى من السنة ما كان دارسا والنور الذي أطلعه الله في ليل الشبهات فكشف به غياهب الظلمات وفتح به من القلوب مقفلها وأزاح به عن النفوس عللها فقمع به زيغ الزائغين وشك الشاكين وانتحال المبطلين وصدقت به بشارة رسول رب العالمين يقول إن الله يبعث لهذه الأمة على رأس كل مائة سنة من يجدد لها دينها، وبقوله: يحمل هذا العلم من كل خلف عدوله ينفون عنه تحريف الغالين وانتحال المبطلين.شيخ الإسلام بحر العلوم ترجمان القرآن مفتي الفرق أوحد المجتهدين أبي العباس أحمد تقي الدين ابن الشيخ الإمام شيخ الإسلام مجد الدين عبد السلام بن عبد الله بن الخضر بن محمد بن الخضر بن علي بن عبد الله بن تيميةقال ابن فضل الله العمري في تاريخه المسمى بمسالك الأبصار في ممالك الأمصار في ترجمة ابن تيمية وهي طويلة تبلغ كراسة فأكثر:ومنهم أحمد ابن عبد الحليم بن عبد السلام العلامة الحافظ المجتهد المفسر شيخ الإسلام نادرة العصرة علم الزهاد. هو البحر من أي النواحي جئته والبدر من أي الضواحي رأيته رضع ثدي العلم منذ فطم وطلع وجه الصباح ليحاكيه فلطم وقطع الليل والنهار ردائين واتخذ العلم والعمل صاحبين إلى أن أنسى السلف بهداه وأنأى الخلف عن بلوغ مداه على أنه من بيتٍ نشأت منه علماء في سالف الدهور ونشأت منه عظماء على المشاهير الشهور فأحيا معالم بيته القديم إذ درس وجنى من فننه الرطيب ما غرس وأصبح في فضله آية إلا أنه آية الحرس عرضت له الكدى فزحزحها وعارضته البحار فضحضها ثم كان أمة وحده وفردا حتى نزل لحده أخمل من القرناء كل عظيم وأخمد من أهل البدع كل حديث وقديم جاء في عصر مأهول بالعلماء مشحون بنجوم السماء تموج في جوانبه بحور خضارم وتطير بين خافقيه نسور قشاعم وتشرق في أنديته بدور دجنة وتبرق في ألويته صدور أسنة إلا أن شمسه طمست تلك النجوم وبحره طم على تلك الغيوم وابتلع غديره المطمئن جداولها واقتلع طوده المرجحن جنادلها ثم عبيت له الكتائب فحطم صفوفها وخطم أنوفها وأخمدت أنفاسهم ريحه وأكمدت شراراتهم مصابيحهتقدم ركابا فيهم إماما ** ولولاه لما ركبوا وراءهفجمع أشتات المذاهب وشتات الذاهب ونقل عن أئمة الإجماع فمن سواهم مذاهبهم المختلفة واستحضرها ومثل صورهم الذاهبة وأحضرها فلو شعر أبو حنيفة بزمانه وملك أمره لأدنى عصره إليه مقتربا أو مالك لأجرى وراءه أشهبه وكوكبا أو الشافعي لقال ليت هذا كان للأم ولدا وليتني كنت له أبا أو الشيباني ابن حنبل لما لام عذاره إذ غدا منه لفرط العجب أشيبا لا بل داود الظاهري وسنان الباطني لظنا تحقيقه من منتحله أو ابن حزم والشهرستاني لحشر كل منهما ذكره في نحله أو الحاكم النيسابوري والحافظ السلفي لأضافه هذا إلى مستدركه وهذا إلى رحله.ترد إليه الفتاوى ولا يردها وتفد عليه فيجيب عنها بأجوبة كأنه كان قاعدا لها يعدهاأبدا على طرف اللسان جوابه ** فكأنما هي دفعة من صيبوكان من أذكى الناس كثير الحفظ قليل النسيان قلما حفظ شيئا فنسيه. وكان إماما في التفسير وعلوم القرآن عارفا بالفقه واختلاف الفقهاء والأصوليين والنحو وما يتعلق به واللغة والمنطق وعلم الهيئة والجبر والمقابلة وعلم الحساب وعلم أهل الكتابين وعلم أهل البدع وغير ذلك من العلوم النقلية والعقلية.وما تكلم معه فاضل في فن من الفنون إلا ظن أن ذلك الفن فنهوكان حافظة للحديث مميزا بين صحيحه وسقيمه عارفا برجاله متضلعا من ذلك وله تصانيف كثيرة وتعاليق مفيدة وفتاوى مشبعة في الفروع والأصول والحديث ورد البدع بالكتاب والسنةقال ابن سيد الناس:وهو الذي حداني على رؤية الشيخ الإمام شيخ الإسلام تقي الدين أبي العباس أحمد بن عبد الحليم بن عبد السلام بن تيمية، فألفيته ممن أدرك من العلوم حظا وكاد أن يستوعب السنن والآثار حفظا، إن تكلم في التفسير فهو حامل رايته أو أفتى في الفقه فهو مدرك غايته أو ذاكر في الحديث فهو صاحب علمه وذو روايته أو حاضر بالملل والنحل لم ير أوسع من نحلته في ذلك ولا أرفع من درايته.برز في كل فن على أبناء جنسه ولم تر عين من رآه مثله ولا رأت عينه مثل نفسهوقال ابن دقيق العيد: لما اجتمعت بابن تيمية رأيت رجلا العلوم كلها بين عينيه يأخذ منها ما يريد ويدع ما يريدقال ابن الوردي في رحلته لما ذكر علماء دمشق:وتركت التعصب والحمية وحضرت مجالس ابن تيمية فاذا هو بيت القصيدة وأول الخريدة علماء زمانه فلك هو قطبه وجسم هو قلبه يزيد عليهم زيادة الشمس على البدر والبحر على القطربحثت بين يديه يوما فاصبت المعنى فكناني وقبل بين عيني اليمنى فقلتإن ابن تيمية ** في كل العلوم واحدأحييت دين أحمد ** وشرعه يا أحمد",
  "genres": [
    "Islam"
  ],
  "author": "ابن تيمية",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/53931144"
}