{
  "title": "What The… Hello, Kitty-Kat!",
  "description": "He’s got a hot body, and he’s crazy about cats. She’s got a…body, and with her luck in relationships, she’s a crazy cat lady in the making. Now they’re a fake match made in PR heaven…KEATONI wasn’t trying to get famous. It was just something that fell in my lap one day when I shared a video that went viral. A man and his cat at the beach—who’d have thought that’d be the reason I shot to international fame?But it happened, and now I’m just trying to navigate this minefield that’s fraught with problems I didn’t think I’d have.I like the money and all, but the judgement and the fake news I can do without.That’s why I agree when my publicist assigns me a fake girlfriend.She’s supposed to improve my image with her demure smile and squeaky clean background.Everything about us was just business. At first.I’ve never been into the nerdy librarian look, but Ada Kershaw does something I wasn’t expecting, something no one else has ever been able to do.She charms my cat.Now I’m looking at her in a whole new light. She might be the woman of my dreams.ADAI didn’t want to be his girlfriend. Keaton James looks like every young guy on social media—hot body, gorgeous face…nothing between the ears.While I love a chiseled chest as much as the next girl, it isn’t at the top of my list.I long for intellectual conversation, deep soul-baring confessions that tell me about a man’s heart instead of his body.But, that’s probably why I’ve been single all my life.Perhaps looking for a soulful connection first will be the reason I remain alone, with only my cats for company.I suppose that’s one thing Keaton has going for him—an adorable cat.So when I’m offered a rather large sum of money to pretend to be his girl for a few months, I figure why not? I’ll appear in some photos and go to a few parties, pet his adorable cat and that will be that.How very wrong I was.Note to self: Next time you sign a contract, read the fine print.I’ve just signed up to be Keaton James’s live in girlfriend.What do I do now?Ready for seven all-new alphas to take control of your library!? From head to toe, these hotties are prepared to deliver the heart-pounding HEA’s you’re craving! Forget the beach, these heroes are the summer fun you need!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Novella",
    "Adult",
    "Short Stories"
  ],
  "author": "Megan Wade",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/53937289-what-the-hello-kitty-kat"
}