{
  "title": "Undercover Epicenter Nurse: How Fraud, Negligence, and Greed Led to Unnecessary Deaths at Elmhurst Hospital",
  "description": "Undercover Epicenter Nurse blows the lid off the COVID-19 pandemic.  What would you do if you discovered that the media and the government were lying to us all? And that hundreds, maybe thousands of people were dying because of it?  Army combat veteran and registered nurse Erin Olszewski’s most deeply held values were put to the test when she arrived as a travel nurse at Elmhurst Hospital in the epicenter of the COVID-19 pandemic. After serving in Iraq, she was back on the front lines—and this time, she found, the situation was even worse.  Rooms were filthy, nurses were lax with sanitation measures, and hospital-acquired cases of COVID-19 were spreading like wildfire. Worse, people who had tested negative multiple times for COVID-19 were being labeled as COVID-confirmed and put on COVID-only floors. Put on ventilators and drugged up with sedatives, these patients quickly deteriorated—even though they did not have coronavirus when they checked in. Doctors-in-training were refusing to perform CPR—and banning nurses from doing it—on dying patients whose families had not consented to “Do Not Resuscitate” orders. Erin wasn’t about to stand by and let her patients keep dying on her watch, but she knew that if she told the truth, people wouldn’t believe her. It was just too shocking. Willing to go to battle for her patients, Erin made the decision to go deep undercover, recording conversations with other nurses, videos of malpractice, and more. She began to share what she found on social media. Unsurprisingly, she was fired for it. Now, Erin is standing up to tell the whole horrifying story of what happened inside Elmhurst Hospital to demand justice for those who fell victim to the hospital’s greed. Not only must the staff be held accountable for their unethical actions; but also, this kind of corruption must be destroyed so that future Americans are not put at risks. The deaths have to end, and Erin won’t rest until the bad actors are exposed.  Undercover Epicenter How Fraud, Negligence, and Greed Led to Unnecessary Deaths at Elmhurst Hospital  is a shocking and infuriating inside exposé of the American healthcare system gone wrong. At the same time, it’s the story of a woman who traveled from the small-town streets of Wisconsin, to the battlefields of Iraq, to the mean streets of Queens, on a quest to help fight for her country. With this book, the real battle has begun.",
  "genres": [
    "Nonfiction",
    "Medical",
    "Biography",
    "Audiobook",
    "Health Care"
  ],
  "author": "Erin Marie Olszewski",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/53940198-undercover-epicenter-nurse"
}