{
  "title": "Lucky Catch",
  "description": "Lucky Catch is part of Kristen Proby's With Me in Seattle Universe.LexieI don’t date football players.As an unproven sideline reporter, I need to show I’m more than a pretty face. And I have the perfect opportunity when my boss asks me to dig into the rookie wide receiver, Gavin Keller. Coming from a family of football stars, he’s my chance to write a huge story about the newest Keller to go pro. I need to get to know the man under the pads. Is he an arrogant entitled player or is there a side to him no one knows about?The more I watch Gavin at practice and when he mentors young athletes, the more I realize he’s nothing like I thought. He’s a leader, someone the fans can rally behind. The more I see, the more I like him—not the player. And the looks he gives me say he feels the same.As we get closer, I'm tempted to break my no-player rule. But if anyone finds out, it’s my job on the line. Giving in would mean losing everything.GavinI've always had more to prove than any of my teammates. I know what everyone says about me. Since the first time I touched a ball, I've been living in the shadow of my family's football legacy. My life is focused on my game and giving back and nothing else. I'm not giving anyone another reason to talk. That's until the new reporter, Lexie Austin appears on the sidelines in her skin-tight tailored suits and sky-high heels. They say she’s only here because of her looks, just like they say I’m only here because of my name.So what if everyone is as wrong about her as me? She’s more than a pretty face and I’m playing better than ever with her watching. It's starting to feel like she’s my personal good luck charm. She doesn’t care about my last name, my signing bonus, or my star potential. She wants to know me.I want her in my bed, by my side, and in my life. Now I just have to convince her that if she falls, it'll be the luckiest catch I ever make.",
  "genres": [],
  "author": "Lea Coll",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/53934098-lucky-catch"
}