{
  "title": "Digital Downfall: Technology, Cyberattacks and the End of the American Republic",
  "description": "\"With the assertion that 'America is in danger of falling apart,' Hugh Taylor warns us in Digital Downfall that the vulnerabilities of our digital lives could allow foreign cyber mischief to exacerbate current political tensions - with disastrous results. Each chapter reads as a separate essay, explaining the basics of cyber insecurity, why Russia and China are such a threat and how our society should adapt to the digital revolution. This comprehensive and incisive book should be read by anyone who wants to ensure America survives the existential threats posed by cyber vulnerabilities.\" - Glenn Gerstell, General Counsel of the United States National Security Agency from 2015 to 20204 out of 5 stars - \"This book is terrific! Hugh Taylor is a master at storytelling, weaving compelling personal stories with vital information to help us stay safe online. I am not a techno genius, so I thought it might be too advanced, however it was clear and easy to understand. A great book for a layperson to read and absorb.\" - Emma Cavanagh, NetGalleyIs America on the brink of civil war? Could foreign cyber plots turn Americans against one another and cause a disastrous domestic conflict? What would happen if the lights went out and the technology we rely upon to run American life is no longer available? The present dangers are real. The US is more vulnerable to destructive foreign interference today than it has been in over a century. As Russia and China realize they can't win shooting wars against the US, they have devised new and cunning ways to destabilize American politics and cripple the US economy. Cyber meddling in elections, disinformation campaigns, abuse of social media to widen racial and political divides, and the theft of military data are just some of the malicious acts threatening the Republic. Digital Downfall examines the potential effects of such attacks, with a look vulnerability of the US to cyber attack*American technological weaknesses that could be exploited by our enemies*How the US military could be affected by cyberwar*The possibility that the American Republic we know could be destroyed*America's relationship with racism*What the future may hold*And more...The dangers posed by external sources can only be real when the internal politics of the United States is in a fragile state. The past four years bear testimony to this political decline as does every passing day of the Trump presidency. The perfect storm of external interference, a rampant and deadly pandemic, and a culture of racism that will no longer be tolerated is upon us. Who knows where it will lead to, or what will be left at the end...About the  Hugh Taylor is Executive Editor of The Journal of Cyber Policy, a cybersecurity industry blog. He has been working in the enterprise technology and cybersecurity fields for over 20 years, earning the Certified Information Security Manager (CISM) credential in the process. His previous books include The Joy of SOX (Wiley) about IT and the Sarbanes Oxley Act, and Event Driven Architecture (Prentice-Hall). After serving in executive roles at venture-backed startups and global tech giants like IBM and Microsoft, he now works as a freelance tech writer. His professional writing spans technology and cybersecurity for a clientele that includes HPE, IBM, Google, Microsoft and SAP. Prior to working in technology, Taylor served in script development roles in primetime television-an experience that gives him insights into the relationship between technology, society and the media.",
  "genres": [],
  "author": "Hugh     Taylor",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/53984436-digital-downfall"
}