{
  "title": "Lessons from the Edge: A Memoir",
  "description": "INSTANT  NEW YORK TIMES  BESTSELLER | An inspiring and urgent memoir by the former U.S. ambassador to Ukraine—a pioneering diplomat who spent her career advancing democracy in the post-Soviet world, and who electrified the nation by speaking truth to power during the first impeachment of President Trump. Marie Yovanovitch was at the height of her diplomatic career when it all came crashing down. In the middle of her third ambassadorship—a rarity in the world of diplomacy—she was targeted by a smear campaign and abruptly recalled from her post in Kyiv, Ukraine. In the months that followed, she endured personal tragedy while simultaneously being pulled into the blinding lights of the first impeachment inquiry of Donald Trump. It was a time of chaos and pain, for her and for the nation. Yet Yovanovitch was no stranger to instability and injustice. Born into a family that had survived Soviet and Nazi terror, she first saw the corrosive effect of corruption in Somalia while cutting her teeth as a diplomat in the male-dominated world of the 1980s State Department. She was an eyewitness to the 1993 constitutional crisis in Russia and the street fighting in Moscow. And she rose to the top of her profession in the crucible of the former USSR, where she saw how President Vladimir Putin adeptly exploited corrupt leaders in neighboring countries and undermined their developing democracies. Nowhere was Putin’s aggression clearer than in Ukraine, where Russia meddled in elections, launched cyberattacks, peddled misinformation, illegally annexed Crimea, invaded the Donbas, and attacked Ukrainian ships in the Black Sea. But when Yovanovitch was abruptly recalled from her post and Ukraine’s democratically elected president, Volodymyr Zelenskyy, found himself set upon by Trump, it became clear just how dangerously close to the edge America itself had strayed. Through it all, Yovanovitch tirelessly advocated for the Ukrainian people, while advancing U.S. interests and staying true to herself. When she made the courageous decision to participate in the impeachment inquiry—over the objections of the Trump administration—she earned the nation’s respect, and her dignified response to the president’s attacks won our hearts. She has reclaimed her own narrative, first with her lauded congressional testimony, and now with this powerful the dramatic saga of one woman’s role at the vanguard of American foreign policy during a time of upheaval, for herself and for our country. A Publishers Marketplace 2021 Buzz Book “A brilliant, engaging, and inspiring memoir from one of America’s wisest and most courageous diplomats—essential reading for current policymakers, aspiring public servants, and anyone who cares about America’s role in the world.” —Madeleine K. Albright “First through the breach, Ambassador Yovanovitch showed Americans what courage and patriotism looks like. More than essential reading,  Lessons from the Edge  is thoroughly engaging and impossible to put down, showing us how an introverted career diplomat overcame the most vicious of smear campaigns to become a foreign service legend.” —Congressman Adam Schiff “At turns moving and gripping and always inspiring … a powerful testament to a uniquely American life well-lived and a remarkable career of dedicated public service at the highest levels of government.” —Fiona Hill, New York Times best-selling author of There Is Nothing for You Finding Opportunity in the Twenty-First Century",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Politics",
    "History",
    "Biography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Marie Yovanovitch",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/53968466-lessons-from-the-edge"
}