{
  "title": "Sunsets & Somedays",
  "description": "BenI know why I lost her. I was too serious. I was too practical. I was grounded when I should’ve been dreaming about forever with Jess. Over time, this wore on her, all her big exciting ideas and all the ways I shut them down. No wonder she handed me my ring back and left town. No wonder she hadn’t been back in ten years. No wonder she’d married someone else, leaving me with memories of sunsets at the beach and the somedays we planned for the future we’d never live.  So, I built a lift without her. My father and I opened the second division of Sunset Builders in New York, and to my surprise, I stayed busy, almost busy enough not to notice the loneliness.  While I was on a job site, my little sister booked an appointment with a woman who lived on Madison Avenue. A quick bathroom and kitchen remodel, she’d said. I should have asked more questions because when I arrived and the door opened memories came flooding back.  Jessica had returned. If I’d learned anything in her absence it was that anything worth doing was worth being done well, and anything worth having was worth fighting for. Maybe by the time the condo was done, Jessica would give me a second chance.  JessicaAll those years ago, Ben had been right to try to keep me grounded. I should’ve listened. The falls didn’t hurt as bad that way.  Instead, I wanted a bigger life in a bigger place and I never appreciated the beauty of living in a small town with a huge support system. So, I left town without so much as a goodbye chasing a silly dream. I alienated myself, moved to a strange city where I knew no one, and chased after something that took me down a dark path.  I married the man who promised me the sun, moon, and stars, but delivered blinding blows. Sometimes, I thought I’d die before I escaped the nightmare. I knew my only way out would be to run...again. This took more years than I could count. Years of me squirreling away money, and years of me hiding in the dark so that no one would see my bruised face in the light of day.  Then my grandfather died. He left me money and a gorgeous condo in New York. While my husband was away on a month-long trip, my best friend drove me to New York. My plan: to upgrade the condo, sell it, and leave my current life behind.  Little did I know when I had called contractors to get some quotes that Ben would show up on my doorstep. He swore we could make more dreams real, but this time I was the grounded one. This time, I could only see how it would never work. I’d made too many mistakes. Love was terrifying. And I never wanted to tie myself to anyone ever again. After all, 425 Madison is the perfect place to fall in love!",
  "genres": [],
  "author": "S.L. Sterling",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/53965458-sunsets-somedays"
}