{
  "title": "Callsign: Queen (Zelda Baker)",
  "description": "At the beginning of her search for Rook, a missing Chess Team member, Zelda Baker, Callsign: Queen, is redirected to Pripyat, Ukraine, a ghost town on the radioactive outskirts of Chernobyl. Intel indicates that splinter cell of Manifold Genetics—a ruthless corporation dismantled by Chess Team—may be operating in the area. Tasked with confirming the existence of a Manifold facility, Queen begins a recon sweep of the abandoned town in search of clues, but soon finds herself fighting for her life. Something sinister lurks beneath the decaying, surreal remnants of Pripyat’s never-used amusement park, and it rises up to greet Queen.In Pripyat, the streets are empty, the derelict buildings crumble, but the bodies…are fresh.THE CALLSIGN BOOKS: Callsign: Queen (30,000 words) is the second in a series of Chess Team novellas being released in 2011. Each of the six books follows a single member of the team and are titled for them; Callsign: Queen, Callsign: Knight, etc, and are co-authored by Jeremy Robinson and six other fantastic authors. The stories take place after the events of THRESHOLD, the third Jack Sigler thriller, but are designed to introduce readers to the series. If you haven't read the novels, no worries. Enjoy the ride!PRAISE FOR ROBINSON\"Rocket-boosted action, brilliant speculation, and the recreation of a horror out of the mythologic past, all seamlessly blend into a rollercoaster ride of suspense and adventure.\" -- James Rollins, New York Times bestselling author of JAKE RANSOM AND THE SKULL KING'S SHADOW\"With THRESHOLD Jeremy Robinson goes pedal to the metal into very dark territory. Fast-paced, action-packed and wonderfully creepy! Highly recommended!\" --Jonathan Maberry, NY Times bestselling author of ROT & RUIN\"Jeremy Robinson is the next James Rollins\" -- Chris Kuzneski, NY Times bestselling author of THE SECRET CROWN\"If you like thrillers original, unpredictable and chock-full of action, you are going to love Jeremy Robinson...\"-- Stephen Coonts, NY Times bestselling author of DEEP BLACK: ARCTIC GOLD\"How do you find an original story idea in the crowded action-thriller genre? Two words: Jeremy Robinson.\" -- Scott Sigler, NY Times Bestselling author of ANCESTOR\"There's nothing timid about Robinson as he drops his readers off the cliff without a parachute and somehow manages to catch us an inch or two from doom.\" -- Jeff Long, New York Times bestselling author of THE DESCENT\"Jeremy Robinson's THRESHOLD is one hell of a thriller, wildly imaginative and diabolical, which combines ancient legends and modern science into a non-stop action ride that will keep you turning the pages until the wee hours. Relentlessly gripping from start to finish, don't turn your back on this book!\" -- Douglas Preston, NY Times bestselling author of IMPACT and BLASPHEMYPRAISE FOR WOOD\"David Wood has done it again. Quest takes you on an expedition that leads down a trail of adventure and thrills. David Wood has honed his craft and Quest is proof of his efforts!\" David L. Golemon, Author of LEGACY, THE SUPERNATURALS, AND EVENT\"Ancient cave paintings? Cities of gold? Secret scrolls? Sign me up! Cibola is a twisty tale of adventure and intrigue that never lets up and never lets go!\" --Robert Masello, author of BESTIARY and BLOOD AND ICE\"Let there be no confusion: David Wood is the next Clive Cussler. From the accessible writing to the wide-ranging plot to the main characters who don't give up no matter how long the odds, Wood's latest book, Quest, is a tremendous classic adventure. Once you start reading, you won't be able to stop until the last mystery plays out in the final line.\" Edward G. Talbot, author of 2010: THE FIFTH WORLD\"Dane and Bones are back! Packed solid with action and witty dialogue, this rousing adventure takes a fresh look at one of the most enduring mysteries of the 20th century, David Wood delivers again with QUEST.\"--Sean Ellis, author of INTO THE BLACK and DARK TRINITY: ASCENDANT",
  "genres": [
    "Thriller",
    "Fiction",
    "Adventure",
    "Action",
    "Science Fiction",
    "Military Fiction",
    "Novella"
  ],
  "author": "Jeremy Robinson",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/12630753-callsign"
}