{
  "title": "Any Luck at All",
  "description": "The first book in a new rom com series by Denise Grover Swank, the author of the New York Times bestselling Wedding Pact series, and A.R. Casella.Georgie Buchanan doesn’t know the first thing about running a brewery—she doesn’t even like beer—so she’s thrown when her grandfather leaves his business to her and her three siblings. Selling Buchanan Brewery would be the prudent approach, and while Georgie is, first and foremost, a businesswoman, keeping it might be her best chance of connecting with her half-brother, Jack. But she quickly learns that what she thought was a fixer-upper is a money pit, the employees are all eccentric to the extreme, and her inheritance comes with a shocking catch. Her one hope for success lies with River Reeves, the handsome brewmaster who learned at her grandfather’s feet...if she can avoid falling for him. After learning his best friend and boss is selling the brewery they built together to a soulless corporation, River quits on the spot, only for Georgie Buchanan to offer him a job the very same night. Helping her turn Buchanan Brewery around is his dream job, the perfect homage to the man who taught him everything and helped give him roots. There’s one problem: his new boss is his dream woman, and she’s not the type to mix business and pleasure. Balancing a new job, a new puppy, and a growing infatuation with his boss, River knows something has to give.  If Georgie has any luck at all, she’ll be able to turn Buchanan Brewery around without losing her mind or her heart. But as River helps her weather everything from her uncle’s possessed cat to a séance, she realizes she might be wishing for the wrong kind of luck.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Humor",
    "Chick Lit",
    "Audiobook",
    "Fiction"
  ],
  "author": "Angela R. Casella",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/53985077-any-luck-at-all"
}