{
  "title": "War under Heaven: Pontiac, the Indian Nations, and the British Empire",
  "description": "The 1763 Treaty of Paris ceded much of the continent east of the Mississippi to Great Britain, a claim which the Indian nations of the Great Lakes, who suddenly found themselves under British rule, considered outrageous. Unlike the French, with whom Great Lakes Indians had formed an alliance of convenience, the British entered the upper Great Lakes in a spirit of conquest. British officers on the frontier keenly felt the need to assert their assumed superiority over both Native Americans and European settlers. At the same time, Indian leaders expected appropriate tokens of British regard, gifts the British refused to give. It is this issue of respect that, according to Gregory Dowd, lies at the root of the war the Ottawa chief Pontiac and his alliance of Great Lakes Indians waged on the British Empire between 1763 and 1767.In War under Heaven, Dowd boldly reinterprets the causes and consequences of Pontiac's War. Where previous Anglocentric histories have ascribed this dramatic uprising to disputes over trade and land, this groundbreaking work traces the conflict back to status: both the low regard in which the British held the Indians and the concern among Native American leaders about their people's standing—and their sovereignty—in the eyes of the British. Pontiac's War also embodied a clash of world views, and Dowd examines the central role that Indian cultural practices and beliefs played in the conflict, explores the political and military culture of the British Empire which informed the attitudes its servants had toward Indians, provides deft and insightful portraits of Pontiac and his British adversaries, and offers a detailed analysis of the military and diplomatic strategies of both sides. Imaginatively conceived and compellingly told, War under Heaven redefines our understanding of Anglo-Indian relations in the colonial period.",
  "genres": [
    "History",
    "American History",
    "Native American History",
    "War",
    "The Americas",
    "Nonfiction",
    "American Revolution"
  ],
  "author": "Gregory Evans Dowd",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/540085.War_under_Heaven"
}