{
  "title": "Find Me",
  "description": "The disappearance of a young woman leaves her closest friend reeling and an NYPD homicide detective digging into her own past in this thrilling mystery full of twists from the New York Times bestselling author of The Better Sister and The Wife.Some pasts won’t stay forgotten . . . She calls herself Hope Miller, but she has no idea who she actually is. Fourteen years ago, she was found in a small New Jersey town thrown from an overturned vehicle, with no clue to her identity. Doctors assumed her amnesia was a temporary side effect of her injuries, but she never regained her memory. Hope eventually started a new life with a new name in a new town that welcomed her, yet always wondered what she may have left behind—or been running from. Now, fourteen years later, she’s leaving New Jersey to start over once again.Manhattan defense lawyer Lindsay Kelly, Hope’s best friend and the one who found her after the accident, understands why Hope wants a new beginning. But she worries how her friend will fare in her new East Hampton home, far away from everything familiar. Lindsay’s worst fears are confirmed when she discovers Hope has vanished without a trace—the only lead a drop of blood found where she was last seen. Even more ominously, the blood matches a DNA sample with a connection to a notorious Kansas murderer.With nowhere else to turn, Lindsay calls NYPD homicide detective Ellie Hatcher, the daughter of the cop who dedicated his life to hunting the Kansas killer.  Ellie has always believed there was more to the story of her father’s death twenty years earlier—and she now fears that Hope’s recent disappearance could be related.In pursuit of answers, three women search for the truth beneath long-buried secrets. And when their searches converge, what they find will upend everything they’ve ever known.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Suspense",
    "Crime"
  ],
  "author": "Alafair Burke",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/54027619-find-me"
}