{
  "title": "Everyday Osho",
  "description": "For more than thirty years, the insights of Osho have delighted and challenged spiritual seekers. Everyday Osho represents the essence of these insights an understanding that synthesizes a wide range of spiritual and philosophical traditions ~with the contributions of modern science and psychology. This inspirational volume offers readers daily choices br living fully in the here and now, challenging them to embrace a new way of being that integrates body, mind, and spirit.The Osho teachings defy categorization, covering everything from the individual quest for meaning to the most urgent social and political issues facing society today. His hooks are not written but are transcribed from audio and video recordings of extemporaneous talks given in response to questions from visitors over a period of thirty-five years. Osho has been described by the Sunday Times in London as one of the \"1,000 Makers of the 20th Century\" and by the Sunday Mid-Day in India as one of the ten people--along with Gandhi, Nehru, and Buddha who have changed India's India. About his own work Osho has said that he is helping to create the conditions for the birth of a new kind of human being. He has often characterized this new human being as \"Zorba the Buddha\" capable of enjoying both the earthy pleasures of a Zorba the Greek and the silent serenity of a Gautama the Buddha. Running like a thread through all aspects of the work is a vision that encompasses both the timeless wisdom of the Last and the highest potential of Western science and technology. Osho is also known for his revolutionary contribution to the science of inner transformation, with an approach to meditation that acknowledges the accelerated pace of contemporary life. His unique \"active meditations\" are designed to first release the accumulated stresses of body and mind, making it is easier to experience the thought-free and relaxed state of~ meditation.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Philosophy",
    "Psychology",
    "Religion",
    "Eastern Philosophy"
  ],
  "author": "Osho",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/54017811-everyday-osho"
}