{
  "title": "Scales & Scoundrels Definitive Edition Book 1: Where Dragons Wander",
  "description": "TKO Studios presents \"Scales & Where Dragons Wander\" (Book 1 of 2) by Sebastian GirnerThis gorgeous, multicultural fantasy adventure follows treasure hunter, Luvander, as she searches for gold and glory. As she dives into an epic journey along with a young prince, his stern bodyguard, and a plucky young dwarf, our heroes will discover a secret that will bring light to a world encroached upon by an ancient darkness.This is the story of a girl who liked to wander...It's hard to make an honest living in a land brimming with magic and mystery, and treasure hunter Luvander is tired of being a penniless adventurer. Ever in search of gold and glory, she sets off for a fabled dungeon \"the Dragon's Maw\", an ancient labyrinth, at the bottom of which slumber endless wealth...or certain doom!A loner by trade, Luvander is forced to team up with a team of scraggly adventurers, each hoping to find a treasure of their own in the forbidden tomb. There is Prince Aki, of the Scarlet Sands Empire, anxious for first taste of adventure yet blind to the consequences. His royal Shadow and bodyguard, Koro, whose very honor hangs in the balance of her prince's success. And Dorma Iron, a stocky young dwarf whose journey will take her deeper into the darkness than she ever wished to tread.For these scruffy heroes, what starts out as a road to riches becomes the first step on an epic journey to destiny, for Luvander holds a secret in her heart that will shatter the chains of fate, and bring light to a world encroached upon by an ancient darkness.Scales & Where Dragons Wander includes all previously collected issues in this Definitive Edition, plus 250+ pages of new material .The Festival of Life - Book 2 continues the adventure as Luvander sets off to find a way to break the chains of her cursed fate. Undeterred by danger, she travels to the frozen northern wastes of the Spine of Winter, to a reclusive monastery whose monks guard a secret entrance to the Dragon Dream, the shared plane of consciousness of all Urden, living or long passed. What she finds there will set her on a journey beyond where any mortals, and few dragons have tread, to uncover an ancient secret from the darkest corners of history. Continuing the epic journey of the cursed dragon princess and her fellow scoundrels in a world bent on undoing itself.",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Comics",
    "Dragons",
    "Young Adult",
    "Fiction",
    "Adventure"
  ],
  "author": "Sebastian Girner",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/54025859-scales-scoundrels-definitive-edition-book-1"
}