{
  "title": "Project Career Quest: Navigating the Journey to New Opportunities Waiting",
  "description": "ARE YOU ON A QUEST FOR A MORE FULFILLING CAREER? Lost your job due to yet another layoff, merger, or acquisition; looking for your first professional job and totally lost in the process; or about to lose your mind and know it’s time to look for a new job? NOW what? Finding meaningful employment and career satisfaction can be a frustrating and long drawn out process without a roadmap and someone to help you navigate the journey.Project Career Quest offers a structured, practical approach to finding employment that is more purposeful, challenging, and engaging. Through proven best practices and lessons learned, the author helps the reader clarify their career goals, identify roadblocks, and map out a strategy to open doors to New Opportunities Waiting – NOW! Kerry combines her expertise as a certified project management professional (PMP®) and career coach to guide the reader through the job search process; providing the knowledge, resources, tools, and strategies needed for a successful journey. Project Career Quest includes all elements of the job search process The emotional aspects and challenges to finding meaningful employment.- Getting to “know yourself” so you can make effective career decisions and “sell” yourself to a prospective employer.- Getting on the “radar screen” and communicating your accomplishments and value to others.- How to market yourself to influencers, recruiters, and hiring managers.- Exploring various options and opportunities including discovering your passion and purpose.- How to develop an effective, focused, and accomplishment-based resume.- Interviewing skills and strategies, interviewing questions and how to approach them, and how to negotiate to close the deal.- Approaching the first 90-days in your new position and on-going professional development needed to remain marketable in an ever-changing work environment.This book is relevant to both entry-level and seasoned professionals. And the 50+ career tools and templates that come with this guidebook. . . PRICELESS!",
  "genres": [],
  "author": "Kerry Ahrend",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54031753-project-career-quest"
}