{
  "title": "The Last Stand of the Tin Can Sailors: The Extraordinary World War II Story of the U.S. Navy's Finest Hour",
  "description": "“This will be a fight against overwhelming odds from which survival cannot be expected. We will do what damage we can.”With these words, Lieutenant Commander Robert W. Copeland addressed the crew of the destroyer escort USS Samuel B. Roberts on the morning of October 25, 1944, off the Philippine Island of Samar. On the horizon loomed the mightiest ships of the Japanese navy, a massive fleet that represented the last hope of a staggering empire. All that stood between it and Douglas MacArthur’ s vulnerable invasion force were the Roberts and the other small ships of a tiny American flotilla poised to charge into history.In the tradition of the #1 New York Times bestseller Flags of Our Fathers, James D. Hornfischer paints an unprecedented portrait of the Battle of Samar, a naval engagement unlike any other in U.S. history—and captures with unforgettable intensity the men, the strategies, and the sacrifices that turned certain defeat into a legendary victory.Praise for The Last Stand of the Tin Can Sailors“One of the finest WWII naval action narratives in recent years, this book follows in the footsteps of  Flags of Our Fathers . . . . Exalting American sailors and pilots as they richly deserve. . . . Reads like a very good action novel.” — Publishers Weekly“Reads as fresh as tomorrow's headlines. . . . Hornfischer's captivating narrative uses previously classified documents to reconstruct the epic battle and eyewitness accounts to bring the officers and sailors to life.” — Texas Monthly“Hornfischer is a powerful stylist whose explanations are clear as well as memorable. . . . A dire survival-at-sea saga.” — Denver Post“In  The Last Stand of the Tin Can Sailors,  James Hornfischer drops you right into the middle of this raging battle, with 5-inch guns blazing, torpedoes detonating and Navy fliers dive-bombing. . . . The overall story of the battle is one of American guts, glory and heroic sacrifice.” — Omaha World Herald",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "World War II",
    "Military History",
    "War",
    "Naval History"
  ],
  "author": "James D. Hornfischer",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/5400.The_Last_Stand_of_the_Tin_Can_Sailors"
}