{
  "title": "Beyond Death: The Elfin Book of the Dead, Ascending towards the Faerie Realms through Progressive Incarnations",
  "description": "BEYOND DEATH: The Elfin Book of the Dead is a guide for those who are dealing with the recently deceased or dying, as well as for anyone who would like to begin consciously preparing for their own demise. There are two parts to Beyond Death — the first part explores the theoretical aspects concerning death and the Between worlds from an elven perspective, and the second part of this book has practical admonitions and spells based on the Elven Star (7 pointed acute hexagram) that can help a person who is in the process of transitioning from one incarnation to another. Part One of BEYOND DEATH explores death and the Between states as it relates to a variety of topics including: elven magic, immortality of elves, raising the dead, lucid dreaming, the experience of the between state, the Death card in the Tarot, the stages of grief and dealing with death, death and amnesia, the fae descent into matter, Faerie and the Nether-realms, elven perspectives on how various myths and religions view death, the wild hunt, banshees and black dogs, Day of the Dead, Sitting Shiva and Shiva, astral travel and the relationship of death to teraphim, nature spirits and animism. It is nearly impossible to know exactly what you will encounter in the Between since our experience there depends greatly upon our own inner being and consciousness, especially our subconscious being, our right brained symbolic consciousness that manifests in dream states and during the Between. However, the general principles and developmental stages are rather universal so we have fashioned from an elven perspective spells and admonitions of guidance so that we might aid anyone who is transiting the realms of manifestation. These spells (see Part Two of the book) are linked to the Elven Star and its seven points and seven intersections or interstices (so 14 in all) and the energies they represent. They are designed to be spoken over 14 days (one spell each day) as you contemplate or more importantly feel (if you knew and have feelings for the individual you wish to guide) the person on whose behalf you are casting the spell. You might wish to set up a temporary magic table, what most people call an altar, with photos or items reminiscent of the individual(s) for this purpose. These spells and admonitions relate to energies of the 14 realms of manifestation: The Red Diamond World, Blue Wave World, Realm of the Wondrous Yellow Orb, Realm of the Rainbow Bridge, Emerald Green World, Orange Glowing World, Royal Purple Mist Realm, Lavender Lotus World, Deep Green Forest World, Golden Light of the Shining Realms, Silver Realms of Moonlight Being, Realm of the Amber Orbs of Translucent Wonder, Opalescent Realm of Radiant Being, and Pure Clear Realm of Radiant Light. We purposely put the 14 day spells and admonitions (ritual) for the recently deceased loved one as the Part Two in this book so it may be easy to find when you need it for guiding your loved one through the Between.",
  "genres": [
    "Spirituality",
    "Wicca",
    "Occult"
  ],
  "author": "The Silver Elves",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54101980-beyond-death"
}