{
  "title": "THE GOOD GIRLS: AN ORDINARY KILLING",
  "description": "A shattering, utterly immersive work of investigative journalism, The Good Girls slips behind political maneuvering, caste systems and codes of honour in a village in northern India to tell the real story behind the tragic deaths of two teenage girls and an epidemic of violence against women.In the early dawn one day in 2014, a man discovered the dead bodies of 14-year-old Lalli Shakya and 16-year-old Padma Shakya hanging from a mango tree on the edge of their village in Uttar Pradesh. When the inseparable cousins hadn't returned from a walk to the fields to relieve themselves the evening before, their families had begun searching for them. Upon hearing of the discovery and reaching the bodies, the grief-stricken women of the family formed a protective shield around the tree. They knew that if their girls were taken down immediately, they would be forgotten, lost in a brutally inefficient and prejudiced system; but if media arrived, and photos of the bodies went viral, those in power could not ignore the deaths and justice would be served.Dramatic images of the Shakya girls spread across India and the world, inciting horror and despair. Padma and Lalli died two years after the Delhi bus rape, and many saw the cousins as victims of an ongoing epidemic of violence, one that was emerging in rural villages. The reality that Sonia Faleiro deftly illuminates, wrapped in pressures of caste, gender, technology and teenage desire, proves to be more complicated, and just as devastating.Intimate, mesmerizing, based on years of meticulous reportage, The Good Girls uncovers the heartbreaking truth of what happened that night through the voices of the girls' families, those who saw them last and the legal and medical officials who touched the case.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "India",
    "Crime",
    "Audiobook",
    "Mystery",
    "Asia"
  ],
  "author": "Sonia Faleiro",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/54057320-the-good-girls"
}