{
  "title": "Lantern's Passage",
  "description": "Drew MacLaren remembers the summers of 1958 and 1959 in the Outer Banks more clearly than any in his life—the months when super heroes streaked across the pages of comic books, and the hurricane winds of Big Leo ripped cottages from their pilings, when Clarisse Silver went violently insane, and his best friend, Maggie, was accused of murdering her mother.On a gray, windy afternoon Drew secretly watches Maggie Silver crying. He listens, terrified, as a voice shrieks inside her cottage and dishes of oatmeal shatter against the wall. He knows nothing about his neighbor, only, like all children instinctively do, that the she is poor and older than he is. He knows that her brother, Skeeter, has had polio and rolls around their porches on a low board with caster wheels. But from the moment he sees her smile rise up through her tears, he becomes determined to learn more of who she is. Drew and Maggie become friends, share secrets together, and he can only watch as she sinks deeper from the burden of caring for her mentally-ill mother and physically dependent brother.When Maggie’s mother is found suffocated after the most violent storm in a decade, all of Nags Head believes the besieged daughter has committed the murder. She has disappeared into the wreckage, but Drew knows she is innocent. He and Skeeter have the answers in front of them. Convincing adults, however, is not always as easy as it should be. Seen through the eyes of a bright and insatiably curious eleven-year-old, Lantern’s Passage is a weaving of genuine characters, children and adults we have all known. It is a story of mystery and suspense, of prejudice and hatred, of love and death, but primarily it tells us of the sweet and cruel lessons every child passing into adulthood comes to understand. And it is certain to echo a chord within ever reader’s heart.",
  "genres": [],
  "author": "Andrew L. MacNair",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/5407467-lantern-s-passage"
}