{
  "title": "Fortune's Bastard",
  "description": "Edward Miller is a reactionary, alpha male, tabloid newspaper editor. He wears his temper like a badge of honor, would rather step over a homeless beggar than walk around him, and engages in petty warfare with his staff over expense receipts. He's also never been much bothered with monogamy, but when one morning he spontaneously seduces his temp in an office storeroom, he's definitely crossed a line in blatancy. Miller has made few friends and many enemies—not to mention the fact that the storeroom is a notorious trysting place and he and the temp both emerge covered in dust and airmail stickers—so the news doesn’t take long to reach his cold, beautiful wife. Conveniently, it just happens to be their anniversary. Imagine the celebratory dinner, capped by her returning her house keys and consummating her desire to sleep with the neighbor.Not a man to suffer rejection well, Miller heads for a London media hangout, where two employees introduce him to cocaine. By morning, his exploits are public (a photographer captured him snorting the cocaine in public), his career is over (thanks to a damning interview he gave a journalist from a rival paper), he's not only painted the word 'WANKER' on the cuckolding neighbor's car, but misspelled it, and his house is on fire (never leave a goodbye bonfire of wedding photos unattended). . . . Clearly, it’s time to leave town. Miller has an engagement to speak to the boys at his old prep school, but he can't seem to stop pouring gasoline on the fire that his life has become, showing up hungover after a night partying with an old school friend and a gaggle of Spanish flight attendants, and calling the headmaster by his behind-the-back nickname of \"Stiffo\" to the students, for a start. After the speech, he speaks with his doctor and learns that his father-in-law plans to kill him.Leigh, the old school friend, works for an English language school in Barcelona, and Miller wrangles its address out of him, for he clearly can't go home. He gets the job and adapts surprisingly well to a life of an underpaid teacher, despite the fact that some of his students will clearly never learn the language (there are hilarious scenes of their attempts in this section) and even starts up a romance with a tough-talking English girl who's one of his fellow teachers—but he doesn't tell her who he really is when he has the opportunity, and when she figures it out on her own she is livid and that bridge is burnt. To make matters worse, his father-in-law's goons have tracked him down.Miller flees again, winding up in Florida, in a town populated by ex-circus freaks and presided over by the Half Man, a criminal and sadist with no legs who welcomes Miller to town by shoving a gun barrel in his mouth and breaking his teeth. But ironically, it seems that despite the fleas in his trailer, the one-eyed albino hit man who seems to overhear every compromising conversation between Miller and the Half Man’s beautiful wife the Lizard Woman, and the fact that the Half Man’s stranglehold on the local police mean that Miller isn’t actually free to leave, it seems that Miller somehow belongs among the freaks. These misfits—among them a black dwarf, a gay clown with a penchant for altar boys, a heroin addict who is their unlicensed doctor, a biker hit man named Hollis after Grove’s erstwhile publicist, and the Lizard Woman’s wonderful eight-year-old daughter—unwittingly teach Miller what normal life never could—how to love, and how to stand up for something he truly believes in. When Miller's wife tracks him down and has him sign over the spoils of his old life to her, he gets enough money out of her to hire the albino to hit the Half Man. And though all certainly does not go smoothly with the hit—someone as vicious as the Half Man is unlikely to go quietly—Miller and the Lizard Woman are able to close that chapter and start a new life together.",
  "genres": [
    "Fiction"
  ],
  "author": "Robert Chalmers",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/540787.Fortune_s_Bastard"
}