{
  "title": "A Theater for Dreamers",
  "description": "THE UK BESTSELLER \"Sublime and immersive . . . If you wish you could disappear to a Greek island right now, I highly recommend.\" —Jojo Moyes, #1 bestselling author of Me Before You\"This gorgeous, glimmering summer read is itself perfect summer: irresistible and deep, Samson's lyric sentences pulling you into unforgettable sunlight and shadow.\" —Amy Bloom, New York Times bestselling author of White Houses It’s 1960, and the world teeters on the edge of cultural, political, sexual, and artistic revolution. On the Greek island of Hydra, a proto-commune of poets, painters, and musicians revel in dreams at the feet of their unofficial leaders, the writers Charmian Clift and George Johnston, troubled queen and king of bohemia. At the center of this circle of misfit artists are the captivating and inscrutable Axel Jensen, his magnetic wife Marianne Ihlen, and a young Canadian ingenue poet named Leonard Cohen.   When eighteen-year-old Erica stumbles into their world, she’s fresh off the boat from London with nothing but a bundle of blank notebooks and a burning desire to leave home in the wake of her mother’s death. Among these artists, she will find an unraveling utopia where everything is tested—the nature of art, relationships, and her own innocence.   Intoxicating and immersive, A Theater for Dreamers is a spellbinding tour-de-force about the beauty between naïveté and cruelty, chaos and utopia, artist and muse—and about the wars waged between men and women on the battlegrounds of genius. Roiling with the heat of a Grecian summer, A Theater for Dreamers is, according to the Guardian, “a blissful piece of escapism” and “a surefire summer hit.”",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Greece",
    "Historical",
    "Travel",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Polly Samson",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/54110440-a-theater-for-dreamers"
}