{
  "title": "Beeswing: Losing My Way and Finding My Voice 1967-1975",
  "description": "“Thompson is a master showman . . .  [ Beeswing is] everything you’d hope a Richard Thompson autobiography would be . . . It’s both major and minor, dirge and ditty, light on its feet but packing a punch.”— The Wall Street JournalAn intimate look at the early years of one of the world’s most significant and influential guitarists and songwriters.In this moving and immersive memoir, Richard Thompson, international and longtime beloved music legend, recreates the spirit of the 1960s, where he found, and then lost, and then found his way again.Known for his brilliant songwriting, his extraordinary guitar playing, and his haunting voice, Thompson is considered one of the top twenty guitarists of all time, in the songwriting pantheon alongside Bob Dylan, Paul Simon, and Randy Newman. Now, in his long-awaited memoir, the British folk musician takes us back to the late 1960s, a period of great change and creativity—both for him and for the world at large.Thompson packed more than a lifetime of experiences into his late teens and twenties. During the pivotal years of 1967 to 1975, just as he was discovering his passion for music, he formed the band Fairport Convention with some schoolmates and helped establish the genre of British folk rock. That led to a heady period of songwriting and massive tours, where Thompson was on the road both in the UK and the US, and where he crossed paths with the likes of Led Zeppelin, Pink Floyd, and Jimi Hendrix. But those eight years were also marked by change, upheaval, and tragedy. Then, at the height of the band’s popularity, Thompson left to form a duo act with his wife Linda. And as he writes revealingly here, his discovery and ultimate embrace of Sufism dramatically reshaped his approach to music—and of course everything else.An honest, moving, and compelling memoir,  Beeswing vividly captures the life of a remarkable artist during a period of creative intensity in a world on the cusp of change.",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Autobiography",
    "Audiobook",
    "History"
  ],
  "author": "Richard      Thompson",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/54110594-beeswing"
}