{
  "title": "Summer Shorts",
  "description": "A Sizzling Summer Set of Sixteen Short Stories from the New York Times and USA Today award-winning authors of The Authors’ Billboard.From sweet to spicy, and contemporary to suspenseful, these sixteen Summer Short Stories will be sure to heat up your heart and help you escape reality in a blaze of fun, drama, and romance.Sixteen NY Times & USA Today popular authors have put together these delightful novellas to give you that spurt of entertainment you can often finish in one sitting. These Summertime stories will delight the romance lover until the sun sets in a blaze of glory.NEW! Mimi Barbour – Her Hero – Her puppy will drown if the stranger can’t save her! USA Today and NY Times Best Selling AuthorNEW! Melinda De Ross – Summer Neighbors– A summer vacation, an inherited house, a sexy neighbor. Should be the formula for the perfect summer…Right? USA Today Bestselling AuthorJennifer St. Giles writing as J. L. Saint – What Didn’t Happen in Vegas – What didn’t happen in Vegas could cost Eric and Holly everything. USA Today Bestselling AuthorNEW! Cynthia Cooke – All I Want Is You – He will not lose – the deal or his heart.NEW! Angela Stevens – Catching Robert – When the adorable Maggie orders a chocolate sundae from Robert Chase, the ice cream is not the only thing to melt. Amazon International Bestselling Author.NEW! Susanne Matthews – Tequila Sunrise – The peppers in Mexico aren’t the only things too hot to handle. Award winning authorNEW! Josie Riviera – A Chocolate-Box Summer Breeze – Will Emily and Joe be able to find their happily-ever-after in a forgotten summer breeze? USA Today Bestselling AuthorNEW! Katy Walters – The Billionaire and the Librarian – Would this unreasonable match be spectacular or a dud? USA Today Bestselling AuthorNancy Radke – The Stubbornest Girl in the Valley – Stubborn ladies hang onto the men they love. USA Today Bestselling AuthorNEW! Susan Jean Ricci – Row with Me – Learning a new sport isn’t easy when the couple involved have questionable skills in kayaking and relationships. USA Today Bestselling AuthorNEW! Dani Haviland – Kidnapped! He’d get her back…at any cost. USA Today Bestselling AuthorRebecca York – Hot and Dangerous – Summer Idyll turns to terror. USA Today Bestselling AuthorNEW! Rachelle Ayala – Bad Boys for Hire: Roni – Roni ordered hits for the cartel, but can she kill the disabled firefighter whose ex hires her? USA Today Bestselling AuthorAileen Fish – Marni – Can a cowboy and a librarian turn a week’s vacation into the love of a lifetime? USA Today Bestselling AuthorNEW! Stacy Eaton – Finding Love on the Summer Surf – Will a magical weekend of memories drift away with the ocean waves? USA Today Bestselling AuthorNEW! Taylor Lee – Heatstroke – Would the Native American doctor allow any man to make her believe she deserved love? Especially him? USA Today Bestselling Author",
  "genres": [],
  "author": "Mimi Barbour",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/54139998-summer-shorts"
}