{
  "title": "Added Sugars-The Slow Poison",
  "description": "•\tWorried about your increasing Waistline & Belly fat?•\tAre you suffering from Metabolic disorders like Obesity, Type-2 diabetes?•\tDo you want to look TEN YEARS YOUNGER than your actual age?•\tDo you have cravings & addiction for Sugary sodas, Fizzy drinks, Energy drinks, Diet cokes& Chocolates?NO PROBLEM! You have a simple solution. Just gain all the knowledge about the vicious cycle of Added sugars, High insulin secretion FAT STORAGE, and Transform your life forever! **ADDED SUGARS -THE SLOW POISON **, is a simple yet insightful guide to gain all the information about the various aspects of ADDED SUGARS AND THEIR DETRIMENTAL EFFECTS TO THE SOCIETY.Hurry! Replace all the unhealthy refined sugars with these **14 NATURAL SWEETENERS ** and you will experience a remarkable & wonderful change in your energy, weight & fitness. Your skin will also reflect &glow with true, inner beauty!By reading this E-BOOK, * Added Sugars -The Slow Poison *,YOU WILL GET TO KNOW :•\tThe Huge role of added sugars in the alarming & Rapid rise of Obesity, Insulin Resistance, Fatty liver, Type 2 Diabetes, especially in children. •\tA Simple Understanding of Metabolism of 2 basic sugars: Glucose, Fructose in the human body.•\tHow to protect your family from the Neurotoxic & Highly addictive effects of Artificial sweeteners used in Sugar-free drinks, Diabetic drinks &Diet sodas.•\tA latest & Extensive list of **60 names of Added sugars (Biochemical & Commercial names)**, which are Cleverly manipulated &Silently added into all the processed foods in our supermarkets.•\t**14 Most Healthy Natural sweeteners **which are 100 % safe & enhance your health with their incredible nutritional benefits. Come, gain all the knowledge, get rid of added sugars in your food products, save your children, and future Generations from all the hidden & deadly effects of added sugars.Don’t hesitate! Buy your copy now. It is available in all your Major Retail Ebook stores.",
  "genres": [],
  "author": "Srividya Bhaskara",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54115530-added-sugars-the-slow-poison"
}