{
  "title": "Why We Cook : Women on Food, Identity, and Connection",
  "description": "An inspirational and powerful book that celebrates women's stories, passions, history, and trailblazing achievements in the culinary world, with personal essays, recipes, Q&As, illustrated quotes, and more from over 100 women in the world of food - restaurateurs, sommeliers, food producers, activists, writers, and home cooks.Inspiring, empowering, beautiful, and moving, Why We Cook explores the place where food meets feminism. In it, artist Lindsay Gardner brings together stories, essays, kitchen profiles, interviews, and more, featuring 112 women restaurateurs, food producers, activists, writers, professional chefs, and home cooks—all of whom are dedicated not only to their craft but to changing the world of food.There are profiles on changemakers, like Cristina Martinez, a chef who emigrated from Mexico and who brings her Philadelphia community together through food while using her platform to champion immigrants’ rights; and Leah Penniman, who describes a day in her life on Soul Fire Farm, which she co-founded to combat racism in the food system. Evocative reflections on food and memory, like Rachel Khong's ode to her mother's love of fruit. And narrative recipes, like restaurateur Nicole Ponseca's Bibingka.With her rich visual storytelling gifts—the book is filled with beautiful watercolour illustrations and portraits—Gardner not only captures a sense of what is unique about each of the women, bringing them to life but adds layers of nuance and insight to their words and their work. Together, their voices reveal the power of food to uplift and nourish, reveal complex questions, and effect change, and offer us all the opportunity to learn about each other and about ourselves.",
  "genres": [
    "Food",
    "Cookbooks",
    "Nonfiction",
    "Cooking",
    "Essays",
    "Memoir",
    "Food Writing"
  ],
  "author": "Lindsay Gardner",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/54110587-why-we-cook"
}