{
  "title": "Misfits Like Us",
  "description": "As the eldest daughter of famous parents, Luna Hale is anything but normal. She escapes most days inside the fandoms she loves and the fics she writes, and she’s accepted that real life just sucks more than fiction. But there is someone who could rival every swoony man inside her imagination.And he only lives three floors below her. Too bad he’s incredibly off-limits. Her brother’s bodyguard, eight years older (okay, sometimes, nine), and the son of meth addicts—the tattooed, shameless bodyguard is the only one her dad really hates. But Luna isn’t sure exactly why.She’s trying not to be hung up on him.Paul Donnelly is trying not to be hung up on her.With his life among the security team and his friends at stake, he doesn’t need to make waves among the Hales, especially the notoriously overprotective Loren Hale, the self-proclaimed Emperor of Petty. But when Donnelly’s two best friends set a time and place for a double—no, a “triple” date—the countdown to finding a date is on.Donnelly has no idea who he should bring. He just knows it can’t be her.Luna finds herself in the same predicament as bad luck unfolds. Find a date.And it can’t be him.Yet, the more they try to stay away, the more the universe has other plans. Nowhere in Luna’s wildest imagination could she have predicted what happens next.The slow burn heartache, feel-good fandom chats, lifelong friendships, and epic cosmic love of this next installment in the Like Us series will send your hearts into orbit with Luna & Donnelly, and you won’t want to make a landing without them.​​The Like Us series is a true series, one continuous timeline, that follows a family of wealthy celebrities and the people that protect them.The Like Us Series Reading Order:1. Damaged Like Us (Maximoff & Farrow)2. Lovers Like Us (Maximoff & Farrow)3. Alphas Like Us (Maximoff & Farrow)4. Tangled Like Us (Jane & Thatcher)5. Sinful Like Us (Jane & Thatcher)6. Headstrong Like Us (Maximoff & Farrow)7. Charming Like Us (Oscar & Jack)8. Wild Like Us (Akara & Sulli & Banks)9. Fearless Like Us (Akara & Sulli & Banks)10. Infamous Like Us (Akara & Sulli & Banks)11. Misfits Like Us (Luna & Donnelly)12. Unlucky Like Us (Luna & Donnelly)",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Contemporary",
    "New Adult",
    "Contemporary Romance",
    "Slow Burn",
    "Fiction"
  ],
  "author": "Krista Ritchie",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/54169029-misfits-like-us"
}