{
  "title": "Wheezer and the Painted Frog",
  "description": "Ideal for mature middle grade readers to adult - anyone interested in Native American history.Who killed Usti Yansa? Find out September 15, 2011, in Wheezer and the Painted Frog, Kitty Sutton's debut novel about the aftermath of the infamous Trail of Tears. Healthy little boys shouldn't grow weak and die when they have shelter, food and the care of their families, yet Sasa's little brother, the last of her family, sickens, mumbling the mysterious 'I didn't do it right, I didn't do enough. Why didn't it work?' Left alone, mourning and trying to survive in a new place with new ways, Sasa seeks answers with the help of her new friend, Wheezer. The Jack Russell Terrier seems too wise, too fierce and too loyal to be just a dog. Did the Creator send Wheezer to Sasa and if so, how can a dog, albeit a smart one, help to solve a murder? From the time Europeans landed in North America, the People were forced out of the land they had known for generations. By the nineteenth century, the United States had pushed them into the remote and undeveloped area known as Indian Territory and promised them food and protection that never came. Plagued by the loss of their ability to farm and hunt, the lack of food and shelter, the disease brought by the White Man, every tribe suffered losses so great only the memories of the survivors could document the dead. This story, taking place among the Cherokee after the Trail of Tears, is a story for all the People. \"Wheezer and the Painted Frog is at once joyous and heartbreaking. You will ache for the suffering, be outraged by the wrongs fascinated by the way of life, identify with Sasa and above all you will love Wheezer. You will look for his spirit in every dog you meet!Good luck and all best wishes Anne\" Anne Perry, Author of Acceptable Loss",
  "genres": [
    "Mystery",
    "Fiction"
  ],
  "author": "Kitty Sutton",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/12634320-wheezer-and-the-painted-frog"
}