{
  "title": "The Way of the Lord Jesus, Vol. 3: Difficult Moral Questions",
  "description": "Like the other volumes in the series entitled The Way of the Lord Jesus, this one is intended primarily for use as a seminary text or instructional resource. But unlike the earlier volumes, which mainly present common Catholic teaching and reflect on it theologically, this volume deals with questions not yet the subject of explicit of clearly applicable Church teachings. Conscientious lay people facing challenging moral questions and those from whom they seek advice will find here guidance not available if not replies to their questions, a model for thinking about questions more or less like those they have. The 200 plus questions dealt with in this book really are difficult. Most of them are more difficult than it initially might seem. Quite often, the proposed reply qualifies or disagrees with something asserted or assumed by the questioner. The reader must be prepared to be challenged. The focus is always on trying to help a questioner form his or her own conscience and make good choices. Public opinion polls and the opinions of supposed experts are never treated as morally authoritative. Legalistic minimalism and impracticable idealism are avoided. Legitimate alternative ways of dealing with problems are often suggested. The motive of hope -- intending heaven and fearing hell -- regularly overarches and under girds every other motive proposed for living the truth of a well-formed conscience. About the Germain Grisez, PhD, is the Harry J. Flynn Professor of Christian Ethics (1978 - ) at Mount Saint Mary's College, Emmitsburg, Maryland. He received his B.A. at John Carroll University; his M.A. and Ph.L. from the Dominican College of St. Thomas Aquinas; and his Ph.D. from the University of Chicago. Along with philosopher John Finnis, who teaches as Oxford and Notre Dame, Grisez launched a new, theoretically sophisticated version of natural law theology, sometimes referred to as the \"New Natural Law Theology\".",
  "genres": [],
  "author": "Germain Grisez",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1263463.The_Way_of_the_Lord_Jesus_Vol_3"
}