{
  "title": "Defiance: The Bielski Partisans",
  "description": "The prevailing image of European Jews during the Holocaust years is one of helpless victims under a death sentence, unable to fight consignment to the ghettos, to the camps, and to the gas chambers. In fact, many Jews struggled alone or with others against the terrors of the Third Reich,risking their lives against overwhelming odds for the slimmest chance of survival, or a mere glimpse of freedom. In Defiance , Nechama Tec offers a riveting history of one such group, a forest community in western Belorussia that would number more than 1,200 Jews by 1944--the largest armed rescueoperation of Jews by Jews in World War II.Describing the entire partisan movement in the region, Tec shows that while most forest fighters in Belorussia were rifle-carrying young men, the members of this extraordinary community included both men and women, some with weapons but mostly unarmed, ranging from infants to the elderly. Shereconstructs for the first time the amazing details of how these partisans and their families--hungry, exposed to the harsh winter weather, always on the lookout for German patrols--managed not only to survive, but to offer protection to all Jewish fugitives who could find their way to them. Drivenby courage born out of despair, they dug wells, set up workshops to repair guns, made clothes, and resoled shoes, supplied services to other guerilla units, and even established a makeshift hospital and school in the forest. Arguing that this success would have been unthinkable without the vision ofone man, Tec offers penetrating insight into the group's commander, Tuvia Bielski, and his journey from his life as the son of the only Jewish peasant family in an isolated rural village to his emergence as a leader possessing the charisma and courage to command under all but impossiblecircumstances.Tec brings to light the untold story of Bielski's struggle as a partisan who lost his parents, wife, and two brothers to the Nazis, yet never wavered in his conviction that it was more important to save one Jew than to kill twenty Germans. She shows how, under Bielski's guidance, the partisanssmuggled Jews out of heavily guarded ghettos, scouted the roads for fugitives, and led retaliatory raids against Belorussian peasants who collaborated with the Nazis against their former Jewish neighbors. Refusing to turn away the weak or the old for the sake of the survival of the larger group,Bielski would warn new arrivals to the forest, \"Life is difficult, we are in danger all the time, but if we perish, if we die, we die like human beings.\"A scholar, a writer, and herself a Holocaust survivor, author Nechama Techas devoted the last two decades to studying the fate of European Jewry, recording rare but vital examples of human compassion, resistance, altruism and heroism in the face of overwhelming horror and despair. Drawing onwide-ranging research and never before published interviews with surviving partisans--including Tuvia Bielski himself two weeks before his death in 1987--she reconstructs here the poignant and unforgettable story of those who chose to fight.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "World War II",
    "War",
    "Historical",
    "Biography"
  ],
  "author": "Nechama Tec",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/542083.Defiance"
}