{
  "title": "The Wraiths of Will and Pleasure",
  "description": "Hailed as \"a literary fantasist of outstanding power and originality\" by Michael Moorcock, Storm Constantine is one of the most exciting and innovative fantasy writers of her generation. The author of many acclaimed works of science fiction and fantasy, she is best known for her daring, stylish and provocative Wraeththu trilogy ( The Enchantments of Flesh and Spirit, The Bewitchments of Love and Hate, The Fulfilments of Fate and Desire ). The series, which chronicled the rise of a new race of seductive androgynous beings with awesome powers, was hailed as a modern fantasy masterpiece, winning an avid international following of devoted readers.Now, with The Wraiths of Will and Pleasure , Storm Constantine returns once again to the saga of the Wraeththu with a new epic that reveals previously unknown truths about the origins of these remarkable beings.Long before the Wraeththu assumed total mastery of the Earth and dominion over the dwindling remnants of the human race, they were a wild and passionate people, living in scattered tribes, worshiping strange gods, increasing their numbers by transmuting humans into their own kind. But all that changed on a festival night that surpassed all others, a night when the world changed forever and the Wraeththu began to realize their awesome potential.It was a time when the archmage Thiede wove the strands of Wraeththu destiny. When two young Wraeththu hara came together to produce a miraculous new life. When Pellaz, a brash and reckless young leader, rose from destruction to take his place in Wraeththu history. And a child called Lileem found a path of passion and power that led to unknown worlds of mystery.A tale of intrigue and betrayal, bloodshed and pleasure, dark and dangerous supernatural forces, ardent and consuming passions, The Wraiths of Will and Pleasure is a thrilling new chapter in a compelling fantasy epic.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Queer",
    "M M Romance",
    "Science Fiction Fantasy",
    "LGBT"
  ],
  "author": "Storm Constantine",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/542357.The_Wraiths_of_Will_and_Pleasure"
}