{
  "title": "Ride the Lightning",
  "description": "Truth seeker. Promise keeper. Guarded heart.By day, Jonah St. John is a criminal analyst for the Georgia Bureau of Investigations. By night, he produces Sinister in Savannah, an investigative podcast, with his two best friends. Jonah’s life revolves around three principles: a man’s word is his oath, friendships are priceless gifts, and love is for other people. When the Sinister in Savannah team delves into the thirty-eight-year-old murder of a drag queen, they quickly discover that the story doesn’t end with the alleged killer’s confession in 1995. Continuing the investigation could have fatal consequences for Jonah and everyone he holds dear, including his irresistible intern.To love is to lose: a lesson Jonah has learned the hard way. For a decade, he has embraced solitude as his penance for a past mistake. Then came Avery Bradford, a man whose warmth and sunshine infuses Jonah’s battered soul and challenges his resistance. Over the past eight months, Jonah has soared closer and closer to Avery’s flame until the thing he’s feared the most becomes the one he can’t live without. The chill of danger merges with the heat of desire, forming a deadly superstorm. Will Jonah seek shelter or ride the lightning? Sinister in Savannah series is a fictional podcast exploring the city’s most nefarious crimes with Southern-fried snark. The books explore friendship, love, loss, and the irrepressible human spirit. Ride the Lightning is book one of three. While each book is written about a different couple, the series should be read in order. Sinister in Savannah is an LGBT romantic suspense series with mature language and sexual content intended for adults eighteen and older.",
  "genres": [
    "M M Romance",
    "Mystery",
    "Romance",
    "Contemporary",
    "Crime",
    "Audiobook",
    "LGBT"
  ],
  "author": "Aimee Nicole Walker",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/54226440-ride-the-lightning"
}