{
  "title": "Scavenger",
  "description": "\"Novels written from the perspective of homeless substance users don't come along every day. When they do, it's a good idea to pay attention, since they offer a window into the casual cruelty of our social economy, which much fiction eschews. Christopher Chambers' new mystery Scavenger offers just such a window.\" —Washington City Paper In the streets of the nation’s capital, a homeless man must quickly learn the ropes of being a detective after a wealthy ex-government official sets him up to take the fall in a cat-and-mouse game of greed, deceit, and murder. Dickie Cornish’s lives in a homeless camp dotting the Smithsonian’s Museum of National History, addled by the K2 and liquor he prays will blunt the pain of a harsh winter, the cruelty of Donald Trump’s capital, and the enduring nightmares from his youth. He makes a few dollars a day turning the possessions of evicted tenants into curb flotsam, scavenging what he can from the wreckage of other lives to save his.On one expedition Dickie gets lucky as he uncovers a treasure in the trash of a wealthy ex-Homeland Security Secretary, Jamie Bracht. But his joy is short-lived, when he simultaneously finds out that his dear friends who escaped the shelters for a decent life have been murdered. In fury, he attacks the local cops, lands in jail, then is plucked out by Bracht, who has a job for him: find a woman using the sub-level network of the streets and the underground world of undocumented immigrants. In return, Bracht promises Dickie a fresh, clean start at a new life.Before long, Dickie discovers that the woman he is supposed to locate guards another treasure that Bracht will stop at nothing―even murder―to retrieve. In his achingly amateur role as sleuth and guardian, Dickie must quell his demons and use his scavenger skills and street smarts to deny Bracht his prize…and save himself from the big frame-up.SCAVENGER is a 21st century take on the noir, hardboiled tales of the 20th, with both bleak and colorful backdrops in the nation’s capital of today. It is layered with characters whose damage outlines why they love, lose, double-cross, and even kill. Dickie Cornish is a new kind of detective: one who is a street-wise local and a neophyte detective, learning to play a new game as it unfolds.",
  "genres": [
    "Fiction",
    "Mystery"
  ],
  "author": "Christopher Chambers",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/54227165-scavenger"
}