{
  "title": "Mine!: How the Hidden Rules of Ownership Control Our Lives",
  "description": "An Adam Grant Spring Book PickFinalist for the Next Big Idea Club A must-read this spring -- a fantastically well-written exploration of our need for ownership and the costs of greed.--Andrew Solomon, National Book Award-winning author of Far From the Tree\n\n\n\nA hidden set of rules governs who owns what--explaining everything from whether you can recline your airplane seat to why HBO lets you borrow a password illegally--and in this lively and entertaining guide, two acclaimed law professors reveal how things become mine.Mine is one of the first words babies learn. By the time we grow up, the idea of ownership seems natural, whether buying a cup of coffee or a house. But who controls the space behind your airplane seat: you reclining or the squished laptop user behind? Why is plagiarism wrong, but it's okay to knock-off a recipe or a dress design? And after a snowstorm, why does a chair in the street hold your parking space in Chicago, but in New York you lose the space and the chair?Mine! explains these puzzles and many more. Surprisingly, there are just six simple stories that everyone uses to claim everything. Owners choose the story that steers us to do what they want. But we can always pick a different story. This is true not just for airplane seats, but also for battles over digital privacy, climate change, and wealth inequality. As Michael Heller and James Salzman show--in the spirited style of Freakonomics, Nudge,  and Predictably Irrational--ownership is always up for grabs.With stories that are eye-opening, mind-bending, and sometimes infuriating, Mine! reveals the rules of ownership that secretly control our lives.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Economics",
    "Law",
    "Business",
    "Sociology",
    "Politics"
  ],
  "author": "Michael A. Heller",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/54226795-mine"
}