{
  "title": "Death Factory",
  "description": "The main character is Sandy Davenport, the son of a wealthy accountant father and a civil servant mother.Despite acquiring a “bad boy” reputation at school, Sandy obtains sufficient qualifications to secure a place at university to study law. Here, he meets Miriam Alexander-Porteous, a fellow law student, and they fall in love. After graduating, they find jobs in their chosen professions, then Miriam becomes pregnant. Following their impending marriage announcement, Miriam's barrister father intervenes and blocks their association by sending Miriam to London, the intended purpose somewhat sinister.Unable to trace his lost love and child, Sandy turns his attention to improving his status as a legal aid lawyer and eventually discovers an aptitude for employment legislation.During the course of his work and after a period of six years, he encounters a much-changed Miriam, who now works for Gordon Richards, a local businessman with connections to organised crime.Sandy first becomes aware of this businessman’s suspect reputation when a school friend commits suicide through accruing debt directly attributed to Richards actions. Then their paths cross when Sandy agrees to act for an ex-employee of Richards in an unfair dismissal litigation. Richards threats are ignored by Sandy, resulting in tragedy and violence.He takes a holiday in Greece where he finds love again. He decides to stay, but learns that Miriam is in serious trouble and he is forced to return to the UK to care for the daughter he has never met and who has stress related issues after witnessing a serious incident.Sandy then discovers Miriam is missing, but learns she has left him documents incriminating Richards and several senior members of the crime organisation. Up against professional hit men and a crooked police superintendent obstructing investigations, Sandy persuades police officers and acquaintances of dubious credentials, to assist him in stopping Richards and ending the organised law breaking, so he can return to Greece.",
  "genres": [],
  "author": "Douglas John Knox",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54233114-death-factory"
}