{
  "title": "Women and Other Monsters: Building a New Mythology",
  "description": "A fresh cultural analysis of female monsters from Greek mythology, and an invitation for all women to reclaim these stories as inspiration for a more wild, more “monstrous” version of feminismThe folklore that has shaped our dominant culture teems with frightening female creatures. In our language, in our stories (many written by men), we underline the idea that women who step out of bounds—who are angry or greedy or ambitious, who are overtly sexual or not sexy enough—aren’t just outside the norm. They’re unnatural. Monstrous. But maybe, the traits we’ve been told make us dangerous and undesirable are actually our greatest strengths.Through fresh analysis of 11 female monsters, including Medusa, the Harpies, the Furies, and the Sphinx, Jess Zimmerman takes us on an illuminating feminist journey through mythology. She guides women (and others) to reexamine their relationships with traits like hunger, anger, ugliness, and ambition, teaching readers to embrace a new image of the female hero: one that looks a lot like a monster, with the agency and power to match.Often, women try to avoid the feeling of monstrousness, of being grotesquely alien, by tamping down those qualities that we’re told fall outside the bounds of natural femininity. But monsters also get to do what other female characters—damsels, love interests, and even most heroines—do not. Monsters get to be complete, unrestrained, and larger than life. Today, women are becoming increasingly aware of the ways rules and socially constructed expectations have diminished us. After seeing where compliance gets us—harassed, shut out, and ruled by predators—women have never been more ready to become repellent, fearsome, and ravenous.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Mythology",
    "Essays",
    "Audiobook",
    "Memoir",
    "History"
  ],
  "author": "Jess Zimmerman",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/54228607-women-and-other-monsters"
}