{
  "title": "When Women Invented Television: The Untold Story of the Female Powerhouses Who Pioneered the Way We Watch Today",
  "description": "The New York Times bestselling author of Seinfeldia tells the little-known story of four trailblazing women in the early days of television who laid the foundation of the industry we know today.It was the Golden Age of Radio and powerful men were making millions in advertising dollars reaching thousands of listeners every day. When television arrived, few radio moguls were interested in the upstart industry and its tiny production budgets, and expensive television sets were out of reach for most families. But four women—each an independent visionary— saw an opportunity and carved their own paths, and in so doing invented the way we watch tv today.Irna Phillips turned real-life tragedy into daytime serials featuring female dominated casts. Gertrude Berg turned her radio show into a Jewish family comedy that spawned a play, a musical, an advice column, a line of house dresses, and other products. Hazel Scott, already a renowned musician, was the first African American to host a national evening variety program. Betty White became a daytime talk show fan favorite and one of the first women to produce, write, and star in her own show.Together, their stories chronicle a forgotten chapter in the history of television and popular culture.But as the medium became more popular—and lucrative—in the wake of World War II, the House Un-American Activities Committee arose to threaten entertainers, blacklisting many as communist sympathizers. As politics, sexism, racism, anti-Semitism, and money collided, the women who invented television found themselves fighting from the margins, as men took control. But these women were true survivors who never gave up—and thus their legacies remain with us in our television-dominated era. It's time we reclaimed their forgotten histories and the work they did to pioneer the medium that now rules our lives.This amazing and heartbreaking history, illustrated with photos, tells it all for the first time.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Audiobook",
    "Womens",
    "Pop Culture",
    "Tv"
  ],
  "author": "Jennifer Keishin Armstrong",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/54236116-when-women-invented-television"
}