{
  "title": "The Monstrosity of Christ: Paradox or Dialectic?",
  "description": "A militant Marxist atheist and a “Radical Orthodox” Christian theologian square off on everything from the meaning of theology and Christ to the war machine of corporate mafia.In this corner, philosopher Slavoj Žižek, a militant atheist who represents the critical-materialist stance against religion's illusions; in the other corner, “Radical Orthodox” theologian John Milbank, an influential and provocative thinker who argues that theology is the only foundation upon which knowledge, politics, and ethics can stand. In The Monstrosity of Christ, Žižek and Milbank go head to head for three rounds, employing an impressive arsenal of moves to advance their positions and press their respective advantages. By the closing bell, they have not only proven themselves worthy adversaries, they have shown that faith and reason are not simply and intractably opposed. Žižek has long been interested in the emancipatory potential offered by Christian theology. And Milbank, seeing global capitalism as the new century's greatest ethical challenge, has pushed his own ontology in more political and materialist directions.Their debate in The Monstrosity of Christ concerns the future of religion, secularity, and political hope in light of a monsterful event—God becoming human. For the first time since Žižek's turn toward theology, we have a true debate between an atheist and a theologian about the very meaning of theology, Christ, the Church, the Holy Ghost, Universality, and the foundations of logic. The result goes far beyond the popularized atheist/theist point/counterpoint of recent books by Christopher Hitchens, Richard Dawkins, and others. Žižek begins, and Milbank answers, countering dialectics with “paradox.” The debate centers on the nature of and relation between paradox and parallax, between analogy and dialectics, between transcendent glory and liberation.",
  "genres": [
    "Philosophy",
    "Religion",
    "Theology",
    "Christianity",
    "Nonfiction",
    "Theory",
    "Politics"
  ],
  "author": "Slavoj Žižek",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/5423242-the-monstrosity-of-christ"
}