{
  "title": "Rejuvenate Aging Eyes",
  "description": "Latest technology to eliminate glasses and contact lenses from your life. Imagine having the vision of your younger self. Imagine throwing away your contacts, progressives, and readers because you now have 20/20 vision that even continues to improve through the years. To have a reversal of the aging process and even preventing cataracts from ever hindering your new vision. This ground-breaking advancement is called Presbyopic Implant in the Eye (PIE). PIE starts from where lasik eye surgery hit a dead end. Lasik above 45 years of age takes away reading and middle vision. If done in thirties inability to read surface in the late forties. People confuse this with lasik fading away. PIE delivers permanent vision for distance middle and near in each eye. It is superior to monovision. Yes, it is eternal. PIE is the only definitive way to prevent cataracts.PIE is a pain free procedure built on the edifice of great communication between surgeon and patient. Usually this has been found to be lacking. This book steps in and helps to bridge that chasm between the surgeon and patient. The book is written in easy to understand English and avoids the medical jargon used in doctor’s office. Our experience has shown that patients understand a little of what the doctors tell and retain even less.The book starts with the basics and takes us on a journey of how visual pathways involved. You may be surprised to learn it’s the eyes not the brain which actually “see”. The next chapter defines presbyopia and non surgical methods to treat it. This is followed by the wonderful chapter which explains PIE and how it is the only method to cure Presbyopia. In fact, it might be the only disease we can cure in a short precure. Have you ever realized we cannot even cure Hypertension or Diabetes. We just make people addicted to medicines. There are many other advantages of PIE enumerated in this chapter including ability to reduce chance of glaucoma. What a lay person should think about when choosing the procedure in surgeon is dealt in the next chapter. The next two amazing chapters detail the procedure and what to expect and choices available. You may be thinking all this sounds too good to be true, but will it work for me. That questioned I s answered by success stories of people from all walks of life. Even if you have had previous lasik or other eye surgeries you could benefit from PIE procedure as explained. Neuroadpataion and astigmatism management are discussed. A very useful chapter on Dry eyes will be beneficial to many readers. Yes, the book does talk about the rare risks and complications in the final chapter.Dr. Khanna has not only coined the term PIE but has been a pioneer in the industry. He has conducted numerous lectures on the topic, provided personal coaching to upcoming surgeons and is the founding Medical Director of Khanna Vision Institute. He has authored numerous educational books which have aided in the popularity of this life-changing procedure.",
  "genres": [],
  "author": "Rajesh Khanna",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54266279-rejuvenate-aging-eyes"
}