{
  "title": "Children with a Star: Jewish Youth in Nazi Europe",
  "description": "“The little children had little parents in the [twins’] block [in Auschwitz]. For example, I was a little mama for twins, two girls named Evichka and Hanka…My sister was the mother for Hanka and I was the mother for Evichka…Evichka told me that she got a mother and a father, but that they had gone away on transport. The twins were four years old. I said to her, ‘I will be your mother.’ She said, ‘But you are only sixteen years old; it doesn’t matter?’ I said, ‘No, it doesn’t matter because it is more important that we are together and that we are not alone. You have a mother and I have a daughter.’” —Magda Magda Somogyi Many books have been written about the experiences of Jews in Nazi Europe. None, however, has focused on the persecution of the most vulnerable members of the Jewish community—its children. This powerful and moving book by Deborah Dwork relates the history of these children for the first time. The book is based on hundreds of oral histories conducted with survivors who were children in the Holocaust, in Europe and North America, an extraordinary range of primary documentation uncovered by the author (including diaries, letters, photographs and family albums), and archival records. Drawing on these sources, Dwork reveals the feelings, daily activities, and perceptions of Jewish children who lived and died in the shadow of the Holocaust. She reconstructs and analyzes the many different experiences the children faced. In the early years of Nazi domination they lived at home, increasingly opposed by rising anti-Semitism. Later some went into hiding while others attempted to live openly on gentile papers. As time passed, increasing numbers were forced into transit camps, ghettos, and death and slave labor camps. Although nearly ninety percent of the Jewish children in Nazi Europe were murdered, we learn in this history not of their deaths but of the circumstances of their lives. Children with a Star is a major new contribution to the history of Europe during the Nazi era. It explains from a different perspective how European society functioned during the wary years, how the German noose tightened, and how the Jewish victims and their gentile neighbors responded. It expands the definition of resistance by examining the history of the people—primarily women—who helped Jewish children during the war. By focusing on children, it strips away rationalizations that the victims of Nazism somehow “allowed or “deserved” their punishment. And by examining the experience of children and thereby laying bare how society functions at its most fundamental level, it not only provides a unique understanding of the Holocaust but a new theoretical approach to the study of history.",
  "genres": [
    "Nonfiction",
    "Holocaust",
    "History",
    "War",
    "Jewish"
  ],
  "author": "Deborah Dwork",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/542463.Children_with_a_Star"
}