{
  "title": "Illumination of the Shadow: Ancestral Wisdom from the past for the future",
  "description": "Imagine a world where everyone has access to all the stories of your ancestors, this would help you to connect to your lineage, heal relationships, and enable these stories to be passed down to future generations.In this book, I discuss real-life ancestral stories. For example, a family with a history of Parkinson's disease across many generations. The ancestral healer tracked the origin of the illness to a time in Africa when an ancestor witnessed the death of her brother, who was bitten by a snake. This caused the essence of this trauma to manifest in Parkinson's disease for future generations until the time came for it to be reviewed by the ancestral healer, which cleared and healed it for all future generations in the lineage. This is one of the many real-life stories that are shared in this book, obtained from the author's client work and group workshops during the completion of genuine energetic healing work.The process of illuminating the shadow aids soul healing and evolution. Healing ancestral patterns is the key to unlock shadow work. As more souls embody more of their source energy on Earth, delving into the shadow is more important than ever. It frees us from energy and patterns that do not serve us anymore. In these turbulent times, the shadow is staring us in the face on an individual and collective level; this is an important time to complete this work. This book shares pioneering knowledge and wisdom about shadow and ancestral work.Illuminating the shadow provides access to the gold; the healing and the wisdom, within which are the secrets of the universe ready to be accessed. Healing the ancestral shadow brings more joy into your life, along with improved relationships with your family and everyone around you. It provides a deep and safe exploration through all the ancestral layers that hold the key to your healing. Our own shadow often manifests itself as an opportunity to delve into the shadow and to find the story behind what is causing us pain.This book contains 10 chapters Our Ancestral Fields of Existence - Pathways of ConsciousnessNavigation of the Ancestral Fields - Pinpointing and Engineering ChangeCurses - Distorting Ancestral RealityEntities - Manifestations of the ShadowsCollective Trauma - Creations of Humanities ShadowsIndividual Trauma - Lessons from the AncestorsThought Forms - Driving our RealityAncestral Illness - Wounds of the PastAncestral Lands - Inherent Foundations of WisdomGifts from the ancestors - Celebration of divine inheritanceEach chapter contains real-life ancestor stories from ancestral healing sessions, which are fascinating and empowering. The book creates an opportunity for the reader to reflect on how humanity has created much of its own trauma, and therefore the manifestation of similar patterns and illness that have continued down the generations. Reflection on this, which the book enables, illuminates the responsibility that we all have to pave a new better future for our families and future generations.",
  "genres": [
    "Spirituality"
  ],
  "author": "Anthea Durand",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/54256698-illumination-of-the-shadow"
}