{
  "title": "Dead Silence",
  "description": "Imagine the worst that can happen. Then imagine again. The stunning new Doc Ford novel by the New York Times–bestselling author. Winter in New York City: Amid sleet and snow, Doc Ford is at the Explorers Club with his new friend, former (and maybe current) British agent Sir James Montbard, researching a jungle expedition and awaiting the arrival of an attractive U.S. senator with whom Ford has become more than friendly. Her car pulls up, she starts to get out—and the unthinkable happens: an abduction attempt right before Ford’s eyes. Ford engages, managing to save the senator, but the companion in her car is not so lucky. A fourteen- year-old Minnesota boy, in New York as the prize for an essay-writing contest, he is snatched and vanishes—dead, authorities fear, until they receive the kidnappers’ ultimatum. Ford goes on the hunt, an odyssey that brings him first to Long Island, then to Florida, but if what happened before was unthinkable, it’s nothing compared with what he discovers. The boy’s captors have a definite agenda, and to make sure he isn’t rescued before their thirty-six-hour deadline is up, they’ve put him someplace they’re sure no one will find him: they’ve buried him alive. But there’s something about the boy his captors do not know. He has a past, as do Doc Ford and many of the other key players in these extraordinary events. And before those thirty-six hours are over, all those pasts will catch up to the present— with catastrophic results. Randy Wayne White’s novels have always won praise for their remarkable imagination, intrigue, and some of the best characters in suspense fiction. Nothing, however, will prepare his readers for the remarkable twists and revelations of Dead Silence.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "Randy Wayne White",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/5424004-dead-silence"
}