{
  "title": "White Feminism: From the Suffragettes to Influencers and Who They Leave Behind",
  "description": "JOURNALIST KOA BECK’S AMBITIOUS HARVARD RESEARCH-BASED DEEP DIVE INTI HOW FEMINISM HAS BEEN COMMODIFIED AND RACIALIZED—AND THE REVOLUTIONARY WAY OF THINKING THAT COULD DRIVE A NEW MOVEMENTFourth-wave feminism preaches empowerment for women, centering an intersectionality that has been missing from the start. Long before the Lean In phenomenon and branded empowerment conferences, women have been encouraged to “find their power” and to “know their value” when combatting institutional sexism. But we’ve also funded patriarchal institutions that have cashed in on “feminism” without actually making a real difference in the lives of the women they supposedly uplift.From the formation of the suffragette movement over a century ago to the Women’s March in 2017, mainstream feminism has been defined by parameters dictated and sanctioned by the white women they most benefit. In White Feminism, Koa Beck details the conventions that marginalized genders have needed to adopt in order to be recognized and exposes how Indigenous, Black, brown, transgender, disabled, and undocumented women, among other disenfranchised peoples, have been overlooked in order to champion a different feminist narrative. With insights spanning from the rise of girl bosses to widespread civil unrest during a global pandemic, Beck illuminates how white feminism adheres to a political strategy that commercializes struggle and reinforces white Western supremacy.Combining her quick-witted, cutting commentary with methodical historical research, Beck pulls from years of experience in the media industry to highlight the extent of racial prejudice, elitism, and privilege that fuels the dominant feminist discourse. She delivers a call to action that urges readers to reinvent the narrow feminist ideas that have become staples in modern gender politics, asking readers to join her in scrutinizing the capitalist, individualist, and heteronormative paradigms under which white feminism operates. In this wide-ranging analysis of the dangers of homogenizing the global feminist experience, Beck advocates for a new landscape that accounts for visibility and inclusivity.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "History",
    "Race",
    "Politics",
    "Social Justice",
    "Audiobook"
  ],
  "author": "Koa Beck",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/54238294-white-feminism"
}