{
  "title": "At the Mercy of the River: An Exploration of the Last African Wilderness",
  "description": "Even in this age of extreme sports and made-for-TV survival games, there still exist places on earth where the most intrepid among us can plunge into truly unknown territory. The acclaimed adventure writer Peter Stark had waited all his life for just such an opportunity. But when he was invited to Africa to join a small expedition kayaking down Mozambique’s Lugenda River, he balked. The 750-kilometer rivercourse was largely uncharted–dotted with rapids, waterfalls, and home to deadly crocodiles and hippos; two of his four travel companions were not skilled kayakers; and he had a family to think of, (not to mention that at forty-eight, he himself was feeling a bit old for the life untamed). Suppressing inner doubts and driven by that most human of urges–to see what lies beyond the next bend–Stark signed on for the adventure of a lifetime.At the Mercy of the River is Stark’s harrowing, insightful account of this venture into the unknown. “Why,” he muses between capsizes in the Lugenda’s croc-infested waters, “are humans compelled to explore?” The expedition’s five distinct–and sometimes clashing–personalities provide individual answers to that question.Equipped with only the most rudimentary comforts and lacking the customary explorer’s gun, the party encounters breathtaking natural splendor, rich wildlife, and villages little affected by modern life. Ever aware that they are following in the metaphorical footsteps of great explorers of the past–Vasco da Gama, Mungo Park, Ibn Battuta, David Livingstone, and other men of adventure who bridged Africa and the West–Stark shares these explorers’ stories with us, finding a common thread linking his experience with theirs. Using their accounts, his travails on the Lugenda River, and the insights of wilderness philosophers such as Henry David Thoreau, Stark attempts to understand the very nature of “exploration” while pondering the question, Where will we go when our wilderness vanishes?At the Mercy of the River is at turns inspiring, heart-thumping, and even amusing. But most of all, it is a riveting adventure story for a time when adventure is in danger of losing its meaning.",
  "genres": [
    "Travel",
    "Africa",
    "Adventure",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Mozambique"
  ],
  "author": "Peter     Stark",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/542425.At_the_Mercy_of_the_River"
}