{
  "title": "Cuyahoga",
  "description": "Longlisted for the PEN/Hemingway Award for Debut Novel “Cuyahoga is tragic and comic, hilarious and inventive—a 19th-century legend for 21st-century America” (The Boston Globe). Big Son is a spirit of the times—the times being 1837. Behind his broad shoulders, shiny hair, and church-organ laugh, Big Son practically made Ohio City all by himself. The feats of this proto-superhero have earned him wonder and whiskey, but very little in the way of fortune. And without money, Big cannot become an honest husband to his beloved Cloe (who may or may not want to be his honest wife). In pursuit of a steady wage, our hero hits the (dirt) streets of Ohio City and Cleveland, the twin towns racing to become the first great metropolis of the West. Their rivalry reaches a boil over the building of a bridge across the Cuyahoga River—and Big stumbles right into the kettle. The resulting misadventures involve elderly terrorists, infrastructure collapse, steamboat races, wild pigs, and multiple ruined weddings. Narrating this “very funny, rambunctious debut novel” (Los Angeles Times) tale is Medium Son—known as Meed—apprentice coffin maker, almanac author, orphan, and the younger brother of Big. Meed finds himself swept up in the action, and he is forced to choose between brotherly love and his own ambitions. His uncanny voice—plain but profound, colloquial but poetic—elevates a slapstick frontier tale into a “breezy fable of empire, class, conquest, and ecocide” (The New York Times Book Review). Evoking the Greek classics and the Bible alongside nods to Looney Tunes, Charles Portis, and Flannery O’Connor, Pete Beatty has written “a hilarious and moving exploration of family, home, and fate [and] you won’t read anything else like it this year” (BuzzFeed).",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Historical",
    "Audiobook",
    "Humor",
    "Adult"
  ],
  "author": "Pete Beatty",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/54264870-cuyahoga"
}