{
  "title": "How the Dead Live",
  "description": "In April 1988, 65-year-old Lily Bloom quickly succumbs to cancer in the Royal Ear Hospital. (\"Where do they keep the Royal Ear, I wonder? I think of it as very large--as big as a dinner tray--and very red, angrily red.\") But after life there's death. Guided by an aborigine named Phar Lap Jones, she is transported by a Greek Cypriot minicab driver to the North London dead neighborhood of Dulston. There, accompanied by her dead son, Rude Boy, she's introduced to the 12-step Personally Dead meetings, and she watches over her living daughters--the cold, ambitious Charlotte, and her favorite, the heroin-addicted Natasha. \"Natasha is peculiarly charged by the drug--and even by the mere anticipation of its effects. She shifts from being vulnerable and skittish and withdrawn to being strong and steady and extrovert. She's told me before that it makes her feel 'complete' and 'confident,' and I can see what she means. When she's off heroin she's a fucking nightmare--when she's on it she's a peach.\" Since Will Self's face, voice, and, notoriously, life story are familiar to many who will never pick up his fiction, there's always the risk of reading How the Dead Live as autobiography. In which case, he's clearly based Lily on his New York-born Jewish mother, and he's wittily retooled large chunks of his own much-publicized addictions, transmuting himself into the beautiful and glamorously doomed Natasha. But Lily is feisty and articulate, with a complex history spanning two continents, two husbands, and a constantly re-created personality--a great literary creation. Self's sympathetic account of Lily's decline into her morphine-laden deathbed is deeply affecting, and his long-term obsession with London provides us with the utterly convincing Dulston. His treatment of modern Jewish life in North London (rather than New York) will find its fans and critics, but the novel grows beyond such local concerns. Ultimately, it is about the vexed relationship between the worries of contemporary Western life and a more transcendent spirituality--signaled by Self's opening gesture to The Tibetan Book of the Dead and by the all-seeing Phar Lap Jones. How the Dead Live is a big book with big ideas, and quite definitely Will Self's most ambitious and mature work to date. --Alan Stewart",
  "genres": [
    "Fiction",
    "Crime",
    "Fantasy",
    "Mystery",
    "Horror",
    "British Literature",
    "Contemporary"
  ],
  "author": "Will Self",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/542910.How_the_Dead_Live"
}