{
  "title": "The Paris Dressmaker",
  "description": "Based on true accounts of how Parisiennes resisted the Nazi occupation in World War II—from fashion houses to the city streets—comes a story of two courageous women who risked everything to fight an evil they couldn’t abide.Paris, 1939. Maison Chanel has closed, thrusting haute couture dressmaker Lila de Laurent out of the world of high fashion as Nazi soldiers invade the streets and the City of Lights slips into darkness. Lila’s life is now a series of rations, brutal restrictions, and carefully controlled propaganda while Paris is cut off from the rest of the world. Yet in hidden corners of the city, the faithful pledge to resist. Lila is drawn to La Resistance and is soon using her skills as a dressmaker to infiltrate the Nazi elite. She takes their measurements and designs masterpieces, all while collecting secrets in the glamorous Hôtel Ritz—the heart of the Nazis’ Parisian headquarters. But when dashing René Touliard suddenly reenters her world, Lila finds her heart tangled between determination to help save his Jewish family and bolstering the fight for liberation.Paris, 1943. Sandrine Paquet’s job is to catalog the priceless works of art bound for the Führer’s Berlin, masterpieces stolen from prominent Jewish families. But behind closed doors, she secretly forages for information from the underground resistance. Beneath her compliant façade lies a woman bent on uncovering the fate of her missing husband . . . but at what cost? As Hitler’s regime crumbles, Sandrine is drawn in deeper when she uncrates an exquisite blush Chanel gown concealing a cryptic message that may reveal the fate of a dressmaker who vanished from within the fashion elite.Told across the span of the Nazi occupation, The Paris Dressmaker highlights the brave women who used everything in their power to resist darkness and restore light to their world.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Christian Fiction",
    "World War II",
    "Audiobook",
    "Romance"
  ],
  "author": "Kristy Cambron",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/54287705-the-paris-dressmaker"
}