{
  "title": "Big City Heat",
  "description": "The heat is rising and champagne is on ice.Love contemporary romances in the Big City? Say yes and you’ll love this collection of hot and steamy stories set in city high-rises, each perfect for one sitting.Within these pages, find an exotic cocktail — billionaire, fake, curvy women, older men, interracial, LGBTQ, straight, office, mafia … and more.In this set:The 57th Floor: Hazel StormWhen a client meeting sends matchmaker, Madelyn, hurtling to the high-rise office of CEO Peter Waring, she doesn’t expect to be blown away by this way-too-hot older man. But hookups with clients aren’t allowed, and now, Madelyn has to find Peter the perfect match.A Change of Plans: PE KavanaghWays to make the best of a NYC blizzard:1. Take shelter in a luxury penthouse2. Stock up on all your favorite snacks3. Get stranded with your big sister’s best friend, who happens to be the woman of your dreamsA Hole: Phoebe AlexanderWith meddling friends and myriad misunderstandings, can Ace and Ella find their happy ending? Or will Ella just become the punchline of Ace’s next joke?Asylum Club: Aidy AwardI need this job at the infamous Asylum Club, but I don’t submit for anyone. Not even the sinful billionaire owner whose dominant side drives me crazy in all the hottest ways.44th & Blue: Jodi PayneWhen Benjamin Waters' law firm moves to the 44th floor of a Midtown high-rise, the last person he expects to encounter is his casual hookup, Cole Turner. Cole is working on the finishing touches to the office space, wearing a sexy tool belt and threatening to disrupt Benjamin's carefully compartmentalized life.Global City Tryst: Maida MalbyOne alluring French-Filipina beauty. One sexy US Air Force officer. One torrid weekend tryst.Felling Bechet: Stella WilliamsBechet Cross seems the perfect fling for Isis Hale. No strings, no games, until he fell.The Wolf of Wall Street: Lucy EdenCEO, Luis Pine and Executive Assistant, Aurora Douglas have a million reasons to keep their relationship strictly professional, except for one…fate.Make Me Beg: Moni BoyceTeagan Palmer hates Reid Beckett. Unfortunately, the sexy, ruthless fixer is the only one standing between Teagan and the hit on her life. An enemies to lovers, mafia romance.Courtney: Jayce EllisCourtney intends to relax, relate, release, when he comes home after a decade abroad. When he meets Tracey, his plans abruptly shift, and now getting to know the cautious, but sinfully gorgeous man is the only thing on his mind.The Glass Tower: Emily GrayWhile Zel Thatcher dreams of escape from a glass prison, Regina Prince restores the passion for music he thought was lost. Can they overcome his uncle’s malice to find love and a fairytale ending?The Right Note: Bree KraemerIn a high-rise in Chicago, Eliza and Henry are unaware that the other even exists. Until music brings them together.Get these HOT stories from the TOP stories of some of the biggest, sexiest city high-rises.",
  "genres": [
    "Anthologies",
    "Romance"
  ],
  "author": "Hazel Storm",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/54277932-big-city-heat"
}