{
  "title": "The Power of Awareness: Neville Goddard's Popular Self-help book - Unlocking Inner Potential: Neville Goddard's Guide to Harnessing the Power of Awareness",
  "description": "With the words, \"Do not try to change people; they are only messengers telling you who you are. Revalue yourself and they will confirm the change,\" Goddard invites us to resist the temptation toward judgment and to look at ourselves for the change we want to see in the world an in others. Neville shows how change of consciousness is the critical factor in life, for consciousness is the only reality, the first and only cause-substance of the phenomena of life. Increase your mindfulness with ten easy exercises, devised by a prominent leader of the spiritual movement known as New Thought.Neville Lancelot Goddard was born in Barbados in 1905. He came to the United States to study drama at the age of seventeen and whilst touring with his dance company in England he developed an interest in metaphysics after striking up a conversation with a Scotsman. The Scotsman lent him a series of books on the powers of the mind. On his return he gave up the entertainment industry to devote his full attention to the study of spiritual and mystical matters. After traveling extensively throughout the United States, Neville eventually made his home in Los Angeles where, in the 1950s, he gave a series of talks on television and radio, and for many years lectured regularly to capacity audiences. In the 1960s and early 1970s, he confined most of his lectures to Los Angeles, New York, and San Francisco. In his early lectures and books, Neville dealt solely with what he called The Law, the technique of creating one's physical reality through imagining. It is this portion of his expression that most closely accords with the teachings of the New Thought movement.",
  "genres": [
    "Spirituality",
    "Self Help",
    "Nonfiction",
    "Philosophy",
    "Psychology",
    "Personal Development",
    "Audiobook"
  ],
  "author": "Neville Goddard",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/54275456-the-power-of-awareness"
}