{
  "title": "Strange Flesh",
  "description": "THIS IS A STORY ABOUT SEX AND GAMES. \"The only clue we have to our brother's whereabouts is this place that doesn't really exist.\"Ten years ago, Blythe Randall broke James Pryce's heart. Now she needs his help. Her enigmatic appeal lures the elite hacker into his most tantalizing, and most personal, assignment yet.A Harvard dropout employed by Manhattan-based RedRook Security, James makes a living finding people who don't want to be found, pursuing their digital tracks around the globe, flushing out criminals, and exacting creative high-tech revenge on behalf of his clients. But this time he's following his target (billionaire multimedia artist Billy Randall) into an exotic and treacherous world: a virtual one.Capping off an erratic, increasingly violent series of stunts meant to plague his family's media empire, black sheep Billy sends a video of his own suicide to his older siblings, aristocratic twins Blythe and Blake. In it, Billy jacks out, reanimating onscreen as an avatar in a decadent online world called NOD. The performance is pure Billy: he has always been obsessed with the Bleed: the moment when real and virtual selves intersect, where actions in one life breed consequences in another.Blythe uses her influence to install James at GAME, a downtown media collective and one of Billy's recent haunts. Posing as a documentarian, James gains access to a small band of artists and programmers, contemporaries, and in some cases enemies, of Billy Randall, whose top secret project represents the holy grail of virtual reality. Meanwhile, James learns that as part of his most recent scheme, Billy himself has designed a lavish alternate reality game, an escalating, high-stakes virtual landscape of strange flesh.In order to find him, James must play along.",
  "genres": [
    "Fiction",
    "Thriller",
    "Science Fiction",
    "Mystery",
    "Cyberpunk",
    "Suspense",
    "Erotica"
  ],
  "author": "Michael  Olson",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/12639667-strange-flesh"
}