{
  "title": "An Anatomy of Pain: How the Body and the Mind Experience and Endure Physical Suffering",
  "description": "An illuminating, authoritative, and in-depth examination of the fascinating science behind pain that “combines a career’s worth of expertise with a long history of pain treatment” ( GQ )—from one of the internationally leading doctors in pain management.Pain is a universal human experience, but we understand very little about the mechanisms behind it. We hurt ourselves, we feel pain, we seek help from a professional or learn to avoid certain behaviors that cause pain. But the story of what goes on in our body is far from simple. Even medical practitioners themselves often fail to grasp the complexities between our minds and bodies and how they interact when dealing with pain stimulus. Throughout history we’ve tried to prevent and mediate the effects of pain—which has only resulted in a highly medicated population and a booming opiates industry.Written by a medical expert trained as an anesthesiologist, An Anatomy of Pain is the first book to clearly explain the current issues and complexities surrounding the treatment of pain and how society deals with those in pain, as well as how our bodies relate to pain. Common conception still equates pain with tissue damage but that is only a very small part of the story—the organ which produces pain is the brain. Case studies show that a woman who has undergone a c-section reports dramatically less pain than a patient who has had kidney stones removed in a similarly invasive operation. The soldier who drags himself or herself to safety after being shot deals with pain in a remarkably different way from someone suffering a similar injury on a street. The truth is that pain is a complex mix of nerve endings, psychological state, social preconceptions, and situational awareness.Filled with case studies and medical history, this enlightening book offers a crash course in all aspects of pain, from chronic to acute, and walks us through the current landscape of pain treatments—from medication (including opioids) to electrical nerve stimulation. Whether it’s a mild ache or severe discomfort, we all encounter pain in our lives and “this splendid book—informative, empathic, and wise—about a universal experience will surely promote healing” ( Booklist , starred review).",
  "genres": [
    "Nonfiction",
    "Science",
    "Health",
    "Medicine",
    "Psychology",
    "History",
    "Medical"
  ],
  "author": "Abdul-Ghaaliq Lalkhen",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/54303830-an-anatomy-of-pain"
}