{
  "title": "The Girls Are All So Nice Here",
  "description": "A USA TODAY Best Book of 2021Two former best friends return to their college reunion to find that they’re being circled by someone who wants revenge for what they did ten years before—and will stop at nothing to get it—in this “propulsive” (Megan Miranda, bestselling author of The Girl from Widow Hills ) psychological thriller.A lot has changed in years since Ambrosia Wellington graduated from college, and she’s worked hard to create a new life for herself. But then an invitation to her ten-year reunion arrives in the mail, along with an anonymous note that reads, “ We need to talk about what we did that night. ”It seems that the secrets of Ambrosia’s past—and the people she thought she’d left there—aren’t as buried as she believed. Amb can’t stop fixating on what she did or who she did it larger-than-life Sloane “Sully” Sullivan, Amb’s former best friend, who could make anyone do anything.At the reunion, Amb and Sully receive increasingly menacing messages, and it becomes clear that they’re being pursued by someone who wants more than just the truth of what happened that first semester. This person wants revenge for what they did and the damage they caused—the extent of which Amb is only now fully understanding. And it was all because of the game they played to get a boy who belonged to someone else and the girl who paid the price.Alternating between the reunion and Amb’s freshman year, The Girls Are All So Nice Here is a “chilling and twisty thriller” ( Book Riot ) about the brutal lengths girls can go to get what they think they’re owed, and what happens when the games we play in college become matters of life and death.",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Contemporary",
    "Adult",
    "Dark Academia"
  ],
  "author": "Laurie Elizabeth Flynn",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/54304089-the-girls-are-all-so-nice-here"
}