{
  "title": "Becoming Leidah",
  "description": "A love story set in nineteenth-century Norway, about a woman rescued from the sea, the fisherman who marries her, their tiny and unusually gifted daughter, and the shapeshifter who follows their every move, perfect for fans of Alice Hoffman, Yangsze Choo, Eowyn Ivey, and Neil Gaiman.The sky opens up... I hear them laugh.They don’t feel the sadness in the air.They don’t feel the danger coming, riding in on the wind.In the hinterlands of old Norway, Leidah Pietersdatter is born blue-skinned, with webbed hands and feet. Upon every turn of season, her mother, Maeva, worries as her daughter’s peculiarities blossom—inside the root of the tiny child, a strange power is taking hold.Maeva tries to hide the girl from the suspicious townsfolk of the austere village of Ørken, just as she conceals her own magical ancestry from her daughter. And Maeva’s adoring husband, Pieter, wants nothing more than for his new family to be accepted by all. But unlike Pieter, who is blinded by love, Maeva is aware that the villagers, who profess a rigid faith to the new God and claim to have abandoned the old ways, are watching for any sign of transgression—and are eager to pounce and punish.  Following both mother and daughter from the shadows and through time, an inquisitive shapeshifter waits for the Fates to spin their web, and for Maeva to finally reclaim who she once was. And as Maeva’s elusive past begins to beckon, she realizes that she must help her daughter navigate and control her own singular birthright if the child is to survive the human world.But the protective love Pieter has for his family is threatening the secure life they have slowly built and increasingly becoming a tragic obstacle. Witnessing this, Maeva comes to a drastic conclusion: she must make Leidah promise to keep a secret from Pieter—a perilous one that may eventually free them all.",
  "genres": [
    "Historical Fiction",
    "Fantasy",
    "Fiction",
    "Magical Realism",
    "Historical",
    "Mythology",
    "Romance"
  ],
  "author": "Michelle Grierson",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/54304119-becoming-leidah"
}