{
  "title": "Pipe Dreams: The Urgent Global Quest to Transform the Toilet",
  "description": "Finalist for the 2022 NASW Science in Society Journalism AwardLonglisted for the 2022 AAAS/Subaru SB&F Prize for Excellence in Science BooksFrom an award-winning science journalist, a “deeply researched, entertaining, and impassioned exploration of sanitation” ( Nature ) and the future of the toilet—for fans of popular science bestsellers by Mary Roach.Most of us do not give much thought to the centerpiece of our bathrooms, but the toilet is an unexpected paradox. On the one hand, it is a modern a ubiquitous fixture in a vast sanitation system that has helped add decades to the human life span by reducing disease. On the other hand, the toilet is also a tragic less than half of the world’s population can access a toilet that safely manages body waste, including many right here in the United States. And it is inefficient, squandering clean water as well as the nutrients, energy, and information contained in the stuff we flush away. While we see radical technological change in almost every other aspect of our lives, we remain stuck in a sanitation status quo—in part because the topic of toilets is taboo.Fortunately, there’s hope—and Pipe Dreams daringly profiles the growing army of sewage-savvy scientists, engineers, philanthropists, entrepreneurs, and activists worldwide who are overcoming their aversions and focusing their formidable skills on making toilets accessible and healthier for all.This potential revolution in sanitation has many benefits, including reducing inequalities, mitigating climate change and water scarcity, improving agriculture, and optimizing health. Author Chelsea Wald takes us on a wild world tour from a compost toilet project in Haiti, to a plant in the Netherlands that salvages used toilet paper from sewage, and shows us a toilet seat that can watch users’ poop for signs of illness, among many other fascinating developments.“Toilet humor is one thing, but toilet fact, as digested by skilled science writer Wald, is quite another…[ Pipe Dreams is] a highly informative, well-reasoned call to rethink the throne” ( Kirkus Reviews ).",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Audiobook",
    "Technology",
    "Nature",
    "Environment"
  ],
  "author": "Chelsea Wald",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/54304230-pipe-dreams"
}