{
  "title": "How to Be Human: An Autistic Man's Guide to Life",
  "description": "An unforgettable, unconventional narrative that examines the many ways to be fully human, told by the first young adult with autism to attend Oxford University as a Rhodes Scholar.As a child, Jory Fleming was wracked by uncontrollable tantrums, had no tolerance for people, and couldn’t manage the outside world. Slightly more than a decade later, he was bound for England, selected to attend one of the world’s premier universities.How to Be Human explores life amid a world constructed for neurotypical brains when yours is not. But the miracle of this book is that instead of dwelling on Jory’s limitations, those who inhabit the neurotypical world will begin to better understand their they will contemplate what language cannot say, how linear thinking leads to dead ends, and how nefarious emotions can be, particularly when, in Jory’s words, they are “weaponized.” Through a series of deep, personal conversations with writer Lyric Winik, Jory makes a compelling case for logical empathy based on rational thought, asks why we tolerate friends who see us as a means to an end, and explains why he believes personality is a choice. Most movingly, he discusses how, after many hardships, he maintains a deep, abiding “With people, I don’t understand what goes in and what comes out, and how to relate,” he says. “But I can always reconnect with my relationship with my Creator.”Join Jory and Lyric as they examine what it means to be human and ultimately how each of us might become a better one. Jory asks us to Who has value? What is a disability? And how do we correct the imbalances we see in the world? How to Be Human shows us the ways a beautifully different mind can express the very best of our shared humanity.",
  "genres": [
    "Nonfiction",
    "Autistic Spectrum Disorder",
    "Memoir",
    "Biography",
    "Psychology",
    "Audiobook",
    "Mental Health"
  ],
  "author": "Jory Fleming",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/54303115-how-to-be-human"
}