{
  "title": "Richer, Wiser, Happier: How the World's Greatest Investors Win in Markets and Life",
  "description": "From a renowned financial journalist comes a fresh, “engaging” (The New York Times), and profound book that draws on hundreds of hours of exclusive interviews with many of the world’s super-investors to demonstrate that key insights for building wealth apply to life as well.Billionaire investors. If we think of them, it’s with a mixture of awe and suspicion. Clearly, they possess a kind of genius—the proverbial Midas Touch. But are the skills they possess transferable? And do they have anything to teach us besides making money?In Richer, Wiser, Happier, William Green draws on interviews that he’s conducted over twenty-five years with many of the world’s greatest investors. As he discovered, their talents extend well beyond the financial realm. The most successful investors are mavericks and iconoclasts who question conventional wisdom and profit vastly from their ability to think more rationally, rigorously, and objectively. They are master game players who consciously maximize their odds of long-term success in markets and life, while also minimizing any risk of catastrophe. They draw powerful insights from many different fields, are remarkably intuitive about trends, practice fanatical discipline, and have developed a high tolerance for pain. As Green explains, the best investors can teach us not only how to become rich, but how to improve the way we think, reach decisions, assess risk, avoid costly errors, build resilience, and turn uncertainty to our advantage.Green ushers us into the lives of more than forty super-investors, visiting them in their offices, homes, and even their places of worship—all to share what they have to teach. From Sir John Templeton to Charlie Munger, Jack Bogle to Ed Thorp, Will Danoff to Mohnish Pabrai, Bill Miller to Laura Geritz, Joel Greenblatt to Howard Marks. In explaining how they think and why they win, this “unexpectedly illuminating” (Peter Diamandis) book provides “many nuggets of wisdom” (The Washington Post) that will enrich you both financially and personally.",
  "genres": [
    "Finance",
    "Business",
    "Nonfiction",
    "Economics",
    "Money",
    "Personal Finance",
    "Self Help"
  ],
  "author": "William                  Green",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/54303127-richer-wiser-happier"
}