{
  "title": "Leonora in the Morning Light",
  "description": "For fans of Amy Bloom’s White Houses and Colm Tóibín’s The Master, a “gorgeously written, meticulously researched” (Jillian Cantor, bestselling author of Half Life) novel about Surrealist artist Leonora Carrington and the art, drama, and romance that defined her coming-of-age during World War II.1940. A train carrying exiled German prisoners from a labor camp arrives in southern France. Within moments, word spreads that Nazi capture is imminent, and the men flee for the woods, desperate to disappear across the Spanish border. One stays behind, determined to ride the train until he reaches home, to find a woman he refers to simply as “her.” 1937. Leonora Carrington is a twenty-year-old British socialite and painter when she meets Max Ernst, an older, married artist whose work has captivated Europe. She follows him to Paris, into the vibrant world of studios and cafes where rising visionaries of the Surrealist movement like Andre Breton, Pablo Picasso, Lee Miller, Man Ray, and Salvador Dali are challenging conventional approaches to art and life. Inspired by their freedom, Leonora begins to experiment with her own work, translating vivid stories of her youth onto canvas and gaining recognition under her own name. It is a bright and glorious age of enlightenment—until war looms over Europe and headlines emerge denouncing Max and his circle as “degenerates,” leading to his arrest and imprisonment. Left along as occupation spreads throughout the countryside, Leonora battles terrifying circumstances to survive, reawakening past demons that threaten to consume her. As Leonora and Max embark on remarkable journeys together and apart, the full story of their tumultuous and passionate love affair unfolds, spanning time and borders as they seek to reunite and reclaim their creative power in a world shattered by war. When their paths cross with Peggy Guggenheim, an art collector and socialite working to help artists escape to America, nothing will be the same.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Art",
    "France",
    "Historical",
    "World War II",
    "Feminism"
  ],
  "author": "Michaela Carter",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/54304219-leonora-in-the-morning-light"
}