{
  "title": "The Memory Collectors",
  "description": "Perfect for fans of The Scent Keeper and The Keeper of Lost Things , an atmospheric and enchanting debut novel about two women haunted by buried secrets but bound by a shared gift and the power the past holds over our lives.Ev has a mysterious ability, one that she feels is more a curse than a gift. She can feel the emotions people leave behind on objects and believes that most of them need to be handled extremely carefully, and—if at all possible—destroyed. The harmless ones she sells at Vancouver’s Chinatown Night Market to scrape together a living, but even that fills her with trepidation. Meanwhile, in another part of town, Harriet hoards thousands of these treasures and is starting to make her neighbors sick as the overabundance of heightened emotions start seeping through her apartment walls.When the two women meet, Harriet knows that Ev is the only person who can help her make something truly spectacular of her collection. A museum of memory that not only feels warm and inviting but can heal the emotional wounds many people unknowingly carry around. They only know of one other person like them, and they fear the dark effects these objects had on him. Together, they help each other to develop and control their gift, so that what happened to him never happens again. But unbeknownst to them, the same darkness is wrapping itself around another, dragging them down a path that already destroyed Ev’s family once, and threatens to annihilate what little she has left.The Memory Collectors casts the everyday in a new light, speaking volumes to the hold that our past has over us—contained, at times, in seemingly innocuous objects—and uncovering a truth that both women have tried hard to bury with their not all magpies collect shiny things—sometimes they gather darkness.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Magical Realism",
    "Mystery",
    "Contemporary",
    "Audiobook",
    "Paranormal"
  ],
  "author": "Kim Neville",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/54303938-the-memory-collectors"
}