{
  "title": "Faye, Faraway",
  "description": "A heartfelt, spellbinding, and irresistible debut novel for fans of The Time Traveler’s Wife and Outlander that movingly examines loss, faith, and love as it follows a grown woman who travels back in time to be reunited with the mother she lost when she was a child.Faye is a thirty-seven-year-old happily married mother of two young daughters. Every night, before she puts them to bed, she whispers to them: “You are good, you are kind, you are clever, you are funny.” She’s determined that they never doubt for a minute that their mother loves them unconditionally. After all, her own mother Jeanie had died when she was only seven years old and Faye has never gotten over that intense pain of losing her.But one day, her life is turned upside down when she finds herself in 1977, the year before her mother died. Suddenly, she has the chance to reconnect with her long-lost mother, and even meets her own younger self, a little girl she can barely remember. Jeanie doesn’t recognize Faye as her daughter, of course, even though there is something eerily familiar about her...As the two women become close friends, they share many secrets—but Faye is terrified of revealing the truth about her identity. Will it prevent her from returning to her own time and her beloved husband and daughters? What if she’s doomed to remain in the past forever? Faye knows that eventually she will have to choose between those she loves in the past and those she loves in the here and now, and that knowledge presents her with an impossible choice.Emotionally gripping and ineffably sweet Faye, Faraway is a brilliant exploration of the grief associated with unimaginable loss and the magic of being healed by love.",
  "genres": [
    "Time Travel",
    "Fiction",
    "Fantasy",
    "Historical Fiction",
    "Science Fiction",
    "Contemporary",
    "Magical Realism"
  ],
  "author": "Helen   Fisher",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/54304108-faye-faraway"
}