{
  "title": "How to Not Die Alone: The Surprising Science That Will Help You Find Love",
  "description": "A “must-read” ( The Washington Post ) funny and practical guide to help you find, build, and keep the relationship of your dreams.Have you ever looked around and wondered, “Why has everyone found love except me?” You’re not the only one. Great relationships don’t just appear in our lives—they’re the culmination of a series of decisions, including whom to date, how to end it with the wrong person, and when to commit to the right one. But our brains often get in the way. We make poor decisions, which thwart us on our quest to find lasting love.Drawing from years of research, behavioral scientist turned dating coach Logan Ury reveals the hidden forces that cause those mistakes. But awareness on its own doesn’t lead to results. You have to actually change your behavior. Ury shows you how.This “simple-to-use guide” (Lori Gottlieb, New York Times bestselling author of Maybe You Should Talk to Someone ) focuses on a different decision in each chapter, incorporating insights from behavioral science, original research, and real-life stories. You’ll learn:-What’s holding you back in dating (and how to break the pattern)-What really matters in a long-term partner (and what really doesn’t)-How to overcome the perils of online dating (and make the apps work for you)-How to meet more people in real life (while doing activities you love)-How to make dates fun again (so they stop feeling like job interviews)-Why “the spark” is a myth (but you’ll find love anyway)This “data-driven” ( Time ), step-by-step guide to relationships, complete with hands-on exercises, is designed to transform your life. How to Not Die Alone will help you find, build, and keep the relationship of your dreams.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Relationships",
    "Psychology",
    "Audiobook",
    "Personal Development",
    "Love"
  ],
  "author": "Logan Ury",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/54304221-how-to-not-die-alone"
}