{
  "title": "Einstein's Fridge: How the Difference Between Hot and Cold Explains the Universe",
  "description": "This entertaining, eye-opening account of how the laws of thermodynamics are essential to understanding the world today—from refrigeration and jet engines to calorie counting and global warming—is “a lesson in how to do popular science right” ( Kirkus Reviews ).Einstein’s Fridge tells the incredible epic story of the scientists who, over two centuries, harnessed the power of heat and ice and formulated a theory essential to comprehending our universe. “Although thermodynamics has been studied for hundreds of years…few nonscientists appreciate how its principles have shaped the modern world” ( Scientific American ). Thermodynamics—the branch of physics that deals with energy and entropy—governs everything from the behavior of living cells to the black hole at the center of our galaxy. Not only that, but thermodynamics explains why we must eat and breathe, how lights turn on, the limits of computing, and how the universe will end.The brilliant people who decoded its laws came from every branch of the sciences; they were engineers, physicists, chemists, biologists, cosmologists, and mathematicians. From French military engineer and physicist Sadi Carnot to Lord Kelvin, James Joule, Albert Einstein, Emmy Noether, Alan Turing, and Stephen Hawking, author Paul Sen introduces us to all of the players who passed the baton of scientific progress through time and across nations. Incredibly driven and idealistic, these brave pioneers performed groundbreaking work often in the face of torment and tragedy. Their discoveries helped create the modern world and transformed every branch of science, from biology to cosmology.“Elegantly written and engaging” ( Financial Times ), Einstein’s Fridge brings to life one of the most important scientific revolutions of all time and captures the thrill of discovery and the power of scientific progress to shape the course of history.",
  "genres": [
    "Science",
    "Nonfiction",
    "Physics",
    "History",
    "Audiobook",
    "Technology",
    "Popular Science"
  ],
  "author": "Paul Sen",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/54303112-einstein-s-fridge"
}