{
  "title": "The Pig War: Standoff at Griffin Bay",
  "description": "On July 27, 1859, U.S. Army Capt. George E. Pickett's Company D, 9th Infantry had arrived on San Juan Island with a mission to protect United States citizens from the British government on Vancouver Island. The reason? An American settler had shot a pig belonging to the Hudson's Bay Company. Everyone overreacted, particularly U.S. Department of Oregon commander, Brigadier General William S. Harney, who had issued Pickett his orders. Thus began the \"San Juan Imbroglio\" of 1859, better known today as the \"Pig War.\" The Pig War: Standoff at Griffin Bay explores how this incident nearly touched off a war between Great Britain and United States Obviously, more was involved than just a dead pig. For nearly 50 years, the two nations had been contending over the international boundary in the Oregon Country, a vast expanse of land consisting of the present states of Washington, Oregon and Idaho, portions of Montana and Wyoming and the province of British Columbia. The Oregon Treaty of 1846 had given the United States undisputed possession of the Pacific Northwest south of the 49th parallel, extending the boundary to the \"middle of the channel which separates the continent from Vancouver's Island; and thence southerly through the middle of said channel and of Fuca's straits to the Pacific Ocean.\" But while the treaty settled the larger boundary question, it created additional problems because its wording left unclear who owned San Juan Island. As Mr. Vouri points out, the difficulty arose over treaty language that referred to the boundary as the \"middle of the channel.\" There were actually two channels, Haro Strait nearest Vancouver Island, and Rosario Strait, nearer the mainland. San Juan island lies between the two. Britain insisted on the Rosario Strait; the U.S., Haro Strait. Thus, both sides claimed San Juan Island. To solidify the British claim, the Hudson's Bay Company occupied the southern end of San Juan, first with a salmon-salting station in 1850, followed by a sheep ranch -- Bellevue Farm -- three years later. The Americans, meanwhile, declared the island within the limits of first Oregon (1848) then Washington Territory (1853). By 1859, about 18 Americans had settled on San Juan Island in anticipation of official American possession. The British did not recognize their rights. The U.S. did. Neither group acknowledged the jurisdiction or taxing authority of the other. Tempers grew short. And Charles Griffins black Berkshire boar wandered into Lyman Cutlar's potato patch. Soon 500 soldiers would occupy San Juan, their presence monitored and threatened by three warships of the Royal Navy. It would require 12 years and binding arbitration before the issue was settled. Mr. Vouri utilizes official documents, newspaper accounts, letters and period photographs to spin his yarn about one of the most intriguing footnotes in North American history.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "American History",
    "Canada",
    "19th Century"
  ],
  "author": "Michael Vouri",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/1263951.The_Pig_War"
}