{
  "title": "Bootleg Stardust",
  "description": "Daisy Jones & the Six meets Nick Hornby in this uplit debut novel about a young musician who auditions for a band and is suddenly catapulted into the wild world of rock and roll stardom, where nothing is quite what it seems.Sometimes you have to hit rock bottom on your way to the top.It’s 1974. The music world is rocking with bellbottoms, platform shoes, and lots and lots of drugs. This year’s sensation is an American band called Downtown Exit and their latest album has just gone gold.For high school dropout Levi Jaxon, things aren’t so great. After bouncing around foster homes for years, he’s living in his best friend’s basement. His dream is to someday be a rock star, but he has a problem—his own band has just broken up.In an uncanny stroke of luck, Levi lands an audition for Downtown Exit, who are now recording their second album at Abbey Road Studios. He arrives in London and aces his audition, only to learn he’s not really in the band. No, Levi’s job is to sit in the wings and cover for the band’s real guitarist when he inevitably starts tripping on stage.Levi sticks with it, hoping to step into the role he’s always dreamed of. But he must first navigate egos, jealousies, and deceptions. Frankie, the band’s front man, has it out for him. And Levi has fallen for Ariadne, the band’s photographer. All of them have their secrets, Levi included. And as the band tours through Europe and struggles to finish their new album, Levi comes face to face with unanswered questions from his past and the impossible price that fame demands.Utterly magical and transporting, Bootleg Stardust is a one-of-a-kind joyride about the power of music to bring people together—and break them apart—and the courage it takes to find your own voice.",
  "genres": [
    "Historical Fiction",
    "Music",
    "Adult Fiction",
    "Fiction",
    "Book Club"
  ],
  "author": "Glenn Dixon",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/54304082-bootleg-stardust"
}