{
  "title": "The Barbizon: The Hotel That Set Women Free",
  "description": "From award-winning author Paulina Bren comes the remarkable history of New York’s most famous residential hotel and the women who stayed there, including Grace Kelly, Sylvia Plath, and Joan Didion.Welcome to New York’s legendary hotel for women, the Barbizon. Liberated after WWI from home and hearth, women flocked to New York City during the Roaring Twenties. But even as women’s residential hotels became the fashion, the Barbizon stood out; it was designed for young women with artistic aspirations, and included soaring art studios and soundproofed practice rooms. More importantly still, with no men allowed beyond the lobby, the Barbizon signaled respectability, a place where a young woman of a certain class could feel at home.  But as the stock market crashed and the Great Depression set in, the clientele changed, though women’s ambitions did not; the Barbizon Hotel became the go-to destination for any young American woman with a dream to be something more. While Sylvia Plath most famously fictionalized her time there in The Bell Jar, the Barbizon was also where Titanic survivor Molly Brown sang her last aria; where Grace Kelly danced topless in the hallways; where Joan Didion got her first taste of Manhattan; and where both Ali MacGraw and Jaclyn Smith found their calling as actresses. Students of the prestigious Katharine Gibbs Secretarial School had three floors to themselves, Eileen Ford used the hotel as a guest house for her youngest models, and Mademoiselle magazine boarded its summer interns there, including a young designer named Betsey Johnson.  The first ever history of this extraordinary hotel, and of the women who arrived in New York City alone from “elsewhere” with a suitcase and a dream, The Barbizon offers readers a multilayered history of New York City in the 20th century, and of the generations of American women torn between their desire for independence and their looming social expiration date. By providing women a room of their own, the Barbizon was the hotel that set them free.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Audiobook",
    "New York",
    "Biography",
    "Book Club"
  ],
  "author": "Paulina Bren",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/54304210-the-barbizon"
}