{
  "title": "تعطير الأنام في تعبير المنام",
  "description": "ورد عن النبي محمد صلى الله عليه وسلم عدد من الأحاديث عن الأحلام ومنها: (إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُسْلِمِ تَكْذِبُ وَأَصْدَقُكُمْ رُؤْيَا أَصْدَقُكُمْ حَدِيثًا وَرُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ خَمْسٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ وَالرُّؤْيَا ثَلَاثَةٌ فَرُؤْيَا الصَّالِحَةِ بُشْرَى مِنْ اللَّهِ وَرُؤْيَا تَحْزِينٌ مِنْ الشَّيْطَانِ وَرُؤْيَا مِمَّا يُحَدِّثُ الْمَرْءُ نَفْسَهُ فَإِنْ رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُمْ فَلْيُصَلِّ وَلَا يُحَدِّثْ بِهَا النَّاسَ ,,,). النبي محمد قسم الأحلام إلى ثلاثة أنواع، الرؤيا والحلم وأضغاث الأحلام، فالرؤيا هي مشاهدة النائم أمرا محبوبا، وهي من الله، وقد يراد بها تبشير بخير، أو تحذير من شر، ويجب حمد الله عليها، والحلم هو ما يراه النائم من مكروه، وهو من الشيطان، ويسن أن يتعوذ بالله منه وينفث عن يساره ثلاثاً، وأن لا يحدث به. وأضغاث الأحلام وهي عبارة عن رغبات ومخاوف مكبوتة في العقل الباطن عبد الغني بن إسماعيل بن عبد الغني النابلسي الدمشقي الحنفيولد سنة 1050 هـ الموافق ل 1143 هـ وتوفي سنة 1641 الموافق ل 1731م وهو شاعر شامي وعالم بالدين والأدب ورحالة مكثر من التصنيف. ولد ونشأ وتصوف في دمشق. قضى سبع سنوات من عمره في دراسة كتابات \"التجارب الروحيّة\" لِفُقهاء الصوفية. وقد تعدّدت رحلاته عبر العالم الإسلامي، إلى إسطنبول ولبنان والقدس وفلسطين ومصر والجزيرة العربية وطرابلس وباقي البلاد السورية. استقر في مدينته دمشق وتوفي فيها.مذهبه: حنفي المذهب.طريقته: نقشبندي وقادري الطريقةمؤلفاته:مقتضى الشهادتين.نور الأفئدة في شرح المرشدة.إيضاح المقصود من وحدة الوجود.الحضرة الأنسية في الرحلة القدسية.تعطير الأنام في تعبير المنام.ديوان الدواوين وهو مجموعة شعره.فضائل الشهور والأيام.أسرار الشريعة.التعبير في تفسير الأحلام.منظومة أسماء الله الحسنى.الفتح الرباني والفيض الرحماني.خمرة الحان ورنة الألحان شرح رسالة الشيخ أرسلان.الوجود الحق والخطاب الصدق.ذخائر المواريث في الدلالة على مواضع الحديث.إيضاح الدلالات في سماع الآلات.رائحة الجنة شرح إضاءة الدجنة في عقائد أهل السنة.كتاب رشحات الأقلام شرح كفاية الغلام.تأثر بـ: أبو حنيفة النعمانعبد القادر الجيلانيبهاء الدين النقشبندمحي الدين بن عربيأثر في: عبد الله الهرريالاهتمامات: الفقه، أصول الفقه، أصول الدين، علم الكلام، التفسير، التصوف، الأدب، الشعرسبب الشهرة: نسبه ينتهي إلى الخليفة عمر بن الخطابتعطير الانام في تفسير الاحلامالنابلسي جمع كتابه هذا من كتب جليلة في علم التعبير لأئمة من الأفاضل النحارير:من كتاب الأستاذ الكبير نصر بن أبي سعد بن يعقوب بن إبراهيم الدينوري المعروف بالقادر الذي صنفه للملك القادر باللّه من بني العباس تغمدهم اللّه تعالى برحمته وأسكنهم فسيح جنته ومن كتاب الشيخ الإمام محمد بن أبي بكر محمود بن إبراهيم المعروف بابن الدقاق المقرئ رحمه اللّه تعالى الذي سماه الحكم والغايات في تعبير المنامات ومن كتاب الشيخ أبي علي الحسين بن حسن بن إبراهيم الخليلي الداري رحمه اللّه تعالى الذي سماه المنتخب ومن كتاب الشيخ الإمام العالم العلامة جلال الدين عبد اللّه بن حازم بن سليمان المزني الشافعي رحمه اللّه تعالى الذي سماه كتاب الإشارة في علم العبارة ومن كتاب الشيخ أبي عبد اللّه محمد بن عمر السالمي رحمه اللّه تعالى الذي سماه الإشارة إلى العبارة ومن كتاب الشيخ الإمام العمدة شهاب الدين أبي العباس أحمد بن الشيخ جمال الدين أبي الفرج عبد الرحمن المقدسي الحنبلي رحمه اللّه تعالى الذي سماه البدر المنير في علم التعبير ومن كتاب الشيخ الإمام أبي طاهر برهان الدين إبراهيم ابن يحيى بن غانم المقدسي الحنبلي رحمه اللّه تعالى الذي سماه المعلم على حروف المعجم ومن مختصره المذيل عليه للشيخ الإمام العلامة محب الدين أبي حامد محمد المقدسي الشافعي رحمه اللّه تعالى الذي سماه المحكم في اختصاص المعلم وقد استوفى جميع ما ذكر في هذه الكتب من وجوه التأويل ولم يترك منها إلا الشيء القليل جداً المسمى بالاسم الغريب الغير معروف فلهذا صار كتابه جامعاً لجميع ما في الكتب المذكورة مع اختصار اللفظ وسهولة المتناول منه ولم يزد على ما نقله من هذه الكتب شيئاً إلا بعض علاوات وقعت له وبعض تأويل نبه عليه أنه من كلامه في موضع أو موضعين وباقي الكلام كله محرر من هذه الكتب المذكورة فمن راجعها وجد هذه التأويلات كلها هناك مسطورة حتى جميع ما ذكر في المقدمة ما عدا البحث في رؤيا نبينا محمد صلى اللّه عليه وسلم وكذلك جميع ما ذكره في الخاتمة من تلك الكتب.سعى ابن عربي وابن خلدون إلى تفسير الأحلام وتحليلها",
  "genres": [],
  "author": "عبد الغني النابلسي",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/54326674"
}