{
  "title": "Living From Eternity: Live Out Heaven's Reality As You Walk The Earth",
  "description": "Is God hidden from us?Every Christian is looking for a more real and tangible experience and relationship with Jesus — one that is special, personal, consistent and conversational. It’s a desire that grows and gets more desperate as we trudge through this attention-demanding earthly life.Truth be told, very few really prioritize this desire and see it become reality. Many are satisfied with their conceptual, intellectual relationship. The rest are simply either on the fence about the possibility of such a glorious relationship, or expect it to ‘happen when it happens.’ I was both of the latter.I questioned the possibility of a tangible experience of God, let alone a real-time, experiential relationship with Him, for the greater part of my early Christian life. I was skeptical of those who had it, always questioning their authenticity. All the while harboring an insatiable desire for an experience of my own.This went on until I could no longer bear the idea of not having it. A short and focused journey of seeking quickly led me to a profound realization — the hindrance was staring me in the face all along. It was speaking to me all the while — and I was listening and agreeing. It was in what I was taught to believe — I believed all the impossibilities that hindered me.Why would God not want a real-time, experiential relationship with me? It’s absurd. Of course He does. In fact, He wants to make it happen more than we do? He designed us to be relational beings. It would be highly illogical and counter productive to design us this way and turn His back on us.Why would God hide Himself? It’s ridiculous to think he’s hiding. He’s not hidden. Where are we looking? At what, or who? Some of us have been expecting to see an invisible God with our physical eyes. We’ve believed that we’re physical beings primarily. We’ve been believing everything contrary to God and His desires. All this because we’ve believed the struggles and failures of men in their pursuit of this relationship, and we’ve sculpted our own lives accordingly.Do you want a tangible, experiential relationship with Father God and Jesus? The kind of relationship that Paul and the patriarchs enjoyed — it’s for any who desire it. Remember, God is not partial.The path to such a relationship is really, really simple — ‘smack-myself-in-the-forehead’ simple — like, ‘how-could-I-have-not-seen-this-before’ simple. Seriously! God doesn’t complicate things — we do.In the first section of Living From Eternity, I start at the very foundations of our belief system — where everything begins for us. This is where we understand what went wrong and what the hindrances are. This is where we solidify our resolve to know God personally and intimately.In the second section, we delve into our true identity as sons of God. Understand how we became sons and what it entails. Get this down right and you’re all set to meet your Father face to face.In the last section, I share my journey of how it all began, how I came to visit the Father’s Throne Room and the garden in His Heart. Through personal experiences and testimonies, I describe my first encounter with Jesus during my visit to the Father’s garden, where everything changed for me.Experience how simple God has made life. Experience the power of a life of freedom in the Father.Read it slow… absorb the essence of it. Let it set you free.",
  "genres": [],
  "author": "Kurt daSilva",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/54308980-living-from-eternity"
}