{
  "title": "Accra Noir",
  "description": "Accra joins Lagos, Nairobi, Marrakech, and Addis Ababa in representing the African continent in the Noir Series arena.Akashic Books continues its award-winning series of original noir anthologies, launched in 2004 with Brooklyn Noir. Each book comprises all new stories, each one set in a distinct neighborhood or location within the respective city.Brand-new stories by: Nana Ekua Brew-Hammond, Kwame Dawes, Adjoa Twum, Kofi Blankson Ocansey, Billie Adwoa McTernan, Ernest Kwame Nkrumah Addo, Patrick Smith, Anne Sackey, Gbontwi Anyetei, Nana-Ama Danquah, Ayesha Harruna Attah, Eibhlín Ní Chléirigh, and Anna Bossman.From the introduction by Nana-Ama Danquah:Accra is one of the most well-known cities on the African continent. It’s the capital of Ghana, which in 1957 became the first sub-Saharan (read: black) nation to gain its independence from colonialism. But the city, in all its globalism, predates the nation. Prior to becoming a sovereign land, the area now known as Ghana was the Gold Coast colony. In 1877, when the British took possession of the colony, Accra was installed as its capital. For nearly a century, in addition to being a political and financial center, the city was a major trade hub. People came from Europe and other African nations to trade everything from gold and salt to guns and slaves . . .One thing that people, too easily seduced by the city’s charm and history and beauty, forget about Accra is that it is a major metropolis. Accra is New York; it is Los Angeles; it is Shanghai, Mexico City, Santiago, Caracas, and Cape Town. It is an urban area, with poverty, desperation, and the inevitable result of a marriage between the two: crime . . .The stories that you will read in this collection highlight all things Accra, everything that the city was and is—the remaining vestiges of colonialism, the pride of independence, the nexus of indigenous tribes and other groups from all over the world, the tension between modernity and traditionalism, the symbolism and storytelling both obvious and coded, the moral high ground, the duplicity and deceit, the most basic human failings laid bare alongside fear and love and pain and the corrupting desire to have the very things you are not meant to have.",
  "genres": [
    "Short Stories",
    "Ghana",
    "Fiction",
    "Anthologies",
    "Accra",
    "Noir",
    "African Literature"
  ],
  "author": "Nana-Ama Danquah",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/54326822-accra-noir"
}