{
  "title": "The Final Revival of Opal & Nev",
  "description": "An electrifying novel about the meteoric rise of an iconic interracial rock duo in the 1970s, their sensational breakup, and the dark secrets unearthed when they try to reunite decades later for one last tour. A GOOD MORNING AMERICA BUZZ PICK NAMED A BEST BOOK OF 2021 BY BARACK OBAMA * THE WASHINGTON POST * NPR * ESQUIRE * ENTERTAINMENT WEEKLY * GOODREADS * THE MILLIONS * READER’S DIGEST * PHILADELPHIA INQUIRER * EERIE READER * PUBLIC RADIO TULSA * CHICAGO PUBLIC LIBRARY * KIRKUS REVIEWS “Feels truer and more mesmerizing than some true stories. It’s a packed time capsule that doubles as a stick of dynamite.” —\nTHE NEW YORK TIMES BOOK REVIEW\nOpal is a fiercely independent young woman pushing against the grain in her style and attitude, Afro-punk before that term existed. Coming of age in Detroit, she can’t imagine settling for a 9-to-5 job—despite her unusual looks, Opal believes she can be a star. So when the aspiring British singer/songwriter Neville Charles discovers her at a bar’s amateur night, she takes him up on his offer to make rock music together for the fledgling Rivington Records. In early seventies New York City, just as she’s finding her niche as part of a flamboyant and funky creative scene, a rival band signed to her label brandishes a Confederate flag at a promotional concert. Opal’s bold protest and the violence that ensues set off a chain of events that will not only change the lives of those she loves, but also be a deadly reminder that repercussions are always harsher for women, especially black women, who dare to speak their truth. Decades later, as Opal considers a 2016 reunion with Nev, music journalist S. Sunny Shelton seizes the chance to curate an oral history about her idols. Sunny thought she knew most of the stories leading up to the cult duo’s most politicized chapter. But as her interviews dig deeper, a nasty new allegation from an unexpected source threatens to blow up everything. Provocative and chilling, The Final Revival of Opal & Nev features a backup chorus of unforgettable voices, a heroine the likes of which we’ve not seen in storytelling, and a daring structure, and introduces a bold new voice in contemporary fiction.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Music",
    "Audiobook",
    "Historical",
    "Contemporary",
    "Book Club"
  ],
  "author": "Dawnie Walton",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/54310698-the-final-revival-of-opal-nev"
}