{
  "title": "Remaking Martin",
  "description": "A dramatic and thrilling Sci-Fi about cloning a genius scientist and a Hollywood star, who later discover themselves through their replacements—A story involving philosophical and psychological arguments and debates. (See excerpts below)Professor Martin Finch supervises a $2 billion energy project. When his life is put at risk because of a health problem, his company proposes a radical solution to ensure the project's future. In a top-secret genetics institute, Martin will be cloned and his memory transferred to his clone Martin2 who will replace him. Martin2 will then finish the project and also take care of Martin’s family.During the final stage of the cloning process, Martin must spend time with his clone, testing Martin2 to determine if he is a perfect copy. Martin’s verdict will determine which one will leave the institute alive—and which one will have to die.While at the institute, Martin befriends another patient, Sarah Joyce, a celebrity Hollywood actress who is also undergoing a cloning procedure. As they walk their strange path together, they become intimate friends and share a secret that will alter the course of their lives.\nEXCERPT 1\n“When we produce your healthy clone, or ‘Martin2,’ we’ll proceed to the confirmation phase,\" said Dr. Spence. \"The only person who can do this is you, as no one else can know you better than you.”Martin didn’t respond.“In short, after the mind transfer, you and Martin2 will spend some time together. You’ll inspect him in detail and decide if he’s a perfect clone of you.”“Then, there will be two of me.”“Only for a short time... as a principle, the Institute cannot accept two versions of the same person going around, for reasons of confidentiality. This means that only one of you can stay ‘active.’ So, after evaluating your clone in the final stage, you’ll have to decide who continues to live.”Martin spoke with difficulty. “...And who dies!”\nEXCERPT 2\nThe two Martins sat silently for a while. Trying to examine each other with curiosity, they avoided eye contact. Martin felt that being confronted by himself created an insane resonance, just like when he watched himself in the mirror for a long time.He remembered his father’s words, “Silence is the hardest thing to listen to.” Probably no silence in the world could be as difficult to bear as the silence between a man and his clone sitting together. What was he thinking about now? Exactly the same things? He knew all his secrets, all his moments of embarrassment, his petty crimes. The moments of lovemaking with his wife were also the other’s memory now. His children were also the other’s children. What he had been doing with Alessandra was now a secret shared by three.“I thought I was better looking,” he said.“Your voice sounds strange,” Martin2 replied with matching disappointment.The being together of two bodies of the same person—one sick and one healthy—revealed something that no living thing possessed in their genetic memory. Martin was experiencing a clash between feeling both envious and blessed. The one sitting across from him was just another opponent in a duel where only one could walk away alive—and also, his only hope to survive.\nEXCERPT 3\n“Let’s have a word with Dr. Spence first. Besides, we have time, up until the last moment, to make the final decision.”“Let’s go see him together, okay?”Their eyes met. While Martin marveled at this close-up of the eyes of a Hollywood star, Sarah drew power from the gaze of one of the smartest men in the world, unaware of the anxiety behind those eyes.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Nezih Unen",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/54307855-remaking-martin"
}