{
  "title": "A Fire Endless",
  "description": "East and West. Humans and Spirits. Breccans and Tamerlaines. The Isle of Cadence has always held itself and its residents in a tenuous balance. But now Bane, the spirit of the North Wind, has pushed everyone and everything in his path off-kilter in a bid to claim dominion over all.In the West, Adaira struggles to adjust to the more brutal, bitter ways of life among the Breccans. Striving to find her place in the clan, she swiftly realizes that it just might be the last role she desires to hold. And while magic blooms effortlessly for the Breccans in the west, the spirits continue to suffer beneath Bane’s harsh power, felt in every gust of wind.In the East, Jack is adrift without Adaira until he sings to the ember-weak fire spirits, acquiring a dangerous mission he never expected. One that is destined to lead him westward. Likewise, Torin and Sidra are consumed by a new mystery as sickness spreads first amongst the crops, and then to the people of the Tamerlaine clan. While Sidra desperately searches for a cure, Torin dares to strike a bargain with the spirits—a precarious folly anytime, but especially now as the days grow darker.With the island falling further out of balance, humans and spirits alike will need to join together to face Bane, and Jack’s gift with the harp will be called upon once more. Yet no one can challenge the North Wind without paying a terrible price, and the sacrifice required this time may be more than Jack, Adaira, Torin, and Sidra can bear to pay.In the stunning conclusion to the Elements of Cadence duology, A Fire Endless finds the delicate balance between the human and faerie realm threatened by Bane, the spirit of the North Wind, whose defeat can only come through fire, song, and heart-rending sacrifice.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fiction",
    "Audiobook",
    "Adult",
    "Romantasy",
    "Magic"
  ],
  "author": "Rebecca   Ross",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/54326657-a-fire-endless"
}