{
  "title": "Duking It Out",
  "description": "Royal dukes from rival countries, shipwrecked on a deserted island. The grudge match of the century—or a love story of super-heroic proportions?Sander Fiala, Duke of Roses, is fourth in line to the South Abarran throne, even though his rogue power earned him the nickname “The Monster of Roses” and got him banished from the Castle. But right before he’s about to set off on his annual birthday sailing trip, the Queen asks him to meet with the notoriously volatile North Abarran Duke of Arles.Tarik Jaso, Duke of Arles, expects the worst from people because—let’s face it—people are the worst. His superpower bombards him with any and all electronic transmissions, which…yeah, people suck. So when he’s attacked and wakes up in the cabin of a stranded boat, he knows he’s royally screwed. Because the man looming over him—the man he’d gone toe-to-toe with right before the attack—is the infamous Monster of Roses.Tarik is positive the Monster is behind his kidnapping. Sander is sure the whole thing is Tarik’s fault. As they work toward rescue, Tarik realizes that the disturbingly hot Sander is no monster, and Sander discovers that Tarik’s temper masks a caring soul wrapped in a cantankerous (though undeniably sexy) body.For their burgeoning connection to endure, they’ll have to duke it out with political factions, dark conspiracies, and centuries of traditions that keep them on opposite sides of the border.But first? They have to get off this damn island.Duking It Out is a 46,000-word M/M enemies to lovers, opposites attract, superhero rom-com, featuring Only One Bed, a grumpy duke who should know better than to jump to conclusions, a self-doubting duke who’s good with his hands (heh), gossipy seagulls, competent assistants, a guaranteed HEA, and (unfortunately) capes.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "Enemies To Lovers",
    "Paranormal",
    "Audiobook",
    "LGBT"
  ],
  "author": "E.J.   Russell",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/54318995-duking-it-out"
}