{
  "title": "Dessa: Spirit Of Vengeance",
  "description": "\"When you’ve lived so long in the darkness, you forget what it’s like to stand in the light.\"A series built with some solid fives, \"Sacrifice, Seduction, Sin, Survival, and Self-discovery\"Fight for the militia? Or for a hidden agenda? Cabil knows Syreene all to well—her motives marked with the stain of vengeance of her murdered parents. But Syreene is bent on learning the craft of elemental-wielding for better or for worse, even though her pyro-dancing human foster brother keeps her under lock and key. How embarrassing, for an elf like herself to bare no earthly arms. It’s bad enough her kind is ridiculed already.The life of a schoolgirl carries little excitement to spark her itch of finding the demon who slayed her biological parents. Cabil insists on letting go of the past, but the fire under the redhead’s furnace burns hot. Even hotter when her older brother comes home one night, unconscious, past town curfew, slung over a mysterious man’s shoulder and plastered with blood. It’s a lot to take in—having to see her high-ranked, on guard brother wounded for the first time, possibly hanging on the brink of death, and the sight of a man that left her stomach sashaying with fluttering butterflies. Déjà vu—the complexity of the moment follows the adolescent to a reckless encounter where she later finds herself kidnapped—a terrible consequence for trying to seek out her brother’s assassin, someone working from the King’s High Council. Her high-end impulsive trait falling in the hands of Cabil’s sworn enemy—smells like a perfect formula for chaos.Not to worry, as long as she doesn’t tell anyone what happened in the dungeon that night, all will be well. Wishful thinking!The story unravels, following the trio through battle, sorcery, adventure, and discovering of family secrets. How will Syreene handle her new persona, and face the man who haunts her dreams?",
  "genres": [
    "Fantasy"
  ],
  "author": "Andreya Lombardi",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/54350002-dessa"
}