{
  "title": "The Better Brain: The New Science of Treating, Anxiety, Depression, ADHD and Other Mental Health Disorders With Nutrition",
  "description": "The surprisingly dramatic role of nutrition in our mental health, and how diet and micronutrients can be used to help treat and prevent anxiety, depression, ADHD and other mental health disorders.‘The Better Brain Diet is the first book that will tell you both how and why nutrients can be used to treat mental-health issues. We are scientists who’ve uncovered that many symptoms of anxiety, depression, ADHD, PTSD, and more are caused by suboptimal nutrition. We’ve been doing research and clinical studies on this crucial topic for decades, yet we have never published our findings for a general audience before. Following our lectures and Julia’s Tedx Talk, we get asked questions all the time about our findings. People want to know more. They’re desperate for answers. This is our solution.’Leading scientists Bonnie Kaplan and Julia Rucklidge have dedicated their careers to researching the role that diet and nutrition play in our mental health. Together, they have published nearly 300 peer-reviewed studies that reveal the healing power of nutrients and the surprising role they play in brain health.In this paradigm-shifting book, Kaplan and Rucklidge share their ground-breaking research for the first time and explain how to feed your brain to stabilise your mood, stave off depression and make yourself more resilient to daily stress. The Better Brain Diet also reveals the hidden causes of the rising rates of depression, from the nutrients in our soil to our reliance on processed food, and explains why a diet rich in fresh fruits, vegetables, pulses, fish and olive oil is healthiest for your brain. Complete with a nutritional plan and at least thirty delicious, mood-boosting recipes, this book will be a complete guide to a healthier, happier brain.",
  "genres": [
    "Health",
    "Nonfiction",
    "Adhd",
    "Psychology",
    "Self Help",
    "Nutrition",
    "Mental Health"
  ],
  "author": "Bonnie Kaplan",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/54345851-the-better-brain"
}