{
  "title": "The Reign of the Beast: a DI Wiggins Adventure",
  "description": "London 1913. Twenty-five years have passed since London shuddered under the visceral rampage of the Ripper. A generation later and the glory of the Victorian age has given way to the brave new Edwardian era of scientific advance and suffrage. Horse-drawn carriages are being replaced by automated motorised saloons. The ever-pervading fog still blankets the City, and its East End remains a cesspool of crime, depravity and poverty. Once again, the great Metropolis finds itself immersed in a homicidal campaign of murder and bestial savagery more evil than Jack himself. The former leader of Sherlock Holmes’ Baker Street Irregulars, Albert Wiggins, now a CID Detective Inspector leads the hunt for the unholy Beast. With Sergeant Jem Pyke, a hardened veteran war hero and prizefighter, they battle not only the savage mania of the Beast but also the cancer that is the sadistic oriental Crime Lord known only as Mr King and the mysterious Russian demon conjurer Luca Radasiliev. Supported by London’s richest and most enigmatic man, the seemingly ageless Dutch leper and scientific visionary, Dante Van Hoon, and the legendary adventurer Doctor John H. Watson, Wiggins is surrounded by a diverse and eclectic cast of characters from London’s grim criminal underworld, facing danger and full-throttle thrills on the way. DI Albert originally one of Sherlock Holmes’ band of Baker Street Irregulars. Walking in his illustrious and inspirational teacher’s footsteps he has risen to the rank of Detective Inspector. A highly intellectual and meticulous individual who embraces modern investigative technology. An analytical brain continually seeking and processing data. DS Leslie ‘Jem’ a decorated hero of the Second Boer War for his part in relieving the besieged mining town of Kimberly. Wiggins’ redoubtable and trusted Detective Sergeant. A partner and a friend. An ex-pugilist who is arguably the toughest and hardest man in all of London. He is a man of the common people, a hardened drinker and has numerous contacts throughout London’s criminal underworld. Dante Van an eccentric and seemingly ageless Dutch leper of unlimited resources. A scientific visionary and practitioner of the arts, botany, philosophy, travel and medicine with a penchant for taxidermy. Has a subservient army of lepers whom he terms his Pestilent. He is one of the richest and most enigmatic individuals in London, his wealth only surpassed by his limitless ego. He ‘assists’ the police on occasion, always for an undisclosed fee, if it furthers his own needs. CID turn a blind eye to his activities of extortion and blackmail in exchange for his unique services. Mr malevolent Chinese underworld gang boss who runs opium houses, prostitution and assassination. A truly evil man who likes inflicting pain and suffering. Has an army of Thugee contract killers. Small, bald-headed with serpentine eyes. His aim, to destabilise the British Government. Luca a sinister Russian Satanist who operates under the cloak of diplomatic immunity. Very little is known of this individual. Has hypnotic powers and practices the dark arts. Doctor John H. Sherlock Holmes' trusted friend and assistant. Keeps a watchful eye on DI Wiggins and his career. Hercules giant Chinese assassin and chief henchman for Mr King. Nearly eight feet tall and speaks very little of any language. Almost childlike of mind but inhumanly strong. Addicted to opium. Magnus Chief Inspector of the MET Police and Wiggins’ boss. Short, terrier-like, hard as nails Scotsman. Very astute and politically connected. Habitually overrides protocols and high-level orders from his seniors.",
  "genres": [],
  "author": "Ian C. Grant",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/54340104-the-reign-of-the-beast"
}