{
  "title": "Along the Way: The Journey of a Father and Son",
  "description": "In this remarkable dual memoir, film legend Martin Sheen and his accomplished actor/director son Emilio Estevez share the stories of their lives while charting a spiritual journey through the Spain of their ancestors.In this remarkable dual memoir, film legend Martin Sheen and accomplished actor/filmmaker Emilio Estevez recount their lives as father and son. In alternating chapters—and in voices that are as eloquent as they are different—they tell stories spanning more than fifty years of family history, and reflect on their journeys into two different kinds of faith.At twenty-one, still a struggling actor living hand to mouth, Martin and his wife, Janet, welcomed their firstborn, Emilio, an experience of profound joy for the young couple, who soon had three more Ramon, Charlie, and Renée. As Martin’s career moved from stage to screen, the family moved from New York City to Malibu, while traveling together to film locations around the world, from Mexico for Catch-22 to Colorado for Badlands to the Philippines for the legendary Apocalypse Now shoot. As the firstborn, Emilio had a special relationship with They often mirrored each other’s passions and sometimes clashed in their differences. After Martin and Emilio traveled together to India for the movie Gandhi, each felt the beginnings of a spiritual awakening that soon led Martin back to his Catholic roots, and eventually led both men to Spain, from where Martin’s father had emigrated to the United States. Along the famed Camino de Santiago pilgrimage path, Emilio directed Martin in their acclaimed film, The Way, bringing three generations of Estevez men together in the region of Spain where Martin’s father was born, and near where Emilio’s own son had moved to marry and live.With vivid, behind-the-scenes anecdotes of this multitalented father’s and son’s work with other notable actors and directors, Along the Way is a striking, stirring, funny story—a family saga that readers will recognize as universal in its rebellions and regrets, aspirations and triumphs. Strikingly candid, searchingly honest, this heartfelt portrait reveals two strong-minded, admirable men of many important roles, perhaps the greatest of which are as fathers and sons.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Travel",
    "Biography Memoir"
  ],
  "author": "Martin Sheen",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/12640989-along-the-way"
}