{
  "title": "Hard Line",
  "description": "A woman dragged into danger…Dr. Samantha Park’s life is shaken when her best friend and research partner dies barely two months into their eight-month stretch at the South Pole. She hasn’t begun to face her loss when men from Cobra International Security arrive to recover sensitive military components from a crashed satellite—and ask her to come with them. As a scientist, she has always been suspicious of the military, and flying across Antarctica in austral winter is more like suicide than a rescue mission. But when she hears what’s at stake, she agrees to help and is forced to put her trust in Thor Isaksen, the tall, broad-shouldered Dane who leads the Cobra team.The only man who can keep her alive…Thor served as an elite soldier in Afghanistan and spent two years as part of a Danish spec-ops unit patrolling sea ice in the Arctic. He’s used to the cold and constant darkness. That’s why he’s been tapped to lead this mission. Under orders to do whatever he must to keep a dangerous weapon from falling into enemy hands, he’s prepared for every scenario—except one. Samantha, with her blue eyes and brilliant mind, takes him by surprise. She’s confident in her abilities as a scientist and yet so unsure of herself as a woman. Stuck at the station with his team until the weather clears, he can’t ignore the growing attraction he feels for her even if she’s the last thing he should be doing on the job.A killer who will destroy them all…As temperatures drop to one hundred below, the heat between Thor and Samantha flares out of control. But a killer is lurking on station, someone with an agenda that threatens not only the lives of every person there, but also global peace. It will take all of Thor’s skill and strength to stop the murderous traitor—and keep himself and the woman he loves alive.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary Romance",
    "Military Fiction",
    "Suspense",
    "Contemporary",
    "Thriller"
  ],
  "author": "Pamela Clare",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/54378661-hard-line"
}