{
  "title": "Suicide Kills: Powerless to Powerful",
  "description": "THERE IS A WAY OUT OF THE DARKNESS!◆ Acclaimed singer/songwriter Klaude Walters has lived an extraordinary life filled with great successes and even greater tragedies. She celebrates all she has learned and the path that has led her here through a visionary collaboration between the written word, poetry, art, and music.◆ Each chapter in her life gives birth to its own song of loss, grief, and, ultimately, triumph. The child of an abusive, alcoholic father, Klaude learned at an early age that pain and neglect were just part of life. She coped with it as best she could, wearing a fake smile and lying to the world about the horrors that went on in her home. As an adult she survived multiple rapes, workplace assaults, and her own suicide attempt. The shocking suicide of her brother threw her into a tailspin, and she descended into darkness so deep she might never have found her way out of it.◆ But the story doesn’t end there. Step-by-step she began to pull herself out of the darkness. She learned how to change her life by changing the way she thought and the way she interacted with herself and the world. She fought through two bouts with cancer, dealt with the breakups of three marriages, and finally found her way to peace, inner strength, and hope. Despite the darkness that she went through her story is a joyous one of survival and triumph in the face of unimaginable loss and adversity.◆ Here she shares what she’s learned and the steps she took. With her words and her music, she encourages all those struggling with depression, mental health issues, and loss to find their own path to healingWhat Readers Say About Suicide Kills:★★★★★ “Gut-wrenching and captivating. Reminded me of A Million Little Pieces, a MUST read.”★★★★★ “I couldn’t put it down. How could anyone go through so much and still see beauty in living. I felt every word.”★★★★★ “Her pain is so raw, so real…it stays with you long after you turn the last page.”★★★★★ “The author doesn’t hold back. Her authenticity shines through every event she describes.”★★★★★ “Life-changing. Made me appreciate my life 100 times more. Filled me with gratitude.”★★★★★ “I love that the book has a list of actionable tools that the reader can use to figure their own problems with. Feels like she shares her way out as much as her way in. Loved it!”★★★★★ “I highly recommend this book to anyone who has lost their hope. This will not only feel like a lifeline, it will show you the way home. It certainly did for me. Bravo!”",
  "genres": [],
  "author": "Klaude Walters",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/54372909-suicide-kills"
}