{
  "title": "The Dark Matters Trilogy",
  "description": "A renegade physicist. A headstrong art curator. When they finally unravel the century-old mystery of dark matter, will it save our world? Or destroy it? Dark Matters is the Winner of 3 Book-of-the-Year Gold Medals in Science Fiction \"Scientific speculation, stunning action, and characters that leap off the page - \" James Rollins, NYT Bestselling AuthorDr. Jonas Hanssen spends his days hunting mineral-rich asteroids for the world's largest corporate conglomerate. But by night, he's on the verge of making one of the universe’s greatest scientific discoveries. It's exactly the lifeline his company needs. Or better yet, the one he needs. Monique Durand uses art to better understand her place in the world, and to help make sense of her increasingly compelling visions. She has the potential to move mountains - in more ways than one. From a life-changing moment in a crowded Singapore marketplace to the business end of an assassin’s gun, they face a power beyond any the world has ever known. To survive, they’ll have to decipher the truth about dark matter, before the trillionaires of the Consortium can achieve their ruinous end game. Can this unlikely duo break the Consortium's stranglehold? Or will they strangle each other first?Take an epic journey to a not-so-distant future. Where wealth, science, and the human spirit get one last chance to determine humanity’s ultimate destiny.˃˃˃ Own the entire series, all three eBooks at one low price!Praise for Dark Matters Foreword Reviews INDIEFAB Gold Medal Winner in Science Fiction, 2015 Independent Publisher's IPPY Gold Medal Winner in Science Fiction, 2016 NextGen Indie Book of the Year Winner in Science Fiction, 2016 \"It's everything I love in a scientific speculation, stunning action, and characters that leap off the page. But best of all, it combines all of the above into a seamless, thrilling story. Don't miss this debut!\" James Rollins, New York Times bestselling author of The Sigma Series \"... nefarious and chilling ... that's what makes it a page-turner.\" FOREWORD REVIEWS \"An interesting premise...not your typical action oriented sci-fi adventure.\" SFFWORLDABOUT THE BOOK Dark Matters is a thought-provoking technothriller, set in a world fully polarized by the rift between the haves and the have-nots. It is a world of extraordinary new technologies–but also one of dwindling natural resources, and an ever-swelling 10 billion-plus human population. Dark Matters offers a unique, entertaining, and (mostly) fictional perspective on the responsibilities of wealth, the potential impact of near-future technologies, and our ultimate place in the universe. Dark Matters is the first book in the Dark Matters trilogy..",
  "genres": [
    "Science Fiction"
  ],
  "author": "Michael  Dow",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/54392745-the-dark-matters-trilogy"
}