{
  "title": "We Are Watching Eliza Bright",
  "description": "Eliza Bright was living the dream as an elite video game coder at Fancy Dog Games when her private life suddenly became public. But is Eliza Bright a brilliant, self-taught coder bravely calling out the toxic masculinity and chauvinism that pervades her workplace and industry? Or, is Eliza Bright a woman who needs to be destroyed to protect \"the sanctity of gaming culture\"? It depends on who you ask...When Eliza reports an incident of workplace harassment that is quickly dismissed, she's forced to take her frustrations to a journalist who blasts her story across the Internet. She's fired and doxed, and becomes a rallying figure for women across America. But she's also enraged the beast that is male gamers on 4Chan and Reddit, whose collective, unreliable voice narrates our story. Soon Eliza is in the cross-hairs of the gaming community, threatened and stalked as they monitor her every move online and across New York City.As the violent power of an angry male collective descends upon everyone in Eliza's life, it becomes increasingly difficult to know who to trust, even when she's eventually taken in and protected by an under-the-radar Collective known as the Sixsterhood. The violence moves from cyberspace to the real world, as a vicious male super-fan known only as The Ghost is determined to exact his revenge on behalf of men everywhere. We watch alongside the Sixsterhood and subreddit incels as this dramatic cat-and-mouse game plays out to reach its violent and inevitable conclusion.This is an extraordinary, unputdownable novel that explores the dark recesses of the Internet and male rage, and the fragile line between the online world and real life. It's a thrilling story of female resilience and survival, packed with a powerful feminist message.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "LGBT",
    "Contemporary",
    "Mystery Thriller",
    "Adult"
  ],
  "author": "A.E. Osworth",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/54360370-we-are-watching-eliza-bright"
}