{
  "title": "The Bright Side Sanctuary for Animals",
  "description": "From the winner of the 2016 Flannery O’Connor Award for Short Fiction comes a “heartwarming and sharp-witted debut” (\nPublishers Weekly\n, starred review) set over one emotionally charged weekend at an animal sanctuary in western Kansas, where maternal, romantic, and community bonds are tested in the wake of an estranged daughter’s homecoming.The Bright Side Sanctuary for Animals is in trouble.It’s late 2016 when Ariel discovers that her mother Mona’s animal sanctuary in Western Kansas has not only been the target of anti-Semitic hate crimes - but that it’s also for sale, due to hidden financial ruin. Ariel, living a new life in progressive Lawrence, and estranged from her mother for six long years, knows she has to return to her childhood home - especially since her own past may have played a role in the attack on the sanctuary. Ariel expects tension, maybe even fury, but she doesn’t anticipate that her first love, a ranch hand named Gideon, will still be working at Bright Side.Back in Lawrence, Ariel’s charming but hapless fiancé, Dex, grows paranoid about her sudden departure. After uncovering Mona’s address, he sets out to confront Ariel, but instead finds her grappling with the life she’s abandoned. Amid the reparations with her mother, it’s clear that Ariel is questioning the meaning of her life in Lawrence, and whether she belongs with Dex or someone else, somewhere else.Acclaimed writer Pam Houston says that “Mandelbaum is wise beyond her years and twice as talented”, and The Bright Side Sanctuary for Animals poignantly explores the unique love and tension between mothers and daughters, and humans and animals alike. “A story of reconciliation and forgiveness (and so many animals)” (Steven Rowley, bestselling author of Lily and the Octopus), Mandelbaum’s debut offers a panoramic view of the meaning of home and reminds us that love provides refuge, and underscores our similarities as human beings, no matter how alone or far apart we may feel.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Animals",
    "Romance",
    "Adult",
    "Chick Lit",
    "Jewish"
  ],
  "author": "Becky Mandelbaum",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/54391394-the-bright-side-sanctuary-for-animals"
}