{
  "title": "Cows Can't Jump",
  "description": "Cows Can't Jump (featuring animal actions) is part of the Cows Can't Series, which includes Cows Can't Quack (animal sounds), Cows Can't Spin Silk (animal creations), Cows Can’t Blow Bubbles (shapes animals make) and Las vacas no pueden saltar (the bilingual Spanish/English edition of Cows Can't Jump). By listening to and reading aloud these fun, educational and engaging picture books, young children will learn the names of dozens of animals — and their actions, sounds, and creations — reinforcing early reading skills and a love of books! The Cows Can't Series is perfect for young listeners and beginning readers ages newborn to six years old. Cows Can't Jump is available in multiple formats: Stubby & Stout™ Board-book (chunky-style format ideal for small hands), Glossy Paperback (for older children), Hardcover (full size format with board-book covers/pages) and Kindle.Cows Can't Jump is featured on the Recommended Children's Books list of the award-winning early literacy organization Parent-Child+ and has received high praise including \"On my list of all-time favorite picture books\", \"Will fast become your child's favorite bedtime story\" and \"A new staple in our daily reading\".The Series is published by Jumping Cow Press, which actively supports literacy programs and partners with a direct-impact foundation to provide tens of thousands of copies of the Series at no cost to Reach Out and Read, Parent-Child Home+, Pajama Program, Read to Grow, Raising a Reader, Kids Need to Read, Get Georgia Reading, Literacy, Inc. (LINC) and Read by 4th, all of which integrate the Cows Can't Series into their early childhood literacy programs.From the Back Cover of Cows Can't Jump: Is it really true that cows can't jump, gorillas can't swim and sloths can't leap? Yes, but discover what these and other animals can do, as they swing, scamper and glide through Cows Can't Jump! In this humorous and inspirational adventure, animals focus on what they do best, comfortably aware they can't do everything, but proud of their own special skills. Vibrantly illustrated, Cows Can't Jump will help helping young readers learn diverse and dynamic words while absorbing a subtle yet powerful message that builds self-esteem and teaches respect and humility. Learn more about the Cows Can't Series at jumpingcowpress.com. Follow Jumping Cow Press on Twitter (@cowscantjump) and Facebook (/jumpingcowpress).",
  "genres": [
    "Picture Books"
  ],
  "author": "Dave Reisman",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/5437935-cows-can-t-jump"
}