{
  "title": "Repeat Offender",
  "description": "Lynnwood Thatcher Windsor has lived a lot of lies. Seen a lot of good men go down.But he will not stand by and watch as the world he’s built from the ground up burns to ashes before his eyes. Even if he has to build an army to combat the problem he sees brewing around him.One step at a time, he carefully lays out his plan, building layer after careful layer until everything is where he wants it to be.Every part is impeccably played, his pawns are in the perfect place, and then she barrels into his life, totally scattering every single piece he’s set in motion.The bad thing is, she doesn’t even realize how badly she’s messed up until she’s roused the beast.***The day that Six Ines Broussard met Lynnwood Thatcher Windsor was the worst day of her life.First, she has a public breakup with a man she’s not even dating. Second, she has to deal with a black-tie event that she’d rather gouge her eyes out than to go to. Third, she then has to sit at a table for hours on end with the one man she despises.Just wanting a break, she thinks she’ll lose herself for a few hours and do what she loves to do best—spend time by herself and go for a walk in the middle of nowhere, spot some birds, and get a little sun. Only, her day doesn’t go nearly as planned.She walks right into the middle of hell. And at the center of it? Lynnwood Thatcher. The mayor. The man that she took one glance at on the night of his inauguration and dismissed as boring. A total stick in the mud.Only, he’s not so boring shirtless, in the middle of nowhere, doing things that are very illegal.At first, she’s appalled. Then her interest gets piqued. Stuck-up suit is hot! And he has tattoos. Oh, and let’s not forget one hell of a mouth on him!Then he goes and kidnaps her, and she realizes that nobody is quite as hot as you thought they were when they’re now holding you hostage.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Romantic Suspense",
    "Audiobook",
    "Suspense",
    "Erotica"
  ],
  "author": "Lani Lynn Vale",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/54381713-repeat-offender"
}