{
  "title": "31 Cents to 43 Countries: Hardcore Tips to Increasing Profits",
  "description": "Need help as an entrepreneur, manager, or business executive? Dina and Don, founders of DEO Entertainment Group, will guide you to optimize your resources, increase profits, and take your business to the next level.31 Cents to 43 Hardcore Tips to Increasing Profits gives managers, entrepreneurial thinkers, and executives a practical guide to optimizing resources, capitalizing on the unknown while finding a work-life balance to increase profits.The reality is that most businesses fail or struggle because of poor resource management, business planning, and the inability to adequately lead problem-solving techniques. By overlooking these building blocks, many potentially successful businesses leave money on the table.31 Cents to 43 Hardcore Tips to Increasing Profits provides tips and tricks to increasing an organization's bottom-line. Dina Preston-Ortiz and Don Ortiz share their unique anecdotes for increasing profits through sheer guts and grit, by being purposeful, and adapting and finding innovative solutions in dynamic environments of constant change.Learn how to manage talent, find excellence, adapt in difficult and controversial situations, do more with less, while keeping clients coming back for more.In this book you will discover tools Making good decisions in atmospheres of uncertaintySuccessfully leading in virtual environments Creating competitive advantages that can't be copiedLeveraging talent and relationships to optimize resourcesFinding the right work and life balanceDina and Don reveal their own personal stories to help you create a unique niche in your own industry market. With proven strategies used across the globe, their simple 3-section framework lays out the details that will help optimize your resources, increase profits, and take your business to the next level.Buy your copy now, it's time to step up the game for your business to thrive.",
  "genres": [],
  "author": "Dina Preston-Ortiz",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/54364478-31-cents-to-43-countries"
}