{
  "title": "King of the Dark",
  "description": "From the author who brought you the award-winning Silk & Steel series comes a new dark MM high fantasy. \"Your love is worthless, it's your hate I need.\" ~Prince Vasili CavilleWhen King Talos Caville surrendered the war to the elves, soldier Nikolas Yazdan vowed never to serve the royals again. He said the same to the prince who tried to buy his loyalty, and learned the Cavilles don’t take no for an answer. Whipped for his insolence, Nikolas is forced into slavery in a palace full of vicious, brutal royals. And Prince Vasili Caville is the worst of all. Malicious and cruel, the prince is more viper than man, and someone inside the palace wants him dead. Nikolas would kill the prince himself if not for one thing: Julian, the prince’s personal guard and Niko’s light in the dark. If Nikolas doesn’t submit to Prince Vasili and discover who is plotting against him, Julian will suffer. But there’s more wrong in the palace than just the prince. The king is on his deathbed, the ferocious elves are creeping closer to the great city of Loreen, and madness stalks the hallways. There’s poison in the Caville court, and if Nikolas doesn’t discover the real reason Prince Vasili tried to buy him with a bag of coin, the palace, the city, and everything he loves, will be lost forever. King of the Dark is the first book in the slow burn, enemies-to-lovers Prince’s Assassin series. A gay Game of Thrones with a hint of Witcher thrown in, there are triggers, including but not limited to: reference to past abuse, attempted rape, dubious consent, reference to incest, torture, drug use and PTSD. High heat sexual content. The Prince’s Assassin is for 18+ only. \nReading order:King of the DarkReign of DarknessCurse of the Dark PrinceThe Cottage (novella)",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "Enemies To Lovers",
    "LGBT",
    "Dark",
    "Magic"
  ],
  "author": "Ariana Nash",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/54359996-king-of-the-dark"
}