{
  "title": "Searcher",
  "description": "From the Number One Best Selling Author Saxon Andrew comes the fifth book in the Best Selling Annihilation Series, “Searcher”. Searcher is a number one bestseller at Amazon kindle's Science Fiction Series and the price has been lowered for the holidays.  The Captor’s have departed to their new home but have left a warning about a looming attack from a species that is known as universe killers. The Eight Legs were more than two hundred million years old and they invade universes to kill and harvest all intelligent life. They had come eight million years ago and harvested the Stars Realm’s universe but the Captors warn that the creation of their new home would lead to them moving up their time table for invasion. The Eight Legs would know that only a highly advanced life form could cause the creation of a new universe.  These green creatures invade with ships as large as medium sized planets and their numbers are in the billions. No intelligent life has ever survived their attention and the Royal Family senses them coming soon. The Realm has learned the invader’s ships will not appear on any of their sensors and all of the Stars Realm’s weapons will be useless against the unique material used to construct the hulls of their ships.   The Realm appears to be doomed but Cassandra has had a vision of one of her decedents who will lead them against this ruthless enemy. She has seen him and knows that he is a Searcher.  The Annihilation Series continues and the action is non-stop as the Stars Realm fights to survive against a species that has never known defeat.  Excerpt from “Searcher”  “The front mass has just arrived, General.” “Hold out, Captain. Use your links to fire your cannons.” The two hundred and fifty warriors in each group released their grips on their shoulder mounted auto cannons and allowed their armor’s computer to take over firing. They pulled their long swords and hand guns and waited as the enormous green mass moved closer and closer. The two lines of warriors had fifty yards between their lines but they began slowly giving ground as the green horde pressured them until the two groups were literally back to back. The front of their lines looked on fire with the massive numbers of hornets, beams, and projectiles leaving their armor. They used their hand guns to shoot individuals that broke from the mass of Eight Legs but their numbers were growing and they pushed closer and closer to the five hundred Red Warriors. Then the on rushing green mass of Eight Legs hit their lines and the killing got close and personal.  Brez swung his sword and cut off a spider’s head then turned and jammed the eight foot blade directly into the fangs of another spider leaping at him from behind. He ripped the sword out and slashed at a spider leaping at the back of the warrior beside him and then ducked as a spider passed over his head and hit another warrior in the back taking him down to the pavement while biting through his armor. The spider died as a Red Warrior cut it in half with a sword slash. Brez’s auto cannon turned and fired six rounds into a spider leaping at his head and then shot two more spiders that had hit warriors beside him. The killing was happening almost faster than Brez could follow. Brez saw a four foot circle around Juck as the small Cainth walked through the green mass swinging the four swords faster than eyes could follow. Suddenly, Brez was hit and fell to the ground with a spider thrusting its fangs at his neck  Searcher is a full length novel 120,044 words in length by Saxon Andrew publishing",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Amazon"
  ],
  "author": "Saxon Andrew",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/12641916-searcher"
}