{
  "title": "Hot Winter Sun",
  "description": "Against the turbulent backdrop of the English Civil War, where political treachery and religious persecution are commonplace, an unlikely romance springs up between Catherine Trefelner, a strikingly beautiful village girl, and Robert Bradshaw, co-heir to one of Cornwall's richest estates. Staunch Royalists, Robert and his twin brother Julian are loyal to the clever, but misguided King Charles, while Catherine's father is a fanatical Puritan, living for the day the Parliamentarian Army unseats the King, and makes Royalist families conform or seek refuge in France.After eloping, the couple return to Briarwood, where Catherine is suddenly transformed from the overworked daughter of a blacksmith to Lady of the Manor. Family members react differently to what is considered an unsuitable match, but Robert, deeply in love with his new wife, knows Catherine will only work a credit to their household. For reasons known only to them, intense animosity exists between Julian and Catherine, yet her remarkable personality and unusual mind work in her favor as she settles into the household. She bonds with the twin's father in a unique and unexpected way, has an amicable relationship with her sister-in-law, and even attempts to charm away the resentment of another family member whom she desperately wants to understand.Ever cynical, Julian continues to question Catherine's motives, but the only true shadow over her happiness is a fear of her father, who has indeed threatened vengeance over her marriage to a Royalist. On the verge of making peace with Julian, Catherine could never envision the tragedy about to strike and Julian’s heinous accusations in its wake. Grief-stricken, she flees England to the family's consternation, only to discover it was a dreadful mistake. In an abrupt and stunning twist of fate, Catherine has no choice but to return to Briarwood and throw herself on Julian's mercy, knowing that he is as unpredictable as she is constant. But is she running back to safety or into even greater danger? Culminating with a shocking answer to what all believed was an unsolvable murder and Catherine's close call as the second victim, Hot Winter Sun is ultimately a tale of love, hate, revenge, envy, mercy and redemption during one of the most chaotic and unstable times in England's history.",
  "genres": [],
  "author": "Jessica  Russell",
  "average_rating": "4.95",
  "url": "https://www.goodreads.com/book/show/54384931-hot-winter-sun"
}