{
  "title": "United We Are Unstoppable",
  "description": "From Asia to Africa, Oceania to Europe, the Americas and Antarctica, see the world through the eyes of 60 young people who are fighting for their homes and their futures in the face of climate change.The stories in this book are devastating, defiant, inspiring and moving - but, above all, they are full of hope. The climate crisis can feel overwhelming but, as this book shows, for every problem there are young voices raising awareness, creating solutions and demanding that things change. It's not too late to save the world. United we really are unstoppable.Aditya Mukarji (16) stopped 26 million straws from polluting the oceans.Cecilia La Rose (15) filed a lawsuit against the Canadian federal government for contributing to global warming.Delphin Kaze (19) founded a company that produces eco-charcoal from organic waste in Burundi.And more inspiring stories from . . . Htet Myet Min Tun; Tatyana Sin; Iman Dorri; Howey Ou; Theresa Rose Sebastian; Nasreen Sayed; Liyana Yamin; Albrecht Arthur N. Arevalo; Akari Tomita; Karel Lisbeth Miranda Mendoza; Emma-Jane Burian; Anya Sastry; Ricardo Andres Pineda Guzman; Cricket Guest; Lia Harel; Shannon Lisa; Khadija Usher; Brandon Nguyen; Vivianne Roc; Octavia Shay Muñoz-Barton; Payton Mitchell; Ashley Torres; Eyal Weintraub; Daniela Torres Perez; Catarina Lorenzo; Juan José Martín-Bravo; João Henrique Alves Cerqueira; Gilberto Cyril Morishaw; Holly Gillibrand; Stamatis Psaroudakis; Lilith Electra Platt; Anna Taylor; Raina Ivanova; Federica Gasbarro; Laura Lock; Agim Mazreku; Adrian Toth; Kaluki Paul Mutuku; Nche Tala; Sebenele Rodney Carval; Jeremy Raguain; Lesein Mathenge Mutunkei; Toiwiya Hassane; Koku Klutse; Tsiry Nantenaina Randrianavelo; Ruby Sampson; Tafadzwa Chando; Elizabeth Wanjiru Wathuti; Ndèye Marie Aida Ndieguene; Zoe Buckley Lennox; Lourdes Faith Auhura Parehuia; Alexander Whitebrook; Komal Narayan; Kailash Cook; Madeleine Keitilani Elceste Lavemai; Freya May Mimosa Brown; and Carlon Zackhras",
  "genres": [
    "Nonfiction"
  ],
  "author": "Akshat Rathi",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/54390249-united-we-are-unstoppable"
}