{
  "title": "Hello, Rogue",
  "description": "SIX NEW NOVELLASSome nights have unforeseen consequences...These six tales explore what happens when rogues are faced with the aftermath of a night of pleasure. Get lost in each story as the ladies approach the gentleman and give them the happy news, or in some cases, the surprise they never expected.When a Rogue Falls by Sasha Cottman: For Sir Stephen Moore, love will never be on the cards. But Cupid is not without a sense of humor. After helping her family deal with a dangerous blackmailer, Lady Bridget Dyson and Sir Stephen celebrate. A little wine and some wicked flirting leads to a night of passion. Bridget now has to break the news of impending fatherhood to a man determined to avoid commitment at all costs.Escaping the Earl by Lauren Smith: Beatrix Lethbridge is desperate to avoid an arranged marriage, and the only way out is to get compromised. The best man for the job is notorious rakehell Richard Savage, the Earl Rivers. But when Beatrix and Richard’s one night of passion has more consequences than simply stopping an unwanted marriage, Richard must win Beatrix’s reluctant heart.This Rogue of Mine by Amanda Mariel: Lady Cordelia Daventry may be a spinster, but she has not given up all hope. When she finds herself alone with the well-known rogue, Nathaniel Lowell, Viscount Wolverton, she embraces her chance to experience desire. Now they must face the consequences of their actions.Loving My Wicked Rogue by Dawn Brower: When Lady Penelope finds herself in a delicate condition, she has a decision to make, and nothing seems quite right. Instead of discerning what she should do on her own, she pays Roman, the Duke of Lindsey a call and unburdens her troubles on him, hoping he will do the gentlemanly thing and take responsibility for the dilemma he helped create.The Trouble with Rogues by Nadine Millard: Ophelia Delacourt has made it her life's mission to teach poor, unsuspecting ladies about the dangers of rogues, rakes, and rapscallions. When one of her protégés faces ruin, Ophelia rushes to her rescue. And right into the path of one such troublesome rogue.Caleb Feldman, Marquess of Guilford is growing bored of his hedonistic lifestyle. Not that he plans to change it any time soon. When he sees a mysterious, dark-haired siren floating through his party, for the first time in a long time, Caleb feels the excitement of the hunt.Their encounter is not what either of them expects. And the life-changing consequences? Even less so. Ophelia will do anything to keep her secret, but that might not be as easy as she hoped. For the trouble with rogues is, sometimes they're just too hard to resist.My Lord, My Rogue by Anna St. Claire: Lady Honora Radcliff was betrothed to the catch of the Season. Too much champagne with a stranger leaves her life in tatters and married to the abusive man. To escape, she fakes her death. Lord Benjamin Crewe accepts a dangerous assignment and discovers the woman he wished he'd married—only she's been \"dead\" three years. His pursuit endangers both their lives.Can Honora and Benjamin survive the danger for a chance at love and happiness?",
  "genres": [
    "Historical",
    "Historical Romance"
  ],
  "author": "Sasha Cottman",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/54359916-hello-rogue"
}