{
  "title": "In This Together: How Republicans, Democrats, Capitalists and Activists Are Uniting to Tackle Climate Change and More",
  "description": "For decades, the dominant narrative for environmental activism has cast crusading citizen heroes against profit-hungry corporate villains in an all-out war to save the earth. The war narrative has basis in fact. But it has triggered a political arms race that has dragged on for a half-century, enriching political strategists while driving the world toward ecological disaster.In This Together is part introduction, part agenda, and part strategy to save the planet from combatants on both the left and the right. Crow and Shireman show how to break the gridlock, unite the parties, and drive radical collaboration to find solutions. Their plan brings together the best ideas of conservatives and progressives, and restores conservation as a bipartisan priority that can preserve our prosperity and help reclaim our divided democracy.“Read this to be upset, confused, conflicted, excited and maybe even hopeful. Collaborating we can achieve amazing progress. Fighting we all lose.” —Joan Blades, Living Room Conversations on Energy and Climate; co-founder, MoveOn.org“There’s no reason why economic and environmental interests need to be at war. Both Shireman and Crow have done a tremendous amount to show exactly why and how what’s good for the planet is also good for the economy.” —Eli Lehrer, President, R Street InstituteTrammell S. Crow is a self-proclaimed pro-environment Republican, real estate investor, and the founder of EarthX, the nonprofit that sponsors the world’s largest and most inclusive environmental conference and exhibition, dedicated to uniting conservatives, progressives, capitalists, and activists across all divides to save the planet.Bill Shireman teaches leadership and problem-solving at UC Berkeley Haas School of Business, and practices it as the CEO of Future 500. He and his team have forged breakthrough partnerships between corporate leaders and grassroots activists including Greenpeace, Rainforest Action Network, ExxonMobil, Coca-Cola, Disney and others, to protect oceans, forests, and climate.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Trammell S. Crow",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/54375881-in-this-together"
}