{
  "title": "Letters Across the Sea",
  "description": "Inspired by a little-known chapter of World War II history, a young Protestant girl and her Jewish neighbour are caught up in the terrible wave of hate sweeping the globe on the eve of war in this powerful love story that’s perfect for fans of The Guernsey Literary and Potato Peel Pie Society .If you’re reading this letter, that means I’m dead. I had obviously hoped to see you again, to explain in person, but fate had other plans.1933At eighteen years old, Molly Ryan dreams of becoming a journalist, but instead she spends her days working any job she can to help her family through the Depression crippling her city. The one bright spot in her life is watching baseball with her best friend, Hannah Dreyfus, and sneaking glances at Hannah’s handsome older brother, Max.But as the summer unfolds, more and more of Hitler’s hateful ideas cross the sea and “Swastika Clubs” and “No Jews Allowed” signs spring up around Toronto, a city already simmering with mass unemployment, protests, and unrest. When tensions between the Irish and Jewish communities erupt in a riot one smouldering day in August, Molly and Max are caught in the middle, with devastating consequences for both their families.1939Six years later, the Depression has eased and Molly is a reporter at her local paper. But a new war is on the horizon, putting everyone she cares about most in peril. As letters trickle in from overseas, Molly is forced to confront what happened all those years ago, but is it too late to make things right?From the desperate streets of Toronto to the embattled shores of Hong Kong, Letters Across the Sea is a poignant novel about the enduring power of love to cross dangerous divides even in the darkest of times—from the #1 bestselling author of The Forgotten Home Child .",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Canada",
    "Historical",
    "World War II",
    "War",
    "Romance"
  ],
  "author": "Genevieve Graham",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/54396860-letters-across-the-sea"
}