{
  "title": "Billionaire Unexpected~Jax",
  "description": "I never expected the man I saw as nothing but a billionaire player to be the only person who could rescue me from near insanity.One moment, everything was perfect.I was finally Dr. Harlow Lewis, research geoscientist, and I was actually employed at Montgomery Mining Laboratories, the crème de la crème of labs for my specialty. I also had good friends, a supportive parent, and a budding relationship with a great guy. Add all of those things together and it was impossible for my existence to be anything less than ideal. I had exactly the life I’d always wanted, until it...wasn’t.  I guess I never realized that brief periods of perfection could instantly be followed by a nine day, horrific hostage situation that would forever change the woman I’d been before that incident.Oddly, after my release, the only person who knew that I was struggling to get my life back was Jaxton Montgomery, my billionaire boss, and the king of one-nighters . Not exactly the perfect confidante, right? The two of us barely spoke unless it was company business, especially after I’d turned down a date with him two years earlier. What rational female would want to have dinner with a man who was known for his one-and-done dating behavior?Maybe Jax wasn’t the guy I would have chosen to be the person who would drag me out of the darkness and back into life again, but he was the only one stubborn enough to do it. He systematically broke down all of defenses until I reached out and clung to him like he was the only lifeline I had. It wasn’t until I got to know him that I realized that Jax was so much more than the playboy he was portrayed to be in the gossip columns.  He was patient, he didn’t judge, and he had a wicked sense of humor. Even stranger, he understood what I was going through, even when I didn’t understand it myself. Unfortunately, he was also the hottest guy I’d ever met, and as our bizarre friends-but-not-really-friends relationship continued, it was getting harder and harder to fight the intense chemistry between the two of us. What happens when a guy you thoroughly disliked just a few months ago suddenly becomes your everything? Jax had helped me claw my way back into my life, but was I brave enough to risk everything all over again to keep the one man I’d always wanted but could never have?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Billionaire Romance"
  ],
  "author": "J.S. Scott",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/54417665-billionaire-unexpected-jax"
}