{
  "title": "Delirium of the Brave",
  "description": "Savannah, 1864. Confederate Captain Patrick Driscoll and his dear friend and manservant Shadrack \"Shad\" Bryan leave their tearful families to help fight for the Southern cause. They are to set up fort at Raccoon Island off Georgia's coast in a last-ditch effort to save their beloved city from Union attack. But only days into their assignment, the two men die in each other's arms in a Yankee bombardment. Though the men are gone, their legacy will live on-as will the legend of the priceless Driscoll family treasure the two men have buried on Raccoon Island.Four generations after the Civil War, many Confederate families still remain in Savannah, struggling through the twentieth-century in a South rife with hardball politics, personal vendettas and the hangover of war.John-Morgan Hartman, son of a newspaper man and great-great grandson of Captain Patrick Driscoll, goes to serve his country in Vietnam, unaware of the physical and psychological wounds that will befall him...Tony O'Boyle is an ambitious young politician who will stop at nothing and spare no one to get ahead-but his family's dark past will come back to haunt him...Lloyd Bryan, descended from slaves, is determined to succeed where his ancestors didn't. But his celebrity as a professional football player immerses him in a world of temptation that ultimately turns him toward religion...Charlotte Drayton, a successful television reporter, has always used her beauty to get her way-but the one man she can't have is the only one she wants...After many years, four friends will meet on the very island where the two confederate soldiers died in each other's arms. To find where they buried Driscoll's treasure-and to uncover the dangerous secrets of a prominent Savannah family.A gripping novel of history, intrigue, war, and love, Delirium of the Brave follows four generations of families contemplating the pain of the past and the promise of the future. Get swept away by this glorious saga rich with the sights, sounds, flavors, and people of the South's most stunning locale.",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical",
    "Historical Fiction"
  ],
  "author": "William C.  Harris Jr.",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1264274.Delirium_of_the_Brave"
}