{
  "title": "Caul Baby",
  "description": "New York Times bestselling author Morgan Jerkins makes her fiction debut with this electrifying novel, for fans of Ta-Nehisi Coates and Jacqueline Woodson, that brings to life one powerful and enigmatic family in a tale rife with secrets, betrayal, intrigue, and magic.Laila desperately wants to become a mother, but each of her previous pregnancies has ended in heartbreak. This time has to be different, so she turns to the Melancons, an old and powerful Harlem family known for their caul, a precious layer of skin that is the secret source of their healing power.When a deal for Laila to acquire a piece of caul falls through, she is heartbroken, but when the child is stillborn, she is overcome with grief and rage. What she doesn’t know is that a baby will soon be delivered in her family—by her niece, Amara, an ambitious college student—and delivered to the Melancons to raise as one of their own. Hallow is special: she’s born with a caul, and their matriarch, Maman, predicts the girl will restore the family’s prosperity.Growing up, Hallow feels that something in her life is not right. Did Josephine, the woman she calls mother, really bring her into the world? Why does her cousin Helena get to go to school and roam the streets of New York freely while she’s confined to the family’s decrepit brownstone?As the Melancons’ thirst to maintain their status grows, Amara, now a successful lawyer running for district attorney, looks for a way to avenge her longstanding grudge against the family. When mother and daughter cross paths, Hallow will be forced to decide where she truly belongs.   Engrossing, unique, and page-turning, Caul Baby illuminates the search for familial connection, the enduring power of tradition, and the dark corners of the human heart.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Fantasy",
    "Literary Fiction",
    "Contemporary",
    "Audiobook",
    "African American"
  ],
  "author": "Morgan Jerkins",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/54427099-caul-baby"
}