{
  "title": "The Rhino Crash",
  "description": "“Here is a book about a young man finding himself in the wilds of Africa, without any previous experience but with a healthy dose of the spirit of adventure many seek but fail to find. Newman excelled at monitoring black rhinos, and made a real difference to the conservation of this critically endangered species. But the challenges of the bush seem simple to deal with compared to those of self-discovery.” - Dr Jacques Flamand, Project Black Rhino Range Expansion Project, WWF-SA“A brilliant read and a great insight into the trials and tribulations of a black rhino monitor - thank you for telling our story.” - Simon Morgan, Wildlife ACTCatapulted into the grim world of rhino poaching, Nick Newman trades life in London for a humble, yet adventurous existence in South Africa. Tasked to monitor and protect critically endangered black rhinos, Nick soon cultivates an understanding of the different individual personalities and their temperamental behaviour by studying the animals in their natural environment. Under constant threat of being poached for their horns, the rhinos become the pivot around which Nick and the Anti-Poaching Unit’s lives revolve. Nick shares raw moments of heartbreak and hope from the frontline, while taking the reader on an honest and humorous trip of his years spent in Africa. Dynamic characters who form part of his stories include his sidekick rhino-tracking dog, Wilma, and a black rhino named Elmore who would become an integral part of his life.Towards the end of his time in South Africa, mounting pressure catches up with Nick and he soon finds himself in a care facility in Spain where he is forced to go on a journey of self-discovery to confront his mental health. It is also here where he learns to understand his affinity to the rhinos which he had come to love more than life itself.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Animals"
  ],
  "author": "Nick Newman",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/54435883-the-rhino-crash"
}