{
  "title": "Once Upon a Twelfth Night",
  "description": "The honor of your presence is requested by The Earl and Countess of Stapleton at their house party to celebrate Twelfth Night, the most enchanting night of the year.Festivities include:• A titillating masked ball• Ice skating• A romp in the local village• A naughty treasure hunt• Midnight kisses in the garden• And the Twelfth Night Ball where holiday magic brings about seven perfect matches …A Twelfth Night Wager by Christina Alexandra… After spending half her life in service, lady’s companion Adelaide Shipley longs for a modest life of her own making. But a midnight wager with Win Maddox has her dreaming of more. Losing to the silver-tongued barrister would cost her everything, but winning could lead to her dreams coming true forever.Ruination of a Rogue by Clair Brett… Will Lord Zander Milford find rumination an acceptable outcome if only at the hands of Miss Maria Lightowler?It Was Only a Kiss by Sofie Darling… Snow falling, the Twelfth Night Ball, a stolen kiss—but no one would’ve expected bespectacled spinster Violet Hotchkiss to be the one stealing a kiss from Bumpstead Hollow’s most eligible bachelor, Will Sinclair. And now that she’s had a taste of passion, she refuses to settle for a life without romance, adventure…or Will.Christmas Chase by A.S. Fenichel… Sarah Sommers has a plan—find the father who abandoned her and live happily ever after as his beloved daughter. Not even the handsome Lord Monty Witmore with his determination to deliver her to yet another guardian will stop her. Her heart, however, has other ideas about where the chase will end… Twelve Nights of Ruin by Carrie Lomax… Holly Mayweather was the delight of London society—until her reputation was tarnished by a shocking scandal. Can the spirited beauty find happiness with William Sharp, a stoic former soldier? Or will their wedding vows end with “I don’t”?What If I Still Love You by Erica Taylor… After a failed elopement ten years earlier, Henry, Earl of Eddington, and Anna, the widowed Viscountess Newcroft, are reunited at his aunt’s Twelfth Night party. As they search the castle for a box of letters left to Henry by his late father, can this star-crossed pair find their way back to each other? Or will fate intervene, again, and separate them for good?Three Kisses Before Christmas by Tanya Wilde… Wolfstan Robert Ward, the Earl of Wicke and Selborne, lost his head for his best friend’s sister the day he saved her from a frightful bully in their youth. There is just one problem. Rebecca is in love with another man—his cousin. Winning her would take every trick in the book, but what is Christmas if not a time for miracles?",
  "genres": [
    "Christmas",
    "Anthologies",
    "Historical Romance",
    "Holiday",
    "Romance",
    "Historical Fiction",
    "Regency"
  ],
  "author": "Christina  Alexandra",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/54444387-once-upon-a-twelfth-night"
}