{
  "title": "Hopeless Romantic",
  "description": "A funny and delightful story from the New York Times bestselling author of the St. Helena Vineyard series that fans of Avery Flynn, Kristan Higgins, and Helena Hunting will love.Set against the breezy backdrop of coastal Rhode Island, bestselling author Marina Adair’s latest novel asks whether two of a small town’s biggest hearts can learn to put themselves first—in the name of love. . .A funny and delightful story from the New York Times bestselling author of the St. Helena Vineyard series that fans of Avery Flynn, Kristan Higgins, and Helena Hunting will love.Set against the breezy backdrop of coastal Rhode Island, bestselling author Marina Adair’s latest novel asks whether two of a small town’s biggest hearts can learn to put themselves first—in the name of love. . . As caregiver for her autistic brother, Beckett Hayes knows how meaningful a little extra help can be when life happens. Which is why she runs Consider It Done, a personal concierge service in her small town. Her job also gives her the flexibility to follow her passion, being Rome, Rhode Island's unofficial special needs advocate, training emotional support companions in her spare time. There's not much of that, though, and certainly not enough for serious dating. It's always been family first for Beck. But one unquestionably gorgeous, good-natured man is suddenly a temptation that's getting tougher to resist...Sixteen years ago, Levi Rhodes was ready to sail off into the sunset--literally. But then his father's death and his sister's unexpected pregnancy postponed his sailing scholarship and the adventures he had planned. Running the family marina and bar was the least he could do for his grieving mother. Plus, his niece needed a father-figure. But now that she's in high school and has her bio-dad in her life, Levi's wondering if it's time to get his sea legs under him again...until curvy, caring Beck showed up in his bar, and then in his dreams...A Goodreads Most Anticipated Romance of JanuaryAn Amazon Book Review Highly Anticipated Romantic Comedy & Best of the Month SelectionAn Apple Books Best of the Month Selection",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Contemporary Romance",
    "Chick Lit",
    "Adult",
    "Disability"
  ],
  "author": "Marina Adair",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/54439150-hopeless-romantic"
}