{
  "title": "The Librarian and the Beast",
  "description": "Beni has lived a charmed existence in Dunvar Citadel, but one that is coming quickly to an end. When she loses her position as transcriber in the citadel library to a newcomer, she knows that is only a matter of time before the council will insist that she marry. Although she dreads the idea of being one of many wives to her husband, her more immediate and pressing concern is her replacement—a man who is conspiring with the chancellor to weed out non-essential fiction that distract the women workers within the citadel. In attempt to save the books, Beni herself ends up requiring saving when she falls into a river. Her savior, however, is far beyond anything she ever could have imagined. The Mintar is far from human in appearance and social niceties, he isn’t even particularly friendly, yet he promises to return her safely home. All that is required is a pretense of mating to keep the other males of his clan from courting her. That is certainly no hardship as far as she is concerned, especially not with so much in the village to keep occupied, alien scrolls to explore, and an opportunity to do what she loves. What she doesn’t plan on is falling in love with the stoic male who doesn’t want a mate.Faltz carries the scars on his body and heart from losing his parents as a calf. Females are frightened by his appearance and he doesn’t consider himself worthy of having a mate and family when his parents died saving him. Caring for a lost human is an annoying inconvenience, but he is determined to see it through and get the feisty female home safely...even if that means deceiving his queen and entire clan by pretending a mating with her. When pretense turns into truth, Faltz’s honor is tested when he is forced to face one fact...when she leaves, how would he continue without her?Book contains graphic sex and violence",
  "genres": [
    "Romance",
    "Aliens",
    "Science Fiction",
    "Fantasy",
    "Monsters",
    "Paranormal",
    "Science Fiction Romance"
  ],
  "author": "S.J. Sanders",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/54440273-the-librarian-and-the-beast"
}