{
  "title": "The Lords of Night",
  "description": "J. C. Cervantes's new spin-off from the STORM RUNNER trilogy.Fourteen-year-old Renata Santiago is the most powerful godborn of them all, a bruja with a unique combination of DNA. The Mexica blood from her dad's side gives her the ability to manipulate shadows. Her mom Pacific, a Maya goddess, gifted her a magical rope that controls time, and Ren recently used it to save a few gods from getting stuck forever in 1987. She brought them back to the present, but her BFF Ah Puch, the once fearsome god of death, darkness, and destruction, is now a teenager with no divine powers.Ren is also a girl with ordinary hopes and dreams. She wishes, for example, that her blog about alien sightings would garner more respect. She's always been absolutely convinced that there's a connection between aliens and the Maya civilization. Plenty of online haters feel differently, and they call her a fake, a liar, and a loser.When Ren receives an email about an alien sighting in Kansas, she thinks it may support her theory. She also suspects that the cinco--five renegade godborns--are up to no good. Soon she finds herself embroiled in a quest to prevent the troublemakers from awakening the nine Aztec Lords of Night. Problem is, none of Ren's friends are available to help her hunt down the cinco and the dangerous gods they are resurrecting. Ren has no choice but to team up with two strangers recruited by Ah Puch: Edison, a teen hybrid demon, and Montero, an eleven-year-old Aztec hunter. Succeeding in this quest will prove that Ren is no fake, liar, or loser. But it isn't just another challenge. It could well be an impossible one that leaves Ren questioning her very existence.",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Mythology",
    "Adventure",
    "Fiction",
    "Urban Fantasy",
    "Magic"
  ],
  "author": "J.C. Cervantes",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/54435522-the-lords-of-night"
}