{
  "title": "The Hidden Light of Mexico City",
  "description": "A stunning political thriller from a former CIA officer on the front lines of Mexico’s drug war. Expect characters who leap off the page and a chilling border scenario that could be tomorrow’s headlines. \nAs presidential elections near, Mexico City attorney Eduardo Cortez Castillo discovers evidence of collusion between a powerful government official and Mexico's most dangerous drug cartel. Coded messages . . . A secret website . . . Clever money laundering. The conclusion is terrifying. With deep state help, a ruthless druglord is poised to buy Mexico’s presidency.  As he digs for evidence and violence spills across the US-Mexican border, Eduardo is marked for death by cartel assassins. Instead of abandoning the dangerous investigation, he follows the money trail deep into drug smuggling territory where violence buys loyalty and votes are for sale. The odds are against survival. Back in Mexico City, a woman whose name means Light of Mary faces a painful choice. Wait for Eduardo or join the immigration train? But the cartel is looking for her, too.  * Get your copy today *  This brilliant political thriller takes you on a riveting ride through Mexico's rigid class system and the country's spiraling drug violence, to the harsh realities of the US-Mexican border. Authentic and revealing, much of the action is drawn from the author’s own experiences. \n \"Enthralling political drama\" -- Literary Fiction Review\n\n “Captivating and thrilling” – InDTale Magazine\nLove international thrillers by Nelson DeMille, Andrew Gross, Ken Follett, Lee Child and David Morrell?  Riveted by AMERICAN DIRT or Don Winslow’s cartel and border thrillers set in Mexico? You won't want to miss THE HIDDEN LIGHT OF MEXICO CITY. Author Carmen Amato is a former CIA intelligence officer who uses her own counterdrug and espionage experiences to craft intrigue-filled crime fiction that keeps you guessing until the very end. Amato is a recipient of both the National Intelligence Award and the Career Intelligence Medal. Her award-winning Detective Emilia Cruz police series pits Acapulco’s first female police detective against cartels and corruption.",
  "genres": [
    "Mystery",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Fiction",
    "Contemporary Romance",
    "Crime"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/54463519-the-hidden-light-of-mexico-city"
}