{
  "title": "VALDIMIRE: And the Viking Curse",
  "description": "It all began a long time ago during the worship of the arrival of the full moon when mortals flexibly combated with the supernatural to acquire dominant power, refuting their predestined fate by the gods and deciding their own will. There lived a clan of adventurers and noble savages somewhere in Northern Europe who raided, traded, and worked as mercenaries and multiplied through the act of building new colonies from conquered territories. They were warriors and seafarers, who created routes to the south through the Baltic and Norwegian Seas, and formed independent habitations through their navigating skills. There, amongst these strong and highly resilient men, ruled a more intrepid dynasty of feudal overlords, who were in all rank superior but reigned with the rest of the clan under its control. Their fame spread around, and beyond their European territories, as they were revered as the highest authority, rulers from other different tribes sojourned to pay homage and sought for advice cum support from them. Soon rose a progeny from this linage who, like his ancestors, exhibited an extraordinary wit and took the lead as a trailblazer. A mortal, whose destiny led him far away from his kin and ancestral land. To an unknown habitat where he took great risks, withstanding time's test to restore the lost glory of his Viking forefathers. His name was Valdimire, the son of Leif Erikson, the son of Erik the Red, lord over the Vikings. About the AuthorDarwin Beloat is a gifted healer and retired chiropractor of 40 yrs. He is also a gym rat, loves to exercise, lifting weights, surfing, running and biking.He has frequented toastmasters for twelve years where he worked on his public speaking skills. He likes animals and spends his time feeding the turtles in the pond behind his house. He currently resides in Bethesda Maryland.",
  "genres": [],
  "author": "Darwin Beloat",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54464287-valdimire"
}