{
  "title": "SEPTEMBER NIGHTS: Hunting the Beasts of the American League East",
  "description": "\"Everybody wrote us off at the start of the 2011 season. We have a new bullpen and different faces on the field, but we're still in the hunt heading into the final week of August. Though we're in third place, we're within striking distance of the Yankees and Red Sox. We're almost exactly where the Red Sox were a year ago, and once again the same three teams are duking it out for the division title and A.L. Wild Card. Maybe we're not just hunting the Beasts of the East anymore. Maybe we're one of them.” --James Shields, Tampa Bay Rays pitcher, from the Epilogue Little did Shields know when he and Bill Chastain penned these words in late August 2011 how prophetic they were. After trailing the Red Sox by nine games on September 2, the Rays overtook them on the last day of the regular season to complete the greatest comeback in major league history. It was an unbelievable sequel to the Tampa Bay Rays' storybook 2010 season, when they overtook the Yankees on the last day of the season to win the American League East Division. September Nights is the story of how the 2010 Tampa Bay Rays handled the heat during the most critical part of the season. Tampa Bay entered the last month of the season knowing they had to fight off the “Beasts of the East” – the New York Yankees and Boston Red Sox—to win their second American League East title in three seasons. The tension mounts as the season reaches high gear. Not only is the team striving to win the pennant, they also know they are running out of time. Can this close-knit team accomplish all their goals in the little time they have remaining as teammates? Shields is not only a master on the mound, he is also a master storyteller with a smooth narrative style. Along the way, he offers insights into the Rays, opposing teams, the art of pitching, and what is going through his mind at key moments in the Rays’ stretch run.",
  "genres": [
    "Baseball",
    "Sports"
  ],
  "author": "James Shields Jr.",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/12645163-september-nights"
}