{
  "title": "Enter the Black Oak",
  "description": "WINNER of the 2021 INTERNATIONAL BOOK AWARDS in the category Fiction: RomanceFalling for a man like Jackson Wilder was not something I had planned.He was wild, experienced and savagely beautiful. He was also damaged and dangerous. Our love was a cosmic collision of lust and obsession that left me scorched by exquisite flames of desire and domination.Jack possessed me. He educated me. Loving him was the greatest pleasure I'd ever known... up until the moment I discovered the dark secrets he had been hiding.I could never have imagined that pulling myself out of the agony of betrayal would lead me to reconnect with a former friend, Cameron O'Neill, scion of one of Manhattan's wealthiest and most powerful dynasties, and sworn enemy of Jack.Cameron's craving for me was acute. The relentless force of his devastating masculine beauty and his powerful, controlled virility was dizzying. Desire colored his fierce gaze. I knew it was wrong. Jack would never allow it. I had to do everything within my power to resist him, even when he pulled me down the rabbit hole where I uncovered dark truths about Manhattan's most secret society that led me to the brink of madness...Enter The Black Oak is a thrilling romantic suspense set in Manhattan's high society. It won the International Book Award for 2021 in the category of Fiction-Romance.Enter The Black Oak will take you on a dangerous journey through lust, desire, betrayal and obsession that will leave you breathless by the end and desperate for more.Mature Audience.Enter The Black Oak features a love triangle between the heroine and two highly dominant and damaged men who are also sworn enemies. The novel is an homage to radical female strength and stunning masculine beauty. If depictions of powerful, beautiful, dominant but damaged men are not your thing, this may not be for you!Approximately 134,000 words.",
  "genres": [
    "Dark",
    "Romance",
    "Dark Romance",
    "BDSM",
    "Erotica",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Monique Edenwood",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/54467100-enter-the-black-oak"
}