{
  "title": "أدب الدنيا والدين: البغية العليا في أدب الدين والدنيا‬",
  "description": "أبو الحسن علي بن محمد بن حبيب البصري الماوردي (364 - 450 هـ / 974 - 1058 م)الإمام العلامة، أقضى القضاة أبو الحسن علي بن محمد بن حبيب البصري، الماوردي، الشافعي، صاحب التصانيف.حدث عن: الحسن بن علي الجبلي صاحب أبي خليفة الجمحي. وعن محمد بن عدي المنقري، ومحمد بن معلى، وجعفر بن محمد بن الفضل.حدث عنه: أبو بكر الخطيب، ووثقه، وقال: مات في ربيع الأول سنة خمسين وأربعمائة وقد بلغ ستا وثمانين سنة، وولي القضاء ببلدان شتى، ثم سكن بغداد.قال أبو إسحاق في \" الطبقات \" ومنهم أقضى القضاة الماوردي، تفقه على أبي القاسم الصيمري بالبصرة، وارتحل إلى الشيخ أبي حامد الإسفراييني، ودرس بالبصرة وبغداد سنين، وله مصنفات كثيرة في الفقه والتفسير، وأصول الفقه والأدب، وكان حافظا للمذهب. مات ببغداد.وقال القاضي شمس الدين في \" وفيات الأعيان \" من طالع كتاب \" الحاوي \" له يشهد له بالتبحر ومعرفة المذهب، ولي قضاء بلاد كثيرة، وله تفسير القرآن سماه: \" النكت \" و \" أدب الدنيا والدين \" و \" الأحكام السلطانية \" و \" قانون الوزارة وسياسة الملك \" و \" الإقناع \"، مختصر في المذهب.وقيل: إنه لم يظهر شيئا من تصانيفه في حياته، وجمعها في موضع، فلما دنت وفاته، قال لمن يثق به: الكتب التي في المكان الفلاني كلها تصنيفي، وإنما لم أظهرها لأني لم أجد نية خالصة، فإذا عاينت الموت، ووقعت في النزع، فاجعل يدك في يدي، فإن قبضت عليها وعصرتها، فاعلم أنه لم يقبل مني شيء منها، فاعمد إلى الكتب، وألقها في دجلة وإن بسطت يدي، فاعلم أنها قبلت.قال الرجل: فلما احتضر وضعت يدي في يده، فبسطها، فأظهرت كتبه.قلت: آخر من روى عنه أبو العز بن كادش.قال أبو الفضل بن خيرون: كان رجلا عظيم القدر، متقدما عند السلطان، أحد الأئمة، له التصانيف الحسان في كل فن، بينه وبين القاضي أبي الطيب في الوفاة أحد عشر يوما.وقال أبو عمرو بن الصلاح: هو متهم بالاعتزال وكنت أتأول له، وأعتذر عنه، حتى وجدته يختار في بعض الأوقات أقوالهم، قال في تفسيره: لا يشاء عبادة الأوثان. وقال في: جعلنا لكل نبي عدوا معناه: حكمنا بأنهم أعداء، أو تركناهم على العداوة فلم نمنعهم منها. فتفسيره عظيم الضرر، وكان لا يتظاهر بالانتساب إلى المعتزلة، بل يتكتم، ولكنه لا يوافقهم في خلق القرآن، ويوافقهم في القدر. قال في قوله: إنا كل شيء خلقناه بقدر أي بحكم سابق. وكان لا يرى صحة الرواية بالإجازة.وروى خطيب الموصل، عن ابن بدران الحلواني، عن الماوردي.فإن كتاب أدب الدنيا والدين كتاب مفيد في موضوعه، وهو الأخلاق والفضائل الدينية من الناحية العلمية ... وبعضه في الآداب الاجتماعية، واسمه الذي وضعه له المؤلف في الأصل (كتاب البغية العليا في أدب الدين والدنيا) وقد شاع بين الناس باسم أدب الدين والدنيا.رتب على خمسة أبواب:الأول: في العقل.والثاني: في العلم.والثالث: في أدب الدين.والرابع: في أدب الدنيا.والخامس: في أدب النفس.",
  "genres": [
    "Religion",
    "Islam",
    "Nonfiction",
    "Philosophy",
    "Spirituality"
  ],
  "author": "أبو الحسن علي بن محمد الماوردي",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/54501696"
}