{
  "title": "Lord of Rain",
  "description": "Book 5 in this exciting new world. If you like dragons and egotistical, super-sexy demigods, then this is the series for you.BoltI am the son of a god.Not just any god, but the mighty Zeus.I take after my father in many ways. I am powerful and astute. I can be ruthless when I need to be. You have to be driven and relentless when you run an empire. When thousands of people rely on you for their livelihoods.I’m still all of those things, but since meeting her, I’m broken. A shadow of the man I used to be. I’m angry. Impossible to be around, but I can’t seem to get over it…I can’t get over her.I’m in love with a ghost.Someone I don’t even know. This woman got her claws into me. Wove a magic spell so tightly around me that I am unable to break free. I wish I could hate her. I can’t. Not when my body and soul yearn for her. I know it isn’t real, and yet I can’t help the way I feel. There is no outlet for all of these emotions because the object of my hate, my affection, my love – real or imagined – is dead. Gone! I heard that doppelgangers exist. I never really believed it until Ashley Shaw walked through my door.AshleyIt’s wrong to lie.My parents taught me better than that.I realize this, but I’m desperate. I need this job. How hard can it be to work as a Personal Assistant? I can run errands and take calls. I can send an email and type up a document…slowly…using two fingers. Still, I can do it. So what if I fibbed a little on my resumé? It won’t take me long to get the hang of things, that is if I actually make it through the interview. I’m sure I’ll manage. People generally like me. I’m nice. Polite. I try.When I see him. The man I would sell my soul for…be a PA for. I almost run away. The terms ‘dark, brooding, dangerous, and sexy’ are accurate, and yet they have nothing on him. He’s more…he’s also angry, arrogant, tortured…and beautiful. Up until today, I didn’t realize a man could be beautiful. Particularly one so masculine. Yet, here he is.I’m so nervous I completely hash the interview. It’s for the best because harboring sexual fantasies about your boss is not a good idea. I’m shocked when I get the call telling me I have the job. I remember thinking that there had to be a catch…and I was right. There is!No cheating! Contains hot alpha males and therefore strong sexual themes/language.",
  "genres": [
    "Paranormal",
    "Dragons",
    "Shapeshifters",
    "Paranormal Romance",
    "Fantasy",
    "Romance",
    "Gods"
  ],
  "author": "Charlene Hartnady",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/54492240-lord-of-rain"
}