{
  "title": "Return of the Trickster",
  "description": "The third and final book of the brilliant and captivating Trickster Trilogy, from the bestselling author of the Scotiabank Giller-prize finalist Son of a Trickster and Trickster Drift. The powerful resolution of a story that has already sparked the new CBC-TV series Trickster and inspired the debaters on Canada Reads Jared, teenaged trouble magnet, wakes up in a hospital bed feeling like hell. Not for the first time.Some of the people he loves--the ones who are deaf to the magic that swirls around him--assume he fell off the wagon after a tough year of sobriety. They think that's why movers found him naked, dangerously dehydrated and confused in the basement of his mom's old house in Kitimat. The truth for Jared is so much worse. He finally knows for sure that he has no hope of ever being normal because he really is the son of Wee'git, a Trickster, and he's won the magic lottery--he is the only one of Wee'git's 535 children who is a Trickster too. He is actually in such bad shape because he was forced into mortal combat with his father's sister, Aunt Georgina, a maniacal ogress hungry for his power. In the struggle, he transported her and her posse of shape-shifting coy wolves to another dimension where the coy wolves all died. Now Georgina doesn't only want to turn him into her slave, she wants revenge on his whole family.There's more bad news: the only person in his life who is happy that he's a Trickster is his ex, Sarah. Everyone else he loves is either pissed with him or in danger from the dark forces he's accidentally unleashed in their world. His mother Maggie, a hard-partying, gun-toting, tough-as-nails witch, resents like hell that Jared has taken after his father, but she is also determined that no one is going to hurt her boy. For Maggie it's simple--Kill or be killed, bucko--and soon Jared is at the centre of an all-out war. A horrible place to be for the sweetest Trickster there's ever been, one whose first instinct is not mischief and mind games but to make the world around him a kinder, safer, place.",
  "genres": [
    "Fantasy",
    "Indigenous",
    "Fiction",
    "Canada",
    "Young Adult",
    "Magical Realism",
    "Urban Fantasy"
  ],
  "author": "Eden Robinson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/54500858-return-of-the-trickster"
}