{
  "title": "The Old Way: A Story of the First People",
  "description": "One of our most influential anthropologists reevaluates her long and illustrious career by returning to her roots--and the roots of life as we know it.When Elizabeth Marshall Thomas first arrived in Africa to live among the Kalahari San, or bushmen, it was 1950, she was nineteen years old, and these last surviving hunter-gatherers were living as humans had lived for 15,000 centuries. Thomas wound up writing about their world in a seminal work, The Harmless People (1959). It has never gone out of print.Back then, this was uncharted territory and little was known about our human origins. Today, our beginnings are better understood. And after a lifetime of interest in the bushmen, Thomas has come to see that their lifestyle reveals great, hidden truths about human evolution.As she displayed in her bestseller, The Hidden Life of Dogs, Thomas has a rare gift for giving voice to the voices we don't usually listen to, and helps us see the path that we have taken in our human journey. In The Old Way, she shows how the skills and customs of the hunter-gatherer share much in common with the survival tactics of our animal predecessors. And since it is \"knowledge, not objects, that endure\" over time, Thomas vividly brings us to see how linked we are to our origins in the animal kingdom.The history of mankind that most of us know is only the tip of the iceberg, a brief stint compared to fifteen thousand centuries of life as roving clans that seldom settled down adapted every day to changes in environment and food supply, and lived for the most part like the animal ancestors from which they evolved. Those origins are not so easily abandoned, Thomas suggests, and our wired, documented, and market-driven society has plenty to learn from the Bushmen of the Kalahari about human evolution. As she displayed in The Hidden Life of Dogs, Thomas helps us see the path that we have taken in our human journey. In The Old Way, she shows how the skills and customs of the hunter-gatherer share much in common with the survival tactics of our animal predecessors. And since it is \"knowledge, not objects, that endure\" over time, Thomas brings us to see how linked we are to our origins in the animal kingdom.",
  "genres": [
    "Nonfiction",
    "History",
    "Anthropology",
    "Africa",
    "Science",
    "Archaeology",
    "Namibia"
  ],
  "author": "Elizabeth Marshall Thomas",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/544855.The_Old_Way"
}