{
  "title": "Castle Brides Box Set",
  "description": "Four binge-worthy historical tales. Four spirited women determined to forge their own futures. And the four rogues whose hearts don't stand a chance against them.Dive into the complex and romantic world of Regency Era England. If you enjoy enemies to lovers, opposites attract, and marriage of convenience love stories with a dash of intrigue, a pinch of witty humor, and swoon-worthy romances that keep you up \nway\n past your bedtime, then get your copy of the CASTLE BRIDES BOX SET now! This collection by USA Today Bestselling author Collette Cameron contains over 900 pages of page-turning, captivating high-jinx, brimming with heart-rending emotion and unexpected twists. BONUS: HEART OF A HIGHLANDER, the prequel to Highlander's Hope included!______________________________________________________________________________# 1 The Viscount's Vow – Enhanced Second EditionIan is a vengeful lord. Evangeline is a spirited gypsy lady. Desire and culture collide when a scandal of his making forces them into a marriage neither wants…or do they?# 2 Highlander's Hope – Enhanced Second EditionYvette is a strong-willed heiress. Ewan is a powerful lord with a secret. Tempers and passion explode when he tricks her into marriage for her own safety. A marriage she's as determined to end as he is to honor. #3 The Earl's Enticement – Enhanced Second EditionAdaira Ferguson made a huge mistake. Roark means to make her pay for imprisoning him. Caught between revenge and the dictates of proper society, can they find the happily ever after they never knew they wanted? Heart of a Scot – A Scottish Novella: Prequel to Highlander's HopeGiselle is a lonely widow far from home. Hugh is a Scottish warrior consumed with guilt. How can she possibly allow herself to love the man responsible for her husband's death?",
  "genres": [],
  "author": "Collette Cameron",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/54500549-castle-brides-box-set"
}