{
  "title": "Winners Never Cheat: Even in Difficult Times",
  "description": "Author royalties from this book go to the Huntsman Cancer Foundation \"The way Jon conducts his business and lives his life will not only inspire you to be a better person, citizen, and entrepreneur, it also will give you hope that the good guys don't finish last.\" Glenn Beck, CNN \"Jon Huntsman is a different breed. He believes business is a creative endeavor, similar to a theater production, wherein integrity must be the central character.\" Larry King, CNN \"Jon Huntsman's own life and personal values lend credence to his words. He walks his ethical talk.\" Neil Cavuto, Fox News \"This book could put me out of business. Nobody would be happier about it than me.\" Wayne Reaud, Trial Attorney. The nationwide bestseller--fully updated for today's tough times and worldwide financial crises \"Everyone does it.\" Everyone cheats. Cuts corners. Tells lies. Maybe it was different once. Not today. If you want to succeed in thiseconomic climate, you simply have to make compromises. Right? Wrong. You can succeed at the highest levels, without sacrificing the principles that make life worth living. The proof? You're holding it. Jon M.Huntsman built a $12 billion company from scratch, the old-fashioned with integrity. There were short-term costs and difficult decisions. There were tough times. Times just like today. But ultimately, leading with integrity wasn't just personally right for Huntsman, it also proved to be the best business strategy. In Winners Never Cheat, Huntsman tells you how he did it, and how you can, too. This book is about remembering why you work, and why you were chosen to lead. It's about finding the bravery to act on what you know is right, no matter what you're up against. It's about winning. The right way. Think about the kind of person you want to do business with. Then, be that person--and use this book to get you there.The man who revolutionized the world by giving it the plastic spoon, fork, knife and Styrofoam take-out food container will once again change how you live your life. I can say that because that’s what happened to me after reading Jon Huntsman’s Winners Never Cheat . In today’s world where it increasingly appears that we can’t trust our political or business leaders, this book is an unwavering reminder that traditional values never go out of style and are as essential today as they were forty years ago when Jon Huntsman launched a small chemical business that he grew into the world’s largest privately held chemical corporation. Jon Huntsman doesn’t like to be called a billionaire. He’s uncomfortable with that title. I’m convinced he also doesn’t like being one either because he’s committed to giving away his hard-earned fortune—not after he dies, but during his lifetime. I believe in this book’s message and its messenger. I have never in my life purchased any book by the case, except for this one. I give a copy to my friends who mistakenly believe that business can no longer be done with a look in the eye and a handshake. Many of the problems and much of the pain we’re currently experiencing on Wall Street and Washington could have been avoided if those we trusted with our money and our power lived what’s taught in these pages. If you’re looking for success, read this book. If you’re wondering if you can be successful while staying true to your core principles, read this book. If you’re wondering, like so many are, if capitalism has a bright future, read this book. I have and it’s changed my life. --Glenn BeckGlenn Beck’s newest book, The Christmas Sweater , follows the challenges and growth of a boy who struggles with the choices he has made and the decisions he yet must make. Beck is also the author of the #1 New York Times bestseller, An Inconvenient Book , and The Real America . He is the host of the nationally syndicated radio show The Glenn Beck Program and will also be hosting his own television show on Fox News beginning in 2009.",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership",
    "Self Help",
    "Biography",
    "Personal Development",
    "Management"
  ],
  "author": "Jon M. Huntsman Sr.",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/5449798-winners-never-cheat"
}