{
  "title": "Crossing Ties",
  "description": "In a world where the rules are gray and the Don's word is a law unto itself, only one thing is sacred… family.When Rory O’Malley’s dad goes missing, with only a photograph of him unconscious and covered in blood to clue them in to what happened, he does what he’s always done. He steps up and takes care of things. His quiet competence has been the O’Malleys’ strong backbone for years. He’ll get his father back, and his kidnappers will regret having ever messed with the O’Malley boys.He didn’t expect his bloody brother Patrick to go dragging the Novaks into family business. But Rory might have forgiven that if Misha Novak didn’t smell like his mate. He doesn’t have time for that kind of distraction, no matter how sexy.Misha has always believed work and play go hand in hand. And that’s even more true when he finds his fated mate while on a rescue mission. Rory’s a tough nut to crack. Misha doesn’t want to break him… but he will do whatever it takes to soften him up. Hopefully, saving Rory’s da should do the trick.Rory is chagrined to realize that he needs the Novaks to access the only people who can help him untangle this mess—the Chen dragon triad. Events bind the two lovers closer and draw them together until even stern and controlled Rory might not be able to avoid his destiny.This is the fifth book in this mpreg mafia series. Get ready for a world ruled by the Don’s iron fist, a sly and serious fox amidst a rambunctious skulk of jokesters, and two families that stand together… no matter what. You can expect to find naughty, knotty scenes of steamy passion, along with a lot of potty-mouth language and more violence than you’re used to from us. But at its heart, you’ll still find all the fluffy mpreg feels and crazy antics you’d look for from Susi Hawke and Crista Crown.",
  "genres": [
    "M M Romance",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Omegaverse",
    "Crime",
    "Fantasy"
  ],
  "author": "Susi Hawke",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/54480459-crossing-ties"
}