{
  "title": "Nonviolent Communication: A Language of Life",
  "description": "An enlightening look at how peaceful communication can create compassionate connections with family, friends, and other acquaintances, this book uses stories, examples, and sample dialogues to provide solutions to communication problems both at home and in the workplace. Guidance is provided on identifying and articulating feelings and needs, expressing anger fully, and exploring the power of empathy in order to speak honestly without creating hostility, break patterns of thinking that lead to anger and depression, and communicate compassionately. Practical nonviolent communication skills are partnered with a powerful consciousness and vocabulary that can be applied to personal, professional, and political differences. Included in the new edition is information on how to compassionately connect with oneself. Do you hunger for skills to improve the quality of your relationships, to deepen your sense of personal empowerment or to simply communicate more effectively? Unfortunately, for centuries our culture has taught us to think and speak in ways that can actually perpetuate conflict, internal pain and even violence. Nonviolent Communication partners practical skills with a powerful consciousness and vocabulary to help you get what you want peacefully.In this internationally acclaimed text, Marshall Rosenberg offers insightful stories, anecdotes, practical exercises and role-plays that will dramatically change your approach to communication for the better. Discover how the language you use can strengthen your relationships, build trust, prevent conflicts and heal pain. Revolutionary, yet simple, NVC offers you the most effective tools to reduce violence and create peace in your life-one interaction at a time.Over 150,000 copies sold and now available in 20 languages around the world. More than 250,000 people each year from all walks of life are learning these life-changing skills.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Communication",
    "Relationships",
    "Personal Development",
    "Leadership"
  ],
  "author": "Marshall B. Rosenberg",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/5448642-nonviolent-communication"
}