{
  "title": "سير أعلام النبلاء الجزء 2 من 2 (كتاب تاريخ أعيان العلماء)‬",
  "description": "شمس الدين أبو عبد الله محمد بن أحمد بن عثمان بن قَايْماز الذهبي (673 هـ - 748 هـ / 1274م - 1348م)هو المحدث والإمام الحافظ المعروف. كان عالما بالتأريخ وعارفا بقواعد الجرح والتعديل في الرجال في الوقت نفسه. وسُمي بالذهبي لانه كان يزن الرجال كما يزن الجوهرجي الذهب.شيوخه في دمشق ومصر وبعلبك والإسكندرية. وطلبته كثيرون وكان يميل للرأي الحنبلي وصنف في الحديث واالجرح والتعديل وتعلم القرآن برواياته وعلمها وله من الكتب المذلفة في التاريخ قريب من 200 منها مجلدات كبيرة.قالوا في الإمام الذهبي:قال الصلاح الصفدي (ت 764): «لم اجد عنده جمود المحدثين، ولا كودنة النقلة، بل هو فقيه النظر، له دربة باقوال الناس، ومذاهب الائمة من السلف، وارباب المقالات.» «واعجبني منه ما يعانيه في تصانيفه من انه لا يتعدى حديثا يورده حتى يبين ما فيه من ضعف متن، او ظلام إسناد، او طعن في رواته، ولم ار غيره يراعي هذه الفائدة فيما يورده.»قال التاج السبكي (ت 771): «اما استاذنا ابو عبد الله، فبصر لا نظير له، وكنز هو الملجا إذا نزلت المعضلة، إمام الوجود حفظا، وذهب العصر معنى ولفظا، وشيخ الجرح والتعديل، ورجل الرجال في كل سبيل، كانما جمعت الامة في صعيد واحد، فنظرها، ثم اخذ يخبر عنها إخبار من حضرها.»قال ابن كثير الدمشقي (ت 774): «الحافظ الكبير، مؤرخ الإسلام، وشيخ المحدثين، وخاتمة الحفاظ.»قال جلال الدين السيوطي (ت 911): «إن المحدثين عيال في الرجال وغيرها من فنون الحديث على أربعة: المزي، والذهبي، والعراقي، وابن حجر.»كتابه سير أعلام النبلاء:كتاب تراجم عام وهو عمل كبير والمؤلف الثاني للذهبي من حيث الحجم بعد كتاب تاريخ الإسلام. وتراجمه مرتبة بحسب الطبقات 20 سنة بما مجموعه 35 طبقة.وما ترجم الذهبي في الكتاب لفئة واحدة من الأعلام، بل ترجم لأنواع مختلفة منهم، خلفاء وملوك وسلاطين وأمراء وقادة وقضاة وفقهاء ومحدثين وأهل اللغة ونحاة وأهل الأدب وشعراء وأهل الفلسفة مع أنه أكثر من الترجمة لأهل الحديث وكانت عنايته بهم أكبر. وتراجمه لم تكن خاصة بقطر دون آخر أو عصر قبله دون غيره بل اعتنى بكل أقطار الإسلام شرقا وغربا وبكل عصور الإسلام قبله.واهتم الذهبي في كتابه بجرح الرجال وتعديلهم بحسب قواعد علم الجرح والتعديل ومنهجه العلمي ليستفيد منه أهل الحديث في معرفة الموثوقون من الضعفاء فيتميز الحديث الصحيح من الضعيف. وقد اقتفى الذهبي أثر أئمة هذا الشأن قبله علي بن المديني ويحي بن معين وانفرد بأسلوبه الخاص في التعاطي مع تراجم الرجال حتى مع من ليس لهم علاقة برواية الحديث وصار إماما في الجرح والتعديل وله كتاب قيم آخر ميزان الاعتدال.وقد حفل كتاب سير أعلام النبلاء بانتقادات متنوعة ومتعددة للمترجم لهم طالت مجالات عدة بينت أحوال الرجال والموارد التي اعتمدوها في نقولاتهم فنبهت إلى الأوهام فيها.وقد رأى البعض من أهل عصر الذهبي مثل تلميذه عبد الوهاب السبكي أنه بالغ وغالى في جرح بعض المترجم لهم.وننبه على أن كتاب السير ليس اختصارا لكتاب تاريخ الإسلام وإن كانت جل التراجم موجودة فيه فهناك فرق واضح للمطلع على الكتابين، فقد أثرى مادة تراجم السابقين الأولين في السير عنه في كتاب تاريخ الإسلام. وقد جعل كتبه عن بعض الأعلام ضمن السير كأبي حنيفة وأبي يوسف وسعيد بن المسيب وابن حزم متميزا بذلك في هذا الباب عن كتاب تاريخ الإسلام. وبداية السير بالسيرة النبوية ثم الراشدون الخلفاء وبعدها ترجمة المبشرين العشرة ثم غيرهم من السابقين الأولين فمن وراءهم فالتابعون وتابعوهم إلى أن انتهى بقليج قان ابن الملك المعز أيبك.",
  "genres": [
    "History",
    "Islam",
    "Religion",
    "Biography",
    "Reference",
    "Autobiography"
  ],
  "author": "شمس الدين الذهبي",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/54500330-2-2"
}