{
  "title": "Don Miller's Hollywood Corral: A Comprehensive B-Western Roundup",
  "description": "When Don Miller's Hollywood Corral was originally published in 1976, it was eagerly embraced by the thriving core of Western film fans that had coalesced during the preceding decade. There had already been several historical surveys of the genre, but none had focused exclusively on the low-budget series Westerns of Hollywood's Golden Age. Miller's work was a lively and informative volume on the subspecies, which included more than 2,000 movies.Hollywood Corral was eagerly accepted by its target serious B Western fans and collectors. Long out of print, it has been much sought after by a new generation of hobbyists who, thanks to the proliferation of old movies on videotape, videodisc, and cable TV, have discovered the joys of B Western watching.With the original's mistakes corrected and a different photo selection accompanying this reprint, Hollywood Corral had been augmented with newly written essays covering specific aspects of the genre not fully covered by Miller. Some of the country's leading film historians are represented in these pages, contributing knowledge about B Western production little known even among the genre's most fervent devotees. Studio styles, literary precursors, location shooting, music scoring, and other facets of B Western production are examined with the same reverence and regard for historical accuracy generally accorded studies of more prestigious film forms.Hollywood Corral sports a breathtaking array of rare over 400 in all, many of them never-before-published candid and behind-the-scenes shots, illustrating the entire history of the B Western era. And it also features a detailed bibliography that will direct students of the genre to other published works on Westerns.Newly written contributions from Gene Autry and Roy Rogers - the era's most beloved cowboy stars - round out this vastly entertaining package, which is sure to delight nostalgia-minded browsers and hardcore B Western aficionados alike.",
  "genres": [
    "Film"
  ],
  "author": "Don      Miller",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/545217.Don_Miller_s_Hollywood_Corral"
}