{
  "title": "The Dinosaurs of Waterhouse Hawkins",
  "description": "The Barnes & Noble ReviewA masterful blend of artistic skill, scientific prowess, and impassioned theatrics lay at the core of Waterhouse Hawkins. A man of pure determination, he created the first life-size models of dinosaurs! This brilliant book is a fantastic nod to the genius of one man, and a glimpse into the beginning of an important era.As a boy in England, Benjamin Waterhouse Hawkins always wanted to be an artist. His passion led him to animals, and soon he was drawing and painting them with fervor. This eventually led to his true calling -- creating models of dinosaurs as they actually must have looked when they roamed the earth! With the help of scientist Richard Owen, he checked the fossil remains of dinosaurs against living animals and constructed a gigantic model. Among the first to witness his creation were Queen Victoria and Prince Albert, who reacted with pure amazement.In order to impress England's leading scientists with his work, Waterhouse Hawkins staged a lavish New Year's Eve dinner party and hosted the gala inside the body of his model! He also wanted the public to learn about the dinosaurs and their history, so he built smaller models, illustrated books, and lectured on the subject. His fame spread to the United States, and he was invited to New York, where he began to create model dinosaurs for a proposed Paleozoic Museum in Central Park. However, a corrupt politician put an end to the project, and vandals later broke into Waterhouse Hawkins's workshop and destroyed his models. Though distraught, he moved on to Princeton, where he built skeletons and created paintings about life on earth in the age of the dinosaurs. Eventually, Waterhouse Hawkins returned to England and continued his work, some of which can still be seen in Crystal Palace Park.Writer Barbara Kerley and illustrator Brian Selznick have weaved a spirited account of this largely forgotten man. Plenty of textual detail, research, and a good dose of wonderment make Kerley's narrative a delightful experience. And the awesome illustrations, which combine Waterhouse Hawkins's own grandeur with Selznick's talent for the bold and the beautiful, made the pages come to life. The fusion of scientific allure and sensational images is a stroke of brilliance. This phenomenal book stands as true testament to the devotion and power of an individual -- it would have made Waterhouse Hawkins proud. (Amy Barkat)",
  "genres": [
    "Picture Books",
    "Nonfiction",
    "Biography",
    "Dinosaurs",
    "Childrens",
    "History",
    "Science"
  ],
  "author": "Barbara Kerley",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/545433.The_Dinosaurs_of_Waterhouse_Hawkins"
}