{
  "title": "Lock & Key",
  "description": "A steamy small town love story - A unique and full of feels second chance romanceOne fiery night with a beautiful woman makes Lock feel alive again, but he doesn't realize it's her, his obsession from the past. His mentor’s widow.When her biker husband was murdered sixteen years ago, Grace Quillen took off from her small hometown forever. But when tragedy strikes again, forty-two year old Grace must return to care for her sister and little nephew. One night she indulges in explosive heat with Lock, an attractive stranger she meets at a bar, but the morning after, she's shaken by her fateful mistake.Why?He’s no stranger.Not only is he an officer in her husband's bike club, but the two men had once been close friends, although Grace had never had a chance to meet him. Fate is a twisted bitch with a bitter sense of humor.Lock had heard all about Grace from her husband years ago, from his brothers, seen her in photographs. Hell, she'd become his ultimate dream woman. A fantasy.Now that once-in-a-lifetime fantasy is his reality, and he’s craving more. A hell of a lot more.But the club has other plans. For the two of them.A brutal firestorm is ignited by a traitor in the MC, and suddenly Grace is in the thick of the dangerous life she’d once left behind. Yet she and Lock are on opposite sides of the mayhem. With her nephew’s safety at risk and so many volatile secrets on the line, she must summon all her determination and grit, while Lock is driven to find the fight in himself once more and do whatever it takes to protect Grace, whether she or his president wants him to or not.Suspicions simmer, loyalties strain, hearts ache.The truth hurts.Once Grace and Lock had nothing.Now, they both have so damn much to lose.\"I love this series! Cat Porter is a massively gifted writer! I highly recommend.” - bestselling author Kennedy Ryan“Cat Porter NAILED it. This was a great, great book. So well written\" - Lorelei James, New York Times & USA Today best-selling authorTotallyBooked Blog: Lock & Key - one of their “Favourite Standalones for 2014″EDGy Reviews: Lock & Key - one of their “Top Ten Favorites of 2014″Guilty Pleasures Book Reviews: Lock & Key - an Overall Favorite Book, a Favorite Motorcycle Romance, a Favorite Debut Romance, a Favorite Kick-Ass Heroine / Cat Porter - a Favorite Author and a Break-Through Author.Sassy Lit Chic Reviews LOCK & KEY - one of their “Top 20 Reads of 2014″The Lock & Key series is a TotallyBooked Blog Biker Romances Recommended Read & The Rock Stars of Romance Recommended Biker Book Series #EpicLove #MUSTread**Please note this book has been re-edited since its release in June 2014**The Lock & Key Series1 - Lock & Key2 - Random & Rare3 - Iron & Bone4 - Blood & Rust4.5 - Lock & Key Christmas*Series Origin Story novel - The Dust and the Roar*Standalone Spinoff novel - FuryThe Lock & Key series is a motorcycle club romance saga. These romantic suspense / romantic adventure / small town romance / biker romance / coming of age / women's fiction novels contain anti-heroes, organized crime, adult language, graphic sex, violence and are intended for mature audiences",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Dark",
    "Erotica",
    "Adult",
    "Audiobook"
  ],
  "author": "Cat Porter",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/54544271-lock-key"
}