{
  "title": "The Backseat Shrink: a comedy. A scandal forces an acclaimed psychiatrist to live on the streets in his station wagon, where he finds himself the backseat shrink to a cast of street denizens",
  "description": "A Hilarious Comedy with a Powerful Message An erupting scandal forces Dr. Lowe an acclaimed psychiatrist to live on the streets in his station wagon, where he finds himself the backseat shrink to a cast of street denizens and mobsters.★★★ BOOKTRIB REVIEW ★★★ Dr. Lowe Prescribes Laughs and Life Lessons in “The Backseat Shrink” The perfect job, the perfect family, the perfect life. As a renowned psychiatrist with a brand-new book deal, Dr. Carlton Lowe is living the high life among the wealthy elite of Chicago. Upper-crust clients and talk show interviews are his bread and butter; he has no time for the seedy aspects of city life. Blue collar work, homeless people and crime don’t exist in his privileged world. He seems to have life all planned out, but the one thing he never considered was how easily it could all be taken away.The Backseat Shrink by D.D. Kaye takes a humorous look at what happens when a man who is used to having everything suddenly has nothing. When Dr. Lowe’s wife and his attorney gang up on him to frame him for infidelity, he finds himself served with divorce papers. As if that wasn’t embarrassing enough, he’s told that everything he owns now belongs to his soon-to-be ex-wife. The one the couple’s ancient station wagon.FROM BIG TIME TO BROKE With his assets frozen, Dr. Lowe takes to the streets where he’s forced to live in his station wagon and mingle with the same homeless people he was content to ignore just one day earlier. Dr. Lowe may be spoiled, arrogant and a bit selfish, but he’s no cheater. He has no intention of rolling over and letting his blackmailers take him for a ride; he plans to put up a fight.Without enough cash flow to buy a cup of coffee, how can he possibly afford the legal resources he’ll need to prove his case and win back his life? Well, the one thing they couldn’t take from him is his expertise as a psychiatrist. Now he’s the backseat shrink, dishing out advice and prescriptions from the back seat of his station wagon at the only rate his new homeless clients can $1 for 10 minutes.Between his sessions and his life on the streets, he meets a cast of down-on-their-luck characters whose stories run deeper than he ever imagined. He might have even found some friends who can help him, and none too soon because he seems to have accidentally parked his practice in the territory of an unfriendly drug lord.SATIRE THAT'S ALL TOO RELEVANT Readers are invited to laugh along as Dr. Lowe tries to fight his way back into his old life. Kaye takes a candid approach to satire, confronting readers with issues pertinent to present-day U.S. culture. She thrusts her larger-than-life characters into situations that will leave readers laughing, cringing and thinking “that’s too real” all at once.Like any good satire, there are rich layers of lessons for real life that can be found under the light-hearted jokes. This book is a narrative written with just a hint of the essence of a screenplay, resulting in a fast-paced edge-of-the-seat experience for readers. Or shall we say, fast-paced edge-of-the-backseat experience.See review on Booktrib, the leading source for book news and",
  "genres": [],
  "author": "D.D. Kaye",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/54572406-the-backseat-shrink"
}