{
  "title": "On Dublin Street: The Novellas",
  "description": "A paperback compilation of three On Dublin Street series novellas.It includes:\nStars Over Castle Hill\nJoss and Braden Carmichael are blissfully married living in their townhouse on Dublin Street with their three beautiful children. It's a life Joss never expected to have, and one she's grateful for every day.But... what if she never met Braden and Ellie Carmichael on that fateful day when she was only twenty-two years old?When Joss is asked to write a story about how her life might have turned out if a pivotal moment in it never happened, she thinks of the day she met both Braden and Ellie Carmichael. If she had never met them where might she have ended up? Joss believes no matter where life may have taken her it would have inevitably led her to Braden. But what if she was thirty instead of twenty-two when they met? How would she have felt about risking her heart then?And even if she was older and wiser and ready to fall madly in love, what if too much had happened to Braden to make him the man that would risk his heart to save hers?Will time be their enemy... or is it possible that two souls are meant for one another in any reality?Stars Over Castle Hill is an alternative reality novella of the #1 international bestselling romance On Dublin Street.\nValentine: An On Dublin Street Novella\nJoss & Braden. Ellie & Adam. Jo & Cam. Olivia & Nate. Hannah & Marco. Shannon & Cole. And one Valentine's Day they'll never forget.It's Valentine's Day! How do Joss & Braden, Ellie & Adam, Jo & Cam, Olivia & Nate, Hannah & Marco and Shannon & Cole keep the fire burning in their relationships while trying to juggle busy careers and the joyful chaos of parenthood? Find out in VALENTINE, six sexy and emotional short stories, one for each couple in the On Dublin Street series so far, making up a short novella about one very special day.\nOn Dublin Street: The Bonus Material\nThroughout the years, fans of the International Bestselling On Dublin Street Series have received behind the scenes bonus material as part of series promotions. Finally, all of those bonus scenes are now available in one novella.",
  "genres": [],
  "author": "Samantha Young",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/54568773-on-dublin-street"
}