{
  "title": "The Summer Tour",
  "description": "In the ten years I’ve spent touring and building this franchise with my brothers, not a single person has ever stood out in the crowd. It’s impossible to tell one face from the next when I’m up there. The mixture of fog, lights, flashing lasers, my astigmatism, and whatever else they put into the air to keep the crowd happy… It’s all just a mix for a big bunch of blurry fuzzy whatnots. She was not a whatnot. She stood out in her ripped black jeans and that adorable neon yellow thing holding her hair up out of her face. I don’t even know what it’s called, but it was perfect. She was perfect. The bright pink tank top that hugged her in all the right places. Those bright yellow heels that made her back curve in just the right way. Those were definitely factors that caught my eye, but it's not why I can't get her out of my head. Her dark brown eyes and that smile—her smile. That’s it. That smile had me hooked from the second I ran on stage. I even stopped short of my mark and totally threw off the spotlight tracker. Why?Because I was too busy watching her and how she just fell into the rhythm of the music. It’s a good thing Chuck didn’t plan any pyro for tonight, or I might have been screwed.I’m not even entirely sure I sang the right lyrics to the first couple of songs. It was more a series of barely audible grunts, caveman style. Nash probably turned his mic up to help with the background vocals. They’ve all gotten really good at covering my ass over the years. I’m grateful the crowd didn’t seem to notice. All I could think about was trying to figure out a way to find out who she is. I still have nothing. So I’m sitting here like a lost, lonely little puppy just hoping to catch another glimpse. What if she leaves and doesn’t come through the line? I can see both Exit doors from here. I’m watching those two doors like a pitbull watches the gate at a junkyard. Maybe I am a lost, lonely little puppy. No.I am a pitbull puppy. And just like that pitbull, I will jump this table and bulldoze whoever gets in the way if I have to.",
  "genres": [
    "Romance",
    "Musicians",
    "Contemporary",
    "Contemporary Romance",
    "Music"
  ],
  "author": "Mandy Melanson",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/54545964-the-summer-tour"
}