{
  "title": "Say I Do",
  "description": "She hates him.Dexter Ryan is smug. Arrogant. Manipulative. And he is also…Lacey Amari’s new partner. Well, her partner on one case. A case she doesn’t even want to take, but when Dex—CIA super operative and all around puppet-master—basically blackmails her, she has no choice. Then he asks her the big question…Will you marry me?The proposal isn’t real. It’s just an undercover assignment. Dex needs Lacey to be his fake fiancée for a case. Not exactly her dream job. But, she’ll do it. He wants her to pretend to be head over heels in love with him, he wants her help on a dangerous investigation in a remote ski lodge, and he…wants her?Their desire isn’t pretend.Dex doesn’t work well with others and handling a case with a partner in close proximity—as in 24/7 close—isn’t his normal style. He’s pulled Lacey into the investigation because she is smart and resourceful, and maybe because he knows a secret about her that could prove to be very useful to him. After all, Dex uses people all the time. It’s his thing. Yet the more he is around her, the idea of using Lacey suddenly doesn’t seem like such a good plan. But getting her into his bed? Stellar idea. He wants her, but so do the bad guys.The attraction between Dex and Lacey burns red-hot, hot enough to melt the snow around them. Except, just as he planned, Lacey’s presence draws in the enemy. Now the bad guys are after her, and Dex has to stick even closer to her. He’s playing the role of the obsessed lover, only it’s not just a role. Because for the first time in his life, Dex is falling hard. He’s losing his control. He’s lied. He’s cheated. He’s about to give up his heart. When Lacey finds out the secret he’s known, her rage and pain break his heart. Dex has to find a way to make things up to her, and he has to stop the enemies who are closing in. Nothing he can’t handle. Maybe. Dex is a master multi-tasker—most days, anyway. Dex will use every trick in his very large arsenal to win this case. Lacey melted the ice around what the whole world knows is Dex’s very, very cold heart, and Dex will fight like hell to protect her and to prove to her that even master spies can fall in love.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Humor"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/54563986-say-i-do"
}