{
  "title": "The Complete Peanuts, 1969–1970",
  "description": "The New York Times best-selling series continues!He turns up first as Snoopy’s secretary, then gradually becomes a good friend whom Snoopy helps to fly South... but it’s not until June 22, 1970 that the little bird gains a name, in a perfect salute to the decade that ends with this volume: Woodstock!In other timely stories, Peppermint Patty runs afoul of her school’s dress code (those sandals!), Lucy declares herself a “New Feminist,” and Snoopy’s return to the Daisy Hill Puppy Farm on a speaking engagement climaxes in a riot and a new love found amidst the teargas (“She had the softest paws...”).Speaking of Snoopy, this volume falls under the sign of the Great Beagle, as three separate storylines focus on the mysterious sovereign of Beagledom. First Snoopy is summoned by a wrathful G.B. when Frieda submits a complaint about his (Snoopy’s) desultory rabbit-chasing efforts; then, back in the Great one’s good graces, Snoopy is sent on a secret mission; and finally he himself ascends (briefly!) to the mantle of Great Beagledom.In other news, an exasperated Lucy throws Schroeder’s piano into the maw of the kite-eating tree, with gruesome results... Miss Othmar goes on strike and Linus gets involved... Charlie Brown’s baseball team has an actual (brief) winning streak... Snoopy’s quest to compete in the Oakland ice skating competition is thwarted by his inability to find a partner... Charlie Brown goes to a banquet to meet his hapless baseball hero Joe Shlabotnik... Snoopy is left in the Van Pelt family’s care as Charlie and Sally Brown head out of town for a vacation... and (alas) the Little Red-Haired Girl moves away...This volume also features a new introduction by renowned illustrator Mo Willems and, as always, gorgeous design by award-winning cartoonist Seth.The Complete Peanuts will run 25 volumes, collecting two years chronologically at a rate of two a year for twelve years. Each volume is designed by the award-winning cartoonist Seth (It's a Good Life If You Don't Weaken) and features impeccable production values; every single strip from Charles M. Schulz's 50-year American classic is reproduced better than ever before.",
  "genres": [
    "Comics",
    "Humor",
    "Comic Strips",
    "Graphic Novels",
    "Fiction",
    "Graphic Novels Comics",
    "Sequential Art"
  ],
  "author": "Charles M. Schulz",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/54593.The_Complete_Peanuts_1969_1970"
}