{
  "title": "Negative Space",
  "description": "\"Dancyger crafts a striking composition out of found objects, a poignant portrait of the identities we construct out of grief.\"--Oprah Daily \"Candid, thrilling, wickedly smart, Negative Space is one of the greatest memoirs of this, or any, time.\" --T Kira Madden, author of Long Live the Tribe of Fatherless Girls Despite her parents' struggles with addiction, Lilly Dancyger always thought of her childhood as a happy one. But what happens when a journalist interrogates her own rosy memories to reveal the instability around the edges?Dancyger's father, Joe Schactman, was part of the iconic 1980s East Village art scene. He created provocative sculptures out of found materials, and brought his young daughter into his gritty, iconoclastic world. She idolized him--despite the escalating heroin addiction that sometimes overshadowed his creative passion. When Schactman died suddenly, just as Dancyger was entering adolescence, she went into her own self-destructive spiral, raging against the world that had taken him away. But as an adult, Dancyger began to question the mythology she'd created about her father--the brilliant artist, struck down in his prime--using his paintings, sculptures, and prints as a guide to piece together a truer story.Featuring Schactman's artwork throughout, Negative Space explores Dancyger's grief, anger, and artistic inheritance as she sets out to illuminate the darkness her father hid from her, as well as her own. \"Negative Space is a beautiful restoration act.\" --Lidia Yuknavitch, author of The Chronology of Water \"This book is so many a daughter's heartrending tribute, a love story riddled by addiction, a mystery whose solution lies at the intersection of art and memory. Together, they form a chorus that I could not turn away from, and didn't wish to.\" --Melissa Febos,  author of Whip Smart and Abandon Me \"Dancyger creates an unflinching account of her artist father's snakebitten life and his struggles with addiction - peeling back the layers around an artistic practice that seems weighted with vulnerability. Ultimately, he comes painfully alive as Dancyger charts an elegiac path to her own self-discovery.\" --Cynthia Carr, author of Fire in the The Life and Times of David Wojnarowicz \"Negative Space is a lovely and heartbreaking book; navigating pain, inheritance, and loss. Dancyger's father emerges from these pages as vividly as if I'd known him.\" --Carmen Maria Machado, author of In the Dream House\"This book is a true accomplishment, one that often left me stunned and disturbed in all the right ways, all the ways brilliant art does.\" --Alex Marzano-Lesnevich, author of The Fact of a Body \"Dancyger achieves that beautiful, often elusive, balance of writing about addiction with equal parts examination and empathy.\" --Erin Khar, author of Strung Out\"Negative Space is a brilliant, moving, unique, thought-provoking meditation on the artistic life, fathers and daughters, and the struggle to live life at the highest pitch in each generation.\" - Mark Greif, author of Against EverythingFor readers of The Glass Castle by Jeannette Walls and The Night of the Gun by David Carr.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Art",
    "Grief",
    "Audiobook",
    "Coming Of Age"
  ],
  "author": "Lilly Dancyger",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/54579036-negative-space"
}