{
  "title": "The Last Chance Cafe",
  "description": "New York Times bestselling author Linda Lael Miller captures the passionate heart of America in this powerful contemporary novel set in a small Western town. Seeking shelter from the storms of life, a woman who is down on her luck finds an unexpected refuge at THE LAST CHANCE CAFÉ  With acres of land and a house that have been in his family for generations, rancher Chance Qualtrough has deep roots in Primrose Creek. Now, at the local diner, he is about to encounter his futureŠ.Perhaps it was fate that brought Hallie O'Rourke and her two young daughters to the Last Chance Café. More likely, it was the blinding Nevada snowstorm and a broken-down truck that forced the desperate single mother inside. Hallie couldn't know that she would find not just a hot meal and a few hours' rest, but the start of a new life. And Chance doesn't know that Hallie is fleeing a danger so threatening she dares not ask anyone for help. Even his kind offer of his aunt's house as lodging seems like too great a risk for Hallie.  But her fierce protection of her children wins out, and she knows she has no choice but to accept Chance's invitation. Slowly, as Chance and Hallie break down barriers of fear and doubt, trust takes hold. Hope replaces despair. And a fragile attraction grows into an undeniable passion. From the moment she took a chance with a handsome stranger in a country diner, everything Hallie has ever believed about home and family is seen through new eyes. But Hallie can never forget that just one careless word could bring back the past with full force, and could destroy all that she has made her own.  With a richly emotional storytelling style that has enchanted readers worldwide, Linda Lael Miller explores the secrets and wishes that push a woman's heart to new tomorrows and -- forever and always -- to lasting love..",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Western Romance",
    "Westerns",
    "Chick Lit"
  ],
  "author": "Linda Lael Miller",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/545872.The_Last_Chance_Cafe"
}