{
  "title": "Hallmark Channel Countdown to Christmas - USA TODAY BESTSELLER: Have a Very Merry Movie Holiday",
  "description": "The Publishers Weekly and USA TODAY Best Seller! The official Hallmark Channel Christmas keepsake takes you behind-the-scenes of your favorite feel-good holiday films with the casts' memories, photos, recipes and more. This stunning book invites readers to an exclusive inside look at the making of everyone's favorite holiday classics with secrets from the stars, screenwriters, set designers, costume designers, and directors who create the movie magic. Featuring the network's top leading ladies and gentlemen--Candace Cameron Bure, Lacey Chabert, Kristin Chenoweth, Debbie Matenopoulos, Cameron Mathison, Chris McNally, Danica McKellar, Christina Milian, Tamera Mowry-Housley, Jodie Sweetin, Holly Robinson Peete, Alexa and Carlos PenaVega, and many others--this ultimate deck-the-halls guide shares their personal holiday recipes, favorite ideas for Christmas decorating and gift giving, as well as ways to savor and share the true meaning of the holidays. Inside you'll find: • 45 recipes for delicious holiday meals, Christmas cookies, desserts, cocktails, and even snacks perfect for serving at your movie marathons, plus recipes from the Hallmark Channel movie stars such as Danica McKellar's Chocolate Yule Log, Chris McNally's Classic Eggnog, and Lacey Chabert's Sweet Potato Pie  • A heartfelt foreword from Candace Cameron Bure on her love of the holiday season • An introduction from Country Living Editor-in-Chief Rachel Hardage Barrett on how holiday movies offer comfort and warmth • Super-fun quizzes to test your Hallmark Channel Christmas Movie IQ • Special decorating and gift-wrapping ideas and thoughtful ways to express gratitude  • Everything you need to host a watch-party including a play-along bingo card and shareable memes • Color photos throughout including captivating images from your favorite holiday romances • Heartwarming tales of rescue animals like the network's Happy the Dog and Happy the CatIt's the must-have gift for your favorite Hallmark Channel movie fan or for anyone who wants to put a little more happily-ever-after into the happiest season of all!",
  "genres": [
    "Christmas",
    "Nonfiction",
    "Cookbooks",
    "Holiday",
    "Media Tie In",
    "Food and Drink",
    "Cooking"
  ],
  "author": "Caroline McKenzie",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/54596449-hallmark-channel-countdown-to-christmas---usa-today-bestseller"
}