{
  "title": "The Case Against Masks: Ten Reasons Why Mask Use Should be Limited",
  "description": "Do we really need to wear masks? From the New York Times Bestselling authors of Plague of Corruption comes the must-read guide on masks and re-opening following the COVID-19 pandemic.THE CASE AGAINST MASKS is the book all America needs to be reading as we emerge from the COVID-19 pandemic. Written by New York Times bestselling authors Dr. Judy Mikovits and Kent Heckenlively, this book reviews the evidence for and against widespread public masking as provided by the Centers for Disease Control and the Mayo Clinic, as well as top scientific publications such as the New England Journal of Medicine and The Lancet. This debate needs to take place without fear and paranoia. Important questions raised in this book are the affect of masks on oxygen and carbon dioxide levels, how SARS-CoV-2 spreads, the effectiveness of various types of masks, those who are most vulnerable to COVID-19, and whether our children should go back to school in the fall, and if so, what measures they should take.The authors' previous book, PLAGUE OF CORRUPTION, was the runaway science bestseller of 2020, and the authors bring that same passion and attention to detail to the mask question. As politicians and bureaucrats of all stripes are weighing in on this question, with some placing their cities and states under mandatory masking provisions, we need to understand the science behind their decisions. Are such measures a reasonable response to current circumstances, or is it a dramatic overreach, which in many cases might make the situation even worse? America desperately needs this public conversation to take place with the best science we have available. As Americans have always done during difficult times, we must summon the courage to have these challenging conversations.",
  "genres": [
    "Health",
    "Nonfiction",
    "Science",
    "Politics",
    "Medicine"
  ],
  "author": "Judy A. Mikovits",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/54595860-the-case-against-masks"
}