{
  "title": "Rockstar Romeo",
  "description": "Jace Logan's smooth, deep voice and devastating good looks have made him a rock legend. He’s seen and done it all, but he’s never forgotten what—or rather, who—inspired him in the first place. Nearly twenty years later, the young singer who’d touched his very soul is still in his thoughts. In every song he writes. And she has no idea, because she disappeared from the music scene before he ever had a chance to tell her.When he and his band fly to LA to lay down some new tracks, he feels an instant and unnerving connection to the woman handling their upcoming tour. She’s beautiful, business-savvy, and oddly familiar. Unfortunately, she’s also proving frustratingly impervious to his charms.Eva D’Agolino’s job is to make people famous, and she’s damn good at it – probably because she was once part of the rock and roll life herself. These days, she prefers working behind the curtain instead of center stage. The cruel lessons she learned firsthand make it easy to keep things strictly professional, even around sexy, confident rock gods who don’t like to be told no.Well, most of the time, anyway. When Eva’s personal life begins to crumble, Jace is there to pick up the pieces. Denying him completely proves impossible, especially when he’s so good at giving her exactly what she needs. But she’s no fool. She’s already been down that road and knows how the song ends.Can Jace convince Eva he’s more than just the rock star she unknowingly created, and that theirs is truly a love song for the ages?Rockstar Romeo by USA Today Bestselling author Abbie Zanders is a standalone contemporary rock star romance written in Vi Keeland and Penelope Ward’s Cocky Hero world. If you like sexy rock stars, second chances, and the kind of love that inspires chart-breaking power ballads, you’re going to love Jace and Eva’s story!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Music",
    "Contemporary",
    "Audiobook",
    "Romantic",
    "Family"
  ],
  "author": "Abbie Zanders",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/54580018-rockstar-romeo"
}