{
  "title": "Der Rasmus-Effekt (Thriller-Reihe 1)",
  "description": "Zitat People-Magazin » Der Rasmus-Effekt könnte Ihnen den Schlaf rauben!«Die Apokalypse.Auf der Erde und im All.Rasant. Atemberaubend. Realistisch.2035 – die Lösung des Welthungerproblems mit Hilfe von Superfruits scheint greifbar nah. Doch todbringende Ereignisse verselbstständigen sich zu einer Kettenreaktion, die das Ende der Menschheit bedeuten könnte.»Fünfter Tag auf der ISS, Dr. Richard Marks, Eintrag für die Nachwelt, falls es eine geben Sie sind alle tot. Ein Mitglied der Crew ist weiterhin unauffindbar. Meine Beobachtungen aus der Aussichtskuppel nehmen mir jeden Tag ein Stück Hoffnung. Seit dem letzten Überflug leuchten Teile von China blau. Kara bedroht mich mit wachsender Aggression. Sie weint, um kurze Zeit später Amok zu laufen. Vielleicht werde ich sie aus der Gefangenschaft befreien, auch auf die Gefahr, dass sie versucht mich zu töten. Sie ist vermutlich der letzte Mensch, den ich zu Gesicht bekommen werde.«Als die Katastrophe über die schwedische Kleinstadt Bollnäs hereinbricht, befindet sich Rasmus bereits am Tiefpunkt seines Lebens. Die eigenwillige Gigi kapert sein Wohnmobil und zwingt ihn zur gemeinsamen Flucht vor dem tödlichen Feind. Abgeschreckt von ihrem energischen Wesen und flippigen Erscheinungsbild will er zunächst nichts lieber, als sie loszuwerden. Doch die Ereignisse überschlagen sich und Rasmus muss sich mit Gigi arrangieren – auf Leben und Tod.Vier durch das Schicksal miteinander verbundene Menschen kämpfen in dieser weltumspannenden Story ums Überleben.Ein packender Endzeit-Thriller über fatale Entscheidungen, Menschlichkeit, Freundschaft und Liebe. Beklemmend, mitreißend und hochspannend erzählt.»Wenn ich den Roman in drei Worten beschreiben sollte, wären es Rasant, intensiv, aufwühlend. Definitiv keine Standardkost - unbedingt lesen!«»Noch einen Tag später schaffe ich nicht, dieses O-Gott-Gefühl in Worte zu fassen.«»Atemberaubendes Tempo, ein ungewöhnlicher, hoch spannender Plot und Protagonisten, die über sich selbst hinauswachsen. Anschnallen, festhalten und los geht's! Sag nicht, ich hätte dich nicht gewarnt.«»Hochspannend! Das Buch lässt dich erst am Ende wieder aus seinen Fängen!«»Verdammt! Ich lese viel zu wenig. Aber wieviel ist eigentlich zu wenig? Wenn Du \"Der Rasmus-Effekt\" von Cookie Ellerdahl nicht gelesen hast, dann ist es zu wenig.«»Kurzum, bevor ich noch zu einem unreflektierten Fanboy \"DER RASMUS-EFFEKT\" ist eines meiner Lesehighlights 2020 und wird mir noch lange im Gedächtnis bleiben!«»Wenn ich gekonnt hätte, ich hätte ihn in einer einzigen Nacht verschlungen, diesen fesselnden Endzeit-Sci-Fi-Roadmovie!«",
  "genres": [],
  "author": "Cookie Ellerdahl",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/54583669-der-rasmus-effekt-thriller-reihe-1"
}