{
  "title": "Among The Blue Horses: The Masters Reimagined 2",
  "description": "2021 Winner of the Gold Royal Palm Literary Award for Published NoveletteThere are blue horses grazing in the park. Aren't there?Muriel has a secret she doesn't dare tell anyone for fear of being locked away forever. Then she discovers German artist Franz Marc might be the only person in the world who understands her. If only he hadn’t been dead for over a century.But when an museum art director takes notice of her frequent visits and outs her, she finds out more than she ever wanted to know, in a way she never could have imagined.Come trip the light fantastic, spirit-walking with modern artists Franz Marc, Wassily Kandinsky, and bestie August Macke through the years before the Great War...and then beyond.A novelette in The Masters Reimagined 2 anthology. Inspired by Franz Marc’s Blaues Pferde I. INTERVIEW WITH THE AUTHORQ - What is The Masters Reimagined 2? A - In The Masters Reimagined 2, eight authors unite under the inspiration of classic works of art. Masters like Leonard da Vinci, Edvard Munch, Franz Marc, Theodore Gericault, Jacques-Louis David, George Adolphus Storey, and Michael Pacher inspired the authors of the Alvarium Experiment in their quest to reinterpret, reinvent, and reshape selected visual arts in story form through speculative twists and turns. This is the fifth project by the Alvarium Experiment, a consortium of accomplished and award-winning authors.Q - Where should a reader start when selecting a short story to read in The Masters Reimagined? A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. The book description will explain the premise for each particular story.About the AuthorElle Andrews Patt writes speculative and mainstream fiction. She's received an Honorable Mention from Writers of The Future has won, a National Indie Excellence award, and multiple Royal Palm Literary Awards from the Florida Writers Association for Short Fiction and Novel. Her debut paranormal mystery novel, GHOST, is available on Amazon from Blue Beech Press. Her book-length fiction is represented by Paul Stevens of Donald Maass Literary Agency. When she's not writing, Elle can be found mucking stalls and working her day job as a freelance digital marketer. Please visit Elle at www.elleandrewspatt.com for book and social media links.",
  "genres": [],
  "author": "Elle Andrews Patt",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54580885-among-the-blue-horses"
}