{
  "title": "The Eyes of Mona Lisa: The Masters Reimagined Volume 2",
  "description": "If the entries in her great-great-great-grandmother's diary are true, twenty-year-old Lanea will see the future if she gazes into the eyes of da Vinci’s Mona Lisa. When a special exhibit of the famed painting arrives at the National Gallery of Art in D.C., Lanea brings her best friend along on her quest to see if the visions are true, and what they may foretell. A short story in The Masters Reimagined 2. Inspired by Leonardo da Vinci’s Mona Lisa. INTERVIEW WITH THE AUTHOR Q - What is The Masters Reimagined 2? A - In The Masters Reimagined 2, eight authors unite under the inspiration of classic works of art. Masters like Leonard da Vinci, Edvard Munch, Franz Marc, Theodore Gericault, Jacques-Louis David, George Adolphus Storey, and Michael Pacher inspired the authors of the Alvarium Experiment in their quest to reinterpret, reinvent, and reshape selected visual arts in story form through speculative twists and turns. This is the fifth project by the Alvarium Experiment, a consortium of accomplished and award-winning authors. Q - Where should a reader start when selecting a short story to read in The Masters Reimagined? A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. The book description will explain the premise for each particular story. About the Author BRIA BURTON lives in sunny St. Petersburg, Florida, with her wonderful husband, her darling son, and two wild pets. Her short fiction has appeared in over twenty anthologies and magazines, including The Prometheus Saga Volumes 1 & 2 , Return to Earth , and The Masters Reimagined , projects of the Alvarium Experiment. Two of her unpublished manuscripts have won First Place Royal Palm Literary Awards. Her Midnight Ride, a novelette featured in The Prometheus Saga 2 won a 2019 RPLA Silver Award. Her novella, Little Angel Helper, earned high praise from the 25th Annual Writer’s Digest Self-Published Book Awards, and won a 2016 RPLA. She also wrote a collection of family-friendly pet stories called Lance & Ringo Tails. At St. Pete Running Company, she's a blogger and customer service manager. Visit Bria at www.briaburton.com for updates on her projects, links to purchase publications, and info about upcoming appearances.",
  "genres": [],
  "author": "Bria Burton",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/54620507-the-eyes-of-mona-lisa"
}