{
  "title": "Redeeming Justice: From Defendant to Defender, My Fight for Equity on Both Sides of a Broken System",
  "description": "He was seventeen when an all-white jury sentenced him to prison for a crime he didn't commit. Now, in this unforgettable memoir, a pioneering lawyer recalls the journey that led to his exoneration--and inspired him to devote his life to fighting the many injustices in our legal system.Seventeen years old and facing nearly thirty years behind bars, Jarrett Adams sought to figure out the why behind his fate. Sustained by his mother and aunts who brought him back from the edge of despair through letters of prayer and encouragement, Adams became obsessed with our legal system in all its damaged glory. After studying how his constitutional rights to effective counsel had been violated, he solicited the help of the Wisconsin Innocence Project, an organization that exonerates the wrongfully convicted, and won his release after nearly ten years in prison.But the journey was far from over. Adams took the lessons he learned through his incarceration and worked his way through law school with the goal of helping those who, like himself, had faced our legal system at its worst. After earning his law degree, he worked with the New York Innocence Project, becoming the first exoneree ever hired by the nonprofit as a lawyer. In his first case with the Innocence Project, he argued before the same court that had convicted him a decade earlier--and won.In this cinematic story of hope and full-circle redemption, Adams draws on his life and the cases of his clients to show the racist tactics used to convict young men of color, the unique challenges facing exonerees once released, and how the lack of equal representation in our courts is a failure not only of empathy but of our collective ability to uncover the truth. Justice for Sale is an unforgettable firsthand account of the limits--and possibilities--of our country's system of law.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Social Justice",
    "True Crime",
    "Biography",
    "Law",
    "Biography Memoir"
  ],
  "author": "Jarrett Adams",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/54614572-redeeming-justice"
}