{
  "title": "Under a Sky on Fire",
  "description": "The child stood in the road wearing a blue flannel nightie, her feet bare and dirt-splattered. Her blonde flyaway hair was golden, aglow from the fires behind her. Stumbling over, Lizzie reached her. The little girl’s eyes were closed, her palms facing upwards. If she’d been in church, you would have thought she was praying.September 1940, LondonAs the German Luftwaffe begin a terrifying bombing campaign that will come to be known as the Blitz, thousands are evacuated to safety. But Lizzie Mackenzie finds herself heading towards London.She knows she must help in the war effort. But she has another reason for leaving the security of her Scottish the illegitimate child she gave up for adoption nearly five years before is somewhere in the city. And – as the bombs rain down – she will stop at nothing to find her and make sure her little girl is safe.Then she finds herself trapped in a dark theatre during a bombing raid, where she meets Pilot Officer Jack Henson. Against all her instincts, she falls in love. But what chance is there for that love to flourish? Because if he discovers the secret shame of her past, he may never forgive her. And with Jack facing the enemy every day in the sky, and Lizzie’s job guiding pilots into battle – life and love has never felt so fragile.Until a chance encounter with a little orphaned girl changes everything, forcing Lizzie to ask herself what truly matters. Because, in the darkest days of war, every life counts. And – when tragedy strikes – saving one child’s life might just give Lizzie a reason to survive…An unforgettable story about sacrifice, love and heartbreak set in World War Two London during the Blitz. If you liked All the Light We Cannot See, My Name is Eva and A Fire Sparkling, you will love Under a Sky on Fire.",
  "genres": [
    "Historical Fiction",
    "World War II",
    "Historical",
    "Fiction",
    "War",
    "Holocaust",
    "Book Club"
  ],
  "author": "Suzanne Kelman",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/54608732-under-a-sky-on-fire"
}