{
  "title": "أمثال العرب",
  "description": "\"(المفضّل بن محمّد بن يعلى) أبو عبد الرّحمن الضّبّيّ، الرّواية الأديب النّحويّ اللّغويّ، كان من أكابر علماء الكوفة، عالما بالأخبار والشّعر والعربيّة. أخذ عنه أبو عبد الله بن الأعرابيّ، وأبو زيد الأنصاريّ، وخلف الأحمر وغيرهم وكان ثقة ثبتا. قال ابن الأعرابيّ: سمعت المفضّل الضّبيّ يقول: قد سلّط على الشّعر من حمّاد الرّاوية ما أفسده فلا يصلح أبدا، فقيل له وكيف ذلك؟ أيخطىء في روايته أو يلحن؟ قال: ليته كان كذلك، فإنّ أهل العلم يردّون من أخطأ إلى الصّواب، ولكنّه رجل عالم بلغات العرب وأشعارها ومذاهب الشّعراء ومعانيهم، فلا يزال يقول الشّعر يشبّه به مذهب رجل ويدخله في شعره، ويحمل ذلك عنه في الآفاق فتختلط أشعار القدماء ولا يتميّز الصّحيح منها إلّا عند عالم ناقد، وأين ذلك؟وعن إبراهيم بن المهديّ قال: حدّثني السّعيديّ الرّواية وأبو إياد المؤدّب قالا : كنّا في دار أمير المؤمنين المهديّ بعيساباذ، وقد اجتمع فيها عدّة من الرّواة والعلماء بأيّام العرب وآدابها وأشعارها ولغاتها إذ خرج بعض أصحاب الحاجب فدعا المفضّل الضّبيّ الرّواية، فدخل فمكث مليّا ثمّ خرج إلينا ومعه حمّاد والمفضّل جميعا، وقد بان في وجه حمّاد الانكسار والغمّ، وفي وجه المفضّل السّرور والنّشاط، ثمّ خرج حسين الخادم فقال: يا معشر من حضر من أهل العلم، إنّ أمير المؤمنين يعلمكم أنّه قد وصل حمّادا الشّاعر بعشرين ألف درهم لجودة شعره، وأبطل روايته لزيادته في أشعار النّاس ما ليس منها، ووصل المفضّل بخمسين ألفا لصدقه وصحّة روايته، فمن أراد أن يسمع شعرا جيّدا محدثا فليسمع من حمّاد، ومن أراد رواية صحيحة فليأخذها عن المفضّل. فسألنا عن السّبب فأخبرنا أنّ المهديّ قال للمفضّل لمّا دعا به وحده: إنّي رأيت زهير بن أبي سلمى افتتح قصيدته بأن قال:«دع ذا وعدّ القول في هرم»ولم يتقدّم له قبل ذلك قول، فما أمر نفسه بتركه؟ فقال له المفضّل: ما سمعت يا أمير المؤمنين في هذا شيئا إلّا أنّي توهّمته، كان يفكّر في قول يقوله أو يروّي في أن يقول شعرا، فعدل عنه إلى مدح هرم وقال: دع ذا، أو كان مفكّرا في شيء من شأنه فتركه وقال: دع ذا فأمسك المهديّ عنه، ثمّ دعا بحمّاد فسأله عن مثل ما سأل عنه المفضّل فقال: ليس هكذا قال زهير يا أمير المؤمنين، قال فكيف قال؟ فأنشد:لمن الدّيار بقنّة الحجر ... أقوين مذ حجج ومذ دهرقفر بمندفع النّجائب من ... ضفوى أولات الضّال والسّدردع ذا وعدّ القول في هرم ... خير البداة وسيّد الحضرقال فأطرق المهديّ ساعة ثمّ أقبل على حمّاد فقال له: قد بلغ أمير المؤمنين عنك خبر لا بدّ من استحلافك عليه، ثمّ استحلفه بأيمان البيعة وكلّ يمين محرجة ليصدقنّ عن كلّ ما يسأله عنه، فحلف له بما توثّق منه، فقال له: اصدقني عن حال هذه الأبيات ومن أضافها إلى زهير؟ فأقرّ له حينئذ أنّه قائلها، فأمر له وللمفضّل بما أمر به من صلة وشهرة أمرهما وكشفه. وللمفضّل من التّصانيف: كتاب الألفاظ، كتاب العروض، المفضّليّات وهي أشعار مختارة جمعها للمهديّ وفي بعض نسخها زيادة ونقص، وأصحّها الّتي رواها عنه أبو عبد الله بن الأعرابيّ.\"ياقوت الحموي. معجم الأدباء\"المفضل بن محمد بن يعلى، الضبي الكوفي. سمع سماك بن حرب، وأبا إسحاق السبيعي، وعاصم بن أبي النجود، ومجاهد بن رومي، وسليمان الأعمش، وإبراهيم بن مهاجر، ومغيرة بن مقسم. روى عنه أبو زكريا يحيى بن زياد الفراء، ومحمد بن عمر القصبي، وأبو كامل الجحدري، وأبو عبد الله محمد بن زياد بن الأعرابي وأحمد بن مالك القشيري، وغيرهم. وكان علامة راوية للآداب والأخبار، وأيام العرب، موثقا في روايته، وفد بغداد في أيام هارون الرشيد وأخبرنا الحسن بن أبي بكر أخبرنا مكرم بن أحمد القاضي، وأخبرنا محمد بن عمر النرسي أخبرنا محمد بن عبد الله بن إبراهيم الشافعي. قال: حدثنا صالح بن محمد الرازي حدثنا محمد بن عمر القصى حدثنا مفضل بن محمد النحوي حدثنا سماك بن حرب عن عكرمة عن ابن عباس. قال قال رسول الله صلى الله عليه وآله وسلم: «إن من الشعر حكما، وإن من البيان سحرا» أخبرني الحسين بن محمد بن جعفر الخالع- فيما إذن أن نرويه عنه- أخبرنا علي بن محمد بن السرى الهمذاني. قال: قال لنا جحظة قال الرشيد للمفضل الضبي: ما أحسن ما قيل في الذئب ولك هذا الخاتم الذي في يده وشراؤه ألف وستمائة دينار؟ فقال قول الشاعر:ينام بإحدى مقلتيه ويتقى ... بأخرى المنايا فهو يقظان هاجعفقال: ما ألقى هذا على لسانك إلا لذهاب الخاتم، وحلق به اليه. فاشترته أم جعفر بألف وستمائة دينار وبعثت به إليه وقالت: قد كنت أراك تعجب به. فألقاه إلى الضبي وقال خذه وخذ الدنانير، فما كنا نهب شيئا فنرجع فيه.\"الخطيب البغدادي، تاريخ بغداد",
  "genres": [
    "Literature"
  ],
  "author": "المفضل الضبي",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/54625577"
}