{
  "title": "Shell-Shocked: Feminist Criticism after Trump",
  "description": "A biting, funny, up-to-the-minute collection of essays by a major political thinker that gets to the heart of what feminist criticism can do in the face of everyday politics.Stormy Daniels offered a #metoo moment, and Anderson Cooper missed it. Conservatives don't believe that gender is fluid, except when they're feminizing James Comey. \"Gaslighting\" is our word for male domination but a gaslight also lights the way for a woman's survival.Across two dozen trenchant, witty reflections, Bonnie Honig offers a biting feminist account of politics since Trump. In today's shock politics, Honig traces the continuing work of patriarchy, as powerful, mediocre men gaslight their way across the landscape of democratic institutions.But amid the plundering and patriarchy, feminist criticism finds ways to demand justice. Shell-Shocked shows how women have talked back, acted out, and built anew, exposing the practices and policies of feminization that have historically been aimed not just at women but also at racial and ethnic minorities. The task of feminist criticism--and this is what makes it particularly well-suited to this moment--is to respond to shock politics by resensitizing us to its injustices and honing the empathy needed for living with others in the world as equals.Feminist criticism's penchant for the particular and the idiosyncratic is part of its power. It is drawn to the loose threads of psychological and collective life, not to the well-worn fabrics with which communities and nations hide their shortcomings and deflect critical scrutiny of their injustices. Taking literary models such as Homer's Penelope and Toni Morrison's Cee, Honig draws out the loose threads from the fabric of shock politics' domination and begins unraveling them.Honig's damning, funny, and razor sharp essays take on popular culture, national politics, and political theory alike as texts for resensitizing through a feminist lens. Here are insightful readings of film and television, from Gaslight to Bombshell, Unbelievable to Stranger Things, Rambo to the Kavanaugh hearings. In seeking out the details that might break the spell of shock, this groundbreaking book illustrates alternative ways of living and writing in a time of public violence, plunder, and--hopefully--democratic renewal.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Bonnie Honig",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/54616109-shell-shocked"
}