{
  "title": "Hate Thy Neighbor",
  "description": "An Enemies-to-Lovers Standalone Romance. Fresh out of a failed engagement, Olivia Hales is in dire need of a fresh start. Tired of being the charming and accommodating girl that always gets stomped on, she’s determined to change her outlook on life.When she finds her dream job in a small town in California, she thinks she’s finally found her place in life. That is, until she meets her new neighbor.  Roman Banks.Moody. Foul-mouthed. Jerk.And the hottest man on the planet.  At a sprawling six foot five, he was coldly distant and physically intimidating. Not only was her new neighbor a God that was good with his hands, he was also a grade-A jerk. Trapped on the same street, sharing the same space together, they’ve become entrenched in an addictive, ridiculous, never-ending game of insults and pranks that result in the destruction of two perfectly good homes. The tension between them is as thick as the walls of their houses are thin. Roman’s touch burned like fire even when his words were ice, and both of them will stop at nothing to make the others life hell.  In the midst of the pranks and the hate they harbor for each other, Olivia slowly pulls back the layers of the man next door and finds herself consumed with wanting to fix him and his past. When both enemies start to catch feelings for each other, Olivia finds herself hiding her own secrets, not wanting to lose another man in her life. Lines are drawn. Strict rules put into place. But that doesn’t stop Olivia from wanting to save the quiet, broody man next door.They say you’re supposed to love thy neighbor, but that was the furthest emotion she felt when thinking about Roman. Hate was all there was to their relationship. At the very least, that’s what she tried to tell herself.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary",
    "New Adult",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit"
  ],
  "author": "S.M. Soto",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/54620782-hate-thy-neighbor"
}