{
  "title": "Αντι-γόνη, Αντι-θεός, Αντι-τύραννος",
  "description": "Γιατί νοσεί H Πόλις ; Το κεντρικό ερώτημα στην αρχαία τραγωδία ποτέ δεν ήταν πιο επίκαιρο απ’ όσο σήμερα, καθώς η πάσχουσα ανθρωπότητα ζει, αγωνιά, νοσεί, επιζεί ή πεθαίνει στις συνθήκες της πανδημίας. Το ξεδίπλωμα της οιδιπόδειας τραγωδίας είχε δείξει ότι η Νόσος που αφανίζει την Πόλη δεν είναι απλώς μια παράλογη κατάρα των θεών ή μια φυσική καταστροφή χωρίς ανθρώπινη παρεμβολή, μια συνωμοσία ή κάποια πολιτική κατασκευή των κρατούντων. Πηγάζει από τις αντιφάσεις της φυσικής και κοινωνικής ιστορικής τάξης πραγμάτων, πυροδοτώντας τη μέχρι θανάτου σύγκρουση των ανθρώπων με ανεξέλεγκτες δυνάμεις που συνηθίζει να τις ονομάζει «μοίρα».Η Αντιγόνη του Σοφοκλή, σημείο αντιλεγόμενο μέσα στους αιώνες, συνεχίζει να βαδίζει και να μας συναντά εράσμια, αποφασιστική και με νου καθαρό, «καθώς η διάνοια του ανθρώπου περιπλανιέται υπό τη σκέπη του αδιανόητου» (Χαίλντερλιν). Τη συναντούμε κι εμείς, ακολουθώντας τις ατραπούς της διαλεκτικής που άνοιξαν ο Χαίλντερλιν και ο Μαρξ. Η αμφισημία της πρόθεσης αντί στο όνομά της της δίνει ένα νήμα. Πρόκειται για την Αντι-γόνη, τον αντ-άξιο γόνο των Λαβδακιδών, αλλά και το αντίθετο, εκείνη που σπάζει τον αιματηρό κύκλο, διεκδικώντας τη ζωή μιας κοινωνίας του συμφιλείν.Είναι Αντί-θεος, με την έννοια που έχει η ομηρική λέξη, του ισόθεου αλλά και του αντίπαλου του θεού, όπως τη χρησιμοποιεί ο Χαίλντερλιν :«Πριν ο ενάντιος θεός την αρπάξει πραγματικά, στέκεται αντιμέτωπή του με λόγο θαρραλέο, συχνά ακόμα και βλάσφημο, κι έτσι διατηρεί ζωντανή την άγια δυνατότητα του Πνεύματος».Αλλά είναι και Αντι-Tύραννος. Δεν συγκρούεται απλώς με τον κρατικό αυταρχισμό του Κρέοντα αλλά με το Κράτος καθεαυτό εν τη γενέσει του. Γιατί νοσεί η Πόλη ; Η Αντιγόνη, «δρώντας ενάντια στην εποχή, επί της εποχής και είθε υπέρ μιας μελλοντικής εποχής» (Νίτσε), έδειξε ότι τα «πρωτεία» του Κράτους δεν είναι η απάντηση στο ερώτημα και η λύση, αλλά μέρος του προβλήματος και φονική νόσος.",
  "genres": [],
  "author": "Σάββας Μιχαήλ",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/54614744------"
}