{
  "title": "Beautiful Melody",
  "description": "A merchant's daughter with a tragic past, an enchanted wolf, a mysterious masked man from the ball. and a threat of evil that could destroy them all.After the sudden and tragic loss of both of her parents, once a merchant’s daughter, Melody Prescott now works as a maid at the palace. Melody is taken in and adopted by the queen of the kingdom.At the palace, she lives a quiet life until one day she discovers a plot that threatens to put the kingdom and her very life in danger.From the scheming king, to the enchanted wolf that saved her life, to the masked man she met at the ball, Melody’s heart and her life are at risk as her quiet world becomes filled with danger and mystery.Will Melody survive, or will the looming darkness conquer the kingdom?Excerpt:“May I ask why you asked me to dance with you? Or is that information confidential?” His pale eyes sparkled as they searched her face.“Why, because I haven’t noticed you participating in any of the dances this evening,” was Melody’s excuse.She tried to keep from looking into his face, so she gazed beyond the ballroom to the gardens outside. The sun cast rays of warm light in through the windows, bathing the ballroom in orange light.“You are a terrible liar, my lady.” He drew her attention back to him. He twirled her in a circle then brought her back to himself. “What is the real reason?”Melody bit her lip, as if pained. She looked back over her shoulder and found the prince standing alone near the edge of the dance floor.“Ah. Avoiding the prince, are we?”Her gaze snapped back to the stranger. “Sir, that is not the reason-” she started.“You don’t have to make excuses with me, Princess. I saw you talking to him right before you asked me to dance.”Melody watched her partner with eyes narrowed as they moved in beat with the slow song. “Were you watching me?”He considered her a moment before answering. “Only a little,” he admitted with a smile. “You’re quite intriguing. First you run away from a prince. Then I find you hiding out in the gardens, and you run away from me. Sometime later, to avoid dancing with the prince, you ask a perfect stranger to dance with you.” He quietly chuckled, and Melody’s cheeks heated as she stared at the buttons of his black shirt.“What is your name, then?” she asked to cover up her embarrassment.He only looked at her, and she tried again, “You said I asked a perfect stranger to dance. What, then, is your name, sir?”A retelling of Beauty and the Beast, Beautiful Melody is the first book in the Happily Ever After series. It can be read as part of the series or as a standalone. Perfect for anyone who enjoys lighthearted fantasy and fairy tale adventures with clean romance and humor.",
  "genres": [],
  "author": "K.E. Drake",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/54622279-beautiful-melody"
}