{
  "title": "Border and Rule: Global Migration, Capitalism, and the Rise of Racist Nationalism",
  "description": "In Border and Rule, one of North America's foremost thinkers and immigrant rights organizers delivers an unflinching examination of migration as a pillar of global governance and gendered racial class formation.Harsha Walia disrupts easy explanations for the migrant and refugee crises, instead showing them to be the inevitable outcomes of conquest, capitalist globalization, and climate change generating mass dispossession worldwide. Border and Rule explores a number of seemingly disparate global geographies with shared logics of border rule that displace, immobilize, criminalize, exploit, and expel migrants and refugees. With her keen ability to connect the dots, Walia demonstrates how borders divide the international working class and consolidate imperial, capitalist, ruling class, and racist nationalist rule. Ambitious in scope and internationalist in orientation, Border and Rule breaks through American exceptionalist and liberal responses to the migration crisis and cogently maps the lucrative connections between state violence, capitalism, and right-wing nationalism around the world.Illuminating the brutal mechanics of state formation, Walia exposes US border policy as a product of violent territorial expansion, settler-colonialism, enslavement, and gendered racial exclusion. Further, she compellingly details how Fortress Europe and White Australia are using immigration diplomacy and externalized borders to maintain a colonial present, how temporary labor migration in the Arab Gulf states and Canada is central to citizenship regulation and labor control, and far-right nationalism is escalating deadly violence in the US, Israel, India, the Philippines, Brazil, and across Europe, while producing a disaster of statelessness for millions elsewhere.A must-read in these difficult times of war, inequality, climate change, and global health crisis, Border and Rule is a clarion call for revolution. The book includes a foreword from renowned scholar Robin D. G. Kelley and an afterword from acclaimed activist-academic Nick Estes.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Race",
    "Social Justice",
    "Theory",
    "Philosophy"
  ],
  "author": "Harsha Walia",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/54626107-border-and-rule"
}