{
  "title": "Punk Rock & Mental Illness Vol. 1 A Love Story More Stable Than We Are: Writings, Poetry, Insanity, Photography, & Excerpts of A Monster, or A Goddess, Not Sure Which One Though...",
  "description": "This is the first in a series of poetry/memoir styled books to be released and will consist of professionally taken photos, as well as, written experiences, rational/irrational middle of the night thoughts, unpublished pieces of poetry, prose, song lyrics, excerpts from personal and professional journals, short stories, feelings of love, rage, hate, and a lot of hangovers. Though she may come off as a bit abrasive, her raw emotional intensity is absolutely intoxicating; she can be a brutal force to be longed for and to be reckoned with. She is a universally talented person and very self-motivated which leads to her running her own business helping others who share the same feeling about literature. Never will you see someone so relentlessly hellbent on trying to find a balance to manage the psychiatric delirium and instability that holds her mind, and sanity, captive, meanwhile, still trying to selflessly help others with the same issues.Aside from her crude language and the fact she's not afraid to 'go there', her work can be viewed as humbling and honest. Emily is a one of a kind compassionate bitch, but her loud/in your face writing style will reek of stale cigarettes and ether but wash down smooth like a cheap Irish whiskey, which will distract you long enough to sucker punch you right in the face. The harsh reality of growing on your own, and having to do so at such a young age, ignited the fuse that led her to discover her talent for explosive means of expression.So come experience the spirit breaking adventures of teenage homelessness, poverty, friends, death, depression, love, survival, playing music, skateboarding, heartache, psych wards, dysfunctional family, legal troubles, drugs, traveling, sex, DIY punk music scene, traveling, and more.",
  "genres": [],
  "author": "Emily    Ryan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/54643343-punk-rock-mental-illness-vol-1-a-love-story-more-stable-than-we-are"
}