{
  "title": "How to Lure a Hunter",
  "description": "Alexei  When Marcus Church brings his brother Claude in to help solve an unusual murder, I’m positive he did it just to disrupt my monotonous life. None of my coworkers in the Vampire Related Crimes unit seem to understand that I want to keep a wall between me and everyone else—especially Claude, who does everything he can to break through it with an annoying smile. After more vampires begin to die, Claude pinpoints the actions of the killers to a group of vampire hunters, leaving us in a race to stop them. When I discover that I have a target on my back, I’m surprised that Claude insists on staying by my side, even when things go from bad to worse. I’m determined to keep him out—I’ve lost enough people in my life—but I can’t stop feeling something every time he breaks through. Claude When I reunited with my brother, I never imagined it’d throw me right into Alexei Karsynov’s path. He’s short-tempered, stubborn, and dangerously adorable whenever he smiles—he just doesn’t realize it yet. When Marcus asks me to help with a case, it gives me the excuse I need to get closer to Alexei, but what I discover threatens to change everything. Suddenly, I find myself wanting to do anything to protect Alexei and to see him smile, despite his efforts to keep his distance from others. I’m determined to show him that he can’t live in the past when his future is so much brighter. How to Lure a Hunter is a 107k word book that Clothes so bright they could cause retina damage, a ridiculous amount of gifts showered on a reluctant recipient, a cranky Russian with a soft spot he tries to hide, a library full of books that need to be treated with the proper respect, some possibly unhealthy sibling teasing, and a sunshiny 300-year-old vampire with an unexpected protective streak.",
  "genres": [
    "M M Romance",
    "Vampires",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Mystery",
    "Audiobook"
  ],
  "author": "Alice  Winters",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/54628489-how-to-lure-a-hunter"
}