{
  "title": "Wood",
  "description": "This isn't a romance about billionaires, movie stars, or models. This is a story of two ordinary, working-class men, dealing with life’s real problems, and trying to find love along the way.It’s been a long seventeen years but Herschel Wood Jr. is finally a free man and he’s looking forward to reconnecting with his old cellmate, Bishop Stockley, who promised him a place to stay and some help getting back on his feet. Wood had a good life once upon time when he’d owned one of the most successful tattoo shops on the Virginia Beach Oceanfront – until a fatal accident that was his fault cost him everything.Now at forty-six years old, all Wood wants is to work in another shop on the beach and find a mature, easygoing man to settle down with. But when he gets to his new place and finds he has to share the small trailer with Bishop’s childhood friend, he wasn’t expecting a sexy, smart-mouthed brat that enjoys pushing a man to his limits.Wood pressed in tight until there was only misunderstanding between them, his mouth mere inches from Trent’s parted lips. “You wanted to get a reaction out of me you annoying, immature little shit… now you’ve got one.”Trent Armstrong has never been considered a catch. He’s a twenty-nine year old laborer, an ex-con, and not the easiest person to get along with. He’s used to being the one people cast to the side when they're done with him. Everyone he’s ever cared about has walked out of his life without a backward glance, so he’s used to the loneliness. His foul mouth and quick temper are a great defense mechanism and an easy way to hide his hurt.From the moment the tattooed, silver-haired man walked into the house there had been nothing but tension, side-eyeing, and sparks between them. Trent has always held back a side of himself that he’s terrified to explore, and without warning Wood’s voice, his maturity, that maddening scent, and even his damaged past all trigger feelings that Trent thought he’d buried deep long ago.Trent went completely still when Wood dragged his nose over his forehead and down the side of his face. His voice was shaky, and his breaths were hot and swift along Wood’s throat. “What the hell are you doing?”“I’m doing what you want me to do.” Wood whispered. “I’m playing your bullshit game, Trent.”The True Lover's Stories are connected standalones. Each title features a different couple but will contain previously mentioned characters.No multiple pairings. No cliffhangers. Ends with a HEA. Note: This is a steaming agnsty, age gap, new-to-love romance. Trigger Warning: AA Recovery",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Gay",
    "LGBT",
    "Contemporary Romance"
  ],
  "author": "A.E. Via",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/54651706-wood"
}