{
  "title": "Long Live Death: The Keys to Victory in the Spanish Civil War",
  "description": "Few wars are more shrouded in myth than the Spanish Civil War. For decades, histories have focused on politics at the expense of studying the military lessons of this pivotal conflict. This book provides a welcome addition to the growing body of work that examines the war as a military rather than political event.Author A.H. Lloyd goes beyond a description of the campaigns to explain why it unfolded the way it did. Drawing upon more than a decade of experience as a military planner and utilizing his formidable storytelling skills, he has created a compelling yet accessible work that explores the conflict like never before.A detailed chronology helps outline the course of events and also includes developments outside of Spain, which are necessary to understanding the ebb and flow of foreign aid and influence. Clear maps provide a visual representation of the changes of territorial control and the courses of the various offensives. The book also includes a short illustrated guide to the tanks and aircraft involved, providing the reader with additional understanding of how emerging technologies shaped the conflict.As part of his wide-ranging analysis, the author is perhaps the first historian to develop a methodology that explains Franco's strategic thinking, and how many of his decisions that have been widely condemned are simply misunderstood. Franco's shrewd but cautious strategy is contrasted with the Republican leadership's many failures, and the book chronicles how the Republic squandered its many advantages and thereby lost the war.The author also explains how the Republic might have won, what the victory could have looked like, and how it would have shifted the balance of power in Europe. Would a Red Spain have forced an uneasy alliance between Nazi Germany and Great Britain?Long Live Death provides a new way of understanding the Spanish Civil War, making it important to dedicated historians as well as casual readers wishing to learn more about the topic.",
  "genres": [],
  "author": "A.H. Lloyd",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/54629942-long-live-death"
}