{
  "title": "Unlikely Destinations: The Lonely Planet Story",
  "description": "Founders of the phenomenally successful publishing company Lonely Planet, Tony and Maureen Wheeler have produced travel guides to just about every corner of the globe.Lonely Planet Publications was born in 1973 when the Wheelers self-published a quirky travel guide, Across Asia on the Cheap. This was quickly followed by what soon became the backpackers' bible, South-East Asia on a Shoestring. Going boldly where no other travel publisher had ventured, they catered to a new generation of independent, budget-conscious travelers long before the advent of mass tourism.Unlikely Destinations: The Lonely Planet Story is a unique mix of autobiography, business history and travel book. It traces Tony and Maureen Wheeler's personal story as well as the often bumpy evolution of their travel guide business into the world's largest independent travel publishing company.Not surprisingly, after thirty years in the business, the Wheelers have an unrivaled set of anecdotes which they share in Unlikely Destinations: The Lonely Planet Story. They have been hassled by customs, cheated by accountants, let down by writers, banned in Malawi, berated for their Burma guide and had books pirated in Vietnam. Tony has been gored by a cow in Benares, declared dead around the world in an assortment of gruesome and greatly exaggerated accounts and their company has been accused of the \"Lonely Planetization\" of the world.Through it all, from the heady days of discovery in the '70s to the rocky patch after the September 11th terrorist attacks, the Wheelers' passion for the planet and traveling hasn't diminished and comes shining through in this enthralling travelogue. But above all, their memoir reveals the spirit of adventure that has made them, according to the New York Daily News, \"the specialists in guiding weird folks to weird places.\"",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Business",
    "History",
    "Biography"
  ],
  "author": "Tony Wheeler",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/546392.Unlikely_Destinations"
}