{
  "title": "Soul for a Soul: The Masters Reimagined Volume 2",
  "description": "A Masters Reimagined Novelette Before St. Augustine earns his position as bishop, he and his teenage son must save the good name of the early Christian Church and rescue an altar boy from the clutches of a soul-capturing daemon. To do so, one of the two must travel to an unknown spiritual realm called the Neither, which lies between Purgatory and Hell, risking their eternal soul in the process. This Masters Reimagined tale is written as if Gothic painter Michael Pacher painted his St. Augustine Confounds the Devil masterpiece specifically for the story. The painting depicts a daemon-like creature in all its bizarre detail interacting with a human St. Augustine of Hippo. Soul for a Soul posits Augustine meeting up with the daemon bearing the Book of Vices in 4th Century northern Italy during a tumultuous period of the Christian Church. Amongst backstabbing, spiritual mysticism, murder, and unspeakable acts within the confines of the early Church, this fast-paced novelette is a gripping parable that interweaves historical fact with spine-tingling fantasy and attempts to answer what really happened to Augustine’s son. INTERVIEW WITH THE AUTHOR Q - What is The Masters Reimagined 2? A - In The Masters Reimagined 2, eight authors unite under the inspiration of classic works of art. Masters like Leonard da Vinci, Edvard Munch, Franz Marc, Theodore Gericault, Jacques-Louis David, George Adolphus Storey, and Michael Pacher inspired the authors of the Alvarium Experiment in their quest to reinterpret, reinvent, and reshape selected visual arts in story form through speculative twists and turns. This is the fifth project by the Alvarium Experiment, a consortium of accomplished and award-winning authors. Q - Where should a reader start when selecting a short story to read in The Masters Reimagined? A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. The book description will explain the premise for each particular story. About the Author JOHN HOPE lives within his unstable mind in central Florida with his wife, two teenage kids, and a frightening collection of Pink Panthers. With over 40 publications in genres spanning science fiction, fantasy, young adult, middle grade, children’s picture book, historical fiction, and nonfiction history, his work appears in hardcover, paperback, eBook, and audiobook. A portion of these publications are included in anthologies and magazines, including The Prometheus Saga, Return to Earth, and The Masters Reimagined , projects of the Alvarium Experiment. John gives informational and inspirational presentations to schools, writing groups and clubs, and various conferences and has won the honorable Kaye Coppersmith Award from the Florida Writers Association for exemplifying helping fellow writers achieve their life’s dreams. An active long-distance runner, John has run over 36,000 miles, captained the University of Central Florida’s Cross Country team, and directed various road race charity runs. Visit John at www.johnhopewriting.com for updates on his projects, links to purchase publications, and info about upcoming appearances.",
  "genres": [],
  "author": "John Hope",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/54636874-soul-for-a-soul"
}