{
  "title": "War Academy: Teen Recruits",
  "description": "An endless war has claimed every available adult. Now, Ebrus’s war generals turn their desperate eyes on their teenagers…Beatrice Stone lives a relatively peaceful life in the country as a shepherdess, doing what she can to provide for her family while her parents fight in an endlessly bloody war. It’s been five years since her parents have left with no indication if they are alive or dead. One day, she receives a draft notice demanding her presence at the War Academy, where she must learn to fight as a soldier. Leaving behind her young siblings and aging grandmother, Bea must dig deep to keep up her spirits while learning combat in the large, unfamiliar city of Steelminster.Within Steelminster’s walls, the Blue Moon Circus stands at the ready to entertain and enchant. Among its crew is Cyra, the fiercely independent knife-throwing wonder. Upon receiving her draft notice, her distrust and misgivings morph into a bitter resentment for the Ebrus government. As she enters the War Academy, she is prepared for whatever challenges they might throw at her. What she doesn’t count on is lowering her guard just enough to leave her heart vulnerable…Miki is thirteen years old – two years shy of the new draft age. Yet he finds himself plucked from the streets of Saltborn, where he begs for scraps and sleeps in alleyways that stink of rotting fish. He is given a choice: life in prison for thievery or to enroll in the War Academy to fight for his country. The choice is easy, but the brutal combat training proves to be more daunting than he thought. He is more often than not sent to the kitchens to work alongside the mysterious Chef Zako, where he dreams of one day living a life free from hunger and pain.Bea, Cyra, and Miki make an unlikely trio, but with the threat of battle on the horizon, they discover the importance of friendship and loyalty to combat their hardships at the academy and on the battlefield.Dive into this non-magical YA fantasy tale with refreshingly relatable characters, heart-pounding action, and themes of friendship and perseverance in the face of calamitous war.",
  "genres": [],
  "author": "Zifflin",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/54634914-war-academy"
}