{
  "title": "We Should All Be Millionaires: A Woman’s Guide to Earning More, Building Wealth, and Gaining Economic Power",
  "description": "Are you ready to fill your life with more peace, power, and joy?We Should All Be Millionaires details a realistic, achievable, step-by-step path to creating the support, confidence, and plan you need to own your success and become the millionaire the world needs you to be.Only 10 percent of the world’s millionaires are women, making it difficult for women to wield the economic power that will create lasting equality. Whatever is stopping you from having seven figures in the bank—whether it’s shaky confidence, knowledge gaps when it comes to wealth building tactics, imposter syndrome, a janky mindset about money (it’s okay, we’ve all been there!), or simply not knowing where to begin—this book shows you how to clear every obstacle in your way, show up, and glow up.We Should All Be Millionaires will forever change the way you think about money and your ability to earn it.In this book, Rachel Rodgers— a Black woman, mother of four, attorney, business owner, and self-made millionaire— shares the lessons she’s learned both in her own journey to wealth and in coaching hundreds of women through their own journeys to seven figures.Inside, you’ll learn:Why earning more money is not “selfish” or “greedy” but in fact, a revolutionary act that brings the economy into balance and creates a better world for all.Why most of the financial advice you’ve heard in the past (like “skip your daily latte to save money”) is absolute, patriarchal nonsense.An eye-opening history lesson on how women and people of color have been shut out of the ability to build wealth for centuries—and how we can fix this.How to stop making broke-ass decisions that leave you feeling emotionally and financially depleted and start making million-dollar decisions instead.Why aiming to earn $100K per year is not enough, and why you need to be setting your goals much higher.Strategies to bring more money in the door and fatten your bank account immediately. (Including Rodgers’$10K in 10 Days Challenge which hundreds of women have completed—with incredible results.)It’s time to construct an entirely new attitude about money, claim your power, and build the financial security that you need and deserve — so you can stop just surviving, and start thriving. Let’s begin.",
  "genres": [
    "Nonfiction",
    "Business",
    "Finance",
    "Self Help",
    "Audiobook",
    "Money",
    "Personal Development"
  ],
  "author": "Rachel Rodgers",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/54626274-we-should-all-be-millionaires"
}