{
  "title": "Harlem Shuffle",
  "description": "From the two-time Pulitzer Prize-winning author of The Underground Railroad and The Nickel Boys, a gloriously entertaining novel of heists, shakedowns, and rip-offs set in Harlem in the 1960s.“Ray Carney was only slightly bent when it came to being crooked…” To his customers and neighbors on 125th street, Carney is an upstanding salesman of reasonably priced furniture, making a decent life for himself and his family. He and his wife Elizabeth are expecting their second child, and if her parents on Striver’s Row don’t approve of him or their cramped apartment across from the subway tracks, it’s still home. Few people know he descends from a line of uptown hoods and crooks, and that his façade of normalcy has more than a few cracks in it. Cracks that are getting bigger all the time. Cash is tight, especially with all those installment-plan sofas, so if his cousin Freddie occasionally drops off the odd ring or necklace, Ray doesn’t ask where it comes from. He knows a discreet jeweler downtown who doesn’t ask questions, either. Then Freddie falls in with a crew who plan to rob the Hotel Theresa—the “Waldorf of Harlem”—and volunteers Ray’s services as the fence. The heist doesn’t go as planned; they rarely do. Now Ray has a new clientele, one made up of shady cops, vicious local gangsters, two-bit pornographers, and other assorted Harlem lowlifes. Thus begins the internal tussle between Ray the striver and Ray the crook. As Ray navigates this double life, he begins to see who actually pulls the strings in Harlem. Can Ray avoid getting killed, save his cousin, and grab his share of the big score, all while maintaining his reputation as the go-to source for all your quality home furniture needs? Harlem Shuffle’s ingenious story plays out in a beautifully recreated New York City of the early 1960s. It’s a family saga masquerading as a crime novel, a hilarious morality play, a social novel about race and power, and ultimately a love letter to Harlem. But mostly, it’s a joy to read, another dazzling novel from the Pulitzer Prize and National Book Award-winning Colson Whitehead.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Audiobook",
    "Mystery",
    "Crime",
    "Literary Fiction"
  ],
  "author": "Colson Whitehead",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/54626223-harlem-shuffle"
}