{
  "title": "The Soul of a Rogue",
  "description": "A lady who swore she’d never love again. A bitter rogue out to avenge horrors of the past. Two hardened souls are forced together in an adventure to break a curse, sparking to life a sizzling attraction that will not be denied in this newest novel from USA Today Bestseller, K.J. Jackson.A lady who swore she’d never love again.Eliana Graham, Dowager Countess of Raplan, had once had it all. An earl for a husband with all the respect, power and wealth that came with it—everything she’d worked toward her entire life. And then, within a year, it was gone in an instant. Adrift since the death of her husband, Elle has filled her days reveling in all the freedoms afforded to a young widow. But when the opportunity appears to help her niece solve the mystery—and the curse—of the Box of Draupnir, she jumps on it. Anything to keep her mind occupied, her body in motion…and her heart cold.A bitter rogue out to avenge horrors of the past.Rune Smith has had one goal since his father was murdered years ago. Complete his father’s life work and in the process, avenge his father’s death. Every step he’s taken since he watched his father die has been filled with that purpose. So when he’s finally within grasp of completing his father’s dream, he’s irritated to learn he’ll have to team up with a silly young chit of the ton to get the answers he needs. Lady Raplan’s a widow, beautiful, entitled, self-absorbed, and the last thing he needs interfering in his life.Two hardened souls team up to break the curse of the Box of Draupnir.With an ancient curse threatening their every move, this unlikely duo fights a sizzling attraction neither can deny. But love is not for either of them—they make a pact upon that very vow. Until the secrets become too dangerous, and the only thing that can possibly save them both from the curse is a love that will last a lifetime.Join the adventure today! You’ll love The Soul of a Rogue, the third in the Box of Draupnir series and a can’t-miss riveting regency historical romance by USA Today bestselling author, K.J. Jackson.Note: The novels in the Box of Draupnir series by K.J. Jackson are each stand-alone stories and can be read individually in any order. These historical romances are set in the Regency and Victorian eras, and do not shy away from scenes with steamy heat, occasional naughty language, and moments that might possibly make you squirm.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical Fiction"
  ],
  "author": "K.J. Jackson",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/54666825-the-soul-of-a-rogue"
}