{
  "title": "‫الداء والدواء: الجواب الكافي لمن سأل عن الدواء الشافي Al Jawābul kāfi liman sa'ala 'an Dawā'i Shaafi‬",
  "description": "أبو عبد الله شمس الدين محمد بن أبي بكر بن أيوب بن سعد بن حريز الزرعي (691هـ - 751هـ/1292م - 1350م) المشهور باسم \"ابن قيّم الجوزية\" أو \"ابن القيّم\".قال ابن حجر العسقلاني: «ولو لم يكن للشيخ تقي الدين من المناقب إلا تلميذه الشهير: الشيخ شمس الدين ابن قَيِّم الجوزية، صاحب التصانيف النافعة السائرة، التي انتفع بها الموافق والمخالف، لكان غاية في الدلالة على عظم مَنْزلته». وقال: «كان جرئ الجنان، واسع العلم، عارفاً بالخلاف ومذاهب السلف».وقال القاضي برهان الدين الزرعي: «ما تحت أديم السماء أوسع علمًا منه.»وقال شيخه جمال الدين المزي: «هو في هذا الزمان كابن خزيمة في زمانه»وقال ابن رجب الحنبلي: «ولا رأيت أوسع منه علماً، ولا أعرفَ بمعاني القرآن والسنة، وحقائق الإيمان منه، وليس هو بالمعصوم، ولكن لم أر في معناه مثله.»وقال الشوكاني: «وكل تصانيفه مرغوب فيها بين الطوائف، وله من حسن التَّصَرُّف مَعَ العذوبة الزَّائِدَة وَحسن السِّيَاق مَالا يقدر عَلَيْهِ غَالب المصنفين بِحَيْثُ تعشق الإفهام كَلَامه وتميل إِلَيْهِ الأذهان وتحبه الْقُلُوب».وقال جلال الدين السيوطي: «صنَّف، وناظر، واجتهد، وصار من الأئمة الكبار في التفسير، والحديث، والفروع، والأصلين، والعربية.»وقال الصَّلاح الصَّفَدِي: «اشتغل كثيراً وناظر، واجتهد، وأكبَّ على الطلب، وصَنَّف، وصار من الأئمة الكبار في: علم التفسير، والحديث، والأصول: فقهاً وكلاماً، والفروع، والعربية، ولم يخلف الشيخ العلامة تقي الدين ابن تَيْمِيَّة مثله».قال ابن ناصر الدين الدمشقي: «أحد المحققين، عَلَمُ المصنفين، نادرة المفسرين».وقال الحافظ الذهبي: «الفقيه، الإمام، المفتي، المتفنن، النحوي». وقال أيضًا: «عُني بالحديث متونه ورجاله، وكان يشتغل في الفقه ويجيد تقريره، وفي النحو وَيَدْرِيه، وفي الأصلين».وقال أبو المحاسن الحسيني الدمشقي: «الشيخ، الإمام، العلامة، ذو الفنون أفتى، ودرَّس، وناظر، وصنف، وأفاد».قال تقي الدين المقريزي: «برع في عدة علوم، ما بين: تفسير، وفقه، وعربية، وغير ذلك، ولزم شيخ الإسلام، وأخذ عنه علماً جَمًّا، فصار أحد أفراد الدنيا».وقال ابن تَغْرِي بَرْدِي: «كان بارعاً في عدة علوم، ما بين: تفسير، وفقه، وعربية، ونحو، وحديث، وأصول، وفروع، ولزم الشيخ تقي الدين بن تيمية. وأخذ عنه علماً كثيراً، حتى صار أحد أفراد زمانه».وقال السخاوي: «العلامة، الحجة، المتقدم في: سعة العلم، ومعرفة الخلاف، وقوة الجنان».وقال ابن العماد الحنبلي: «الفقيه الحنبلي- بل المجتهد المطلق - المفسر، النحو، الأصولي، المتكلم».وقال ابن شطي: «ذو اليد الطولى، الآخذ من كل علم بالنصيب الأوفى. تَفَنَّن في علوم الإسلام، فكان إليه المنتهى في: التفسير، وأصول الدين، وكان في الحديث والاستنباط منه لا يُجَارى، وله اليد العليا في الفقه وأصوله، والعربية، وغير ذلك».وقال ابن كثير الدمشقي: «صار فريداً في بابه في فنون كثيرة. وبالجملة: كان قليل النظير في مجموعه وأموره وأحواله»الجواب الكافي لمن سأل عن الدواء الشافي أو الداء والدواء. كتاب الإمام ابن قيم الجوزية (691هـ - 751هـ). موضوع فصوله هو إصلاح وتقويم وتهذيب النفس بحسب السنة النبوية الشريفة، يمر القارئ بين فصول الكتاب بالنصائح والمآخذات، ويحاول المؤلف من خلالها معالجة آفات وشرور الأنفس الآمرة بالسوء، ويوضح الضعف والخلل فيها، ويغلق الأبواب التي يدخل منها الشيطان ويكشف عن مكائده وحيله التي يستعبد بها الناس إذا ركنوا للدنيا الفانية وانغمسوا في ملذاتها وشهواتها واغتروا بها فيقعون في السيئات والكبائر مما يرجع عليهم بأنواع الهم والغم والنكد. فيعانون امراضا نفسية لا يجدون لها علاجا الا بالتوبة والانابة والعمل الصالح.والكتاب هو جواب عن سؤال سائل لابن القيم وهو:\" ما تقول السادة العلماء أئمة الدين رضى الله عنهم أجمعين في رجل ابتلى ببلية وعلم أنها إن استمرت به أفسدت عليه دنياه وآخرته؟ وقد اجتهد في دفعها عن نفسه بكل طريق فما يزداد إلا توقدا وشدة فما الحيلة في دفعها؟ وما الطريق إلى كشفها؟ فرحم الله من أعان مبتلى والله في عون العبد ما كان العبد في عون أخيه أفتونا مأجورين رحمكم الله تعالى\"",
  "genres": [
    "Religion",
    "Islam",
    "Nonfiction",
    "Psychology",
    "Philosophy",
    "Self Help",
    "Spirituality"
  ],
  "author": "Ibn Qayyim al-Jawziyya",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/54659055"
}