{
  "title": "The Liar's Girl",
  "description": "Her first love confessed to five murders … but the truth was so much worse. Will Hurley was an attractive, charming, and impressive student at Dublin’s elite St. John’s College—and Ireland’s most prolific serial killer. Having stalked his five young victims, he drowned them in the muddy waters of the Grand Canal. Sentenced to life imprisonment when he was just nineteen, Will is locked away in the city’s Central Psychiatric Hospital. Freshman Alison Smith moved to the Big Smoke to enroll in St. John’s and soon fell hard for Will Hurley. Her world bloomed … and then imploded when Liz, her best friend, became the latest victim of the Canal Killer—and the Canal Killer turned out to be the boy who’d been sleeping in her bed. Alison fled to the Netherlands and, in ten years, has never once looked back. When a young woman’s body is found in the Grand Canal, Garda detectives visit Will to see if he can assist them in solving what looks like a copycat killing. Instead, Will tells them he has something new to confess—but there’s only one person he’s prepared to confess it to. The last thing Alison wants is to be pulled back into the past she’s worked so hard to leave behind. Reluctantly, she returns to the city she hasn’t set foot in for more than a decade to face the man who murdered the woman she was supposed to become. Only to discover that, until now, Will has left out the worst part of all … “An absolute belter of a book…[A] stand-out book in the thriller genre. Real and sympathetic characters, a flawlessly paced plot and a genuinely original premise.” —Gillian McAllister, Sunday Times bestselling author “Read The Liar’s Girl with the lights on. A thrilling whodunit with a shocking final twist.” —A. J. Banner, USA Today bestselling author “ The Liar’s Girl is an addictive page-turner that…ladles out the suspense like spoonfuls of sugar, building to a heady rush of tension—and a heartbreaking final twist in the tale.” —Jo Furniss, author of the bestselling All the Little Children “Slick, smart, and stylish suspense. Characters so real I felt I knew them personally, a plot so taut it squeaked, and deeply poignant nods to the loss of innocence that every teenager craves and despairs. Really clever.” —Holly Seddon, USA Today bestselling author",
  "genres": [
    "Mystery",
    "Thriller",
    "Audiobook",
    "Fiction",
    "Mystery Thriller",
    "Crime",
    "Suspense"
  ],
  "author": "Catherine Ryan Howard",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/54655299-the-liar-s-girl"
}