{
  "title": "Queen Victoria",
  "description": "Known for its advances in literature, industrialization, politics, and science, the Victorian era was a prominent time in British history. However, author Lytton Strachey remembers Queen Victoria as a person instead of just focusing on her accomplishments. First starting with a brief history of her predecessors and origins, Victoria was crowned just as she came of age. Having only been eighteen, Queen Victoria was widely unfamiliar to her subjects when she was coronated. While her advisors and elders attempted to train her for her regal duties and present her to society, Victoria struggled to adjust to her new life. However, after a short period of adjustment, Victoria transformed into an iconic figure, known and celebrated for her elevated sense of morality. In 1840, Victoria married her cousin, Prince Albert, a match arranged by their families. But while Albert brought financial success, he was still unpopular in high society London, unlike his wife, who was growing to be more beloved every day.First published in 1921, Lytton Strachey's Queen Victoria follows the inventive biographical style Strachey created, featuring witty, irreverent prose paired with the focus on human characteristics rather than just their achievements. Told in relation to the prominent figures in each stage of her life, Queen Victoria is an intimate perspective of the legendary ruler. Praised for its accuracy and entertainment, Queen Victoria led Lytton Strachey to be awarded the James Tait Black Memorial Prize, one of the oldest awards in British literature.This edition of Queen Victoria by Lytton Strachey features an eye-catching new cover design and is presented in a font that is both modern and readable. With these accommodations, this edition is accessible and appealing to contemporary audiences, restoring Queen Victoria to modern standards while preserving the original innovation and insight of Lytton Strachey's work.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Biography Memoir",
    "Classics",
    "British Literature",
    "Victorian"
  ],
  "author": "Lytton Strachey",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/54667207-queen-victoria"
}