{
  "title": "Scamdemic - The COVID-19 Agenda: The Liberal's Plot To Win The White House",
  "description": "Real pandemics don't rely on faulty prediction models, biased reporting, politicized science, exaggerated mortality rates, and inflated death statistics. Scamdemic, a combination of the words scam and pandemic defines the mainstream media's orchestration in creating a COVID-19 hysteria. This book is not stating that the COVID-19 virus isn't a threat, this book exposes the exaggeration and fearmongering of the COVID-19 virus threat to panic the population.The mainstream media in its propaganda campaign censors any critical and independent thought that conflicts with its media message. The mainstream media has become the purveyor of misinformation, half-truths, woke propaganda, and the never relenting push for larger government. One example of how the mainstream media oversells and dramatizes news, especially negative news, is illustrated by the reporting of Hurricane Florence. When Hurricane Florence headed toward the U.S. coast in 2018, the news broadcast hourly progress reports. One reporter's live shot went viral. He showed himself struggling against the fury of the oncoming hurricane in South Carolina, digging his feet into the ground, to steady himself against the onslaught of the \"gale force\" wind, yelling so his voice could be heard above the wind's noise. Unbeknownst to the reporter, during his live dramatic shot, residents calmly strolled behind the reporter, unaffected by the hurricane winds. The reporter, not seeing the residents behind him, foolishly continued his dramatic struggle against the wind. And thus, the fake news was exposed.  I'm the guy walking behind the fake news reporting and exposing it. After the fake news media panicked the population, state governors capitalized on the weakened psychology to declare a \"State of Emergency\" that gave them complete authoritarian control to enforce unnecessary socioeconomic lockdowns. What was sold was a two-week lockdown to flatten the curve that turned into an 18-month lockdown, that still continues in parts of the country. These lockdowns are a socialist Democrat's dream. Lockdowns isolated, controlled and trained people into strict government obedience. Welcome to COVID-1984, the dystopian future we feared has arrived. George Orwell would be proud. The lockdowns suspended our constitutional rights and killed Trump's booming U.S. economy. The scamdemic lockdowns continue even as the death rate from COVID-19 has flatlined across the nation. Still, state governors refuse to release their economic stranglehold and restore our constitutional rights.",
  "genres": [],
  "author": "John Iovine",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/54662102-scamdemic---the-covid-19-agenda"
}