{
  "title": "Brian Wilson",
  "description": "Brian Wilson is a musical genius. Ever since British press agent Derek Taylor launched a publicity campaign with that theme to promote the landmark LP Pet Sounds in 1966, some variation of that claim has been obligatory when discussing the significance of The Beach Boys' founder and chief composer.Originally designed to liberate Wilson from his outmoded image as a purveyor of sun-and-surf teen pop so the symphonic sophistication of his music might be properly appreciated, the assertion has been repeated so often in the forty-plus years since as to render it virtually meaningless. Indeed, if anything, the label today seems an albatross around the man's neck, inasmuch as Wilson's slow-but-steady reemergence as a working musician since 1998 after three decades of mental illness and drug abuse, has been freighted with expectations that he again produce something as epochal as Good Vibrations to justify the adoration he inspires in impassioned defenders.Brian Wilson interrogates this and other paradigms that stymie critical appreciation of Wilson's work both with The Beach Boys and as a solo artist. This is the first study of Wilson to eschew chronology for a topical organization that allows discussion of lyrical themes and musical motifs outside of any prejudicial presumptions about their place in the trajectory of his career.The chapter on lyrics explores questions of quality, asking why the words to Wilson's songs are often considered a detriment, before surveying such tendencies as melancholy and introspection, the conceit of childlike wisdom, his depiction of women, and Americana/nostalgia.The section on music focuses on his falsetto, the famous harmonies, the peculiar whiteness of The Beach Boys' sound, as well as song structure.A final chapter on iconicity asks how rock criticism's investment in auteurship both maintains and limits his reputation.Finally, Curnutt examines what Brian Wilson means to his most fervent fans. Together, these issues emphasize the often overlooked point that, despite his status as a 'living legend', Brian Wilson does not always fit neatly into the paradigms of taste and value by which critics grant certain artists entry into the pantheon of pop and rock importance.Finalist, ForeWord Reviews Book of the Year Awards 2012, Performing Arts and Music (Adult Non-Fiction)",
  "genres": [
    "Biography",
    "Music"
  ],
  "author": "Kirk Curnutt",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/12651648-brian-wilson"
}