{
  "title": "The De-Coding of Jo: Hall of Ignorance",
  "description": "TRIGGER WARNINGWhat would you do if you accidentally discovered a holographic portal into the cosmos, in the basement of your high school’s library? Would you take the leap of faith?The De-Coding of Jo: Hall of Ignorance is a meld of fantasy, paranormal and science fiction, with a strong appeal to young adult readers (ages 15 years+). It is the first book of the Ascending Angel Academy series, incorporating plot driven and coming of age stories of diverse, gender inclusive teenagers struggling with self-identity and a sense of belonging. Sixteen-year-old Jo attends Forest Hill Academy, a preppy co-ed private school with her best friends Nisha, Daphne, Reyes, Zaxden, and Flynn. Ever since the fatal night her mother was taken hostage by a homicidal maniac, Jo has been plagued by debilitating nightmares. As she tries to unravel her bleak reality, Jo and her friends discover a mysterious gateway into a Black Hole, hidden behind a strange mirrored door in an eerie underground hallway of the school’s library. Reyes accidentally releases the evil that has been imprisoned in this grid-matrix and unknowingly becomes infected with the menacing parasites. These demons emerge from their shadows and spread throughout the school to gain control over their hosts. One by one, they raise an army of sleepwalkers to serve the Lord of Darkness in a sinister plot for universal domination. As Jo is activated by the Light to realize her truth and ascend from the hall of ignorance, she finds an antiquated Galactic Compass. Jo discovers its interstellar capabilities to time travel through the cosmos, and secures the Akashic Records, stored in a library of multi-dimensional consciousness of every soul since creation.Primed by the Galactic Council and Ascending Angel Academy, Jo faces heartbreak and accepts a difficult mission to embrace her celestial form. She must unlock the power of creation and prevent the Lord of Darkness from enslaving all of humanity into obscurity. Will she be able to decode the artificial system in time to save her friends and the sacred Light?",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Science Fiction"
  ],
  "author": "Lali A.  Love",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/54701781-the-de-coding-of-jo"
}