{
  "title": "Step Into My Web",
  "description": "Step into my web…and you’ll never get out.Chloe Hastings doesn’t like rules, and she doesn’t exactly play well with others. But she does have one amazing talent—she can get into the mind of killers like no one else. A police consultant and profiler, Chloe is definitely not like anyone that Joel Landry has ever encountered. From the moment they meet—in the middle of a bank robbery—she throws him off balance and pulls him under spell. She seems to have no fear, she plots constantly, and…Joel quickly finds himself trapped in her web.She needs a new partner…and he’s just the man for the job.There’s a sadistic killer hunting in the streets of New Orleans, and Chloe plans to catch him. First, though she needs a partner she can trust, and she’s decided that Dr. Joel Landry is the best fit for the job. Sure, he has a dark past. The doctor was attacked by a serial killer, but Joel survived while his attacker did not. Now the ruggedly handsome doctor has turned to the shadows. He’s learned how to hunt, how to fight, how to kill in a thousand brutal ways—in short, he’s acquired all of the skills that Chloe absolutely adores in a man.He’s exactly what she wants. She could become the only thing he needs.Together, they should be a perfect fit. She knows the minds of criminals better than anyone else, and Joel can protect her from any threat that comes their way. They’ll have one hell of a time tracking down the bad guys, provided Chloe and Joel don’t kill each other first. Another unanticipated twist for the new partners? Their attraction to each other is explosive, their desire uncontrollable. One reckless kiss seals their fate, and their need won’t be denied.And neither will the killer who waits for his moment to attack.Once you step into a spider’s web, there is no going back.Author’s Note: Chloe Hastings always has a plan in play. Her investigations are unusual, her friends are generally on the shady side, and her social skills? Well, those are pretty much non-existent. But Chloe solves every case that crosses her path, and she never, ever backs down. When she teams up with her new partner, all bets are off. Joel is gorgeous, sinful, and about to break through every wall that Chloe possesses. He’ll fight for her, she’ll fight for him, and the criminals in their path had better get ready. There is a new crime-solving team in town.",
  "genres": [
    "Romantic Suspense",
    "Suspense",
    "Romance",
    "Contemporary",
    "Mystery",
    "Thriller",
    "Contemporary Romance"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/54704546-step-into-my-web"
}