{
  "title": "Dear Edward",
  "description": "NEW YORK TIMES BESTSELLER • #ReadWithJenna Book Club Pick as Featured on Today • A “dazzling” novel that “will break your heart and put it back together again” (J. Courtney Sullivan, bestselling author of Saints for All Occasions) about a young boy who must learn to go on after surviving tragedy.“A reading experience that leaves you profoundly altered for the better ... Don’t miss this one.” — Jodi Picoult, bestselling author of Small Great Things and A Spark of Light.What does it mean not just to survive, but to truly live?One summer morning, twelve-year-old Edward Adler, his beloved older brother, his parents, and 183 other passengers board a flight in Newark headed for Los Angeles. Among them are a Wall Street wunderkind, a young woman coming to terms with an unexpected pregnancy, an injured veteran returning from Afghanistan, a business tycoon, and a free-spirited woman running away from her controlling husband. Halfway across the country, the plane crashes. Edward is the sole survivor.Edward’s story captures the attention of the nation, but he struggles to find a place in a world without his family. He continues to feel that a part of himself has been left in the sky, forever tied to the plane and all of his fellow passengers. But then he makes an unexpected discovery—one that will lead him to the answers of some of life’s most profound questions: When you’ve lost everything, how do you find the strength to put one foot in front of the other? How do you learn to feel safe again? How do you find meaning in your life?Dear Edward is at once a transcendent coming-of-age story, a multidimensional portrait of an unforgettable cast of characters, and a breathtaking illustration of all the ways a broken heart learns to love again.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Literary Fiction",
    "Coming Of Age",
    "Adult"
  ],
  "author": "Ann Napolitano",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/54686853-dear-edward"
}