{
  "title": "Infuriating",
  "description": "What he fears is love.JACKSON AVERY has everything in life, except somebody to share it with. But as the owner of one of the largest private security forces in the country, he’s got plenty to keep him busy until he finds ‘the one.’ After spending the last year dealing with the fallout of his best security agents falling for their clients, the last thing Jackson expects is to take one look at feisty camboy, Dayton Daniels, and almost instantly know that he’s it for him.DAYTON DANIELS has been on his own since he was just fourteen years old. He’s spent his entire life scraping by, doing whatever’s necessary to survive. A severe learning disability has left Day unable to read and forced him to find creative ways to make a living. Camming allows him to earn money while keeping his clients at a distance, and Day has grown used to keeping everybody at a distance...until he witnesses a murder and Jackson Avery walks into his life.Guarding Day is supposed to be a favor, a simple off the books job until they find out who killed a prominent attorney, but Jackson quickly realizes there is nothing simple about Day. He’s beautiful, smart, surprising, and Jackson is all in merely ten minutes after they meet. But Day, he can’t imagine a man like Jackson wanting to spend his life with somebody like him, and he is determined to do anything to send Jackson running in the opposite direction, no matter how much it hurts.When Day starts receiving threatening emails, Jackson enlists his team to hunt down the killer. Day doesn’t want to spend the rest of his life living in fear, but every day he’s with Jackson, he falls a little harder, forming cracks in the walls he’s worked so hard to build up around himself. Can Jackson solve a murder and find a way past Day’s defenses to convince him there is such a thing as love at first sight and that everybody deserves a happily ever after, even him?INFURIATING is the fourth book in the Elite Protection Services Series and contains age-gap, Daddy-kink, voyeurism and lingerie with a HEA and no cliffhangers.Warning: This book contains brief portrayals of childhood emotional abuse as well as discussions of past child sexual trauma and one scene of on-page physical violence to a main character at the hands of somebody other than the main character.",
  "genres": [
    "M M Romance",
    "Romance",
    "LGBT",
    "Contemporary",
    "BDSM",
    "Audiobook",
    "Abuse"
  ],
  "author": "Onley James",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/54739383-infuriating"
}