{
  "title": "1864: Lincoln at the Gates of History",
  "description": "In a masterful narrative, historian and biographer Charles Bracelen Flood brings to life the drama of Lincoln's final year, in which he oversaw the last campaigns of the Civil War, was reelected as president, and laid out his majestic vision for the nation's future in a reunified South and in the expanding West.In \"1864: Lincoln at the Gates of History,\" the reader is plunged into the heart of that crucial year as Lincoln faced enormous challenges. The Civil War was far from being won: as the year began, Lincoln had yet to appoint Ulysses S. Grant as the general-in-chief who would finally implement the bloody strategy and dramatic campaigns that would bring victory.At the same time, with the North sick of the war, Lincoln was facing a reelection battle in which hundreds of thousands of \"Peace Democrats\" were ready to start negotiations that could leave the Confederacy as a separate American nation, free to continue the practice of slavery. In his personal life, he had to deal with the erratic behavior of his wife, Mary Todd Lincoln, and both Lincolns were haunted by the sudden death, two years before, of their beloved eleven-year-old son, Willie.\"1864\" is the story of Lincoln's struggle with all this -- the war on the battlefields and a political scene in which his own secretary of the treasury, Salmon P. Chase, was working against him in an effort to become the Republican candidate himself. The North was shocked by such events as Grant's attack at Cold Harbor, during which seven thousand Union soldiers were killed in twenty minutes, and the Battle of the Crater, where three thousand Union men died in a bungled attempt to blow up Confederate trenches. The year became so bleak that on August 23, Lincoln wrote in a memorandum, \"This morning, as for several days past, it seems exceedingly probable that this Administration will not be reelected.\" But, with the increasing success of his generals, and a majority of the American public ready to place its faith in him, Lincoln and the nation ended 1864 with the close of the war in sight and slavery on the verge of extinction.\"1864\" presents the man who not only saved the nation, but also, despite the turmoil of the war and political infighting, set the stage for westward expansion through the Homestead Act, the railroads, and the Act to Encourage Immigration.As 1864 ends and Lincoln, reelected, is planning to heal the nation, John Wilkes Booth, whose stalking of Lincoln through 1864 is one of this book's suspenseful subplots, is a few weeks away from killing him.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "Biography",
    "Audiobook",
    "Presidents"
  ],
  "author": "Charles Bracelen Flood",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/5473613-1864"
}