{
  "title": "Collapse 2020 Vol. 1: Fall of the First Global Civilization",
  "description": "Collapse 2020 Vol. 1: Fall of the First Global Civilization, provides new insights that describe why humanity’s current way of life is on its way to a major collapse.Collapse 2020 Vol. 1 digs into the major chaos of today’s world: climate change, liberal-conservative polarization, gridlock in governments massive social injustice, and the role of pandemics. It provides NEW understanding for what has and is going wrong. The book presents major new discoveries from over 30 years of unpublished research. It doesn’t rehash conventional ideas. It explores an entirely new logical foundation for society to understand today’s fundamental problems. Unfortunately, humanity has already gone over the tipping point. Civilization will collapse.As great as the books Atlas Shrugged, Origin of Species and Maslow’s Hierarchy were, they were still unfinished milestones in the progress of civilization. Are you ready to take the next step? This book will take you there!In this book, many revolutionary breakthroughs will be presented.One of these is a new theory for the structure and function of the human brain. This theory, for the first time, describes what “human consciousness” is, AND how the brain produces it. YES, this model can be programmed into a computer. A second discovery was a new theory for how humans learn language. Unlike traditional theories that focus on \"logic\" and \"reasoning\" in the learning process, the discovery observed that all infants first create language structures primarily as sound patterns that lead to controlling what others do. Logic only enters the picture much later. This has profound results for human psychology.The new brain and language theory leads directly to a new explanation for human behavior based on a new interpretation of what society calls the \"Seven Deadly Sins.\" (This is not a religious interpretation.\")These three new models lead to a new interpretation of the “singularity”. The models explain that the singularity has already passed, and why humanity missed it. The models also explain that “the Machines” won’t be coming as \"robots\" to take over the world. But that doesn’t mean humans will still play a major part in their world!The new theory of human language clearly explains the destructive polarization of human society and the gridlock in governments that dominates modern life.All of these discoveries together lead to new theory of democracy I call Personalized Democracy. The reason democracy is failing is explained, why it can’t be fixed, and a new form that WILL work is outlined. A detailed description of Personalize Democracy is the basis for Collapse 2020 Vol. 2.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Bruce  Nappi",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/54743710-collapse-2020-vol-1"
}