{
  "title": "Gold Diggers",
  "description": "An Indian-American magical realist coming of age story, spanning two continents, two coasts, and four epochs, in razor sharp and deeply funny prose, Sathian captures what it is to grow up as a member of a family, of a diaspora, and of the American meritocracy.A floundering second-generation teenager growing up in the Bush-era Atlanta suburbs, Neil Narayan is authentic, funny, and smart. He just doesn't share the same drive as everyone around him. His perfect older sister is headed to Duke. His parents' expectations for him are just as high. He tries to want this version of success, but mostly, Neil just wants his neighbor across the cul-de-sac, Anita Dayal.But Anita has a secret: she and her mother Anjali have been brewing an ancient alchemical potion from stolen gold that harnesses the ambition of the jewelry's original owner. Anjali's own mother in Bombay didn't waste the precious potion on her daughter, favoring her sons instead. Anita, on the other hand, just needs a little boost to get into Harvard. But when Neil--who needs a whole lot more--joins in the plot, events spiral into a tragedy that rips their community apart.Ten years later, Neil is an oft-stoned Berkeley history grad student studying the California gold rush. His high school cohort has migrated to Silicon Valley, where he reunites with Anita and resurrects their old habit of gold theft--only now, the stakes are higher. Anita's mother is in trouble, and only gold can save her. Anita and Neil must pull off one last heist.Gold Diggers is a fine-grained, profoundly intelligent, and bitingly funny investigation in to questions of identity and coming of age--that tears down American shibboleths.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Fantasy",
    "Book Club",
    "Audiobook",
    "Contemporary",
    "India"
  ],
  "author": "Sanjena Sathian",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/54719856-gold-diggers"
}