{
  "title": "Black Bottom Saints",
  "description": "An enthralling literary tour-de-force that pays tribute to Detroit's legendary neighborhood, a mecca for jazz, sports, and politics, Black Bottom Saints is a powerful blend of fact and imagination reminiscent of E.L. Doctorow's classic novel Ragtime and Marlon James' Man Booker Award-winning masterpiece, A Brief History of Seven Killings.From the Great Depression through the post-World War II years, Joseph “Ziggy” Johnson, has been the pulse of Detroit’s famous Black Bottom. A celebrated gossip columnist for the city’s African-American newspaper, the Michigan Chronicle, he is also the emcee of one of the hottest night clubs, where he’s rubbed elbows with the legendary black artists of the era, including Ethel Waters, Billy Eckstein, and Count Basie. Ziggy is also the founder and dean of the Ziggy Johnson School of Theater. But now the doyen of Black Bottom is ready to hang up his many dapper hats.  As he lays dying in the black-owned-and-operated Kirkwood Hospital, Ziggy reflects on his life, the community that was the center of his world, and the remarkable people who helped shape it.Inspired by the Catholic Saints Day Books, Ziggy curates his own list of Black Bottom’s venerable \"52 Saints.\" Among them are a vulnerable Dinah Washington, a defiant Joe  Louis, and a raucous Bricktop. Randall balances the stories of these larger-than-life \"Saints\" with local heroes who became household names, enthralling men and women whose unstoppable ambition, love of style, and faith in community made this black Midwestern neighborhood the rival of New York City’s Harlem.Accompanying these “tributes” are thoughtfully paired cocktails—special drinks that capture the essence of each of Ziggy’s saints—libations as strong and satisfying as Alice Randall’s wholly original view of a place and time unlike any other.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "African American",
    "Book Club",
    "Music",
    "Literary Fiction"
  ],
  "author": "Alice Randall",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/54740008-black-bottom-saints"
}