{
  "title": "Travels in Cuba",
  "description": "Even for an experienced traveler like Charlie, Cuba is a place unlike any he has visited before ― an island full of surprises, secrets and puzzling contradictions. When Charlie’s artist mother is invited to visit a school in Cuba, the whole family goes along on the trip. But the island they discover is a far cry from the all-inclusive resorts that Charlie has heard his friends talk about. Charlie has never visited a country as strange and puzzling as Cuba ― a country where he often feels like a time traveler. Where Havana’s grand Hotel Nacional sits next to buildings that seem to be crumbling before his very eyes. Where the streets are filled with empty storefronts and packs of wild dogs, but where flowers and sherbet-colored houses may lie around the next corner, and music is everywhere. Where there are many different kinds of walls ― from Havana’s famous sea wall to the invisible ones that seem aimed at keeping tourists and locals apart. Then the family heads “off the beaten track,” traveling by hot, dusty bus to Viñales, where Charlie makes friends with Lázaro, who often flies from Miami to visit his Cuban relatives. The boys ride a horse bareback, find a secret cache of rifles inside a little green mountain and go swimming with small albino fish in an underground cave. A rent-a-wreck takes the family into the countryside, where they find an abandoned hotel inhabited by goats, and a modern resort filled with tourists. And as he goes from one strange and marvelous escapade to another, Charlie finds that his expectations about a place and its people are overturned again and again. Key Text Featuresillustrations Correlates to the Common Core State Standards in English Language CCSS.ELA-LITERACY.RL.5.6Describe how a narrator's or speaker's point of view influences how events are described.",
  "genres": [
    "Travel",
    "Middle Grade",
    "Fiction",
    "Family"
  ],
  "author": "Marie-Louise Gay",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/54738245-travels-in-cuba"
}