{
  "title": "The Runaway",
  "description": "Bestselling author Lisa Childs launches a new romantic suspense trilogy with The Runaway, an atmospheric, fast-paced novel set on an island off the coast of Maine, where a former insane asylum has been reopened as Halcyon Hall. But despite its efforts to present itself as a spa for the rich and famous, it can't escape its haunted past. When Bainesworth Manor calls out to the cursed, they come.And they never leave again...\"Atmospheric, emotional, and well-told.\"\n\n\n--New York Times\n bestselling author, Lori Wilde\n\n\n\n\nI'm in trouble. Come get me.\n\n\n\nOn a remote island off the coast of Maine lies a secluded estate. There, behind wrought iron gates and rock walls, sits Halcyon Hall. Today, it is an exclusive spa catering to wealthy elites and pampered celebrities. But once, it had another name--and a terrifying reputation . . .\nRosemary Tulle has come to Halcyon Hall desperate to find her younger sister. Seventeen-year-old Genevieve left a brief, troubling message on Rosemary's phone, begging to be picked up. But Rosemary is not on the visitor list, and no one will let her in . . .Halcyon Hall was once Bainesworth Manor, an asylum for the insane. Such places often draw whispers about gruesome treatments and tortured inmates. In the case of Bainesworth, the reality may have been far worse. Now, staff insist that Genevieve ran away, but Rosemary's instincts say otherwise. Rosemary and Genevieve share an unsual bond, and she knows Genevieve wouldn't have just left. Compelled to turn for help to a man she hoped never to see again, judge Whit Lawrence, she tries to learn the truth about Genevieve. But it will mean uncovering secrets about Bainsworth Manor, and about Rosemary's own dark past--secrets with the power to kill . . .\"Childs knows how to keep readers riveted.\" --\nRT Book Reviews\n\"Grabs you from page one . . . Lisa Childs paints an eerie, haunting suspense that will keep you riveted until the very last page!\" --Rita Herron \nUSA Today\n bestselling author",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Adult"
  ],
  "author": "Lisa Childs",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/54752457-the-runaway"
}