{
  "title": "Naughty Brits",
  "description": "Everything is hotter with a British accent…Sarah MacLean - A Duke Worth Falling For:Her career in tatters, celebrity photographer Lilah Rose retreats to the British countryside, complete with fluffy sheep, rolling hills…and Max, the stern, sexy farmer who tends to them. But their lazy days and lush nights aren’t as far from the spotlight as Lilah thinks, and Max will have to reveal the truth if he is going to convince Lilah that some dukes are worth the risk.Sophie Jordan - Better with You:When the author of a controversial self-help book starts receiving threats, she has no choice but to accept a bodyguard on her UK book tour. Vee Mathers is famous for asserting that women don’t need men—especially for sex!—but at security specialist Luca Moretti’s first, burning touch, she starts to think she might need to revise her theory...Louisa Edwards - Not a Bad Boy:Writer Mallory Pritchard moved to London for research—and to get over a bad breakup. When she (literally) runs into Hollywood’s hottest action hero, Ian Hale, at a dog park, she realizes her heart isn’t as broken as she thought! Ian is even more devastatingly sexy in person, which makes Mallory wonder...is there room for a regular girl in his glamorous movie-star world?Tessa Gratton - Songbird:Former American soldier Daniel Kelly’s mission is simple: close the deal to buy a Welsh pub on behalf of his family’s corporation, and survive another anniversary of the worst day of his service. Too bad that from the moment he sees the pub’s owner, Elspeth Gwenlan is the only thing Daniel wants to conquer—even if it means lying to her about his agenda. Sierra Simone - Supplicant:After being left at the altar by her cold and brilliant professor, Church Cason, Charlotte Tenpenny had to leave school to take care of her younger brother. But a fateful night brings Church—and his delicious, drugging kisses—back into Charlotte's life. And it stirs up a reckoning years in the making . . .",
  "genres": [
    "Romance",
    "Contemporary",
    "Anthologies",
    "Contemporary Romance",
    "Novella",
    "Short Stories",
    "Fiction"
  ],
  "author": "Sarah MacLean",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/54761649-naughty-brits"
}