{
  "title": "You are Eating an Orange. You are Naked.",
  "description": "A young translator living in Toronto frequently travels abroad—to Hong Kong, Macau, Prague, Tokyo—often with his unnamed lover. In restaurants and hotel rooms, the couple begin telling folk tales to each other, perhaps as a way to fill the undefined space between them. Theirs is a comic and enigmatic relationship in which emotions are often muted and sometimes masked by verbal play and philosophical questions, and further complicated by the woman’s frequent unexplained disappearances.You Are Eating an Orange. You Are Naked. is an intimate novel of memory and longing that challenges Western tropes and Orientalism. Embracing the playful surrealism of Haruki Murakami and the atmospheric narratives of filmmaker Wong Kar-wai, Sheung-King’s debut is at once lyrical and punctuated, and wholly unique, and marks the arrival of a bold new voice in Asian-Canadian literature.Praise for You Are Eating an Orange. You Are Naked.:Longlisted for CBC's Canada Reads 2021“One of the best book debuts of 2020” — The Globe and Mail“Sheung-King has written a wonderfully unexpected and maverick love story but also a novel of ideas that hopscotches between Toronto, Macau, Hong Kong, Tokyo, and Prague. It is enchanting, funny, and a joy to read.”—Kyo Maclear, author of Birds Art Life“A tale of two rich and rootless people that oozes the horror and confusion of love, while staying somehow still desperately romantic, and so gloriously sad. This novel is also about something else: it gives the cold shoulder to the dominant gaze and its demands to control the Asian body, carving out a thrilling space beyond whiteness. I didn’t want it to end.” —Thea Lim, author of An Ocean of Minutes, a finalist for the Scotiabank Giller Prize“In a cruel paradox for writers who are just trying to recount their lives, the tropes of diasporic lit have made it nearly impossible to write about belonging without also placing whiteness at the center of attention—the tropes exist because stories that do this are regularly rewarded with publication. But You Are Eating an Orange. You Are Naked. sidesteps this trap all together: It is bored by Western approval.” — Thea Lim, The Nation.“He practically sets the page on fire.\" —Brett Josef Grubisic, Toronto Star",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Canada",
    "Audiobook",
    "Asian Literature",
    "Novels"
  ],
  "author": "Sheung-King",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/54750338-you-are-eating-an-orange-you-are-naked"
}