{
  "title": "The Scream: The Masters Reimagined Volume 2",
  "description": "A man steps into the path of a tram. An art school love affair turns tragic. And the eccentric wandering of an antiques dealer catches the attention of a detective investigating the theft of Norway’s most celebrated work of art, Edvard Munch’s The Scream. Haunted by weird dreams and psychic visions, former mental patient Torsten Egland may provide the key in Detective Inspector Henrik Nordkapp’s search for the stolen painting. After a series of mysterious events, Nordkapp must decide if he should abandon traditional police methods and place his faith in a quirky man whose troubled mind may be communicating with the painting itself. A short story in The Masters Reimagined 2. Inspired by Edvard Munch’s The Scream. INTERVIEW WITH THE AUTHOR Q - What is The Masters Reimagined 2? A - In The Masters Reimagined 2, eight authors unite under the inspiration of classic works of art. Masters like Leonard da Vinci, Edvard Munch, Franz Marc, Theodore Gericault, Jacques-Louis David, George Adolphus Storey, and Michael Pacher inspired the authors of the Alvarium Experiment in their quest to reinterpret, reinvent, and reshape selected visual arts in story form through speculative twists and turns. This is the fifth project by the Alvarium Experiment, a consortium of accomplished and award-winning authors. Q - Where should a reader start when selecting a short story to read in The Masters Reimagined? A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. The book description will explain the premise for each particular story. About the Author CHARLES A CORNELL writes speculative fiction ranging from the mysterious to the macabre; sometimes blending science fiction, fantasy, alternative history and horror. He is a regular contributor to podcasts, seminars and conferences, and conducts webinars and workshops on his specialty, retro-punk fiction (Steampunk, Dieselpunk). Charles A Cornell lives in a rural English village in Lincolnshire with his wife and ginger tabby. His first published novel, Tiger Paw, won the 2012 Royal Palm Literary Award for Best Thriller from the Florida Writers Association. His dieselpunk work, DragonFly is a retro-futuristic collision of science fiction and fantasy with a generous dash of alternative history. DragonFly was a 2014 Royal Palm Literary Award Finalist in Science Fiction and won the 2018 Reader’s Favorite Silver Medal in the Young Adult - Action category. Charles’s short stories and novellas have appeared in the anthologies, The Prometheus Saga Volumes 1 & 2 and Return to Earth . His Prometheus Saga science fiction stories Crystal Night and The Orchid Man are both winners of FWA Royal Palm Literary Award Gold Medals in Short Fiction (2016, 2018) Visit Charles at www.CharlesACornell.com for updates on his projects, links to purchase publications, and info about upcoming appearances.",
  "genres": [],
  "author": "Charles A Cornell",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/54765654-the-scream"
}