{
  "title": "Leave My Ashes on Blackheart Mountain",
  "description": "“When the world ended, people eventually regained their footing, but that was a long time ago. We have come so far since then. We still have so much farther to go…” Two decades before the bloodstained events of the novella “MERCY”, Rancid Mahoney is commissioned by Gunther purveyor of opportunity and Head Prospector of New Canterton, a mining settlement located in what was once, but long forgotten as, the heart of the American Northwest. Mahoney is tasked with scouring the land in an attempt to locate Blackheart the source of \"Blackvein\", the heavily romanticized miracle mineral rumored to be able to enhance the human body's ability to heal, effectively defeating death itself. But time and time again, Mahoney returns empty handed to his reluctant employer. On the heels of setting out on yet another venture to locate the Mountain, Ostrander orders Mahoney to first escort the prisoner Til Drange to the settlement of Vermouth not far to the north, so that he may face judgment for crimes committed against the eccentric Mayor Henry Kenroy. On the way to Vermouth, the two are interrupted by scouts of the Tuskatawa Tribe, an assemblage of people who believe the cataclysmic event which put an end to civilization long ago was a sign for their people that it is now the time to take back the land that was once theirs in the name of their native ancestors. To make matters worse, Mancino Rolandraz, the deranged leader of the savage Crimson Collar gang, is on his own quest for vengeance under the guise of what he believes to be the only purpose worth fighting for. Spearheading his campaign for \"justice\" is an obsessive hunger to kill Til Drange, and anyone else who gets in his way. It swiftly comes to the realization of Mahoney that a new war is not only about to break out, but is impossible to prevent, one which he must decide whether or not to take part in, and if he does, which side to fight for.",
  "genres": [],
  "author": "Dave Matthes",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/54765517-leave-my-ashes-on-blackheart-mountain"
}