{
  "title": "On the Second Day of Christmas",
  "description": "Slipping on the ice is bad enough—being treated by the physician she rejected years ago is simply unbearable.Belles of Christmas: Frost FairSweet, Regency Christmas RomancesFive Christmas romances and the Frost Fair that started them allHeadstrong and independent, Miss Lucy Lincoln wishes to find a husband who shares her taste for adventure. Until then, she is determined to live her life without regrets. Well, except for the one she already has—humiliating poor Benjamin Kent after his unwanted marriage proposal years earlier. After an accident at the Frost Fair draws that same insecure gentleman to care for her injury, she finally asks for forgiveness. But Dr. Kent, now a respectable gentleman and physician, is unwilling to accept her apology.Benjamin Kent wants nothing more than to live out his days in peace and seclusion away from London Society—and away from his memories of Lucy Lincoln. But when his conscience forces him to treat the woman, he cannot pass on the opportunity to finally let her know that she no longer has him under her spell.Rather than being relieved with Benjamin’s indifference, Lucy struggles to accept the fact that little, shy Benjamin now shows irresistible confidence—and an unsettling apathy toward her. When sparks smolder between them, though, Benjamin must fight to keep his old feelings in the past, and Lucy must realize before it’s too late that either Benjamin has changed…or her own feelings have.This is the fourth book in the clean and sweet Regency romance Belles of Christmas: Frost Fair series.Although this second chance romance is a stand-alone novel, the books are best enjoyed when read in order.",
  "genres": [
    "Christmas",
    "Regency",
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Holiday",
    "Historical"
  ],
  "author": "Deborah M. Hathaway",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/54761720-on-the-second-day-of-christmas"
}