{
  "title": "Sticking to Emma Daniels",
  "description": "How bad can one vacation get?Emma Daniels is a workaholic buyer for a top art gallery in LA. Her current goal, fly to Vancouver to purchase a well sought after painting by Haesung Hill for her demanding boss’s Women in Art exhibit. Emma thinks its a lucky trip because she can surprise her long-distance boyfriend with a visit.Henry Hill is an acclaimed artist who might not work as hard as he should. Just ask his Mom, Haesung Hill, who Henry is currently avoiding. But Henry’s bills are about to be due which means – time to actually sell a painting. Luckily, he has a client lined up in Vancouver.When their luggage gets switched at the airport, Emma’s well-organized day becomes a mad dash to meet HH (ie. Henry), swap back, and hurry to her auction. Only, things go haywire from jump street when she catches her boyfriend cheating at the restaurant she meets Henry. One viral slap, a high flying flip over a rental car, and a concussion later, sends Henry and Emma to the hospital and saddled with a doctor's order: you must keep him awake for 6 hours.Now reluctantly attached at the hip and internet famous, Emma and Henry have to work together to get to Henry’s meeting on one side of Vancouver and to Emma’s auction on the other without tearing each other’s heads off. Of course, they definitely won’t fall in love.Sticking to Emma Daniels is a fun mistaken-Identity romance through Vancouver, Canada. I hope it makes you smile, escape from the day, and even laugh. It is perfect for readers who enjoy sweet romcom books without explicit content.Sticking to Emma Daniels is book one in the lol Romantic Comedy Catastrophe series. You will love this book series if you love Hallmark movies, Korean dramas, adorable heroes, spunky heroines, and, of course, oodles and oodles of serendipity!The Romantic Comedy Catastrophe SeriesBook 1: Sticking to Emma DanielsBook 2: Running into Jade Song (coming soon!)Book 3: Gazing at Sophia Solis (coming this fall)Book 4: Falling for Amelia Mitchell (coming this winter)",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Elle Weston",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/54763691-sticking-to-emma-daniels"
}