{
  "title": "Storey's Orphans: The Masters Reimagined 2",
  "description": "Grunsberry Murphy, a time traveler, appears as a twelve-year-old in 1878 London just in time to save the lives of Winifred and Laurance Allen from certain death when two ships collide on the Thames River. After rinsing the stench of the river from them, she leaves them to go in search of their parents. While doing that, the children disappear, and she goes on to the Alexandra Orphanage where she’s sure they will turn up. When they do, she is sitting in the front room where all children are received on arrival. Mr. George Storey has arranged to do one of his London life scenes at the home and captures the arrival of Winifred and Laurance, as seen in “Arrival at the Orphanage.”A short story in The Masters Reimagined 2. Inspired by George A. Storey’s Arrival at the Orphanage.INTERVIEW WITH THE AUTHORQ - What is The Masters Reimagined 2? A - In The Masters Reimagined 2, eight authors unite under the inspiration of classic works of art. Masters like Leonard da Vinci, Edvard Munch, Franz Marc, Theodore Gericault, Jacques-Louis David, George Adolphus Storey, and Michael Pacher inspired the authors of the Alvarium Experiment in their quest to reinterpret, reinvent, and reshape selected visual arts in story form through speculative twists and turns. This is the fifth project by the Alvarium Experiment, a consortium of accomplished and award-winning authors. Q - Where should a reader start when selecting a short story to read in The Masters Reimagined? A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. The book description will explain the premise for each particular story.About the AuthorVeronica Helen Hart lives in Ormond Beach, Florida, with her wonderfully supportive husband. She recently created Paranormalice Press, LLC in order to publish paranormal mysteries and is always seeking new authors. She is the author of eleven published novels. Many of her books have won prizes in Florida’s Royal Palm Literary Awards, including first place for humor for The Prince of Keegan Bay.This is her third entry in an Alvarium Collection anthology. Many of her short stories are also in The Florida Writers Association annual anthology collections. Visit Veronica at www.veronicahhart.com or www.paranormalice.com for updates on her projects, links to purchase publications, and info about upcoming appearances.",
  "genres": [],
  "author": "Veronica Helen Hart",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54765648-storey-s-orphans"
}