{
  "title": "Oil and Hemlock: The Masters Reimagined Volume 2",
  "description": "Amita, a young New York philosophy student, is whisked from 1977 to 399 BC Athens, and into the life of one of her heroes, Socrates. Yet her excitement plunges into horror as she realizes she's arrived on the day of his trial and execution. A short story in The Masters Reimagined 2. Inspired by Jacques-Louis David’s The Death of Socrates. INTERVIEW WITH THE AUTHOR Q - What is The Masters Reimagined 2? A - In The Masters Reimagined 2, eight authors unite under the inspiration of classic works of art. Masters like Leonard da Vinci, Edvard Munch, Franz Marc, Theodore Gericault, Jacques-Louis David, George Adolphus Storey, and Michael Pacher inspired the authors of the Alvarium Experiment in their quest to reinterpret, reinvent, and reshape selected visual arts in story form through speculative twists and turns. This is the fifth project by the Alvarium Experiment, a consortium of accomplished and award-winning authors. Q - Where should a reader start when selecting a short story to read in The Masters Reimagined? A - Each story is self-contained and can be read in any order. The reader is free to select any of the stories at random to begin their experience. The book description will explain the premise for each particular story. About the Author KRISTIN DURFEE resides outside of Orlando, FL, and when not enjoying the theme parks or Florida sun, she spends most of her time with her husband, son, and their quirky dogs. She is the author of the Four Corners Trilogy as well as appearing in several anthologies, including The Prometheus Saga Volume 2 , Return to Earth , and The Masters Reimagined , projects of the Alvarium Experiment as well as Demonic Household and Thrill of the Hunt anthologies. She is a two-time finalist for the Florida Writer's Association Royal Palm Literary Awards. She is currently working on several short stories and a novel for young adults and adults.",
  "genres": [],
  "author": "Kristin Durfee",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/54765643-oil-and-hemlock"
}