{
  "title": "Racism in America: A Reader",
  "description": "Racism in America has been the subject of serious scholarship for decades. At Harvard University Press, we’ve had the honor of publishing some of the most influential books on the subject. The excerpts in this volume—culled from works of history, law, sociology, medicine, economics, critical theory, philosophy, art, and literature—are an invitation to understand anti-Black racism through the eyes of our most incisive commentators.Readers will find such classic selections as Toni Morrison’s description of the Africanist presence in the White American literary imagination, Walter Johnson’s depiction of the nation’s largest slave market, and Stuart Hall’s theorization of the relationship between race and nationhood. More recent voices include Khalil Gibran Muhammad on the pernicious myth of Black criminality, Elizabeth Hinton on the link between mass incarceration and 1960s social welfare programs, Anthony Abraham Jack on how elite institutions continue to fail first-generation college students, Mehrsa Baradaran on the racial wealth gap, Nicole Fleetwood on carceral art, and Joshua Bennett on the anti-Black bias implicit in how we talk about animals and the environment.Because the experiences of non-White people are integral to the history of racism and often bound up in the story of Black Americans, we have included writers who focus on the struggles of Native Americans, Latinos, and Asians as well. Racism in America is for all curious readers, teachers, and students who wish to discover for themselves the complex and rewarding intellectual work that has sustained our national conversation on race and will continue to guide us in future years.",
  "genres": [
    "History",
    "Race",
    "Nonfiction",
    "Politics",
    "Social Justice",
    "Essays",
    "American History"
  ],
  "author": "Annette Gordon-Reed",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/54753851-racism-in-america"
}