{
  "title": "The Social Hour",
  "description": "Anderson “Andie” Daniels wonders when she’s going to catch a break. A single mom in a new city, Andie desperately tries to stay afloat, but life keeps throwing her curveballs. She’s lonely, she’s tired, and she’s broke. She’s about to throw the towel in and crawl back home when she gets a job offer working for a stylist. Andie’s new job is keeping her head above water, but the hot bar owner downstairs may just pull her back under. Cameron Forbes is successful, handsome, and single…and that’s how he likes it. Recently broken up from a long-term relationship and living in a new city, Cam decides to solely focus on his business, a successful string of bars called The Social Hour. His business is his baby, his mistress, and his responsibility. What he didn’t have perfectly planned out is the crazy woman who pops into his bar unexpectedly one afternoon. Cameron has to decide if he can let his heart overrule his head or if he’s destined to a life running The Social Hour. Sometimes Life doesn’t go the way you planned it. The Social Hour is the third book in the Coffee Book series. It’s a standalone novel, but the author strongly suggests reading the first two books in the series because of returning characters. \"I love Sophie’s books, they never fail to make me smile and I always enjoy every moment I spend reading them. She quickly became one of my favorite authors and I’m already excited to see what she has next in store for us. The Social Hour was a heartwarming, emotional, and sweet read that had me laughing like crazy and enjoying every minute I spent reading it. I cannot recommend it, and this series, enough!\" - MLOVESTOREAD \"After reading all three books, I feel like these characters are my friends so writing this review feels very bittersweet. The Social Hour is definitely one of my most anticipated releases of the summer and once I received the ARC on my Kindle, I binged it in one evening so I think that tells you how much I enjoyed it. Sophie writes fun, witty romances with very likeable characters and fantastic friendships.\" - Wendy, LOVELIBOOKS \"The entire three book, Coffee Girl series is 5⭐️s. I cannot get enough of these amazing characters.\" - Wagging with Words \"Well guys, Sophie Sinclair has done it again. Another amazing book in the Coffee Book series. This book was filled with fun, drama, steam, and overall was just captivating. \" - Buffalogirllovesbooks \"I love love love this series! The friendship between TJ, Kiki, Sarah, and now Addie is amazing. I found myself laughing out loud so many times during this book. TJ made me laugh as usual so much, but the babysitting scene with Cam had me in hysterics! I love Cam and Andie together as a couple. This was one of those books that once it hit my Kindle, I couldn't put it down. \" - Carrie P. \"Y’all, I am not ready to say goodbye to The Coffee Girl series. But, because I have too, The Social Hour was the perfect ending! \" - MollysReadingAdventure",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Sophie  Sinclair",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/54765045-the-social-hour"
}