{
  "title": "Everyone Knows Your Mother Is a Witch",
  "description": "The startling, witty, highly anticipated second novel from the critically acclaimed author of Atmospheric Disturbances.The story begins in 1618, in the German duchy of Württemberg. Plague is spreading. The Thirty Years' War has begun, and fear and suspicion are in the air throughout the Holy Roman Empire. In the small town of Leonberg, Katharina Kepler is accused of being a witch.Katharina is an illiterate widow, known by her neighbors for her herbal remedies and the success of her children, including her eldest, Johannes, who is the Imperial Mathematician and renowned author of the laws of planetary motion. It's enough to make anyone jealous, and Katharina has done herself no favors by being out and about and in everyone's business.So when the deranged and insipid Ursula Reinbold (or as Katharina calls her, the Werewolf) accuses Katharina of offering her a bitter, witchy drink that has made her ill, Katharina is in trouble. Her scientist son must turn his attention from the music of the spheres to the job of defending his mother. Facing the threat of financial ruin, torture, and even execution, Katharina tells her side of the story to her friend and next-door neighbor Simon, a reclusive widower imperiled by his own secrets.Drawing on real historical documents but infused with the intensity of imagination, sly humor, and intellectual fire for which Rivka Galchen is known, Everyone Knows Your Mother Is a Witch will both provoke and entertain. The story of how a community becomes implicated in collective aggression and hysterical fear is a tale for our time. Galchen's bold new novel touchingly illuminates a society and a family undone by superstition, the state, and the mortal convulsions of history.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Witches",
    "Fantasy",
    "Book Club",
    "Audiobook"
  ],
  "author": "Rivka Galchen",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/54785536-everyone-knows-your-mother-is-a-witch"
}