{
  "title": "Everything Now: Lessons from the City-State of Los Angeles",
  "description": "A provocative, exhilaratingly new understanding of the United States’ most confounding metropolis—not just a great city, but a full-blown modern city-stateAmerica is obsessed with Los Angeles. And America has been thinking about Los Angeles all wrong, for decades, on repeat. Los Angeles is not just the place where the American dream hits the Pacific. (It has its own dreams.) Not just the vanishing point of America’s western drive. (It has its own compass.) Functionally, aesthetically, mythologically, even technologically, an independent territory, defined less by distinct borders than by an aura of autonomy and a sense of unfurling destiny—this is the city-state of Los Angeles.Deeply reported and researched, provocatively argued, and eloquently written, Rosecrans Baldwin's Everything Now approaches the metropolis from unexpected angles, nimbly interleaving his own voice with a chorus of others, from canonical L.A. literature to everyday citizens. Here, Octavia E. Butler and Joan Didion are in conversation with activists and astronauts, vampires and veterans. Baldwin records the stories of countless Angelenos, discovering people both upended and reborn: by disasters natural and economic, following gospels of wealth or self-help or personal destiny. The result is a story of a kaleidoscopic, vibrant nation unto itself—vastly more than its many, many parts.Baldwin’s concept of the city-state allows us, finally, to grasp a place—Los Angeles—whose idiosyncrasies both magnify those of America, and are so fully its own. Here, space and time don’t quite work the same as they do elsewhere, and contradictions are as stark as southern California’s natural environment. Perhaps no better place exists to watch the United States’s past, and its possible futures, play themselves out.Welcome to Los Angeles, the Great American City-State.",
  "genres": [
    "Nonfiction",
    "History",
    "Essays",
    "The United States Of America",
    "Urbanism",
    "Audiobook",
    "Cities"
  ],
  "author": "Rosecrans Baldwin",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/54785534-everything-now"
}