{
  "title": "What About the Baby?: Some Thoughts on the Art of Fiction",
  "description": "A collection of essays, lectures, and observations on the art of writing fiction from an expert novelistLook: Artistic inspiration, religious faith, does not come to most of us with the beating of wings or the leaping of flames or the cinematic, middle-of-the-night aha moment that cuts to an acceptance speech in Stockholm. It comes through long effort, through moving ahead and falling back, through working in the dark. It comes to us in moments of passionate intuition and over long days and nights of painful silence. It arrives in the usual and yet miraculous confluence of ordinary events. It comes and goes. It leaves us in doubt. It is sustained by doubt. It is the work of a lifetime.What About the Baby? Some Thoughts on the Art of Fiction gathers Alice McDermott's essays and lectures regarding her own \"work of a lifetime\" as a bestselling novelist and professor of writing. From technical advice (\"check that your verbs aren't burdened by unnecessary hads and woulds\") to setting the bar (\"I expect the fiction I read to carry with it the conviction that it is written with no other incentive than it must be written\"), from the demands of readers (\"they'd been given a story with a baby in it and they damn well wanted that baby accounted for\"), to the foibles of public life (\"I've never subscribed to the notion that a movie adaptation is the final imprimatur for a work of fiction--despite how often I've been told by encouraging friends and strangers: Maybe they'll make a movie of your novel . . . as if I'd been aiming for a screenplay all along but somehow missed the mark and wrote a novel by mistake\"), McDermott muses delightfully about the art and the craft of literary creation.She also serves throughout as the wise and witty conductor of a literary chorus, quoting generously from the work of various greats (Tolstoy, Shakespeare, Nabokov, Morrison, Woolf, and more), beautifully joining her own voice with theirs. These stories of lessons learned, books read, the terrors and the joys of what she calls \"this mad pursuit,\" form a rich and truly useful collection for readers and writers alike: a deeply charming meditation on the gift that is literature.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Essays",
    "Crafts",
    "Audiobook",
    "Self Help",
    "Memoir"
  ],
  "author": "Alice McDermott",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/54785497-what-about-the-baby"
}