{
  "title": "Embassy Wife",
  "description": "In Katie Crouch's thrilling novel Embassy Wife, two women abroad search for the truth about their husbands--and their country.Meet Persephone Wilder, a displaced genius posing as the wife of an American diplomat in Namibia. Persephone takes her job as a representative of her country seriously, coming up with an intricate set of rules to survive the problems she encounters: how to dress in hundred-degree weather without showing too much skin, how not to look drunk at embassy functions, and how to eat roasted oryx with grace. She also suspects her husband is not actually the ambassador's legal counsel but a secret agent in the CIA. The consummate embassy wife, she takes the newest trailing spouse, Amanda Evans, under her wing.Amanda arrives in Namibia mere weeks after giving up her Silicon Valley job so her husband, Mark, can have his family close by as he works on his Fulbright project. But once they're settled in the sub-Saharan desert, Amanda sees clearly that Mark, who lived in Namibia two decades earlier, has other reasons for returning. Back in the safety of home, the marriage had seemed solid; in the glaring heat of the Kalahari, it feels tenuous. And the situation grows even more fraught when their daughter becomes involved in an international conflict and their own government won't stand up for her.How far will Amanda go to keep her family intact? How much corruption can Persephone ignore? And what, exactly, does it mean to be an American abroad when you're not sure you understand your country anymore?Propulsive and provocative, Embassy Wife asks what it means to be a human in this world, even as it helps us laugh in the face of our own absurd, seemingly impossible states of affairs.",
  "genres": [
    "Fiction",
    "Africa",
    "Audiobook",
    "Contemporary",
    "Thriller",
    "Namibia",
    "Literary Fiction"
  ],
  "author": "Katie Crouch",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/54785514-embassy-wife"
}