{
  "title": "Inflamed: Deep Medicine and the Anatomy of Injustice",
  "description": "Raj Patel, the New York Times bestselling author of The Value of Nothing, teams up with physician, activist, and co-founder of the Do No Harm Coalition Rupa Marya to reveal the links between health and structural injustices--and to offer a new deep medicine that can heal our bodies and our world.The Covid pandemic and the shocking racial disparities in its impact. The surge in inflammatory illnesses such as gastrointestinal disorders and asthma. Mass uprisings around the world in response to systemic racism and violence. Rising numbers of climate refugees. Our bodies, societies, and planet are inflamed.Boldly original, Inflamed takes us on a medical tour through the human body--our digestive, endocrine, circulatory, respiratory, reproductive, immune, and nervous systems. Unlike a traditional anatomy book, this groundbreaking work illuminates the hidden relationships between our biological systems and the profound injustices of our political and economic systems. Inflammation is connected to the food we eat, the air we breathe, and the diversity of the microbes living inside us, which regulate everything from our brain's development to our immune system's functioning. It's connected to the number of traumatic events we experienced as children and to the traumas endured by our ancestors. It's connected not only to access to health care but to the very models of health that physicians practice.Raj Patel, the renowned political economist and New York Times bestselling author of The Value of Nothing, teams up with the physician Rupa Marya to offer a radical new cure: the deep medicine of decolonization. Decolonizing heals what has been divided, reestablishing our relationships with the Earth and one another. Combining the latest scientific research and scholarship on globalization with the stories of Marya's work with patients in marginalized communities, activist passion, and the wisdom of Indigenous groups, Inflamed points the way toward a deep medicine that has the potential to heal not only our bodies, but the world.",
  "genres": [
    "Nonfiction",
    "Medicine",
    "Science",
    "Health",
    "Social Justice",
    "Politics",
    "History"
  ],
  "author": "Rupa Marya",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/54785505-inflamed"
}