{
  "title": "The Portrait of a Mirror",
  "description": "A stunning reinvention of the myth of Narcissus as a modern novel of manners, about two young, well-heeled couples whose parallel lives intertwine over the course of a summer, by a sharp new voice in fiction.Wes and Diana are the kind of privileged, well-educated, self-involved New Yorkers you may not want to like but can't help wanting to like you. With his boyish good looks, blue-blood pedigree, and the recent tidy valuation of his tech startup, Wes would have made any woman weak in the knees—any woman, that is, except perhaps his wife. Brilliant to the point of cunning, Diana possesses her own arsenal of charms, handily deployed against Wes in their constant wars of will and rhetorical sparring. Vivien and Dale live in Philadelphia, but with ties to the same prep schools and management consulting firms as Wes and Diana, they’re of the same ilk. With a wedding date on the horizon and carefully curated life of coupledom, Vivien and Dale make a picture-perfect pair on Instagram. But when Vivien becomes a visiting curator at The Metropolitan Museum of Art just as Diana is starting a new consulting project in Philadelphia, the two couples’ lives cross and tangle. It’s the summer of 2015 and they’re all enraptured by one another and too engulfed in desire to know what they want—despite knowing just how to act. In this wickedly fun debut, A. Natasha Joukovsky crafts an absorbing portrait of modern romance, rousing real sympathy for these flawed characters even as she skewers them. Shrewdly observed, whip-smart, and shot through with wit and good humor, The Portrait of a Mirror is a piercing exploration of narcissism, desire, self-delusion, and the great mythology of love.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Mythology",
    "Romance",
    "Literary Fiction",
    "Retellings",
    "Fantasy"
  ],
  "author": "A. Natasha Joukovsky",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/54776198-the-portrait-of-a-mirror"
}