{
  "title": "Let the Record Show: A Political History of ACT UP New York, 1987-1993",
  "description": "Twenty years in the making, Sarah Schulman's Let the Record Show is the most comprehensive political history ever assembled of ACT UP and American AIDS activism In just six years, ACT UP, New York, a broad and unlikely coalition of activists from all races, genders, sexualities, and backgrounds, changed the world. Armed with rancor, desperation, intelligence, and creativity, it took on the AIDS crisis with an indefatigable, ingenious, and multifaceted attack on the corporations, institutions, governments, and individuals who stood in the way of AIDS treatment for all. They stormed the FDA and NIH in Washington, DC, and started needle exchange programs in New York; they took over Grand Central Terminal and fought to change the legal definition of AIDS to include women; they transformed the American insurance industry, weaponized art and advertising to push their agenda, and battled--and beat--The New York Times, the Catholic Church, and the pharmaceutical industry. Their activism, in its complex and intersectional power, transformed the lives of people with AIDS and the bigoted society that had abandoned them.Based on more than two hundred interviews with ACT UP members and rich with lessons for today's activists, Let the Record Show is a revelatory exploration--and long-overdue reassessment--of the coalition's inner workings, conflicts, achievements, and ultimate fracture. Schulman, one of the most revered queer writers and thinkers of her generation, explores the how and the why, examining, with her characteristic rigor and bite, how a group of desperate outcasts changed America forever, and in the process created a livable future for generations of people across the world.",
  "genres": [
    "History",
    "Nonfiction",
    "Queer",
    "LGBT",
    "Politics",
    "Social Justice",
    "New York"
  ],
  "author": "Sarah Schulman",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/54785548-let-the-record-show"
}