{
  "title": "The Great Destroyers",
  "description": "The Hunger Games meets Pacific Rim, set in the 1960s Cold War.Jo Linden grew up in a world where wars are won with the use of giant mechanical soldiers and the nuclear bomb was never invented. Yet the Cold War still rages. Only now international rivalries between democracy and communism play out at the Pax Games, an Olympic-style competition that pits young pilots of mecha soldiers against each other. The USSR's beaten the US in every game since its inception, and in the 1963 games, the US is desperate for a win. Because it's more than just the Games at stake here. Premier Khrushchev will be attending, and after he and President Kennedy are slated to sign a peace accord stabilizing the war in Vietnam-and their relationship.Raised in her father's mecha repair shop, Jo knows more than anyone about the awesome machines and piloting. She's also the most unlikely pick for Team USA since she's a virtually unknown fighter. So when Jo is invited at the last minute to compete, she jumps at it. This could be the last chance to save her family's home from debt collectors. When Jo arrives in DC for the Games, all eyes on her. But she's got secrets of her own. Secrets that could get her kicked out the Games-and cost her family everything-if anyone found out. As competitors start dying in the arena, it's suddenly clear that it's more than the usual Pax Games, and Jo finds herself drawn into a deadly political plot with the very stake of freedom at its center.In a global chess match between superpowers, playing out in violent games that only humanity could create, comes a terrifying story of clashing titans, deadly competition, patriotism, and the girl caught in the middle of it all.",
  "genres": [
    "Young Adult",
    "Historical Fiction",
    "Science Fiction",
    "Historical",
    "Fantasy",
    "Alternate History",
    "Young Adult Science Fiction"
  ],
  "author": "Caroline Tung Richmond",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/54776505-the-great-destroyers"
}