{
  "title": "A Lantern in the Shade: An Arab-American Historical Fiction Novel of Love, Family and Self-Discovery",
  "description": "An Arab-American Historical Fiction Novel of Love, Family and Self-Discovery.“Equal parts witty, historical and dramatic, Nader’s narrative, A Lantern in the Shade , is a page turner.” – Reader Review“Nader's writing is transporting...There is a magical charm that pervades his writing, as he guides us from the past to the present, from deep comfort & familiarity to heart-pounding seduction and danger.” – Reader Review“I truly enjoyed reading this book, it made me feel heard in some ways, most of the topics he talked about felt very real and hit home, and he did a wonderful job shining the light on important [Middle East and Arab] regional topics. I teared up at the end of it.\" – Reader ReviewThe touching story of an immortal love between a mother and her son. A gripping family heritage tale spanning generations. A Lantern in the Shade is the epic historical fiction novel that draws on a diverse blend of SWANA cultures and poignant, dramatic prose, to tell the story of one immigrant family's quest for truth and honor –– offering a unique perspective that heralds the rich and vibrant history of the SWANA region, while unveiling repressive challenges some marginalized communities face in their day-to-day lives.Nour is the responsible, devoted daughter of Syrian/Lebanese immigrants with a coming-of-age story desperate to be told –– she is faced with the impossible task of reconciling with her father’s heavily-guarded secrets and her mother’s deteriorating mental health. She struggles to prevent her own dreams from falling by the wayside, as she fights to hold her family together.Years later, Nour’s son Jacob makes a harrowing move to the Arabian Peninsula to be closer to his family’s homeland –– yearning to uncover lost details about his mother's life, and ultimately, his own. Jacob’s path to self-discovery, fraught with peril and wonder, quickly becomes treacherous. Should Jacob prevail, he will finally achieve his life-long aspiration to shed light on their family’s deepest-held mysteries. But if he fails, he might just become a lost soul consumed by the sinking sands of the Arabian Desert…Page up and order now.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Jacob Nader",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/54795065-a-lantern-in-the-shade"
}