{
  "title": "Ditch the People Pleaser: A Radical Guide to Not Being Nice",
  "description": "We are living in a culture still defined by unrealistic gender stereotypes and expectations. Despite much progress being made, women are still not, on the whole, treated as equals to men. Gender pay gaps, invisible labour, and outdated attitudes towards women (especially around sex and relationships) mean that many of us grow into adulthood shackled to our need to be nice, liked, and to please, at the detriment of our happiness and wellbeing. In Ditch the People Pleaser, you are going to explore four of the areas where you may find yourself people life, relationships (including love and sex), work, and business and leadership.This book will help you 1) Undo the effects of people pleasing in your life so you ARE free from expectations + boxes.2) Release the need to please so you are able to achieve deep connection, a sense of purpose + guidance from your inner knowing.3) Break the cycle for your personal + spiritual growth AND for the young people in your life. You will be able to model and pass on a healthier way of being for the next generation.4) Use techniques and practices that will transform the way you feel about being nice and acceptable.5) Strengthen your relationship to yourself and the people in your life, expand into your work and contribute to compassionate change.Not only will you discover what the antidote is to people pleasing you will be supported with practical techniques and supportive resources to ditch the need to please right away.About the Kara is a writer, yoga teacher, intuitive coach, and multi award-winning entrepreneur. Founder of the Sensitive Superstar Movement, she wants sensitives to flip the story of sensitivity being a weakness, and instead own their sensitivity as their superpower. Kara had a breakthrough on her ‘journey’ when she finally got it! She discovered that being sensitive can be amazing, and that her superpowers come from that sensitivity. She would LOVE to see a world where wealth is shared equally, the earth is respected and looked after, and everyone is given the same opportunities and freedom, regardless of race. She is committed to playing her part in creating that equitable world. Kara likes being out under the stars at festivals, trying to keep plants alive, and eating vegan cakes.Section 1: People Pleasing … In Life Chapter 1: Craving Approval Chapter 2: Raising People Pleasers Chapter 3: People Pleasing at Home Chapter 4: InnerFEARfreaks Section 2: People Pleasing … in Relationships Chapter 5: Family Chapter 6: Father Relationship Chapter 7: Parenting Chapter 8: Friendships Chapter 9: Intimate Relationships Chapter 10: Love, Sex and Sexuality Chapter 11: Women Misogynists Section  3: People Pleasing … In Work Chapter 12: The Post-Metoo Workplace Section 4: People pleasing in Business, Leadership and Your Purpose Chapter 13: The Five Superpowers Section 5: The 7-Step Exploration Step",
  "genres": [],
  "author": "Kara V Grant",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/54799326-ditch-the-people-pleaser"
}