{
  "title": "Beyond the Four Kingdoms Box Set Two",
  "description": "The final three interconnected stand-alone fairy tale retellings from the Beyond the Four Kingdoms series Book 4 - A Dream of Ebony and A Retelling of Snow White Snow has always lived under the shadow of her cruel stepmother, with only her beloved father and her childhood friend—the huntsman, Alexander—to make life bearable. When her father dies, she should be crowned queen, but instead she finds herself fleeing for her life. With no allies, no skills, and no food, her future could be over before it has truly begun. But there’s more at stake than just one life. If Snow can’t claim her throne, her kingdom faces destruction. Snow has to make a focus on her own salvation or put everything on the line—even those she loves the most. And if she’s going to succeed, Snow must fight the hardest battle of all, against her own doubt and weakness, and gain new skills and strength she never imagined possessing. Alexander is ready to help her. But if she lets him, the consequences might be more than she can bear—because her heart is in as much jeopardy as the kingdom. In this reimagining of the classic fairy tale, Snow must find her inner strength in time to fight for her throne before it’s too late. Book 5 - A Captive of Wing and A Retelling of Swan Lake Princess Adelaide has been missing for years. And that’s exactly the way she wants it. Haunted by her past, not even the curse that entraps her is enough to make her long for her old home. But her past finds her anyway, in the form of a handsome prince from her childhood. Adelaide doesn’t want to let Gabe in, but a sinister force is spreading fear throughout her new kingdom, and only Gabe has the will to help her. Adelaide can’t refuse his assistance—not when the evil might soon ensnare much more than a solitary princess. But with her friends and her new kingdom in danger, even the help of Gabe and her seven swans might not be enough. In this reimagining of the classic tale, Swan Lake, the trapped princess must find the courage to overcome her past if she has any hope of turning a tragedy into a happy ending. Book 6 - A Princess of Wind and A Retelling of The Little Mermaid Isla may be a mermaid princess, but she’s never felt at home in her undersea kingdom. Instead she dreams of the day her people can return to the surface—and the boy whose life she once saved. But while Isla foresees danger for her people beneath the ocean, she has no concept of the dark forces working to keep her people submerged. When an impetuous vow sets her on the course of the truth, Isla discovers that shadowy foes beset the kingdoms of both land and sea. And when she finally finds herself onshore, Isla realizes the fight will require not only her sword but her mind and heart as well—at least if she ever hopes to overcome her enemies and win the love of the prince of her dreams. In this reimagining of the classic fairy tale, The Little Mermaid, the princess will have to grow beyond her dreams if she wants to save two kingdoms and her own heart. If you enjoy clean romance, adventure, and intrigue, then try the books in the Beyond the Four Kingdoms series now! These interconnected fairy tale retellings each feature a different princess who has to fight for her happily ever after. Beyond the Four Kingdoms reading A Dance of Silver and A Retelling of The Twelve Dancing Princesses<",
  "genres": [
    "Fantasy",
    "Audiobook",
    "Fairy Tales",
    "Fiction",
    "Young Adult Fantasy",
    "Fairy Tale Retellings",
    "Romance"
  ],
  "author": "Melanie Cellier",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/54805265-beyond-the-four-kingdoms-box-set-two"
}