{
  "title": "Call of Water",
  "description": "A man with a teasing smile and an angel’s voice, Zeph is supposed to be nothing more than a beautiful, fun Parisian adventure. His voice lures me in. His gorgeous blue eyes draw me to him. And his smile puts me at ease.We part after just one night. The next time I see him, I'm captured and trapped in a world I never knew existed. Madame Tan's establishment is intriguing and whimsical on the outside. But it turns dark and sinister as I'm plunged deep into it.Humans do not belong in the menagerie, so what is Zeph doing here? I realize I know nothing about the man who has ruled over my imagination since the day we met.I need to find my way out or risk spending the rest of my life locked in a cage. Only the more I learn about Zeph, the more I realize he's not from my world.Is he a willing participant in the menagerie? Or a victim, just like me?_____________________________________Each book in the Madame Tan's Freakshow series is a complete love story of a separate couple. To follow the main storyline, however, it is recommended to read the trilogy in order.Second edition (2022)A part of this story, with a different world explanation, has been previously published as Menagerie of Oddities in Tempted by Fae anthology.Call of Water is a contemporary fantasy romance that contains graphic descriptions of intimacy and some violence ( not  by the hero against the heroine.) Intended for mature readers.____________________________Books set in the world of the River of Mists:Wingless CrowWingless CrowCrownless KingFire in StoneFire in StoneHearts on FireSerpent's TouchSerpent's TouchSerpent's ClaimMadame Tan's FreakshowCall of WaterMadness of the MoonPower of RageNOTE: All duets and trilogies in the River of Mists can be read independently.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal Romance",
    "Paranormal",
    "Fae",
    "Mermaids",
    "Fantasy Romance"
  ],
  "author": "Marina Simcoe",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/54798827-call-of-water"
}