{
  "title": "Light and Liberty: Reflections on the Pursuit of Happiness",
  "description": "Were Thomas Jefferson alive to read this book, he would recognize every sentence, every elegant turn of phrase, every lofty, beautifully expressed idea. Indeed, every word in the book is his. In an astonishing feat of editing, Eric S. Petersen has culled the entirety of Thomas Jefferson’s published works to fashion thirty-four original essays on themes ranging from patriotism and liberty to hope, humility, and gratitude. The result is a lucid, inspiring distillation of the wisdom of one of America’s greatest political thinkers.From his personal motto—“Rebellion to tyrants is obedience to God”—to his resounding discourse on “life, liberty and the pursuit of happiness” in the Declaration of Independence, Jefferson defined the essential truth of the American spirit. In the essays that Petersen has crafted from letters, speeches, and public documents, Jefferson’s unique moral philosophy and vision shine through. Among the hundreds of magnificent sentences gathered in this volume, here are Jefferson’s pronouncements on “I have but one system of ethics for men and for nations—to be grateful, to be faithful to all engagements and under all circumstances, to be open and generous.” “A concern purely between our God and our consciences.”America’s national “It is part of the American character to consider nothing as desperate; to surmount every difficulty with resolution and contrivance.”Public “We shall all consider ourselves unauthorized to saddle posterity with our debts, and morally bound to pay them ourselves.” “I abhor war and view it as the greatest scourge of mankind.”In stately measured cadences, these thirty-four essays provide timeless guidance on leading a spiritually fulfilling life . Light and Liberty is a triumphant work of supreme eloquence, as uplifting today as when Jefferson first set these immortal sentences on paper.",
  "genres": [
    "History",
    "Philosophy",
    "Nonfiction",
    "Politics",
    "Biography"
  ],
  "author": "Thomas Jefferson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/548042.Light_and_Liberty"
}