{
  "title": "Bass Ackwards and Belly Up",
  "description": "A first novel about four best friends who, after graduating high school, decide to postpone the standard college route to pursue their creative dreams. Harper Waddle, Sophie Bushell, and Kate Foster are about to commit the ultimate suburban sin--bailing on college to each pursue their dreams: write the next Great American Novel, make it as a Hollywood actress, and backpack around the world. Middlebury-bound Becca Winsberg is convinced her friends have gone insane...until they remind her she just might have a dream of her own. So what if their lives are bass ackwards and belly up? They'll always have each other. Harper is going to be the next Jane Austen. Or Sylvia Plath. Or Plum Sykes. Figuring out which should be easy. It?s living with the lie she told her three best friends that?s going to be hard.Kate doesn?t know exactly what she wants. But whatever it is, she won?t find it at Harvard. Maybe the answer is in Paris, or Athens? or anywhere Kate can be someone besides the girl with perfect grades, perfect hair, and the perfect boyfriend.Sophie is a star. She?s already got the looks, the talent, and a list of demands for her dressing room. Now that she?s wrangled a furnished guesthouse in Beverly Hills, it?s only a matter of time before she?s discovered. Unless she isn?t.Becca is dysfunctional. At least, her family is. Which is why she can?t wait to flee the drama and get to college. But Becca?s friends know she needs more than a spot on the Middlebury ski team and a cozy dorm room. They know she needs to fall in love.Dreams are complicated. They almost never turn out like you imagine?they almost always change. Sometimes, they change you.",
  "genres": [
    "Young Adult",
    "Chick Lit",
    "Contemporary",
    "Fiction",
    "Romance",
    "New Adult",
    "Realistic Fiction"
  ],
  "author": "Elizabeth Craft",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/547918.Bass_Ackwards_and_Belly_Up"
}