{
  "title": "Sunflower Sisters",
  "description": "Lilac Girls introduced readers to Caroline Ferriday, an American philanthropist who helped young girls released from Ravensbruck concentration camp. Now, in Sunflower Sisters, Kelly tells the story of her ancestor Georgeanna Woolsey, a Union nurse who joins the war effort during the Civil War, and how her calling leads her to cross paths with Jemma, a young enslaved girl who is sold off and conscripted into the army, and Ann-May Wilson, a southern plantation mistress whose husband enlists.Georgeanne \"Georgey\" Woolsey isn't meant for the world of lavish parties and demure attitudes of women of her stature. So when the war ignites the nation, Georgey follows her passion for nursing during a time when doctors considered women a bother on the battlefront. In proving them wrong, she and her sister Eliza venture from New York to Washington, D.C., to Gettysburg and witness the unparalleled horrors of slavery as they become involved in the war effort.In the South, Jemma is enslaved on the Peeler Plantation in Maryland, where she lives with her mother and father. Her sister, Patience, is enslaved on the plantation next door and both live in fear of LeBaron, an abusive overseer who tracks their every move. When Jemma is sold by the cruel plantation mistress Anne-May at the same time the Union army comes through, she sees a chance to finally escape--but only by abandoning the family she loves.Anne-May is left behind to run Peeler Planation when her husband joins the Union Army and her cherished brother enlists with the Confederates. In charge of the household, she uses the opportunity to follow her own ambitions and is drawn into a secret Southern network of spies, finally exposing herself to the fate she deserves.Inspired by true accounts, Sunflower Sisters provides a vivid, detailed look at the Civil War experience, from the barbaric and inhumane plantations, to a war-torn New York City to the horrors of the battlefield. It's a sweeping story of women caught in a country on the brink of collapse, in a society grappling with nationalism and unthinkable racial cruelty, a story still so relevant today.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Civil War",
    "Historical",
    "Audiobook",
    "Book Club",
    "War"
  ],
  "author": "Martha Hall Kelly",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/54809001-sunflower-sisters"
}