{
  "title": "An Ordinary Age: Finding Your Way in a World That Expects Exceptional",
  "description": "In conversation with young adults and experts alike, journalist Rainesford Stauffer explores how the incessant pursuit of a “best life” has put extraordinary pressure on young adults today, across their personal and professional lives—and how ordinary, meaningful experiences may instead be the foundation of a fulfilled and contented life.Young adulthood: the time of our lives when, theoretically, anything can happen, and the pressure is on to make sure everything does. Social media has long been the scapegoat for a generation of unhappy young people, but perhaps the forces working beneath us—wage stagnation, student debt, perfectionism, and inflated costs of living—have a larger, more detrimental impact on the world we post to our feeds. An Ordinary Age puts young adults at the center as Rainesford Stauffer examines our obsessive need to live and post our #bestlife, and the culture that has defined that life on narrow, and often unattainable, terms. From the now required slate of (often unpaid) internships, to the loneliness epidemic, to the stress of \"finding yourself\" through school, work, and hobbies—the world is demanding more of young people these days than ever before. And worse, it’s leaving little room for young people to ask the big questions about who they want to be, and what makes a life feel meaningful.Perhaps we’re losing sight of the things that fulfill us: strong relationships, real roots in a community, and the ability to question how we want our lives to look and feel, even when that’s different from what we see on the ‘Gram. Stauffer makes the case that many of our most formative young adult moments are the ordinary ones: finding our people and sticking with them, learning to care for ourselves on our own terms, and figuring out who we are when the other stuff—the GPAs, job titles, the filters—fall away.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Mental Health",
    "Business",
    "Audiobook",
    "Adult"
  ],
  "author": "Rainesford Stauffer",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/54798482-an-ordinary-age"
}