{
  "title": "Protecting His New Family: A Navy SEAL Romance with an Unexpected Family",
  "description": "Former Navy SEAL Owen Foster has never been in love and never thought of having a family. Getting tied down to one woman isn’t his priority. But when his brother and sister-in-law die in a car crash, leaving their toddler son Myles under his care, he’s thrown into domesticity overnight. The couple left the care of Myles not only to him but also his sister-in-law’s sister, Samantha Mayfield. Now, the man who’d never allowed his “dates” to stay past breakfast finds himself living with a gorgeous woman he’s been attracted to for years. It helps knowing that Sam is the opposite of every woman Owen’s been with. She’s smart, driven, and the classiest girl he’s ever met. Definitely out of his league. Which is why he just can’t understand why his heart seems to have forgotten he’s not the marrying kind of guy.Samantha is sure she doesn’t have a maternal bone in her body. Her entire life has been focused on her career as a medical researcher trying to discover a vaccine for a rare disease. Despite the recent threats against her project, her work is her haven, her happy place. Changing diapers and drool is not—at least at first. Like everything in her life, Samantha is determined to succeed. Surely caring for a baby can’t be more complex than finding a cure for a disease. And Owen is a natural father, so he’s a big help. And a big distraction. She’s always thought he was sexy, but now she’s seeing his softer side. A side that’s hard to resist. When the threats against her escalate dangerously, Sam has to admit that it’s kind of nice to have a big, tough Navy SEAL around. Actually, it’s more than nice. It makes her wonder if it’s possible for Owen to stay with her forever…USA Today Bestseller Leslie North and Katie Knight invite you to indulge in a heart-pounding military romance with a hot, super-alpha Navy SEAL protecting the woman he loves at all costs...",
  "genres": [
    "Romance",
    "Mystery Thriller",
    "Contemporary"
  ],
  "author": "Katie Knight",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/54801616-protecting-his-new-family"
}