{
  "title": "The Kindred Spirits Supper Club",
  "description": "\"A charming rom-com with a supernatural twist...Filled with a strong sense of place, mouthwatering descriptions of food, and a sweet love story (or two), Reichert's latest will surely delight readers.\" Booklist Starred ReviewNamed a Must Read for spring by Buzzfeed * Bustle * Booktrib * PopSugar * BookRiot * Midwest Living Jobless and forced home to Wisconsin, journalist Sabrina Monroe can tolerate reunions with frenemies and kisses from old boyfriends, but not the literal ghosts that greet her in this heartwarming tale of the power of love and connection from acclaimed author Amy E. Reichert.For Sabrina Monroe, moving back home to the Wisconsin Dells–the self-described Waterpark Capital of the World–means returning to the Monroe family curse: the women in her family can see spirits who come to them for help with unfinished business. But Sabrina’s always redirected the needy spirits to her mom, who’s much better suited for the job. The one exception has always been Molly, a bubbly rom-com loving ghost, who stuck by Sabrina’s side all through her lonely childhood.Her personal life starts looking up when Ray, the new local restaurateur, invites Sabrina to his supper club, where he flirts with her over his famous Brandy Old-Fashioneds. He’s charming and handsome, but Sabrina tells herself she doesn’t have time for romance–she needs to focus on finding a job. Except the longer she’s in the Dells, the harder it is to resist her feelings for Ray. Who can turn down a cute guy with a fondness for rescue dogs and an obsession with perfecting his fried cheese curds recipe? When the Dells starts to feel like home for the first time and with Ray in her corner, Sabrina begins to realize that she can make a difference and help others wherever she is.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Chick Lit",
    "Paranormal",
    "Fantasy",
    "Contemporary Romance"
  ],
  "author": "Amy E. Reichert",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/54802068-the-kindred-spirits-supper-club"
}