{
  "title": "The Wreckage of My Presence",
  "description": "Laugh-out-loud, deeply insightful, and emotion-filled essays from multi-talented actress, comedian, podcaster, and writer Casey Wilson.Casey Wilson has a lot on her mind and she isn’t afraid to share. In this dazzling collection of essays, skillfully constructed and brimming with emotion, she shares her thoughts on the joys and vagaries of modern-day womanhood and motherhood, introduces the not-quite-typical family that made her who she is, and persuasively argues that lowbrow pop culture is the perfect lens through which to understand human nature.Whether she’s extolling the virtues of eating in bed, processing the humiliation over her father’s late in life perm, or exploring her pathological need to be liked, Casey is witty, candid, and full of poignant and funny surprises. Humorous dives into her obsessions and areas of personal expertise—Scientology and self-help, nice guys, reality television shows—are matched by touching meditations on female friendship, grief, motherhood, and identity. Reading The Wreckage of My Presence is like spending time with a close friend—a deeply passionate, full-tilt, joyous, excessive, compulsive, shameless, hungry-for-it-all, loyal, cheerleading friend. A friend who is ready for any big feeling that comes her way and isn’t afraid to embrace it.Bed person --The wreckage of my presence --To all the boys I loved before --Cool girl --A saber story --Send in the clowns --Flyentology --Hide your phones --Expect a miracle --Hiked out --The BBQ --Tears of a clown --Happy endings --My husband's just not that into me; or Afrin: a love story --Grandpa's pretty girl --It doesn't do --What dis --Open-door policy --Mother's day --People don't know how to act --Gimme some sugar; or, the wreckage of my presence redux",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Essays",
    "Humor",
    "Comedy",
    "Biography"
  ],
  "author": "Casey  Wilson",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/54798456-the-wreckage-of-my-presence"
}