{
  "title": "With Scott Before the Mast: These are the Journals of Francis Davies Leading Shipwright RN when on board Captain Scott’s Terra Nova Expedition",
  "description": "My interview with Captain Scott, he explained what would be expected of me. My principal job, he said, would be the erection of Winter Quarters for the Southern party, which was to make an attempt to reach the South Pole..... He also told me that I would be paid GBP40 a year, adding that if I made a success of the job, he wouldn't say what he would do for me, but if on the other hand, I failed to come up to scratch, I would be for the high jump. The geographic and scientific accomplishments of Captain Scott's two Antarctic expeditions changed the face of the Twentieth Century in ways that are still not widely appreciated over a hundred years later. The fact of accomplishment has tended to be lost in speculative argument as to how Scott should have done this instead of that, supposedly to achieve the extra few yards per day to save the lives of the South Pole Party in 1912. Also lost to a generation overwhelmed with information, however, is the sublime sense of adventure into the unknown, which Scott's expeditions represented to his generation. We have forgotten what it is to take the awesome life-gambling risk of sailing beyond the edge of the map into nothingness and rendering it known. We send robot explorers instead. As a result, after two millennia of maritime and exploration history, we have become detached from the sea which surrounds our island and the tradition of exploration which it represents. With Before the Mast is a unique account that serves as an antidote to this disconectedness. It is no fictional 'Hornblower', although it may seem so at times. This is a true story. It presents one man's account of his part in a great act of derring-do, the assault on the South Pole in 1912. Most records of Captain Scott's British Antarctic Expedition aboard Terra Nova (1910-1913) are the accounts of officers. With Before the Mast is the story of Francis Davies, Shipwright, R.N., and Carpenter. The title says it all but may be lost on landlubbers. Before the mast means 'to serve as an ordinary seaman in a sailing ship'. This makes it a rare and hugely important account, presenting a viewpoint from the lower ranks. Such insight is rarely available and the long overdue publication of this account is greatly to be welcomed. When I first read this manuscript some years ago, I was hugely excited by the refreshing perspective that it gave to a well-aired story. Although an autobiographical period piece, written with an eye to publication many years after the events that it recalls, it is still of great interest. It tells the often forgotten story of the vast majority of Scott's men, the sailors of Terra Nova; the supporting cast, if you like, to the Shore Parties of officers and scientists. Through a kaleidoscope of memories, this book gets to the heart of the huge logistic effort that was the British Antarctic Expedition.",
  "genres": [],
  "author": "Francis Davies",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/54790125-with-scott-before-the-mast"
}