{
  "title": "The Chief Witness: escape from China’s modern-day concentration camps",
  "description": "A shocking depiction of one of the world’s most ruthless regimes — and the story of one woman’s fight to survive.I will never forget the camp. I cannot forget the eyes of the prisoners, expecting me to do something for them. They are innocent. I have to tell their story, to tell about the darkness they are in. It is so easy to suffocate us with the demons of powerlessness, shame, and guilt. But we aren’t the ones who should feel ashamed. Born in China’s north-western province, Sayragul Sauytbay trained as a doctor before being appointed a senior civil servant. But her life was upended when the Chinese authorities incarcerated her. Her crime: being Kazakh, one of China’s ethnic minorities.The north-western province borders the largest number of foreign nations and is the point in China that is the closest to Europe. In recent years it has become home to over 1,200 penal camps — modern-day gulags that are estimated to house three million members of the Kazakh and Uyghur minorities. Imprisoned solely due to their ethnicity, inmates are subjected to relentless punishment and torture, including being beaten, raped, and used as subjects for medical experiments. The camps represent the greatest systematic incarceration of an entire people since the Third Reich.In prison, Sauytbay was put to work teaching Chinese language, culture, and politics, in the course of which she gained access to secret information that revealed Beijing’s long-term plans to undermine not only its minorities, but democracies around the world. Upon her escape to Europe she was reunited with her family, but still lives under constant threat of reprisal.This rare testimony from the biggest surveillance state in the world reveals not only the full, frightening scope of China’s tyrannical ambitions, but also the resilience and courage of its author.",
  "genres": [
    "Nonfiction",
    "China",
    "Memoir",
    "Politics",
    "Biography",
    "Asia",
    "Biography Memoir"
  ],
  "author": "Sayragul Sauytbay",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/54823635-the-chief-witness"
}