{
  "title": "A Place Like Home",
  "description": "'As with every Rosamunde Pilcher story - long or short - I began to read and couldn't stop' - Lucinda RileyA spellbinding collection of fifteen stories from multi-million copy, internationally bestselling modern classic author Rosamunde Pilcher, with an introduction by Sunday Times bestselling author Lucinda Riley.In The Holiday , a wife surprises her husband of twenty-five years with a trip full of Mediterranean sunshine, red rocks and blue seas in an effort to rekindle the romance they had before children.Skelmerton takes the reader to the bright spring sunshine and sparkling waves of a Northumbrian village where old flames meet again.In A Place Like Home , a lonely young woman goes to recuperate in the Scottish countryside after a brief illness. The fruit orchards and fresh sea air offer much needed respite - but not as much as the handsome, mysterious farmer . . .Each of the fifteen stories is a perfect slice of romance written with warmth and passion, featuring some wonderfully memorable, smart and feisty female characters that will transport the reader to another time and place.Praise for A PLACE LIKE 'A PLACE LIKE HOME is a wonderful treat for fans of Rosamunde Pilcher's writing. Each story resonates with the echoes of a voice that is at once familiar and beloved . Reading this collection of love stories does indeed feel just like returning to a place like home .' - Fiona Valpy , bestselling author of The Dressmaker's Gift' An antidote to challenging times , this set of stories from a much-loved author has a comforting, nostalgic feel - cosy and reassuring - with Rosamunde Pilcher's signature insight into domestic hopes and yearnings, taking us into a gentler world .' - Sarah Maine , bestselling author of Beyond the Wild River'Reading this anthology of short stories was like being wrapped in a cashmere shawl and travelling back to the recent past where people drank sherry before dinner and seemed to have more time. Highly recommended reading that will lift you during this difficult period we are experiencing. Find a saggy, chintz armchair, a log fire and a glass of sherry and indulge . . .' - Angela Petch , bestselling author of The Tuscan SecretFurther praise for Rosamunde 'Her genius is to create characters you really care about' Daily Express'Rosamunde Pilcher's warm spell is charming and utterly convincing' Daily Mail'Pilcher's storytelling skills are serene and beguiling' The Times'Pilcher's strength is knowing what she can do well and writing about what she knows. She has a way of tapping into the emotional life of her readers and making them care about characters not unlike themselves' Daily Telegraph'Britain's most under-rated novelist' Sunday Times'This warm-hearted family saga, beautifully written and expertly paced, is just assatisfying now as when it was first published more than 30 years ago.' Daily Mail",
  "genres": [
    "Short Stories",
    "Fiction",
    "Romance",
    "Chick Lit",
    "Audiobook",
    "British Literature",
    "Drama"
  ],
  "author": "Rosamunde Pilcher",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/54822933-a-place-like-home"
}