{
  "title": "Slonim Woods 9: A Memoir",
  "description": "An “extraordinary” (Nylon) firsthand account of the creation of a modern cult and the costs paid by its young a group of college roommates   “Intense . . . [a tale] of hard-won survival, and creating a life after the unimaginable.”—Salon The inspiration for the Hulu docuseries Stolen Youth, directed by Zach Heinzerling and co-produced by Daniel Barban LevinIn September 2010, at the beginning of the academic year at Sarah Lawrence College, a sophomore named Talia Ray asked her roommates if her father could stay with them for a while. No one objected. Her father, Larry Ray, was just released from prison, having spent three years behind bars after a conviction during a bitter custody dispute.Larry Ray arrived at the dorm, a communal house called Slonim Woods 9, and stayed for the whole year. Over the course of innumerable counseling sessions and “family meetings,” the intense and forceful Ray convinced his daughter’s friends that he alone could help them “achieve clarity.” Eventually, Ray and the students moved into a small Manhattan apartment, beginning years of manipulation and abuse, as Ray tightened his control over his young charges through blackmail, extortion, and ritualized humiliation. After a decade of secrecy, Larry Ray was finally indicted on charges of extortion, sex trafficking, forced labor, and money laundering.Daniel Barban Levin was one of the original residents of Slonim Woods 9. Beginning the moment Daniel set foot on Sarah Lawrence’s idyllic campus and spanning the two years he spent in the grip of a megalomaniac, this brave, lyrical, and redemptive memoir reveals how a group of friends were led from college to a cult without the world even noticing.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Memoir",
    "Cults",
    "Audiobook",
    "Crime",
    "Cult Classics"
  ],
  "author": "Daniel Barban Levin",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/54814838-slonim-woods-9"
}