{
  "title": "Madam Speaker: Nancy Pelosi and the Lessons of Power",
  "description": "Featuring more than 150 exclusive interviews with those who know her best—and a series of in-depth, news-making interviews with Pelosi herself—MADAM SPEAKER is unprecedented in the scope of its exploration of Nancy Pelosi’s remarkable life and of her indelible impact on American politics. Before she was Nancy Pelosi, she was Nancy D’Alesandro. Her father was a big-city mayor and her mother his political organizer; when she encour­aged her young daughter to become a nun, Nancy told her mother that being a priest sounded more appealing. She didn’t begin running for office until she was forty-six years old, her five children mostly out of the nest. With that, she found her calling.Nancy Pelosi has lived on the cutting edge of the revolution in both women’s roles and in the nation’s movement to a fiercer and more polarized politics. She has established herself as a crucial friend or for­midable foe to U.S. presidents, a master legislator, and an indefatigable political warrior. She took on the Democratic establishment to become the first female Speaker of the House, then battled rivals on the left and right to consolidate her power. She has soared in the sharp-edged inside game of politics, though she has struggled in the outside game—demonized by conservatives, second-guessed by progressives, and routinely underestimated by nearly everyone. All of this was preparation for the most historic challenge she would ever face, at a time she had been privately planning her retirement. When Donald Trump was elected to the White House, Nancy Pelosi became the Democratic counterpart best able to stand up to the disruptive president and to get under his skin. The battle between Trump and Pelosi, chronicled in this book with behind-the-scenes details and revelations, stands to be the titanic political struggle of our time.",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Memoir",
    "Leadership"
  ],
  "author": "Susan  Page",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/54817562-madam-speaker"
}