{
  "title": "Sing Backwards and Weep",
  "description": "This gritty bestselling memoir by the singer Mark Lanegan of Screaming Trees, Queens of the Stone Age, and Soulsavers documents his years as a singer and drug addict in Seattle in the '80s and '90s.When Mark Lanegan first arrived in Seattle in the mid-1980s, he was just \"an arrogant, self-loathing redneck waster seeking transformation through rock 'n' roll.\" Little did he know that within less than a decade he would rise to fame as the frontman of the Screaming Trees and then fall from grace as a low-level crack dealer and a homeless heroin addict, all the while watching some of his closest friends rocket to the forefront of popular music.In Sing Backwards and Weep, Lanegan takes readers back to the sinister, needle-ridden streets of Seattle, to an alternative music scene that was simultaneously bursting with creativity and dripping with drugs. He tracks the tumultuous rise and fall of the Screaming Trees, from a brawling, acid-rock bar band to world-famous festival favorites that scored a hit number five single on Billboard's alternative charts and landed a notorious performance on Late Night with David Letterman , where Lanegan appeared sporting a fresh black eye from a brawl the night before. This book also dives into Lanegan's personal struggles with addiction, culminating in homelessness, petty crime, and the tragic deaths of his closest friends. From the back of the van to the front of the bar, from the hotel room to the emergency room, onstage, backstage, and everywhere in between, Sing Backwards and Weep reveals the abrasive underlining beneath one of the most romanticized decades in rock history-from a survivor who lived to tell the tale.Gritty, gripping, and unflinchingly raw, Sing Backwards and Weep is a book about more than just an extraordinary singer who watched his dreams catch fire and incinerate the ground beneath his feet. It's about a man who learned how to drag himself from the wreckage, dust off the ashes, and keep living and creating.\"Mark Lanegan—primitive, brutal, and apocalyptic. What's not to love?\" — Nick Cave, author of The Sick Bag Song and The Death of Bunny Munro",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Mark Lanegan",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/54816411-sing-backwards-and-weep"
}