{
  "title": "After You Died",
  "description": "Bisexual teen, Asher remembers nothing from the night in 1968 that the police found him covered in his girlfriend's blood. He knows he'd never hurt anyone, least of all her. But the only person who believes him is his twin sister. He's sentenced to five years at the Dozier Reform School. And like Asher's memory, Dozier hides violent secrets of its own. Juvenile boys serving time for everything from truancy to murder are hidden away in the sinister School for Boys. Those who manage to escape its bounds with broken bones and scars are the lucky ones. Asher's afraid he may end up like many of the other students buried beneath unmarked graves. Worse, his fellow inmates may become his next victims. In hopes of recovering the events from the night of the murder, Asher visits the school's psychiatrist. But when the memories return, he finds many aren't his own. Thoughts, feelings, and visions from another life, and another time, slip into his mind. And each new memory brings consequences. First days disappear, then weeks. As the weeks slip away, students follow. He starts seeing his murdered girlfriend Olivia in the woods around the school. One morning, after following her ghost into the forest the night before, he wakes up outside covered in blood with no memory, and fears he's killed someone else. On top of that, he learns that his sister―who had feared she was being stalked by a boy from their school―has disappeared. Could Asher himself somehow be responsible? As Asher's possible body count grows, he knows the answers he needs are trapped within his own mind, and in ghosts from the past. He needs to find out who he is and prove the murders aren't connected to him or risk losing his sanity and freedom forever. AFTER YOU DIED is a paranormal thriller loosely based on true events.",
  "genres": [
    "LGBT",
    "Mystery",
    "Young Adult",
    "Thriller",
    "Historical Fiction",
    "Fiction",
    "Mystery Thriller"
  ],
  "author": "Dea Poirier",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/54829406-after-you-died"
}