{
  "title": "Dad The Best I Can : Nuggets of Wisdom From Entrepreneurs, CEOs, and 52 Other Dads That Will Help You Thrive At Dad Life",
  "description": "“IS EVERY DAD GOING THROUGH THIS?”That is the question that Rob Roseman, host of the Dad the Best I Can podcast, and dad of 3 kids  (ages 8, 6, & 3) set out to answer.  Rob interviewed 50+ rockstar entrepreneurs like Jesse Itzler, and CEOs like Drift's David Cancel, about their experiences as Dads. The Dad the Best I Can book is a fun and relatable collection of their advice, to help other dads thrive at Dad Life (without losing their minds). ------WHAT OTHERS ARE ★★★★★ \"As a father of young kids, the book provided valuable insight from other fathers and is truly a hidden gem. Read it!\" --KT★★★★★ \"What an awesome and special book. I love reading about other dads and their approach to fatherhood. I am so glad this author created this book--it is a wonderful collection of input from a wide variety of fathers. Highly recommended!!!\" --Zack Bush★★★★★ “Being a dad is the most rewarding and challenging thing I have ever done. I love learning about other dads and how they are also trying not to blow it with this most marvelous of life opportunities.” --Seth Jay King, @LateNotes------------------------HERE’S A TASTE OF WHAT YOU WILL ★ The #1 lesson this financial advisor learned from his divorce★ How this educator thinks we should define success to our kids★ What this ex-MLB pitcher think about kids specializing in sports★ Why coaching his kid's football team turned out to be great therapy★ The most important skills this tech CEO thinks kids should learn today★ How to take the best lessons from your dad and teach them to your kids★ Why this CEO doesn't think there's really such a thing as a work-life balance★ Find these nuggets and 50+ more inside the Dad the Best I Can book------------------Get more Dad tips from Rob and his guests   ★ LOOKING FOR THE PERFECT GIFT FOR YOUR HUSBAND, FATHER, OR FRIEND? ★ You can't go wrong with this book! Filled with funny anecdotes, actionable tips, and exciting stories, Dad the Best I Can will teach every Dad invaluable parenting lessons.★★★★★ Scroll Up, Click on \"Buy Now with 1-Click\", and Get Your Copy Now! ★★★★★",
  "genres": [
    "Parenting"
  ],
  "author": "Rob  Roseman",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/54829772-dad-the-best-i-can"
}