{
  "title": "Blitz",
  "description": "New from a USA Today Bestseller! One obnoxious billionaire. One small-town girl with heart. And the promo blitz that will either bring them together or keep them worlds apart.Mina Lipinski. She's a girl with a problem, and the only person who can solve it is Chase Blastoviak, the most obnoxious guy she's ever met – slick, cocky, and way too jaded for his own good.Chase Blastoviak. He's given up crazy chicks for a reason, which means that Mina Lipinski, the girl begging Blast Tools to sponsor a hometown farmers' festival, is definitely off-limits – especially now that he's avoiding troublesome temptations.Too bad for both of them, each has something the other needs. Mina needs the sponsorship to keep her hometown traditions alive. And Chase? Well, he needs a girl like Mina, whether he realizes it or not.**Blitz is a fun, full-length billionaire romance with a guaranteed happily-ever-after!**The Blast Brothers Blitz is the third in a series of funny contemporary romance novels starring three billionaire brothers and the women who claim their hearts. Each book can be read as a standalone.BOOM, an Enemies-to-Lovers Romance (Brody's Book). He torched her scholarship. She torched his pickup. Six years later, these high school enemies are at it again, working to restore a crumbling beach house they each want to claim as their own – unless what they truly want to claim is each other.BANG, an Opposites-Attract Romance (Mason's Book). This hard billionaire needs a nanny for his kid sister. This plucky teaching grad needs money for student loans. What they don't need is each other – or so they think.BLITZ, an Enemies-to-Lovers Romantic Comedy (Chase's Book). Mina Lipinski has a problem, and the only person who can solve it is Chase Blastoviak, the most obnoxious guy she's ever met. Good thing for Chase, their dislike is more than mutual…until it isn't.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Audiobook",
    "Humor"
  ],
  "author": "Sabrina Stark",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/54845555-blitz"
}