{
  "title": "Kingdom's Edge",
  "description": "A Riveting Medieval Parallel to the BibleGood and evil clash. Leinad and Cedric are determined to not only survive, but claim hope and victory! In Kingdom’s Dawn , Leinad and Tess, along with all the king’s people, must escape slavery by the powerful Lord Fairos. Kingdom’s Hope finds them free and arriving in the Chessington Valley . But when they forget the king, will Kergon and the Kessons capture them for good? After many years, Kingdom’s Edge finds Cedric living a hopeless life until a stranger appears with powerful words of a new kingdom and a grand army. Finally, Kingdom’s Reign marches you through the danger of earth’s last days as the evil dark knight threatens to defeat the prince once and for all. Swords, knights, and battles define these captivating tales that parallel biblical events from Genesis to Revelation!He was doomed to a life of hopelessness and despair.Then the stranger arrived…For Cedric of Chessington, every day is the full of poverty and despair. And he knows that will never change.Or so he thinks.Then a stranger comes to the city. Drawn to the man’s mysterious ways, Cedric discovers the stranger’s humility belies great strength and wisdom. That’s when an astounding truth becomes clear—the stranger is a Master of the Sword, and He is there to train Cedric.Suddenly propelled into a desperate battle against evil, Cedric must rely on the Master’s training if he is going to survive. But the ultimate battle is yet to come, for the Dark Knight is at work, implementing his plan to take over the kingdom. Will Cedric be ready to stand in the face of pure evil?Journey to Arrethtrae, where the King and His Son implement a bold plan to save their kingdom; where courage, faith, and loyalty stand tall in the face of opposition; where good will not bow to evil; and where hope and compassion are as powerful weapons as the sword.DISCUSSION QUESTIONS INCLUDEDStory Behind the Book“When my six kids’ eyes glossed over during a reading from the Bible, I paused to explain the significance of redemption to a sin-sick soul. I was rewarded with patronizing elephant nods and more blank stares. Shortly thereafter, I awoke in the middle of the night with a medieval story enveloping my mind. I wrote it down and later read it to my children. Their waning attention transformed into complete anticipation. I was amazed and disappointed. Why did it take a fictional story, not a Bible passage, to get that response? Then I realized—that is how Jesus taught! Parables are powerful! I penned the Kingdom series to help young people get excited about the supremely significant story of Jesus Christ and His mission to save mankind.”— Chuck Black",
  "genres": [
    "Fantasy",
    "Christian",
    "Christian Fiction",
    "Fiction",
    "Young Adult",
    "Middle Grade",
    "Medieval"
  ],
  "author": "Chuck Black",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/1265593.Kingdom_s_Edge"
}