{
  "title": "Always Only You",
  "description": "Get ready for an emotional ride filled with laughter, longing, and a sweet slow-burn in this sports romance about love’s power not in spite of difference, but because of it.RenThe moment I met her, I knew Frankie Zeferino was someone worth waiting for. Deadpan delivery, secret heart of gold, and a rare one-dimpled smile that makes my knees weak, Frankie has been forbidden since the day she and I became coworkers, meaning waiting has been the name of my game—besides, hockey, that is.I’m a player on the team, she’s on staff, and as long as we work together, dating is off-limits. But patience has always been my virtue. Frankie won’t be here forever—she’s headed for bigger, better things. I just hope that when she leaves the team and I tell her how I feel, she won’t want to leave me behind, too.FrankieI’ve had a problem at work since the day Ren Bergman joined the team: a six foot three hunk of happy with a sunshine smile. I’m a grumbly grump and his ridiculously good nature drives me nuts, but even I can’t entirely ignore that hot tamale of a ginger with icy eyes, the perfect playoff beard, and a body built for sin that he’s annoyingly modest about.Before I got wise, I would have tripped over myself to get a guy like Ren, but with my diagnosis, I’ve learned what I am to most people in my life—a problem, not a person. Now, opening my heart to anyone, no matter how sweet, is the last thing I’m prepared to do.​Always Only You is an opposites-attract, forbidden love sports romance about a nerdy, late-blooming hockey star, and his tough cookie coworker who keeps both her soft side and her autism diagnosis to herself. Complete with a meddling secretary, tantric yoga torture, and a scorching slow burn, this standalone is the second in a series of novels about a Swedish-American family of five brothers, two sisters, and their wild adventures as they each find happily ever after.",
  "genres": [
    "Romance",
    "Sports Romance",
    "Sports",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Friends To Lovers"
  ],
  "author": "Chloe Liese",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/54828168-always-only-you"
}