{
  "title": "The Varasso Brothers",
  "description": "FIVE standalone dark mafia novels in the sexy and suspenseful Varasso Brothers series plus one BONUS dark mafia novella that started it all! Unleash the passion of the fiercely ruthless Varasso crime family. He kidnapped me. Locked me up in his mansion. Would it be too crazy to fall in love with this monster? Luca is the oldest son of a mafia boss. He’s the sanest one in his family, if you ask me. His little girl makes him human. But danger is still his middle name. I’m drawn to his power. His devilish gaze that wants every part of me. He has a dark soul that fills a void in mine. Reminding me of things that I’m capable of. After his father’s assassination, Luca is the new king. And he needs a partner in crime. A queen. I’m the woman in his bed. In his heart. So, what does that make me? Luca is the oldest son of a mafia boss. He’s the sanest one in his family, if you ask me. His little girl makes him human. But danger is still his middle name. I’m drawn to his power. His devilish gaze that wants every part of me. He has a dark soul that fills a void in mine. Reminding me of things that I’m capable of. After his father’s assassination, Luca is the new king. And he needs a partner in crime. A queen. I gave my innocence to a mafia prince. But I haven’t told him that I’m carrying his baby. My life was mundane before I met Marco. I didn’t know how dangerous he was until it was too late. He’d already hired me as his assistant. Marco has my body and my heart. He also holds my career in his hands. The only way out of this is to run for my life. Even though I know he’d do everything to hunt me down. Now, I’ve asked for something impossible. Would he abandon his mafia family to be with me? And how would he protect me and his unborn baby if our lives were threatened? He’s part of the same family that’s responsible for my father being in prison. So, why do I feel such love for him? Alessandro and I were together as teenagers before the pressure of being raised by a mob family got to me. I needed to move away from the house to get my life back. That also meant leaving Alessandro behind. He begged me to stay, and I asked him to come with me. Years have gone by since I’ve seen him. Now, fate is bringing us back. And a big decision is on the table. Can I fit into his family and accept a life of crime? Or will be hold my hand and agree to start afresh? Falling in love with him has put my life in danger. Hot as hell and impossible to resist. Gabriel is everything I’ve ever wanted in a man. Except that he belongs to the most dangerous family in town. I knew I’d regret falling into bed with a mob prince. Especially if I ended up pregnant. But I never expected one of his brothers to hurt me. In the Varasso family, blood means loyalty. So, can Gabriel turn against his own brother to protect me? I just want my husband back, but he’s strangled by darkness. There was a time that the love between Alessandro and I was all that mattered. Nothing could keep us apart, neither time, nor space, nor his family. But he’s haunted by the spirit of his father, and now the pull towards the darkness is too strong to resist. With our family staring down obliteration, I have no choice but to pretend to be a loving, supportive wife. But our enemies hide right under our noses. Can we save our family and regain our love, or will this toxic business finally cost me my husband, or worse, my life?",
  "genres": [],
  "author": "Sophia Reed",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/54829953-the-varasso-brothers"
}