{
  "title": "The Part About the Dragon Was (Mostly) True",
  "description": "Sure, you think you know the story of the fearsome red dragon, Dragonia. How it terrorized the village of Skendrick until a brave band of heroes answered the noble villagers' call for aid. How nothing could stop those courageous souls from facing down the dragon. How they emerged victorious and laden with treasure.But, even in a world filled with epic adventures and tales of derring-do, where dragons, goblins, and unlicensed prestidigitators run amok, legendary heroes don't always know what they're doing. Sometimes they're clueless. Sometimes beleaguered townsfolk are more hapless than helpless. And orcs? They're not always assholes, and sometimes they don't actually want to eat your children.Heloise the Bard, Erithea's most renowned storyteller (at least, to hear her tell it), is here to set the record straight. See, it turns out adventuring isn't easy, and true heroism is as rare as an articulate villager. Having spent decades propagating this particular myth (which, incidentally, she wrote), she's finally able to tell the real story—for which she just so happened to have a front-row seat.Welcome to Erithea. I hope you brought a change of undergarments—things are going to get messy. ADVANCE PRAISE FOR THE PART ABOUT THE DRAGON WAS (MOSTLY) TRUE“Sean Gibson’s The Part About The Dragon Was Mostly True is the rare book that is full of action and excitement but is also a natural, effortless extension of the writer’s humor and personality. I felt like I was reading a version of Lord of the Rings, by way of Joss Whedon, only funnier, and with more Rock Giant poop jokes.” – Scott Weinstein, Author of Team of Steves and Weekend Update Co-Producer - \"Saturday Night Live\" “This is a book. What? You told me to be honest—wait, why are you making air quotes when I say ‘honest’? And why are you getting out your knife?” – Rumscrabble Tooltinker, Unlicensed Prestidigitator“Urk kunk grummh nuk kur grubble knuck.” – High Chieftain Gnurk Blurglesplick of the Orcs of the Gloom Forest (Hey, they can't all be complimentary)“Undoubtedly one of the best books I’ll never read.” – Kenneth the Pretty Okay Sometimes Wandering But Usually Sedentary Minstrel",
  "genres": [
    "Fantasy",
    "Humor",
    "Fiction",
    "Dragons",
    "Adventure",
    "Adult",
    "Comedy"
  ],
  "author": "Sean  Gibson",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/54830321-the-part-about-the-dragon-was-mostly-true"
}