{
  "title": "Every Body Shines: Sixteen Stories About Living Fabulously Fat",
  "description": "*** A lot of reviews mention they felt deceived with the anthology because they expected a happy collection due to the cover, title, and marketing, and then, when they began to read the stories, they quickly discovered it is definitely not a book about fat joy. I'd like to address those comments and hopefully give some understanding to the issue.While there are joyful moment within the pages of Every Body Shines, it was never intended to be a collection of fat joy stories. The authors wanted to show true to life situations regarding the way we, and the world, treat our bodies, and, even more importantly, how in a society that always expects us to change ourselves to fit a certain narrative, we explored and allowed our stories to instead, change the narrative to fit our characters and their worlds. Sometimes, that may not have happened until the last page, or even the last sentence, however, it does happen.We wanted to show growth from external and internal struggles. We wanted to show our characters discovering the light within themselves and teaching it to burn.If I could have chosen the title to the anthology, it would have been--LET THEM LOOK, or, FAT LIKE ME.I hope, those titles alone give you more of a window into what this collection is meant to be and I apologize for the emotional turmoil you might experience because the publisher marketed it to represent fat joy. I promise you that how it was marketed, or even the title choice, was out of my control.My apologies to anyone who wasn't prepared for the stories within because of this. --- truly, CassAn intersectional, feminist YA anthology from some of today's most exciting voices across a span of genres, all celebrating body diversity and fat acceptance through short stories.Fat girls and boys and nonbinary teens are: friends who lift each other up, heroes who rescue themselves, big bodies in space, intellects taking up space, and bodies looking and feeling beautiful. They express themselves through fashion, sports and other physical pursuits, through food, and music, and art. They are flirting and falling in love. They are loving to themselves and one another. With stories that feature fat main characters starring in a multitude of stories and genres, and written by authors who live these lives too, this is truly a unique collection that shows fat young people the representation they deserve.With a foreword by Aubry Gordon, creator of Your Fat Friend, and with stories by:Nafiza Azad, Chris Baron, Sheena Boekweg, Linda Camacho, Kelly deVos, Alex Gino, Claire Kann, amanda lovelace, Hillary Monahan, Cassandra Newbould, Francina Simone, Rebecca Sky, Monique Gray Smith, Renée Watson, Catherine Adel West, Jennifer Yen",
  "genres": [
    "Young Adult",
    "Short Stories",
    "Contemporary",
    "Anthologies",
    "LGBT",
    "Fiction",
    "Feminism"
  ],
  "author": "Cassandra Newbould",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/54860255-every-body-shines"
}