{
  "title": "The Death of Vivek Oji",
  "description": "SHORTLISTED FOR THE DYLAN THOMAS PRIZESHORTLISTED FOR THE DUBLIN LITERARY AWARD'Astonishing.' Stylist'Electrifying.' O: The Oprah Magazine'Brilliant and heartbreaking.' Marie Claire'Propulsive and resonant.' Esquire\nThey burned down the market on the day Vivek Oji died.\nOne afternoon, a mother opens her front door to find the length of her son's body stretched out on the veranda, swaddled in akwete material, his head on her welcome mat. The Death of Vivek Oji transports us to the day of Vivek's birth, the day his grandmother Ahunna died. It is the story of an over protective mother and a distant father, and the heart-wrenching tale of one family's struggle to understand their child, just as Vivek learns to recognize himself.Teeming with unforgettable characters whose lives have been shaped by Vivek's gentle and enigmatic spirit, it shares with us a Nigerian childhood that challenges expectations. This novel, and its celebration of the innocence and optimism of youth, will touch all those who embrace it.\n\nWhat readers are saying:\n\n'The book is so beautifully written and I've never read anything like it ever before.''This is a gorgeously written story of identity, sexuality, love, grief, friendship, and the need to live the life you want, even in a country where doing so might be deadly . . . This was emotional, beautiful, and so poignant, and their storytelling took my breath away.''This book is both so joyful and so devastating.''The way Emezi made me care so deeply about these characters was just incredible, so that when the whole truth of Vivek's death was revealed I felt so personally affected by it. This book is about so many things all at once . . . The writing is so simple yet beautifully emotive. And I cried.''FIVE HUGE STARS . . . The Death of Vivek Oji is a poignant and tantalizing novel that wraps you up in its web of characters and feeds on you with carnivorous force, all while softening your heart and mind to a world outside of the normal social constraints we have been conditioned to.'(Goodreads reader reviews)",
  "genres": [
    "Fiction",
    "Contemporary",
    "LGBT",
    "Queer",
    "Literary Fiction",
    "Audiobook",
    "Book Club"
  ],
  "author": "Akwaeke Emezi",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/54849715-the-death-of-vivek-oji"
}