{
  "title": "King Acid and Other Essays",
  "description": "King Acid and Other Essays is best appreciated as forty miles of strange, compelling road. I can’t imagine you’re going to find a better array of characters and circumstances this year than the ones brought together for this unique, electrifying collection.-- Gabriel Ricard, author of Bondage Night and co-host of the Cinema Hounds podcast.Patrick King has led a peculiar life. And we should all be thankful he chose to share it with us here. But there’s so much more to King Acid and Other Essays than unadulterated calamity and weirdness. The mark of a great artist is the ability to take the ordinary and make it extraordinary, and King’s immense talent for doing so is on full display here. He takes isolation, depression, madness and despair and turns it all into something beautiful. He takes the mundane and makes it interesting. He writes with fervor, heart and distinct perspective. And his skill is such that he will make you feel sadness, joy, disgust and love, simultaneously. King is a writer with an important and original voice. My only hope now is that we continue hearing it more and more for years and years to come.-- J. Matthew Smith, author of Jailed By My Father and Stay Away From Lions.What an honor it is to be allowed into Pat King’s highly-personal recollections into his past. A past that is rife with wild characters and drug-fueled incidents; mental breakdowns and struggles with substance abuse; family drama and heartbreak; companionship. King Acid and Other Essays is brutally honest and unflinching, and at times terrifying. But King tells his stories with careful introspection, often with bits of humor and a lucidity that can only come with distance and healing.-- Jill Blake, co-founder of TheRetroSet.com and co-host of the Drinking While Talking podcast.",
  "genres": [],
  "author": "Pat King",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/54852509-king-acid-and-other-essays"
}