{
  "title": "Wings of Fire",
  "description": "Stealing objects for supernatural clients is my bread and butter. Murder? Not so much.As a phoenix, I’m used to burning hot and rising from the ashes. That’s why I chose to make my living as a world-class thief. Some say it’s dangerous. I call it fun.Or it is until someone beats me to my latest mark, stealing the prize and killing a fae duke in the process. To add insult to injury, I get blamed for the gruesome murder.With my freedom on the line, I’ve got three options.One, confess my failure and spend a few centuries as the caged pet of my sadistic, bloodsucking client. Nope.Two, take the blame and let the hotter-than-hell grim reaper take me to jail. Also a hard nope, unless he sweetens the deal with an offer to burn up the sheets.Is it any wonder I choose door number three? I’ve got to find the real killer, steal back the goods, and remind everyone how I got my reputation as the world’s best “acquirer” in the first place.There’s just one problem. That sexier-than-sin grim reaper I mentioned?He’s determined to see me go down.Discover the thrill of the chase and the excitement of the supernatural in this bestselling urban fantasy series, full of danger, slow-burn romance, and a strong-willed phoenix who won't back down. With twists and turns at every corner, you won't be able to put this book down. Start the series today!Find out why readers are RAVING about this series!★★★★★ 'I’m Totally Addicted to this Series'★★★★★ 'I blew through the first 3 books in just two days.'★★★★★ 'The story line keeps me on the edge of my seat'★★★★★ 'a fast paced story that grabs your attention at the start and never lets go'★★★★★ 'This series just gets better and better'★★★★★ 'a series that has been a true treasure for me to read'★★★★★ 'I fell in love with all the wordplay in both the dialogue and the narrative'★★★★★ 'Winner for me!'★★★★★ 'If you enjoy a fast paced urban fantasy with action, mystery, adventure, suspense, and a touch of romance, this book is for you!'",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Shapeshifters",
    "Magic",
    "Angels",
    "Vampires"
  ],
  "author": "Stephanie Mirro",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/54848728-wings-of-fire"
}