{
  "title": "Duke I'd Like to F...",
  "description": "He’s got big duke energy…The Chasing of Eleanor Vane - Sierra SimoneAjax Dartham, the Duke of Jarrell, has a problem. And that problem is his future niece-in-law. When the clever and capable Lady Eleanor Vane—understandably—runs off into the night rather than marry his horrible nephew, the Duke has a choice. Should he catch Eleanor and return her to her fate—or make Eleanor his own instead?My Dirty Duke - Joanna ShupeViolet knows that her father's best friend, the Duke of Ravensthorpe, is the most powerful man in all of London with a reputation for sin. But nothing can stop Violet from wanting to shed her wallflower ways and fulfill her darkest, most forbidden desires...even if it means seducing a man twice her age.An Education In Pleasure - Eva LeighAs a governess to the Duke of Tarrington, Cecilia Holme resigns herself to a passionless life. Except now the old duke is dead and Owen, the new duke, is very tempting—and much younger. Is the chance to give Owen an education in pleasure too enticing to refuse? Duke For Hire - Nicola DavidsonAs her fiery clergyman father chases away all suitors, Miss Ada Blair is resigned to spinsterhood. Yet while she can’t wed, bedding might be another matter. One man meets all her requirements for a discreet and expert pleasure tutor—Jasper Muir, Duke of Gilroy—but he insists on a very wicked contract…The Duke Makes Me Feel... - Adriana HerreraDukes and their demands are nothing new for Marena Baine-Torres. Her newfound success has her little apothecary teeming with ill-mannered aristocrats. But as tiresome as they are, she needs the business. When the unflappable Duke of Linley storms into her shop and makes her an offer she’d be a fool to refuse, Marena soon finds herself on the adventure of a lifetime with a man who is as infuriating as he is intriguing.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Anthologies",
    "Historical",
    "Historical Fiction",
    "Novella",
    "Short Stories"
  ],
  "author": "Sabrina Darby",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/54855474-duke-i-d-like-to-f"
}