{
  "title": "Maiden Voyages: Magnificent Ocean Liners and the Women Who Traveled and Worked Aboard Them",
  "description": "In an engaging and anecdotal social history, Siân Evans's Maiden Voyages explores how women’s lives were transformed by the Golden Age of ocean liner travel between Europe and North America.During the early twentieth century, transatlantic travel was the province of the great ocean liners. It was an extraordinary undertaking made by many women, whose lives were changed forever by their journeys between the Old World and the New. Some traveled for leisure, some for work; others to reinvent themselves or find new opportunities. They were celebrities, migrants and millionaires, refugees, aristocrats and crew members whose stories have mostly remained untold―until now.Maiden Voyages is a fascinating portrait of the era, the ships themselves, and these women as they crossed the Atlantic. The ocean liner was a microcosm of contemporary society, divided by class: from the luxury of the upper deck, playground for the rich and famous, to the cramped conditions of steerage or third class travel. In first class you’ll meet A-listers like Marlene Dietrich, Wallis Simpson, and Josephine Baker; the second class carried a new generation of professional and independent women, like pioneering interior designer Sibyl Colefax. Down in steerage, you’ll follow the journey of émigré Maria Riffelmacher as she escapes poverty in Europe. Bustling between decks is a crew of female workers, including Violet “The Unsinkable Stewardess” Jessop, who survived the Titanic disaster.Entertaining and informative, Maiden Voyages captures the golden age of ocean liners through the stories of the women whose transatlantic journeys changed the shape of society on both sides of the globe.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel",
    "Feminism",
    "Historical",
    "War",
    "Womens"
  ],
  "author": "Siân Evans",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/54860342-maiden-voyages"
}