{
  "title": "Shoulder Season",
  "description": "The small town of Lake Geneva, Wisconsin is an unlikely location for a Playboy Resort, and nineteen-year old Sherri Taylor is an unlikely bunny. Growing up in neighboring East Troy, Sherri plays the organ at the local church and has never felt comfortable in her own skin. But when her parents die in quick succession, she leaves the only home she’s ever known for the chance to be part of a glamorous slice of history. In the winter of 1981, in a costume two sizes too small, her toes pinched by towering stilettos, Sherri joins the daughters of dairy farmers and factory workers for the defining experience of her life.Living in the “bunny hutch”—Playboy’s version of a college dorm, surrounded by a twelve-foot high barbed-wire fence (to keep the men out, and the girls in)—Sherri gets her education in the joys of sisterhood, the thrill of financial independence, the magic of first love, and the heady effects of sex, drugs, and rock and roll. But as spring gives way to summer, Sherri finds herself caught up in a romantic triangle––and the tragedy that ensues will haunt her for the next forty years of her life.Shoulder Season follows Sherri from her fledgling days as a bunny, when she tries to reinvent herself before she even knows who she is, to the woman she becomes years later. From the Midwestern prairie to the California desert, from Wisconsin lakes to the Pacific Ocean, this is a story of what happens when small town life is sprinkled with stardust, and what we lose—and gain—when we leave home. It’s about the brief but intoxicating experiences of our youth, and how they have the power to shape the rest of our lives. With a heroine to root for and a narrative to get lost in, Shoulder Season is a sexy, evocative tale, drenched in longing and desire, that captures a fleeting moment in American history with nostalgia and heart.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Book Club",
    "Historical",
    "Audiobook",
    "Chick Lit"
  ],
  "author": "Christina Clancy",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/54860172-shoulder-season"
}