{
  "title": "A Peculiar Combination",
  "description": "The first in the Electra McDonnell series from Edgar-nominated author Ashley Weaver, set in England during World War II, A Peculiar Combination is a delightful mystery filled with spies, murder, romance, and the author's signature wit.Electra McDonnell has always known that the way she and her family earn their living is slightly outside of the law. Breaking into the homes of the rich and picking the locks on their safes may not be condoned by British law enforcement, but World War II is in full swing, Ellie's cousins Colm and Toby are off fighting against Hitler, and Uncle Mick's more honorable business as a locksmith can't pay the bills any more.So when Uncle Mick receives a tip about a safe full of jewels in the empty house of a wealthy family, he and Ellie can't resist. All goes as planned--until the pair are caught redhanded. Ellie expects them to be taken straight to prison, but instead they are delivered to a large townhouse, where government official Major Ramsey is waiting with an offer: either Ellie agrees to help him break into a safe and retrieve blueprints that will be critical to the British war effort, before they can be delivered to a German spy, or he turns her over to the police.Ellie doesn't care for the Major's imperious manner, but she has no choice, and besides, she's eager to do her bit for king and country. She may be a thief, but she's no coward. When she and the Major break into the house in question, they find instead the purported German spy dead on the floor, the safe already open and empty. Soon, Ellie and Major Ramsey are forced to put aside their differences to unmask the double-agent, as they try to stop allied plans falling into German hands.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "Audiobook",
    "World War II"
  ],
  "author": "Ashley Weaver",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/54860475-a-peculiar-combination"
}