{
  "title": "Stolen Earth",
  "description": "Firefly meets The Expanse in a future where humanity has destroyed the Earth through ecological disaster and warfare, and a totalitarian state prevents any access to their home...Environmental disasters and uncontrolled AI armies have caused the human population of Earth to flee. They lie scattered across innumerable space stations and colonies, overcrowded and suffering. The Earth is cut off by the Interdiction Zone: a network of satellites to prevent anything getting into or out of the planet. The incredible cost of maintaining it has crippled humanity, who struggle under the totalitarian yoke of the Sol Commonwealth government, whose rich grow richer while the poor are on the brink of starvation. Many have been driven to the edge of society, yearning for freedom and taking any work offered, criminal and otherwise, in order to survive. The crew of the Arcus are just such people. A client has come to the table claiming to have the codes necessary to penetrate the Interdiction Zone. Once through, a world of priceless artifacts awaits, provided anyone crazy enough to make the run can be found. They've all heard the rumors - ships that have set down, pilfered the ruins of a museum or private collection, and escaped with enough priceless works to retire. Arcus Captain Lynch knows better - he's been on-world before, a brief and harrowing experience that he's in no hurry to relive. But fuel is running low and cred accounts even lower, and the Arcus' survival might depend on taking the job. Yet on arrival on Earth, the crew discovers that what remains on their world is not as they have been told, and the secrets they find are big enough to bring the entire Sol Commonwealth tumbling down...",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Adventure",
    "Science Fiction Fantasy",
    "Space",
    "Post Apocalyptic"
  ],
  "author": "J.T. Nicholas",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/54863062-stolen-earth"
}