{
  "title": "Caffeinated Calamity",
  "description": "The only witch in the world? It might feel like it to Stormy Morgan but she knows better.Twenty minutes away, in a town called Hemlock Cove, witches have taken over. Sure, the bulk of the town is made up of frauds looking to shore up their tourism industry, but there are real witches, too. There’s a family, last name of Winchester, and they’re notorious. Stormy wants to meet them but she has a myriad of problems darkening her doorstep.The first is Hunter Ryan, her childhood love who is back in her life and ready to take the next step, which is formal dating … just as soon as he’s given proper respect to his previous relationship. While Stormy is waiting for that to happen, she runs to the aid of customer at the family diner when the older woman collapses as she’s leaving after breakfast. Before Stormy can offer even a dollop of help, though, the woman is dead and there are more questions than answers.When the cause of death is determined to be poison, Stormy and Hunter have to follow a tangled trail of clues… and it leads them straight to the senior center. It seems the victim was a regular visitor there, and one of the better euchre players at the lauded weekly tournaments. Is that a motive for murder, though?Stormy has her hands full with out-of-control euchre madness, magic she is trying to control, and hormones that are threatening to run rampant. When she finally makes it to Hemlock Cove, her nerves threaten to get the best of her.She needs help. This is a world she doesn’t understand. The truth has to come out, but is she ready? It might not matter because a murderer has marked Stormy for death. It’s up to her and her motley crew of friends and family to save the day … if they can all come together as a team.That will be easier said than done.",
  "genres": [
    "Mystery",
    "Paranormal",
    "Cozy Mystery",
    "Fantasy",
    "Romance",
    "Magic",
    "Witches"
  ],
  "author": "Amanda M. Lee",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/54868485-caffeinated-calamity"
}