{
  "title": "A Snowflake Christmas",
  "description": "A Snowflake Christmas is a sweet holiday romance set in the fictional small town of Snowflake, Montana.It’s another snowy day in Snowflake when Rachel Welch, RN finds herself bringing her nephew in for an office visit with Dr. Alan Garcia. Rachel currently runs her family-owned café while she waits for the new doctor to post an opening for a nurse in the medical clinic owned by the town.As a native of Snowflake and a member of the founding family known for cattle ranching, Rachel’s passion has instead always been nursing. Well, until the prior doctor she worked for suddenly left town. If juggling family commitments and her dreams isn’t hard enough, one look at the handsome out-of-town doctor sends Rachel’s heart racing.Dr. Garcia moves to Snowflake for a fresh start. Miami, Florida is all he’s ever known. But, after drug-dealing accusations are proven false, the lingering tarnish on his reputation forces him to relocate. As an employee of the city, managing a small medical clinic should be easy. He soon finds that big-city medicine and small-town doctoring are very different.Alan isn’t looking for love but Rachel gets him on so many levels. Not to mention he thinks she’s the hottest woman he’s ever seen. However, this attraction and connection occurs before he learns she was the prior doctor’s nurse. Can he hire her and date her? Should he?Like many small towns, in Snowflake, everyone knows everything about everyone. Dr. Garcia does his best to win the hearts of his patients. Rachel helps him fit in, and Alan has the skills to heal the wounds from her past. As they struggle with their own inner demons, they also strive to be the people the city of Snowflake needs them to be. Can two people who are so right for each other prove to everyone around them that they are meant to be together?",
  "genres": [
    "Christmas"
  ],
  "author": "Vickey Wollan",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/54861779-a-snowflake-christmas"
}