{
  "title": "Look at the Star in You",
  "description": "Have you seen the starry night sky lately? If yes, you should see it again and if no, you have missed those nights. Because you will feel pleasant when you see the countless twinkling dots that sparkle in the night sky amidst the darkness around. Our life is just like those tiny twinkles. Every star undergoes its energy churn to shine bright.We too may undergo the churn of life, but instead of taking it as an opportunity to learn and grow we succumb to the circumstances. This is because of fear of unaccustomed or ignorance of unknown or both fear and ignorance combined.Here are seven subtle short stories with characters from different backgrounds and unusual situations. An Airforce Pilot who does exhilarating manoeuvres, a classical singer with divine voice, a furniture maker who lives in greens, an architect who dreams of making exuberant structures, a cinematographer who shows us the eye catchy canvas of life and many more.The stories are quick and crispy. But the essence of the story will linger for some time before you proceed to the next. You will know how the characters respond to the situations which are simple but important. You will traverse that extra mile they took to make their dreams and aspirations to come true.A part of their life is shown you here in an interesting way giving you a racy read and wanting for more.About the Author: Namasvi works in an Insurance Company in Hyderabad. She has underwritten various policies and is now in the claims hub. Being in the insurance business she has observed people from different walks of life and interacted with them.A voracious reader and likes travelling. Passionate to know about the changes especially that happened during the past hundred years in India and the world which has transformed the way of life. Also, contemplation of the trends in the recent past that have a potential to bring change in the future. Writing has been the outcome of such interest.",
  "genres": [],
  "author": "Namasvi Bandarupalli",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/54872444-look-at-the-star-in-you"
}