{
  "title": "The Newcomer",
  "description": "Mary Kay Andrews, the New York Times bestselling author and Queen of the Beach Reads delivers her next page-turner for the summer with The Newcomer .In trouble and on the run...After she discovers her sister Tanya dead on the floor of her fashionable New York City townhouse, Letty Carnahan is certain she knows who did Tanya’s ex; sleazy real estate entrepreneur Evan Wingfield. Even in the grip of grief and panic Letty heeds her late sister’s “If anything bad happens to me―it’s Evan. Promise me you’ll take Maya and run. Promise me.”With a trunkful of emotional baggage...So Letty grabs her sister’s Mercedes and hits the road with her wailing four-year-old niece Maya. Letty is determined to out-run Evan and the law, but run to where? Tanya, a woman with a past shrouded in secrets, left behind a “go-bag” of cash and a big honking diamond ring―but only one a faded magazine story about a sleepy mom-and-pop motel in a Florida beach town with the improbable name of Treasure Island. She sheds her old life and checks into an uncertain future at The Murmuring Surf Motel.The No Vacancy sign is flashing & the sharks are circling...And that’s the good news. Because The Surf, as the regulars call it, is the winter home of a close-knit flock of retirees and snowbirds who regard this odd-duck newcomer with suspicion and down-right hostility. As Letty settles into the motel’s former storage room, she tries to heal Maya’s heartache and unravel the key to her sister’s shady past, all while dodging the attention of the owner’s dangerously attractive son Joe, who just happens to be a local police detective. Can Letty find romance as well as a room at the inn―or will Joe betray her secrets and put her behind bars? With danger closing in, it’s a race to find the truth and right the wrongs of the past.",
  "genres": [
    "Romance",
    "Fiction",
    "Mystery",
    "Audiobook",
    "Chick Lit",
    "Contemporary",
    "Thriller"
  ],
  "author": "Mary Kay Andrews",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/54860489-the-newcomer"
}