{
  "title": "Helen and The Grandbees",
  "description": "'Breathtaking and moving' Awais Khan'Authentic and tender' Carmel HarringtonForgetting your past is one thing, but living with your present is entirely different.Twenty years ago, Helen is forced to give up her newborn baby, Lily. Now living alone in her small flat, there is a knock at the door and her bee, her Lily, is standing in front of her.Reuniting means the world to them both, but Lily has questions. Lots of them. Questions that Helen is unwilling to answer. In turn Helen watches helplessly as her headstrong daughter launches from relationship to relationship, from kind Andrew, the father of her daughter, to violent Kingsley who fathers her son.When it’s clear her grandbees are in danger, tangled up in her daughter’s damaging relationship, Helen must find the courage to step in, confronting the fears that haunt her the most.Told in Helen’s quirky voice Helen and the Grandbees addresses matters of identity, race and mental illness.'Breathtaking and moving, Helen and the Grandbees is a novel that bravely explores themes of familial discord, race and love in modern Britain. It is a book that immediately gripped me, compelling me to keep turning the pages well into the night. Morrall writes with confidence, poise, and a sense of humour to match. At times heartbreaking and heartwarming, this is a novel readers won't soon forget. A riveting debut.' Awais Khan, author of In the Company of Strangers'Alex can write; she has a way, a bit like playwright Mike Leigh, of zooming into the tiniest, seemingly mundane physical details of a situation, and in so doing, conveying the complexity, circularity and pattern of relationship and emotion. There is a humanity and a realism about her writing that Is far from commonplace despite the fact that when you read about the people and situations in her storytelling, they are instantly recognisable. Helen and the Grandbees is unbearably sad but because Alex manages the seemingly impossible feat of introducing hope right from the start it is possible to read and read on, with curiosity and enjoyment.' Dr Kairen Cullen, Writer and Psychologist",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Book Club"
  ],
  "author": "Alex Morrall",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/54882686-helen-and-the-grandbees"
}