{
  "title": "Grace in Mombasa",
  "description": "All books in the series are standalone stories and can be read in any order.Grace in Mombasa is a story about a woman whose amazing faith gets shattered when her life falls apart, but will God simply let her go? This novel was inspired by true events.From the day she was born, Grace Clifton has navigated a life of loss and heartbreak without a mother to guide her. With England in the midst of a Second World War, Grace experiences the excitement of love and romance, but all too soon it turns to heartbreak. Through it all, Grace is sustained by her unwavering faith in God, but when all she holds dear is ripped away from her, she is left devastated and doubting everything she’s ever believed in. As the world slowly recovers from war, Grace begins the process of healing. However, her steadfastness in God is lost and she determines to never pray again.When an unexpected opportunity comes up in Kenya, Grace seizes the chance to escape, hoping to find a purpose and build a new life for herself in a strange land. In Mombasa, Grace soon realizes she can’t distance herself from life’s complications. But if she’s prepared to open her heart, maybe her shattered faith will bloom once more, bringing hope, love, and healing – not only to herself but others.If you like heartfelt dialogue, stories seeped in fact and history, and memorable characters, then you’ll love Tracy Traynor’s moving and inspirational novel. Read \nGrace in Mombasa\n for a rich historical story that you’re sure to be thinking about long after you’ve turned the last page.What Reviewers are saying…This is a very inspiring tale.The story itself has the ability to heal heart and soul.You'll be thinking about the story long after reading it!I was moved to tears at the touching ending, I could almost hear God telling Grace, `Well done my good and faithful servant'.By God's grace is the appropriate theme of this book.It’s been a long time since I read a book with such an internally beautiful heroine.A wonderful tale, and well worth the read.There is an underlying sense of hope and strength.Profound story.An inspiring historical novel!A beautiful and touching story about one woman's belief in God.This book shows the struggles Christians make, especially in times of adversity.This story is inspirational, emotional, and very spiritual.Thought-provoking spiritual read.Well-researched, sweeping drama.I loved Grace's bravery and courage and faith.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Christian Fiction"
  ],
  "author": "Tracy Traynor",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/54880649-grace-in-mombasa"
}