{
  "title": "Doin' a Dime",
  "description": "Live-in property & pet caretaker needed. Six-year minimum. Background check required. Generous compensation. Marriage of convenience required.The moment that Wyett Villin read the ad on her local community’s page, she knew that it would be perfect. It didn’t matter how big the house was, what kinds of animals she had to take care of, or what the compensation was. She didn’t give a flip as long as it got her out of her childhood home and away from the person that she despised the most.Only, she had no clue that by accepting the position, she would be agreeing to watch over the mini-mansion and two large dogs of Hunt McJimpsey, computer hacker extraordinaire, sexy nerd, and convicted felon of Souls Chapel, Texas.She’d meant to make her life easier, not complicate it more.***Hunt McJimpsey was careful. He knew exactly what he was doing and practically planned every single step that he took to make sure that he always had his tracks covered.But one single mistake costs him five years of his life, and if he’s going to go down for the crime, he might as well make it spectacular.Three years into his prison sentence, he’s a changed man, and definitely not for the better.He’s harder, angrier, and even more brilliant and conniving than before he went in.He thinks that by keeping up with his dogs’ babysitter, his property caretaker, and reluctant wife, that he’s only doing his due diligence as a responsible person. Only, what starts out as curiosity for his property turns into genuine like for the woman that is caring for what means the most to him.When an opportunity to get out of the hellhole known as prison arises and the only thing he has to do is join a motorcycle club and sign some of his free time away to help those less fortunate, he jumps at the chance.Not only because he’s ready to get the hell out of prison, but because he’s ready to meet the woman that he’s been falling for, one visit a week, for the last three years.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Friends To Lovers",
    "Romantic Suspense",
    "Suspense"
  ],
  "author": "Lani Lynn Vale",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/54893026-doin-a-dime"
}