{
  "title": "TWAS The Year 2020",
  "description": "I didn’t intend to write this book. I wrote a piece on the hypocrisy of the Black Lives Matter movement for my blog, found there were a few more points concerning the way the planet’s spinning at this moment in time, the year 2020, so decided to finish up with a second piece. 75,000 words later I discovered I’d written a book covering BLM, slavery, Antifa, DFLA (Democratic Football Lads Alliance), COVID-19, pensions, radicalisation, President Trump, Marxism, China, masks & vaccines, racism, Forever Family, population control, cashless society, and a possible New World Order The word TWAS, of course, is an acronym for Together we are StrongerI’ve always been ready to stand up and be counted because I know that if I allow my emotions to be stilled, then a kind of blue funk settles in, and I have no intention of apologising for being me In this book, I’m sure to rattle a few cages, but my intention isn’t to be quarrelsome, it’s just to offer enough ‘Wow!’ moments to give the reader something to ponder over. I make every effort to stay away from Conspiracy Theories, not because I don’t believe in them, but more because I find it a rather dismissive term, allowing others to reject the freethinker’s point of view.I’m an overthinker, I know, and if sh*t doesn’t make sense, I think about it over and over until it does make sense, and right now none of this makes sense …. But it’s starting to. People are getting angry, and in this book I analyse these views and justify them in the words of the bloke who goes to football on a Saturday afternoon, enjoys a few pints with his mates before the game and puts the world to right.I’ve no doubt there will be people who disagree with my reflections, and that’s okay. We’re not all supposed to agree. But there are issues right now that need addressing. We read about them in the papers, we listen to radio hosts discuss them on phone-in programmes and we talk about them to our pals at work and in the pub. I also speak to a lot of football supporters from various clubs and I know most are in accordance with my views.I haven’t watered down my writing at all, or bent over backwards to suit the do-gooders, I promise you that.I’m strong-willed, a bit outspoken and I write exactly what I’m thinking. I’m not to everyone’s taste, but this is a book you can dip in and out of whenever the mood takes you. I hope you enjoy!",
  "genres": [
    "Nonfiction"
  ],
  "author": "Karl Wiggins",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/54901683-twas-the-year-2020"
}