{
  "title": "Effortless: Make It Easier to Do What Matters Most",
  "description": "The New York Times bestselling author of Essentialism takes on the holy grail of human performance: How can we make it easier to get the right things done?Is there a goal you want to make progress on, if only you had the energy? Do you assume that anything worth doing must take tremendous effort? Have you ever abandoned a hard but important activity for an easy but trivial one? Are you often overwhelmed by the complexity that's expanding everywhere?If you answered \"yes\" to any of these questions, you might be making life much harder for yourself than it needs to be.In the New York Times bestseller Essentialism, Greg McKeown urged readers to eliminate nonessential activities and focus on the few that truly matter. He's since talked with thousands of readers about the challenges they face in putting those ideas into practice. The problem, he's found, is that the complexity of modern life has created a false dichotomy between things that are \"essential and hard,\" and things that are \"easy and trivial.\" But what if the trivial tasks became harder and the essential ones became easier? If the important projects became enjoyable, while the trivial distractions lost their appeal entirely?In Effortless, McKeown offers proven strategies for making the most important activities the easiest ones. For example:  - Streamline your process by mapping out the minimum number of steps. - Prevent problems later by solving them before they happen. - Let Go of perfectionism by finding the \"courage to be rubbish.\" - Accelerate your learning by leveraging the best of what others know.By making the toughest tasks just a little bit easier, we can accomplish more of what matters, without burning out.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Productivity",
    "Business",
    "Personal Development",
    "Psychology",
    "Audiobook"
  ],
  "author": "Greg McKeown",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/54895700-effortless"
}