{
  "title": "Professional Troublemaker: The Fear-Fighter Manual",
  "description": "From the New York Times bestselling author of I'm Judging You, a hilarious and transformational book about how to tackle fear--that everlasting hater--and audaciously step into lives, careers, and legacies that go beyond even our wildest dreams.Luvvie Ajayi Jones is known for her trademark wit, warmth, and perpetual truth-telling. But even she's been challenged by the enemy of progress known as fear. She was once afraid to call herself a writer, and nearly skipped out on doing a TED talk that changed her life because of imposter syndrome. As she shares in Professional Troublemaker, she's not alone.We're all afraid. We're afraid of asking for what we want because we're afraid of hearing \"no\". We're afraid of being different, of being too much or not enough. We're afraid of leaving behind the known for the unknown. But in order to do the things that will truly, meaningfully change our lives, we have to become professional troublemakers: people who are committed to not letting fear talk them out of the things they need to do or say to live free.With humor and honesty, and guided by the influence of her professional troublemaking Nigerian grandmother, Funmilayo Faloyin, Luvvie walks us through what we must get right within ourselves before we can do the things that scare us; how to use our voice for a greater good; and how to put movement to the voice we've been silencing--because truth-telling is a muscle.The point is not to be fearless, but to know we are afraid and charge forward regardless. It is to recognize that the things we must do are more significant than our fears. This book is about how to live boldly in spite of all the reasons we have to cower. Let's go!",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Audiobook",
    "Personal Development",
    "Psychology",
    "Leadership",
    "Humor"
  ],
  "author": "Luvvie Ajayi Jones",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/54916181-professional-troublemaker"
}