{
  "title": "Perfection of Suffering",
  "description": "The Southern Aristocracy brought together by one woman - Dahlia Aldridge.I had lived here most of my life in a blissful state of ignorance, surrounded by a loving family and the other residents of Wildberry Lane. Specifically, their sons - the heirs to some of the largest fortunes in the country. I had grown used to them acting as my shadows, protecting me and surrounding me with enough affection that I never questioned if their words were in fact the truth.Then the Brooks twins came to town. Suddenly, everything I had known about myself was being shattered as they dug up my worst insecurities and exploited them to the world. I began questioning everything.Kingston Ross. Stratton Lee. Yates Carter. Lincoln & Sterling Gates.They have been able to protect me from everything… but myself. My boys carry a darkness inside of them that has never scared me. The shadows of deeds done at night, away from the spotlight of being who we were in this societal hierarchy. They think I’m afraid of that, but they couldn’t be farther from the truth.I wasn’t afraid of their darkness.I wasn’t afraid of my feelings for them, ones that had grown from friendship into so much more.I wasn’t even afraid of expressing that to them… eventually.What I was afraid of? That I would hurt those around me with my shame and pain.I would just have to perfect the art of suffering in silence.Wildberry Lane - Home to the extremely wealthy and powerful Southern elite.Perfection of Suffering, book 1 in The Shadows of Wildberry Lane trilogy, is M. Sinclair’s debut contemporary reverse harem novel. This work features a naive female character hiding a dark secret of her own, the men in her life that will do anything to keep her safe, and a scandal that stretches far beyond the safety of Wildberry Lane’s gate.Warning: This book does contain sexual content for +18, swearing, violence, and triggers when it comes to specifically, but not limited to, eating disorders and bullying. Important to note, the bullying is NOT done by the harem, but rather outside sources. This is a slow/medium burn series.",
  "genres": [
    "Reverse Harem",
    "Contemporary",
    "Romance",
    "Dark",
    "Friends To Lovers",
    "Contemporary Romance",
    "Slow Burn"
  ],
  "author": "M. Sinclair",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/54979115-perfection-of-suffering"
}