{
  "title": "Sins of the Father",
  "description": "Severiano Tarussio, who'd been banished from the country of his birth for too many years, finally returns home to Italy with only one thing on his mind - vengeance. Knowing he needs approval from the head of the Lombardo family before he can act upon his desire, he knows that if he can get it, retribution against the Saletti family would be, oh, so sweet. Fiora Ducani, the new head of the Lombardo family, is thrilled to the bone by the return of Vicente Tarussio's handsome grandson, even if it had been without her permission. She'd missed the arrogant man who'd always had a way with the ladies, but now he's put her in a tight spot with the very man who'd ordered his banishment years before. Rocco Lombardo, the retired mob boss who'd managed to keep an alliance with the Saletti family for years, now has a growing concern for the recently ascended son of Alessandro, who seems to be spiraling out of control over the little American girl he's been keeping company with. He wants nothing but to keep the peace between the families, but the return of Severiano threatens to destroy it all. Or, will it turn the tables in favor of the Lombardo family, through a scheme that only Severiano can pull off? With the hope for a new family in his future with his beautiful and young bride-to-be, Vincenzo Saletti finds himself confronted by his father's past and the possibility that his lifelong enemy may have a closer connection to him than he'd ever imagined. It's enough to leave him questioning everything about the father he'd known, while giving the woman who holds his heart in the palm of her hand doubts about their own future together. Will it be enough to destroy the love he and Novella have only just begun to know, or will they overcome the sins of the father and strengthen the bond they now share?",
  "genres": [
    "Dark",
    "Suspense",
    "Mafia Romance"
  ],
  "author": "Vana V.",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/12661815-sins-of-the-father"
}