{
  "title": "The Best New True Crime Stories: Well-Mannered Crooks, Rogues & Criminals:",
  "description": "“True crime storytelling at its very best!” ― Dan Zupansky , author and host of True Murder #1 New Release in Heists & Robberies Enjoy a collection of non-fiction accounts by international writers and experts on crooks, rogues, criminals, and serial killers who disguise themselves among society by being what you least expect-your friendly next-door neighbor. From mild mannered coworkers to doting parents.  Some might be your jack-of-all-trades friend, or others might be your family member with an altruistic persona.  The Best New True Crime Well-Mannered Crooks, Rogues & Criminals takes you deeper into the unconventional criminal's psyche. The ones where their most prominent feature isn’t a bloodied knife, but a bright smile and warm gaze meant to lure their next victim. Meet the real murderers and killers.  You’ve heard about John Wayne Gacy. You’ve read about Jeffrey Dahmer. You’ve delved into the Ted Bundy fascination. It’s time for you to meet the infamous Naún Briones, who struck fear into the hearts of the rich, and Freddie Brenman, a notorious street-fighter with mysterious ties to the Dillinger Gang. You’ll find yourself realizing that being nice and friendly is a killer combination.  Edited by acclaimed author and anthologist Mitzi Szereto,   The Best New True Crime Well-Mannered Crooks, Rogues & Criminals reveals all-new accounts of true crime stories featuring serial killers from the contemporary to the depression-era. The international list of contributors includes award-winning crime writers, true-crime podcasters, journalists, and experts in the dark crimes field such as Tom Larsen, David Blumenfeld, and Anthony Ferguson. If you are a fan of true crime books such as  The Big Book of Serial Killers ,  The Best New True Crime Serial Killers , or  The Best New True Crime Small Towns , then you’ll love  The Best New True Crime Well-Mannered Crooks, Rogues & Criminals . Contributors Dean Jobb, Paul Willetts, Janel Comeau, David Breakspear, and Anthony Ferguson.",
  "genres": [
    "Nonfiction",
    "True Crime"
  ],
  "author": "Mitzi Szereto",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/54985383-the-best-new-true-crime-stories"
}