{
  "title": "A Will To Kill",
  "description": "THE NEW YORK TIMES EDITOR'S CHOICE. Recommended by The New York Times.The New Your Times: \"... a modern-day take on the classic locked-room murder mystery, transported to a remote mansion high in the hills of southern India.\" ... \"Athreya is a fine detective with a curious mind, a cool eye for the chance detail, a skill in synthesizing disparate threads and a talent for resisting the insults of the requisite police officer assigned to the case.\"Also named one of the best traditional mysteries of 2020 by Crimereads.For fans of Knives Out, a book that embodies all the things we love about Agatha Christie―a haunted manor house, estranged relatives, a will, and a murder― set in modern-day India, and the first in a new series from author RV Raman.Aging and wheelchair-bound patriarch Bhaskar Fernandez has finally reclaimed his family property after a bitter legal battle, and now wants to reunite his aggrieved relatives. So, he invites them to remote Greybrooke Manor in the misty Nilgiris ―a mansion that has played host to several sudden deaths; a colonial edifice that stands alone in a valley that is said to be haunted by the ghost of an Englishman. But Bhaskar has other, more practical problems to deal with.He knows that his family is waiting for him to die to regain the family fortune, and to safeguard himself against violence during the house party, he writes two conflicting wills. Which one of them comes into force depends on how he dies.Into this tinderbox, he brings Harith Athreya, a seasoned investigator. When a landslide occurs, temporarily isolating them all at the mansion, and resulting in a murder, Athreya finds that murder is not the only thing the mist conceals.A WILL TO KILL is the first Harith Athreya mystery.",
  "genres": [
    "Mystery",
    "Fiction",
    "India",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Adult"
  ],
  "author": "R.V. Raman",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/54983580-a-will-to-kill"
}