{
  "title": "How to Listen to and Understand Great Music",
  "description": "A music history and appreciation course, all in one. In these 48 lectures, Professor Greenberg discusses music from the ancient world to the modern day. According to The Teaching Company, \"This course can permanently enrich your life.\" Lecture Titles (abbreviated): Introduction Sources—The Ancient World and the Early Church The Middle Ages Introduction to the Renaissance The Renaissance Mass The Madrigal Introduction to the Baroque Style Features of Baroque Music and a Brief Tutorial on Pitch, Motive, Melody, and Texture The Rise of German Nationalism in Music Fugue Baroque Opera, Part 1 Part 2 Baroque Sacred Music, Part 1—The Oratorio Part 2—The Lutheran Church Cantata Baroque Instrumental Forms, Part 1—Passacaglia Part 2—Ritornello Form and the Baroque Concerto The Enlightenment and an Introduction to the Classical Era The Viennese Classical Style, Homophony, and the Cadence Classical-Era Form—Theme and Variations Minuet and Trio I-Baroque Antecedents Minuet and Trio II Rondo Sonata-Allegro Form I, Part 1 Part 2 Classical-Era Form—Sonata-Allegro Form II Classical-Era Orchestral Genres—The Symphony The Solo Concerto Classical-Era Opera—The Development of Opera Buffa Mozart and the Operatic Ensemble The French Revolution Beethoven's Symphony No. 5 in C Minor, Op. 67, Part 1 Part 2 Introduction to Romanticism Formal Challenges and Solutions in Early Romantic Music—Miniatures—Lieder and Chopin Program Symphony—Berlioz's Symphonie Fantastique, Part 1 Part 2 Nineteenth-Century Italian Opera—Bel Canto Opera Giuseppe Verdi Nineteenth-Century German Opera—Nationalism and Experimentation Richard Wagner The Concert Overture, Part 1 Part 2 Romantic Nationalism—Post-1848 Musical Nationalism Russian Nationalism The Early Twentieth Century and the Modernist Movement—An Introduction The Search for a New Musical Language—Debussy Stravinsky Schönberg",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Audiobook",
    "Art",
    "Education",
    "Self Help"
  ],
  "author": "Robert Greenberg",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/1266284.How_to_Listen_to_and_Understand_Great_Music"
}