{
  "title": "Jolie Blon's Bounce",
  "description": "The Barnes & Noble ReviewJames Lee Burke's fiction is haunted, sometimes quite literally, by the ghosts of history, and by a bone-deep apprehension of the human capacity for violence and cruelty. A case in point is the author's latest Dave Robicheaux novel, Jolie Blon's Bounce, a contemporary account of murder and madness whose plot reflects the lingering aftereffects of the antebellum South.The story begins with the shotgun murder of 16-year-old Amanda Boudreau and the subsequent arrest of Tee Bobby Hulin, a musically gifted young black man with a spiraling drug habit and a checkered criminal past. This initial murder is quickly followed by a second, the bludgeoning death of a prostitute with ties to the world of organized crime. The dual investigation that ensues leads Robicheaux -- together with his current partner, Helen Soileau, and his former partner in the New Orleans PD, Clete Purcell -- into the complex, interrelated histories of several New Iberia families, some rich, white, and powerful, some poor, black, and chronically underprivileged. The investigation puts Robicheaux in touch with the most vicious elements of Louisiana society, and with the darkest aspects of his own divided soul.Like most of Burke's fiction, Jolie Blon's Bounce is a rambling, loosely plotted affair notable for its powerful set pieces, its precise, sensual evocation of the Louisiana bayou country, and its flamboyant sense of character. Among the novel's most vivid creations are a sexually voracious defense attorney descended from a wealthy slaveholding family, a traveling Bible salesman with a penchant for violence, a former Mafia hit man with a tragic personal history, and a predatory, not-quite-human killer who goes by the name of Legion. Legion, a deliberate, over-the-top embodiment of absolute evil, is one of Burke's most remarkable creations. His presence, together with the corollary presence of a mad, possibly angelic figure known as Sal Angelo, lends this novel the faint, unmistakable aura of the supernatural that has characterized so much of Burke's recent fiction.As always, though, it is Dave Robicheaux himself -- a decent, violent, angry, loving, and deeply conflicted man -- who dominates the narrative. Robicheaux's distinctive character and his voice -- with its mournful power, its clean, rolling cadences, and its frequent flights of unforced poetry -- elevate this novel at every turn. Like the best of its predecessors (The Neon Rain, A Morning for Flamingos, Purple Cane Road), Jolie Blon's Bounce is bruising, moving, and beautifully composed -- an example of American crime fiction at its best and most highly evolved. (Bill Sheehan)",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Thriller",
    "Mystery Thriller",
    "Detective",
    "Audiobook"
  ],
  "author": "James Lee Burke",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/55013.Jolie_Blon_s_Bounce"
}