{
  "title": "Gates of Eden: The Druid Legacy 1-3",
  "description": "Legacies are forged through sacrifice. Book 1: Druid’s Dance (newly revised/edited edition) Elijah Wadsworth lost his parents and twin sister in what he thought was little more than a tragic accident. But five years later, when Elijah begins manifesting strange abilities--which he neither understands nor can control--he discovers his family has been at the center of a cosmic battle for centuries... and his family's death was likely no accident at all. A mysterious \"girl in black\" with dark, magical abilities pursues him, hoping to lure him to her cause. After coming into possession of a mystical stone, which transports Elijah into his deceased father’s ancient memories, Elijah and his closest friends must discover the source of his power together lest his newfound abilities drain his very soul, and open up our world to the blight of Samhuinn. When a girl he loves, however, is threatened he must make a choice to either save her by joining the sorceress, the \"girl in black,\" or save the world. Book 2: Bard’s Tale The Tree of Life—the source of Elijah’s power—is failing. Creatures from Samhuinn are breaking through the veil and terrorizing St. Louis. As the Tree weakens, Elijah’s abilities are failing. Will Elijah be able to stop the incursions before his powers fade completely? Book 3: Ovate’s Call Elijah’s Ovate—Tyler—is visited by a strange, but alluring, princess from Annwn. He's immediately captivated by her--but Elijah fears the princess has ulterior motives. Is the princess who she claims to be, or is she another pawn in the Morrigan's scheme? The cosmic struggle between Elijah, his Order, and the Morrigan and her legions comes to a head in the final installment of the Gates of Eden: the Druid Legacy Trilogy. Readers of Theophilus Monroe’s Voodoo Academy from the Gates of Eden: The Voodoo Legacy series will naturally adore the Druid Legacy. Combined with Celtic mythology and Arthurian lore, this druid urban fantasy is a compelling installment in the Gates of Eden world. With magical fantasy adventure romance, a snarky male hero, and a plethora of characters taken straight from Arthurain lore and the Celtic world of myth, this time travel epic fantasy will keep readers enthralled from start to finish.",
  "genres": [
    "Fantasy"
  ],
  "author": "Theophilus Monroe",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/55018711-gates-of-eden"
}