{
  "title": "Reign of Darkness",
  "description": "\"Know your place, Nikolas.\" \"Under the heel of your boot, Your Highness?\"After a terrible inferno destroys the Caville palace, and with the people of Loreen turned against him, Prince Vasili is left with no choice but to flee his ancestral home, leaving Amir to proclaim himself king. But the prince's life isn't the only one left in ashes. King Amir has not forgotten Nikolas Yazdan—the butcher, a lord's bastard son, and Vasili's favorite pet. Nikolas doesn't fear Amir, but the new king has discovered the Caville curse can be wielded like a weapon, and he has Nikolas in his crosshairs. The exotic south is Vasili's and Niko's only refuge. A land of pirates and thieves, of mystery and magic. A land of opportunity for a manipulative prince and his reluctant assassin.But just as Nikolas begins to believe Vasili might be worth fighting for—that Loreen can be saved with Vasili on the throne—the dark flame trapped in the royal bloodline unravels its ancient bonds.One prince must control the unrelenting power desperate for its escape. The other must die. Niko thought he knew which prince he could trust, but he's been fooled before and as Vasili's true motives are revealed, Niko finds himself at the mercy of Prince Vasili once more. Only this time, there is more than love at stake. The fate of the world rests on Niko discovering the truth about the flame, about the cursed Cavilles, and his place in their doomed destiny.Prince’s Assassin series is a slow-burn enemies-to-lovers saga. A gay Game of Thrones with a hint of Witcher thrown in, there are triggers, including but not limited to: reference to past abuse, attempted rape, dubious consent, reference to incest, torture, drug use and PTSD. High heat sexual content. The Prince’s Assassin is for 18+ only.\nReading order:King of the DarkReign of DarknessCurse of the Dark PrinceThe Cottage (novella)",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "Enemies To Lovers",
    "Dark",
    "LGBT",
    "Magic"
  ],
  "author": "Ariana Nash",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/55014590-reign-of-darkness"
}