{
  "title": "Imagining India: The Idea of a Renewed Nation",
  "description": "A visionary look at the evolution and future of India by a preeminent business leader India's recent economic boom—similar in scope to that of the United States during the early 1990s or Europe's during the 1970s—has triggered tremendous social, political, and cultural change. The result is a country that, while managing incredible economic growth, has also begun to fully inhabit its role on the world political stage. In this far-ranging look at the central ideas that have shaped this young nation, Infosys cofounder Nandan Nilekani offers a definitive and original interpretation of the country's past, present, and future. India's future rests on more than simply economic growth; it also depends on reform and innovation in all sectors of public life. Imagining India traces the efforts of the country's past and present leaders as they work to develop new frameworks that suit India's specific characteristics and challenges. Imagining India charts the ideas that are crucial to India's current infrastructure revolution and quest for universal literacy, urbanization, and unification; maps the ideological battlegrounds of caste, higher education, and labor reform; and argues that only a safety net of ideas from social security to public health to the environment can transcend political agendas and safeguard India's economic future. As a cofounder of Infosys, a global leader in information technology, Nandan Nilekani has actively participated in the company's rise in the last fifteen years. In Imagining India, he uses the global experience and understanding he has gained at Infosys as a springboard from which to discuss the future of India and its role as a global citizen and emerging economic giant. A fascinating window into the future of India, Imagining India engages with the central ideas and challenges that face the country from within and as a part of the global economy and charts a new way forward for a nation that has proved itself to be young, impatient, and vitally awake.",
  "genres": [
    "India",
    "Nonfiction",
    "Politics",
    "History",
    "Economics",
    "Business",
    "Indian Literature"
  ],
  "author": "Nandan Nilekani",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/5501276-imagining-india"
}