{
  "title": "Who Is That Man?: In Search of the Real Bob Dylan",
  "description": "A Kaleidoscopic Look at the Many Faces of Bob Dylan For almost half a century, Bob Dylan has been a primary catalyst in rock's shifting sensibilities. Few American artists are as important, beloved, and endlessly examined, yet he remains something of an enigma. Who, we ask, is the \"real\" Bob Dylan? Is he Bobby Zimmerman, yearning to escape Hibbing, Minnesota, or the Woody Guthrie wannabe playing Greenwich Village haunts? Folk Messiah, Born-Again Bob, Late-Elvis Dylan, Jack Fate, or Living National Treasure? In Who Is That Man? , David Dalton--cultural historian, journalist, screenwriter, and novelist--paints a revealing portrait of the rock icon, ingeniously exposing the three-card monte games he plays with his persona. Guided by Dalton's cutting-edge insights and myth-debunking point of view, Who Is That Man? follows Dylan's imaginative life, integrating actual events with Dylan's words and those of the people who know him most intimately. Drawing upon Dylan's friends and fellow eyewitnesses--including Marianne Faithfull, Allen Ginsberg, Peter Stampfel , Larry \"Ratso\" Sloman, Eric Andersen, Nat Hentoff, Andrew Oldham, Nat Finkelstein, and others--this book will provide a new perspective on the man, the myth, and the musical era that forged them both. Praise for Who Is That Man?\"Mr. Dalton, a founding editor of Rolling Stone , dates back so far in Dylan watching that he was all but present at the creation. He writes not just about Mr. Dylan but about what it's like to have lived in close psychic and musical proximity to him for so long.\"--Janet Maslin, The New York Times \"[Dalton's] attempts at exposing, debunking, and celebrating the essence of Robert Zimmerman's Dylanness, and vice versa, make for an intriguing, often amusing, vision quest. Dylan's quirks, kinks, and inscrutability are fascinating fodder for endless interpretations. Dalton is entitled to his, and they're the opposite of dull.\"--Robin Finn, The New York Times Book Review \"For all of the shelf-busting Dylan literature that's out there, it's rare that you find a book in which the music is discussed as adroitly as any aspect of the life... Dalton is a penetrating critic.\"--Colin Fleming, Washington Post \"Addictive reading... This approach would have crumbled in lesser hands, but Dalton does a stunningly good job.\"-- Publishers Weekly , starred review \"The mysteries of Bob Dylan captured in even-handed, never-boring fashion... This lively and literate attempt to read a half-century's worth of brain scans from a literal living legend strikes the right balance between admiration and skepticism.\"-- Kirkus Reviews \"All David Dalton's books are wonderful, but Who Is That Man? is especially insightful, funny, and beautifully written.\"--Marianne Faithfull \"Dalton's crazy poetic prose first caught my eye in Rolling Stone back in the day. Have loved his writing ever since. Oh yeaah! \"--Steven Tyler \"The first truly hip analysis of the ultimate hipster.\"--Lenny Kaye",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Journalism"
  ],
  "author": "David Dalton",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/12663122-who-is-that-man"
}