{
  "title": "Slow Brewing Tea",
  "description": "“Insightful, moving, and at times deeply profound, this book will have you turning each page in anticipation. It’s the introspective reader’s dream–a spiritual journey woven beautifully through a love story. A book that will cause you to think on what it means to love and be loved.” Nancy H.Isaiah set off on a ten day motorcycle adventure in northern, rural Japan. His quest, at the age of twenty, was to photograph the quiet mysterious culture, meet a Japanese woman and find The Tao (the way). He took stunning photographs, fell deeply in love with an extraordinary Japanese woman and found an old man willing to teach him the way, the truth and the narrow gate. Over the next forty years Isaiah’s life tumbles through lessons of pain and redemption, loss and victory in search of a path of unconditional love and faith.Be transformed by a journey into traditional Japan, a mystical land of tea ceremonies, Japanese gardens, rich culture and unexpected spiritual revelations.Slow Brewing Tea is an epic spiritual adventure and a touching love story that will compel you to look deeper at your relationships with your God, your spouse and the path beneath your feet.For four hundred years, the Oda clan kept a secret. In 1593, Oda Nobumasa, the son of infamous Oda Nobunaga, converted to Christianity and to avoid persecution was sent away to the remote mountains of northern Honshu to live as a hermit. For the remainder of his life he studied the mysteries of Jesus and came to a shocking Jesus’ teachings are a perfect fit into Japan’s traditions of the Samurai, Wa, the tea ceremony, gardens and nearly every aspect of Japanese culture. Obedient to a dream from God, Oda Nobumasa hid his discoveries in his tea room scrolls, to remain a family secret, until...Join Isaiah on this quest; finish, and you will see life, love and spirituality in a radically new way.“Our western world has been thirsting for a vision that can adequately blend Christianity with the depths of Asian culture and philosophy; this slowly brewed tea will satisfy.” —B.S., Amazon“Best novel I have read in a long time.\" —J., Amazon“WOW is an understatement... from beginning to the end, this book will move you!!!... the BEST novel I have ever read.” —PLS, Amazon“Isaiah is all of us who look for faith.” —C.N. BookBub“If I could recommend one book this year, it would be this. I couldn’t stop reading. I feel so full of hope after reading this book.” —L., Amazon, India“This is a beautiful story... overall sense is peace, spirituality and inner strength and faith. A very enlightening read whether you are Christian or not.” —C.N., BookBub“It’s hard to describe this novel. This is the new The Shack, but I think more biblically sound.” —G.B., Amazon India“Looking for inspiration? Here it is…read and absorb.” —G. H., Amazon“Moving story of redemption and love filled with romance and adventure. Yes, it moved me to tears.” —A.M., Amazon“A great read! It’s deep. Rich with great teaching that every Christian needs. Highly recommend.” —Z.H., Amazon“Incredible story! The reviews are right. You need to read this book!” —T., Amazon India“This book breaks all the molds! In my humble opinion this book will go down as one of the most epic Christian novels of the century.” —A.S., NetGalley“FIVE STARS ISN’T ENOUGH. The writing is excellent.",
  "genres": [
    "Fiction",
    "Christian",
    "Christian Fiction",
    "Novels",
    "Spirituality",
    "Religion",
    "Contemporary"
  ],
  "author": "Randy Loubier",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/55014950-slow-brewing-tea"
}