{
  "title": "The Second Book of the Tao",
  "description": "Enhanced by Stephen Mitchell’s illuminating commentary, the next volume of the classic manual on the art of living The most widely translated book in world literature after the Bible, Lao-tzu’s Tao Te Ching, or Book of the Way, is the classic manual on the art of living. Following the phenomenal success of his own version of the Tao Te Ching, renowned scholar and translator Stephen Mitchell has composed the innovative The Second Book of the Tao. Drawn from the work of Lao-tzu’s disciple Chuang-tzu and Confucius’s grandson Tzussu, The Second Book of the Tao offers Western readers a path into reality that has nothing to do with Taoism or Buddhism or old or new alone, but everything to do with truth. Mitchell has selected the freshest, clearest teachings from these two great students of the Tao and adapted them into versions that reveal the poetry, depth, and humor of the original texts with a thrilling new power. Alongside each adaptation, Mitchell includes his own commentary, at once explicating and complementing the text. This book is a twenty-first-century form of ancient wisdom, bringing a new, homemade sequel to the Tao Te Ching into the modern world. Mitchell’s renditions are radiantly lucid; they dig out the vision that’s hiding beneath the words; they grab the text by the scruff of the neck—by its heart, really—and let its essential meanings fall out. The book introduces us to a cast of vivid characters, most of them humble artisans or servants, who show us what it means to be in harmony with the way things are. Its wisdom provides a psychological and moral acuity as deep as the Tao Te Ching itself.The Second Book of the Tao is a gift to contemporary readers, granting us access to our own fundamental wisdom. Mitchell’s meditations and risky reimagining of the original texts are brilliant and liberating, not least because they keep catching us off-guard, opening up the heavens where before we saw a roof. He makes the ancient teachings at once modern, relevant, and timeless.Listen to a special podcast with Stephen Mitchell:",
  "genres": [
    "Philosophy",
    "Religion",
    "Taoism",
    "Spirituality",
    "Nonfiction",
    "Poetry",
    "Zen"
  ],
  "author": "Stephen Mitchell",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/5501274-the-second-book-of-the-tao"
}