{
  "title": "Confessions From Your Token Black Colleague: True Stories & Candid Conversations About Equity & Inclusion In The Workplace",
  "description": "In the aftermath of the George Floyd killing in 2020, as U.S. society takes a deep look at its racist underpinnings, corporations are among the institutions being called on to revamp their treatment of black people. Confessions from Your Token Black Colleague: True Stories and Candid Conversations About Equity and Inclusion in the Workplace, provides a first-hand account of the discrimination endured by Author Tali Lavarry while working for corporations that failed to rise to the occasion when it came to creating and fostering a sustainable work environment for diverse hires.Revealing the injustices and hypocrisy that prevails, she makes a case for business leaders to examine their own unacknowledged biases and take action to address systemic racism. Through conversations with progressive white business leaders and professionals in the fields of human resources and diversity and inclusion, with their help she demonstrates what has to be done to create real solutions that protect and fortify people of color and other marginalized groups.Part memoir and part blueprint for change, this book lays bare the mechanisms of workplace racism, from microaggressions to false accusations. Relentless oppression, at a series of corporate jobs, led to her nervous breakdown and confinement to a psych ward. This experience served as the catalyst for a period of soul-searching that resulted in the biggest revelation of her life and the formation of her own diversity, equity and inclusion consultancy.In this book she articulates the attitudes and behaviors of corporate staff that need changing if equity is to be achieved. Through a series of \"Proposals for Atonement and Reconciliation,\" she introduces a strategy that opens the door to the possibility of intrinsic change.",
  "genres": [
    "Nonfiction",
    "Race",
    "Business"
  ],
  "author": "Talisa Lavarry",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/55018895-confessions-from-your-token-black-colleague"
}