{
  "title": "Violets Are Blue",
  "description": "VIOLETS ARE BLUE, A Novella Newly-wed Sarah is delighted to move in with her mother-in-law, Martha, a widower who had raised her son, by herself, on an isolated Midwest farm. A kid from a broken home who had been raised in a group house in Chicago, Sarah had struggled to put herself through college on scholarships. She considered herself self-reliant and willing to work hard for her dreams. She wants only one thing in life—a real family.Todd was the love of her life, so that she was sure that she'd love Martha, too.It never occurred to Sarah that Martha would see her as competition, to be stood on the dirt road, staring at the six foot high stalks, at the long, rippled leaves that concealed, in seconds, the bold red of Todd's t-shirt. The corn had swallowed him up. She hadn't expected him to take off.Seriously, he wanted to play tag in a corn field? Then, she thought, why not? It was as crazy as anything else that they had done together. She remembered the time that they had walked through a snow storm, licking ice cream cones. People drove by, laughing at them, but a cone in winter had the advantage of not melting. It was the perfect weather for ice cream.\"Todd, where are you?\" She tried to sound pissed, after all, he was forcing her to play tag. She waited to hear his voice, so that she could follow him. \"Todd?\"\"Come and get me!\" he shouted, but she heard him moving again as she ran into the field, the noise of him running was fainter than the crashing of her own elbows and legs through the corn stalks. In the corner of her eye she saw the ears of corn which were both uglier and smaller than those in the supermarkets back home. The cobs, half eaten by the birds, had empty black sockets that resembled gap-toothed smiles. Tassels draped over the cobs like a bad comb-over.The leaves sliced her skin. She was forced to run through random swarming circles of flies. Her hands were held out straight in front of her, in a futile effort to protect her face. Sarah could hear Todd, up-ahead. He sounded closer.She stumbled. Her feet kept getting caught in the rope-like webbing of the corn roots. The ground was rock hard and dry. Only her momentum kept her from actually falling. A glimpse, finally, of Todd's shirt; she was gaining on him.His dark blue baseball cap flew up above the corn. Her eyes followed its descent. Sarah almost went to pick it up, but she didn't want to lose Todd now. It was his problem, if they couldn't find the hat later...Grinning, she gasped for more air, she was getting closer. Todd was too smug in his country boy superiority, condescending about her fear of chickens. They were big birds, peaking at her knees, chasing her around the pen. They had flapped their useless wings in what she figured was their attack pose and made their warning cries, high and screechy. Fried chicken. Roasted chicken. Sweet and sour chicken. Her revenge would be tasty.Todd was no longer a blur, but begun to take shape, again. She could see, in clear detail, the dark wave of hair at the top of his neck, formed by his constant habit of wearing baseball caps.She was getting closer. Growing up in Chicago didn't mean that she couldn't run. There had been plenty of things to run from in Chicago. She liked to think that four years in college hadn't slowed her down.She could see Todd turn his head to check on her progress. He started quarterback dodging, going left and then right, around the rows of corn. Sarah followed, replicating his sudden turns. She steadied herself by reaching out at the corn, ripping off leaves, knocking down stalks.",
  "genres": [],
  "author": "Carrie  Green",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/12663183-violets-are-blue"
}