{
  "title": "Lady Sunshine",
  "description": "ONE ICONIC FAMILY. ONE SUMMER OF SECRETS. THE DAZZLING SPIRIT OF 1970S CALIFORNIA.For Jackie Pierce, everything changed the summer of 1979, when she spent three months of infinite freedom at her bohemian uncle’s sprawling estate on the California coast. As musicians, artists, and free spirits gathered at The Sandcastle for the season in pursuit of inspiration and communal living, Jackie and her cousin Willa fell into a fast friendship, testing their limits along the rocky beach and in the wild woods... until the summer abruptly ended in tragedy, and Willa silently slipped away into the night.Twenty years later, Jackie unexpectedly inherits The Sandcastle and returns to the iconic estate for a short visit to ready it for sale. But she reluctantly extends her stay when she learns that, before her death, her estranged aunt had promised an up-and-coming producer he could record a tribute album to her late uncle at the property’s studio. As her musical guests bring the place to life again with their sun-drenched beach days and late-night bonfires, Jackie begins to notice startling parallels to that summer long ago. And when a piece of the past resurfaces and sparks new questions about Willa’s disappearance, Jackie must discover if the dark secret she’s kept ever since is even the truth at all.“Lady Sunshine is shot through with free love, hope, and all the magic of the ’70s, but under the sun and music lie dark secrets.It’s a thrilling ride, a beautiful evocation of an era, and a story that will keep readers entranced from the first page to the last.”—Rene Denfeld, bestselling author of The Child Finder“This book is gorgeous. A gold-drenched nostalgic dream with a fierce female friendship at its heart.”—Marisa de los Santos, New York Times bestselling author of I'll Be Your Blue Sky“Haunting and vivid, with layered, complex characters and an evocative setting that sparkles with detail, LADY SUNSHINE will stay with me for a long time.”—Julie Clark, New York Times bestselling author of The Last Flight",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Contemporary",
    "Audiobook",
    "Music"
  ],
  "author": "Amy Mason Doan",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/55004512-lady-sunshine"
}