{
  "title": "Nine Lives: Death and Life in New Orleans",
  "description": "The hidden history of a haunted and beloved city told through the intersecting lives of nine remarkable characters After Hurricane Katrina, Dan Baum moved to New Orleans to write about the city’s response to the disaster for The New Yorker. He quickly realized that Katrina was not the most interesting thing about New Orleans, not by a long shot. The most interesting question, which struck him as he watched residents struggling to return, was this: Why are New Orleanians—along with people from all over the world who continue to flock there—so devoted to a place that was, even before the storm, the most corrupt, impoverished, and violent corner of America?Here’s the answer. Nine Lives is a multivoiced biography of this dazzling, surreal, and imperiled city through the lives of nine characters over forty years and bracketed by two epic storms: Hurricane Betsy, which transformed the city in the 1960’s, and Katrina, which nearly destroyed it. These nine lives are windows into every strata of one of the most complex and fascinating cities in the world. From outsider artists and Mardi Gras Kings to jazz-playing coroners and transsexual barkeeps, these lives are possible only in New Orleans, but the city that nurtures them is also, from the beginning, a city haunted by the possibility of disaster. All their stories converge in the storm, where some characters rise to acts of heroism and others sink to the bottom. But it is New Orleans herself—perpetually whistling past the grave yard—that is the story’s real heroine. Nine Lives is narrated from the points of view of some of New Orleans’s most charismatic characters, but underpinning the voices of the city is an extraordinary feat of reporting that allows Baum to bring this kaleidoscopic portrait to life with brilliant color and crystalline detail. Readers will find themselves wrapped up in each of these individual dramas and delightfully immersed in the life of one of this country’s last unique places, even as its ultimate devastation looms ever closer. By resurrecting this beautiful and tragic place and portraying the extraordinary lives that could have taken root only there, Nine Lives shows us what was lost in the storm and what remains to be saved.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Book Club",
    "Travel",
    "Memoir",
    "The United States Of America"
  ],
  "author": "Dan Baum",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/5501146-nine-lives"
}