{
  "title": "Product Management's Sacred Seven: The Skills Required to Crush Product Manager Interviews and be a World-Class PM",
  "description": "Authored by 3 Product Managers at Facebook, Google, and Microsoft, Product Management’s Sacred Seven is a comprehensive resource that will teach you the must-know knowledge and applied skills necessary to become a world-class PM that can get hired anywhere.In writing this book, we interviewed 67 product leads and hiring managers from 52 top companies around the world. They ranged from all the usual FAANG suspects to darling unicorns such as Coinbase, TikTok, and Grab. We asked everyone two simple questions:What knowledge separates interview candidates you hire from those you don't?What hard skills help PMs advance their careers the fastest?Given that we talked to product leaders across the world who worked in various different countries and industries, we expected to see no clear pattern in our responses. We were shocked to find a common theme across all of our interviews. The knowledge and skills which separated exceptional PMs from the rest all boiled down to seven subjects: product design, economics, psychology, user experience, data science, law & policy, and marketing & growth.The average PM excels at 2 or 3 of these disciplines. A truly world-class product manager, however, thrives in all 7. Authored by the #1 bestselling authors of Swipe to Unlock, this book blends case studies, theory, and mental models to help you master these seven subjects and fast forward your product career!Inside Product Management’s Sacred Seven, you’ll find real-world examples from over four dozen companies, battle-tested interview tips, and free access to a library of bonus video content online.Topics Covered: Product Development, Hypothesis Testing, Market Selection, Prototyping, Product Strategy, Business Models, Market Entry Strategies, Unit Economics, Customer Economics, Product Segmentation, Pricing Psychology, User Motivation, Creating Product Stickiness & Habit, Gamification, Cognition & Mental Models, UX Principles, Product Usability, Light & Dark Patterns, Data Analysis, Experimentation Frameworks, Product Metrics, Storytelling with Data, Antitrust Policy, Intellectual Property, Platform Liability, Privacy, Employment Law, Accessibility, Brand Building, Advertising, Growth Hacking and much more!Featured Companies: Google, Facebook, Microsoft, Amazon, TikTok, Snapchat, Apple, Spotify, Uber, WeChat, Yelp, Tinder, Twitter, Tesla, ByteDance, OnePlus, PayPal, LinkedIn, Airbnb, Pinterest, Zillow, Visa, Salesforce, Asana, Robinhood, Adobe, Alibaba, Netflix, Bloomberg, Shopify, Trello, Workday, Notion, Nintendo, Glossier, Lyft, Telegram, Disney, and many more!Read Sacred Seven today to ace your PM interviews and become a better product leader!",
  "genres": [
    "Business",
    "Management",
    "Nonfiction",
    "Buisness",
    "Entrepreneurship"
  ],
  "author": "Parth Detroja",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/55025971-product-management-s-sacred-seven"
}