{
  "title": "A Needle in the Right Hand of God: The Norman Conquest of 1066 and the Making and Meaning of the Bayeux Tapestry",
  "description": "The Bayeux Tapestry is the world’s most famous textile–an exquisite 230-foot-long embroidered panorama depicting the events surrounding the Norman Conquest of 1066. It is also one of history’s most mysterious and compelling works of art. This haunting stitched account of the battle that redrew the map of medieval Europe has inspired dreams of theft, waves of nationalism, visions of limitless power, and esthetic rapture. In his fascinating new book, Yale professor R. Howard Bloch reveals the history, the hidden meaning, the deep beauty, and the enduring allure of this astonishing piece of cloth.Bloch opens with a gripping account of the event that inspired the Tapestry: the swift, bloody Battle of Hastings, in which the Norman bastard William defeated the Anglo-Saxon king, Harold, and laid claim to England under his new title, William the Conqueror. But to truly understand the connection between battle and embroidery, one must retrace the web of international intrigue and scandal that climaxed at Hastings. Bloch demonstrates how, with astonishing intimacy and immediacy, the artisans who fashioned this work of textile art brought to life a moment that changed the course of British culture and history. Every age has cherished the Tapestry for different reasons and read new meaning into its enigmatic words and images. French nationalists in the mid-nineteenth century, fired by Tapestry’s evocation of military glory, unearthed the lost French epic “The Song of Roland,” which Norman troops sang as they marched to victory in 1066. As the Nazis tightened their grip on Europe, Hitler sent a team to France to study the Tapestry, decode its Nordic elements, and, at the end of the war, with Paris under siege, bring the precious cloth to Berlin. The richest horde of buried Anglo-Saxon treasure, the matchless beauty of Byzantine silk, Aesop’s strange fable “The Swallow and the Linseed,” the colony that Anglo-Saxon nobles founded in the Middle East following their defeat at Hastings–all are brilliantly woven into Bloch’s riveting narrative.Seamlessly integrating Norman, Anglo-Saxon, Viking, and Byzantine elements, the Bayeux Tapestry ranks with Chartres and the Tower of London as a crowning achievement of medieval Europe. And yet, more than a work of art, the Tapestry served as the suture that bound up the wounds of 1066. Enhanced by a stunning full-color insert that includes reproductions of the complete Tapestry, A Needle in the Right Hand of God will stand with The Professor and the Madman and How the Irish Saved Civilization as a triumph of popular history.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "Medieval History",
    "Audiobook",
    "Medieval",
    "War"
  ],
  "author": "R. Howard Bloch",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/55040.A_Needle_in_the_Right_Hand_of_God"
}