{
  "title": "Falling Upward: A Spirituality for the Two Halves of Life",
  "description": "PRAISE FOR FALLING UPWARD\"Understanding the spiritual aspects of aging is as important as appreciating the systems and biological processes that age us. Richard Rohr has given us a perfect guide to what he calls the 'further journey,' a voyage into the mystery and beauty of healthy spiritual maturity.\"—Mehmet Oz, M.D., host of the \"Dr. Oz Show\"\"Falling Upward calls forth the promise within us and frees us to follow it into wider dimensions of our spiritual authenticity. This 'second half of life' need not wait till our middle years. It emerges whenever we are ready and able to expand beyond the structures and strictures of our chosen path. With Richard Rohr as a guide, this mystery can become as real and immediate as your hand on the doorknob.\"—Joanna Macy, author of World as Lover, World as Self\"In Falling Upward, Richard offers a simple but deeply helpful framework for seeing the whole spiritual life—one that will help both beginners on the path as they look ahead and long-term pilgrims as they look back over their journey so far.\"—Brian McLaren, author of A New Kind of Christianity and Naked Spirituality brianmclaren.net\"The value of this book lies in the way Richard Rohr shares his own aging process with us in ways that help us be less afraid. We begin to see that, as we grow older, we are being awakened to deep, simple, and mysterious things we simply could not see when we were younger.\"—Jim Finley, retreat leader, Merton scholar, and author of The Contemplative Heart\"This is Richard Rohr at his vintage best: prophetic, pastoral, practical. A book I will gratefully share with my children and grandchildren.\"—Cynthia Bourgeault, Episcopal priest, retreat leader, and author of The Meaning of Mary Magdalene, Centering Prayer, Inner Awakening, and The Wisdom Way of Knowing",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Religion",
    "Faith",
    "Christian",
    "Theology",
    "Christianity"
  ],
  "author": "Richard Rohr",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/12664433-falling-upward"
}