{
  "title": "Sam & Jordan",
  "description": "Sam - The moment I saw Jordan Webb walk into Brews Brothers a few weeks ago, I knew I was in trouble. He was the most gorgeous man I’d ever seen, but I soon learned that his beauty was more than skin deep. He has a kind heart and a desire to do good in the world. Since his living arrangement was in limbo after a breakup, I invited him to stay with me until the trial against Paul was over. It seemed like a good idea at the time; he needed a place to stay, I had more space than I needed, and he could be close to me and my police officer friends if he had questions about his case. But actually living with him is the best kind of torture. Everything he does only confirms how crazy about him I am. But I could never tell him; he’s young and beautiful, and free to go anywhere with his life. I’m nothing special; just a graying, softening man who is sixteen years his senior. I could never hold him back. He deserves better than me. Jordan - I’m head over heels in love with Sam Miller, the older police officer whom I’m currently living with. He’s sweet and funny and everything I want. But I could never reveal my feelings for him; I’m not exactly what you’d call a “catch”. I’m dramatic, sensitive, and often let my emotions get the better of me. I don’t have a lot of money - my last job as a public defender where I cut my teeth in the world of law didn’t pay much. Oh, and I have student loan debt up to my eyeballs. I wouldn’t even have a place to stay (besides the crummy motel where I’d been sleeping) if it weren’t for Sam’s kindness. It’s also entirely likely that my new aspiration of being a prosecutor will tank; for my “initiation test”, I’ve been tasked with trying Paul, the man who abused Lyle and assaulted Jonah. No self respecting prosecutor would touch the case because it’s been deemed unwinnable. So yeah, I’m a mess with literally nothing to offer. Sam deserves someone with his shit together. He deserves better than me. *This M/M May-December insta-love romance is for readers 18 and up! It contains a sexy, loving cop, his feisty sweetheart and their crazy best friends. It has no cheating or cliffhangers, and a very happy HEA.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Friends To Lovers",
    "Romance",
    "Forced Proximity",
    "Found Family"
  ],
  "author": "Jayda Marx",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/55035394-sam-jordan"
}