{
  "title": "Stalin's Wine Cellar",
  "description": "In the late 1990s, John Baker was known as a purveyor of quality rare and old wines. Always entrepreneurial and up for adventure, he was the perfect person for an occasional business partner to approach with a mysterious wine list that was foreign to anything John, or his second-in-command, Kevin Hopko, had ever come across. The list was discovered to be a comprehensive catalogue of the wine collection of Nicholas II, the last Tsar of Russia. The wine had become the property of the state after the Russian Revolution of 1918, during which Nicholas and his entire family were executed. Now owned by Stalin, the wine was discreetly removed to a remote Georgian winery when Stalin was concerned the advancing Nazi army might overrun Russia, and inevitably loot artefacts and treasures. Half a century later, the wine was rumoured to be hidden underground and off any known map.John and Kevin embarked on an audacious, colourful and potentially dangerous journey to Georgia to discover if the wines actually existed; if the bottles were authentic and whether the entire collection could be bought and transported to a major London auction house for sale. Stalin's Wine Cellar is a wild, sometimes rough ride in the glamorous world of high-end wine. From Double Bay Sydney to Tbilisi Georgia, via the streets of Paris, the vineyards of Bordeaux and iconic Château d'Yquem. A multimillion dollar cellar and a breathtaking collection of wine (and one very expensive broken bottle) is the elusive treasure. The cast of characters include Stalin, Hitler, Tsar Nicholas II and a motley bunch of Georgian businessmen/cowboys toting handguns, in the early days of Russian business development that led to the world of Putin and oligarchs.",
  "genres": [
    "Nonfiction",
    "History",
    "Wine",
    "Audiobook",
    "Adventure",
    "Biography",
    "War"
  ],
  "author": "John Baker",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/55061291-stalin-s-wine-cellar"
}