{
  "title": "Dreams of the Dying",
  "description": "If your mind is the enemy, where do you run?Years after a harrowing war experience, ex-mercenary Jespar Dal'Varek has taken to drifting. It's a lonely existence, but, barring the occasional bout of melancholia, he has found the closest thing to peace a man like him deserves. Life is \"all right.\"Or so he believes. Hoping to turn the page, Jespar accepts a mysterious invitation into the beautiful but dangerous archipelago of Kilay-and everything changes.Plagued by explosive social tensions and terrorism, the tropical empire is edging ever closer to civil war. Kilay's merchant king is the only person able to prevent this catastrophe, but he has fallen into a preternatural coma-and it's Jespar's task to figure out what or who caused it. As the investigation takes him across the archipelago and into the king's nightmares, unexpected events not only tie Jespar's own life to the mystery but also unearth inner demons he believed to be long exorcised.Battling old trauma while fighting for his life, his sanity, and the fate of Kilay, the line between dream and reality blurs until only one question remains: If your mind is the enemy, where do you run?Described as \"Inception in a Polynesian fantasy setting,\" Dreams of the Dying is a slow-burning, haunting blend of fantasy, mystery, and psychological horror, that explores mental illness, morality, and the dark corners of our minds.The hardcover edition comes with an illustrated appendix that includes: A short geographical overview of the Kilayan Archipelago An essay on the history of the Archipelago and the Illumined World A bestiary of the Archipelago's native creatures Pencil sketches of the characters, as envisioned by another in-universe character An overview of the seven Light-Born, the pantheon of the Illumined World A Nehrimese tailor's impressions of Kilayan fashion A guide to Makehu, the language spoken by the Makehu people, designed by a professional linguist The Great Umbra and the Resurrection of the World, the creation myth of the Makehu To the Moon I Say Farewell, a poem by Jespar's sister",
  "genres": [
    "Fantasy",
    "Horror",
    "Fiction",
    "Adult",
    "Mystery",
    "Dark Fantasy",
    "High Fantasy"
  ],
  "author": "Nicolas Lietzau",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/55069593-dreams-of-the-dying"
}