{
  "title": "Checkmate in Berlin: The Cold War Showdown That Shaped the Modern World",
  "description": "From a master of popular history, the lively, immersive story of the race to seize Berlin in the aftermath of World War II as it's never been told beforeBERLIN'S FATE WAS SEALED AT THE 1945 YALTA CONFERENCE: the city, along with the rest of Germany, was to be carved up among the victorious powers-- the United States, Britain, France, and the Soviet Union. On paper, it seemed a pragmatic solution. In reality, once the four powers were no longer united by the common purpose of defeating Germany, they wasted little time reverting to their prewar hostility toward--and suspicion of--one another. The veneer of civility between the Western allies and the Soviets was to break down in spectacular fashion in Berlin. Rival systems, rival ideologies, and rival personalities ensured that the German capital became an explosive battleground.The warring leaders who ran Berlin's four sectors were charismatic, mercurial men, and Giles Milton brings them all to rich and thrilling life here. We meet unforgettable individuals like America's explosive Frank \"Howlin' Mad\" Howley, a brusque sharp-tongued colonel with a relish for mischief and a loathing for all Russians. Appointed commandant of the city's American sector, Howley fought an intensely personal battle against his wily nemesis, General Alexander Kotikov, commandant of the Soviet sector. Kotikov oozed charm as he proposed vodka toasts at his alcohol-fueled parties, but Howley correctly suspected his Soviet rival was Stalin's agent, appointed to evict the Western allies from Berlin and ultimately from Germany as well.Throughout, Checkmate in Berlin recounts the first battle of the Cold War as we've never before seen it. An exhilarating tale of intense rivalry and raw power, it is above all a story of flawed individuals who were determined to win, and Milton does a masterful job of weaving between all the key players' motivations and thinking at every turn. A story of unprecedented human drama, it's one that had a profound, and often underestimated, shaping force on the modern world - one that's still felt today.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Germany",
    "War",
    "Russia",
    "Military Fiction"
  ],
  "author": "Giles Milton",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/55077569-checkmate-in-berlin"
}