{
  "title": "Treasured",
  "description": "From New York Times and USA Today bestselling author Lexi Blake comes a new story in her Masters and Mercenaries series…David Hawthorne has a great life. His job as a professor at a prestigious Dallas college is everything he hoped for. Now that his brother is back from the Navy, life seems to be settling down. All he needs to do is finish the book he’s working on and his tenure will be assured. When he gets invited to interview a reclusive expert, he knows he’s gotten lucky. But being the stepson of Sean Taggart comes with its drawbacks, including an overprotective mom who sends a security detail to keep him safe. He doesn’t need a bodyguard, but when Tessa Santiago shows up on his doorstep, the idea of her giving him close cover doesn’t seem so bad.Tessa has always excelled at most anything she tried, except romance. The whole relationship thing just didn’t work out for her. She’s not looking for love, and she’s certainly not looking for it with an academic who happens to be connected to her boss’s family. The last thing she wants is to escort an overly pampered pretentious man-child around South America to ensure he doesn’t get into trouble. Still, there’s something about David that calls to her. In addition to watching his back, she will have to avoid falling into the trap of soulful eyes and a deep voice that gets her heart racing.But when the seemingly simple mission turns into a treacherous race for a hidden artifact, David and Tess know this assignment could cost them far more than their jobs. If they can overcome the odds, the lost treasure might not be their most valuable reward.**Every 1001 Dark Nights novella is a standalone story. For new readers, it’s an introduction to an author’s world. And for fans, it’s a bonus book in the author’s series. We hope you'll enjoy each one as much as we do.**",
  "genres": [
    "BDSM",
    "Romance",
    "Romantic Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Erotic Romance",
    "Erotica"
  ],
  "author": "Lexi Blake",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/55061874-treasured"
}