{
  "title": "Absolute War: Soviet Russia in the Second World War",
  "description": "The battle on the Eastern Front between 1941 and 1945 was arguably the single most decisive factor of World War II, fixing the course of world history over the next half century. Now, drawing on sources newly available since the collapse of the Soviet Union and the reunification of Germany, historian and journalist Chris Bellamy presents the first full account of this deadly conflict.Bellamy outlines the lead-up to the war—in which the fragile alliance between Hitler and Stalin was unceremoniously broken—and takes us headlong into the hostilities. He presents a shocking picture of battle in which the traditional restraints of “civilized” warfare were shed. He makes clear how the Soviets quickly rallied against Hitler, choosing homegrown despotism over foreign domination in a struggle that the Russian people call the Great Patriotic War.Bellamy charts the early gains of the German army, whose advances into Soviet territory were brought to a halt in Moscow in the winter of 1941, and whose defeat was sealed in the Battle of Stalingrad, the most merciless campaign of the bloodiest front. He shows how Soviet men—and women—joined to fight a war whose casualties were later steeply underestimated by their government, and how even the true death toll, at 27 million, does not take into account the millions of lives on both sides that lay shattered in the aftermath.Finally, Bellamy examines the far-reaching consequences of the battle’s outcome—the reverberations of which are still felt today—and argues that the cost of victory was ultimately too much for the Soviet Union to bear.A magisterial study, and an essential addition to our understanding of contemporary world history.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Russia",
    "War",
    "Military History",
    "Russian History"
  ],
  "author": "Christopher Bellamy",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/550529.Absolute_War"
}