{
  "title": "The Simple Answer",
  "description": "Emily Garrett had a plan for after college: back to her hometown of Ember Grove, where she had a great job waiting for her that she was going to focus on. After forgiving her last girlfriend too many times and only finally getting out, she's not keen on dating again--not for a good, long while.Vanessa Schreier is a different person from when she was a kid--or at least, she hopes she is. A clique ruler in school who used her influence to bring down anyone who got in her way, she's come back to Ember Grove not too long ago to make amends. Most people know her as the woman who'll help anyone, anywhere, anytime, but some people aren't so quick to let go of the her past mistakes. One of those people is Vanessa herself.And one is the girl who just moved back in next door: Emily Garrett, her brother's best friend, her old next-door neighbor, and her favorite target to pick on as a kid.Emily's not stupid. She knows she had a crush on Vanessa as a kid even when she was bullying her, and judging by the way it feels to look at Vanessa now, she knows part of her still feels the same way. After spending college accepting one apology after another from an abusive girlfriend, she is done with accepting apologies from anyone--especially girls who make her heart race.But Vanessa, and the drive she has to make things right, are hard to avoid.The Simple Answer is a 70k-word girl-next-door romance about growth, forgiveness, and is the first book in the Ember Grove small-town romance series. Content warnings for childhood bullying, emotional manipulation, a car accident but no one gets hurt I promise, people talking about feelings, and more references to J-pop artists than I thought I'd be able to sneak into a novel.",
  "genres": [
    "Romance",
    "LGBT",
    "Lesbian",
    "Lesbian Romance",
    "Enemies To Lovers",
    "Second Chance",
    "Contemporary"
  ],
  "author": "Lily  Seabrooke",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/55067813-the-simple-answer"
}