{
  "title": "Ridgeline",
  "description": "The thrilling, long-awaited return of the #1 New York Times bestselling author of The Revenant.In 1866, with the country barely recovered from the Civil War, new war breaks out on the western frontier--a clash of cultures between a young, ambitious nation and the Native tribes who have lived on the land for centuries. Colonel Henry Carrington arrives in Wyoming's Powder River Valley to lead the US Army in defending the opening of a new road for gold miners and settlers. Carrington intends to build a fort in the middle of critical hunting grounds, the home of the Lakota. Red Cloud, one of the Lakota's most respected chiefs, and Crazy Horse, a young but visionary warrior, understand full well the implications of this invasion. For the Lakota, the stakes are their home, their culture, their lives.As fall bleeds into winter, Crazy Horse leads a small war party that confronts Colonel Carrington's soldiers with near constant attacks. Red Cloud, meanwhile, seeks to build the tribal alliances that he knows will be necessary to defeat the soldiers. Colonel Carrington seeks to hold together a US Army beset with internal discord. Carrington's officers are skeptical of their commander's strategy, none more so than Lieutenant George Washington Grummond, who longs to fight a foe he dismisses as inferior in all ways. The rank-and-file soldiers, meanwhile, are still divided by the residue of civil war, and tempted to desertion by the nearby goldfields.Throughout this taut saga--based on real people and events--Michael Punke brings the same immersive, vivid storytelling and historical insight that made his breakthrough debut so memorable. As Ridgeline builds to its epic conclusion, it grapples with essential questions of conquest and justice that still echo today.",
  "genres": [
    "Historical Fiction",
    "Westerns",
    "Fiction",
    "Audiobook",
    "War",
    "Historical",
    "Native American"
  ],
  "author": "Michael Punke",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/55077562-ridgeline"
}