{
  "title": "آنا کارنینا",
  "description": "داستان آنا کارِنینا دارای شخصیت اولِ واحدی نیست. با دیدن نام آنا کارنینا، این تصور ایجاد می‌شود که این داستان حتماً به‌کلّی دربارهٔ اوست، اما در واقع این‌گونه نیست؛ درحالی‌که شاید بیش از نیمی از داستان دربارهٔ او باشد، بقیهٔ داستان دربارهٔ فردی به نام «لوین» است که البته این دو شخصیت در داستان رابطهٔ دورادوری با هم دارند. به‌عبارتی، آنا کارِنینا خواهرِ دوستِ لوین است، که در ادامه داستان باجناق می‌شوند. در طولِ داستان، این دو شخصیت فقط دو بار یک بار در اوایل داستان و همچنین در اواخرِ داستان با هم روبه‌رو می‌شوند. پس، درحقیقت این رمان فقط به زندگی آنا کارِنینا اشاره ندارد و در آن به زندگی و افکار شخصیت‌های دیگرِ داستان نیز پرداخته شده‌است. آنا نام این زن است و کارِنین نام شوهرِ اوست، و او به‌مناسبت نام شوهرش آنا کارِنینا (مؤنثِ «کارِنین») نامیده می‌شود. تولستوی در نوشتن این داستان سعی داشته برخی افکار خود را در قالب دیالوگ‌های متن به خواننده القاء کند و او را به تفکر وادارد. در بعضی قسمت‌های داستان، تولستوی دربارهٔ شیوه‌های بهبود کشاورزی یا آموزش سخن گفته که نشان‌دهندهٔ اطلاعات وسیع نویسنده در این زمینه‌هاست. البته بیان این اطلاعات و افکار، گاهی باعث شده داستان از موضوع اصلی خارج و خسته‌کننده شود؛ به‌ویژه وقتی که در داستان صحبت از کشاورزی است. یکی از بارزترین جلوه‌های ظهور اندیشه‌های این نویسنده در داستان، قسمت‌هایی است که او افکار مذهبیِ خود را در قالب افکار شخصیت مهم داستان، یعنی لوین، آورده‌است. داستان از اینجا شروع می‌شود که زن و شوهری به نام‌های استپان آرکادیچ و داریا الکساندرونا با هم اختلافی خانوادگی دارند. آنا کارِنینا خواهر استپان آرکادیچ است و از سن پترزبورگ به خانهٔ برادرش – که در مسکو است – می‌آید و اختلاف زن و شوهر را حل می‌کند و حضورش در مسکو باعث به وجود آمدن ماجراهای اصلیِ داستان می‌شود… در داستان، فضای اشرافیِ آن روزگار حاکم است؛ زمانی که پرنس‌ها و کنت‌ها دارای مقامی والا در جامعه بودند، و آداب و رسوم اشرافیت و نجیب‌زادگی بر داستان حاکم است. در کل داستان روندی نرم و دلنشین دارد و به عقیدهٔ بعضی فضای خشک داستان جنگ و صلح بر آناکارنینا حاکم نیست. این داستان، که درون‌مایه‌ای عاشقانه – اجتماعی دارد، بعد از جنگ و صلح، بزرگ‌ترین اثر تولستوی، این نویسندهٔ بزرگ روسی به‌شمار می‌رود.",
  "genres": [
    "Fiction",
    "Romance",
    "Russia",
    "Historical Fiction",
    "Literature",
    "Russian Literature",
    "Novels"
  ],
  "author": "Leo Tolstoy",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/5507388"
}