{
  "title": "Five Quarts: A Personal and Natural History of Blood",
  "description": "“We’re born in blood. Our family histories are contained in it, our bodies nourished by it daily. Five quarts run through each of us, along some sixty thousand miles of arteries, veins, and capillaries.”–from Five QuartsIn the national bestseller Sleep Demons, Bill Hayes took us on a trailblazing trip through the night country of insomnia. Now he is our guide on a whirlwind journey through history, literature, mythology, and science by means of the great red river that runs five quarts strong through our bodies.Profusely illustrated, the journey stretches from ancient Rome, where gladiators drank the blood of vanquished foes to gain strength and courage, to modern-day laboratories, where high-tech machines test blood for diseases and dedicated scientists search for elusive cures. Along the way, there will be world-changing William Harvey’s discovery of the circulation of the blood; Antoni van Leeuwenhoek’s advances in making the invisible world visible in the early days of the microscope; Dr. Paul Ehrlich’s Nobel-Prize-winning work in immunology; Dr. Jay Levy’s codiscovery of the virus that causes AIDS. Yet there will also be ignorance and the widespread practice of bloodletting via incision and the use of leeches, which harmed more than it healed; the introduction of hemophilia into the genetic pool of nineteenth-century European royalty thanks to the dynastic ambitions of Queen Victoria; the alleged spread of contaminated blood through a phlebotomist’s negligence in modern-day California.This is also a personal voyage, in which Hayes recounts the impact of the vital fluid in his daily life, from growing up in a household of five sisters and their monthly cycles, to coming out as a gay man during the explosive early days of the AIDS epidemic in San Francisco, to his enduring partnership with an HIV-positive man.As much a biography of blood as it is a memoir of how this rich substance has shaped one man’s life, Five Quarts is by turns whimsical and provocative, informative and moving. It will get under your skin.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Medicine",
    "Memoir",
    "Medical",
    "Biology"
  ],
  "author": "Bill Hayes",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/550912.Five_Quarts"
}