{
  "title": "Disposable Domestics: Immigrant Women Workers in the Global Economy",
  "description": "Contents IntroductionBreeding Ignorance, Breeding HatredChapter 1: Undocumented The New Employable MotherChapter 2: The Nanny The Bracero Program RevisitedChapter 3: Immigrants and Workfare Emplyable but \"Not Employed\"Chapter 4: The Global Trade in Filipina Workers Gatekeeping and Housekeeping An Breeding Ignorance, Breeding Hatred In 1994, during one of the worst, but certainly not unprecedented, systematic attacks on immigrants to the United States, immigrants and their allies began sporting T-shirts bearing the face of an indigenous man and the slogan, \"Who are you calling illegal, Pilgrim?\" reflecting indignation at the ignorant and malicious anti-immigrant sentiments of the day. Specifically, this was in direct response to a campaign that had been brewing for years in policy circles and \"citizen\" groups, culminating in California state's Proposition 187. The initiative proposed to bar undocumented children from public schools and turn away undocumented students from state colleges and universities. It also proposed to deny the undocumented an array of public benefits and social services, including prenatal and preventive care such as immunizations. While the overt purpose of this voter initiative was to curtail immigration, ostensibly by restricting the use of public benefits and social services by undocumented immigrants, the real agenda behind it was to criminalize immigrants for presumably entering the country \"illegally\" and stealing resources from \"true\" United States citizens. More to the point, Proposition 187 came out of and was aimed at perpetuating the myth that all immigrants are \"illegal\" at worst and, at best, the cause of our society's and economy's ills. Throughout US history, immigration has been viewed and intentionally constructed as plague, infection or infestation and immigrants as disease (social and physical), varmints or invaders. If we look at contemporary popular films, few themes seem to tap the fears or thrill the American imagination more than that of the timeless space alien invading the United States, and statespeople have snatched up this popular image to rouse public support for",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Labor",
    "Politics",
    "History",
    "Economics",
    "Gender"
  ],
  "author": "Grace Chang",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/550778.Disposable_Domestics"
}