{
  "title": "What Makes It Great: Short Masterpieces, Great Composers",
  "description": "Rob Kapilow has been helping audiences hear more in great music for two decades with his What Makes It Great? series on NPR's Performance Today, at Lincoln Center, and in concert halls throughout the US and Canada. In this book, he focuses on short masterpieces by major composers to help you understand the essence of each composer's genius and how each piece—which can be heard on the book's web site—transformed the musical language of its time. Kapilow's down-to-earth approach makes music history easy to grasp no matter what your musical background. Explores the musical styles and genius of great classical composers, including Vivaldi, Handel, J.S. Bach, Handel, Haydn, Mozart, Beethoven, Schubert, Brahms, Chopin, Puccini, Wagner, Dvorak, Tchaikovsky, and Debussy Features an accompanying web site where you can see, hear, and download each short masterpiece and all of the book's musical examples Introduces you in depth to popular pieces from the classical repertoire, including \"Spring\" from the Four Seasons (Vivaldi), \"Dove Sono\" from The Marriage of Figaro (Mozart), the Prelude to Tristan and Isolde (Wagner), and \"Trepak\" from The Nutcracker Suite (Tchaikovsky) Written by acclaimed composer, conductor, and pianist Rob Kapilow: \"You could practically see the light bulbs going on above people's heads\" (The Philadelphia Inquirer); \"Rob Kapilow is awfully good at what he does\" (The Boston Globe); \"A wonderful guy who brings music alive!\" (Katie Couric)This book, along with the music on the companion web site, is an ideal starting point for anyone interested in classical music, whether first-time listener, experienced concertgoer or performing musician, offering an entree into the world of eighteen great composers and a collection of individual masterpieces spanning almost two hundred years.",
  "genres": [
    "Music",
    "Nonfiction"
  ],
  "author": "Rob Kapilow",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/12666687-what-makes-it-great"
}