{
  "title": "Eclipse of the Sun",
  "description": "In this fast-paced, reflective novel, (the third in a trilogy following Strangers and Sojourners and Plague Journal) Michael O'Brien presents the dramatic tale of a family that finds itself in the path of a totalitarian government. Set in the near future, the story describes the rise of a police state in North America in which every level of society is infected with propaganda, confusion and disinformation. Few people are equipped to recognize what is happening because the culture of the Western world has been deformed by a widespread undermining of moral absolutes. Against this background, the Delaney family of Swiftcreek, British Columbia, is struck a severe blow when the father of the family, the editor of a small newspaper which dares to speak the truth, is arrested by the dreaded Office of Internal Security. His older children flee into the forest of the northern interior, accompanied by their great-grandfather and an elderly priest, Father Andrei. Their little brother Arrow also becomes a fugitive as the government seeks to remove any witnesses, and eradicate all evidence of its ultimate goals. As O'Brien draws together the several strands of the story into a frightening yet moving climax, he explores the heart of growing darkness in North America, examining events which have already occurred. The reader will take away from this disturbing book a number of urgent questions: Are we living in the decisive moment of history? How dire is our situation? Do we live in pessimistic dread, or a Christian realism founded on hope? This is a tale about the victory of the weak over the powerful, courage over terror, good over evil, and, above all, the triumph of love.",
  "genres": [
    "Fiction",
    "Catholic",
    "Christian Fiction",
    "Christian",
    "Religion",
    "Spirituality",
    "Christianity"
  ],
  "author": "Michael D. O'Brien",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/550989.Eclipse_of_the_Sun"
}