{
  "title": "Defy The Ravaged",
  "description": "My name is Willow.His name is Jason.He hated me. I hated him— while silently hiding how much all that hate hurt deep down inside me. But all that was before. Before everything changed. Before I woke up to gunshots and screaming and death.Now he still hates me, along with his Uncle Paulie and their club brothers. But I don’t hate him. I can’t, not after he came for me. Not after he saved me.Not now that the ravaged are here.They come at you like you’re nothing. With their feral snarls, and bloodshot eyes. Their decaying mouths salivating for a bite of you. They are hungry for life and we are their meal.I didn’t want to believe it. I didn’t want to accept it. But I can’t ignore them now that they’re everywhere. Now that the threat of them haunts us every waking moment.With Jason standing between them and me— I can’t hate him anymore. I don’t want to.Defy the Ravaged is a compilation of the four-part romantic dystopian series originally published separately as novellas. It includes: Willow, Thrive, Hunted, and Defend.Warning: For Readers 18 years and older. Contains explicit sexual situations, possible triggers, dark themes, language, and violence.Reviews:“Zombies, blood, death, life, love and a psychopath all make for a really great read. Add a handsome Marine, a motorcycle, and his club and it is perfect!” -Amazon Reviewer\"Loved this book. Characters are well developed and it has a great story. It is emotional, raw and gripping. I literally couldn't put it down.\"- Amazon Reviewer\"Really one of the best zombie books I’ve read in awhile. Between her post-apocalyptic and her sci-fi books, this author is becoming one of my favorites.\" -Amazon Reviewer“There are so many twists and turns, you never know what's going to happen next. I was so involved in this book that when I was reading, I paid attention to nothing else around me.\" -Amazon Reviewer\"I devoured it. There’s so much happening between the fall of civilization itself and the relationship between Willow and Jay. I love how the romance never takes a back seat but the action is pretty much constant. So much love this series.\" -Amazon Reviewer“This book made me forget about time. I totally lost a night reading this and not realizing its morning already. From the first page to the last . . . You will be drawn to it. The writing is so good and flawless you just flow with it. Non stop action must read. I can't wait for the next one.” -Amazon Reviewer“This book hooks you from the beginning! I couldn’t put it down once I started to read it. Can’t wait for the next book!” -Amazon Reviewer",
  "genres": [
    "Dystopia",
    "Post Apocalyptic",
    "Zombies",
    "Romance",
    "Apocalyptic",
    "Enemies To Lovers",
    "Survival"
  ],
  "author": "E.M. Raegan",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/55108006-defy-the-ravaged"
}