{
  "title": "Single Dad Seeks Juliet",
  "description": "Dear Internet: Am I a horrible person for wanting to sabotage my work assignment—completely wreck a dating contest—because I hate the idea of love?I know it sounds bad, but just hear me out, okay?I (33F) work at a local paper, and two months ago, my editor assigned me a huge project—run the upcoming, highly anticipated Bachelor Anonymous contest.In essence, I’m supposed to help a reader-nominated bachelor find his special someone, and while I should be excited to handle something of this magnitude solo, I can’t help but get queasy over how gross it feels.Like, how cheesy could this thing get?Not to mention, I’m the last person who should be involved in this—my dating and relationship history is a cluster. Generally, the person in charge of these things shouldn’t fantasize about lighting the whole three-ring dating circus on fire.Anyway, men from all over Southern California, vying for the coveted bachelor role, submitted their personal ads to my paper. The readers voted, and Single Dad Seeks Juliet won by a landslide.Enter Mr. Bachelor Anonymous (40M), the single dad Romeo seeking his Juliet.Blah, blah, blah, right? Wrong.You guys—and I cannot stress this enough—this guy is the ultimate man in a six-foot-three, chiseled-muscle, freaking Adonis package with aquamarine eyes that would haunt the dreams of an insomniac.He’s a former Navy SEAL, successful business owner, motocross-riding, charming, supportive, funny-as-heck single dad, and the more time I spend with him, the more I want to bring this contest thing crumbling to the ground for an entirely different reason.Real talk: I think I’m falling for him.Me, the woman who despises love, might be falling for the completely off-limits Bachelor who I’m ironically assigned to help find love, while five other women think they’re the only contestants competing for his heart.So, Internet. Am I scum? Or is all fair in love and war?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers",
    "Audiobook",
    "Military Fiction",
    "Slow Burn"
  ],
  "author": "Max Monroe",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/55125515-single-dad-seeks-juliet"
}