{
  "title": "On The Grind",
  "description": "Charged with felony misconduct in a high-profile solicitation of murder case, Lieutenant Scully is faced with an impossible decision: either quietly resign from his job as a detective for the LAPD, the work he loves, or face criminal prosecution. Rather than smear the department's reputation and his own, Scully chooses to leave. His colleagues of years feel betrayed to learn that a dirty cop has been in their midst. His wife, Alexa, the chief of detectives, leaves him, seeking a divorce for his dalliance with the accused in the case, a beautiful, well-known Hollywood actress. His son, Chooch, horrified by these events, won't even speak to him. Life as Scully knows it is over. Or so it seems . . .In order to make a living the only way he knows how, Shane seeks employment from a police department that has been known to hire rejects from other departments: the Haven Park PD. Haven Park is an incorporated city near downtown Los Angeles, just one square mile in size and populated almost entirely by Mexican immigrants, most of them illegal. The department is a hotbed of corruption, in effect the personal goon squad and collection agency of the town's mayor, Cecil Bratano. Ushered into the department by his new partner, Alonzo Bell, Shane takes his lessons in policing from one of the dirtiest cops around.But things in L.A. are hardly ever what they seem. Relentlessly harassed by an over-zealous FBI agent, the alluring Ophelia Love, and under the constant, violent, and hyper-paranoid scrutiny of his new comrades-at-arms, Shane finds himself in snare a far greater than any he could have expected. His estranged wife may be the only one who can get Shane out of this mess alive. The question is: Is she willing to do so?",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Detective",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "Stephen J. Cannell",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/5511174-on-the-grind"
}