{
  "title": "Dusk, Night, Dawn: On Revival and Courage",
  "description": "\"Anne Lamott is my Oprah.\" -Chicago Tribune From the bestselling author of Help, Thanks, Wow comes an inspiring guide to restoring hope and joy in our lives.In Dusk Night Dawn, Anne Lamott explores the tough questions that many of us grapple with. How can we recapture the confidence we once had as we stumble through the dark times that seem increasingly bleak? As bad news piles up--from climate crises to daily assaults on civility--how can we cope? Where, she asks, \"do we start to our world and joy and hope and our faith in life itself back . . . with our sore feet, hearing loss, stiff fingers, poor digestion, stunned minds, broken hearts?\"We begin, Lamott says, by accepting our flaws and embracing our humanity.Drawing from her own experiences, Lamott shows us the intimate and human ways we can adopt to move through life's dark places and toward the light of hope that still burns ahead for all of us.As she does in Help, Thanks, Wow and her other bestselling books, Lamott explores the thorny issues of life and faith by breaking them down into manageable, human-sized questions for readers to ponder, in the process showing us how we can amplify life's small moments of joy by staying open to love and connection. As Lamott notes in Dusk Night Dawn, \"I got Medicare three days before I got hitched, which sounds like something an old person might do, which does not describe adorably ageless me.\" Marrying for the first time with a grown son and a grandson, Lamott explains that finding happiness with a partner isn't a function of age or beauty but of outlook and perspective.Full of the honesty, humor, and humanity that have made Lamott beloved by millions of readers, Dusk Night Dawn is classic Anne Lamott--thoughtful and comic, warm and wise--and further proof that Lamott truly speaks to the better angels in all of us.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Essays",
    "Spirituality",
    "Self Help",
    "Religion",
    "Audiobook"
  ],
  "author": "Anne Lamott",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/55115150-dusk-night-dawn"
}