{
  "title": "Older Sister. Not Necessarily Related.: A Memoir",
  "description": "Winner of the 2019 Hilary Weston Writers' Trust Prize for NonfictionA beautiful and haunting memoir of kinship and culture rediscovered.Jenny Heijun Wills was born in Korea and adopted as an infant into a white family in small-town Canada. In her late twenties, she reconnected with her first family and returned to Seoul where she spent four months getting to know other adoptees, as well as her Korean mother, father, siblings, and extended family. At the guesthouse for transnational adoptees where she lived, alliances were troubled by violence and fraught with the trauma of separation and of cultural illiteracy. Unsurprisingly, heartbreakingly, Wills found that her nascent relationships with her family were similarly fraught.Ten years later, Wills sustains close ties with her Korean family. Her Korean parents and her younger sister attended her wedding in Montreal, and that same sister now lives in Canada. Remarkably, meeting Jenny caused her birth parents to reunite after having been estranged since her adoption. Little by little, Jenny Heijun Wills is learning and relearning her stories and those of her biological kin, piecing together a fragmented life into something resembling a whole.Delving into gender, class, racial, and ethnic complexities, as well as into the complex relationships between Korean women--sisters, mothers and daughters, grandmothers and grandchildren, aunts and nieces-- Older Sister. Not Necessarily Related . describes in visceral, lyrical prose the painful ripple effects that follow a child's removal from a family, and the rewards that can flow from both struggle and forgiveness.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Adoption",
    "Canada",
    "Asian Literature",
    "Audiobook",
    "Biography"
  ],
  "author": "Jenny  Heijun Wills",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/55121378-older-sister-not-necessarily-related"
}