{
  "title": "Élj céltudatosan",
  "description": "Vannak, ​akik maguk irányítják az életüket, vannak, akik figyelik, és vannak, akik egyre csak ámulnak.SzókratészSokan véletlenszerűen élünk: belesodródunk kapcsolatokba, rákerülünk egy pályára, keressük az élet értelmét, és reménykedünk, fohászkodunk, hogy szerencsénk legyen a szerelemben, jól alakuljanak a pénzügyeink, és jó egészségnek örvendjünk.Évekig élhetünk így, találomra, de előbb-utóbb meg kell tanulnunk céltudatosan alakítani az utunkat. Miért? Mert egy merészen új szemléletmóddal olyan életben lehet részünk, amelyben a mindennapok kihívásait valóban fel tudjuk használni a spirituális növekedéshez. Ha tervszerűen élünk, és az elveinknek megfelelően cselekszünk, akkor olyanok leszünk, mint az erős, mégis hajlékony bambusznád: meghajlunk a szembejövő erők előtt, majd ahogy elhaladnak, visszapattanunk eredeti helyünkre.A volt világbajnok atléta, edző és tanító, Dan Millman tovább csiszolja előző könyvei tudását. Salamoni bölcsességet és józan paraszti észjárást egyesítő, derűs stílusban adja közre meglátásait, amelyek időtlen elveket mozgatnak meg. Terítékre kerül a pénz és a munka, a gyermeknevelés és a fontossági sorrend megállapítása, a táplálkozás és az egészség, a döntéshozatal és a válás, az egyszerűség és a spiritualitás, a meditáció és az erkölcs, a testi örömök és a félelem, az élet és a halál, és még sorolhatnánk. Újszerű meglátásai és személyes útmutatásai intuitív felismerésekhez vezetnek minket saját életünkkel kapcsolatban: hozzájárulnak az önelemzéshez, és elősegítik, hogy önmagunkba mélyedve ráleljünk benső igazságainkra.A könyvben ismertetett elvek és gyakorlati tanácsok az élet iskolájának tömören megfogalmazott tanításai, amelyeket Millman öreg harcos-tanítómestere, Szókratész házszabályoknak nevezett. A „ház” az életet, a Taót, a Világmindenséget, a Valóságot, a „szabályok” pedig az egyetemes törvényszerűségeket vagy alapigazságokat jelentik, és megbízható támpontot nyújtanak a céltudatos élethez.Próbáljuk ki a házszabályokat a gyakorlatban, és igazítsuk őket saját körülményeinkhez! Hatásukra nő a teljesítményünk, az alkotókedvünk és az örömérzetünk, még jobban elmélyül lelki életünk, s közben megálljuk helyünket az anyagi világban is.",
  "genres": [
    "Self Help",
    "Spirituality",
    "Nonfiction",
    "Philosophy"
  ],
  "author": "Dan Millman",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/55114386-lj-c-ltudatosan"
}