{
  "title": "In Search of a Northern Soul: A journey of discovery in the north east of England",
  "description": "In a search for the author’s northern roots he takes a deeply personal but lighthearted and humorous look at the land of his birth and heritage. This is an adventure into both the present and the past landscapes of the north east of England, a journey that is light, playful yet often poignant and thought-provoking, exploring the places in which his ancestors lived and worked, looking for their memories and exploring far back in the depths of his own memory for the seeds of their experiences.The author begins his journey at his birthplace in Tynemouth, taking us around the dockyards and riverside industries of the Tyne, through the coastal resort of Whitley Bay and on to the metropolis of the City of Newcastle where memories of a 1960s Geordie lifestyle emerge from the granite and glass of the 21st century. Over the river into County Durham he seeks out the mining communities where in days gone by his ancestors dug coal from far below ground, and then to the far north east coast where immense coastal landscapes provided the backdrop for the smugglers and felons with which his ancestors were concerned. The story is littered with pubs and bars, characters and places, ghosts of ancestors which appear in the 21st century landscape. Unexpected encounters arise at almost every turn – drinking beer with an ordained Reverend in a 19th century pub, a bar where everyone seems to be called “Steve”, and a kipper manufacturer are just some of the obstacles the author has to navigate in his quest for his Northern Soul. This is not simply a travelogue through the varied landscapes of the north east, but also a look into blood-lines and heritage, into history and the lives of the people who lived there long before us, and a discovery of the changes that have overtaken those past times. Will the northern blood that runs in the author’s veins with the depth of generations give rise to a feeling of belonging? Is that where he will feel at home?",
  "genres": [],
  "author": "Stephen  Wood",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/55116009-in-search-of-a-northern-soul"
}