{
  "title": "تاريخ الطبري: تاريخ الأمم والملوك",
  "description": "الإمام، صاحب التصانيف المشهورة.استوطن بغداد، وأقام بها إلى حين وفاته.وكان قد رحل في طلب الحديث، وسمع بالعراق والشام ومصر من خلق كثير وحدث بأكثر مصنفاته.واتفق أنه جمعت الرحلة إلى مصر بين محمد بن جرير الطبري، ومحمد بن إسحاق بن خزيمة، ومحمد بن نصر المروزيّ، ومحمد بن هارون الرّوياني فأرملوا ولم يبق عندهم ما يقوتهم، وأضرّ بهم الجوع، فاجتمعوا ليلة في منزل كانوا يأتون إليه، فاتفق رأيهم على أن يستهموا ويضربوا القرعة، فمن خرجت عليه سأل لأصحابه الطعام، فخرجت القرعة على محمد بن إسحاق- ابن خزيمة، فقال لأصحابه: أمهلوني حتى أتوضأ وأصلي صلاة الخيرة، واندفع في الصلاة فإذا هم بالشموع وخصيّ من قبل والي مصر يدق الباب، ففتحوا فنزل عن دابته وقال: أيكم محمد بن نصر؟ فقيل: هو، ذا، فأخرج صرّة فيها خمسون دينارا فدفعها إليه، وقال: أيكم محمد بن هارون؟ فقالوا:هو ذا. فأخرج صرة فيها خمسون دينارا فدفعها إليه، وقال: أيكم محمد بن جرير؟ فقيل: هو، ذا. فأخرج صرّة فيها خمسون دينارا فدفعها إليه ثم قال:أيكم محمد بن إسحاق ابن خزيمة؟ فقالوا: هو، ذا يصلي، فلما فرغ دفع إليه صرة فيها خمسون دينارا، ثم قال: إن الأمير كان قائلا فرأى في المنام خيالا. قال: إن المحامد طووا كشحهم جياعا، فأنفذ إليكم هذه الصرر، وأقسم عليكم إذا نفدت فابعثوا إليّ أمدّكم.قال أبو سعيد بن يونس: كان فقيها، قدم إلى مصر قديما سنة ثلاث وستين ومائتين. وكتب بها، ورجع إلى بغداد، وصنف تصانيف حسنة تدل على سعة علمه.وقال الخطيب أبو بكر: أحد أئمة العلماء، يحكم بقوله، ويرجع إلى رأيه، لمعرفته وفضله، وكان قد جمع من العلوم ما لم يشاركه فيه أحد من أهل عصره، وكان حافظا لكتاب الله، عارفا بالقراءات بصيرا بالمعاني، فقيها في أحكام القرآن عالما بالسنن وطرقها، وصحيحها وسقيمها، وناسخها ومنسوخها، عارفا بأقوال الصحابة والتابعين، ومن بعدهم من المخالفين في الأحكام، ومسائل الحلال والحرام، عارفا بأيام الناس وأخبارهم، وله الكتاب المشهور في «تاريخ الأمم والملوك» وكتاب «التفسير» الذي لم يصنّف أحد مثله، وكتاب «تهذيب الآثار» لم أر سواه في معناه، إلا أنه لم يتمّه، وكتاب حسن في القراءات سماه «الجامع» وله في أصول الفقه وفروعه كتب كثيرة، واختيار من أقاويل الفقهاء وتفرّد بمسائل حفظت عنه.وسمعت علي بن عبيد الله بن عبد الغفار اللغوي، يحكي أن محمد بن جرير مكث أربعين سنة، يكتب في كل منها أربعين ورقة.وقال ابن خزيمة وقد نظر تفسير محمد بن جرير: قد نظرت فيه من أوله إلى آخره، وما أعلم على أديم الأرض أعلم من محمد بن جرير.وقال أبو محمد عبد الله بن أحمد الفرغانيّ في «تاريخه» فتمّ من كتب يعني محمد بن جرير كتاب «تفسير القرآن» وجوّده، وبين فيه أحكامه، وناسخه ومنسوخه، ومشكله وغريبه، ومعانيه، واختلاف أهل التأويل والعلماء في أحكامه وتأويله، والصحيح لديه من ذلك، وإعراب حروفه، والكلام على الملحدين فيه، والقصص وأخبار الأمة، والقيامة، وغير ذلك مما حواه من الحكم والعجائب، كلمة كلمة، وآية آية، من الاستعاذة وإلى أبي جاد، فلو ادعى عالم أن يصنف منه عشرة كتب كل كتاب منها يحتوي على علم مفرد عجيب مستقصى لفعل.وكان ممّن لا تأخذه في دين الله لومة لائم، وحكي أنه استخار الله وسأله الإعانة على تصنيف التفسير ثلاث سنين فأعانه، وروى القاضي أبو عبد الله محمد بن سلامة بن جعفر القضاعي قال: أنبأنا علي بن نصر بن الصباح التغلبي، أنبأنا القاضي أبو عمر عبيد الله بن أحمد السمسار، وأبو القاسم بن عقيل الورّاق، أن أبا جعفر قال لأصحابه: أتنشطون لتفسير القرآن؟ قالوا: كم يكون قدره؟ فقال: ثلاثون ألف ورقة، فقالوا: هذا مما يفني الأعمار قبل تمامه. فاختصره في نحو ثلاثة آلاف ورقة.ثم قال: هل تنشطون لتاريخ العالم، إلى وقتنا هذا؟ قالوا كم قدره؟فذكر نحوا ممّا ذكره في التفسير [فأجابوا بمثل ذلك، فقال: إنا لله، ماتت الهمم. فاختصره في نحو ما اختصر التفسير] وقال أبو بكر الخطيب: عن القاضي ابن كامل: أربعة كنت أحبّ بقاءهم، أبو جعفر الطبري، والبربري، وأبو عبد الله بن أبي خيثمة، والمعمري، فما رأيت أفهم منهم ولا أحفظ.ومولد أبي جعفر بآمل في سنة أربع وعشرين ومائتين، ووفاته ببغداد في يوم السبت، ودفن يوم الأحد بالغداة في داره لأربع بقين من شوال سنة عشر وثلاثمائة، وقيل توفي في عشية يوم الأحد ليومين بقيا من شوال ودفن يوم الاثنين، واجتمع في جنازته خلق لا يحصون، وصلّي على قبره عدة شهور ليلا ونهارا، وكان السواد في رأسه ولحيته كثيرا، وكان أسمر إلى الأدمة، أعين، نحيف الجسم، مديد القامة، فصيح اللسان، ورثاه خلق كثير من أهل الدّين والأدب. وقيل إنه دفن في سفح المقطم من القرافة، وليس بصحيح.",
  "genres": [
    "History",
    "Religion",
    "Islam",
    "Nonfiction"
  ],
  "author": "محمد بن جرير الطبري",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/55125407"
}