{
  "title": "Beethoven: The Music and the Life",
  "description": "An authoritative work offering a fresh look at Beethoven’s life, career, and milieu. “Magisterial” ― New York Review of Books . This brilliant portrayal weaves Beethoven's musical and biographical stories into their historical and artistic contexts. Lewis Lockwood sketches the turbulent personal, historical, political, and cultural frameworks in which Beethoven worked and examines their effects on his music. \"The result is that rarest of achievements, a profoundly humane work of scholarship that will―or at least should―appeal to specialists and generalists in equal measure\" (Terry Teachout, Commentary ). Finalist for the Pulitzer Prize.  \"Lewis Lockwood has written a biography of Beethoven in which the hours that Beethoven spent writing music―that is, his methods of working, his interest in contemporary and past composers, the development of his musical intentions and ideals, his inner musical life, in short―have been properly integrated with the external events of his career. The book is invaluable.\" ―Charles Rosen \"Lockwood writes with poetry and clarity―a rare combination. I especially enjoyed the connection that he makes between the works of Beethoven and the social and political context of their creation―we feel closer to Beethoven the man without losing our wonder at his genius.\" ―Emanuel Ax \"The magnum opus of an illustrious Beethoven scholar. From now on, we will all turn to Lockwood's The Music and the Life for insight and instruction.\" ―Maynard Solomon \"This is truly the Beethoven biography for the intelligent reader. Lewis Lockwood speaks in his preface of writing on Beethoven's works at 'a highly accessible descriptive level.' But he goes beyond that. His discussion of the music, based on a deep knowledge of its context and the composition processes behind it, explains, elucidates, and is not afraid to evaluate; while the biographical chapters, clearly and unfussily written, and taking full account of the newest thinking on Beethoven, align closely with the musical discussion. The result is a deeply perceptive book that comes as close as can be to presenting the man and the music as a unity.\"―Stanley Sadie, editor, The New Grove Dictionary of Music and Musicians \"Impressive for both its scholarship and its fresh insights, this landmark work―fully accessible to the interested amateur―immediately takes its place among the essential references on this composer and his music.\"―Bob Goldfarb, KUSC-FM 91.5 \"Lockwood writes like an lucid, enthusiastic, stirring and enlightening. Beethoven has found his ablest interpreter.\"―Jonathan Keates, The Spectator   \"There is no better survey of Beethoven's compositions for a wide audience.\"―Michael Kimmelman, The New York Times Book Review 50 illustrations",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "History",
    "Classical Music",
    "Biography Memoir",
    "Germany"
  ],
  "author": "Lewis Lockwood",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/126672.Beethoven"
}