{
  "title": "Echoes of Blood",
  "description": "Let’s play a game.\nThis isn’t revenge anymore.This is a revolution.▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀Dystopian Earth buckles under the gods’ wrath while two mirrored souls seek reason and revenge.Kyder is the boss of the Apolli, the most notorious gang on the planet. Rune is a recruit at the Four Towers of Ma’at, a military academy. They were born on opposite solstices in a world where season of birth determines power—spring healers, summer mages, fall shapeshifters, and winter shields. As they struggle through war, their fates orbit while they battle their own demons and the demons from the sky.How do we rebuild after we lose everything?How do we rise again after we fall?Return to the Rift.Welcome back to the breach.CONTENT WARNING: The Rift Cycle is a highly graphic series intended for mature audiences. There is on-page murder, death, torture, mutilation, rape, child abuse, substance abuse, self-harm, and suicide ideation, as well as triggers for mental illnesses (depression, anxiety, OCD, and PTSD). This list is not comprehensive.Please read at your own risk.TAGS: science fiction, fantasy, grimdark, horror, LGBT, mental illness▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nREAD AN EXCERPT\nChapter 1: The Lightning War Kyder, Age 23 - August 22, 7023Let’s play a game.Do you see that person over there? On the couch at the other end of the brothel? The man in the top hat with the obnoxious glasses? That’s Deleri, the jeweler. Look closely. Did you see it? No, of course you didn’t. But I did. Flared nostrils. Difficulty breathing. Mr. Deleri has asthma. Trigger an attack, and he’d sell you his wife and five children to remedy it. Lucky for him, I am always willing to assist.Try again. Do you see that woman perched on the coffee table? The one with the long hair and sequined dress? That’s Porja, the mechanic. Her tell is easy. Go on. Take your time. What? You still don’t see it? For the love of Ra, I handed that one to you. Her ear. She always turns her head when spoken to, because she can only hear out of her right ear. Why is that relevant? I scheduled her an appointment with Zawad’s best spring-born healers to fix it this week. I know. How could she ever repay me? Don’t worry. I have a few ideas.One more, though you’re letting me down. See that man standing by the wall? Arms crossed, back slouched? That’s Rhip, the mortician. Ra knows I often have need of him. Look carefully. You wouldn’t want to disappoint me. I’m waiting. Okay, I’ll give you a few more seconds. Still nothing? Dear gods, you have a lot to learn. Watch his shoulders. He recoils whenever one of my whores nears him, because he’s a virgin, petrified of anything with a pulse. They make him uneasy, illogical, and pliable from a business perspective. That’s why I usually meet him here. I can get anything and everything from a man with fear…▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nWELCOME BACK TO THE BREACH.",
  "genres": [
    "M M Romance"
  ],
  "author": "Halo Scot",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/55141547-echoes-of-blood"
}