{
  "title": "Alphas in Heat Box Set",
  "description": "The firemen of Blackcloud Point are some of the most possessive and obsessed bear shifters around when it comes to their mates! Approach at your own risk!The complete Amazon best-selling bear shifter series by Olivia T. Turner in one Box Set! Each of these five books debuted in the Amazon Top #100 or Top #50! 1. Bound to the AlphaHe's come to save me from the flames, but when I see the territorial way he's looking at me, I start to wonder who's going to save me from him?He keeps calling me his mate and I'm not about to correct him when he's got that feral look in his eyes.He wants to leave his mark on me.He keeps saying he's going to claim me, whatever that means.I've always had a thing for firemen, but this rough wild-looking man is more than just a pretty image in a calendar.He's real.And he's full on obsessed with me.2. Drawn to the AlphaI didn't want a mate. Never have.But when I walked into that kindergarten classroom and saw the new teacher......man, everything changed.Because the guy who never needed a girl is suddenly obsessed with one.My inner grizzly wants her as our mate.I want her for everything.And this firefighting grizzly bear shifter is ready to burn the world down to get her.3. Destined to the AlphaWestin Wood.Firefighter. Grizzly bear shifter. Muscular god.He can have any girl he wants and for some reason, he's chosen the curvy sarcastic waitress down at the local diner...He's very vocal about what he wants and I'm not talking about him ordering off the menu.He wants me. Claimed and marked.For a customer, he's a tad possessive.And protective.And downright wild.Luckily for me, my shift finishes in ten minutes... 4. Mated to the AlphaWhen a grizzly bear shifter named Rylan Young rolls into my ER with his body smashed to a pulp, it's love at first sight.If only he'd open his eyes...Every day, the pull to his room gets harder to resist. My crush on the sleeping shifter grows.I feel like I'm obsessed.Until Rylan opens his beautiful blue-gray eyes and he shows me what it truly means to be obsessed with the one you love. 5. Pulled to the AlphaThe silver fox of a Fire Chief, Blake Frost, thinks I'm his mate.Well, I got news for him.I'm nobody's girl.And I'm definitely not his to claim, no matter what he keeps saying.Fire-fighting bear shifters? Yes, please! All books are SAFE, with no cheating, and a furry HEA guaranteed. Enjoy!",
  "genres": [
    "Paranormal Romance"
  ],
  "author": "Olivia T. Turner",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/55143660-alphas-in-heat-box-set"
}