{
  "title": "Rowan Farm",
  "description": "Back in print from Purple House Press!January 1948 began a wonderful year for the Lechows. With Father newly returned to Western Germany from a Russian prison camp, they were together again and could enjoy a measure of security and happiness in The Ark, their railroad car home on Rowan Farm.It was a year that held for sixteen-year-old Margret in particular, both joy and sorrow. She found real satisfaction in entering Mrs. Almut’s Great Danes in two important shows and in raising several young animals which were her very own. She felt a vague unhappiness, however, when Mrs. Almut’s son, Bernd, as well as her own brother Matthias, succumbed to the charms of an attractive, but superficial girl from Frankfurt. But Margret had little time to brood. There was the abused Shetland pony whose life she was determined to save. There was also the problem of Andrea, her younger sister, whose flair for the dramatic landed her in serious difficulties at school. And Joey and Ull, the enterprising eight-year-olds, kept Margret in a constant state of uncertainty with their magnificent ventures. The year brought Margaret new friends as well⁠—among them the resourceful young schoolmaster with his plan for rebuilding a bombed out farm, and the American woman, working in Germany with the Friends’ Service Committee.As in The Ark, her previous book about the Lechow family, Mrs. Benary mirrors the slow changes of the season, come war or peace, the burgeoning of life in the spring and with it a renewal of hope. Once again she creates real people whose joys and disappointments are universally understood, and above all she leaves her readers a sense of courage and faith all too rare in books today.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Childrens",
    "Young Adult",
    "Germany",
    "World War II",
    "Historical"
  ],
  "author": "Margot Benary-Isbert",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/55151500-rowan-farm"
}