{
  "title": "Last Night I Dreamed of Peace: The Diary of Dang Thuy Tram",
  "description": "At the age of twenty-four, Dang Thuy Tram volunteered to serve as a doctor in a National Liberation Front (Viet Cong) battlefield hospital in the Quang Ngai Province. Two years later she was killed by American forces not far from where she worked. Written between 1968 and 1970, her diary speaks poignantly of her devotion to family and friends, the horrors of war, her yearning for her high school sweetheart, and her struggle to prove her loyalty to her country. At times raw, at times lyrical and youthfully sentimental, her voice transcends cultures to speak of her dignity and compassion and of her challenges in the face of the war’s ceaseless fury.The American officer who discovered the diary soon after Dr. Tram’s death was under standing orders to destroy all documents without military value. As he was about to toss it into the flames, his Vietnamese translator said to him, “Don’t burn this one. . . . It has fire in it already.” Against regulations, the officer preserved the diary and kept it for thirty-five years. In the spring of 2005, a copy made its way to Dr. Tram’s elderly mother in Hanoi. The diary was soon published in Vietnam, causing a national sensation. Never before had there been such a vivid and personal account of the long ordeal that had consumed the nation’s previous generations.Translated by Andrew X. Pham and with an introduction by Pulitzer Prize winner Frances FitzGerald, Last Night I Dreamed of Peace is an extraordinary document that narrates one woman’s personal and political struggles. Above all, it is a story of hope in the most dire of circumstances—told from the perspective of our historic enemy but universal in its power to celebrate and mourn the fragility of human life.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "War",
    "Biography",
    "Asia",
    "Historical"
  ],
  "author": "Đặng Thùy Trâm",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/551280.Last_Night_I_Dreamed_of_Peace"
}