{
  "title": "Glassheart",
  "description": "\"Fantasy at its best.\" The Daily Telegraph\"With echoes of Susan Cooper, this has all the feel of a classic.\" Sarah Baker“A masterfully written story surging with powerful energy.” Sinéad O'HartAn enchanting magical adventure set in the wild moors of Dartmoor – the second middle-grade novel from the author of Nevertell .Through the glass, the magic is waiting…Nona and her uncle travel everywhere together, replacing stained-glass windows in war-torn buildings. When a mysterious commission takes them to the lonely moors of Dartmoor, Nona discovers a wild and powerful magic which threatens everything. Can Nona protect those she loves – even if it means fighting darkness itself?A beautifully imaginative and rich adventure about determination, courage and the power of love, set in the aftermath of World War Two. Perfect for fans of Abi Elphinstone, Sophie Anderson and Catherine Doyle.Praise for Glassheart :\"Orton's fantastical world is creepily drawn ; even better is her understanding of grief, suffering and healing.\" Observer“ Rich and atmospheric , Glassheart feels like a long-lost folktale brimming with ghostly magic.” Jennifer Bell“Katharine Orton writes about history as someone who understands it, and about magic as though she could probably do it. Shatteringly good .” Nick Tomlinson\" Glassheart shimmers with magic and adventure ... A story that left a sparkling splinter in my soul.\" Damaris YoungPraise for Nevertell :“This is fantasy at its best .” Daily Telegraph“A coming-of-age tale that’s compelling, exciting and as chilling as the snow-bound landscape in which it is set.” Financial Times“Readers will be captivated … A magical, snowy adventure perfect for winter nights.” BookTrust“Featuring themes of bravery, friendship, sorcery and survival, this beautifully written story is ideal for fans of magical adventure tales.” The Week Junior“A tale that sparkles with frosty magic.” Thomas Taylor“Orton's use of language is masterful and her vivid descriptions bring the journey to life … Perfect to snuggle up with on a winter's afternoon.” ReadingZone“It’s an unusual juxtaposition – the harsh world of political prisoners in a forced labour camp versus one of ice castles, spirit children and giant eagles. Katharine Orton pulls it off brilliantly .” The Bookseller",
  "genres": [
    "Middle Grade",
    "Fantasy",
    "Historical Fiction",
    "Paranormal",
    "Young Adult",
    "Childrens",
    "Historical"
  ],
  "author": "Katharine  Orton",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/55138936-glassheart"
}