{
  "title": "A Kaleidoscope of Stories - Muslim Voices in Contemporary Poetry",
  "description": "'A Kaleidoscope of Stories is a volume to celebrate in the world of poetry. Never before have so many Muslim voices in contemporary poetry been collected in the same place. It’s a powerful contribution to the poetry scene.'- William SieghartFounder of the Forward Prizes for Poetry and National Poetry DayAuthor of The Poetry PharmacyThe poets in this anthology are seekers, teachers, artists, parents, activists and much more. From every continent and spanning generations, their collective experiences appear in verses of love, devotion, grief and healing, as they take us on a journey through cityscapes and the natural beauty of the world we live in. Through their insights and inspirations we find ourselves in London, New York, Istanbul, Fez, Damascus and Makka, in mosques and at sacred sites, in deserts, mountains, and under towering redwoods, in heart-opening moments of connection. Their poetry navigates all the seasons of life, reflecting and meditating through their outward and inward pilgrimages upon our relationships to those around us and to the Divine. A KALEIDOSCOPE OF STORIES – Muslim Voices in Contemporary Poetry brings together the myriad voices of eighty Muslim poets from diverse backgrounds to powerfully articulate what it means to be Muslim in the modern world. It provides a platform for Muslim voices to be heard speaking about their experiences in their own words, and offers an antidote to the stereotyped, one-dimensional portrayal of Muslims we see so often in the media.The anthology gives the reader a glimpse of the thoughts, hopes and challenges of those who see the world through two or more cultural lenses, and provides an authentically Muslim space for the expression of our spiritual, social and personal lives. It brings together the verses of multi-generational voices exploring themes including love and loss, identity and belonging and Islamic spirituality.Half of the profits from this publication will go to charity to provide food and clean water to those in need.'This stupendous kaleidoscope of contemporary Muslim poetry transports the reader vertically and horizontally through a constellation of scintillating worlds that stretch and extend the imagination. Every voyage leads to deeper faculties of perception and feeling and a fuller sense of what it means to be a human being seeking meaning, purpose, wonder and wisdom.By bringing together this extensive collection of poems, Lote Tree Press has rendered a tremendous service to present and future generations of reflecting hearts and minds.'- Luqman AliArtistic Director of Khayaal Theatre Company'A Kaleidoscope of Stories takes you on a journey of contemporary voices of emerging experiences, reflections and musings, primarily from a Western Muslim perspective. There are the voices of wisdom such as the late Abdal-Hayy Moore and Abdalhamid Evans and the more youthful Raqaya Esime Fetuga. Then there are those who travel the tightrope of diversity, difference and change, and of course many of the poems reflect the deeply felt spiritual journeys that come both with elation, longing and even pain… This collection is about the here and now, the people who have followed the same paths as you, who struggle with the same struggles and who have opened their hearts in verse. I think the variety of experiences reflected in the collection will appeal to different moods and will resonate in particular with those, like me, who are not so able to put similar feelings down on paper… As my late husband would often say those that we consider to be classical writers today such as the Shakespeares and the John Donnes or the Hafiz and Rumi were in their day contemporaries of their time, space and context writing what they saw, felt and experienced. The future classical poets, writers and Muslim commentators are emerging right now and it is so exciting to witness it.'- Humera KhanAn-Nisa Society‘This 532 page anthology is comprised of poems from 80 mostly contemporary Muslim poets writing in English and from a few pioneers who have left this transitory realm, such as our dear brother, Daniel Abd al-Hayy Moore رحمه الله. One of the ground-breaking features of this unique anthology is that about half of its contributors are women … This should be among the required texts for classes in contemporary Islam and transnational literature.’- Dr. Alan ʿAbd al-Haqq Godlas, Associate Professor of Religion, University of Georgia'The editors of this edition, and the poets within its pages, are to be commended for allowing those of us whose tongue is English to receive a drink from the cup of unity and eternal love.' - Baraka Blue, Poet, Director of Rumi Center for Spirituality and the Arts",
  "genres": [
    "Poetry",
    "Nonfiction"
  ],
  "author": "R.S.  Spiker",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/55131697-a-kaleidoscope-of-stories---muslim-voices-in-contemporary-poetry"
}