{
  "title": "The Public Speaking Bible; a Survival Guide for Standing on Stage",
  "description": "The Public Speaking Bible; a Survival Guide for Standing on Stage is a depository of essential speaker’s knowledge designed to further your career whether you aim to be a full time speaker, undertake management roles or simply wish to improve your voice and stage presence. All the tips within come via the author and guest performers, adding up to a combined three hundred years of essential speakers’ know-how!Within this bible:Technical advice: how to effortlessly project your voice, audience manipulation, crowd control, body language, hand gestures and more.Additionally: a frank approach for overcoming stage fright, a foolproof recipe for memorising a speech, how to overcome a sore throat and using the physics of sound to your advantage.Business advice: how to price your speech, approaching agencies, talking overseas, understanding unique selling points, the most complete list of global public speakers’ agencies and more.Children’s author Marcus Alexander, once horrified by the thought of standing on stage, has grown to become one of the most sought-after school speakers. He’s delivered more than 1600 talks in 13 different countries and is booked 18 months in advance. The journey wasn’t easy; he’s tripped, fallen and blundered over every imaginable obstacle. This bible contains all the insights you need to create a similar career at a faster rate and with half the hiccups.'Marcus doesn't just hold the stage he is the stage. Every word spoken is a sledge hammer pinning the audience to their seats.'Adisa the Verbaliser, spoken poet and author.'The first time I saw Marcus Alexander on stage was with a group of other authors. We all watched in amazement as he enthralled both the children and adults with his awesome energy. One of the best author events I have watched.'Andy Briggs, author and scriptwriter.Guest speakers sharing their advice include: best-selling author Chris Bradford, movement icon Dan Edwardes, British actor and producer Joey Ansah, author and teamwork specialist Casper Craven. Other guests include: surgeons, dentist lecturers, thespians, West End singers, polio advisers, educators and coaches.",
  "genres": [
    "Self Help",
    "Business",
    "Communication",
    "Personal Development",
    "Entrepreneurship",
    "Nonfiction",
    "Social"
  ],
  "author": "Marcus Alexander",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/55151129-the-public-speaking-bible-a-survival-guide-for-standing-on-stage"
}