{
  "title": "Count the Ways",
  "description": "In her most ambitious novel to date, New York Times bestselling author Joyce Maynard takes on the story of a family from the hopeful early days of young marriage to parenthood, divorce, and its costly aftermath—to illuminate how the mistakes of parents are passed down through generations to fester, or to be healed. After falling in love in the last years of the 1970s, Eleanor and Cam follow their dream of raising three children on a New Hampshire farm. Theirs is a seemingly idyllic life of summer softball games and Labor Day cookouts, snow days and skating on the pond. But when a tragic accident permanently injures the family’s youngest child, Eleanor blames Cam. Her inability to forgive him leads to a devastating betrayal: an affair with the family babysitter that brings about the end of their marriage.Over the decades that follow, the five members of this fractured family—and the many others who make up their world—make surprising discoveries and decisions that occasionally bring them together, and often tear them apart. As we follow the family from the days of illegal abortion and the draft through the early computer age, the Challenger explosion, the AIDS epidemic, the early awakenings of the #MeToo era, and beyond, through the gender transition of one of the children and another’s choice to cease communication with her mother, we witness a family forced to confront essential, painful truths of its past and find redemption in the face of unanticipated disaster.With endearingly flawed characters and a keen eye for detail, Joyce Maynard transforms the territory she knows best—home, family, parenthood, love, and loss—into the stuff of a page-turning thriller. In this achingly beautiful novel, she reminds us how great sorrow and great joy may coexist—and frequently do.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Contemporary",
    "Family",
    "Book Club",
    "Literary Fiction"
  ],
  "author": "Joyce Maynard",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/55177032-count-the-ways"
}