{
  "title": "Catullus. Tibullus. Pervigilium Veneris",
  "description": "Catullus (Gaius Valerius, 84–54 BCE), of Verona, went early to Rome, where he associated not only with other literary men from Cisalpine Gaul but also with Cicero and Hortensius. His surviving poems consist of nearly sixty short lyrics, eight longer poems in various metres, and almost fifty epigrams. All exemplify a strict technique of studied composition inherited from early Greek lyric and the poets of Alexandria. In his work we can trace his unhappy love for a woman he calls Lesbia; the death of his brother; his visits to Bithynia; and his emotional friendships and enmities at Rome. For consummate poetic artistry coupled with intensity of feeling Catullus's poems have no rival in Latin literature.Tibullus (Albius, ca. 54–19 BCE), of equestrian rank and a friend of Horace, enjoyed the patronage of Marcus Valerius Messalla Corvinus, whom he several times apostrophizes. Three books of elegies have come down to us under his name, of which only the first two are authentic. Book 1 mostly proclaims his love for 'Delia', Book 2 his passion for 'Nemesis'. The third book consists of a miscellany of poems from the archives of Messalla; it is very doubtful whether any come from the pen of Tibullus himself. But a special interest attaches to a group of them which concern a girl called Sulpicia: some of the poems are written by her lover Cerinthus, while others purport to be her own composition.The Pervigilium Veneris, a poem of not quite a hundred lines celebrating a spring festival in honour of the goddess of love, is remarkable both for its beauty and as the first clear note of romanticism which transformed classical into medieval literature. The manuscripts give no clue to its author, but recent scholarship has made a strong case for attributing it to the early fourth-century poet Tiberianus.",
  "genres": [
    "Poetry",
    "Classics",
    "Fiction",
    "Language",
    "Ancient History"
  ],
  "author": "Catullus",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/551650.Catullus_Tibullus_Pervigilium_Veneris"
}