{
  "title": "Tinderbox: How the West Sparked the AIDS Epidemic and How the World Can Finally Overcome It",
  "description": "In this groundbreaking narrative, longtime Washington Post reporter Craig Timberg and award-winning AIDS researcher Daniel Halperin tell the surprising story of how Western colonial powers unwittingly sparked the AIDS epidemic and then fanned its rise. Drawing on remarkable new science, Tinderbox overturns the conventional wisdom on the origins of this deadly pandemic and the best ways to fight it today. Recent genetic studies have traced the birth of HIV to the forbidding equatorial forests of Cameroon, where chimpanzees carried the virus for millennia without causing a major outbreak in humans. During the Scramble for Africa, colonial companies blazed new routes through the jungle in search of rubber and other riches, sending African porters into remote regions rarely traveled before. It was here that humans first contracted the strain of HIV that would eventually cause 99 percent of AIDS deaths around the world. Western powers were key actors in turning a localized outbreak into a sprawling epidemic as bustling new trade routes, modern colonial cities, and the rise of prostitution sped the virus across Africa. Christian missionaries campaigned to suppress polygamy, but left in its place fractured sexual cultures that proved uncommonly vulnerable to HIV.  Equally devastating was the gradual loss of the African ritual of male circumcision, which recent studies have shown offers significant protection against infection. Timberg and Halperin argue that the same Western hubris that marked the colonial era has hamstrung the effort to fight HIV. From the United Nations AIDS program to the Bush administration's historic relief campaign, global health officials have favored well-meaning Western approaches--abstinence campaigns, condom promotion, HIV testing--that have proven ineffective in slowing the epidemic in Africa. Meanwhile they have overlooked homegrown African initiatives aimed squarely at the behaviors spreading the virus.  In a riveting narrative that stretches from colonial Leopoldville to 1980s San Francisco to South Africa today, Tinderbox reveals how human hands unleashed this epidemic and can now overcome it, if only we learn the lessons of the past.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Medicine",
    "Medical",
    "Africa",
    "American History"
  ],
  "author": "Craig Timberg",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/12669736-tinderbox"
}