{
  "title": "Peaches and Schemes",
  "description": "In Anna Gerard's third delightful Georgia B&B mystery, Nina Fleet learns that despite the satin, lace, and buttercream trappings, weddings often prove to be anything but sweet...Nina Fleet might be new to the innkeeping business, but she's savvy enough to know that Cymbeline's tourists aren't enough to keep her fledgling bed and breakfast going. And so, Nina decides to tap into the destination wedding market by taking a booth at the Veils and Vanities Bridal Expo. The twice-yearly event is sponsored by the town's two wedding pros: Virgie Hamilton, the sixtysomething owner of Virgie's Formals, and Roxanna Quarry, a Gen X event planner and Nina's new friend. But everything goes wrong during the expo's fashion show, when Roxanna comes tumbling out of an oversized prop wedding cake, strangled to death by her own scarf.Virgie is arrested for the crime, thanks to Nina's statement to the police about having overheard the woman accusing her partner of embezzlement. Meanwhile, the situation grows tense with her sometimes nemesis and current tenant, the dashing out-of-work actor Harry Westcott. Harry is concentrating on plugging his most recent side hustle ...but he's not too busy to break the news to Nina that her ex-husband is engaged to be married again.Certain that Virgie's only offense is a bad temper, Nina decides to do her own investigating. First, however, she and Harry retrieve Roxanna's now ownerless dog, planning to foster him until a new home can be found. But local gossip soon convinces Nina that others beside Virgie might have had reason to murder Roxanna. As Nina gets close to the truth, she's putting her own life at danger. And when Virgie vanishes after being bailed out of jail by an unknown benefactor, Nina fears that if she can't find the dress shop owner in time, tying the knot will take on a whole new meaning for them both.",
  "genres": [
    "Cozy Mystery",
    "Mystery",
    "Cozy",
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Adult"
  ],
  "author": "Anna Gerard",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/55174825-peaches-and-schemes"
}