{
  "title": "Warrior Girls Do It Standing Up: Your Racy Guide to Create Total Awareness, Empowerment & Prosperity in All Areas of Your Life",
  "description": "You were guided to pick up this book for a reason. Nothing in your life is a coincidence. This edgy guide to creating complete awareness, enlightenment, empowerment, prosperity and growth in all areas of your life, from love and finance to your mental well being, is the last tool you will ever need to finally move forward toward living your very best life - in your truth as your authentic, powerful self - making things happen for you, instead of having things always happening to you. The author will take you on a personal journey from total ruin to total transformation, educating and entertaining you as you learn how to create new insights, perspectives and healthy habits that will change how you create your future. This book was designed to be used as a lifelong resource for anyone who has ever struggled with self worth, fears, doubts, anxiety or worry about the future, or not knowing how to move forward from past hurts and disappointments, or how to break toxic cycles, negative thinking or patterns of behavior that you may not even be aware of, that stagnate you from moving toward the success in life you deserve, no matter any past mistakes or choices you may regret. It will awaken something inside that allows the reader to see themselves, their connections and the world that surrounds them in a very different and healing light, in a way that breaks down your past to build a better understanding of why you are not yet living your desired life and provide clarity as to how to transform your mindset once and for all in order to learn how to align the actions you take in your life from now on, toward your highest good, while learning how to create stability, balance and peace within your mind - even for those who have struggled with a chaotic mind or letting go of obsessive thinking or control their entire life. The author writes with a racy, \"no holds barred\" style, providing you with entertaining shock value as valuable, in-depth, life lessons are given. Surely to leave you wanting more, it's guaranteed to be the next book you just cannot put down. And possibly the book that can change your life, light a fire inside you and catapult you into living as the very best, most successful version of yourself, in true happiness, fulfillment, love, financial abundance and inner-peace.",
  "genres": [],
  "author": "J.K. Despot",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/55197342-warrior-girls-do-it-standing-up"
}