{
  "title": "Adoption: What You Should Know",
  "description": "What You Should Know has been divided into four short, easy-to-read sections, revealing the making of the global system throughout time, starting in Europe, America, South Korea (Asia), and today finally, in Africa. Learn how religious folks, like Harry Holt (1954), spearheaded overseas adoption programs that have exploded into a worldwide in-demand phenomenon but blatantly ignore inherent and natural human rights (aka God's laws) for patriarchal and evangelical dreams and continue to violate the correct interpretation of the United Nations Convention on the Rights of the Child (UNCRC).Most of us have heard the positive side of international adoption in the United States. Clips of children being sent into the arms of loving Americans can be found all over the internet. But did you know that in other parts of the world, the indigenous and less fortunate communities view overseas adoption as a violation of their natural, inherent, and God-given rights to family and community? Gain a bird's-eye view of the hidden side of the practice here.Not many of us would wish for a new identity to live by and then be removed from our sisters and brothers--never legally permitted to contact them again--even upon our deathbeds. Manufactured adoption laws rooted in \"the right to commodity children\" consist of many governmental and religious red tape overseas adoptees are forced to contend with even into their elder years because of the fierce advertising campaigning of adoption agencies to convince the public to fall in love with their secretive profitable activities.The pioneers who built and profited from the industry continue to deny adoptees access to documents that could lead them back to their families. This book protects you against adoption profiteers and traffickers who profess God is on their side. It summarizes the inception and expansion of the adoption industry, focusing on its roots and consequences kept from public awareness. Discover the history of adoption from another angle--a view adoption agencies will never tell you. The findings have been called mind-blowing!Inspired by a Haitian adoptee who died of heart failure after learning that he had been trafficked to France for overseas adoption but was never able to acquire justice due to the public's love affair with the practice. The author co-founded Adoption Truth & Transparency Worldwide Information Network (ATTWIN), an adoptee-led forum rooted in equal rights for adoptees. ATTWIN refuses to accept any funding from the lobbying efforts of profitable multi-million dollar adoption agencies. The co-founders are adopted people and are affiliated politically as \"Independents.\" This book is NOT recommended for adoption profiteers, anti-abortion fundamentalists, evangelicals, or individuals against equal rights for adult adoptees.*For universities and institutions, this book is titled Adoption An Adoptee's Research into Child Trafficking and is available in hardcover",
  "genres": [
    "Adoption",
    "Social Issues"
  ],
  "author": "Janine Myung Ja",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/55190613-adoption"
}