{
  "title": "Yesterday's Demon",
  "description": "“Can yesterday’s demon be the hero of today?”\n** Yesterday’s Demon is book 3 in the Sharpest Kiss series, but it can be read as a stand-alone story. **\nShe’s got a talking dog, a magic rock, a supernatural mystery to solve, and a hot friend determined to make her his.Can an ex-vampire girl find love and redemption after more than nine centuries of iniquity…or will her dark secret doom everything she’s ever longed for?\nMarta has a big secret. She may look like a teenager, but she’s really almost a thousand years old.For centuries, she existed as a vampire, but now she’s just a normal human girl again, stripped of all her supernatural powers and many of her memories. But whether she remembers it or not, she knows she used to be a monster. She did a lot of horrible things in her past. She’s determined to spend what’s left of her human life trying to make amends by helping other people in trouble, especially in cases where her knowledge of the paranormal might come in handy. When her friend Harris calls on her, asking for her help finding his college roommate’s missing sister, Marta agrees to open an investigation. Dark magic might be involved in the young girl’s disappearance, but Marta’s confident she can unravel the case; she knows a few spells herself, and she’s got an enchanted talking dog and a psychic stone to help her out. What worries her most is the brand-new set of human hormones raging through her system, making it next to impossible to keep things with Harris strictly platonic. Marta may have made the mistake of locking lips with Harris once or twice before, but she knows it’d be wrong to ever let it happen again—and certainly to take things any further. Her past is just too ugly, and her new life is too bizarre and dangerous. Harris is better off staying far away from her. If only he didn’t seem so intent on doing just the opposite. And if only his piercing green eyes and sultry kisses weren’t so incredibly irresistible…MORE ABOUT THE BOOK:\n\nYesterday’s Demon is a complete novel of 80,000 words. \n  \n\n   It is narrated in third person from Marta’s point of view. \n  \n\n   It is Book 3 in the Sharpest Kiss series but can be enjoyed as a stand-alone story.",
  "genres": [],
  "author": "Elizabeth Myles",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/55197927-yesterday-s-demon"
}