{
  "title": "Showdown: The Inside Story of How Obama Fought Back Against Boehner, Cantor, and the Tea Party",
  "description": "The veteran political journalist and New York Times bestselling author goes behind the scenes at the White House to recount the dramatic tale of a pivotal period in the Obama presidency, from the game-changing 2010 midterm elections to the beginning of the critical 2012 campaign season—a tumultuous time that tested the president as never before and set the stage for a titanic clash over the future of the nationAfter Barack Obama's first two years as president—during which he navigated the United States through its severest economic crisis since the Great Depression while managing wars in Afghanistan and Iraq—he was faced with a bitterly divided nation and an emboldened political opposition dedicated to impeding his presidency. What followed was a year of political crises and fierce battles that would transform Obama and profoundly shape the terrain for the next election.In Showdown, astute political journalist David Corn chronicles and examines this crucial time in the Obama presidency and its impact on the nation's future. Drawing on interviews with White House officials, Obama's inner circle, members of Congress, and others, Corn takes the reader into the Oval Office and the back rooms on Capitol Hill for a fast-paced and gripping account of the major events as they unfolded: the controversial tax-cut deal with Congress in December 2010; the repeal of Don't Ask/Don't Tell; the passage of the New START treaty; the near shutdown of the government in early 2011; the revolutionary Arab spring; the killing of Osama bin Laden; the intense, high-wire debt-ceiling negotiations (in which intransigent House Republicans risked the nation's financial standing); House Speaker John Boehner's erratic maneuvers during the rise and fall of the grand bargain; and the face-off between Obama and congressional Republicans over how best to create jobs.Corn captures the dilemmas faced by a president assailed by disappointed progressives and defiantly obstructionist Republicans determined to see his defeat. Here is a chief executive trying to balance the cross-cutting demands of governance and politics while handling unending challenges at home and abroad. The book reveals a thoughtful leader with a cool head who is unafraid to take risks and make tough choices, a steely battler who successfully turned his enemies' obstinacy to his advantage. Obama has often frustrated supporters, but Corn shows how the president, who often puts pragmatism ahead of partisan demands, has craftily operated within a hostile conservative political climate, looking to win the long game, achieve progressive goals, and, ultimately, win reelection.A vivid and powerful account of White House decision-making, Showdown offers a unique and enlightening look at the turbulent American political scene during one of the most consequential moments of the nation's history, and explains the fascinating and complicated leader at the heart of this vortex.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "United States",
    "Biography",
    "American History",
    "Presidents"
  ],
  "author": "David Corn",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/12669812-showdown"
}