{
  "title": "Crossing",
  "description": "Irish-born Johnny Flynn, a former British soldier, is banished from his homeland and sent to America on a ship so riddled with disease that he realizes the voyage was meant to murder him. When he survives the trip, the captain forces him to walk the plank into the Hudson River. Miraculously, Johnny is rescued by a rum running Irish gang, the Swamp Angels, and given a job running whisky in Hell's Kitchen just as Prohibition makes liquor a hugely profitable, dangerous business. Fighting for his life and livelihood amid the denizens of the Manhattan piers, Johnny is plagued by the memory of his lost lover, Nora, whose father, the famed Irish revolutionary, James Connolly, met his death through a firing squad that included a reluctant gunman named Johnny Flynn. Nora's last words to him, when she learned of his betrayal and left him, \"I love you, Johnny Flynn\", echo in his heart, leaving him pulsing with guilt, yearning, and the hope that she might yet forgive him. Johnny drinks hard. One night, drunk on the floor of Hailey's speakeasy, he encounters a seeming apparition on stage, the ghostly Esme, an Irish singer who suffered unspeakable horrors at the hands of the British Black and Tans. Johnny is dazzled by her. She is not only a singer but a healer, teaching poor and afflicted children to sing and gather hope at an old theater called The Woebegone. From Esme Johnny learns how to overcome the desire for revenge, only to discover that she, too, clings to her own dark dream of retribution. Hell's Kitchen, Johnny discovers, is thronged with people whose damaged hearts ache for revenge, repentance and love. As he grapples with taking responsibility to help others resolve this overwhelming dilemma, he learns that Nora is coming to New York to advocate for Irish independence. As he confronts her and soon thereafter receives a piercing love letter from Esme, the story comes to a turbulent climax. \"The Crossing\" by Ashby Jones is a powerfully written and memorable love story set in Manhattan's Hell's Kitchen during Prohibition and dealing with the reconciliation of love and guilt, grief and promise. Deftly combining history, fact, surrealism, and reality into an 'ever-recycling boost of the human spirit', \"The Crossing\" is a compelling page turner of a read from start to finish and will prove to be a welcome and appreciated addition to community library collections in general, and the personal reading lists of romance and suspense fans in particular.",
  "genres": [
    "Fiction"
  ],
  "author": "Ashby Jones",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/55183433-crossing"
}