{
  "title": "Anarchism and Other Essays",
  "description": "Emma Goldman is often depicted in current academic discourse as a mere prototypical feminist and socialist. Yet this collection of essays by Goldman reveals that she often expressed ideas which many of her present day admirers might find surprising and unsettling. She distrusted the proletariat, wrote disdainfully of the early feminists who were her contemporaries, and even expressed scepticism of women's suffrage. Goldman was an admirer of Nietzsche and in many ways represents a model of a superior individual who is capable of rising above the herd instincts of the masses and embracing confrontation with danger. She never hesitated to countenance both the ire of public authorities and the scorn of public opinion. As contemporary anarchists have fallen into the mundane habit of politically correct conformity, a full examination of Goldman's thought suggests the need for a new anarchism that reflects the martial spirit of which Goldman was an exemplary.Emma Goldman is often depicted in current academic discourse, and the “Left” in particular, as a role model for feminists and a champion of the proletariat. Keith Preston however in reviewing each chapter of Goldman’s most famous work “Anarchism and Other Essays” reveals that Emma Goldman often expressed ideas which many of her present day admirers will find surprising and unsettling. He highlights the fact that Emma Goldman distrusted the proletariat, wrote disdainfully of the early feminists who were her contemporaries, and expressed scepticism of women’s suffrage.Keith Preston maintains that Emma Goldman can only be really understood by recognising her admiration for the ideas of the German philosopher Friedrich Nietzsche (an admiration that she shared with Adolf Hitler and the National Socialists). He argues that Emma Goldman (as with Nietzsche’s “Zarathustra”) represents a model of a “superior individual” who is capable of rising above the herd instincts of the masses - one who never hesitated to countenance both the ire of public authorities and the scorn of public opinion. Politically correct she was not.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Philosophy",
    "Feminism",
    "Essays",
    "Theory",
    "History"
  ],
  "author": "Emma Goldman",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/551926.Anarchism_and_Other_Essays"
}