{
  "title": "Conspiracy in the Streets: The Extraordinary Trial of the Chicago Seven",
  "description": "THE TRIAL THAT IS NOW A MAJOR MOTION PICTUREReprinted to coincide with the release of the new Aaron Sorkin film, this book provides the political background of this infamous trial, narrating the utter craziness of the courtroom and revealing both the humorous antics and the serious politics involvedOpening at the end of 1969--a politically charged year at the beginning of Nixon's presidency and at the height of the anti-war movement--the Trial of the Chicago Seven (which started out as the Chicago Eight) brought together Yippies, antiwar activists, and Black Panthers to face conspiracy charges following massive protests at the 1968 Democratic National Convention in Chicago, protests which continue to have remarkable contemporary resonance.The defendants--Rennie Davis, Dave Dellinger, John Froines, Tom Hayden, Abbie Hoffman, Jerry Rubin, Bobby Seale (the co-founder of the Black Panther Party who was ultimately removed from the trial, making it seven and not eight who were on trial), and Lee Weiner--openly lampooned the proceedings, blowing kisses to the jury, wearing their own judicial robes, and bringing a Viet Cong flag into the courtroom. Eventually the judge ordered Seale to be bound and gagged for insisting on representing himself. Adding to the theater in the courtroom an array of celebrity witnesses appeared, among them Timothy Leary, Norman Mailer, Arlo Guthrie, Judy Collins, and Allen Ginsberg (who provoked the prosecution by chanting \"Om\" on the witness stand).This book combines an abridged transcript of the trial with astute commentary by historian and journalist Jon Wiener, and brings to vivid life an extraordinary event which, like Woodstock, came to epitomize the late 1960s and the cause for free speech and the right to protest--causes that are very much alive a half century later. As Wiener writes, \"At the end of the sixties, it seemed that all the conflicts in America were distilled and then acted out in the courtroom of the Chicago Conspiracy trial.\"An afterword by the late Tom Hayden examines the trial's ongoing relevance, and drawings by Jules Feiffer help recreate the electrifying atmosphere of the courtroom.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "True Crime",
    "American History",
    "Biography",
    "Law"
  ],
  "author": "Jon Wiener",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/55183795-conspiracy-in-the-streets"
}