{
  "title": "Legend of the Horizon Vengeance",
  "description": "“You have the weary look of someone who’s always been in the service of someone else. I know this to be true because you left the war to the north. You didn’t choose a side, but you didn’t flee, either. You’re simply… tired of the shackles. That sort of weariness is not something that needs to be forgiven, Mr. Mahoney. It is the irrefutable clue to the underlying independence a restless mind is starving for....\"A year following The Battle of New Canterton, Rancid Mahoney, now wandering in exile and in search of purpose, answers the call of an old mentor and surrogate father figure, Frank Delmont, who has embarked on his own quest for redemption since his retirement from Gunther Ostrander’s vicious shadow.With the war to the north incinerating the lands behind them, the two take to the sea aboard The Moonlady in search of the only other known two remaining members of the Delmont Family: Plath and Wyatt, Frank's brother and son respectively. But all is not well in the Woodstar Triangle, the maritime trade routes that used to be known as The Caribbean Sea. A different sort of conflict has been brewing in the southern waters. Val Remo, Empress of Woodstar City, and Mahoney's biological mother, has been confronted with her most challenging tribulation yet. Plaguing the Empress' rule are the bloodthirsty, relentless Mantle of Fire, a fleet of pirates priding themselves with decades of unchallenged bloodshed, and Chief Zao of the Black Boar Tribe, emerging from the northern war to hunt down Tuskatawa deserters and their sympathizers alike.As \"guests\" of the Empress at Morro Castle, a fortress carved out of the ruins of Old Havana, Mahoney and Frank are presented with a double-edged sword. Remo demands that Wyatt Delmont be brought back to her so that he may answer for his crimes of rebellion, insurrection, and most of all, stealing the Horizon Vengeance : Val Remo’s prized war vessel that has a story of its own beginning before Mahoney was born. To ensure her demands do not go unanswered, Remo sends along with Delmont and Mahoney the captain of the Igneous Reef, Sebastian “The Anvil” Longbar, a man feared for his brutal habit of feeding unruly crew members and prisoners to his pet, Celeste, a monstrous bear living in a cage deep in the bowls of his ship.An expedition to reunite a family divided will clash with a conquest to overthrow an empire, and Rancid Mahoney will be forced to decide between family over principle, and self over fate.Legend of the Horizon Vengeance is BOOK II in THE TWO REVOLVERS SAGA.",
  "genres": [],
  "author": "Dave Matthes",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/55203093-legend-of-the-horizon-vengeance"
}