{
  "title": "Operation Pedestal: The Fleet That Battled to Malta, 1942",
  "description": "Renowned historian Max Hastings recreates one of the most thrilling events of World War II: Operation Pedestal, the British action to save its troops from starvation on Malta—an action-packed tale of courage, fortitude, loss, and triumph against all odds.In 1940, Hitler had two choices when it came to the Mediterranean region: stay out, or commit sufficient forces to expel the British from the Middle East. Against his generals’ advice, the Fuhrer committed a major strategic blunder. He ordered the Wehrmacht to seize Crete, allowing the longtime British bastion of Malta to remain in Allied hands. Over the fall of 1941, the Royal Navy and RAF, aided by British intelligence, used the island to launch a punishing campaign against the Germans, sinking more than 75 percent of their supply ships destined for North Africa.But by spring 1942, the British lost their advantage. In April and May, the Luftwaffe dropped more bombs on Malta than London received in the blitz. A succession of British attempts to supply and reinforce the island by convoy during the spring and summer of 1942 failed. British submarines and surface warships were withdrawn, and the remaining forces were on the brink of starvation.Operation Pedestal chronicles the ensuing British mission to save those troops. Over twelve days in August, German and Italian forces faced off against British air and naval fleets in one of the fiercest battles of the war, while ships packed with supplies were painstakingly divided and dispersed. In the end only a handful of the Allied ships made it, most important among them the SS Ohio, carrying the much-needed fuel to the men on Malta.As Hastings makes clear, while the Germans claimed victory, it was the British who ultimately prevailed, for Malta remained a crucial asset that helped lead to the Nazis’ eventual defeat. While the Royal Navy never again attempted an operation on such scale, Hasting argues that without that August convoy the British on Malta would not have survived. In the cruel accountancy of war, the price was worth paying.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military History",
    "War",
    "Military Fiction",
    "Audiobook"
  ],
  "author": "Max Hastings",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/55200686-operation-pedestal"
}