{
  "title": "Run and Hide",
  "description": "They walk the earth, their bite a sentence worse than death. Allow them too close and they will not hesitate to tear you from life and curse you to bear the infection alongside them. The lucky ones do not escape their bite and instead become the meal. The unlucky suffer for eternity.I cannot allow myself to be bit. I cannot allow myself to be torn from life. No matter how easy it may be to surrender to the pain and horror of this new life, to willingly walk into oblivion, the boys rely on me. To care for them, to keep them safe.The dead walk the earth aimlessly, driven by a primal need to feed. We—the living—walk the earth just as aimlessly, driven by a desire to survive. To carve out the smallest amount of safety and comfort wherever we can find it.It is nearly impossible to find anywhere that is not haunted by death and grief and terror. But we keep searching, unwilling to let go of the last sliver of hope clutched so tightly in our hearts. Into the woods we disappear, traveling only in the daylight, where we are certain we can see them coming for us. But one of my boys is sick, and I have no choice but to keep pushing them into the night, searching for food, safety, and something now more coveted than anything else in this world. Medicine.When we stumble upon the camp to see the three men sleeping by the fire, desperation takes over and I cannot help myself. We try and take from them. We are all thieves now. It’s the only way to survive. We take what we need from anyone weaker than ourselves.Only my desperation has clouded my judgment. These men are not weak. They are bigger than me, harder than me, quicker to act on their baser instincts.They catch us. They catch me, and now we have something they need. Something he needs.Cuffed to his wrist, he will not let me go until he’s dragged me through hell and back again. But I’m not so easily contained. I fight back every mile of our journey, meeting his iron will with my own. Hate and lust battling inside me.The world around us piles on obstacle after horrific obstacle. Forcing us closer together. By the time we reach our destination my heart is more tightly entwined with his than the metal cuffing our wrists. And when Ren finally releases me, I don’t run from him, I chase after him.My name is Charlotte.His name is Ren.I hated him. He couldn’t stand me. He wanted my body just as strongly as I wanted his. Having allowed the desire coursing through my veins for him to rule my emotions, that hate has steadily rolled out like a tide, a stronger more terrifying emotion rolling through with the power of a tsunami.He’s dragged me through hell and back again and I’ll be damned if I‘ve gone through it all only to watch him kill himself trying to save me.Run and Hide is a dystopian romance that ends in a cliffhanger. It can be read on its own but it is HIGHLY recommended that you read the series from the beginning, starting with Defy the Ravaged.Warning: For Readers 18 years and older. Contains explicit sexual situations, possible triggers, dark themes, language, and violence.",
  "genres": [
    "Dystopia",
    "Zombies",
    "Romance",
    "Apocalyptic",
    "Post Apocalyptic",
    "Enemies To Lovers",
    "Suspense"
  ],
  "author": "E.M. Raegan",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/55182316-run-and-hide"
}