{
  "title": "Unstuck: How to Unlock and Activate the Wisdom of Others",
  "description": "Many industries worldwide are stuck as they struggle to survive and grow. Stuck businesses do not react, pivot and redirect, which can be catastrophic. In Unstuck, Craig Lemasters shares techniques he has used in a lifetime of helping Fortune 500 companies fill their knowledge gaps--using reciprocity, strategic planning, rapid cycle learning and make-it-happen coaching through direct connections with enlightened resources.The wisdom in this book is for far more than Fortune 500 executives. \"We all get stuck sometimes,\" writes futurist Rita J. King in her Introduction to the book. Community leaders, teachers, networkers, entrepreneurs--and anyone who works with others in companies and organizations--will find powerful tools in these pages.Craig makes that promise in his dedication page: \"to everyone who feels stuck.\" He addresses all of us throughout the book.Why is this book timely? Because leaders are facing more disruption and seemingly insurmountable barriers than ever before. In the opening pages, Craig writes: \"For most of human history on this planet, change has consistently been gradual. ... Now, change has accelerated so rapidly that it poses a formidable challenge to the acquisition of timely knowledge, let alone accumulating the depth and range of knowledge needed to get ahead of change. My goal, and my full-time vocation, is to meet leaders in that moment of stuck and share a way to get unstuck.\"This book is divided into two sections. Part 1 is \"Stuck,\" because getting unstuck depends on clearly understanding the complex forces leaders are facing. In this section of the book, Craig draws on his own experience as a Fortune 500 CEO leading digital transformation. Readers learn the symptoms to look for when organizations are getting stuck, how expectations differ from reality and how our internal bank of wisdom may not be broad enough to meet emerging challenges.Part 2 is \"Unstuck,\" which is possible once an organization has diagnosed the problem. Readers learn about defining and filling knowledge gaps in an organization and many other practical techniques for leading teams and connecting with others, both locally and around the world.When you can acknowledge being stuck, you're ready to overcome it. Craig shares his definition of wisdom and how it can help you overcome the knowledge gaps keeping you stuck. Learn practical techniques for leading teams and connecting with others.",
  "genres": [],
  "author": "Craig Lemasters",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/55189670-unstuck"
}