{
  "title": "Briar Rose",
  "description": "In this modern version of the fairy tale classic, although her dreams are filled with sensual imagery, and she’s often awakened with a throbbing sense of release, Rose has never had a sexual climax—at least, not while conscious. When she’s forced to confess her faked orgasms to her fiancé on the eve of their wedding, she finds herself alone, abandoned and suicidal—until her aunt gives her a business card with the name of a special clinic. Rose has undergone all sorts of physical and mental examinations in the past, but her aunt assures her that this place is “different.” Desperate for a solution, Rose decides to give it one last try, and finds that Dr. Matt, as he insists she call him, is indeed very different from any other person she’s ever met, and he’s determined to get to the bottom of her problem—one way or another. ------EXCERPT: “Rose?” He put down his baggage, she could hear it clatter and thud on the floor. She knew he was probably carrying the portable massage table he had brought the other night and a bag she knew was full of scented oils. She felt more than heard him approach, and she knew exactly how she looked, because there was a mirror on the ceiling and she had seen herself, long blonde hair spread out like a golden field of wheat beneath her shoulders, lips red and swollen and aching to be kissed, the pink nubs of her nipples hard with excitement.“Oh god,” he whispered and she felt his weight shifting the bed, his knee pushing down on the mattress. “You’re so fucking beautiful.”She couldn’t move, couldn’t breathe. His hand moved through her hair, his fingers trailing over her cheek. She felt the heat of his breath on her shoulder, felt the press of his lips against her collarbone, her throat. A soft moan caught in her throat, her eyelids fluttering, her stomach tight with anticipation. Please, oh Matt, please, please… And then he was kissing her, his mouth soft and open, exploring hers. This time she did moan, meeting his growing urgency, her limbs tingling with feeling as she wrapped her arms around his neck, pulling him fully onto the bed. She gasped when he pressed the full weight of his clothed body against hers, feeling the bite of his belt buckle against her navel. Thank god, Matt had given up his white coats for these meetings, coming in jeans and a button-down shirt. “Oh Matt, please,” she whispered, giving voice to her pleas. “I want you so much. I can’t stand it. Please, please, please…” She punctuated each please with a kiss along his throat, her hands already working the buttons of his shirt. “How did you get in here?” he asked again as she peeled off his shirt, delighting in the sight and feel of his bare skin. “Magic,” she whispered, giggling, working on his belt—and he let her. He let her! Not only that, he helped, unzipping his jeans and sliding them down his slim hips. The feel of his cock against her hip—already so hard for her—was all the reassurance she needed. “I want you, Matt. Every bit of you.” He groaned when her hand reached into the flap of his boxers to caress his growing length, dropping his forehead and resting it against her shoulder, letting her touch him. She was already so wet, so ready. She’d skipped dinner and had been here for hours, waiting, anticipating his arrival. “I want your hands, your mouth, your cock.” She slipped her tongue along the shell of his ear, feeling him shiver. Matt cleared his throat, looking at her. “Well, I guess the communication lesson was effective.”“Yes,” she agreed, slipping her hand lower, cupping his balls. “I know exactly what I want.”“Then tell me.” His eyes were bright, his mouth curled into a soft smile.",
  "genres": [
    "Erotica",
    "Romance",
    "Fantasy",
    "Fairy Tales",
    "Paranormal",
    "Short Stories",
    "Retellings"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/12671440-briar-rose"
}