{
  "title": "Christmas at Fireside Cabins",
  "description": "Escape to the idyllic small town of Pinewood Hills in this enchanting romance, about falling in love under the mistletoe with a sprinkle of Christmas magic…For Lila Evans, Christmas is the toughest time of year––a heartbreaking reminder of losing her father, and just how lonely she is… This year, she’s organized a blissful getaway with her closest friends: just the remedy for the December blues.The countryside resort of Fireside Cabins, tucked away in the snowy Tennessee hills, seems like this year’s perfect setting to get into the festive spirit. But it’s far from a winter wonderland––the crumbling cottage is falling apart, and the owner, a widow named Eleanor Finely, confesses that the cabins are on the brink of closure. Lila and her friends should pack their bags right there and then, but Lila can’t bear to leave the tearful elderly woman. She clearly has no one, and Lila, more than anyone, knows how that feels.In search of holiday cheer, the women find a local coffee shop. But the rugged, surly owner Theo Perry has an apparent aversion to Christmas, seeming downright angry when Lila asks for a peppermint latte. No one in the area knows who he is––but it’s clear he’s running from something.Yet there’s more to this small town than Theo’s frosty reception. As much as his coldness infuriates her, Lila can’t deny that on the rare occasions when he does smile, it feels like coming home. Plus, the cabins are just calling for some festive sparkle.And, unexpectedly, Pinewood Hills could hold a new beginning for Lila… But can she save Fireside Cabins in time for Christmas? With a dusting of festive magic, spiced apple cider and sugarplum pie, could this be the first holiday she doesn’t spend alone?",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Audiobook"
  ],
  "author": "Jenny  Hale",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/55229051-christmas-at-fireside-cabins"
}