{
  "title": "Blitz",
  "description": "September, 1940. Three women of the Checquy, the secret organization tasked with protecting Britain from supernatural threats, stand in the sky above London and watch German aircraft approach. Forbidden by law to interfere, all they can do is watch as their city is bombed. Until Pamela, the most sensible of them, suddenly breaks all the rules and brings down a Nazi bomber with her bare hands. The three resolve to tell no one about it, but they soon learn that a crew member is missing from the downed bomber. Charred corpses are discovered in nearby houses and it becomes apparent that the women have unwittingly unleashed a monster. Through a city torn by the Blitz, the friends must hunt the enemy before he kills again. Their task will take them from the tunnels of the Underground to the halls of power, where they will discover the secrets that a secret organization must keep even from itself. Today. Lynette Binns, a librarian with a husband and child, is a late recruit to the Checquy, having discovered only as an adult her ability to electrify everyday objects with her touch. After completing her training, she is assigned to examine a string of brutal murders of London criminals and quickly realizes that all bear the unmistakable hallmark of her own unique power. Unable to provide an alibi and determined to prove her innocence, she flees, leaving behind her family to venture into the London underworld to find answers. But now she is prey, being tracked by her own frighteningly capable comrades. As Lyn fights off powered thugs and her own vengeful colleagues, she will find that the solution to the murders and to the mystery of her own past lies in the events of World War II, and the covert actions of three young women during the Blitz.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Historical Fiction",
    "Science Fiction",
    "Audiobook",
    "Mystery"
  ],
  "author": "Daniel O'Malley",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/55228104-blitz"
}