{
  "title": "Lady Lilias and the Devil in Plaid",
  "description": "Free-spirited Lilias Honeyfield has a secret. She’s certain the rich and powerful Duke of Greybourne is meant to be hers. He just needs to reappear in her life and stop denying his love for her before she’s forced to wed another. Though it’s been seven years, she has never forgotten the beautiful but tormented man hiding behind the mask of moody boy, nor does she believe she imagined the searing passion between them. But the day Nash Steele finally returns to Town, the rogue destroys her hope by claiming he never returned her affection. Nash Steele is haunted by his mistakes and the memories of the impetuous, headstrong beauty who breached his heart and soothed his soul years ago. But innocent Lilias was never meant to be his. And if he ever doubts it, he reminds himself of the tragic accident he caused soon after they met. His life is now, and will always be, one of penance. Unable to have the one woman he wants, the easiest thing to do is to flee. So when duty eventually forces him home, he intends to keep his distance from the ravishing creature. Yet when danger threatens her, he cannot sit by and allow her to be harmed. Every moment in her presence is sweet torture, and soon the need he has kept caged for years refuses to be contained any longer. Swept together by burning desire but ensnared in a tangle of secrets and guilt, Lilias and Nash must fight to turn tragedy into triumph and the past that threatens to destroy them into the very thing that heals their hearts. Lady Lilias and the Devil in Plaid is a witty and wild romance featuring a lovestruck guilt ridden rogue, a free-spirited Gothic romance novel loving heroine, meddling good intentioned friends, and schemes aplenty. It stands alone and includes blazing chemistry and a guaranteed happily ever after.",
  "genres": [
    "Historical Romance",
    "Historical"
  ],
  "author": "Julie Johnstone",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/55217028-lady-lilias-and-the-devil-in-plaid"
}