{
  "title": "Cody",
  "description": "Sara knew Cody was up for making her spying ex-boyfriend jealous. What she didn't count on was wanting more from him than their carefully timed, on-camera action...Even though I visit Last Call to see my grandparents every year, this time feels different. Maybe it’s because of Nan's Alzheimer's. Or because I’m trying to keep the disaster of my last relationship firmly in the past where it belongs, though my ex, Roger, makes that difficult when he’s tracking my every move.It could also be the fact that Cody, the local playboy-turned-firefighter, has been helping my grandparents with chores on their farm, and it’s… distracting. In a welcome way. I am not a girl who turns down help, especially when it’s hot, blond, and standing in my doorway.With Cody happy to help me prove my creepy ex has bugged my laptop, he and I decide to put on a not-safe-for-work show. Or three. Just enough teasing to get a reaction—recorded evidence that Roger’s broken the law.I know. I know. It seems like a good idea... At first.Beyond our mutual lapse in judgment, Cody’s actually more than just a really sexy friend with benefits. He’s a good friend, period. He knows what it’s like to be alone, to have to re-learn how to trust other people.People like me. Cody is someone who wouldn’t let anyone use me like I’ve been using him.Crap.Series Description: In the midst of rumors, secrets, and lies, twenty-somethings traverse friendships and find love in the cozy, fictional town of Last Call, Virginia. Each book follows a different heroine and her love interest, offering memorable heat, endearing men, interconnected standalone plots, and a HFN/HEA.◆Professionally edited by Faith Williams of the Atwater Group.◆18+ due to mature content and \"open-door\" scenes with enough heat to melt your socks off.Triggers: Domestic abuse, Alzheimer's, Internet stalking, anxiety.",
  "genres": [],
  "author": "R.V. Asher",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/55217295-cody"
}