{
  "title": "Don't Overthink the Application Said: A Short Story Collection",
  "description": "Ten science fiction stories about the evolution of technology and where it might lead humanity.From techno-thriller to the possibilities of digital romances, from criminal AI's to the loss of one's world to the augmentation of reality, this anthology of science fiction stories explores a very possible vision of tomorrow, where complete digitalization has become part of our everyday life.Rooted deeply in today's emerging technologies this anthology of speculative fiction tells ten stories about a very possible world of tomorrow. Why care about the future? Because we cannot escape it!A hacker who must find out who perverted his greatest creation into a murder weapon (Decypher Me), a dealer of body modification who must negotiate for his life with a former customer (The Art in Artificial), a woman playing a dangerous game of augmented reality where damnation is the only thing that is for certain (Repent, my App Demon said), a man who receives therapy by an app for his break-up with his girlfriend (Don't Overthink the Application said), an impossible crime that leads to an even more impossible criminal (Chainbreaker), an island holding a deadly secret (The Specs are all right), a Hotel AI that turns into a criminal (Orchard Oriental Hotel), an interview with a CEO who made racistic vigilantism a scalable business model (Remember the Prey), an assassin working in home office (Proxy-by-nature) and a murder of a billionaire that might not be what it seems at first (A study in carbon).A book from a guy who actually worked for ten years in shaping the future of technology as an entrepreneur himself, DON'T OVERTHINK THE APPLICATION SAID is the warm-up for many more stories told in this vision of the future. It is the perfect entry point for all those who want to have a head-start. For those who loved William Gibson, Philip K. Dick, George Alec Effinger, Neil Stephenson, and Black Mirror this book is a perfect read!",
  "genres": [
    "Science Fiction",
    "Anthologies"
  ],
  "author": "Christoph Brueck",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/55219795-don-t-overthink-the-application-said"
}