{
  "title": "The Weekend",
  "description": "**#1 International BestsellerShortlisted for the Stella Prize 2020 * Long-listed for the 2020 Miles Franklin Award“The Big Chill with a dash of Big Little Lies... Knife-sharp and deeply alive.”—Guardian“An insightful, poignant, and fiercely honest novel about female friendship and female aging.”—Sigrid Nunez, National Book Award-winning author of The Friend'Friendship, ambition, love, sexual politics and death: it's all here in one sharp, funny, heartbreaking and gorgeously-written package. I loved it' —Paula Hawkins, author of The Girl on the Train.Three women in their seventies reunite for one last, life-changing weekend in the beach house of their late friend.Four older women have a lifelong friendship of the best kind: loving, practical, frank, and steadfast. But when Sylvie dies, the ground shifts dangerously for the remaining three.They are Jude, a once-famous restaurateur; Wendy, an acclaimed public intellectual; and Adele, a renowned actress now mostly out of work. Struggling to recall exactly why they've remained close all these years, the grieving women gather at Sylvie's old beach house—not for festivities this time, but to clean it out before it is sold. Can they survive together without her?Without Sylvie to maintain the group's delicate equilibrium, frustrations build and painful memories press in. Fraying tempers, an elderly dog, unwelcome guests and too much wine collide in a storm that brings long-buried hurts to the surface—and threatens to sweep away their friendship for good.The Weekend explores growing old and growing up, and what happens when we're forced to uncover the lies we tell ourselves. Sharply observed and excruciatingly funny, this is a jewel of a book: a celebration of tenderness and friendship from an award-winning writer.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Book Club",
    "Australia",
    "Literary Fiction",
    "Friendship",
    "Novels"
  ],
  "author": "Charlotte  Wood",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/55214308-the-weekend"
}