{
  "title": "Crown of Secrets",
  "description": "Verene is a disappointment to her entire kingdom--the first royal ever born without power, despite her mother being the most powerful mage in history. So when she's sent to the Academy in neighboring Kallorway to forge ties with her people's traditional enemies, she's determined to succeed and prove she can still be of value to her kingdom.Prince Darius of Kallorway is the strongest mage in his family--and the only reason his weak father is still clinging to his throne. Starting at the Academy at the same time as Verene, the crown prince is cold and distant and shows no desire to connect with her. Instead he seems suspicious of both her presence and her claimed lack of power.Surrounded by unfamiliar politics and long-held enemies, Verene discovers that some at the Academy want her gone by whatever means necessary. As the threats grow ever more sinister, she starts to question all of her assumptions. The hardened prince might just be her best hope of survival and--even more shockingly--he might be right about her power. If Verene wants to survive Kallorway and the Academy, she must uncover her hidden powers and take her true place among the mages.If you enjoy strong heroines, fantasy worlds, adventure, intrigue, and clean romance, then try this new adventure in the Spoken Mage world now!The Hidden Mage reading order:Crown of SecretsCrown of DangerCrown of Strength (coming December 2020)Crown of Power (coming February 2021)Verene lives in a world of written power--a world turned upside down by the first ever Spoken Mage. If you missed the adventures of her mother, Elena, then check out the completed Spoken Mage series, starting with Voice of Power.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Magic",
    "Audiobook",
    "Young Adult Fantasy",
    "Fantasy Romance"
  ],
  "author": "Melanie Cellier",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/55212757-crown-of-secrets"
}