{
  "title": "Joe Biden: The Life, the Run, and What Matters Now",
  "description": "A FINANCIAL TIMES BEST BOOK OF 2020A concise, brilliant, and trenchant examination of Joseph R. Biden Jr.’s successful lifelong quest for the presidency by National Book Award winner Evan Osnos.President Joseph R. Biden Jr. has been called both the luckiest man and the unluckiest—fortunate to have sustained a fifty-year political career that reached the White House, but also marked by deep personal losses and disappointments that he has suffered.Yet even as Biden’s life has been shaped by drama, it has also been powered by a willingness, rare at the top ranks of politics, to confront his shortcomings, errors, and reversals of fortune. As he says, “Failure at some point in your life is inevitable, but giving up is unforgivable.” His trials have forged in him a deep empathy for others in hardship—an essential quality as he leads America toward recovery and renewal.Blending up-close journalism and broader context, Evan Osnos, who won the National Book Award in 2014, draws on nearly a decade of reporting for The New Yorker to capture the characters and meaning of 2020’s extraordinary presidential election. It is based on lengthy interviews with Biden and on revealing conversations with more than a hundred others, including President Barack Obama, Cory Booker, Amy Klobuchar, Pete Buttigieg, and a range of activists, advisers, opponents, and Biden family members.This portrayal illuminates Biden’s long and eventful career in the Senate, his eight years as Obama’s vice president, his sojourn in the political wilderness after being passed over for Hillary Clinton in 2016, his decision to challenge Donald Trump for the presidency, and his choice of Vice President Kamala Harris as his running mate.Osnos ponders the difficulties Biden faces as his presidency begins and weighs how a changing country, a deep well of experiences, and a rigorous approach to the issues, have altered his positions. In this nuanced portrait, Biden emerges as flawed, yet resolute, and tempered by the flame of tragedy—a man who just may be uncannily suited for his moment in history.",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "History",
    "Presidents",
    "Audiobook",
    "American History"
  ],
  "author": "Evan Osnos",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/55246908-joe-biden"
}