{
  "title": "Forbidden Woman: A single woman's survival in the 20th century.",
  "description": "Award-winning book! Forbidden Woman took Gold in the category of Literary Fiction, eLit Book Awards 2021.Lucille learns the hard way that she can't trust men. Her missing husband and the San Antonio chief of police are proof of that. But the Great Depression insists that she needs a man - or the open wallets of many men - to build her Texas empire and raise the daughter she wishes she didn't have.Rosemary is that daughter, and she wants her mother’s approval more than anything. She’s even willing to say goodbye to the love of her life in favor of a man who has a steady job and serves his country honorably. And yet her mother still doesn't approve.Helen had once dreamed of enlisting as a nurse in the Army, but the military had already reached its quota for Negro women when she had completed her training. Now, she works in the one square block of San Antonio that doesn’t segregate her from any of the other girls, and her dream has been reduced to finding peace in a world at war.But when Lucille is nearly killed by an angry soldier returning from the war, she must face the prospect of losing the fortune she spent a lifetime building and sending Helen and the other girls to the streets. Rosemary tries to send Lucille a message of love, while Helen prods Lucille to take a stand for the American Dream, but is it enough? Lucille wonders if she was meant for something more than a life of separating men from their coin. She might be wrong, but if she changes nothing in her life, she will change nothing in the world.Forbidden Woman will capture the interest of fans of Little Fires Everywhere by Celeste Ng and The Orphan Collector by Ellen Marie Wiseman.Content Notice: The author has gone to great lengths to present this story in an historically accurate fashion, right down to the going rate for a woman's time in any given year. A sad result of historical accuracy, however, is that certain uncivilized words are used in this book, because it is set in South Texas in the mid-twentieth century. This was an era when even Federal and Texas state laws did not hesitate to share their true intent: keep women and people of color out of power. The author has chosen to maintain those words, rather than paint over an ugly part of American history, to demonstrate just how far we’ve (not) come in the last eighty years.",
  "genres": [],
  "author": "Blair Bronwyn",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/55250737-forbidden-woman"
}