{
  "title": "Twisted Pretty Things",
  "description": "Something wicked is moving in the shadows of London… \nIn the underground world of glitzy illegal auctions, fast cars, and stolen magical artifacts, John “Dom” Domenici knows he’s out of his depth. But he needs the job at Kempthorne & Co like he needs to breathe. The alternative—going back to the organized crime gangs of London’s East End—is unthinkable.So when Alexander Kempthorne, boss of Kempthorne & Co Artifact Retrieval Agency, wants him on a special case to track down an illegal artifact dealer, Dom can’t say no. It shouldn’t matter that Kempthorne’s world is full of deadly secrets. It shouldn’t matter that the billionaire is sexy as sin, and it really shouldn’t matter how there’s an American agent stalking Dom, an American who knows more than he should about Dom’s case, including the real reason Alexander Kempthorne hired Dom. The only thing that really matters to Dom is solving the case and finding the artifact dealer. Because there are worse things in London than a conflicted billionaire and a trigger-happy American. Something wicked is stalking London’s streets, and if Dom doesn’t stop it, its shadows will rise and consume them all. ***Twisted Pretty Things is the first book in the all-new Shadows of London MM urban fantasy series. Action, mystery, and MM romance combine in this fast-paced adventure from the author who brought you the award-winning Silk & Steel series and the best-selling Prince's Assassin series. Coming August 2021.Triggering content: mention of past mental and physical abuse. Please note the Shadows of London series is set in London and the characters are all British (so is the author). Although the series has been edited in US English for the larger US market, to include US spelling and grammar, many English slang words and spelling remain as part of the character of the work.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Urban Fantasy",
    "Paranormal",
    "Romance",
    "Magic",
    "Mystery"
  ],
  "author": "Ariana Nash",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/55244683-twisted-pretty-things"
}