{
  "title": "It Gives You Strength",
  "description": "An alien visitor to the primitive planet Earth has one mission-to bring a child home. However, while searching for her, the alien is caught in a gang war. He must act quickly, or his home planet will, devastating the Earth. It is 1926, the height of prohibition. Tashan Zho, an alien scientist, is sent to Earth on a rescue mission. The alien's method of disguise, the Transference Protocol, allows the extraterrestrial to reanimate the body of a dying host so that the alien can seamlessly walk among Earthlings. However, when Tashan Zho reanimates the remains of a dead bootlegger, his memory and mission files are seemingly corrupted by the alcohol-ravaged body. Now, all he recalls about his assignment is one phrase, \"Find the one called Mike Kelly.\" Kelly is the leader of a criminal gang of World War One veterans fighting the mobster Jack \"Legs\" Diamond to control the Canada/New York rum-running market. He's also the only person who can help Tashan discover his mission's objective and help complete it. Infiltrating the mobster's gang, Tashan soon recalls his directive. He has to rescue an alien child from the infamous Craig Colony before his home planet sends a rescue team to do the job, likely destroying Earth.It Gives You Strength is an action-packed mashup of historical fiction, science fiction, and fantasy set in upstate New York during prohibition.Order your copy now and jump into this highly enjoyable sci-fi fantasy. \"... Brown’s prose undoubtedly captures the reader on the page. He makes the 1920s in upstate New York feel as exciting as an old-time thriller, with gun-wielding big shots, intense rivalries, and the perfect wildcard character.\"— Independent Book Review \"A rip-roaring blend of space opera, history, and fantasy, this is entertainment at its best....A must-read!\"— The Prairies Book Reviews \"It’s been a while since I enjoyed a book this much. It’s a well written sci-fi fantasy with perfect pacing.\"— Emerald Book Reviews \"Historical and sports fiction readers will fly through this book...\"— Independent Book ReviewReview",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Historical",
    "Fantasy"
  ],
  "author": "Philip Raymond Brown",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/55250367-it-gives-you-strength"
}