{
  "title": "The Outlaw",
  "description": "Bestselling author Jennifer Millikin delivers an emotional small-town romance about a misunderstood man and the woman who can set him free.There’s a thin line between being a hero and a villain, and I’m well aware I walk right down the middle of it. My reputation precedes me, even when I’m making a bad choice for the right reason. This is how I wind up in the back of a police car late one night. My infamous last name keeps my record clean, with a single community service at a ranch recently purchased by Jo Shelton. I think I’d rather go to jail than serve time with the woman who has made it clear she can’t stand me, even though we used to be friends. Despite the tense atmosphere and how she keeps me at arms’ length, I show up every day, ready to work. Quickly I learn a valuable while it’s difficult being around someone I don’t like, it’s far more difficult being around someone I find myself intensely attracted to, but cannot have. Because Jo, the woman who's driving me crazy with her quiet strength and beautiful face, is in a relationship. With a man who, I’d like to point out, is not out there getting his hands dirty on his girlfriend’s ranch. Possession is 9/10th’s of the law, and as far as I’m concerned, I’m currently in possession of Jo’s time and attention. One day, the unexpected happens. Her blue eyes pierce my callused exterior, seeing deep down into a wound I work hard to hide. It’s in this moment, and so many that follow, that I become certain there’s no hope left for me. I’m in love with Jo, and I’m desperate to show her I’m someone worthy of her love in return. Lucky for me, nobody rises to the occasion quite like an outlaw.*Author's The Hayden Family series is standalone, but for maximum enjoyment it is recommended it be read starting from book one.",
  "genres": [
    "Romance",
    "Small Town Romance",
    "Second Chance",
    "Enemies To Lovers",
    "Westerns",
    "Western Romance",
    "Contemporary Romance"
  ],
  "author": "Jennifer Millikin",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/55232294-the-outlaw"
}