{
  "title": "The Ape Who Guards the Balance",
  "description": "The prospects for the 1907 archaeological season in Egypt seem fairly dull to Amelia Peabody. Despite her adored husband's brilliant reputation in his field, his dashing-yet-less-than-diplomatic behavior has Professor Radcliffe Emerson ignominiously demoted to examining only the most boring tombs in the Valley of the Kings -- mere leftovers, really. All the Peabody Emersons profess stiff upper lips and intend to make the best of a bad situation, but this year the legendary land of the pharaohs will yield more than priceless artifacts for the Emerson expedition. For the desert guards even deeper mysteries that are wrapped in greed -- and sealed by murder.In a seedy section of Cairo, the youngest members of the expedition purchase a mint-condition papyrus of the famed Book of the Dead , the collection of magical spells and prayers designed to ward off the perils of the underworld and lead the deceased into everlasting life. But for as long as there have been graves, there have also been grave robbers -- as well as those who believe tomb violators risk the wrath of gods like Thoth, the little baboon who protects the scales used to weigh such precious commodities as hearts and souls.Besides facing the ire of ancient deities, their adventure into antiquity also puts Amelia and company in the sights of Sethos, the charismatically compelling but elusive Master Criminal whose bold villainies have defied the authorities in sever countries. In truth, Amelia needn't have this season is about to turn from dull to deadly. Soon, she will need all her remarkable skills of detection and deduction to untangle a web woven of criminals and cults, stolen treasures and fallen women -- all the while under the unblinking eye of a ruthless, remorseless killer.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Egypt",
    "Audiobook",
    "Historical Mystery"
  ],
  "author": "Elizabeth Peters",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/126734.The_Ape_Who_Guards_the_Balance"
}