{
  "title": "Out of the Shadows: Six Visionary Victorian Women in Search of a Public Voice",
  "description": "Extraordinary tales of women and the supernatural during the Victorian era that illuminate a radical history of female influence on social issues that has been—until now—confined to the dark.Queen Victoria’s reign was one of breathtaking social change, yet roles for most women remained rigid and narrow. The “angel in the house” rarely expressed an opinion, and certainly not one that challenged the status quo.But not so within the social sphere of the seance–a mysterious, lamplit world dominated by enterprising women whose apparent ability to move between the realms of the dead and the living rewarded them with otherwise unthinkable fame and power. Such talents allowed them to cross rigid boundaries of gender and class, and to summon unique political voices–voices capable of reaching some of the era’s most famous personalities, including even Victoria herself.Out of the Shadows, which draws on original diaries, letters, and memoirs, tells the stories of six such visionary Victorians. The clairvoyance of Kate, Leah, and Maggie Fox, three sisters from upstate New York, inspired some of the era’s best-known female suffrage activists and set off an international séance craze. British performer Emma Hardinge Britten left behind a career on Broadway for the life of a “trance lecturer,” whose oration on the death of Abraham Lincoln was celebrated by tens of thousands. The meteoric rise of Victoria Woodhull, born into poverty in Ohio, took her from childhood medium to Wall Street broker to America’s first female presidential candidate. And Georgina Weldon, whose interest in spiritualism nearly saw her confined to an asylum, went on to become a favorite of the press and a successful campaigner against Britain’s archaic lunacy laws.",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Biography",
    "Womens",
    "Victorian",
    "Audiobook"
  ],
  "author": "Emily Midorikawa",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/55263604-out-of-the-shadows"
}