{
  "title": "After Francesco",
  "description": "An Apple Books Best of the Month SelectionReturn to New York City and Minneapolis in 1988, at the peak of the AIDS crisis, in this stunning novel of relationships and surviving heartbreaking loss. Published on the 40th anniversary of the disease's first reported cases, this story is both a tribute to a generation lost to the pandemic as well as a powerful exploration of heartbreak, recovery, and how love can defy grief. Two years after his partner, Francesco, died, twenty-eight-year-old Kevin Doyle is dusting off his one good suit jacket for yet another funeral, yet another loss in their close-knit group. They had all been young, beautiful, and living the best days of their lives, though they didn’t know it. That was before New York City began to feel like a war zone, its horrors somehow invisible, and ignored by the rest of the world.Some people might insist that Francesco is in a better place now, but Kevin definitely isn’t. He spends his days in a mind-numbing job and his evenings drunk in Francesco’s old apartment, surrounded by memories. Francesco made everything look easy, and without him, Kevin struggles to keep going. And then one night, he stops trying. When Kevin awakens in a hospital, he knows it’s time to move back home to Minnesota and figure out how to start living again—without Francesco.With the help of a surviving partners support group and old and new friends, Kevin slowly starts to do just that. But an unthinkable family betrayal, and the news that his best friend is fighting for his life in New York, will force a reckoning and a defining choice. Drawing on his experience as part of the AIDS generation, Brian Malloy brings authenticity, insight, sensitivity, and humor to a story that is distinct yet universal in its powerful exploration of heartbreak and recovery, and the ways in which love can defy grief.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "LGBT",
    "Queer",
    "Literary Fiction",
    "Historical",
    "Audiobook"
  ],
  "author": "Brian Malloy",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/55261405-after-francesco"
}