{
  "title": "BE 2.0 (Beyond Entrepreneurship 2.0): Turning Your Business into an Enduring Great Company",
  "description": "NEARLY THIRTY YEARS AGO, Stanford University faculty members Jim Collins and Bill Lazier showed you how to turn an entrepreneurial business into an enduring great company.Beyond Entrepreneurship became a leadership staple, particularly among small and early-stage companies. And while Collins would go on to write a series of famous bestsellers that have sold more than ten million copies worldwide, this lesser-known early work remains the favourite of many of his loyal readers.Now, with Beyond Entrepreneurship 2.0, Collins re-shares the timeless insights in Beyond Entrepreneurship alongside new perspectives gleaned after decades of additional research into what makes great companies tick. In Beyond Entrepreneurship 2.0, you'll learn how to turn your company into the 2.0 version of itself. You'll be challenged to grow your own leadership as your company grows, from 1x to 2x to 5x to 10x. You'll learn Collins's newest reflections on people decisions, insights that extend beyond his seminal \"first who\" principle about getting the right people on the bus. You'll learn why luck favours the persistent, and what it means to look for \"who luck.\" You'll learn about the origins of the \"BHAG\" (Big Hairy Audacious Goal), and why even a small business needs a galvanising BHAG to have a complete and inspiring vision.You'll also unlock what Collins calls \"The Map.\" The Map is a road map that pulls together the key concepts developed from thirty years of research and writing into one integrated framework for building a company that delivers superior results, makes a distinctive impact, and achieves lasting endurance.Finally, you'll learn the lessons that Jim Collins himself learned from the most influential mentor in his life, Bill Lazier.Beyond Entrepreneurship 2.0 is the ambitious upgrade to a classic. In Beyond Entrepreneurship 2.0, you'll discover that the goal to turn your business into an enduring great company is as relevant - and as within your reach - as ever.",
  "genres": [
    "Business",
    "Entrepreneurship",
    "Leadership",
    "Nonfiction",
    "Management",
    "Buisness",
    "Audiobook"
  ],
  "author": "Jim Collins",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/55270310-be-2-0-beyond-entrepreneurship-2-0"
}