{
  "title": "Make Your Art No Matter What: Moving Beyond Creative Hurdles",
  "description": "The Artist's Way for the 21st century—from esteemed creative counselor Beth Pickens.If you are an artist, you need to make your art. That's not an overstatement—it's a fact; if you stop doing your creative work, your quality of life is diminished. But what do you do when life gets in the way? In this down-to-earth handbook, experienced artist coach Beth Pickens offers practical advice for developing a lasting and meaningful artistic practice in the face of life's inevitable obstacles and distractions. This thoughtful volume suggests creative ways to address the challenges all artists must overcome—from making decisions about time, money, and education, to grappling with isolation, fear, and anxiety. No matter where you are in your art-making journey, this book will motivate and inspire you. Because not only do you need your art—the world needs it, too.• EXPERT Beth Pickens is an experienced and passionate arts advocate with extensive insight into working through creative obstacles. She has spent the last decade advising artists on everything from financial strategy to coping with grief.• PRACTICAL AND This book is both a love letter to art and artists and a hands-on guide to approaching the thorniest problems those artists might face. Pickens offers a warm reminder that you are not alone, that what you do matters, and that someone out there wants you to succeed.• TIMELESS Like a trusted advisor, this book is an invaluable resource jam-packed with strategies for building a successful creative practice. From mixing business and friendship to marketing yourself on social media, this book can help. And it will—again and again.Perfect • Visual artists and makers• Writers, musicians, filmmakers, and other creatives• Art and design school graduates and grad-gift givers",
  "genres": [
    "Art",
    "Nonfiction",
    "Self Help",
    "Writing",
    "Audiobook",
    "Crafts",
    "Art Design"
  ],
  "author": "Beth Pickens",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/55277763-make-your-art-no-matter-what"
}