{
  "title": "Perfidy",
  "description": "A true classic! History that reads like a mystery novel when villains parade themselves as heroes and the real heroes are targets of evil.Picture those early days when the new nation of Israel was being formed in the region of Palestine European Jews had just endured history's ultimate holocaust. Allied governments such as Great Britain had refused to take action to block the trains from carrying thousands of them to certain death. In those final days before the end of the war, the epicenter of the Nazi extermination effort was Hungary. Jews had fled there from Germany and Poland, but they could not outrun the shadow of death. That is the obvious truth, but was there more? Was there collaboration with the enemy that resulted in these murderous acts?As Edmund Burke declared, \"The only thing necessary for the triumph of evil is for good men to do nothing.\" But what happens when those who are trusted as good join forces with evil?Underlying this story is a bizarre tapestry of deception at the highest levels of government with the lives of many innocents in the balance. The libel trial of Kastner establishes the outline of that hidden past, protected by the political interests of some of Israel's early leaders. Rudolf Kastner was a prominent journalist representing this new government and supported by its Prime Minister David Ben Gurion. Ben Gurion desperately wanted to exonerate those British and Jewish men who had collaborated with Nazis, supposedly to save the lives of others.Another man, Malchiel Greenwald, accused Kastner of testifying on behalf of SS Lieutenant General Kurt Becher and thus saving him from punishment for his war crimes. Greenwald further accused Kastner of collaborating with the Nazis and contributing to the death of over 400,000 Hungarian Jews during WWII when Kastner served as a major leader of the Jewish Agency Rescue Committee in Hungary.Kastner sued Greenwald for libel. The unfolding courtroom drama becomes intense as Kastner loses the case. When faced with the possibility of being convicted under Israel's anti-collaboration law (the one Eichmann was convicted under), he was convenient \"assassinated.\" The appeals are followed by the mysterious death of Kastner, relieving the government of political embarrassment and scandal. As a reader, you will be the final judge of this case and all its horrible details. But first, you must read the book and weigh the evidence for yourself.",
  "genres": [
    "History",
    "Israel",
    "Nonfiction",
    "Holocaust",
    "Jewish",
    "Judaism",
    "World War II"
  ],
  "author": "Ben Hecht",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/552775.Perfidy"
}