{
  "title": "Mad for Ads: How Advertising Gets (and Stays) in Our Heads",
  "description": "This amusing and engaging behind-the-scenes look at advertising and its influence will help kids decode the ads that surround them every day and make smart decisions. For children growing up in an advertising-saturated world, here’s an eye-opening explanation of what advertising is, how it works and why that matters. The book covers the components of an advertising campaign, from slogans to logos, and the many ways marketers seek to influence behavior, from tapping into fears to using psychological pricing. It then brings these techniques and tools to life by taking readers through the creation of two fictional advertising plans. Along the way, there’s information about the strategies that advertisers use to influence their audience, as well as valuable background on how digital technology allows companies to track people and what that means for privacy. It’s a savvy look at the business of advertising that teaches children to pay better attention to ads and be more discerning about the messages they find. Award-winning author Erica Fyvie has geared this vital, comprehensive and entertaining look at advertising to children who are just beginning to notice and to be swayed by brands. By building media literacy and promoting critical thinking about all kinds of marketing tools — from in-game ads to social media “kid influencers” — the book empowers readers to analyze and respond to what they see every day. Relevant, child-friendly language and examples, along with bold and humorous illustrations by Ian Turner, keep the pages lively and interesting. There are direct curriculum links to language arts, visual arts, technology and social studies lessons. Also included are a glossary, index and selected bibliography.",
  "genres": [
    "Nonfiction",
    "Middle Grade",
    "Picture Books",
    "Canada",
    "Childrens"
  ],
  "author": "Erica Fyvie",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/55277852-mad-for-ads"
}