{
  "title": "Finding Your Way in a Wild New World: Reclaim Your True Nature to Create the Life You Want",
  "description": "Finding Your Way in a Wild New World is a remarkable path to the most important discovery you can the knowledge of what you should be doing with your one wild and precious life. It’s a journey to the thing that so fulfills you that, if someone told you, “It’s right outside—but watch out—it could kill you!” you’d run straight toward it, through the screen door without even opening it. Life coach and bestselling author of Finding Your Own North Star Martha Beck guides you to find out how you got to where you are now and what you should do next with clear, concrete instructions on tapping into the deep, wordless knowledge you carry in your body and soul. There are certain people who sense that they are called to do something fulfilling and significant, but who often get caught in self-destructive, unproductive cycles. This is the book that will lead you to unleash your incredible creative energy—and fulfill your life’s purpose.With her inimitable ability to translate inner life into accessible, witty, sparkling prose, Beck draws from ancient wisdom and modern science to help readers consciously embrace their skills and create the life they really want. What she’s found is that these people with great passion, empathy, and creative potential often sense a higher calling—in a society where that calling isn’t even recognized as real. They often have within them a quiet power that could change the world; they lack only the tools. Beck offers real, actionable methods to tap into that power . She shows how to find your inner identity and your external “tribe” of like-minded people. She demonstrates the four simple tools for Wordlessness, Oneness, Imagination, and Creation. With clear step-by-step instructions and guided reflections, Beck shows how to drop into the wordless state of communion with nature and self, how to experience for yourself the oneness between yourself and the universe, how to be empowered by the spark of inspiration, and, finally, how to take action and realize creative potential to make a lasting impact on the world.Compassionate and inspirational, Finding Your Way in a Wild New World is a revolutionary journey of self-discovery that leads to miraculous change.***From Finding Your Way in a Wild New The mother rhino paws nervously, and I feel the impact tremor in the ground beneath my own feet. She is huge. She is nervous. She could kill me as easily as I clip my fingernails. But my mind is filled only with wonder, distilled into two basic questions.Question 1: How the hell did I get here?Question 2: What the hell should I do now?Both issues seem equally mysterious. . . . But it all seems to clear now— it was my true nature that brought me face to face with a rhinoceros. . . . I’m finding out what it feels like to reclaim my true nature. It’s one of the most wonderful things I’ve ever experienced. And, because ecstasy loves company, I want you to experience it too. The wild new world of the twenty-first century is the perfect setting for reclaiming your true nature. And your life will work much, much better if you let it direct your choices. It will bring you freedom, peace, and delight; give you the optimal chance of making a good living; and help you create the best possible effect on everything around you. I’m not certain exactly how it will play out in your case, but here’s what I do it’s time you met your rhinoceros.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Spirituality",
    "Business",
    "Psychology",
    "Audiobook"
  ],
  "author": "Martha N. Beck",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/12672988-finding-your-way-in-a-wild-new-world"
}