{
  "title": "Ted Bundy: The Campus Killer",
  "description": "Ted Bundy is such an enigma that it is a challenge to describe him in one sentence. He is certainly one of the most notorious serial killers of all time and one which both fascinates and terrifies us all in some way or another.To think that he was able to sustain a life of education, romance, politics, and ordinary day-jobs while he brutally raped and murdered countless women across the United States is gut-wrenching- there were no signs of what he hid behind his charming smile and boyish personality. He is known as a serial rapist and murderer, but he was also a voyeur, hebephile, necrophile, and cannibal- with an avalanche of love for socks. His fetishes ranged from Burlington socks to sadomasochism and brunettes with their hair parted in the middle, which he combined into the most gruesome and torturous expressions of his inferiority and rage.A cunning and manipulative nose picker who studied psychology and law to master his craft, something that he said he worked very hard to “get right”. Wherever Bundy fell short in childhood, he made up for in adulthood, making sure that he squeezed himself into as many middle to upper-class circles as he could and earning himself the favor he needed from police officers, politicians, professors, church leaders, and girlfriends to help him stay undetected for as long as possible.He had to be apprehended three times to keep him locked behind bars, escaping twice in the most iconic performance of a serial killer ever observed. He also naturally defended himself in court with each surmounting death sentence, slipping in a marriage proposal with a Tiffany’s ring right before he was sentenced to death by electrocution. He met ‘Old Sparky’ in 1989, confessing to at least 30 murders after 11 years of denial in an attempt to buy himself more time. Some of the remains had been found, while others have never been recovered.Bundy was and remains the icon of Hybristophilia, where women have often been absolutely enamored by him as a person, believing that he was exceptionally special. Stephen Michaud, a journalist who spent possibly the most time with Ted Bundy on death row summed it up “I tried to portray him as the worm that he was. That he in fact knew that he was. To look beyond that toothpaste smile and see him for what he is felt like a goal. So. if the public at large wants to turn him into some kind of evil genius, or handsome scarlet pimpernel, well then, I can’t help that. I made a point to say that serial murder is a simple crime to commit and get away with. It involves complete strangers in remote places.” Let’s Investigate!",
  "genres": [],
  "author": "Gisela K.",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/55264110-ted-bundy"
}