{
  "title": "The Last Fallen Star",
  "description": "A NEW YORK TIMES BESTSELLERBest-selling author Rick Riordan presents Graci Kim's thrilling debut, now in paperback, about an adopted Korean-American girl who discovers her heritage and her magic on a perilous journey to save her witch clan family.\"Graci Kim does such an amazing job of blending Korean mythology into the modern world, I am now wondering how I ever lived without knowing all this cool information.\"--New York Times #1 best-selling author Rick RiordanRiley Oh can't wait to see her sister get initiated into the Gom clan, a powerful lineage of Korean healing witches their family has belonged to for generations. Her sister, Hattie, will earn her Gi bracelet and finally be able to cast spells without adult supervision. Although Riley is desperate to follow in her sister's footsteps when she herself turns thirteen, she's a saram--a person without magic. Riley was adopted, and despite having memorized every healing spell she's ever heard, she often feels like the odd one out in her family and the gifted community.Then Hattie gets an idea: what if the two of them could cast a spell that would allow Riley to share Hattie's magic? Their sleuthing reveals a promising incantation in the family's old spell book, and the sisters decide to perform it at Hattie's initiation ceremony. If it works, no one will ever treat Riley as an outsider again. It's a perfect plan!Until it isn't. When the sisters attempt to violate the laws of the Godrealm, Hattie's life ends up hanging in the balance, and to save her Riley has to fulfill an impossible task: find the last fallen star. But what even is the star, and how can she find it?As Riley embarks on her search, she finds herself meeting fantastic creatures and collaborating with her worst enemies. And when she uncovers secrets that challenge everything she has been taught to believe, Riley must decide what it means to be a witch, what it means to be family, and what it really means to belong.\"A fun, new magical world that promises more adventures to come.\"--Kirkus ReviewsComplete your middle grade collection with these best-selling fan favorites :Rick Riordan Presents Aru Shah and the End of Time by Roshani ChokshiRick Riordan Presents Tristan Strong Punches a Hole in the Sky by Kwame MbaliaRick Riordan Presents Paola Santiago and the River of Tears by Tehlor Kay MejiaThe Trials of Apollo series by Rick Riordan",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Mythology",
    "Fiction",
    "Adventure",
    "Young Adult",
    "Magic"
  ],
  "author": "Graci Kim",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/55277625-the-last-fallen-star"
}