{
  "title": "The Beatles: Get Back",
  "description": "The most anticipated book in more than a decade by the legendary band, The Beatles: Get Back is the official account of the creation of their final album, Let It Be, told in The Beatles’ own words, illustrated with hundreds of previously unpublished images, including photos by Ethan A. Russell and Linda McCartney. Half a century after the 1970 Let It Be album and film, this milestone book coincides with the global release of Peter Jackson’s documentary feature film, The Beatles: Get Back.The book opens in January 1969, the beginning of The Beatles’ last year as a band. The BEATLES (The White Album) is at number one in the charts and the foursome gather in London for a new project. Over 21 days, first at Twickenham Film Studios and then at their own brand-new Apple Studios, with cameras and tape recorders documenting every day’s work and conversations, the band rehearse a huge number of songs, culminating in their final concert, which famously takes place on the rooftop of their own office building, bringing central London to a halt.The Beatles: Get Back tells the story of those sessions through transcripts of the band’s candid conversations. Drawing on over 120 hours of sound recordings, leading music writer John Harris edits the richly captivating text to give us a fly-on-the-wall experience of being there in the studios. These sessions come vividly to life through hundreds of unpublished, extraordinary images by two photographers who had special access to their sessions―Ethan A. Russell and Linda Eastman (who married Paul McCartney two months later). Also included are many unseen high-resolution film-frames, selected from the 55 hours of restored footage from which Peter Jackson’s documentary is also drawn.Legend has it that these sessions were a grim time for a band falling apart. However, as acclaimed novelist Hanif Kureishi writes in his introduction, “In fact this was a productive time for them, when they created some of their best work. And it is here that we have the privilege of witnessing their early drafts, the mistakes, the drift and digressions, the boredom, the excitement, joyous jamming and sudden breakthroughs that led to the work we now know and admire.\" Half a century after their final performance, this book completes the story of the creative genius, timeless music, and inspiring legacy of The Beatles.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "History",
    "Photography",
    "Pop Culture",
    "Art"
  ],
  "author": "The Beatles",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/55286757-the-beatles"
}