{
  "title": "The Chinese Question: The Gold Rushes and Global Politics",
  "description": "In roughly five decades, between 1848 and 1899, more gold was removed from the earth than had been mined in the 3,000 preceding years, bringing untold wealth to individuals and nations. But friction between Chinese and white settlers on the goldfields of California, Australia, and South Africa catalyzed a global battle over “the Chinese Question”: would the United States and the British Empire outlaw Chinese immigration?This distinguished history of the Chinese diaspora and global capitalism chronicles how a feverish alchemy of race and money brought Chinese people to the West and reshaped the nineteenth-century world. Drawing on ten years of research across five continents, prize-winning historian Mae Ngai narrates the story of the thousands of Chinese who left their homeland in pursuit of gold, and how they formed communities and organizations to help navigate their perilous new world. Out of their encounters with whites, and the emigrants’ assertion of autonomy and humanity, arose the pernicious western myth of the “coolie” laborer, a racist stereotype used to drive anti-Chinese sentiment.By the turn of the twentieth century, the United States and the British Empire had answered “the Chinese Question” with laws that excluded Chinese people from immigration and citizenship. Ngai explains how this happened and argues that Chinese exclusion was not extraneous to the emergent global economy but an integral part of it. The Chinese Question masterfully links important themes in world history and economics, from Europe’s subjugation of China to the rise of the international gold standard and the invention of racist, anti-Chinese stereotypes that persist to this day.",
  "genres": [
    "History",
    "China",
    "Nonfiction",
    "American History",
    "South Africa",
    "Australia",
    "World History"
  ],
  "author": "Mae M. Ngai",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/55298347-the-chinese-question"
}