{
  "title": "Pessoa: A Biography",
  "description": "Like Richard Ellmann’s James Joyce, Richard Zenith’s Pessoa immortalizes the life of one of the twentieth century’s greatest writers.Nearly a century after his wrenching death, the Portuguese poet Fernando Pessoa (1888–1935) remains one of our most enigmatic writers. Believing he could do “more in dreams than Napoleon,” yet haunted by the specter of hereditary madness, Pessoa invented dozens of alter egos, or “heteronyms,” under whose names he wrote in Portuguese, English, and French. Unsurprisingly, this “most multifarious of writers” (Guardian) has long eluded a definitive biographer—but in renowned translator and Pessoa scholar Richard Zenith, he has met his match.Relatively unknown in his lifetime, Pessoa was all but destined for literary oblivion when the arc of his afterlife bent, suddenly and improbably, toward greatness, with the discovery of some 25,000 unpublished papers left in a large, wooden trunk. Drawing on this vast archive of sources as well as on unpublished family letters, and skillfully setting the poet’s life against the nationalist currents of twentieth-century European history, Zenith at last reveals the true depths of Pessoa’s teeming imagination and literary genius.Much as Nobel laureate José Saramago brought a single heteronym to life in The Year of the Death of Ricardo Reis, Zenith traces the backstories of virtually all of Pessoa’s imagined personalities, demonstrating how they were projections, spin-offs, or metamorphoses of Pessoa himself. A solitary man who had only one, ultimately platonic love affair, Pessoa used his and his heteronyms’ writings to explore questions of sexuality, to obsessively search after spiritual truth, and to try to chart a way forward for a benighted and politically agitated Portugal.Although he preferred the world of his mind, Pessoa was nonetheless a man of the places he inhabited, including not only Lisbon but also turn-of-the-century Durban, South Africa, where he spent nine years as a child. Zenith re-creates the drama of Pessoa’s adolescence—when the first heteronyms emerged—and his bumbling attempts to survive as a translator and publisher. Zenith introduces us, too, to Pessoa’s bohemian circle of friends, and to Ophelia Quieroz, with whom he exchanged numerous love letters. Pessoa reveals in equal force the poet’s unwavering commitment to defending homosexual writers whose books had been banned, as well as his courageous opposition to Salazar, the Portuguese dictator, toward the end of his life. In stunning, magisterial prose, Zenith contextualizes Pessoa’s posthumous literary achievements—especially his most renowned work, The Book of Disquiet.A modern literary masterpiece, Pessoa simultaneously immortalizes the life of a literary maestro and confirms the enduring power of Pessoa’s work to speak prophetically to the disconnectedness of our modern world.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Portugal",
    "Poetry",
    "Biography Memoir",
    "Literature",
    "Memoir"
  ],
  "author": "Richard Zenith",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/55298317-pessoa"
}