{
  "title": "The Third Pole: Mystery, Obsession, and Death on Mount Everest",
  "description": "***NPR Books We Love selection***“If you’re only going to read one Everest book this decade, make it The Third Pole. . . . A riveting adventure.”— OutsideShivering, exhausted, gasping for oxygen, beyond doubt . . .A hundred-year mystery lured veteran climber Mark Synnott into an unlikely expedition up Mount Everest during the spring 2019 season that came to be known as “the Year Everest Broke.” What he found was a gripping human story of impassioned characters from around the globe and a mountain that will consume your soul—and your life—if you let it. The mystery? On June 8, 1924, George Mallory and Sandy Irvine set out to stand on the roof of the world, where no one had stood before. They were last seen eight hundred feet shy of Everest’s summit still “going strong” for the top. Could they have succeeded decades before Sir Edmund Hillary and Tenzing Norgay? Irvine is believed to have carried a Kodak camera with him to record their attempt, but it, along with his body, had never been found. Did the frozen film in that camera have a photograph of Mallory and Irvine on the summit before they disappeared into the clouds, never to be seen again? Kodak says the film might still be viable. . . . Mark Synnott made his own ascent up the infamous North Face along with his friend Renan Ozturk, a filmmaker using drones higher than any had previously flown. Readers witness first-hand how Synnott’s quest led him from oxygen-deprivation training to archives and museums in England, to Kathmandu, the Tibetan high plateau, and up the North Face into a massive storm. The infamous traffic jams of climbers at the very summit immediately resulted in tragic deaths. Sherpas revolted. Chinese officials turned on Synnott’s team. An Indian woman miraculously crawled her way to frostbitten survival. Synnott himself went off the safety rope—one slip and no one would have been able to save him—committed to solving the mystery. Eleven climbers died on Everest that season, all of them mesmerized by an irresistible magic. The Third Pole is a rapidly accelerating ride to the limitless joy and horror of human obsession.",
  "genres": [
    "Nonfiction",
    "History",
    "Adventure",
    "Mountaineering",
    "Travel",
    "Memoir",
    "Sports"
  ],
  "author": "Mark Synnott",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/55288158-the-third-pole"
}