{
  "title": "Pastrix: The Cranky, Beautiful Faith of a Sinner & Saint",
  "description": "\" Seven years on from its original publication,  Pastrix  remains bracing and beautiful. Nadia’s bold vulnerability and tender heart are timeless gifts. And the words she has added to this edition remind We need her call to tender grace and a loving, forgiving God now more than ever.\"-- Jeff Chu, Author of  Does Jesus Really Love Me? a derogatory term used by Christians who refuse to recognize female pastors.  Heavily tattooed and foul-mouthed, Nadia Bolz-Weber, a former stand-up comic, sure as hell didn't consider herself to be religious-leader material—until the day she ended up leading a friend's funeral in a smoky downtown comedy club. Surrounded by fellow alcoholics, depressives, and cynics, she These were her people. Maybe she was meant to be their pastor.Using life stories—from living in a hopeful-but-haggard commune of slackers to surviving the wobbly chairs and war stories of a group for recovering alcoholics, from her unusual but undeniable spiritual calling to pastoring a notorious con artist—Nadia uses humorous narrative and poignant honesty to portray a woman who is both deeply faithful and deeply flawed, giving hope to the rest of us along the way. This is the book for people who hunger for a bit of hope that doesn't come from vapid consumerism or navel-gazing; for women who talk too loudly and guys who love chick flicks; for the gay man who loves Jesus and won't allow himself to be shunned by the church. In short, this book is for every thinking misfit suspicious of institutionalized religion but still seeking transcendence and mystery.Updated with a new afterword, Pastrix is wildly entertaining, sardonically irreverent, and deeply resonant—a messy, beautiful, prayer—and profanity-laden narrative about an unconventional life of faith.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Religion",
    "Spirituality",
    "Faith",
    "Christian",
    "Theology"
  ],
  "author": "Nadia Bolz-Weber",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/55277920-pastrix"
}