{
  "title": "Ruthless Pamela Jean",
  "description": "On September 1, 2022, Ruthless Pamela Jean became author Carol Denise Mitchell's 2nd Readers Favorite Book Award-winning novel. The author is thrilled! In this amazing youth adventure, Pamela Jean Metcalf’s father left his daughter at birth, not believing a baby so light-skinned could be his. In Carol Denise Mitchell’s ground-breaking book, Ruthless Pamela Jean, the author leads readers on a real-life roller coaster ride, where they’re dropped off into the life of one “only” child, who aims to put an end to racial child bullying. There is nothing conventional about Ruthless Pamela Jean, who is heartbroken when she sees her beloved mother Betty, her best friend, praying at the foot of her bed that the bullying against her light-skinned daughter will end. Upon hearing her mother’s prayers, little Pamela Jean Metcalf leaves her broken mother out of her daily issues of abuse as she sets out to change the formidable child-bullying game!The author dares to make Iceberg Slim, the 60s most notorious \"Pimp,” Pamela Jean’s go-to mentor! Mitchell says, “Why not?\" After reading \"PIMP\" by Iceberg Slim, Pamela embraces Slim’s controlling metaphors to handle bullies in a dark tunnel that tried to kill her. There, Pamela builds her strength. She takes the bullies by the horn(s) while she fights back. One day of strength gives Pamela Jean Metcalf a lifetime of hope. Readers will engage with this “think-out-the-box” book like no other! Pamela’s initial survival comes from state psychiatrist Nancy Parker, who becomes PJ’s lifelong mentor. The doctor convinces Pamela to confront the abuse without violence by using her muses’ metaphors to build character and become a winner. What emerges is a woman in control of a man’s game. Survival means Pamela would enter the man’s game armed with an Ivy League education to create a very successful male escort startup that turns into pure gold. Pamela experiences a meteoric halt in the nation’s abuse as she sets out to save the world. Notwithstanding, as Pamela adheres to the doctor’s counseling, she is empowered by tragedy; she’s a warrior for the abused. From a broken child into one of the nation’s most powerful business women and a spokesperson against child bullying, Pamela Jean Metcalf emerges nicely as a savvy businesswoman who teaches the bullied how to take control and win!",
  "genres": [],
  "author": "Carol Denise Mitchell",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/55297810-ruthless-pamela-jean"
}