{
  "title": "Husband of Hitwoman",
  "description": "Aware his bride once worked as an assassin for The Company, Dawson Pelletier marries her despite the past she tries to leave behind. Now, all efforts are to keep her alive when her former employer sends its best to kill Julia. Wounded and angry, the former hitwoman vows all-out war against them. Alone, trying to spare her husband, she systematically hunts each killer, as Dawson fights for his own life. Even if they survive, can the newlyweds overcome distrust, hurt feelings, and rekindle their love? Praise for Jeffrey Pitts’ new novel Husband of Hitwoman “…Pitts’ real magic is an intimate knowledge of survival. Be it a chapter or two surviving in a wilderness setting, or engaging in the challenges of endurance and grit in an urban setting, he is highly knowledgeable and the details come across in a genuine way…the book is real and engaging.”—John, Wilderness Explorer and EdTech Entrepreneur \"Action packed from start to finish, I was hooked from the beginning. Once you start reading you will not be able to put Husband of Hitwoman down until you have finished. The detail and descriptiveness of Pitts' writing makes you feel like you know the characters and are a part of the story. I look forward to reading more of Jeffrey A Pitts' books!”—Cassie Allison, Actual waitress from the Morton drive-in where Julia ate breakfast. \"I am addicted to Jeffrey Pitts writing abilities. The action packed, thriller that keeps you on the edge of your seat. The characters pull you in where you feel like you’re in the middle of everything happening in the story. Amazing book and can't wait for the next.\"—Carla Tavoloni, Nurse, Buckeye, Arizona “Julia, (J's), former employer, The Company, wants to eliminate her, their prized asset. She uses her unique talent and turns the table on them and systematically eradicates those who put a bounty on her head. Fast paced, page turning action as she plots her revenge with Dawson, her husband, and members of his former unit. A surprising and intriguing twist concludes this thrilling novel by Jeffrey Pitts.”—Jack P., CEO J & J Adventures Excerpt I found it difficult to imagine the warm and caring woman I’d married was once a ruthless killer until from behind a tree I watched her practice. Julia no longer existed. She became J—the gray woman. I held my breath when she dove forward, tumbling head over heels to come up shooting with her suppressed work pistol. Although never admitting an actual number, stories she once confided meant her kills went over fifty or seventy-five, perhaps even a hundred. Shots from the .22 Ruger were silent from where I watched. A few rounds fired then a run, dive, roll, or summersault and come up shooting again—empty magazines exchanged with others carried on her belt. More bullets went downrange while barrel-rolling without slowing her rate of fire. Blazing away from her side with her weak or strong hand, J stopped only when her gun ran dry after shooting her way back to the bench. A voice at my shoulder shocked me. “Jesus Christ…” Automatically drawing the .44 Magnum Colt Anaconda on my belt, I turned fully prepared to kill our intruder. Scotty stood a few feet behind me but his gaze never shifted from Julia. His mouth left open, he observed slack-jawed while she switched from empty to loaded magazines. My drawn revolver got ignored, and I holstered it. “I…holy shit…” Scotty was finally at a loss for words, holding the shotgun he promised to bring. “How long have you been watching?” “Long enough,” he whispered back. “Buddy, you’ve gotta get out of here. She can’t know you saw.",
  "genres": [],
  "author": "Jeffrey A. Pitts",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/55291796-husband-of-hitwoman"
}