{
  "title": "Aspects of the Novel",
  "description": "From the Back CoverThe wit and lively, informed originality Forster employs in his study of the novel has made this book a classic. Deliberately avoiding the chronological development approach of what he classifies \"pseudoscholarship,\" the author freely examines aspects all English-language novels have in common: story, people, plot, fantasy, prophecy, pattern, and rhythm. Forster's delightful treatment gives the reader a profound appreciation for both the novel and the author's own formidable talents.\"We discover under Forster's casual and wittily acute guidance, many things about the literary magic which transmutes the dull stuff of He-said and She-said into characters, stories, and intimations of truth.\" -- Jacques Barzun, Harper's MagazineMr. Forster's volume is more than a discussion of a literary form, it is a discussion of experience, of life, an admirable and delightful reflection of a mind that has recognized its own affinity with Erasmus and Montaigne. -- Theodore Spencer, New York Times Book ReviewAmazon. com ReviewThere are all kinds of books out there purporting to explain that odd phenomenon the novel. Sometimes it's hard to know whom they're are for, exactly. Enthusiastic readers? Fellow academics? Would-be writers? Aspects of the Novel, E. M. Forster's 1927 treatise on the \"fictitious prose work over 50,000 words\" is, it turns out, for anyone with the faintest interest in how fiction is made. Open at random, and find your attention utterly sandbagged.Forster's book is not really a book at all; rather, it's a collection of lectures delivered at Cambridge University on subjects as parboiled as \"People,\" \"The Plot,\" and \"The Story.\" It has an unpretentious verbal immediacy thanks to its spoken origin and is written in the key of Apologetic Mumble: \"Those who dislike Dickens have an excellent case. He ought to be bad.\" Such gentle provocations litter these pages. How can you not read on? Forster's critical writing is so ridiculously plainspoken, so happily commonsensical, that we often forget to be intimidated by the rhetorical landscapes he so ably leads us through. As he himself points out in the introductory note, \"Since the novel is itself often colloquial it may possibly withhold some of its secrets from the graver and grander streams of criticism, and may reveal them to backwaters and shallows.\" Forster's brand of humanism has fallen from fashion in literary studies, yet it endures in fiction itself. Readers still love this author, even if they come to him by way of the multiplex. The durability of his work is, of course, the greatest raison d'être this book could have. It should have been titled How to Write Novels People Will Still Read in a Hundred Years. -- Claire Dederer",
  "genres": [
    "Writing",
    "Nonfiction",
    "Literary Criticism",
    "Essays",
    "Literature",
    "Classics",
    "Books About Books"
  ],
  "author": "E.M. Forster",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/12674995-aspects-of-the-novel"
}