{
  "title": "King of Wands",
  "description": "An unconventional widow with a secret . . .Lady Julia Lacey’s world collapsed when her abusive husband dragged her from India back to England after a tragic loss. Following his death, she turned her palatial home into a sanctuary for battered wives while she withdrew to quiet seclusion. When a letter bearing joyous news arrives from Calcutta, she vows to return to India to reclaim what she lost, but moving there requires funds. She won’t liquidate her estate, though, until she finds a new refuge for her guests. The insufferable, albeit attractive, vicar she grudgingly appointed to the parish living, has reluctantly offered his help, even though he considers her a raging heretic. She accepts his assistance warily because that means spending time with him. And unfortunately, he’s the one person who reminds her that she’s still a woman.A devoted holy man with a broken heart . . .Mr. Charles Rodman’s heart was ripped from his chest years ago by his unfaithful wife. When she died, he resolved to bury his pain with her memory. Now, the staid widower wants nothing more than to minister to his new flock, including his exasperating but beautiful patroness. Though he’s given up trying to convince the impertinent apostate to return to the fold, he still finds himself entangled with her when he’s unexpectedly volunteered to help her raise money for a shelter for abused women. As a servant of God, he must help her, but the last thing he wants is to be around her because she’s the one person who makes him uncomfortably aware that he’s a man.Can they work together without getting burned?Despite their mutual antagonism, Charles and Julia’s equally mutual attraction heats up when a fiery kiss unleashes a searing passion. Can she allow him into her heart, or would he only break it if he learned her secret? Can he ever trust another woman again, especially this one, or is she too much like his late wife?",
  "genres": [
    "Historical Romance"
  ],
  "author": "Anna Durbin",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/55318134-king-of-wands"
}