{
  "title": "Manage My Emotions: What I Wish I'd Learned in School about Anger, Fear and Love",
  "description": "Enrich Your Life!Internationally Renowned Now from the comfort of your home.As Seen on CBS, NBC and Business InsiderStop struggling on the roller coaster and find freedom. In Manage My Emotions, author, psychologist and emotional intelligence expert Dr. Kenneth Martz draws on over 25 years of improving people's emotional and spiritual lives to offer you proven and powerful methods for understanding emotions, how they affect your life, and how to change.In Part 1, you will learn an introduction to the role of emotions in a successful life, coping skills strategies, and how the brain tricks us to believe our self-doubt. In Part 2, armed with these valuable tools, you will continue through a clear plan for change that you can apply and practice on your way to success. In Part 3, you will learn easy self-discovery exercises and tools to find emotional balance by facing our fear, anger management, and relieving depression. In Part 4, you will learn how to maintain emotional balance and find happiness across a range of applications such as motivation issues, relationships problems, and workplace challenges. This inspiring book will help you achieve success and create the life you were meant to have.Additionally, in this valuable self-improvement guide for managing emotions, you will What emotions really are, how they become ingrained into your daily lifeAmazingly effective self-assessment exercises8 powerful ways to conquer fear14 thoughtful tools to manage anger12 easy exercises to quiet our worryTo find motivation to succeed, passion for life and learn to cherish positive relationships with spouses, your children and your friendsInspirational quotes about emotions from great thinkers and the most influential self-help personalities of all timeIn these challenging times dealing with the Covid-19 pandemic, Coronavirus quarantine isolation and social unrest, do you feel depressed, unmotivated, or off your game? Would you like to learn how to live a purpose driven life, based on your true emotional needs? If so, you need to read Manage My Emotions.What are They Saying about Manage My Emotions?A highly recommended read 5 Star Rating Tammy WongTake back control and live our lives to the fullest. 5 Star Rating Rabia TanveerManage your emotions and learn to live well! Dr. Sandra RasmussenWill help a lot of people Penny FletcherAn outstanding job of offering solutions Joel ElstonStop fighting your emotional roller coaster. Dr. Mel CaudleFind the links in the back to free tools and resources such The Emotional Circle, Relaxation Techniques and Meditation Tips.Live Well! Order Now!",
  "genres": [
    "Self Help",
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Personal Development",
    "Emotion",
    "Counselling"
  ],
  "author": "Kenneth J. Martz",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/55298552-manage-my-emotions"
}