{
  "title": "Fela: The Life And Times Of An African Musical Icon",
  "description": "Why black people suffer todayWhy black people don't have money todayWhy black people haven't travelled to the moon todayTHIS is the reason We were in our homeland, without troublesWe were minding our own businessSome people came from a faraway landThey fought us and took our landThey took our people as slaves and destroyed our townsOur troubles started at that time Our riches they took away to their landIn return they gave us their colonyThey took our culture away from usThey gave us their culture which we don't understandBlack people, we don't know ourselvesWe don't know our ancestral heritageWe fight each other every dayWe are never together at all —THAT is why black people suffer today Musician, political critic, and hedonist, international superstar Fela Anikulapo-Kuti created a sensation throughout his career. In his own country of Nigeria he was simultaneously adulated and loathed, often by the same people at the same time. His outspoken political views and advocacy of marijuana smoking and sexual promiscuity offended many, even as his musical brilliance enthralled them. In his creation of afrobeat, he melded African traditions with African-American and Afro-Caribbean influences to revolutionize world music. Although harassed, beaten, and jailed by Nigerian authorities, he continued his outspoken and derisive criticism of political corruption at home and economic exploitation from abroad. A volatile mixture of personal characteristics—charisma, musical talent, maverick lifestyle, populist ideology, and persistence in the face of persecution—made him a legend throughout Africa and the world. Celebrated during the 1970's as a musical innovator and spokesman for the continent's oppressed masses, he enjoyed worldwide celebrity during the 1980's and was recognized in the 1990's as a major pioneer and elder statesman of African music. By the time of his death in 1997 from AIDS-related complications, Fela had become something of a Nigerian institution. In Africa, the idea of transnational alliance, once thought to be outmoded, has gained new currency. In African-America, during a period of increasing social conservatism and ethnic polarization, Africa has re-emerged as a symbol of cultural affirmation. At such a historical moment, Fela's music offers a perspective on race, class, and nation on both sides of the Atlantic. As Professor Veal demonstrates, over three decades Fela synthesized a unique musical language while also clearing—if only temporarily—a space for popular political dissent and a type of counter-cultural expression rarely seen in West Africa. In the midst of political turmoil in Africa, as well as renewal of pro-African cultural nationalism throughout the diaspora, Fela's political music functions as a post-colonial art form that uses cross-cultural exchange to voice a unique and powerful African essentialism.",
  "genres": [
    "Music",
    "Africa",
    "Biography",
    "Nonfiction",
    "History",
    "Jazz",
    "Nigeria"
  ],
  "author": "Michael E. Veal",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/553288.Fela"
}