{
  "title": "The Godmothers",
  "description": "Big Little Lies set in World War II era Greenwich Village! An irresistible, suspenseful novel about four women who marry into an elegant, prosperous Italian family, and then must take charge of the family’s business when their husbands are forced to leave them during the war.Meet the Godmothers: Filomena is a clever and resourceful war refugee with a childhood secret, who comes to America to wed Mario, the family's favored son. Amie, a beautiful and dreamy French girl from upstate New York, escapes an abusive husband after falling in love with Johnny, the oldest of the brothers. Lucy, a tough-as-nails Irish nurse, ran away from a strict girls' home and marries Frankie, the sensuous middle son. And the glamorous Petrina, the family’s only daughter, graduates with honors from Barnard College despite a past trauma that nearly caused a family scandal.All four women become godmothers to one another’s children, finding hope and shelter in this prosperous family and their sumptuous Greenwich Village home, and enjoying New York life with its fine dining, opulent department stores and sophisticated nightclubs.But the women’s secret pasts lead to unforeseen consequences and betrayals that threaten to unravel all their carefully laid plans. And when their husbands are forced to leave them during the second World War, the Godmothers must unexpectedly contend with notorious gangsters like Frank Costello and Lucky Luciano who run the streets of New York City.Refusing to merely imitate the world of men, the four Godmothers learn to put aside their differences and grudges so that they can work together to protect their loved ones, and to find their own unique paths to success, love, forgiveness, and the futures they’ve always dreamed of.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "New York",
    "Audiobook",
    "Book Club",
    "Adult"
  ],
  "author": "Camille Aubray",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/55338975-the-godmothers"
}