{
  "title": "The Ride of Her Life: The True Story of a Woman, Her Horse, and Their Last-Chance Journey Across America",
  "description": "The incredible true story of a woman who rode her horse across America in the 1950s, fulfilling her dying wish to see the Pacific Ocean, from the #1 \n\nNew York Times\n\n bestselling author of \n\nThe Perfect Horse\n\n and \n\nThe Eighty-Dollar Champion\n\n.\nIn 1954, Annie Wilkins, a sixty-three-year-old farmer from Maine, embarked on an impossible journey. She had no relatives left, she'd lost her family farm to back taxes, and her doctor had just given her two years to live--but only if she lived restfully. He offered her a spot in the county's charity home. Instead, she decided she wanted to see the Pacific Ocean just once before she died. She bought a cast-off brown gelding named Tarzan, donned men's dungarees, loaded up her horse, and headed out from Maine in mid-November, hoping to beat the snow. She had no map, no GPS, no phone. But she had her ex-racehorse, her faithful mutt, and her own unfailing belief that Americans would treat a stranger with kindness.Between 1954 and 1956, Annie, Tarzan, and her dog, Depeche Toi, journeyed more than 4,000 miles, through America's big cities and small towns, meeting ordinary people and celebrities--from Andrew Wyeth (who sketched Tarzan) to Art Linkletter and Groucho Marx. She received many offers--a permanent home at a riding stable in New Jersey, a job at a gas station in rural Kentucky, even a marriage proposal from a Wyoming rancher who loved animals as much as she did. As Annie trudged through blizzards, forded rivers, climbed mountains, and clung to the narrow shoulder as cars whipped by her at terrifying speeds, she captured the imagination of an apprehensive Cold War America. At a time when small towns were being bypassed by Eisenhower's brand-new interstate highway system, and the reach and impact of television was just beginning to be understood, Annie and her four-footed companions inspired an outpouring of neighborliness in a rapidly changing world.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Book Club",
    "History",
    "Travel",
    "Animals",
    "Adventure"
  ],
  "author": "Elizabeth Letts",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/55333765-the-ride-of-her-life"
}