{
  "title": "The Eagle's Claw",
  "description": "NATIONAL BESTSELLER • In a “riveting” ( Booklist ) tale that picks up where To Wake the Giant left off, Jeff Shaara transports us to the Battle of Midway in another masterpiece of military historical fiction.Spring 1942. The United States is reeling from the blow the Japanese inflicted at Pearl Harbor. But the Americans are determined to turn the tide. The key comes from Commander Joe Rochefort, a little known “code breaker” who cracks the Japanese military encryption. With Rochefort’s astonishing discovery, Admiral Chester Nimitz will know precisely what the Japanese are planning.But the battle to counter those plans must still be fought.From the American side, the shocking conflict is seen through the eyes of Rochefort and Admiral Nimitz, as well as fighter pilot Lieutenant Percy “Perk” Baker and Marine Gunnery Sergeant Doug Ackroyd.On the Japanese side, Admiral Isoroku Yamamoto is the mastermind. His key subordinates are Admiral Chuichi Nagumo, aging and infirm, and Admiral Tamon Yamaguchi, a firebrand who has no patience for Nagumo’s hesitation. Together, these two men must play out the chess game designed by Yamamoto, without any idea that the Americans are anticipating their every move on the sea and in the air.Jeff Shaara recounts in electrifying detail what happens when these two sides finally meet, in what will be known ever after as one of the most definitive and heroic examples of combat ever seen. In The Eagle’s Claw , he recounts, with his trademark you-are-there immediacy and signature depth of research, one single battle that changed not only the outcome of a war but the course of our entire global history.The story of Midway has been told many times, but never before like this.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "War",
    "Military Fiction",
    "Audiobook",
    "Historical"
  ],
  "author": "Jeff Shaara",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/55333766-the-eagle-s-claw"
}