{
  "title": "Positive Vision: Enjoying the Adventures and Advantages of Poor Eyesight",
  "description": "Author Ken Brandt presents a gloriously positive view of life’s challenges while riding his roller coaster of vision setbacks and improvements. An adventure and humor filled journey that includes: being dragged by galloping horses in Montana, helping firefighters combat an arson blaze, captaining his university parachuting team, and a long convoluted successful chase of a thief in New York City. Complementing the adventures are amusing and relatable anecdotes demonstrating the advantages of poor eyesight. Good eyesight is clearly better than poor eyesight, but it is fun to appreciate the advantages of poor eyesight, such as: longer life, better balance, and better presentation skills. Enjoying these advantages makes life more fun for you and those around you. Brandt presents the bright side of his lifetime with poor vision and slightly crossed eyes, sharing how he worked his way through eyeglasses, contact lenses, a detached retina and cataract operation in each eye, two other eye operations, and many years of being legally blind. Each book purchase helps two great vision causes. Author Ken Brandt is donating 10 percent of his book royalties (5 percent each) to: Massachusetts Eye and Ear, for eye research; and The Fred Hollows Foundation, for ending avoidable blindness. Everyone with even slightly less than perfect eyesight must be a bit adventurous to do some of the same things routinely done by people with normal eyesight. If you are not there yet, you might be in the future: Many people’s vision deteriorates a bit as they age, pushing them into this adventure zone. Enjoy Ken Brandt’s sneak preview in this memoir. A rollicking, rambling ripper of a read. Great for anyone who likes adventure, humor, memoirs, and a bit of inspiration.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Adventure",
    "Biography",
    "Self Help",
    "Humor"
  ],
  "author": "Ken Brandt",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/55334031-positive-vision"
}