{
  "title": "Dabung Girl and A Lost Friend: Superhero comic book for kids ( English graphic novel for children )",
  "description": "In this visually engaging story book, Chintu's sister, Seema, has been missing for six months. Dabung Girl, along with the rescue team, goes on an exciting journey to the city to search for Seema. Will they be able to find her? This story is centered around child trafficking and protecting children from it. Remember, when the going gets tough, #DabungGirl always shows up! The book has been designed in a knowledge partnership with Kailash Satyarthi Children's Foundation. This comic book is a must-read for every child. A new Indian superhero is here, and this time, it is a female superhero, Dabung Girl. She is a fearless hero, who has an elastic body as her superpower. However, unlike some other superheroes, who come and save the day, she helps children find solutions on their own. The imagination, creativity, and fun continues throughout the comic. This comic book inspires children to find their inner superheroes. ★ She inspires them to learn, take action, and break stereotypes.★ Presents India's very own girl superhero with relatable stories on overcoming gender biases.★ Meticulously researched and expertly written, this book is packed with vivid, carefully created artwork, illuminating infographics, and insightfully curated dialogues that make the readers think.★ Validated by educators as a valuable resource to encourage constructive dialogues.★ Dabung Girl always comes forward to help her friends. Her superpower is nano-elasticity, and she can extend her body to reach far and wide in a jiffy. Her super neurons enable her to use her mind and heart at 100% capacity. ★ Each story of Dabung Girl focuses on a specific social issue, such as environment, child protection, sports, etc. Some of these topics are barely touched upon in daily life, while others may be too sensitive for adults to figure out how to convey the message appropriately. This is where Dabung Girl will save the day and the future! It provides a platform for parents to have a more engaging discussion with their kids.★ \"I wanted my daughter to read things that inspire her to strive for success, that fuel her imagination and nurture her creative spirit! I am thankful to Dabung Girl for giving her a superhero she deserves!\" – A caring mother. Does it really work?✓ Research shows that superhero stories give wings to the imagination and confidence of children. Children feel more empowered when they hear stories of superheroes. Often, the problems that seem very difficult can be solved if we believe in ourselves. ✓ The impact of Dabung Girl stories is empowered girls with confidence and knowledge, and at the same time, build gender sensitivity among boys, which is needed to build a better society Do I need to know anything more?♥ Apart from winning hearts, Dabung Girl is also winning several awards. Dabung Girl is also the winner of the best emerging comic book series for children at the prestigious CBAM Awards 2021.♥ Dabung Girl Comics present some of the most inspiring comic book stories ever created. Saurabh Agarwal - Dabung Girl has been created by an internationally recognized life skills educator, Saurabh Agarwal. He brings in his knowledge from Harvard University and has worked in the education sector for many years. Abhishek Singh - A global storyteller and an ex-management consultant with over a decade of experience across health, communications, media, and social sectors. KAVOOOM! So what are you waiting for?Don't forget to check out and read more Dabung Girl and SuperAvni books! ♥♥♥ Other Dabang Girl , Dabangg Girl , दबंग गर्ल",
  "genres": [],
  "author": "Saurabh Agarwal",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/55337911-dabung-girl-and-a-lost-friend"
}