{
  "title": "My Life As A Woman: World Edition: Women Inspiring Women In 2020 And Beyond",
  "description": "The My Life As A Woman Project Initiative travels around the globe to explore the resilience, strength, and true power of women throughout the world.Having every woman's voice heard or read in some way is important because it is women who continue to remind us of our humanity, to love our mothers, our sisters, our daughters, and ourselves. From women all over the world, these are the stories from women, by women, for women, to men and women, about their lives and messages to all the women in the world.Born out of an idea during the COVID-19 quarantine, this project seeks to understand the challenges and successes of women in their everyday lives. The book provides a glimpse into the lives of women from different backgrounds to understand what women around the world have been through, what they are going through, how they overcame their struggles and challenges, to enter into a world where they finally feel successful and comfortable in their own skin.The book explores various countries such as North Korea, Syria, Lebanon, Libya, Iraq, Iran, Pakistan, Saudi Arabia, Israel, Palestine, China, Brazil, Mexico, South Africa, Ethiopia, the United States, and many more. Where we could find women who were willing to share their story, we wanted their voice to be heard, their story to be read, and many women, who do not enjoy the privileges of free speech came forward to share their stories.Under the circumstances and a very unique situation, during the COVID-19 quarantine and lockdown, I realized almost every woman on the planet was at home. This was the perfect time to do this and probably the only time it would ever really be possible for me and them to reply so fast. Asking random women around the world to open up about their lives was very nerve-wracking for me, but I had contacted Valerie first, whom I had worked with before, and I explained the project idea to her, not even sure if she understood what I was asking of her. I had no idea where this project could go, and I just told her to write what was in her heart, and once I received the article from her, it would be Valerie, an African woman from Nigeria, that would lead the way for the potential of this project.\"A Nigerian woman іѕ lіkе a rose growing out оf concrete. Wе are ѕtrоng, rеѕіlіеnt, hardworking, kind, resourceful, fаѕhіоnаblе amongst mаnу оthеr thіngѕ.\" - Valerie on Nigerian WomenAs soon I saw this passage, I knew what this project would be, and I provided the guidelines for how the women should write, although they were given the complete creative freedom to write as their story however they pleased, as long as they shared a glimpse into their lives. And soon, so many other women began to back the project once I told them about it and they were the ones who have made this all completely possible. Due to the nature of the subject, this project did not involve any women that I knew personally.To get the voices of these women, I never physically left my home, but I spoke to many of them first-hand through the Internet to earn their trust and share the reasons why this project initiative needed to happen and why it was important for the world, especially in 2020, to understand why women, now more than ever, can no longer remain silent in a world full of corruption, greed, suffering, hunger, and pain, as many of these women have witnessed firsthand and are still observing on a daily basis.It was not easy to convince every woman that she should be a part of this project. Many women were skeptical, and of course, women have every reason to be for the way the world has treated them. Fortunately, I do try to do more good than evil in this world, and they understood what I was trying to do.The message from women is Women are Resilient. Women Are Strong. Women Are Powerful.",
  "genres": [],
  "author": "Matthew Gates",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/55333916-my-life-as-a-woman"
}