{
  "title": "A Passion for Nature: The Life of John Muir",
  "description": "In Donald Worster's magisterial biography, John Muir's \"special self\" is fully explored as is his extraordinary ability, then and now, to get others to see the sacred beauty of the natural world. A Passion for Nature is the most complete account of the great conservationist and founder of the Sierra Club ever written. It is the first to be based on Muir's full private correspondence and to meet modern scholarly standards. Yet it is also full of rich detail and personal anecdote, uncovering the complex inner life behind the legend of the solitary mountain man. It traces Muir from his boyhood in Scotland and frontier Wisconsin to his adult life in California right after the Civil War up to his death on the eve of World War I. It explores his marriage and family life, his relationship with his abusive father, his many friendships with the humble and famous (including Theodore Roosevelt and Ralph Waldo Emerson), and his role in founding the modern American conservation movement. Inspired by Muir's passion for the wilderness, Americans created a long and stunning list of national parks and wilderness areas, Yosemite most prominent among them. Yet the book also describes a Muir who was a successful fruit-grower, a talented scientist and world-traveler, a doting father and husband, a self-made man of wealth and political influence. A man for whom mountaineering was \"a pathway to revelation and worship.\"For anyone wishing to more fully understand America's first great environmentalist, and the enormous influence he still exerts today, Donald Worster's biography offers a wealth of insight into the passionate nature of a man whose passion for nature remains unsurpassed.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Nature",
    "History",
    "Outdoors",
    "Science",
    "Environment"
  ],
  "author": "Donald Worster",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/5533235-a-passion-for-nature"
}