{
  "title": "Someone Else's Daughter",
  "description": "A woman can never make herself too tough, too strong, or too street smart.\nTHE SEARCHING MOTHERMiranda Steele. Smart-talking, hot pepper-eating loner whose abusive ex-husband stole her baby and gave it up for adoption. She comes to Atlanta to hunt for her daughter.THE PIWade Parker. Wealthy owner of the Parker Investigative Agency, ace detective, and the most eligible forty-four-year-old bachelor in Atlanta. He still mourns the death of his socialite wife but must now solve a disturbing murder case.THE MURDERERA serial killer strangling young girls in a bizarre ritual. Why?She doesn't need a man.He needs to find a killer.Together, can they save a thirteen year old girl?********\"Highly charged and emotional... Read it with tissue from the very beginning.\" Pamela Mason.\"It was a great read, honestly couldn't put it down and can't wait to read the next one.\" Cathie - Sydney, Australia\"Miranda Steele is one ballsy lady...what I'd call 'one HOT pepper!'\" Diane Kratz - crime fiction writer********Someone Else's Daughter is the first book in the popular Miranda's Rights Mystery series, the emotional story of a stubborn loner looking for her stolen daughter. Buy this intriguing thriller for a story readers say they can't put down.THE MIRANDA'S RIGHTS MYSTERY SERIESSomeone Else's Daughter - Book IDelicious Torment - Book IIForever Mine - Book IIIFire Dancer - Book IVThin Ice - Book VTHE MIRANDA AND PARKER MYSTERY SERIESAll Eyes on MeHeart WoundsClowns and CowboysThe WatcherZero Dark ChocolateTrial by FireSmoke ScreenOTHER SUSPENSE BOOKS BY LINSEY LANIERChicago Cop (A cop family thriller)Steal My Heart (A Romantic Suspense)HUMOROUS BOOKS BY LINSEY LANIERYou Want Me to Kill Who? (A Dandy Frost--Ninja Assassin Story) #1You Want Me to Go Where? (A Dandy Frost--Ninja Assassin Story) #2The Clever Detective Boxed Set 2 (A Fairy Tale Romance): Stories 1-5",
  "genres": [
    "Mystery",
    "Romance",
    "Fiction",
    "Thriller",
    "Romantic Suspense",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Linsey Lanier",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/12675958-someone-else-s-daughter"
}