{
  "title": "Queen of Nightmares",
  "description": "EvoraI am the epitome of beauty, yet I am haunted. I sense the auras of others, and their emotions explode inside my mind. My form is ever-changing, my body morphing into what those around me would prefer to see. No one knows what I truly look like. Not even I know my true shape, but something is seething deep in my bones, warning me I won’t like the view when I find it. I have a feeling it’s the reason Mimzy, the woman who raised me, sent me running. The citizens of my world fear me. The leaders want to use me for something dangerous, something sadistic, so they’ve sent one of their most terrifying criminals to capture me. He’s been locked up in the Prison of Nightmares for decades, brewing in his hate, his wickedness.His darkness.They call him The Bringer of Nightmares, the demon who infests the dreams of the living. A coiled snake ready to strike at any moment.A ravenous beast ready to devour. And he’s coming for me. CreedI have no fears because I am the thing that is most feared. I’m evil, cunning, and devious. To survive in this prison I’ve had to fight, kill, and conquer. My soul has become a rotten and tattered thing, and I’ve let most of it die so that I can be what I need to be. The Bringer of Nightmares.I am good at what I do, but I am powerless. Until my father, the King of Aisling and the man I loathe, comes to me with a bargain that’s hard to refuse. He’s offering me the one thing I crave more than anything.Freedom.In exchange, I am to bring him the creature called Evora, supposedly one of the most evil beings in existence. Legendary throughout our world for her alluring beauty and addictive seduction, it’s the perfect combination for luring in her prey. Little does she know she’s about to become my prey. She thinks fleeing to Earth will save her, but she can’t escape me. I’m coming for her. (Disclaimer: This is a dark paranormal romance. The main male character is an antihero. Some themes may be triggering. 18+)",
  "genres": [],
  "author": "T.  Steele",
  "average_rating": "1.00",
  "url": "https://www.goodreads.com/book/show/55321688-queen-of-nightmares"
}