{
  "title": "The Complications: On Going Insane in America",
  "description": "An unflinching, rare account of living with severe mental illness that is also a bold commentary on how we misunderstand this often debilitating disease.The Complications is an intimate portrait of what it's like to live with schizoaffective disorder of the bipolar type as well as a biting, revelatory critique of America's mental health culture. Journalist Emmett Rensin has been hospitalized and jailed. He has lost jobs and friends, cycled through a daunting combination of medications, written and edited articles for major national media outlets, and taught writing at prestigious schools, most recently the esteemed Iowa Writers Workshop. With scorching honesty, he reflects on his messy, fragile attempt to live his life, the tremor in his hands, his periods of grace, his difficulty reading social situations, and his near misses with disaster and death.Rensin confronts the current dysfunction in current mental health narratives, contrasting what he calls \"high culture\" mental illness--in which we affirm the prevalence of anxiety and encourage regular therapy--and society's difficulties acknowledging people outwardly struggling with more severe forms of mental illness--individuals we pass on the street who talk to themselves and are often caught in a loop between hospitals and prisons. Rensin has experienced the darkest depths of mental illness; he speaks frankly about how we came to ignore and undertreat people like him and how we can--and must--do better.With raw honesty, Rensin invites us into every aspect of his life, from what it's like see four different psychiatrists in one year and the nature of psychotic breaks to a harrowing diary that logs exactly what happens when he stops taking his medication and the unexpected kinship he discovers with a serial killer who shares his diagnosis.A compelling, often devastating, yet hopeful blend of memoir, cultural commentary, and history, The Complications elevates the conversation around mental illness and challenges us to reexamine what we think we know about mental health and wellbeing.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Psychology",
    "Mental Health",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Emmett Rensin",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/55335632-the-complications"
}