{
  "title": "Black Water Sister",
  "description": "A finalist for the 2022 World Fantasy Award for Best NovelOne of BookPage's Best Science Fiction and Fantasy Books of 2021\n \nOne of Tor.com Reviewers' Choice Best Books of 2021\n \nOne of Book Riot's Best SFF Standalones of 2021\n \n“Ghosts. Gods. Gangsters. Black Water Sister has it all…a wildly entertaining coming-of-age story for the twentysomething set, with a protagonist who is almost painfully relatable at times.”—Vulture\n  \"A twisty, feminist, and enthralling page-turner.\"—BuzzFeed  \"A sharp and bittersweet story of past and future, ghosts and gods and family.\"—Naomi Novik, New York Times bestselling author of A Deadly Education  A reluctant medium discovers the ties that bind can unleash a dangerous power in this compelling Malaysian-set contemporary fantasy.    When Jessamyn Teoh starts hearing a voice in her head, she chalks it up to stress. Closeted, broke and jobless, she’s moving back to Malaysia with her parents – a country she last saw when she was a toddler.She soon learns the new voice isn’t even hers, it’s the ghost of her estranged grandmother. In life, Ah Ma was a spirit medium, avatar of a mysterious deity called the Black Water Sister. Now she’s determined to settle a score against a business magnate who has offended the god—and she's decided Jess is going to help her do it, whether Jess wants to or not.Drawn into a world of gods, ghosts, and family secrets, Jess finds that making deals with capricious spirits is a dangerous business, but dealing with her grandmother is just as complicated. Especially when Ah Ma tries to spy on her personal life, threatens to spill her secrets to her family and uses her body to commit felonies.  As Jess fights for retribution for Ah Ma, she’ll also need to regain control of her body and destiny – or the Black Water Sister may finish her off for good.",
  "genres": [
    "Fantasy",
    "LGBT",
    "Fiction",
    "Queer",
    "Urban Fantasy",
    "Lesbian",
    "Adult"
  ],
  "author": "Zen Cho",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/55354170-black-water-sister"
}