{
  "title": "Lady Guinevere and the Rogue with a Brogue",
  "description": "an alternate cover edition can be found hereFive years ago he humiliated her. Five years ago she betrayed him. And when fate forces them together once more, they’ll discover what burns hotter—vengeance or desire. Lady Guinevere Darlington has spent the last five years trying to forget the beautiful rogue who stole her heart and then crushed it under his shiny black hessian. Humiliated by the blighter with the unforgettable brogue and left to weather the wagging tongues of the ton alone, she started a secret society that delivers justice to ill-intentioned rakes, and she managed to avoid having to wed—until now. But while her time is up, her determination is not. If she must take a husband, she’ll do so on her own terms. She has a plan, and a possible candidate, until the Scot she once loved returns to London and throws her life into salacious turmoil yet again.Asher Talbot, the newly minted Duke of Carrington, has nearly perfected his ability to repress memories of the stunning, stubborn lass who long ago captivated him with her innocent charm, then slayed him with her duplicity. He channeled his anger into continuing to build the distillery empire he started when he thought he was a by-blow. But now his company is in danger, and he intends to secure his inheritance to save it, even if it requires pursuing the perfidious enchantress he disavowed. True reconciliation is not part of his plot, but hints of the Guinevere he thought he knew leave him questioning everything.When fate, fortune, and a cunning scheme bring these two together, their mutual attempts to torture each other ignite the dormant desire between them. But secrets surround them, and they’ll have to unravel each one before the love they glimpsed is lost forever.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Amazon",
    "Historical Fiction",
    "Regency",
    "Fiction"
  ],
  "author": "Julie Johnstone",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/55361479-lady-guinevere-and-the-rogue-with-a-brogue"
}