{
  "title": "Saved",
  "description": "From Book 1: \"A fantastic new vampire series!\" --Morgan Rice, #1 Bestselling author of THE VAMPIRE JOURNALS  In SAVED (Book #1 of the Shadow Vampires), Keira and Amanda, twins, move with their family to a new town, and start their senior year at a new high school. But though they are twins, the girls have different fates. Amanda, beautiful, popular, is sought out by everyone. Keira, who has always lived in Amanda’s shadow, is smaller, awkward, different. Even her mother, who is so close to Amanda, doesn’t know what to make of her other daughter. Keira turns to books, and to her journal, for solace, and to find out about other worlds.  Amanda makes friends easily at the new school, and quickly finds a boyfriend, while Keira is left alone, an outsider. But very quickly, it is clear that something strange is going on in Everstock. The town and the school are very divided. The popular, rich kids act as if they own the school and have nothing to do with the other kids, who are poorer and live in a different part of town. Not only are the kids meaner here, but an unknown infection has gripped the town, with more and more people going to the hospital. Something here is terribly wrong.  But things change suddenly, as there is a terrible accident involving the twins. Not only are Keira and Amanda’s lives changed forever, but a new dimension of life begins to open to Keira.  As Keira recovers, she begins to change in ways she can’t expect, receiving new and mysterious powers that no one can possibly understand. At the same time, a gorgeous, mysterious new boy, Cooper, appears at the school, who grips her imagination, and who refuses to tell her what secret he is hiding.  As Keira and Cooper grow closer to each other, it soon becomes apparent that destiny has brought them together—and that they may each have to sacrifice it all if they want to stay together…  Book #2 in the Shadow Vampire series (TOUCHED) is now also available, and Book #1 in Allegra's new fantasy series, CHARLOTTE TWEED AND THE SCHOOL FOR ORPHANED DRAGONS (Book #1) is now also available!",
  "genres": [
    "Vampires",
    "Paranormal",
    "Young Adult",
    "Fantasy",
    "Romance",
    "Fiction",
    "Paranormal Romance"
  ],
  "author": "Allegra Skye",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/12676872-saved"
}