{
  "title": "Gutter Mind: Smoke Valley MC",
  "description": "— Face of an angel. Mind in the gutter.---Mike. Macho Biker. Scarred. Will never love again.Arden. Femme boy. Jaded. Will never succumb to lust again.Mike is always on the lookout for a fresh fling, and there are more than enough chicks for a stud like him at the Smoke Valley MC clubhouse. But the pretty little thing he spots at the gas station turns out to be a boy, and that triggers all sorts of confusion.Mike loves a challenge, so when he’s given the cold shoulder, his predator senses are set aflame! Straight or not, Mike makes a bet with his cousin and won’t settle for anything other than a total seduction of Arden.Arden has bigger fish to fry than some biker’s petty insecurities. His last relationship has left him jaded and hurt, so he will never again succumb to the charms of a bad boy. Especially since Mike isn’t just hot, he’s freaking irresistible. Older, dangerous, and cocky, Mike will be Arden’s downfall if he isn’t careful.But when a monster from Arden’s past reaches out his claws, the only deterrent Arden can think of is claiming Mike is his new boyfriend. So now he’s stuck in a fake relationship with a straight guy.For Mike, what starts as a game turns out to be an awakening he’d never expected. The ice prince in lace is actually hot as hellfire, with a gutter mind to match Mike’s, and all of a sudden, his scarred heart is not as safe as he’d thought it was.WARNING: This story contains scenes of violence, mentions of past abuse, offensive language and morally ambiguous characters.POSSIBLE SPOILERS:\nThemes\n: fake relationship, bet, ice prince, player, gay-for-you, crossdressing, outlaw biker gang, self-discovery, age gap, protector, lingerie, commitment-phobe, big family\nGenre\n: Scorching hot M/M romance, romantic suspense\nLength\n: ~ 95,000 words (Standalone)",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Gay For You",
    "LGBT",
    "Audiobook",
    "Dark Romance"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/55344413-gutter-mind"
}