{
  "title": "The Halloween Store, and Other Tales of All Hallows' Eve",
  "description": "When you first enter The Halloween Store, things seem normal. Fun and frightful decorations, ghastly costumes and masks of the season, and bags of candy galore. Then, as you travel farther into its shadowy depths, things begin to change. The air smells of damp autumn leaves and candle-scorched pumpkin. The shelves of All Hallows’ Eve fare grow darker and more disturbing. Strange and unsettling things of Halloweens past and present lurk amid the cobwebs and dust…Four trick-or-treaters purchase vintage costumes from a strip-mall shop, only to discover that they must sign a mysterious disclaimer for the Halloween celebration to come…After a man’s missing daughter is found–near death and physically altered–he must once again face a horrifying monster from his own childhood…A teenage girl hitches a ride after a Halloween rock & roll concert, only to learn that her favorite singing idol has made a pact with the Devil himself…Three kids receive unusual treats during a Halloween stop at their favorite teacher’s house…During a random visit to his hometown, a businessman treats a young boy to the joy and excitement of a Halloween festival, only to find that things are not what they first appeared to be…A rash of ghoulish jack-o’-lanterns leads a small-town sheriff to the doorstep of one of the most notorious serial killers of all time…An advertisement in the back of an old comic book prompts two friends to place an order that they soon come to regret…Seven horrific tales and two nostalgic essays… hand-picked for your Trick-or-Treat bag. With the arrival of a 2020 Halloween, there is no telling what terrifying treats and petrifying prizes may await you!",
  "genres": [
    "Horror",
    "Halloween",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Collections",
    "Horror Thriller"
  ],
  "author": "Ronald Kelly",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/55356753-the-halloween-store-and-other-tales-of-all-hallows-eve"
}