{
  "title": "Electric: Best Lesbian Erotic Fiction",
  "description": "An Excerpt Petal Sweat By Susan Kan Rhonda Nickels never considered herself a poet, but lately she was drawn to the magnetic poetry kit on the refrigerator in the staff room at the women's health clinic where she worked. The lunchroom was a difficult place for her, she being shy and newly hired. Instead of trying to talk with the other nurses, most of whom spoke about their weekend escapades, dating dilemmas, or children, she would stand at the refrigerator, sipping from her milk carton. Rhonda was interested in their conversations, she had to admit, but she didn't know how to participate comfortably. A recent graduate from a nursing school in a small Midwestern town, Rhonda's move to Boston had been a big change. Her family back home had been opposed to her leaving, but Rhonda felt the pull of the ocean, the salt spray, and the warm dunes calling out to her. Timid as she was, a kernel of adventurousness was burning inside her. At 31 years old, she felt it was now or never. At the clinic she was efficient and well-versed in the language of the body, but she interacted with the patients as though they had brought their cars in for tune-ups and repairs. She could say the words breast, vagina, cervix, fallopian tubes, and Pap smear as easily as mountain, elevator, door, subway, and lunch. Rhonda pulled the tiny magnets around the sit there and I can cook eggs and meat Not very poetic. The next day she made a list of rhyming make lake steak bake fake take One day, about a month into her new city life, as she searched for words, she noticed on the side of the refrigerator facing away from the room a line of words all by we am love by doing Rhonda looked sheepishly around the room to see if anyone saw her. The others were absorbed in the latest People magazine, the one with The First Wives Club actresses on the cover. Turning back to the five simple words, Rhonda thought, Bad grammar . Then after thinking a moment, she wondered, We am love by doing what? Obviously, as a nurse, she knew. She knew what the books said. But as much as she hated to confess this, she had never been in love, and she had",
  "genres": [
    "Lesbian",
    "Erotica"
  ],
  "author": "Nicole  Foster",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1267681.Electric"
}