{
  "title": "Dreams of Darkness and Desire",
  "description": "Kira Lockwood has moved in with her best friend, developed a loving relationship with her boyfriend, and is excelling in her dance classes. Everything was perfect until she is suddenly plagued by unusual dreams and nightmares. And to make things more complicated, the man who haunts those very dreams has just moved in down the street. Their attraction is undeniable, but she struggles to understand why he torments her at night while she sleeps. Her dreams are erotic, shifting from seduction to drowning, burial, and abduction in the span of seconds. But dreams aren’t real… or are they? Blake Michaelson is a handsome and powerful centuries-old warlock. He and his three brothers have moved to New Orleans in search of one thing - Kira Lockwood. Though she does not know it, she is a descendent of the first Supra Virtutem, a witch with the ability to harness the ultimate power. He and his brothers have spent a lifetime, hunting others like them, and claiming their magic as their own. To ensure their immortality, Blake must complete the Order of Three: claim her body, take her blood, and end her life.Kira will not ascend and harness her power until her 21st birthday but her magic lives within her and her light recognizes the darkness. Will the power within her be enough to save her? Or will Blake complete his mission and steal her power before she steals his heart?TRIGGER WARNINGS INCLUDE BUT NOT LIMITED TO: Graphic sexual content. Masochism. Sadism. Graphic acts of violence. Graphic acts of murder, human sacrifices and rituals. Acts of manipulation. Manipulative torture tactics. Sensory deprivation. Physical assault. Mentions of assault. Mentions of sexual assault. Mentions of mental health issues. Threats of both physical and sexual assault. Dubious consent. Mentions of illegal drugs. Alcohol use and excessive drinking. Bad language.",
  "genres": [
    "Fantasy",
    "Romance",
    "Witches",
    "Paranormal",
    "Fantasy Romance",
    "Magic",
    "New Adult"
  ],
  "author": "B.L.  Cagle",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/55349339-dreams-of-darkness-and-desire"
}