{
  "title": "Hostage In Time",
  "description": "For photographer Amanda Lloyd, being hired to film the historic Serenity house, home of Thomas Edison's patent attorney Jonathan Brisbane, is a straightforward gig. Filming during re-enactment day, Amanda begins to explore the home, including the prohibited third floor. Suddenly and without warning, Amanda finds herself transported back in time to 1884 where, because she is brandishing her camcorder that he mistakes for a weapon, she is accused by Brisbane himself of being a spy in search of Edison's secrets. Immediately placed under house arrest, she finds herself a hostage to history. She quickly becomes accustomed to the lifestyle and routine of the time and begins to grow closer to Jonathan. The quiet of their growing love is shattered when a scorned traitor sets them up, forcing the pair to work together to unravel the secrecy of missing documents before Amanda is arrested for treason and history is changed forever. With the help of a spiritualist medium, they are able to find and understand their destiny but is it already too late?An exciting, mind-bending trip down the time-travel rabbit hole, Linda Lauren's debut novel is a seemingly never-ending series of twists and turns that constantly keeps you guessing. Full of romance and intrigue, the juxtaposition of times and cultures serves as an extraordinary reminder that time and place matter little when it comes to human nature despite technological advancements, changes in politics and sophistication, in our essence, we remain the same. At its core, this spiritual journey to find the truth of self is a quest for reconciling our past with our present, our heart with our minds, and the knowledge that who we are is not transient, but fixed, regardless of the gadgets at our disposal. Deftly capturing the mysterious spiritual journey while simultaneously building romantic and life-threatening tensions, Hostage in Time will leave you guessing until the final climactic sequence.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Linda Lauren",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/12677131-hostage-in-time"
}