{
  "title": "Achieve: Overcome Obstacles. Find Time for Greatness. Develop a Framework to Achieve Anything.",
  "description": "Achieve is a book designed with one purpose in mind; to take your amazing ideas from your head and bring them to this world by using easy to learn skills applied by only the highest Achievers.I was in a near fatal motorcycle accident, I've been on the edge of financial collapse, I suffered through a terrible divorce, the break-up of my dream family life and have been riddled with depression and anxiety.And for the longest time I thought that achieving important goals was only for other people who followed the rules, were more outgoing and people who knew how to finish.But then I started to study the path others took to achieve success and I realized that they shared many things in common. And that they each followed a process that created their own Achievement Formula. And I started to apply it.Once you have the process I personally use, you will find yourself with more confidence, more clarity, and able to act faster with less doubt, stress, or confusion.You'll learn The Truth About Overcoming Obstacles is BeliefIn Achieve I deliver you both the road map and the secrets that high achievers use to overcome whatever is in their way and achieve that next level of life.With this book you'll learn how to eliminate excuses and believe any idea is possible.You'll also gain THE ABILITY TO TAKE ACTION AND FOLLOW THROUGHAnd once you have that, you're ready for what might be the most important thing of all. CONFIDENCE THAT NOTHING IS IMPOSSIBLE.In today's world, it's all about this one question: Do you have the ATTITUDE TO ACHIEVE?Most people never bother to find out what true achievement is ...much less take the time to cultivate the skills necessary to achieve their dreams.But it's not difficult ...and it can be mastered at any age and I give you the recipe to follow so you can have these skills by the time you are done reading Achieve.So as you can see, this is going to be MUCH than you're expecting.",
  "genres": [],
  "author": "Michael J.   Lee",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/55368730-achieve"
}