{
  "title": "What Fears Become: An Anthology from The Horror Zine",
  "description": "From classic horror and pure suspense to Twilight-Zone-style dark fantasy, WHAT FEARS BECOME relentlessly explores our basic fears and leaves you with twisted endings that will make your skin crawl…This spine-tingling, international anthology contains contributions from the critically acclaimed online horror magazine, The Horror Zine, and features bestselling authors such as Bentley Little, Graham Masterton, Ramsey Campbell, Joe R. Lansdale, Elizabeth Massie, Ronald Malfi, Cheryl Kaye Tardif, Melanie Tem, Scott Nicholson, Piers Anthony, Conrad Williams, and many more.Edited by Jeani Rector of The Horror Zine and featuring a foreword by award-winning, bestselling author Simon Clark, it also contains deliciously dark delights from morbidly creative writers, poets and artists who have not yet made it big--but will very soon.Come and discover…WHAT FEARS BECOME Table of Contents Foreword by Simon A Small Matter of Life and DeathFictionBAST by Christian A. LarsenDOGLEG by Bentley LittleA BAD STRETCH OF ROAD by Dean H. Wild THE HOUSE AT THE END OF SMITH STREET by Stephen M. DareGNAW by Lala DronaREFLECTION OF EVIL by Graham MastertonWANDERING DANIEL by Jagjiwan SohalNEXT TIME YOU'LL KNOW ME by Ramsey Campbell3 AM by James MarlowLOSING JUDY by Andy MeeFISH NIGHT by Joe R. LansdaleMETHODS OF DIVORCE by Philip RobertsAND BABY, YOU CAN SLEEP WHILE I DRIVE by Elizabeth MassieCHUPACABRA by Ronald MalfiTHE ORPHANS OF LETHE by Rachel ColesBONFIRE NIGHT by Chris CastleTHE PRODUCT by Bruce MemblattOUIJA by Cheryl Kaye TardifFRY DAY by Melanie TemTHE CHAMBER by David LandrumCHRISTENING by Scott NicholsonLOST THINGS by Piers AnthonyA NEW DAY by Larry GreenRED KING by Jessica HandlyYOU SAID ALWAYS AND FOREVER by Richard HillUBIRR by Conrad WilliamsBONES IN THE MEADOW by Tim JeffreysADELLE'S NIGHT by David K. GinnBONES FOR A PILLOW by Alexandra SeidelMALL WALKERS by Chris ReedWHAT THE BLIND MAN SAW by C. Dennis MoorePoetryEmon AnthousisDennis BagwellJohn T. CarneyTeresa Ann FrazeeJohn GreyChristopher HivnerJean JonesRon KoppelbergerAlec B. KowalczykJoe R. LansdaleEverett MadridJuan PerezNathan RowarkStephanie SmithPaul SoharPeter SteeleAnna TaborskaScott H. UrbanThe ArtistsThomas Bossert Ricardo Di Ceglia Kalynn Kallweit Daniel Kirk Joseph Patrick McFarlane Felicia Olin Tatomir Pitariu Elizabeth Prasse April A. Taylor Editor's CornerHORRORSCOPE by Jeani RectorTHE HOUSE ON HENLEY WAY by Jeani Rector",
  "genres": [
    "Horror",
    "Anthologies"
  ],
  "author": "Bentley Little",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/12677382-what-fears-become"
}