{
  "title": "Marco Polo: From Venice to Xanadu",
  "description": "As the most celebrated European to explore Asia, Marco Polo was the original global traveler and the earliest bridge between East and West. A universal icon of adventure and discovery, he has inspired six centuries of popular fascination and spurious mythology. Now, from the acclaimed author of Over the Edge of the World: Magellan’s Terrifying Circumnavigation of the Globe (“Superb . . . A first-rate historical page turner”— The New York Times )—comes the first fully authoritative biography of one of the most enchanting figures in world history. In this masterly work, Marco Polo’s incredible odyssey—along the Silk Road and through all the fantastic circumstances of his life—is chronicled in sumptuous and illuminating detail.We meet him as a callow young man, the scion of a wealthy Venetian merchant family, only seventeen when he sets out in 1271 with his father and uncle on their journey to Asia. We see him gain the confidence of Kublai Khan, the world’s most feared and powerful leader, and watch him become a trusted diplomat and intelligence agent in the ruler’s inner circle. We are privy to his far-flung adventures on behalf of the Khan, living among the Mongols and other tribes, and traveling to magical cities, some far advanced over the West. We learn the customs of the Khan’s court, both erotic and mercantile, and Polo’s uncanny ability to adapt to them. We follow him on his journey back to Venice, laden with riches, the latest inventions, and twenty-four years’ worth of extraordinary tales.And we see his collaboration with the famed writer Rustichello of Pisa, who immediately saw in Polo the story of a lifetime; enlivened by his genius for observation, Polo’s tales needed little embellishment. Recorded by Rustichello as the two languished as prisoners of war in a Genoese jail, the Travels would explode the notion of non-Europeans as untutored savages and stand as the definitive description of China until the nineteenth century.Drawing on original sources in more than half a dozen languages, and on his own travels along Polo’s route in China and Mongolia, Bergreen explores the lingering controversies surrounding Polo’s legend, settling age-old questions and testing others for significance. Synthesizing history, biography, and travelogue, this is the timely chronicle of a man who extended the boundaries of human knowledge and imagination. Destined to be the definitive account of its subject for decades to come, Marco Polo takes us on a journey to the limits of history—and beyond.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Travel",
    "Asia",
    "China",
    "World History"
  ],
  "author": "Laurence Bergreen",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/553783.Marco_Polo"
}