{
  "title": "The Cowboy and the Yogi: Ideals Shared by India and America",
  "description": "India, like America, is a country that nourishes creative individuality. Just as Americans have been inspired by the archetype of the Cowboy, who wanders the open spaces in search of a dream, so Indians are inspired by the Yogi, who wanders inner spaces in search of realization. The essential difference between the two cultures is that Americans demand freedom from rules, and India is a country with lots of rules—that everybody breaks. Indians praise obedience to tradition, but when push comes to shove, it is always the inner voice of intuition that wins out—an intuition that, at its best, inspires each individual to preserve the essence of the tradition as he or she changes it. For 25 years, Teed Rockwell wrote a monthly column for India Currents magazine on all aspects of Indian music, ancient and modern, classical and popular. His goal was to be an ambassador for Indian music, as Leonard Bernstein had been for European music, aspiring to make it comprehensible and enjoyable to everyone. This book is a collection of Rockwell’s best columns, grouped by subject matter, with additional commentary written especially for this book. The first chapter is devoted to the Allauddin Khan Gharana, which includes Ali Akbar Khan, his sons Alam and Aashish, and Ravi and Anoushka Shankar. There are articles on Classical Indian musical styles, such as Dhrupad, Thumri, and Qawwali, as well as introductions to Indian music theory that could be used in college or high school courses. There are chapters on Indian folk and contemporary music, from Bollywood, to Bhangra, to the world fusion music that arises when cultures collide. And there is a chapter on the complicated relationship between music and Islam. Teed Rockwell took hundreds of classes with Ali Akbar Khan, Shahid Parvez, and other great Indian classical musicians, He is philosophy lecturer emeritus at Sonoma State University, and his writings on the philosophy of cognitive science have been published by MIT press, and in numerous academic journals. He is the only person in the world to play Indian classical and popular music on an instrument he calls the touchstyle Veena. His music videos can be found at www.bollywoodgharana.com",
  "genres": [],
  "author": "Teed Rockwell",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/55371107-the-cowboy-and-the-yogi"
}