{
  "title": "Space Taxis",
  "description": "He's abducted by aliens to the planet Vost.He's saving up for his fare home.But he's got the small matter of a planetary apocalypse to deal with first...In 1977 a New York Cab driver Mike Redolfo is abducted by aliens after being mistaken for a renegade scientist. Meanwhile, back in 1944 a mysterious man and his Jewish fiancée are fleeing across Nazi-occupied Europe.Redolfo tries to keep a low profile on his new world whilst earning his fare home, but unwittingly gets involved with a shady gang of alien criminals, inadvertently bringing the planet to the brink of catastrophe.As the link between the timelines becomes clear, Redolfo must discover secrets from the past that may hold the key to saving the planet.If you like The Hitchhiker's Guide to the Galaxy, Kurt Vonnegut's Slaughterhouse 5, and Frank Herbert's Dune, you'll love this gripping and entertaining sci-fi mystery thriller.What others are saying about Space Taxis:★★★★★ 'A triumph of high adventure.' Readers' Favorite★★★★★ 'VERY highly recommended.' Goodreads★★★★★ 'This is a fun SciFi read.' Netgalley★★★★★ 'An entertaining sci-fi adventure in the tradition of Douglas Adams.' Amazon reviewer★★★★★ 'What a gripping, unputdownable story.' Amazon reviewer★★★★★ 'I loved every minute of this book, it's just the sort of sci-fi I really enjoy, good storyline, quirky characters and so much humour. If you're a fan of Hitchhikers, Chronicles of St Mary's and Red Dwarf this will definitely be right up your alley!' Goodreads★★★★★ 'Don't hesitate in buying Space Taxis. You won't regret it - in fact, you'll probably be reading it again and again, AND recommending it to all your friends and relatives.' Jude Gwynaire, Author of Aliens in My Garden Space Taxis has been awarded the 5-star seal by Readers' Favorite.Don't miss out. Review\"This anti-gravity rollercoaster of a book is a real page-turner for me. It's a genuine original full of interesting characters and enthralling storylines. If you're looking for something new and exciting to get into I would highly recommend.\" Goodreads\"Space Taxis is a goddam crazy ride...I want a proximity klaxon on my Ford!\" Chris Malone, author of Zade and #StoptheGlitch'If Space Taxis does not sound like a story that sprang out of the minds of two wildly imaginative storytellers, no story ever will... Adam and Harriet Frosh have written a novel that is a triumph of high adventure. This can even translate to an entertaining film adaptation that would have an appeal-like Total Recall or The Fifth Element. Redolfo's abduction, his time spent on another planet, and how it changes him are what give the story life, depth, and humanity. Reading it is a good form of cerebral entertainment.' Readers' Favorite'I absolutely loved Redolfo's story.' Netgalley'Fans of both science fiction and historical fiction will love Space Taxis - five stars.' Eric Balch, Author of Assault on Devil's DenSpace Taxis has been awarded the 5-star seal by Readers' Favorite.",
  "genres": [
    "Science Fiction",
    "Humor",
    "Alternate History",
    "Space Opera",
    "Fantasy"
  ],
  "author": "Adam Frosh",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/55375798-space-taxis"
}