{
  "title": "Slipping into Paradise: Why I Live in New Zealand",
  "description": "In the tradition of Under the Tuscan Sun and A Year in Provence, here is Jeffrey Moussaieff Masson’s ode to his personal paradise–his adopted home, New Zealand. After living in California, why did Masson settle– out of all the places on earth–in such a faraway land? It turns out that while visiting a beautiful sandy beach just fifteen minutes from bustling Auckland, Masson and his family were utterly seduced by the exotic locale. There was little deliberation. This place, surrounded by lush forest on a bay dotted with volcanic islands, would be their new home.Masson takes readers on a remarkable journey to another world, as he and his family “slip into” the paradise that is New Zealand. For anyone who has ever dreamed of finding utopia, Masson reveals a country where neighbors talk to one another and provide a sense of real community–rarely, outside of the big cities, locking their doors–and where politics are as mellow as the weather. New Zealand is also a land of spectacular scenery, made even more famous for being the shooting location for the Lord of the Rings films. The flora is plentiful. Mangroves, banana plants, papaya trees, and more than ten thousand species of ferns grow wild and freely. The fauna is benign. There are no snakes, tarantulas, or scorpions. Children can walk to school barefoot without a care– there is nothing to sting them, bite them, or give them a rash. In the blue waters near the lush coastline, dolphins and orcas abound. While describing his love affair with the country and his affinity for its citizens, Masson reflects on the meaning of home, the importance of acting on intuition, and what happens when we lose our connection to the place we live in. Responding to an impulse, Masson reveals, he realized a dream.Featuring a its glossary of phrases used by New Zealanders and important Maori words, as well as the author’s recommended travel itinerary, Slipping into Paradise is ideal for anyone planning a visit to this exquisite land. Full of photographs, delightful anecdotes, and little-known facts (jogging, for example, was invented in New Zealand), Slipping into Paradise is also a book for those who fantasize about dramatically changing their lives–and who imagine something better for themselves. Jeffrey Masson’s message: New Zealand awaits.From the Hardcover edition.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "History",
    "Nature",
    "Biography"
  ],
  "author": "Jeffrey Moussaieff Masson",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/553657.Slipping_into_Paradise"
}