{
  "title": "First and Tension",
  "description": "It all started with a dare.Emily Flanagan has been living her dreams the last four years as a professional cheerleader for the Los Angeles Vipers, thousands of miles away from her tiny hometown of Summersweet Island, Virginia. She’s got the world at the tips of her pom-poms... until she tells her boss to shove those pom-poms where the sun doesn’t shine.After spending her last night in California with her biggest crush, Emily flies back home to Summersweet, resigned to her boring fate of running her parents’ business, never to be heard from again. Besides, there’s no use crying over a man who lives on the other side of the country, who she’ll never see again.“Secret love affair for the new quarterback of the Virginia Beach Sharks, or a shocking tale of infidelity, leading all the way back to a birthday party Quinn Bagley threw at his previous home in Calabasas five months ago? New photos of the mystery redhead from the party surface, leaving fans to speculate all over social media, “Who is this woman who convinced Quinn Bagley to quit the Vipers and go to one of the worst teams in the league?”Quinn Bagley is finally playing for a team that feels like a family, after years of playing with nothing but egos. Following an announcement that shocked the world—one he’d been wrestling with for months, if not years—it felt good to have that weight lifted off his shoulders. What he’s not happy about is that the woman who rocked his world the night she literally fell into his life turned out to be like every other crazy redhead he’s ever encountered, spreading lies all over social media and wanting to use him for something. He just wants to look her in the eyes and hear her admit it was all a game.Except Emily Flanagan isn’t the hotheaded, rude woman he thought she was, out to screw him over. She’s sweet, sexy, and fun. Even if she does try to banish him from her island. She makes him feel normal, she makes him laugh, and she makes him want more.He’s going to win her heart, even if he has to do it in overtime.Let the real games begin, Miss Flanagan. I dare you.",
  "genres": [
    "Romance",
    "Sports",
    "Sports Romance",
    "Contemporary",
    "Audiobook",
    "Football",
    "Contemporary Romance"
  ],
  "author": "Tara Sivec",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/55412138-first-and-tension"
}