{
  "title": "Take It On Faith",
  "description": "\"When you find the thing that makes you feel a truth so undeniable that your faith in it is involuntary, you have to submit to it, don’t you? What else is there? What else could we choose?\" Blair's debut novel explores the idea of taking leaps of faith in pursuit of personal truth and finds that strong faith is essential but has little to do with religion or theism. Through the intimate portrayal of gender transition through the eyes of a woman trying to figure out what it all means and where she fits in, this story is about what it means to love and be loved exactly for who we really are. When Jexe, a lifelong metal fan, moves from the midwest to Vermont to take a teaching job at an unusual school and distance herself from a conservative religious family, she quickly wonders if she's made the wrong decision. As her waning Christian faith becomes the focus of the local priest and headmaster who runs the public school like a private parochial school, Jexe feels the oppression she tried to escape all over again and faces the question of her atheism once and for all. While Jexe sorts her feelings about religion, she also has a secret that no one knows about. Her family only knows her as a boy named Jesse and her new friends and coworkers only know her as a woman named Jexe. Her worlds collide in a painfully traumatic turn of events that forces everyone involved to question what they really believe about their god, their friends, and their family. Jexe's story is about feeling like an outsider and taking leaps of faith in searching for truth and love. Jexe's story is one of atheism and queerness, unlikely heroes and friendships, pain and triumph, and above all else, love. \"The psychological acuity and wit of this novel propelled me past page 32 and the all the way to the end. In addition to sensitively portraying Jexe's search for love and acceptance, Bradley A.F. creates antagonists who aren't \"Church Lady\" style stereotypes. Especially memorable is Father Donnelly, who drowns his genuine soul searching in a daily bottle or three of vino and 'didn't think he had an age-related cognitive decline. Rather he had more of an age-related giving a shit decline.' Faith has many forms in this nuanced take on the coming-out story.\" Margot Harrison, Seven Days, Burlington, VT December 23, 2020",
  "genres": [],
  "author": "Blair Watson",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/55391039-take-it-on-faith"
}