{
  "title": "Malibu Rising",
  "description": "Four famous siblings throw an epic party to celebrate the end of the summer. But over the course of twenty-four hours, their lives will change forever. Malibu: August, 1983. It’s the day of Nina Riva’s annual end-of-summer party, and anticipation is at a fever pitch. Everyone wants to be around the famous Rivas: Nina, the talented surfer and supermodel; brothers Jay and Hud, one a championship surfer, the other a renowned photographer; and their adored baby sister, Kit. Together, the siblings are a source of fascination in Malibu and the world over—especially as the offspring of the legendary singer, Mick Riva.The only person not looking forward to the party of the year is Nina herself, who never wanted to be the center of attention, and who has also just been very publicly abandoned by her pro tennis player husband. Oh, and maybe Hud—because it is long past time to confess something to the brother from whom he’s been inseparable since birth.Jay, on the other hand, is counting the minutes until nightfall, when the girl he can’t stop thinking about promised she’ll be there.And Kit has a couple secrets of her own—including a guest she invited without consulting anyone.By midnight the party will be completely out of control. By morning, the Riva mansion will have gone up in flames. But before that first spark in the early hours before dawn, the alcohol will flow, the music will play, and the loves and secrets that shaped this family’s generations will all come bubbling to the surface.Malibu Rising is a story about one unforgettable night in the life of a family: the night they each have to choose what they will keep from the people who made them... and what they will leave behind.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Contemporary",
    "Romance",
    "Audiobook",
    "Book Club",
    "Adult"
  ],
  "author": "Taylor Jenkins Reid",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/55404546-malibu-rising"
}