{
  "title": "Beneath the Stands",
  "description": "From USA TODAY bestselling author Emily McIntire comes an angsty, best friend's brother, second chance romance. Elliot Carson left Sugarlake and has never looked back. Revered as the next big thing in basketball, Eli’s a star until an injury ends his career, sending him spiraling with no direction.But he won’t go home.He can’t. Instead, he accepts a coaching gig at Florida Coast University, determined to leave his past behind. But fate has other plans when Becca, his sister’s best friend, shows up as a student and, even worse, becomes the new team manager.Rebecca Sanger is the preacher’s daughter and the town's disappointment. When she ignores her family’s demands to come home, she’s cut off and needs a job so she can stay enrolled at FCU. She thought she had everything figured out, until Eli Carson—the person she hates more than anything in the world—ends up being her new boss.Forced together, Becca and Eli’s hatred turns to heat, and they start an affair. But disaster quickly strikes, ripping them apart.Years pass, and Becca’s back home, under her parent’s thumb, and living a mundane life. When Eli shows up out of the blue with a fiancée in tow, Becca is tasked with planning their wedding.There’s only one problem.Becca still loves Eli.And he hates her.For the second time in their lives, they’re forced together, and they’ll find out just how thin the line is between hate... and a love that lasts a lifetime.***** *Beneath the Stands is the second interconnected standalone in the Sugarlake series. It can be read alone, but it's recommended to start with Beneath the Stars for a full reading experience. Beneath the Stands contains mature content. READER DISCRETION IS ADVISED. Full list of TW can be found on author's website.*",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Sports Romance",
    "Second Chance",
    "Contemporary Romance",
    "Sports",
    "Contemporary"
  ],
  "author": "Emily McIntire",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/55399755-beneath-the-stands"
}