{
  "title": "UNLOCKED: A Journey Inward to Utter Truth",
  "description": "Trapped in a passionless marriage. So, we become liars. We become liars trapped behind scriptures and moral facades. We learn to hide ourselves behind our reputations, as long as we look good to society. We put others and their aspirations before our own. We are taught that if we make a promise before God, then that covenant is cast in stone, even if your feelings do not align. That if you were once out of integrity, you can never go back. Even if it means you become a blatant, perpetual liar. We learn that there is no point of return; and no turning forward either. We learn that where we make our bed, we sleep. We learn that there is no justification solid enough to even tempt squeezing our new, evolved, wiser self through the cracks of a promise once made. We are told that we are warm when we are cold; that there are many things to be happy about, when we feel sad. When we cry out that we are hungry – hungry for more – we’re told we should be grateful for the fill we already have. We are told how to feel. And we are told how not to feel. We are moulded into an expectation of uniformity; homogenised into a fictitious ideal of normality. So, we stay. And we pretend. We mask and we ache. With a smile. We laugh when all we really want to do is cry. We close our eyes and focus on the positive and turn away from the knowing – a constant gnawing groan from somewhere deep inside of us. We tell ourselves that we’re being silly – a hopeless reiteration of what we’ve been told is silly. We turn a deaf ear to the loud hungry pangs from our gut. \"If you are looking for something honest, thoughtfully crafted, bold and gripping, then this is it! Tracy has managed to not only tell her story but has beautifully weaved it into a fabric that is easy to wrap yourself in whilst you start to unravel your own truth about the life you have created for yourself.\" - Monica Fiandeiro \"The book will provoke thought and make a profound impact on all who read it. In fact, it ought to be prescribed reading for all young couples before they choose their partner for marriage. It imparts a very necessary wisdom which can inevitably save much heartache.\" - Dave Emslie",
  "genres": [],
  "author": "Tracy Loubser",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/55387791-unlocked"
}