{
  "title": "The Young and the Ruined: Compromised",
  "description": "These members of the peerage are young, beautiful and full of trouble... the sort that might just get a lord or lady ruined. Don't miss out on this set of six stories of romance, passion and a fair bit of societal difficulties...Two Ruins Make a Right by Janna MacGregor - Lady Nellwyn 'Nell' Whitton and Mr. James Richardson hate each other. A jilting will do that to a betrothed couple, no matter the reason. After eight years, fate steps in when Nell stumbles upon a house party where James will pick a new wife. They must reconcile their past when Nell’s sister and James’ cousin are found in a compromising position. One ruination leads to another. Only this time, will it make it right?Laird of Longing by Tammy Andresen - Lady Sophia Everclear doesn’t regret fleeing the rake who attempted to trap her into marriage, But perhaps she should not have stowed away on a ship bound for Scotland. The problems? There are too many to count. But the largest, most annoying one is Captain Ewan McLaren. The tall and brawny Scot says exactly what he thinks, and he doesn’t think much of Sophia. Still. He’s all she’s got, and fortunately, for her, his heart is even bigger than his lectures. Which makes her wonder. What else, beside talking, might his mouth be good at?A Rescued Heart by Meara Platt - Annie Whitcomb often helped out her father in his medical practice in their quiet seaside village, and his worst patient without doubt was Major Peter Croft. His surly disposition and abuse of spirits and opium to ease the pain of his battle injuries left him fit company for no one. Yet, when her father unexpectedly passes away, leaving her destitute and with nowhere to turn, it is Peter who comes to her with a startling proposition... marry him.How to Avoid a Scandal (Or Not) by Merry Farmer - Lady Diana Pickwick has hated John Darrow, Lord Whitlock for years, so why can’t she seem to stay away from him? John has had his eye on Diana from the moment they met, and baiting her has been so much fun. But when they are accidentally caught in a compromising position and forced to marry, their games are over. Or have they just begun?Trapped with the Duke by Annabelle Anders - Miss Collette Jones, as the illegitimate daughter of a baron, is determined to become a respectable teacher. The Duke of Bedwell isn’t interested in respectable teachers. He’s interested in being proper, honorable, and fulfilling his duties to his title. So what is Bedwell to do when honor demands he show more than a little interest in one particular respectable teacher? Why, marry the chit, that’s what.A Captivating Compromise by Tabetha Waite - Younger brothers have become a bane to Miss Garnett Younghusband’s existence. As she travels out one night to drag them back from Vauxhall before they destroy the family soap business, she finds that she is the one compromised at the hands of the infamous Lord Rafe Pembroke! Can anything good come from such a brief torrid affair?",
  "genres": [
    "Historical Romance",
    "Anthologies",
    "Romance",
    "Historical",
    "Historical Fiction"
  ],
  "author": "Janna MacGregor",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/55422316-the-young-and-the-ruined"
}