{
  "title": "To Burn in Brutal Rapture",
  "description": "From the author of PUSH comes a new epic tale of unexpected forbidden romance… The ache of tragedy sunk deep, like the claws of a wicked monster. To heal was to remember what my godfather told me when I was six… Pain is a part of life. If you prepare for it, it will hurt less. He would know, after all. Lazarus Weston is pain personified. The scowling man with stormy eyes and tattoos covering his excessive muscles is not only my godfather, but also my dad’s business partner and best friend. A permanent fixture in our lives. Well, in Dad’s, not mine. But when grief mixes with confusing new feelings, I’m forced to see Lazarus differently, in a way that severely complicates my world. Because he’s too old for me. He’ll never be mine. I’m not allowed to have him, but obsession burns a fine line between can’t and won’t. I can’t want her… The curse on my heart is heavy, the tale of my malediction drenched in brutal loss. Wearing ink like scars reminds me of the tomb I left behind. I’ve been expecting pain all my life, yet I’m still unprepared, failing to see my downfall until she’s wrapped around my soul like barbed wire. Tracien Wright. My best friend’s daughter. Part of my life strictly through association. She was never meant to be more than that. But Traci is a trickster. A skilled predator in the most unexpected package, oblivious to her own power. She’ll learn the hard way that not all beasts should be hunted. I’m not what she thinks I am, having rose from a pit, only to bury myself in secrets and lies. Deep down I’d love nothing more than to have her. But I don’t get to keep nice things. Burn with me, Lazarus. **TBIBR is a standalone novel which contains sensitive subjects that may be triggering to some. Open-minded readers only! Please do not read or post spoilers.**",
  "genres": [
    "Romance",
    "Dark",
    "M M Romance",
    "Dark Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica"
  ],
  "author": "Nyla K.",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/55422448-to-burn-in-brutal-rapture"
}