{
  "title": "Triangulation",
  "description": "ABOUT THIS EPISODE Less than a day. Less than a day of peace, of calm, of comfort before the white rabbit returns to tear Malcolm and Seong-Jae's lives apart. An eerie video presents them with a deadly ultimatum, which leaves our intrepid pair racing to discover the identity of the latest victim — and desperate to protect their families from the threat hanging over their heads. As tension rises to a screaming point and conflict comes to a head between Mal, Seong-Jae, and Aanga Joshi, the detectives dive deeper into the pasts of their remaining suspects, searching for the clue that will unmask the white rabbit once and for all. Two men. One killer. And that tenuous connection to the darkness of Seong-Jae's past, now cast into doubt as Sila's true identity comes clear. For Malcolm and Seong-Jae, there seems no escape from this endless night. Unless they trust each other. And trust the love between them to light the way. ABOUT SEASON TWO Malcolm Khalaji and Seong-Jae Yoon are back on the case — and partnering with the FBI on a horrific serial murder case that will test Malcolm's faith and revive the darkest parts of Seong-Jae's past. With an enigmatic killer leading them on a wild goose chase through city after city and body after body, both Mal and Seong-Jae will find themselves pushed to their limits as they discover the worst of what humanity can do. Even two minds against one may not be enough as they track the devious Golden Ratio Killer, and try to find the key to his pattern. But the trail of breadcrumbs left by the white rabbit will lead them suspiciously close to home, and a connection they never could have predicted. With their worlds exploding around them and everyone they know suddenly cast into doubt... Can their partnership — and their love — survive the greatest trial of their lives?",
  "genres": [
    "M M Romance",
    "Romance",
    "LGBT",
    "Mystery",
    "Contemporary",
    "Crime",
    "Fiction"
  ],
  "author": "Cole McCade",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/55430630-triangulation"
}