{
  "title": "The Horde: How the Mongols Changed the World",
  "description": "An epic history of the Mongols as we have never seen them―not just conquerors but also city builders, diplomats, and supple economic thinkers who constructed one of the most influential empires in history.The Mongols are widely known for one thing: conquest. In the first comprehensive history of the Horde, the western portion of the Mongol empire that arose after the death of Chinggis Khan, Marie Favereau shows that the accomplishments of the Mongols extended far beyond war. For three hundred years, the Horde was no less a force in global development than Rome had been. It left behind a profound legacy in Europe, Russia, Central Asia, and the Middle East, palpable to this day.Favereau takes us inside one of the most powerful sources of cross-border integration in world history. The Horde was the central node in the Eurasian commercial boom of the thirteenth and fourteenth centuries and was a conduit for exchanges across thousands of miles. Its unique political regime―a complex power-sharing arrangement among the khan and the nobility―rewarded skillful administrators and diplomats and fostered an economic order that was mobile, organized, and innovative. From its capital at Sarai on the lower Volga River, the Horde provided a governance model for Russia, influenced social practice and state structure across Islamic cultures, disseminated sophisticated theories about the natural world, and introduced novel ideas of religious tolerance.The Horde is the eloquent, ambitious, and definitive portrait of an empire little understood and too readily dismissed. Challenging conceptions of nomads as peripheral to history, Favereau makes clear that we live in a world inherited from the Mongol moment.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Russia",
    "World History",
    "Asia",
    "Audiobook"
  ],
  "author": "Marie Favereau",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/55437277-the-horde"
}