{
  "title": "There Is a Rainbow",
  "description": "Even when we're far apart, \"here\" and \"there\" can still be connected by a rainbow. A hopeful, timely picture book that helps us all see the rainbows that connect us!On the other side of a window, there is a neighbor.On the other side of a sadness, there is a hug.And on the other side of a storm, there is a rainbow.Sometimes we are separated by distance, sometimes by the way we feel. Even though the world is full of barriers that can make us feel unconnected, we are all just on one end of a rainbow. Connected by all that color and light, there is always something, or someone, waiting for us on the other side.Poetically told with an uplifting message for some of life's most difficult moments, this book encourages readers to look past their immediate surroundings and find comfort, community, and inner courage—all are closer than we might think.Inspired by the multitude of rainbows found in the windows of homes around the world following the coronavirus lockdown, this uplifting picture book shares a message of hope and resilience that is truly timeless.• TIMELY: Sweet, sincere, and uplifting, this book offers comfort to readers young and old. Its graceful approach to navigating both today's difficulties and the inevitable obstacles of the future makes this a staple picture book little ones and their parents will cherish for years and return to time and again.• HOPEFUL: This book provides a much-needed dose of realistic optimism, encouraging readers to see the light at the end of the tunnel. Painting a believable picture of what is and what might be, it also shows readers all the wonderful things within our reach, even in difficult times. Its underlying message has the potential to change perspectives.• COMMUNITY INVOLVEMENT: The book's emphasis on finding a network of support—whether it's among family members a phone call away, the neighbors right across the street, or a wider community accessible through technology—is particularly potent. Imbued with the unshakeable sense that we are never alone, this is one picture book with a message everyone can get behind, and which will, itself, spread hope from home to home, community to community.• READ ALOUD: As this reassuring picture book artfully reveals what's on the other side of both concrete objects and abstract ideas, it smartly uses the page turn to do so—it will have young readers eagerly turning the page to complete each sentence, to see what's on the other side. It provides the perfect read-aloud experience for story time in the classroom, in the library, and at home.• THE INSPIRATION: This picture book was inspired by the author's own experiences during the COVID-19 crisis.Perfect for:• Children going through a wide variety of difficult experiences, possibly for the first time• Parents and grandparents looking for a hopeful, comforting picture book• Caretakers and gift givers looking for profound, beautifully written, optimistic picture books• Teachers, librarians, and booksellers looking for the perfect uplifting read-aloud option• Fans of picture books that teach new perspectives",
  "genres": [
    "Picture Books",
    "Childrens",
    "Family",
    "Fiction",
    "Emotion",
    "Juvenile",
    "Storytime"
  ],
  "author": "Theresa Trinder",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/55426421-there-is-a-rainbow"
}