{
  "title": "Unravelling Canada: A Knitting Odyssey",
  "description": "Toques, mittens and scarves are all associated with northern climates, but the quintessential garment of Canadian knitting is surely the bulky and distinctly patterned West Coast cardigan. In the early twentieth century, Indigenous woolworkers on southern Vancouver Island began knitting what are now called Cowichan sweaters, named for the largest of the Coast Salish tribes in the region. Drawing on their talents as blanket weavers and basket makers, and adapting techniques from European settlers, Coast Salish women created sweaters that fuelled a bustling local economy. Knitters across the country copied the popular sweaters to create their own versions of the garment. The Cowichan sweater embodies industry and economy, politics and race relations, and is a testament to the innovation and resilience of Coast Salish families. Sylvia Olsen married into the Tsartlip First Nation near Victoria, BC, and developed relationships with Coast Salish knitters through her family’s sweater shop. Olsen was inspired to explore the juncture of her English/Scottish/European heritage and Coast Salish life experiences, bringing to light deeply personal questions about Canadian knitting traditions. In 2015, she and her partner Tex embarked on a cross-Canada journey from the Salish Sea to the Atlantic Ocean with stops in more than forty destinations to promote her books, conduct workshops, exchange experiences with other knitters and, Olsen hoped, discover a fresh appreciation for Canada. Along the way, with stops in urban centres as well as smaller communities like Sioux Lookout, ON, and Shelburne, NS, Olsen observed that the knitters of Canada are as diverse as their country’s geography. But their textured and colourful stories about knitting create a common narrative. With themes ranging from personal identity, cultural appropriation, provincial stereotypes and national icons, to “boyfriend sweaters” and love stories, Unravelling Canada is both a celebration and a discovery of an ever-changing national landscape. Insightful, optimistic, and beautifully written, it is a book that will speak to knitters and would-be knitters alike.",
  "genres": [
    "Nonfiction",
    "Knitting",
    "Canada",
    "Travel",
    "History",
    "Crafts",
    "Biography Memoir"
  ],
  "author": "Sylvia Olsen",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/55433348-unravelling-canada"
}