{
  "title": "House of Bastiion",
  "description": "BEHIND THE MASK OF DUTY AND POWER, NO ONE IS WHO THEY SEEM...After the Forgotten Wars ravaged the world and turned it to ash, the realm of Orynthia has thrived. To bring peace to their territories, the Houses of Pilar, Darakai, and Boreal forged an accord with Bastiion, founding a Quadren of advisory to the throne. Each generation, a single haidren is appointed to this coveted chair. But in a land of war and deceit, peace should never be trusted.When Luscia Tiergan, al’haidren to the House of Boreal, reaches the age of ascension and takes her seat in court, she is driven into a maze of political traps and dark secrets. Her reputation soiled by seclusion and alleged sorcery, Luscia soon uncovers a pattern of forgotten children, slain in the streets of Bastiion.Ascending from an upbringing rooted in cruelty and suspicion, Zaethan Kasim, al’haidren to the House of Darakai, quickly clashes with Luscia, the newcomer in his midst. His position in Darakai threatened by an old rival, Zaethan is forced into an uneasy alliance to gain the upper hand. As death spills across his second home, Zaethan must set aside his hatred to secure his claim and protect the blameless.Following a disturbing stream of innocent blood, Luscia and Zaethan learn they are not alone as they race through the heart of Orynthia, the House of Bastiion.THE SERIESHouse of Bastiion is the first installment in the award-winning epic fantasy series, The Haidren Legacy. Brimming with courtly machinations and a diverse cast, House of Bastiion centers not around those wearing the crown, but those influencing it. Those who whisper into its ear; who protect or betray the agenda of the throne. For the most powerful in any society are rarely who they seem, and in the shadows are they ever truly unmasked. Themes such as loyalty, betrayal, duty, self-discovery, blood-ties, and prejudice unravel in a deadly explosion across a sprawling world built upon intricate cultural systems and diabolical plotlines. Following a string of hellish murders, this political masquerade packs a legendary punch for fans of Brandon Sanderson, Victoria Aveyard, John Gwynne, and Robin Hobb. By evoking the classic style of A Game of Thrones and The Lord of the Rings, The Haidren Legacy series is not for the faint of heart.Content Advisory detailed on the THL website. Direct link provided under \"Questions\" below.",
  "genres": [
    "Fantasy",
    "Romance",
    "New Adult",
    "Fantasy Romance",
    "High Fantasy",
    "Fiction",
    "Mystery"
  ],
  "author": "K.L. Kolarich",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/55430147-house-of-bastiion"
}