{
  "title": "Origin Story",
  "description": "\"Origin Story\" by T. Kingfisher is one of 27 short horror stories in Nightfire's audio anthology. When abominations begin roaming the village streets at night, the slaughterhouse workers grow suspicious of the fairy who works there.Come Join Us by the Fire Season 2 is the second installment of Nightfire's audio-only horror anthology, featuring a wide collection of short stories from emerging voices in the horror genre as well as longtime fan favorites. The collection showcases the breadth of talent writing in the horror genre today, with contributions from a wide range of genre luminaries including Laird Barron, Indrapramit Das, Shaun Hamill, Daniel M. Lavery, Matthew Lyons, T. Kingfisher, Seanan McGuire, Nibedita Sen, and Nightfire’s own Cassandra Khaw and Silvia Moreno-Garcia.The full Table of Contents is as follows:Cassandra Khaw- \"Some Breakable Things\"Sarah Langan- \"The Changeling\"Shaun Hamill- \"Music of the Abyss\"Caitlín R. Kiernan- \"Standing Water\"Tade Thompson- \"Bone\"T. Kingfisher- \"Origin Story\"Silvia Moreno-Garcia- \"The Sound of Footsteps\"Laird Barron- \"Jōren Falls\"Damien Angelica Walters- \"Tooth, Tongue, and Claw\"Sunny Moraine- \"If Living is Seeing I'm Holding My Breath\"Matthew Lyons- \"Blood Daughter\"Jessica Guess- \"Mama Tulu\"Daniel M. Lavery- \"Prodigal Son\"Seanan McGuire- \"Emergency Landing\"Indrapramit Das - \"You Will Survive This Night\"‘Pemi Aguda- \"Things Boys Do\"Kelly Link- \"The Specialist's Hat\"Clay McLeod Chapman- \"The Fireplace\"Nibedita Sen- \"Pigeons\"Camilla Grudova- \"Ghost Bread\"Catherynne M. Valente- \"The Days of Flaming Motorcycles\"Brian Evenson- \"The Cabin\"Maria Dahvana Headley- \"The Krakatoan\"Craig Laurance Gidney- \"Spyder Threads\"Mariana Enriquez- \"Things We Lost in the Fire\"Gabino Iglesias- \"The Song of the Lady Rose\"Nick Antosca- \"The Quiet Boy\"",
  "genres": [
    "Horror",
    "Fantasy",
    "Short Stories",
    "Audiobook",
    "Fiction"
  ],
  "author": "T. Kingfisher",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/55454004-origin-story"
}