{
  "title": "Tulsa, 1921: Reporting a Massacre",
  "description": "In 1921 Tulsa’s Greenwood District, known then as the nation’s “Black Wall Street,” was one of the most prosperous African American communities in the United States. But on May 31 of that year, a white mob, inflamed by rumors that a young Black man had attempted to rape a white teenage girl, invaded Greenwood. By the end of the following day, thousands of homes and businesses lay in ashes, and perhaps as many as three hundred people were dead.Tulsa, 1921 shines new light into the shadows that have long been cast over this extraordinary instance of racial violence. With the clarity and descriptive power of a veteran journalist, author Randy Krehbiel digs deep into the events and their aftermath and investigates decades-old questions about the local culture at the root of what one writer has called a white-led pogrom.Krehbiel analyzes local newspaper accounts in an unprecedented effort to gain insight into the minds of contemporary Tulsans. In the process he considers how the Tulsa World , the Tulsa Tribune , and other publications contributed to the circumstances that led to the disaster and helped solidify enduring white justifications for it. Some historians have dismissed local newspapers as too biased to be of value for an honest account, but by contextualizing their reports, Krehbiel renders Tulsa’s papers an invaluable resource, highlighting the influence of news media on our actions in the present and our memories of the past.The Tulsa Massacre was a result of racial animosity and mistrust within a culture of political and economic corruption. In its wake, Black Tulsans were denied redress and even the right to rebuild on their own property, yet they ultimately prevailed and even prospered despite systemic racism and the rise during the 1920s of the second Ku Klux Klan. As Krehbiel considers the context and consequences of the violence and devastation, he asks, Has the city—indeed, the nation—exorcised the prejudices that led to this tragedy?",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Race",
    "Politics",
    "African American",
    "Book Club"
  ],
  "author": "Randy Krehbiel",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/55459543-tulsa-1921"
}