{
  "title": "Days of Hope, Miles of Misery - Love and Loss on the Oregon Trail",
  "description": "The shout “giddap” starts the oxen down a path to the end of the world.For five months, and two thousand miles, the wagon train lumbers toward California on the Oregon Trail and into big trouble. The emigrants endure disease, dirt, and attacks from outlaws, and invaded Indians. Bitter strife erupts between ill-matched pioneers forced together by necessity.The 1845 wagon train is part of a vast westward movement; a monument to Americana that fascinates readers 175 years later. In one of the wagons is a heart-sick physician, Hannah Blanc, whose tribulations are Jobian: the suicide of a beloved husband, unfair denial of her medical career by graybeards of the profession, and a nightmarish new “marriage of necessity to a vile man named Ed Spencer. Hannah tries to save a young boy from gangrene by amputating his leg. She has never done surgery by herself, let alone of that complexity. The guide is a hard-to-figure mountain man, Nimrod Lee, who knows the trail, but is also looking a man he needs to kill. Guilt over the murder of his Crow wife beclouds his conscience. Betrayal of his word to her chief father threatens his life. The killer of his wife is still out there. A love affair between Hannah and Nimrod is inevitable, but it’s complicated, because for both, painful histories and mixed-up emotions make tall walls. The heart of the story is the pool of misgivings that threatens to drown their tenuous affair.The wagon train is a village of strangers locked together with no escape. Cholera is the killer and diarrhea is the tormentor. Mosquitoes are a biblical plague. The sun, the heat, the cold, the snow—all are partners in misery.The last part of the trek is the most miserably. The dreaded Forty Mile Desert is all sand, sun and no water for days. The Sierra Nevada surprises with an early winter that takes their suffering to a higher plane.Beyond all they must endure, the pioneers keep fighting, and keep coming. Those who make it are survivors; survivors with a great story to tell.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Westerns"
  ],
  "author": "Fred Dickey",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/55446088-days-of-hope-miles-of-misery---love-and-loss-on-the-oregon-trail"
}