{
  "title": "Warning Track",
  "description": "Colleen Callahan is exactly where she’s always dreamt of being.From a young age, she’s been groomed to take over as general manager of the Packton Pistons, her family’s professional baseball dynasty. Except she never expected her father would have to go to prison for the role to become hers.The public, and even her own family, are counting on the first female to wear the title to fail. Hoping to wipe the slate clean and clear the club’s name, Colleen vows to put her job above everything else. Friends, a social life, her well-being, and most of all, love.Until she meets the team’s new star player. Their chemistry is instant, igniting the stadium and her heart. But the last thing she needs is a distraction, much less a surly God of the clay diamond who seems to despise her.Fate has other plans, though. If they’re found out, it could mean the end of both of their careers. Except hurtling so close to the danger zone has never felt more right.Hayes Swindell would prefer hell over the place he ended up.After a series of bribes and blackmail gone bad, the league’s most desirable veteran superstar finds himself playing on a team that he wants no part of. The family who runs this dynasty is corrupt, and he’s spent his career avoiding limelight exactly like this.With a chip on his shoulder and the intention to hightail it out of Pennsylvania as soon as his one-year contract is up, he has no plans to fall for the very woman he should stay away from.In his ten years in the league, he’s never once gotten bit by the love bug. But the moment he lays eyes on her, Hayes can see his days are numbered. When the forbidden happens, he has a decision to make.Should they head for disaster together, risking it all, or course-correct and save themselves the ultimate price of heartbreak and scandal?",
  "genres": [
    "Sports Romance",
    "Sports",
    "Baseball",
    "Romance",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Carrie Aarons",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/55454490-warning-track"
}