{
  "title": "The Pride Omnibus",
  "description": "Joe Glass's \n\nThe Pride\n\n in a full omnibus trade paperback, collecting volumes 1 and 2 as well as the collection of self-contained stories, \n\nThe Pride Adventures\n\n!\nIn The Pride, FabMan is sick of being seen as a joke. Tired of the LGBTQ+ community being seen as inferior to straight heroes, he thinks it's about damn time he did something about it. Bringing together some of the world's greatest LGBTQ+ superheroes, the Pride is born to protect the world and fight prejudice, misrepresentation and injustice--not to mention a pesky supervillain or two.The Pride Adventures brings a whole host of extra, self-contained stories and adventures starring the heroes of the Pride! See the team members face down crazed shooters, invasions, and even a sixty-foot-tall drag queen! Featuring a slew of incredible artistic talent, plus stories from writers Mike Garley, Sina Grace and PJ Montgomery too! Follow the LGBTQ+ heroes into whole new stories and meet even more characters in the world of The Pride!Join the Pride as they work to change the world and show just what they can do!Collects the original digital series The Pride and The Pride Adventures in print for the first time.[F]or readers hungry for queer superheroes. Joe Glass' The Pride introduces a superhero universe built on LGBTQ+ inclusion, following a team that is explicitly created to show the range of the queer experience. The Pride features superheroes who are gay, lesbian, bi, trans, non-binary, and children of gay parents. Glass blends modern queer issues with classic superhero storytelling to tell narratives that classic superhero comics haven't touched. . . . The Pride excels at using queer struggle and joy to show a different side of the superhero genre.--AV ClubI highly recommend this smart, charming, wonderful book to anyone who likes good comics. It's absolutely a pleasure to read and a clear labor of love.--Gail Simone,  Batgirl, Leaving Megalopolis, Clean RoomOld-school and progressive at the same time. Classic, high-energy superhero action that gives the queer community the heroes they've always deserved.--Steve Orlando, Midnighter, VirgilThe Pride is the modern, inclusive, and compelling superhero epic the world needs today.--Alex Segura, co-writer of The Black Ghost and author of the acclaimed Pete Fernandez Miami Mystery novel series.",
  "genres": [
    "Graphic Novels",
    "Comics",
    "LGBT",
    "Queer",
    "Superheroes",
    "Fiction",
    "Fantasy"
  ],
  "author": "Joe   Glass",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/55477214-the-pride-omnibus"
}