{
  "title": "Last Best Hope: America in Crisis and Renewal",
  "description": "Acclaimed National Book Award-winning author George Packer diagnoses America’s descent into a failed state, and envisions a path toward overcoming our injustices, paralyses, and dividesIn the year 2020, Americans suffered one rude blow after another to their health, livelihoods, and collective self-esteem. A ruthless pandemic, an inept and malign government response, polarizing protests, and an election marred by conspiracy theories left many citizens in despair about their country and its democratic experiment. With pitiless precision, the year exposed the nation’s underlying conditions—discredited elites, weakened institutions, blatant inequalities—and how difficult they are to remedy.In Last Best Hope, George Packer traces the shocks back to their sources. He explores the four narratives that now dominate American life: Free America, which imagines a nation of separate individuals and serves the interests of corporations and the wealthy; Smart America, the world view of Silicon Valley and the professional elite; Real America, the white Christian nationalism of the heartland; and Just America, which sees citizens as members of identity groups that inflict or suffer oppression. In lively and biting prose, Packer shows that none of these narratives can sustain a democracy. To point a more hopeful way forward, he looks for a common American identity and finds it in the passion for equality—the “hidden code”—that Americans of diverse persuasions have held for centuries. Today, we are challenged again to fight for equality and renew what Alexis de Tocqueville called “the art” of self-government. In its strong voice and trenchant analysis, Last Best Hope is an essential contribution to the literature of national renewal.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Sociology",
    "Audiobook",
    "American History",
    "Society"
  ],
  "author": "George Packer",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/55467212-last-best-hope"
}