{
  "title": "Sky Pirates: The Dragon's Gold",
  "description": "Embark on another swashbuckling SKY PIRATES adventure in Echo Quickthorn and the Dragon's Gold, perfect for 8+ explorers and fans of Abi Elphinstone, Peter Bunzl and Vashti Hardy.   Echo Quickthorn has been reunited with her sky-pirate mother, Indigo Lil, and is now a fully-fledged member of the Black Sky Wolves. So when Lil is summoned to the Alliance of the Seven Skies, Echo decides to sneak along with her friend Horace. There, Horace is captured by the dastardly Thunder Sharks, a rival pirate clan, who present Echo with an ultimatum: they’ll release her friend in exchange for the legendary dragon’s gold... Echo must journey – through underwater libraries and active volcanoes - to the inhospitable Dragonlands, in order to find the dragon’s lair.     Can Echo find the treasure and prove herself to be a true-sky pirate?Praise for SKY PIRATES: Echo Quickthorn and the Great Beyond: \"Strap yourselves in for an exhilarating ride!\" - \nDaily Mail \n \"Fizzes with magic and wonder\" – Abi Elphinstone, bestselling author of SKY SONG  \"A charmingly madcap adventure, with endearing friendships, sparkling wit, and a swashbuckling journey across pirate-infested skies. I loved it. Perfect for fans of Nevermoor and Cogheart.\" – Hana Tooke, author of THE UNADOPTABLES   “A spirited protagonist, a charming side-kick and a believable villain come together in this tightly plotted, visual, treat for the senses. I want to soar over the rainbow rooftops of Port Tourbillon and the toadstooled forests of Tyrian in my very own airship.” – Nizrana Farook, author of THE GIRL WHO STOLE AN ELEPHANT   “Sky Pirates is a fast-moving adventure story full of intrepid explorers, ingenious inventors, stolen treasure and mysterious undiscovered lands. If you like Chitty Chitty Bang Bang (and who doesn't?) you'll love Sky Pirates too!” Kirsty Applebaum, author of THE MIDDLER \"From the very first page, I felt as if I'd been grabbed by the hand by a best friend and taken on the journey of a lifetime. Pacey, thrilling and endearing too. If I was ever to encounter sky pirates, I can think of no one I'd want by my side more than clever, brave Echo.\" – Joanna Nadin, author of the RACHEL RILEY series “A breath-taking adventure and a wonderfully imagined story of friendship and danger in strange places.” – Claire Fayers, author of THE VOYAGE TO MAGICAL NORTH \"An incredible adventure, brimming with friendship and danger\" – The Bookseller",
  "genres": [
    "Fantasy",
    "Fiction"
  ],
  "author": "Alex  English",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/55467901-sky-pirates"
}