{
  "title": "The Missing Gospels: Unearthing the Truth Behind Alternative Christianities",
  "description": "What others are saying about The Missing Gospels \"Darrell Bock has written a timely and valuable study for anyone curious about the question of lost or missing gospels. The Missing Gospels is a breath of sanity!\"- Philip Jenkins , Professor of History and Religious Studies, Penn State \"Those who don't want their prejudices disturbed will want to avoid this book. Those with an open mind and readiness to learn from scholarship . . . read with profit.\"- Larry Hurtado , Professor of New Testament Language, Literature, and Theology, University of Edinburgh, Scotland \"Darrell Bock patiently, and accessibly, sifts through all the relevant issues and offers much-needed guidance to those who want to discern fact from fiction. If you read only one book on this issue, this is it!\"- Andreas J. Kostenberger , PhD, Professor of New Testament and Greek, Southeastern Baptist Theological Seminary \" The Missing Gospels is a unique resource for those who wish to respond to the 'new school' with accuracy and confidence.\"- Frederica Mathewes-Green , National Public Radio's Morning Edition Commentator \"A necessary book that corrects many still fashionable but even more questionable hypotheses about the origin of the Gospels, the Nag Hammadi texts, and the development of Christian theology in the first two centuries AD.\"- Prof. Dr. Martin Hengel , Professor Emeritus of New Testament and Ancient Judaism, University of Tubingen, Germany______________________________For a brief overview from Dr. Bock on the contents of the Gospel of Judas along with other materials, please visit www.thomasnelson.com/missinggospels .",
  "genres": [
    "Christianity",
    "Religion",
    "Nonfiction",
    "Theology",
    "Church History",
    "Christian",
    "Canon"
  ],
  "author": "Darrell L. Bock",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/554680.The_Missing_Gospels"
}