{
  "title": "The Day Jesus Rode Into Croydon",
  "description": "The Day Jesus Rode Into Croydon is a novel written by Daryl Gould.The Apocalypse is coming to Suburbia and it's the greatest thing to happen since the Great Road Widening Scheme of 1976.The Day Jesus Rode Into Croydon is a mystery with elements of comedy and thought provoking realism. Occurring in contemporary times entwined with the golden days of childhood in the 1980's the story takes in the everyday setting of a life wasted in English suburbia to escape and vengeance in far off lands, revealing dark secrets and hidden pasts along the way.From the heart of suburbia the protagonist Joseph finds he has a daunting task in saving the future of mankind. On the face of it, he seems the most unlikely person for the job and hasn't been the sort of chap to get involved in titanic battles between good and evil before. It is the job of failed television celebrity turned religious messiah Jack Connolly to convince Joe otherwise. The only problem is, as Joe's past, present and future come into focus, we learn that this isn't the first time famous people have appeared as wild hallucinations.Who else can he turn to? Perhaps not Danny, his housemate and self styled entrepreneur come drug dealer with an unhealthy obsession with Roger Moore. He certainly won't be telling Katie, his oldest friend. If he's too scared to tell her that he secretly loves her then he wont is telling her this. The only person left is Mia, his newly acquired girlfriend. Unfortunately, she is under the misapprehension that he is someone else entirely called Bruce and the last thing he wants to do is upset the balance there. And Joe's not the only one who intends to work it out. Sergeant Walker, the delusional hero of Goodison CID is also set on uncovering the truth and Joe is just another part to his great master plan.Joseph must fight his way through a web of deceit, betrayal and unrequited love to find out the truth. It's not a healthy state of affairs to be in and despite attempts otherwise, all the cups of tea in the world aren't going to help.",
  "genres": [
    "Fiction",
    "Humor",
    "Mystery"
  ],
  "author": "Kirk St Moritz",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/5548850-the-day-jesus-rode-into-croydon"
}