{
  "title": "Jimbo The Farting Robot: A funny picture book about being different, self esteem, and cute robots. Kids ages 3-6",
  "description": "Welcome to the Lab , a world of fantastic inventions. One little robot named Jimbo is having trouble fitting in. The inventor didn't give Jimbo a job, but DID give Jimbo the ability to fart rainbows. Join Jimbo as they learn that being different is actually a good thing.\"This book reminds children and adults alike that we are all important and special. What a fun way to open a discussion with kids about why being different is ok and everyone is important. Kids will love the humor when Jimbo Farts rainbows. This makes the book a funny story yet a memorable one.\" - 5 STAR REVIEW - Betty M.\"Uplifting, and the author's illustrations work brilliantly with the story.\" - 5 Star Review by Jack Magnus for Readers' Favorite-----------Are you ready for a wacky adventure about a little robot who farts rainbows? This funny picture book has it all. Beautiful artistic illustration paired with a fun story about a little baby robot who farts!THE Jimbo lives in the lab. All the other robots have jobs - there is the Snifter 5000 who smells things and the Barkbot who sounds alarms. Sadly, these other robots are bullies and make fun of the Jimbo who doesn't have a job. The one thing Jimbo DOES have is the power to fart rainbows! Join Jimbo as they figure out what makes someone special and how being different or weird is it's own special type of super power!\"This is a wonderful story about Jimbo the farting robot, whose \"superpower\" is farting rainbows. It's a cute and funny way to teach kids about being different, having a special skill, and fitting in to our world. Jimbo's story is a must-read for the little ones, who will love his \"superpower\". A great holiday gift!!\" - 5 STAR REVIEW - Robin R.",
  "genres": [
    "Childrens"
  ],
  "author": "Momo J. Pug",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/55464250-jimbo-the-farting-robot"
}