{
  "title": "Clockwork Igni",
  "description": "Long live the me! As Queen of Antrum, I rule an underground realm of demon hunters who love finding new caves. Hey, it’s boring down here; I’m glad they all have a hobby. Per usual, I try to act interested about their latest discovery, but all I hear is blah blah blah new cavern blah blah blah Forbidden Tombs blah blah blah massive bronze pyramids blah blah blah creepy ticking sounds. It’s a little odd, but I’m not worried.My bad.Suddenly, the Forbidden Tombs burst through the ground in my home realm of Purgatory. Bronze pyramids smash through abandoned buildings and highways, making rush hour a nightmare. Even worse, the metal structures attract tiny lightning bolts called igni, which are my very special supernatural buddies. Within minutes, every last igni gets stolen away. Now. I’m. Pissed. Whoever hides inside those pyramids? Time to dust off your mummies and shine up your sarcophagi. Because my husband, Lincoln, and I are breaking in and kicking ass. Angelbound OriginsIn which Myla Lewis kicks ass and takes names. Nuff said.1. Angelbound2. Scala 3. Acca 4. Thrax 5. The Dark Lands 6. The Brutal Time 7. Armageddon 8. Quasi Redux9. Clockwork Igni 10. Lady ReaperAngelbound OffspringThe next generation takes on Heaven, Hell, and everything in between1. Maxon 2. Portia3. Zinnia 4. Rhodes5. Kaps 6. Mack 7. HuntressAngelbound LincolnAngelbound Origins as told by Prince Lincoln1. Duty Bound2. Lincoln3. Trickster4. Baculum5. AngelfireDon't Miss These Series From Christina Bauer- Fairy Tales of the Magicorum, modern fairy tales with sass, action, and romance- Beholder, where a medieval farm girl discovers necromancy and true love - Dimension Drift, a dystopian adventure with science, snark, and hot aliens - Pixieland Diairies, in which sassy pixie Calla writes about ‘her’ elf prince, Dare",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult"
  ],
  "author": "Christina Bauer",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/55473988-clockwork-igni"
}