{
  "title": "How Stella Learned to Talk: The Groundbreaking Story of the World's First Talking Dog",
  "description": "An incredible, revolutionary true story and surprisingly simple guide to teaching your dog to talk from speech-language pathologist Christina Hunger, who has taught her dog, Stella, to communicate using simple paw-sized buttons associated with different words.When speech-language pathologist Christina Hunger first came home with her puppy, Stella, it didn’t take long for her to start drawing connections between her job and her new pet. During the day, she worked with toddlers with significant delays in language development and used Augmentative and Alternative Communication (AAC) devices to help them communicate. At night, she wondered: If dogs can understand words we say to them, shouldn't they be able to say words to us? Can dogs use AAC to communicate with humans?Christina decided to put her theory to the test with Stella and started using a paw-sized button programmed with her voice to say the word \"outside\" when clicked, whenever she took Stella out of the house. A few years later, Stella now has a bank of more than thirty word buttons, and uses them daily either individually or together to create near-complete sentences.How Stella Learned to Talk is part memoir and part how-to guide. It chronicles the journey Christina and Stella have taken together, from the day they met, to the day Stella \"spoke\" her first word, and the other breakthroughs they've had since. It also reveals the techniques Christina used to teach Stella, broken down into simple stages and actionable steps any dog owner can use to start communicating with their pets.Filled with conversations that Stella and Christina have had, as well as the attention to developmental detail that only a speech-language pathologist could know, How Stella Learned to Talk will be the indispensable dog book for the new decade.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Dogs",
    "Science",
    "Memoir",
    "Audiobook",
    "Biography"
  ],
  "author": "Christina Hunger",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/55507038-how-stella-learned-to-talk"
}