{
  "title": "The Vixen",
  "description": "Critically acclaimed, bestselling author Francine Prose returns with a dazzling new novel set in the glamorous world of 1950s New York publishing, the story of a young man tasked with editing a steamy bodice-ripper based on the recent trial and execution of Ethel and Julius Rosenberg—an assignment that will reveal the true cost of entering that seductive, dangerous new world. It’s 1953, and Simon Putnam, a recent Harvard graduate newly hired by a distinguished New York publishing firm, has entered a glittering world of three-martini lunches, exclusive literary parties, and old-money aristocrats in exquisitely tailored suits, a far cry from his loving, middle-class Jewish family in Coney Island.But Simon’s first assignment—editing The Vixen, the Patriot and the Fanatic, a lurid bodice-ripper improbably based on the recent trial and execution of Ethel and Julius Rosenberg, a potboiler intended to shore up the firm’s failing finances—makes him question the cost of admission. Because Simon has a secret that, at the height of the Red Scare and the McCarthy hearings, he cannot reveal: his beloved mother was a childhood friend of Ethel Rosenberg’s. His parents mourn Ethel’s death.Simon’s dilemma grows thornier when he meets The Vixen’s author, the startlingly beautiful, reckless, seductive Anya Partridge, ensconced in her opium-scented boudoir in a luxury Hudson River mental asylum. As mysteries deepen, as the confluence of sex, money, politics and power spirals out of Simon’s control, he must face what he’s lost by exchanging the loving safety of his middle-class Jewish parents’ Coney Island apartment for the witty, whiskey-soaked orbit of his charismatic boss, the legendary Warren Landry. Gradually Simon realizes that the people around him are not what they seem, that everyone is keeping secrets, that ordinary events may conceal a diabolical plot—and that these crises may steer him toward a brighter future. At once domestic and political, contemporary and historic, funny and heartbreaking, enlivened by surprising plot turns and passages from Anya’s hilariously bad novel, The Vixen illuminates a period of history with eerily striking similarities to the current moment. Meanwhile it asks timeless questions: How do we balance ambition and conscience? What do social mobility and cultural assimilation require us to sacrifice? How do we develop an authentic self, discover a vocation, and learn to live with the mysteries of love, family, art, life and loss?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Books About Books",
    "Novels",
    "Audiobook",
    "Adult"
  ],
  "author": "Francine Prose",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/55507033-the-vixen"
}