{
  "title": "Unwell Women: Misdiagnosis and Myth in a Man-Made World",
  "description": "A trailblazing, conversation-starting history of women's health--from the earliest medical ideas about women's illnesses to hormones and autoimmune diseases--brought together in a fascinating sweeping narrative.   Elinor Cleghorn became an unwell woman ten years ago. She was diagnosed with an autoimmune disease after a long period of being told her symptoms were anything from psychosomatic to a possible pregnancy. As Elinor learned to live with her unpredictable disease she turned to history for answers, and found an enraging legacy of suffering, mystification, and misdiagnosis.In Unwell Women, Elinor Cleghorn traces the almost unbelievable history of how medicine has failed women by treating their bodies as alien and other, often to perilous effect. The result is an authoritative and groundbreaking exploration of the relationship between women and medical practice, from the wandering womb of Ancient Greece to the rise of witch trials across Europe, and from the dawn of hysteria as a catchall for difficult-to-diagnose disorders to the first forays into autoimmunity and the shifting understanding of hormones, menstruation, menopause, and conditions like endometriosis.Packed with character studies and case histories of women who have suffered, challenged, and rewritten medical orthodoxy--and the men who controlled their fate--this is a revolutionary examination of the relationship between women, illness, and medicine. With these case histories, Elinor pays homage to the women who suffered so strides could be made, and shows how being unwell has become normalized in society and culture, where women have long been distrusted as reliable narrators of their own bodies and pain. But the time for real change is long overdue: answers reside in the body, in the testimonies of unwell women--and their lives depend on medicine learning to listen.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "History",
    "Science",
    "Health",
    "Medicine",
    "Womens"
  ],
  "author": "Elinor Cleghorn",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/55502857-unwell-women"
}