{
  "title": "Arctic Storm Rising",
  "description": "First in a new series from New York Times bestselling author Dale Brown, featuring U.S. Air Force intelligence officer Nick Flynn on the hunt for Russian commandos in the mountains of Alaska.After a CIA covert mission goes badly awry, U.S. Air Force intelligence officer Nicholas Flynn is exiled to guard a remote radar post along Alaska’s Arctic frontier. This dead-end assignment is designed to put his career permanently on ice, but Flynn’s not the type to fade quietly into obscurity...As winter storms pound Alaska and northern Canada, Russian aircraft begin penetrating deep into friendly airspace. Are these rehearsals for a possible first strike, using Russia’s new long-range stealth cruise missiles? Or is some other motive driving the Kremlin to take ever-increasing risks along the hostile Arctic frontier separating two of the world’s great powers?When an American F-22 collides with one of the Russian interlopers, things go south fast—in seconds, missiles are fired. There are no survivors. Despite horrific weather, Flynn and his security team are ordered to parachute into the area in a desperate bid to reach the crash sites ahead of the Russians. It’s now obvious that the Pentagon and CIA are withholding vital information, but Flynn and his men have no choice but to make the dangerous jump.Soon they’re caught in a deadly game of hide-and-seek with Spetsnaz commandos operating covertly on American soil. It seems that the F-22s and their Russian counterparts aren’t the first aircraft to have gone missing in these desolate mountains. The Kremlin is hunting for the first prototype of its new stealth bomber—which vanished on what was supposed to be a test flight…while loaded with nuclear-armed stealth cruise missiles.As Russia and the U.S. square off on the brink of all-out-war, it’s up to Nick to find the missing bomber…and prevent a potential nuclear holocaust.",
  "genres": [
    "Thriller",
    "Fiction",
    "Military Fiction",
    "Mystery",
    "Action",
    "Audiobook",
    "Adventure"
  ],
  "author": "Dale Brown",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/55501754-arctic-storm-rising"
}