{
  "title": "All the Love in the World",
  "description": "Christmas. New Year’s Eve. Valentine’s Day. Summer Vacation. Halloween. Pick your holiday and strap yourself in for some epic love stories from your favorite novels by New York Times Bestselling author Karina Halle. This collection of five sexy, funny, thrilling, & emotional stories & novellas bring together some of the most beloved characters from such books and series as The Forbidden Man, The Nordic Royals, Experiment in Terror, Dirty Angels, and The McGregors into one amazing anthology. Each story is all original, never-before published, with each story revolving around a specific holiday. So whether you’re in the Christmas spirit, all loved up with Valentine’s Day, want to be spooked by Halloween, or ring in the New Year, there’s something for everyone. • The Off-Season: Retired captain of Real Madrid Luciano Ribeiro and his fiancée Ruby Turner have recently moved to the remote Portuguese island of Madeira, expecting peace and quiet. With former teammate Alejo Albarado and his wife Thalia showing up alongside their old coach Mateo Casalles and his wife Vera, the island gets turned upside down. Luckily for the men of Real Madrid, it’s nothing they can’t handle. Featuring characters from Love in English, The Forbidden Man, & The One That Got Away. • Christmas with the Cartels: Revered drug lord Javier Bernal thought he’d get to have a nice, quiet Christmas with his wife Luisa and young son Vicente. That is until he’s having a very Scrooge-like visitation from the ghost of Christmas past, making him face all the horrible things he’s done...and the people he's lost. Luckily, Javier is one to roll with the punches, even when a rival cartel threatens to spoil their holiday. Featuring characters from the Dirty Angels Series. • Ghosted: Every day is Halloween for married ghost-hunters Dex and Perry Foray. But this year, that thin veil between the living and the dead is more vulnerable than normal, and it seems a few ghosts have made their way through into the cold, wet streets of Seattle. But what happens when one of the spirits turns out to be a man they thought they’d never see again, a man who crawled straight from Hell. Featuring characters from the Experiment in Terror Series and The Devil's Duology. • A Nordic New Year: King Aksel of Denmark and his wife Queen Aurora are helping Prince Magnus throw an intimate New Year’s Eve party in the rugged mountains of Norway, alongside Prince Viktor, Prince Orlando, and their loved ones. But they get more than they bargained for when they’re snowed in with no end in sight. Featuring characters from The Nordic Royals Series. • Arrow Through the Heart: Being born on Valentine’s Day has always been an annoyance to Lachlan McGregor, never mind the fact that it was the day his mother gave him away to an orphanage. But this year, his brother Brigs, and his cousins Linden, Bram, Keir and Mal have decided on the biggest birthday party, with everyone flying out to be with him in Scotland. But when his estranged mother comes back in his life, it pushes Lachlan to the brink, with only his love Kayla Moore to save him. Featuring characters from The McGregors (The Pact, The Offer, The Play, The Lie, and The Debt). ** these stories feature characters from previous books and series. They are not intended to be read as standalones as they contains spoilers for prior novels**",
  "genres": [
    "Romance",
    "Anthologies",
    "Novella",
    "Contemporary Romance",
    "Christmas",
    "Holiday",
    "Adult"
  ],
  "author": "Karina Halle",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/55510207-all-the-love-in-the-world"
}