{
  "title": "How to Survive America",
  "description": "Legendary comedian D.L. Hughley uses humor to confront racism's unjust impact on the health and wellbeing of Blacks and minorities White people love survival guides. But have you noticed they’re always about ridiculous activities in locations far from home, with chapters like “How to Survive an Avalanche\" or \"How to Live on Bugs in the Jungle.” Huh?!You know who really needs a survival guide? Black and brown Americans. For surviving their own damn country! Minority populations wake up every day in a battle for their health and safety. Thankfully, legendary activist-comedian D.L. Hughley offers How to Survive America, a fearless satire that exposes racism’s unjust toll on our bodies and minds.Even before COVID-19 disproportionately impacted minority communities, life expectancy for Blacks was a full three years less than for white Americans. The very air we breathe is more polluted, our water is more contaminated, our local food options are toxic, and our jobs are underpaid. Despite the obvious need, the quality of our health care is tragically inadequate. Our communities are statistically less safe than the average, and yet we’re terrorized by the law-enforcement and criminal-justice systems that are supposed to protect us, sending Blacks to prison at five times the rate of whites. Not least, our means of addressing these injustices—voting—is perennially under assault.It’s enough to drive you crazy. Well, guess what? According to Cigna, Blacks are 20 percent more likely to report “psychological distress” yet “50 percent less likely to receive counseling or mental health treatment.” It’s almost like the entire country has been structured with no regard for our welfare. Hmmm.Whether you’re Black, white, brown, or Asian, don’t leave home without arming yourself with <>How to Survive America!",
  "genres": [
    "Nonfiction",
    "Humor",
    "Social Justice",
    "Race",
    "Audiobook",
    "Politics",
    "Essays"
  ],
  "author": "D.L. Hughley",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/55507046-how-to-survive-america"
}