{
  "title": "The Ailing Nation: Lessons From the Bedside for America's Leaders",
  "description": "A NATION IN DISTRESS America has enjoyed an enviable life. Yet, in recent years, there have been unmistakable signs of chronic illness. Our economic progress has fallen off its once-blistering pace, our ability to shape world events has been checked, and our vaunted democratic institutions have begun to collapse around us. America is ailing. Now, here we are, nearly forty years into a chronic illness that has resisted our best efforts at diagnosis. Is this the cancer of our advancing age? The long, slow, terminal decline that will defy the best approaches of modern Medicine? Our fitful end? Not necessarily. In the past four decades, American hospitals have garnered principles of safety from the aviation industry, gathered tips about quality from automobile manufacturers, and gleaned insights into customer service from the hotel trade. These interstellar innovations launched American healthcare into a continuously self-improving model of advancing performance. As such, the world of Medicine has valuable assets to offer the political A culture of excellence. Intellectual tools to diagnose and treat difficult problems. A systematic approach that guides almost everything we say and do, yet is seldom employed in the chambers of government. And now it is time to pay it forward. In this collection of riveting stories from patient narratives and leadership challenges - from heartbreaking tales of AIDS, to a harrowing evacuation during Superstorm Sandy, to the exhilarating conquest of Ebola - Dr. Nate Link translates a lifetime of experience into useful lessons for our nation's leaders. To review these examples, he takes us to the bedside of his most memorable cases. We will learn from Natalie, the well-meaning ICU nurse who ignored the ventilator alarm, Juan, the irrepressible AIDS patient who had nine lives, Gerry, the bemused accountant whose brain could not store new memories, and Thomas, the accidental tourist who was raised from the dead. Two dozen other notable patients will teach us additional lessons in leadership. In the final chapter, our lessons will jointly lead us to a most unexpected conclusion and a prescription for the cure of our nation's mysterious malady. Dr. Link is the Chief Medical Officer of Bellevue, America's oldest public hospital, and has practiced there since arriving as a lowly intern at the onset of the AIDS epidemic. He earned his MD from Washington University School of Medicine in 1983, then completed his internship and residency in Internal Medicine at NYU School of Medicine and Bellevue Hospital in 1986. Dr. Link was Co-Chief Editor of the \"Bellevue Guide to Outpatient Medicine,\" winner of the American Medical Writers Association award as Book of the Year for Physicians in 2001.",
  "genres": [],
  "author": "Nate Link",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/55496374-the-ailing-nation"
}