{
  "title": "Mark Rutte",
  "description": "In 2006 won Mark Rutte de lijsttrekkersstrijd van de VVD maar nét van Rita Verdonk. In de partij bleven er daarna zoveel twijfels over hem dat hij in 2009 bijna door het hoofdbestuur naar huis werd gestuurd en in 2010 ook niet de officiële premierskandidaat mocht zijn van de VVD. Tien jaar later lijkt zijn positie onaantastbaar, en niet alleen in de VVD. In Mark Rutte laat NRC-journalist Petra de Koning zien wat hem maakte tot wie hij is, hoe zijn manier van denken en doen zich ontwikkelde. En misschien ook wel vooral al die jaren hetzelfde bleef. Hoe kan het dat iemand die bekend kwam te staan als politicus-zonder-opvattingen, die met rechts en links regeerde, een rij van verkiezingsbeloften verbrak en grote politieke inschattingsfouten maakte, volgens opinieonderzoek in 2020 wordt gezien als de beste naoorlogse minister-president van Nederland? Mark Rutte gaat over een politiek leider die als scholier en student al op zoek was naar een rol voor zichzelf in de geschiedenis. Het is het verhaal dat mensen van dichtbij met hem meemaakten, op school en thuis, in de JOVD, op het Binnenhof, in Europa. En ook het verhaal dat voor een deel werd bedacht door campagnestrategen en andere VVD’ers die zich bleven afvragen of Rutte wel echt wist en snapte wat zijn eigen kiezers het allerbelangrijkste vonden. Mark Rutte laat een politicus zien die extreem kwaad kan zijn als hij de controle verliest. Die vertrouwelingen kwijtraakte en dus ook leegte om zich heen creëerde. Maar die ook elke zondag koffie dronk met de bejaarde moeder van een vriend, die in zijn appartement boven hem woonde en niet moeilijk deed toen er door het plafond heen stroop uit haar keuken op zijn Italiaanse pakken was gekomen. En haar voorstel weigerde om meer te gaan betalen aan huur. ‘Wat moet ik met dat geld?’",
  "genres": [
    "Biography",
    "Nonfiction",
    "Politics",
    "Autobiography"
  ],
  "author": "Petra de Koning",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/55525688-mark-rutte"
}