{
  "title": "Have Yourself a Merry Little Secret",
  "description": "Have Yourself a Merry Little... Secret!From the seductive boudoirs and elite salons of London to the ancient castles of the snowy Scottish Highlands, our fearless heroines enter the Christmas season in pursuit of their heart's desire.But, the course of true love never did run smooth... especially when SECRETS abound.Settle in to enjoy these tales of intrigue, romantic adventure, sizzling passion, and heartwarming holiday romance.This collection of never-before-published Yuletide historical romances from your favorite authors is available for just three months, so don’t miss out.Unwrap the pleasure...Wedding Her Christmas Duke - by Collette CameronHe’s not who he says he is…but then again, neither is she. Their secrets are revealed at a Christmastide house party, resulting in scandal and scorching romance.The Knot of a Knight - by Linda Rae SandeSir Randolph’s daytime occupation collides with his nocturnal avocation of service to the Crown when he discovers Lady X's hidden stash of bank notes. They might be counterfeit—but are his feelings for her?The Marquess is Mine - by Tamara GillIs a Christmas ball at St. Albans Abbey the perfect setting for Sarah to regain her trust in love—and in Giles? Or is their second chance at happily ever after doomed to end as badly as their first?A Yuletide Miracle - by Laurel O'DonnellThe one knight who didn’t believe her was the only man who could keep her secret and save the Yule.The Lady Who Stole Christmas - by Sydney Jane BailyAmid mistletoe and missing jewels, a wealthy widow and a sexy sleuth play a game of cat and mouse.Christmas with a Czar - by Emily E.K. MurdochThis Christmas at St. James’ Court, a gentleman claiming to be a Czar is not all that he seems...A Scot Most Wanted - by Angelique ArmaeWhen highwaywoman Catrina Lennox’s secret is unmasked during a Christmas Eve snowstorm, she learns just how deliciously scandalous the laird she once walked out on, truly is.Secretly Marvellous - by Virginia TaylorLady Mary doesn’t expect Lord Westerham to ask for her hand in marriage, but she has a secret reason to say ‘yes’ and mean ‘no.’Yuletide Secrets - by S. CindersHe promised to never love again—until she, quite literally, fell at his feet. Now, he's ruined for anyone else but her.One Scandalous Christmas - by J. BurrelliRobert Vaughn never expected to lay eyes on Kitty Thorpe again. Her misplaced anger confounds him, but the fire in her eyes tempts him to pure folly, of falling in love with her all over again.The Rogue's Secret - by Stacy Reid and Giselle MarksBachelor Lord Rupert Rogers is searching for the treasure his great uncle suggests he has left him but finds an enemy and a bride he must convince with one kiss at a time that they are perfect for each other...The Secrets He Keeps - by Amy SandasShe’s the madam of an elite London brothel. He’s a master in the art of seduction. Enticing her to his bed will be a pleasure. Convincing her love is real might prove to be impossible.",
  "genres": [
    "Christmas"
  ],
  "author": "Collette Cameron",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/55518158-have-yourself-a-merry-little-secret"
}