{
  "title": "Draw with Rob at Christmas: A Fabulously Festive Art Activity Book",
  "description": "Merry Christmas! The internet phenomenon #DrawWithRob is now a fantastically festive art activity book for you to draw with Rob at home… The second book based on the viral videos seen everywhere on YouTube, Facebook, TikTok, TV, and more, from the creative genius and bestselling author Rob Biddulph! Christmas is different this year, with more families at home and wondering what to do! Pick up your pencils and join thousands of children around the world and #DrawWithRob – celebrating Christmas has never been so much fun! The first DRAW WITH ROB activity book went to Number One in the charts and was named ‘Book of the Year’ at the 2020 Sainsbury’s Children’s Book Awards! Now every family can share this fantastically festive new art activity book for Christmas. Join Rob and learn to draw your favourite Christmas characters – from Polar Bears to Elves and from Father Christmas to a Snowman, this perfect present is packed with arts, crafts and festive fun. The bestselling and award-winning author/illustrator Rob Biddulph is the genius behind the phenomenal, viral sensation that is DRAW WITH ROB and the accompanying activity book, and now the sensational DRAW WITH ROB AT CHRISTMAS – bringing joy to families everywhere with his easy to follow instructions and warm-hearted humour. So whether you’re in home education, home-schooling, learning to draw or just having fun, let Rob show you that anyone can learn to #DrawWithRob! *WITH PERFORATED PAGES SO YOU CAN EASILY TEAR OUT AND DISPLAY YOUR ART!* Rob’s original hit videos are also available at www.robbiddulph.com, and on Facebook, YouTube, TikTok, and Instagram, with Rob appearing on TV to talk about them too. Perfect stay-at-home fun for boys, girls, and everyone aged three to one hundred and three, and a wonderful introduction to Rob Biddulph’s bestselling picture book range – including the Waterstones Children’s Book Prize-winning Blown Away , Odd Dog Out , and many more! Available in all good bookstores and online retailers, and perfect for children who are learning to read – or just love to!",
  "genres": [],
  "author": "Rob Biddulph",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/55520730-draw-with-rob-at-christmas"
}