{
  "title": "Tafsir Ibn Kathir - Abridged",
  "description": "Translated and abridged by a group of scholars under the supervision of Sheikh Safiur-Rahman Al-Mubarakpuri. The Qur'an is the revelation of Allah's Own Words for the guidance of His creatures. Since the Qur'an is the primary source of Islamic teachings, the correct understanding for the Qur'an is necessary for every Muslim. The Tafsir of Ibn Kathir is the most renowned and accepted explanation of the Qur'an in the entire world. In it one finds the best presentation of Ahadith, history, and scholarly commentary. Tafsir Al-Qur'an Al-Azim, which is famous by the title Tafsir Ibn Kathir, by Al-Hafiz. Abu Al-Fida' 'Imad Ad-Din Isma'il bin 'Umar bin Kathir Al-Qurashi Al-Busrawi (d. 774 H.), is the most popular interpretation of the Qur'an in the Arabic language, and the majority of the Muslims consider it to be the best source based on Qur'an and Sunnah. This Arabic work spans three thousand and two hundred pages in four volumes. To cover all of the references, Ibn Kathir has also collected some weak Ahadith and Israelites stories. Some repetitions also occur in it, as and when the topics required these. Tafsir Ibn Kathir is one of the Most Comprehensive and Complete Explanation of The Noble Quran. Translated in to the English language for the First time in the History of Islam! Translated and abridged by a group of scholars under the supervision of Sheikh Safiur-Rahman Al-Mubarakpuri. The Qur'an is the revelation of Allah's Own Words for the guidance of His creatures. Since the Qur'an is the primary source of Islamic teachings, the correct understanding for the Qur'an is necessary for every Muslim. The Tafsir of Ibn Kathir is the most renowned and accepted explanation of the Qur'an in the entire world. In it one finds the best presentation of Ahadith, history, and scholarly commentary. All of the authentic saying of the Prophet Mohammad (peace be upon him) are presented in Arabic along with the diacritics. Muslims all over the world use it as a trusted source of Tafsir of the Qur’an and Sunnah. It is a resource that all libraries or personal collection of English Islamic books should have.",
  "genres": [
    "Islam",
    "Religion",
    "Spirituality"
  ],
  "author": "ابن كثير",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/555133.Tafsir_Ibn_Kathir_Abridged"
}