{
  "title": "Grief Healed: A Physician's Guide to Dealing with Grief and Thriving",
  "description": "Grief is so devastating that it is paralyzing.How do you deal with life-altering losses? How can you pick yourself up from a cascade of tragic events? How can you maintain your will to live—let alone your sanity?Readers will discover…Simple, practical steps to move forward from the shock and pain of traumatic lossKnowledge and techniques to create joyful, well-lived, fulfilling livesThe importance of learning to let goAspects of non-traditional wellness therapies that allow us to connect with Source and develop resiliencyHow to merge spirituality with the grieving processPraise for Grief “Grief Healed is a self-help book of the highest order! What is unique about Dr. Sona Bhatnagar’s story is her practical processes that can support anyone going through major trauma.”—Mrs. Kathy and Dr. Issam Nemeh, M.D., Anesthesiologist, General Surgeon, International Spiritual Healer.“Dr. Sona guides people in the often unpredictable terrains of life where no roadmap really works. This book is a true friend to uplift the morale of mankind.”—Mohanji, Himalayan Spiritual Master, World-renowned Humanitarian.“Dr. Bhatnagar uses her 30 years of medical training and her education as a Grief Recovery Specialist to guide the reader into renewal and personal growth after great loss.”—Dr. Jeff Rediger, M.D., Harvard Medical School Faculty, Author of The Life-Changing Science of Spontaneous Healing.“Grief Healed is such an accessible and enlightening read written with a crispness and fluidity that is lacking in most grief/self-help books. This book has legs and is for anyone coping with loss of any type.”—Justin M. Yopp, PhD, Clinical Psychologist and Associate Professor of Psychiatry at the University of North Carolina at Chapel Hill, Author of The Seven Widowed Fathers Reimagine Life.“Grief Healed takes a topic that is universally traumatic and demonstrates a path of spirituality and healing.”—Kathilyn Solomon, EFT Practitioner & Mentor, Author of Tapping Into Using EFT To Clear Emotional and Physical Pain and Illness.“What an absolute treasure to help uncover the secrets of grief and learning to heal and love after loss.”—Mesina Sanders, world-famous Psychic.“In so many ways this manuscript is peering into my soul. Thank you so much for sharing this with me. It is allowing me to let go, finally!”—Roshan K Mathew, MD, Vanderbilt University School of Medicine.“Dr. Sona Bhatnagar uses her life lessons as a vehicle to open the door to many people who may be sitting in their own infinite loops of sorrow, hurt & grief, thus breaking the cycle that keeps people trapped in despair and inaction. She is a blessing.”—Asavri Gupte, Author of Little Pilot Logbook and creator of the Baby Nebula books.“Congratulations on teaching all these life lessons and so many more in such a meaningful, personable, and relatable way. Bravo, Sona!”—Amy Coleman, M.D. Founder and CEO of Wellsmart Medical Services. Author of Discovering Your Own Doctor Within.\"Sona Bhatnagar is a gifted writer and an inspiring storyteller. Grief Healed is a compelling testament to the power of faith and the tenacity of the human spirit.",
  "genres": [
    "Medicine"
  ],
  "author": "Sona Bhatnagar",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/55513599-grief-healed"
}