{
  "title": "The Black Church: This Is Our Story, This Is Our Song",
  "description": "From the New York Times-bestselling author of Stony the Road and one of our most important voices on the African-American experience, a powerful new history of the Black church in America as the Black community's abiding rock and its fortress.The companion book to the upcoming PBS series.For the young Henry Louis Gates, Jr., growing up in a small, segregated West Virginia town, the church was his family and his community's true center of gravity. Within those walls, voices were lifted up in song to call forth the best in each other, and to comfort each other when times were at their worst. In this book, his tender and magisterial reckoning with the meaning of the Black church in American history, Gates takes us from his own experience onto a journey across more than four hundred years and spanning the entire country. At road's end, we emerge with a new understanding of the centrality of the Black church to the American story--as a cultural and political force, as the center of resistance to slavery and white supremacy, as an unparalleled incubator of talent, and as a crucible for working through the community's most important issues, down to today.In a country that has historically afforded its citizens from the African diaspora tragically few safe spaces, the Black church has always been more than a sanctuary; it's been a place to nourish the deepest human needs and dreams of the African-American community. This fact was never lost on white supremacists: from the earliest days of slavery, when enslaved people were allowed to worship at all, their meeting houses were subject to surveillance, and often destruction. So it continued, long after slavery's formal eradication; church burnings and church bombings by the Ku Klux Klan and others have always been a hallmark of the violent effort to suppress the struggle for equality for the African-American community. The past often isn't even past--Dylann Roof committed his slaughter in Charleston's Emanuel AME Church 193 years after the church was first burned down by whites following a thwarted slave rebellion.But as Gates brilliantly shows, the Black church has never been only one thing. Its story lies at the vital center of the civil rights movement, and produced many of its leaders, from the Reverend Martin Luther King, Jr. on, but at the same time there have always been churches and sects that eschewed a more activist stance, even eschewed worldly political engagement altogether. That tension can be felt all the way to the Black Lives Matter movement and the work of today. Still and all, as a source of strength and a force for change, the Black church is at the center of the action at every stage of the American story, as this enthralling history makes vividly clear.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Race",
    "Christian",
    "Christianity",
    "American History"
  ],
  "author": "Henry Louis Gates Jr.",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/55513324-the-black-church"
}