{
  "title": "Sentinals Awaken",
  "description": "Winner of the 2021 Readers' Favorite Finalist Award for Fantasy-EpicAs a three thousand-year-old threat reemerges, only one man has the power to awaken the world’s greatest protectors and restore order to the realm. He just doesn’t know it yet.When Jerrol Haven, a captain in the King’s Rangers, discovers treason at the highest level, he knows immediately that the knowledge puts his life at risk. And indeed, though he expected the ailing King to shield him, the ambitious Crown Prince sentences Jerrol to death. What hold does the Prince have over his weakened father, and who or what is he protecting? As Jerrol flees for his life, he is rescued by the enigmatic Lady Leyandrii, a goddess who, according to legend, once saved the land of Remargaren from malevolent wild magic users known as the Ascendants by raising a veil to nullify their power and exiling them. Now, with signs that her veil is weakening and the Ascendants are creeping back into power, she has returned and is in dire need of Jerrol’s help. For though he doesn’t know it, Jerrol possesses a rare gift: By chance, he touches a revered Sentinal tree and awakens Birlerion, one of the Lady’s personal guard who have been sleeping in the strange, tall trees since they were last called to battle. Aided by Birlerion and an old friend, Jennery, Jerrol begins his journey to help Lady Leyandrii save Remargaren once more. But time is running out: As it was with the King, the old guard Lords are everywhere being usurped, attacked, and assassinated, while their heirs behave strangely and refuse to honour the Lady as Remargarens have done for millennia. Jerrol must unravel the mystery of the Ascendants’ return, stop the sinister force that is dividing good families through bloodshed and betrayal, and rescue the King—and his troubles are only just beginning.Sentinals Awaken is the first book in the saga of Remargaren, a vibrant, ancient world of high fantasy suffused with magic and adventure.",
  "genres": [
    "Fantasy",
    "Audiobook"
  ],
  "author": "Helen Garraway",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/55519316-sentinals-awaken"
}