{
  "title": "The Secret Language of Birthdays: Personology Profiles for Each Day of the Year",
  "description": "Many people have long suspected, as astrologers believe, that the day you were born affects your personality. While no one knows exactly how or why, birthdays do tend to be uncannily accurate predictors of psychological tendencies. The Secret Language of Birthdays by Gary Goldschneider and Joost Effers describes in detail the characteristics and quirks of personality associated with being born on a particular day of the year.The 366 personality profiles in The Secret Language of Birthdays are based on a combination of astrology, numerology, the tarot, and Gary Goldschneider's many years of observation of more than 14,000 people, including contemporary and historical figures. Goldschneider's theory of \"personology\" proposes that all of life is cyclical: people born on the same day occupy the same point in the year's cycle and thus share certain characteristics.Learn what famous personalities were born on your birthday....Study your astrological sign and your personology profile....Your strengths, weaknesses, and major concerns will be illuminated while you are given practical advice and spiritual guidance. While you study your profile, you will find it hard to resist examining those of family, friends, colleagues, and favorite celebrities.Non one who reads this book can feel left out, since each one of us has a birthday. The Secret Language of Birthdays may help to bring people to a better understanding of themselves and of others, including those living now, those who have gone before, and even those yet to come. The Secret Language of Birthdays is truly a celebration of our differences and similarities as human beings.",
  "genres": [
    "Astrology",
    "Nonfiction",
    "Reference",
    "Spirituality",
    "New Age",
    "Occult",
    "Self Help"
  ],
  "author": "Gary Goldschneider",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/126811.The_Secret_Language_of_Birthdays"
}