{
  "title": "The Awesome Pizza Cookbook: An Incredible Guide with Nice Recipes to Prepare",
  "description": "Where and when did this pizza craze begin? Well, where most delicious cuisine comes Italy – Naples, to be exact. It was during the 1700s when the town was growing, and street vendors began offering a cheap flatbread with toppings. Legend had it that it sparked the attention of King Umberto I and Queen Margherita as they were passing through, and from then, it became more popular. Did it ever! The world became enthralled with this basic creation. In 1905, G. Lombardi’s opened in Manhattan, becoming the first registered pizza join in America. During World War II, migration across the country brought a wave of business west. You can probably fill in what happened next. No? Okay, I will make it easy on you. We became obsessed! From expansion to delivery to hipster trends, pizza has been a cornerstone of dining out. It’s easy, it’s cheap, and it’s quick. You can get it in a pinch, or when you’re feeling lazy, it can be consumed alone or by the masses at huge gatherings, and it can be made in every way possible. Now, it’s even easier to make at home. What else can be done? Remember when “picture in picture” came out on televisions and you were like, “No way, the future is here, there’s no way they can top that?” Pizza keeps progressing as well and stays true to its roots. What I’m trying to say is why isn’t “picture in picture” a thing anymore? It was amazing! No, wait, that’s not what I’m trying to say. We’re obsessed all right. It’s hard to find someone who doesn’t enjoy pizza, and if they don’t, they’re probably lying, and you shouldn’t affiliate yourself with liars. The reason I say that is because you can make a pizza every which way, healthy or non-healthy. If they have an excuse, you have an answer. I heard, and then always like to repeat, that a pizza can contain the four major food groups in every bite. Of course, trends have altered the structure of the food pyramid with new allergies and diseases evolving as well as yet another super food being pushed. I mean, I guess you could make a soy cheese, quinoa, and kale pizza with a gluten-free crust, but that’s you’re thing, definitely not mine. I’m lactose intolerant and I still have classic mozzarella on my pie. I just keep the good people over at Lactaid in business. My point is that you can benefit from what many automatically claim to be unhealthy food. The best way to make sure you’re getting everything you want, whether that be your weird toppings or your healthy alternative, is to make the pizza at home. You’re given a blank canvass when you make your dough and you can do anything you please. Also, generally speaking, you tend to have less grease when cooking at home because you can control the amount of ingredients you use. You have the ability to control the health level, don’t go blaming the pizza! It doesn’t know any better. This book • Pizza with Lamb Sausage, Caramelized Onions, And Marjoram • Fennel Pizza with Bresaola and Lemon • Merguez Flatbread with Zucchini, Smoky Eggplant, And Cilantro • Pizza with Chicken Sausage, Red Onions, And Charred Sweet Pepper and Tomato Sauce • Roasted Clam and Bacon Pizza • And so much more!! So be healthy, be creative, and have fun making the pizza you want at home!",
  "genres": [],
  "author": "Angel Burns",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/55555017-the-awesome-pizza-cookbook"
}