{
  "title": "Seasons Between Us: Tales of Identities and Memories",
  "description": "What is a life well-lived? How should life be lived? What kind of stories will you leave behind?Travel with twenty-three science fiction and fantasy authors through the seasons of life to capture the memories, identities, and moments of stepping through the portal of change, as they cope with their own journeys of growing older.From the moment of birth, through each threshold of our lives, to the moment we take our last breath, we age.Some of us leap into a hopeful future, some cling to the knowns of our former selves, some wander obliviously through the minefields and poppies of change. Something is lost, something is gained in each season. Things forgotten, things remembered.A child redefines identity and belonging in post-Soviet Hungary. A girl blossoming to adult awareness exchanges life for death in rural Canada. A college student chooses between the magic of ancient spirits and the magic of daily happiness in modern Japan. In futuristic India, a mother finds joy in the balance between family and career. Under the Andulasian sun, a mathematician consults his older self in affairs of love. In alternate Tanzania, a husband and wife discover wisdom in memory loss. A robot eases an old man's grief, and a grandmother opens her heart when she listens to her child. And many more hopeful stories.Featuring Original Stories by Maurice Broaddus, Vanessa Cardui, C.J. Cheung, Joyce Chng, Eric Choi, S.B. Divya, Alan Dean Foster, Bev Geddes, Maria Haskins, Tyler Keevil, Rich Larson, Karin Lowachee, Brent Nichols, Heather Osborne, Y.M. Pang, Karina Sumner-Smith, Amanda Sun, Patrick Swenson, Bogi Takács, Hayden Trenholm, Liz Westbrook-Trenholm, Jane Yolen, and Alvaro Zinos-Amaro.With an Introduction by Candas Jane DorseyEdited by Susan Forest and Lucas K. LawThe anthologies in this award-winning series (Strangers Among Us, The Sum of Us, Where the Stars Rise, Shades Within Us) have been recommended by Publishers Weekly, Booklist (American Library Association), Kirkus Reviews, Library Journal, School Library Journal, Locus, Foreword Reviews, and Quill & Quire.",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Anthologies",
    "Science Fiction"
  ],
  "author": "Susan Forest",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/55534517-seasons-between-us"
}