{
  "title": "Kamala's Way: An American Life",
  "description": "A revelatory biography of the first Black woman to stand for Vice President, charting how the daughter of two immigrants in segregated California became one of this country’s most effective power players.There’s very little that’s conventional about Kamala Harris, and yet her personal story also represents the best of America. She grew up the eldest daughter of a single mother, a no-nonsense cancer researcher who emigrated from India at the age of nineteen in search of a better education. She and her husband, an accomplished economist from Jamaica, split up when Kamala was only five.The Kamala Harris the public knows today is tough, smart, quick-witted, and demanding. She’s a prosecutor—her one-liners are legendary—but she’s more reticent when it comes to sharing much about herself, even in her memoirs. Fortunately, former Los Angeles Times reporter Dan Morain has been there from the start.In Kamala’s Way , he charts her career from its beginnings handling child molestation cases and homicides for the Alameda County District Attorney’s office and her relationship as a twenty-nine-year-old with the most powerful man in the married Assembly Speaker Willie Brown, a relationship that would prove life-changing. Morain takes readers through Harris’s years in the San Francisco District Attorney’s Office, explores her audacious embrace of the little-known Barack Obama, and shows the sharp elbows she deployed to make it to the US Senate. He analyzes her failure as a presidential candidate and the behind-the-scenes campaign she waged to land the Vice President spot. Along the way, he paints a vivid picture of her values and priorities, the kind of people she brings into her orbit, the sorts of problems she’s good at solving, and the missteps, risks, and bold moves she’s made on her way to the top.Kamala’s Way is essential reading for all Americans curious about the woman standing by Joe Biden’s side.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Politics",
    "Audiobook",
    "Womens",
    "Memoir",
    "History"
  ],
  "author": "Dan Morain",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/55554057-kamala-s-way"
}