{
  "title": "Just Good Friends",
  "description": "After twenty-nine years working as a police officer in NY, my dad attended a call that shocked the country when the details were aired on the news. He’d done everything he could, but he’d been too late to save the daughter of a powerful businessman. After a lengthy trial and investigation, and with her killer in prison, her father had turned his focus onto the people he felt failed him and her—my dad and his partner included, and their families. After a close call, we decided it would be safer and Dad could focus on stopping Cevdet Gjorka if I wasn’t there, so I started over somewhere far away from my family as Zuri Hadid. I’ve kept my head down and work at a hospital in Texas now, not saying more than I have to. Well, until the topic of jelly fish came up and I remembered a meme I’d seen online. Who can resist spouting facts that probably aren’t true? Not me!It was only meant to be temporary, but I love living in Piersville… and then there’s Garrett Evans. He makes me want to get out and live again, instead of hiding all the time. Sometimes bad things bring new joy and light into our lives, right? That is until trouble found me.∞∞∞∞Leaving the military should have been a scary experience, but I couldn’t say I felt that way.Yeah, I’ve had some nightmares and I definitely have scars, but I’d come out of the Army with plans for my new civilian life, and it’d turned out better than I thought it would. Some of my scars weren’t from the military, though, and if I’d known a jellyfish sting years ago would bring Zuri into my life, I’d have thanked it instead of calling it every name under the sun. But then, for some ungodly reason, I’d immediately friend zoned myself with her.Fortunately, I prefer to think of zones as suggestions, not limits, and suggestions can be changed with a bit of persuasion and work, so that’s what I set about doing. Well, after we’d both been stitched up in hospital after an unfortunate accident involving me and a door, with Zuri standing on a chair on the other side of it. It didn’t break the ice per se, but it definitely broke the glass.I never imagined that the kinds of monsters I’d fought against would follow me from my old life into the new one. These ones weren’t terrorists from overseas, they were living on home soil with the power of money behind them who wanted revenge, and for people to feel the pain they were feeling. One thing is clear, though—when you get good in your life, you fight to keep it. Who knew a meme could have such an impact.",
  "genres": [
    "Romance"
  ],
  "author": "Mary B.  Moore",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/55582195-just-good-friends"
}