{
  "title": "A Part Apart: The Life and Thought of B.R. Ambedkar",
  "description": "Bhimrao Ramji Ambedkar (1891–1956) is perhaps the most iconised historical figure in India. Born into a caste deemed ‘unfit for human association’, he came to define what it means to be human. How and why did Ambedkar, who revered and cited the Gita till the 1930s, turn against Hinduism? What were his quarrels with Gandhi and Savarkar? Why did he come to see himself as Moses? How did the lessons learnt at Columbia University impact the struggle for water in Mahad in 1927 and the drafting of the Constitution of India in 1950? Having declared in 1935 that he will not die as a Hindu, why did Ambedkar toil on the Hindu Code Bill? What made him a votary of Western individualism and yet put faith in the collective ethical way of life suggested by Buddhism? Why is it wrong to see Ambedkar as an apologist for colonialism? From which streams of thought did Ambedkar brew his philosophies? Who were the thinkers he turned to in his library of fifty thousand books? What did this life of the mind cost him and his intimates? What of his first wife, Ramabai, while he was busy with the chalval?A Part Apart is a rigorous effort at both asking questions and answering as many as one can about B.R. Ambedkar. Ashok Gopal undertakes a mission without parallel: reading the bulk of Ambedkar’s writings, speeches and letters in Marathi and English, and what Ambedkar himself would have read. This is the story of the unrelenting toil and struggle that went into the making of Ambedkar legend.A graduate in history, Ashok Gopal has worked as a journalist, consultant for NGOs, curriculum designer and educational content developer. He has been studying the life and thought of Dr Babasaheb Ambedkar since 2004. He lives in Pune.The book features 70 photographs, most of them from the archivist Vijay Surwade’s collection.",
  "genres": [
    "India",
    "Biography",
    "Nonfiction",
    "History",
    "Politics"
  ],
  "author": "Ashok Gopal",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/126816808-a-part-apart"
}