{
  "title": "Love Me to Death: A Journalist's Memoir of the Hunt for Her Friend's Killer",
  "description": "In 1994, Ricardo Caputo, object of an international FBI manhunt, turned himself in, confessing to the brutal murders of four women. For more than two decades, he had moved with ease from one U.S. city to the next, and across the Mexican border, altering his identity, and killing with impunity. Now the deadly Don Juan, whom one detective called 'a beautiful snake', has been found. But for Linda Wolfe, the search had just begun.Acclaimed for her incisive true-crime journalism, Linda Wolfe has explored some of the darkest aspects of human nature. But never before had she felt as visceral and disturbing a reaction as she did to Ricardo Caputo. Some ten years earlier, the author's friend, New York writer and activist, Jacqui Bernard, was murdered, and Wolfe had become convinced that Caputo was the killer. His arrest, in 1994, propelled her on a deeply affecting, personal odyssey. The result is a profoundly intimate and eloquent account of Linda Wolfe's confrontation with Caputo - and of the tragedy and terror he left in his wake.Seeking closure in the death of her friend, Wolfe met with the families of both Caputo and his victims; she spoke with police investigators, psychiatrists who had treated Caputo, and lawyers on both sides of the case; and she pored over private letters, diaries, and photo albums. She also conducted three prison interviews with Caputo. What emerges is not only a frightening and unforgettable portrait of a serial killer, but a powerful and poignant evocation of the lives he touched, twisted, and destroyed.Distrusting Caputo's expressions of remorse, seeking the true reason for his surrender, Wolfe strives to make sense of the seductive sociopath whose violence was rooted in his troubled chilhood in Argentina, and who spread his venomous charm from suburban Long Island to San Francisco's Pacific Heights. She pieces together profiles of the attractive, successful, sophisticated women he preyed upon. And she addresses some of the troubling legal issues facing a justice system that too often turns criminals into celebrities, shifts blame to the victims, and allows defendants to abuse the insanity defense.Love Me To Death is more than a triumph of investigative journalism. It is a candid, compelling story of innocence and evil, crime and punishment - and Linda Wolfe's own determined quest to unmask and face the enemy.",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "Linda Wolfe",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/55565.Love_Me_to_Death"
}