{
  "title": "The Burning Blue: The Untold Story of Christa McAuliffe and NASA's Challenger Disaster",
  "description": "The untold story of a national trauma—NASA’s Challenger explosion—and what really happened to America’s Teacher in Space, illuminating the tragic cost of humanity setting its sight on the starsYou’ve seen the pictures. You think you know what happened. You do not.On the morning of January 28, 1986, NASA’s space shuttle Challenger exploded shortly after blasting off from Cape Canaveral. Christa McAuliffe, America’s “Teacher in Space,” was instantly killed, along with the other six members of the mission. Right? Wrong.Thirty-five years after NASA’s revitalization program literally went up in smoke, Kevin Cook uncovers the untold story of the disastrous order to launch on an ice-cold Florida day. For the first time, he takes readers inside the shuttle for those agonizing two minutes and forty-five seconds after the fire, which, yes, some of the astronauts survived.But this is more than a simple corrective to a now-dimming memory. Centering on McAuliffe, a charmingly ordinary civilian on the cusp of history, The Burning Blue animates the mission’s colorful cast of characters, which featured the second female astronaut (who was also the first Jewish astronaut), the second Black one, and the first Asian-American and Buddhist in space. Drawing intimate portraits of the people wearing the spacesuits and detailing how they earned the right to suit up, Cook makes readers temporarily forget the tragedy toward which the tale is hurtling. Infused with drama, immediacy, and compelling characters, The Burning Blue reveals the human price paid for politics and capital-P Progress on that ill-fated, unforgettable morning.",
  "genres": [
    "Nonfiction",
    "History",
    "Space",
    "Science",
    "Biography",
    "Audiobook",
    "American History"
  ],
  "author": "Kevin Cook",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/55578045-the-burning-blue"
}