{
  "title": "Yes We Can: Barack Obama's History-Making Presidential Campaign",
  "description": "Yes We Can is a personal and comprehensive record of Barack Obama’s world-changing campaign for the presidency. With more than 200 color photographs by award-winning photojournalist Scout Tufankjian, the book takes the reader on an unforgettable journey. Barack Obama’s run for president touched something profound in America, awakening a civic engagement, pride, and passion that many had perhaps given up on. In the course of his campaign, Obama inspired millions of Americans - young and old, rich and poor, rural and urban, and from every racial and ethnic background. These images, by the only photographer who covered his entire campaign from start to finish, pay heed not only to the man who would be President, but also the people who came to see him, hear him, and vote for him. Yes We Can is a rich portrait of Obama’s historic campaign — a campaign that is as much about Americans and their hopes and dreams as it is about the man that gave them voice.The first time I photographed Barack Obama, I really didn’t want to go. I knew who he was and was interested in him, but I had plans for that weekend — plans that did not involve driving five hours to New Hampshire to photograph what I assumed would be a deadly dull event. But when Kelly Price, my editor at Polaris Images, told me the German newsmagazine Stern would pay me to make that five hour drive, I canceled my plans, climbed into my Camry, and drove up to Portsmouth. It was probably the best decision I ever made. To some extent, my predictions had been accurate. The book signing was a photographer’s nightmare. The building was huge, dark, cavernous, and impossible to find. I showed up late and in a panic. Looking around, I was convinced that there was no way I was going to be able to make a decent picture in that room. When Obama walked into the room, my aesthetic issues with the room became immediately irrelevant. The crowd was transfixed. Hell, some of the other news photographers were transfixed. And this was New Hampshire! New Hampshire photographers are not impressed by politicians. Ever. Immediately after the event was over, even before filing my pictures, I called Kelly and told her that I was going to cover the Obama presidential campaign. I did not offer her a choice. The fact that he wasn’t technically running yet was immaterial. I knew that this was going to be important and I wanted to be there. Despite my complete lack of “on-the-bus” experience, the national editor at Newsweek took a huge risk and assigned me to cover Barack Obama’s announcement tour. For the first two days of the campaign I would be a part of the traveling press corps. I would have to learn fast. And I did. For the next twenty-three months, I followed Obama from event to event, only heading home for quick breaks to meet with editors and to remind my boyfriend what I looked like. I followed him into coffee shops and diners, auto manufacturing plants and bowling alleys. I followed him in a rental car and I flew in his charter jet. I photographed Obama wooing potential voters in huge, expensive houses and on poverty-stricken Indian reservations. I covered small events, where I was the only photographer present, and I covered massive rallies with more than 75,000 people in cities like Denver and Berlin. Even as the campaign stretched from one year to two, and as I marked my third winter photographing the Senator, I have not lost interest in this campaign and the people that have supported it. Whether the audience included a skeptical old farmer from Tama, Iowa, who was surprised to slowly realize that he had something in common with this young black politician from Hawaii or an eight-year-old boy from LA who couldn’t stop saying “He is going to be President! He looks like me and he is going to be President!” the people’s reaction to the Senator and his campaign have fueled my work. The looks on their faces, the questions on their lips, and the ways that they hang on his every word, are a constant reminder of how lucky I have been to document this moment in history. - Scout TufankjianThe Journey of an American Excerpts from Yes We Can",
  "genres": [
    "Politics",
    "History",
    "Biography"
  ],
  "author": "Scout Tufankjian",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/5556889-yes-we-can"
}