{
  "title": "Hungry Hearts: Essays on Courage, Desire, and Belonging",
  "description": "Sixteen innovators, creatives, and thought leaders--Austin Channing Brown, Sue Monk Kidd, and Luvvie Ajayi Jones, among others--share intimate stories of uncovering beauty and potential through moments of fear, loss, heartbreak, and uncertainty.\n\"If you are looking for a little bit of gentleness, a warm word from writers you can trust, well, here it is.\"--GlamourOver the course of four years, the traveling love rally called Together Live brought together diverse storytellers for epic evenings of laughter, music, and hard-won wisdom to huge audiences across the country. Well-known womxn (and the occasional man) from all walks of life shared their most vulnerable truths in a radical act of love, paving the way for healing in the face of adversity.Now, off the stage and on the pages of Hungry Hearts, sixteen of these beloved speakers offer moving, inspiring, deeply personal essays as a reminder that we can heal from grief and that divisions can be repaired. Bozoma Saint John opens herself up to love after loss; Cameron Esposito confronts the limits of self-reliance in the wake of divorce; Ashley C. Ford learns to trust herself for the first time. A heartfelt anthology of transformation, self-discovery, and courage that also includes essays by Luvvie Ajayi Jones, Amena Brown, Austin Channing Brown, Natalie Guerrero, Sue Monk Kidd, Connie Lim (MILCK), Nkosingiphile Mabaso, Jillian Mercado, Priya Parker, Geena Rocero, Michael Trotter and Tanya-Blount Trotter of The War and Treaty, and Maysoon Zayid, Hungry Hearts shows how reconnecting with our own burning, undeniable intuition points us toward our unique purpose and the communities where we most belong.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Memoir",
    "Self Help",
    "Audiobook",
    "Biography Memoir",
    "Anthologies"
  ],
  "author": "Jennifer Rudolph Walsh",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/55573795-hungry-hearts"
}