{
  "title": "The Most Interesting Person in the Room: A brief guide to understanding the world",
  "description": "The origin of the marathon derives from the legendary story of Philippides running from the Battlefields of Marathon to Athens in 490 B.C. This distance was approximately 40 km, however, was changed in 1908 to please a lazy 67-year-old king.In nearly every geography classroom around the world hangs a map called the Mercator Projection. This is the mostly widely distributed, yet inaccurate map in history and could be distorting societal views on the world.Americans celebrate Christopher Columbus Day, despite the fact he was not the first to discover America, nor did he set foot on the North American continent. The famous Italian explorer died alone and poor, with his heirs suing the Spanish Crown for their share of the New World fortune.Pallor, algor, rigor, and livor mortis are the different stages of a decomposing body, which help coroners determine the time and cause of death, and if the body has been moved. When humans eventually expire, the last thing they see is a tunnel of white light, as they slowly fade away... Is it the gates of heaven? In the late 19th century, the world suffered from a pollution epidemic that threatened the entire existence of global cities. This environmental threat did not originate from rats, or factories, but instead horse manure. This was not the first time in history that poop threatened to destroy our civilization. The Most Interesting Person in the Room is a rich, fast-paced exploratory journey into the world. This debut book from author Thomas Vernon is a glorified fact book, exploring the broad topics into Health, History, Sport, Finance, and Death. The informal, easy-to-read style enables the reader to jump down the rabbit hole of curiosity and learn about topics and issues to broaden the reader’s horizon.",
  "genres": [
    "Nonfiction",
    "History",
    "Psychology",
    "Science",
    "History and Politics"
  ],
  "author": "Thomas   Vernon",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/55573766-the-most-interesting-person-in-the-room"
}