{
  "title": "Whistle: A New Gotham City Hero",
  "description": "A new Gotham City superhero appears in this YA graphic novel.Sixteen-year-old Willow Zimmerman has something to say. When she's not on the streets advocating for her community, she's volunteering at the local pet shelter. She seeks to help all those in need, even the stray dog she's named Lebowitz that follows her around. But as much as she does for the world around her, she struggles closer to home--taking care of her mother, recently diagnosed with cancer. Her job as an adjunct professor of Jewish studies does not provide adequate health insurance--and Willow can see that time is running out.When in desperation she reconnects with her estranged \"uncle\" Edward, he opens the door to an easier life. Through simple jobs, such as hosting his private poker nights with Gotham City's elites, she is able to keep her family afloat--and afford critical medical treatments for her mother.Willow's family life quickly improves through the income provided by these jobs, but it comes at the cost of distancing herself from the people she truly cares about. Her time is now spent on new connections, such as biologist and teacher Pammie Isley. And when Willow and Lebowitz collide with the monstrous Killer Croc outside the local synagogue, they are both injured, only to wake up being able to understand each other. And there are other developments, too...strange ways in which they've become stronger together. Willow's activism kicks into high gear--with these powers, she can really save the world!But when Willow discovers that Edward and his friends are actually some of Gotham's most corrupt criminals, she must make a choice: remain loyal to the man who kept her family together, or use her new powers to be a voice for her community.",
  "genres": [
    "Graphic Novels",
    "Young Adult",
    "Comics",
    "Superheroes",
    "Fantasy",
    "Dc Comics",
    "Fiction"
  ],
  "author": "E. Lockhart",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/55562431-whistle"
}