{
  "title": "Ninja Girl Adventures: An action packed fantasy adventure story about the power of sisterhood, finding your own inner strength, and well, ninjas!",
  "description": "Sister Power at It’s BestMoira Mackenzie is just 14 years old. Her sister Mindy is 15, and their younger sister Marci is 9. The girls have lived their lives until now believing their father, Scottish billionaire Stephen Mackenzie, is simply a businessman whose KogaTech Consolidated (KTC) is the world’s most successful technology company. Their father was married to a Japanese woman, Kameko, whom the girls are told died in a car accident.The girls’ idyllic existence in New York, where KTC headquarters is located, is shattered when their father disappears. He is legally declared dead by their Uncle Jiro Akiyama, Kameko’s brother. Uncle Jiro wants to possess the company for himself. What he doesn’t know is that Stephen Mackenzie changed his will so that Moira inherits the entire corporation.An overwhelmed Moira must contend with the unraveling of her family. She has the help of Morton Gerardi, Stephen Mackenzie’s best friend, but he’s not the girls’ father and there’s only so much he can do. While Mindy rebels and Marci, a child genius, disappears deeper into her computer, Moira is further frightened by an intruder who invades the girl’s Manhattan apartment. Not long after this, Moira is visited by Uncle Jiro himself, who offers to provide for the girls financially as long as Moira signs the company over to him. Moira considers giving in but doesn’t. Suddenly, out of nowhere, black-clad figures, who can only be the mythical ancient ninja of feudal Japan, attack the Mackenzie sisters. The girls are saved by an elderly Asian woman who heads a ninja clan of her own. That woman removes her face mask to reveal that she is Aiko Akiyama, the girls’ grandmother. Moira immediately has many questions. Why has Aiko only now revealed herself?Aiko explains that Kameko, as Aiko before her, was a member of a Koga ninja clan of Kunoichi — a female ninja. Aiko was forced to fake her own death because of Jiro’s ambitions. She vows to teach Moira to become a ninja warrior and fulfill her family destiny. As Moira beings to learn the ways of the ninja, Aiko’s Yoda-like lessons give her greater self-confidence as well as physical martial arts skills. She passes these lessons to her sisters… but there’s more. Legends claim the ninja were shape-changing tengu, forest spirits with magical powers. Aiko reveals that these stories are true. If Moira wishes, she can learn these mystical abilities. Jiro himself can become a wolf and other ferocious beasts. Moira can learn these same skills, just as Aiko has.As Moira trains and learns more about herself, she helps her sisters to grow more confident and more disciplined as well. Soon, Mindy is using her gymnastics skills to have ninja-style adventures of her own, as genius Marci helps both of her sisters using her knowledge of computers.As they grow in their abilities, the girls uncover a plot by Uncle Jiro to misuse “sleep learning” technology developed by KTC. This is why Jiro wants the company. He believes the technology can be used to control minds, ultimately giving him control over the city — and perhaps, one day, even more than that. As the girls use their new abilities to chase down clues that point them to Jiro’s sinister ambitions, Jiro grows tired of holding back. He instructs his ninja to kidnap Mindy and Marci. He then tells Moira she has no choice but to sign KTC over to him if she ever wants to see her sisters again.To get her sisters back, Moira will have to face her greatest fears. With only partial training, she must conquer her own doubts and apply the lessons of empowerment and confidence that Aiko has given her. The story climaxes in a battle between the two rival ninja clans wherein Moira must first save her sisters and then defeat Jiro himself. The fate of New York City hangs in the balance, as does the fate of Moira’s family and of her father’s company.",
  "genres": [
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Melissa Wilson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/55579563-ninja-girl-adventures"
}