{
  "title": "Whispers: An American Legend",
  "description": "If M.T.T. is just a myth, why are there so many missing children?An epic family vacation spirals into a conspiracy filled nightmare when Stacy Cooper's niece is stolen and the only clue left behind points to a monster that dates back to the foundation of the United States.As Stacy and her family use all their power and privilege to track down their eight year old, it becomes clear that the creature they hunt is ancient, sinister and all too real.Get your copy of the satirical thriller that's been called \"Prophetic\" and \"A Future Classic\" - Producer Valerie McGowan Bestseller in four categories, Satire, Fiction Satire, Thriller and #1 Bestseller in Sociology of Abuse for six weeks. This is filmmaker Bonné Bartron's debut novel.“Whispers is a unique story of social and family danger that reaches into disparate lives” - D. Donovan, Senior Reviewer, Midwest Book Review“Indelible female characters enhance this dense but engaging abduction tale” Verdict? Get it! — Kirkus “A storyline that draws you down a rabbit hole, while moving you forward, that's hard to put down and might leave you questioning everything you think you know.” — Reedsy/Jennie Louwes“Step aside Slenderman & Momo, Mr. Tasty Treats is here, and he’s coming for your babies.” - The Literary Wife\"Wound up like a top; This child - kidnapped thriller spins the reader into unraveling the twisted Internet, police department, and government agencies to find a missing child. An honest outrage, intertwined to unmask the reader to take responsibility towards the apathy that cloaks our awareness.\" - DonnaM Goodreads\"This is a really good read. The suspense is awesome, and keeps you on the edge of your seat throughout. The author does a really good job of building the characters and the world and really making you care about the characters. You will have a hard time honestly not caring about Tilly. Read on, you will not be disappointed.\" - Justin GoodreadsIt's Bartron's truest wish that this book makes you feel seen, or gives you a chance to see from another perspective.",
  "genres": [],
  "author": "Bonné Bartron",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/55583183-whispers"
}