{
  "title": "Halfway Between: The Complete Series",
  "description": "All three novels in Kathryn Ann Kingsley's Dark Fantasy Romance Series, HALFWAY BETWEEN, are now available in one collection.Book 1, SHADOW OF ANGELSThe first time I died was November 1st, 1945. That might’ve been the first time, but it certainly wasn’t the last.My name is Veil, and my life has been far from normal. Everything I thought I knew about myself had been a lie. Every single thing. Turns out, I had been in the care of a cult dedicated to a King in Hell and fallen archangel.But after learning the truth of who—or what—I was, I devoted my life to stopping them and everyone like them.Which is why when I learned that Boston was under siege from an occult society who was slaughtering innocents, I had no choice but to come and stop them. Even if it meant it would take me piece by piece through that past I’d spent seventy years trying to avoid—and right into the presence of the archdemon I’d been running from for so very long. Asmodeus.Just when I thought things could not get worse, I realized once more that I had no clue what was coming next…Book 2, BLOOD OF ANGELSWhen I learned the truth of what I was seventy years ago, let’s just say, I didn’t take it well.I’m not human. I never was.I’m a homunculus crafted by two creatures for their benefit. Azrael, the archangel of death, made me to be his daughter and Asmodeus, the archdemon of lust, created me to be his wife.That’s the simplest part of my life right now.Now, there’s a murderous cult in the city of Boston who’s abducting angels and demons. I thought this had nothing to do with me, but Octavian, the cult’s leader, wants to show me how very wrong I was.I’m trapped between my desire to fight the cult, and fighting my desire for Asmodeus. He loves me, and I loved him once. But in the face of all his lies, I’m not sure if I can—or should—love him again.With Octavian closing in, taking more and more of the archangels and archdemons for some mysterious purpose, I may never get the chance to decide how I feel.I may not make it through this at all.Book 3, FALL OF ANGELSAsmodeus lied to me.While I shouldn’t be surprised, to say my feelings for the archdemon are complicated is putting it lightly. But now, I don’t even know if I’ll ever have the chance to decide how I feel about him.Unfortunately, I know the terrible truth.Asmodeus told me that I was the only homunculus he made that survived—but there’s another one. The leader of the deadly cult that’s been abducting archangels and archdemons, Octavian, is just like me. He’s a creature made from the flesh of others and given a life he didn’t want.I’m Octavian’s prisoner now. He’s a sadist and a monster, and I can’t die. That’s a terrible combination. He’s eager to tell me all of what he knows, and why he’s been killing people and taking angels—but it’ll come at a price.A price I don’t know if I can afford to pay. But I get the feeling I don’t have a choice. I just hope Michael, Azrael, and the others can find me before it’s too late.I might not be able to die, but there are far worse fates than death.",
  "genres": [
    "Paranormal",
    "Dark Romance",
    "Romance",
    "Fantasy"
  ],
  "author": "Kathryn Ann Kingsley",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/55594652-halfway-between"
}