{
  "title": "I Promise You",
  "description": "From #1 Amazon Charts and WSJ Bestselling Author Ilsa Madden-Mills comes an all-new swoony romance between the football hottie and the mystery girl he kissed years before…Dillon McQueen: Babe. I promise. You want me.Serena Jensen: Um, who are you?There’s a legend at Waylon University: the first girl you kiss freshman year at the bonfire party is the one you’ll never forget. She’ll crawl under your skin. She’ll spark a passion so fierce you’ll burn the world down to possess her.You might even put a ring on it.But...timing is everything. That kiss can go horribly wrong. She might run in the opposite direction. And boy, did Serena run.Dillon is Waylon’s hotshot quarterback with something to prove. All he wants is to graduate and make it to the NFL. What he doesn’t need is to finally meet the mystery girl he kissed at the bonfire freshman year. Isn’t it enough that she’s haunted his dreams for more than a thousand nights?Fate laughs in his face when he runs into the plucky girl at the Piggly Wiggly. Surrounded by his entourage, he’s got all the Oreos in his cart; she gets revenge by buying every six-pack of his favorite beer.Obviously, that legend is a curse. She’s not his type and hates him. Worst of all, how can she not remember him when she left a Serena-shaped hole in his heart for the past three years?So why can’t he stop trying to win her?Will this quarterback score the girl or make the biggest fumble of his life?Author’s Note: I Promise You is a complete stand-alone college sports romance. Expect hot football jocks, strong women with pluck, a tell-it-like-it-is Nana, deep feels, fun banter, and a sigh-worthy happy ending. No cheating or cliff-hangers.*Also read I Dare You, I Bet You, and I Hate You, ALL STAND-ALONE COLLEGE FOOTBALL ROMANCES.",
  "genres": [
    "Sports Romance",
    "Romance",
    "Sports",
    "College",
    "New Adult",
    "Contemporary",
    "Football"
  ],
  "author": "Ilsa Madden-Mills",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/55588809-i-promise-you"
}