{
  "title": "Parthenon Místico",
  "description": "O cenário é o Brasil do século XIX. No mundo concebido pela mente do premiado autor Enéias Tavares, a tecnologia a vapor permite a existência de carruagens sem cavalos, máquinas voadoras e prodigiosos robôs autômatos. É neste lugar que um grupo de personagens inusitados se une para formar o Parthenon Místico e enfrentar os vilões da Ordem Positivista Nacional.O leitor mais atento, ao começar o livro, vai perceber que vários dos personagens a que Enéias Tavares dá vida já são seus conhecidos: já os viu em O Ateneu, de Raul Pompeia; em Contos Amazônicos, de Inglês de Souza; em Noite na Taverna, de Alvares de Azevedo; em Dr. Benignus, de Augusto Emilio Zaluar, e em tantas outras obras. A eles se juntam mais histórias da literatura brasileira, bem como personagens originais do universo de Tavares, chamado de Brasiliana Steampunk.Além da empolgante aventura nesse cenário repleto de literatura, misticismo e vapor, o leitor ainda pode viver uma experiência transmídia. Parthenon Místico não se contém apenas entre as páginas do romance, mas se desdobra em mapas, ilustrações, histórias em quadrinhos, áudio dramas e um tarô, tudo acessado através do celular. O universo de Brasiliana Steampunk também está presente nas telas, na série lançada na Amazon Prime A Todo Vapor!Parthenon Místico continua a trama de O Ateneu e conta a origem da Liga Extraordinária Tupiniquim já vista em A Lição de Anatomia do Temível Dr. Louison (LeYa, 2014). Neste prequel, que funciona mesmo sem a leitura do livro anterior, descobriremos quem integrou as duas gerações desta insólita sociedade secreta. Dividida em seis partes, a trama é contada por noitários e gravações, recriando os estilos textuais dos autores que emprestaram seus personagens a Tavares. Soma-se ao texto a arte de Ana Koehler que coloca em seu belo traço os personagens do livro.Prepare-se, nobre leitor, pois Enéias Tavares criou um universo único a partir de referências literárias diversas e o chamado da aventura foi feito a você. Aceite e conheça esse mundo cheio de letras, vapor e grandes ideias!",
  "genres": [
    "Science Fiction",
    "Steampunk",
    "Fantasy"
  ],
  "author": "Enéias Tavares",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/55582675-parthenon-m-stico"
}