{
  "title": "Mardon",
  "description": "Greed and vengeance are powerful tools, but not as strong as a forbidden kiss that neither of them can seem to forget.\nWith his crazy old grandmother on board The Falcon, Mardon sets sail with his crew. They are following a clue that will hopefully lead them to where Mardon's late father buried treasure. When they dock at Great Yarmouth, it isn't treasure they find. Instead, a mysterious nun in a tavern helps them decipher the code that points them to the Canterbury Cathedral. A nun in a tavern isn't an everyday occurrence. Odder still, is the fact that Mardon can't shake the feeling he knows her, or that he is attracted to her.Lady Emmaline de la Croix's reputation has been ruined by her late French husband. She thought the naked painting he commissioned of her would remain private, but now every man in France has seen it. To make matters worse, the painting was stolen by pirates that boarded their ship and killed her husband. Emmaline was kissed by a handsome pirate that day, just before she tried to kill him. It was a kiss so passionate, that she's never been able to forget it.As a widow, Emmaline goes back to England and is put in a nunnery by her family. She'd rather die than to live without knowing true love for a man. She escapes, with her goal being to hunt down the pirate ship and steal back the naked painting. Hopefully, she can clear her sullied name and marry another nobleman and start over. But once she's reunited with the pirate named Mardon, she can't stop thinking about the kiss they shared, even if she is in disguise as a nun.One searches for treasure while the other seeks redemption. Sparks of passion are ignited between a lady and a pirate, but they both know they can't stay together. What started as a simple kiss now promises, or threatens, to change their lives forever.",
  "genres": [],
  "author": "Elizabeth Rose",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/55591911-mardon"
}