{
  "title": "Fall From Grace",
  "description": "The mysteriously violent death of a prominent New England patriarch exposes a nest of dark family secrets in bestselling author Richard North Patterson’s twentieth page-turning novel.The mysterious, violent death of a prominent New England patriarch exposes a nest of dark family secrets in bestselling author Richard North Patterson’s twentieth compelling novel.Adam Blaine arrives on the island of Martha’s Vineyard to attend the funeral of his estranged father, Ben Blaine, a famous and charismatic writer who has served as patriarch of his clan for many years. A man fond of sailboats, good wine, and women other than his wife, Ben Blaine has left behind a string of secrets in addition to an emotionally distraught widow and his strangely aloof mistress, Carla Pacelli, a beautiful television actress who once had a drug problem.As soon as Adam arrives, he discovers that Ben has disinherited his mother, uncle, and brother in favor of his lover, and begins to wonder if his father’s death—caused by an inexplicable fall from a cliff—might be murder. Using his training as a CIA operative, Adam skillfully seeks to obscure the evidence suggesting that a family member may have killed his father, while at the same time fighting to undo the will, which favors the enigmatic Carla. As he walks this tightrope, Adam risks his freedom and perhaps his life, even as he unearths increasingly disturbing family secrets never meant to be discovered, and which cause him to question his understanding of his own life and everyone around him—his beloved mother, uncle, and brother and, not least, Carla.Filled with tight psychological intrigue that will keep readers guessing until the very last page, Fall from Grace confirms that “Richard North Patterson is one of the best in the business” ( Time ).",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Audiobook",
    "Mystery Thriller",
    "Family",
    "Book Club"
  ],
  "author": "Richard North Patterson",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/12682653-fall-from-grace"
}