{
  "title": "No Strings Attached",
  "description": "Ci sono incontri che ti cambiano la vita, basta un singolo istante e tutto ciò che avverrà dopo sarà condizionato da quell’attimo. Skylar Allen ha cinque anni quando conosce Jaxon all’orfanotrofio dove vive dalla nascita.Per la prima volta ha qualcuno a cui voler bene, un amico che la protegge e la incoraggia a realizzare i suoi sogni, almeno fin quando Jaxon non viene adottato.Se ne va con la promessa di scriverle una lettera ogni giorno, ma dopo un anno Skylar è costretta a rassegnarsi all’evidenza: Jaxon si è dimenticato di lei.È questo che pensa ancora, dopo diciotto anni, quando se lo ritrova davanti. Lui e i The Blind Spot, la sua band, hanno prenotato una vacanza proprio nell’albergo in cui lavora.Peccato che le cose non stiano più come prima. Perché Jaxon ha davvero realizzato il sogno di cui parlavano da piccoli, è una rockstar, mentre lei non è riuscita a diventare una campionessa di pattinaggio su ghiaccio come gli aveva promesso. Inoltre, Jaxon non è più il bambino dei suoi ricordi, è un divo arrogante e sfrontato e Skylar è ben contenta che lui non l’abbia riconosciuta né sappia che non si chiama più Jas come in quel tempo lontano.Jaxon Mitchell ha nove anni quando finisce all’orfanotrofio e incontra per la prima volta la piccola Jas. Proprio come lei, sogna una vita distante da quel posto infelice e, ben presto, farla sorridere si trasforma nel suo scopo principale, il suo affetto riempie il vuoto che ha dentro.Dopo l’adozione, attende a lungo che la piccola Jas risponda alle sue lettere, ma la cassetta della posta resta sempre vuota ed è costretto a rassegnarsi alle parole di sua madre: Jas, probabilmente, non vuole più avere nulla a che fare con lui.Solo dopo diciassette anni scopre che i suoi genitori non hanno mai spedito nessuna di quelle lettere e che, sicuramente, la sua amica è convinta lui l’abbia abbandonata.Per questo, appena ne ha la possibilità, prenota una vacanza in Minnesota, in un albergo di montagna non distante dall’orfanotrofio in cui ha trascorso un anno con lei. Le sue ricerche, però, sono infruttuose, Jas pare scomparsa nel nulla; Jaxon considererebbe l’idea di tornare in breve a New York e ai suoi impegni con la musica non fosse per Skylar, quella ragazza dalla lingua saccente a cui pare non importi nulla che lui sia una star e che, suo malgrado, gli ricorda ogni giorno di più la piccola Jas.Sa bene che non sono la stessa persona, ma forse lei è l’unica che può renderlo ancora capace di amare qualcuno.Una promessa, un sogno, un legame che va oltre il tempo e le distanze.",
  "genres": [
    "Romance",
    "Second Chance",
    "Music",
    "Friends To Lovers",
    "Contemporary Romance",
    "New Adult",
    "Abuse"
  ],
  "author": "Laura Rocca",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/55601284-no-strings-attached"
}