{
  "title": "Have Yourself a Merry Little Scandal",
  "description": "Have Yourself a Merry Little... Scandal!From the snowbound Scottish Highlands to the glittering ballrooms of London, our fearless heroines enter the Christmas season in pursuit of their heart's desire.But, the course of true love never did run smooth... especially when SCANDAL is afoot.Settle in to enjoy these tales of romantic adventure, sizzling passion, and heartwarming holiday romance.This collection of never-before-published Yuletide historical romances from your favorite authors is available for just three months, so don’t miss out.Unwrap the pleasure...Rogue for Hire - by Sasha CottmanWhen heiress Alice North engages the scandal managing services of Lord Harry Steele, she gets a first-hand lesson in steamy, wicked behaviour.The Highlander's Christmas Lassie - by Anna CampbellA chance to mend two shattered lives. After years of searching, the Laird of Dun Carron finds his lost beloved and their son, but the reunion doesn’t go as expected.The Christmas Rose - by Emma V. LeechDarkly handsome Ludo—universally known as Lascivious Lord Courtney – is the wickedest rake in Christendom, and unwitting wallflower Felicity Bunting just accidentally trapped him into marriage.The Lady's Guide to Scandal - by Emmanuelle de MaupassantWith her name already mired in scandal, posing as the fiancée of reckless explorer Ethan Burnell can only spell trouble--or make Cornelia Mortmain so notorious she'll become irresistible. The game is on!The Courtship Caper - by Beverley OakleyWhen the scandalous Brightwell sisters wave their matchmaking wands, Christmas becomes a comedy of errors for two hapless couples who find themselves paired with their imperfect match.A Scandalous Secret - by Laura TrenthamA secret passion is revealed when a spymaster’s daughter and the man pledged to protect her are forced to shelter for the night in a cottage—with only one bed.Fate Gave Me a Duke - by Amanda MarielChristmas brings unforeseen complications for the Duke of Cleburne and Lady Juliet Gale. Will they give into fate, or fight against it?Duncan's Christmas - by Ellie St. ClairDuncan McDougall is on a mission to reclaim his betrothed. Though the woman he nabs isn't the one he intended, she just may be the one truly intended for him.Bedeviled: A Russian Pursuit - by Elsa HollandPrince Ilya Petroski is honor-bound to play the rake and dominate London's gossip columns; cruel are the fates to introduce him to the love of his life, the gentle-hearted Seraphina Seymour.At the Mistletoe Masquerade - by Dayna QuinceLady Cassandra's plans go amiss when a kiss gone too far turns into the scandal of the season.The Christmas Courtesan - by Victoria ValeMoonlighting as a Gentleman Courtesan seems like the best way to earn a dowry for his sister—until a scandal during a Christmas house party leads Roger Thornton toward a fiery and unexpected love.A Scandal Before Christmas - by April MoranHe’s determined to win her back; she’s determined to resist. Will the night before Christmas bring scandal or the renewed promise of a wedding?Her Virgin Duke - by Nicola DavidsonA lost wager sparks an unlikely alliance and a wicked affair between England's stuffiest duke and London's Mistress of Sin.",
  "genres": [],
  "author": "Anna Campbell",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/55605197-have-yourself-a-merry-little-scandal"
}