{
  "title": "Past the Glad and Sunlit Season",
  "description": "K. A. Opperman conjures up a pageant of autumnal imagery sure to delight all fans of the Halloween season. Often recalling the charming rhymes on vintage postcards, these poems take us on a stirring journey deep into October’s heart, offering treats—and a few tricks—to those brave enough to follow the jack-o’-lantern’s orange grin into the night. Put on your costume, grab your pumpkin-shaped treat-bucket, and come discover what treasures are to be found past the glad and sunlit season, where both the dying year—and youth itself—confront what it means to face the darkness at summer’s end.The poetry in this delightful volume is accompanied by 15 full-page illustrations by noted weird artist Dan Sauer, whose images celebrate the macabre nostalgia evoked by the the poems of Mr. Opperman and by All Hallows' Eve itself.“...[K. A. Opperman] is the gifted descendent of poets ranging from Poe to Walter Scott to Robert Burns, all of whom understood that Halloween’s deliciously dark mood may be best served by poetry.”—From the Preface by Lisa Morton, author of Trick or Treat: A History of Halloween“K. A. Opperman’s poems evoke both the dark chill of late October and the warmth of a cottage fireside. He captures a time outside of time, an otherworld populated by Pumpkin Kings and haunted souls who wander the edges of our consciousness begging to come inside. The book is a heartfelt incantation to mysteries of Halloween.” —Lesley Pratt Bannatyne, author of Halloween: An American Holiday, an American History\"These visions of All Hallows’ Eve are sure to enchant and whisk the reader away to a world of crisp autumn leaves, brimming with magic. The poems within this collection are steeped in folklore and perfectly reflect the ambiance of Halloween. This book will become your treasured new Halloween tradition.”—Mickie Mueller, author of Llewellyn’s Little Book of Halloween“Past the Glad and Sunlit Season is a cornucopia of autumnal delights. At turns whimsical and sombre, K. A. Opperman’s Halloween poems serve as fine evocations of that season of mist, fire, and scythe.” —Richard Gavin, author of Sylvan Dread: Tales of Pastoral Darkness“Follow the flickering orange light into the darkness beyond Summer’s End, and pay court to the Pumpkin King. . . . K. A. Opperman’s passion for Halloween burns as brightly as Jack’s fabled lantern. That, combined with his uncanny metrical precision, is a potent recipe for verse-magick that is as haunting as it is darkly delightful.” —Adam Bolivar, author of The Lay of Old Hex“K.A. Opperman has gifted us a varied gathering of lovely, intelligent poems that swell from a passion for the magical black and orange season. Beautiful and evocative, the works are rich in imagery and mood, composed of intriguing rhyme schemes and word choices. Reading this collection made me think of the noble poetry of old, and the subject could not appeal to me more. Past the Glad and Sunlit Season is a treasure from a superb wordsmith whose love for the great season burns brighter than a thousand jack-o’-lanterns. I hereby dub Mr. Opperman the poet laureate of Halloween.”—Scott Thomas, author of The Sea of Ash“All hail the Pumpkin King, aka K. A. Opperman! Those of us who love Halloween in all its guises will be delighted by this collection of seasonal poetry.”—Denise Dumars, author of The Dark Archetype: Exploring the Shadow Side of the Divine",
  "genres": [
    "Poetry",
    "Halloween",
    "Horror",
    "Ghosts"
  ],
  "author": "K.A. Opperman",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/55621337-past-the-glad-and-sunlit-season"
}