{
  "title": "Back to the Coast",
  "description": "“A splendid job...Those who appreciate intelligent writing and emotionally plausible characters will be rewarded.” — Publishers Weekly “Noort cranks up the tension with skill to produce a truly gripping nightmare.” — Sunday Telegraph Praise for Saskia Noort : 'A mystery writer of the heart as much as of the mind, a balance that marks her work with a flesh-and-blood humanity.'—Andrew Pyper, author of The Wildfire Season “Affairs, deceit, manipulation, tax dodges and murder—-there’s nothing Noort shies away from stirring into the mix, nicely showing off the sinister side of the suburbs.”— Time Out “While there are echoes of Desperate Housewives here, this is closer to Mary Higgins Clark and is a good bet for her fans.”-— Library Journal Maria has money problems, two children from a failed marriage, and a depressive boyfriend. When she becomes pregnant, she decides not to keep the baby and then the letters start to arrive. Threatening letters, from pro-life activists she thinks at first, but then she begins to suspect others—even her own boyfriend. She flees to her sister’s house, redolent with memories of a childhood she does not want to revisit. As the death threats follow her to her hiding place, Maria begins to fear not only for her life but for her own sanity. This is relentless suspense writing; it is a description of Maria’s hellish descent into a world of induced paranoia that ends with a narrow escape from a carefully planned murder. Saskia Noort , born in 1967, is an acclaimed author of literary thrillers and international bestsellers. She has sold over a million copies of her first three novels and splits her time between the Netherlands and a Spanish island retreat.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Suspense",
    "Roman",
    "Novels",
    "Contemporary"
  ],
  "author": "Saskia Noort",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/5562152-back-to-the-coast"
}