{
  "title": "Captain Vorpatril's Alliance",
  "description": "New York Times bestseller!  When handsome Ivan Vorpatril reluctantly agrees to help Barrayar’s undercover security keep an eye on a young woman in danger, he is drawn into a tangled network of intrigue and unlikely romance. The job description did not include arrest warrants from the local police or being caught in the endless schemes of warring Houses from Jackson’s Whole. Returning to Barrayar with the young lady, both are faced with choices and challenges neither had expected.  Starred Booklist review: “For years fans have clamored for Ivan Vorpatril’s story, and at last Bujold delivers something that will thrill the devoted audience and entrance new readers…. Essential for all SF collections and a must-read for Bujold and Vorkosigan fans… In the SF world, a new release doesn’t get much bigger than this one.”  Booklist *Starred Review* (FULL REVIEW) \"Set a few years before the most recent Miles Vorkosigan story (CRYOBURN, 2011), this may be one of the most anticipated and long-awaited entries to Bujold’s acclaimed Vorkosigan saga. For years fans have clamored for Ivan Vorpatril’s story, and at last Bujold delivers something that will both thrill the devoted audience and entrance new readers. For many years, Ivan has been perfectly content to live a quiet bachelor life and serve as a staff officer to a Barrayaran admiral. With no desire for the imperial throne or the types of death-defying adventures that his cousin Miles so adores, Ivan has become a master at avoiding political intrigue and entangling alliances. Asked to look after a young woman during a brief trip to Komarr, Ivan is happy to oblige. But when his attempt to ask the woman out ends up with her handmaiden knocking him out and tying him to a chair, Ivan realizes that something very bad is going on. It quickly becomes clear that the only way Ivan can save himself and his charge is to marry Tej Arqua and bring her home to Barrayar. Longtime readers will love seeing a new side of Ivan as well as hearing his views on many of the series characters. New readers can enjoy Ivan’s story on its own but will miss many of the nuances that add depth and character; best to begin at the beginning. Essential for all SF collections and a must-read for Bujold and Vorkosigan fans. HIGH-DEMAND BACKSTORY: In the SF world, a new release doesn’t get much bigger than this one. The wait is finally over for Bujold’s followers.\" - Jessica Moyer  “Bujold continues to prove what marvels genius can create out of basic space operatics.” - Library Journal  “Bujold is not just a master of plot, she is a master of emotion.” - SF Site  “Bujold is one of the best writers of SF adventure to come along in years.” - Locus Magazine  “A superb craftsman and stylist, Ms. Bujold is well on her way to becoming one of the great voices of speculative fiction.” - Rave Reviews  \"Boy, can she write!\" - Anne McCaffrey  “Bujold has a gift, nearly unique in science fiction, for the comedy of manners.” - Chicago Sun Times  “Superb far-future saga.” - Publishers Weekly on the 'Vorkosigan' series  Bujold's \"work remains among the most enjoyable and rewarding in contemporary SF.\" - Publishers Weekly  about the author: Lois McMaster Bujold was born in 1949, the daughter of an engineering professor at Ohio State University, from whom she picked up her early interest in science fiction.  She now lives in Minneapolis, and has two grown children.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Romance",
    "Audiobook",
    "Science Fiction Fantasy",
    "Fantasy"
  ],
  "author": "Lois McMaster Bujold",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/55606278-captain-vorpatril-s-alliance"
}