{
  "title": "Driftwood: Stories from the Margarita Road",
  "description": "** ONE OF THE \"BEST BOOKS OF 2020\" ~ KIRKUS REVIEWS ** WINNER \"BILL FISHER AWARD FOR BEST FIRST BOOK: FICTION\" ~ 2022 IBPA BENJAMIN FRANKLIN AWARDS **** WINNER \"BEST FIRST BOOK\" ~ 2021 INDIEREADER DISCOVERY AWARDS **If You’ve Ever Dreamed of Running Away to Paradise, Driftwood Will Spark Your Secret Wanderlust This captivating book follows modern-day nomads escaping the rat race in search of a fresh start. Fleeing boredom, bad marriages, and dead-end jobs, these adventurers wander south to Playa Paraiso—a lush, unspoiled village on Mexico’s idyllic Caribbean coast. There they find the unpredictable, hedonistic, and sometimes frightening world of the tropics.At the center of this extraordinary group is Poppa, the irreverent and savvy owner of the local beach bar. As he tries to make sense of his own vagabond existence, he offers his fellow expats booze, advice, and the occasional helping hand. It is Poppa who tells the tales of these intriguing runaways, as together they encounter true loves, vicious drug dealers, charming rogues, clueless do-gooders, and a devastating hurricane. Against a backdrop of stunning blue water and endless white sand, they experience the heart’s tug of war between the need for a place to call home and the desire for the freedom to roam.Author Anthony Lee Head is very familiar with the dream of living in paradise portrayed in Driftwood: Stories from the Margarita Road. After leaving a long career as a San Francisco trial lawyer, he moved to Playa del Carmen, Mexico where for ten years he ran a small hotel and margarita bar near the beach.Travelers, wanderers, explorers and dreamers alike will see themselves in these unforgettable characters, all the while craving an icy boat drink on a sprawling beach. But be careful: if you stick your feet in the sand and come along on this journey, you may not want to go home again.\"... Joseph Conrad collides with Jimmy Buffett in a journey through the dark heart of Mexico's Riviera Maya.\"~ Bob Calhoun, bestselling author and journalist\"Truly wonderful and moving tales; the author is a writer to watch.\"~ Kirkus Reviews (starred review)\"Beneath the 'palm and balmy breezes' tone, a deep, empathetic humanity affords each character and event vivid authenticity.\"~ Peter Coyote, bestselling author and actor",
  "genres": [
    "Fiction"
  ],
  "author": "Anthony Lee Head",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/55620469-driftwood"
}