{
  "title": "They'll Never Catch Us",
  "description": "A thriller about two sisters vying for the top spot on their cross-country team--the only way out of their stifling small town. But their dreams are suddenly thrown into peril when a new girl threatens to take away everything they've worked for... until she disappears.Stella and Ellie Steckler are only a year apart, but their different personalities make their relationship complicated. Stella is single-minded, driven, and keeps to herself. Cross-country running is her life, and she won't let anything get in the way of being the best. Her sister Ellie is a talented runner too, but she also lets herself have fun. She has friends. She goes to parties. She has a life off the course.The sisters do have one thing in common, though: the new girl, Mila Keene. Both Stecklers' lives are upended when Mila comes to town. Mila was the top runner on her team back home and at first, Ellie and Stella view her as a threat. But soon Ellie can't help but be drawn to her warm, charming personality. After her best friend moved away and her first boyfriend betrayed her, Ellie's been looking for a friend. In a moment of weakness, she even shares her darkest secret with Mila. For her part, Stella finds herself noticing the ways she and Mila are similar. Mila is smart and strong--she's someone Stella can finally connect with. As the two get closer, Stella becomes something she vowed she'd never be: distracted.With regionals approaching and college scouts taking notice, the pressure is on. Each girl has their future on the line and they won't let friendships get in their way. But then, suddenly, Mila goes out on a training run and never returns. No one knows what happened, but all eyes are on the Steckler sisters.",
  "genres": [
    "Mystery",
    "Young Adult",
    "Thriller",
    "Mystery Thriller",
    "Fiction",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Jessica  Goodman",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/55648616-they-ll-never-catch-us"
}