{
  "title": "The Flying Troutmans",
  "description": "\" Min was stranded in her bed, hooked on the blue torpedoes and convinced that a million silver cars were closing in on her (I didn't know what Thebes meant either), Logan was in trouble at school, something about the disturbing stories he was writing, Thebes was pretending to be Min on the phone with his principal, the house was crumbling around them, the black screen door had blown off in the wind, a family of aggressive mice was living behind the piano, the neighbours were pissed off because of hatchets being thrown into their yard at night (again, confusing, something to do with Logan) … basically, things were out of control. And Thebes is only eleven. \"–from The Flying TroutmansDays after being dumped by her boyfriend Marc in Paris – \"he was heading off to an ashram and said we could communicate telepathically\" – Hattie hears her sister Min has been checked into a psychiatric hospital, and finds herself flying back to Winnipeg to take care of Thebes and Logan, her niece and nephew. Not knowing what else to do, she loads the kids, a cooler, and a pile of CDs into their van and they set out on a road trip in search of the children's long-lost father, Cherkis.In part because no one has any good idea where Cherkis is, the traveling matters more than the destination. On their wayward, eventful journey down to North Dakota and beyond, the Troutmans stay at scary motels, meet helpful hippies, and try to ignore the threatening noises coming from under the hood of their van. Eleven-year-old Thebes spends her time making huge novelty cheques with arts and crafts supplies in the back, and won't wash, no matter how wild and matted her purple hair gets; she forgot to pack any clothes. Four years older, Logan carves phrases like \"Fear Yourself\" into the dashboard, and repeatedly disappears in the middle of the night to play basketball; he's in love, he says, with New York Times columnist Deborah Solomon. Meanwhile, Min can't be reached at the hospital, and, more than once, Hattie calls Marc in tears.But though it might seem like an escape from crisis into chaos, this journey is also desperately necessary, a chance for an accidental family to accept, understand or at least find their way through overwhelming times. From interwoven memories and scenes from the past, we learn much more about how Min got so sick, why Cherkis left home, why Hattie went to Paris, and what made Thebes and Logan who they are today.In this completely captivating book, Miriam Toews has created some of the most engaging characters in Canadian Hattie, Logan and Thebes are bewildered, hopeful, angry, and most of all, absolutely alive. Full of richly skewed, richly funny detail, The Flying Troutmans is a uniquely affecting novel.",
  "genres": [
    "Fiction",
    "Canada",
    "Contemporary",
    "Book Club",
    "Literary Fiction",
    "Family",
    "Adult Fiction"
  ],
  "author": "Miriam Toews",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/5563187-the-flying-troutmans"
}