{
  "title": "Upon a Once Time",
  "description": "Fairy tales and folk tales, originally passed down orally through generations, are a fundamental part of our shared world culture. They are a way to interpret - through magic and monsters, princesses and paupers, queens and quests - lessons on morality and society. They show a once upon a time world of simple archetypes in fantastical situations.This book gathers twenty-one authors who have brought new focus to fairy tales by combining two well known stories with a literary genre of their choice.Upon a Once Time contains the following tales re-imagined: The Arthurian Cycle, The Bad Wife, Beauty and the Beast, The Boy Who Drew Cats, The Brown Bear of Norway, Caliph Stork, Cinderella, Diamonds and Toads, The Girl Who Trod on a Loaf, The Goblin Spider, The Golem of Prague, Iron John, The Little Mermaid, Little Red Riding Hood, Math Fab Mathonwy, Momotaro, The Nightingale, Petrosinella, The Pied Piper of Hamelin, Pwyll Pendefig Dyfed, The Red Shoes, Rumpelstiltskin, Rusalka Tales, Schneewittchen, The Selkie Bride, Sleeping Beauty, The Swineherd, Taketori Monogatari, Thousandfurs, Tom Thumb, The Twelve Months, The Valiant Little Tailor, Vasilisa the Beautiful, Vasilisa the Wise, The Waters of Life, The Well of the World’s End, The Wild Swans, and The Woodcutter’s Daughter.List of stories:Six Rusalki - NA SulwayThe Waters At The End Of The Worlds - Mike MorganLittle Tom’s Reality - Rebecca E. TreasureDiamonds, Toads, And… Pumpkins? - Melissa MeadThe Rabbi’s Daughter And The Golem - Alex Langer Abigail Washington And The Angelic Organ Of Far Khitan - Joshua GageStrings That Ought To Be Pondered, Even In Urgent Times - M. Regan Lady Of The Slake - Suri ParmarRed Boots Blues - Cat RamboTaketori Momogatari - Evan Dicken Two Of Our Kind - Anna MartinoCurrants To The Sea - Taryn Haas Cloak Of Bearskin - Anna Madden Sunshine Noir For Synthetic Lovers - Lin DarrowThe Candlewood Trail - Dennis Mombauer Gell Who Makes - Kit Falbo Mutability - Maya Chhabra The Pilot - C.J. DotsonA Dark Path Through The Forest Of Stars - Jude Reid The Forest Magic Protects Its Own - Jamie Lackey Where The Earth Meets The Sea And The Sea Meets The Sky - Brent Baldwin",
  "genres": [
    "Fantasy",
    "Anthologies",
    "Short Stories",
    "Fiction",
    "Science Fiction"
  ],
  "author": "N.A. Sulway",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/55650165-upon-a-once-time"
}