{
  "title": "Christians Against Christianity: How Right-Wing Evangelicals Are Destroying Our Nation and Our Faith",
  "description": "A timely and galvanizing work that examines how right-wing evangelical Christians have veered from an admirable faith to a pernicious, destructive ideology.Today's right-wing Evangelical Christianity stands as the very antithesis of the message of Jesus Christ. In his new book, Christians Against Christianity, best-selling author and religious scholar Obery M. Hendricks Jr. challenges right-wing evangelicals on the terrain of their own religious claims, exposing the falsehoods, contradictions, and misuses of the Bible that are embedded in their rabid homophobia, their poorly veiled racism and demonizing of immigrants and Muslims, and their ungodly alliance with big business against the interests of American workers.He scathingly indicts the religious leaders who helped facilitate the rise of the notoriously unchristian Donald Trump, likening them to the \"court jesters\" and hypocritical priestly sycophants of bygone eras who unquestioningly supported their sovereigns' every act, no matter how hateful or destructive to those they were supposed to serve.In the wake of the deadly insurrectionist attack on the US Capitol, Christians Against Christianity is a clarion call to stand up to the hypocrisy of the evangelical Right, as well as a guide for Christians to return their faith to the life-affirming message that Jesus brought and died for. What Hendricks offers is a provocative diagnosis, an urgent warning that right-wing evangelicals' aspirations for Christian nationalist supremacy are a looming threat, not only to Christian decency but to democracy itself. What they offer to America is anything but good news.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Politics",
    "Christianity",
    "Christian",
    "History",
    "Faith"
  ],
  "author": "Obery M. Hendricks Jr.",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/55656168-christians-against-christianity"
}