{
  "title": "Build Your House Around My Body",
  "description": "A century of Vietnam's history and folklore comes to life in this \"brilliant, sweeping epic that swaps spirits and sheds time like snakeskin\" (Paul Tremblay, author of A Head Full of Ghosts and Survivor Song). Two young women go missing decades apart. Both are fearless, both are lost. And both will have their revenge. 1986 The teenage daughter of a wealthy Vietnamese family loses her way in an abandoned rubber plantation while fleeing her angry father and is forever changed. 2011 A young, unhappy Vietnamese American woman disappears from her new home in Saigon without a trace.The fates of these two women are inescapably linked, bound together by past generations, by ghosts and ancestors, by the history of possessed bodies and possessed lands. Alongside them, we meet a young boy who is sent to a boarding school for the métis children of French expatriates, just before Vietnam declares its independence from colonial rule; two Frenchmen who are trying to start a business with the Vietnam War on the horizon; and the employees of the Saigon Spirit Eradication Co., who find themselves investigating strange occurrences in a farmhouse on the edge of a forest. Each new character and timeline brings us one step closer to understanding what binds them all.Part puzzle, part revenge tale, part ghost story, this book takes us from colonial mansions to ramshackle zoos, from sweaty nightclubs to the jostling seats of motorbikes, from ex-pat flats to sizzling back-alley street carts. Spanning more than fifty years of Vietnamese history and barreling toward an unforgettable conclusion, this is a time-traveling, heart-pounding, border-crossing fever dream of a novel that will haunt you long after the last page.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Horror",
    "Fantasy",
    "Magical Realism",
    "Historical",
    "Mystery"
  ],
  "author": "Violet Kupersmith",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/55656269-build-your-house-around-my-body"
}