{
  "title": "Appleseed",
  "description": "In the vein of Neal Stephenson and Jeff VanderMeer, an epic speculative novel from Young Lions Fiction Award–finalist Matt Bell, a breakout book that explores climate change, manifest destiny, humanity's unchecked exploitation of natural resources, and the small but powerful magic contained within every single apple. In eighteenth-century Ohio, two brothers travel into the wooded frontier, planting apple orchards from which they plan to profit in the years to come. As they remake the wilderness in their own image, planning for a future of settlement and civilization, the long-held bonds and secrets between the two will be tested, fractured and broken—and possibly healed.Fifty years from now, in the second half of the twenty-first century, climate change has ravaged the Earth. Having invested early in genetic engineering and food science, one company now owns all the world’s resources. But a growing resistance is working to redistribute both land and power—and in a pivotal moment for the future of humanity, one of the company’s original founders will return to headquarters, intending to destroy what he helped build.A thousand years in the future, North America is covered by a massive sheet of ice. One lonely sentient being inhabits a tech station on top of the glacier—and in a daring and seemingly impossible quest, sets out to follow a homing beacon across the continent in the hopes of discovering the last remnant of civilization.Hugely ambitious in scope and theme, Appleseed is the breakout novel from a writer “as self-assured as he is audacious” (NPR) who “may well have invented the pulse-pounding novel of ideas” (Jess Walter). Part speculative epic, part tech thriller, part reinvented fairy tale, Appleseed is an unforgettable meditation on climate change; corporate, civic, and familial responsibility; manifest destiny; and the myths and legends that sustain us all.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Dystopia",
    "Historical Fiction",
    "Speculative Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Matt   Bell",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/55659625-appleseed"
}