{
  "title": "Call Me Indian: From the Trauma of Residential School to Becoming the NHL's First Treaty Indigenous Player",
  "description": "NATIONAL BESTSELLER Fred Sasakamoose played in the NHL before First Nations people had the right to vote in Canada. This page turner will have you cheering for 'Fast Freddy' as he faces off against huge challenges both on and off the ice--a great gift to every proud hockey fan, Canadian, and Indigenous person.--Wab Kinew, Leader of the Manitoba NDP and author of The Reason You WalkTrailblazer. Residential school Survivor. First Treaty Indigenous player in the NHL. All of these descriptions are true--but none of them tell the whole story.Fred Sasakamoose, torn from his home at the age of seven, endured the horrors of residential school for a decade before becoming one of 120 players in the most elite hockey league in the world. He has been heralded as the first Indigenous player with Treaty status in the NHL, making his official debut as a 1954 Chicago Black Hawks player on Hockey Night in Canada and teaching Foster Hewitt how to pronounce his name. Sasakamoose played against such legends as Gordie Howe, Jean Beliveau, and Maurice Richard. After twelve games, he returned home.When people tell Sasakamoose's story, this is usually where they end it. They say he left the NHL to return to the family and culture that the Canadian government had ripped away from him. That returning to his family and home was more important to him than an NHL career. But there was much more to his decision than that. Understanding Sasakamoose's choice means acknowledging the dislocation and treatment of generations of Indigenous peoples. It means considering how a man who spent his childhood as a ward of the government would hear those supposedly golden words: You are Black Hawks property.Sasakamoose's story was far from over once his NHL days concluded. He continued to play for another decade in leagues around Western Canada. He became a band councillor, served as Chief, and established athletic programs for kids. He paved a way for youth to find solace and meaning in sports for generations to come. Yet, threaded through these impressive accomplishments were periods of heartbreak and unimaginable tragedy--as well moments of passion and great joy.This isn't just a hockey story; Sasakamoose's groundbreaking memoir sheds piercing light on Canadian history and Indigenous politics, and follows this extraordinary man's journey to reclaim pride in an identity and a heritage that had previously been used against him.",
  "genres": [
    "Nonfiction",
    "Indigenous",
    "Sports",
    "Canada",
    "Memoir",
    "Hockey",
    "Biography"
  ],
  "author": "Fred Sasakamoose",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/55655496-call-me-indian"
}