{
  "title": "Soothing Nightmares",
  "description": "I didn’t fear my nightmares. I loved them... and they loved me.I had never been afraid of the dark. Abandoned on the front step of ISS, I’d spent my entire life thriving in the realm of darkness that most humans avoided.I was a woman living among monsters.Arabella was abandoned at the front steps of INSTITUTUM SEQUUNTUR SOMNIA (ISS) one stormy night, only to be found and brought in by the monsters that lived there. An institute of nightmares that housed the most dangerous creatures that walked the plane of humanity. A place that trained and harnessed those abilities for their own use, while defending against the humans that were constantly attacking them.But what happens when a young human woman grows up among the nightmares? Feeling no fear but instead taking comfort in her team that she surrounded herself by? By all regards, Arabella shouldn’t have fit in at the institute. Nothing like the warrior-like creatures around her, the 5’1’’ young woman with pink hair and a vision impairment was absolutely fundamental to her team. Not just for her strategic brilliance but her soothing lack of fear that seemed to tame the nightmares around her. Arabella is bound and determined to keep her monstrous men safe while they are on their missions.What happens when their most recent mission attracts the wrong type of attention? What happens when ISS comes under attack and everything that she values is destroyed?Join Arabella and her possessive nightmares as one human woman finds the monster within herself to protect those that she loves. The ISS series is promised to feature terrifying monsters that include everything from the literal monster under the bed to Lucifer’s overbearing son, the prince of Hell. If you love large harems, brilliant, sassy, but slightly naive female main characters with no fear, and a thrilling adventure filled with steam, vengeance, and a happily ever after, then you are absolutely going to love this.Warning: This medium/fast burn RH contains several dark themes from swearing, violence, and sexual themes suitable for +18.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Monsters",
    "Demons",
    "Paranormal Romance"
  ],
  "author": "M. Sinclair",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/55665622-soothing-nightmares"
}