{
  "title": "Kiwi",
  "description": "Tai Cooper holds many titles, but to the Kings of Retribution MC, he's known as Kiwi, Road Captain, and their brother.At eighteen, Kiwi left New Zealand- his sights set on The States. In search of a man, he has never met.His birth father.Kiwi discovered the man he shares blood with was part of the evil underbelly in Sin City, where he soon found himself trapped in a world where he was nothing more than a pawn.Determined to dig his way out of the corruption, Kiwi put his trust in the hands of a stranger-Riggs.It was that defining moment that led him to join the MC, leaving Las Vegas and never looking back.Years later, Kiwi faces another defining moment, one that involves Piper LeBlanc. When the Enforcer’s daughter comes home from a year at college, he no longer sees her as the young girl she was, but as the confident woman, she has become. Kiwi struggles to fight his feelings.He's older than her.She's his brother's daughter.Piper is off-limits.The pull between them is too intense to fight, and Kiwi finds himself willing to risk everything to claim her.As the daughter of The Kings of Retribution Enforcer, Piper LeBlanc is no stranger to the rough and rugged lifestyle and risks associated with it.Being raised by a single father, she never wanted for anything. Piper's life was perfect, until the day her mom rolls into town on the back of a Harley as another MC president's old lady, wanting back in her life.Piper becomes torn between hating the woman who abandoned her eighteen years ago, and longing for the mother she never had.After graduating from high school, Piper struggles with life choices. Taking a leap-of-faith, she sets her sights on Texas.She never thought she would consider leaving Louisiana and her family, but she's urgent for change, and to spread her wings.Rocking a bold new look, after nearly a year away at college, Piper returns home for the summer.She hasn't seen Kiwi in months.The way he looks at her makes her heart race. She should stay away from him, but her attraction toward Kiwi is stronger now than ever.Does she risk acting on her feelings? Piper grew up in the club. She was raised by loud, rugged, and fiercely protective bikers.So, it should come as no surprise that she falls in love with one.Overwhelmed with the push and pull between her and Kiwi as their relationship causes a rift between her dad and tensions to rise in the club, Piper jumps at the opportunity to put some distance between her and Louisiana the moment her best friend from college proposes a road trip.What is supposed to be a fun-filled week turns into a fight for her life.When Piper and her friend go missing, the Kings come together, seeking retribution, and vowing to destroy anyone who stands in their way.Kiwi will stop at nothing until Piper is home.He'll fight for the woman he loves or die trying.",
  "genres": [
    "Romance",
    "Suspense",
    "Contemporary",
    "Dark Romance",
    "Erotica",
    "Friends To Lovers",
    "Audiobook"
  ],
  "author": "Crystal  Daniels",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/55666539-kiwi"
}