{
  "title": "While Justice Sleeps",
  "description": "#1 NEW YORK TIMES BESTSELLER - A gripping, complexly plotted thriller set within the halls of the U.S. Supreme Court, where a young law clerk finds herself embroiled in a shocking mystery crafted by one of the most preeminent judges in America--from celebrated national leader and bestselling author Stacey Abrams.\n\"Abrams follows in Dan Brown's footprint with this masterfully plotted thriller that unfolds like the ultimate chess match--bold move to bolder move with lives hanging in the balance.\"--Lisa Gardner, author of Before She Disappeared \"A first-class legal thriller, favorably compared to many of the best, starting with The Pelican Brief,  which it brings to mind. It's fast-paced and full of surprises--a terrific read.\"--Scott Turow, author of Presumed InnocentAvery Keene, a brilliant young law clerk for the legendary Justice Howard Wynn, is doing her best to hold her life together--excelling in an arduous job with the court while also dealing with a troubled family. When the shocking news breaks that Justice Wynn--the cantankerous swing vote on many current high-profile cases--has slipped into a coma, Avery's life turns upside down. She is immediately notified that Justice Wynn has left instructions for her to serve as his legal guardian and power of attorney. Plunged into an explosive role she never anticipated, Avery finds that Justice Wynn had been secretly researching one of the most controversial cases before the court--a proposed merger between an American biotech company and an Indian genetics firm, which promises to unleash breathtaking results in the medical field. She also discovers that Wynn suspected a dangerously related conspiracy that infiltrates the highest power corridors of Washington.As political wrangling ensues in Washington to potentially replace the ailing judge whose life and survival Avery controls, she begins to unravel a carefully constructed, chesslike sequence of clues left behind by Wynn. She comes to see that Wynn had a much more personal stake in the controversial case and realizes his complex puzzle will lead her directly into harm's way in order to find the truth. While Justice Sleeps is a cunningly crafted, sophisticated novel, layered with myriad twists and a vibrant cast of characters. Drawing on her astute inside knowledge of the court and political landscape, Stacey Abrams shows herself to be not only a force for good in politics and voter fairness but also a major new talent in suspense fiction.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Audiobook",
    "Politics",
    "Book Club"
  ],
  "author": "Stacey Abrams",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/55671327-while-justice-sleeps"
}