{
  "title": "The Girl from Widow Hills",
  "description": "From the New York Times bestselling author of The Last House Guest—a Reese Witherspoon Book Club pick—comes a “hauntingly atmospheric and gorgeously written page-turner” (Kimberly McCreight, New York Times bestselling author of A Good Marriage) about a young woman plagued by night terrors after a childhood trauma who wakes one evening to find a corpse at her feet.Everyone knows the story of “the girl from Widow Hills.” Arden Maynor was just a child when she was swept away while sleepwalking during a terrifying rainstorm and went missing for days. Strangers and friends, neighbors and rescue workers, set up search parties and help vigils, praying for her safe return. Against all odds, she was found, alive, clinging to a storm drain. The girl from Widow Hills was a living miracle. Arden’s mother wrote a book. Fame followed. Fans and fan letters, creeps, and stalkers. And every year, the anniversary. It all became too much. As soon as she was old enough, Arden changed her name and disappeared from the public eye. Now a young woman living hundreds of miles away, Arden goes by Olivia. She’s managed to stay off the radar for the last few years. But with the twentieth anniversary of her rescue approaching, the media will inevitably renew its interest in Arden. Where is she now? Soon Olivia feels like she’s being watched and begins sleepwalking again, like she did long ago, even waking up outside her home. Until late one night, she jolts awake in her yard. At her feet is the corpse of a man she knows—from her previous life, as Arden Maynor. The girl from Widow Hills is once again at the center of this story in this “compulsive page-turner” (Booklist).",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Audiobook",
    "Suspense",
    "Adult"
  ],
  "author": "Megan Miranda",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/55710562-the-girl-from-widow-hills"
}