{
  "title": "The Sacred Band: Three Hundred Theban Lovers Fighting to Save Greek Freedom",
  "description": "From classicist James Romm comes a “striking…fascinating” ( Booklist ) deep dive into the last decades of ancient Greek freedom leading up to Alexander the Great’s destruction of Thebes—and the saga of the greatest military corps of the time, the Theban Sacred Band, a unit composed of 150 pairs of male lovers.The story of the Sacred Band, an elite 300-man corps recruited from pairs of lovers, highlights a chaotic era of ancient Greek history, four decades marked by battles, ideological disputes, and the rise of vicious strongmen. At stake was freedom, democracy, and the fate of Thebes, at this time the leading power of the Greek world.The tale begins in 379 BC, with a group of Theban patriots sneaking into occupied Thebes. Disguised in women’s clothing, they cut down the agents of Sparta, the state that had cowed much of Greece with its military might. To counter the Spartans, this group of patriots would form the Sacred Band, a corps whose history plays out against a backdrop of Theban democracy, of desperate power struggles between leading city-states, and the new prominence of eros , sexual love, in Greek public life.After four decades without a defeat, the Sacred Band was annihilated by the forces of Philip II of Macedon and his son Alexander in the Battle of Chaeronea—extinguishing Greek liberty for two thousand years. Buried on the battlefield where they fell, they were rediscovered in 1880—some skeletons still in pairs, with arms linked together.From violent combat in city streets to massive clashes on open ground, from ruthless tyrants to bold women who held their era in thrall, The Sacred Band recounts “in fluent, accessible prose” ( The Wall Street Journal ) the twists and turns of a crucial historical the end of the treasured freedom of ancient Greece.",
  "genres": [
    "History",
    "Nonfiction",
    "Ancient History",
    "Queer",
    "LGBT",
    "Greece",
    "War"
  ],
  "author": "James Romm",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/55710587-the-sacred-band"
}