{
  "title": "The Forgotten Kingdom",
  "description": "From the author of \nThe Lost Queen\n, hailed as “\nOutlander\n meets \nCamelot\n” (Kirsty Logan, the author of The Gloaming) and “\nThe Mists of Avalon\n for a new generation” (Linnea Hartsuyker, the author of The Golden Wolf), a “rich, immersive” (\nKirkus Reviews\n) new novel in which a forgotten queen of 6th-century Scotland claims her throne as war looms and her family is scattered to the winds.AD 573. Imprisoned in her chamber, Languoreth awaits news in torment. Her husband and son have ridden off to war against her brother, Lailoken. She doesn’t yet know that her young daughter, Angharad, who was training with Lailoken to become a Wisdom Keeper, has been lost in the chaos. As one of the bloodiest battles of early medieval Scottish history abandons its survivors to the wilds of Scotland, Lailoken and his men must flee to exile in the mountains of the Lowlands, while nine-year-old Angharad must summon all Lailoken has taught her to follow her own destiny through the mysterious, mystical land of the Picts. In the aftermath of the battle, old political alliances unravel, opening the way for the ambitious adherents of the new religion: Christianity. Lailoken is half-mad with battle sickness, and Languoreth must hide her allegiance to the Old Way to survive her marriage to the next Christian king of Strathclyde. Worst yet, the new King of the Angles is bent on expanding his kingdom at any cost. Now the exiled Lailoken, with the help of a young warrior named Artur, may be the only man who can bring the warring groups together to defeat the encroaching Angles. But to do so, he must claim the role that will forever transform him. He must become the man known to history as “Myrddin.” “Intrigue, rivalry, and magic among the mists of old Britain—The Forgotten Kingdom is an enchantment of a read” (Kate Quinn, New York Times bestselling author of The Alice Network).",
  "genres": [
    "Historical Fiction",
    "Fantasy",
    "Fiction",
    "Historical",
    "Audiobook",
    "Scotland",
    "Historical Fantasy"
  ],
  "author": "Signe Pike",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/55710581-the-forgotten-kingdom"
}