{
  "title": "What College Didn't Teach You About Getting Hired: The Ultimate Guide to Finding the Right Job Fresh Out of College",
  "description": "Have you been looking for a job unsuccessfully and have gotten to a point where you are desperate for a job, because you don't know what it is you've been doing wrong? And are you looking for a guide that will help you spot where you've been making mistakes as well as how to fix such problems, for good, so that you finally get the job you so much prepared for while in college? If you've answered YES, keep reading... You Are About To Discover Exactly How To Secure A Job That Pays Well And One You Are Proud Of Right After Graduation! The fact that you are reading this is enough proof that you don't need a lecture about how difficult getting a job is after college. You must have felt it- the pain, humiliation, frustration and sadness. It's infuriating to imagine that all your hopes and expectations that accumulated over the years of difficult schooling had to end in the misery of joblessness. But it's a sad truth that most graduates have to live with. Have you ever sat down and wondered... * Why are employers demanding \"three years\" experience? * Do I have to accept a paycheck just a couple of dollars above the minimum wage? * Why is it so darn difficult to convince an employer to give you a chance to showcase your skills? * What do I need to do to get a job? If you have, then you are in luck because you came to the right place. The reasons for not getting employed after college are too many to mention and while in some cases, college graduates fail to land a job because of situations that are beyond their control, there's a great many of them who actually fail to get a job because of failing to do a number of things right, or failing to acknowledge a number of truths. But lucky for you, this powerful book is here to give you detailed answers to all the questions you have been asking yourself, including what it is that college graduates do wrong, what they erroneously perceive and what they need to do to overcome the main challenges they face in finding a job. More precisely, you'll discover: ◆ An overview of life and expectations after college ◆ The three main problems graduates face, and what you need to do to get around them ◆ How to set your career goals to see success ◆ How to find the right job along with tips to do so successfully ◆ How to put it all together and secure your dream career with surefire strategies ...And much more! As it turns out, finding a job after graduation is not as complicated as it always seems. By following the expert tips and tricks offered to you through this book, and understanding the important truths and the steps to success that are often ignored or misstated, you'll realize that there are ways to secure a job without unnecessary struggling or luck. Even if you feel as if the odds are not in your favor because you've unsuccessfully tried to secure a job in the past, this book will help turn things around!",
  "genres": [],
  "author": "Hunter Hazelton",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/55688670-what-college-didn-t-teach-you-about-getting-hired"
}