{
  "title": "Focus on Friendship: How to Find the Tribe That Lifts You up and Helps You Thrive in Life",
  "description": "Have you been looking to establish new friendships and cement old ones? And are you tired of losing touch with your friends as you find new ones and wish to be guided on how exactly to find a balance between making new friendships and maintaining old ones? If you've answered YES, keep reading... You Are About To Discover The Blueprint On How To Make New Friends And Maintain Old Friendships Like A Pro! Friendships can be challenging, confusing, stressful and sometimes, you might even wonder why you bother. But according to studies, friendships are no less important to your wellbeing than exercising, meditating or eating properly. We know that from our school years, friends have not only been helping us cope with challenges, but also teaching us to be patient, considerate, responsible, and happy. In many instances, they've also been helping us create great moments and find meaning in life. Unfortunately, establishing healthy friendships is not easy, given the divergence in our personalities, behavior, life patterns and other factors. At a more basic level, being a good friend, one that's selfless, present and helpful, and finding a trusted friend with such qualities is one of the most challenging things for many people, and maintaining friendships over long periods of time is even worse. As a normal person having normal difficulties with friendships therefore, you must often wonder: * What does it take to be a good friend? * What kind of friend do I need? * Is it possible to make new friends and maintain the old ones? * How do I deal with conflicts that keep breaking my friendships? * How do I select good friends? If that's you, then this is the book you've been looking for. It comes with answers to these and many more similar questions to offer you a complete understanding of the concept of friendship and what you need to do to foster healthy, lasting friendships in your life. More precisely, this book will teach you: ◆ How to take care of yourself first before helping others to be truly effective ◆ Why it's important to be selfless ◆ How to be an effective friend without burning out, by following a few simple tips ◆ What friendship really is and its different categories ◆ How to discern a good friend and know when someone isn't being a good friend to you ◆ How to clear fears and doubts about friendships and relationships ◆ How to keep in touch with friends healthily and show you care ◆ How to make someone you care about feel listened to ◆ How to deal with conflicts ◆ How to choose the right friends while keeping the old ones ...And much more! The basic components of any relationship- be it our marriages or even platonic work-based relationships are founded on friendship, so learning how to create healthy friendships is the key to seeing more success in more critical areas of our lives like our careers and romantic relationships. It is also critical to our mental health and as studies have it, the best way to stay young and emotionally stable. Let this simple beginners' guide show you how to be successful at making and maintaining healthy friendship without a hassle.",
  "genres": [],
  "author": "Hunter Hazelton",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/55688579-focus-on-friendship"
}