{
  "title": "Cuba: An American History",
  "description": "Winner of The L. A. Times Book Prize (2021) in History ​“Full of…lively insights and lucid prose” (The Wall Street Journal) an epic, sweeping history of Cuba and its complex ties to the United States—from before the arrival of Columbus to the present day—written by one of the world’s leading historians of Cuba.In 1961, at the height of the Cold War, the United States severed diplomatic relations with Cuba, where a momentous revolution had taken power three years earlier. For more than half a century, the stand-off continued—through the tenure of ten American presidents and the fifty-year rule of Fidel Castro. His death in 2016, and the retirement of his brother and successor Raúl Castro in 2021, have spurred questions about the country’s future. Meanwhile, politics in Washington—Barack Obama’s opening to the island, Donald Trump’s reversal of that policy, and the election of Joe Biden—have made the relationship between the two nations a subject of debate once more. Now, award-winning historian Ada Ferrer delivers an “important” (The Guardian) and moving chronicle that demands a new reckoning with both the island’s past and its relationship with the United States. Spanning more than five centuries, Cuba: An American History provides us with a front-row seat as we witness the evolution of the modern nation, with its dramatic record of conquest and colonization, of slavery and freedom, of independence and revolutions made and unmade. Along the way, Ferrer explores the sometimes surprising, often troubled intimacy between the two countries, documenting not only the influence of the United States on Cuba but also the many ways the island has been a recurring presence in US affairs. This is a story that will give Americans unexpected insights into the history of their own nation and, in so doing, help them imagine a new relationship with Cuba; “readers will close [this] fascinating book with a sense of hope” (The Economist). Filled with rousing stories and characters, and drawing on more than thirty years of research in Cuba, Spain, and the United States—as well as the author’s own extensive travel to the island over the same period—this is a stunning and monumental account like no other.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Audiobook",
    "Historical",
    "World History"
  ],
  "author": "Ada Ferrer",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/55710558-cuba"
}