{
  "title": "Lord of London Town",
  "description": "Cheska Harlow-Wright was born into a life of luxury and privilege. She has never wanted for anything. A comfortable future as a married London socialite awaits her. But since the age of thirteen, Cheska has harboured a secret—an unshakeable fixation on a boy who could never offer her anything close to comfort. A boy steeped in sin and draped in depravity. A boy born into the possessive embrace of darkness. When Cheska’s seemingly perfect world is ripped apart by an unknown but deadly enemy, there’s only one person she can run to. One person in the world who has the power to keep her safe. The one person her weak and shattered heart craves. Arthur Adley. The new head of the most feared crime family in London. Forced too young to take the helm of the Adley firm, Arthur has become even more ruthless, formidable, and cold than ever before. His enemies are circling, and he must fight—and kill—to maintain his family’s place at the top of the London crime underworld. There is no room for weakness, emotion, or loss of control.But then Cheska smashes back into his life with the force of a wrecking ball. She has no place in this dark, vicious, and bloodthirsty world. And worse, she is the solitary chink in his impenetrable armour. He’s already pushed her away once, but this time she desperately needs him. She’s broken, lost, and in danger, and he is the only one who can help.Arthur must protect her. He must destroy those who dare to threaten her, hunt down those who would take what is his. He would raze all of London to the ground to keep her safe… but can he also protect himself?The infamous Dark Lord of London Town faces his most brutal battle yet—the crippling weight of the past, the unrelenting enemies lurking in the shadows… and the havoc that Cheska’s presence is wreaking on the granite fortress that was once his heart.",
  "genres": [
    "Dark Romance",
    "Romance",
    "Dark",
    "Mafia Romance",
    "Contemporary",
    "Contemporary Romance",
    "New Adult"
  ],
  "author": "Tillie Cole",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/55705820-lord-of-london-town"
}