{
  "title": "¡Hola Papi!: How to Come Out in a Walmart Parking Lot and Other Life Lessons",
  "description": "From popular LGBTQ advice columnist and writer John Paul Brammer comes a hilarious, heartwarming memoir-in-essays chronicling his journey growing up as a queer, mixed-race kid in America’s heartland to becoming the “Chicano Carrie Bradshaw” of his generation.The first time someone called John Paul (JP) Brammer “Papi” was on the popular gay hookup app Grindr. At first, it was flattering; JP took this as white-guy speak for “hey, handsome.” Who doesn’t want to be called handsome? But then it happened again and again…and again, leaving JP wondering: Who the hell is Papi?What started as a racialized moniker given to him on a hookup app soon became the inspiration for his now wildly popular advice column “¡Hola Papi!,” launching his career as the Cheryl Strayed for young queer people everywhere—and some straight people too. JP had his doubts at first—what advice could he really offer while he himself stumbled through his early 20s? Sometimes the best advice to dole outcomes from looking within, which is what JP has done in his column and book—and readers have flocked to him for honest, heartfelt wisdom, and of course, a few laughs.In ¡Hola Papi!, JP shares his story of growing up biracial and in the closet in America’s heartland, while attempting to answer some of life’s toughest questions: How do I let go of the past? How do I become the person I want to be? Is there such a thing as being too gay? Should I hook up with my grade school bully now that he’s out of the closet? Questions we’ve all asked ourselves, surely.¡Hola Papi! is for anyone—gay, straight, and everything in between—who has ever taken stock of their unique place in the world.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "LGBT",
    "Queer",
    "Essays",
    "Audiobook",
    "Humor"
  ],
  "author": "John Paul Brammer",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/55711622-hola-papi"
}