{
  "title": "DSM: A History of Psychiatry's Bible",
  "description": "The first comprehensive history of \"psychiatry's bible\"―the Diagnostic and Statistical Manual of Mental Disorders . Over the past seventy years, the Diagnostic and Statistical Manual of Mental Disorders , or DSM , has evolved from a virtually unknown and little-used pamphlet to an imposing and comprehensive compendium of mental disorder. Its nearly 300 conditions have become the touchstones for the diagnoses that patients receive, students are taught, researchers study, insurers reimburse, and drug companies promote. Although the manual is portrayed as an authoritative corpus of psychiatric knowledge, it is a product of intense political conflicts, dissension, and factionalism. The manual results from struggles among psychiatric researchers and clinicians, different mental health professions, and a variety of patient, familial, feminist, gay, and veterans' interest groups. The DSM is fundamentally a social document that both reflects and shapes the professional, economic, and cultural forces associated with its use. In DSM , Allan V. Horwitz examines how the manual, known colloquially as \"psychiatry's bible,\" has been at the center of thinking about mental health in the United States since its original publication in 1952. The first book to examine its entire history, this volume draws on both archival sources and the literature on modern psychiatry to show how the history of the DSM is more a story of the growing social importance of psychiatric diagnoses than of increasing knowledge about the nature of mental disorder. Despite attempts to replace it, Horwitz argues that the DSM persists because its diagnostic entities are closely intertwined with too many interests that benefit from them. This comprehensive treatment should appeal to not only specialists but also anyone who is interested in how diagnoses of mental illness have evolved over the past seven decades―from unwanted and often imposed labels to resources that lead to valued mental health treatments and social services.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "History",
    "Psychiatry",
    "Audiobook",
    "Education",
    "Medicine"
  ],
  "author": "Allan V. Horwitz",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/55721179-dsm"
}