{
  "title": "Out of the Pocket : Football, Fatherhood, and College GameDay Saturdays",
  "description": "A powerfully intimate, plain-spoken memoir about fathers and sons, fortitude, and football from the face and voice of college football—Kirk Herbstreit.Kirk Herbstreit is a reflection of the sport he loves, a reflection of his football-crazed home state of Ohio, where he was a high school star and Ohio State captain, and a reflection of another Ohio State football captain thirty-two years earlier: his dad Jim, who battled Alzheimer’s disease until his death in 2016.In Out of the Pocket, Herbstreit will do what his father did for him: take you inside the locker rooms, to the practice fields, to the meeting rooms, to the stadiums. Herbstreit will describe how a combination of hard work, perseverance, and a little luck landed him on the set of ESPN’s iconic College GameDay show, surrounded by tens of thousands of fans who treat their Saturdays like a football Mardi Gras.He’ll take you into the television production meetings, on to the GameDay set, and into the broadcast booth. You’ll live his life during a football season, see the things he sees, experience every chaotic twist and turn as the year unfolds. Not to mention the relationships he’s established and the insights he’s learned from the likes of coaches and players such as Nick Saban, Tim Tebow, Dabo Swinney, and Peyton Manning, as well as his colleagues, including Chris Fowler, Rece Davis, and his “second dad,” the beloved Coach Lee Corso.Yes, Kirk Herbstreit is the undeniable face and voice of college football—but he’s also a survivor. He’s the quiet kid who withstood the collapse of his parents’ marriage. The boy who endured too many overbearing stepdads and stepmoms. The painfully shy student who always chose the last desk in the last row of the classroom. The young man who persevered through a frustrating Ohio State playing career. The new college graduate who turned down a lucrative sales job after college to pursue a “no way you’ll make it” dream career in broadcasting.An inspiring, gripping, and eye-opening memoir, Out of the Pocket is the ultimate read for anyone who loves football and with a dream worth pursuing.",
  "genres": [
    "Sports",
    "Biography",
    "Nonfiction",
    "Football",
    "Audiobook",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Kirk Herbstreit",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/55711724-out-of-the-pocket"
}