{
  "title": "The Man Who Invented Motion Pictures: A True Tale of Obsession, Murder, and the Movies",
  "description": "One of the New York Times Best True Crime of 2022A “spellbinding, thriller-like” ( Shelf Awareness ) history about the invention of the motion picture and the mysterious, forgotten man behind it—detailing his life, work, disappearance, and legacy.The year is 1888, and Louis Le Prince is finally testing his “taker” or “receiver” device for his family on the front lawn. The device is meant to capture ten to twelve images per second on film, creating a reproduction of reality that can be replayed as many times as desired. In an otherwise separate and detached world, occurrences from one end of the globe could now be viewable with only a few days delay on the other side of the world. No human experience—from the most mundane to the most momentous—would need to be lost to history.In 1890, Le Prince was granted patents in four countries ahead of other inventors who were rushing to accomplish the same task. But just weeks before unveiling his invention to the world, he mysteriously disappeared and was never seen or heard from again. Three and half years later, Thomas Edison, Le Prince’s rival, made the device public, claiming to have invented it himself. And the man who had dedicated his life to preserving memories was himself lost to history—until now.The Man Who Invented Motion Pictures pulls back the curtain and presents a “passionate, detailed defense of Louis Le Prince…unfurled with all the cliffhangers and red herrings of a scripted melodrama” ( The New York Times Book Review ). This “fascinating, informative, skillfully articulated narrative” ( Kirkus Reviews , starred review) presents the never-before-told history of the motion picture and sheds light on the unsolved mystery of Le Prince’s disappearance.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Biography",
    "Film",
    "Crime",
    "Historical"
  ],
  "author": "Paul   Fischer",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/55711551-the-man-who-invented-motion-pictures"
}