{
  "title": "Do Better: Spiritual Activism for Fighting and Healing from White Supremacy",
  "description": "“Do Better is a clear, powerful, direct, wise, and extremely helpful treatise on how to combat and heal from the ubiquitous violence of white supremacy. Using a voice that is both passionate and compassionate, Rachel Ricketts instructs where necessary and soothes when needed—but never flinches from the urgency of the mission at hand. These pages are meant not merely to be read, but to be studied, workshopped, and put into daily practice. I would recommend Do Better to anybody who wishes to live a life of higher consciousness and humanity. But to white readers in particular, I say: Pull up a chair, grab a pen, lay down your defenses, and listen very respectfully to Rachel Ricketts. She has offered up an exceedingly valuable resource to a tired, troubled (and all too often delusional) world. This is a book we all need.”Elizabeth Gilbert, New York Times  bestselling author of Eat Pray LoveThought leader, racial justice educator, and sought-after spiritual activist Rachel Ricketts offers mindful and practical steps for all humans to dismantle white supremacy on a personal and collective level.Heart-centered and spirit-based practices are the missing but vital piece to achieving racial justice.Do Better is a revolutionary offering that addresses anti-racism from a comprehensive, intersectional, and spiritually-aligned perspective. This actionable guidebook illustrates how to engage in the heart-centered and mindfulness-based practices that racial justice educator and healer Rachel Ricketts has developed to fight white supremacy from the inside out, in our personal lives and communities alike. It is a loving and assertive call to do the deep - and often uncomfortable - inner work that precipitates much-needed external and global change.Radical racial justice includes daily, intentional and informed action. It demands addressing the emotional violence we have perpetuated on ourselves and others (most notably toward Black women and femmes), both as individuals and as a society. Do Better provides the missing pieces to manifest practicable, sustainable solutions such as identifying where we most get stuck, mitigating the harm we inflict on others and mending our hearts from our most painful race and gender-based experiences, plus much more.This inspirational and eye-opening handbook is filled with carefully curated soulcare activities for getting into our bodies and better withstanding the grief, rage and conflicting emotions that naturally arise when we fight against injustice. Culturally informed, secular spiritual exercises, such as guided meditations, transformative breathwork and journaling prompt unpack our privilege, and take up the ongoing fight against oppression, while transforming our own lives along the way.",
  "genres": [
    "Nonfiction",
    "Anti Racist",
    "Social Justice",
    "Race",
    "Spirituality",
    "Activism",
    "Self Help"
  ],
  "author": "Rachel Ricketts",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/55713010-do-better"
}