{
  "title": "Tee-Dog and The Magic Globe: China",
  "description": "ONE YOUNG BOY, JOEY, AND HIS MAGICAL PET DOG, TEE... One Nighttime Magical And Exciting Adventure To Learn About China! \"Get ready says Tee, grab your coat, wash your face, We're taking a trip to a wonderful place. We're going to China it's far, not near, We'll cross a great ocean to get there from here- the Pacific Ocean that's deep and wide, China we'll find on the very far side. If we went there by plane it would take a whole day, Pick me up and we'll go there a much faster way!\" Thus begins Joey and Tee's overnight adventure in China during which Joey learns about China's geography, size of the population, the capital city of Beijing, famous sites including Tiananmen Square, The Forbidden City, The Great Wall; how to speak and write Chinese, and China's heritage of invention. Written in rhythm and rhyme with rich accompanying illustrations, Tee Dog and the Magic China is a fun and memorable introduction for early readers to China - one of the oldest, largest, and most influential countries in the world! EARLY PRAISE FOR TEE-DOG AND THE MAGIC CHINA \"What a fun and mesmerizing introduction Saul Gitlin has penned for young children to learn about China! While Western adults need to learn more about China's culture and history as the Middle Kingdom gains more influence on the global community, Tee-Dog and the Magic China is the perfect book to launch children on their own journeys to understanding the country that will impact the whole world in a myriad of ways from culture to trade in the coming century. I highly recommend this book!\" Shaun Rein Founder & CEO, China Market Research Group. Bestselling author of The End of Cheap China, The End of Copycat China, and The War for China's Wallet. China commentator on CNN, CNBC, BBC, Bloomberg, National Public Radio, and other global media outlets and a corporate keynote speaker working with organizations worldwide. “Tee-Dog and The Magic China is a magical and entertaining first introduction to China for English-speaking children, with a practical side. Young readers are introduced to a broad range of information about the country’s culture & geography and offered a first lesson in Mandarin. We learn that it’s not that difficult to learn to speak Chinese, and with China’s heritage of invention bringing us things like paper and umbrellas, maybe the country has never really been that far away.” Mark Rowswell (a.k.a. “Dashan” 大山) National Media & Entertainment Celebrity in China; Canada - China Goodwill Ambassador “Tee-Dog and The Magic China takes children on a whirlwind visit to China to introduce the richness of its language and culture in one magical evening. Narrated in rhyme, and with child-friendly language and brilliant illustrations, this book will capture the imagination of young readers as well as the grown-ups who read with them.” Professor Claudia Ross Chair, Department of Modern Languages & Chinese Program Coordinator – College of the Holy Cross; Past President of the Chinese Language Teachers Association (CLTA) USA “Tee-Dog and The Magic China is an exciting and educational adventure that will entertain all young readers while allowing children in families of Chinese origin to connect with their own heritage. With its memorable rhythm and rhyme, the story is an excellent, age-appropriate introduction to international culture.” Lisa Skriloff Founder & President - Multicultural Marketing Resources, Inc. (MMR)",
  "genres": [],
  "author": "Saul Gitlin",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/55717655-tee-dog-and-the-magic-globe"
}