{
  "title": "The Lost Boys of Montauk: The True Story of the Wind Blown, Four Men Who Vanished at Sea, and the Survivors They Left Behind",
  "description": "An immersive account of a tragedy at sea whose repercussions haunt its survivors to this day, lauded by New York Times bestselling author Ron Suskind as “an honest and touching book, and a hell of a story.”In March of 1984, the commercial fishing boat Wind Blown left Montauk Harbor on what should have been a routine offshore voyage. Its captain, a married father of three young boys, was the boat’s owner and leader of the four-man crew, which included two locals and the blue-blooded son of a well-to-do summer family. After a week at sea, the weather suddenly turned, and the foursome collided with a nor’easter. They soon found themselves in the fight of their lives. Tragically, it was a fight they lost. Neither the boat nor the bodies of the men were ever recovered.The fate of the Wind Blown —the second-worst nautical disaster suffered by a Montauk-based fishing vessel in over a hundred years—has become interwoven with the local folklore of the East End’s year-round population. Back then, on the easternmost tip of Long Island, before Wall Street and hedge fund money stormed into town, commercial fishing was the area’s economic lifeblood.Amanda M. Fairbanks examines the profound shift of Montauk from a working-class village—“a drinking town with a fishing problem”—to a playground for the ultra-wealthy, seeking out the reasons that an event more than three decades old remains so startlingly vivid in people’s minds. She explores the ways in which deep, lasting grief can alter people’s memories. And she shines a light on the powerful and sometimes painful dynamics between fathers and sons, as well as the secrets that can haunt families from beyond the grave.The story itself is a universal tale of family and brotherhood; it’s about what happens when the dreams and ambitions of affluent and working-class families collide. Captivating and powerful, The Lost Boys of Montauk explores one of the most important questions we face as how do memories of the dead inform the lives of those left behind?",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Adventure",
    "Audiobook",
    "New York",
    "Book Club"
  ],
  "author": "Amanda M. Fairbanks",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/55711528-the-lost-boys-of-montauk"
}