{
  "title": "The Director: My Years Assisting J. Edgar Hoover",
  "description": "The first book ever written about FBI Director J. Edgar Hoover by a member of his personal staff—his former assistant, Paul Letersky—offers unprecedented, “clear-eyed and compelling” (Mark Olshaker, coauthor of Mindhunter ) insight into an American legend.The 1960s and 1970s were arguably among America’s most turbulent post-Civil War decades. While the Vietnam War continued seemingly without end, protests and riots ravaged most cities, the Kennedys and MLK were assassinated, and corruption found its way to the highest levels of politics, culminating in Watergate.In 1965, at the beginning of the chaos, twenty-two-year-old Paul Letersky was assigned to assist the legendary FBI director J. Edgar Hoover who’d just turned seventy and had, by then, led the Bureau for an incredible forty-one years. Hoover was a rare and complex man who walked confidently among the most powerful. His personal privacy was more tightly guarded than the secret “files” he carefully collected—and that were so feared by politicians and celebrities. Through Letersky’s close working relationship with Hoover, and the trust and confidence he gained from Hoover’s most loyal senior assistant, Helen Gandy, Paul became one of the few able to enter the Director’s secretive—and sometimes perilous—world.Since Hoover’s death half a century ago, millions of words have been written about the man and hundreds of hours of TV dramas and A-list Hollywood films produced. But until now, there has been virtually no account from someone who, for a period of years, spent hours with the Director on a daily basis.Balanced, honest, and keenly observed, this “ vivid, foibles-and-all portrait of the fabled scourge of gangsters, Klansmen, and communists” ( The Wall Street Journal ) sheds new light on one of the most powerful law enforcement figures in American history.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "American History",
    "Memoir",
    "Crime"
  ],
  "author": "Paul Letersky",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/55711697-the-director"
}