{
  "title": "From Jerusalem to Beverly Hills: Memoir of a Palestinian Jew",
  "description": "This is a riveting story of the authors journey for survival as a war refugee and overcoming poverty. The story begins in Jerusalem as the British Empire crumbles and World War II ends. The ensuing turmoil in Palestine lead to Israels War of Independence and the Arab siege of Jerusalem that shaped Eitans childhood and the journey he travelled as a construction laborer, shepherd in a kibbutz, Top Gun fighter pilot in Israel Air Force, engineer for the Space Shuttle and a businessman in Beverly Hills. On his quest for independence and justice he endured family displacement, hunger, personal loss, and a government corruption scandal that nearly unraveled all he had worked to create. This compelling story, however, is ultimately one of triumph.Jerusalem, at once provincial and cosmopolitan, where lives of Christians, Jews and Arabs intermingle, is the colorful ground for a true story of a boy growing up during the tumultuous waning years of the British rule. The author describes scenes from the Arab-Israeli war, from a rare vantage point of a little boy, turned refugee in the ravaged city.As a teenager, he becomes a member of a socialist youth movement and joins his friends to establish a kibbutz. Toiling as a shepherd in the hills of Judea, and disappointed by the communal system, he leaves to join the Israel Air Force and becomes a fighter pilot. At the age of 22, he takes Dina, his wife, to Africa to create the newly independent Ghana Air Force.Fulfilling his lifelong dream, the author goes to America, but tragedy drives his young family back to Israel for eleven years. Following the Yom Kippur War, his keen sense of justice compels him to expose government corruption that inevitably teaches him that no good deed goes unpunished, but at the end of the day makes him victorious.A memorable scene aboard an El Al flight provides an emotional end.Visit jerusalemtobeverlyhills.com",
  "genres": [],
  "author": "Eitan Gonen",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/10282707-from-jerusalem-to-beverly-hills"
}