{
  "title": "Dementia Caregiver: With You. For You. About You.: Inspirational Messages of Support for Dementia Family Caregivers Everywhere",
  "description": "“A real Gem of a book. Love it.” Lisa Cooper (Professional Editor)Are you a caregiver for a family member with a diagnosis of dementia?Are you looking for inspiration from other dementia caregivers who help and support a family member with dementia to live well?When someone you care about is diagnosed with Alzheimer’s Disease or another form of dementia, the future can seem daunting.  Stress can take over and expand into your personal life, relationships, work, and family life.Caring for someone with dementia can, at times, takes its toll, it can be too easy to focus on what has been lost to dementia, not what remains. Dementia affects not just memory but also thinking and many people with dementia and autonomy.social roles and relationships.the ability to carry out favourite activities or hobbies.everyday skills of daily life.Living with dementia can have a big emotional, social, psychological and practical impact on a person. Many people with dementia describe these impacts as a series of losses and adjusting to them can be challenging.But what about the dementia caregiver?For You, With you, About You, Inspirational messages of support for family dementia caregivers everywhere.Written by an experienced dementia carer living at home and caring for a family member with dementia for a decade.  In addition to being a highly experienced dementia caregiver, the author also has an MSc in Dementia Studies.The book shares inspirational images/messages for all dementia family caregivers. From one dementia caregiver to another, sharing what has been relevant for me on my journey with you to help you keep positive as you give support.This wonderful, inspiring book contains 65 images with inspirational messages and motivational support about caring for someone at home with dementia.This book offers inspiration, motivation, reflection, recognition and connection – from one dementia caregiver to another.It provides inspiration on living successfully at home with dementia through - each image and message providing inspiration.It offers a message to dementia caregivers globally to become inspired and empowered in their role as a dementia caregiver.It provides a positive message on dementia, a topic that is traditionally thought of in a negative way.Family dementia caregivers will find this an essential, inspiring read.",
  "genres": [
    "Medical"
  ],
  "author": "Catherine Verner",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/55749159-dementia-caregiver"
}