{
  "title": "The Invisible Husband of Frick Island",
  "description": "“This is the hopeful book we all need right now. I loved it!”—Emily Giffin, #1 New York Times bestselling author of The Lies That BindAs Seen on the TODAY SHOW A Southern Living Best Beach Read * A PopSugar Best Book of May * An Us Weekly Summer Beach Staple * A Frolic Under-the-Radar Book of May * An OK Magazine Best Summer Beach Read * An EW Best Book of Spring * A Country Living Can't Miss Beach Read * A LibraryReads Pick for May * An Emily Giffin Book Club pickSometimes all you need is one person to really see you.Piper Parrish's life on Frick Island—a tiny, remote town smack in the middle of the Chesapeake Bay—is nearly perfect. Well, aside from one pesky detail: Her darling husband, Tom, is dead. When Tom's crab boat capsized and his body wasn't recovered, Piper, rocked to the core, did a most peculiar thing: carried on as if her husband was not only still alive, but right there beside her, cooking him breakfast, walking him to the docks each morning, meeting him for their standard Friday night dinner date at the One-Eyed Crab. And what were the townspeople to do but go along with their beloved widowed Piper? Anders Caldwell’s career is not going well. A young ambitious journalist, he’d rather hoped he’d be a national award-winning podcaster by now, rather than writing fluff pieces for a small town newspaper. But when he gets an assignment to travel to the remote Frick Island and cover their boring annual Cake Walk fundraiser, he stumbles upon a much more fascinating tale: an entire town pretending to see and interact with a man who does not actually exist. Determined it’s the career-making story he’s been needing for his podcast, Anders returns to the island to begin covert research and spend more time with the enigmatic Piper—but he has no idea out of all the lives he’s about to upend, it’s his that will change the most.USA Today bestselling author Colleen Oakley delivers an unforgettable love story about an eccentric community, a grieving widow, and an outsider who slowly learns that sometimes faith is more important than the facts.",
  "genres": [
    "Fiction",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Book Club",
    "Mystery",
    "Chick Lit"
  ],
  "author": "Colleen Oakley",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/55760893-the-invisible-husband-of-frick-island"
}