{
  "title": "Predictable Revenue",
  "description": "GROW REVENUE BY 300% OR MORE AND MAKE IT PREDICTABLE...\"Alexander Graham Bell discovered the telephone, Thomas Edison discovered electricity and Aaron Ross discovered the Enterprise Market for Salesforce.com.\" SHELLY DAVENPORT - VP Worldwide Sales at Replicon & ex-VP Corporate Sales at Salesforce.comDiscover the outbound sales process that, in just a few years, helped add $100 million in recurring revenue to Salesforce.com, almost doubling their enterprise growth... with zero cold calls.This is NOT another book about how to cold call or close deals. This is an entirely new kind of sales bible for CEOs, entrepreneurs and sales VPs to help you build a sales machine.  What does it take for your sales team to generate as many highly-qualified new leads as you want, create predictable revenue, and meet your financial goals without your constant focus and attention? LEARN INSIDE WHAT PEOPLE ARE SAYING ABOUT PREDICTABLE REVENUE\"I couldn't put it down. It's saved me so much time, and now revenue is ramping up. After reading the book, we closed major deals immediately with the strategies.\"  KURT DARADICS CEO, Freedom Speaks / CitySourced.com\"Reading Predictable Revenue is like having a delicious conversation with a sales guru who generously shares his sales process, results and lessons learned. I'm so impressed, energized and refreshed to hear such relevance mixed with humor and unabashed logic. This book is honest, relevant and logical and it's rated A++ because it's guaranteed to make you think and convinces you to change things up....fast. Now, please excuse me as I'm running out to a funeral for my phone. After reading my favorite chapter on RIP Cold Calling there's no doubt its dead and gone and Aaron tells us why.\" JOSIANE FEIGON, CEO of TeleSmart and author of Smart Selling on the Phone and Online\"I just finished reading your book. Unbelievable! I now know what's wrong with our sales process...\" PAT SHAH, CEO, SurchSquad\"I have read Predictable Revenue and it's Entrepreneurial Crack!\"  DAMIEN STEVENS, CEO, Servosity \"Working with Aaron Ross has been nothing short of amazing! His methods applied to our sales organization helped us produce a profitable and scalable new stream of predictable revenue. We saw at least 40+% new business growth. The best part is, we had a blast while doing it!\"  MICHAEL STONE, VP Sales and Strategy, WPromote (#1 ranked Search Marketing Firm on the Inc. 500)For A Summary... google \"Why Salespeople Shouldn't Prospect\"",
  "genres": [
    "Business",
    "Nonfiction",
    "Entrepreneurship",
    "Management",
    "Buisness",
    "Finance",
    "Leadership"
  ],
  "author": "Aaron Ross",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/12688360-predictable-revenue"
}