{
  "title": "200",
  "description": "It’s Eva Thorne’s 200th birthday.But it’s not a celebration, more like a funeral. Eva lives in a world where the Cure for aging and illness has been discovered and administered to every person on Earth, only there’s one big hitch. It turns out that very few people can handle immortality, so they have to take a test on their two hundredth birthday. If they pass, then they get to live forever. But if they fail, they must be euthanized.Eva’s not an optimist. In fact, she’s pretty sure that she’s going to fail her Centurial Assessment Test. For starters, almost nobody passes anymore. She’s seen the news stories. But than more than that, Eva can tell that she’s already starting to slip mentally. Ever since the Escorts took her husband Owen away for his test a little over six months ago and he never came back, she’s been chainsmoking cigarettes (they can’t kill her after all), binge drinking, and waiting for the Escorts to get it over with already.Who wants to live forever if you have to do it alone?Here’s the truth—Owen was her husband for over 170 years. He was her soulmate. Her lover. Her goofball best friend. Her partner in crime. Her everything. But on the way to her testing room, Eva glimpses a staffer who resembles her husband. Suddenly, she has to find out the truth about what really happened to him. Suddenly, she has a reason to live. Did he pass his test? Does he get to live forever? Can Eva join him for this next part of their lives? Or is she destined to fail her test and be euthanized?Now Eva must escape from the testing facility and find out if her husband passed his test—and what he’s been doing for the past six months. With the Escorts hunting her down, she kidnaps the staffer and drags him to the roof, discovering that it’s Owen—only he can’t remember her because they wiped his memory. When you pass your CAT test, you must leave your old life behind. Eva must now find a way to him remember their life together, or lose him forever to his new immortal existence.",
  "genres": [
    "Graphic Novels",
    "Science Fiction",
    "Graphic Novels Comics"
  ],
  "author": "Jennifer  Brody",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/55759000-200"
}