{
  "title": "Beyond the Darkness",
  "description": "Scotland 1564: Oran Shaw is no ordinary man: a Warlock, determined to leave his lengthy, and turbulent, past behind, he disregards his elders, choosing to live a normal life among mortals… until he meets Kristene, a young, innocent woman, wrongfully accused of witchcraft. Following his instincts, he feels compelled to rescue her from her death sentence. It is an act he would later regret. Together, they escape to a new life, settling in Triora—Italy. But life alters, when a sinister rival from Oran’s past—Magia Nera, a dark Warlock—discovers them. He secretly manipulates Kristene, luring her away from Oran, bitterly ending their relationship, his interference abruptly forcing all three to go their separate ways.Four decades later: Oran has returned to Scotland with his new wife, Rosalyn, and her daughter, Eleanor; they are mortals. At last the Warlock feels contentment, living a normal and peaceful life with his family. But when Rosalyn bears him a son, Gillis, life changes utterly for the reluctant Warlock.Soon, his past creeps up on him, in the form of a Sorceress called, L’Ordana. Oran recognises her as, Kristene, only now there is an element of evil inside her. She is not alone, and wants something from him: the location of a powerful amulet: The Shenn. Aware his son is destined to rule over the precious item, Oran vows to protect him, and his family… no matter what! Forced by his council, the Elliyan, to seek out the Sorceress and destroy her, he soon realises he is torn between their past and the present. But, when they come face to face, the Warlock unexpectedly finds himself as her prisoner. While incarcerated, Oran then allies with three unlikely characters, to help him escape; they are not what they seem. Half human, half Vampire, the three Dhampir, Reece (a Soldier), Asai (a Samurai), and Tam (a Highlander), are also L’Ordana’s prisoners—through no fault of their own. They, too, want freedom and their mortality restored. After much persuasion, Oran then makes a bargain with them: in exchange for their freedom, they find and protect his son. With many lives at stake, and time running out, a twist of fate then turns the table on them all, when one of the Dhampir makes a shocking discovery…",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "M. A. Maddock",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/55757692-beyond-the-darkness"
}