{
  "title": "The Five Wounds",
  "description": "Winner of the 2021 Center for Fiction First Novel PrizeWinner of the 2022 Rosenthal Family Foundation AwardFinalist for the 2022 Andrew Carnegie Medal for Excellence in Fiction • Finalist for the 2022 PEN/Hemingway Award for Debut Novel • Finalist for the 2022 Aspen Words Literary Prize • Finalist for the 2022 Lambda Literary Award for Lesbian Fiction • Finalist for the 2022 Mark Twain American Voice in Literature AwardOne of NPR's Best Books of the Year • A Publishers Weekly and Library Journal Best Book of the Year in Fiction • A Kirkus Reviews Best Fictional Family of the Year • A Booklist Top Ten Book-Group Book of the Year and Top Twenty-First Century First Novels, So Far • A Goodreads Choice Awards Best Debut Novel NomineeFrom an award-winning storyteller comes a stunning debut novel about a New Mexican family’s extraordinary year of love and sacrifice.It’s Holy Week in the small town of Las Penas, New Mexico, and thirty-three-year-old unemployed Amadeo Padilla has been given the part of Jesus in the Good Friday procession. He is preparing feverishly for this role when his fifteen-year-old daughter Angel shows up pregnant on his doorstep and disrupts his plans for personal redemption. With weeks to go until her due date, tough, ebullient Angel has fled her mother’s house, setting her life on a startling new path.Vivid, tender, funny, and beautifully rendered, The Five Wounds spans the baby’s first year as five generations of the Padilla family converge: Amadeo’s mother, Yolanda, reeling from a recent discovery; Angel’s mother, Marissa, whom Angel isn’t speaking to; and disapproving Tíve, Yolanda’s uncle and keeper of the family’s history. Each brings expectations that Amadeo, who often solves his problems with a beer in his hand, doesn’t think he can live up to.The Five Wounds is a miraculous debut novel from a writer whose stories have been hailed as “legitimate masterpieces” (The New York Times). Kirstin Valdez Quade conjures characters that will linger long after the final page, bringing to life their struggles to parent children they may not be equipped to save.\"Masterly…Quade has created a world bristling with compassion and humanity. The characters and the challenges they face are wholly realized and moving; their journeys span a wide spectrum of emotion and it is impossible not to root for [them].\" —Alexandra Chang, New York Times Book Review",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Book Club",
    "Audiobook",
    "LGBT",
    "Family"
  ],
  "author": "Kirstin Valdez Quade",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/55759252-the-five-wounds"
}