{
  "title": "The Part That Burns",
  "description": "“You can tear a thing apart and tape it back together,” writes Jeannine Ouellette, “and it will still be torn and whole. There is no other way.” In her fiercely beautiful memoir, Ouellette recollects fragments of her life and arranges them elliptically in order to see each piece as torn and whole, as something more than itself. Caught between the dramatic landscapes of Lake Superior and Casper Mountain, between her stepfather’s groping and her mother’s erratic behavior, Ouellette lives for the day she can become a mother herself, and create her own sheltering family. What she does not know is how the visceral reality of birth and motherhood will pull her back into the body she long ago abandoned, revealing new layers of pain and desire, and forcing her to choose between her idealistic vision of perfect marriage and motherhood and the birthright of her own flesh, unruly and alive. This is a story about the tenacity of family roots, the formidable undertow of trauma, and the rebellious and persistent yearning of human beings for love from each other.A textured remembrance of a traumatic childhood that also offers affecting moments of beauty. ~Kirkus (starred review) I love this book and am grateful it is in the world. ~Dorothy Allison, New York Times bestselling author of Bastard Out of Carolina and CavedwellerSimply beautiful. Precisely imagined, poetically structured, compelling, and vivid. ~Joyce Carol OatesJeannine Ouellette’s memoir glows with incandescent storytelling centered around memories, motherhood, and resilience. The Part That Burns proves that life isn’t lived in a linear way. Girlhood and womanhood can exist simultaneously, our former selves meeting our present selves. Ouellette’s writing is ablaze with a burnished beauty.” ~Michele Filgate, editor of What My Mother and I Don’t Talk About Vital, full of energy and wisdom, Jeannine Ouellette's memoir crackles with excitement. From the shores of Lake Superior to the mountains of Wyoming to the banks of the Mississippi River, this is a story of American migration—not just of families but of spirits. I loved the brave little girl at the heart of this story, so will you.\" ~Rene Denfeld, bestselling author of The Child Finder and The Butterfly GirlWith a poet's voice and an uncanny knack for mining memory, Ouellette's memoir-in-fragments evokes pain and beauty in equal measure. Ouellette understands the elliptical nature of memory, the way years and experience can transform our understanding of the things we did as children and the things that were done to us. She loops back and forth in time to the same seminal experiences, adding layers of depth and understanding, and in so doing shows us how her wild determination to overcome the trauma of her childhood results in a life lived on her own terms. Full of love, loss, and hard-won redemption, The Part That Burns is a fiercely beautiful memoir. ~Alison McGhee, New York Times bestselling author of The Opposite of Fate and Someday. A writer with an extraordinary gift for prose that's complex, imagistic, and startling. ~Richard McCann, author of Mother of SorrowsAt turns tender and devastating, these essays are finely carved vignettes that, laid together, form a powerful portrait of one woman's path from hard girlhood to motherhood, the grace and mettle it takes not only to survive but to flourish. ~Melissa Febos, author of Abandon Me and Girlhood Powerful and urgent, this is truly a book for our time: It teases beauty out of ugliness; it shows the courage of everyday survival; it creates wholeness out of fragments. With her gorgeous and precise prose, Ouellette shows that when faced with abuse we can do more than merely endure – we can fight back, we can flourish, we can thrive. ~Sue William Silverman, author of How to Survive Death and Other InconveniencesIn The Part that Burns, Jeannine Ouellette has gifted an entrancing and courageous story to those who have ever felt forced to silence memories of childhood sexual abuse. She is a child, searching wild, unending landscapes for doorways to other dimensions of understanding and safety. She is a young wife, then a young mother, hypnotically looping back again and again to make sense of the memories that won’t let her go. Like lacy tumbleweeds finally uprooted and taking to air, this too is a story of flight. Her flight on black-as-space country roads; her flight to reach a faraway mother figure who once said she cared; and the flight of her deepest-down words, finally taking to air for those who must hear them. This is a story about giving voice to all the pieces of one’s life, rendered with devastating beauty, heart, and artistry. ~ Diane Zinna, author of The All-Night Sun",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Jeannine Ouellette",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/55779198-the-part-that-burns"
}