{
  "title": "Private Rogue",
  "description": "We will take on any case, solve any crime, uncover any secret.We are Private. And we're the best.__________________________In Afghanistan, a US Special Forces pilot is shot down during a covert mission.In New York, a mother is forced to flee with her two young children.A wealthy businessman approaches Jack Morgan, head of Private - the world's largest investigation agency - with a desperate plea to track down his daughter and grandchildren, who have disappeared without a trace.What at first seems to be a simple missing persons case soon escalates into something much more deadly, when Jack discovers the daughter is being pursued by highly trained operatives.As Jack uncovers more of the woman's backstory, the trail leads towards Afghanistan - where Jack's career as a US Marine ended in catastrophe . . .Jack will need to face the trauma of his past to save a family's future.__________________________Fans love Private 'Yet again James Patterson gives us a fast-paced, easy to read thriller''You think you know where it is going when all of a sudden it is flipped on its head''A fast-paced thriller that does not fail to please with its twists and turns.''James Patterson never fails to hook me in and this was another of his books that I stayed up way too late to finish... no regrets.''It is non stop action and I couldn't read it fast enough.''Packed with oodles of suspense and tension ... It is a gripping read''What a great book, couldn't put it down once I started it''It's fast paced, authentic and grabbed me from the first page. As with all of this series, it offers great characterisations, excellent research and a thoroughly gripping read. Roll on the next one.''High action, tense and with such urgency inherent in the text that if I had any belief I was in for an early night, that was also gone.''The chapters are short and pacy, each one leaving readers with a kind of cliffhanger that makes it virtually impossible to ignore the 'one more chapter' call.''I love the action sequences, the pace, the energy and, more than anything, the characters.''Fast-paced, edge of the seat action, emotionally driven story laced with a very generous helping of corruption and espionage. The kind of brilliant storytelling that makes me power to the last page.'__________________________PRAISE FOR THE PRIVATE THRILLERS'An unmissable, breakneck ride' James Swallow'Great action sequences . . . breathtaking twists and turns' Anthony Horowitz'Exhilarating, high-stakes action' Lesley Kara",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Crime",
    "Audiobook",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "James  Patterson",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/55778135-private-rogue"
}