{
  "title": "Gypsy Magic (Poppy's Potions, #1)",
  "description": "Welcome to Haven Hollow, a town of monsters…After dating a string of losers and banishing a poltergeist, I packed up my Los Angeles life and my eleven-year-old son, and moved… to a town in Oregon with a population of 680. Well, 682 now.Culture shock anyone? Ahem, never mind that… New starts can happen anywhere, right?I hope so because I need to start the next chapter of my forty-three year life pronto. So, why Haven Hollow? For one reason—there aren’t any witches here. And a witch can make a gypsy’s life… complicated.Oh, right, I’ve put the cart before the horse…Hi, I’m Poppy Morton and I come from a long line of Scottish gypsies—gypsies who possess magic and make potions to treat any and all ailments. It’s been my dream to open my own potions store and I’m finally going to do it—in the picturesque and small town of Haven Hollow.Once my son, Finn, and I get settled in our two-story ramshackle, decrepit and rickety farmhouse (that happens to be bordering a cemetery), the nightmares start. And they won’t stop. Almost every night, I find myself face to face with a shadow monster—and its victim. And I’m fairly sure it’s the victim sending me the night terrors, wanting me to figure out the mystery of who or what murdered him.But, I’m not really sure I want to get involved. Between facing a huge remodel of the above mentioned “house,” getting my son situated in his new school, opening my potions store and dealing with one of the ghosts from my last house who somehow thumbed a ride to this one, I’ve got my hands full. Actually, more than full.Good thing I’ve got a few handsome neighbors to call on—Marty Zach, a self-professed ghost exorcist who just happens to have the sexiest smile, and Roy Osbourne, a bear of a man who looks like he alone coined the word ‘lumberjack.’While I’m taken by Marty’s charm and Roy’s really-really-really broad shoulders, I can’t help but feel like this whole town is hiding a secret… and that’s the mystery I mostly want to solve, ghost visions be damned.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Magic",
    "Urban Fantasy",
    "Contemporary",
    "Vampires",
    "Audiobook"
  ],
  "author": "H.P. Mallory",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/55768929-gypsy-magic-poppy-s-potions-1"
}