{
  "title": "Tamed & Unleashed: The Highlander's Vivacious Wife",
  "description": "A forgotten night. A stolen child. And a stranger who feels all too familiar.  Waking up alone after a drunken night with a stranger in Gretna Green, CLAUDIA DAVENPORT, sister to Viscount Ashwood, finds herself still unmarried…and with child. In order to preserve her reputation, her brother sends her to a remote estate so she can give birth in secret and then return to society, unscathed…but heartbroken. However, when her child is kidnapped, Claudia can no longer deny the bond that connects her to her son. Alone, she sets out to discover his whereabouts…and her path crosses that of a stranger, who feels all too familiar.  After marrying an English lass in Gretna Green, GARRETT MACDRUMMOND returns to their room at the inn the next morning only to find her gone. Duty-bound to return to his clan in the Scottish Highlands, he counts the days until he can travel to England to find her. However, when he finally does discover her, he is shocked to realise that she does not remember him.  Determined to remind her of the fateful night they shared, Garrett refuses to leave her side, following her across England without knowing why.  Will Claudia ever remember him? Will Garrett ever learn that he has a child? Will they recover their son or lose him without ever having had the chance to know him?    \"Their adventure into 'love' is filled with the love of two people as they rediscover each other and chase after a kidnapper, meet up with a 'Privateer' and find their happily ever after.\" - Zena, BookBub review  \"There are lots of twists and turns but this bring together several characters from previous books. That only enhances this story.\" - Monica, BookBub review     Love's Second Chance Series  #1 Forgotten & Remembered - The Dukes Late Wife (Rosabel & Graham) #2 Cursed & Cherished - The Duke's Wilful Wife (Anna & Edmond) #3 Despised & Desired - The Marquess' Passionate Wife (Ellie & Frederick) #4 Abandoned & Protected - The Marquis' Tenacious Wife (Henrietta & Connor) #5 Ruined & Redeemed - The Earl's Fallen Wife (Charlotte & Sebastian) #6 Betrayed & Blessed - The Viscount's Shrewd Wife (Beth & Tristan) #7 Deceived & Honoured - The Baron's Vexing Wife (Madeline & Derek) #8 Sacrificed & Reclaimed - The Solider's Daring Widow (Meagan & Edward) #9 Condemned & Admired - The Earl's Cunning Wife (Violet & Oliver) #10 Trapped & Liberated The Privateer's Bold Beloved (Alexandra & Antoine) #11 Oppressed & Empowered - The Viscount's Capable Wife (Evelyn & Richard) #12 Destroyed & Restored - The Baron's Courageous Wife (Adelaide & Matthew) #13 Tamed & Unleashed - The Highlander's Vivacious Wife (Claudia & Garrett)(coming soon) More to follow!  Each love story in this series can be read as a stand alone. However, most readers prefer to read them in order.  Also check out Bree's A Forbidden Love Novella Series which is FREE with Kindle Unlimited!",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Historical Fiction",
    "Regency Romance",
    "Fiction"
  ],
  "author": "Bree Wolf",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/55777200-tamed-unleashed"
}