{
  "title": "Thunder",
  "description": "Makenna has a past she’d rather bury deep in her mind. Unfortunately, as the sole guardian for her five siblings, forgetting where they came from isn’t possible. All she can hope for is to provide her loved ones the kind of untroubled childhood she’d always dreamed of and keep them far away from where she grew up. Friendships and relationships, especially the romantic variety, don’t rank on her priority list. That is until she’s introduced to a hot biker whose playful personality and mesmerizing smile would make any woman perk up and take notice, even one with more responsibilities than sense.Thunder has seen it all, done it all, and has no interest in the high maintenance, in-your-face, party girls. Give him a no-frills woman, like the diner’s adorable new waitress, who doesn’t play games rather than a scantily clad bimbo who manipulates men for sport. Makenna is precisely the kind of fun he needs to celebrate patching with the Hell’s Handlers MC. Only he quickly discovers Makenna is a package deal with more baggage than a carefree guy like him can handle. With each passing day, Thunder finds himself increasingly drawn to Makenna despite her mountain of responsibilities and his distrust of relationships. Even crazier is how some of her siblings are working their way under his skin and into his heart, as is Makenna. Just as Thunder starts thinking about dates and promises, the CDMC roars back into his life. They’re responsible for his beloved club brother’s death, and he wants nothing more than to make them suffer.When the threats start coming, and Makenna finds herself caught in the crossfire, Thunder will discover exactly the kind of man he is, and how far he’s willing to go to keep Makenna and her siblings in his life.",
  "genres": [
    "Romance",
    "Contemporary",
    "Crime",
    "Contemporary Romance",
    "Romantic Suspense",
    "Abuse",
    "M F Romance"
  ],
  "author": "Lilly Atlas",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/55773140-thunder"
}