{
  "title": "At the End of the World, Turn Left",
  "description": "\"It's rare to find a debut mystery crafted with such elegance and authenticity, let alone in a place that has been so neglected as a literary location. Slor's next novel will be one to anticipate.\" ― NPR“Slor keeps the suspense high in this unconventional detective story, using her characters’ musings on language and perception to enrich readers’ understanding of how and why events unfold as they do. Those looking for an intricately textured tale of family relationships will be rewarded.” — Publishers Weekly“This wonderful debut is a match for patrons who enjoyed Zadie Smith’s White Teeth or Rachel Zhong’s Goodbye, Vitamin. It’s also a must for anyone who has ever had a needy Grandma who anticipates death every morning (this character alone is worth the read).” — Booklist, Starred ReviewZhanna Slor's debut novel, a unique literary mystery set in Milwaukee's eclectic Riverwest neighborhood during the 2008 recession, weaves together the tale of two immigrant sisters with very different ideas of home. Masha remembers her childhood in the former USSR, but found her life and heart in Israel's Orthodox community. Anna, a young artist and student, was only an infant when her family left but still yearns to find her roots. When Anna is contacted by a stranger from their hometown and then disappears, Masha is called back to Wisconsin to find her, and this search changes the family forever.MORE ADVANCE PRAISE:“An intoxicating fever dream of a book, At the End of the World Turn Left subverts the mystery genre in surprising ways and gives us the mysteries of real life instead: the incommunicable nature of the past, the confines of family, the gulfs love must try to cover between us. A beautiful, joyful read.” — Rufi Thorpe, author of The Knockout Queen, Dear Fang with Love, and The Girls of Corona Del Mar\"Don’t miss AT THE END OF THE WORLD, TURN LEFT―one of those gems of a novel that delivers poignant observations about life in a suspenseful page-turner. As two young sisters separately search for answers in the wonderfully offbeat neighborhood of Riverwest, Milwaukee, torn in different directions by a fascinating crew of locals―Jewish Soviet refugees, charismatic train hoppers, lovable loafers and thieves―the reader is taken on a heart-thumping ride that explores all the important relationships that make up our lives: our relationship to our siblings, parents, friends, country, heritage, and, lastly, to ourselves, that is the person we used to be and the one we hope to become.\" ― Jessamyn Hope, author of SAFEKEEPING\"Zhanna Slor's AT THE END OF THE WORLD, TURN LEFT is the story of two immigrant sisters who are grappling with finding their purpose and place in the world, struggling to find the balance between family and freedom, tradition and modernity. Slor's brilliant exploration of the nature of freedom is a quintessential first generation American story told with great humor, grit, wisdom, and compassion.\" ―Anne Raeff, author of Winter Kept Us Warm and Only the River \"Zhanna Slor has written a stellar debut novel of literary suspense, which is also an engrossing coming-of-age story focusing on two sisters who emigrated as children from Ukraine to Milwaukee. Slor insightfully examines their experiences as young women who must confront the contradictions they find in themselves, in America, and in their parents, who both want their daughters to live as they are told to rather than find their own way in the world. This is a debut of many felicities, much heart, and more than a few comic moments. It was a true pleasure to read.\" ―Christine Sneed, author of Little Known Facts and Paris, He Said ​​",
  "genres": [
    "Fiction",
    "Mystery",
    "Book Club",
    "Audiobook",
    "Mystery Thriller",
    "Thriller",
    "Ukraine"
  ],
  "author": "Zhanna Slor",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/55776215-at-the-end-of-the-world-turn-left"
}