{
  "title": "What My Husband Did",
  "description": "A little girl has been left for dead. And now my husband is missing.‘I can give you a lift home,’ the man says. Little Alice tightens the zip of her big red coat. She’s unsure, but the walk will be cold and dark. ‘I’m not supposed to get in a stranger’s car.’ He forces a smile. ‘I’m not a proper stranger, am I?’I return home to our beautiful house on a chilly winter evening expecting to find my handsome husband Richard waiting for me by the fire. We’re still so in love, and he always takes care of me: buying us this home in the little village where he grew up, making sure I settled in and made friends, and treating my teenage daughter like his own. There’s a bit of gossip about our age gap, but the death of his first wife years ago was so tragic that he still gets sympathetic looks. Everyone loves Richard.He usually comes straight back from work. But tonight, our antique clock ticks on through the dark evening, with no sign of him. Then a knock at the door shatters my perfect life. A 12-year-old-girl, Alice from the village, has been found unconscious in the field behind our house. They say she was last seen getting into Richard’s car.Now rumours are flying. As Alice fights for her life in hospital, nobody will speak to me: and when they do it’s to ask if he didn’t hurt Alice, why hasn’t Richard come home?I know that revealing my own darkest secret about Richard’s first wife could prove his innocence… but even if I do, he’s still missing. Is everyone right, and is my husband on the run? And will telling the truth about my past turn my own daughter against me, and tear our lives apart for good?Fans of The Girl on the Train, I Am Watching You and Shari Lapena will adore this absolutely unputdownable read by bestselling author Kerry Wilkinson, about the dark secrets we hide to protect ourselves and the ones we love.",
  "genres": [
    "Thriller",
    "Mystery",
    "Psychological Thriller",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Kerry Wilkinson",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/55776809-what-my-husband-did"
}