{
  "title": "The Women's March: A Novel of the 1913 Woman Suffrage Procession",
  "description": "New York Times  bestselling author Jennifer Chiaverini returns with The Women’s March , an enthralling historical novel of the women’s suffrage movement inspired by three courageous women who bravely risked their lives and liberty in the fight to win the vote. Twenty-five-year-old Alice Paul returns to her native New Jersey after several years on the front lines of the suffrage movement in Great Britain. Weakened from imprisonment and hunger strikes, she is nevertheless determined to invigorate the stagnant suffrage movement in her homeland. Nine states have already granted women voting rights, but only a constitutional amendment will secure the vote for all. To inspire support for the campaign, Alice organizes a magnificent procession down Pennsylvania Avenue in Washington, DC, the day before the inauguration of President-elect Woodrow Wilson, a firm antisuffragist. Joining the march is thirty-nine-year-old New Yorker Maud Malone, librarian and advocate for women’s and workers’ rights. The daughter of Irish immigrants, Maud has acquired a reputation—and a criminal record—for interrupting politicians’ speeches with pointed questions they’d rather ignore. Civil rights activist and journalist Ida B. Wells-Barnett resolves that women of color must also be included in the march—and the proposed amendment. Born into slavery in Mississippi, Ida worries that white suffragists may exclude Black women if it serves their own interests. On March 3, 1913, the glorious march commences, but negligent police allow vast crowds of belligerent men to block the parade route—jeering, shouting threats, assaulting the marchers—endangering not only the success of the demonstration but the women’s very lives. Inspired by actual events, The Women’s March offers a fascinating account of a crucial but little-remembered moment in American history, a turning point in the struggle for women’s rights.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Feminism",
    "Audiobook",
    "Politics",
    "Book Club"
  ],
  "author": "Jennifer Chiaverini",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/55809796-the-women-s-march"
}