{
  "title": "Moms Don't Have Time To: A Quarantine Anthology",
  "description": "* FEATURED ON GOOD MORNING AMERICA, KATIE COURIC MEDIA, ABC-7 EYEWITNESS NEWS, NY1,  GOOD DAY LA, GOOD DAY DC, GOOD DAY DALLAS, WGN CHICAGO, TAXI TV, KCRA SAN DIEGO AND NBC BOSTON! * FEATURED IN THE WASHINGTON POST, THE NEW YORK POST, PARENTS, TOWN & COUNTRY, WORKING MOTHER, BELLETRIST, L.A. PARENTS, SOCIAL LIFE, PUBLISHERS WEEKLY, PSYCHOLOGY TODAY, AVENUE, WHAT'S UP MOMS, POLO LIFESTYLES, THE JEWISH BOOK COUNCIL, SHELF AWARENESS, AND MORE * FEATURED ON MANY, MANY AMAZING PODCASTS LIKE FRIEND AND FICTION, A MIGHTY BLAZE, TABLET, BOOKS CONNECT US, GROWN & FLOWN, CHICKEN SOUP FOR THE SOUL, A BOOKISH HOME, AND MORE * WINNER 2021 INTERNATIONAL BOOK AWARDS  * WINNER 2021 NATIONAL PARENTING PRODUCT AWARDS * WINNER 2021 MOM'S CHOICE AWARDS  * WINNER 2021 HERMES CREATIVE GOLD AWARDS  * WINNER 2021 MUSE CREATIVE AWARDS  * #1 BESTSELLER IN HEALTH/FITNESS; #1 BESTSELLER IN GASTRONOMY ESSAYS; #2 BESTSELLER IN ESSAYS ON AMAZON ****** JOIN ZIBBY OWENS OF MOMS DON'T HAVE TIME TO READ BOOKS ON A JOURNEY FILLED WITH FOOD, EXERCISE, SEX, BOOKS, AND MORE. Zibby Owens, an award-winning podcaster and mother of four herself, wanted to do something to help people carry on during the pandemic and give them something to focus on other than the horrors of their news feeds. In addition to her IGTV daily interview show and book club, she launched an online magazine called We Found Time,  which she later turned into this book with the editing help of authors Claire Gibson, Elissa Altman and Carolyn Murnick.  ALL PROCEEDS OF THE BOOK GO TO THE SUSAN FELICE OWENS PROGRAM FOR COVID-19 VACCINE RESEARCH AT MOUNT SINAI HEALTH SYSTEM.Authors who had been on her podcast wrote original, brilliant essays for busy readers inspired by five things moms don't have time to eat, read, work out, breathe, and have sex.  These 60+ short, literary essays by many New York Times bestselling authors, celebrities, award-winning authors and more promise to inspire and make others feel less alone -- at any time.  Contributors BermanAlison CayneAlli FrankAshley Prentice NortonBeth Ricanati, MDBonnie TsuiCaitlin MullenCarolyn MurnickCasey SchwartzChris BohjalianChristina GeistClaire GibsonCourtney MaumDan PeresDeborah BurnsDibs BaerDonna HemansDylan LaurenEilene ZimmermanElissa AltmanElliot AckermanEsther AminiEvangeline LillyGeorgia ClarkGretchen RubinJan EliasbergJanelle BrownJanice KaplanJeanne McWilliams BlasbergJewell Parker RhodesJill SantopoloJohn KenneyJulie SatowKaren DukessKarma BrownKelly McWilliamsLaura HankinLauren Braun CostelloLauren MechlingLea CarpenterLisa BarrLiz AstrofMary Laura PhilpottMaya Shanbhag LangMegan AngeloNicole C. KearNina Renata AronPhyllis GrantRachel BertscheRachel Levy LesserReema ZamanRene DenfeldRochelle WeinsteinSally KoslowSara ShepardSonali DevSuzanne FalterTeresa SorkinTiffany ShlainV. C. ChickeringWendy WalkerWilliam DameronZibby Owens",
  "genres": [
    "Nonfiction",
    "Parenting",
    "Essays",
    "Short Stories",
    "Humor",
    "Biography",
    "Audiobook"
  ],
  "author": "Zibby Owens",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/55781047-moms-don-t-have-time-to"
}