{
  "title": "Trasiga helgon",
  "description": "Vi möter ofta nåden där vi minst av allt väntar oss det. Det är den bästsäljande amerikanska författaren och prästen Nadia Bolz Webers budskap i boken Trasiga helgon att finna Gud i oväntade människor.Med hjälp av en mängd personliga berättelser, där hon inte minst delar med sig av sina egna misstag och svagheter, pekar hon på hur Gud envist fortsätter att visa sig för henne i de mest oväntade människorna en kyrkälskande agnostiker, en drag queen, en kriminell biskop och en vapenflörtande medlem i NRA. Med sitt karaktäristiskt mustiga språk berättar Nadia Bolz Weber hur hon genom dessa ”trasiga helgon” sveps in i personliga möten med nåd en gåva som för henne känns mindre som att vara insvept i en varm filt och mer som att bli slagen med ett trubbigt verktyg. Men genom den nåden blir hon och andra människor förvandlade på sätt som de inte kunde ha blivit på egen hand. Vi kan nämligen bara uppleva Guds nåd genom gemenskap, och att gå till kyrkan och delta i liturgin formar oss långsamt över tid vilket är mycket viktigare än vad vi tror på, menar Nadia Bolz Weber.Ur boken: ”Som människor kan vi skapa en mängd saker åt oss själva underhållning, berättelser, smärta, tandkräm, kanske rentav lite peppning. Men det är svårt att skapa det som befriar oss från jagets bojor.”Nadia Bolz Weber är präst i den lutherska kyrkan i USA, före detta ståuppkomiker, nykter alkoholist och New York Times bestseller-författare. Hon är också grundare av den uppmärksammade församlingen House for all sinners and saints i Denver, USA. Nadia Bolz Weber är en efterfrågad inspiratör, talare och föreläsare. Hon är känd för sina tankeväckande och nyskapande bibelutläggningar och annorlunda predikostil hennes budskap har beskrivits som utmanande för såväl konservativa som liberala men också för att hon är öppen med sina egna brister och vilda förflutna. Trasiga helgon är den första av hennes böcker som översätts till svenska.",
  "genres": [
    "Nonfiction",
    "Religion",
    "Memoir",
    "Faith",
    "Spirituality",
    "Christian",
    "Theology"
  ],
  "author": "Nadia Bolz-Weber",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/55795676-trasiga-helgon"
}