{
  "title": "Could Have Been Us",
  "description": "New York Times Bestselling author Corinne Michaels returns to the Willow Creek Valley Series in this stunning friends-to-lovers/brother’s best friend romance. Stella Parkerson has been in love with Jack since she was sixteen. He’s older, broken, her brother’s best friend, and unwilling to betray his promise to never touch her again. Their past is riddled with secrets. Their heartache is too much to bear, but what happens when they can no longer keep apart and give in to their love?New York Times Bestselling author Corinne Michaels returns to the Willow Creek Valley Series in this stunning small town, brother’s best friend romance.Fifteen years ago, I fell for Jack O’Donnell.I was just a girl, but I knew my brother’s best friend was the only man I’d ever love.On my eighteenth birthday, when I asked him to kiss me, I never imagined it would change my life so completely.I gave Jack everything that night.In order to move on, we had to go our separate ways and pretend like nothing happened... as though it wasn’t the greatest moment of my life.But even that wasn’t as heartbreaking as the secret we were forced to keep.I’ve tried not to think about how much I still love him. How I long to be back in his strong arms or the way his hazel eyes make my heart race.Until he kisses me again. And this time there’s no turning back. This time I know what it means.We belong together and there’s no use denying it any longer.But our feelings aren’t the only thing that won’t stay buried, our past resurfaces and threatens to destroy our second chance at happiness.When our love is tested once again, will we be strong enough to stand together?",
  "genres": [
    "Romance",
    "Second Chance",
    "Second Chance Romance",
    "Contemporary Romance",
    "Small Town Romance",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Corinne Michaels",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/55809364-could-have-been-us"
}