{
  "title": "One More Beer, Please: Q&A With American Breweries Vol. 1",
  "description": "Are you a Craft Beer fanatic?Are you the person who takes the long way home just to visit a new craft brewery that opened up a town over?My name is Jon Nelsen and I truly love craft beer! Ever since my first visit to Selin's Grove Brewing in the middle of nowhere Pennsylvania, I was hooked. I have traveled from coast to coast to explore and experience both that atmosphere of a good brewery and the unique styles of limited edition beer.Like many of you, I have a dream of opening my own craft brewery, but did not understand where to start. This book was a chance to ask breweries some poignant questions about their operations, their products, what their take on the industry is, and why they wake up each morning and keep grinding away! I have read dozens of books on all things craft beer and worked for many well-known breweries and can honestly say I learned more from this book than anything else.Each book in this three book set contains over 100 Q&A interviews with breweries all over America. Questions like: ◆ Can you guess how much beer a brewer can drink?◆ How do you open a brewery and what does it cost?◆ What is the real difference between a Porter and a Stout?◆ What beer are you drinking at the end of a long day?◆ Who in the industry is doing it best?and so much more....Beer is personal to me and if it is to you too, please pick up these books today and show your love for the amazing industry that brought us hours of delightful day drinking and evenings that felt like you never wanted them to end.Each book you purchase goes to support my dream of becoming a part of the most exciting industry on the planet.Written by someone who truly loves beer, this book peeks behind the curtain and gets candid answers to questions from hundreds of breweries. The people behind these companies are leaders and trailblazers. Get to know more about American Breweries and how they work.Perhaps this book will inspire you to seek new breweries in your area and support those who have given us so many fun memories!Your perfect beer companion is one click away.★ Click BUY NOW, and savor it with your favorite ale today. ★",
  "genres": [],
  "author": "Jon Nelsen",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/55792596-one-more-beer-please"
}