{
  "title": "Hold Fast Through the Fire",
  "description": "The Near-Earth Orbital Guard (Neo-G)—inspired by the real-life mission of the Coast Guard—patrols and protects the solar system. Now the crew of Zuma’s Ghost must contend with personnel changes and a powerful cabal hellbent on dominating the trade lanes in this fast-paced, action-packed follow-up to A Pale Light in the Black.Zuma’s Ghost has won the Boarding Games for the second straight year. The crew—led by the unparalleled ability of Jenks in the cage, the brilliant pairing of Ma and Max in the pilot seats, the technical savvy of Sapphi, and the sword skills of Tamago and Rosa—has all come together to form an unstoppable team. Until it all comes apart.Their commander and Master Chief are both retiring. Which means Jenks is getting promoted, a new commander is joining them, and a fresh-faced spacer is arriving to shake up their perfect dynamics. And while not being able to threepeat is on their minds, the more important thing is how they’re going to fulfill their mission in the black.After a plea deal transforms a twenty-year ore-mining sentence into NeoG service, Spacer Chae Ho-ki earns a spot on the team. But there’s more to Chae that the crew doesn’t know, and they must hide a secret that could endanger everyone they love—as well as their new teammates—if it got out. At the same time, a seemingly untouchable coalition is attempting to take over trade with the Trappist colonies and start a war with the NeoG. When the crew of Zuma’s Ghost gets involved, they end up as targets of this ruthless enemy.With new members aboard, will the team grow stronger this time around? Will they be able to win the games? And, more important, will they be able to surmount threats from both without and within?",
  "genres": [
    "Science Fiction",
    "Audiobook",
    "Space",
    "Queer",
    "Fiction",
    "LGBT",
    "Space Opera"
  ],
  "author": "K.B. Wagers",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/55809786-hold-fast-through-the-fire"
}