{
  "title": "The Valancourt Book of ​Victorian Christmas Ghost Stories: Volume Four",
  "description": "Victorian-era Christmas ghost stories are associated primarily with Charles Dickens and other British writers, but for this new volume, editor Christopher Philippo has discovered that the tradition of telling and publishing ghostly tales at Christmas flourished in the New World as well. These tales are set in places that are familiar and yet foreign to us—Gold Rush-era San Francisco, old New Orleans, the barren and frozen plains of Iowa and the Dakotas, the early days of the Puerto Rican commonwealth. Like their British cousins, these stories make perfect winter reading by candlelight or the fireside. This selection includes more than a dozen rare tales, most never before reprinted, along with a number of macabre Christmas-themed poems, and features a number of contributions by women and African-American authors.“He turned and beheld a low black figure, with a body no higher than his knees, with a prodigious head, in the brow of which was set a single eye of green flame like a shining emerald, and with hands and arms of supernatural length.”—Joseph Holt Ingraham, “The Green Huntsman; or, The Haunted Villa: A Christmas Legend of Louisiana”“There was a crash of the outer door​—then a staggering and uncertain step in the outer room. It approached the sick-room​—the latch lifted​, the door swung open​—and then​—my God! what a spectacle! Through the open door there stepped a figure​, not of Mrs. Hayden, not of her corpse, not of death, but a thousand times more horrible​, a thing of corruption, decay, of worms and rottenness.”—Anonymous, “Worse than a Ghost Story”",
  "genres": [
    "Horror",
    "Short Stories",
    "Christmas",
    "Classics",
    "Ghost Stories",
    "Ghosts",
    "Gothic"
  ],
  "author": "Christopher Philippo",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/55782059-the-valancourt-book-of-victorian-christmas-ghost-stories"
}