{
  "title": "No Good Mitchell",
  "description": "BRODYA night on the town after a long workweek at my family's distillery should include shots and dancing--not a hot kiss with a handsome stranger. I'm straight...at least, that's what I figured until I find myself locking lips with a sexy city boy. Now all my circuits are going haywire, and the spark that ignites between us makes me even more curious.Unfortunately, I kissed the one man who's off-limits: Cohen Mitchell--the sole surviving heir to the Mitchell Creek distillery, a rival neighbor my family has feuded with for nearly a hundred years. Until he arrived in town, no one knew there were any Mitchells left. But the business-savvy city slicker has taken an interest in his legacy. Nothing means more to me than my family, so whether I like it or not, I have to keep my hands off the sexy, green-eyed beauty who Big Daddy has not-so-affectionately dubbed that \"No Good Mitchell.\" Problem is: my hands have other plans...COHENI never expected to inherit a distillery from a father I had never known. That's how I find myself in a tiny Georgia town where everyone knows a family history I've been kept in the dark about. The townsfolk all have a different story about my ancestors, with two things in common: illegal activity and Mitchell vs O'Ralley forever.Maybe I shouldn't like Brody O'Ralley, but I didn't grow up with this stupid family feud. I enjoy touching him, kissing him and--oops--I'm falling for the man with sweet Southern charm and a big heart. Between the O'Ralley patriarch hating me, getting the Mitchell Creek distillery off the ground, and working through my own family issues, I know I should stay away from Brody.But I won't, and staying away is not what he wants either. I crave all the time with my country boy as I can get, even if it's breaking the rules. After all, I am a No Good Mitchell.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "LGBT",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Gay For You"
  ],
  "author": "Riley Hart",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/55811302-no-good-mitchell"
}