{
  "title": "Corruption of the Rose",
  "description": "The beast-men of the Urgal Mountains were said to have been a race that had ages past been warped by the magic of dark alchemy. For Rose Almander they are nothing but stories for scaring children and the ignorant. An educated woman and a cast-out alchemist of the Order, she has more to worry about than fictional monsters lurking in the wooded mountains. Like, staying under the cover of semi-obscurity from other mages by working as a perfumer. Although it is not what she would have dreamed of and trained for, the coin is enough to soothe her bruised ego. Yet, when she’s commissioned by the queen to create a fragrance to bewitch, Rose must obtain the Forial Rose that grows only in the depths of the mountain forests. With a fortune promised and no one available to procure it for her, and her own life on the line should she fail, Rose must face the wilderness and a monster of legend not seen in generations. The lupi were created to be guardians, the wolves of the mountain that was said to separate the worlds. There, the dark alchemist once reined, his chaotic art keeping the balance between worlds. When the time came for the mage to leave the abode he built, he trained the first among the lupi, Siras, in the arts so that his successor would be found and prepared to rule the mountain. As centuries pass with no heir in place, the presence of a mage in the forest is greeted with high expectations from Siras. But it is a dangerous path for the female. She must prove her dominance with her magic for the lupi to submit. Only then will she be able to bind herself to the mountain as its queen. Saris must push her, punish her, and consume her so that she can rise and take her place upon the alchemist’s throne. Only then will he serve her, his dark mistress and beloved.Rose was captured by a beast, but he discovered the monster within her.Please be aware that this book contains dub-con, as well as dark and horror themes. It may not be suited for everyone.",
  "genres": [
    "Fantasy",
    "Dark",
    "Monsters",
    "Paranormal",
    "Fantasy Romance",
    "Erotica",
    "Dark Romance"
  ],
  "author": "S.J. Sanders",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/55813492-corruption-of-the-rose"
}