{
  "title": "Shake Things Up",
  "description": "Three people, one road trip, and so many queer feelings. A polyamorous romance about changing your life.Allie and Matt’s happy open relationship means they’re both free to find hookups. When Allie gets duped by a date, though, she’s found with someone else’s cheating boyfriend. Ugh!Meeting Noelle by helping her leave the guy isn’t the night Allie expected, but after the women bond over drinks and a seriously dysfunctional tape gun, Allie’s hesitant to say goodbye. It’s weird; she doesn’t normally like-like people who aren’t Matt.Matt’s questioning whether he’s entirely straight, and he hopes to find answers on his and Allie’s impending road trip. But he’s cool with bringing her new maybe-crush along, especially since he and Noelle keep finding things in common. And staring into each other's eyes.Noelle lost her demanding job right before her boyfriend cheated, and she’s looking for the next one—preferably back home in the Midwest. Allie’s fumbling charm and Matt’s flirtatious humor, however, make her wonder if her life compass needs fixing.Late-night talks on Texas highways, first kisses, and hotel confessions might change a lot... but only if there’s a next step for Noelle that isn’t leaving.SHAKE THINGS UP is a queer polyamorous road trip romance novel about unexpected sapphic crushes, geeks falling in love, bisexual awakening, coming out in adulthood, honoring relationships that don’t fit the traditional mold, and finding the people who will support you completely in living as your full self. You can also expect tipsy bowling, hella flirting, cheerful faux-bickering, bi-pan solidarity, F/F and M/M love scenes, and a warm and optimistic polyam HFN.Content warnings are available in the book's front matter and on the author's website.Cover Artist: Laya Rose",
  "genres": [
    "Romance",
    "Contemporary",
    "LGBT",
    "Lesbian",
    "Queer",
    "Polyamory",
    "Adult"
  ],
  "author": "Skye Kilaen",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/55814111-shake-things-up"
}