{
  "title": "How to Stop Procrastinating: Powerful Strategies to Overcome Laziness and Multiply Your Time",
  "description": "Have you ever felt there are not enough hours in the day to finish important tasks?Do you feel stressed, anxious, and worried because your to-do lists never get completed?Face it – at some point in your life, you have experienced unwanted distractions that kept you from focusing on pursuing your goals.Whether you are an aspiring entrepreneur, a teacher, a student, or a stay at home parent—this book will show you how to shatter procrastination and live a life of purpose and fulfillment. No matter how big or small, we all have goals, and when days turn into weeks and weeks turn into months and months turn into years without achieving them, life can get pretty depressing.Did you know that you are only one or two mindset tweaks away from eliminating procrastination from your life?In How to Stop Procrastinating: Powerful Strategies to Overcome Laziness and Multiply Your Time, you will find the reasons why we procrastinate in the first place, and how to use that to accelerate your productivity to higher heights. This book will enlighten your mind and open your eyes to the infinite possibilities that are available to you, whether you want more financial freedom, happiness, or personal fulfillment. You will discover:The science behind crushing procrastinationHow to escape social media traps that engage you for hours on endThe importance of eating the right foods to boost your productivityHow to overcome previous fears of failure, judgment, and rejectionPowerful action-based tips to reach your goals fasterHow to discipline yourself physically, mentally, and emotionallyTechniques to master the art of time managementYou will be given a unique insight into the power of now. Time is something you can never reclaim and you will begin to realize how precious every second of your life really is.The time is now, not tomorrow, not next week. Don’t waste another day—now is the time for transformation. Get your copy of this fantastic guide as a part of your commitment to improving today!Click the link below to view the book on Amazon!",
  "genres": [
    "Self Help",
    "Productivity",
    "Nonfiction",
    "Personal Development"
  ],
  "author": "Daniel Walter",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/55817399-how-to-stop-procrastinating"
}