{
  "title": "Facing the Unseen: The Struggle to Center Mental Health in Medicine",
  "description": "From the New York Times bestselling author of Black Man in a White Coat comes a powerful and urgent defense of psychiatry and mental health careAs much as we all might wish that mental health problems, with their elusive causes and nebulous presentations, simply did not exist, millions of people suffer, sometimes to an extreme extent. The National Institute of Mental Health estimates that about twenty percent of U.S. adults live with a mental illness each year. And yet the practice of psychiatry, and psychiatrists themselves, are often derided, challenged, and their work seen as nothing but pill-pushing.Meanwhile, those who suffer from mental health problems face a worse reality. Because there is often no tangible sign that reliably distinguishes a person suffering a mental disorder from someone who is not, it is easy to discount that person’s subjective experience. The teenager who stays in bed all day is lazy; the woman who cries for hours at a time is weak; the man who consumes too much alcohol or drugs is selfish. What’s worse, these castigations don’t just arise from strangers, but often from those closest to parents, children, spouses, and yes, even doctors. Bestselling author, professor of psychiatry, and practicing physician Damon Tweedy guides us through his days working in various settings―from country clinics, to emergency rooms, to VA hospitals as he meets people from all walks of life who are often grappling with both physical and mental illnesses. In forceful, eloquent prose, Tweedy argues for a more comprehensive and integrated system of mental health care in America, one where doctors of all stripes will have a deeper understanding and be taught more empathy for sufferers, and the continued stigma of “crazy” in the public eye, will be replaced by a more compassionate and educated understanding of how mental and physical symptoms can interact and contribute to a person’s health.",
  "genres": [
    "Nonfiction",
    "Mental Health",
    "Psychology",
    "Health",
    "Science",
    "Medicine",
    "Medical"
  ],
  "author": "Damon Tweedy",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/126917730-facing-the-unseen"
}