{
  "title": "Gordo",
  "description": "The first ever collection of short stories by Jaime Cortez, Gordo is set in a migrant workers camp near Watsonville, California in the 1970s. A young, probably gay, boy named Gordo puts on a wrestler's mask and throws fists with a boy in the neighborhood, fighting his own tears as he tries to grow into the idea of manhood so imposed on him by his father. As he comes of age, Gordo learns about sex, watches his father's drunken fights, and discovers even his own documented Mexican-American parents are wary of illegal migrants. Fat Cookie, high schooler and resident artist, uses tiny library pencils to draw huge murals of graffiti flowers along the camp's blank walls, the words \"CHICANO POWER\" boldly lettered across, until she runs away from home one day with her mother's boyfriend, Manny, and steals her mother's Panasonic radio for a final dance competition among the camp kids before she disappears. And then there are Los Tigres, the perfect pair of twins so dark they look like indios, Pepito and Manuel, who show up at Gyrich Farms every season without fail. Los Tigres, champion drinkers, end up assaulting each other in a drunken brawl, until one of them is rushed to the emergency room still slumped in an upholstered chair tied to the back of a pick-up truck. These scenes from Steinbeck Country seen so intimately from within are full of humor, family drama, and a sweet frankness about serious matters - who belongs to America and how are they treated? How does one learn decency, when laborers, grown adults, must fear for their lives and livelihoods as they try to do everything to bring home a paycheck? Written with balance and poise, Cortez braids together elegant and inviting stories about life on a California camp, in essence redefining what all-American means.",
  "genres": [
    "Short Stories",
    "Fiction",
    "LGBT",
    "Queer",
    "Historical Fiction",
    "Audiobook",
    "Historical"
  ],
  "author": "Jaime  Cortez",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/55836536-gordo"
}