{
  "title": "The Eve's End",
  "description": "It’s been twenty-eight years since Fae Peeters came to a little Belgian village for Christmas. Twenty-eight years since she received the Gift and came face to face with Nefas. Fate would ensure that twenty-eight years would not become twenty-nine. Fae has found a successful life for herself, rising to the top of her field as a highly sought after architect; she has a healthy family, home, and future. But she carries with her the secret of a traumatic past no one can understand: the Gift, and Nefas. She fears her past because it could still become her future. . . because Nefas hasn't stopped haunting her. What does it take to get your life back from someone who stole it from you? Everything.A mysterious mandate brings Fae back to the Belgian village for Christmas where it all began. It’s a place she swore she’d never return to, but she determines to find reprieve from what—and who—still haunts her. Unsettling events, however, shatter her plans for finding peace. The ghost of a teenager, who legend said Nefas had killed years earlier, is seen wandering the streets. A young woman who has interests beyond the Christmas festivities knows more than she should, and she seems to have awoken the Gift in a way it hasn’t been since Fae had twenty-eight years earlier. Even many of the local villagers have become ignorant of Nefas’ darkness.Faced once more with Nefas’ inevitable call, Fae will be forced to discover the courage to exorcise her past once and for all by surviving one more Christmas Eve with the Gift and with Nefas. He has had twenty-eight years to make sure Fae doesn’t escape him again, and his ambitions have grown beyond the village walls.Written by Canadian author Stephanie M. Matthews, “The Eve’s End” is a non-traditional Christmas story of good versus evil. Beautiful descriptions and haunting storytelling will appeal to those who enjoy thrillers, psychological thrillers, the supernatural, and suspense.",
  "genres": [],
  "author": "Stephanie M. Matthews",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/55822448-the-eve-s-end"
}