{
  "title": "The Bookseller of Florence: The Story of the Manuscripts That Illuminated the Renaissance",
  "description": "The Renaissance in Florence conjures images of beautiful frescoes and elegant buildings--the dazzling handiwork of the city's skilled artists and architects. But equally important for the centuries to follow were geniuses of a different sort: Florence's manuscript hunters, scribes, scholars, and booksellers, who blew the dust off a thousand years of history and, through the discovery and diffusion of ancient knowledge, imagined a new and enlightened world.At the heart of this activity, which bestselling author Ross King relates in his exhilarating new book, was a remarkable man: Vespasiano da Bisticci. Born in 1422, he became what a friend called \"the king of the world's booksellers.\" At a time when all books were made by hand, over four decades Vespasiano produced and sold many hundreds of volumes from his bookshop, which also became a gathering spot for debate and discussion. Besides repositories of ancient wisdom by the likes of Plato, Aristotle, and Quintilian, his books were works of art in their own right, copied by talented scribes and illuminated by the finest miniaturists. His clients included a roll-call of popes, kings, and princes across Europe who wished to burnish their reputations by founding magnificent libraries.Vespasiano reached the summit of his powers as Europe's most prolific merchant of knowledge when a new invention appeared: the printed book. By 1480, the king of the world's booksellers was swept away by this epic technological disruption, whereby cheaply produced books reached readers who never could have afforded one of Vespasiano's elegant manuscripts.A thrilling chronicle of intellectual ferment set against the dramatic political and religious turmoil of the era, Ross King's brilliant The Bookseller of Florence is also an ode to books and bookmaking that charts the world-changing shift from script to print through the life of an extraordinary man long lost to history--one of the true titans of the Renaissance.",
  "genres": [
    "History",
    "Nonfiction",
    "Italy",
    "Books About Books",
    "Art",
    "Biography",
    "Historical"
  ],
  "author": "Ross King",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/55836542-the-bookseller-of-florence"
}