{
  "title": "Systematic Land Theft",
  "description": "This textbook, includes case studies , in-depth policy and legal case analysis along with over 1,000 citations detailing the history of land theft in the U.S.Whites presently own over ninety-five percent of farmland in the United States through the misappropriation of tribal nation lands and the exploitation of enslaved Africans. As the enslaved African population grew, the government welcomed immigrants from Europe to settle into the U.S., ensuring their majority status. As Europeans immigrated into the U.S., the adoption of English common law created the separation of land into statehood, thus replacing African and tribal groups' beliefs of communal living. The creation of state boundary lines and personal property rights became the foundation of U.S. modern property laws. Due to forced assimilation into the “new” American way of life, the five civilized tribes adopted some European customs. By the early 1800’s the five civilized owned slaves and fought in the Confederacy to preserve the institution of slavery. After the Civil war ended, former enslaved Black men, joined the military, which provided stability and wages to “cultivate” the land for European settlers. “Cultivate” meant removing tribes from their property, which was earmarked for disbursement to European settlers during the Allotment period. The incidences of slave ownership of the five civilized tribes and the removal of tribal nations off their land plus the position of Europeans created strife. Subsequently, the creation of a racial hierarchy led to conflict among all three groups: European Immigrants, Indigenous Tribal Nations, and former/enslaved Africans. U.S. property laws were implemented to enfranchise settlers and afford protection for Europeans while disenfranchising non-whites out of their land ownership. This system has allowed future generations to secure their position of wealth while the loss of land in both Black and indigenous communities continue to keep both groups economically oppressed. Due to the history of land theft and property laws, Blacks lose 30,000 acres in land ownership per year. Systematic Land Theft explores the history of European settlements in the Plain States as a replica for other U.S. regions and the present-day land loss of both exploited communities. Hishaw provides recommendations regarding the identification, valuation, legislation, and compensation for land reparations, how to disperse them, and legal analysis related to tax credits. These are backed by industry interviews and 15 years of professional experience. Systematic Land Theft presents a provocative and factual justification for land reparations supported by extensive research.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Jillian Hishaw",
  "average_rating": "4.94",
  "url": "https://www.goodreads.com/book/show/55846083-systematic-land-theft"
}