{
  "title": "Lincoln In Private: What His Most Personal Reflections Tell Us About Our Greatest President",
  "description": "From the New York Times bestselling author of A. Lincoln and American Ulysses, a revelatory glimpse into the mind and soul of our sixteenth president through his private notes to himself, explored together here for the first time.A deeply private man, closed off to even those who worked closely with him, Abraham Lincoln often captured \"his best thoughts,\" as he called them, in short notes to himself. He would work out personal stances on the biggest issues of the day, never expecting anyone to see these frank, unpolished pieces of writing, which he'd then keep close at hand, in desk drawers and even in his top hat. The profound importance of these notes has been overlooked, because the originals are scattered across several different archives and have never before been brought together and examined as a coherent whole.Now, renowned Lincoln historian Ronald C. White walks readers through twelve of Lincoln's most important private notes, showcasing our greatest president's brilliance and empathy, but also his very human anxieties and ambitions. We look over Lincoln's shoulder as he grapples with the problem of slavery, attempting to find convincing rebuttals to those who supported the evil institution (\"As I would not be a slave, so I would not be a master. This expresses my idea of democracy.\"); prepares for his historic debates with Stephen Douglas; expresses his private feelings after a defeated bid for a Senate seat (\"With me, the race of ambition has been a failure--a flat failure.\"); voices his concerns about the new Republican Party's long-term prospects; develops an argument for national unity amidst a secession crisis that would ultimately rend the nation in two; and, for a president many have viewed as not religious, develops a sophisticated theological reflection in the midst of the Civil War (\"It is quite possible that God's purpose is something different from the purpose of either party.\").These are notes Lincoln never expected anyone to read, put into context by a writer who has spent his life studying Lincoln's life and words. The result is a rare glimpse into the mind and soul of one of our nation's most important figures.",
  "genres": [
    "History",
    "Biography",
    "Presidents",
    "Nonfiction",
    "Civil War",
    "Us Presidents",
    "Politics"
  ],
  "author": "Ronald C. White",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/55851609-lincoln-in-private"
}