{
  "title": "Lady Constantine and the Sins of Lord Kilgore",
  "description": "In the game of love, even a rogue can come undone by his own wicked wager.\nCallum, the Marquess of Kilgore, long ago accepted that he was no saint. So when he’s offered a shameful bet—to seduce the lady some have dubbed the “Ice Queen” and recover the land he foolishly gambled away—he agrees. Yet, as he comes to know Lady Constantine, he realizes this kind and pure woman deserves far better than a reprobate like himself. Now, he would do anything to protect her from the scandal he helped create, even ruthlessly pushing her away. It seems he hasn’t fallen quite as far into sin as he thought…But a brush with death and an unexpected offer of a marriage of convenience from Constantine provides an opportunity he never anticipated: recoup his squandered fortune and win back the woman he loves. But before Callum can launch his new plan, a heinous plot rips him away, snatching his freedom and destroying any trace of the man who wanted to open his heart.Constantine hasn’t a clue what to do when the man she loved, hated, and mourned returns from the dead. Though she is still legally his wife, she certainly doesn’t know him anymore—if she ever did. The seemingly unrepentant rogue appears focused solely on revenge, no matter the destruction it may cause—a far cry from the complex man of honor she once believed him to be. Yet, despite the pain of the past and the demons of the present, Callum still holds the power to inexorably fill her with a yearning and a hope she can hardly control. Suddenly, Constantine wants to risk her heart again for the one thing she has always longed for from the only man she ever cared for—exquisite, unconquerable love.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Regency",
    "Second Chance Romance"
  ],
  "author": "Julie Johnstone",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/55846314-lady-constantine-and-the-sins-of-lord-kilgore"
}