{
  "title": "This Might Get Awkward",
  "description": "Sophie Kinsella meets Sarah Dessen in the most hilarious, romantic book of the summer about a girl with social anxiety and the boy who refuses to let her hide herself away.Seventeen-year-old Gemma’s favorite kind of beach is an empty one. Social interactions are too much for her to handle. She always says the wrong thing—if she manages to say anything at all. She can’t even bring herself to speak to her longtime crush, Beau Booker, without losing sleep over her own awkwardness.During a solo outing to her favorite beach, Gemma realizes—to her horror—that the popular kids from school have shown up to throw a party. Before she can sneak away (and possibly puke behind her car) Gemma is pulled into the action and ends up talking to Beau, who asks her to pretend that they’re “close.” Gemma is too flustered and flattered to refuse, and mostly, she’s wondering why Beau is talking to her at all . . . right up until the moment when he falls off the boat, hits his head, and ends up in a coma.After rescuing Beau from the water, Gemma is mistaken for Beau’s girlfriend by his friends and family, including his mysterious older brother, Griff, who has returned to town after a year away. Gemma tries to correct the record, but her social anxiety (and a nosy reporter) gets in the way at every turn. Before she knows it, she’s in too deep to backtrack. And when Beau’s warm, boisterous family pulls Gemma into their orbit, she realizes how much she wants to keep them in her life.For the first time, Gemma has everything she’s ever wanted: friends, big family dinners, and Griff—a boy who she can be herself around. But how can she embrace her new dream life when everything is built on a lie?",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Mental Health",
    "Audiobook",
    "Young Adult Romance",
    "Realistic Fiction"
  ],
  "author": "Kara McDowell",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/55848848-this-might-get-awkward"
}