{
  "title": "The Boys Who Loved Me",
  "description": "A lifelong friendship that became a rivalry. Three gorgeous specters of my past, hellbent on winning me back. Who knew coming home could be so deliciously complicated?When the funeral of a childhood friend brings Kayla back to North Glade, she's forced to face the very reasons she left. And when three sizzling exes reveal they still harbor feelings for her? The men come up with a very unique way of determining who gets their shot.There's Warren... her first in every way. Whiskey brown eyes. A lady-killing smile and a roguishly handsome face, set upon shoulders to die for.Then there's Luke, tall, blonde and perfect. Warren's best friend... at least up until he and Kayla shared that smoldering hot summer together, just after their breakup.Finally there's Adrian, the brooding tattooed god. Thick black hair with mountains of muscle; a friend with benefits so raw and savage Kayla could never hope to resist - nor would she ever want to.Choosing between them becomes an impossibility... until a very unorthodox solution presents itself. One that leaves Kayla breathless and filled with butterflies, while fulfilling every last one of her far-flung fantasies.But North Glade still harbors its own share of mysteries, as outside forces begin aligning against their tight-knit little group. Will Kayla stay long enough for one of her suitors to win her heart? Or will a more unconventional arrangement present itself... one where she gets to eat her cake and have it too?THE BOYS WHO LOVED ME is a sweltering, stand-alone reverse harem love story filled with suspense, humor, new adult romance, and enough molten hot action to melt your kindle (author not responsible for molten kindles). HEA guaranteed!",
  "genres": [
    "Reverse Harem",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Erotica",
    "Menage",
    "Second Chance"
  ],
  "author": "Krista Wolf",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/55851443-the-boys-who-loved-me"
}