{
  "title": "The Second Life of Mirielle West",
  "description": "In an intoxicating story of resilience, repulsion, and the Roaring 20’s, the glamorous world of a silent film star’s wife abruptly crumbles when she’s forcibly quarantined at America’s only leper colony in Carville, Louisiana…Based on the little-known true story of America’s only leper colony, The Second Life of Mirielle West by RUSA Award-winning author Amanda Skenandore brings vividly to life the Louisiana institution known as Carville, where thousands of people were stripped of their civil rights, branded as lepers, and forcibly quarantined throughout the entire 20th century.* A 2023 Silicon Valley Reads Selection ** Reader's Digest Editor's Choice *Based on the true story of America’s only leper colony, The Second Life of Mirielle West brings vividly to life the Louisiana institution known as Carville, where thousands of people were stripped of their civil rights, branded as lepers, and forcibly quarantined throughout the entire 20th century. For Mirielle West, a 1920’s socialite married to a silent film star, the isolation and powerlessness of the Louisiana Leper Home is an unimaginable fall from her intoxicatingly chic life of bootlegged champagne and the star-studded parties of Hollywood’s Golden Age. When a doctor notices a pale patch of skin on her hand, she’s immediately branded a leper and carted hundreds of miles from home to Carville, taking a new name to spare her family and famous husband the shame that accompanies the disease.At first she hopes her exile will be brief, but those sent to Carville are more prisoners than patients and their disease has no cure. Instead she must find community and purpose within its walls, struggling to redefine her self-worth while fighting an unchosen fate.As a registered nurse, Amanda Skenandore’s medical background adds layers of detail and authenticity to the experiences of patients and medical professionals at Carville – the isolation, stigma, experimental treatments, and disparate community. A tale of repulsion, resilience, and the Roaring ‘20s, The Second Life of Mirielle West is also the story of a health crisis in America’s past, made all the more poignant by the author’s experiences during another, all-too-recent crisis.",
  "genres": [
    "Historical Fiction",
    "Book Club",
    "Fiction",
    "Audiobook",
    "Historical",
    "Romance",
    "Adult"
  ],
  "author": "Amanda Skenandore",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/55841940-the-second-life-of-mirielle-west"
}