{
  "title": "Home Plate",
  "description": "Dominic GirardMy final baseball season with the Easton U Pirates feels bittersweet. I’d like to go out on a high note, graduate, and focus on the family business. But a certain pitcher is making senior year a challenge. Not only because Maclain is stubborn as hell, but because he makes me feel things I never have about another guy. With each snarky comment and hard-won grin, he reveals a little more of himself, and before I know it, I’m in over my head. Mason MaclainI’ll be graduating college this year, which also means the end of baseball, a sport I’ve played my entire life. It feels like a significant chapter is coming to a close, leaving behind a void I’m unwilling to face. Something else I don’t want to face? The impossibly charming Pirates catcher, whose quick wit and killer smirk poke holes in all my defenses. With each lingering look and quiet exchange, I want to push him away and pull him closer at the same time. I’ve never felt this intense draw before, and there’s no way I’ll ever admit it.When Coach proposes a team-building activity to improve our chemistry on the field, little does he know things are heating up behind the scenes as well. A flicker of a connection sparks into a firestorm, and soon Girard and I are experiencing things for the first time—together. But outside the haven of our hotel room, reality infringes all too soon. I’m clinging to my fraying relationship with my dad, and for Girard, coming out is still scary, loving family or not. Resisting the pull to Girard seems futile, but I struggle at every turn. Any longer and I’ll lose the only person who makes my pulse thud quicker than a fastball over home plate.There’s a pitcher-and-catcher joke in there somewhere.",
  "genres": [
    "M M Romance",
    "Sports",
    "Romance",
    "College",
    "Sports Romance",
    "Enemies To Lovers",
    "Contemporary"
  ],
  "author": "Christina  Lee",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/55846156-home-plate"
}