{
  "title": "The Last Muslim Conquest: The Ottoman Empire and Its Wars in Europe",
  "description": "A monumental work of history that reveals the Ottoman dynasty's important role in the emergence of early modern EuropeThe Ottomans have long been viewed as despots who conquered through sheer military might, and whose dynasty was peripheral to those of Europe. The Last Muslim Conquest transforms our understanding of the Ottoman Empire, showing how Ottoman statecraft was far more pragmatic and sophisticated than previously acknowledged, and how the Ottoman dynasty was a crucial player in the power struggles of early modern Europe.In this panoramic and multifaceted book, Gábor Ágoston captures the grand sweep of Ottoman history, from the dynasty's stunning rise to power at the turn of the fourteenth century to the Siege of Vienna in 1683, which brought an end to Ottoman incursions into central Europe. He discusses how the Ottoman wars of conquest gave rise to the imperial rivalry with the Habsburgs, and brings vividly to life the intrigues of sultans, kings, popes, and spies. Ágoston examines the subtler methods of Ottoman conquest, such as dynastic marriages and the incorporation of conquered peoples into the Ottoman administration, and argues that while the Ottoman Empire was shaped by Turkish, Iranian, and Islamic influences, it was also an integral part of Europe and was, in many ways, a European empire.Rich in narrative detail, The Last Muslim Conquest looks at Ottoman military capabilities, frontier management, law, diplomacy, and intelligence, offering new perspectives on the gradual shift in power between the Ottomans and their European rivals and reframing the old story of Ottoman decline.",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "War",
    "Military Fiction",
    "Military History",
    "18th Century"
  ],
  "author": "Gábor Ágoston",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/55849777-the-last-muslim-conquest"
}