{
  "title": "Finlay Donovan Rolls the Dice",
  "description": "Finlay Donovan and her nanny/partner-in-crime Vero are in sore need of a girls’ weekend away. They plan a trip to Atlantic City, but odds are―seeing as it’s actually a cover story to negotiate a deal with a dangerous loan shark, save Vero’s childhood crush Javi, and hunt down a stolen car―it won’t be all fun and games. When Finlay’s ex-husband Steven and her mother insist on tagging along too, Finlay and Vero suddenly have a few too many meddlesome passengers along for the ride. Within hours of arriving in their seedy casino hotel, it becomes clear their rescue mission is going to be a bust. Javi’s kidnapper, Marco, refuses to negotiate, demanding payment in full in exchange for Javi’s life. But that’s not all―he insists on knowing the whereabouts of his missing nephew, Ike, who mysteriously disappeared. Unable to confess what really happened to Ike, Finlay and Vero are forced to come up with a new plan: sleuth out the location of Javi and the Aston Martin, then steal them both back. But when they sneak into the loan shark’s suite to search for clues, they find more than they bargained for―Marco's already dead. They don’t have a clue who murdered him, only that they themselves have a very convincing motive. Then four members of the police department unexpectedly show up in town, also looking for Ike―and after Finlay's night with hot cop Nick at the police academy, he’s a little too eager to keep her close to his side. If Finlay can juggle a jealous ex-husband, two precocious kids, her mother’s marital issues, a decomposing loan shark, and find Vero’s missing boyfriend, she might get out of Atlantic City in one piece. But will she fold under the pressure and come clean about the things she’s done, or be forced to double down?",
  "genres": [
    "Mystery",
    "Audiobook",
    "Fiction",
    "Mystery Thriller",
    "Romance",
    "Humor",
    "Contemporary"
  ],
  "author": "Elle Cosimano",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/126918023-finlay-donovan-rolls-the-dice"
}