{
  "title": "The Life of the Qur'an: From Eternal Roots to Enduring Legacy",
  "description": "Based on extensive scholarship, an innovative biography of the central text of IslamOver a billion copies of the Qur`an exist – yet it remains an enigma. Its classical Arabic language resists simple translation, and its non-linear style of abstract musings defies categorization. Moreover, those who champion its sanctity and compete to claim its mantle offer widely diverging interpretations of its core message – at times with explosive results.Building on his intimate portrait of the Qur`an’s prophet in Muhammad the World-Changer , Mohamad Jebara returns with a vivid profile of the book itself. While viewed in retrospect as the grand scripture of triumphant empires, Jebara reveals how the Qur`an unfolded over 22 years amidst intense persecution, suffering, and loneliness. The Life of the Qur`an  recounts this vivid drama as a biography examining the book’s obscured heritage, complex revelation, and contested legacy.The Qur`an re-emerges with clarity as a dynamic life force that seeks to inspire human beings to unleash their dormant potential despite often-overwhelming odds – in order to transform themselves and the world. \"A vibrant biography of the holy book of Islam... the author capably intertwines the stories of the Qur’an, Muhammad, and the Muslim religion in general. Jebara approaches the Qur’an as a true subject for biography, no less so than its prophet...Despite the challenges this sacred text faces in modern society, Jebara is optimistic: “The critics…have it backward: The Qur’an is not the source of the Muslim world’s problems, but its untapped solution.\" ―Kirkus (Starred review) \"Understanding the Qur'an within the framework of classical Qur'anic exegesis requires understanding the nuances of language as well as the culture and events of the time. Chronicling its history requires tracing the changes in its interpretation, variations, and standardization. In this book, Jebara attempts all of the above.\"―Booklist\"In Jebara’s hands, Islam is shown not just as a religion but as a way of life, with the Qur’an serving as an animating force that deserves to be cultivated rather than simply preserved. An extensively researched look at the text of the Qur’an. It is sure to appeal to Muslims, religious scholars, and any readers interested in learning more about the sacred scripture of Islam.\"―Library Journal\"An eloquent and engaging statement of faith by an author whose traditionalist education is impeccable, but brings a broadminded and modern sensibility to his exploration of the Muslim scripture.\"—Dr. Juan Cole, University of Michigan, author of Muhammad: Prophet of Peace Amid the Clash of Empires\"Jebara’s latest masterpiece is an accessible and captivating read. He brings the Qur’an to life by providing a stimulating historical account of the Abrahamic tradition as well as Prophet Muhammad’s life and legacy. But this book is much more than a historical work. It inspires a deeper interfaith engagement and spiritual encounter with sacred Islamic principles. Jebara is to be commended for writing an original book that offers a rewarding journey into the beautiful soul of Islam.\"—Dr. Craig Considine, author of The Humanity of Muhammad: A Christian View\"A well-researched masterpiece that demonstrates in meticulous detail how the Quran can serve as an enlightening source of guidance for all humanity. Jebara's magnum opus inspires readers to engage the Quran in order to extract principles that bring meaning and order to our avericious and muddled world.\"—His Eminence Dr. Mahmoud Akkam, Grand Mufti of Aleppo\"For both Muslims and non-Muslims, reading the Qur’an in its historical context — and not as an eternally absolute text — is a crucial endeavor. In this remarkable book, Jebara offers such a historical reading of the Islamic Scripture with erudition and eloquence.\" —Mustafa Akyol, senior fellow at Cato Institute, author of Reopening Muslim Minds \"As a Quranic scholar and master of Semitic languages, Jebara elegantly engages the cultural and historical context in which the Quran was revealed, demonstrating its timeless relevance to the modern world. Further, the author astutely elucidates the vitality of the Quran as a positive force for social change and as a spiritual guide for those searching for meaning.\" —Dr. Ali Akkam, Dean, Faculty of Islamic Law, Aleppo University\"A brilliant guide to the heart and soul of the world's fastest-growing faith. For the many Muslims who think they already know the Qur’an, Jebara has produced a treasure of insight and inspiration, as challenging and provocative as it is approachable and rewarding. We may have read the Qur'an countless times, yet Jebara shows how much more depth and dimension there is to the foundation of the Islamic tradition than we know.\"—Haroon Moghul, author of Two Billion Caliphs: A Vision of a Muslim Future\"Scriptures have always contained mysteries and the Quran is not an exception. Jebara proposes an exciting journey transporting our mental horizon to an outstanding view of the enlightening message contained in The Quran. Elucidated with rational evidence, it is a must read for anyone seeking to understand this much misunderstood Holy Book. A vibrant masterpiece, that I highly recommend!\"—His Excellency Dr. Khalid Sacoor D. Jamal, Islamic Community of Portugal\"An extremely well-written introduction to the Qur’an. The author draws the reader into the world of the Qur’an with accessible and elegantly written prose. He demonstrates a breath-taking ability to communicate complex ideas with simplicity and eloquence. Jebara weaves basic concepts of the Arabic language easily with philosophical tropes interpreted against the backdrop of Arabic culture and local context. He does not shy away from directly addressing Western generated stereotypes toward unmaking myths which surround both the Qur’an and Arabic culture. His deft use of narrative provides fascinating linkages between cultural worlds, past and present. Jebara’s book provides a readily accessible entry point and fascinating journey through key themes of the Qur’an and its ideas, which is guaranteed to whet the reader’s appetite for more!\" —Dr. Wendy L. Fletcher, President and Vice-Chancellor, Renison University College, University of Waterloo\"A spiritually nourishing, visually captivating, and lyrically appealing work that is a delight to read. Jebara takes readers on an epic journey replete with a shared Semitic legacy, vivid descriptions of historical facts, and lush details of events and incidences from the bible. Necessary for world healing as it delivers the core message contained in the Quran, substantiated by relevant Quranic verses. Jebara’s vivid description of gender parity, a call to unify diverse communities, makes this book a modern-day savior and powerful educational tool for Muslims and non-Muslims who seek to activate its message for the public good.\" —Dr. Daisy Khan, Women’s Islamic Initiative in Spirituality and Equality\"An accessible and enjoyable read about Islam's Holy Book, which can and should be read by everyone - regardless of faith. During a moment when misinformation about Islam and distortion of the Quran is rife, this book brings urgent clarity and powerful commentary.\" —Dr. Khaled Beydoun, Wayne State University\"I always knew the Qur'an had so much more to offer than what I could extract just from reading on my own. This book unlocks the deeper meanings I've been looking for - and some that I wasn't.\" —Hazem Bata, Former Secretary General and CEO of the Islamic Society of North America \"An accessible and inspiring introduction to one of the world’s most influential books. As with his magnificent and eye-opening biography “Muhammad, The World Changer,” Jebara once again tells a story that will appeal to readers of all backgrounds who wish to better understand Islam.\"—Joshua Foer, author of Moonwalking with Einstein\"Jebara rescues the Qur’an, one of the world’s most memorized yet misunderstood and maligned works, from the book burners and fanatics by elucidating the nuanced meanings of Islam’s fundamental text. A beautifully written, well-sourced, and essential read for understanding the power of ideas and intercultural exchange.\"—Jason Guberman, Executive Director, American Sephardi Federation\"An exquisitely written masterpiece offering a unique window into Quranic wisdom, making it relatable to readers of all backgrounds.\" —Rev. Father Andre Boyer, Former Superior of the Oblates of Mary Immaculate\"Through the power of words, Jebara takes an ancient, sacred, life-giving book and makes it accessible to modern readers. He patiently offers transformative world-changing insights into the Quran making it a window to the Divine, while inspiring readers to seek deeper understanding. This book will truly give readers the courage to go against all odds and listen to the Divine Guidance calling them to make this world a better place.\" —Rev. Takouhi Demirdjian-Petro, first Armenian woman minister ordained in Canada by the United Church\"Fresh insight into a well-known—yet much misunderstood—foundational pillar of the Islamic faith. Jebara addresses many of the most complex and controversial passages, providing readers with the interpretive keys to not merely unlock these texts, but the larger Quranic mindset, which has, and still can, provide inspiration and upliftment for individuals and entire societies.\" —Capt Barbara Lois Helms, First Female Muslim Chaplain of the Canadian Armed Forces\"This book is a finely-detailed key that unlocks the Qur’an’s power, potential and ability both to center the individual and culture, and foster their blossoming!\"—Steven H. Biondolillo, Biondolillo Associates \"A game-changer that will shed light on preconceived notions and repair generational misinterpretations that have plagued so many.\" —Anthony Samadani, Good News Network\"A paragon of explication that reactivates the central role of the Quran as an inspiring force for world-changing impact. Employing a captivatingly brilliant writing style, Jebara captures the minds and hearts of readers of diverse backgrounds.\" —Dr. Ammar Almehmi, University of Alabama at Birmingham",
  "genres": [
    "Religion",
    "Inspirational",
    "Islam",
    "History",
    "Spirituality",
    "Nonfiction",
    "Counselling"
  ],
  "author": "Mohamad Jebara",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/126918344-the-life-of-the-qur-an"
}