{
  "title": "Bedside Matters",
  "description": "Walter had mastered the business world at an unaccounted cost to discover in old age and ill-health a degenerative disease that would eventually render his body useless. His mind, however, was trapped as it was, and had an unconventional final act to play to everyone’s surprise, including his own. “You’re just dying, Walter, Irma, his caretaker said. We all do.”“I’m fine with dying, Irma. I’d just like to know when,” he replied. But it wasn’t true. Walter is a complicated man, captured in the gilded cage of his mansion, tasteful as it is, watching the world, his world, go by without him. As he yearns for his physical power to somehow be magically restored, Walter learns to let go, and let his mind take its course.Visitors with agendas appear to remind him of his life and responsibilities: Walter’s ex-wife Polly, a voluptuous handful as he would describe her, Paula, his chip-off-the-old block upright and forthright all-business daughter, Gavin, his immensely attractive and irresponsible son with a very dodgy track record, and the irrepressible daydreams and memories that flood his consciousness with emotions long shunned.While Walter reads the work of the 13th-century Persian poet Rumi, his inner life takes on a new shape, as his body continues to betray him and deteriorate. He says a long, reluctant goodbye while engaging a side to life that has been, until now, unexplored.The natural world in the garden outside his window provides pleasure as he battles pain and new people enter his world to invigorate his last days, including his new physical therapist, Tressie, a woman so enticing and exotic he counts the minutes between visits.Walter, for the first time, seems to be experiencing life as a poet would, even as the inevitable end comes closer. He takes a young artist under his wing, and even dabbles with watercolors, something he would never have done as a boy, let alone an elder.Succession becomes an obsession with Paula as she builds her empire, albeit with Walter’s help and his power of attorney, and Gavin tries to demonstrate how far he’s come after another stint in rehab. Walter watches them play the game of life, as he becomes a mere observer from the solitude of his stately manor, lost, and possibly found, in his thoughts. Walter’s world becomes a fascinating realm where philosophy rules.A cinematic non-linear take and frank examination of the promise of life, even at its end, Bedside Matters concerns us all at one time or another and asks the ultimate question: what matters most?",
  "genres": [],
  "author": "Richard Alther",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/55849086-bedside-matters"
}