{
  "title": "Exiled Duke",
  "description": "He's the key to her future and a brutal ruler of the underworld. She's the only woman to have ever cracked into his cold heart. Now, he's determined to force her exactly where he needs her to be...exiled.A desperate woman trades everything for a chance of escape.Penelope Willington is an innocent—innocent to a fault—and she never should have stepped foot into the rookeries, much less sought out the man that had once been her whole world—when she was ten. But that was a long time ago. Desperate times call for extraordinary actions, and Pen can't afford to miss her one and only chance to find a future free of the vile man determined to force her under his thumb and into his bed.Her survival depended on his cruelty.After his parents died, Strider Hoppler was forced to exile the one other person in the world he loved—Penelope Willington. He did it to save Pen, did it cruelly, and he never once looked back. Not until sixteen years later, when she strolled into his lair in the heart of the East End of London.A cold ruler of the underground.She entered a world she had no right to be in—his world—a world she should never know for its monstrosities of humanity. No matter that she needed his help. Try as he might to get rid of her, she's stubborn, and before he knows it, Strider is helping her untangle the web of her past.The more time they spend together, the more Strider finds it impossible to resist the inexplicable draw between the two of them. But is it even possible for this hardened rogue to find the one thing he destroyed long ago—his heart?Join the adventure today! You'll love Exiled Duke, the first in the Exile series and a can't-miss enthralling regency romance by USA Today bestselling author K.J. Jackson.Note: The novels in the Exile series by K.J. Jackson are each stand-alone stories and can be read individually in any order. These historical romances are set in the Regency and Victorian eras and do not shy away from scenes with steamy heat, occasional naughty language, and moments that might possibly make you squirm.",
  "genres": [
    "Historical",
    "Historical Romance",
    "Romance",
    "Regency",
    "Friends To Lovers",
    "Historical Fiction",
    "Second Chance"
  ],
  "author": "K.J. Jackson",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/55854454-exiled-duke"
}