{
  "title": "Eco Amazons: 20 Women Who Are Transforming the World",
  "description": "It's a individuals have the power to change the world.And in an age of rampant environmental devastation,nothing is as vital as saving our planet and the health ofits inhabitants. Eco Amazons brings together the womenleading the charge to create a sustainable future. Theyare individuals at the forefront of the global preservationmovement, making a noticeable difference in all of our lives.Through intimate interviews conducted by journalist DorkaKeehn and arresting images by award-winning photographerColin Finlay, Eco Amazons chronicles and illuminates thecritical environmental issues of our time and shows howconcern leads to passion, and how passion leads to actionthat can be emulated by all.While many of the leaders of the modern environmentalmovement have consistently been women, most of theirnames, struggles, and successes have yet to achievenational recognition. A generation ago, conservation held thespotlight; but because of these women, the beam is nowshining equally on health and urban issues like clean air andsafe drinking water. As the movement has expanded, womencontinue to spearhead change in new areas of environmentalfocus such as art, design, economics, and food production.With a forward by Julia Butterfly Hill-the internationallyknown activist who lived in a redwood tree affectionatelyknow as \"Luna\" for 738 days-this seminal book brings tolight the stories and lives of 20 American women making adifference. These eco-warriors include Majora Carter, whofounded the environmental justice organization SustainableSouth Bronx, which includes one of the nation's firsturban-farm training programs; Agnes Denes, a pioneer ofthe ecological art movement; Julia Bonds, a coal miner'sdaughter and the director of Coal River Mountain Watchin the Appalachian Mountains who is fighting the highlydestructive mining practice known as \"mountaintop removal\";and Alice Waters, the chef and owner of the award-winingrestaurant Chez Panisse, who has championed farmer'smarkets and organic products.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Conservation"
  ],
  "author": "Dorka Keehn",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/10283435-eco-amazons"
}