{
  "title": "Far Away from Close to Home: A Black Millennial Woman In Progress",
  "description": "“Vivid and relatable. The writing is like Vanessa herself; funny, charming and brave.” —Mindy Kaling  Through a series of extraordinary, incisive, often-humorous essays, Emmy-nominated winning actress Vanessa Baden Kelly examines what the idea of “home” means to a Black millennial woman in FAR AWAY FROM CLOSE TO HOME: A Black Millennial Woman in Progress. How important is race to the idea of community? What are the consequences of gentrification on the life of a young Black woman? What aspects of a community help―or hurt―a family with a young child? In these profound, intimate essays, Baden has found a space where she can work out thoughts and feelings she feels unsafe saying out loud. As she processes the initial ideas more fully, her essays evolve from personal stories to fully-realized communiques of a generation of Black women who are finding a new sense of both belonging and ostracism in private, work, and public life. A single ride on a Los Angeles public bus that begins with the overwhelming odor of a man sleeping across one of the seats travels through a range of ideas and choices: “choosing” to sit in the back of the bus; the interconnectedness of living in a majority-Black community in the Crenshaw district; the segregation and gentrification of Los Angeles; the challenges of raising a child in a modern urban environment. Underlying the theme of each essay are questions of how a Black millennial woman can find “home” anywhere when confronted with its invasion by police, men, and society’s expectations.Author VANESSA BADEN KELLY is an Emmy-winning actress, Emmy-nominated writer, and producer. She began her career as a child, starring on Nickelodeon’s Gullah Gullah Island and Kenan and Kel. After departing entertainment, she began organizing in college, co-founding the Student Coalition for Justice (later the base for the Dream Defenders) and continued working in the field. To date, she has led campaigns for The Trayvon Martin Foundation, Community Coalition South LA, and various political campaigns including Obama for America ’08 and the Ndoum Presidential Campaign in Accra, Ghana. Additionally, she is an Ambassador for the RuJohn Foundation. Upon her return to Hollywood, Vanessa has become a successful television writer and producer, writing for shows such as TNT’s Animal Kingdom and Mindy Kaling’s HBO Max series The Sex Lives of College Girls. Vanessa originated the role of Journee as writer/star of the Issa Rae digital series Giants, where she is four times Emmy-nominated and one time Emmy-winning for Best Actress in a Digital Drama. Vanessa is mother to a human son, Ryder, and a dog son named Dude.",
  "genres": [
    "Essays",
    "Nonfiction",
    "Feminism",
    "Memoir"
  ],
  "author": "Vanessa Baden Kelly",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/55856518-far-away-from-close-to-home"
}