{
  "title": "The Letters of Shirley Jackson",
  "description": "A bewitchingly brilliant collection of never-before-published letters from the renowned author of \"The Lottery\" and The Haunting of Hill HouseShirley Jackson is one of the most important American authors of the last hundred years and among America's greatest chroniclers of the female experience. This extraordinary compilation of personal correspondence has all the hallmarks of Jackson's beloved fiction: flashes of the uncanny in the domestic, sparks of horror in the quotidian, and the veins of humor that run through good times and bad.\"I am having a fine time doing a novel with my left hand and a long story—with as many levels as Grand Central Station—with my right hand, stirring chocolate pudding with a spoon held in my teeth, and tuning the television with both feet.\"Written over the course of nearly three decades, from Jackson's college years to six days before her early death at the age of forty-eight, these letters become the autobiography Shirley Jackson never wrote. As well as being a bestselling author, Jackson spent much of her adult life as a mother of four in Vermont, and the landscape here is often the everyday: raucous holidays and trips to the dentist, overdue taxes and frayed lines of Christmas lights, new dogs, and new babies. But in recounting these events to family, friends, and colleagues, she turns them into remarkable stories: entertaining, revealing, and wise. At the same time, many of these letters provide fresh insight into the genesis and progress of Jackson's writing over nearly three decades.\"The novel is getting sadder. It's always such a strange feeling—I know something's going to happen, and those poor people in the book don't; they just go blithely on their ways.\"Compiled and edited by her elder son, Laurence Jackson Hyman, in consultation with Jackson scholar Bernice M. Murphy and featuring Jackson's own witty line drawings, this intimate collection holds the beguiling prism of Shirley Jackson—writer and reader, mother and daughter, neighbor and wife—up to the light.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Essays",
    "Classics",
    "Biography Memoir",
    "Books About Books"
  ],
  "author": "Shirley Jackson",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/55873256-the-letters-of-shirley-jackson"
}