{
  "title": "The Icepick Surgeon: Murder, Fraud, Sabotage, Piracy, and Other Dastardly Deeds Perpetrated in the Name of Science",
  "description": "Murder, Fraud, Sabotage, Piracy, and Other Dastardly Deeds Perpetrated in the Name of ScienceFrom New York Times bestselling author Sam Kean comes the gripping, untold history of science's darkest secrets, “a fascinating book [that] deserves a wide audience” (Publishers Weekly, starred review)Science is a force for good in the world—at least usually. But sometimes, when obsession gets the better of scientists, they twist a noble pursuit into something sinister. Under this spell, knowledge isn’t everything, it’s the only thing—no matter the cost. Bestselling author Sam Kean tells the true story of what happens when unfettered ambition pushes otherwise rational men and women to cross the line in the name of science, trampling ethical boundaries and often committing crimes in the process.The Icepick Surgeon masterfully guides the reader across two thousand years of history, beginning with Cleopatra’s dark deeds in ancient Egypt. The book reveals the origins of much of modern science in the transatlantic slave trade of the 1700s, as well as Thomas Edison’s mercenary support of the electric chair and the warped logic of the spies who infiltrated the Manhattan Project. But the sins of science aren’t all safely buried in the past. Many of them, Kean reminds us, still affect us today. We can draw direct lines from the medical abuses of Tuskegee and Nazi Germany to current vaccine hesitancy, and connect icepick lobotomies from the 1950s to the contemporary failings of mental-health care. Kean even takes us into the future, when advanced computers and genetic engineering could unleash whole new ways to do one another wrong.Unflinching, and exhilarating to the last page, The Icepick Surgeon fuses the drama of scientific discovery with the illicit thrill of a true-crime tale. With his trademark wit and precision, Kean shows that, while science has done more good than harm in the world, rogue scientists do exist, and when we sacrifice morals for progress, we often end up with neither.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "True Crime",
    "Audiobook",
    "Medicine",
    "Medical"
  ],
  "author": "Sam Kean",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/55867888-the-icepick-surgeon"
}