{
  "title": "Still the One",
  "description": "It’s never too late to finish a love story…Cole Barrett, former Army Ranger, has a new mission objective. Sell his grandfather’s house and put Deep Haven, a place that holds too many hurts, in his rearview mirror as fast as possible. Recently divorced, single, and unattached, Cole just wants a new life as a US Marshal. One where he can forget the past and start new.Unfortunately, there’s a tenant in the garage apartment who’s refusing to move. Even worse? It’s his childhood crush, Megan Carter, and her son.Wedding planner and single mom Megan Carter loves Deep Haven. To her, it’s the place where she makes dreams come true—at least, everyone else’s. Her big dream is to purchase the Black Spruce Bed & Breakfast to turn it into a premier event venue and, if she can stay booked for enough weddings over winter, she’ll have the needed funds to buy the inn, move out of Grandpa Barrett’s garage apartment, and finally give her nine-year-old son, Josh, the life he deserves. She just needs four thousand dollars in the next thirty days.\tStill, she’s oh, so close…until Cole Barrett returns to Deep Haven. Even if he’s not back to fulfill a silly childhood promise to marry her, but she never expected him to evict her! The last thing she needs is more expenses. Or for another man to walk into her heart…and break it.When a blizzard strikes Deep Haven, and Megan is overrun with wedding catastrophes, it takes a former Ranger to step in and help. Besides, the more he comes to her rescue, the sooner she’ll be able to move out…and he can move on. And that’s what they both want, right?Return to Deep Haven with this magical tale about the one who got away…and came back.",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Contemporary",
    "Fiction",
    "Christian",
    "Christian Romance",
    "Contemporary Romance"
  ],
  "author": "Rachel D.  Russell",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/55879614-still-the-one"
}