{
  "title": "The Heiress",
  "description": "When Ruby McTavish Callahan Woodward Miller Kenmore dies, she’s not only North Carolina’s richest woman, she’s also its most notorious. The victim of a famous kidnapping as a child and a widow four times over, Ruby ruled the tiny town of Tavistock from Ashby House, her family’s estate high in the Blue Ridge mountains. In the aftermath of her death, that estate—along with a nine-figure fortune and the complicated legacy of being a McTavish—pass to her adopted son, Camden.But to everyone’s surprise, Cam wants little to do with the house or the money—and even less to do with the surviving McTavishes. Instead, he rejects his inheritance, settling into a normal life as an English teacher in Colorado and marrying Jules, a woman just as eager to escape her own messy past.Ten years later, Camden is a McTavish in name only, but a summons in the wake of his uncle’s death brings him and Jules back into the family fold at Ashby House. Its views are just as stunning as ever, its rooms just as elegant, but coming home reminds Cam why he was so quick to leave in the first place.Jules, however, has other ideas, and the more she learns about Cam’s estranged family—and the twisted secrets they keep—the more determined she is for her husband to claim everything Ruby once intended for him to have.But Ruby’s plans were always more complicated than they appeared. As Ashby House tightens its grip on Jules and Camden, questions about the infamous heiress come to light. Was there any truth to the persistent rumors following her disappearance as a girl? What really happened to those four husbands, who all died under mysterious circumstances? And why did she adopt Cam in the first place? Soon, Jules and Cam realize that an inheritance can entail far more than what’s written in a will—and that the bonds of family stretch far beyond the grave.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Book Club",
    "Suspense"
  ],
  "author": "Rachel Hawkins",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/126919284-the-heiress"
}