{
  "title": "WHERE WERE YOU?: Ten Terrifying Tales",
  "description": "What would you do if the government made a mistake? A mistake that unleashes a deadly disease across the country turning people violent, cannibalistic and gifting them with super human strength. What would you do if it happened right now, as you are reading this? Maybe you are at home, maybe you are at work. Maybe you are with your loved ones, maybe you are far away. Would you stay at home and follow the government’s advice? Would you panic buy, would you hide, would you gather weapons and go on the attack? Would you attempt to reach loved ones or just try and survive?Ten Terrifying Tales are ten short stories set in this very world. Taken at various time points during the outbreak, they tell the tales of ordinary people in ordinary situations and the battles that take place in this ‘new normal’.Stories included:Home Sweet HomeA young couple have stocked their house with enough food and water to survive for a couple of months without leaving the house. Unfortunately for them there are people that want to steal what they have.Floor TwoA regular day at the office takes a turn for the worse as the sickness has infected a number of employees. With only one way out it quickly escalates into a fight for survival.Him and HerA married couple have taken their tent as far away from civilisation as possible. Sleeping outdoors is never easy, especially when it’s so cold outside, but they have survived so far. Unfortunately something has just woken them up.Locked UpMr Hirst is sat in a prison cell, knowing he has done nothing wrong. A new prisoner is put in the cell across, a prisoner who brings a very literal meaning to the phrase caged animal.ICUShelly and Sophie are still getting used to the new conditions. Working on the Intensive Care Unit they can dictate exactly what they want to happen on their ward, despite what Colonel White says. They are, however, still nurses at the end of the day and agree to take a new patient at the Colonel's request. All is not what it seems when the new patient arrives.The Last TrainTrying to escape the outbreak, four strangers have boarded the last train out of England and into Scotland. The journey can't begin quickly enough as a hoard of the infected appear on the platform.ParadiseWill and Lewis have made it to one of the most beautiful locations in South East Asia. With laid back bars and stunning scenery they truly believe they have arrived in paradise. They meet Sophie and Sara at their hostel and before anybody knows what is going on they are double dating. While on a trip to get food between drinks things on the island take a sinister turn.EvacuationFrank is a former paediatrician pulled out of retirement to help with the evacuation of children. Working on an abandoned airfield the military have been brought in to secure and set up a base for the evacuation. Frank is alarmed to see restraints added to temporary hospital beds but the soldiers brush it off as nothing to worry about. As Frank is making his way to the living quarters he hears a commotion inside as all hell breaks loose. Valley FarmOwning and running their own farm, Tim and Lisa are far enough away from the outbreak to not be concerned. Brief flashes of a deteriorating situation on the news go ignored. Strange happenings on the farm and a warning from their neighbour does nothing, that us until late one evening when the neighbour comes knocking on the door.The BaitAlone and looking to survive it’s been four days since John last ate anything. Villages and shops have been looted long before he arrives and his only hope is a mysterious note he finds telling him to head to a supermarket in a village not far from where he is. The note insists he will be offered food in exchange for medicine. This is the only option he has but has no medicine to trade.",
  "genres": [
    "Horror"
  ],
  "author": "Ryan Berridge",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/55868555-where-were-you"
}