{
  "title": "Alembical",
  "description": "Small Press newcomer, Paper Golem, embarks on an exciting, new annual series, a celebration of the novella, long touted as the \"ideal length\" in speculative fiction. Subtitled \"A Distillation of Four Novellas,\" ALEMBICAL brings together four of the field's top authors, and gets out of their way! \"Jay Lake's “America, Such as She Is” populates postapocalyptic Oregon with beautifully written character studies. In “13 Miles to Paradise,” Bruce Taylor occasionally gets too self-indulgent, but the story itself―five internal monologues of a family heading to a vacation spot―is highly enjoyable. James Van Pelt's “Harvest” is a moving ghost story in which three believably complex high school students deal with grief, love and religion. Ray Vukcevich anchors the book with the witty “Now You See Us,” a love story set against the background of a lost Arctic village and lecherous, time-traveling Finnish monks. Short story writers Schoen and Dorrance have chosen these novellas cover a wide variety of subgenres and show off the talents of four impressive writers. The finely crafted writing should appeal to fans of both speculative and mainstream fiction.\" -- From the PUBLISHERS WEEKLY starred review. \"A stylish collection of stories that continually make you think about what it might mean to be human in strange, unpredictable realms.\" -- Brian Herbert, co-author of the DUNE sequels and prequels. \"Here are four of the deftest sleight-of-hand artists working in the fantastic today... They will slip past your expectations before you know it and astound you without ever raising their voices beyond a hypnotic murmur.\" -- James Patrick Kelly, Hugo, Nebula, and Locus award-winning author. \"The four novellas of ALEMBICAL will take you to wildly diverse places... Challenging, intricate, and beautifully crafted, the stories are a treat to read.\" -- Nancy Kress, Hugo and Nebula award-winning author of DOGS. \"In ALEMBICAL, four of my favorite writers present four of their best stories. Every one is a masterpiece. This collection goes on the top of my re-read stack!\" -- Jerry Oltion, author of PARADISE PASSED. \"ALEMBICAL contains a magical, alchemical distillation of four novellas by four fine writers. I hope this is the first in a long series.\" -- Walter Jon Williams, Nebula award-winning author of IMPLIED SPACES. \"It’s great to see a new venue for novellas. ALEMBICAL puts together four of the most original writers in the field and lets them run. Buy it.\"-- Kristine Kathryn Rusch, Hugo award-winning author of RECOVERY MAN",
  "genres": [
    "Short Stories"
  ],
  "author": "Lawrence M. Schoen",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/5587100-alembical"
}