{
  "title": "Let's Talk Love",
  "description": "The world has fallen in love with The Love Vixen. Whether you’re unhappy in your current relationship, having trouble lowering those walls around your untrusting heart, or needing advice on how to deal with jealousy, the Love Vixen is there for you. This short read is an introduction into the world of The Love Vixen.The Love Vixen began as the author of a simple relationship blog that exploded into an international sensation. She’s often seen on television talk shows offering her expertise, and even on QTC, promoting her bestselling book, Love Like a PB&J Sammie. Watch parties form for her weekly posts. Coffee shops host Love Vixen events, where her podcasts have become social happenings. Water cooler debates over her content are all the rage. Love Vixen memes are everywhere on social media and Love Vixen merch is flooding the market!The Love Vixen’s quirky answers and straight-shooting advice are taking the world by storm. Her platform has blown up, resulting in much reflection from both men and women, opening the lines of communication on those tough relationship subjects.This short read introduces you to the trending phenomenon known as The Love Vixen and kicks off a year of LV books. Eleven amazing authors have been given the rights to develop Love Vixen inspired stories, each based on one of her most liked blog posts and to be released monthly. **Disclaimer: The Love Vixen concept, letters, posts, and advice are works of fiction. The LV is not a licensed doctor or trained professional, or even a real person. The guidance she gives should probably not be followed because everything is made up by the authors. ***Let’s Talk Love introduces you to The Love Vixen and gives you a peek inside her life. The Love Vixen ultimately finds her HEA in December in My Bet’s on Love.Line Up of Love Vixen ReleasesJanuary: Let’s Talk Love – Lizabeth ScottFebruary: Lust or Love - Jeannette WintersMarch: Getting Lucky in Love – Dylann CrushApril: A Warrior to Love – J.M. MaddenMay: Bone Frog Love – Sharon HamiltonJune: One of a Kind Love – Christina TetreaultJuly: Mistaken for Love – Delancey StewartAugust: Silver Lining Love – Melanie ShawnSeptember: Deadline for Love – Jade WebbOctober: Blinded by Love – Reana MaloriNovember: Waiting for Love – Lacey BlackDecember: My Bets on Love – Lizabeth Scott",
  "genres": [
    "Romance",
    "Novella",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Lizabeth Scott",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/55884057-let-s-talk-love"
}