{
  "title": "Antipodes",
  "description": "Antipodes is a unique work of fiction, set in present-day post-apocalyptic Australia. Aimed at young adults who are disillusioned with our world, and concerned for the ecological future of our planet, Antipodes focuses on the values our society lacks-sustainability, inclusion, community and friendship.Cam Mackintosh is in his last year of a science degree at Melbourne University when he is offered the opportunity of a lifetime, the chance to help establish an entirely sustainable community on an island off the coast of Australia following a deadly outbreak. The community is presented with a clean slate; a completely new eco-village, protected from the outside world, but with much of the knowledge and technology of today. The community on August Island thrives and is established on modern values of gender equality and cultural inclusion.In their second year, Will overcomes his personal challenges and finds love with Freyja. Life is idyllic until Freyja goes missing. Will follows her to Scotland using Antipodes, an ancient secret, referenced by many cultures throughout history. There he connects with sustainable community on the island of Lewis, much like his own. Strangers become friends, and he realises he has found his forever home, the place where he is genuinely of the land. His new friends include Fraser, who shares his passion for sustainable agriculture and Laetitia, a psychologist turned teacher with a challenging past. Despite his contentment, his loyalty and commitment to Freyja continue to haunt him, and Will travels outside the protection of the communities in search of Freyja and other communities like theirs.This book will appeal to readers who enjoy the environment-centred work of Margaret Atwood such as Oryx and Crake, or work by Piers Torday, Frank Cottrell Boyce and Sarah Crossan's Breathe.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Dystopia"
  ],
  "author": "T.S. Simons",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/55882613-antipodes"
}