{
  "title": "Belly of the Beast: The Politics of Anti-Fatness as Anti-Blackness",
  "description": "Exploring anti-fatness and anti-Blackness at the intersections of race, police violence, gender identity, fatness, and health.To live in a body both fat and Black is to intersect at the margins of a society that normalizes anti-fatness as anti-Blackness: hyper-policed by state and society, passed over for housing and jobs, and derided and misdiagnosed by medical professionals, fat Black people in the United States are subject to culturally sanctioned discrimination, abuse, and trauma.In Belly of the Beast, author Da’Shaun Harrison–a fat, Black, disabled, and non-binary writer AMAB (assigned male at birth)–offers an incisive, fresh, and precise exploration of anti-fatness as anti-Blackness. Foregrounding the state-sanctioned murder of Eric Garner in a historical analysis of the policing, disenfranchisement, and invisibilizing of fat Black men and trans and nonbinary AMAB people, Harrison discusses the pervasive, insidious ways that anti-fat anti-Blackness shows up in everyday life. Fat people can be legally fired in 49 states for being fat; they’re more likely to be houseless. Fat people die at higher rates from misdiagnosis or non-treatment; fat women are more likely to be sexually assaulted. And at the intersections of fatness, race, disability, and gender identity, these abuses are exacerbated.Taking on desirability politics, f*ckability, healthism, hyper-sexualization, invisibility, and the connections between anti-fatness and police violence, Harrison viscerally and vividly illustrates the myriad harms of anti-fat anti-Blackness–and offers strategies for dismantling denial, unlearning the cultural programming that says “fat is bad,” and moving beyond the world we have now toward one that makes space for the fat and Black.",
  "genres": [
    "Nonfiction",
    "Race",
    "Politics",
    "Social Justice",
    "Audiobook",
    "Queer",
    "Theory"
  ],
  "author": "Da’Shaun Harrison",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/55887785-belly-of-the-beast"
}