{
  "title": "The Memory Keeper",
  "description": "From the USA Today bestselling author of The Summer House comes a story about family bonds, one small town, and a reunion that changes everything.Hannah Townsend’s life is just as she’s always wanted it to be. She has the perfect job at a New York magazine, a small but elegant apartment in the upper west side, and an incredibly successful beau named Miles Monahan. This year, for her thirty-fifth birthday, she’s leaving the icy city sludge for sunshine! She’s got tickets for two to Barbados, and she’s all packed and meeting Miles at the airport for a week of cocktails, sandy beaches, and the music of steel drums. But her life is turned upside down in the span of that one morning. Hannah is rocked by the news that her beloved grandmother is very sick, and Hannah needs to come home to her small Tennessee town right away to be with her family and help run her gran’s dilapidated flower shop. It also means she has to face Ethan Wright, the best friend she’d left behind so many years ago. If that isn’t enough to deal with, she discovers her boyfriend is seeing someone else. With flights grounded and rental cars in great demand due to the winter snowstorm, she’s stranded at the airport. On her birthday, instead of waking up in a stylish beachfront hotel in Miles’s arms like she thought, she finds herself packed like sardines into a car, with two passengers, on a ride-share from LaGuardia Airport to her hometown of Franklin, Tennessee.When everything seems to be going wrong, it’s the kindness of a handsome businessman from Hannah’s past named Liam McGuire that might just save her. But a new development that threatens Gran’s shop and secrets surrounding Liam could alter both their lives forever. A heartwarming, sweet romance that will have you laughing, crying, and best of all, hugging those around you a little tighter. If you loved the Christmas movies based on Jenny’s books and are looking for more feel-good, small town romance, look no further!",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Womens Fiction",
    "Fiction",
    "Roman",
    "Southern"
  ],
  "author": "Jenny  Hale",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/55890490-the-memory-keeper"
}