{
  "title": "The Fall in Love Checklist",
  "description": "The Bucket List meets Rom Com. The Perfect Romance Book for fans of JoJo Moyes, Mhairi McFarlane, and Abby Jimenez. “Sarah Ready is the best kept secret in contemporary romance. Her voice is seasoned, her characters are perfectly flawed and eternally endearing, and she strikes just the right balance between humor, heartbreak and uplifting.” from BookAddictWhat if you made a list of all the crazy things you’ve dreamed of doing, but have been too scared to try…and then did them? Every. Last. One. Unassuming, nice-girl Dany always does what people expect. She keeps her dreams hidden behind boring cardigans and beige upholstery. What does that get her? Dumped by her fiancé and kicked out of her home.Now Dany is going to do the unexpected – survive and thrive.She has a ten step checklist and a sexy new landlord determined to tag along. Suddenly, Dany’s life goes from ordinary to wildly unexpected. But when everything turns upside down again, Dany has to decide, is number ten on her list the end or just the beginning?What readers have said about The Fall In Love Checklist“…my #1 read for 2020, so if you read nothing else that I’ve recommended this year, do not pass up the chance to read this stunning, evocative, heart-wrenching, inspiring story.”\"Hope shines through it all, and makes this a book you will want to read.\" “The Fall in Love Checklist is a superb blending of romcom, contemporary romance, and women's fic.”“Well written, authentic, and filled with heart, I can't wait to see more from this author.” “Great Book. This book was a fun read. I was hooked from the beginning and I couldn’t put it down.”“I just read a few pages and I am in love.”“This book was definitely worth the read. It’s funny, sexy, and swoon worthy! I couldn’t put it down! I can’t wait for Sarah’s next book!”“…this is just a wholesome story. I was rooting for every single one of them.”“The story catches you from the first paragraph and you immediately want to read more. The characters are very likable and you start rooting for them from the start.”“Umm Wow, just Wow… Sarah Ready has written a beautiful story about a woman finding love, friends and herself along the way.”“Wow! What an emotional and beautiful story! …I loved this story; you do not want to miss it!!”“Well written, authentic, and filled with heart, I can't wait to see more from this author.”“If you’re looking for a story that has the power to really move you then this is the one for you.”“This is the first book I have read by this author and it certainly won’t be the last because Sarah Ready has given us a story that’s",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary Romance"
  ],
  "author": "Sarah Ready",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/55884809-the-fall-in-love-checklist"
}