{
  "title": "New Ground",
  "description": "The thing about being in the public eye since birth, is that everyone thinks they know me. They don’t. They don’t know that the public smiles hide private threats to toe the family line. The pro-reg supporters who sent my father to public office hate me. To them, I’m Henry, the deviant who took away their voice. Psions don’t trust me. I’m an Anselm, and our family has done more to fight against psion rights than any other single entity. I get that. I never asked for it, but I understand their distrust. Telepathy sucks when you live with people who hate what you are. If I could figure out how to leave, I would. But Father took a huge career risk in publicly embracing me as a psion, so he planned to wring every possible benefit out of my abilities. That’s where Will, my professional anchor, enters the picture. My family’s wealth pays for his services. When my telepathy proved unstable, I needed a link with an anchor to regain control. How else could I get all the dirt on Father’s rivals? For the right price, Will overlooks the name signed on his paycheck. His link keeps my telepathy stable. He changes my entire world when he invites me home to meet his long-time lover, Dana. Together they show me there’s more to life than obedience to my family’s whims. Their love might just make me brave enough to choose my own path. Except, as Father often reminds me, the Anselm family has money—I don’t. If I step out of line, then I risk losing Will and Dana. My anchor. The only people who touch me. Talk to me. Treat me like I matter. I’d do anything for them, even let them go. New Ground is a M/M/NB (genderqueer) romance with political intrigue, psychic powers, intense mental connections, light Daddy kink with a slightly spoilt boy, some chastity play, a slight age gap (7 years), and a polyamorous relationship with long-time lovers welcoming in a new third partner. There is mention of past trauma including infant loss, abusive/neglectful parents, homelessness, and nonconsensual recording of sex tapes.",
  "genres": [],
  "author": "Alex  Silver",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/55890842-new-ground"
}