{
  "title": "The Ice Swan",
  "description": "Amid the violent last days of the glittering Russian monarchy, a princess on the run finds her heart where she least expects it.1917, Petrograd. Fleeing the murderous flames of the Russian Revolution, Princess Svetlana Dalsky hopes to find safety in Paris with her mother and sister. But the city is buckling under the weight of the Great War, and the Bolsheviks will not rest until they have erased every Russian aristocrat from memory. Svetlana and her family are forced into hiding in Paris’s underbelly, with little to their name but the jewels they sewed into their corsets before their terrifying escape.Born the second son of a Scottish duke, the only title Wynn MacCallan cares for is that of surgeon. Putting his talents with a scalpel to good use in the hospitals in Paris, Wynn pushes the boundaries of medical science to give his patients the best care possible. After treating Svetlana for a minor injury, he is pulled into a world of decaying imperial glitter. Intrigued by this mysterious, cold, and beautiful woman, Wynn follows Svetlana to an underground Russian club where drink, dance, and questionable dealings collide on bubbles of vodka.Out of money and options, Svetlana agrees to a marriage of convenience with the handsome and brilliant Wynn, who will protect her and pay off her family’s debts. It’s the right thing for a good man to do, but Wynn cannot help hoping the marriage will turn into one of true affection. When Wynn’s life takes an unexpected turn, so does Svetlana’s—and soon Paris becomes as dangerous as Petrograd. And as the Bolsheviks chase them to Scotland, Wynn and Svetlana begin to wonder if they will ever be able to outrun the love they are beginning to feel for one another.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical",
    "Russia",
    "Fiction",
    "Historical Romance",
    "Christian Fiction"
  ],
  "author": "J'nell Ciesielski",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/55918636-the-ice-swan"
}