{
  "title": "I Know What You're Thinking: Using the Four Codes of Reading People to Improve Your Life",
  "description": "\"A practical and savvy guide.\"-- Gavin de Becker, #1 New York Times bestselling author of The Gift of Fear \"Understanding nonverbal language is the essential skill in any profession that involves communication. This book is the best primer on the topic of nonverbal communication I have ever read.\"-- Geoffrey N. Fieger, noted trial attorney \"As a regular contributor to and commentator on Court TV, Dr. Lillian Glass has repeatedly demonstrated her exceptional professional skills of reading people in our on-air coverage of several trials. In this book, she shares with readers these skills, which could prove to be invaluable in every aspect of your life.\"-- Nancy Grace, Court TV \"A must-read for everyone, whether they are in business or not. Applause to Dr. Glass for giving the public such an important work.\"-- Arnold Kopelson, motion picture producer Knowing how to read people-- picking up on and interpreting their hidden cues-- is a tremendous asset for virtually anything you do. In I Know What You're Thinking, psychologist, bestselling author, and communications expert Dr. Lillian Glass helps you develop a tremendous new set of skills that will make you more perceptive, more powerful, and more successful. As she has done for her numerous clients, Dr. Glass shows you-- step by step-- how to gain the power to know the truth about people. Through simple quizzes and easy-to-follow exercises, you'll learn to improve your judgment of others and make better decisions while projecting confidence, sincerity, and strength. With this fun, down-to-earth guide, you'll be able to look anyone in the eye with a quiet self-assurance that says I Know What You're Thinking.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Social Science",
    "Education"
  ],
  "author": "Lillian Glass",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/559058.I_Know_What_You_re_Thinking"
}