{
  "title": "Callsign: Rook (Stan Tremblay)",
  "description": "After a failed mission claims the lives of his five man support team, Stan Tremblay, Rook, flees Siberia and finds himself on the secluded coast of Norway, north of the Arctic Circle. Exhausted, cut off from the outside world, and emotionally beaten from his defeat in Russia, Rook just wants to find a place to rest. The small coastal town of Fenris Kystby seems like the perfect place.Within hours of arriving, he discovers that the town is not as tranquil as it appears. The townspeople are mistrustful of outsiders, a pack of mysterious wolves stalk the local tundra, and two villagers have been killed by a creature that defies explanation. To make things worse, there are rumors of something sinister, something the townspeople refuse to discuss.Despite the hostility of the locals, Rook commits to stopping the creature murdering townspeople. As the body count rises, he quickly learns that the greatest threat might walk on two legs. And when he uncovers the town's hidden past, Rook knows only one thing for something is rotten in Norway.THE CALLSIGN Rook (27,000 words) is the third in a series of Chess Team novellas being released in 2011. Each of the six books follows a single member of the team and are titled for them; Queen, Knight, etc, and are co-authored by Jeremy Robinson and six other fantastic authors. The stories take place after the events of THRESHOLD, the third Jack Sigler thriller, but are designed to introduce readers to the series. If you haven't read the novels, no worries. Enjoy the ride!PRAISE FOR ROBINSON\"There's nothing timid about Robinson as he drops his readers off the cliff without a parachute and somehow manages to catch us an inch or two from doom.\" -- Jeff Long, New York Times bestselling author of THE DESCENT\"Greek myth and biotechnology collide in Robinson's first in a new thriller series to feature the Chess Team... Robinson will have readers turning the pages...\" -- Publisher's Weekly\"Jeremy Robinson’s THRESHOLD is one hell of a thriller, wildly imaginative and diabolical, which combines ancient legends and modern science into a non-stop action ride that will keep you turning the pages until the wee hours. Relentlessly gripping from start to finish, don’t turn your back on this book!\" -- Douglas Preston, NY Times bestselling author of IMPACT and BLASPHEMY\"Jeremy Robinson is an original and exciting voice.\" -- Steve Berry, NY Times bestselling author of THE EMPEROR'S TOMB\"Jeremy Robinson is a fresh new face in adventure writing and will make a mark in suspense for years to come.\" --David Lynn Golemon, NY Times bestselling author of LEGEND and EVENT PRAISE FOR TALBOT“2012: The Fifth World shows what happens when myth, faith, and science collide. The result is a gripping page-turner that doesn't let up until the very world is pushed to the brink of destruction.”-- Michael Wallace, top 20 Amazon bestselling author of THE RIGHTEOUS.\"Edward G. Talbot expertly blends ancient mystery with modern thriller. The end result is a book you won't be able to put down until you've turned the final page!\"-- DAVID WOOD, author of QUEST and CIBOLA\"NEW WORLD ORDERS will make you question everything you have ever been told by the system..it will suck you in from the very beginning and linger long in your thoughts after you finish the last page.\"-- James Melzer, author of HULL'S LANDING and ESCAPE",
  "genres": [
    "Thriller",
    "Adventure",
    "Fiction",
    "Action",
    "Science Fiction",
    "Military Fiction",
    "Novella"
  ],
  "author": "Jeremy Robinson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/12693230-callsign"
}