{
  "title": "Mr. Black",
  "description": "Was it a teenage crush, love at first sight, or just pure and simple lust? It was only one weekend and he walked away claiming that if the stars aligned, fate would bring us back together someday.Fast forward fifteen years, he's back and his sights are set on me.Jordan:My eyes flit around the room and land on a pair of brilliant blue eyes that are staring back at me. The man who they belong to is gorgeous, tall, tanned, sex on legs. His bright blue eyes are focused on mine like two laser beams. His lips, which are full beautiful lips, quirk up at the sides as he tips his glass my way. His strides are long and calculated. A panther on the prowl hunting and I am the prey. It's him, Darian Black, my first love, my obsession, the man who haunts my wet dreams. \"Do you know who I am?\" He whispers into my ear, sending shivers down my spine.Darian:I saw her as soon as she walked into the room: Jordan Sinclair, the girl I walked away from fifteen years ago. Only now, she's no longer a girl. I can't take my god damned eyes off her. She stands out like she has a spotlight on her, an angel from heaven sent down just for me. She stops in her tracks when she sees me, standing there nibbling on her bottom lip, making me want to pull it out and suck on it. Uncertainty is written all over her beautiful face. The light catches on the soft tendrils of her honey blond hair, her huge eyes are like pools of molten chocolate as she stares back at me. She has a special glow to her that is unmatched by anyone else around her. As I stare at her in that moment, I can honestly say she is the most beautiful woman I have ever seen. \"Mine,\" I think to myself as I stride towards her. It's not over, we have a lot of time to make up for and I'm a selfish bastard.Unfortunately for us, there is a terrorist out there. He also wants her and will stop at nothing in order to make her his.",
  "genres": [
    "Second Chance",
    "Thriller",
    "Romance"
  ],
  "author": "Nancy  Brown",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/55919628-mr-black"
}