{
  "title": "The Profession: A Memoir of Community, Race, and the Arc of Policing in America",
  "description": "“Engaging. . . a remarkably candid account. . . Succeeding as a centrist in public life these days can be an almost impossible task. But centrism in law enforcement may be the most delicate challenge of all. Bratton’s ability to practice it was a startling phenomenon.” – New York Times Book ReviewThe epic, transformative career of Bill Bratton, legendary police commissioner and police reformer, in Boston, Los Angeles, and New YorkWhen Bill Bratton became a Boston street cop after his return from serving in Vietnam, he was dismayed by the corrupt old guard, and it is fair to say the old guard was dismayed by him, too. But his success fighting crime could not be denied. Propelled by extraordinary results, Bratton had a dazzling rise, and ultimately a dazzling career, becoming the most famous police commissioner of modern times. The Profession is the story of that career in full.Everywhere he went, Bratton slashed crime rates and professionalized the vocation of the cop. He and his team created the revolutionary program CompStat, the Big Bang of modern data-driven policing. But his career has not been without controversy, and central to the reckoning of The Profession is the fundamental crisis of relations between the Black community and law enforcement; a crisis he now believes has been inflamed by the unforeseen consequences of some well-intentioned policies. Building trust between a police force and the community it is sworn to protect is in many ways, Bratton argues, the first task--without genuine trust in law enforcement to do what is right, little else is possible.The Profession is both a searching examination of the path of policing over the past fifty years, for good and also for ill, and a master class in transformative leadership. Bill Bratton was never brought into a police department to maintain the status quo; wherever he went--from Boston in the '80s to the New York Police Department in the '90s to Los Angeles after the beating of Rodney King to New York again in the era of unchecked stop-and-frisk--root-and-branch reinvention was the order of the day and he met the challenge. There are few other positions on Earth in which life-and-death stakes combine with intense public scrutiny and turbulent political crosswinds as they do for the police chief of a major American city, even more so after counterterrorism entered the mix in the twenty-first century. Now more than ever, when the role of the police in society is under a microscope like never before, Bill Bratton's authority on the subject of improving law enforcement is profoundly useful. A riveting combination of cop stories and community involvement, The Profession presents not only a fascinating and colorful life at the heights of law-enforcement leadership, but the vision for the future of American policing that we sorely need.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Politics",
    "Biography Memoir",
    "Crime",
    "Sociology",
    "True Crime"
  ],
  "author": "Bill Bratton",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/55920279-the-profession"
}