{
  "title": "The Art of Alice and Martin Provensen",
  "description": "The Art of Alice and Martin Provensen  is the first-ever monograph on the award-winning midcentury husband-and-wife illustration team behind more than 40 beloved children's books.Renowned husband-and-wife illustrators Alice and Martin Provensen created dozens of beloved children's books over the span of seven decades, many of which appeared on the  New York Times  Best Illustrated Books of the Year lists. The Art of Alice and Martin Provensen  showcases hundreds of their well-known illustrations, as well as many never-before-seen paintings, drawings, and exquisite sketchbooks from their travels around the world.Original paintings for their beloved classics—from  A Child's Garden of Verses (1951) and The Iliad and the Odyssey (1959) to  Myths and Legends (1960) and many others—are beautifully reproduced here. This comprehensive volume is a treasure trove for children, designers, illustrators, historians, and all who cherish classic children's books.ICONIC CLASSICS OF CHILDREN'S From early favorites for Golden Books such as 1949's The Color Kittens  by Margaret Wise Brown to their 1983 Caldecott-winning title  The Glorious Across the Channel  with Louis Bleriot, the Provensens' legendary visual style has inspired generations of young readers and modern illustrators alike.A PEEK INSIDE THE LIVES OF INFLUENTIAL An interview with Alice and Martin's daughter Karen Provensen Mitchell illuminates their life and career and includes many personal photographs, quotes, speeches, and memorabilia from their archive. An introduction by Leonard S. Marcus, a leading historian in children's literature, underscores the Provensens' importance and influence as illustrators and authors. Additionally, noted publisher and close family friend Robert Gottlieb provides a personal essay that shares many of his memories with this cherished couple.5-STAR REVIEWS FROM AMAZON Readers celebrate the sheer joy of this gorgeous book, calling it a must have and noting that every page is a \"beautiful stunner.\" It showcases the \"impeccable style and brilliant technique of two of the most important illustrators in the world,” says one review. Another notes what a beautiful gift it is for any fan of the Provensens' art \"or any art or illustration lover in general.\"Perfect",
  "genres": [
    "Art",
    "Nonfiction",
    "Biography",
    "Childrens",
    "Adult"
  ],
  "author": "Alice Provensen",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/55922081-the-art-of-alice-and-martin-provensen"
}