{
  "title": "In Polite Company",
  "description": "“This terrific debut lifts the veil on the charming old city of Charleston and a prominent Lowcountry family to deliver an entertaining story about becoming yourself without totally rejecting your past. Plus: debutante balls! I love this novel.” —Lauren Weisberger, #1 New York Times bestselling author of The Devil Wears Prada and When Life Gives You LululemonsA captivating debut novel that looks inside the private lives of Charleston aristocracy, where a former debutante learns that sometimes good behavior leads to bad decisions.Tourists think they see the real Charleston, but Simons Smythe knows there’s more to her hometown than sweet tea and Southern hospitality. Behind the walled gardens, inside the fabled historic homes, live Charleston’s elite. Simons was born into this powerful aristocracy that has quietly ruled the city for centuries.Simons’s family has a banner year ahead; Her older sister will give birth to her second child, and her younger sister will make her debut—a series of cocktail parties and balls to introduce her to society. And in one year, Simons plans to marry Trip. She hopes that’s enough time to fall back in love.Simons produces the news at a local TV station, a job that increasingly tests her loyalty to her family and friends. On her days off, Simons surfs the waves of Folly Beach, crabs the salty rivers of Edisto Island, and follows her wayward heart to King Street bars. The one touchstone in this confusing time is her elegant and secretive grandmother, Laudie, who—repeatedly and mysteriously—urges Simons to “be brave”.In this sparkling novel, Simons unlocks riddles from the past, flirts with a new future, and discovers that some rules are made to be broken.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Southern",
    "Chick Lit",
    "Audiobook",
    "Womens Fiction"
  ],
  "author": "Gervais Hagerty",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/55921514-in-polite-company"
}