{
  "title": "Alfie Goes to Thailand",
  "description": "A story of human challenge, manipulation, rejection, abuse, and a search for peace.​If you like thought-provoking drama, romantic tragedies, and damaged characters, then you’ll love the tropical sauna and wry humour of POST- IT NOTES and the other books in the series.Starved of love and affection for far too long, it now comes at Alfie from all sides. When you are led to the well after a long drought, the temptation to drink the well dry is powerful. Alfie's adventures hot up, as a conniving Mother and her wicked daughters, plot his downfall. The dangers are exacerbated by crooked builders, and rogue property traders, exposing him to a hair-raising ride through Thailand. There are shades of David Copperfield just when he thinks he's landed safely...Post-it notes stuck on the fridge door are constant reminders of a period Alfie wants to forget. But he can’t resist a challenge, even if it has the potential to destroy him. Has Alfie taken on more than he can handle? Only time will tell.In the poor, hot and dusty North-East of Thailand Alfie Mynn, a South African businessman, has all but finished building a house for his partner Nin. But will her mother’s evil plot bring the family down. Can Mother use her daughter’s misplaced loyalty and the law, to ruin Nin and Alfie? The worst and the best elements of the human condition are reflected in the characters.Like a butterfly, Alfie finds himself, fragile and delicate, flitting around, looking for a soft place to land and settle down. The constant nightmares have become real, and now the ghost of Nin is haunting him.A deep sadness washes over him, and with a heart heavier than the leaden skies that came with the day, he takes the decision. He will not give up on Thailand. He will go on a journey of recovery. A journey that leaves him with no options.He buckles up and drives away, with no plan, just an open heart and an empty mind, a man with no identity other than for official purposes.Just when he thinks he has succeeded, and his journey is over, a shocking event and a quirk of fate take him to a place he could never have imagined existed.Will he recover, or he will end up as another statistic of abuse?Can Alfie save himself or is it too late?",
  "genres": [],
  "author": "James   King",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/55924303-alfie-goes-to-thailand"
}