{
  "title": "The View Was Exhausting",
  "description": "Faking a love story is a whole lot easier than being in love . . .The world can see that international A-list actress Whitman (\"Win\") Tagore and jet-setting playboy Leo Milanowski are made for each other. Their kisses start Twitter trends and their fights break the internet. From red carpet appearances to Met Gala mishaps, their on-again, off-again romance has titillated the public and the press for almost a decade. But it's all a lie.As a woman of color, Win knows the Hollywood deck is stacked against her, so she's perfected the art of controlling her public persona. Whenever she nears scandal, she calls in Leo, with his endearingly reckless attitude, for a staged date. Each public display of affection shifts the headlines back in Win's favor, and Leo uses the good press to draw attention away from his dysfunctional family. Pretending to be in a passionate romance is one thing, but Win knows that a real relationship would lead to nothing but trouble. So instead they settle for friendship, with a side of sky-rocketing chemistry. Except this time, on the French Riviera, something is off. A shocking secret in Leo's past sets Win's personal and professional lives on a catastrophic collision course. Behind the scenes of their yacht-trips and PDA, the world's favorite couple is at each other's throats. Now they must finally confront the many truths and lies of their relationship, and Win is forced to consider what is more important: a rising career, or a risky shot at real love?The View Was Exhausting is a funny, wickedly observant modern love story set against the backdrop of exotic locales and the realities of being a woman of color in a world run by men.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Adult",
    "Chick Lit",
    "Adult Fiction"
  ],
  "author": "Mikaella  Clements",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/55898102-the-view-was-exhausting"
}