{
  "title": "Facing the Mountain: A True Story of Japanese American Heroes in World War II",
  "description": "From the #1 New York Times bestselling author of The Boys in the Boat, a gripping World War II saga of patriotism and courage: the special Japanese-American Army unit that overcame brutal odds in Europe; their families, incarcerated back home; and a young man who refused to surrender his constitutional rights, even if it meant imprisonment.They came from across the continent and Hawaii. Their parents taught them to embrace both their Japanese heritage and the ways of their American homeland. They faced bigotry, yet they believed in their bright futures as American citizens. But within days of Pearl Harbor, the FBI was ransacking their houses and locking up their fathers. And within months many would themselves be living behind barbed wire.Facing the Mountain is an unforgettable chronicle of war-time America and the battlefields of Europe. Based on Daniel James Brown's extensive interviews with the families of the protagonists as well as deep archival research, it portrays the kaleidoscopic journey of four Japanese-American families and their sons, who volunteered for 442nd Regimental Combat Team and were deployed to France, Germany, and Italy, where they were asked to do the near impossible.But this is more than a war story. Brown also tells the story of these soldiers' parents, immigrants who were forced to shutter the businesses, surrender their homes, and submit to life in concentration camps on U.S. soil. Woven throughout is the chronicle of a brave young man, one of a cadre of patriotic resisters who stood up against their government in defense of their own rights. Whether fighting on battlefields or in courtrooms, these were Americans under unprecedented strain, doing what Americans do best--striving, resisting, pushing back, rising up, standing on principle, laying down their lives, and enduring.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Audiobook",
    "Book Club",
    "Historical"
  ],
  "author": "Daniel James Brown",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/55920278-facing-the-mountain"
}