{
  "title": "The Mulberry Empire",
  "description": "In the spring of 1839, some fifty thousand British forces entered Afghanistan with “the full pomp of Empire,” possessed of the certainty that they would replace the Amir with someone less hostile toward their ally, the King of the Punjab. Three years later, a single British horseman rode out of the Afghan mountains into India—the sole survivor of the original vast contingent. The Mulberry Empire is the magnificently told story of this conflict—of the events that surrounded it, of the politics and people on both sides, of the passions and pride that led to the destruction of the British and the triumph of the Afghans.At the center: Alexander Burnes—a British explorer who ventures into the fabled city of Kabul, befriends the all-powerful Amir, and returns to England a hero. The bearer of amazing stories, he is unwitting emissary to and from both nations, neither of which can see how his impressions will change their worlds. And there is Bella Garraway, whose upper-class, predictable life will be wholly undone—leaving her with nothing, and then everything—when her path crosses Burnes’s. Around them, a superbly wrought cast of characters: English, Russian, Indian, Afghan, Persian—a shifting universe of men and women, the powerful and the pawns, caught in a vortex of history.Spanning a decade and moving between London and Calcutta, St. Petersburg and Kabul, The Mulberry Empire is a brilliant synthesis of fact and imagination, as rich in the details of history and place as it is in the complexities and drama of human nature. It is an unexpectedly timely, masterful novel of fidelity and dreams, belief and chance, an epic of empires built and lost, and built again.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "India",
    "21st Century",
    "Asia",
    "Historical",
    "Novels"
  ],
  "author": "Philip Hensher",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/559107.The_Mulberry_Empire"
}