{
  "title": "The Cold Vanish: Seeking the Missing in North America's Wilderness",
  "description": "The critically acclaimed author and journalist Jon Billman's fascinating, in-depth look at people who vanish in the wilderness without a trace and those eccentric, determined characters who try to find them. These are the stories that defy conventional logic. The proverbial vanished without a trace incidences, which happen a lot more (and a lot closer to your backyard) than almost anyone thinks. These are the missing whose situations are the hardest on loved ones left behind. The cases that are an embarrassment for park superintendents, rangers and law enforcement charged with Search & Rescue. The ones that baffle the volunteers who comb the mountains, woods and badlands. The stories that should give you pause every time you venture outdoors.Through Jacob Gray's disappearance in Olympic National Park, and his father Randy Gray who left his life to search for him, we will learn about what happens when someone goes missing. Braided around the core will be the stories of the characters who fill the vacuum created by a vanished human being. We'll meet eccentric bloodhound-handler Duff and R.C., his flagship purebred, who began trailing with the family dog after his brother vanished in the San Gabriel Mountains. And there's Michael Neiger North America's foremost backcountry Search & Rescue expert and self-described \"bushman\" obsessed with missing persons. And top researcher of persons missing on public wildlands Ex-San Jose, California detective David Paulides who is also one of the world's foremost Bigfoot researchers. It's a tricky thing to write about missing persons because the story is the absence of someone. A void. The person at the heart of the story is thinner than a smoke ring, invisible as someone else's memory. The bones you dig up are most often metaphorical. While much of the book will embrace memory and faulty memory -- history -- The Cold Vanish is at its core a story of now and tomorrow. Someone will vanish in the wild tomorrow. These are the people who will go looking.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Mystery",
    "Nature",
    "History",
    "Audiobook",
    "Crime"
  ],
  "author": "Jon Billman",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/55921896-the-cold-vanish"
}