{
  "title": "The Segonian",
  "description": "New York Times bestselling author Dianne Duvall brings readers the second stand-alone novel in a thrilling new sci-fi romance series full of action, humor, and happily-ever-afters. Eliana’s life has never been what one might term ordinary. At least, it hasn’t been for a very long time. As a powerful Immortal Guardian, she spends her nights hunting and slaying psychotic vampires that most of humanity doesn’t even realize exist. Then an opportunity arises that instantly makes her extraordinary existence seem downright boring. The leader of the Immortal Guardians asks her to guard a group of mortals who are embarking upon a voyage across the galaxy to the planet Lasara. How could she possibly say no? In no time at all, Eliana is hurtling through space on board a Lasaran battleship and getting to know not one but two alien races. It’s the most exciting adventure of her long life… until the ship is unexpectedly attacked. Amid the chaos and destruction that follow, she valiantly helps everyone she can before an explosion renders her unconscious. When Eliana awakens, she finds herself alone, floating in space, clad only in a spacesuit, with no ship in sight. Alone—that is—except for the warm, deep voice that carries over the comm in her helmet. Commander Dagon and the crew of the Segonian battleship Ranasura respond to a distress call from their Lasaran allies and join a massive Alliance-wide search-and-rescue mission. He quickly achieves communication with a lone Earthling female and races toward her. Every time they speak, his fascination with her grows and he becomes more desperate to reach her before her oxygen supply runs out. Her strength, bravery, and humor entice him, even more so when she defies all odds and they meet in person. As he and Eliana embark upon a quest to find her missing friends, a bond swiftly grows between them that deepens with every laugh and smile and tender touch they share. But they are not the only ones searching for Earthling survivors. When Eliana herself becomes the hunted and their enemies begin to close in, can the two of them fight their way to victory, or will their enemies take everything? What Readers & Reviewers Are Saying About The Aldebarian Alliance \"Full of adventures, sizzling passion, romance and yes kick-ass fighting... I devoured it in one seating.\"--Book Dragon \"Intense, addictive and brilliant... I want more and frankly; I want it now!\"--Caffeinated Reviewer \"I can't express enough how gripping this story was. This could be a movie!\"--Obsessive Reading Disorder \"Dianne Duvall once again weaves her magic giving us a tale filled with excitement, romance and introducing us to new friends in a galaxy far away. Everything about this story was amazing.\"--eBook Obsessed \"The Lasaran has everything I love about the Immortal Guardians snappy dialogue, action, humor, steaminess, and paranormal elements, but now I can add space travel. Booyah!\"\"--I'm a Voracious Reader \"I got exactly what I was expecting from this a thrilling, action-packed, sometimes funny romance that happens to include a hot dude from space... I highly recommend.\"--Romance Rehab \"Another great read by one of my favorite authors. This is a great start to a new series. Fast paced, with action, adventure and romance\"--Seeing Spots \"I definitely can't wait for more . . . Full of action and a sweet unusual love story.\"--Read All About It",
  "genres": [
    "Romance",
    "Science Fiction",
    "Paranormal",
    "Aliens",
    "Audiobook",
    "Vampires",
    "Fantasy"
  ],
  "author": "Dianne Duvall",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/55937921-the-segonian"
}