{
  "title": "What If You & Me",
  "description": "New York Times and USA Today bestseller Roni Loren blends heat and heart in this emotionally charged story A frightened woman longing to break freeA wounded man searching for his purposeAn unexpected friendship turned sizzling hot connectionAnd an emotional climax that'll have them both learning to let goThe world can be a scary place. At least, that's what Andi Lockley's anxiety wants her to believe. It doesn't help that she narrowly escaped a dangerous man years ago, or that every relationship since has been colored with that lingering fear. But things are better now—she's channeling everything into her career as a horror novelist and true crime podcaster, and her next book may be the breakthrough she needs.If only her grumpy new neighbor would stop stomping around at all hours of the night.Former firefighter Hill Dawson can't sleep. After losing part of his leg in a rescue gone wrong, he's now stuck in limbo. He needs to figure out what he's supposed to do with his life, and he can't let himself get distracted by the pretty redhead next door. But when someone breaks into Andi's place, Hill can't stop himself from rushing in to play the hero. Soon, a tentative bond forms between the unlikely pair. But what starts out as a neighborly exchange quickly turns into the chance for so much more...if Andi can learn to put aside her fear and trust in herself—and love—again.Readers Rave About Books By Roni \"Phenomenal.\"—LORELEI JAMES, New York Times and USA Today bestselling author\"Unforgettable.\"—KRISTEN CALLIHAN, New York Times and USA Today bestselling author\"Unique, swoony, and lively.\"—SARINA BOWEN, USA Today bestselling author\"Don't let this book get away!\"—M. O'KEEFE, USA Today bestselling author\"A must-read.\"—Publishers Weekly STARRED Review for The One You Fight For",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook",
    "Fiction",
    "Adult",
    "Mental Health"
  ],
  "author": "Roni Loren",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/55942717-what-if-you-me"
}