{
  "title": "The Benefit and The Burden: Tax Reform-Why We Need It and What It Will Take",
  "description": "A spirited and insightful examination of the need for American tax reform—arguably the most overdue political debate facing the nation—from one of the most legendary political thinkers, advisers, and writers of our time.A thoughtful and surprising argument for American tax reform, arguably the most overdue political debate facing the nation, from one of the most respected political and economic thinkers, advisers, and writers of our time.The United States Tax Code has undergone no serious reform since 1986. Since then, loopholes, exemptions, credits, and deductions have distorted its clarity, increased its inequity, and frustrated our ability to govern ourselves.At its core, any tax system is in place to raise the revenue needed to pay the government’s bills. But where that revenue should come from raises crucial Should our tax code be progressive, with the wealthier paying more than the poor, and if so, to what extent? Should we tax income or consumption or both? Of the various ideas proposed by economists and politicians—from tax increases to tax cuts, from a VAT to a Fair Tax—what will work and won’t? By tracing the history of our own tax system and by assessing the way other countries have solved similar problems, Bartlett explores the surprising answers to all of these questions, giving a sense of the tax code’s many benefits—and its inevitable burdens.Tax reform will be a major issue debated in the years ahead. Growing budget deficits and the expiration of various tax cuts loom. Reform, once a philosophical dilemma, is turning into a practical crisis. By framing the various tax philosophies that dominate the debate, Bartlett explores the distributional, technical, and political advantages and costs of the various proposals and ideas that will come to dominate America’s political conversation in the years to come.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Economics",
    "Taxation",
    "History",
    "American History",
    "Business"
  ],
  "author": "Bruce Bartlett",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/12694000-the-benefit-and-the-burden"
}