{
  "title": "The Masters M.C.: Riding Into Heaven & Back Into Hell",
  "description": "This is a boxset/collection of the Masters M.C. series and includes Riding Into Heaven-Origin/Prequel Property Of Beautiful Insanity F.T.W. (Fu@k the World) G.F.Y. (Go Fu@k Yourself) This book contains strong and unfiltered language, violence, possible triggers, adult situations, BDSM, M/M, and MMf. The completion of this series continues directly into the Malevolent MC #1 Corral Me (the series name is only changed due to the club patching over to the Malevolent MC. The characters and established story lines will continue. Colt Daniels and Kash Kendrick were raised in two separate 1% clubs founded by their fathers. They were expected to go on to lead those clubs. When they were sent to work as bouncers at a BDSM club those plans changed drastically. They left the outlaw life and rode into their own version of Heaven. Unfortunately, Heaven didn't last and they found themselves on a bloody track back to Hell. Colt I'm a tough as nails Brooklyn native who was raised in a 1% club. Never in my life did I think I'd be anything except the national president of the Malevolent MC. When I found out about the BDSM lifestyle my life path took an abrupt turn. Kash and I started our own club and closed the door on the outlaw life. A few years later I met a sassy and fiery girl from Louisiana and decided to make her mine. Tuesday Grace has been a challenge from day one, but she's my ol' lady, my slave, and my entire world. I never realized how true that was until the day I almost lost her. I should've known the outlaw in me was never going to die. After that day he was wide awake and out for blood. It was just a matter of time before that abrupt turn took me back to my roots. Kash I was on a one way track back to prison and it didn't seem there was any way to change that. I'm violent and sadistic and that night I took it too far. When I showed up in that hole called NYC Colt gave me the chance to change. Our idea about a BDSM MC was possible, and The Bishop taught us how to do it right. He also helped me realize I could find the right piece of my dark puzzle. When I met Tuesday's sister Barely I knew exactly why they say dynamite comes in small packages. She is my perfect match. She gives me a way to let my sadistic side run wild, but that beast is who I am. I left the outlaw life, but the outlaw never left me. It wouldn't have taken much to make me take that baby step and cross back over the line. What happened was monstrous and Colt and I jumped back over with both boots blazin’. Sundown I was taken away from my tribe by my old man because I’m a half-breed and they didn’t want me around. He decided to raise me in his club—the Malevolent MC—and I’ve been in chapters all over the country. I didn’t find a home until I met Colt and Kash and I’ve killed and would die for them. When all Hell broke loose, I stepped up and got my hands just as bloody as theirs. It wasn’t my fight, but it became my mission. Colt’s old man Redhook—the founder of the club—calls us the Malevolent Musketeers. We take no prisoners, just the cuts of our enemies, and they’re a dying breed.",
  "genres": [],
  "author": "B.B. Blaque",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/55937937-the-masters-m-c"
}