{
  "title": "Christmas Naturally Collection",
  "description": "Seven unforgettable hometown holiday stories brimming with heartwarming heroines, swoon-worthy heroes, new and old traditions that sparkle like tinsel in this peppermint-kissed Christmas boxset.\nChristmas Reflections\n by Joanne JaytanieShe's come home to open her own business. He's on the quest to advance his career. Neither will achieve their goals if they refuse to work together.Juliet is a hometown girl, and Colton is a big city guy. Will he squash her dream of turning the 100-year old Christmas tree farm into a year-round destination? Or risk his career by revealing a family secret that could save Forever Christmas tree farm.\nChristmas Ivy\n by Joanne JaytanieShe's a survivor. He's a bone-weary surgeon. Can this damaged artistic soul and frazzled do-gooder find serenity together in a small town?Ivy's struggled to succeed her entire life. Mason is a surgeon who can't say no. Their fast-paced lives are eroding their spirits. And both are searching for a place to call home. Worlds apart, will they discover the love they seek in Glenville?\nChristmas Chemistry\n by Joanne JaytanieChemistry and Christmas draw them together, but family loyalty could keep them on opposing sides.It's nothing but an old tavern. But to the Jamersons and Brocks, it's a treasured history, a precious legacy. Can Gina Jamerson and Owen Brock meet in the middle or will their families ruin any chance of compromise?\nChristmas at the Aloha Cafe\n by Jacquolyn McMurrayA heroine fixated on Christmas lawn decorations and a hero oblivious to his wife's shenanigans.When Noelani's obsession to defeat her nemesis for the \"Best Christmas Lawn Display\" trophy steals her holiday joy, the most unlikely person offers to assist her--her rival's husband. Will that partnership help or hinder Noelani's efforts to recover her joy?\nAlways on Christmas\n by Jacquolyn McMurrayIf you like uplifting holiday stories, fiercely independent single moms, and kind-hearted cowboys, then you'll love this inspirational romance.When Emma Sanchez inherits a cabin in Hawai'i, it's a fresh start for her young daughter and herself. Determined to raise Ally without a man, Emma's resolve is tested when disaster strikes, and a generous cowboy offers support.\nSecond Chances\n by Grace AugustineIf you like the strength of family, the bond of friendship, and second chances, you'll love Grace Augustine's romance.Single fatherhood was not his life's plan. A generation later, his daughter vows to not repeat her mother's mistakes. Can father and daughter let go of the past and open their hearts to love?\nCounting on Christmas\n by Lexa FisherShe's resolved to conquer the ghost of Christmas past. He's dreading another lonely Christmas. Can they trust enough to make the holidays shine brightly?Mary Ellis faces a cold holiday without a furnace repairman. Chris Storey has what it takes to warm her hearth and heart. Will surprise visits by her corrupt nemesis and his drunk ex-wife leave them both out in the cold this holiday season?",
  "genres": [
    "Christmas",
    "Anthologies",
    "Romance",
    "Contemporary"
  ],
  "author": "Joanne Jaytanie",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/55931467-christmas-naturally-collection"
}