{
  "title": "The Lion Throne",
  "description": "The last two novels in Jennifer Roberson’s dynastic fantasy epic Chronicles of Cheysuli , now available in an omnibus edition.In Flight of the Raven : Aidan, only child of Brennan and Aileen, is heir to the Lion Throne of Homana and inheritor of a prophecy carried down through the generations. But will Aidan, driven as he is by strange visions and portents, prove the weak link in the ages-old prophecy—the Cheysuli who fails to achieve his foretold destiny? For as Aidan prepares to set out for Erinn to claim his betrothed, he will become the focus of forces out of legend, visited by the ghosts of long-dead kinsmen, and by the Hunter, a mysterious being who may be a Cheysuli god incarnate.Commanded by the Hunter to undertake a quest to claim a series of “god-given” golden links, Aidan will find himself challenged by the Cheysuli’s most deadly foe—Lochiel, the son of Strahan—who will use every trick of Ihlini sorcery to stop Aidan and destroy the promise of the prophecy once and for all….In A Tapestry of Lions : Nearly a century has passed since the Prophecy of the Firstborn was set in motion—the generational quest to recreate the magical race which once held sway in the lands ruled by Homana’s Mujar. Now, Kellin, heir to Homana’s throne, has only to sire an offspring with an Ihlini woman to reach this goal. But Kellin wants nothing of prophecy, nor even of his own magical heritage. Embittered by tragedy, he refuses the sacred lir -bonding, becoming anathema in the eyes of his Cheysuli kin. But willing participant or not, Kellin provides a very real threat to the Ihlini—the ancient enemies of the Cheysuli people—for should the prophecy be fulfilled, life as the Ihlini know it will end. How can a lir less warrior ever hope to escape the traps of the Ihlini sorcerers? And how can the prophecy ever be realized when the man born to become its final champion shuns his destined role?",
  "genres": [
    "Fantasy",
    "Science Fiction Fantasy",
    "Fiction",
    "High Fantasy",
    "Epic Fantasy",
    "Romance",
    "Young Adult"
  ],
  "author": "Jennifer Roberson",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/559476.The_Lion_Throne"
}