{
  "title": "Blissy Extended Her Life Despite Cancer Myths.: How to take a liver tumor diagnosis of 24 hours and turn it into 365 additional days of life with your dog - Cooking Secrets & Love to healthy dogs.",
  "description": "Viele Hundeliebhaber möchten das Essen für ihren Hund zu Hause zubereiten, empfinden dies aber als zu komplex. \"Krebs in Hunden - Blissy´s Mutmach-Story könnte auch das Leben deines Hundes verlängern - Spezielle Kochmethoden & Liebe für gesunde Vierbeiner\" erzählt die wahre Geschichte von Golden Retriever-Hund BLISSY und ihrer Besitzerin Linda. Bei Blissy wurde im November 2019 \"inoperabler Leberkrebs\" diagnostiziert. Als der Tierarzt sagte, dass Blissy maximal noch Stunden zu leben hat und Linda Blissy einschläfern sollte, brach Lindas ganze Welt zusammen. Glücklicherweise weigerten sich Linda & Blissy beide, diese Todesdiagnose zu akzeptieren. Stattdessen begann Linda mit einer speziellen Kochmethode zu kochen. Dieses Buch ist auch ein einfacher Wegweiser zu den Grundlagen der Ernährung von Hunden, geschrieben in leicht verständlicher Sprache.Ausgehend von ihrer eigenen Reise mit ihrem geliebten Hund Blissy beschreibt Linda, wie sie Blissy kennen gelernt hat und warum sie schließlich zur einzig wahren Liebe in ihrem Leben wurde. Aufgrund ihrer Verbindung zu Blissy begann Linda nach der Diagnose täglich in ihrem herkömmlichen Schnellkochtopf für Blissy zu kochen, da sie wusste, dass dies eine der gesündesten Kochmethoden weltweit ist, die auf dem Sauerstoff basiert, der während des Kochprozesses eliminiert wird. Das bedeutet, dass alle Vitamine in der Nahrung bleiben. Linda hatte jahrelang als Firmentrainerin gearbeitet und anderen beigebracht, wie man diesen herkömmlichen Schnellkochtopf benutzt, so dass Linda in dieser beängstigenden Situation \"Was für Menschen gut ist, kann für Hunde nicht schlecht sein\".Indem sie über ein Jahr lang einen komplexen Forschungsprozess begann, fand Linda heraus, dass die Tierfutterindustrie uns Hundebesitzer im Stich gelassen hat. Wir haben uns auf sie verlassen, um unseren geliebten vierbeinigen Kumpels eine gesunde Ernährung zu bieten. Obwohl sie Zutaten als ganzheitliche, natürliche und menschliche Qualität anpreisen; in Wirklichkeit sind die Zutaten von Hundefutterkonserven oft Abfallprodukte der Lebensmittelindustrie oder aus kranken Tierkadavern gewonnene Mahlzeiten.Es ist kein Wunder, dass wir verwirrt sind, und der Grund dafür ist, dass die Tierfutterindustrie Millionen von Werbegeldern ausgegeben hat, um Tierkliniken, Tierärzte und die Öffentlichkeit, die Haustiere besitzt, davon zu überzeugen, dass die einzige Möglichkeit, eine vollständige Ernährung zu gewährleisten, die Verfütterung von verarbeiteter industrieller Nahrung ist. Linda eröffnet ihre Welt und ihre Reise mit Blissy, ohne zu wissen, ob Blissy nachts noch bei ihr wäre, immer im Hinterkopf, was der Tierarzt sonst noch gesagt hat, nämlich dass \"der Tumor in Ihrem Hund platzen kann, und niemand weiß, wann dies geschehen wird. Als Blissy und Linda sich diese Worte in der Tierklinik anhören mussten, erinnert sich Linda daran, wie ihr Hund sie ansah.Es war, als ob Blissy mit ihren Augen zu ihr sagen wü \"BITTE GEBEN SIE MICH NOCH NICHT AUF!\"Und dies war einer dieser besonderen Momente im Leben, in denen man schon beim bloßen Gedanken daran eine Gänsehaut bekommt, wissend, dass man das nie vergessen wird...(1) Willst du deinen geliebten Hund gesund und nachhaltig ernähren?(2) Bist du es auch leid, beängstigende Rückrufe von Hundefutter zu lesen, die die Gesundheit deines Hundes einem sehr hohen Risiko aussetzen?(3) Willst du als Hundebesitzer nur eine einfache Lösung, die dir die Kontrolle über deinen Hund gibt und ihm ein glücklicheres, längeres und gesünderes Leben ermöglicht? Dann lies´ weiter...Dies ist nicht nur eine wahre Geschichte, sondern auch ein Leitfaden für die Fütterung deines Hundes mit einer ausgewogenen und nahrhaften Hausmannskost, die nicht darauf abzielt, mehr Geld durch Krankheit zu verdienen, sondern das kostbare Leben eines Hundes zu verlängern und zum Besseren zu optimieren!",
  "genres": [],
  "author": "Linda Julius",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/55961363-blissy-extended-her-life-despite-cancer-myths"
}