{
  "title": "Too Happy To Be Sad Girl",
  "description": "TOO HAPPY TO BE SAD The Ultimate Homegirl's Guide to Overcome Anxiety and Panic, Survive Sadness, and Thrive in Life, Written by An Iconic Girl Boss!Are you looking for the courage to finally start living your truth?Are you ready to find happiness in yourself, stop struggling with self-worth, and finally kick anxiety to the curb?Now’s the time! Too Happy to Be Sad Girl is an inspiring guide that will make you laugh, cry, think, and finally stand up for yourself!If you've spent years feeling like you've put everyone else's needs ahead of your own, struggling with self-esteem, or just felt like you were not living up to your potential, you're not alone. Every one of us has a unique journey, often filled with pain, hardship, and a hefty dose of dark times. Every one of us must find the strength and courage to live with and on purpose.Angel Aviles is one of those people who made a living making movies. In fact, in 1993, she appeared as the Sad Girl in the cult classic filmMi Vida Loca. At some point though, her battle with anxiety and panic took her from heaven through hell. She learned so much in the process. Angel has helped countless women find self-worth and happiness in themselves. With her book, you can begin the process of becoming \"too happy,\" too!Here’s what makes this book It's a heart to heart autobiography that reveals how Angel learned to use her anxiety and change her life.It's a straightforward guide to help you understand who you are, what you want and learn how to find joy, whether you're a new mom, a divorcee, or a fierce 40-year- old. It's a riveting story. As you read, you will feel less alone and inspired to pursue your dreams.It’s fun, it’s adventurous, it’s daring, it’s sad, it’s dark, it’s everything in between - there’s no way you will be left indifferent!Angel is not your typical life coaching guru. In fact, she likes to think of herself as a comadre, a trusted friend, full of love and genuine advice. If You Want to Find Your Happiness and Self-Worth and Overcome Anxiety, Scroll up, Click on ‘Buy Now’, and Get Your Copy Today!",
  "genres": [],
  "author": "Angel Aviles",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/55948862-too-happy-to-be-sad-girl"
}