{
  "title": "Feast of Shadows: Part 2",
  "description": "One part mystery. One part savagery. Three parts magic.Years ago, driven by greed, men penetrated the last soft places on earth. Out of the clear-cut jungle—out of nowhere—a man appeared, eyes rimmed in blue. The last shaman. A man who could make magic.Across five stories, five victims of the inexplicable narrate strange encounters with an enigmatic titan, a man without a past. Caught in his decades-long battle with an unseen foe, each is given the power to alter human history—or end it forever.To the White of the Bone (cont.)A mangled body floats to the surface of a reservoir with nothing to distinguish the victim save for a binding knot branded under her tongue. The case is routed to the NYPD’s resident occultist, an uncompromising homicide detective whose history of unusual and uncertain results has left her career in shambles. Dodging an inquiry into a fatal shooting and pursued by a homicidal witch, she contemplates a devil’s bargain to stop the killer, who just may be the Lord of Shadows..The Song on the GreenOne by one, the children of an upscale Pennsylvania neighborhood are found crippled and catatonic, their minds seemingly vanished. As the panicked community searches in vain for a human predator, they neglect the only witness, an eight-year-old boy with a menagerie of strays, who is left to stand alone against the very creature that hunts him.Bright BlackAfter carelessly killing an innocent, a beautiful aristocrat is cursed with eternal youth. Forced to endure as waves of friends and loved ones wither and fade around her, she wanders the ages in search of meaning—from the wars of Napoleon to the Victorians in India, from the Great Depression to the collapse of the Iron Curtain. Recruited as a spy in an occult war, she soon tires of blood and loss and retreats to a small village in the mountains, where an accident reveals missing memories and the ghosts of her past rise to remind her that the mistakes of five lifetimes are not so easily fled.Part urban fantasy, part magical whodunit, FEAST OF SHADOWS is a five-course occult mystery and the most devilish meal you’ll ever read. The complete epic conundrum is available in two parts.",
  "genres": [],
  "author": "Rick  Wayne",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/55956038-feast-of-shadows"
}