{
  "title": "Black AF History: The Un-Whitewashed Story of America",
  "description": "From acclaimed columnist and political commentator Michael Harriot, a searingly smart and bitingly hilarious retelling of American history that corrects the record and showcases the perspectives and experiences of Black Americans.America’s backstory is a whitewashed mythology implanted in our collective memory. It is the story of the pilgrims on the Mayflower building a new nation. It is George Washington’s cherry tree and Abraham Lincoln’s log cabin. It is the fantastic tale of slaves that spontaneously teleported themselves here with nothing but strong backs and negro spirituals. It is a sugarcoated legend based on an almost true story. It should come as no surprise that the dominant narrative of American history is blighted with errors and oversights—after all, history books were written by white men with their perspectives at the forefront. It could even be said that the devaluation and erasure of the Black experience is as American as apple pie. In Black AF History, Michael Harriot presents a more accurate version of American history. Combining unapologetically provocative storytelling with meticulous research based on primary sources as well as the work of pioneering Black historians, scholars, and journalists, Harriot removes the white sugarcoating from the American story, placing Black people squarely at the center. With incisive wit, Harriot speaks hilarious truth to oppressive power, subverting conventional historical narratives with little-known stories about the experiences of Black Americans. From the African Americans who arrived before 1619 to the unenslavable bandit who inspired America’s first police force, this long overdue corrective provides a revealing look into our past that is as urgent as it is necessary. For too long, we have refused to acknowledge that American history is white history. Not this one. This history is Black AF.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Race",
    "Politics",
    "Social Justice",
    "Historical"
  ],
  "author": "Michael Harriot",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/55959466-black-af-history"
}