{
  "title": "Crystal Reflections: A Story About Glassmaking and Forbidden Love in Pittsburgh’s Victorian Age",
  "description": "Set in Pittsburgh, and spanning the Victorian years (1837-1901), this is a story of family, commitment, love, and loss set against the backdrop of the glass industry for which Pittsburg was famous long before steel. ‘Crystal Reflections’ chronicles the early days of the industrial revolution, before the organizations of the great titans Andrew Carnegie, Charles Schwab, Henry Clay Frick, John D. Rockefeller, and George Westinghouse. At the time, glass manufacturing reigned supreme in western Pennsylvania, West Virginia, and Ohio. As this factory boom was taking place along the shores of Pittsburgh’s three rivers, a bright, ambitious boy emigrated with his family from Germany, and he would soon come to figure prominently in the glassmaking business. His name was Paul Zimmerman. Raised by a Lutheran minister, Paul conducted himself in accordance with the teachings of his faith. He developed a personal code of ethics that mostly steered him the right way, yet sometimes failed him in the same way unwavering passions can break down anyone’s resolve. With the best of intentions toward his fellow man, Paul Zimmerman did a lot of good, yet he would ultimately succumb to life’s negative forces. Paul had many friends but also a few enemies. One of those enemies, Harry McCabe shadowed him through his life. They had common interest in a beautiful, young, Irish girl, named Amy, driven by vastly different reasons. She was the love of Paul’s life. For Harry, she was an object and the ultimate victim of his pathological rage. They both made lifelong commitments to the glass industry, Paul as a manager and Harry as a representative of labor. Their paths would unintentionally cross throughout their lives, even after Amy disappeared. At each intersection of their lives, violence and mayhem would usually follow. Paul married Harriette Dithridge, the daughter of Edward Dithridge, patriarch of a manufacturing family in Victorian Pittsburgh and soon became a significant force in the industry. Paul eventually ran their flagship factory, the Fort Pitt Glass Works along with his brother-in-law Edward Dithridge, Jr. They would struggle with the demise of the glass industry as a dearth of capital, a preference for human labor over modern mechanization, and poor labor relations stood as barriers to long-term growth and prosperity. It was during this struggle and in pursuit of business goals that Paul found Amy, who had created a new life in Martins Ferry, Ohio. Both young and impassioned, their relationship was re-kindled instantly. After an evening of emotional and physical engagement, Paul apologetically insisted, out love and duty to his family, that the affair must end, and he returned to Pittsburgh disturbed and burdened with what might have been. He was also made uncomfortably aware of the existence of a son, a son he never knew existed. The struggle between forces of management and labor weighed heavily on him. Following the early death of his wife, circumstances allowed him to reunite with Amy. Even though they had reached into deep middle age, their passion resumed, and Paul enjoyed a relationship with the adult son he never knew he had. Life was good again but Paul fell ill with a mysterious condition that would ultimately lead to his death. It was in this weakened state that he had his ultimate struggle with Harry McCabe; a struggle that ended with Harry’s destruction.",
  "genres": [],
  "author": "John    Griffith",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/55952065-crystal-reflections"
}