{
  "title": "Ryder",
  "description": "\"Wow, this book is honestly amazing in so many ways. I never thought I was so emotional until reading this book. J.L. Wyer’s writing is so good, it is almost like you are transported to Fallen Brook.\" - Maegan. Goodreads\nMy name is Ryder Cutton and I’ve been in love with Elizabeth Fairchild since I was nine years old. But there’s a problem. My two best friends, Jayson and Julien Jameson, are also in love with her. Wait, it gets worse. After telling my best friends how I felt about Elizabeth, Jayson went behind my back and stole the girl of my dreams away from me. For the past year, I’ve had to stand by and watch as he gets to be her boyfriend. He gets her hugs and kisses, her smiles and laughter. Jayson gets everything that should have been mine.Do you know how hard it is to remain best friends with the girl you are still in love with but can’t have, and with the guy who was supposed to be your best friend but broke your trust by stabbing you in the back?They say that every story has a beginning. I say that every story can be re-written. Perhaps I didn’t lose the girl after all.Meet the boys of Fallen Brook High School and the one girl they all fell in love with.Reader's Note: The Fallen Brook High School YA Romance Series is written by romance author Jennilynn Wyer under her pen name, J.L. Wyer. The Fallen Brook High School YA Romance Series is a reimagining of the adult Fallen Brook Series and is suitable for a Young Adult audience. It does contain some minor bad language and reference to underage drinking, intimacy, and certain social situations. Books 1, 2, and 3 end on a cliffhanger. The series ends with an HEA. Whoever Elizabeth finally chooses, I hope you enjoyed the unusual, unconventional friendship and love the five main characters shared.The Fallen Brook High School YA Romance Series#1 Jayson#2 Ryder#3 Fallon#4 Elizabeth#5 Hailey (Standalone)",
  "genres": [],
  "author": "J.L. Wyer",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/55977030-ryder"
}