{
  "title": "Prior Sins",
  "description": "He hunts monstrous criminals Psychologist and Oxford University Professor Hadrian Prior helps the British police catch violent criminals. Understanding the dark impulses that drive men to maim and kill comes easily to him. When he temporarily swaps teaching positions with a University of Michigan colleague, Hadrian assumes he’ll be on a sabbatical from crime. Then a series of disturbing assaults occur on campus and the Ann Arbor police ask him to consult on the case. Pursuing a link between the perpetrator and ancient mythology leads Hadrian to Sarah Roth. His reaction to her challenges his long held assumption that emotional intimacy is beyond him. She believes she’s a monster University of Michigan Classics Professor Sarah Roth dreams of blood and death. Her mother warned her to never share her dreams or she’d be locked away. Sarah pours her passion into teaching as a relationship is out of reach. When Hadrian approaches her for information, she is shocked by her attraction to him. Hadrian is dangerous to her but the demons inside her like to live dangerously. As Sarah struggles to keep her distance from Hadrian, her dreams become more vivid and violent. The real monster is hunting her Someone on campus is secretly obsessed with Sarah. He is recreating the Labors of Hercules, violent feats of power and strength, to prove worthy of her love. Once he’s completed his quest, Sarah will be his forever. Praise for the Novels of DJ “I was super glued to my Kindle for two days...The balance between the suspense-filled action and romance is spot on.\" The Romance Reviews on Stolen Justice \"Seriously top-notch.\" Romance Junkies on Stolen Justice \"DJ Gross made it so you just had absolutely no idea what would happen next!\" Shameless Romance Reviews on Stolen Justice\"For anyone who enjoys Romantic Suspense - this is a must read.\" The Book Pimp Blogs on Stolen Justice",
  "genres": [
    "Mystery Thriller"
  ],
  "author": "D.J. Gross",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/12696321-prior-sins"
}