{
  "title": "Bad Boys With Red Roses",
  "description": "Meet the bad boys women love to love--the ones who break everybody's rules and live by their own. But sooner or later, every bad boy meets his match in that special woman who makes him believe. . .and behave. Still Mr. & Mrs. Janelle Denison Rachel Hudson strides purposefully past Luke Kincaid's security cameras at a posh Las Vegas casino, closing the door to eight long years of regrets after Luke wins a wager that puts her in his bed for an overdue honeymoon. Luke is sure of one Rachel will enjoy herself and have him begging for more. . . Tempt Me, Tease Me, Thrill Me Tina Donahue After one wild encounter with Judge Cait Campbell, Chicago cop Sean Logan finds out what's under those long black a body that's as beautiful as her face. And he's prepared to plead guilty to wanting her--and only her. . . The Invitation Sharon Cullars The card arrives with a single, long-stemmed red rose, followed by a phone call from a mysterious, deeply seductive male voice, inviting Gerri to a special evening at a beautiful old mansion--and the fulfillment of her most hidden desires. Is she ready to be. . .experienced? USA Today bestselling author Janelle Denison is known for her sinfully sexy heroes and provocative stories, packed with sexual tension and emotional conflicts that keep readers turning the pages. She is the recipient of the prestigious National Reader's Choice Award, has been a RITA finalist, and has garnered many other awards and accolades in the romance writing industry, including being a bestseller at Amazon.com, Barnes & Noble, and Waldenbooks. Tina Donahue is a multi-published novelist in contemporary and historical romance. She was the editor of an award-winning Midwestern newspaper, worked in Story Direction for a Hollywood production company, served as public relations director for a California literary agency, and is currently the Managing Editor for a global business document concern. She has also modeled professionally, appearing on billboards throughout the nation. Sharon Cullars lives in Chicago where she works as a research analyst for a professional association. In her spare time, she reads whatever she can lay her hands on, but particularly loves works that allow her to make an emotional connection to the characters. She does not limit herself to any one genre and is a lover of mystery, romance, horror and sci-fi. She also enjoys various types of music, but generally gravitates toward soft jazz. She has written several short stories, one of which is due to be published in Masques V, an anthology of horror literature. In addition to writing, she hosts the Short Stories section of Bella Online, a comprehensive site for women. When she feels in the mood, she also dabbles in 3D art or just enjoys the wonderful attractions of the city of Chicago. S",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary Romance",
    "Contemporary",
    "M F Romance",
    "Interracial Romance",
    "Erotic Romance"
  ],
  "author": "Janelle Denison",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/560071.Bad_Boys_With_Red_Roses"
}