{
  "title": "Beyond Freedom and Dignity",
  "description": "In this profound and profoundly controversial work, a landmark of 20th-century thought originally published in 1971, B. F. Skinner makes his definitive statement about humankind and society. Insisting that the problems of the world today can be solved only by dealing much more effectively with human behavior, Skinner argues that our traditional concepts of freedom and dignity must be sharply revised. They have played an important historical role in our struggle against many kinds of tyranny, he acknowledges, but they are now responsible for the futile defense of a presumed free and autonomous individual; they are perpetuating our use of punishment and blocking the development of more effective cultural practices. Basing his arguments on the massive results of the experimental analysis of behavior he pioneered, Skinner rejects traditional explanations of behavior in terms of states of mind, feelings, and other mental attributes in favor of explanations to be sought in the interaction between genetic endowment and personal history. He argues that instead of promoting freedom and dignity as personal attributes, we should direct our attention to the physical and social environments in which people live. It is the environment rather than humankind itself that must be changed if the traditional goals of the struggle for freedom and dignity are to be reached. Beyond Freedom and Dignity urges us to reexamine the ideals we have taken for granted and to consider the possibility of a radically behaviorist approach to human problems--one that has appeared to some incompatible with those ideals, but which envisions the building of a world in which humankind can attain its greatest possible achievements.",
  "genres": [
    "Psychology",
    "Philosophy",
    "Nonfiction",
    "Science",
    "Sociology",
    "Politics",
    "Education"
  ],
  "author": "B.F. Skinner",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/55987.Beyond_Freedom_and_Dignity"
}