{
  "title": "To Poison a Nation: The Murder of Robert Charles and the Rise of Jim Crow Policing in America",
  "description": "An explosive, long-forgotten story of police violence that exposes the historical roots of today's criminal justice crisis \"A deeply researched and propulsively written story of corrupt governance, police brutality, Black resistance, and violent white reaction in turn-of-the-century New Orleans that holds up a dark mirror to our own times.\"―Walter Johnson, author of River of Dark Dreams On a steamy Monday evening in 1900, New Orleans police officers confronted a black man named Robert Charles as he sat on a doorstep in a working-class neighborhood where racial tensions were running high. What happened next would trigger the largest manhunt in the city's history, while white mobs took to the streets, attacking and murdering innocent black residents during three days of bloody rioting. Finally cornered, Charles exchanged gunfire with the police in a spectacular gun battle witnessed by thousands. Building outwards from these dramatic events, To Poison a Nation connects one city's troubled past to the modern crisis of white supremacy and police brutality. Historian Andrew Baker immerses readers in a boisterous world of disgruntled laborers, crooked machine bosses, scheming businessmen, and the black radical who tossed a flaming torch into the powder keg. Baker recreates a city that was home to the nation's largest African American community, a place where racial antagonism was hardly a foregone conclusion―but which ultimately became the crucible of a novel form of racialized modern policing. A major new work of history, To Poison a Nation reveals disturbing connections between the Jim Crow past and police violence in our own times.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Race",
    "American History",
    "Politics",
    "Historical"
  ],
  "author": "Andrew Baker",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/55990716-to-poison-a-nation"
}