{
  "title": "2,000 Mules: They Thought We'd Never Find Out. They Were Wrong.",
  "description": "At last, bestselling author Dinesh D'Souza exposes the powerful evidence of voting fraud that you were told didn't exist. Also, a major motion picture documentary.THE FIX WAS IN  The 2020 presidential election was rife with fraud orchestrated by the Democratic Party. That’s not just an accusation; it’s now, thanks to bestselling author and investigative journalist Dinesh D’Souza, an established fact. With eyewitness testimony and the pinpoint precision and analytic sophistication of the forensic technique of geotracking, D’Souza demonstrates how an already corrupt system put in place by Democratic Party hacks and “community organizers” was taken over and supercharged by national-level operatives to jeopardize the integrity of the election.  The key the mule. A paid cut-out. A criminal deliveryman. The stooge found at the intersection where election cheating and double-dealing hit the road. The mule is the crook who physically takes a sack of ballots provided by shady NGOs and political machines—the “community activist organizations” made famous by former President Obama, for instance—and dumps those ballots in collection boxes throughout a voting district. Do enough of this, and you have planted voter fraud across a nation.  Documentary filmmaker extraordinaire and bestselling author of America, Death of a Nation, and United States of Socialism, Dinesh D'Souza exposes powerful evidence of the colossal voting racketeering that you were told didn’t exist. Here you will find the receipts—the transcripts and confirmatory details—for the facts establishing 2020 election fraud presented in D’Souza’s major motion picture documentary, 2,000 Mules. D’Souza makes a powerful argument that 2020 was a stolen election. More important, D’Souza proves it.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History"
  ],
  "author": "Dinesh D'Souza",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/55994369-2-000-mules"
}