{
  "title": "The Queen's Assassin",
  "description": "“The King of High Adventure.” Starlog.In a world of magic and gunpowder, the half-breed Rik must rise from simple soldier to the deadliest assassin the world has ever known.The plans of the Dark Brotherhood reach a crescendo as magical murder is unleashed in the conquered city of Halim. While the fate of the civilised world hangs in the balance, Rik must do battle with dragons, super-human killers and the sinister squid-like Elder Race known only as the Quan. In his quest for vengeance, Rik must now face the deadliest threat of all; his monstrous, inhuman father.The Queen's Assassin continues the thrilling saga of muskets and magic begun in Death’s Angels and continued in The Serpent Tower. In it, the bestselling creator of Gotrek and Felix blends Lovecraftian horror with high adventure in the tradition of Sharpe.ABOUT THE SERIESA thousand years ago the world of Gaeia fell to the Terrarchs, cruel and beautiful alien invaders with a deadly secret. Masters of sorcery and intrigue they have ruled humanity with a fist of steel inside a glove of velvet. For a thousand years, ancient demons have slept, waiting for the moment of their return. Now the stars are right. Old and evil gods are wakening. New revolutions are being born. A genocidal war that will destroy civilization sweeps ever closer.Born a Shadowblood, one of a clan of genetically engineered super-assassins created to serve a long dead Dark Lord, the outcast Rik must master his deadly birthright before his own lost kinfolk can kill him. BOOKS IN THE TERRARCH SERIESDeath’s AngelsThe Serpent TowerThe Queen’s AssassinShadowbloodABOUT THE AUTHORWilliam King lives in Prague, Czech Republic with his lovely wife Radka and his two sons Dan and William Karel. He has been a professional author and games developer for almost a quarter of a century. He is the creator of the bestselling Gotrek and Felix series for Black Library and the author of the bestselling Space Wolf books which between them have sold over three quarters of a million copies in English and been translated into 8 languages. He has been nominated for the David Gemmell Legend Award. His short fiction had appeared in Year’s Best SF and Best of Interzone. He has twice won the Origins Awards For Game Design. His hobbies include role-playing games and MMOs as well as travel.",
  "genres": [
    "Fantasy",
    "Fiction"
  ],
  "author": "William King",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/12696605-the-queen-s-assassin"
}