{
  "title": "China Room",
  "description": "\"The follow-up to his Booker Prize-shortlisted The Runaways, Sunjeev Sahota's new novel follows characters across generations and continents (from Punjab to rural England) and is equally heart-wrenching.\" --Entertainment Weekly \"A gorgeous, gripping read.\" --Kamila Shamsie, author of Home Fire \"Cements [Sahota's] place in a vibrant literary canon alongside Salman Rushdie, Kamila Shamsie, Mohsin Hamid, Hari Kunzru and others.\" --BookPageA transfixing novel about two unforgettable characters seeking to free themselves--one from the expectations of women in early 20th century Punjab, and the other from the weight of life in the contemporary Indian diasporaMehar, a young bride in rural 1929 Punjab, is trying to discover the identity of her new husband. Married to three brothers in a single ceremony, she and her now-sisters spend their days hard at work in the family's \"china room,\" sequestered from contact with the men--except when their domineering mother-in-law, Mai, summons them to a darkened chamber at night. Curious and strong willed, Mehar tries to piece together what Mai doesn't want her to know. From beneath her veil, she studies the sounds of the men's voices, the calluses on their fingers as she serves them tea. Soon she glimpses something that seems to confirm which of the brothers is her husband, and a series of events is set in motion that will put more than one life at risk. As the early stirrings of the Indian independence movement rise around her, Mehar must weigh her own desires against the reality--and danger--of her situation.Spiraling around Mehar's story is that of a young man who arrives at his uncle's house in Punjab in the summer of 1999, hoping to shake an addiction that has held him in its grip for more than two years. Growing up in small-town England as the son of an immigrant shopkeeper, his experiences of racism, violence, and estrangement from the culture of his birth led him to seek a dangerous form of escape. As he rides out his withdrawal at his family's ancestral home--an abandoned farmstead, its china room mysteriously locked and barred--he begins to knit himself back together, gathering strength for the journey home.Partly inspired by award-winning author Sunjeev Sahota's family history, China Room is at once a deft exploration of how systems of power circumscribe individual lives and a deeply moving portrait of the unconquerable human capacity to resist them. At once sweeping and intimate, lush and propulsive, it is a stunning achievement from a contemporary master.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "India",
    "Historical",
    "Literary Fiction",
    "Audiobook",
    "Book Club"
  ],
  "author": "Sunjeev Sahota",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/55994371-china-room"
}