{
  "title": "Escaping Conviction",
  "description": "#1 Best Seller Action & Adventure Literary FictionAn Amazon Top 125 Best SellerHe walked away once… he won’t make that mistake again.Former MF7 Operative Jason Stone is back in town and he can’t stop thinking about the woman he left behind: Jules Bellerose. She’s the love of his life, the one that got away… but he’s the bullet she dodged.Ever since he ghosted her, Jules has made a name for herself, arguing for second chances in every courthouse across the southeast. When Jason’s sister goes missing, he’s the prime suspect, and he needs the best defense attorney there is. Good thing he still remembers her number.Jules swore off love after Jason broke her heart. Defending her clients is her main priority now. But when her past collides with her present, it gets harder to believe that Jason is “just a client.” Especially after one heated argument in particular becomes much, much more.When her own life is in danger, the tables turn and she has to depend on Jason to be her protector again. Self-control is impossible when it’s just the two of them, but what will he think of her after she confesses her own secrets?Only one thing is for certain.Keeping her hands off her new client will be the toughest case she’s had yet.ESCAPING CONVICTION is the suspenseful first chapter in the Conviction Series of interconnected standalones. Jason and Jules get their happily-ever-after and a new couple gets their own HEA in Book Two, while the entire series carries an overarching plot.**While Escaping Conviction has an HEA, this read is not for the faint of heart. The Conviction series should be read by mature readers only (18+) and contains sexually explicit scenes, along with descriptions of human trafficking, drugs, strong language, and physical and sexual violence. Reader discretion is advised.**",
  "genres": [
    "Romance",
    "Dark Romance",
    "Second Chance",
    "Military Fiction",
    "Dark",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Greer Rivers",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/55993232-escaping-conviction"
}