{
  "title": "Dear Marcus: A Letter to the Man Who Shot Me",
  "description": "When Jerry McGill was growing up in the housing projects on the Lower East Side of Manhattan in the 1980s, his future seemed Though times were tough for a family led by a single mother, McGill was a charming, precocious teenager, already excelling as an athlete and a dancer. But everything changed one night when he was thirteen. Walking home from a New Year’s party with a friend, McGill was shot in the back by an unknown assailant, who was never caught. Soon after, he learned that he would be wheelchair-bound for life. Written as a letter to the man who shot him, whom he decides to call Marcus, Dear Marcus is a reflection on McGill’s childhood, the event that changed his life in an instant, the challenges of living with a disability, and the importance of optimism, forgiveness, and making the most of our gifts. In this direct and intimate attempt to explain to his attacker the repercussions of his deeds—how one man’s random decision radically altered the course of another’s life—McGill takes us to the streets of New York City in the 1980s, to the hospital where he spent six months recovering, and on his journey to make the most of his new life. He recounts the joys he has experienced traveling the globe and mentoring disabled children, the love and support he has received over the years, and the strengths he has been able to find within himself that he may never have discovered had his life turned out differently. By turns brutally honest and funny, both full of rage and full of heart, Dear Marcus is an inspiring book about the moments in life that shape us—the ones that catch us by surprise, that blindside us, but that present us with opportunities for growth, reflection, compassion, and forgiveness. At some point—to greater or lesser degrees—we will all be in the wrong place at the wrong time. The challenge, though, as Dear Marcus shows us, is not to wallow in despair or blame other people, but to rise up and find strengths within ourselves that we didn’t know we had.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "African American",
    "Disability",
    "Biography Memoir",
    "Crime"
  ],
  "author": "Jerry McGill",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/12696650-dear-marcus"
}