{
  "title": "The Baltimore Plot: The First Conspiracy to Assassinate Abraham Lincoln",
  "description": "The Complete Story of the First Attempt to Assassinate President Abraham Lincoln\"In a thrilling detective story of conspiracy, treachery and assassination, Michael J. Kline suggests how close the Baltimore plotters came to achieving their goal, and reveals how Lincoln and a few guards outwitted them. Meticulously researched and written with verve, \"The Baltimore Plot\" takes readers aboard Lincoln's inaugural train for a perilous and unforgettable journey.\" —James L. Swanson, author of the Edgar Award-winning New York Times bestseller The 12-Day Chase for Lincoln's Killer On February 11, 1861, the \"Lincoln Special\" - Abraham Lincoln's private train—began its journey from Springfield, Illinois, to the City of Washington, carrying the president-elect to his inauguration as the sixteenth president of the United States. Considered a \"sectional candidate\" by the South, and winning the election without the popular vote, Lincoln was so despised that seven states immediately seceded from the Union. Over the next twelve days, Lincoln would speak at numerous stops, including Indianapolis, Columbus, Cleveland, Pittsburgh, Buffalo, Albany, New York, and Philadelphia, expressing his desire to maintain the Union. But as Lincoln made his way east, America's first private detective, Allan Pinkerton, and a separate undercover operation by New York City detectives, uncovered startling evidence of a conspiracy to assassinate Lincoln during his next-to-last stop in Baltimore. Long a site of civil unrest—even Robert E. Lee's father, Henry \"Light Horse Harry\" Lee, was nearly beaten to death in its streets—Baltimore provided the perfect environment for a strike. The largest city of a border state with secessionist sympathies, Baltimore had been infiltrated by paramilitary groups bent on killing Lincoln, the \"Black Republican.\" The death of the president-elect would, it was supposed, throw the nation into chaos and allow the South to establish a new nation and claim Washington as its capital. Warned in time, Lincoln outfoxed the alleged conspirators by slipping through Baltimore undetected, but at a steep price. Ridiculed by the press for \"cowardice\" and the fact that no conspirators were charged, Lincoln would never hide from the public again. Four years later, when he sat unprotected in the balcony of Ford's Theatre, the string of conspiracies against his life finally succeeded. One of the great presidential mysteries and long a source of fascination among Lincoln scholars, the Baltimore Plot has never been fully investigated until now. In The Baltimore The First Conspiracy to Assassinate Abraham Lincoln , Michael J. Kline turns his legal expertise to evaluating primary sources in order to discover the extent of the conspiracy and culpability of the many suspects surrounding the case. Full of memorable characters, including Kate Warne, the first female undercover agent, and intriguing plot twists, the story is written as an unfolding criminal proceeding in which the author allows the reader to determine whether there was a true plot to kill Lincoln and if the perpetrators could have been brought to trial.",
  "genres": [
    "History",
    "Civil War",
    "American History"
  ],
  "author": "Michael J. Kline",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/5602911-the-baltimore-plot"
}