{
  "title": "The Obama Hate Machine: The Lies, Distortions, and Personal Attacks on the President---and Who Is Behind Them",
  "description": "In Toxic Talk, Bill Press exposed the ways in which the extreme right-wing media has done an end run around the American voting populace by exerting a disproportionate control over open political debate. In The Obama Hate Machine, Press returns to show how the Right has taken rhetoric to slanderous new levels in attacking the nation’s forty-fourth president.While presidents and presidential candidates routinely have been subject to personal attacks, the outright disdain Obama’s extremist opponents have for the facts has inspired an insidious brand of character assassination unique in contemporary politics.Obama was born in Kenya . . . Obama sympathizes with Muslim terrorists . . . Obama is a communist who wants to institute death panels and touch off class warfare…The extent to which these unfounded assertions have taken hold in the American mindset shows just how ruthless, destructive, and all-powerful the right-wing machine—hijacked by extremists in the media and fueled by corporate coffers—has become. The author reveals how corporate interests such as the infamous Koch Brothers continue to steer political coverage away from fact-based dialogue into the realm of hysteria. Bill Press also observes this phenomenon is not limited to the airwaves and provides an “I Hate Obama Book Club” list, calling out the scores of anti-Obama tomes—and even some from the Left—that have helped drag politics even deeper into the mud. In his characteristic on-the-mark arguments sure to appeal to anyone on the Left or in the Center, Press shows how the peculiar nature of Obama-hating subverts issue-driven debate and threatens not only the outcome of the 2012 election but the future of the American democratic system.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "The United States Of America"
  ],
  "author": "Bill Press",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/12696957-the-obama-hate-machine"
}