{
  "title": "Soundings: The Story of the Remarkable Woman Who Mapped the Ocean Floor",
  "description": "Her maps of the ocean floor have been called \"one of the most remarkable achievements in modern cartography\", yet no one knows her name. Soundings is the story of the enigmatic, unknown woman behind one of the greatest achievements of the 20th century. Before Marie Tharp, geologist and gifted draftsperson, the whole world, including most of the scientific community, thought the ocean floor was a vast expanse of nothingness. In 1948, at age 28, Marie walked into the newly formed geophysical lab at Columbia University and practically demanded a job. The scientists at the lab were all male; the women who worked there were relegated to secretary or assistant. Through sheer willpower and obstinacy, Marie was given the job of interpreting the soundings (records of sonar pings measuring the ocean's depths) brought back from the ocean-going expeditions of her male colleagues. The marriage of artistry and science behind her analysis of this dry data gave birth to a major work: the first comprehensive map of the ocean floor, which laid the groundwork for proving the then-controversial theory of continental drift. When combined, Marie's scientific knowledge, her eye for detail and her skill as an artist revealed not a vast empty plane, but an entire world of mountains and volcanoes, ridges and rifts, and a gateway to the past that allowed scientists the means to imagine how the continents and the oceans had been created over time. Just as Marie dedicated more than twenty years of her professional life to what became the Lamont Geological Observatory, engaged in the task of mapping every ocean on Earth, she dedicated her personal life to her great friendship with her co-worker, Bruce Heezen. Partners in work and in many ways, partners in life, Marie and Bruce were devoted to one another as they rose to greater and greater prominence in the scientific community, only to be envied and finally dismissed by their beloved institute. They went on together, refining and perfecting their work and contributing not only to humanity's vision of the ocean floor, but to the way subsequent generations would view the Earth as a whole. With an imagination as intuitive as Marie's, brilliant young writer Hali Felt brings to vivid life the story of the pioneering scientist whose work became the basis for the work of others scientists for generations to come.",
  "genres": [
    "Nonfiction",
    "Science",
    "Biography",
    "History",
    "Geology",
    "Womens",
    "History Of Science"
  ],
  "author": "Hali Felt",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/12696972-soundings"
}