{
  "title": "Stealing Home",
  "description": "Walker Callahan has loved from afar for as long as he can remember.The golden boy of the Callahan baseball dynasty, he’s the only player to ever secure a top spot on a roster controlled by his own flesh and blood. The pressure, duty and plans laid out for him since birth loom large, causing things like love and a family to fall by the wayside.Or maybe that’s because the woman he loves is already married with children.When they met, she was already promised to someone else. For over six years, he resigned himself to being her friend. Until one night, when her marriage and the ugly secrets it keeps unravels for the world to see. She’s burned, scared and needs someone who will put her needs above everything else.Can Walker risk his own future and show her how to trust again? Or will the feelings he’s kept hidden for years throw him out of the game before he can even attempt to play?Hannah Giraldi never wants to fall in love again.All it brings is pain, misery and her life falling to shambles. After a very public scandal, her abusive husband takes everything, leaving her to raise two daughters on nothing but charity from others, a hope, and a prayer.New to the job market, single motherhood, and with two court cases on her plate, the last thing she needs are the butterflies that Walker ignites in her stomach every time he comes around. But with his soothing words, supportive shoulder to lean on, and undeniable gorgeousness, he’s pretty hard to ignore.Just when it feels like she might be standing on her own two feet, the world comes crumbling down around her. And the man she’s finally allowed into her heart abandons her, once again leaving her to pick up the pieces.Is there a way to heal all of the broken parts, or will Hannah go down swinging while attempting one more shot at a happily ever after?",
  "genres": [
    "Sports Romance",
    "Baseball",
    "Sports",
    "Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Carrie Aarons",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/56031606-stealing-home"
}