{
  "title": "The Killing of Faith",
  "description": "AMERICAN BOOK FEST AWARD WINNER – September, 2022READER'S FAVORITE AWARD WINNER FOR MYSTERY/THRILLER – October 2021NATIONAL INDIE EXCELLENCE AWARD FINALIST – May 2022Do you like a shocking thriller? Do you like a twist you never see coming?The Killing of Faith, winner of three national awards, follows Faith, a beautiful, single mother of three, as she looks back on her life and describes a mysterious - but seemingly hopeless - situation. After leaving an unhappy marriage and swearing off love, Faith finally meets the man of her dreams. We've all read a similar tale. What sets this story apart is the dark turn it takes. The reader quickly knows Faith is in big trouble, but doesn’t know where she is or why she’s there. This mystery will draw you in, as you are given clues to solving the puzzle of Faith’s whereabouts, the events leading up to her current nightmare, and how a woman's simple lies plunge her into a living nightmare beyond anything you can imagine. The book concludes with a shocking twist that will make you question everything you thought you knew.You'll be shocked when you realize what happened to Faith can happen to you!Kirkus Reviews calls it \"riveting\"Online Book Club gives it an \"enthusiastic recommendation\"Best Seller's World says it's a \"Must Read\"Reedsy says \"if your looking for a twisted thriller similar to Gillian Flynn or Stieg Larson look no further\"WHAT READERS ARE SAYING★★★★★ \"This was a great book about love, lust, betrayal and revenge. The twist at the end is impossible to see coming and will shock you!\" — Luke Williams★★★★★. \"If you love a book that grabs you from the beginning and doesn't let up, this is a must read. If you love a book that makes you go OMG throughout it, this is a must read. If you love a book that the ending completely turns everything you thought into a fantastic twist, this is a must read!!!\" —Victor Stowe★★★★★ \"WOW. The more you read the better it gets. As a wife, I was becoming very upset with The wife of the story and her decisions. Just goes to show you that be careful what you wish for and to be grateful for what you have. This was an awesome story and I highly recommend.\" — PdhForever★★★★★ \"The chapters are quick and easy to fly through as you are continually pulled to find out what her next misstep will be that leads to her ultimate misery described at the onset. There is a constant struggle of who to trust and that feeling of \"things are going way too well\" that you know something is about to go terribly wrong. Just when you think the ending couldn't be more predictable, there's a shocking Gone Girl-level twist. It's not a feel good story, however I like that it leaves you feeling extremely thankful for all the simple things you might take for granted in your life. I'm hoping for a sequel!\" — Annalee★★★★★ \"I've read a lot of kindle books on Amazon and this is one of the best books that I've read in a long time. I would highly recommend this one and I cannot wait for the next one from this author.\" — Jimmy Jones★★★★★ \"The book had me thinking one way and a complete surprise at the end....I have not been able to get it out of my mind..\" — Camifan★★★★★. \"So...I received my copy of the book \"The killing of faith\" and started reading it at about 8pm. It started flowing and I didn't want to stop. I had to know where it was going. I couldn't.... (and you won't) foresee what's going to happen. I read all night and finished at 7:30am. So..was it good? It was as good or better than any suspense book or movie that I have ever seen. This is Alfread Hitchcock. it was not good..... It was great.\" — Dean.",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "William Holms",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/56016382-the-killing-of-faith"
}