{
  "title": "Paradise: One Town's Struggle to Survive an American Wildfire",
  "description": "The definitive firsthand account of California's Camp Fire--the nation's deadliest wildfire in a century--and a riveting examination of what went wrong and how to avert future tragedies as the climate crisis unfoldsOn November 8, 2018, the people of Paradise, California, awoke to a mottled gray sky and gusty winds. Soon the Camp Fire was upon them, gobbling an acre a second. Less than two hours after it ignited, residents were trapped in flames, cremated in their homes and cars. By the next morning, eighty-five people were dead.San Francisco Chronicle reporter Lizzie Johnson was there as the town of Paradise burned. She saw the smoldering rubble of a historic covered bridge and the beloved Black Bear Diner, and she stayed long afterward, visiting shelters, hotels, and makeshift camps. Drawing on years of on-the-ground reporting and reams of public records, including 911 calls and testimony from a grand jury investigation, Johnson provides a minute-by-minute account of the Camp Fire, following residents and first responders as they fight to save themselves and their town. We see a young mother fleeing with her newborn; a school bus full of children in search of an escape route; and a group of paramedics, patients, and nurses trapped in a cul-de-sac, fending off the fire with rakes and hoses.Johnson documents the unfolding tragedy with empathy and nuance. But she also investigates the root causes, from runaway climate change to a deeply flawed alert system to Pacific Gas and Electric's decades-long neglect of critical infrastructure. A cautionary tale for a new era of megafires, Paradise is the gripping story of a town wiped off the map and the determination of its people to rise again.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Audiobook",
    "Nature",
    "Environment",
    "Climate Change"
  ],
  "author": "Lizzie Johnson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/56024292-paradise"
}