{
  "title": "One Treasured Summer",
  "description": "Fifteen-year-old Ruby Alice's life is smashed to pieces when her father dies. Her already tumultuous relationship with her mother, Helen, becomes even more stressed when Ruby Alice begins asking questions about the accident that took her father's life. Her questions are met with anger and veiled language, leading Ruby Alice to believe that her mother is keeping a secret about the circumstances surrounding her fathers death. Months pass, while confused and helpless, Ruby watches her mother unravel and their money run out. Desperate, Helen reluctantly reaches out to her mother, Dorothy, whom she's successfully avoided for years. Suddenly, Ruby Alice finds herself in rural Missouri moving in with an eccentric grandmother she's never met. She's still acquainting herself with life in the country when Grandma Dorothy tells Ruby Alice about her great grandfather, Thomas Irl, the man who built the three-story farmhouse that is now her new home. Dorothy relays that he was a secretive man and never allowed anyone into the attic. So, when she offers to take Ruby Alice up to look for dusty treasures, Ruby Alice is all in. While scooching past stacks of boxes and peeking into drawers of antique furniture, a clumsy mistake leads to the discovery of an old scrap of paper with strange writing. A treasure map? This is the spark that sets Ruby Alice on the hunt for more clues. Along the way she gets help from a new friend, Ansel, who helps her decipher what great grandpa T.I. left behind. Her search takes on sudden urgency when she overhears that long unpaid debts threaten to take away her new home. On the cusp of making a great discovery, the truth from her mother about her father's death sends her into an emotional spiral causing her to question her perception of her father. Is her mother right? Are her memories of her father false? Is she just chasing a childish fantasy? Though she won't see it with clarity until years later, Ruby Alice discovers that words and actions have consequences and people aren't always who they seem to be in that one treasured summer.",
  "genres": [],
  "author": "Carmen  Hopkins",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/56021325-one-treasured-summer"
}