{
  "title": "The Stray and the Strangers",
  "description": "Based on a true story, a stray dog befriends an orphan boy in a refugee camp on a Greek island.The fishermen on Lesvos call her Kanella because of her cinnamon color. She’s a scrawny, nervous stray — easily intimidated by the harbor cats and the other dogs that compete for handouts on the pier.One spring day a dinghy filled with weary, desperate strangers comes to shore. Other boats follow, laden with refugees who are homeless and hungry. Kanella knows what that is like, and she follows them as they are taken to a makeshift refugee camp. There she comes to trust a bearded man, an aid worker, and gradually settles into a contented routine. Kanella grows healthy and confident. She has a job now — to keep watch over the people in her camp.One day, a little boy arrives and does not leave like the others. He seems to have no family and, like Kanella, he is taken in by the workers. He sleeps on a cot in the food hut, and Kanella keeps him warm and calm. When two new adults come to the camp. Kanella is ready to defend the boy from them, until she is pulled away by the bearded man. They are the boy’s parents, and now he must go with them.Eventually, the camp is dismantled, and Kanella finds herself homeless again. Until one night, huddled in the cold, she awakens to see two bright lights shining in her eyes — the headlights of a car. The bearded man has come back for her, and soon Kanella is on a journey, too, to a new home of her own.Key Text Featuresmapsillustrationsauthor's noteCorrelates to the Common Core State Standards in English Language CCSS.ELA-LITERACY.RL.5.6Describe how a narrator's or speaker's point of view influences how events are described.",
  "genres": [
    "Childrens",
    "Middle Grade",
    "Dogs",
    "Fiction",
    "Animal Fiction",
    "Juvenile",
    "Audiobook"
  ],
  "author": "Steven Heighton",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/56026200-the-stray-and-the-strangers"
}