{
  "title": "Roman Will Fall",
  "description": "She can’t work with him.They’ve been partners for less than a week, and Roman Smith (if that even was his real last name!) is already driving Harper Crane absolutely insane. His list of faults is a mile long. Roman is secretive, controlling, and far too sexy. Okay, the sexiness doesn’t matter. It can’t matter. What matters is that Roman never listens to orders, he is far too quiet and intense, and Harper is pretty sure that he is up to some seriously shady side business.He isn’t supposed to want his new training partner.Roman has spent his life in the darkness. He is far too well acquainted with evil, and working at Wilde? Well, joining the security and protection firm is supposed to be the first step to turning things around in his world. The first step to becoming someone new. But some habits are hard to shake. And Roman knows that his way too beautiful trainer, Harper, is already suspicious of him. Yeah, so…she is right to be suspicious. Until recently, he has been the bad guy in the story. His list of past deeds could give anyone nightmares. Too bad he only wants to give Harper sweet dreams.Trouble has followed Roman.Roman has some unfinished business from his past—in the form of deadly enemies—who have tracked him. And now those enemies have gotten the wrong idea about Harper. (Probably because Roman couldn’t keep his hands off her on a case.) They think she is Roman’s lover. They think they can use her in order to get to him. They are about to make the worst mistake of their lives.When Roman’s enemies kidnap Harper, he drops the good guy role.Roman races to rescue her—and they are thrown together in close confines. Intimately close. In order to fight the enemies closing in, Harper and Roman have to trust each other. They have to work together. Stay together. Except the longer they are together, the more Roman realizes just how much he wants the fiery Harper. And soon…Roman can’t imagine his life without her.\nCan a reformed bad guy get a chance at happily ever after? Maybe. If things get Wilde enough…\nAuthor’s note: The badder they are, the harder they fall. And Roman is about to fall…HARD. His training partner blindsides him from the very beginning. Bad guys aren’t supposed to believe in love at first sight, and, hell, Roman doesn’t even believe in love at all. But…then Harper barrels into his life. When she’s threatened, he will do anything and everything necessary to assure her safety. And as for Harper, if she gives him the chance, he will prove to her that even bad guys can be good…at least, with the right person. The Wilde crew is back. Buckle up and get ready for hot times, danger, and a whole lot of surprises.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Suspense",
    "Mystery",
    "Enemies To Lovers"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/56028183-roman-will-fall"
}