{
  "title": "The Same End",
  "description": "Teancum Leon is pretty sure that if he plays his cards right, he can have it all: his childhood friend and former lover, Ammon Young; his best friend (although Tean is loath to admit it), Jem Berger; and his family. A boyfriend might even be in his future, although he’s having a heck of a time getting a second date with the guys he meets on Prowler.Then the key suspect in a murder investigation asks to speak with Jem, overturning the precarious balance Tean has worked to maintain. A girl Jem knew in childhood is dead, and the man believed to have killed her was one of Jem’s tormentors at Decker Lake Juvenile Detention Center. Antonio Hidalgo insists he is innocent, and he begs Jem to find the real killer, a man Jem knows very well, the man who masterminded his torture at Decker: Tanner Kimball.When Jem decides to check out Antonio’s story, Tean insists on helping. Their search takes them into Utah’s high desert, a land of redrock cliffs and hoodoo stones. But everything changes when they find a dead man in a remote canyon. He carries Tanner’s wallet, but the body has been disfigured, making identification difficult—if not impossible. Jem is convinced that the scene has been staged, and he’s determined to find Tanner and make him pay for the bodies in his wake.Warnings begin piling up from the chief of police, the sheriff, a Bureau of Land Management special agent, even a Utah Highway Patrol trooper. Everyone wants Tean and Jem to understand that it’s in their best interest to go back to Salt Lake before they dig any deeper. A shipment of illegal drugs—several million dollars’ worth—might be the motive. But Tean and Jem begin to suspect that something else is driving events: a motive darker and stronger than money. Learning the truth, though, will take both men on a collision course with the past.",
  "genres": [
    "M M Romance",
    "Mystery",
    "Romance",
    "Contemporary",
    "Crime",
    "LGBT",
    "Audiobook"
  ],
  "author": "Gregory Ashe",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/56040417-the-same-end"
}