{
  "title": "TRANCE-formation of America: The True Life Story of a CIA Mind Control Slave",
  "description": "The true life story of a CIA mind control slave by Cathy O'Brien with Mark Phillips. This is the documented autobiography of a victim of government mind control. Cathy O'Brien is the only vocal and recovered survivor of the Central Intelligence Agency's MK-Ultra Project Monarch mind control operation. Chiseled deep into the white stone of the CIA's Langley, Virginia headquarters is a partial verse lifted from the Holy Bible and writings of Saint John... \"and the truth shall set you free\". This statement, like the agency, is total reality. The building that it is engraved upon houses the world's most successful manufacturer of lies to facilitate psychological warfare. The \"Company\" uses truth and technology as their raw materials to produce \"pure\" lies for control of you and America's allies.This book is amongst the most shocking ever to reach this desk. Trance-formation of America is the chronicle of Cathy O'Brien, a recovered survivor of the CIA's infamous MK-ULTRA Project Monarch mind-control operation, and of Mark Phillips, the courageous man who rescued her (and her daughter) in 1988 from certain death and helped her recover her memories and regain some control over her life. Cathy O'Brien's troubles began at birth (in 1957) when she was subjected to constant abuse by her family. As she grew up, her father ensnared her in a corrupt pedophile ring and eventually sold her out to the CIA where, under the auspices of Project Monarch, Cathy became a mind-controlled White House sex slave deprived of any love, free will, or self-respect and forced to endure drug and electro-induced torture.",
  "genres": [
    "Nonfiction",
    "Conspiracy Theories",
    "Politics",
    "Psychology",
    "History",
    "True Crime",
    "Memoir"
  ],
  "author": "Cathy O'Brien",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/560419.TRANCE_formation_of_America"
}