{
  "title": "My Gifts At Christmas",
  "description": "As the holidays approach Caspian has resigned himself to the fact that life in the City of Eternal Night is just one meaningless day after another. When his older brother, Magnus, asks him to greet a scientist working on improving the quality of their blood resources, he is surprised to hear that the man is a shifter. Once they meet he is shocked they are mates. When he looks at what Broderick Monroe is carrying on his hip, his heart melts. In one fateful afternoon, he goes from being Noctem Falls' most eligible bachelor, to a mated man with a baby girl!Broderick Monroe is still reeling from losing his best friend and mother of his child to a senseless carriage accident, when the Prince of the Vampires writes and extends an offer to move him to the Noctem Falls and further fund his research. His only worry his how his toddler Beth will handle living below ground and how the vampire citizens will react to shifters in their city.When they arrive they are welcomed by the Prince's brother and Broderick almost faints when he realizes this god-like man his is mate. He soon realizes that his mate is as beautiful on the inside as he is on the outside. Caspian turns his entire life to suit his and Beth's needs, becoming a model mate and father. What more could he ask Father Christmas for?As Caspian and Broderick carve out a new life together, they both start to suspect that the small accidents Beth has been having on a regular basis may not be exactly normal. Being the only shifters in Noctem Falls seemed daunting at first, but when Beth nearly dies for the fourth time in a week, Broderick realizes that it may take an entire city of super strong and fast vampires to keep his baby girl alive!Father Christmas has his work cut out for him in the City of Eternal Night.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Vampires",
    "Fantasy",
    "Shapeshifters",
    "Magic"
  ],
  "author": "Alanea Alder",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/56055158-my-gifts-at-christmas"
}