{
  "title": "La hija del Papa",
  "description": "Roma, 1871. El cavaliere Di Fonso es convocado por el gobierno que acaba de unificar Italia para que examine un manuscrito de extraordinario valor custodiado hasta entonces por los jesuitas. Di Fonso no tarda en descubrir que el texto fue redactado a inicios del siglo XVI, una época en que Italia se encontraba desgarrada por los enfrentamientos entre potencias como España y Francia y por las intrigas de la corte papal, sometida a un español de la familia Borja coronado con el nombre de Alejandro VI. El manuscrito además es la última misiva escrita por Lucrezia Borgia, la mismísima hija del papa, a Pietro Bembo, el humanista que creó la lengua italiana, recordándole un amor vivido por ambos tiempo atrás.¿Podrá ser utilizado aquel documento para socavar el poder de la Iglesia católica en la nueva Italia?¿Contiene informaciones que sean susceptibles de favorecer a los nuevos detentadores del poder en la península?¿Tiene una relevancia que vaya más allá del mero interés literario e histórico? Di Fonso se entregará a la tarea de responder a esas preguntas, y así dará con revelaciones sepultadas en el silencio durante siglos a causa del interés de Estado. La hija del papa es un retrato vigoroso, documentado y ameno de la Italia del Renacimiento en que los pontífices eran príncipes guerreros y protectores de mecenas; en que los sabios se esforzaban por conciliar a los clásicos griegos y latinos con el Nuevo Testamento; y en que los más espirituales gemían por una Reforma que purificara a la Iglesia de pecados de siglos. Se trata pues de otra novela magistral de César Vidal en la que nos acercamos al amor y a la muerte, a la ambición y a la belleza, a la amistad y al poder. ENGLISH DESCRIPTION Rome, 1871. The Government of a recently unified Italy summons cavaliere Di Fonso to examine a priceless manuscript guarded by the Jesuits. It does not take long for Di Fonso to date the manuscript to the early sixteenth century, a time where Italy was being torn apart by the constant rivalries with Spain and France and the intrigues of the Papal court, subjugated by a Spaniard from the Borgia family who was crowned as Pope Alexander VI. Adding to its import, the manuscript was also the last letter written by Lucrezia Borgia, the Pope's illegitimate daughter, to Venetian scholar and Cardinal Pietro Bembo, recalling their past love affair. Could the document be used to undermine the power of the Catholic Church in the new Italy? Does it contain information that could favor the new usurpers of power in the Peninsula? Does its value lie merely in its literary and historic value or could it pervade other aspects? Di Fonso will devote himself to finding the answers, and in his quest will uncover centuries-old truths buried by the interests of the State. La hija del Papa is a well documented and powerful portrait of Renaissance Italy, where Popes were warrior princes and patrons of the arts, where learned men strove to reconcile classical Greek and Latin teachings with the New Testament, and where the pious begged for a Reform that would purify the Church of centuries of sins. This thoroughly enjoyable read is yet another example of César Vidal's masterful rendition of love and death, ambition and beauty, friendship and power.",
  "genres": [],
  "author": "César Vidal",
  "average_rating": "2.41",
  "url": "https://www.goodreads.com/book/show/12698120-la-hija-del-papa"
}