{
  "title": "Heartbreak and Honor",
  "description": "Who knew that being abducted by a band of renegade Scots would be the least of her concerns?\nHighland gypsy Tasara, has no use for aristocrats. She especially doesn’t like the arrogant nobleman who rescued her and tried to steal a kiss in the process. No good can come from spending time with him—distractingly handsome though he may be. But everything changes when she learns she’s actually Alexandra Atterberry, a long-lost heiress. Now, she must take her proper place in a society she wants no part of, amidst jealous people who might very well be plotting her demise. Perhaps she has use for her roguish rescuer after all…Lucan, Duke of Harcourt, promised his ailing mother he’d find a suitable wife by Christmas. But the feisty, knife-wielding Scottish Highland lass he rescued? Tasara isn’t at all suitable. However, she is everything he could ever want in a bride—and the simpering ladies of the haut ton pale in comparison. All he has to do is help Alexa overcome her aversion to the English, the nobility, and most of all, him.With danger and intrigue plaguing their every move, can these two polar opposites find common ground on the road to happily ever after?Historical romance at its sizzling best! This tantalizing Scottish Regency by a USA Today bestselling author will have you on the edge of your seat and sighing in delight! You’ll eagerly escape into this page-turner and cheer as Lucan and Alexa, at last, admit their love for each other.If you enjoy reading arranged marriages and enemies to lovers stories packed with suspense, a dash of humor, and heartwarming emotion, then you’ll adore Collette Cameron’s passionate HIGHLAND HEATHER ROMANCING A SCOT Series. Buy HEARTBREAK AND HONOR today and settle into your favorite reading nook for an unforgettable historical romance escapade you can’t put down.Though this book can easily be read as a stand-alone, most readers prefer to read the series in order.HIGHLAND HEATHER ROMANCING A SCOT:Triumph and TreasureVirtue and ValorHeartbreak and HonorScandal’s SplendorPassion and PlunderSeductive SurrenderA Yuletide HighlanderCHECK OUT COLLETTE’S OTHER SERIES:Castle BridesSeductive ScoundrelsThe Blue Rose Regency Romances: The Culpepper MissesThe Honorable Rogues®Wicked Earls’ ClubDaughters of Desire (Scandalous Ladies)",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Historical Fiction",
    "Regency",
    "Regency Romance",
    "Historical Mystery"
  ],
  "author": "Collette Cameron",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/56054343-heartbreak-and-honor"
}