{
  "title": "Heartbeat Repeating",
  "description": "“If he could keep Avery’s eyes on him, just for a few moments, he’d give up everything he had.”Millionaire Alejandro Santos’ life is defined by three things: money, compulsions, and loss. And while he has long-since learned to cope with his OCD, he has never moved on after losing his family. Grief is his only companion, and he plans to keep it that way.And then he sees a young college student washing cars for charity in the freezing cold, and everything changes. Without meaning to, Alejandro stops, and the next thing he knows, Avery Marshak is signing his name on the dotted line, becoming his new sugar baby.Twelve months later, and Avery has followed all of Alejandro’s rules to a T. No touching, no sleeping with anyone, always come when he calls. But spending a year without so much as a handshake, and Avery’s starting to feel a little affection starved. He tells himself there’s no point in hoping this year will be different, because Alejandro is not the kind of man who embraces change. And then his sugar daddy shows up with an offer: stay with me at my penthouse for Chanukah. Saying yes is dangerous, because Avery’s heart is a fool and even a single touch will ruin what little progress he’s made in protecting it. But he also knows he can’t resist the offer, because what’s a little heartbreak if it gives him a single chance to know the man who’s been keeping himself at a distance.Avery wants to believe there’s hope—that the miracle of Chanukah is more than lights. But the more Alejandro opens up, the more Avery realizes this might not be a beginning, but instead the means to an end.Will Alejandro be able to let go of his grief and embrace the love in front of him? And will Avery find the patience to hold on as Alejandro fights to break through his comfortable routine? The answer is there, if only they stop to listen, in the echo of their heartbeats repeating.Heartbeat Repeating is a stand-alone holiday novel with no cheating and a Happily Ever After.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Holiday",
    "Queer",
    "Contemporary Romance",
    "Slow Burn"
  ],
  "author": "E.M. Lindsey",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/56056347-heartbeat-repeating"
}