{
  "title": "After the Arab Spring: How Islamists Hijacked the Middle East Revolts",
  "description": "From the author of the book that uniquely predicted the Egyptian revolution, a new message about the Middle East: everything we're told about the Arab Spring is wrong. When popular revolutions erupted in Tunisia and Egypt, the West assumed that democracy and pluralism would triumph. Greatly praised author and foreign correspondent John R. Bradley draws on his extensive firsthand knowledge of the region's cultures and societies to show how Islamists will fill the power vacuum in the wake of the revolutions. This vivid and timely book gives an original analysis of the new Tunisia, Egypt, Syria, Yemen, Libya, and Bahrain by highlighting the dramatic spread of Saudi-funded Wahhabi ideology, inter-tribal rivalries, and Sunni-Shia divisions. Bradley gives a boots on the ground look at how the revolutions were first ignited and the major players behind them, and shows how the local population participated in and responded to the uprisings. In Tunisia he witnesses secularists under violent attack and in Egypt observes radical Islamists taking control of the streets. He illuminates the ancient sectarian strife shaking Bahrain, fierce civil war pitching tribe against tribe in Libya and Yemen, and ethnic divisions threatening to tear apart Syria and Iran. Taking it one step further, Bradley offers a comprehensive look at how across countries, liberal, progressive voices that first rallied the Arab masses were drowned out by the slogans of the better-organized and more popular radical Islamists. With the in-depth knowledge of a local and the keen perspective of a seasoned reporter, After the Arab Spring offers a piercing analysis of what the empowerment of Islamism bodes for the future of the Middle East and the impact on the West.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Sociology",
    "Islam"
  ],
  "author": "John R.  Bradley",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/12698030-after-the-arab-spring"
}