{
  "title": "The One Who Got Away",
  "description": "He has to get her back.Antony Kyle can’t believe what’s happening to him. First, Ella Webb—the head of security at his gaming company—quits on him. Then…she kisses him as if she’s never wanted anyone more. They spend one incredible night together—a night that brands him to his core—and he wakes to find her gone. Gone.No, not happening. Antony is not about to lose her now. Not when he’s been obsessed with her for years. He can’t have a taste and then lose…everything.She’s done with his lies.Ella has been in love with her gorgeous, genius boss for far too long. And she’s put up with his lies and secrets…for far too long! She’d fallen for his helpless act, thought that the man needed her, but now she has learned the truth. Antony Kyle is a secret spy, more than capable of looking after himself and taking out a whole army of bad guys. So, she gives in to the need that she’s always felt for him, she allows herself one, unforgettable night with him, then she walks away.But he follows her.Antony can’t lose Ella—not when he’s finally had the woman he’s wanted so desperately. But she’s got a new job at Wilde—an elite protection and security firm—and he has to figure out a way to woo her back. So, he hires Wilde. Says that he needs protection. He pulls some strings (because the owner of Wilde happens to owe him about a dozen favors), and Antony gets Ella assigned as his bodyguard. He thinks his plan is brilliant. He’ll have Ella in close proximity again, and Antony is sure that he’ll able to convince her that they belong together. Though some groveling—and a whole lot of seduction—may just be involved in his master plan.Except…the danger turns out to be real.Someone is gunning for Antony, and he doesn’t know if his enemy is from the spy world or the business world. He just knows that a big target is on his back. Now he and Ella have to unmask the threat that they never saw coming, before it’s too late. As they fight to track the bad guy, Antony has to prove to Ella that he can be honest with her, and, if she gives him a shot…he just might be a man she can love. Because if he loses her again, Antony knows there will be no second chances.Author’s Note: Their sexual tension can’t be held in check. When Ella and Antony are close, they ignite. But with so many secrets and lies, can they find a happy ending? It will take a master spy—and one very savvy new Wilde agent—to bring down the bad guy in this case. Wilde times are ahead again. Let’s see where these two lovers lead as they fight for each other.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Suspense",
    "Contemporary Romance",
    "Friends To Lovers",
    "Adult"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/56041831-the-one-who-got-away"
}