{
  "title": "Owen",
  "description": "Owen Cullen was a dream. Not a dream come true because I’d never dared to dream. He was my wildest fantasy, a hallucination, a delusion. The handsome man who’d saved my life—twice. He was a real-life hero, and I was…what was I? Filth, that was what I was. The daughter of a gangster, the niece of the reigning king of Chicago’s underground. I tried my best not to fall in love with Owen. I tried not to mistake his kindness. I tried to remember the lessons of my youth: Love was a weakness. Sex was a weapon. It didn’t work. I fell in love. Then my uncle found me, and I ruined everything.Natasha. It was a fake name. One she’d made up on the fly when my team had rescued her from a life worse than death. She had no place to go, so I took her home. It was supposed to be temporary, just until we learned who she was. But the woman proved to be stubborn and kept her secrets buried deep. She’d lived with me for months, and every day the pull of her called to me. I was living a nightmare of my own making. I didn’t trust women, especially the one sleeping in my guest bedroom. I’d fought the good fight. I’d held out for as long as I could. Then all of her secrets came out, but it was too late. I was in too deep. Natasha, the beautiful woman with no last name, was mine. But she had a last name—Pollaski.Everything came crashing down.I was no stranger to the battlefield. I was used to blood, guts, and no glory. What I wasn’t accustomed to was the feeling of my heart being torn from my chest. What I was not acquainted with was desperation. Natasha was gone, and I had less than twenty-four hours to find her, or she’d be gone in a different way.Welcome back to Z Corp and Special Forces—Operation Alpha. New team, new badass former military heroes. Like the teams that have come before, Owen, Gabe, Myles, Kevin, and Cooper are ready for action. With a little help from Susan Stoker’s unparalleled cast of heroes.",
  "genres": [
    "Military Fiction",
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Military Romance",
    "Contemporary",
    "Amazon"
  ],
  "author": "Riley Edwards",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/56034464-owen"
}