{
  "title": "Revolutionary",
  "description": "Can she save him from the dark magic that's killing him?Beatrix Harper knows now that she loves Omnimancer Peter Blackwell—the insidious Vows that ensnared them are gone. But if she can't untangle the new enchantment trapping him in a coma, he'll never wake again.As if that wasn't enough, the fate of women's rights in her repressive country rests on her shoulders. Once blissfully anonymous, she's now in the crosshairs of wizards willing to do anything—anything—to maintain the status quo.Perhaps most dangerous of all is Beatrix's former best friend, a powerful witch who nearly killed Peter. She's out there somewhere. At any moment, she could strike again.As resourceful as Beatrix is, that's too many disasters to handle. How can she protect everyone and everything she cares about with wizards bearing down on her and a rogue witch closing in?Revolutionary is the final novel in the completed Clandestine Magic trilogy, set in an Edwardian-feeling 21st century America that appeals to fans of gaslamp fantasy, fight-the-patriarchy characters, intrigue and slow-burn romance with some steam.If you're a reader who prefers to know certain information upfront, including whether any tropes you hate are waiting to spring, scroll to the author biography for a link to those details.PRAISE FOR REVOLUTIONARY\"Clandestine Magic is the type of series that you think about long after you finish it, and Revolutionary is a wonderfully satisfying conclusion.\" — One Book More\"It feels more like I’m closing a chapter on my life, as though I’m saying goodbye to friends, and less like I’m simply closing a book. The trilogy is a highlight of my very bookish year.\" — itsKoo Reviews\"The story had me on the figurative edge of my seat, unable to get even close to guessing what would happen next. . ... The only bad thing about this book is that it had to end.\" — Life in the Book Lane Reviews",
  "genres": [
    "Fantasy",
    "Romance",
    "Magic",
    "Historical",
    "Fiction",
    "Urban Fantasy",
    "Enemies To Lovers"
  ],
  "author": "Colleen Cowley",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/56079547-revolutionary"
}