{
  "title": "Diary of the Holiday Season in Tokyo: Holiday Shopping, Christmas Cards, New Year’s Day and Japanese Girl",
  "description": "I love Christmas. So much. I am anxiously counting down to Christmas all year long, every year. At long last, the holiday season has come. I decorated the tree and my apartment joyfully. After the decorations were all put up, I got grabbed by a feeling of melancholy. Being in the holiday season means that it will be over soon. Even before Christmas Day comes, I lament for it to be over. How many days are there left to celebrate Christmas? Very few! A negative countdown has started...I finished sending out my Christmas cards. Japanese people don’t have a custom to send them. Instead, they send New Year post cards. I prefer a Christmas card though because a New Year card has some restrictions. For instance, it has to be arrived on New Year’s Day, or, you can’t send nor receive it when someone related to you has died the previous year because it is regarded as bad luck. I don’t make it time-consuming but once I start writing a Christmas card, I tend to take time decorating the card with stamps or stickers. Mostly, I would send them to my grandparents on both my father’s and mother’s sides. One by one I lost them and I have sent the cards fewer and fewer. In September, my grandmother on my mother’s side passed away. She was the last grandparent of mine. Now I have no grandparents and the number of Christmas cards I send is so small…You must be weary of reading about my dreams by now, but, I had an absolutely shocking dream just last night and have to write about it.I had a gathering with my relatives in a temple. A monk declared to hand out an envelope to the ones whose remaining days of life are 25 years. He handed it to my uncle. He received it cheerfully, saying that it was longer than he had thought. Then, the monk handed the envelope to ME! I choked with shock. I got pronounced that the rest of my life was only 25 years! For some reason, I’d always felt that I would live long and that short life never crossed my mind. I felt devastated and woke up.I can shrug it off as one of scary dreams, but as I’ve written, some of my dreams do tell the future. None of them has related to me so far, but what if this dream is the first future-telling one that concerns me…?I still linger on the dream I had, in which a monk told me that I had only 25 years more to live. I’ve given thought to life and death.I have plans for my future and a fairly good deal of hope, I guess. Suppose I work hard and achieve something, but the remaining time to enjoy it is so short.What’s the difference between now and then? Maybe life has nothing to do with achievement. Without realizing, I get influenced in a good way from someone, and I could influence someone as well. If I can encourage someone depressed through my music or whatever I do as I was encouraged, that’s more wonderful than superficial success.I think that’s life is all about. And above all, I’m not alone…",
  "genres": [],
  "author": "Hidemi Woods",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/56071919-diary-of-the-holiday-season-in-tokyo"
}