{
  "title": "10 Lessons for Living #LocationFree: An insider’s guide to living and working anywhere and everywhere",
  "description": "Do you wish you had the courage to follow your dream, to quench your wanderlust? To downsize, pack light and explore the world while still working? Do you honestly think others are able do it because they’re younger, richer, are single and have fewer responsibilities, with no kids to tag along? Wrong. That’s simply not true. This book will show you that it’s possible no matter what your age! Do you really want to play it safe just because you’re no longer in your twenties, waiting on tables as you backpack around the world? You’re a successful business owner, leader or employee who believes there has to be more, right? More freedom, flexibility, passion and travel. It’s not that you want to run away – just that your heart knows it’s time to fulfil your dreams and live larger! No matter what’s happening in the world, you can grab a #LocationFree life by the feisty horns.  Here you will learn about the ups and downs, the pros and cons, what to do and what to avoid at all costs. Of course, no matter what Instagram tells us, it’s not all glamour and gloss, and if you’re longing to listen to your heart, pack up your life and take the plunge, you need an insider’s view! This book is packed with honest insight and tips from Kate and other Global Nomads living their own version of this lifestyle.This book offers you a no-nonsense guide  • Cultivating the mindset for living #LocationFree• What’s amazing versus what sucks• Cracking the code, both emotionally and spiritually• Travelling, packing and wardrobe• Navigating relationships and remaining true to your heart• Levelling up and living like a local – fast!• Running a successful global business while on the road• Understanding the LAY Principle of looking after yourself• How to stay sane with routine, ritual and rhythm• Resources and hacks to keep life flowing.Kate has partnered with The Future Forest Company for the launch of her latest book, with 10% of each book sale contributing to their sustainable reforestation projects in Scotland. Each book sale will help The Future Forest Company not only plant more native broadleaf trees (on sites such as Glenaros on Mull), but will also contribute to delivering wildlife projects such as the continued reintroduction of white-tailed sea eagles. This is important to reduce Kate’s impact of travelling and the carbon footprint.Details of the number of trees planted will be updated on kate-emmerson.com",
  "genres": [],
  "author": "Kate Emmerson",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/56072522-10-lessons-for-living-locationfree"
}