{
  "title": "The Destroyer of Worlds: An Answer to Every Question",
  "description": "Mythologies collide in an epic war for the ages!Follow all the mythological beings you know & love (including Athena, Loki, and Susanoo) as they become entangled in a war between alien DINOSAURS and magical DRAGONS!The novel showcases THE MOST POWERFUL CHARACTERS EVER PUT TO PAPER. It also features major mythological events such as Ragnarok, the Titanomachy (Titan War), the Fall, Armageddon, and the Apocalypse in a surprisingly coherent, all-encompassing story!The book includes a logical explanation for the formation and structure of the cosmos: 'TDOW Theory.' It also explores such great questions as the meaning of life, the nature of God, the origins of evil, the source of suffering, the root cause of death, and the true price of freedom. BOOK HIGHLIGHTS:- Deep and interesting characters with their own separate plans & motivations- The most powerful character in the history of fiction- The most powerful female character in the history of fiction- Incredible plot twists & payoffs- Fulfilling character arcs- Surprisingly gritty, realistic, and believable- Action-packed from beginning to end- MORE SUBSTANCE packed into 500 physical pages than any other work of fiction- A daring, ambitious, one-of-a-kind plot- Superpowers and superheroes galore- A portion of proceeds go toward the World Literacy Foundation, improving literacy worldwide- Introduces a new cosmological theory & a new model for the universeMORE INFORMATION:- “The Destroyer of Worlds” took 20 years to write & underwent 22 revisions/edits!- It is sold as ONE BOOK rather than a series, providing a tremendous bargain and value to the customerDISCLAIMER:- This version is not recommended for children due to language and descriptions of violence, gore, and brief sexual situations.",
  "genres": [
    "Fantasy"
  ],
  "author": "Steven Seril",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/56059127-the-destroyer-of-worlds"
}