{
  "title": "Cute but Psycho",
  "description": "I'm certifiably insane. Just ask my amazing therapist. He's my soulmate and a vampiric serial killer. There's no one I'd rather stalk more.Except no more late night slinking for me. I'm in The Asylum, committed as a danger to myself and others. They tell me I'm delusional, which they aren't wrong...except about what.See, this place is made for supernaturals too dangerous to let roam free. The doctors, the staff, the family members that helped put us here are all in on it, trying to convince us magic is just another delusion. They plan to keep us here forever--sedated and docile.Aren't we all just perfect test subjects for inhumane experiments? Well, the doctors think so at least.Yeah... it's time to bust out of the loony bin. Unfortunately for our zookeepers we're the most dangerous supernaturals there are and we haven't been taking our medicine.A genetically modified super alpha wolf monster. An ultra rare basilisk, so poisonous he can't leave any skin exposed. My dreamy serial killing vampire therapist.Oh, and me. A genetic marvel, one of the few dhamphyr to ever exist and probably, just a little... more crazy than most.Nighty, night Asylum. Don't let the nightmares bite.Author Note: Full-length STANDALONE! This is a why choose/reverse harem dark paranormal romance where the female lead does not need to choose between her three male love interests. There are m/m scenes.Content warnings/tropes & other details: Breathplay/Edgeplay, Erotic, Asphyxiation, Blood play, Period/Menstrual Sex, Graphic violence/gore, Knife, violence, Death/murder, Dub-con and forced submission, primal play, knotting/vibration, DVP, DP, Domination/submission, consuming bodily fluids (blood, menstruation, c*m), spitting, masks, three-ways, four-way, anal, mm, mmf, rough oral, squirting, forced hospitalization, forced medication, abusive hospital staff, nonconsensual experimentation",
  "genres": [
    "Reverse Harem",
    "Dark",
    "Paranormal",
    "Dark Romance",
    "Fantasy",
    "Vampires",
    "Romance"
  ],
  "author": "Beatrix Hollow",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/56100947-cute-but-psycho"
}