{
  "title": "Aid Imperium: United States Foreign Policy and Human Rights in Post-Cold War Southeast Asia",
  "description": "Does foreign aid promote human rights? As the world's largest aid donor, the United States has provided foreign assistance to nearly 200 countries. Deploying global numerical data on US foreign aid and comparative historical analysis of America's post-Cold War foreign policies in Southeast Asia, Aid Imperium provides the most comprehensive explanation that links US strategic assistance to physical integrity rights outcomes in recipient countries, particularly in ways that previous quantitative studies have systematically ignored. The book innovatively highlights the active political agency of Global South states and actors as they negotiate and chart their political trajectories with the United States as the core state of the international system. Drawing from theoretical insights in the humanities and the social sciences as well as a wide range of empirical documents, Aid Imperium is the first multidisciplinary study to explain how US foreign policy affects state repression and physical integrity rights outcomes in Southeast Asia and the rest of the Global South.----Praise / Awards\"As someone who has straddled the worlds of human rights advocacy and comparative politics for many years, I have long been hoping to see such a wonderful book, one that is both theoretically sophisticated and empirically rich, and particularly one that combines true academic excellence with genuine experience of 'how things really work.' It should be read by scholars and practitioners alike.\"—Steve Heder, School of Oriental and African Studies\"In this clear-eyed and commendable study, Salvador Santino Fulo Regilme Jr. explores whether and how foreign aid can improve human rights outcomes—and sometimes sets them back. Theoretically rigorous, with illuminating case studies of US aid to Southeast Asia, this book opens a new era of debate on a crucial topic.\"—Samuel Moyn, author of  Not Human Rights in an Unequal World\"Does US foreign aid help or hurt human rights in recipient countries?  Aid Imperium , with unique scholarly insight, systematic rigor and conceptual care, offers nuanced answers to this important question. This is a must-read for anyone interested in US foreign policy and human rights.\"—Julian Go, Professor of Sociology, the University of Chicago\"At a time when the fate of democracy is in question, this book is a must read. It explores the complex effects of U.S. foreign strategic support on human rights. With a laser focus on the Philippines and Thailand, it explains how and why certain types of leaders use this support to empower the state to foster the repression of their peoples.\"—Emilie M. Hafner-Burton, Professor of Politics, School of Global Policy and Strategy, University of California, San Diego; author of  Making Human Rights a Reality\"Salvador Santino Fulo Regilme Jr. has assembled hard data to support his interpretation of an 'interest convergence theory' that quantifies what he refers to as the 'US Foreign Aid Imperium.' His excellent reportage also brings the story forward to today's headlines for readers unfamiliar with his two country cases.\"—Paul Rodell, Georgia Southern University\" Aid Imperium  is a must-read for those who seek deeper understanding of how foreign strategic assistance shapes physical integrity rights in the Global South. Regilme Jr offers a comprehensive and dynamic framework for how ideational factors shape the material consequences of foreign aid, and provides important insights into the conditions that facilitate domestic state repression and human rights abuse.\"—Shannon Lindsey Blanton, University of Alabama at Birmingham\"Regilme makes it possible to explain why authoritarian regimes seem to continue getting more aid without necessarily changing their repressiveness and human rights record.\"—Obert Hodzi, University of Liverpool",
  "genres": [],
  "author": "Salvador Santino Fulo Regilme Jr.",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/56089015-aid-imperium"
}