{
  "title": "The Reckoning: Our Nation's Trauma and Finding a Way to Heal",
  "description": "America is suffering from PTSD― The Reckoning diagnoses its core causes and helps us begin the healing process.For four years, Donald J. Trump inflicted an onslaught of overlapping and interconnected traumas upon the American people, targeting anyone he perceived as being an “other” or an enemy. Women were discounted and derided, the sick were dismissed as weak and unworthy of help, immigrants and minorities were demonized and discriminated against, and money was elevated above all else. In short, he transformed our country into a macro version of his malignantly dysfunctional family.How can we make sense of the degree to which our institutions and leaders have let us down? How can we negotiate a world in which all sense of safety and justice seems to have been destroyed? How can we―as individuals and as a nation―confront, process, and overcome this loss of trust and the ways we have been forever altered by chaos, division, and cruelty? And when the dust finally settles, how can we begin to heal, in the midst of ongoing health and economic crises and the greatest political divide since the Civil War?Mary L. Trump is uniquely positioned to answer these difficult questions. She holds a Ph.D. in clinical psychology specializing in trauma, has herself been diagnosed with post-traumatic stress disorder, and happens to be Donald J. Trump’s only niece. In The Reckoning , she applies her unique expertise to the task of helping us confront an all-encompassing trauma, one that has taken an immense toll on our nation’s health and well-being.A new leader alone cannot fix us. Donald J. Trump is only the latest symptom of a disease that has existed within the body politic since America’s inception―from the original sin of slavery through our unceasing, organized commitment to inequality. Our failure to acknowledge this, let alone root it out, has allowed it to metastasize. Now, we are confronted with the limits of our own agency on a daily basis. Whether it manifests itself in rising levels of rage and hatred, or hopelessness and apathy, the unspeakable stress of living in a country we no longer recognize has affected all of us for a long time, in ways we may not fully understand. An enormous amount of healing must be done to rebuild our lives, our faith in leadership, and our hope for this nation. It starts with The Reckoning .",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Audiobook",
    "Psychology",
    "Race",
    "Sociology"
  ],
  "author": "Mary L. Trump",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/56124858-the-reckoning"
}