{
  "title": "Bishop to Knight One",
  "description": "alternate cover edition of ASIN B08NXZW8ZYDeejay:I have spent every day of the last ten years taking in and caring for my sisters’ sons. The problem is, we’re the sons of Naiads and I’ve never met a Nymph of any kind that cared about her male offspring. The boys don’t inherit the magic required to care for and connect to the waters of the earth, therefore they’re useless to the Naiads. Never mind that I have enough magic to wipe all Naiads off the planet altogether. Not that I would. Probably. My nephews deserve better than their mothers, and as long as those Naiads keep bringing me their sons, I won’t have to destroy them. I’ll even take their stepsons off their hands.Yes, single parenting can get lonely. No, I’m not going to act on my attraction to my newest ‘nephew’, no matter how many boxes he ticks for me.Matt:The best thing my old man did for me and my brother was die. With him dead, his girlfriend brought Cary and me to live with her brother. Deejay is rich, powerful, and sometimes gives me heart palpitations. I will do whatever it takes except abandon him to make sure Deejay adopts my brother, even if that means I have to insinuate myself into every part of this powerful man’s life. I didn’t plan to woo him, but I won’t ignore the attraction between us for too much longer.After all, who knows how long I have left to live what with every other person I meet trying to kill me. I don’t know what I did to Houston’s Non-Humans, but I won’t go down without a fight. Bring it.Bishop to Knight One is a 115k age-gap MM paranormal romance.Trigger warnings include: off-page past child abuse and on-page descriptive violence. In this family, the boys have tragic backstories.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Magic",
    "Urban Fantasy",
    "Supernatural"
  ],
  "author": "Jennifer Cody",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/56122071-bishop-to-knight-one"
}