{
  "title": "Beyond the Vines",
  "description": "There are not many women like Celeste in 1918. She owns her own home, runs her own business, and refuses to give up this power to marry a man. Widowed at twenty-seven, Celeste has spent up all her child-bearing years to run the vineyard she inherited. Due to her wealth and status, Celeste is a prize many men want to win. Many have tried. All have failed.Willamina, Amina, is down on her luck. After her husband dies in the war, Amina marries Gus to ensure her son has a male figure and their survival. However, Gus turns out to have an awful temper, making Amina flee in the middle of the night with her son. With little money, Amina and her son must hitch-hike their way to Washington, where her family lives. It is Amina's last-ditch effort to ensure their survival.While driving to the market, Celeste comes across Amina and her son, hitch-hiking. Celeste picks up the stranded pair and instantly understands Amina's situation. Amina finds herself amazed by Celeste's independence and wishes she could have her own. Celeste informs Amina that she can and invites her to move in and work at the vineyard.Being a working mom is unlike anything Amina has ever experienced. Days are spent picking fruit, and evenings are reserved for her son. Amina finds herself exhausted from the hectic schedule and questions if she should move to Washington to find a husband there. What stops Amina from returning to what is comfortable is her freedom and friendship with Celeste. While different, Amina has never experienced living somewhere so fancy and a bond like the one she has with Celeste.Rumors around their community regarding Celeste's personal life and the relationships she keeps with women spark Amina's interest. Amina finds herself drawn to Celeste. And begins to feel emotions, unlike anything she's experienced before. And when Amina realizes that the rumors around town turn out as right, she wonders if there is a way Celeste might show her what it is like to love a woman.Will Celeste and Amina be able to love one another and build a unique family? Or will an unaccepting community shatter their yearning to love?",
  "genres": [
    "Historical Fiction",
    "Romance",
    "LGBT",
    "Lesbian",
    "Historical",
    "Historical Romance",
    "Fiction"
  ],
  "author": "Mariah R. Embry",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/56085992-beyond-the-vines"
}