{
  "title": "Rebel at Spruce High",
  "description": "TOBYIt's no secret I'm shy and sensitive. I'm perfectly content to spend my senior year at Spruce High keeping to myself, playing my video games, and avoiding eye contact with anything that breathes.That proves impossible the moment I meet Spruce High's newest student: Vann Pane.To be honest, he's kind of scary. Mysterious, full of attitude, and with a checkered past, it's no wonder everyone keeps their distance.That's why I'm surprised when he comes to my sudden rescue in a \"cafeteria food-fight Armageddon\" that sends all of Spruce High into a frenzy, defending me against the bullies that have made my life miserable since middle school.Is there something more than meets the eye about Vann, the rebellious new bad boy in town?VANNSpruce High is the third high school I've attended. Or is it the fourth?I'm not proud of my past. My parents aren't either. And the constant, nagging reminder that I'm just a problem they can't seem to solve is enough to make any misfit like me want to run away.All of that changes the moment I meet Toby Michaels.He's sweet, surprisingly funny, with a soul as squishy as a marshmallow. I can't resist my intense desire to protect the guy and stand up for him in the face of his pesky bullies. Toby gives me purpose.That purpose is about to be challenged when we're cast in a play together - and are made to rehearse one-on-one, in private. The way he looks into my eyes. What he's doing to my heart.I'm not sure I can stand it another second.Our already unlikely friendship is about to ignite into something deeper.Something neither of us will be able to control.✔️ M/M romance (between 18-year-olds)✔️ Friends-to-lovers✔️ Small-town charm & feel-good vibesHave you read all the books in the Spruce Texas series?Football SundaeBorn Again SinnerHeteroflexibleWrangledRebel At Spruce High ◄◄Summer SweatHopeful RomanticMr. Picture PerfectHot Mess Express(with more to come!)What about the Texas Beach Town spin-off series?In Too DeepCrusherFar From Paradise(more on the way!)",
  "genres": [
    "M M Romance",
    "Romance",
    "High School",
    "Audiobook",
    "Contemporary",
    "Young Adult",
    "LGBT"
  ],
  "author": "Daryl Banner",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/56097128-rebel-at-spruce-high"
}