{
  "title": "The Theft of the Ayn Noor",
  "description": "When Brill first hears the legend of the Ayn Noor—the light of the inner world—it is only a story. The child of a devout Christian and a prominent scientist, he isn’t supposed to believe in myths, especially those of the Pagani. But the tale of the diamond stirs something deep within him. It tells of the first people, who lived in a world below this one, dark and terrible.With the help of a benevolent goddess, they travelled by the light of the Ayn Noor up the spiral path and into the new world, trapping the jewel above. It is said that one day the time will come for the Ayn Noor to be returned, righting a great betrayal and restoring balance to both worlds. Until that day, the Pagani have sworn to protect it. Now, after two years of drought and disease, the mighty Ilyrian Empire is in disarray. In the far north, an uneasy detente exists between the fiercely independent Pagani and their conquerors. So when Ilyrian soldiers steal the Ayn Noor, the theft sparks a violent uprising that threatens to topple a tenuous peace. Reeling from the death of his father and coming of age in the capital city, Brill is beginning to sense that he does not fit in with the world around him. But when Pagani legend comes to his door, will he have the strength to follow the journey laid at his feet, even if it means abandoning all he has ever understood about himself? The first book in the Blue Snake series, The Theft of the Ayn Noor is interwoven with a cast of unforgettable characters—from a young warrior learning to wield her power, to a mysterious order of mystics, to the pompous and preening leaders of the ruling class. An epic adventure in the tradition of Dune and the His Dark Materials trilogy, Lartigue’s debut novel explores the tension between our physical and spiritual selves and what happens when our preconceived notions of identity dissolve.",
  "genres": [
    "Fantasy"
  ],
  "author": "Charles L.M. Lartigue",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/56100434-the-theft-of-the-ayn-noor"
}