{
  "title": "Forces of Life: Psychology and Success or Failure in Ourselves and Our Children",
  "description": "This is a journey into the forces that shape and control our life. The ideas others have embedded in our minds profoundly impact ourselves and our future, for better or worse. Understanding how this works is the beginning of gaining control over our own mind.This is a book about what they never told you in school. The most important facts of life are often ignored in our education. \"If only I knew then, what I know now...\" is the most common regret of life. It fairly screams the critical importance of knowledge. All of us know that there are things we could have done better in life if only we had, an understanding of life or people. Yet our educational system has failed to provide the knowledge.Psychology Controls the Biology of the Brain. from adrenalin to neurotransmitters. From the emotional reaction of our mind to a Hollywood horror movie, or from the peer group, or positive emotions from our parents, or society, the emotions embedded in our brains by others shape our anxiety and depression, or our success in life.The lack of the knowledge and information we need to survive and succeed in a difficult world has created vast problems in interpersonal relations, marriage, school, sex, the workplace, raising children, and every area of human existence. This book is one small beginning of an attempt to provide some of that knowledge.The nations who learn the “secrets” of how to motivate their children will outclass us in the decades to come. We will be left in the dirt.What is it that the most important minds in psychology and the most successful people know about succeeding in life? From Lincoln to Oprah, from Mark Twain to Elon Musk, J. B. Rowling, Einstein, Michael Jordan, and more, are the lessons of life that we never learned in school.Einstein, Rowling, Musk, and others understood one of the most important lessons to get across to ourselves and our children. Challenge yourself to change your life. Improve yourself. Practice life.",
  "genres": [],
  "author": "David Shepard",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/56133528-forces-of-life"
}