{
  "title": "America's Great Debate: Henry Clay, Stephen A. Douglas, and the Compromise That Preserved the Union",
  "description": "The spellbinding story behind the longest debate in US Senate the Compromise of 1850, which brought together Senate luminaries on the eve of the Civil War in a desperate effort to save the Union.The Mexican War introduced vast new territories into the United States, among them California and the present-day Southwest. When gold was discovered in California in the great Gold Rush of 1849, the population swelled, and settlers petitioned for admission to the Union. But the U.S. Senate was precariously balanced with fifteen free states and fifteen slave states. Up to then states had been admitted in pairs, one free and one slave, to preserve that tenuous balance in the Senate. Would California be free or slave? So began a paralyzing crisis in American government, and the longest debate in Senate history.Fergus Bordewich tells the epic story of the Compromise of 1850 with skill and vigor, bringing to life two generations of senators who dominated the great debate. Luminaries such as John Calhoun, Daniel Webster, and Henry Clay—who tried unsuccessfully to cobble together a compromise that would allow for California’s admission and simultaneously put an end to the nation’s agony over slavery—were nearing the end of their long careers. Rising stars such as Jefferson Davis, William Seward, and Stephen Douglas—who ultimately succeeded where Clay failed—would shape the country’s politics as slavery gradually fractured the nation.The Compromise saved the Union from collapse, but it did so at a great cost. The gulf between North and South over slavery widened with the strengthened Fugitive Slave Law that was part of the complex Compromise. In America’s Great Debate Fergus Bordewich takes us back to a time when compromise was imperative, when men swayed one another in Congress with the power of their ideas and their rhetoric, when partisans on each side reached across the aisle to preserve the Union from tragedy.",
  "genres": [
    "History",
    "American History",
    "Civil War",
    "Politics",
    "Nonfiction",
    "Biography",
    "American Civil War"
  ],
  "author": "Fergus M. Bordewich",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/12700570-america-s-great-debate"
}