{
  "title": "Apples Never Fall",
  "description": "#1 New York Times BestsellerA Peacock Original TV Series–Streaming SoonFrom #1 New York Times bestselling author Liane Moriarty comes a novel that looks at marriage, siblings, and how the people we love the most can hurt us the deepestThe Delaney family love one another dearly—it’s just that sometimes they want to murder each other . . .If your mother was missing, would you tell the police? Even if the most obvious suspect was your father?This is the dilemma facing the four grown Delaney siblings.The Delaneys are fixtures in their community. The parents, Stan and Joy, are the envy of all of their friends. They’re killers on the tennis court, and off it their chemistry is palpable. But after fifty years of marriage, they’ve finally sold their famed tennis academy and are ready to start what should be the golden years of their lives. So why are Stan and Joy so miserable?The four Delaney children—Amy, Logan, Troy, and Brooke—were tennis stars in their own right, yet as their father will tell you, none of them had what it took to go all the way. But that’s okay, now that they’re all successful grown-ups and there is the wonderful possibility of grandchildren on the horizon.One night a stranger named Savannah knocks on Stan and Joy’s door, bleeding after a fight with her boyfriend. The Delaneys are more than happy to give her the small kindness she sorely needs. If only that was all she wanted.Later, when Joy goes missing, and Savannah is nowhere to be found, the police question the one person who remains: Stan. But for someone who claims to be innocent, he, like many spouses, seems to have a lot to hide. Two of the Delaney children think their father is innocent, two are not so sure—but as the two sides square off against each other in perhaps their biggest match ever, all of the Delaneys will start to reexamine their shared family history in a very new light.",
  "genres": [
    "Fiction",
    "Mystery",
    "Audiobook",
    "Book Club",
    "Thriller",
    "Mystery Thriller",
    "Contemporary"
  ],
  "author": "Liane Moriarty",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/56143578-apples-never-fall"
}