{
  "title": "The High School Days in Kyoto: A Christmas tree, Catholic school and Jesus",
  "description": "I spent my teenage life at a privileged Catholic school. Most students came from wealthy families and some were famous. As a farmer’s daughter, I belonged to a few non-wealthy students. I thought a farming family was regarded as poor and unsophisticated in this school, and tried to hide the fact that I came from one as much as I could. Every time I submitted the paper on which the parents’ occupation should be stated, I put my thumb right on the word ‘Farming’ so that other students didn’t see it.There was a famous long-standing chain of high-end chestnut snack stores in the city which chain name was the same as my last name, and one day, a student casually said to me, “Your family owns the chain doesn’t it?” While the chain and I happened to share the same name, we actually had no relation. But she sounded so sure as if everyone believed so. It was three years since I had entered the school and my concealing operation might have worked. It was possible that no one besides my close friends knew I came from a farming family. I felt confident I looked cool and sophisticated enough for them to think I came from that wealthy chestnut chain family. Hoping their misunderstanding would last, I didn’t deny strongly and gave her an ambiguous reply. When I told my mother about it at home, she was very pleased and instructed me to keep them believing that way.I was walking toward the bus stop with my close friend after school one afternoon. When I cracked her up with my jokes and moves as usual, she said laughing, “You look like a peasant!” And the next moment, she gasped and added, “I’m sorry!” I wouldn’t have cared if she had kept laughing, but her serious apology offended me. She remembered I was a farmer’s daughter and thought her comment was inappropriate. I realized reference to a farming business required an apology, which meant she looked down on it.By the time I was a senior, I had grown weary of being a class clown just to be popular. I had tried everything to be cool but become doubtful if it was right to act someone else who wasn’t real me.For seniors, a teacher asked attendance to a table manners class at a gorgeous restaurant one by one. Since some students were busy preparing for the entrance examination of universities and colleges, they were allowed to opt out of the class. I was one of them and when my classmate behind me heard me answer “Not coming,” she started giggling. Then she said to me, “Even though your family is a farmer, you’d better learn table manners!” The girl next to her was also giggling and said, “That’s what we shouldn’t tell her!” It was a wake-up call. All those years every body had known my family was a farmer and laughed at me inwardly while I pretended to be cool. What I had been doing so hard for years was nothing.Since that day, I stopped acting a class clown and returned to my true quiet self. A couple of days later, in a class journal that all students would read, I wrote, “I’m a farmer’s daughter. Yet, I have been to a high-class restaurant and I do know table manners.”…",
  "genres": [],
  "author": "Hidemi Woods",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/56136051-the-high-school-days-in-kyoto"
}