{
  "title": "Vampire vs Vatican",
  "description": "When massive earthquakes ripple, simultaneously, all over the world, bringing chaos, scientists are puzzled – what is happening? V, the half-alien ancient vampire goddess, knows. Cardinal Xavier Ambrosiano, the leader of a secret satanic cult nested deep in the Vatican, has triggered a giant alien device buried deep in North Africa. The Crystal – and V is its custodian – is also known as the World-Destroyer. By twisting Earth’s gravitational field, it can tear the planet apart. Since before the time of Augustus Caesar, V has protected the Crystal. Since the time of Augustus Caesar, V has fought the satanic cult, and its ritual sacrifice of young women. Even now, monkish figures, disguised as Latin lovers, stalk the streets of Rome, hunting for ideal victims – young women to incarnate the goddess – who must be sacrificed in a black Mass, exorcising the feminine principle, casting women out of divinity, robbing them of their divine luster and power. To defeat the Cardinal, V needs allies. Father Patrick Michael O’Bryan, an Irish Jesuit and famous exorcist, dithers – V is a demon, obviously, but she is a flirtatious – and possibly good – demon. Should he cast her out, and kill her, or join her mission? Don U Pizzu, a dapper handsome Mafia Don and ruthless killer, is entranced. What to do? Gun the charming vampire down, or offer her roses and champagne? Kate Thornhill, a brilliant young scientist, is hypnotized by V’s beauty – and her sleek silky warrior outfit – a temptation for a girl of Kate’s martial temper. Time presses. Earthquakes, volcanic eruptions, and tsunamis sweep around the world. Tourists, caught in Rome, flee from dangerous buildings to the open spaces of the Roman Forum, which becomes the stage for a giant bacchanal, celebrating the end of the world. Vesuvius and Yellowstone erupt. Superstorms rage; cities collapse; chaos and terror spread. The end is nigh. At the last moment, just as Earth teeters on the edge of annihilation, just as Rome, the Eternal City, collapses into ruins, V faces off against Cardinal and the Intergalactic Evil Force he has welcomed into our universe. If V fails, humanity’s great adventure comes to an end. If V fails, nothing will be left of Earth but a cold dead asteroid belt, circling around the sun. A mad Cardinal, scheming prelates, human sacrifice, Mafia plots, Vatican scandals, a dying Pope, a damsel in distress, theological debates, a persnickety Jesuit, a gorgeous vampire, a sleek warrior woman, a galaxy of characters, a dying Earth, and an impending Apocalypse, all add up – to a sexy whirlwind adventure, for fans of Dan Brown, of the Exorcist, of the Godfather movies, and of dystopian and apocalyptic fiction.",
  "genres": [],
  "author": "Gilbert  Reid",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/56145612-vampire-vs-vatican"
}