{
  "title": "The Girl from Silent Lake",
  "description": "Her daughter, with emerald eyes and the sweetest smile, is everything to her. Her whole world. “Mommy,” the little girl says, touching her mother’s face with trembling fingers before she’s torn away. “Don’t cry.” Will she ever see her again?When single mother Alison Nolan sets off with her six-year-old daughter, Hazel, she can’t wait to spend precious time with her girl. A vacation in Silent Lake, where snow-topped mountains are surrounded by the colors of fall, is just what they need. But hours later, Alison and Hazel vanish into thin air.Detective Kay Sharp rushes to the scene. The only evidence that they were ever there is an abandoned rental car with a suitcase in the back, gummy bears in the open glove compartment and a teddy bear on the floor.Kay’s mind spins. A week before, the body of another woman from out of town was found wrapped in a blanket, her hair braided and tied with feathers. Instinct tells her that the cases are connected––and it won’t be long until more innocent lives are lost.As Kay leads a frenzied search, time is against her, but she vows that Alison and little Hazel will be found alive. She works around the clock, even though the small town is up in arms, saying she’s asking too many questions. Then she uncovers a vital clue – a photograph of the blanket that the first victim was buried in.Just when Kay thinks she’s found the missing piece, she realises she’s being watched. Is she getting too close, or is her own past catching up with her?With a little girl’s life on the line, Kay will stop at nothing. But will it be enough to get inside the mind of the most twisted killer she has ever encountered, or will another blameless child be taken?A totally gripping and utterly pulse-pounding crime thriller series for readers who love Lisa Regan, Robert Dugoni and Kendra Elliot. This twist-packed page-turner gives “unputdownable” a whole new meaning!",
  "genres": [
    "Thriller",
    "Mystery",
    "Crime",
    "Mystery Thriller",
    "Suspense",
    "Fiction",
    "Detective"
  ],
  "author": "Leslie Wolfe",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/56138672-the-girl-from-silent-lake"
}