{
  "title": "Why I FAILED in the Music Business: and How NOT to Follow in My Footsteps",
  "description": "OverviewA frank and honest discussion of the 8 reasons most musicians fail to build a long-term, music career and the proven “real world” skills and principles of business that are rarely taught to people in “the arts.” It is full of usable tips and tools about finance, marketing, sales, communication, strategy, goals and people that can be applied directly to their music career. When they finish the book, readers will have a written plan based on who they are, the things they want to do, and the life they want to live.The Book• Introduction - why musicians must look to the “real world” of business for how to succeed in “the arts.”1. I Thought Talent Was Enough (The many things needed for success) - talent is a given, it’s everything else that makes the difference in building a successful career.2. I Thought I Had Enough Talent (Self-development - you can learn it all) - everything outside of talent and musical skill can be learned. Successful people do it everyday.3. The Company I Kept (You can’t do it alone - Networking and crabs in a bucket) - success is a team sport. Association with the right people is the foundation to a successful career - and life.4. How I Kept My Company (You own a business and it’s YOU!) - musicians are much too close to their art to make the right career decisions. That’s why they have to act like CEOs.5. My Attitude (The power of belief) - whether a person believes they’ll fail or succeed, they’re right.6. I Was Dreaming (Is what you want real? Make sure.) - the only thing worse than failing is to succeed in the wrong thing.7. I Was Hoping (The power of a right goal.) - most people spend far more time planning vacations than they do planning their lives.8. I Wanted to be a STAR (What you want is a LIFE!) - why the “why” is the most important element in success. The reason to succeed has to be bigger than the pain of overcoming failure.9.You, Inc. - how to put everything in the book into a usable plan that is actually used.• Resources - where and how to learn moreBioSteve Grossman is a husband/father, a businessman and an encourager who is passionate about living fully alive and helping others do the same. Following a 20 year career as a Grammy award winning drummer, he joined and climbed the corporate ladder of a privately held firm in the Automotive Industry. Now well into his third career as an author, speaker and consultant, Steve encourages individuals and businesses to uncover what it is they're meant to do and how to do that well. He currently lives in Smyrna, TN with his bride of 25 years and their two children.",
  "genres": [],
  "author": "Steve Grossman",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/12701329-why-i-failed-in-the-music-business"
}