{
  "title": "A Billionaire for Christmas",
  "description": "For surviving 2020, you deserve A Billionaire for Christmas. Heck, you deserve SEVEN billionaires for Christmas.It’s been a wild ride this year. So 7 of your favorite romance authors have teamed up to raise a glass of eggnog, sit in front of the fire, and give you 7 billionaire holiday romance novels to help you make it through this last month of the year with a hot billionaire by your side, in his Maserati, with his staff cleaning your house.Thank you, romance authors.And what’s in this little holiday present just for you, all tied up in a bow? Infatuation by Willow Winters -- \"Maybe the chill that traveled down my spine when I first saw him was a warning. A warning that once he laid eyes on me, I was his to keep. A warning that this man would stop at nothing to have me. A warning I wasn’t given until it was too late.”Sweet Liar by Laurelin Paige -- He isn't looking for love. She's looking for lessons and is certain he'll be the best teacher. If he agrees, can this Love Scrooge keep his heart?A Very Dare Christmas by Carly Phillips -- Ian Dare misses the alone time and intense sex life he and his wife shared before their children were born. What’s an alpha man to do? He kidnaps Riley for an erotic weekend away before the Christmas rush overwhelms them both. Riley Dare adores her husband and she’s excited to spend time with him minus distractions on a sexy retreat where anything goes … and spontaneity leads to future surprises. A complete stand-alone for people who haven’t yet read Dare to Love but a special treat for those who want to revisit their favorite couple.Delight Me by J. Kenner -- There’s one special gift Damien wants to give his wife Nikki and their daughters for Christmas… but with a crisis brewing and time running out, can he make it home in time for the holidays?Christmas Shopping for a Billionaire by Julia Kent -- When Shannon is called to the mall to work as a sexy Christmas elf, her billionaire boyfriend, Declan, gets roped into playing Santa. The mall mommies start tweeting pictures, and soon everyone is crashing the mall to have a seat on Santa's lap. Ho ho... ahem.Bossy Bride by JA Huss -- Jesse Boston is the man of my dreams so I’m gonna marry him. I’m not real picky about how that happens but when my mother invites my childhood nemesis, KAREN, to plan our wedding AND be one of my bride’s maids? Uh---no. We’re going to elope to Vegas on Christmas Eve, get hitched in the most ridiculous way possible, and then fly home in time for dinner. We’ve got it all figured out. Nothing can go wrong.Santa, Baby by Blair Babylon – Peyton Cabot hates his life: being a rock star, performing for screaming crowds, being interviewed for magazines’ hottest musician of the year articles, winning awards, and banking loads of money. Yeah, it sucks to be him. Especially when the one woman who really gets him won’t return his calls anymore. When he goes to see what’s up, he gets a Christmas surprise that really rings his sleigh bells.(Maserati and house-cleaning staff not included.)",
  "genres": [
    "Christmas",
    "Romance",
    "Anthologies",
    "Holiday",
    "Amazon",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Carly Phillips",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/56128523-a-billionaire-for-christmas"
}