{
  "title": "A Wagon Train Weekend",
  "description": "It was just one night at a Victorian B&B. Until they woke up in 1857.Collette Donaldson never should have taken her boyfriend to her cousin’s wedding. Or introduced him to her parents. After a disastrous weekend, all she wants is to get back home and sort out the mess that had once been their relationship. A heartbreaking fight, a flat tire, and an inconvenient storm force her and Seth to stay the night at a quaint bed and breakfast. But when Collette finds an antique photograph of herself, circumstances quickly shift from weird to unimaginable.Seth Stone was ready to propose. Now he isn’t sure if he and Collette even have a relationship. People he'd never want to be his in-laws, an irritable girlfriend, and now he has to spend the night in a creepy old Victorian inn. He should have never wondered how things could possibly get worse. When they wake up stranded on a wagon train in 1857, Seth is determined to get home. But the only way to get out of the past is to face the problems stealing their future.♥ The Back Inn Time series short novels are fun, faith-filled stories of what it might be like to suddenly experience life in a different time. These clean historical romances are packed with humor and adventure. Perfect for fans of dual timeline or time slip stories and Christian historical romance, these books answer the question ever historical fiction fan wonders—what would it be like if I went back to that time? If you enjoy the wholesomeness of Amish, Western, or frontier fiction and adore romantic comedies, then a visit a seaside Victorian inn where you can “step back inn time and leave your troubles behind!” is for you.",
  "genres": [
    "Time Travel",
    "Historical Fiction",
    "Christian Fiction",
    "Romance",
    "Christian",
    "Contemporary",
    "Fiction"
  ],
  "author": "Stephenia H. McGee",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/56150076-a-wagon-train-weekend"
}