{
  "title": "Religion and the Rise of Capitalism",
  "description": "From one of the nation's preeminent experts on economic policy, a major reassessment of the foundations of modern economic thinking that explores the profound influence of an until-now unrecognized force—religion.\"Friedman has given us an original and brilliant new perspective on the terrifying divisions of our own times. No book could be more important.” —George A. Akerlof, Nobel Laureate in Economics Critics of contemporary economics complain that belief in free markets—among economists as well as many ordinary citizens—is a form of religion. And, it turns out, that in a deeper, more historically grounded sense there is something to that idea. Contrary to the conventional historical view of economics as an entirely secular product of the Enlightenment, Benjamin M. Friedman demonstrates that religion exerted a powerful influence from the outset. Friedman makes clear how the foundational transition in thinking about what we now call economics, beginning in the eighteenth century, was decisively shaped by the hotly contended lines of religious thought within the English-speaking Protestant world. Beliefs about God-given human character, about the after-life, and about the purpose of our existence, were all under scrutiny in the world in which Adam Smith and his contemporaries lived. Friedman explores how those debates go far in explaining the puzzling behavior of so many of our fellow citizens whose views about economic policies—and whose voting behavior—seems sharply at odds with what would be to their own economic benefit. Illuminating the origins of the relationship between religious thinking and economic thinking, together with its ongoing consequences, Friedman provides invaluable insights into our current economic policy debates and demonstrates ways to shape more functional policies for all citizens.",
  "genres": [
    "Economics",
    "History",
    "Religion",
    "Nonfiction",
    "Politics",
    "Philosophy",
    "Christianity"
  ],
  "author": "Benjamin M. Friedman",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/56165497-religion-and-the-rise-of-capitalism"
}