{
  "title": "Autumn Bridge",
  "description": "In the year 1311, in the highest tower of Cloud of Sparrows Castle, a beautiful woman sits by the window, watching as enemies gather below and fires spread through the night. As she calmly awaits her fate, she begins to write, carefully setting down on a scroll the secret history of the Okumichi clan…of the gift of prophecy they share and the extraordinary destiny that awaits them.For six centuries, these remarkable writings lay hidden—until they are uncovered by an American woman, a missionary named Emily Gibson, who arrived in Edo harbor in 1861, in flight from a tragic past. Soon an extraordinary man would enter her life: Lord Genji of the Okumichi clan, a nobleman with a gift of prophecy who must defend his embattled family—and confront forbidden feelings for an outsider in his midst. Emily, too, soon finds herself at a turning point; courted by two westerners, she knows her heart belongs to the one man she cannot have. But Emily has found a mission of her own: translating Genji’s ancestral history, losing herself in an epic tale of heroism and forbidden love.For here is the story of Lady Shizuka, the beautiful witch-princess who has enchanted Okumichi men for generations…of Genji’s ancestors, Lord Hironobu and Lord Kiyori, and of the terrible betrayals that befell them…and of Genji’s parents: a wastrel father and his child bride whose tragic love has shaped Genji as a leader and as a man. As Emily sifts through the fragile scrolls, she begins to see threads of her own life woven into the ancient writings. And as past and present collide, a hidden history comes to life, and with it a secret prophecy that has been shrouded for centuries, and may now finally be revealed. Takashi Matsuoka’s spellbinding novel is infused with spectacle, intricately woven, magically told. Autumn Bridge is a feast for the senses, a work of truly dazzling storytelling.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Japan",
    "Fantasy",
    "Historical",
    "Japanese Literature",
    "Novels"
  ],
  "author": "Takashi Matsuoka",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/56149.Autumn_Bridge"
}