{
  "title": "The Leopard Licks Its Spots",
  "description": "Leroy is a leopard cub who lives in the Savannah with his family. He has a best friend called Lapa, and the two cubs enjoy playing together every day. One day, Leroy and Lapa notice one of the other leopards, Loopy Leopard, doing something that they know is wrong. They report the theft to Leroy's grandfather, Grandpa Leopard.On hearing the news, Grandpa Leopard, the wisest of all the leopards and a very important and respected figure amongst the leopard pride, immediately calls a meeting for all the leopards. He announces the punishment that he has decided Loopy Leopard must endure for his transgression. Leroy and Lapa, satisfied that justice has been served, then speak to Grandpa Leopard, and he shares a valuable lesson with them. They don’t understand what he is saying and ask him to explain, but Grandpa Leopard is old and needs to rest. He assures them that that they will learn the lesson themselves soon enough.Shortly afterwards, the two cubs are playing together when they find themselves in a tempting situation. Before they know it, they have succumbed to temptation and are doing exactly the same bad thing that Loopy Leopard had done. Because they have seen Loopy Leopard being punished, they know that what they are doing is wrong, but it seems like a good idea at the time, so they do it anyway.What will happen next? Will the naughty leopards be caught, and if so, will they be punished, or will Grandpa Leopard take pity on them, just because he is part of Leroy’s family?Read on to find out!The Leopard Licks its Spots is a lovely story which conveys important life lessons to young children in a relatable way. It teaches them that if something is considered wrong, it is wrong for everyone, not only for certain people. The story also teaches them about facing consequences for one’s actions, and not to expect preferential treatment just because you may know, or be close to, somebody in a position of authority.",
  "genres": [],
  "author": "K.A.  Mulenga",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/56159295-the-leopard-licks-its-spots"
}