{
  "title": "La escritora muerta",
  "description": "Anna es una escritora de mediana edad que crió a su hija sola. En la actualidad Berta ha crecido, y las dudas que le supondría conocer a su padre, a quien solo ha visto en una fotografía, se incrementan cuando la relación que mantiene con su novio entra en crisis. Hans trabaja en una fábrica y tiene una hermana, Clara, una joven incomprendida que vive obsesionada por un tipo que conduce una moto amarilla. Pero es, ante todo, la historia de Anna Flieder, que cuando opta por escribir un libro de estilo más biográfico, la inspiración la visita y toma la forma de aquel hombre a quien hace años abandonó.\"Una obra dirigida a quienes les gusta leer y se dejan absorber por la lectura, porque deja mucha imaginación, y hay muchas cosas que se intuyen.\" -La Mañana\"Una invitación a todos los que aprecian la Literatura reflejada sobre sí misma en una obra. Personajes con sentimientos y en situaciones que provocan, inevitablemente, una identificación. El deleite de un texto literario que sobresale por un lenguaje metafórico y sugiere imágenes reveladoras que a menudo la vida no nos permite ver.\" -Dra. Alexandra Santos Pinheiro\"El libro cuenta la historia de una escritora, el mundo y la vida de quienes la rodean. Anna vive su vida literaria como la real, sufre un tipo de esquizofrenia cuando los personajes de sus libros chocan con su vida en su deseo de ver la luz.\" -Debbie Garrick\"El libro demuestra no solo el buen hacer de su autora sino además su manejo del lenguaje. Un lúcido artefacto literario que satisfará el variopinto gusto del lector contemporáneo.\" -Letralia\"Núria Añó teje con una maestría que va muy lejos y ahonda en la exploración del individuo contemporáneo.\" -Noury Bakrim\"El proceso de creación literario descrito como algo sombrío y poético. Una escritora se atreve con la autobiografía, y se enreda en nostalgias reprimidas hasta la fecha. Un libro inteligentemente vital.\" -Sarah Raabe",
  "genres": [
    "Fiction",
    "Spanish Literature",
    "Spain",
    "Novels",
    "Cultural"
  ],
  "author": "Núria Añó",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/56150978-la-escritora-muerta"
}