{
  "title": "Busted",
  "description": "Daughter of an over protective world-champion fighter, and shielded by dozens of alpha men, Emma Kincaid was locked in an ivory tower many years ago.Too bad she shimmied down water pipes the moment she was old enough to do so. Coercing with the devil twins is as natural as breathing to her, and getting into trouble with them is as easy as falling in love.For Emma, falling in love is easy—it’s a known family trait—but falling out of love may be the hardest thing she’ll ever have to do.*Dealt a tough hand since birth, and accused of being the devil since day one, Rob Hart was punished accordingly, and watched with distrust.Any time golden girl Emma Kincaid was in his presence, she finds herself in danger.Or at least, that’s how her father sees it.In reality, Emma is the courter of danger, the instigator of illegal activities, and Rob is the unfortunate fall-guy who endures the punishments of Em’s misdeeds.It’s a small price to pay, after all, to be with his soulmate day after day.Best friends to the death, Rob and Emma know everything about each other: except where their hearts lie, and just when they decide to try something new, Rob’s past smacks into them harder than any explosion that came before.Rob and Emma are destined to be together, but to get their happily ever after, they must overcome a pain so few in their family know about.Can friends who want to be so much more see past the shards of destruction engulfing them? Or will their blooming relationship bust before it truly begins?BUSTED is a love story that spans two decades, two proms, three ex boyfriends, years of potential prison time, one pet food factory, and an explosion that will rock the world and change everything the Rollers have ever known.",
  "genres": [
    "Mixed Martial Arts",
    "Sports",
    "Romance",
    "Contemporary Romance",
    "Sports Romance",
    "Friends To Lovers"
  ],
  "author": "Emilia Finn",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/56145899-busted"
}