{
  "title": "The Second Mrs. Astor",
  "description": "Perfect for fans of Jennifer Chiaverini and Marie Benedict, this riveting novel takes you inside the scandalous courtship and catastrophic honeymoon aboard the Titanic of the most famous couple of their time—John Jacob Astor and Madeleine Force. Told in rich detail, this novel of sweeping historical fiction will stay with readers long after turning the last page.Madeleine Talmage Force is just seventeen when she attracts the attention of John Jacob “Jack” Astor. Madeleine is beautiful, intelligent, and solidly upper-class, but the Astors are in a league apart. Jack’s mother was the Mrs. Astor, American royalty and New York’s most formidable socialite. Jack is dashing and industrious—a hero of the Spanish-American war, an inventor, and a canny businessman. Despite their twenty-nine-year age difference, and the scandal of Jack’s recent divorce, Madeleine falls headlong into love—and becomes the press’s favorite target.On their extended honeymoon in Egypt, the newlyweds finally find a measure of peace from photographers and journalists. Madeleine feels truly alive for the first time—and is happily pregnant. The couple plans to return home in the spring of 1912, aboard an opulent new ocean liner. When the ship hits an iceberg close to midnight on April 14th, there is no immediate panic. The swift, state-of-the-art RMS Titanic seems unsinkable. As Jack helps Madeleine into a lifeboat, he assures her that he’ll see her soon in New York…Four months later, at the Astors’ Fifth Avenue mansion, a widowed Madeleine gives birth to their son. In the wake of the disaster, the press has elevated her to the status of virtuous, tragic heroine. But Madeleine’s most important decision still lies ahead: whether to accept the role assigned to her, or carve out her own remarkable path…",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Book Club",
    "Audiobook",
    "Historical Romance"
  ],
  "author": "Shana Abe",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/56161317-the-second-mrs-astor"
}