{
  "title": "Chuck the Cheetah",
  "description": "Chuck the cheetah is the fastest runner in the land and loves to race his cheetah friends, Chip, Chum and Chester. Chuck especially loves racing because, whether he is competing at the Daily Friendly Races, the Weekly Fun Races or the Monthly Championship Races, he is always the first one over the finish line. Because he is always the winner and has never experienced failure, Chuck starts thinking he is better than everyone else. He cannot imagine ever losing a race and ever being anything less than number one. But Chuck’s cheetah friends also want a chance to be the ones to run through the ribbon. They gather together and try and come up with ways to beat Chuck in the races. They decide to approach Chuck and ask him how he would feel if, for once in his life, he wasn’t the winner. Chuck haughtily dismisses their suggestion as ridiculous and says it would never happen. At the next daily race, something out of the ordinary happens. Chuck experiences a setback while he is racing. Before he knows it, Chuck has lost his first ever race in the whole history of cheetah races. Well, he certainly didn’t see that coming! Feeling devastated and highly embarrassed, Chuck worries that his cheetah friends won’t like him anymore. He behaves like a sore loser and finds himself unable to be happy for the friend who beat him. While all the other cheetah friends are congratulating the new winner on his achievement, Chuck sulks and can’t even bring himself to say, “Well done!” to his speedy friend. Chuck has never felt worse in his life and everything seems to have gone wrong for him. That night, Chuck is visited in a dream by a wise old cheetah. The sage cat gently explains the true meaning of winning to Chuck and offers him some valuable advice about how to deal with failure. Will Chuck take heed of the cheetah’s wise words? Is it too late to save his friendship with Chip, Chum and Chester? Will they forgive him for his big-headedness and will they still like him, even though he is no longer the undefeated champion of the cheetah races? Read on to find out… Chuck the Cheetah is a delightful story which explains the well-known adage, “Pride comes before a fall” in a refreshing way that is relatable and enjoyable for young readers. Chuck’s experience warns children of the danger of smugness and arrogance, teaches them about the nature of true friendship, and offers valuable lessons about the art of winning and losing graciously. Children will recognise the sense of competition amongst the cheetah friends and will be able to identify with the characters – whether they see themselves as Chuck, or as any of his cheetah friends. The story contains many important messages for children. It teaches them that just because you are not the best, you are not any less lovable; it teaches them that life is not always about coming first; and it teaches them about true friendship – where we celebrate each other’s successes, stay humble and always congratulate each other for trying our best.",
  "genres": [],
  "author": "K.A.  Mulenga",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/56159315-chuck-the-cheetah"
}