{
  "title": "Girl, 11",
  "description": "\"Propulsive... Not only is the book difficult to put down, it’s also an adroit exploration of the ethical quandaries of true-crime storytelling, particularly in podcasts.\"—The New York Times Book Review   Elle Castillo once trained as a social worker, supporting young victims of violent crime. Now she hosts a popular true crime podcast that focuses on cold cases of missing and abducted children.   After four seasons of successfully solving these cases in Minnesota’s Twin Cities, Elle decides to tackle her white The Countdown Killer. Twenty years ago, TCK was terrorizing the community, kidnapping and ritualistically murdering three girls over seven days, each a year younger than the last. Then, after he took his eleven-year-old victim, the pattern—and the murders—abruptly stopped. No one has ever known why.   When Elle follows up on a listener tip only to discover the man’s dead body, she feels at fault. Then, within days, a child is abducted—a young girl who seems to fit suspiciously into the TCK sequence halted decades before. While media and law enforcement long ago concluded that TCK had suicided, Elle has never believed TCK was dead. She had hoped her investigation would lay that suspicion to rest, but her podcast seems instead to be inciting new victims.  “A masterful, heart-pounding suspense that ushers in an astonishing new voice in crime fiction.\" —Samantha M. Bailey, internationally bestselling author of Woman on the Edge “A tale of obsession, dark histories, and one woman’s quest to bring a terrifying killer to justice, GIRL, 11 is delivered with poise, style, and cunning - making it impossible to put down.” —Alex Segura, acclaimed author of Miami Midnight and Blackout",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Crime",
    "Audiobook",
    "Suspense"
  ],
  "author": "Amy Suiter Clarke",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/56172290-girl-11"
}