{
  "title": "Rideshare Revelations From An LA Uber Driver: The Highlights, The Lowlights and The Darkness",
  "description": "What really happens inside an Uber? Rideshare passengers can be fun, interesting and very entertaining. But some individuals are strange, deeply troubled or bizarre at times. So fasten your seatbelts and get ready for some wild rides around   Southern California.  Imagine your riding inside the Uber as you navigate through the diverse neighborhoods of Los Angeles and nearby cities. You can expect the unexpected because you never know what might happen when strangers get inside your vehicle. Forget what you previously thought about rideshare work and prepare to be shocked and surprised as you drive off into the unknown.Mark Nisall is a retired public safety veteran who completed 6,056 trips while driving 61,200 miles by working part time over three years. With 29 years of combined experience in law enforcement and judicial administration, he is uniquely well qualified to authentically narrate his most memorable rideshare adventures. These wide ranging situations are portrayed in clear and vivid detail so readers can vicariously experience them as if they were actually there.      In this book, you will •     A Swedish woman who encounters a naked homeless man inside her Bronson Canyon home below the Hollywood Sign.•    A Forensic Mortician who performs autopsies and embalming services under contract with the Los Angeles International Airport.•     An NBA basketball player over 7 feet tall at the SLS Hotel in Beverly Hills.•     The A-list television star and his entourage at the Catch LA Restaurant on Melrose Avenue.•     A transgendered woman and You Tube star who also works as a woman's swimsuit model.•     The entire defensive line for the UCLA Football Team on their way to an In-And-Out Burger Restaurant in Westwood.•     Three Escorts who stop at a Seven Eleven store to buy condoms before meeting their clients at a Beverly Hills Hotel.•    A famous Porn Star and internet business woman who shares the details of her adult film career and offers relationship advice to her Uber driver.You'll also  How drug and alcohol abuse affects the behavior of many passengers especially on the weekends.The prevalence of mental illnesses amongst passengers, other rideshare drivers and the homeless.The medieval, putrid and dangerous conditions in and around of our growing homeless encampments that are visible and unavoidable in almost every neighborhood of the city. Rideshare work is engaging and compelling, but it's random and unpredictable as well. So if you thought you've seen and heard it all before, you couldn't be more wrong. Discover that whatever happens inside an Uber, doesn't necessarily stay inside the Uber. So pick up your copy today by clicking the BUY NOW button at the top of this page.",
  "genres": [],
  "author": "Mark Alan Nisall",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/56198783-rideshare-revelations-from-an-la-uber-driver"
}