{
  "title": "Breaking Ground: The Lower Elwha Klallam Tribe and the Unearthing of Tse-whit-zen Village",
  "description": "In 2003, a backhoe operator hired by the state of Washington to work on the Port Angeles waterfront discovered what a larger world would soon learn. The place chosen to dig a massive dry dock was atop one of the largest and oldest Indian village sites ever found in the region. Yet the state continued its project, disturbing hundreds of burials and unearthing more than 10,000 artifacts at Tse-whit-zen village, the heart of the long-buried homeland of the Klallam people.Excitement at the archaeological find of a generation gave way to anguish as tribal members working alongside state construction workers encountered more and more human remains, including many intact burials. Finally, tribal members said the words that stopped the \"Enough is enough.\"Soon after, Lower Elwha Klallam Tribe chairwoman Frances Charles asked the state to walk away from more than $70 million in public money already spent on the project and find a new site. The state, in an unprecedented and controversial decision that reverberated around the nation, agreed.In search of the story behind the story, Seattle Times reporter Lynda V. Mapes spent more than a year interviewing tribal members, archaeologists, historians, city and state officials, and local residents and business leaders. Her account begins with the history of Tse-whit-zen village, and the nineteenth- and twentieth-century impacts of contact, forced assimilation, and industrialization. She then engages all the voices involved in the dry dock controversy to explore how the site was chosen, and how the decisions were made first to proceed and then to abandon the project, as well as the aftermath and implications of those controversial choices.This beautifully crafted and compassionate account, illustrated with nearly 100 photographs, illuminates the collective amnesia that led to the choice of the Port Angeles construction site. \"You have to know your past in order to build your future,\" Charles says, recounting the words of tribal elders. Breaking Ground takes that teaching to heart, demonstrating that the lessons of Tse-whit-zen are teachings from which we all may benefit.A Capell Family Book",
  "genres": [
    "History",
    "Nonfiction",
    "Native American",
    "Anthropology"
  ],
  "author": "Lynda V. Mapes",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/5619259-breaking-ground"
}