{
  "title": "Scythe",
  "description": "\"OMG, this was absolutely amazing! Meimi is badass, brilliant, and snarky… And the setting! The world described is very dark and technically advanced with super interesting sciency stuff, aliens, and tons of mystery.\" - Diary of a Wannabe WriterI’m Meimi Archer, your regular high school science geek for hire. Sure, it’s dangerous to create high-tech gizmos for a criminal overlord called the Scythe, but it keeps Mom and me safely off-grid. Ever since the Authority took over the United Americas, you either live inside a domed city (where you’re watched 24-7) or you scrape by on illegal money while hiding out in the sticks. Guess what category I fall into? Long story short, everything's fine until I screw up a job. Badly. My home slips into two-dimensional space-time. It only lasts for a few seconds, but the move still sets off about a dozen government alarms. If they track me down, Mom and I are good as dead. Now I need to pay someone off, hide the evidence, and keep us safe. Fast. That’s when a hottie named Thorne materializes in my kitchen. He’s about my age, wears black body armor, and says he came to “this version of Earth” from another planet. We share a bizarre mind-meld moment before he vows to do anything that ensures I survive. Hey, I’ll take all the help I can get. Plus, Thorne has dimples... \"This kept me on my toes… Be it random science, opening portals to new dimensions, evading capture, doing shady deals with crime bosses, betrayal, the humdrum of school with Lead Camper Dave (snicker), to hot (alien) man-candy sent to help save the day. Pick this up and expect to get sucked in to the Dimension Drift.\" - Smada’s Book Smack Dimension Drift SeriesA dystopian adventure with science, snark and hot aliens 1. Scythe2. Umbra3. Alien Minds4. ECHO Academy5. Drift WarriorAlso From Christina Bauer- Angelbound, the story of a part-demon girl who fights evil souls in Purgatory’s Arena- Fairy Tales of the Magicorum, a series of modern fairy tales with sass, action and romance- Beholder, where a medieval farm girl discovers necromancy and true love- Pixieland Diaries, with sassy pixie Calla and 'her' elf prince, Dare",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Science Fiction",
    "Romance",
    "Dystopia",
    "Aliens",
    "Paranormal"
  ],
  "author": "Christina Bauer",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/56212122-scythe"
}