{
  "title": "The City of Snow & Stars",
  "description": "A gritty YA Christian Fantasy tackling difficult topics surrounding abuse, human trafficking, and the question \"Why does God let bad things happen?\"A girl who can duplicate herself.A prince on the run from his future.A man hiding from his past.A fate that binds them together.Gifted with the power to perfectly duplicate herself, Trinia flees from her power-hungry father who wishes to use her ability for his own means. Born of the ancient Airgíd race that once ruled with an iron fist, she’s hated by all, and now she must seek their help to stop the coming genocide.Jayden wants nothing to do with his birthright as the Crown Prince of Ungäar. Having faked his death nearly three years ago, he finds himself caught up in a string of events that pull him away from his desire for freedom, toward a fate he’s tried to escape.A man of legend, Údar sought refuge in the Forest of Nex to nurse his bitterness and anger toward Elohai for his wife’s death. But Elohai has not forgotten him, nor is his calling fulfilled. Drawn out of hiding by the promise of revenge, he finds the world has changed... and not for the better.-II-Filled with sweeping landscapes, terrifying creatures, and deep lore, Wintenaeth is a land held together by a fragile peace between the Four Kingdoms. After the fall of the Old Airgíd Empire, the Four Kingdoms rose from the ashes to rule, but the Airgíd have not forgotten what was taken from them, and there are some who will do whatever it takes to rebuild it. Even if that means seeking help from the Queen of the Banshees.The City of Snow & Stars is book one in the Cities of Wintenaeth Trilogy and the first in a larger story which takes place over the twelve books planned in the series.Grab your copy and join the growing community of readers!\"The City of Snow & Stars is a fast-paced, skillfully crafted story that will leave readers wanting to read the next book in the series.\" - Romuald Dzemo, Reviewer at Reader's Favorite",
  "genres": [
    "Fantasy",
    "Christian Fiction",
    "Young Adult",
    "Epic Fantasy",
    "Fiction"
  ],
  "author": "S.D.   Howard",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/56224345-the-city-of-snow-stars"
}