{
  "title": "Paola Santiago and the Forest of Nightmares",
  "description": "Best-selling author Rick Riordan presents the sequel to Tehlor Kay Mejia's critically acclaimed own-voices novel about science-obsessed Paola Santiago. \n\n\"Paola is a brilliant, furious girl who often trusts her brain but trips over her heart.\"--Sarah Gailey, Hugo and Locus award-winning author of River of Teeth\n\nSix months after Paola Santiago confronted the legendary La Llorona, life is nothing like she'd expected it to be. She is barely speaking to her best friends, Dante and Emma, and what's worse, her mom has a totally annoying boyfriend. Even with her chupacabra puppy, Bruto, around, Pao can't escape the feeling that she's all alone in the world.Pao has no one to tell that she's having nightmares again, this time set in a terrifying forest. Even more troubling? At their center is her estranged father, an enigma of a man she barely remembers. And when Dante's abuela falls mysteriously ill, it seems that the dad Pao never knew just might be the key to healing the eccentric old woman.Pao's search for her father will send her far from home, where she will encounter new monsters and ghosts, a devastating betrayal, and finally, the forest of her nightmares. Will the truths her father has been hiding save the people Pao loves, or destroy them?Once again Tehlor Kay Mejia draws on her Mexican heritage to tell a wild and wondrous story that combines creatures from folklore with modern-day challenges.\n\nComplete your middle grade collection with these best-selling fan favorites:Rick Riordan Presents Aru Shah and the End of Time by Roshani ChokshiRick Riordan Presents Tristan Strong Punches a Hole in the Sky by Kwame MbaliaRick Riordan Presents Sal and Gabi Break the Universe by Carlos HernandezThe Percy Jackson and the Olympians series by Rick RiordanThe Trials of Apollo series by Rick Riordan",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Mythology",
    "Fiction",
    "Adventure",
    "Young Adult",
    "Magic"
  ],
  "author": "Tehlor Kay Mejia",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/56209478-paola-santiago-and-the-forest-of-nightmares"
}