{
  "title": "Like Other Girls",
  "description": "\"What if I played football?\" I ask. As soon as it's out of my mouth, I feel stupid. Even suggesting it feels like I've overstepped some kind of invisible line we've all agreed not to discuss. We don't talk about how Mara is different from other girls. We don't talk about how Mara is gay but no one says so. But when I do stuff like this, I worry it gets harder for us all to ignore what's right in front of us. I direct my gaze to Quinn. \"What do you think?\"\"I think it's frickin' genius,\" he says.After getting kicked off the basketball team for a fight that was absolutely totally not her fault (okay maybe a little her fault), Mara is dying to find a new sport to play to prove to her coach that she can be a team player. A lifelong football fan, Mara decides to hit the gridiron with her brother, Noah, and best friend, Quinn-and she turns out to be a natural. But joining the team sets off a chain of events in her small Oregon town-and within her family-that she never could have predicted.Inspired by what they see as Mara's political statement, four other girls join the team. Now Mara's lumped in as one of the girls-one of the girls who can't throw, can't kick, and doesn't know a fullback from a linebacker. Complicating matters is the fact that Valentina, Mara's crush, is one of the new players, as is Carly, Mara's nemesis-the girl Mara fought with when she was kicked off the basketball team. What results is a coming-of-age story that is at once tear-jerking and funny, thought-provoking and real, as Mara's preconceived notions about gender, sports, sexuality, and friendship are turned upside down.Britta Lundin's sophomore novel will give readers all the feels, and make them stand up and cheer.",
  "genres": [
    "LGBT",
    "Young Adult",
    "Lesbian",
    "Contemporary",
    "Romance",
    "Sports",
    "Queer"
  ],
  "author": "Britta Lundin",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/56221776-like-other-girls"
}