{
  "title": "Mr. Lincoln's Army",
  "description": "A vivid account of the early battles, first in the Pulitzer Prize-winning “One of America’s foremost Civil War authorities” (Kirkus Reviews). The first book in Bruce Catton’s Pulitzer Prize–winning Army of the Potomac Trilogy, Mr. Lincoln’s Army is a riveting history of the early years of the Civil War, when a fledgling Union Army took its stumbling first steps under the command of the controversial general George McClellan. Following the secession of the Southern states, a beleaguered President Abraham Lincoln entrusted the dashing, charismatic McClellan with the creation of the Union’s Army of the Potomac and the responsibility of leading it to a swift and decisive victory against Robert E. Lee’s Army of Northern Virginia. Although a brilliant tactician who was beloved by his troops and embraced by the hero-hungry North, McClellan’s ego and ambition ultimately put him at loggerheads with his commander in chief—a man McClellan considered unworthy of the presidency.   McClellan’s weaknesses were exposed during the Battle of Antietam, the bloodiest day in American military history, which ended in a stalemate even though the Confederate troops were greatly outnumbered. After Antietam, Lincoln ordered McClellan’s removal from command, and the Union entered the war’s next chapter having suffered thousands of casualties and with great uncertainty ahead.   America’s premier chronicler of the nation’s brutal internecine conflict, Bruce Catton is renowned for his unparalleled ability to bring a detailed and vivid immediacy to Civil War battlefields and military strategy sessions. With tremendous depth and insight, he presents legendary commanders and common soldiers in all their complex and heartbreaking humanity.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American Civil War",
    "American History",
    "War",
    "Military History"
  ],
  "author": "Bruce Catton",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/562407.Mr_Lincoln_s_Army"
}