{
  "title": "Surviving Hitler, Evading Stalin: One Woman’s Remarkable Escape from Nazi Germany",
  "description": "The peaceful farm life of a teenage girl in Germany is abruptly upended when WWII comes knocking at her family’s door. One month before her sixteenth birthday, Mildred “Mickchen” Schindler and her family are captured by Russian Soldiers. Having already survived life in Hitler’s Nazi Germany, they now face the terror of a new enemy—Stalin’s Red Army. Driven from their home, Mildred and her family become refugees along with a sad, slow-moving caravan of other families who have suffered the same fate. Cleverly disguised by her mother, Mildred avoids being taken to a work camp until one morning when authorities arrive unexpectedly. Her father has already been taken by Russian soldiers, and now she is taken from her mother and brother. Mildred recounts, in meticulous detail, her treacherous journey and the roller coaster of raw emotions she experiences —fear, regret, loneliness, humility, perseverance, and defiance. Mildred’s odyssey of making her way home and finding her family in a war-torn countryside takes many riveting twists and turns. The discovery of a secret, hidden document offers hope for a brighter future. From harrowing to heartwarming, this memoir provides a unique perspective of a Gentile girl’s road to resilience and her fortitude against all odds to forge a life filled with love and laughter. \"Surviving Hitler, Evading Stalin\" is a remarkable testimony to the strength of the unconquerable human spirit and an endearing account of God’s faithfulness in the midst of faithless circumstances.Surviving Hitler, Evading Stalin has garnered numerous awards. Mildred was personally awarded the National Medal of Honor by the National Society Daughters of the American Revolution (NSDAR) in September of 2021 and received the Women in American History Medal in June of 2022.2020 Sunbury Press SUNNY Award2021 Mississippi Library Association Non-fiction Author Award2021 American Book Fest - Best Book Award Autobiographies & Memoirs2021 Sunbury Press SUNNY Award2022 Illumination Book Award Silver Biography/Memoir-Inspiration2022 International Book Autobiography/memoir",
  "genres": [
    "Memoir",
    "World War II",
    "Nonfiction"
  ],
  "author": "Mildred Janzen",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/56241666-surviving-hitler-evading-stalin"
}