{
  "title": "Why Pro-Life?: Caring for the Unborn and Their Mothers",
  "description": "So much is at stake in the abortion debate. If pro-choicers are right, precious freedoms are in jeopardy. If pro-lifers are right, innocent children are being robbed of their most basic freedom—life. Though bumpersticker slogans prevail, the facts are rarely presented. We need clear and credible answers to the central questions of the abortion debate. For those who have had abortions or are currently considering one, for pro-choicers and fence-straddlers alike, Why Pro-Life? provides answers to these questions in a concise, straightforward, and nonabrasive manner. Human Life Begins… When ?No issue is more divisive or troubling than abortion. Many believe that we have to choose between helping women and helping children. This book shows how critical it is that we help both. In a concise, non-abrasive fashion, Randy Alcorn offers compassionate, factual answers to the central issues of the abortion debate.[ Insert Sarah Marie Switzer image ] An award-winning photo of an operation on Sarah Marie Switzer, a twenty-four-week unborn child with spina bifida. Sarah, here grasping a surgeon’s finger, was reinserted into her mother’s womb and born two months later, nine weeks premature.[ Insert 3-D Real-Time ultrasound image ] A 3-D ultrasound photo of a baby 21 weeks after conception—just over halfway through the pregnancy. Modern technology offers a window to the womb that is changing the face of the abortion debate.Story Behind the BookThere have always been likable people who hold to wrong positions on ethical issues—including slavery and anti-Semitism. Sincere people can be wrong and often are. We need a clear presentation of what is true. Randy Alcorn has intervened for the unborn and their mothers—and at great personal cost. In writing this book on one of today’s critical issues, he has endeavored to lay out well-supported facts on why the pro-life position is right and true when it comes to valuing human life.",
  "genres": [
    "Nonfiction",
    "Christian",
    "Christianity",
    "Politics",
    "Christian Living",
    "Christian Non Fiction",
    "Religion"
  ],
  "author": "Randy Alcorn",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/562490.Why_Pro_Life_"
}