{
  "title": "Înainte",
  "description": "Iulia Dobre-Trifan, autoarea cărții „Provocări și echilibru în coaching executiv pragmatic” și unul din autorii cărții „Calendarul zâmbetelor realiste” creează un roman despre devenire, vindecare și curaj, ce se ramifică, pe durata a 40 de ani, întrețesând personaje complexe din lumi diferite, ce gravitează în jurul unei axe atemporale comune: dorința de fericire.Lia, o femeie tenace, care lucrează cu succes, pe cont propriu, de mulți ani, începe un nou proiect, de suflet: o ceainărie în care oamenii obosiți vor putea să se odihnească și să își regăsească echilibrul.Trecută prin întâmplări care i-au pus la încercare, de multe ori, voința și încrederea în drumul propriu, Lia este preocupată de a-i ajuta pe cei care au cu adevărat nevoie. Adună în jurul ei oameni talentați, alături de care dorința ei prinde formă și, zi de zi, ceainăria visată devine un loc protector, al inocenței.Dar nu totul este ceea ce pare… Unii vizitatori ascund intenții întunecate. Atrași de lumina și frumusețea ceainăriei și lăsându-se în voia naturii lor prădătoare, atacă în moduri subtile și feroce.Cum va reuși Lia să apere armonia prezentului de forțele tulburătoare ale acestora? „Suntem învățați să privim lumea în alb și negru, bine și rău, drept sau nedrept. Autoarea ne arată o lume plină de nuanțe aflate într-o continuă schimbare, ce ne obligă și ne provoacă să o (re)descoperim cu fiecare pas.” – Ciprian Dobre-Trifan „O poveste captivantă ce evocă încrucișarea unor destine diferite. Abordarea unui stil de viață închis, retras, plin de umbre se ciocnește cu făurirea armonioasă a unui destin luminos, încărcat cu magie pragmatică.” – Andrei Cristian „În tinerețe, credeam că îi pot salva pe toți. Pe toți cei care se cereau salvați și care mă impresionau cu poveștile lor de victime, năpăstuite, pradă unor circumstanțe nefaste cărora nu puteau să le facă față. Și mă implicam în poveștile lor nefericite, luând asupra mea responsabilitatea de a îi ajuta pe ei să iasă la lumină, să găsească ieșirea din acele labirinturi de neșanse și neputințe. Mi-au trebuit câteva relații terminate prost ca să înțeleg că e imposibil să salvezi pe cine nu se vrea salvat sau, cu atât mai mult, pe cine nu este dispus să se implice în propria-i salvare.”  „Câți oameni, atâtea fantezii despre fericire. Cele mai multe, din păcate, ajung rareori să existe, în realitate. Și de aici se naște conflictul interior care ne macină pe fiecare. Să vrei să fie într-un fel viața ta, plină de emoția aceea și realitatea să fie, de fapt, alta. Și tu să te convingi că totuși este așa cum îți imaginezi tu că este. Așa cum idealizezi tu. Așa cum ți-ai dori tu să cunoști fericirea. Sau echilibrul. Pentru că fericirea și echilibrul sunt același lucru.\"",
  "genres": [
    "Romanian Literature",
    "Relationships",
    "Fiction",
    "Contemporary"
  ],
  "author": "Iulia Dobre-Trifan",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/56249635-nainte"
}