{
  "title": "Becky Chambers 4 Book set: The Long Way to a Small, Angry Planet / A Closed and Common Orbit / Record of a Spaceborn Few / To Be Taught, If Fortunate",
  "description": "The Long Way to a Small, Angry PlanetWhen Rosemary Harper joins the crew of the Wayfarer, she isn't expecting much. The ship, which has seen better days, offers her everything she could possibly want: a small, quiet spot to call home for a while, adventure in far-off corners of the galaxy, and distance from her troubled past. But Rosemary gets more than she bargained for with the Wayfarer. The crew is a mishmash of species and personalities, from Sissix, the friendly reptillian pilot, to Kizzy and Jenks, the constantly sparring engineers who keep the ship running. Life on board is chaotic, but more or less peaceful - exactly what Rosemary wants.A Closed and Common OrbitLovelace was once merely a ship's artificial intelligence. When she wakes up in a new body, following a total system shut-down and reboot, she has to start over, in a world where her kind are illegal. She's never felt so alone. But she's not alone, not really. Pepper, one of the engineers who risked life and limb to reinstall Lovelace, is determined to help her adjust to her new world. Because Pepper knows a thing or two about starting over.Record of a Spaceborn FewCenturies after the last humans left Earth, the Exodus Fleet is a living relic, a place many are from but few outsiders have seen. Humanity has finally been accepted into the galactic community, but while this has opened doors for many, those who have not yet left for alien cities fear that their carefully cultivated way of life is under threat.To Be Taught, If FortunateCarrying all the trademarks of her other beloved works, including brilliant writing, fantastic world-building and exceptional, diverse characters, Becky's first book outside of the Wayfarers series is sure to capture the imagination.Ariadne is explorer. As an astronaut on an extrasolar research vessel, she and her fellow crewmates sleep between worlds and wake up each time with different features. Her experience is one of fluid body and stable mind and of a unique perspective on the passage of time. Back on Earth, society changes dramatically from decade to decade, as it always does. Ariadne may awaken to find that support for space exploration back home has waned, or that her country of birth no longer exists, or that a cult has arisen around their cosmic findings, only to dissolve once more by the next waking. But the moods of Earth have little bearing on their mission: to explore, to study, and to send their learnings home.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Cozy",
    "LGBT"
  ],
  "author": "Becky  Chambers",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/56245002-becky-chambers-4-book-set"
}