{
  "title": "The White Mosque",
  "description": "A historical tapestry of border-crossing travelers, of students, wanderers, martyrs and invaders,  The White Mosque  is a memoiristic, prismatic record of a journey through Uzbekistan and of the strange shifts, encounters, and accidents that combine to create an identity. In the late nineteenth century, a group of German-speaking Mennonites traveled from Russia into Central Asia, where their charismatic leader predicted Christ would return.Over a century later, Sofia Samatar joins a tour following their path, fascinated not by the hardships of their journey, but by its aftermath: the establishment of a small Christian village in the Muslim Khanate of Khiva. Named Ak Metchet, “The White Mosque,” after the Mennonites’ whitewashed church, the village lasted for fifty years. In pursuit of this curious history, Samatar discovers a variety of characters whose lives intersect around the ancient Silk Road, from a fifteenth-century astronomer-king, to an intrepid Swiss woman traveler of the 1930s, to the first Uzbek photographer, and explores such topics as Central Asian cinema, Mennonite martyrs, and Samatar’s own complex upbringing as the daughter of a Swiss-Mennonite and a Somali-Muslim, raised as a Mennonite of color in America.A secular pilgrimage to a lost village and a near-forgotten history, The White Mosque traces the porous and ever-expanding borders of identity, asking: How do we enter the stories of others? And how, out of the tissue of life, with its weird incidents, buried archives, and startling connections, does a person construct a self?Finalist for the 2023 PEN/Jean Stein Book Award.Winner of the 2023 Bernard J. Brommel Award for Biography & Memoir (Midland Authors Book Award).",
  "genres": [
    "Memoir",
    "Nonfiction",
    "History",
    "Travel",
    "Religion",
    "Asia",
    "Biography"
  ],
  "author": "Sofia Samatar",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/56241377-the-white-mosque"
}