{
  "title": "At Night All Blood Is Black",
  "description": "\"Astonishingly good.\" —Lily Meyer, NPR\"So incantatory and visceral I don’t think I’ll ever forget it.\" —Ali Smith, The Guardian | Best Books of 2020One of the Wall Street Journal's 11 best books of the fall | One of The A.V. Club's fifteen best books of 2020 |A Sunday Times best book of the yearNamed a most anticipated book by Literary Hub | Electric Literature| The Millions | Refinery29Selected by students across France to win the Prix Goncourt des Lycéens, David Diop’s English-language, historical fiction debut At Night All Blood is Black is a “powerful, hypnotic, and dark novel” (Livres Hebdo) of terror and transformation in the trenches of the First World War.Alfa Ndiaye is a Senegalese man who, never before having left his village, finds himself fighting as a so-called “Chocolat” soldier with the French army during World War I. When his friend Mademba Diop, in the same regiment, is seriously injured in battle, Diop begs Alfa to kill him and spare him the pain of a long and agonizing death in No Man’s Land. Unable to commit this mercy killing, madness creeps into Alfa’s mind as he comes to see this refusal as a cruel moment of cowardice. Anxious to avenge the death of his friend and find forgiveness for himself, he begins a macabre ritual: every night he sneaks across enemy lines to find and murder a blue-eyed German soldier, and every night he returns to base, unharmed, with the German’s severed hand. At first his comrades look at Alfa’s deeds with admiration, but soon rumors begin to circulate that this super soldier isn’t a hero, but a sorcerer, a soul-eater. Plans are hatched to get Alfa away from the front, and to separate him from his growing collection of hands, but how does one reason with a demon, and how far will Alfa go to make amends to his dead friend?Peppered with bullets and black magic, this remarkable novel fills in a forgotten chapter in the history of World War I. Blending oral storytelling traditions with the gritty, day-to-day, journalistic horror of life in the trenches, David Diop's At Night All Blood is Black is a dazzling tale of a man’s descent into madness.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Africa",
    "War",
    "Historical",
    "Literary Fiction",
    "Senegal"
  ],
  "author": "David Diop",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/56268795-at-night-all-blood-is-black"
}