{
  "title": "Ladyparts",
  "description": "A frank, witty, and dazzlingly written memoir of one woman trying to keep it together while her body falls apart—from the New York Times bestselling author of Shutterbabe I’m crawling around on the bathroom floor, picking up pieces of myself. These pieces are not a metaphor. They are actual pieces. Twenty years after the publication of her iconic Shutterbabe, we remeet Deborah Copaken at her darkly comedic nadir: battered, broke, divorcing, dissected, and dying—literally—on sexism’s battlefield as she deliriously scoops up what she believes to be her internal organs, which have fallen out of her body, into a glass Tupperware container before heading off to the hospital for emergency surgery . . . in an UberPool.Part cri de coeur cautionary tale, part dystopian tragicomedy, Ladyparts is Copaken’s irreverent inventory of both the female body and the body politic of womanhood in America. With her journalist’s eye, her novelist’s heart, and her performer’s sense of timing, she provides a frontline account of one woman brought to her knees by the one-two-twelve punch of divorce, solo motherhood, lack of healthcare, unaffordable childcare, shady landlords, her father’s death, college tuitions, sexual harassment, corporate indifference, ageism, sexism, and just plain old bad luck. Plus seven serious illnesses, one on top of the other, which provide the book’s narrative skeleton: vagina, uterus, breast, heart, cervix, brain, and lungs. She keeps bouncing back from each bum body part and finding the black humor in every setback, but in her slippery struggle to survive a steep plunge off the middle-class ladder, she is suddenly awoken to what it means to have no safety net.Turning her Harlem home into a commune to pay rent and have childcare, she trades her life as a bestselling novelist to apply for full-time corporate gigs that come with health insurance but often not scruples. She gets fired from a health magazine for being unhealthy; laid off from a PR firm for rushing home to deal with a child’s medical emergency; and sexually harassed out of her newspaper column, only to be grilled by the FBI when her harasser is offered a plum job in the White House.Side-splittingly funny one minute, a freak horror show the next, and quintessentially American, Ladyparts is an era-defining memoir for our time.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Feminism",
    "Audiobook",
    "Biography",
    "Humor",
    "Book Club"
  ],
  "author": "Deborah Copaken",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/56262771-ladyparts"
}