{
  "title": "American Kleptocracy: How the U.S. Created the World's Greatest Money Laundering Scheme in History",
  "description": "A remarkable debut by one of America's premier young reporters on financial corruption, Casey Michel's American Kleptocracy offers the first explosive investigation into how the United States of America built the largest illicit offshore finance system the world has ever known.\"An indefatigable young American journalist who has virtually cornered the international kleptocracy beat on the US end of the black aquifer.\"—The Los Angeles Review of Books For years, one country has acted as the greatest offshore haven in the world, attracting hundreds of billions of dollars, and potentially more, in illicit finance tied directly to corrupt regimes, extremist networks, and the worst the world has to offer. But it hasn’t been the sleepy, sand-splattered Caribbean islands, or even traditional financial secrecy havens like Switzerland or Panama, that have come to dominate the offshoring world. Instead, the country profiting the most from modern offshoring also happens to be the one that still claims to be the moral leader of the free world, and the one that claims to be leading the fight against the crooked and the corrupt: the United States of America.From anonymous shell companies and legal inventions like “perpetual trusts” to public relations and lobbying shops willing to do anything they can to camouflage the source of the dirty money, the United States’ transformation into the center of global offshoring is complete. And while Donald Trump presented, in many ways, the ultimate culmination of the U.S.’s descent, the country’s trajectory has been decades in the making.American Kleptocracy will examine just how the United States’ implosion into a center of global offshoring took place: how states like Delaware and Nevada perfected the art of the anonymous shell company, and how post-9/11 reformers watched their success usher in a new flood of illicit finance directly into the U.S.; how African despots and post-Soviet oligarchs came to dominate American coastlines, American industries, and entire cities and small towns across the American Midwest; how Nazi-era lobbyists birthed an entire industry of spin-men whitewashing trans-national crooks and despots, and how dirty money has now begun infiltrating America's universities and think tanks and cultural centers; and how those on the front-line are trying to restore America's legacy of anti-corruption leadership—and finally end this reign of American kleptocracy. It will also look at how Trump’s presidency accelerated all of the trends already on hand—and how the Biden administration can, and should, act on this inheritance.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Business",
    "Economics",
    "Finance",
    "American"
  ],
  "author": "Casey Michel",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/56268811-american-kleptocracy"
}