{
  "title": "A Previous Life",
  "description": "______________'Elegant, filthy – and quite possibly the queerest thing you will read all year.' - Guardian'Intriguing and inventive.' - Electric Literature, \"Most Anticipated LGBTQ+ Book of the Year\"'A dizzyingly enticing and kaleidoscopic take on the spectrum of sexual experiences.' - Publishers Weekly, starred review_____________A daring, category-confounding, and ruthlessly funny novel from National Book Award honored author Edmund White that explores polyamory and bisexuality, aging and love.Sicilian aristocrat and musician, Ruggero, and his younger American wife, Constance, agree to break their marital silence and write their Confessions. Until now they had a ban on speaking about the past, since transparency had wrecked their previous marriages. As the two alternate reading the memoirs they’ve written about their lives, Constance reveals her multiple marriages to older men, and Ruggero details the affairs he’s had with men and women across his lifetime―most importantly his passionate affair with the author Edmund White.Sweeping outward from the isolated Swiss ski chalet where the couple reads to travel through Europe and the United States, White’s new novel pushes for a broader understanding of sexual orientation and pairs humor and truth to create his most fascinating and complex characters to date. As in all of White’s earlier novels, this is a searing, scintillating take on physical beauty and its inevitable decline. But in this experimental new mode―one where the author has laid himself bare as a secondary character―White explores the themes of love and age through numerous eyes, hearts and minds.Delightful, irreverent, and experimental, A Previous Life proves once more why White is considered a master of American literature.",
  "genres": [
    "Fiction",
    "Queer",
    "LGBT",
    "Romance",
    "Literary Fiction",
    "Gay",
    "Adult"
  ],
  "author": "Edmund White",
  "average_rating": "2.99",
  "url": "https://www.goodreads.com/book/show/56268846-a-previous-life"
}