{
  "title": "Lucky Man: A Memoir",
  "description": "A funny, highly personal, gorgeously written account of what it's like to be a 30-year-old man who is told he has an 80-year-old's disease.\"Life is great. Sometimes, though, you just have to put up with a little more crap.\" -- Michael J. FoxIn September 1998, Michael J. Fox stunned the world by announcing he had been diagnosed with Parkinson's disease -- a degenerative neurological condition. In fact, he had been secretly fighting it for seven years. The worldwide response was staggering. Fortunately, he had accepted the diagnosis and by the time the public started grieving for him, he had stopped grieving for himself. Now, with the same passion, humor, and energy that Fox has invested in his dozens of performances, he tells the story of his life, his career, and his campaign to find a cure for Parkinson's.Combining his trademark ironic sensibility and keen sense of the absurd, he recounts his life -- from his childhood in a small town in western Canada to his meteoric rise in film and television which made him a worldwide celebrity. Most importantly however, he writes of the last 10 years, during which--with the unswerving support of his wife, family, and friends -- he has dealt with his illness. He talks about what Parkinson's has given the chance to appreciate a wonderful life and career, and the opportunity to help search for a cure and spread public awareness of the disease. He is a very lucky man, indeed.The Michael J. Fox FoundationMichael J. Fox is donating the profits from his book to the Michael J. Fox Foundation for Parkinson's Research, which is dedicated to fast-forwarding the cure for Parkinson's disease. The Foundation will move aggressively to identify the most promising research and raise the funds to assure that a cure is found for the millions of people living with this disorder. The Foundation's web site, MichaelJFox.org , carries the latest pertinent information about Parkinson's disease,",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Audiobook",
    "Inspirational"
  ],
  "author": "Michael J. Fox",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/562674.Lucky_Man"
}