{
  "title": "Trejo: My Life of Crime, Redemption, and Hollywood",
  "description": "For the first time, the full, fascinating, and inspirational true story of Danny Trejo’s journey from crime, prison, addiction, and loss to unexpected fame as Hollywood’s favorite bad guy with a heart of gold.On screen, Danny Trejo the actor is a baddie who has been killed at least a hundred times. He’s been shot, stabbed, hanged, chopped up, squished by an elevator, and once, was even melted into a bloody goo. Off screen, he’s a hero beloved by recovery communities and obsessed fans alike. But the real Danny Trejo is much more complicated than the legend.Raised in an abusive home, Danny struggled with heroin addiction and stints in some of the country’s most notorious state prisons, including San Quentin and Folsom, from an early age, before starring in such modern classics as Heat, From Dusk till Dawn, and Machete. Now, in this funny, painful, and suspenseful memoir, Danny takes us through the incredible ups and downs of his life, including meeting one of the world’s most notorious serial killers in prison and working with legends like Charles Bronson and Robert De Niro.In honest, unflinching detail, Danny recounts how he managed the horrors of prison, rebuilt himself after finding sobriety and spirituality in solitary confinement, and draws inspiration from the adrenaline-fueled robbing heists of his past for the film roles that made him a household name. He also shares the painful contradictions in his personal life. Although he speaks everywhere from prison yards to NPR about his past to inspire countless others on their own road to recovery and redemption, he struggles to help his children with their personal battles with addiction, and to build relationships that last.Redemptive and painful, poignant and real, Trejo is a portrait of a magnificent life and an unforgettable and exceptional journey through tragedy, pain, and, finally, success that will transfix and inspire.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Crime",
    "Biography Memoir"
  ],
  "author": "Danny Trejo",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/56269833-trejo"
}