{
  "title": "Guardians of the Trees: A Journey of Hope Through Healing the Planet: A Memoir",
  "description": "A \"magnificent, empowering\" (Bill McKibben) memoirabout a woman spearheading a global initiative to heal the world’s rainforestsand the communities who depend on themWhen Kinari Webb first traveled to Indonesian Borneo at 21 to study orangutans, she was both awestruck by the beauty of her surroundings and heartbroken by the rainforest destruction she witnessed. As she got to know the local communities, she realized that their need to pay for expensive healthcare led directly to the rampant logging, which in turn imperiled their health and safety even further. Webb realized her true calling was at the intersection of medicine and conservation.After graduating with honors from the Yale School ofMedicine, Webb returned to Borneo, listening to local communities about theirsolutions for how to both protect the rainforests and improve their lives. Foundingtwo non-profits, Health in Harmony in the U.S. and ASRI in Indonesia, Webb andher local and international teams partnered with rainforest communities,building a clinic, developing regenerative economies, providing educationalopportunities, and dramatically transforming the region. But just wheneverything was going right, Webb was stung by a deadly box jellyfish and wouldspend the next four years fighting for her life, a fight that would lead her torethink everything. Was she ready to expand her work to a global scale and takeclimate change head on? Full of hope and optimism, Webb takes us on an exhilarating, galvanizing journey across the world, sharing her passion for the natural world and for humanity. In our current moment of crisis, Guardians of the Trees is an essential roadmap for moving forward and the inspiring story of one woman’s quest to heal the world.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Memoir",
    "Environment",
    "Audiobook",
    "Medicine",
    "Ecology"
  ],
  "author": "Kinari Webb",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/56269017-guardians-of-the-trees"
}