{
  "title": "Core of Conviction: My Story",
  "description": "Michele Bachmann is one of the most compelling leaders in America. But despite all the magazine covers and cable television stories, most people don’t know who she really is, where she comes from, or what she believes. So she decided to tell her own story and let the reader decide. As you’ll learn in this fascinating memoir, Bachmann wasn’t the type of kid who started dreaming about the White House in elementary school. She grew up in Iowa and Minnesota as a typical midwestern girl, grounded by her family and her faith. She was raised to believe in the American that anyone could succeed if they worked hard and took advantage of this country’s boundless opportunities. She followed her dreams to college and law school, pursued a career as a federal tax attorney, started a successful business with her loving husband, raised five great kids and (over time) twenty-three foster children. By her early forties she was very happy as a full-time mom and homemaker and was a leading education reform advocate in Minnesota. Then she became what she calls “an accidental politician.” The political insiders who ran Minnesota held a one-party line—Al Franken-style liberalism. Bachmann became especially concerned about a state-mandated education curriculum that stressed political correctness over academic excellence. She started making calls, writing letters, and recruiting others to act. When her state senator (an entrenched insider) refused to listen, someone had to challenge him for his seat. No one else volunteered, so Bachmann jumped in—and won. That was the start of an amazing journey from obscurity to the state senate, to the U.S. Congress, to an underdog campaign for president. Along the way her style has been consistent. She says what she means and she does it. She is the rare political figure who fights for her beliefs. She speaks from the heart, with common sense about limited government, the sanctity of life and marriage, the power of free enterprise, and the need to confront America’s enemies. She also talks about putting principles above partisanship, even if that means ruffling the feathers of the Republican elite. As Bachmann puts it, the Republican coalition is traditionally a “three-legged stool”—economic conservatives, social conservatives, and national security conservatives. Like Ronald Reagan, she represents all three groups. And in addition, as the founder of the Tea Party caucus in Congress, Bachmann considers the Tea Party the dynamic fourth leg of the coalition, in support of a return to constitutional conservatism. This book will show you why Michele Bachmann believes ordinary people can take on the establishment and win. “Armed with values and faith, supported by family and fellow citizens, together we can do much. We can secure what people are yearning for—the chance to take our country back. Just watch.”",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "Autobiography"
  ],
  "author": "Michele Bachmann",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/12706937-core-of-conviction"
}