{
  "title": "Cries Unheard: Why Children Kill: The Story of Mary Bell",
  "description": "In 1968, at the age of eleven, Mary Bell was tried, and convicted, of manslaughter after the death of two small boys in Newcastle upon Tyne, England. Her friend, and neighbour, thirteen-year-old, Norma Bell, no relation, was acquitted. Gitta Sereny attended the trial, and spent the next two years researching, and writing, what has become a classic study, The Case of Mary Bell. Over the years, however, she came to realize that if we are ever to understand the pressures which bring a child to commit serious crimes, only they, when adult, can tell us.Twenty-seven years after her conviction, and her sentence of detention for life, after her mother's death, Mary Bell agreed to talk about her harrowing childhood, her two terrible acts nine weeks apart, her public trial, and her twelve years of detention - seven of them, beginning when she was sixteen, in a maximum security women's prison.Nothing she said in the five months of intensive talks with Gitta Sereny was intended, or can be taken, as an excuse for her crimes: she herself rejects all mitigation. But the story of her life forces the reader to ponder society's responsibility for children at breaking point. It challenges our willingness to commit ourselves to the prevention of violent acts such as Mary committed. It is a clarion call to review our system of justice, and punishment, as it applies to the most needy amongst us - our children at risk.Cries Unheard is a brilliant tour de force, meticulously piecing together the terribly damaged life of Mary Bell, who only as an adult, and loving parent herself, grew to realize the moral enormity of her crimes. But it is not an isolated tragedy. There are thousands of children in prison across Europe, and in America. And in Britain, where punitive justice for children is most formalized, recent cases such as the murder of James Bulger show the urgency for our attention, our compassion, and our action.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Biography",
    "Psychology",
    "Mental Health",
    "History"
  ],
  "author": "Gitta Sereny",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/562710.Cries_Unheard"
}