{
  "title": "The Twelve Jays of Christmas",
  "description": "The cast of Donna Andrews’ New York Times bestselling Meg Langslow mystery series is back for an unforgettable holiday story in The Twelve Jays of Christmas .Meg and Michael’s annual holiday celebration is well underway, with a throng of out-of-town relatives staying at their house. Hosting these festivities is a little harder than usual―they have to relocate all the events normally held in their library, currently occupied by Roderick Castlemayne, the irascible wildlife artist who’s creating twelve paintings of birds to illustrate Meg’s grandfather’s latest nature book.Still, the celebrations continue―and the entire family rejoices to learn that Meg’s brother Rob and his longtime fiancée Delaney have finally decided to tie the knot. Unfortunately, they decide to do this in the middle of Meg and Michael’s annual New Year’s bash, dashing their mothers’ hopes of planning the wedding to end all weddings.Delaney’s mother sneaks into town so she and Meg’s mother can secretly plot a way to talk the happy couple into having a big bash. Hiding her only adds to Meg’s holiday stress―it’s almost a full-time job fending all the visitors who want to confront Castlemayne―reporters, bill collectors, process servers, and several ex-wives in search of unpaid alimony.Then someone murders Castlemayne in the middle of a blizzard and sets loose the birds he was painting. Can Meg help the police crack the case before the killer strikes again? Can she keep Christmas merry in spite of the body in the library? Can she negotiate a compromise between Rob and Delaney and their disappointed mothers? And can she recapture the twelve escaped jays before they begin nesting in the Christmas tree?This intrigue-filled Christmas mystery takes readers home to Caerphilly to join in Meg's family's holiday celebration―including, of course, another baffling mystery.",
  "genres": [
    "Mystery",
    "Christmas",
    "Cozy Mystery",
    "Fiction",
    "Humor",
    "Holiday",
    "Audiobook"
  ],
  "author": "Donna Andrews",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/56268995-the-twelve-jays-of-christmas"
}