{
  "title": "Looking for the Good War: American Amnesia and the Violent Pursuit of Happiness",
  "description": "In Looking for the Good War, Elizabeth D. Samet reexamines the literature, art, and culture that emerged after World War II, bringing her expertise as a professor of English at West Point to bear on the complexity of the postwar period in national life. She exposes the confusion about American identity that was expressed during and immediately after the war, and the deep national ambivalence toward war, violence, and veterans--all of which were suppressed in subsequent decades by a dangerously sentimental attitude toward the United States' \"exceptional\" history and destiny.Samet finds the war's ambivalent legacy in some of its most heavily mythologized figures: the war correspondent epitomized by Ernie Pyle, the character of the erstwhile G.I. turned either cop or criminal in the pulp fiction and feature films of the late 1940s, the disaffected Civil War veteran who looms so large on the screen in the Cold War Western, and the resurgent military hero of the post-Vietnam period. Taken together, these figures reveal key elements of postwar attitudes toward violence, liberty, and nation--attitudes that have shaped domestic and foreign policy and that respond in various ways to various assumptions about national identity and purpose established or affirmed by World War II.As the United States reassesses its roles in Afghanistan and the Middle East, the time has come to rethink our national mythology: the way that World War II shaped our sense of national destiny, our beliefs about the use of American military force throughout the world, and our inability to accept the realities of the twenty-first century's decades of devastating conflict.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "War",
    "American History",
    "Sociology",
    "Audiobook"
  ],
  "author": "Elizabeth D. Samet",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/56269254-looking-for-the-good-war"
}