{
  "title": "Agent Sniper: The Cold War Superagent and the Ruthless Head of the CIA",
  "description": "The thrilling never-before-told story of Agent Sniper, one of the Cold War's most effective counter-agentsMichal Goleniewski, cover name Sniper, was one of the most important spies of the early Cold War. For almost three years, as a Lieutenant Colonel at the top of Poland’s espionage service, he smuggled thousands of top-secret Soviet bloc intelligence and military documents, as well as 160 rolls of microfilm, from behind the Iron Curtain. Then, in January 1961, he abandoned his wife and children to make a dramatic defection across divided Berlin with his East German mistress to the safety of American territory. There, he exposed more than 1,600 Soviet bloc agents operating undercover in the West―more than any single spy in history.The CIA called Goleniewski “one of the West’s most valuable counterintelligence sources,” but in late 1963, he was abandoned by the US government because of a split inside the agency, and over questions about his mental stability and his trustworthiness. Goleniewski bears some of the blame for his troubled He made baseless assertions about his record, notably that he was the first to expose Kim Philby. He also bizarrely claimed to be Tsarevich Aleksei Romanoff, heir to the Russian Throne who had miraculously survived the 1918 massacre of his family.For more than fifty years, American and British intelligence services have sought to erase Goleniewski from the history of Cold War espionage. The vast bulk of his once-substantial CIA and MI5 files remain closed. Only fragments of his material crop up in the de-classified dossiers on the KGB spies he exposed or the memoirs of CIA officers who dealt with him, but his newly-released Polish intelligence file reveals the remarkable extent of his espionage on behalf of the West.A never-before-told story that brings together love and loyalty, courage and treachery, betrayal, greed and, ultimately, insanity, Tim Tate's Agent Sniper is a crackling page-turner that takes readers back to the post-war world and a time when no one was what they seemed.",
  "genres": [
    "History",
    "Nonfiction",
    "Espionage",
    "War",
    "Poland",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Tim Tate",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/56269118-agent-sniper"
}