{
  "title": "The Best of Artisan Bread in Five Minutes a Day: Favorite Recipes from BreadIn5",
  "description": "WITH A FOREWORD BY ANDREW ZIMMERN\"What Zoë and Jeff have done with the Artisan Bread in Five Minutes series is prove that the world’s easiest yeasted loaf, the most versatile bread dough recipe (even pizza!), can be taken in so many directions and have so many applications that it has created a series of hits.\" ―From the Foreword by Andrew ZimmernFrom Jeff Hertzberg, M.D., and Magnolia Network's Zoë François, the authors of the Artisan Bread in Five Minutes a Day series, comes a collection of all time favorite recipes and techniques.With nearly one million copies of their books in print, Jeff Hertzberg and Zoë François have proven that people want to bake their own bread, so long as they can do it easily and quickly. But with five very different “Bread in Five” books to choose from, bakers have been asking: “Which one should I get if I want a little of everything: the best of European and American classics, whole-grain recipes, pizza and flatbread, gluten-free, sourdough, and loaves enriched with eggs and butter?”With The Best of Artisan Bread in Five Minutes a Day , Jeff and Zoë have chosen their absolute favorite 80 recipes from all five of their books, bringing them together into a single volume that is the only bread book a baker needs. In addition to old favorites, the book pulls in a few new tricks, tips, and techniques that Jeff and Zoë have learned along the way. With this revolutionary stored-dough technique―along with color and instructional black-and-white photographs―readers can have stunning, delicious bread on day one. The Best of Artisan Bread in Five Minutes a Day will make everyone a baker―with only five minutes a day of active preparation time.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction"
  ],
  "author": "Jeff Hertzberg",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/56269180-the-best-of-artisan-bread-in-five-minutes-a-day"
}