{
  "title": "Wildland: The Making of America's Fury",
  "description": "After a decade abroad, the National Book Award– and Pulitzer Prize– winning writer Evan Osnos returns to three places he has lived in the United States—Greenwich, CT; Clarksburg, WV; and Chicago, IL—to illuminate the origins of America’s political fury.Evan Osnos moved to Washington, D.C., in 2013 after a decade away from the United States, first reporting from the Middle East before becoming the Beijing bureau chief at the Chicago Tribune and then the China correspondent for The New Yorker. While abroad, he often found himself making a case for America, urging the citizens of Egypt, Iraq, or China to trust that even though America had made grave mistakes throughout its history, it aspired to some foundational moral commitments: the rule of law, the power of truth, the right of equal opportunity for all. But when he returned to the United States, he found each of these principles under assault.In search of an explanation for the crisis that reached an unsettling crescendo in 2020—a year of pandemic, civil unrest, and political turmoil—he focused on three places he knew firsthand: Greenwich, Connecticut; Clarksburg, West Virginia; and Chicago, Illinois. Reported over the course of six years, Wildland follows ordinary individuals as they navigate the varied landscapes of twenty-first-century America. Through their powerful, often poignant stories, Osnos traces the sources of America’s political dissolution. He finds answers in the rightward shift of the financial elite in Greenwich, in the collapse of social infrastructure and possibility in Clarksburg, and in the compounded effects of segregation and violence in Chicago. The truth about the state of the nation may be found not in the slogans of political leaders but in the intricate details of individual lives, and in the hidden connections between them. As Wildland weaves in and out of these personal stories, events in Washington occasionally intrude, like flames licking up on the horizon.A dramatic, prescient examination of seismic changes in American politics and culture, Wildland is the story of a crucible, a period bounded by two shocks to America’s psyche, two assaults on the country’s sense of itself: the attacks of September 11 in 2001 and the storming of the U.S. Capitol on January 6, 2021. Following the lives of everyday Americans in three cities and across two decades, Osnos illuminates the country in a startling light, revealing how we lost the moral confidence to see ourselves as larger than the sum of our parts.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Sociology",
    "Audiobook",
    "American History",
    "Journalism"
  ],
  "author": "Evan Osnos",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/56269283-wildland"
}