{
  "title": "Blood of Anteros",
  "description": "\"I was tantalized by the mystery of her. The leech inside me came out to find prey, but found none in this enigmatic girl. The close proximity of her essence didn’t entice the monster within, so what did that make her? I had more questions than answers, but one thing was unmistakable; although she released me from her embrace, her hold on me remained.\"Cruel circumstances turned Curry Brennan into the wretched monster he hates and refuses to accept, but when an expected turn of events releases him from the bond of his obsessive maker, he returns to the home he knew 161 years earlier and finds the return of happiness and joy in something he didn’t know existed. Puzzled by his growing attraction to Chansey Leclaire, a human, he is unable to resist the captivating relationship that threatens to reveal his existence as a vampire. He eventually discovers the reason he was destined to find what he didn’t know he searched for and is faced with the cruel realization that the living and the immortal undead will always be separated by one thing. Eternity.Be sure to check out the book trailer for Blood of Anteros on my Goodreads profile page or http://www.youtube.com/watch?v=_LbJpi...BRIEF EXCERPT-Although somewhat involuntary, I was part of this now. My confrontation fanned the flames of Julian’s obsession, making him more determined than ever to have Chansey. Consequences battled within me and my heart spoke against my mind’s better judgement. “Maybe I should drive you back and forth to work for a while, just until he backs off.”She looked appreciative, but didn’t intend on taking my offer. “I can’t ask you to do that, it’s too much for you to take on.”I didn’t intend for her to not take my offer. “You didn’t ask. I offered and I insist.”Relief flooded her face. Then, she surprised me by stepping forward and put her arms around me. She placed her head against my chest, leaving me without an option and I returned the embrace by placing my arms around her. I lowered my face to her hair and inhaled deeply, taking in the scent of lavender and vanilla. I dropped my face closer to her shoulder and smelled the lingering fragrance of jasmine, cherry blossom and peach, mixed with a slight release of salty perspiration due to the combination of heat and anxiety.The monster, deep within me, unexpectedly resurfaced. He no longer laid dormant as he screamed in agony, begging to be set upon this innocent creature. He pleaded with me for one taste. Didn’t he deserve it? It has been so long.One scent of her blood essence would surely send me over the edge, giving the awakened one the upper hand as he urged me to side with him. I braced myself for the battle against the leech within me and begged him to leave me in peace.I held my breath and didn’t move a muscle, for fear the beast might interpret any sudden movement as permission to strike. When I could no longer hold my breath, I exhaled, then inhaled slowly and shallowly. I waited for her fragrance to signal my defeat, giving the leech the permission to strike.I readied myself to charge against this inner beast when her aromatic essence penetrated my line of defense. When her aroma registered in my brain, I waited to see what my level of temptation would be. The beast received the verdict first and my battle was won as he retreated.I was intrigued by Chansey’s unexpected essence. It wasn’t unappealing, yet not enticing either. It was neutral and I was spellbound.She lifted her head from my chest and leaned back to see my face. “I don’t know what to say or how to thank you.”She raised up onto her tiptoes and planted a kiss on my cheek before she released her hold of me. I reluctantly released my hold, as well, but I wasn’t finished exploring this. I wanted more, I needed more.We both knew we had just shared a significant moment, although neither of us voiced it.“I’m sure you’re exhausted. You should get a good night’s rest,” I said, verbally encouraging her to go to bed, but inside begging her stay.I regretfully watched her walk up the steps to the backdoor. Before entering, she turned and said, “Thank you again, Curry. You’re a real life saver.”The paradox of her words brought a smile to my face. She saw a life saver in a skilled killer and I was tantalized by the mystery of her. The leech inside me came out to find prey, but found none in this enigmatic girl. The proximity of her essence didn’t entice him, so what did that make her? I had more questions than answers, but one thing was unmistakable; although she released me from her embrace, her hold on me remained.I was uncertain what this meant for me, but more importantly, I didn’t know what it meant for Chansey. Of all the puzzling things in my head, there remained one clear circumstance; she needed my protection because, for once, I wasn’t the dangerous one.I lifted my eyes to Chansey’s bedroom window and watched darkness replace the light. She remained standing at her window, believing she was hidden in the darkness, and briefly watched me before she crawled into bed.She was lying in her bed, unaware of the strange emotions flooding me. Beings like me didn’t desire romantic relationships with humans, so it was unnatural for me to desire anything other than her blood while all I wanted was to be near her. I remembered the way she leaned forward to kiss me and it left room for no doubt in my mind; I wanted her with all of my heart, body and soul, if there still was one within me.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Young Adult",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Georgia Cates",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/12706916-blood-of-anteros"
}