{
  "title": "Muhammad, the World-Changer: An Intimate Portrait",
  "description": "\"An accessible biography of Muhammad, Islam’s founding prophet, tracing his development from orphan to political leader and providing insights into his personal life and tastes.\" —New York Times Book Review\"A fresh telling of a familiar story...The result is a biography that reads like a novel.\"—Washington Post“A joyous read, presenting the Prophet Muhammad both as human and humane. Insightful, thoughtful and thought provoking!” —Azar Nafisi, New York Times  bestselling author of Reading Lolita in Tehran“A beautifully written, immaculately researched meditation on the impact of the Prophet Muhammad on the modern world. I loved this book!” —Reza Aslan, author of No God but God and Zealot: The Life and Times of Jesus of NazarethA six-year-old cries in his mother’s arms as she draws her last breaths to urge him: “Muhammad, be a world-changer!” The boy, suddenly orphaned in a tribal society that fears any change, must overcome enormous obstacles to unleash his own potential and inspire others to do the same.Fusing details long known to Muslim scholars but inaccessible to popular audiences, Mohamad Jebara brings to life the gripping personal story of Islam’s founding prophet. From his dramatic birth to nearly being abducted into slavery to escaping assassination, Muhammad emerges as an unrelenting man on a mission. Surrounding the protagonist are dynamic women who nurture Muhammad; Jewish and Christian mentors who inspire him; and the enslaved individuals he helps liberate who propel his movement.Jebara places Muhammad’s life in a broader historical context, vividly evoking the Meccan society he was born into and arguing that his innovative vision helped shape our modern world.\"This excellent biography presents a unique and personal perspective.\" —Booklist\"Accessible... Those looking for an introduction to the life of the Islamic prophet would do well to start here.\"—Publishers Weekly“This book is truly unique—in its enchanting prose, reverent secularity, and thought-provoking revisionism. For anyone curious about the amazing life and legacy of this seminal figure, this book is highly recommended—even for those who think they already know it well.” —Mustafa Akyol, senior fellow at Cato Institute, author of Reopening Muslim Minds“A vivid and beautifully written book that is both inspiring and well-researched. Readers will be in awe at how Jebara describes the Prophet Muhammad’s many inspiring and overlooked acts in service to humanity – as an entrepreneur, philosopher, statesman, husband, humanitarian, and father, among other roles.\" —Dr. Craig Considine, author of The Humanity of Muhammad: A Christian View\"A rare literary treat...Jebara treats his namesake, the prophet Muhammad, as a human and historical figure, distilling a wealth of compelling information while deftly treading sensitive ground.” —Nadim Shehadi, Executive Director, Lebanese American University Academic Center, New York“A religious icon long shrouded in both myth and stigma at last receives the biography he deserves. Jebara’s mastery of classical Arabic and Islamic scholarship enables him to reveal an authentic human narrative of Muhammad’s life.” —Captain Barbara Helms, first female Muslim military chaplain in the British commonwealth“Jebara, a once-in-a-generation elucidator, brings his namesake’s visionary spirit to life as never before. Offers an inspiring portrait of Islam’s founder that serves as a vital tool for enhancing interfaith coexistence.” —Jason Guberman, American Sephardi Federation“Jebara spotlights the many women who mentored Muhammad, including his mother, his wife Khadijah, and Barakah—the slave he emancipated at age six. Erudite and poetic, the narrative immerses readers in the Prophet’s life, leaving them craving to know more. A must-read.” —Rana Bokhari, former head of the Manitoba Liberal Party“Via Jebara’s soaring prose, readers join Muhammad on an epic life journey that transforms how they view the world.” —Rev. Father Andre Boyer, Former Superior of the Oblates of Mary Immaculate“Scholarly yet accessible, this book touches the heart and the mind--helping advance peacemaking our world so desperately needs.” —The Venerable Mavis Brownlee, Archdeacon in the Anglican Church of Canada (retired)“Brings this icon to life as never before.” —Prof. Stuart Chambers, University of Ottawa\"This book will transport you to an ancient time, yet you will sense human emotions as contemporary as our own. This book inspires us to be world-changers.\" —Rev. Takouhi Demirdjian-Petro, first Armenian woman minister ordained in Canada by the United Church.",
  "genres": [
    "Islam",
    "History",
    "Nonfiction",
    "Biography",
    "Religion",
    "Philosophy",
    "Inspirational"
  ],
  "author": "Mohamad Jebara",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/56268993-muhammad-the-world-changer"
}