{
  "title": "Truth of the Divine",
  "description": "USA TODAY BESTSELLERTruth of the Divine is the latest alternate-history first-contact novel in the Noumena series from the instant New York Times, Wall Street Journal and Los Angeles Times bestselling author Lindsay Ellis.The human race is at a crossroads; we know that we are not alone, but details about the alien presence on Earth are still being withheld from the public. As the political climate grows more unstable, the world is forced to consider the ramifications of granting human rights to nonhuman persons. How do you define “person” in the first place?Cora Sabino not only serves as the full-time communication intermediary between the alien entity Ampersand and his government chaperones but also shares a mysterious bond with him that is both painful and intimate in ways neither of them could have anticipated. Despite this, Ampersand is still keen on keeping secrets, even from Cora, which backfires on them both when investigative journalist Kaveh Mazandarani, a close colleague of Cora’s unscrupulous estranged father, witnesses far more of Ampersand’s machinations than anyone was meant to see.Since Cora has no choice but to trust Kaveh, the two must work together to prove to a fearful world that intelligent, conscious beings should be considered persons, no matter how horrifying, powerful, or malicious they may seem. Making this case is hard enough when the public doesn’t know what it’s dealing with―and it will only become harder when a mysterious flash illuminates the sky, marking the arrival of an agent of chaos that will light an already-unstable world on fire.With a voice completely her own, Lindsay Ellis deepens her realistic exploration of the reality of a planet faced with the presence of extraterrestrial intelligence, probing the essential questions of humanity and decency, and the boundaries of the human mind.While asking the question of what constitutes a “person,” Ellis also examines what makes a monster.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Aliens",
    "Speculative Fiction",
    "Romance",
    "Adult"
  ],
  "author": "Lindsay  Ellis",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/56269171-truth-of-the-divine"
}