{
  "title": "Watching Darkness Fall: FDR, His Ambassadors, and the Rise of Adolf Hitler",
  "description": "A gripping and groundbreaking account of how all but one of FDR's ambassadors in Europe misjudged Hitler and his intentionsAs German tanks rolled toward Paris in late May 1940, the U.S. Ambassador to France, William Bullitt, was determined to stay put, holed up in the Chateau St. Firmin in Chantilly, his country residence. Bullitt told the president that he would neither evacuate the embassy nor his chateau, an eighteenth Renaissance manse with a wine cellar of over 18,000 bottles, even though “we have only two revolvers in this entire mission with only forty bullets.”As German forces closed in on the French capital, Bullitt wrote the president, “In case I should get blown up before I see you again, I want you to know that it has been marvelous to work for you.” As the fighting raged in France, across the English Channel, Ambassador to Great Britain Joseph P. Kennedy wrote to his wife Rose, “The situation is more than critical. It means a terrible finish for the allies.”Watching Darkness Fall will recount the rise of the Third Reich in Germany and the road to war from the perspective of four American diplomats in Europe who witnessed it firsthand: Joseph Kennedy, William Dodd, Breckinridge Long, and William Bullitt, who all served in key Western European capitals―London, Berlin, Rome, Paris, and Moscow―in the years prior to World War II. In many ways they were America’s first line of defense and they often communicated with the president directly, as Roosevelt's eyes and ears on the ground. Unfortunately, most of them underestimated the power and resolve of Adolf Hitler and Germany’s Third Reich.Watching Darkness Fall is a gripping new history of the years leading up to and the beginning of WWII in Europe told through the lives of five well-educated and mostly wealthy men all vying for the attention of the man in the Oval Office.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "World War II",
    "War",
    "Politics"
  ],
  "author": "David McKean",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/56269145-watching-darkness-fall"
}