{
  "title": "Your Next Big Idea: Improve Your Creativity and Problem-Solving",
  "description": "🏆20 Awards🏆• 2022 International Rubery Book Award Grand Prize Shortlist• 2022 Eric Hoffer Awards First Horizon Award Winner, 2022 Eric Hoffer Awards Reference Category Winner, 2022 Eric Hoffer Awards Grand Prize Shortlist• 2022 Independent Press Book Awards Winner: Best Debut Nonfiction Book•2022 Global Ebook Awards: Grand Prize Legacy Award for Non-fiction• 2022 Next Generation Indie Book Awards: Career Genre Book of the Year• 2022 NYC Big Book Award Category Winner: Best How-To Book• 2022 National Indie Excellence Awards - Education Book of the Year• IndieReader 2021 Discovery Awards Business Category Book of the Year• ReadFreely Top 100 Indie Books of 2021• 2021 Living Now Mind Award Winner• Nonfiction Authors Association Gold Medal Book Award• 2021 Readers’ Favorite International Book Award Contest - Marketing Book of the Year• Independent Author Network Book of The Year Awards - 2021 Business, Finance, and Sales Book of the Year• Award Winner in Personal Growth & Development - 2021 International Impact Book Awards• Best Book Awards - 2021 Interior Design of the Year• Indie B.R.A.G. Medallion Winner• 2021 Nonfiction IndieReader Summer Book Cover Design Contest Winner• 2022 International Book Awards Winner - Best Cover Design: Nonfiction• How-To Category Winner - Summer 2021 Pinnacle Book Achievement Award• Award Winner in Business - 2021 International Impact Book Awards🌲This book is carbon negative🌲(see yournextbigideabook[dot]com for details)From an author who has written for Business 2 Community & Advertising Week comes a book featured by Yahoo!, Booklist Magazine, Publishers Weekly, ABC's Good Morning Washington, Thrive Global, Modern Professional, NBC's Good Morning NWA, Young Upstarts, IndieReader, Technically, Elephant Journal and multiple affiliates of CBS, Fox, and NBC.This non-fiction business and self-help creativity guide encourages innovation in aspiring entrepreneurs and business leaders. Have you ever looked at a product and thought, 'Why didn't I think of that?' or, 'I'm just not a creative person!' Improve problem-solving skills and increase the effectiveness of knowledge management in your organization to come up with the next game-changing idea to hit the market!\"Your Next Big Idea ignites the imagination with a kaleidoscope of ideas and exercises. Even if you have no intention of pursuing “the next big idea,” this book is sure to give you an exciting and fresh perspective of the world around you.”- BlueInk Reviews“[A]n easy-to-follow road map for ramping up innovation… Sanders isn’t short of ideas himself in this treatise on turning ideas into reality, and the “Big Idea Journey Map” that structures the book works nicely. Entrepreneurs wanting to get their creative juices moving should give this a look.” -  Publishers Weekly \"This book is a breath of fresh air in letting people let their creative minds run wild... I would recommend this book to people of all ages who want to feel that spark of an idea again.\" - Manhattan Book Review“Practical, insightful, thoroughly 'user friendly' in organization and presentation, [Your Next Big Idea] is an extraordinary and unreservedly recommended addition to personal, professional, community, college, and university library Business Management collections. It should be noted for the personal reading lists of MBA students, academia, entrepreneurs, corporate administrators, business managers, and non-specialist general readers with an interest in the subject” - Midwest Book Review\"If I still taught, this book would definitely be integrated into classwork!... Highly recommended for creatives, and those who want to cultivate creativity, alike!\" - Portland Book Review“This is an inspirational yet instructional guide to becoming more inventive in solving everyday problems…[Your Next Big Idea] applies this step-by-step process to entrepreneurs, employees, executives, and anyone interested in keeping their mind sharp.” - Eric Hoffer Book Award Committee via the US Review of Books“Everyone can use a little more creativity, and [Your Next Big Idea] is the jumpstart to take it from stale to stellar.” - Readers' Favorite“Your Next Big Idea will challenge the way you think. This unique book is engaging, even \"customized\" to fit the needs and purposes of every reader--whether an individual or a team.” - Nonfiction Authors Association Book Awards Program\"[Samuel Sanders] sets lofty goals, promising \"By the end of the book, you'll be equipped with the skills to come up with 100 meaningful ideas a week that you can apply to your career or personal life.\" But readers will be pleased to find that the advice is down-to-earth, easy to implement, and applicable to just about every area, business or personal, anyone may be working to enhance.\" - Booklife Reviews\"Exemplary...[a] unique point of view to a well-worn topic.\" - Writer's Digest Magazine: Judge, 29th Annual Writer’s Digest Self-Published Book Awards \"You will uncover talents and ideas that you did not know you had.\" - Online Book Club\"[Your Next Big Idea] was one of the best practical books that I have read. I would highly recommend this to anyone...\" - San Francisco Book Review\"Inspiring and fun – especially when compared to the sometimes-staid books on the same topic. The exercises are effective for a wide range of issues, acting as a kind of team-building exercise on a personal level. As many books bombard the reader with ideas, without a real sense of implementation, Your Next Big Idea stands out in the field. Though his book is primarily designed for those in business and marketing, it can be useful to anyone seeking a more hands-on approach to self-improvement.\" - Self-Publishing Review“Once the reader does the exercises in [Your Next Big Idea], they will be able to master the skills of innovation, problem-solving and creativity.” - IndieReader Review\"A practical guide to learning how to consistently generate ideas that will help you live a more creative and fulfilling life...If you're looking for help with coming up with fresh ideas for just about anything, this book will be quite useful.\" - Reedsy DiscoveryThe inspiring self-help guide Your Next Big Idea forwards advice and creative exercises that encourage the development of different ways of thinking. - Foreword Clarion Reviews\"[Y]ou will find Your Next Big Idea on our Must-Have Reading List for next year…middle schools and high schools should keep a copy of Your Next Big Idea in the library and encourage students to read.” - Mommies Reviews“A step-by-step guide to mastering the basic skills of creativity.\" - Kirkus Reviews\"[A] guide that’s a quick read, but don’t let that fool you. It’s also a roadmap for the long route to mastery, both in business and in life.\" - Booktrib\"Samuel Sanders will bring out the creativity in those that read this intellectually invigorating book. The author directs his readers to think beyond their surroundings. The language and tone the author uses are friendly and welcoming, like having a conversation with a friend or colleague…Whether readers are a student, starting a small business, or are in the corporate world, Samuel Sanders will share with readers how they can grow that small idea that they have been sitting on.\" -  Literary Titan “I would recommend this book to all those that are looking to pursue innovation”  Red Headed Book Lover “Whether you’re interested in developing your business, enhancing your artistic inventiveness, improving your communication skills, or some other important endeavor, reading Your Next Big Idea is a great way to get your creative juice flowing” -  Seattle Book Review \"Samuel Sanders has produced a pioneering tool that will challenge your thinking and put you on the best-foot-forward to creating that new business... I personally got so inspired that I could not put this book down and began thinking of my own new ideas.” - Chick Lit Café“Your Next Big Idea by Samuel Sanders is a remarkable blueprint to creative thinking and practical action. This is an extremely comprehensive ‘step-by-step’ to a thoroughly friendly motivational guide, which can catapult you from standstill to racing in the world of business.” - Artisan Book ReviewsBook Description:This business and self-help creativity guide encourages innovation in aspiring entrepreneurs and business leaders. Have you ever looked at a product and thought, ‘Why didn’t I think of that?’ or, ‘I’m just not a creative person!’ Improve problem-solving skills and increase the effectiveness of knowledge management in your organization to come up with the next game-changing idea to hit the market! In this book you will: • Learn how others innovate by examining the world around them • Practice asking questions, and see how to recognize details in observations• Complete creative exercises to get into the right mindset • Understand the importance of sharing ideas, and assessing their feasibility Fueling You to Find: Your Next Big IdeaAre you ready? Order the book to get started.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Personal Development",
    "Writing",
    "Psychology"
  ],
  "author": "Samuel  Sanders",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/56283219-your-next-big-idea"
}