{
  "title": "Die Wawuschels mit den grünen Haaren.",
  "description": "Die Wawuschels, das sind Mutter, Vater, Großmutter, Onkel und die Kinder Wischel und Wuschel, leben im Berg. Auf dem Kopf tragen sie grüne Haare, die ihnen in der Dunkelheit des Berges leuchten. Wawuschels essen mit Vorliebe Marmelade, und sie besitzen ein Zauberbuch, das sie leider nicht lesen können. Mit dem Drachen mit den drei Köpfen leben sie in vollkommener Harmonie. Er wird von allen Familienangehörigen gekrault. Alles ist also in bester Ordnung, bis es eines Tages so laut und bedrohlich im Berg bumbst, dass Wischel und Wuschel sich auf den Weg machen, um herauszufinden, was da los ist. Jetzt beginnt eine abenteuerliche Reise, die Wischel sogar bis zu den bösen Menschen bringt!  Irina Korschunow, die sich diese Geschichte ausgedacht hat, sagt von sich, dass sie gerne für Kinder schreibt. Weil sie über jene Mittel der Sprache und Phantasie zu verfügen glaubt, die man braucht, um junge Leser zu erreichen. Irina Korschunow wurde durch ihre Wawuschel-Bände, die in den Jahren 1968 bis 1973 erschienen, als Kinderbuchautorin berühmt. Neben aktuellen Jugendbüchern wie \"Die Sache mit Christoph\" schrieb sie auch Romane für Erwachsene. Für ihr Gesamtwerk wurde sie 1987 mit der Roswitha-von-Gandersheim-Medaille geehrt.  So eine wundervolle Geschichte braucht einen richtigen Erzähler, einen, der mit Liebe alle Wawuschel-Familienmitglieder mit ihrer ganz eigenen Ausdrucksweise darstellt. Monty Arnold, der Comedy-Star und vielseitige Entertainer, tut das! Er vollbringt bei seiner Erzählung über die Abenteuer der Wawuschels wahre phonetische und artikulatorische Glanzleistungen. Es jammert, piepst, grummelt, zazischelt und mamoffelt, dass einem die Ohren sausen. Vollständige Lesung, Spieldauer: ca. 135 Minuten, 2 MC. Ab 5 Jahren. \n-- culture.text",
  "genres": [
    "Childrens"
  ],
  "author": "Irina Korschunow",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/5628387-die-wawuschels-mit-den-gr-nen-haaren"
}