{
  "title": "The Heart of Yoga: Developing a Personal Practice",
  "description": "The first yoga text to outline a step-by-step sequence for developing a complete practice according to viniyoga--yoga adapted to the needs of the individual. • A contemporary classic by a world-renowned teacher. • This new edition adds thirty-two poems by Krishnamacharya that capture the essence of his teachings. Sri Tirumalai Krishnamacharya, who lived to be over 100 years old, was one of the greatest yogis of the modern era. Elements of Krishnamacharya's teaching have become well known around the world through the work of B. K. S. Iyengar, Pattabhi Jois, and Indra Devi, who all studied with Krishnamacharya. Krishnamacharya's son T. K. V. Desikachar lived and studied with his father all his life and now teaches the full spectrum of Krishnamacharya's yoga. Desikachar has based his method on Krishnamacharya's fundamental concept of viniyoga, which maintains that practices must be continually adapted to the individual's changing needs to achieve the maximum therapeutic value. In The Heart of Yoga Desikachar offers a distillation of his father's system as well as his own practical approach, which he describes as \"a program for the spine at every level--physical, mental, and spiritual.\" This is the first yoga text to outline a step-by-step sequence for developing a complete practice according to the age-old principles of yoga. Desikachar discusses all the elements of yoga--poses and counterposes, conscious breathing, meditation, and philosophy--and shows how the yoga student may develop a practice tailored to his or her current state of health, age, occupation, and lifestyle. This is a revised edition of The Heart of Yoga.",
  "genres": [
    "Nonfiction",
    "Spirituality",
    "Health",
    "Philosophy",
    "Self Help",
    "Reference",
    "Religion"
  ],
  "author": "T.K.V. Desikachar",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/56303.The_Heart_of_Yoga"
}