{
  "title": "Into The Dragon's World",
  "description": "A woman who needs protection. A dragon who fears he won’t be able to save her.CASEYStuff like this never happens to people like me.One day I’m studying for my PhD, the next I’m running from a stalker.But not just any stalker. Oh, no. It’s my English professor. And he’s a bear shifter.Just my luck.When my best friend Jasmine tries to help me, she introduces me to her boss. To him.Brady Markonian.Owner of the Paradigm, a nightclub almost exclusively for shifters.Guardian of the Arch, the secret doorway between our world and theirs.Sexy. Gorgeous.And a dragon.I wanted him from the first moment I met him.There was something about him that I trusted. Something that made me feel safe.When he transports me to his shifter world for safety, I realize that want has turned into love.It’s a wonderful escape for a while…But when my stalker threatens the lives of everyone I love, I know I have to make a choice.My life…or theirs.BRADYThe last thing I needed was some helpless female to babysit.For the last few years, I’ve been alone and I liked it that way.No one to worry about. No one to lose.But then Casey slams into my life like a whirlwind and I’m shaken to the core.She’s beautiful. Brave. A smart-ass.I want to help her despite myself.When the only way to protect her is to take her to my world, she’s not afraid to trust me.I can’t help but want her. All of her. Body and soul.I know that we are fated to be together. I’ve found my true mate.But happily ever after might not be in the future for us, not as long as her stalker’s alive.And when I learn that Casey is going to be the mother of my child, I know that I’ll do anything it takes to keep them safe.Anything.Can the fury of a dragon be enough to save the life of the woman he loves?Note: Adults Only!",
  "genres": [
    "Paranormal",
    "Dragons",
    "Shapeshifters",
    "Romance",
    "Adult",
    "Paranormal Romance",
    "Urban Fantasy"
  ],
  "author": "Brittany White",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/56279936-into-the-dragon-s-world"
}