{
  "title": "Twice Bitten",
  "description": "The first two Dying of the Dark novels, together in one convenient omnibus.The Vampires' Last Txema Ybarra is the most unenviable nineteen-year-old girl alive.Smart, pretty, and athletically gifted, this University of Tennessee freshman should be enjoying college life and her entrance into adulthood. And for a moment she does…until the vampires show up.Born with an unusual ‘twin teardrop’ birthmark on her neck, Txema (pronounced Chema) is one of only a handful of females in the world who bear this trait. It marks her as a vessel of eternal youth and beauty for an elite vampire society determined to protect her precious blood….But it also is the only thing standing in the way of a rogue ‘undead’ nation determined to destroy mankind and usurp the power their sexier brethren have held uncontested for centuries.Caught in the middle of this war after all the other bearers of the birthmark are murdered, Txema must flee America and heads to France under the protection of five beautiful vampires who all have a vested interest in her survival. The race is on to save her blood, as well as her very life, to ensure the survival of Les Amants de Vampire. Otherwise, Txema will be the last one…the vampires’ last lover.The Vampires' A birthright. It should be something no one can ever take away.But that’s not how it works in the world of vampires. Especially when that birthright involves a unique type of blood necessary for an elitist vampire society to remain young and beautiful.Welcome to the continued misadventure of nineteen-year-old Txema Ybarra.The earth’s most privileged undead believe they deserve a stake in Txema’s blood, and there is power and prestige for whoever controls her ancient bloodline. However, the vampire demon, Ralu, and his burgeoning Chupacabra army crave the same lofty status. Unlike his brother Gustav—ruler of the elite European vampires—Ralu desires the death of Txema, and with it the end of Gustav’s two thousand-year reign.As this teenage mother-to-be fights for survival for her and her unborn daughter, the journey to elude Ralu and traitor vampires among Gustav’s civilized allies takes Txema across the globe. The race is on to save or destroy two human lives…and determine the rightful holder of The Vampires’ Birthright.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Fiction",
    "Paranormal Romance"
  ],
  "author": "Aiden James",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/12707541-twice-bitten"
}