{
  "title": "The Missing",
  "description": "The author of The Clearing (“the finest American novel in a long, long time”—Annie Proulx) now surpasses himself with a story whose range and cast of characters is even broader, with the fate of a stolen child looming throughout.Sam Simoneaux’s troopship docked in France just as World War I came to an end. Still, what he saw of the devastation there sent him back to New Orleans eager for a normal life and a job as a floorwalker in the city’s biggest department store, and to start anew with his wife years after losing a son to illness. But when a little girl disappears from the store on his shift, he loses his job and soon joins her parents working on a steamboat plying the Mississippi and providing musical entertainment en route. Sam comes to suspect that on the downriver journey someone had seen this magical child and arranged to steal her away, and this quest leads him not only into this raucous new life on the river and in the towns along its banks but also on a journey deep into the Arkansas wilderness. Here he begins to piece together what had happened to the girl—a discovery that endangers everyone involved and sheds new light on the massacre of his own family decades before.Tim Gautreaux brings to vivid life the exotic world of steamboats and shifting currents and rough crowds, of the music of the twenties, of a nation lurching away from war into an uneasy peace at a time when civilization was only beginning to penetrate a hinterlands in which law was often an unknown force. The Missing is the story of a man fighting to redeem himself, of parents coping with horrific loss with only a whisper of hope to sustain them, of others for whom kidnapping is either only a job or a dream come true. The suspense—and the complicated web of violence that eventually links Sam to complete strangers—is relentless, urgently engaging and, ultimately, profoundly moving, the finest demonstration yet of Gautreaux’s understanding of landscape, history, human travail, and hope.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Southern",
    "Historical",
    "Literary Fiction",
    "The United States Of America"
  ],
  "author": "Tim Gautreaux",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/5631674-the-missing"
}