{
  "title": "Stolen Brides: Four Beauty-and-the-Beast Medieval Romances",
  "description": "Don't miss this themed boxed set of four Beauty-and-the-Beast medieval romances, available for a limited time! Stolen Brides includes four full-length novels: The Rose Red Bride, Pearl Beyond Price, The Warrior, and The Beauty.In The Rose Red Bride, book two of the Jewels of Kinfairlie trilogy of medieval Scottish romances, Vivienne's night with her destined love is as magical as the tales foretell, but at dawn, he takes her captive. Erik is bent on vengeance but Vivienne quickly sees his true valor and resolves to help restore his stolen legacy herself. Will she lose her heart in the bargain?“Claire Delacroix is a shining star of the romance genre. Cleverly original, emotional and fast-paced, full of twists and turns, her books will sweep you right off your feet!”—Julianne Maclean, bestselling author, on The Rose Red BrideIn Pearl Beyond Price, Kira is snatched away from her home by a grim warrior she cannot understand. When he defends her, she realizes that actions speak louder than words; when Thierry is dispatched on mission that he is not expected to survive, only Kira's knowledge can ensure his success and give them both the chance of a future. Can Kira dare to hope that the valiant warrior who has claimed her love will share that future with her?\"Another dazzling Delacroix delicacy!\" —Affaire de Coeur on Pearl Beyond PriceIn The Warrior, book three of the Rogues of Ravensmuir trilogy, the unwed and unwanted Aileen is abducted by a dangerous knight and compelled to wed him in secrecy. But when her dreams reveal truths that the Hawk has never shared and her curiosity takes her where she should not go, he fears that his beguiling new bride may be his doom. Can Aileen overcome her husband's suspicions to win his love?“Delacroix’s satisfying tale leaves the reader hungry for the next offering.”—Booklist on The Warrior“The Warrior is one more gem in the crown of this queen of medieval romance.”—RendezvousIn The Beauty, book five of the Bride Quest series of medieval romances, Jacqueline is seized on her way to a convent by a wounded knight seeking vengeance, but Alasdair has mistaken her for the daughter of his enemy. When Jacqueline discovers that her captor has returned from crusade only to find his inheritance stolen, she knows that she must help this man of honor regain what is rightfully his own. Will healing his heart cost her own?“Four stars! A tale to warm a winter’s night!”—Romantic Times on The BeautyIn these Beauty-and-the-Beast romances, four wounded warriors are healed by the bold beauty of a bride they take captive—only to lose their shielded hearts to the maiden who believes in their honor. Can each persuade his stolen bride to become his willing partner—body, heart and soul?",
  "genres": [],
  "author": "Claire Delacroix",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/56311446-stolen-brides"
}