{
  "title": "How David Met Sarah",
  "description": "David is a young man who works in a mailroom and lives with his parents. When a young woman named Sarah moves to his neighborhood and begins to attend his church, David believes she's the girl of his dreams. First, however, he has to figure out how to meet her, in spite of the challenges his carefully structured world contains. Reading specialists, special education teachers and librarians agree there are few other titles like this available. Inspired by, and written for, the author's 36 year old brother with Down Syndrome, How David Met Sarah is both content and reading level appropriate for adults with limited reading skills. This book has been endorsed by the National Down Syndrome Society, and 20% of the profits from each book will be donated to the NDSS. \"What a heartwarming glimpse inside David's mind and what it means to be family! Enlightening and informative for families and professionals who love and care for children and adults with developmental disabilities.\" - Robert A. Naseef, Ph.D., psychologist, author of \"Special Children, Challenged Parents,\" and father of an adult child with autism \"Anne Kelleher's outstanding work is to be applauded for reaching a heretofore ignored and forgotten audience. Ms. Kelleher gives a gift of entertaining with adult themes and plots while staying appropriate to the audience of intention and increasing the quality of life. There have been little or no works produced for adults with limited mental abilities. How joyful that this group of adults now has the luxury of reading books aimed to hold their interest with the support of appropriate vocabulary and structure levels. This bold,brave work is just the beginning....\" - Sandra Diamond, M.A., Ct. H., RMT, Experiential Healer \"I can't recommend this book strongly enough to the professionals. After you've read it, you'll then understand why I say it's required reading. Enjoy Annie's gift to the world.\" - Lawrence Kotkin, Ph.D. Lecturer, St. Joseph's College, Long Island, NY",
  "genres": [
    "Fiction"
  ],
  "author": "Anne Kelleher",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/12709133-how-david-met-sarah"
}