{
  "title": "The Collected Poems of W. B. Yeats",
  "description": "William Butler Yeats, whom many consider this century's greatest poet, began as a bard of the Celtic Twilight, reviving legends and Rosicrucian symbols. By the early 1900s, however, he was moving away from plush romanticism, his verse morphing from the incantatory rhythms of \"I will arise and go now, and go to Innisfree\" into lyrics \"as cold and passionate as the dawn.\" At every stage, however, Yeats plays a multiplicity of poetic roles. There is the romantic lover of \"When You Are Old\" and \"A Poet to His Beloved\" (\"I bring you with reverent Hands / The books of my numberless dreams...\"). And there are the far more bitter celebrations of Maud Gonne, who never accepted his love and engaged in too much politicking for his taste: \"Why should I blame her that she filled my days / With misery, or that she would of late / Have taught to ignorant men most violent ways, / Or hurled the little streets upon the great, / Had they but courage equal to desire?\" There is also the poet of conscience--and confrontation. His 1931 \"Remorse for Intemperate Speech\" ends: \"Out of Ireland have we come. / Great hatred, little room, / Maimed us at the start. / I carried from my mother's womb / A fanatic heart.\"  Yeats was to explore several more sides of himself, and of Ireland, before his Last Poems of 1938-39. Many are difficult, some snobbish, others occult and spiritualist. As Brendan Kennelly writes, Yeats \"produces both poppycock and sublimity in verse, sometimes closely together.\" On the other hand, many prophetic masterworks are poppycock-free--for example, \"The Second Coming\" (\"Turning and turning in the widening gyre / The falcon cannot hear the falconer; / Things fall apart; the centre cannot hold; / Mere anarchy is loosed upon the world...\") and such inquiries into inspiration as \"Among School Children\" (\"O body swayed to music, O brightening glance, How can we know the dancer from the dance?\"). And at his best, Yeats extends the meaning of love poetry beyond the obviously romantic: love becomes a revolutionary emotion, attaching the poet to friends, history, and the passionate life of the mind. --Kerry Fried",
  "genres": [
    "Poetry",
    "Classics",
    "Irish Literature",
    "Fiction",
    "Ireland",
    "Literature",
    "20th Century"
  ],
  "author": "W.B. Yeats",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/1270881.The_Collected_Poems_of_W_B_Yeats"
}