{
  "title": "From Groningen to Montpellier: A walk along rivers and canals",
  "description": "In 1995 Hielke Hylkema went on a long-distance hike with very minimal luggage. He walked along canals and rivers from Groningen in the north of the Netherlands to Montpellier in the south of France.Meuse and Marne brought him to Paris. The Seine, Loire, and Rhône accompanied him to the Mediterranean.He tried to avoid as many barking dogs as possible and stopped in a nice quiet spot every day to practice Tai Ji.He hoped the hiking would reduce his anxiety, and maybe he would even find a girlfriend along the way.It is a travelogue with some additional commentary about the local sights and restaurants. In each chapter, there are small maps so that you can follow along with this journey.The book is filled with historical facts and observations, a touch of Chinese wisdom, and reflections on the books that influenced him (Henry David Thoreau, Lin Yutang, Robert M. Pirsig, Michel de Montaigne)Hielke chose history as his secondary theme, with an emphasis on the history of the regions and cities he passed. How did it all begin and how much of what you see today, points back to a distant past? How are past and present connected? He looked for clues in the names of the places and regions, in language, religion, and local customs. So by the end of it you will have learned a decent amount about early European (and French) history. From Celts to Charlemagne.The history of the Romans plays a leading role because written European history begins with the Romans. Many French cities started as Roman cities, and a large part of the Roman road network in France is still there in its original state. Hielke tells what can still be seen of these ancient Roman roads. They're pretty easy to spot on a map because they are all very straight.After the Romans, it was the Catholic Church that defined the face of Europe, so you can also read a little bit about the rise of Christianity and about the saints who took over tasks from the Roman gods.",
  "genres": [],
  "author": "Hielke Hylkema",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/56307958-from-groningen-to-montpellier"
}