{
  "title": "Tarnished Gold",
  "description": "Tarnished Gold is the captivating prequel to the bestselling V. C. Andrews Landry series that began with Ruby and continued with Pearl in the Mist, All That Glitters, and Hidden Jewel. This thrilling new novel takes us back to the Louisiana bayou in the time before Ruby. In a world of wondrous natural beauty—a world of tantalizing dreams and inescapable sorrow—we meet Gabriel Landry, daughter of Catherine and Jack.Growing up in her beloved swamp, Gabriel is supremely happy, despite the ever-widening rift between her Mama and her conniving, whiskey-drinking Daddy. Her classmates tease her, calling her \"La Femme Au Naturel,\" the Nature Girl, because she seems more interested in poling her pirogue through the canals than in romance. But Gabriel nurtures her own secret dreams. Then, days before her high school graduation, rich cannery owner Octavious Tate surprises her in a secluded pond and shatters her innocence.Pregnant and desolate, wishing to spare her dear Mama the scandal, Gabriel agrees to a shocking plan that will allow Octavious's frigid wife, Gladys, to claim the baby as her own and will net Gabriel's furious Daddy a huge payoff. Hiding in a tiny abandoned playroom in the Tate mansion, Gabriel is miserable. Her only visitor is Mama, whose mission as a Traiteur—a Cajun healer—gives her an excuse to treat Gladys Tate's \"pregnancy.\" But nothing is more wrenching than the moment Gladys takes baby Paul away forever.Returning home to the swamp, Gabriel drifts in a world of twilight gloom, brightened only by chance glimpses of her son. But as Jack Landry's reputation as a swamp guide grows, a hunting party brings handsome, gentle Creole millionaire Pierre Dumas to the bayou. Falling desperately in love, Gabriel will not heed the voice warning that their joy may bring her more grief than she can bear....",
  "genres": [
    "Fiction",
    "Horror",
    "Young Adult",
    "Romance",
    "Gothic",
    "Drama",
    "Adult Fiction"
  ],
  "author": "V.C. Andrews",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/563461.Tarnished_Gold"
}