{
  "title": "The Agatha Frost Cozy Mystery Winter Anthology: 5 Festive Cozy Mystery Short Stories",
  "description": "Controlling Christmas Janet jumped at the chance to direct the local annual nativity play, but not everyone is happy for her. When something precious of Janet’s is stolen during one of the rehearsals at the church, she dives into hunting down the culprit, but will she like what she discovers?Christmas Crystal HeistFor the fifth year in a row, yoga instructor Em escapes Northash to spend the holidays at a peaceful yoga retreat in the middle of nowhere. That peace is broken when something valuable is stolen from one of her fellow colourful guests. Can Em get to the bottom of the mystery before the usually zen group turns on each other?  Candle Crimbo Bash Claire spent years hearing about Warton Candle Factory’s infamous 1999 secret Christmas party, the Candle Crimbo Bash. Two decades later, she finds herself at the sequel ready to find out what makes a legendary work’s Christmas party. What she had in mind, however, is a far cry from how things play out…  Boxing Day Bingo Dot usually stays at home the day after Christmas, but she can’t ignore an invitation from an estranged friend to take part in Oakwood Nursing Home’s festive Boxing Day bingo event. After a decades-late reunion, she learns there’s more than bingo on her old friend’s mind. A cat burglar is on the loose, and with no one taking it seriously, the responsibility to uncover the truth falls on Dot.  Murder on the Christmas Express A surprise winter ride on a vintage steam train takes a deadly turn when someone aboard is murdered. Can passengers, heavily pregnant Julia and her private investigator husband, Barker, get to the bottom of the crime on their own?",
  "genres": [
    "Mystery",
    "Christmas",
    "Cozy Mystery",
    "Short Stories",
    "Novella",
    "Anthologies"
  ],
  "author": "Agatha Frost",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/56343964-the-agatha-frost-cozy-mystery-winter-anthology"
}