{
  "title": "Secret City: The Hidden History of Gay Washington",
  "description": "The New York Times BestsellerA New York Times Notable Book of 2022Named one of Vanity Fair 's “Best Books of 2022 ”“Not since Robert Caro’s Years of Lyndon Johnson have I been so riveted by a work of history. Secret City is not gay history. It is American history.”― George StephanopoulosWashington, D.C., has always been a city of secrets. Few have been more dramatic than the ones revealed in James Kirchick’s Secret City .For decades, the specter of homosexuality haunted Washington. The mere suggestion that a person might be gay destroyed reputations, ended careers, and ruined lives. At the height of the Cold War, fear of homosexuality became intertwined with the growing threat of international communism, leading to a purge of gay men and lesbians from the federal government. In the fevered atmosphere of political Washington, the secret “too loathsome to mention” held enormous, terrifying power.Utilizing thousands of pages of declassified documents, interviews with over one hundred people, and material unearthed from presidential libraries and archives around the country, Secret City is a chronicle of American politics like no other. Beginning with the tragic story of Sumner Welles, Franklin Delano Roosevelt’s brilliant diplomatic advisor and the man at the center of “the greatest national scandal since the existence of the United States,” James Kirchick illuminates how homosexuality shaped each successive presidential administration through the end of the twentieth century.Cultural and political anxiety over gay people sparked a decades-long witch hunt, impacting everything from the rivalry between the CIA and the FBI to the ascent of Joseph McCarthy, the struggle for Black civil rights, and the rise of the conservative movement. Among other revelations, Kirchick tells of the World War II–era gay spymaster who pioneered seduction as a tool of American espionage, the devoted aide whom Lyndon Johnson treated as a son yet abandoned once his homosexuality was discovered, and how allegations of a “homosexual ring” controlling Ronald Reagan nearly derailed his 1980 election victory.Magisterial in scope and intimate in detail, Secret City will forever transform our understanding of American history.",
  "genres": [
    "History",
    "Nonfiction",
    "LGBT",
    "Politics",
    "Queer",
    "Audiobook",
    "Gay"
  ],
  "author": "James Kirchick",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/56347310-secret-city"
}