{
  "title": "The Most Hated President, Yet the Most Loved: The Theory of Conservatives vs Liberals and the Hidden Truth Behind It",
  "description": "Foreword by Roger StoneConservatives vs Liberals, a view from both political parties. Why do they either love President Donald Trump or hate him? Why is he such a controversial figure? In this book you will get a unique perspective from a black female, veteran, and registered nurse, running for Congress. Follow Carla Spalding’s journey as she runs for Congress for Miami-Broward Congressional District 23, Florida. Understand how someone with no political background navigates through the underworld of nasty dirty politics of both parties. See how she became the nominee despite the efforts of one party to undermine and the lack of support from the other. Also, get an insider look at Carla’s prediction of who will win the presidency for 2020. Carla will speak to the future of both parties or the lack thereof. If you truly value democracy and want true change, this is the book for you!Conservative versus Liberals, a new beginning.  How do we want to live?  The way we are living now? Do we want to continue on the path of destruction that the Democrats are leading us in? Or do we want to return America the way that it used to be and how the President has made it so far? Trump blows up the system as we know it.Regular middle-class people vs the big political machine.Awakening the woke, blacks starting to see the truth.Why aren’t more Caribbean Americans,  Republican?Are the American people ready for the truth? Can Black America handle what is behind the political strategies on display?Are you ready for the Vaccine, Carla’s got the Truth Vaccine!!Think about the following If the Democrats are for the poor, then why, for generations, are they still poor? How have their policies really helped? Carla Spalding is planting a seed of learning to think rationally for self-determination. Carla doesn’t have all the answers to the future, but she will open your eyes to view different positions.  We don't always see things in the same manner.   The first thing that must be addressed is the mindset and empowering individuality.  It is important for the voters to wake up and demand more from their representatives, regardless of party.Are you ready for the truth?#1 International Bestseller in EIGHT categories in THREE countries. Including Rationalism Philosophy, Deconstructionism History & Criticism, Non-US Legal Systems, Public Policy Immigration, and Regional Planning in the US. Deconstructionism History & Criticism in AU. Deconstruction Philosophy Movement, and Rationalism in CA.",
  "genres": [],
  "author": "Carla Spalding",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/56354956-the-most-hated-president-yet-the-most-loved"
}