{
  "title": "The Unsinkable Greta James",
  "description": "An indie musician reeling from tragedy reconnects with her estranged father on a week-long cruise in this tale of grief, fame, and love from bestselling author Jennifer E. Smith.Greta James's meteoric rise to indie stardom was hard-won. Before she graced magazine covers and sold out venues, she spent her girlhood strumming her guitar in the family garage. Her first fan was her mother, Helen, whose face shone bright in the dusty downtown bars where she got her start--but not everyone encouraged Greta to follow her dreams. While many daydream about a crowd chanting their name, her father, Conrad, saw only a precarious life ahead for his daughter. Greta has spent her life trying to prove him wrong, but three months after Helen's sudden death, and weeks before the launch of her high-stakes sophomore album, Greta has an onstage meltdown that goes viral. Attempting to outrun the humiliation and heartbreak, she reluctantly agrees to accompany her father on a week-long Alaskan cruise, the very one that her parents had booked to celebrate their fortieth anniversary. This could be the James family's last chance to heal old wounds and will prove to be a voyage of discovery for them, as well as for Ben Wilder, a historian also struggling with a major upheaval in his life. Ben is on board to lecture about Jack London's The Call of the Wild, the adventure story Greta's mother adored, and he captures Greta's attention after her streak of dating hanger-ons. As Greta works to build up her confidence and heal, and Ben confronts his uncertain future, they must rely on one another to make sense of life’s difficult choices. In the end, Greta must make the most challenging decision of all: to listen to the song within her or make peace with those who love her.",
  "genres": [
    "Fiction",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Chick Lit",
    "Music",
    "Adult"
  ],
  "author": "Jennifer E. Smith",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/56360481-the-unsinkable-greta-james"
}