{
  "title": "Heart Smart",
  "description": "Dr. Maximillian Ramsey has a problem…I’m a jerk. Everyone I know or have ever worked with agrees. “Misanthropic asshole” is the term I hear most often.I don’t care what other people think as long as they leave me alone to focus on my research on soil microbiology. Plus, I walk with a cane thanks to a childhood accident. I have scars on my face. And if that isn’t enough to scare people off, my bad attitude and general grumpiness seal the deal. Which is just the way I like it.Except, I’ve been short listed for one of the most prestigious academic fellowships around. To win it, I’ll have to give a series of speeches. On a stage. With an audience. While being filmed.Yeah. None of that is going to happen.Unfortunately, my boss has a plan. He brings in one of the communications lecturers to give me a “make over,” help me write the speeches, and manage my social media.But the last thing I need is some nosy, bossy, gorgeous woman meddling in my life.And Holly is the solution…I’m a mere communications lecturer at a prestigious research university. I’m used to being outclassed and under-educated compared to the PhDs who surround me.But I’m good at what I do. Brilliant, actually.When Max’s boss (who happens to be my ex-husband) begs me to help transform this beast of a man into someone worthy of the fellowship, I have my work cut out for me.It’ll take a lot of badgering, blatant manipulation, and some outright thievery to get Max to cooperate. All of which I handle with the enough professionalism and restraint that should earn me a fancy grant.What I can’t handle is how unexpectedly attractive I find the stubborn and brilliant man.This is a battle of wills and wits, and neither is prepared to admit defeat …Heart Smart is a full-length contemporary romance and can be read as a standalone. Book #2 in the Work For It series, Educated Romance World, Penny Reid Book Universe.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Enemies To Lovers",
    "Audiobook",
    "Adult",
    "Workplace Romance"
  ],
  "author": "Emma Lee Jayne",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/56400137-heart-smart"
}