{
  "title": "The Stolen Lady",
  "description": "From the acclaimed author of The Night Portrait comes a stunning historical novel about two women, separated by five hundred years, who each hide Leonardo da Vinci’s Mona Lisa—with unintended consequences.France, 1939At the dawn of World War II, Anne Guichard, a young archivist employed at the Louvre, arrives home to find her brother missing. While she works to discover his whereabouts, refugees begin flooding into Paris, and German artillery fire rattles the city. Once they reach the city, the Nazis will stop at nothing to get their hands on the Louvre’s art collection. Anne is quickly sent to the Castle of Chambord, where the Louvre’s most precious artworks—including the Mona Lisa—are being transferred to ensure their safety. With the Germans hard on their heels, Anne frantically moves the Mona Lisa and other treasures again and again in an elaborate game of hide and seek. As the threat to the masterpieces and her life grows closer, Anne also begins to learn the truth about her brother, and the role he plays in this dangerous game.Florence, 1479House servant Bellina Sardi’s future seems fixed when she accompanies her newly married mistress, Lisa Gherardini, to her home across the Arno. Lisa’s husband, a prosperous silk merchant, is aligned with the powerful Medici, his home filled with luxuries and treasures. But soon, Bellina finds herself bewitched by a charismatic monk who has urged Florentines to rise up against the Medici, and to empty their homes of the riches and jewels her new employer prizes. When Master Leonardo da Vinci is commissioned to paint a portrait of Lisa, Bellina finds herself tasked with hiding an impossible secret.When art and war collide, Leonardo da Vinci, his beautiful subject Lisa, and the portrait find themselves in the crosshairs of history.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "World War II",
    "Art",
    "France",
    "Italy"
  ],
  "author": "Laura Morelli",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/56382369-the-stolen-lady"
}