{
  "title": "Forgotten In Death",
  "description": "If you're a crime fiction fan and haven't discovered them yet, welcome to the very best day of your life' Heat MagazineThe brand new thriller in the Sunday Times bestselling seriesFor a Homicide cop, murder often started the day. For the mixed-race female sloppily wrapped in a tarp and stuffed in a construction site dumpster, it had surely ended hersLt. Eve Dallas hasn't even arrived at work when her first call of the day comes in. Alva Quirk - forty-six years old, sidewalk sleeper - was beaten to death with a crowbar. Known to the local cops for handing out origami flowers to anyone who gives her change, Alva was well-liked but with no fixed address, no job and no family, there's noone to remember her.Eve has barely had time to examine the crime scene when her second victim of the morning is discovered just a block away. Make that second and third. Jane Doe - a well-dressed young mother and her baby shot and buried over 40 years ago.Two very different victims in the same location with no-one to claim them. Coincidence or does the history of the site hold the answer? To uncover the truth Eve must delve into a world of family businesses, Russian mobsters and shady dealings. These two women may have been forgotten in their lifetimes but Eve Dallas won't let them be forgotten in death'J.D. Robb is a fantastic storyteller who knows how to keep the pages flying by' -#1 International Bestselling Author, Karin Slaughter\"One of my all-time favorite authors... one of my all-time favorite series. J.D. Robb never disappoints!\" Lisa Gardner'Eve Dallas - tough as nails and still sexy as hell'Stephen King'J.D. Robb's novels are can't-miss pleasures'Harlan Coben'Curious corpses, tangled twists and one sizzling sleuth'Kathy Reichs",
  "genres": [
    "Mystery",
    "Romance",
    "Fiction",
    "Audiobook",
    "Crime",
    "Futuristic",
    "Thriller"
  ],
  "author": "J.D. Robb",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/56394277-forgotten-in-death"
}