{
  "title": "Saving Cascadia: A Novel",
  "description": "A few hundred years ago, Cascadia Island didn’t even exist. Like the Washington seacoast, it was rock submerged beneath the Pacific. A massive earthquake changed that, exploding the rock upward, making it land – unstable land, according to seismologist Dr. Doug Lam.Lam has spent years researching the Cascadia Subduction Zone. He published a theory that the unrelieved tectonic strain beneath the idyllic landscape of Cascadia Island could be triggered with modern construction processes – with catastrophic results. The paper was disregarded, even ridiculed, by his peers and by mega wealthy developer Mick Walker, who stands to earn millions from the construction of a luxury resort on Cascadia. The elegant casino, hotel, and convention center will reap millions for him even if the tiny island only lasts for a short time…When a series of earthquakes begins to shake the Northwest Corridor, Doug’s worst fears are confirmed. In an attempt to convince Walker to evacuate Cascadia immediately, Doug hurries to join guests arriving for the resort’s grand opening. As the tremors wreak havoc across the Northwest coastal area, the military is left with too few resources to assist the people on Cascadia. Convinced that the island will be in ruins within hours, Doug reluctantly calls upon his girlfriend, Jennifer Lindstrom, president of Nightingale Aviation – a major medical transport helicopter company – for help.With snow falling, visibility dropping, and winds increasing, Doug embarks on an impossible mission with Jennifer and Nightingale’s helicopters to evacuate over three hundred people, while smaller earthquakes continue to herald the approach of a catastrophic tsunami.John J. Nance hurtles readers along a nail-biting quest to rescue hundreds of stranded vacationers and resort staff. Meticulously researched, and with the signature authenticity only a veteran pilot could provide, Saving Cascadia is a hair-raising thriller of awesome magnitude.",
  "genres": [
    "Fiction",
    "Thriller",
    "Adventure",
    "Aviation",
    "Action",
    "Mystery Thriller",
    "Geology"
  ],
  "author": "John J. Nance",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/563807.Saving_Cascadia"
}