{
  "title": "CALLING HER HEART: Box Set books volumes 1-4",
  "description": "#1 WHISPER OF THE HEARTStarting over is never easy.On the run from an abusive home and shunned by her family and friends, Arlana and her son seek refuge on a family farm. Heartbroken and with no one to turn to, she finds comfort in her new neighbours who welcome her with open arms.Finally trusted and accepted by those you'd least expect, she's able to settle in and find happiness.But happiness has a way of being short-lived when you're running from your past. Her family back home is unravelling at the seams. Her friendship takes a step in the wrong direction, and everything starts to come apart again. Will love be enough to mend her broken heart? Or will that very love threaten to topple all the happiness she's built?#2 NO TURNING BACKA moment of vulnerability. Enduring consequences. Can Arlana ever forgive herself?Josiah leaves when she needs him most. As Arlana's whole world crumbles around her; her grandfather's terminal cancer, feelings of unworthiness, doubting Josiah's love - things don't seem like they can get worse.Drowning in grief and fear, she turns to Josiah's best friend, Lachlan. He alone knows her darkest secret. And he still cares for her and offers friendship and support. So she clings to him and the warmth of their friendship.Josiah however, is cold and aloof. He's a whole different person than Arlana remembers and it's tearing her up inside. All he does is push her away. Arlana knows that the things that matter most are the child growing within her and her young son. She must also find her way back to God, or has He turned His back on her as well?Caught between two different worlds; she must make a heartbreaking choice. The wrong one might destroy her spirit. Whatever her decision, there's no turning back.#3 FORSAKE ME NOTHoping for a clean break, Arlana follows through with her decision, refusing to look back. Aware of the tension it will cause she is certain she has made the right choice for her and her son. Life, however, isn't that easy.Facing the skeletons of her past, now in her present, she is more determined than ever to hold onto her faith. What can she do? Surrounded by her antisemitic family, life is more than a little challenging.The demons from Atarah's past are alive and well after tragedy hits. Atarah's faith is put to the test.#4 HEAR MY CRYAtarah embarks on a new phase of her life and the challenges it brings. Can there be reconciliation? Josiah faces a decision that changes not only his life, but Atarah's destiny.",
  "genres": [],
  "author": "Avalon Davidson",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/56388661-calling-her-heart"
}