{
  "title": "أوتار الماء",
  "description": "يا سكني، كثير من هؤلاء الناس الذين نراهم يمضون من حولنا في نهر الحياة، دهستهم الحياة من قبل مرة أو مرات. لكنهم انتفضوا ليواصلوا المسير . فالحياة طيبة برغم كل شيء ، وبرغم أنها في مثل تلك الحالات تغدو مثقلة بذكري اللحظات الأليمة .. تغدو مفعمة بالشجن.. والشجن حزن جليل. والجلال أعلي مراتب الفتنة..يا سكني...\"لايعرف احد انه يتسلل بين الحين والحين الى تلك الشرفة ليخبئ فيها قارورة عطر صغيرة مما يستطيع استخلاصة , يخفيها وراء ظهر الميكروويف ويتركها مفتوحة , لعل روحا هائمة من ارواح المغدورين الكثر فى هذا العالم تجئ ... وتنهل مما يتاح لها من اريج\" ــــــــــــــــــــــــــــ كتب صلاح فضل عن المجموعة القصصية بجريدة الاهرامهو مبدع دقيق وباهرتوهمت يوم ان قرات له منذ قرابه عقدين من الزمان مجموعته القصصيه‏'‏ الموت يضحك‏'‏ انه يعيد سيره يوسف ادريس في هجر الطب وعشق القصه الغاويه لكنه لم يلبث ان وقع في غوايه انكي وافدح ترك مصر وطار علي اجنحه مجله العربي الكويتيه الي مختلف بقاع المعموره شرقا و غربا وعندما انتثر عطره في الصحافه المصوره الانيقه ونجا من تراب القاهره الرمادي خشيت ان يضيع اسمه من ذاكره قرائها المولعين بالنسيان بحيث لا يصبح مرشحا لملء فراغ العبقري الجامح الذي كثيرا ما صرخ دفاعا عن الحريه والثقافه حتي لكان يوسف ادريس قد ارتحل معه مره اخري لكن في اعاره عربيه‏!‏ غير اني اصطدمت بمجموعته الاخيره‏'‏ اوتار الماء‏'‏ فنبهتني الي حقيقه بديهيه وان كانت مدهشه لا يمكن للتجارب العظمي ان تتكرر ولا للشخصيات الفذه ان تستنسخ فلكل زمان مبدعوه وقاماته ولا تجوز المقارنات المبنيه علي مشابه سطحيه خاصه ابان فوره التحولات التي شملت كل شئ‏.‏ لقد اختمرت تجارب محمد المخزنجي الفنيه في مواطن ثقافيه عربيه وعالميه مغايره لمن قبله وعثر علي ايقاعاته المميزه وهو يعزف علي الوتر الانساني بكل عذوبته وصفائه وما جعله يحقق درجه عاليه من شعريه السرد ليس شبهه بيوسف ادريس بل اختلافه الجذري عنه فلم تعد حروب الايديولوجيا هي منطلق كتابه اليوم ولا مناوشه السلطه والاحتماء بها تاره والتربص بها تاره اخري هي ما يصنع قامات المبدعين الكبارانقضي عهد السرديات الجماعيه الكبري في تاريخ الثقافه ودخلت الي منطقه الفولكلور واصبح علي كل فنان ان يصنع عالمه ورويته ويبتكر منظوره للحياه وتصوره للمستقبل بمعزل عما يريده الاخرون منه‏.‏كثيرا ما اجدني عند قراءه مجموعه قصصيه مدفوعا الي التماس الخطوط الواصله بينها متمنيا اندماجها في نسيج روائي متعدد الشرائح لان كل قطعه منها لا تشبع احساس القارئ باستدارتها واكتمالها واستقلالها عما يحف بها من اجزاء عندئذ يدرك ان صاحبها لا يمتلك موهبه الخراط المحترف ولا يعرف كيف يكور مخلوقاته التامه بنعومه كافيه‏.‏ لان سر القصه القصيره انها تولد مكتمله كالطفله التي لا تحتاج الي مزيد من الاعضاء لا يمكن مطها او اختزالها او ادماجها في مخلوق اخر‏.‏ قليل جدا من كتاب السرد من يحقق هذا الشرط الجمالي الموسس للقصه القصيره ومنهم كاتبنا الموهوب‏.‏ فمجموعه‏'‏ اوتار الماء‏'‏ تضم عشر قطع‏.‏ لا تتداخل ولا تتخارج كانها مجره فلكيه من النجوم الصغيره المتناغمه لكل منها تجربته وتقنياته ودلالته‏.‏ ربما كانت مفارقه الربط بين الاطراف المتباعده هي التي تعطي مسحه رهيفه من الاتساق علي منظومتها الكليه او كان البحث عن الظواهر اللامرئيه وشغف السوال عن السر الكامن خلف الخوارق هو التيار الدافئ الذي يجعلها ذات حراره حميمه متقاربه لكن كلا منها يظل ثمره شهيه لها نكهتها الخاصه تبث في روحك شعورا بالاكتمال بعد قراءتها يدعوك الي التريث في مطالعه غيرها حتي تستجمع قدرتك علي بدايه شئ جديد‏.‏ولناخذ مثالا علي ذلك قصته الاولي‏'‏ تلك الحياه الفاتنه‏'‏ التي يخاطب فيها الراوي قرينته بعد رويته لحادثه صغيره دهست فيها السياره قطه فراها مكومه تحت العجل وراها في اللحظه ذاتها تفر ناجيه يقول‏'‏ اعرف يا سكني ان احدا لن يصدقني مثلك واعرف ان تصديقك لي ليس مماشاه مجنون تحبينه لكنه تصديق شريكك في الايمان بان الكون من حولنا ملئ بالمدهشات التي لم نعرف قوانينها فنسميها معجزات او خوارق واعرف انك طيبه الي درجه الفرح بكل معجزه شجيه لهذا لن اخون طيبتك تلك وسابسط بين يديك بامانه تفسيري لتلك الرويه التي تكشفت لي وانا في الطريق اليك بعد نجاتك من الموت مرتين مره من النزيف الداخلي ومره من الجراحه الكبري التي استاصلوا فيها جزءا من داخلك‏..‏ بقوانين عالمنا المحسوس يا سكني اندفعت القطه فدهستها عجلات السياره لكن بحسابات الروح وبما كانت فيه من فرح اللعب ثم في مواجهه المباغته الخئون للخطر الداهم قفزت قفزه الحياه في وجه الموت فنجت‏.'‏ويربط الفنان هذه الرويه المزدوجه للزمن وللاشياء بما يراه في نهر الشارع من اناس دهستهم الحياه مرتين لكنهم انتفضوا كي يواصلوا المسير مما يقدم لمحه بارقه من حكمه سيروره الوجود في ظل هذه اللحظه الكاشفه واذا كانت هذه دلاله القصه فان مشهدها الوصفي وسطورها التحليليه وما تعبق به من عطر المشاعر وحركه الالتفاتات وحيويه المواقف تجعل لقراءتها متعه لا تغني عنها هذه الفقرات المفصوله عن سياقها الدافق‏.‏حقيبه بلون الشفقفي هذه القصه الاخري يطلعنا المخزنجي علي بعض اسراره الابداعيه عندما توقف في متحف‏'‏ تشيخوف‏'‏ بروسيا امام‏'‏ خزانه نحيله من خشب البلوط لها واجهه كامله من البللور الصافي وما ان نظرت الي الرف الاوسط حتي‏..‏ انذهلت‏.‏ تسمرت امام الخزانه التي كان يستعملها تشيخوف لحفظ ادواته الطبيه محدقا جاحظ العينين‏..‏ كانت حقيبه صفراء برتقاليه حقيبه من جلد الغزال يا محمد تماما تشبه الحقيبه التي حلمت بها منذ ثلاثين سنه وكانت سببا لصدام جنوني مع امي المسكينه وسببا لاكتشاف لعله هو الذي مازال يبقيني علي قيد الحياه‏.‏ ان هذه التزامنات هذه التوافقات الغامضه بين اشياء متباعده هذه التجليات تذهب بلبي‏'‏نلاحظ اولا تطابق الراوي مع شخصيه القاص في الاسم والمهنه والمشاعر والهموم الشخصيه والمهنيه مما يضاعف من شعور القرب الحميم من التجربه الصادقه في هذا الجزء والممهده بدورها لتصديق الجزء الاشد وعوره فيها فالصبي قد الح علي امه ان تقتني له حقيه من جلد الغزال فردت عليه قائله‏'‏ يا سلام غالي والطلب رخيص‏..‏ اول ما يبيض الديك يا نن عيني‏'‏ وبهذه الكلمات تفجرت المشكله فقد جن جنون الصبي واخذ يمزق حقائبه مدركا سخريه امه به ثم امسك بالسكين وصعد الي سطح بيتهم حيث عشه الطيور كان في العاشره من عمره حينئذ اي ثلاث سنوات بعد بدايه القدره علي التجريد كما يقول الراوي بدايه الفصل ما بين التخييلي والحلمي والواقعي قبل ذلك يتعامل الاطفال مع هذه الاشياء علي قدم المساواه‏.‏ بعدها لا يحدث ذلك الا في حاله الجنون‏:'‏ كنت ابكي ابكي بتوحش وقد قبضت علي الديك وانا راكع وهو بين ركبتي ويدي اليسري بينما كانت اليمني ترفع السكين اما ان يضع البيضه او اخرجها من داخله‏.‏لحظه بدات هياجي كان ذلك لادراكي ان امي تسخر مني‏.‏ وبعد ذلك ادركت ان بيضه الديك الذهبيه التي يضعها مره في العمر ما هي الا بيضه الحكايات السحريه ايقنت انها حقيقيه وموجوده في احشاء الديك الممسوك بين ركبتي ويدي والسكين‏'‏ ثم يصف تلك اللحظات العجيبه لينتهي منها الي حاله نورانيه خالصه حيث اخذ الديك يشف وينفش ريشه ويتالق بالوان زاهيه كانه قد اصبح من زجاج حي ملون‏'‏ وفي قلب الزيغ اللوني داخله اخذت شمس صغيره تولد‏..‏ تشتعل بلون ذهبي هادئ‏..‏ وما ان تحركت انا حركه يسيره حتي اختلفت زاويه النظر‏..‏ وتبينت دحو هذه الشمس الصفراء‏..‏ كانت لحظه مثل السرنمه‏(!)‏ تلك التي تلت هذا التجلي‏.‏ ولم استطع عبر ثلاثين عاما ان اتذكر غير اني ذهبتالي مكان ودفنت فيه هذا السر المتوهج وبخبره هذا البعد الغائر من الزمن بحكمه هذا الموروث اتخذت قراري فلا بوح ولا بيع‏..‏ اته سريسري وحدي‏'.‏اما الحقيبه التي ترقد في خزانه‏'‏ تشيخوف‏'‏ فان الراوي علي استعداد لان يقسم انها الحقيبه ذاتها التي حلم بها يوما وقاده حلمه الي اكتشاف ما اكتشف‏.‏‏'‏وانني بمقدار يقيني من وحده الكون لا اشك لحظه في ان بارقا برق لسبب ما في الوجود يوم كنت في العاشره ونقل الي ذهني الحالم صوره تلك الحقيبه النائمه في خزنه ذات واجهه زجاجيه علي بعد الاف الاميال في اقاصي قاره بعيده‏'.‏ اما القارئ الذي لا يريد تصديق هذه الخوارق العجيبه فحسبه ان يفترض قصه لتشيخوف قراها هذا الصبي المفتون بالسرد منذ طفولته ولمعت في ذهنه من اوصافها صوره حقيبه جلد الغزال الثمينه حتي يستقر ضميره علي سبب معقول‏.‏رنين اوتار الماءيبدو ان هذه المجموعه القصصيه تتمحور حول الغرائب التي جمعها محمد المخزنجي في جولاته البعيده‏.‏ خاصه في اقصي المشرق واحالها الي لحظات ابداعيه خارقه لا تكاد تخلو واحده منها مما يدهش ويتجاوز حدود العقل ويقف بالراوي علي حافه الجنون‏.‏ ولانه راو اليف ووديع فهو دائما يحدث نفسه او يحدثك كمخاطب في تخاطر موصول‏.‏ والقصه التي اعطت المجموعه عنوانها‏'‏ اوتار الماء‏'‏ تستحق ان نتريث عندها لانها دفعت الكاتب الي اختيار فقره من احد الكتب العلميه وتصدير المجموعه بها تدور حول اثر الرنين‏'‏ الذي ينبعث من اصوات بعض مغنيات الاوبرا‏'‏ السوبرانو‏'‏ بالغه النقاء والقوه ممن يستطعن باصواتهن تهشيم كووس البللور بفعل الرنين وهو محاوله الماده للاهتزاز توافقا مع موجه صوتيه عاليه الطاقه تجعل الزجاج يرج نفسه بعنف حتي يتحول الي نثار كيما ينجز هذا التوافق وكانه تحول الي اوتار عديده يتجاوب كل منها مع موجه الصوت الحافز‏'.‏اما القصه فتحكي تفاصيل لقاء عارض بالصدفه بين الراوي الذي هاجر الي تخوم المعموره في كمبوديا علي حافه الغابه العذراء التي منحته وحدها السكينه وعمل دليلا سياحيا لها كي يدرا عنها هجوم المتطفلين علي مساربها الخفيه ثم يلتقي بعد خمسه عشر عاما بطبيبه الذي عرض عليه حالته في قسم الامراض النفسيه والعصبيه بمستشفي المنصوره والذي لم يتعرف عليه مما جعله يكتب له رساله هي هذه القصه دون ان يختلف شكل الرساله عن نمط الكتابه القصصيه في المجموعه يقول فيها‏:-‏‏'‏ اتذكرك بشده فانت طبيب من اثنين بين عشرات الاطباء الذين عرضت عليهم حالتي ووضعتما احتمالا مختلفا لتفسير الاعراض التي كنت انا نفسي اظنها بوادر جنون كانت حاله مدهشه لرجل لا يستحم ولا يغتسل و يمتنع عن الطعام اكتئابا عندما تمطر الرجل الذي اعتاد مع انطلاق الماء من صنبور او اي مصدر اخر ان يسمع بكاء اطفال وعويل نسوه وانتحاب رجال واصوات مبهمه صارخه تتلاحق مفزعه‏.‏ كلهم شخصوا حالتي ضمن دائره الفصام وقالوا عن الاعراض انها هلاوس سمعيه‏.‏ وقد سالتني انت مره السوال الذي لم يوجهه لي طبيب اخر‏:‏ وماذا تظن حالتك كيف يمكن ان تفسرها يومها لم يكن لدي تفسير لكنني كنت متيقنا انها ليست هلاوس‏.‏ انها اصوات حقيقيه اسمعها وان لم انجح في تحديد مصدرها انذاك‏.‏ لكن خاطرا عابرا اضاء لي فجاه واحسست انني اعثر علي تفسير لم يقل به احد لكنه ينبع من قوانين الفيزياء البسيطه‏.‏ انت تعرف ان الصوت موجات من تضاغط وخلخله في الهواء‏.‏ وتراكيب تنطلق من حولنا ولا تختفي او تتبدد كما يظن معظم الناس‏.‏ وانها طاقه تبقي وتتخذ لها مكامن تتناسب مع قوتها وحيزها المضغوط حتي يتم استدعاوها‏..‏ وهنا لب مسالتي فالماء عندما يخرج مضغوطا بقوه من ثقوب‏'‏ الدش‏'‏ الرفيعه او من مصفاه صنبور الحوض او بجذب كتله الارض لزخات المطر الماء في هذه الحالات يغدو كاوتار مشددوه قابله للاهتزاز باصغر نسمه هواء فتستدعي بذبذباتها اصوات الصراخ والبكاء والعويل والنحيب والفزع يستقبلها سمعي دون بقيه خلق الله لخلل او ميزه في هذا السمع‏'.‏لذلك لم يجد الراوي مكانا يضمن له سكينه النفس وهدوء الاصوات سوي علي حافه خليج تايلاند حيث الغابات المطيره والنباتات الكثيفه والطيور الطليقه وبقيه قبائل معزوله ومتناثره تعيش علي الفطره في سلام الغابه‏.‏ يحيون علي جمع الثمار البريه وصيد السمك من الجداول الشفافه في وهاد الخضره عاش بينهم وتزوج احدي بناتهم واخذ ينشد للطبيعه الصافيه العذبه ولما وراءها من اسرار‏.‏ وهنا تتجلي رويه محمد المخزنجي الذي برئ من الايديولوجيا واخلص للعلم والفن واتخذ من الادب مهجرا يفتح له اسرار خزائن الوجود الانساني واعماقه الغائره وموسيقاه في تخالفاتها وتوافقاتها التي تهتز لها حركه الحياه البشريه دون ان تتحطم‏.‏",
  "genres": [
    "Short Stories",
    "Literature",
    "Fiction",
    "Novels",
    "Unfinished"
  ],
  "author": "محمد المخزنجي",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/5639869"
}