{
  "title": "Fade to Blue",
  "description": "CAITLYN⠀You don’t know me. I do the work behind the scenes. The I-will-not-only-make-your-dirty-little-secrets-disappear-but-also-transform-your-life work. I am the go-to publicist and manager in the wild world of entertainment. I’m also a damn good single mom to the most adorable four-year-old ballbuster.Despite my nonexistent dating life, in the eternal words of Beyoncé, I slay.But good Lordt y’all, I was not ready for Blue King. ⠀The king of the NBA. Brother to the popstar prince, Delaware King. Ridiculously sexy alpha-hole with a heart as big as Texas. He’s the epitome of swoon, and also my biggest headache. My newest client, and the man who has haunted my filthy dreams ever since we…⠀Nope, we’re forgetting that night, remember?How’s that working out for you, girl?Not great, because it seems like every single moment with Blue King makes me want a thousand more.F*** me. I think I’m falling for my client. ⠀⠀⠀BLUE⠀You already know who I am. ⠀You’ve probably chanted my name from the stands. You may even have my number on your back and my gorgeous face plastered on your kid’s bedroom wall.Blue King, NBA living legend. Three-time champion. Bleeding heart philanthropist. America’s favorite boy next door. But underneath all of that, I’m a mess. Turns out, confessing your love to your best friend/your brother’s soulmate does not end well. ⠀You know what else doesn’t result in a happily ever after? Running away from home in a raging hurricane of emotions and even worse decisions, resulting in many drunken nights and a fight with a brick wall that ends with a broken wrist, a pissed off team, and a tarnished reputation. Hello, rock bottom. It’s really nice to meet you. ⠀Now you know why I needed Caitlyn Jones. The publicist of publicists. A true boss, with a penchant for hot pink, F-bombs, and sky-high stilettos.She’s ballsy and beautiful in every single way, and she’s making me feel things that I have never felt before—not even with Zoey.F*** me. I think I’m falling for my publicist. ⠀Yeah, I didn’t see that one coming either.",
  "genres": [
    "Romance",
    "Sports Romance",
    "Childrens"
  ],
  "author": "Andrea  Hopkins",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/56380801-fade-to-blue"
}