{
  "title": "Shopping for a Turkey",
  "description": "alternate cover edition of ASIN B08R6D3345I don’t understand Americans. Or, as we say in Scotland, I dinna understand ye eedjits.And I definitely dinna understand the crazy mother-in-law of my cousin Declan. Who in their right mind names a wee dog Chuffy?I’m stuck in New York after ma agent makes a bloody mess of an otherwise good endorsement contract for a sports towel company, and this crazy American holiday–Thanksgiving–is in two days.The invitation to spend it in Mendon, Massachusetts, with the Jacoby family is about as appealing as rotten haggis. As far as I can tell, Thanksgiving is about stuffing yerself silly, watching pathetic American “football,” while fighting with relatives ye only see once a year.If I wanted that last one, I’d head back to Scotland, where we dinna need a holiday to be salty to each other.Ma firm answer is nae.Until I remember Amy is part of the family.Suddenly, I’m available.Eager, even. Perhaps she’ll pull ma wishbone. I hear that’s part of the Turkey Day festivities, aye?What I canna admit, though, is how she pulls ma heartstrings, too.Which shouldna feel better than the wishbone, but it does.And here comes Amy's mother with another holiday tradition, this one a bit early.A sprig o’ mistletoe, dangling right above Amy’s bonnie head.Shopping for a Turkey features Scottish football player Hamish McCormick and Amy Jacoby as they navigate unusual cultural norms, new traditions, and the undeniable attraction between these two characters, who have appeared as supporting players in Julia Kent's New York Times-bestselling Shopping series. It's their turn to have their own all-new spinoff series. And to pull the wishbone. ;)",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Holiday",
    "Sports Romance",
    "Novella",
    "Sports"
  ],
  "author": "Julia Kent",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/56389570-shopping-for-a-turkey"
}