{
  "title": "مجموعة العبقريات الإسلامية",
  "description": "- عبقرية محمد صلى الله عليه وسلم.- عبقرية الصديق رضي الله عنه.- عبقرية عمر رضي الله عنه.- عبقرية عثمان بن عفان رضي الله عنه.- عبقرية الإمام علي رضي الله عنه.- عبقرية خالد رضي الله عنه.نبذة موقع النيل والفرات:من الصعوبة بمكان... إدراك مدى الأثر الذي تركه العقاد للحضارة العربية... فهذا المفكر الأسطورة ترك ميراثاً يستعصي إدراكه على كل ذي قدرة وفكر... عشرات بل مئات الكتب والدراسات والمقالات والأشعار... ومن عينة كتاباته السياسية التي توقفت بعد الثورة يبرز كتابه \"لا شيوعية ولا استعمار\" كعلامة حقيقية في هذا المضمار.. وتعد العبقريات أشهر ما أخرج العقاد للفكر الإسلامي وهو لم يكتب تاريخاً للأشخاص أو الوقائع فحسب... كل كان يصب الفكر في قوالب كتبه محللاً للأحداث ومواقف الشخصيات التي يتناولها عن طريق معالجته ومناقشته لأمهات الكتب التاريخية ومراجعها الكبرى...وبين يدينا كتاب جمع توليفة من كتب العبقريات وكانت البداية مع عبقرية محمد صلى الله عليه وسلم، حيث تصدى العقاد في هذا الكتاب للدفاع الذي يتصدى للدفاع عن رسول الله، والذود عن شرعته، والرد على شانئيه ممن اجترأوا على مناوأته، والإتيان بالبرهان تلو البرهان على إثبات عظمته، وعظمة دعوته، وقدسية رسالته، وسمو عبقريته... لقد تناول العقاد الكشف عن عبقرية محمد صلى الله عليه وسلم في قوله وفعله، بل في سكوته وفكره، فأفاد العقاد وأجاد، واستعرض فأبدع، واستقص فأشبع، وتألقت غيرته على محمد (صلى الله عليه وسلم)، في رد سهام مناوئيه إلى نحورهم، وإقحامهم في كل باطل من دعاويهم.أما في كتابه عبقرية الصديق فبدأ العقاد كتابه بالقول في تقديم كتابي هذا عن أبي بكر الصديق أقول ما قلته في \"عبقرية محمد\" و\"عبقرية عمر\" وكل كتاب من هذا القبيل.وفحواه أنني لا أكتب ترجمة للصديق رضي الله عنه، ولا أكتب تاريخاً لخلافته وحوادث عصره، ولا أعني بالوقائع من حيث هي وقائع، ولا بالأخبار من حيث هي أخبار، فهذه موضوعات لم أقصدها ولم أذكر في عناوين الكتب ما يعد القارئ بها ويوجه استطلاعه إليها. ولكنما قصدت أن أرسم للصديق صورة نفسية تعرفنا به، وتجلو لنا خلائقه وبواعث أعماله، كما تجلو الصورة ملامح من تراه بالعين. فلا تعنينا الوقائع والأخبار إلا بمقدار ما تؤدي أداءها في هذا المقصد الذي لا مقصد لنا غيره... ولعل حادثاً صغيراً يستحق منا التقديم على أكبر الحوادث إذا كانت فيه دلالة نفسية أكبر من دلالته، ولمحة مصورة أظهر من لمحته. بل لعل الكلمة الموجزة التي تجيء عرضاً في المناسبات تتقدم لهذا السبب على الحوادث كبيرها وصغيرها في مقياس التاريخ\".إن ذلك النص العقادي الواضح ليحمل في طياته تبياناً واضحاً على أن مؤلف هذه العبقريات لم يقصد الكتابة التاريخية المعروفة والمتداولة، وإنما كان هدفه الحقيقي من وراء كتابته لتلك السير أمراً آخر هو الذي دفعه وألح عليه إلى أن يتناول تلك الشخصيات بذلك \"التشكيل الحر\" لو جاز لنا هذا التعبير.وبالعودة لمتن كتابة \"عبقرية الصديق\" رضي الله عنه، نجد أن العقاد قد أوفى الإمام الصديق حقه من التقدير والتوقير في هذه الدراسة بلا مراء. وأثبت لقراءة بما لا يدع مجالاً لباحث من أنه الصديق قولاً وفعلاً وعملاً في كل خلائقه وشمائله.. فهو الكريم السمح الودود.. وهو الأمين في الصداقة، والأمين في السيرة، والأمين في المال، والأمين في الإيمان، والأمين في الحكومة إلى جانب شجاعته في الرأي وفي القتال.. ثم هو في كل أولئك أكثر من الأمين.ولم يفت العقاد في هذه الدراسة أن يعالج كالعهد به العديد من صفات الصديق أبي بكر رضي الله عنه في أسلوب جزل رصين اشتهر به العقاد بين كتاب عصره. فناقش خلال صفحاته دعاوى المستشرقين وأباطيل المبطلين بالدليل الواضح والحجة البينة التي لا نملك إزاءها سوى التسليم.وقد تألق العقاد في هذه الدراسة عندما تصدى للرد على تلك الفرية الكبرى التي تقول بها بعض أعداء الإسلام بالنسبة لخلافة أبي بكر. قالت تلك الفردية: \"إن هناك اتفاقاً سابقاً ومؤامرة دبرت بين أبي بكر وعمر وأبي عبيدة ليأخذ الخلافة الأول والثاني فالثالث رضوان الله عليهم.كما تألق العقاد –كذلك- في هذه الدراسة عن الصديق أبي بكر عندما قارن بين أبي بكر وعمر في علاقتهما بالنبي صلى الله عليه وسلم فأثبت بالأدلة والبراهين أن أبا بكر نموذج للإقتداء في صدر الإسلام، وعمر نموذج للاجتهاد. وكلاهما كان يحب النبي ويطيعه ويحرص على سنته، ويعجب به غاية ما في وسعه من إعجاب؟وفي كتابه عبقرية عمر، امتطى العقاد لهذا الكتاب صهوة فكره، بغية الإحاطة بعظمة بطله، فبطله ذو لون جديد، وعبقريته ذات طابع فريد، والكتاب ليس سرداً لسيرة عمر بن الخطاب، ولا عرضاً لتاريخ عصره، وإنما هو وصف له، ودراسة لأطواره، ودلالة على خصائص عظمته، واستفادة من هذه الخصائص لعلم النفس، وعلم الأخلاق، وحقائق الحياة، لذلك ركز العقاد على ما يفيد هذه الدراسة، سواء لديه أكان من حادث صغير أم عظيم. كما أظهر حرجه عندما حاول أن يجاري من يسمون بالكتّاب المنصفين، الذين يقرنون المدائح بالمعايب، ويمزجون النقائص بالمناقب، ولا يأتون بحسنة إلا نقبوا عن سيئة تمحوها، أو تقلل منها، وكأن سر حرج العقاد، أنه لم يجد عيباً ولا ما يستحق اللوم في حياة عمر وأطواره، مما جعله يتوقع أن يتهم بالمغالاة والتحيز والإعجاب، إذ كيف يحاسب-هو أو غيره-عمر بن الخطاب، وقد كان عمر يحاسب نفسه بأعنف مما كان يمكن أن يحاسبه غيره؟وسيرة عبقرية عثمان كانت المحطة الرابعة للعقاد، وسيرة عثمان ما هي إلا نمط من أنماط متعددة، زخرت بها الدعوة الإسلامية من سير الخلفاء، وغير الخلفاء كأبي عبيدة، وخالد، وسعد، وأمثالهم من الصحابة والتابعين.. ما منهم إلا من كان عظيماً بمزية، وعلماً من أعلام التاريخ...وسيرة عثمان لا تبرز لنا عبقرية كعبقرية الصديق أو الفاروق أو الإمام، وإنما تبرز لنا من جانب الأريحية صفحة لا تطوى، ولا يستطيع العقل الرشيد أن يرجع بها إلى باعث غير باعث العقيدة والإيمان.لذلك لم يكن مقتل عمر كمقتل عثمان، فبواطن الحادثين والقيم النفسية الكامنة وراءهما متباينة، لأن عمر قتل بيد دخيلة على الإسلام، وبتخطيط من خصوم الإسلام، أما عثمان... فقد قتل بأيد مسلمة، حركها وقادها الدهماء الشاغبون.ولقد تساءل الكاتب: ماذا صنعت العقيدة إذن بنفوس الحاكمين والمحكومين؟ وماذا تغير في الأمر عما عليه من فتك الجاهليين بعد قتال المؤمنين، وإيمان الكافرين؟ ولكنه استدرك بأن العقيدة لا تبطل الخلاف والنزاع، ولا تلغي الحوادث والخصومات، وإلا كانت شللاً معطلاً لحياة الأمم، ومعوقاً لمجرى التاريخ.ولا عجب إذن إن كان الناس قد ابتلوا بشرور تفوق الخصومات، إذ ليس المطلوب من العقيدة إبطالها، وإنما أن ترتفع بالنفوس عن أن تكون في غير شأن، أو شأن هزيل ضئيل، فدورها الحقيقي: إيقاظ القيم، وتحريك الهمم.وعلى هذا لم يكن مدار البحث الخصومات والأحداث، وإنما القيم والمبادئ التي دارت عليها الخصومات والأحداث.. ولقد كان مدار الخصومة، محاسبة الرعية للإمام، ومحاسبة الإمام لنفسه.وقارن الكاتب بين ما كان عليه أبناء الجاهلية والبادية وحكومات الجزيرة العربية من غمط حق المحكوم في محاسبة الحاكم، حيث كانت شرعة الحكام وقتئذ طغياناً مطلقاً من جميع القيود.. وبين ما وصلت إليه الأمور في إطار التطور إلى حد محاسبة الخليفة على كل صغيرة وكبيرة، ومن كل صغير وكبير، وهذا ما حققته العقيدة الإسلامية على أعقاب الجاهلية.. ولئن كانت المآرب الذاتية وراء كل محاسبة لعثمان، فإن هذا كان عيب الحركة، وإن لم يكن عيباً لحق المحاسبة، لأن محاسبة الحكام كانت قيمة جديدة في الصدر الأول من الإسلام، فنادى بها الخاصة والعامة، وظلت عاملاً مهماً في السياسة أيام الخلافة، وبعد أن صار الحكم ملكاً متوارثاً..ولقد بلغ عثمان الذروة في محاسبة نفسه، وتحرجة من المساس بالحياة البشرية ولو في سبيل الحفاظ على حياته، فلما أيقن القتل رفض أن يبقى في داره من يقتل أحداً ممن يحيطون به، ولما طلب منه التنحي أبى، ولم يكن إباؤه حرصاً منه على السلطان، فلا شيء أغلى من الحياة وقد هانت عليه، ولا يزعم أحد أنه غنم من الخلافة مالاً، فقد ترك الدنيا وماله دون ما كان عليه يوم استخلف، ولكنه خاف جريرة التنحي، وما سيعقب ذلك من نزاع وقتال.وعن صفات الإمام علي وعن شخصيته وعن حياته يتحدث العقاد على صفحات كتابه عبقرية الإمام علي فجاء الكتاب رائعاً بالشخصية التي تناولها وبكاتب سطورها. هذا في طهارة نشأته وعراقة أروقته، ونقاد سريرته، وعلو همته، وقوة إرادته، وغزارة علمه وثقافته، وروعة زهره وحكمته، وصدق إيمانه وشجاعته، وثباته على الحق ونصرته، وتضحيته في سبيله بروحه ومهجته... والآخر (الكاتب) في جمال عرضه، وصحة نقده، وقوة رده، وحلاوة لفظه، ودقة فهمه، وبراعة فكره، ونبل قصده...وقف لهؤلاء اللاغطين والمغالطين بالمرصاد، وتعقب كل لفظ لهم وغلط، فأظهر كيدهم ولحاجتهم وافتراءهم في ادعائهم: أن الإسلام قد قام على حد السيف، وأن محمداً كان يستهوي القتل، ويتعشق رؤية الدماء، وأن دين محمد قد أباح العبودية، وأجاز الرق، وأن تعدد زوجات محمد كان استجابة للذات حسه، وأن الإسلام قد تخطى الإنصاف في إباحته تعدد الزوجات وتوقيع العقوبة عند نشوز الزوجة، وجواز الطلاق... إلخ. واستطاع العقاد، في اقتدار وإبداع، أن يحيل مواطن التهم، كما أرادوها، إلى مواقف عظيمة، وعبقرية، وفخار هذا والذي ميز كتاب العقاد جمال عرض الموضوع، وصدق تعبير الكاتب ودقة تحليله وروعة استقصائه، وهي لا شك سمات من سمات تميز بها العقاد.وختم هذا الكتاب بعبقرية خالد حيث واصل العقاد مسيرته في سرد في سرد سير العباقرة والعظماء الذين كانت لهم مع البطولة في تاريخ الإسلام جولات، والذين كانت لهم مواقف حكمة وشجاعة سطرها لهم التاريخ، واعترف لهم بها القاصي والداني، الصديق والعدو، وعلى هذه الصفحات يروي عباس محمود العقاد سيرة واحد من هؤلاء الذين ذاع في الدنيا صيته، وعلا في التاريخ صوته، وطال في ميادين البطولة شوطه، واقترن اسمه بالنصر، فأشاع في نفوس الأعداء الفزع، وكان مجرد اختباره للقيادة مدعاة بين جنوده للثقة والطمأنينة، ومثاراً لقوة العزم وشدة الشكيمة... إنه سيف الله... خالد بن الوليد.وقد استعرض المؤلف سيرة هذا البطل: نشأته، شخصيته، إسلامه، والمعارك التي خاضها، مركزاً على أهم المنعطفات التي أبرزت عبقريته القيادية، وملقياً الضوء على علاقته بالنبي صلى الله عليه وسلم، ومكانته عنده، ومما يلفت النظر في هذه السيرة أسلوب العقاد الرائع الذي يتجلى في سردياته التي تمتع بالسلاسة وبالتحليل الذي ينفذ إلى عقل القارئ وروحه. والبديع في ذلك في أن المواقف التي صورها المؤرخون على أنها مآخذ على هذا البطل.. استطاع الكاتب بفكره الدقيق، وتحليله العميق، واستقصائه الوثيق، أن يجعلها مفاخرة له، لا معايب تهز قدره أو تقلل من شأنه... وفي هذا تكمن عظمة الكاتب، وتظهر قدرته، وتبرز شخصيته، وتثبت عبقريته.",
  "genres": [
    "Islam",
    "Religion",
    "Biography",
    "History",
    "Nonfiction"
  ],
  "author": "عباس محمود العقاد",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/5640388"
}