{
  "title": "A Passion for Books: A Book Lover's Treasury of Stories, Essays, Humor, Love and Lists on Collecting, Reading, Borrowing, Lending, Caring for, and Appreciating Books",
  "description": "\"When I have a little money, I buy books. And if any is left, I buy food and clothing.\" — --Desiderius Erasmus — Those who share Erasmus's love of those curious bundles of paper bound together between hard or soft covers know exactly how he felt. These are the people who can spend hours browsing through a bookstore, completely oblivious not only to the passage of time but to everything else around them, the people for whom buying books is a necessity, not a luxury. A Passion for Books is a celebration of that love, a collection of sixty classic and contemporary essays, stories, lists, poems, quotations, and cartoons on the joys of reading, appreciating, and collecting books.This enriching collection leads off with science-fiction great Ray Bradbury's Foreword, in which he remembers his penniless days pecking out Fahrenheit 451 on a rented typewriter, conjuring up a society so frightened of art that it burns its books. This struggle--financial and creative--led to his lifelong love of all books, which he hopes will cosset him in his grave, \"Shakespeare as a pillow, Pope at one elbow, Yeats at the other, and Shaw to warm my toes. Good company for far-travelling.\"Booklovers will also find here a selection of writings by a myriad of fellow sufferers from bibliomania. Among these are such contemporary authors as Philip Roth, John Updike, Umberto Eco, Robertson Davies, Nicholas Basbanes, and Anna Quindlen; earlier twentieth-century authors Christopher Morley, A. Edward Newton, Holbrook Jackson, A.S.W. Rosenbach, William Dana Orcutt, Robert Benchley, and William Targ; and classic authors such as Michel de Montaigne, Gustave Flaubert, Petrarch, and Anatole France.Here also are entertaining and humorous lists such as the \"Ten Best-Selling Books Rejected by Publishers Twenty Times or More,\" the great books included in Clifton Fadiman and John Major's New Lifetime Reading Plan, Jonathan Yardley's \"Ten Books That Shaped the American Character,\" \"Ten Memorable Books That Never Existed,\" \"Norman Mailer's Ten Favorite American Novels,\" and Anna Quindlen's \"Ten Big Thick Wonderful Books That Could Take You a Whole Summer to Read (but Aren't Beach Books).\"Rounding out the anthology are selections on bookstores, book clubs, and book care, plus book cartoons, and a specially prepared \"Bibliobibliography\" of books about books.Whether you consider yourself a bibliomaniac or just someone who likes to read, A Passion for Books will provide you with a lifetime's worth of entertaining, informative, and pleasurable reading on your favorite subject--the love of books.A Sampling of the Literary Treasures in A Passion for BooksUmberto Eco's \"How to Justify a Private Library,\" dealing with the question everyone with a sizable library is inevitably asked: \"Have you read all these books?\"Anatole Broyard's \"Lending Books,\" in which he notes, \"I feel about lending a book the way most fathers feel about their daughters living with a man out of wedlock.\"Gustave Flaubert's Bibliomania, the classic tale of a book collector so obsessed with owning a book that he is willing to kill to possess it.A selection from Nicholas Basbanes's A Gentle Madness, on the innovative arrangements Samuel Pepys made to guarantee that his library would survive \"intact\" after his demise.Robert Benchley's \"Why Does Nobody Collect Me\"--in which he wonders why first editions of books by his friend Ernest Hemingway are valuable while his are not, deadpanning \"I am older than Hemingway and have written more books than he has.\"George Hamlin Fitch's extraordinarily touching \"Comfort Found in Good Old Books,\" on the solace he found in books after the death of his son.A selection from Anna Quindlen's How Reading Changed My Life, in which she shares her optimistic view on the role of reading and the future of books in the computer age.Robertson Davies's \"Book Collecting,\" on the difference between those who collect rare books because they're valuable and those who collect them because they love books, ultimately making it clear which is \"the collector who really matters.\"",
  "genres": [
    "Books About Books",
    "Nonfiction",
    "Essays",
    "Writing",
    "Reference",
    "Short Stories",
    "History"
  ],
  "author": "Harold Rabinowitz",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/56412.A_Passion_for_Books"
}