{
  "title": "When Your Aging Parent Needs Help: A Geriatrician's Step-by-Step Guide to Memory Loss, Resistance, Safety Worries, & More",
  "description": "It’s scary and stressful when it happens…. noticing changes in your parent and becoming increasingly worried about their health and safety. Maybe it’s Mom leaving the stove on, Dad getting lost on his way home, or unpaid bills that trigger this realization. Or perhaps there have been falls or emergency room visits. Whatever it is, you know something’s wrong. You wonder about a diagnosis. And you want your aging parent to accept help, or perhaps move.Helping an older parent can be gratifying. But it’s especially hard if they’re blowing off your concerns, refusing to make changes, or otherwise resisting your efforts. You want them to listen, but they get upset or withdraw when you try to talk about this. What to do?You don’t have to remain stuck in conflict with your parent (or other family members). You don’t have to keep getting the runaround from doctors or feel stumped about next steps. Instead, use an expert’s clear plan on how to help your aging parent.In this practical, step-by-step guide, geriatrician Leslie Kernisan, MD, walks you through what to do and what to say in order to offer respectful assistance and intervention to a declining elderly parent.Full of actionable advice and insider tips, When Your Aging Parent Needs Help provides practical and flexible steps that move concerned families toward effective elder care action, while respecting a parent’s dignity and autonomy.You’ll to communicate with your aging parent to reduce conflicts and enhance cooperationThe A-B-C-D-E assessment framework for Alzheimer or other dementia concerns, safety issues, or independent living – and steps to implement changeStrategies to overcome parental resistance, health provider reluctance to share information, and family disagreementHow to get a medical evaluation for memory loss and, if applicable, a diagnosis for Alzheimer’s or another dementiaWhat to know about possible mental “incompetence,” powers of attorney, HIPAA, and other options for gaining legal authority as a caregiverHow to find geriatric care managers and other eldercare professionals to assistDownloadable worksheets, symptom checkers, and checklists to bring to doctor visits “What this looks like” family stories that show you what these action steps look like in real-world situationsTransform good intentions into workable solutions and improved relationships. If you’re concerned about an aging parent’s health, wellbeing, or safety, you’ll find encouragement and direction for this next life stage in When Your Aging Parent Needs Help.",
  "genres": [
    "Personal Development",
    "Health",
    "Nonfiction"
  ],
  "author": "Leslie  Kernisan MD",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/56429826-when-your-aging-parent-needs-help"
}