{
  "title": "Condemned to Love",
  "description": "Her teen crush is now a ruthless killer and powerful mafia heir. Will one life-altering night unite or destroy them? Bennett Mazzone grew up ignorant of the truth: he is the illegitimate son of the most powerful mafia boss in New York. Until it suited his father to drag him into a world where power, wealth, violence, and cruelty are the only currency.Celebrating her twenty-first birthday in Sin City should be fun for Sierra Lawson, but events take a deadly turn when she ends up in a private club, surrounded by dangerous men who always get what they want.And they want her.Ben can’t believe his ex’s little sister is all grown up, stunningly beautiful, and close to being devoured by some of the most ruthless men he has ever known. The Vegas trip is about strengthening ties, but he won’t allow his associates to ruin her perfection. Although it comes at a high price, saving Sierra is his only choice.The memory of Ben’s hands on her body is seared into Sierra’s flesh for eternity. She doesn’t regret that night. Not even when she discovers the guy she was crushing on as a teenager is a cold, calculating killer with dark impulses and lethal enemies who want him dead.Understanding the risks, she walks away from the only man she will ever love, stowing her secrets securely in her heart. Until the truth becomes leverage and Sierra is drawn into a bloody war—a pawn in a vicious game she doesn’t want to play.As the web of deceit is finally revealed, Ben will stop at nothing to protect Sierra. Even if loving her makes him weak. In a world where women serve a sole purpose, and alliances mean the difference between life and death, can he fight for love and win?A STAND-ALONE DARK MAFIA ROMANCE.",
  "genres": [
    "Romance",
    "Mafia Romance",
    "Dark Romance",
    "Dark",
    "Second Chance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Siobhan     Davis",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/56450083-condemned-to-love"
}