{
  "title": "Now, Discover Your Strengths: The revolutionary Gallup program that shows you how to develop your unique talents and strengths",
  "description": "The 20th anniversary edition of Now, Discover Your Strengths comes with an access code to the Clifton StrengthsFinder 2.0 assessment. This updated assessment includes reports and resources that go far beyond the standardized reports of the older assessment by providing you with personalized insight statements unique to your specific combination of strengths.Many people have little sense of their talents and strengths, much less the ability to build their lives around them. Instead, they are raised and taught to become experts in their weaknesses — and spend their lives trying to fix them — while their strengths lie dormant.Led by Don Clifton, the Father of Strengths-Based Psychology, Gallup created a revolutionary program to help people identify their talents; develop them into strengths; and enjoy consistent, near-perfect performance. Twenty years ago, Gallup released Now, Discover Your Strengths to bring this program to the world.At the heart of this book is CliftonStrengths, the assessment that is the product of decades of research and hundreds of thousands of interviews to identify the most prevalent human strengths. CliftonStrengths reveals 34 dominant talent themes that you can translate into personal and career success. To develop this assessment, Gallup conducted psychological profiles with more than 2 million individuals to help people around the world focus and perfect these themes. Since Now, Discover Your Strengths was first released two decades ago, more than 20 million people worldwide have taken the CliftonStrengths assessment.The 20th anniversary edition includes a unique access code to take CliftonStrengths — previously known as StrengthsFinder 2.0 — which is a significantly more robust program than the assessment that appeared in the original edition of the book. This web-based assessment analyzes your instinctive reactions and immediately presents you with your top five themes.Once you know which of the 34 themes you lead with — such as Achiever, Activator, Empathy, Futuristic and Strategic — the book will show you how to use your top themes for your own development, for your success as a manager and for the success of your organization.With accessible and profound insights into how to turn talents into strengths, and with immediate online feedback from the CliftonStrengths assessment at its core, Now, Discover Your Strengths is one of the most groundbreaking and powerful business books ever written.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Leadership",
    "Personal Development",
    "Psychology",
    "Management"
  ],
  "author": "Gallup",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/56452.Now_Discover_Your_Strengths"
}