{
  "title": "After the Fall: Being American in the World We've Made",
  "description": "Why is democracy so threatened in America and around the world? And what can we do about it? A former White House aide and close confidante to President Barack Obama -- and New York Times bestselling author of The World as It Is -- travels the globe in a deeply personal, beautifully observed quest for answers. In 2017, as Ben Rhodes was helping Barack Obama begin his next chapter, the legacy they worked to build for eight years was being taken apart. To understand what was happening in America, Rhodes decided to look outward. Over the next three years, he traveled to dozens of countries, meeting with politicians, activists, and dissidents confronting the same nationalism and authoritarianism that was tearing America apart. Along the way, a Russian opposition leader he spends time with is poisoned, the Hong Kong protesters he comes to know see their movement snuffed out, and America itself reaches the precipice of losing democracy before giving itself a second chance.  Equal parts memoir and reporting, After the Fall is a hugely ambitious and essential work of discovery. Throughout, Rhodes comes to realize how much America’s fingerprints are on a world we helped to shape: through the excesses of our post-Cold War embrace of unbridled capitalism, post-9/11 nationalism and militarism, mania for technology and social media, and the racism that shaped the backlash to the Obama presidency. At the same time, he learns from a diverse set of characters - from Obama to rebels to a rising generation of leaders - how looking squarely at where America has gone wrong only makes it more essential to fight for what America is supposed to be at home - for our own country, and the entire world.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "Memoir",
    "American History",
    "Political Science"
  ],
  "author": "Ben  Rhodes",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/56466928-after-the-fall"
}