{
  "title": "Evil in All Its Disguises",
  "description": "Anthony Award-winner Hilary Davidson weaves a thrilling story of paranoia, vengeance, and murder. When travel writer Lily Moore joins a group of journalists for an all-expenses-paid press junket to Acapulco, she expects sun, sand, and margaritas. Instead, she finds that the Mexican city, once the playground of Hollywood stars, is a place of faded glamour and rising crime. Even the luxurious Hotel Cerón, isolated from the rest of the town, seems disturbing to her, with its grand, empty rooms, ever-watchful staff, and armed guards patrolling the grounds.Lily isn’t the only one who suspects something rotten under the hotel’s opulent facade. Skye McDermott, another journalist on the trip, asks Lily for help with an article she’s working on about fraud and corruption in the hotel industry. Skye claims she’s eager to write a piece of real journalism rather than the fluff she’s known for. But she also lets slip that she’s deeply upset at a lover who jilted her, and she plans to exact her revenge by exposing his company’s illegal activities.After Skye disappears suddenly, Lily suspects her friend is in grave danger. But the hotel’s staff insists that everything is fine and refuses to contact the police. Only after Lily tries—and fails—to leave the Hotel Cerón does she discover the the journalists are prisoners in a gilded cage.Too late, Lily realizes that she has been maneuvered into the role of bait in a vicious, vengeful plot. Faced with unthinkable choices, Lily must summon all her strength to survive, confront the past she’s still running from, and save other lives. “Davidson has a great eye for the small detail that leads the reader into the spot and her puzzle plots are beautifully organized and crafted... This third book featuring travel journalist Lily Moore is the best of the set.” — The Globe & Mail“Davidson's book pulses with psychological suspense.” — Milwaukee Journal Sentinel“Hilary Davidson delivers the goods — an exotic, atmospheric setting, a rocket-paced plot, and a bright, engaging heroine in Lily Moore. Evil in All Its Disguises is a top-notch mystery — exciting, harrowing, and smart.” — Lisa Unger, New York Times bestselling author",
  "genres": [
    "Mystery",
    "Fiction",
    "Audiobook",
    "Mystery Thriller",
    "Crime",
    "Thriller"
  ],
  "author": "Hilary Davidson",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/56463928-evil-in-all-its-disguises"
}