{
  "title": "WOLF WHISPERER SERIES  Vol 1 & 2",
  "description": "#1 THE CRY OF THE WOLF By: Angeline GallantWhen Adelaide and her children are suddenly transported back in time while her husband is at work, they discover that they have gone back to the 1600s Canada - a time of great peril. Captured by the Wyandotte tribe, Adelaide realizes that she must quickly adapt to her new situation and the culture, and when it becomes apparent that their trip was a one-way journey she is forced to settle into life as the new wife of Chief Long Knife, who lost his first wife in an Iroquois raid. With dangers everywhere, including deadly cholera, the arrival of European settlers and the ever-present threat from enemy tribes, Adelaide soon finds that life in these beautiful surroundings is anything but idyllic and as she slowly begins to accept what has happened to her, she comes to realize that Long Knife is a much better man than her husband she left behind. With the introduction of Christianity to the tribe, it brings a new danger to the Wyandotte people and their way of life. Will they convert to the strange new religion or maintain their own traditions? And if they do convert, can the fractured tribe possibly survive? Based on a true story, this book is a story of love and redemption.#2 JOURNEY OF THE HEARTGeorge and Gretjen face their own heartache as they journey to the New World to begin a better life, escaping haunting memories. The untamed wilderness offers less than a warm welcome, however, George cares for the natives and is determined to join them as one of their own. The tribe's dying chief makes a decision that will affect generations. Jaira faces memories she would rather forget as her world is turned upside down and she comes face to face with a tribe known for their brutality. This time, however, there is no one to save her.",
  "genres": [],
  "author": "Angeline Gallant",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/56449746-wolf-whisperer-series-vol-1-2"
}