{
  "title": "A Righteous Man",
  "description": "Salinger Dolan. You know his name. You've seen his face. You've spent money on the endless amount of useless crap he endorses. Of course, you've heard the stories. You know the ones… The one that claimed he was hard to work with and totally unprofessional on set. The one where he got caught doing drugs on the set of the most popular, family-friendly show in America. The one where he ruined the reputation—and career—of America's sweetheart. There’s more truth to those stories than his fans want to believe because Salinger is the kind of thoughtless, careless, dangerous Hollywood bad boy the paparazzi and fame-hungry starlets can't get enough of. Eventually, the shine of his flashy lifestyle started to fade, and Salinger realized the only thing he's famous for nowadays is his bad behavior and well-documented struggle with addiction. The former golden boy is beyond tarnished, and the only person who can help him get his glow back is the one woman who wants absolutely nothing to do with him. Maren Copeland. You might recall her name. It's possible you vaguely remember her face. You're probably wondering where she went. After all, you've heard the stories… The one where she exposed Salinger Dolan’s drug use all those years ago. The one that said she tried to ruin his career because she was envious of his popularity. The one about how she went from being everyone's favorite to a pariah overnight. Maren Copeland is now known as the comeback queen. After years of hard work and purposely avoiding entanglements with problematic heartthrobs like her first co-star, she's on track to revitalize her career and rearrange her priorities after a very messy and very public divorce. For the first time in both her professional and personal life, she’s the one calling all the shots. Unfortunately, the path to get her where she wants to be leads directly to none other than Salinger Dolan. He’s the one and the only person she swore she would never work with again. Once upon a time, he cost her everything. He’s back to make amends and promised to give her anything she wants if she’ll just give him a chance to prove he’s grown up. She doesn't trust him. She knows she’d be a fool to believe he’s changed. After all, what are the odds that a spoiled, entitled brat like Salinger Dolan could become a righteous man?",
  "genres": [
    "Romance",
    "Audiobook",
    "Enemies To Lovers",
    "Contemporary",
    "Second Chance",
    "New Adult",
    "Contemporary Romance"
  ],
  "author": "Jay Crownover",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/56441208-a-righteous-man"
}