{
  "title": "Sailor Proof",
  "description": "The sexy Navy chief and his best friend’s adorkable little brother…It’s petty, but Naval Chief Derrick Fox wishes he could exact a little revenge on his ex by showing off a rebound fling. His submarine is due to return to its Bremerton, Washington, home base soon and Derrick knows all too well there won't be anyone waiting with a big, showy welcome.Enter one ill-advised plan…Arthur Euler is the guy you go to in a pinch—he's excellent at out-of-the-box solutions. It's what the genius music-slash-computer nerd is known for. So when he finds out Derrick needs a favor, he’s happy to help. He can muster the sort of welcome a Naval Chief deserves, no problem at all.Except it is a problem. A very big problem.When Arthur’s homecoming welcome is a little too convincing, when a video of their gangplank smooch goes enormously viral, they're caught between a dock and a hard place. Neither of them ever expected a temporary fake relationship to look—or feel—so real. And Arthur certainly never considered he'd be fighting for a very much not-fake forever with a military man.Also from Annabeth Albert:Out of UniformBook 1: Off BaseBook 2: At AttentionBook 3: On PointBook 4: Wheels UpBook 5: Squared AwayBook 6: Tight QuartersBook 7: Rough TerrainHotshotsBook 1: Burn ZoneBook 2: High HeatBook 3: Feel the FireBook 4: Up in SmokeCarina Adores is home to highly romantic contemporary love stories where LGBTQ+ characters find their happily-ever-afters.A new Carina Adores title is available each month:The Hideaway Inn by Philip William StoverThe Girl Next Door by Chelsea M. CameronJust Like That by Cole McCadeHairpin Curves by Elia WintersBetter Than People by Roan ParrishThe Love Study by Kris RipperThe Secret Ingredient by KD FisherJust Like This by Cole McCadeTeddy Spenser Isn’t Looking for Love by Kim FieldingThe Beautiful Things Shoppe by Philip William StoverBest Laid Plans by Roan ParrishKnit, Purl, a Baby and a Girl by Hettie BellThe Hate Project by Kris RipperHard Sell by Hudson LinFor the Love of April French by Penny AimesSailor Proof by Annabeth AlbertMeet Me in Madrid by Verity LowellThe Life Revamp by Kris Ripper",
  "genres": [
    "Romance",
    "M M Romance",
    "Contemporary",
    "Military Fiction",
    "Audiobook",
    "LGBT",
    "Queer"
  ],
  "author": "Annabeth Albert",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/56472984-sailor-proof"
}