{
  "title": "Rise of the Witch",
  "description": "Please note: This is an RH, with multiple POV, unusual spicy smex, and a focus on romance (including MM) and body positivity. If any of those things don't work for you, please don't read it!BLURB:As with most beginnings, it started with death.When I had nothing left to lose, I traveled to the hut in the woods; the one no one dared approach. The witch who lived there recognized the darkness in my soul and took me under her wing—to witness her reign of terror firsthand and eventually, to inherit her legacy as my own.Now I’m the monster they fear; the one humans avoid at all costs. In this welcome isolation, I've attempted to forget my past and the future that was taken from me.Until three men appear, somehow able to break through my protective wards and see me in my true form. While resistant to their intrusion, I recognize they may be the ones I’ve been waiting for—the ones I need to ascend to my full power.Too bad I would rather grind their bones than invite them in.But something is mysteriously devouring the forest, and I suspect the threat may be the same one I barely escaped many moons ago. If it is, he will find me a more worthy opponent than the last time we met.I am the Yaga and I may be broken, but my edges are sharp.--The Yaga’s Riders is based on the folklore of Baba Yaga, with creative liberties taken.The Rise of the Witch is the first book in a steamy, paranormal romance trilogy featuring alphaholes, mysterious forces in magical woods, and a slightly frightening heroine who never has to choose just one man.MMFMMultiple POVThis series is meant for readers 18 and over.Beware: Cliffys ahead!Possible triggers:Sweary dialogueGraphic sex, including kink and various edgeplayGore and violenceToxic masculinity (don't worry - it doesn't last forever! #characterarc)Reference to past sexual assault and pregnancy lossGeneral weirdness and medium-dark elements",
  "genres": [
    "Reverse Harem",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Witches",
    "Paranormal Romance",
    "M M Romance"
  ],
  "author": "C. Rochelle",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/56481094-rise-of-the-witch"
}