{
  "title": "Maybe I Don't Belong Here: A Memoir of Race, Identity, Breakdown and Recovery",
  "description": "ONE OF THE OBSERVER'S BEST MEMOIRS OF 2021 AND THE TIMES' BEST FILM AND THEATRE BOOKS OF THE YEAR.'As a Black British man I believe it is vital that I tell this story. It may be just one account from the perspective of a person of colour who has experienced this system, but it may be enough to potentially change an opinion or, more importantly, stop someone else from spinning completely out of control.' – David HarewoodIs it possible to be Black and British and feel welcome and whole?Maybe I Don't Belong Here is a deeply personal exploration of the duality of growing up both Black and British, recovery from crisis and a rallying cry to examine the systems and biases that continue to shape our society.In this powerful and provocative account of a life lived after psychosis, critically acclaimed actor, David Harewood, uncovers devastating family history and investigates the very real impact of racism on Black mental health.When David Harewood was twenty-three, his acting career beginning to take flight, he had what he now understands to be a psychotic breakdown and was sectioned under the Mental Health Act. He was physically restrained by six police officers, sedated, then hospitalized and transferred to a locked ward. Only now, thirty years later, has he been able to process what he went through.What was it that caused this breakdown and how did David recover to become a successful and critically acclaimed actor? How did his experiences growing up Black and British contribute to a rupture in his sense of his place in the world?'Such a powerful and necessary read . . . Don't wait until Black History Month to pick up this book, it's a must-read just now.' - Candice Brathwaite, author of I Am Not Your Baby Mother'David Harewood writes with rare honesty and fearless self-analysis about his experiences of racism and what ultimately led to his descent into psychosis . . . This book is, in itself, a physical manifestation of that hopeful journey.' - David Olusoga, author of Black and British",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Mental Health",
    "Audiobook",
    "Autobiography",
    "Biography",
    "Race"
  ],
  "author": "David  Harewood",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/56530526-maybe-i-don-t-belong-here"
}