{
  "title": "The Weight of a Moment",
  "description": "Winner for Literary Fiction at the American Fiction Awards 2020. On list of “10 Best Indie Books of 2019” at Shelf Unbound Magazine. Finalist for Best Novel at the Next Generation Book Awards 2020, (often referred to as the \"Sundance of Books\" in the media). Winner of a Bronze Medal at the Readers' Favorite Awards 2020.\"Emotionally rich, psychologically exciting, and inspiring\" - Readers' Favorite”The Weight of a Moment is the best book I have read in a long time.” – Linda Carson, Host, Suncoast View, ABC 7, Sarasota FL\"Profound...replete with startling twists and turns\" - Seattle Book Review “One of the most compelling and thought-provoking pieces of literature I’ve read in quite some time.” - Blogger, booksinmylibraryblog .wordpress .comAnd, Goodreads reviewers praised it also, calling it “profound,” “beautifully written,” \"relevant,\" \"powerful,\" and “one of the best books I’ve read this year.” Critically acclaimed, this second novel from the author of Skyscraper of a Man is a brilliant sophomore effort.The Weight of a Moment is a beautiful story about the fragility of life and the redemptive power of friendship. Nick Sterling, a Fenwick Prize winning journalist, can't move beyond a tragedy caused by one of his articles. Tom Corbett, a successful antiques dealer, is humiliated and shamed by an internet video that damages his business, marriage, and family. After their blunders, one shameful and one fatal, the two men run from their pasts, meet in a small Pennsylvania town, and, despite—or because of—the most unusual circumstances, help each other find redemption. Together, they make an unusual discovery that changes everything, one that unwittingly puts them back onto the national stage. Joined by fate, each man's journey is remarkable in its own right and only exceeded by their shared journey. In a profound final scene, Nick confronts his tragic mistake, asks for forgiveness, and the novel's title, The Weight of a Moment, is fully realized. Contrasting elements: big cities and small towns, modern and historic, priceless and valuable, compassion and condemnation, add to the richness of the tale. Critically acclaimed, this second novel from the author of Skyscraper of a Man is a brilliant sophomore effort.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Book Club",
    "Literary Fiction",
    "Journalism",
    "Novels"
  ],
  "author": "Michael  Bowe",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/56524447-the-weight-of-a-moment"
}