{
  "title": "Beasts of Prey",
  "description": "Magic doesn't exist in the broken city of Lkossa anymore, especially for girls like sixteen-year-old Koffi. Indentured to the notorious Night Zoo, she cares for its fearsome and magical creatures to pay off her family's debts and secure their eventual freedom. But the night her loved ones' own safety is threatened by the Zoo's cruel master, Koffi unleashes a power she doesn't fully understand--and the consequences are dire.As the second son of a decorated hero, Ekon is all but destined to become a Son of the Six--an elite warrior--and uphold a family legacy. But on the night of his final rite of passage, a fire upends his plans. In its midst, Ekon not only encounters the Shetani--a vicious monster that has plagued the city and his nightmares for nearly a century--but a curious girl who seems to have the power to ward off the beast. Koffi's power ultimately saves Ekon's life, but his choice to let her flee dooms his hopes of becoming a warrior.Desperate to redeem himself, Ekon vows to hunt the Shetani down and end its reign of terror, but he can't do it alone. Meanwhile, Koffi believes finding the Shetani and selling it for a profit could be the key to solving her own problems. Koffi and Ekon--each keeping their true motives secret from the other--form a tentative alliance and enter into the unknowns of the Greater Jungle, a world steeped in wild magic and untold dangers. The hunt begins. But it quickly becomes unclear whether they are the hunters or the hunted.In this much-anticipated series opener, fate binds two Black teenagers together as they strike a dangerous alliance to hunt down the ancient creature menacing their home--and discover much more than they bargained for.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Young Adult Fantasy",
    "Mythology",
    "Romance",
    "Magic"
  ],
  "author": "Ayana Gray",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/56552953-beasts-of-prey"
}