{
  "title": "Het lijk in het schandblok",
  "description": "The moonlight shone on the quiet village green when an English bobbie returning from night patrol finds on a man's two motionless feet stuck through the holes of a pair of stocks. He identifies the corpse in evening dress immediately. Wealthy Andrew Vereker was not a well-loved man, and when he was found stabbed, no one seemed to be particularly disturbed. The resourceful Inspector Hannasyde found nothing unusual in the murder -- until he met the Vereker heirs. The Vereker family are corrupt and eccentric -and hardly cooperative... Every member of his eccentric family had a motive -- money. Was it his half-sister Antonia, whose marriage he had forbidden, or Rudolph, her embezzling lover? Could it have been Arnold's half-brother Kenneth, heir apparent, or perhaps it was the delectable beauty, Violet Williams? And then there was Roger, his \"dead\" brother, who appeared right after the murder? Narrowing down the suspects is not going to be an easy job. The problem the inspector had to face was whether these four were the charming, intelligent, though perfectly infuriating people they seemed to be, or whether they were more cunning than any murder suspects he had ever encountered. They seemed to enjoy being suspects, which they logically were, and in proving to him how easy both in deed and in fact it would have been for any one of them to have killed Vereker. They delighted in tying nooses around each other's necks, in laying false trails, in annoying the police, and, a side issue, in driving the inspector frantic. Were they pulling his leg, or were they deliberately tricking him? The question is: who in this family is clever enough to get away with murder?One cousin allies himself with the inspector, while the victim's half-brother and sister, each of whom suspects the other, markedly try to set him off the scent. Hannasyde's consummate powers of detection and solicitor Giles Carrington's amateur sleuthing are tested to their limits. With the second murder the inspector gave up in despair, admitting that the family was too much for him. It must be someone, attractive Inspector Hannasyde kept telling himself in one of his most puzzling cases ever. The solution to the baffling though perfectly plausible crimes comes through other channels and as a distinct surprise.",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Crime",
    "Historical",
    "Romance",
    "Mystery Thriller"
  ],
  "author": "Georgette Heyer",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/12716460-het-lijk-in-het-schandblok"
}