{
  "title": "Holiday Hearts Volume 4",
  "description": "A heartwarming story is the hallmark of a romantic holiday season. Savor the magic in Holiday Hearts Volume 4 with three sweet and inspirational holiday contemporary romances.Cozy up and lose yourself in this wonderful season of love.A Christmas Puppy To Cherish (Inspirational)You don’t need ears to hear God’s plan. All you need is an open heart…Music of both birds and harmonicas fills Max’s life, but it’s the near-silent forest guide he meets in Cherish, SC, who captures his attention. Small and slim, pretty Sarah’s smiles and graceful hands speak louder than her voice. In fact, she’s so quiet, he's not sure he’s made much of an impression. But with her, he can imagine making this temporary stopover into something permanent.Sarah has found a comfortable niche in Cherish, working miracles with plants, arranging flowers for church, and taking in stray animals. In fact, her house is so full, she’s not sure she can say yes to the Sheriff’s plea to take in one more puppy for Christmas.Max has definitely captured her interest, and he shares her love of nature. But maybe she should take in that puppy after all, because a ball of fur that needs her will fill the empty space in her heart when Max's research sends him off looking for bluer skies.A Chocolate-Box Christmas WishHe’s been all over the world. She’s a home-town girl. Can a holiday wish bridge the gap?In Cora Carpenter’s small California hometown, Christmas is tailor-made for couples.Unfortunately, Cora is a party of one, thanks to a con man who stole her heart, then bilked her out of thousands of dollars.What’s on her Christmas wish list this year? Nothing whimsical. She’ll take a new vacuum cleaner, thanks—and no dating for the foreseeable future. But when she meets a stranger with a broken-down car, his warm smile and perilously blue eyes almost make her want to tweak that list. If only she could get over the pain and humiliation of her past.A double whammy of betrayal and a broken heart sent anchorman Patrick Gervez thousands of miles west looking for a fresh start. But the pretty child care provider’s unforgettable amber eyes and deft hand with a set of jumper cables does funny things to his heart—and makes him wonder if she’s a forgotten dream come true.Except she’s as skittish as a piece of tinsel in a windstorm. And the only way to help her forget her heartbreak, is to convince her to forgive. Especially herself.A Chocolate-Box Irish WeddingA woman who wanted more. A man who wanted her. Can they rediscover their love in the seaside town where it all began?Colum O’ Brien, a professional ballet dancer, is still hurt from a break-up four decades earlier. All this time, his heart has gravitated toward the woman who left him behind.Sure, he’s moved on with his life, but he’s never forgotten his childhood sweetheart, Keira Murphy.That is, until he meets her again. Because his father is marrying her mother.Keira was a famous runway model who moved away from her seaside Irish town with dreams of becoming a superstar. She left everything behind, including Colum.With her skills as a seamstress, she’s now determined to return and open her own shop. Only she never expected to see Colum again—or to be instantly connected to him, just like when they were next-door neighbors and childhood sweethearts.",
  "genres": [],
  "author": "Josie Riviera",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/56543794-holiday-hearts-volume-4"
}