{
  "title": "The Anglo Saxon Chronicle",
  "description": "The Anglo-Saxon Chronicle is a historical text that covers the history of England from the Roman occupation to the Norman Conquest. It is a collection of annals that were written by various authors over the course of several centuries, with the earliest entries dating back to the 9th century. The chronicle provides an invaluable insight into the political, social, and cultural changes that took place in England during this period. It covers major events such as the Viking invasions, the reigns of famous kings like Alfred the Great and Edward the Confessor, and the Battle of Hastings. The text is written in Old English and is considered to be a masterpiece of medieval literature. The author is unknown, but it is believed that the chronicle was compiled by a group of monks in a monastery in Winchester. The Anglo-Saxon Chronicle is an important historical document and is still studied and referenced by scholars today.The first inhabitants were the Britons, who came from Armenia, and first peopled Britain southward. Then happened it, that the Picts came south from Scythia, with long ships, not many; and, landing first in the northern part of Ireland, they told the Scots that they must dwell there. But they would not give them leave; for the Scots told them that they could not all dwell there together.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Classics",
    "Anglo Saxon",
    "Medieval History",
    "British Literature"
  ],
  "author": "Benjamin Thorpe",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/565578.The_Anglo_Saxon_Chronicle"
}