{
  "title": "Black Girls Must Die Exhausted",
  "description": "The first novel in a captivating three-book series about modern womanhood introduces a young Black woman who must rely on courage, laughter, love—and the unwavering support of her two longtime friends—to overcome an unexpected setback that threatens the most precious thing she has ever wanted.Tabitha Walker is a Black woman with a plan to “have it all.” At 33 years old, her checklist for the life of her dreams is well underway: Education? Check. Good job? Check. Down payment for a nice house? Check. Dating marriage material? Check, check, and check. With a coveted position as a local news reporter, a “paper-perfect” boyfriend, and even a standing Saturday morning appointment with a reliable hairstylist, everything seems to be falling into place.Then, Tabby receives an unexpected diagnosis—one that brings her picture-perfect life crashing down, jeopardizing the keystone of her dream: having children. With her future at risk of slipping through the cracks of her meticulous checklist, she faces an impossible choice between her career, her dream home, and a family of her own.Fortunately, Tabby isn’t alone. She leans on her best friends—Laila, irreverent and headstrong, and Alexis, the mom-jeans-wearing former “Sexy Lexi”—along with the generational wisdom of her grandmother and the fiery, nonagenarian Ms. Gretchen. Together, they guide her through the reaches of modern medicine, the complexities of relationships, and the emotional rollercoaster of reevaluating what matters most.But the fight for her dreams is all-consuming, demanding a steep price that forces an honest reckoning for nearly everyone in her life. Along the way, Tabby learns a hard but enduring truth through her grandmother’s age-old adage: Black girls must die exhausted.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Adult",
    "Literary Fiction",
    "Book Club",
    "Race"
  ],
  "author": "Jayne Allen",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/56554306-black-girls-must-die-exhausted"
}