{
  "title": "Pillars: How Muslim Friends Led Me Closer to Jesus",
  "description": "Gold Medal, 2022 Independent Publisher Book Awards, IPPYPersonal friendships with Somali Muslims overcome the prejudices and expand the faith of a typical American Evangelical Christian living in the Horn of Africa.When Rachel Pieh Jones moved from Minnesota to rural Somalia with her husband and twin toddlers eighteen years ago, she was secure in a faith that defined who was right and who was wrong, who was saved and who needed saving. She had been taught that Islam was evil, full of lies and darkness, and that the world would be better without it.Luckily, locals show compassion for this blundering outsider who can’t keep her headscarf on or her toddlers from tripping over AK-47s. After the murder of several foreigners forces them to evacuate, the Joneses resettle in nearby Djibouti.Jones recounts, often entertainingly, the personal encounters and growing friendships that gradually dismantle her unspoken fears and prejudices and deepen her appreciation for Islam. Unexpectedly, along the way she also gains a far richer understanding of her own Christian faith. Grouping her stories around the five pillars of Islam – creed, prayer, fasting, giving, and pilgrimage – Jones shows how her Muslim friends’ devotion to these pillars leads her to rediscover ancient Christian practices her own religious tradition has lost or neglected.Jones brings the reader along as she reexamines her assumptions about faith and God through the lens of Islam and Somali culture. Are God and Allah the same? What happens when one’s ideas about God and the Bible crumble and the only people around are Muslims? What happens is that she discovers that Jesus is more generous, daring, and loving than she ever imagined.",
  "genres": [
    "Nonfiction",
    "Religion",
    "Faith",
    "Memoir",
    "Africa",
    "Islam",
    "Christian"
  ],
  "author": "Rachel Pieh Jones",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/56560315-pillars"
}