{
  "title": "#drug 140",
  "description": "In a parallel universe the government of the United States of America is using stimulants, hallucinogens, and analgesic drugs to control the masses. The government wants to prevent the people from realizing the terrible conditions that those in power have forced us to endure. The government wants people to ignore the racism, inequality, sexism, and their strategy of divide and conquer. The government wants its citizens to be dumb so that it can control everyone. President Dick Kush wins the 2016 Presidential Election with the promise to, “Make America Drug Free Again.” President Dick Kush promises to send some paramilitary troops to México to fight the drug war that was started by President Pulque in México during 2006. President Dick Kush is able to pass the Twenty-eighth Amendment to the United States of America Constitution to ban all drugs that are stimulants, hallucinogens, and analgesics. With the help of his political party the Government of the Racist (G. O. P.) who now hold a majority in the United States of America Congress and in each of the state’s legislatures he is victorious. Soon President Dick Kush will live to regret this idea when people are free of the mind control that the drugs places them in.A cast of characters must now deal with the results of the 2016 Presidential Election and President Dick Kush’s rise to the seat of power. Demetria finds out a secret that makes her wonder what other secrets her family hides. El Destrampado is now ordered by his boss to take care of a little problem in a hotel room. Gianluca finds out about the corruption that plagues his federal police department and wants to do something to clean it up. Franco is on his way to Samuel’s birthday party to give him a special present in order to get the approval of the boss. Gansito just spotted a traitor to the Pearl of the Pacific Cartel and goes after the man that the boss nicknamed Francisco Madero. Chabela is celebrating her first communion when her uncle Franco shows up with a surprise gift. Kyng works at a Mexican restaurant but he really enjoys smoking marihuana when he is not at work. Caylee is a drug dealer who is trying to make a lot of money quickly to buy a house and move out of her apartment. Fortuna is worried about paying a loan that her husband owes to the Pearl of the Pacific Cartel.",
  "genres": [],
  "author": "id oro",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/56609237-drug-140"
}