{
  "title": "Cross the Stars",
  "description": "*This is not a stand-alone novel. This is the first book in the New Adult duet, Crossing Stars.**Steal the Moon (Crossing Stars Duet, Book2), the final book in the Crossing Stars Duet, will release May 2021* ~What would you risk for love? Would you cross the stars? Steal the moon?Ella’s an American in a foreign land. Raj is Jordanian royalty. Fate has brought them together and their diverse worlds are about to collide.~A year shy of graduating from Georgetown University, Ella Wallace feels like she's losing direction. Having carved her own path through life, rejecting her family’s elitist influences, the last thing she wants is to waste time and prove her parents right. A happenstance summer-long program abroad offers the perfect opportunity to immerse herself in volunteer work, finding richness in family and purpose she has never experienced before.Prince Rajaa bin Ammaar is returning home to Jordan from Georgetown University. His intent is to spearhead a refugee program meant to bring peace to his country. Amidst threats of civil war and revolt, Raj stands for his convictions, even when they challenge his family and the very culture he is preordained to uphold. A chance encounter at a crowded party in D.C. brought Ella and Raj together for one fleeting moment –never expected to meet again. That is until their opposing worlds collide in Jordan. With the Syrian refugee program as their reuniting bond, they must cross the stars and defy their clashing cultures to protect a forbidden love that crosses the ill-fated stars. And their fight for their love could become deadly. Prepare yourself for a journey both geographically and culturally into the turbulent Middle East where Ella and Raj’s clashing fates bring forth a storm of forbidden love, hatred, deceit, scandal, war, suspense, and the timeless battle to defy what is written in the stars.Reminiscent of the timeless Shakespearean tale of Romeo and Juliet, Raj and Ella's star-crossed passionate fight for the deep love they share will have you reading each twist and turn in this duet with bated breath. **This book is intended for readers 18 and older due to explicit content.**",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Fiction",
    "Contemporary"
  ],
  "author": "Venessa Kimball",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/56608792-cross-the-stars"
}