{
  "title": "The Lunar Housewife",
  "description": "A stylish and suspenseful historical page-turner following an up-and-coming journalist who stumbles onto a web of secrets, deceptions, and mysteries at a popular new literary magazine--inspired by the true story of CIA intervention in Cold War American arts and letters.New York City, 1953: Louise Leithauser's star is on the rise. She's filed some of the best pieces at her boyfriend Joe's brand new literary magazine, Downtown (albeit under a male pseudonym), her relationship still makes her weak at the knees, and the science fiction romance she's writing on the side, \"The Lunar Housewife,\" is going swimmingly. But when she overhears Joe and his business partner fighting about listening devices and death threats, Louise can't help but investigate, and she quickly finds herself wading into dangerous waters. As Louise pieces together rumors, hunches, and clues, the picture begins to come together--Downtown's strings are being pulled by someone powerful, and that someone doesn't want artists or writers criticizing Uncle Sam. Meanwhile, opportunities are falling in Louise's lap that she'd have to be crazy to refuse, including an interview with America's most famous living author, Ernest Hemingway. Can Louise stand by and let doors keep opening for her, while the establishment sells out and censors her fellow writers? As her suspicions and paranoia mount, Louise's own novel \"The Lunar Housewife\" changes shape, colored by her newfound knowledge. And when Louise is forced to consider her future sooner than she planned, she needs to decide whether she can trust Joe for the rest of her life.  Peppered with cameos from real life luminaries such as Truman Capote and James Baldwin, and full of period detail and nail-biting tension, Caroline Woods channels 1950s New York glamour as Louise's investigation brings her face to face with shocking secrets, brutal sexism, and life or death consequences. Deeply researched and propulsive, The Lunar Housewife is a historical thriller rich with meaning for modern readers.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Thriller",
    "Mystery",
    "Historical",
    "Espionage",
    "Audiobook"
  ],
  "author": "Caroline  Woods",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/56601256-the-lunar-housewife"
}