{
  "title": "Shadow's Kiss",
  "description": "ADULT FANTASY ROMANCE . . . COMPLETED SERIESWARNING: Are you looking for a sweet romance with puppy dogs and rainbows? An innocent, young adult fairy tale with a chivalrous prince who will seek permission to kiss your cheek? Do you like a predictable story line? Do you want every character to be perfect? To make all the right choices? To have zero flaws?If so, this is not the series for you.If, however, you've got a little darkness buried deep down inside; if you prefer your romance to be adult in nature; if you enjoy the mystery and suspense of not knowing what's around the next corner; if you like darkly flawed characters who don't give a damn about being polite, charming gentlemen; if you like protagonists who develop and grow over the course of an entire story . . . then welcome to the Shadow Series.Just don't get too attached, my darling. This is a complete story broken into four full-length novels. And book one is just the tip of the iceberg. If you think you know what's happening, if you think you understand the characters and the relationships, if you think you know where this story is headed, let me tell you: you have no idea, friend.Here's to hoping you don't get lost in the Dark:~An epic adventure. Mysterious circumstances. Fun. Dark and steamy. The latest in adult fantasy romance . . . you don't want to miss this series.~A violent storm. Unending night . . . Violet Archer is running through the darkness for her very life.A single spark blazes, calling to her. It is her chance at salvation. It is a connection beyond any she could have ever imagined. And it leads her to a lonely cabin in the woods.But when Violet wakes she has no memory of how she got there. She is disturbingly ill. And a chilling evil creeps through her veins. Worse still, her host, the tall and powerful Elijah Stone, is intent on killing her. Yet a cataclysmic bond, neither can deny, stays Elijah’s hand.Radiants, immortals of the Light, have been warring with their enemies, the Shadows, for millennia. Now, twisted together by fate, the two adversaries must embark on a journey. One on which their very lives depend. Unfortunately for Violet, she does not know who she can trust, especially when it comes to her guide, Elijah.But it turns out that Violet and Elijah are not alone on their quest. They soon realize they are being hunted along the way. It seems Violet has a dark debt to settle.And someone very dark, indeed, is about to collect his due.*Adult novel. Contains mature and explicit content.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Fantasy Romance",
    "Enemies To Lovers",
    "Fae",
    "Magic"
  ],
  "author": "T.M. Hart",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/56596356-shadow-s-kiss"
}