{
  "title": "The Miracle Prince: The Power of the Pearl",
  "description": "A 2021 Wishing Shelf Awards FINALISTThree teenagers accused of stealing the world’s most valuable object.A real thief with dangerous intentions.Can they stop the thief and save the world before it’s too late?An absolute must-read for fans of Harry Potter and Percy Jackson!Thirteen-year-old Alaric Swift lives a tough, lonely life. He’s never known his parents, nor had any friends.However, everything changes after his adoptive parents attempt to eat him, and he’s taken to live on the magical island of Harramore. The reason? Alaric is the son of the most powerful being to have ever existed—the King Guardian, Rei.So begins a magical adventure as Alaric learns to master hidden extraordinary powers, meets creatures beyond his imagination, and gets caught up in a plot to steal the world’s most dangerous object, the Golden Pearl.The Power of the Pearl is a captivating opening to the Miracle Prince series and a page-turning debut.\"Edmonds mixes dark fantasy with a coming-of-age tale that is sure to excite young readers. His intelligent writing style and creative world-building make for a fantastic story...perfect for ages eleven through fourteen, great for older teens, too. The Miracle The Power of the Pearl will keep your kids delightfully entertained with reading, forgetting computers and smart screens.\" - Reedsy Discovery★★★★★ \"William Edmonds' novel, The Miracle The Power of the Pearl, will have Harry Potter fans and those who love C.S. Lewis’ adventures in Narnia enraptured from beginning to end. The author has developed a compelling plot that grips the reader from the very start.\" - Readers' Favorite‘A compelling fantasy adventure 9 – 12 year olds will love. A FINALIST and highly recommended!’ – The Wishing Shelf Book Awards",
  "genres": [
    "Fantasy"
  ],
  "author": "William  Edmonds",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/56593794-the-miracle-prince"
}