{
  "title": "The Girls in the Wild Fig Tree: How I Fought to Save Myself, My Sister, and Thousands of Girls Worldwide",
  "description": "The \"incredibly powerful\" (Kirkus Reviews) story of the human rights activist who changed the minds of her elders, reformed traditions from the inside, and is creating a better future for girls and women throughout Africa.Nice Leng`ete was raised in a Maasai village in Kenya. In 1998, when Nice was six, her parents fell sick and died, and Nice and her sister Soila were taken in by their father’s brother, who had little interest in the girls beyond what their dowries might fetch. Fearing “the cut” (female genital mutilation, a painful and sometimes deadly ritualistic surgery), which was the fate of all Maasai women, Nice and Soila climbed a tree to hide.Nice hoped to find a way to avoid the cut forever, but Soila understood it would be impossible. But maybe if one of the sisters submitted, the other would be spared. After Soila chose to undergo the surgery, sacrificing herself to save Nice, their lives diverged. Soila married, dropped out of school, and had children–all in her teenage years–while Nice postponed receiving the cut, continued her education, and became the first in her family to attend college.Supported by Amref, Nice used visits home to set an example for what an uncut Maasai woman can achieve. Other women listened, and the elders finally saw the value of intact, educated girls as the way of the future. The village has since ended FGM entirely, and Nice continues the fight to end FGM throughout Africa, and the world.Nice’s journey from “heartbroken child and community outcast, to leader of the Maasai” is an inspiration and a reminder that one person can change the world–and every girl is worth saving.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Africa",
    "Biography",
    "Biography Memoir",
    "Feminism",
    "Audiobook"
  ],
  "author": "Nice Leng'ete",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/56620829-the-girls-in-the-wild-fig-tree"
}