{
  "title": "The Cursed Carnival and Other Calamities: New Stories about Mythic Heroes",
  "description": "Best-selling author Rick Riordan presents ten new stories--including one of his own--about beloved heroes that sprang from the imaginations of some of the best middle grade authors working today.A cave monster . . . an abandoned demon . . . a ghost who wants to erase history . . . a killer commandant . . . These are just some of the challenges confronting the young heroes in this highly entertaining anthology.All but one of the heroes previously starred in a popular book from Rick Riordan Presents. You''ll be reunited with Aru Shah, Zane Obispo, Min the fox spirit, Sal and Gabi, Tristan Strong, Nizhoni Begay, Paola Santiago, Sikander Aziz, and Riley Oh. Who is the new hero? Read Rick Riordan''s short story to find out!Ten bestselling and award-winning middle grade authors contributed to this collection: Roshani Chokshi, J.C. Cervantes, Yoon Ha Lee, Carlos Hernandez, Kwame Mbalia, Rebecca Roanhorse, Tehlor Kay Mejia, Sarwat Chadda, Graci Kim, and Rick Riordan, who also served as the editor.The cultures represented by these own-voices stories are: Indian, Mesoamerican, Korean, Cuban, Black American, African, Navajo, Mexican, Mesopotamian, and Celtic.There''s something for everyone in this collection of fast-paced and funny adventure stories that show what it takes to be a hero in any time, setting, and universe.Read more about the heroes in these best-selling books:Rick Riordan Presents: Aru Shah and the End of Time by Roshani ChokshiRick Riordan Presents: The Storm Runner by J.C. CervantesRick Riordan Presents: Dragon Pearl by Yoon Ha LeeRick Riordan Presents: Sal and Gabi Break the Universe by Carlos HernandezRick Riordan Presents: Tristan Strong Punches a Hole in the Sky by Kwame MbaliaRick Riordan Presents: Race to the Sun by Rebecca RoanhorseRick Riordan Presents: Paola Santiago and the River of Tears by Tehlor Kay MejiaRick Riordan Presents: City of the Plague God by Sarwat ChaddaRick Riordan Presents: The Last Fallen Star by Graci Kim",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Mythology",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Magic"
  ],
  "author": "Rick Riordan",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/56623547-the-cursed-carnival-and-other-calamities"
}