{
  "title": "The Stolen Hours",
  "description": "A woman finds herself in a race not only for justice but for her life in this  \" riveting, hold-your-breath\" new mystery from the bestselling author of  The Life We Bury  (Karin Slaughter, New York Times bestselling author).Lila Nash is on the verge of landing her dream job—working as a prosecutor under the Hennepin County Attorney—and has settled into a happy life with her boyfriend, Joe Talbert. But when a woman is pulled from the Mississippi River, barely alive, things in the office take a personal turn. The police believe the woman’s assailant is local photographer Gavin Spenser, but the case quickly flounders as the evidence wears thin. It seems Gavin saw this investigation coming—and no one can imagine how carefully he has prepared.The more determined Lila is to put Gavin behind bars, the more elusive justice becomes. Battling a vindictive new boss and haunted by the ghosts of her own unspeakable attack, which she’s kept a dark secret for eight long years, Lila knows the clock is ticking down. In a race against an evil mastermind, it will take everything Lila’s got to outsmart a killer—and to escape the dark hold of her own past.“A near-perfect thriller, The Stolen Hours is a true nail-biter that will have you reading long into the night.” — Book Reporter“Even readers who predict the tale’s biggest twist before it arrives will still have the breath knocked out of them by the surprises that follow.” — Kirkus Reviews (starred review)“There’s not a moment misplaced or a second lost. With the precision of a watchmaker, Eskens assembles the fine parts of a mystery and sets them to the tempo of a thriller, leaving the reader breathless.” —Craig Johnson, author of the Walt Longmire Mysteries",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Audiobook",
    "Mystery Thriller",
    "Crime",
    "Suspense"
  ],
  "author": "Allen Eskens",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/56620855-the-stolen-hours"
}