{
  "title": "The Other Merlin",
  "description": "Welcome to the great kingdom of Camelot. Prince Arthur’s a depressed botanist who would rather marry a library than a princess, Lancelot’s been demoted to castle guard after a terrible misunderstanding, and nothing is going according to plan. Then Arthur accidentally pulls the sword from the stone (in his defense, he was drunk and mostly kidding), and now everyone’s convinced he’s some prophesied hero.Emry Merlin is stuck in her small town. Her father, the legendary court wizard, disappeared years ago, and Emry’s been peddling theater tricks to make ends meet. When a royal messenger arrives summoning her far less talented twin brother to serve as Prince Arthur's right-hand wizard, Emry is understandably upset. But after Emmett becomes indisposed thanks to a bad spell, Emry disguises herself as her brother and travels to the royal court to impersonate him until they can switch.Studying magic at the castle is everything Emry hoped for. But life in King Uther’s court is full of scandals, lies, and backstabbing courtiers. What’s a teen wizard masquerading as her twin brother to do? Other than fall for the handsome prince, stir trouble with the foppish Lord Gawain, offend Princess Guinevere, and make herself indispensable to the future of Camelot?When the truth comes out with disastrous consequences, Emry has to decide whether she'll risk everything for the boy she loves, or give up her potential to become the greatest wizard Camelot has ever known.\nChanneling the modern humor of \n\nA Knight's Tale,\n\n bestselling author Robyn Schneider creates a Camelot that becomes the ultimate teen rom-com hotspot in this ultra-fresh take on the Arthurian legend.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Retellings",
    "LGBT",
    "Arthurian",
    "Young Adult Fantasy"
  ],
  "author": "Robyn Schneider",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/56631877-the-other-merlin"
}