{
  "title": "Sinners and Saints",
  "description": "For years, spirited young Scarlett O’Hare has been cooped up in a tiny Vermont town with her repressed and devoutly religious mother, June. When June dies unexpectedly, Scarlett’s wealthy and sinful uncle, Joe Byron, is called upon to return to his boyhood home to help settle his late sister’s estate and make future plans for his niece. But Joe, now peacefully retired and living with an old friend in sleepy Peachtree, Georgia, has his own plan—he wants to burn the house to the ground!Intrepid even as a boy, Joe ran away from that old Vermont house, away from his oppressively religious family and on towards an exciting life of excess running a gambling house in New York City. But now that he’s grown older, Joe is beginning to reflect back on his younger years with shame, and yearns for a sense of reconciliation regarding his past.When Joe meets his young niece, Scarlett, at their shared family home, he’s delightfully surprised by her normalcy. Unlike all of the other members of their family, Scarlett is charming, vibrant, and full of life. As the two talk and get to know each other, they begin to form a bond based around their remarkably similar temperaments and understanding. So much so that Joe offers to provide for Scarlett and allow her to live with him down in Peachtree. She excitedly accepts her uncle’s offer, and they commence on a journey of self-rediscovery and growth. But when two young men become intrigued by her wild beauty, Scarlett is forced to adjust to a new life—that is, until her youthful recklessness gets the better of her.Sinners and Saints is at once an exquisite ode to youthful passion, a lighthearted coming-of-age story, and a heartwarming tale of personal redemption. Bloom reminds us that even though we are all indelibly shaped by our upbringing, we still retain the power to redefine our past and reclaim our own destiny.Note: This novel is clean and charming, and contains a HEA ending.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Young Adult",
    "Christian"
  ],
  "author": "Allie Bloom",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/56612266-sinners-and-saints"
}