{
  "title": "The Top Five Teachings: An Asian Exploration of the Mysteries of Christ",
  "description": "The mysteries of Christ are meant to be explored by everyone. Every background, every race, every spiritual heritage is invited. Yet, it might not seem that way; Christianity can often seem foreign and awkward, even to Christians.The Tea Room Scrolls is a bridge in the Asian garden. At the height of the bridge, two groups of people will meet in this study: those familiar with Asian spiritual traditions, and Christians wanting to explore Jesus’ teachings from a new vantage point. From the safety of the bridge, and with no pressure to step off the bridge, you will explore the mysteries of Jesus Christ in a fascinating format.Mankind has questions—about the purpose of life, the path of blessed living, the way to live in peace, the pursuit of abundant joy. The Tea Room Scrolls is a mindful and spiritual adventure you will never forget as you ponder Jesus’ answers to the most important questions of life.Come up onto the bridge and enjoy the view in this eight week self-study course.Best-selling author Randy Loubier spent 50 years pursuing the Asian spiritual traditions of Shinto, Taoism, Hindu and Buddhism, all the while convinced that Christians were weak people who were deluded by a book written by ancient kings to control the masses. When he finally read the Bible for himself, he discovered something extraordinary: Jesus’ teachings not only brought radical joy to his life, but are a far better fit to the Asian culture than the West! Your perspective is about to be stretched because...“Western Christians are often blind to some vital teachings of Jesus!”“Asian spiritualists are closer than they think to the Kingdom of Heaven!”Included in Volume 1:Vital Introductory MaterialThe Full Grid RevealedIn-Depth Study: Top Row",
  "genres": [
    "Inspirational",
    "Christian"
  ],
  "author": "Randy Loubier",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/56650597-the-top-five-teachings"
}