{
  "title": "Mafia King",
  "description": "Lui, c’est un barbare. Elle, une jeune mariée volontaire éprise de liberté. Mais elle ne fait que troquer une cage contre une autre.EmmaJe me suis volontairement offerte en sacrifice avec un mariage arrangé.Jusqu’à ce que mon père signe un nouveau contrat et me donne à un autre.Maintenant, je dois épouser un barbare.Un homme du Nord, du genre que l’on m’a appris à haïr.Je me jure de ne jamais devenir sienne. Je n’appartiendrai jamais à Shay O’Reagan.Je compte bien le mettre à l’épreuve à chaque instant.Il possédera peut-être mon corps, mais jamais mon cœur.ShayAfin de m’assurer une place de choix au sein de la mafia, je dois accepter un mariage arrangé.Un mariage avec une épouse volontaire, éduquée pour épouser un roi de la mafia.Je me retrouve avec une beauté rousse bien décidée à causer ma perte.Il s’avère qu’elle devait devenir une parfaite épouse de mafieux… mais pas la mienne.Ce terrible détail ne m’empêche pas de la désirer.De désirer ses lèvres rouge rubis.Le feu qui brûle dans son regard rebelle allume en moi un désir qui me pousse à la revendiquer.Alors qu’elle me fait perdre mon temps en me défiant à chaque instant, le Nord vient exiger la rétribution d’un crime enfoui depuis bien longtemps.Le temps presse, alors que je dois affronter à la fois une guerre autour de moi et sous mon propre toit. Chaque seconde nous rapproche tous les deux d’une mort certaine.Je ne peux me fier à personne, car mes ennemis sont partout, même dans mes rangs. Il n’y a qu’une chose dont je suis certain.Je n’abandonnerai jamais.Je combattrai jusqu’au bout, quoi qu’il en coûte.Je suis un roi, et je compte bien mourir debout et fier.Le Roi de la Mafia est le deuxième tome de la série des Rebelles irlandais. C’est une romance dark sur fond de mariage arrangé, qui ne se termine pas sur un suspense et offre aux lecteurs une fin heureuse.",
  "genres": [
    "Dark Romance",
    "Romance",
    "Mafia Romance",
    "Enemies To Lovers",
    "Dark",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Vi Carter",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/56641888-mafia-king"
}