{
  "title": "The Midwest Survival Guide: How We Talk, Love, Work, Drink, and Eat . . . Everything with Ranch",
  "description": "New York Times Bestseller A hilarious full-color guide to Midwestern culture, from comedian and journalist Charlie Berens, creator of the viral comedic series \"The Manitowoc Minute\" Have you ever had a goodbye lasting more than four hours? Do you lack the emotional capacity to say “I love you” so you just tell your loved ones to “watch out for deer”? Have you apologized to a stranger because she stepped on your foot? If you answered yes to any of these questions, there’s a good chance you’re a Midwesterner—or a Midwesterner at heart.  Even if you answered no, you probably know someone who held the door for you from two football fields away. He likely waved at you and said, “Hey there,” like you organized the church bar crawl together. That was a Midwesterner in the wild. We understand that your interaction was strange—but it’s likely to get stranger. Don’t wait until they stick their head in your second-floor window to invite you over for a perch fry because they climbed on your roof to clean your gutters. There’s no need to pull the pepper spray; this species is helpful by nature. And the relationship could be very symbiotic—but only if you let it happen. And that’s where this book comes into play. Inspired by my comedy tours across the Midwest and life growing up in Wisconsin, this book is an exploration into my favorite region on Earth. Some may think the Midwest is just a bunch of bland flyover states filled with less diversity than a Monsanto monoculture. But scratch that surface with your buck knife and you’ll find rich cultures and traditions proving we’re more than just fifty shades of milk.  So whether you’re a born-and-bred Midwesterner looking to sharpen your skill at apologies or a costal elite visiting the in-laws for the holidays, this book will help you navigate the Midwest, with everything from the best flannel looks to dating and mating rituals (yes, casserole is involved) to climbing the corporate corn silo to how to handle a four-way stop—and every backyard brat fry in between.  And for those of you who don’t like reading, don’t worry—we’ve got pictures! Toss in illustrations, sidebars, quizzes, and jokes worthy of a supper club stall and The Midwest Survival Guide is just the walleye-deep look into this distinctive, beautiful, and bizarre American culture you’ve been looking for.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Audiobook",
    "Travel",
    "Comedy",
    "Cultural",
    "Biography"
  ],
  "author": "Charlie Berens",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/56645972-the-midwest-survival-guide"
}