{
  "title": "Jane Austen Made Me Do It: Original Stories Inspired by Literature's Most Astute Observer of the Human Heart",
  "description": "Stories Lauren Willig • Adriana Trigiani • Jo Beverley • Alexandra Potter • Laurie Viera Rigler • Frank Delaney & Diane Meier • Syrie James • Stephanie Barron • Amanda Grange • Pamela Aidan • Elizabeth Aston • Carrie Bebris • Diana Birchall • Monica Fairview • Janet Mullany • Jane Odiwe • Beth Pattillo • Myretta Robens • Jane Rubino and Caitlen Rubino-Bradway • Maya Slater • Margaret C. Sullivan • and Brenna Aubrey, the winner of a story contest hosted by the Republic of Pemberley “My feelings will not be repressed. You must allow me to tell you how ardently I admire and love you.” If you just heaved a contented sigh at Mr. Darcy’s heartfelt words, then you, dear reader, are in good company. Here is a delightful collection of never-before-published stories inspired by Jane Austen—her novels, her life, her wit, her world.In Lauren Willig’s “A Night at Northanger,” a young woman who doesn’t believe in ghosts meets a familiar specter at the infamous abbey; Jane Odiwe’s “Waiting” captures the exquisite uncertainty of Persuasion ’s Wentworth and Anne as they await her family’s approval of their betrothal; Adriana Trigiani’s “Love and Best Wishes, Aunt Jane” imagines a modern-day Austen giving her niece advice upon her engagement; in Diana Birchall’s “Jane Austen’s Cat,” our beloved Jane tells her nieces “cat tales” based on her novels; Laurie Viera Rigler’s “Intolerable Stupidity” finds Mr. Darcy bringing charges against all the writers of Pride and Prejudice sequels, spin-offs, and retellings; in Janet Mullany’s “Jane Austen, Yeah, Yeah, Yeah!” a teacher at an all-girls school invokes the Beatles to help her students understand Sense and Sensibility; and in Jo Beverley’s “Jane and the Mistletoe Kiss,” a widow doesn’t believe she’ll have a second chance at love . . . until a Miss Austen suggests otherwise.Regency or contemporary, romantic or fantastical, each of these marvelous stories reaffirms the incomparable influence of one of history’s most cherished authors.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Historical Fiction",
    "Romance",
    "Anthologies",
    "Chick Lit",
    "Historical"
  ],
  "author": "Adriana Trigiani",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/10285809-jane-austen-made-me-do-it"
}