{
  "title": "The Revolt of the Masses: The Story of Bonifacio and the Katipunan",
  "description": "ABOUT THE BOOK\"In dealing with Andres Bonifacio and the Katipunan, I have laid more emphasis on the latter than on its founder and organizer, firstly because of the dearth of materials on his life, and secondly, because it is my belief that Bonifacio can best be sen and appreciated against the backdrop of the revolutionary society. He could not have been greater than the Katipunan. Nor could he have risen above it. To understand him, one must understand the Katipunan. He looms great because of the society. He must, therefore, be seen in and through the Katipuanan, and this method of unraveling the thin and scattered threads of his life is valid only because of the lack of materials. In examing my sources of information, I have adopted the attitude of friendly hostility. It has been my experience that most of the errors in the difficult task of interpretation--which, after all, is the most important in any book--spring from the scholar's uncritical attitude. He takes for granted that the fame of an author is sufficient guaranty of reliability and competence. Such mental outlook smacks of hypocrisy and cowardice. I have, therefore, dismissed this line of reasoning as inadequate. In this book, I have subjected my sources to a severe scrutiny, looked for loopholes, inconsistencies, and inaccuracies in order to arrive at a balanced conclusion. Ricarte, for instance, hitherto, regarded as incontrovertible, is, after a careful examination, not always accurate and reliable. So is General Pio del Pilar. So are certain documents on the trial and death of Bonifacio. And so are some of the opinons expressed by the great scholars Epifanio de los Santos and Teodoro M. Kalaw. I shall probably hear loud protests and whispered innuendos, but I invite the potential objectors to my method to read my Notes carefully, for in them I have embodied th reasons for repudiating some of the claims of famous scholars, for simissing this authroity and for accepting that document.\"T.A.A.",
  "genres": [
    "History",
    "Ku Klux Klan"
  ],
  "author": "Teodoro A. Agoncillo",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/5663803-the-revolt-of-the-masses"
}