{
  "title": "The Ultimate Hitchhiker's Guide to the Galaxy Omnibus",
  "description": "A phenomenon across all formats, this 42nd anniversary paperback omnibus contains the complete Hitchhiker's Guide trilogy in five parts, charting the whole of Arthur Dent's odyssey through space and time. Share and enjoy.Collected together in this omnibus are the five titles that comprise Douglas Adams' wildly popular and wholly remarkable comedy science fiction 'trilogy', introductions to each book, expanded material from the Douglas Adams archives plus a bonus short story, Young Zaphod Plays It Safe, and a special undeleted scene . . .The Hitchhiker's Guide to the GalaxyOne Thursday lunchtime the Earth gets unexpectedly demolished to make way for a new hyperspace bypass. For Arthur Dent, who has only just had his house demolished that morning, this seems already to be rather a lot to cope with. Sadly, however, the weekend has only just begun. The Galaxy may offer a mind-boggling variety of ways to be blown up and/or insulted, but it’s very hard to get a cup of tea.The Restaurant at the End of the UniverseWhen all questions of space, time, matter and the nature of being have been resolved, only one question remains - 'Where shall we have dinner?' The Restaurant at the End of the Universe provides the ultimate gastronomic experience, and for once there is no morning after to worry about.Life, the Universe and EverythingFollowing a number of stunning catastrophes, Arthur Dent is surprised to find himself living in a hideously miserable cave on prehistoric Earth. However, just as he thinks that things cannot get possibly worse, they suddenly do. An eddy in the space-time continuum lands him, Ford Prefect, and their flying sofa in the middle of the cricket ground at Lord's, just two days before the world is due to be destroyed by the Vogons. Escaping the end of the world for a second time, Arthur, Ford, and their old friend Slartibartfast embark (reluctantly) on a mission to save the whole galaxy from fanatical robots. Not bad for a man in his dressing gown.So Long, and Thanks for All the FishThere is a knack to flying. The knack lies in learning how to throw yourself at the ground and miss. It's not an easy thing to do, and Arthur Dent thinks he's the only human who's been able to master this nifty little trick - until he meets Fenchurch, the woman of his dreams. Fenchurch once realised how the world could be made a good and happy place. Unfortunately, she's forgotten. Convinced that the secret lies within God's Final Message to His Creation, they go in search of it. And, in a dramatic break with tradition, actually find it . . .Mostly HarmlessArthur Dent has settled down on the small planet Lamuella and has embraced his role as a Sandwich Maker. However, his plans for a quiet life are thrown awry by the unexpected arrival of his daughter. There's nothing worse than a frustrated teenager with a copy of the Hitchhiker's Guide to the Galaxy in their hands. When she runs away, Arthur goes after her determined to save her from the horrors of the universe. After all - he's encountered most of them before.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Humor",
    "Science Fiction Fantasy",
    "Novels",
    "Space"
  ],
  "author": "Douglas Adams",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/56647910-the-ultimate-hitchhiker-s-guide-to-the-galaxy-omnibus"
}