{
  "title": "The Girl from Berlin",
  "description": "They sat together on the roof, watching Berlin burn, as traces of smoke and cloud floated through the air. “I just want to be free,” Rosa said quietly, “Even if only for a few minutes. It might be the last chance I have.”Berlin, 1936: From her beautiful new home a young woman named Liesel Scholz barely notices the changes to the city around her. Her life is one of privilege and safety thanks to her father’s job working for the new government.But soon a chance encounter with Rosa, the daughter of their Jewish housekeeper, leaves Liesel in no doubt that something isn’t right. That this government’s rules are not fair and that others aren’t as safe as she is. When Rosa begs Liesel to help—pressing her grandfather’s gold pocket watch into Liesel’s hand—Liesel recklessly agrees.She will help hide Rosa and her family—in the dusty, unused rooms at the top of their house—even if it means putting everyone she loves in danger. Even if it means risking her own life.Frankfurt, 1946: An idealistic American captain, Sam Houghton, arrives in Germany to interrogate prominent Nazis on trial and to help rebuild a battered country. He hires an enigmatic and damaged woman named Anna as his interpreter. But, as sparks fly between them, the question of what happened to Anna in the war raises its head.Because Anna has secrets—ones that link her to the Nazi party, the darkest days in Europe’s history, and the story of one gold pocket watch and two young women who became friends even when they were told it was impossible…A compelling and haunting story about courage, love and betrayal set in war-torn Berlin. Fans of The Alice Network, All the Light We Cannot See and The Nightingale will be not be able to put this down.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "Holocaust",
    "Audiobook",
    "War"
  ],
  "author": "Kate Hewitt",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/56633927-the-girl-from-berlin"
}