{
  "title": "Ground Zero",
  "description": "When former Navy SEAL Jeff Crockett witnesses an attempted kidnapping of a young girl, he makes a conscious choice to save her. But what he doesn’t realize is how that singular decision will change his life forever. It is the catalyst for a new career and the event that opens the door to love. What happens to former Navy SEALS when we enter civilian life? Do we stop serving our country? Stop giving a damn about the mission we've been trained for? Stop caring about our fellow Americans who are unable to defend themselves? When I came face to face with human trafficking, I was forced to answer those questions.My answer is, and always will be, \"HOOYAH!\"I refuse to fail in the fight for freedom, and I am not alone. I am Jeff Crockett, founder and CEO of Cock Blockers, Inc.A private securities corporation made up of former SEALS and support team members.We target for rescue and recovery victims of human trafficking smuggled over the porous southern border. Our motto: Freedom is the only option.  Our first mission: Find and rescue a loved one of one of our own. Nina Fox (Foxtrot), Former Targeting Officer for Bravo. Watching the only man I have ever desired and the man I could not have rescue the little girl I love like my own is the biggest mind-blowing moment of my life. I know I should thank him, but I honestly don’t know if my heart would survive it if this time, without mission restrictions forbidding it, there is nothing more than friendship between us. He is Ground Zero.If you love edge of your seat action, mixed with hot steamy romance, involving alpha men and the women that love them, then Heroes For Hire Missions will be your new favorite series.  *Ground Zero is a standalone action-adventure, romantic suspense novel in a new series of interconnected books.Written in Amazon Bestselling Author Jessika Klide’s no-holds-barred immersive style of storytelling. She takes you straight into the adventure and gives you a front row seat. Undeniable chemistry is her forte told in a happy, romantic, funny way.",
  "genres": [
    "Romance",
    "Contemporary",
    "Military Fiction"
  ],
  "author": "Jessika Klide",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/56668272-ground-zero"
}