{
  "title": "Forsaken",
  "description": "They thought they knew who the enemy was…\nWhen the Vatican extends an official invitation to Artemus and his allies to visit Rome, Artemus is wary of their intentions. Especially since the demon inside Drake has turned out to be one of Hell’s strongest princes, while Otis’s newly awakened powers means he is their most powerful tool against Hell’s army. Heading for Rome despite his misgivings, their arrival precipitates a series of attacks that soon has them questioning everyone around them.Daniel Lenton is a shadow. Afflicted by a disease that weakened him as a child, the priest has dedicated his life to the church and wants nothing to do with Artemus and his friends. Not when such an association would risk exposing the lie he wants to keep buried. But when an ambush rouses Daniel’s beast to defend him against a monster, he is left with little choice but to embrace who he was born to be.After the precious cargo they are hired to protect is attacked by demons, Serena and Nate are convinced that Ba’al is after something hidden among the artifacts bound for an exhibition in Rome. The last thing the super soldiers expect when they arrive in the city is to come face to face with their past.As a new and formidable foe grows closer, Artemus and his allies must decipher the mysteries that await them in Rome, help a guardian find his key, and uncover the location of the next gate to Hell, all before Ba’al destroys the Holy See.\nFrom the author of bestselling supernatural thriller series Seventeen comes a spin-off series like no other. \nIf you like Jim Butcher, Ilona Andrews, Patricia Briggs, Nalini Singh, Karen Marie Moning, Christine Feehan, Shayne Silvers, Shannon Mayer or K.F. Breene, then you’ll love Legion, the new series in the Seventeen universe.\nGrab this spellbinding book and enter a world you won’t want to leave!",
  "genres": [
    "Fantasy"
  ],
  "author": "A.D. Starrling",
  "average_rating": "4.66",
  "url": "https://www.goodreads.com/book/show/56667830-forsaken"
}