{
  "title": "Blood and Bones",
  "description": "Artemus Steele is many things. The world's foremost yet least celebrated expert on all things ancient and arcane. A metalsmith with unusual skills. The owner of an antique shop and a switchblade that is more than just a knife. What he doesn’t want to be is a hero. When the monster he first met on the night he turned six appears on his doorstep, Artemus suspects his life is about to go from strange to hell in a handbasket. And he isn’t too happy about that.Callie Stone arrives in Chicago with one purpose in mind: to sell one of her dead husband’s prized possessions. When the auction house gets attacked by fiendish creatures and the relic goes missing, Callie realizes that the life she has known is a lie and the world is full of frightening things straight out of her worst nightmares.Moments after snatching a priceless artifact from one of the most securely guarded private functions in the country, Drake Hunter is confronted by enemies he thought he’d left in his past. Brought face to face with the mysterious organization after the relic, Drake knows he is dealing with something evil. Because the devil inside him is stirring once more.With no option but to join forces with a pair of ruthless mercenaries, the reluctant associates are cast into a race to uncover the organization’s dark intentions and the true nature of the artifact. To survive, they will need more than brute strength and wit. They will have to figure out what twisted Fate links them. And they will have to embrace powers they never knew they possessed.From the author of bestselling supernatural thriller series Seventeen comes a spin-off series like no other. Get the spellbinding book fans have been waiting for and enter a world you won’t want to leave!",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Fiction",
    "Demons",
    "Angels",
    "Magic"
  ],
  "author": "A.D. Starrling",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/56667764-blood-and-bones"
}