{
  "title": "Murder in the Big Easy",
  "description": "The body of a young boy is found discarded in a dumpster. Even in a town used to deadly crimes, this one touches a nerve.Miles Jenkins is new to the police force, and while he was prepared to deal with routine traffic stops and occasional gang violence. He wasn’t prepared to open a trash bag and find two glassy eyes staring back at him. The rest of the NOPD writes the death off as a casualty of the streets, but Miles is confident it’s something more.He’s so confident, in fact, that he’s determined to uncover the truth, and the first step is talking to the boy’s mother, her boyfriend, and her older brother, Leonard Davis.Leo Davis has a lot going on. With a mother battling a drug addiction and the recent loss of his only nephew, the last thing he wants is a cop to come snooping around his streets, especially one as bright-eyed and hopeful as Officer Jenkins.The officer is obsessed with finding out who killed his nephew, and he’s determined to involve Leo in his search. However, what starts out as a simple off-hours investigation quickly turns into more. With mounting threats and more dead bodies, can Leo and Miles find out who committed this heinous crime before they’re both silenced for good?Murder in the Big Easy is the first of an on-going series. There’s mystery, romance, and action all wrapped up in one nice, fast-paced package. This is an origins story, so while it may feel a little light on the paranormal, realize there’s a lot more to come. This story is gritty and a little dark, so if you’re not into streetwise gangbangers or are sensitive to that language, this may not be the series for you.Murder in the Big Easy is 101k and a complete story, but there are open threads and an overarching plot that will be resolved as the series continues.",
  "genres": [
    "Mystery",
    "M M Romance",
    "Paranormal",
    "M M Mystery",
    "Romance",
    "Fiction",
    "Contemporary"
  ],
  "author": "Jules Monroe",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/56658095-murder-in-the-big-easy"
}