{
  "title": "The Games Lovers Play",
  "description": "#1 New York Times bestselling author Stephanie Laurens returns to the Cynsters’ next generation with an evocative tale of two people striving to overcome unusual hurdles in order to claim true love.A nobleman wedded to the lady he loves strives to overwrite five years of masterful pretence and open his wife’s eyes to the fact that he loves her as much as she loves him.Lord Devlin Cader, Earl of Alverton, married Therese Cynster five years ago. What he didn’t tell her then and has assiduously hidden ever since—for what seemed excellent reasons at the time—is that he loves her every bit as much as she loves him.For her own misguided reasons, Therese had decided that the adage that Cynsters always marry for love did not necessarily mean said Cynsters were loved in return. She accepted that was usually so, but being universally viewed by gentlemen as too managing, bossy, and opinionated, she believed she would never be loved for herself. Consequently, after falling irrevocably in love with Devlin, when he made it plain he didn’t love her yet wanted her to wife, she accepted the half love-match he offered, and once they were wed, set about organizing to make their marriage the very best it could be.Now, five years later, they are an established couple within the haut ton, have three young children, and Devlin is making a name for himself in business and political circles. There’s only one problem. Having attended numerous Cynster weddings and family gatherings and spent time with Therese’s increasingly married cousins, who with their spouses all embrace the Cynster ideal of marriage based on mutually acknowledged love, Devlin is no longer content with the half love-match he himself engineered. No fool, he sees and comprehends what the craven act of denying his love is costing both him and Therese and feels compelled to rectify his fault. He wants for them what all Therese’s married cousins enjoy—the rich and myriad benefits of marriages based on acknowledged mutual love.Love, he’s discovered, is too powerful a force to deny, leaving him wrestling with the conundrum of finding a way to convincingly reveal to Therese that he loves her without wrecking everything—especially the mutual trust—they’ve built over the past five years.A classic historical romance set amid the glittering world of the London haut ton. A Cynster Next Generation novel—a full-length historical romance of 110,000 words.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Audiobook",
    "Victorian",
    "Regency Romance",
    "Mystery"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/56661500-the-games-lovers-play"
}