{
  "title": "A Wilderness of Stars",
  "description": "In this magical romance from the New York Times bestselling author of The Wicked Deep, a mysterious illness cursing the land forces a teen girl astronomer to venture across the wilderness in search of the stars’ message that will, hopefully, save them all.If magic lives anywhere, it’s in the stars… ​Vega has lived in the valley her whole life—forbidden by her mother to leave the safety of its borders because of the unknown threats waiting for her in the wilds beyond. But after her mother dies, Vega begins to see stars falling from the sky. It’s an omen she can no longer ignore, forcing her to leave the protective boundaries of the valley. But the outside world turns out to be much more terrifying than Vega could have imagined. People are gravely sick—they lose their eyesight and their hearing, just before they lose their lives.  What Vega keeps to herself is that she is the Last Astronomer—a title carried from generation to generation—and she is the only one who carries the knowledge of the stars. Knowledge that could hold the key to the cure. And so when locals spot the tattoo on Vega’s neck in the shape of a constellation—the mark of an astronomer—chaos erupts as the threats her mother warned her about become all too real.  Fearing for her life, Vega will be rescued by a girl named Cricket who will lead her to Noah, a boy marked by his own mysterious tattoos. On the run from the men who are hunting her, Vega, Cricket, and Noah will set out across the plains in search of the cure the stars speak of. But as the lines between friend and prisoner begin to blur, Vega must decide whether she will protect the sacred knowledge of an astronomer. Or if she will risk everything to try to save them all.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Fiction",
    "Science Fiction",
    "Young Adult Fantasy",
    "Paranormal"
  ],
  "author": "Shea Ernshaw",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/56659051-a-wilderness-of-stars"
}