{
  "title": "Last Temptation",
  "description": "Others have already fallen prey to Daemon's dark influence, but he's still resolved to fulfill his secret mission. Then, he meets the enchanting Esperanza, and everything starts to change. Can he bear to corrupt the woman he loves like he has corrupted everyone else? Or will he give up his hidden calling and entire purpose for her? With so much on the line, his decision is going to cause eternal repercussions that no one expected.This is a double romance that follows the dual stories of two different couples.From the moment Daemon appears in Jacob's life, he should have known that Daemon was nothing but trouble. It wasn't all bad news though. Because of Daemon, the lovely, unreachable Sara came into Jacob's life, and Jacob can't imagine life without her. There is so much about Sara that he still doesn't know, and it troubles him. Is Sara really the person she seems to be?Jacob isn't the only one encountering Daemon's sinister ways for the first time. As a child, Jacob grew up with his two best friends, Esperanza and Peter. As Jacob becomes wrapped up in Daemon’s unconventional lifestyle, Esperanza finds herself spending more and more time with Peter. He may have been just a childhood friend before, but he now has a sexy allure that she can’t ignore.Everything changes for Esperanza when she is crushed by a personal tragedy, and Peter is nowhere to be seen. In desperate need of love and support, she is an easy target. Daemon quickly proves himself to be a dashing, dangerous competitor for her love. Whether Peter knows it or not, Daemon is now the hidden threat in their love triangle and an intriguing, irresistible paramour for the innocent Esperanza. When Daemon swoops in with his seductive charm, Esperanza, like Jacob before her, is unable to resist him. No one other than Daemon knows the hidden truth behind his sinister deeds—or the terrible extent he will go to fulfill his divine purpose. Can she fall for his seductive appeal without losing her soul? And will he let her? What will Jacob give up to be with the guarded, beguiling Sara?When he met Esperanza, Daemon never expected to find true love. Until then, he'd been content to play the field and introduce Jacob to his unorthodox career choices. Now, the eternal bad boy is left with a problem. Is he willing to give up his entire purpose in life for the only woman he has ever loved? Could he accept the consequences of his decision and choose love over duty? More importantly, would she?This dark romance is intended for mature audiences only.",
  "genres": [
    "Romance"
  ],
  "author": "Sloane Virago",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/56671374-last-temptation"
}