{
  "title": "Therapy",
  "description": "Jonathan Kellerman has made the psychological thriller his own gripping province with his bestselling series of Alex Delaware novels. Now, Delaware’s new adventure leads the sleuthing psychologist on a harrowing exploration into the realm he knows best: the human psyche, in all its complexity, mystery, and terrifying propensity for darkness.“Been a while since I had me a nice little whodunit,” homicide detective Milo Sturgis tells Alex Delaware. But there’s definitely nothing nice about the brutal tableau behind the yellow crime-scene tape. On a lonely lover’s lane in the hills of Los Angeles, a young couple lies murdered in a car. Each bears a single gunshot wound to the head. The female victim has also been impaled by a metal spike. And that savage stroke of psychopathic fury tells Milo this case will call for more than standard police procedure. As he explains to Delaware, “Now we’re veering into your territory.”It is dark territory, indeed. The dead woman remains unidentified and seemingly unknown to everyone. But her companion has a name: Gavin Quick—and his troubled past eventually landed him on a therapist’s couch. It’s there, on familiar turf, that Delaware hopes to find vital clues. And that means going head-to-head with Dr. Mary Lou Koppel, a popular celebrity psychologist who fiercely guards the privacy of her clients . . . dead or alive.But when there’s another gruesomely familiar murder, Delaware surmises that his investigation has struck a nerve. As he trolls the twisted wreckage of Quick’s tormented last days, what he finds isn’t madness, but the cold-blooded method behind it. And as he follows a chain of greed, corruption, and betrayal snaking hideously through the profession he thought he knew, he’ll discover territory where even he never dreamed of treading.As provocative as it is suspenseful, Therapy is premier Kellerman that finds the award-winning author firing on all creative cylinders—and carrying readers on an electrifying ride to a place only he can take them, for an experience they won’t soon forget.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Jonathan Kellerman",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/127221.Therapy"
}