{
  "title": "Obsession",
  "description": "With scores of millions of books in print, translation into two dozen languages, and one of the most popular heroes in contemporary fiction to his name, #1 New York Times bestselling author Jonathan Kellerman is the unequivocal “master of the psychological thriller” (People). In his newest novel Kellerman delivers a tour de force–poignant, dark, and chilling–that illuminates a shadowy world where impulse rules.Tanya Bigelow was a solemn little girl when Dr. Alex Delaware successfully treated her obsessive-compulsive symptoms. Now, at nineteen, she still seems older than her years–but her problems go beyond hyper-maturity. Patty Bigelow, Tanya’s aunt and adoptive mother, has made a deathbed confession of murder and urged the young woman to seek Delaware’s help. The doctor recalls Patty as a selfless E.R. nurse struggling to raise a child on her own–a woman seemingly incapable of the “terrible thing” she has admitted. But for Tanya’s peace of mind, Delaware agrees to investigate, and he enlists LAPD detective Milo Sturgis in the search for the phantom victim of a crime that may never have occurred.Armed with only the vaguest details, psychologist and cop follow a trail twisting from L.A.’s sleaziest low-rent districts to its overblown mansions, retracing Patty and Tanya’s nomadic and increasingly puzzling life to the doorsteps of a sullen heroin addict; a randy real-estate broker; and a brilliant, enigmatic physics student. Suddenly a very real murder tears open a terrifying tunnel into the past, where secrets–and bodies–are buried. As the tension mounts, Delaware and Sturgis uncover a tangled history of desperation, vengeance, and death–a legacy of evil that refuses to die.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Jonathan Kellerman",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/127219.Obsession"
}