{
  "title": "Erotcia Bible: Genesis Part I",
  "description": "The Erotcia Bible = Erotcia GodImagine the Bible... yes, the one you're thinking of... completely rewritten. Imagine it done so with an erotica element splashed over the pages like a Jackson Pollock painting. Imagine an erotic God, an Erotcia God, who is (gasp) a woman.What if Adam and Eve, an Erotcia Adam and Erotcia Eve, frolicked in the gardens amidst the original Erotcia bad guy and committed the first Erotcia sin while God enjoyed every minute?Picture Lot, well before his retreat from Sodom into the mountains, with his daughters. Picture him an Erotcia Lot and how he got that way through his travels with an Erotcia Abraham and Erotcia Sarah.Herein : God is a Woman.Therein : Prepare yourself for the first reverse harem christian stories.Imagine the Bible as an Erotcia Bible story where the lessons you grew up with get a makeover, and all doors that existed get blown off the hinges along with the rules, the clothes, and any shaming on race, sex, orientation, size, or shape.Did you feel excluded from the original Bible? Hated on? Shamed for being YOU? Even villainous?You're no villain. Chances are, if you think so, you're an Erotcia villain which brings you under my wing, into my church: the Erotcia Church of Love, Acceptance, Understanding, and, yes, lots of naughty under-the-covers fun.Are your thoughts bubbling yet?Considering an Erotcia Christian conversion?Skip the confession booth this week and open the pages of the Erotcia Bible for your dose of repentance. For what you've done, pails in comparison to the Erotcia Bible romance stories within.If you’re new to my world, this first collection of Erotcia books from Genesis is for you. You might say I had extra help with this one (wink wink).Erotcia Bible: Genesis Part I is intended for adults 18 and up.Note - Erotcia is my brand of erotica stories. I know what you're thinking, \"It's spelled wrong.\" Nope. It's not. Erotcia is my flavor of erotica. It sounds Italian. I don't think it is, but I like it. I think you will, too.",
  "genres": [],
  "author": "L.W. Boudreaux",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/56660476-erotcia-bible"
}