{
  "title": "Hallowed Ground",
  "description": "Once upon a time in Chicago…\nThere are only two things Artemus Steele and his friends want after their latest battle with Ba’al in Rome. Some R&R and zero encounters with demonic entities trying to kill them. Unfortunately for the angel and his allies, Ba’al is headed to Chicago in search of the slumbering Guardian they know to be there. Detective Jeremiah Chase does not believe in monsters. But when his partner is attacked by one, he can no longer deny the evidence of his own eyes, nor the suspicions he has always harboured about Artemus Steele and the incident he once investigated at Elton LeBlanc’s auction house.Leah Chase knows that lying to her father about her secret meetings with her estranged grandmother will come and bite her in the ass some day. When she receives a mysterious pendant from her grandmother, Leah wonders whether her father had done the right thing keeping her from seeing her mother’s family after all. Because strange things are starting to happen around her. And she can feel the presence of an otherworldly being growing within her soul.When Haruki Kuroda saves Leah from a newborn demon, his actions trigger her awakening and set off a chain of events that no one could ever have imagined. With Ba’al intent on laying a trap to lure out the new Guardian and use her to open another gate of Hell, Artemus and the others must hunt down the divine beast who continues to elude them. The question is, who will find her first?\nHallowed Ground is the fifth book in AD Starrling’s spellbinding urban fantasy series Legion, the spin-off of her bestselling supernatural thriller series Seventeen. If you like smart-mouthed heroes, angels, demons, myths, and monsters, then you’ll love this addictive fifth installment in Legion. Buy Hallowed Ground today and",
  "genres": [
    "Fantasy"
  ],
  "author": "A.D. Starrling",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/56667844-hallowed-ground"
}