{
  "title": "Humiliation: And Other Essays on Honor, Social Discomfort, and Violence",
  "description": "How do we feel when our friend turns up with a holiday present and we have nothing ready to give in exchange? What lies behind our small social panics and the maneuvers we use, to avoid losing face? Recognizing how much we care about how others see us, this wise and witty book tackles the complex subject of humiliation and the emotions that keep us going as self-respecting social actors.William Ian Miller writes astutely about a host of homely and seemingly banal social occasions and shows us what is buried behind them. In his view, our lives are permeated with sometimes merely uncomfortable, sometimes hair-raising rituals of shame and humiliation. Take the unwanted dinner invitation, the exchange of valentines in grade school, or the \"diabolically ingenious invention of the bridal registry.\" Readers will have no trouble recognizing the social situations he finds indicative of our often perilous dealings with each other.Educated as a literary critic and philologist, by profession a historian of medieval Iceland, by employment a law professor, Miller ranges comfortably beyond his areas of formal expertise to talk about emotions across time and culture. His scenarios are based on incidents from his own college town and from the Iceland of the sagas. He also makes incursions into the emotional worlds represented in the Middle English poem, Sir Gawain and the Green Knight, and in some of the works of Shakespeare, Dostoyevsky, and others. Indeed, one theme that gradually becomes specific is how meaning travels from one culture to another. Ancient codes of honor, he insists, still function in contemporary American life.Some of Miller's narratives are unsettling, and he acknowledges that a certain ironical misanthropy may run through his discussions. But he succeeds in cutting through a mountain of pretensions to entertain and enlighten us.",
  "genres": [
    "Philosophy",
    "Psychology",
    "Nonfiction",
    "Essays",
    "History",
    "Sociology",
    "Social Science"
  ],
  "author": "William Ian Miller",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/566817.Humiliation"
}