{
  "title": "No FREE Attention: How Women use The Possibility of Sex to Manipulate Naïve and Lustful Men",
  "description": "Alan Roger Currie, author of the books, \"Mode One,\" \"Oooooh ... Say it Again,\" and \"The Beta Male Revolution\" has now published an edited, revised and updated edition of his 2012 popular best-seller for single heterosexual men titled, \"The Possibility of How Naïve and Lustful Men are Manipulated by Women Regularly\"Currie is well-known as the very first professional dating coach in what is now known as 'The Manosphere' to encourage single heterosexual men to use upfront, specific, and straightforwardly honest verbal communication methods (otherwise known informally as \"direct verbal game\") as a means of quickly identifying women who possess sexually duplicitous tendencies and/or highly manipulative and materialistic desires with men.Currie was also the first professional dating coach to create the concept of the female archetype known as the \"Manipulative Timewaster\" and Currie popularized the signature phrase and personal philosophy of \"No Free Attention.\" In the book, Currie describes a \"Manipulative Timewaster\" as a woman who is very friendly and flirtatious with naïve and lustful men, but in reality, she has no genuine intention of actually engaging in sexual relations with these men.\"No Free Attention\" represents Currie's personal philosophy that a man should never allow women to gain full and indefinite access to his non-sexual time, attention, and companionship unless he and that woman are business colleagues, or unless that woman has already made it clear to the man that she is interested in sharing his company in a romantic or strictly sexual manner.After men read this book, they will no longer have to worry about women placing them in the dreaded \"just-friends-only\" category (also known simply as a woman's \"friend zone\"). Men will have their entire mindset and paradigm changed as a result of reading this book and adhering to Currie's knowledge, wisdom, insight and teachings.",
  "genres": [
    "Psychology"
  ],
  "author": "Alan Roger Currie",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/56685060-no-free-attention"
}