{
  "title": "Save Me from the Dark",
  "description": "He thinks the past is over. He’s dead wrong.Dr. Joel Landry never expected to fall hard and fast for beautiful, mysterious, and maddening Chloe Hastings…but he did. Now he can’t imagine his life without her—and her band of misfit/shady friends. He thinks that he is finally putting his brutal past to rest as he and Chloe begin their new crime-solving partnership, but there are dark secrets pushing to the surface. Secrets that might destroy his relationship with Chloe.She’s lying to protect him.A killer has followed Joel to New Orleans. Someone who has been watching him for a very long time. Someone who wants to turn the doctor…into a monster. But Chloe isn’t about to let that happen. She’s found a man who suits her needs perfectly—and she will not let anyone take him from her. She will do anything necessary to protect Joel, even if that means hiding an unspeakable truth from him. Or killing to shield him. A woman has to do what a woman has to do…Betrayal burns deep.The darkness from Joel’s past is trying to swallow him whole, and when he learns that Chloe knew the truth about him from day one, his world explodes. A killer has Joel in his sights, and the killer wants to push Joel to the edge—and beyond. And the best way to do that? Take away the only person that Joel loves in this world. Take away Chloe.Chloe is no one’s victim.Chloe’s greatest strength is her ability to get into the minds of killers, and this time, her hunt for a murderer is personal. The killer in the dark has picked the wrong team to attack. Chloe and Joel are on the case, and they will not stop until the perp is the one begging for mercy. The hunt is on.Author’s Note: Chloe and Joel are back! Their attraction is just as red-hot, their need for each other even stronger than before. Love, obsession? Maybe they are the same. Joel knows that Chloe turned his life around, and he can’t imagine his world without her. They’re hunting a monster, someone playing a very dangerous game, and it will take all of their cunning and deadly skills to stop a predator who has been manipulating his victims from the shadows. Thrills, chills, red-hot romance, and plenty of surprises are in store. Think you know Chloe and Joel? Think again.",
  "genres": [
    "Romantic Suspense",
    "Suspense",
    "Romance",
    "Mystery",
    "Contemporary",
    "Thriller",
    "Adult"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/56695711-save-me-from-the-dark"
}