{
  "title": "Mother May I",
  "description": "Revenge doesn’t wait for permission.Growing up poor in rural Georgia, Bree Cabbat was warned by her single mother that the world was a dark and scary place. Bree rejected her mother’s fearful outlook, and life has proved her right. Having married into a family with wealth, power, and connections, Bree now has all a woman could ever dream of: a loving lawyer husband, two talented teenage daughters, a new baby boy, a gorgeous home, and every opportunity in the world.Until the day she awakens and sees a witch peering into her bedroom window—an old gray-haired woman dressed all in black who vanishes as quickly as she appears. It must be a play of the early morning light or the remnant of a waking dream, Bree tells herself, shaking off the bad feeling that overcomes her.Later that day though, she spies the old woman again, in the parking lot of her daugh­ters’ private school . . . just minutes before Bree’s infant son, asleep in his car seat only a few feet away, vanishes. It happened so quickly—Bree looked away only for a second. There is a note left in his place, warning her that she is being is being watched; if she wants her baby back, she must not call the police or deviate in any way from the instructions that will follow.The mysterious woman makes contact, and Bree learns she, too, is a mother. Why would another mother do this? What does she want? And why has she targeted Bree? Of course Bree will pay anything, do anything. It’s her child.To get her baby back, Bree must complete one small—but critical—task. It seems harmless enough, but her action comes with a devastating price, making her complicit in a tangled web of tragedy and shocking secrets that could destroy everything she loves. It is the beginning of an odyssey that will lead Bree to dangerous places, explosive confrontations, and chilling truths.Bree will do whatever it takes to protect her family—but what if the cost tears their world apart?",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Audiobook",
    "Mystery Thriller",
    "Suspense",
    "Contemporary"
  ],
  "author": "Joshilyn Jackson",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/56694680-mother-may-i"
}