{
  "title": "FORCES OF LIFE: PSYCHOLOGY: WHAT CREATES SUCCESS OR FAILURE IN OURSELVES AND OUR CHILDREN",
  "description": "Why Have Psychology and Psychiatry Failed Us So Badly?* Psychology, Counseling, and Education are at a \"tipping point\" on the edge of an active volcano. In the 1970s an average of 25,000 Americans committed suicide each year. Today, that figure stands at 48,000 per year, every year, before Covid-19.* This happened even though we now have nearly six times more psychologists, psychiatrists, MSWs school counselors and mental health workers than we had then. And there has been more than a 400% increase in anti-depressive medications in just 20 years.* We have failed dramatically.* Unhappiness in life is epidemic.* We are a nation of very unhappy people. Why?* Where did we go wrongThe failure of psychology is a failure to use the educational system to provide ourselves and our children the knowledge and understanding we need to survive and do well in a very difficult world. The only hope of changing that may be to transform psychotherapy into preventive psychology, instead of psychotherapy, using our educational system.\"If only I knew then, what I know now...\" is the most common regret of life. It fairly screams the critical importance of knowledge. Yet our educational system has failed to provide the knowledge.Psychology Controls the Biology of the Brain. Adrenalin, cortisol, and neurotransmitters flood the brain repeatedly from our experiences in life. From the emotional reaction of our mind to a Hollywood horror movie, a put-down from the peer group, or positive emotions from our parents or society, the emotions embedded in our brains by others shape our anxiety and depression or our success in life.What is it that the best minds in psychology and the most successful people know about succeeding in life against the worst life has to offer? From Lincoln to Oprah, from Mark Twain to Elon Musk, J. B. Rowling, Einstein, Michael Jordan and more, in their own words, the lessons of life that we never learned in school.What creates success or failure in life? We can learn from the life experiences of others. Few understand how little it takes to set our course in life. Most of us find a direction in life by accident, if we find one at all.Nobel laureate John Paul Sartre was an avid reader as a child, encouraged by his mother and grandfather. In his book “ The Words ” he tells how his grandfather saw that he was drifting, with no direction in life, and sat him down and told him that he had the makings of a great writer, like the writers on his grandfather’s bookshelves. But in the meantime, he had to find something to do that would give him a future, like teaching.Sartre said of his grandfather’s words; “It flowed into my bones. It directed my life.”Anxiety and Depression are normal reactions of the human brain.After coming out of a long period of feeling anxious and hopeless, Lara Jefferson wrote a profound comment on the nature of anxiety and depression in her book These are My Sisters :“At least I have learned this, nothing is ever so bad when it is actually happening to us, as when we are dreading, fearing, anticipating it. It is the fear we build in our minds that gives a thing the power to cause us greater pain.”This sets the table for how we can change our own life, or use parents or the school system to change the course of life that leads to the most critical issues of our time, and change the direction of life, by understanding the stories of others who have been through problems we all face and gone on to success.The hypercriticism, the put-downs, the bullying, the gossip, and self-criticism, sets the mind on a path of depression, a loss of self-esteem, a lack of direction, and a feeling of hopelessness. Yet we can succeed, if we learn the stories of others who have been there and gone on to succeed.",
  "genres": [],
  "author": "David Lloyd Shepard",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/56698333-forces-of-life"
}