{
  "title": "City of Glory",
  "description": "Set against the dramatic backdrop of America's second war for independence, Beverly Swerling's gripping and intricately plotted sequel to the much-loved \"City of Dreams\" plunges deep into the crowded streets of old New York. Poised between the Manhattan woods and the sea that is her gateway to the world, the city of 1812 is vibrant but raw, a cauldron where the French accents of Creole pirates mingle with the brogues of Irish seamen, and shipments of rare teas and silks from Canton are sold at raucous Pearl Street auctions. Allegiances are more changeable than the tides, love and lust often indistinguishable, the bonds of country weak compared to the temptation of fabulous riches from the East, and only a few farseeing patriots recognize the need not only to protect the city from the redcoats, but to preserve the fragile Constitutional union forged in 1787.Joyful Patrick Turner, dashing war hero and brilliant surgeon, loses his hand to a British shell, retreats to private life, and hopes to make his fortune in the China trade. To succeed he must run the British blockade; if he fails, he will lose not only a livelihood, but the beautiful Manon, daughter of a Huguenot jeweler who will not accept a pauper as a son-in-law. When stories of a lost treasure and a mysterious diamond draw him into a treacherous maze of deceit and double-cross, and the British set Washington ablaze, Joyful realizes that more than his personal future is at stake. His adversary, Gornt Blakeman, has a lust for power that will not be sated until he claims Joyful's fiancee as his wife and half a nation as his personal fiefdom. Like the Turners before him, Joyful must choose: his dreams or hiscountry.Swerling's vividly drawn characters illuminate every aspect of the teeming metropolis: John Jacob Astor, the wealthiest man in America, brings the city's first Chinese to staff his palatial Broadway mansion; Lucretia Carter, wife of a respectable craftsman, makes ends meet as an abortionist serving New York's brothels; Thumbless Wu, a mysterious Cantonese stowaway, slinks about on a secret mission; and the bewitching Delight Higgins, proprietress of the town's finest gambling club, lives in terror of the blackbirding gangs who prey on runaway slaves. They are all here, the butchers and shipwrights, the doctors and scriv-eners, the slum dwellers of Five Points and the money men of the infant stock exchange...conspiring by day and carousing by night, while the women must hide their loyalties and ambitions, their very wills, behind pretty sighs and silken skirts.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "New York",
    "American History",
    "Americana",
    "American"
  ],
  "author": "Beverly Swerling",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/567129.City_of_Glory"
}