{
  "title": "The Lonely Lady",
  "description": "“Harold Robbins is a master.” —Playboy  “Robbins grabs the reader and doesn’t let go…” —Publishers Weekly  A young schoolgirl with dreams of being an actress, JeriLee Randall, is at the dawn of discovering her own sexuality when she meets Walter Thornton, Jr., the son of the world-famous playwright, Walter Thornton, Sr., whom she idolizes. After a humiliating “near” sexual encounter with JeriLee, Walt Jr. participates in a graphically brutal assault that traumatizes JeriLee, triggering unfettered chaos in their small, gossipy town.  Walt’s father Walter Sr. befriends JeriLee and tries to make amends for the deplorable behavior of his son. Over time, despite their age difference, the two become quite close and eventually marry—resulting in yet another town scandal.  But it is JeriLee’s ambition—not the rumors—that drives the couple from this tiny town to New York City, setting her on a collision course with an unexpected future.  Inevitably, their marriage unravels and JeriLee embarks on a path of sexual liberation in her pursuit of success—from stints in sleazy strip clubs to rendezvous on the casting couches of Hollywood moguls, from the searing lights of Broadway to the twilight world of drugs—as JeriLee moves restlessly from man to man and woman to woman.  Can she find success in a brutal world while retaining her dignity, honesty, and the self-respect developed in her youth? As she struggles to retain her dreams of stardom, can her strength and cunning save her from Hollywood’s death grip, allowing her to beat the smooth-talking power players at their own game?  When it was published, The Lonely Lady spent 24 weeks on the best-seller list, turning Hollywood on its ear and, yet again, showing the world that Harold Robbins stood alone in his ability to redefine erotic fiction. Robbins, author of The New York Times #1 best-selling novel The Carpetbaggers, proves that his books still have the power to keep readers turning pages.",
  "genres": [
    "Fiction",
    "Romance",
    "Drama",
    "Contemporary",
    "Novels",
    "Adult Fiction"
  ],
  "author": "Harold Robbins",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/56709.The_Lonely_Lady"
}