{
  "title": "Gasoline Dreams: Waking Up from Petroculture",
  "description": "A graphic novel that confronts our habits, narratives, and fantasies head-on to helpbreak our petroleum dependencyWhat if the biggest barriers to responding to climate change are not technological or governmental but, rather, cultural? In other words, what if we ourselves could help to enact change through a deeper understanding of our petroleum dependency? In a provocative graphic format that draws widely from history, critical theory, and popular culture, Gasoline Dreams explores and challenges the ways fossil fuels have shaped our identities, relationships, and our ability to imagine sustainable, equitable futures.As our rapidly warming planet is pushed toward ecological collapse, we might often feel helpless or paralyzed by the enormity of the challenges confronting us. However, reflecting upon the cultural dimensions of our predicament helps reveal the great potential for social transformation inherent in the multiplying crises. Author and artist Simon Orpana engages with contemporary scholarship in the emergent field of Energy Humanities to confront the habits, narratives, and fantasies that support our attachment to fossil fuels. By revealing the many ways petroculture repeatedly fails to deliver on its promises of “the good life,” Gasoline Dreams calls us to the difficult work of waking up from the fantasies that inhibit us from working toward a global transition to renewable energy.Written in an engaging graphic format that makes relevant historical, cultural, and political analyses of global warming and petrol dependency important to a wide audience, Gasoline Dreams refutes the progress narratives that depict contemporary, energy-intensive societies as the inevitable product of human history. By revealing the contingencies, coercions, and compulsions this myth disguises, the book allows us to imagine truly progressive alternatives. Rather than casting climate change as a problem for technological elites to solve, the book confronts the everyday realities that reinforce our dependence on fossil fuels, offering a space of hope and engagement from which concerned people can work to build a more sustainable future.On the threshold of the single greatest transformation the human species has yet faced, Gasoline Dreams challenges us to start living, working, and dreaming differently to become less culturally dependent on petroleum.",
  "genres": [
    "Graphic Novels",
    "Nonfiction",
    "Politics"
  ],
  "author": "Simon Orpana",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/56750501-gasoline-dreams"
}