{
  "title": "A Return to Modesty: Discovering the Lost Virtue",
  "description": "Where once a young woman had to be ashamed of her sexual experience, today she is ashamed of her sexual inexperience. Where not long ago an unmarried woman was ashamed to give public evidence of sexual desire by living with someone, today she must be ashamed to give evidence of romantic desire. From sex education in grade school to coed bathrooms in college, today's young woman is being pressured relentlessly to overcome her embarrassment, her \"hang-ups,\" and especially her romantic hopes.Meanwhile, the problems young women struggle with grow steadily more from sexual harassment, stalking, and date rape to anorexia and self-mutilation. Both men and women endlessly lament the loss of privacy and of real intimacy. What is it all about?Beholden neither to conservatives who discount as exaggeration the dangers facing young women, nor to feminists who steadfastly affix blame on the patriarchy, Wendy Shalit proposes that, in fact, we have lost our respect for an important classical virtue -- that of sexual modesty. A Return to Modesty is a deeply personal account as well as a fascinating intellectual exploration. From seventeenth-century manners guides to Antonio Canova's sculpture, Venus Italico, to Frank Loesser's 1948 tune, \"Baby, It's Cold Outside,\" A Return to Modesty unfolds like a detective's search for a lost idea as Shalit uncovers opinions about this lost virtue's importance, from Balzac to Simone de Beauvoir, that have not been aired for decades. Then she knocks down the accompanying myths one by one. Female modesty is not about a \"sexual double standard,\" as is often thought, but is related to male virtue and honor. Modesty is not a social construct, but a natural response. And modesty is not prudery, but a way to preserve a sense of the erotic in our lives.With humor and piercing insight, Shalit invites us to look beyond the blush and consider the new power to be found in an old ideal. She maintains that the sex education curriculum forced on those of her generation from an early age is fundamentally flawed, centered as it is on overcoming reticence -- what we today call \"hang-ups.\" Shalit surprisingly and persuasively argues that without these misnamed hang-ups there can be no true surrender, no richness and depth to relations between the sexes. The natural inclination toward modesty is not a hang-up that we should set out to cure, but rather a wonderful instinct that, if rediscovered and given the right social support, has the power to transform society.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Philosophy",
    "Sociology",
    "Sexuality",
    "Psychology",
    "Religion"
  ],
  "author": "Wendy Shalit",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/56748.A_Return_to_Modesty"
}