{
  "title": "Every Word You Never Said",
  "description": "HEARTSTOPPER meets FOOTLOOSE in this cute young adult romance about first love, embracing what makes you different, and standing up for what you believe.⁠— ⁠— ⁠— ⁠— ⁠— ⁠— ⁠—Jacob Walters′s dad has worked to make his son′s life a living hell. But when the cute new transfer student suffers his father′s wrath, Jacob must make the hardest decisions of his life.Skylar Gray is adopted, nonverbal, and he feels most comfortable wearing skirts. Life has never been easy, but with a fresh start at a brand-new school, with new parents and in a new state, he just might finally make some friends. Maybe. Honestly it′s hard to focus on anything when gorgeous rocker boy Jacob is around. But it′s hard for Skylar to trust anyone when people have always been quick to ditch him at the first inconvenience; they always seem more than ready to judge him as defective. And the bullies love to confirm it. Skylar has only ever had himself, so why would anything be different this time? Especially for an anxious boy with literally no voice.Jacob doesn′t give a damn, especially not since he came out over the summer. He expected the hate he got from his father, who mostly acts as if it never happened, but he refuses to let it hold him back. It doesn′t matter, Jacob′s over it. He's going to paint his nails, dye his hair, and strike a heavy riff on his guitar if he wants to, even if it means being grounded most of senior year. But when the cute nonverbal transfer student, Skylar, wears a skirt to school, prompting a sexist new dress code proposal, Jacob decides it′s time to take a stand, no matter the risk to himself.- - - - - - - - - - -TW: Homophobia & Homophobic Slurs, Bullying, Sexism, Ableism, Religious Trauma",
  "genres": [
    "LGBT",
    "Romance",
    "Queer",
    "Young Adult",
    "Contemporary",
    "Gay",
    "Fiction"
  ],
  "author": "Jordon Greene",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/56706019-every-word-you-never-said"
}