{
  "title": "Pie It Forward: Pies, Tarts, Tortes, Galettes, and Other Pastries Reinvented",
  "description": "\"It’s a conundrum I can’t understand. Someone’s hankering for pie; you can see the pie-longing in their eyes. They want a delicious flaky crust, something with buttery overtones. They want fresh fruit—not a vague whisper of berry in a butter cream, but overt chunks of apple, discernible bites of berry. But it’s just not done. You don’t serve pie at special events like fiftieth birthdays, dinner parties, silveranniversaries, or, God forbid, at a wedding. To which I reply, ‘Bullpuckies.’\" And so begins Pie It Forward: Pies, Tarts, Tortes, Galettes, and Other Pastries Reinvented. Pie has always been a popular cookbook topic, yet in Pie It Forward, baker, confectioner, and pastry master Gesine Bullock-Prado unveils an entirely new frontier of pies, redefining what can be done with a piecrust and pastry shell. Expect lattice and cutouts with an entirely modern twist. Homemade puff pastry made easy. Individual pie pops to replace tiredcupcakes. Surprising and wildly successful explorations with beer (Chocolate Stout Pudding Pie), exotic fruits (Yuzu-Ginger Rice Pudding Meringue Pie), and candy making (Earl Grey Truffle Tart). And there are the classics too—riffing on her German roots, her Hollywood background, and life on her Vermont farm—a Blueberry Brown Butter Tart, an Italian Plum Tart with a yeasted-dough crust, a tiramisu-inspired Espresso Tart, a Vermont Pizza Pie, and more. Including sweet, savory, layered, and miniature pies and tarts, Bullock-Prado presents these recipes with a voice that removes the intimidation factor and inspires readers to break out of the double-crust straitjacket and try her signaturecreations—and to laugh out loud along the way. For additional information, technique demonstrations, and more, please visit www.pieitforwardcookbook.com. Praise for Pie it Forward: “Delicious reworkings and inventions from Sandra Bullock’s sister, including a truly quick puff pastry that’s worth the price of the book.” —New York Times Book Review \"A slice of heaven.\" —US Weekly \"In Pie it Forward, Gesine Bullock-Prado satisfies even the most demanding sweet tooth.\" —National Examiner \"Pie it Forward by Gesine Bullock-Prado grabs you with the delectable cover, and holds you with its mouth-watering recipes. My favorite so far, the unbearably amazing pear and rhubarb cardamom custard pie, tastes both cozy and original in the best way possible.\" —Campus Circle “Work your way through her beginning section on crusts—the thing that scares bakers off pies—and you will be an expert from puff pastry to pizza dough. . . . When you’ve conquered these, it really is time to “pie it forward” with Bullock-Prado’s compositions that turn pie into art. To see them and her technique go to pieitforwardcookbook.com because words don’t do them justice.” —Cookbook Digest",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food"
  ],
  "author": "Gesine Bullock-Prado",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/12723590-pie-it-forward"
}