{
  "title": "Two Steps Forward, One Step Back: My Life In The Music Business",
  "description": "My real story starts with a disaster, an unmitigated, pull-the-rug-from-under-you, clean-out-the-bank-account disaster. But had it not happened, The Police would never have risen to become the biggest rock band in the world; Jools Holland would not have ended up on TV; The Bangles, The Go-Go’s, R.E.M., and many other music stars might never have made it either. It’s strange how a fluke, a disaster, an unlikely event can lead to incredible results. But that is in essence what happened to me . . . Two Steps Forward, One Step Back tells the extraordinary story of a maverick manager, promoter, label owner, and all-round legend of the music industry. It opens in the Middle East, where Miles grew up with his father, a CIA agent who was stationed in Syria, Egypt, and Lebanon. It then shifts to London in the late 60s and the beginnings of a career managing bands like Wishbone Ash and Curved Air—only for Miles’s life and work to be turned upside down by a disastrous European tour. From the ashes of near bankruptcy, Miles entered the world of punk, sharing a building with Malcolm McLaren and Sniffin’ Glue , before shifting gears again as manager of The Police, featuring his brother Stewart on drums. Then, after founding IRS Records, he launched the careers of some of the most potent musical acts of the new wave scene and beyond, from Squeeze and The Go-Go’s to The Bangles and R.E.M. The story comes full circle as Miles finds himself advising the Pentagon on how to win over hearts and minds in the Middle East and introducing Arabic music to the United States. ‘Never let the truth get in the way of a good story,’ his father would tell him. In the end, though, the truth is what counts—and it’s all here.",
  "genres": [
    "Music",
    "Autobiography",
    "Nonfiction"
  ],
  "author": "Miles Copeland III",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/56756256-two-steps-forward-one-step-back"
}