{
  "title": "The Other Daughter",
  "description": "Twenty-one year-old Scarlett Strohman has had to walk a difficult path thus far in her young life. Raised by a neglectful mother and an alcoholic grandmother before entering the foster care system, she's never met the father who abandoned her before birth. Scarlett is tough, embittered, and has a chip on her shoulder that's nearly as big as her goal to make something meaningful out of her life. She works three jobs to put herself through college, frequently goes to bed hungry, and is wary around most people, having been betrayed and let down far too many times to trust easily.Jackson Gilmore has, by contrast, lived a life of privilege and comfort, the youngest child of a wealthy, prestigious family. He's always felt like something of an oddball in his family, though, the only one with enough guts to frequently stand up to and defy his controlling, dictatorial father. His desire to leave town and make a life of his own had to be put on hold, however, when his beloved niece fell seriously ill with a life threatening disease. And it is his overwhelming sense of obligation to do anything to help his niece that brings Jackson into Scarlett's life once he realizes the connection between the two girls.Sparks instantly ignite when Scarlett and Jackson meet for the first time, and as they gradually come to know each other – reluctantly so on her part – he feels both admiration for what she's made of her life, compassion for all that she's suffered, and an emotional and physical attraction that is both powerful and entirely forbidden.As long held secrets are revealed, and Scarlett comes face to face with unpleasant reminders of her past, will she be able to rely on Jackson to stand by her? Or will he be just one more in a long line of all those who have failed her?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Illness",
    "Fiction",
    "College",
    "M F Romance"
  ],
  "author": "Janet Nissenson",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/56757097-the-other-daughter"
}