{
  "title": "The Lucky Escape",
  "description": "‘This is exactly the book we all need right now’ Beth O’Leary‘I can’t remember the last time a book made me forget I had a phone’ Stacey HallsONE CANCELLED WEDDINGWhen the day finally comes for Annie to marry Alexander, the last thing she expects is to be left standing at the altar. She was so sure he was Mr Right. Now, she has no idea how she could have got it so wrong. ONE UNEXPECTED ENCOUNTERAfter a chance meeting with Patrick, an old friend who reminds her of who she used to be, Annie takes a vow of her own: she’ll say yes to every opportunity that comes her way from now on.ONE SPARE TICKET FOR THE HONEYMOON Could a spontaneous trip with Patrick be the way to mend Annie’s heart? She’s about to find out as she embarks on her honeymoon – with a man who’s not her husband…PRAISE FOR THE LUCKY ESCAPE‘Full of fun and charm, I'd recommend it to anyone wishing to be whisked away by an utterly feel-good love story.’ Holly Miller, author of Richard Judy Bookclub Pick The Sight of You‘I can’t remember the last time a book made me forget I had a phone. Pure escapist fiction!’ Stacey Halls, author of Sunday Times bestseller and Richard Judy Book Club Pick The Familiars‘The Lucky Escape is Laura's best book yet. It whisked me away on a much-needed holiday – this is exactly the book we all need right now!’ Beth O’Leary, Sunday Times bestselling author of The Flatshare and The Switch‘What an absolute delight! A romantic, relaxing, inspiring not-quite-honeymoon in book form, with a surprising emotional heft behind it. I love it!’ Emily Henry, New York Times bestselling author of Beach Read‘Perceptive, funny and ultimately hopeful – the perfect tonic for 2021.’ Sophie Cousens, New York Times bestseller of This Time Next Year",
  "genres": [
    "Romance",
    "Contemporary",
    "Audiobook",
    "Fiction",
    "Chick Lit",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Laura Jane Williams",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/56754290-the-lucky-escape"
}