{
  "title": "Fox & I",
  "description": "A solitary woman’s inspiring, moving, surprising, and often funny memoir about the transformative power of her unusual friendship with a wild fox, a new window onto the natural world, and the introduction of a remarkable literary talent.Catherine Raven left home at 15, fleeing an abusive father and an indifferent mother. Drawn to the natural world, for years she worked as a ranger in National Parks, at times living in her run-down car (which lacked a reverse gear), on abandoned construction sites, or camping on a piece of land in Montana she bought from a colleague. She managed to put herself through college and then graduate school, eventually earning a Ph.D. in biology.Yet she never felt at home with people, and though she worked at various universities and taught field classes in the National Parks, she built a house on a remote plot of land in Montana and, except when teaching, spoke to no one. One day, she realized that the fox who had been appearing at her house was coming by every day at 4:15. He became a regular visitor, who eventually sat near her as she read to him from The Little Prince or Dr. Seuss. Her scientific training had taught her not to anthropomorphize animals, but as she grew to know him, his personality revealed itself—and he became her friend. But friends cannot always save each other from the uncontained forces of nature.Though this is a story of survival, it is also a poignant and dramatic tale of living in the wilderness and coping with inevitable loss. This uplifting fable-like true story about the friendship of a woman and a wild fox not only reveals the power of friendship and our interconnectedness with the natural world but is an original, imaginative, and beautiful work that introduces a stunning new voice.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Nature",
    "Animals",
    "Science",
    "Audiobook",
    "Biography"
  ],
  "author": "Catherine Raven",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/56764127-fox-i"
}