{
  "title": "The Christmas Dress",
  "description": "An enchanted Christmas dress brings two generations of women together for the magic of the season in this delightful holiday story from author Courtney Cole.One Dress. Two Women. The Magic of the Holiday Season.When hopeful fashionista Meg Julliard must return to her hometown of Chicago to manage her late father’s apartment building, she thinks her dreams of making it in the fashion business are over. Add in her father’s eclectic roster of tenants who all need Meg’s attention (ASAP!), a host of building related disasters, and a handsome handyman she keeps embarrassing herself in front of, and this has all the makings for the worst Christmas she’s ever had.Ellie Wade, one of the building’s longtime residents, is also not feeling the Christmas Joy this year. She is preparing to move into a nursing home (reluctantly), and is in the process of sorting through her belongings to downsize. Every corner of her apartment holds memories, some good, some bad. But there’s one dress she hesitates to pack up as it represents both the best and worst night of her life.Ellie and Meg strike up an unlikely friendship and the story of Ellie’s dress comes out. Ellie gifts the gorgeous dress to Meg, hoping that it will bring her more luck, on the condition that she wear it to the building’s Christmas party.The dress magically fits, and while it eventually leads to the best night of Meg’s life, it also acts as inspiration for Meg to follow a life-long dream of her own, a dream that will help save the crumbling Parkview West, and restore it to its former glory, and keep it as a safe home for all of the current tenants.The dress and the magic of the holiday season helps both Meg and Ellie find their own happy endings.",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Book Club",
    "Fiction",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Courtney Cole",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/56755565-the-christmas-dress"
}