{
  "title": "The Man Who Loved Cole Flores",
  "description": "You want revenge? Dig two graves.Ten years ago, a vicious gang called the Gotham Boys descended on a homestead in the mountains like a pack of wolves, leaving nothing behind but death and destruction.Ned O’Leary was the only one to survive the ordeal.He lost hope for revenge long ago, but its flame erupts in his heart when the gang is spotted again. By a stroke of luck, he is recruited to infiltrate the Gotham Boys and bring them all to justice. Ripped out of his wholesome life on a ranch, he has to find his footing with a band of ruthless outlaws who challenge his morals every step of the wayBut the one who tests him most of all is Cole Flores. Deadly, full of himself and unpredictable, the gang leader’s adopted son should be a man easy to hate, but instead, he sparks illicit desires Ned has never felt before.Cole Flores is forbidden.Cole Flores is corruption.Cole Flores is everything Ned O’Leary craves.Torn between love and revenge, lust and loyalty, Ned has to face impossible choices that are bound to leave scars, no matter how hard he tries to do the right thing.*“I don’t know what this means, or how to do this with you,” he whispered as his heart broke into a gallop. “But I want to. I need to.”\nDark, dangerous, yet desperately romantic,\n “The Man Who Loved Cole Flores” is a gritty western M/M romance novel. Prepare for violence, emotional turmoil, and scorching hot, explicit scenes, as well as a heart-pounding cliffhanger to book 1.The epic love story of Ned O’Leary and Cole Flores gets its HEA in book 2 - “The Man Who Hated Ned O’Leary”.POSSIBLE SPOILERS:Themes: Enemies-to-lovers, first love, revenge, undercover, friends-to-lovers, forbidden romance, outlaws and cowboys, crime, gang, secrets, loyalty, betrayal, period-typical homophobia, Old West, survival, corruption of the innocent, self-discovery, first love, opposites attractLength: ~155,000 words (Book 1 in a duology)WARNING: This story contains scenes of violence, offensive language and morally ambiguous characters as well as sensitive topics of child abuse and suicide",
  "genres": [
    "Historical",
    "M M Romance",
    "Romance",
    "Westerns",
    "Friends To Lovers",
    "Enemies To Lovers",
    "Historical Fiction"
  ],
  "author": "K.A. Merikan",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/56766249-the-man-who-loved-cole-flores"
}