{
  "title": "The Seeds of Time",
  "description": "Clio Finn is a Dive pilot on a troubled Earth in 2019. Public paranoia about the AIDS virus and its successors has led to the imprisonment of the \"subversives\" of the society (namely, drug users and gays) in forced labor quarantine camps known as quarries. Meanwhile, Earth itself is dying from a progressive lack of greenery, as the UV irradiation from a successively depleted ozone layer is killing off all the plants, and therefore the planet's ability to sustain itself. To counteract this problem, the powers of Earth have decided that new greenery must be found on alternate worlds, to supplement Earth's dying stock with heartier, alien strains. But since faster-than-light travel is still unavailable, a new method must be found to achieve this. Enter time travel, in which a quick jaunt down through time can bring ships into the position of planets which had rotated through Earth's present position in the distant past, due to the galaxy's extended period of rotation.As most people are unable to remain awake during these temporal Dives, the guiding duty is left to an exclusive class of Dive pilots. Only dive pilots have a limited span before they burn out. Most can last thirty to forty Dives. Clio Finn has lasted fifty-five, and she is on the ragged end of burn-out, kept on track only by a handful of outlawed drugs. But the potential rewards are great. A previous haul of greenery, once thought to be Earth's salvation, is dying off, and an illicit jaunt into the future taken by Clio and her colleagues has discovered the violent end of humanity itself. So her current destination, Niang, an Edenic tropical planet, seems the answer to mankind's prayers. Only, on Niang's surface, Clio discovers a desperate secret. The green which may save mankind also subsists on metals, and may therefore destroy all of mankind's existing technology. Clio's dilemma--whether to regreen Earth at the risk of driving man back into the dark ages--is only exacerbated when an accidental loop in time catches her in a paradox between two alternate futures, each of which is determined to eradicate the other completely and absolutely.",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Science Fiction Fantasy",
    "Fantasy"
  ],
  "author": "Kay Kenyon",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/127264.The_Seeds_of_Time"
}