{
  "title": "The Dope: The Real History of the Mexican Drug Trade",
  "description": "The Mexican drug trade has inspired prejudiced narratives of a war between north and south, white and brown; between noble cops and vicious kingpins, corrupt politicians and powerful cartels. In this first comprehensive history of the trade, historian Benjamin T. Smith tells the real story of how and why this one-peaceful industry turned violent. He uncovers its origins and explains how this illicit business essentially built modern Mexico, affecting everything from agriculture to medicine to economics—and the country’s all-important relationship with the United States.Drawing on unprecedented archival research; leaked DEA, Mexican law enforcement, and cartel documents; and dozens of harrowing interviews, Smith tells a thrilling story brimming with vivid characters—from Ignacia “La Nacha” Jasso, “queen pin” of Ciudad Juárez, to Dr. Leopoldo Salazar Viniegra, the crusading physician who argued that marijuana was harmless and tried to decriminalize morphine, to Harry Anslinger, the Machiavellian founder of the American Federal Bureau of Narcotics, who drummed up racist drug panics to increase his budget. Smith also profiles everyday agricultural workers, whose stories reveal both the economic benefits and the human cost of the trade.The Dope contains many surprising conclusions about drug use and the failure of drug enforcement, all backed by new research and data. Smith explains the complicated dynamics that drive the current drug war violence, probes the U.S.-backed policies that have inflamed the carnage, and explores corruption on both sides of the border. A dark morality tale about the American hunger for intoxication and the necessities of human survival, The Dope is essential for understanding the violence in the drug war and how decades-old myths shape Mexico in the American imagination today.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Crime",
    "Politics",
    "Audiobook",
    "American History"
  ],
  "author": "Benjamin T. Smith",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/56769588-the-dope"
}