{
  "title": "A Shifter for New Years",
  "description": "Burke Dunne’s Pride of lion shifters is finally growing. One year ago, his brother finally chose a human mate in Leslie, and Turned her. One year ago, he started opening up to the possibility that he would someday be an uncle. One year ago, he watched Leslie’s sister, Kimberly, struggle through a divorce, and has watched her be weighed down by her reality ever since. At every Wilson family party throughout the year, she’s grown quieter and quieter, and it doesn’t sit well with him. She’s losing everything, and the animal inside of him wants to point her in the right direction again. Not because he cares. Of course not because of that. But because he doesn’t like seeing alpha females go weak and get broken by circumstance. But as he steps out of the routine of his life to make sure she’s okay, he falls for her quiet strength, and her brazenness, and her tenacity. Kimberly is on a journey, and he wants to be a part of it. She has a lot to prove in the new year, and he wants to have that front row seat at seeing her not only succeed, but step out of the shadow of her family name and become her own legend.Kimberly is losing everything. The future that she’d thought she had is dead and buried, and she’s coming out of a split that stole her entire life. When her sister, Leslie, offers her a job at a pottery shop, and a small home to call her own, everything in her wants to run back to the comfortable life her parents are tempting her with. But Burke Dunne is challenging her to be more than just some Wilson with a planned, perfect future. He’s wanting more for her. He’s wanting her to work harder and be her own woman. And the more he tells her she can, the more she believes she can too. She has big resolutions this year, but they don’t include tethering herself to a shifter with a red mark on his name. Burke is off-limits for a human like her, and the rules they are breaking could send him right to shifter prison. All she wants for the new year is a simpler, easier, worthwhile life…but sometimes ultimate sacrifices need to be made to reach a dream so steady.Content Warning: Explicit love scenes, naughty language, and piles of sexy shifter secrets. Intended for mature audiences.",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Holiday",
    "Fantasy",
    "Supernatural"
  ],
  "author": "T.S. Joyce",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/56772055-a-shifter-for-new-years"
}