{
  "title": "Fighting Conviction",
  "description": "#1 Best Seller Action & Adventure RomanceAn Amazon Top 100 Best Seller He saved her once… now he’s teaching her to save herself.BlackStone Securities Agent Devil Ray Vos needs control, and around his best friend’s younger sister, Ellie Stone? He knows he can’t keep it. The BlackStone team saved her a year ago, and Devil hasn’t been able to get his angel off his mind since. She’s in college and still healing, so he’s kept his distance. That resolve vanishes when her brother asks Devil to train her in self-defense. His head tells him to stay away, but no one can protect her better than he can. Ellie survived the worst trauma of her life a year ago. Her best friend didn’t, and Ellie has fought survivor’s guilt and PTSD ever since. Only Devil seems to understand her. He sees her as a survivor… and his best friend’s kid sister. But his face was the first she saw when BlackStone rescued her, and you never get over a hero crush. When Devil lessons get more hands-on, she realizes her feelings burn deeper. But all that gets pushed aside when the BlackStone team goes after the men who took Ellie, and her life is suddenly at stake again. It’s do or die.And she’ll have to use Devil’s lessons to stay alive.  FIGHTING CONVICTION is the suspenseful second chapter in the Conviction Series of interconnected standalones. Devil and Ellie get their happily-ever-after and a new couple gets their own HEA in Book Three, while the entire series carries an overarching plot. **The Conviction series should be read by mature readers only (18+) and contains sexually explicit scenes, along with descriptions of human trafficking, drugs, strong language, and physical and sexual violence. Reader discretion is advised.**",
  "genres": [
    "Romance",
    "Dark Romance",
    "Contemporary",
    "Dark",
    "Military Fiction",
    "Adult",
    "Contemporary Romance"
  ],
  "author": "Greer Rivers",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/56780278-fighting-conviction"
}