{
  "title": "Crazy Town: Money. Marriage. Meth.",
  "description": "Sterling Braswell was a millionaire—palatial ranch, stock options, and money in the bank. Then he met his high school sweetheart after not seeing her for over ten years. With their love rekindled, they were married. Life was beautiful. They had no real worries, a lovely son, and a bright future.Then she started using meth.The craziness of the next few years would leave Sterling almost completely broke—financially, emotionally, and spiritually—and nearly murdered.The Weekender Raves About Crazy Town!Drugs, violence, sex and betrayal. Sound like the tagline from the newest Megan Fox movie? Maybe, but those components are also the basis for the book “Crazy Town: Money. Marriage. Meth.” by Sterling R. Braswell. Published right in our own backyard by Wilkes-Barre-based Kallisti Publishing, Inc., “Crazy Town” is the true story of a man who thought he had it all, until methamphetamine destroyed the delicate house of cards he didn’t realize he was building. In addition to being based on true events, the book is an exploration of the rise of the meth epidemic in our country, offering some very interesting insight among the twists and turns of Braswell’s tumultuous past.In “Crazy Town,” the author provides a first-person account of his life up to the present. In short, he reconnects with and marries his childhood sweetheart, Lucille. As is often the case in relationships, Braswell is too busy seeing life through his rose-colored glasses to notice all of the glaring red flags in their relationship. Not to mention the fact that his ranch hand Clyde is operating a meth lab right on his property. Eventually, though, the author is forced to face the bitter reality that Lucille is an addict, and with her addiction comes all of the baggage associated with substance abuse. What follows is a devastatingly depressing account of the dissolution of Braswell’s marriage and his personal battle with his feelings for Lucille, as well as some rocky years spent in divorce court.At first, the way the book is organized seems to take away from the personal narrative Braswell is trying to give the reader. The chapters concerning his life seem significantly shorter than those relaying the development and evolution of meth use, and the reader is always left wanting more pieces of the puzzle. After getting a bit more in-depth, however, one can begin to see a direct correlation of the history of methamphetamine use to Braswell’s own story. For example, from the facts he unearthed pertaining to the development of at-home meth labs (a phenomenon with which our generation is now all too familiar), the reader is able to understand how over-the-counter medications came to be used in the homegrown meth operations around our country, and at about the same time the reader also is familiarized with the antics Clyde is up to on Braswell’s property.Braswell also points out some very interesting facts that he discovered in his research. Adolph Hitler, Jim Jones, Charles Manson and Andrew Cunanan (Gianni Versace’s murderer) were all amphetamine users in one way or another. While it’s true that all of these people were probably unstable to begin with, it cannot be ignored that the addition of amphetamine to an already volatile cocktail probably took their degree of violence to an entirely new level.“Crazy Town” is a startling look at how a drug can singlehandedly destroy a person and those who love him. Though depressing at times, this intimate glimpse into Braswell’s life allows the reader a new perspective on the meth crisis in today’s culture. His findings and the way in which he sums up the history of the problem also make it easier to understand how and why it is becoming an epidemic.",
  "genres": [
    "Memoir"
  ],
  "author": "Sterling R. Braswell",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/5677584-crazy-town"
}