{
  "title": "People Love Dead Jews: Reports from a Haunted Present",
  "description": "Renowned and beloved as a prizewinning novelist, Dara Horn has also been publishing penetrating essays since she was a teenager. Often asked by major publications to write on subjects related to Jewish culture—and increasingly in response to a recent wave of deadly antisemitic attacks—Horn was troubled to realize what all of these assignments had in common: she was being asked to write about dead Jews, never about living ones. In these essays, Horn reflects on subjects as far-flung as the international veneration of Anne Frank, the mythology that Jewish family names were changed at Ellis Island, the blockbuster traveling exhibition Auschwitz, the marketing of the Jewish history of Harbin, China, and the little-known life of the \"righteous Gentile\" Varian Fry. Throughout, she challenges us to confront the reasons why there might be so much fascination with Jewish deaths, and so little respect for Jewish lives unfolding in the present.Horn draws upon her travels, her research, and also her own family life—trying to explain Shakespeare’s Shylock to a curious ten-year-old, her anger when swastikas are drawn on desks in her children’s school, the profound perspective offered by traditional religious practice and study—to assert the vitality, complexity, and depth of Jewish life against an antisemitism that, far from being disarmed by the mantra of \"Never forget,\" is on the rise. As Horn explores the (not so) shocking attacks on the American Jewish community in recent years, she reveals the subtler dehumanization built into the public piety that surrounds the Jewish past—making the radical argument that the benign reverence we give to past horrors is itself a profound affront to human dignity.",
  "genres": [
    "Nonfiction",
    "Jewish",
    "History",
    "Essays",
    "Judaism",
    "Audiobook",
    "Religion"
  ],
  "author": "Dara Horn",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/56769532-people-love-dead-jews"
}