{
  "title": "Damaged Dreams",
  "description": "What price would you pay for the truth?“It all starts there.” Those were the last words my father spoke to me.When I was 16, everything seemed perfect. I had it all--loving parents, best friends, and a potential boyfriend. But most of all, I had skating, and we were one step away from the Olympics.Until they came for me, and secrets and betrayal rip my world apart. With everything crashing down around me, I’m isolated and broken and I find myself running for my life.At 21, I find my way to The Aldridge School. A place where futures, dreams, and careers are made or broken. Skating was what brought me here, but I'm in search of so much more.I wasn't expecting to meet people I could trust, much less connect with the six guys who enter my life. Finding my way back to myself, I'm learning that I don't always have to hide.Searching for answers will lead me to discoveries that I'm not ready to hear. Each layer I uncover terrifies me more, and I find myself back in danger. Opposing forces each have a purpose for me: to be used or broken. I'm not sure which was worse.Will my dreams be damaged again? Can I get my justice without losing myself?Happiness was within my grasp. I just need to be alive to enjoy it—piece of cake.Grab this Contemporary Sports Reverse Harem today!***As of April 2022, the interior has been updated and re-edited. This is a why choose romance meaning the FMC will end up with three or more love interests. There is no cheating, and the final book will end in a HEA. There are three books in the series, and books 1 and 2 will end in cliffhangers. This series is a NA medium-high burn with MM, MFM, and MFMM meant for 18+ readers. Some themes may be triggering for some readers in regards to sexual abuse with more specific triggers listed in the foreward. ***",
  "genres": [
    "Reverse Harem",
    "Sports",
    "Contemporary",
    "M M Romance",
    "Romance",
    "Sports Romance",
    "Dark"
  ],
  "author": "Kris  Butler",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/56769821-damaged-dreams"
}