{
  "title": "Preserving Chili Peppers",
  "description": "You've worked hard to build your chili pepper garden. You've toiled all spring to properly prepare the soil and plant the seeds. You've nourished your peppers through the summer strain and you've enjoyed the bounty of your efforts. You've eaten chili pepper after chili pepper, incorporated them into countless recipes. And you still have more!Now what?It's time to preserve those chili peppers before they go bad. If you don't preserve your peppers, that is exactly what will happen, and you won't be able to enjoy them through the winter cold. We're here to help you. This book includes:* Pressure Canning Chili Peppers* Pickling Chili Peppers * Freezing Chili Peppers * Drying Chili Peppers * Smoking Chili Peppers * Chili Pepper Jam * Making Hot Sauce * Interviews with Preserving Professionals \"Preserving is a great way to extend the storage life of your chili peppers in a variety of tasty ways, enabling you to enjoy them all year long. You can also have the pleasure of sharing your homemade preserves with family and friends. If you have been blessed with an abundant chili pepper harvest or have access to locally-grown peppers, this book is a great resource for deliciously preserving your peppers for future use.\"Linda J. Amendt, Award-winning cookbook author and home preserver \"As a nutritionist, I recommend the great recipes in Preserving Chili Peppers as a way of bringing these hot and delicious gems to your healthy lifestyle. Preserving peppers is a great way to eat and share these freshly grown wonders year round. They are high in antioxidants, immunity and metabolism boosting qualities and when preserved with herbs and spices are a great step towards a nutritious lifestyle. Thank you, Chili Pepper Madness!\"Lisa C. Cohn, Nutrition Expert, Owner, Park Avenue Nutrition, New York",
  "genres": [],
  "author": "Michael J. Hultquist",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/12725460-preserving-chili-peppers"
}