{
  "title": "Lust: Kinky Online Personal Ads",
  "description": "Ellen Forney's follow-up to her wildly successful I Love Led Zeppelin is a collection of cartoons celebrating the sometimes stunningly crude, sometimes surprisingly sweet online world of personal classifieds. Forney has for several years been illustrating the Seattle alt-weekly The Stranger's \"Lustlab\" classified ads by interpreting the most interesting, outrageous, or idiosyncratic ad in that week's paper, that is awarded the appellation \"Lustlab Ad of the Week.\" \"Lustlab\" is the category encompassing the kinkiest personal ads in the paper, and every week the page attracts Seattle's finest lovers, kinksters, perverts, and the perv-curious, and each week, Forney chooses one ad, edits the text, and creates a comic combining that text and imagery. She uses her brushwork in many different styles bold and graphic, fine and detailed, cartoony, or elegant, depending on the tone of the ad. She uses a variety of resource materials for inspiration, from early erotic photography to Tom of Finland to Wacky Packages-style send-ups of consumer products to original designs. Exhibitionists, voyeurs, threesomes, moresomes, tops, bottoms, switches, rope-lovers, spankers, spankees, bi-curious men, bi-curious women, lesbians with prison fantasies, masturbation clubs Forney illustrates them all in her bemused, affectionate, witty, and elegant style. In addition to the text and illustrations, the author embarked upon the rare journalistic feat of interviewing six enthusiastic Lustlab subscribers, who provide background, context, and hilarity (intentional and unintentional) by discussing their participation in the Lustlab network and their lusty experiences with the lovers for whom they advertised. Thrill to their outr sexual quests Live vicariously through their sexual adventuring To cap it off, the collection includes an introduction by the notorious sex advice columnist and novelist (and Stranger editor), Dan Savage. You'll meet (and love): The female-to-male transsexual boot-loving Germanophile The trashy fat redneck man seeking same, preferably with months-old B.O. The erotic hypnotist's offer to give women mind-blowing \"joy-buttons\" The smartass bisexual nerdy-girl rope-lover The obedient transvestite who wants to clean women's toilets The man organizing a private strip poker game for gay men The butch dyke seeking a femme for erotic medieval reenactments Three women friends seeking a male \"service bottom\" The woman who wants to watch a very fat woman on the toilet The male-to-female blonde transsexual who wants \"airhead\" lessons The man who wants to be humped in public by someone in an animal costume The woman who wants to try \"pegging\" for the first time. Exhibitionists, voyeurs, threesomes, moresomes, tops, bottoms, switches, rope-lovers, spankers, spankees, bi-curious men, bi-curious women, lesbians with prison fantasies, jack-off clubs Forney illustrates them all in her bemused, affectionate, witty, and elegant style.",
  "genres": [
    "Graphic Novels",
    "Nonfiction",
    "Comics",
    "Sexuality",
    "Humor",
    "Art",
    "Graphic Novels Comics"
  ],
  "author": "Ellen Forney",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1028640.Lust"
}