{
  "title": "Ghosts Can Bleed",
  "description": "Alien landscapes and mythic societies...creatures of the night and the more terrifying monsters of the human psyche... Be warned: Ghosts Can Bleed... but it's not just the blood you should be worried about... Last Chance To See - what if you had a chance to attend your own funeral? A reincarnation facility offers this opportunity, but you won't be quite as your family remembered... House Arrest - Angela misses the social event of the year when she realises that there's no place like home- and no dietary aid in the world like it, dahlings! Baptism - Brother Tomas is the fourth friar to visit the island of Koreka with a holy mission: to save the immortal souls of the mermaids who live there. But the mermaids have an unholy baptism of their own to offer... Killing A Goddess - The Goddess demands a sacrifice, and Laura is a willing volunteer. It is a great honour for the five young men chosen to assist in the ritual. But do they really know what they are letting themselves in for? Ghosts Can Bleed - Maurice knows, because he is one... DreamCatcher - will prevent bad dreams coming through to you. But what do you do with the nightmares that are caught in it? What if you could return them to their owners? Rush Hour - Virgil retreads Dante's Inferno, twenty-first century style. Wasps, tornadoes and dirty nappies block his path - and that's before the motorway... Marked - being scarred by lightning is like being touched by the hand of God. This divine spark is essential, because only the Marked can see the creatures that hunger for us... Blue Screen of Death - Sara's dead. Again. With Heaven's computer system failing, and God on holiday, it'll take a genius hacker to fix it. Problem is, he's not on Heaven's database... Diagnosis - all aspects of human health can be scientifically measured, analysed and assessed. But there's one measure Dr Chad has neglected to notice... By turns terrifying, darkly comic, surreal and stomach-churning, these forty one stories and poems from award-winning author Tracie McBride open the veins of the world to show humanity in a different - and much darker - light.",
  "genres": [
    "Horror",
    "Short Stories"
  ],
  "author": "Tracie McBride",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/12726547-ghosts-can-bleed"
}