{
  "title": "Monadology and Other Philosophical Essays",
  "description": "Monadologie is one of Gottfried Leibniz’ works that best define his philosophy, monadism. Written toward the end of his life in order to support a metaphysics of simple substances, it's thus about formal atoms which aren't physical but metaphysical.The Monadology is written in 90 logical paragraphs, each generally following from the previous. Its name is due to the fact that Leibniz, imitating Marsilio Ficino, Giordano Bruno & Viscountess Anne Conway, wanted to keep together the meanings of monas (Greek, unity) & logos (treatise/science/word/reason). Therefore, the Monadology came to be the science of the unity.The text is dialectically reasoned, facing questions & problems helping readers to advance. For instance, it can be accepted that composed bodies are something derived, extended, phenomenal or repeated according to simple substances (later expressed by Kant's phenomena-noumena dichotomy). Is the soul a monad? If affirmative, then the soul is a simple substance. If it's an aggregate of matter, then it cannot be a monad.Leibniz, 1st using the term in 1696, ties almost all ancient & early modern meanings of \"monad\" together in his metaphysical hypothesis of infinitely many simple substances. Monads are everywhere in matter & are either noticeably active (awake), when they form the central or governing monad, which is the center of activity & of perception within an organism, or they are only weakly active (asleep), when they belong to the countless subordinate monads w/in or outside of an organic body. Monads are the sources of any spontaneous action unexplainable in mechanical terms. They constitute the unity of any individual. All monads are living mirrors representing the whole universe, because of the lack of any vacuum they have an irrecognizably obscure recognition of every body in the world; & they appetite, which means they strive from one perception to the next. Nevertheless all monads differ in the degree of clarity & distinction with which they perceive the surrounding world according to the organic body in which they're incorporated. The most fundamental level in the hierarchy of monads are the entelechies, which are genuine centers of a non-physical force, namely a spontaneous activity in organisms. If these centers are capable of sentiment & memory, as in animals, they're called souls. The highest level of monads are souls endowed with reason, or spirits, reflectively self-conscious.Leibniz characterizes monads as metaphysical points, animate points or metaphysical atoms. In contrast to those physical atoms postulated by classic atomism they aren't extended & thus aren't bodies. As he explains in letters to Burchard de Volder & Bartholomew des Bosses, this doesn't imply that monads are immaterial. They rather consist of two inseparable principles constituting together a complete substance or monad: the innermost center of a monad, i.e. the mathematical point, where the entelechy, soul or spirit is located, is the monad's inner form. This form has no existence in itself, but is incarnated in a physical point or an infinitesimally small sphere, the \"vehicle of the soul\". This hull consists of a special matter, called primary matter (materia prima-matière primitive).The problem that monads are supposed to have some kind of matter on the one hand, but to have neither any parts nor extension on the other, may be explained by the dynamic nature of primary matter. Leibniz conceives primary matter in contrast to the 2nd matter (materia secunda), i.e. extended & purely phenomenal bodies. Primary matter is a very fine, fluid & elastic matter, which he identifies in his early \"Hypothesis physica nova\" (1671) with aether, spiritus or matter of light, flowing anywhere thru every body. Strictly taken, this primary matter or matter of light doesn't consist in \"extension, but in the desire to extension\": \"The nature of light strives to extend itself\".The animate centre of a monad cannot exist w/out the encasing coating fluid of light, because 1stly monads w/out this passive principle couldn't perceive any impressions from the exterior world, & because 2ndly they'd have no limitation of power. \"It follows that God can never strip any created substance bare of its primary matter, even tho by his absolute power he can take off her 2ndary matter; otherwise he would make it become pure activity, which can only be himself.\" Only God is free from any matter, he's the creating 1st monad, out of which all created monads derive by continuous effulgurations. The punch-line of the monad or metaphysical point is its dynamical unity of the mathematical centre & the encasing physical point: The fluid ethereal sphere of the monad is extended, has parts & can be destroyed, but in every deformation or division of the sphere the mathematical point in which the soul is incarnated shall outlive within the smallest remaining fluid. Indestructible therefore isn't the whole sphere consisting in matter of light, but only the dynamic point within the monad.Leibniz understands monads as the intellectual answer to the mind-body problem, radically exposed by Descartes. Because he conceives soul (not the monad) as an immaterial centre, he denies any direct interaction or physical influence (influxus physicus) between body & soul. He allocates the causal connection between both w/in the monad, because its fluid ethereal matter is the substantial bond (vinculum substantiale) between body & mind. The circulation of the aether or matter of light thru visible worldly bodies is the preestablished divine artifice, which constitutes the exact correspondence & harmony between the perceptions of the soul & the bodies' movements. Preestablished harmony doesn't only govern the relation between body & soul, but also between monads.According to Leibniz’ slogan, monads have \"no windows\" or portals, thru which something could enter from the outside or could escape from the inside since the monad's center in which the soul is incarnated is always encased by its own primary matter. Despite that, the monad represents in a spontaneous act the surrounding world with an individual perspective, constituted by its punctual structure of centre, radius & circumference.The Monadology tried to put an end from a monist point of view to the main question of what is reality & particularly to the problem of communication of substances, both studied by Descartes. Leibniz offered a new solution to mind/matter interaction by means of a preestablished harmony expressed as the Best of all possible worlds form of optimism; in other words, he drew the relationship between “the kingdom of final causes”, or teleological ones, & “the kingdom of efficient causes”, or mechanical ones, which wasn't causal, but synchronous. Monads & matter are only apparently linked. There isn't even any communication between different monads, as far as they act according to their degree of distinction only, as they were influenced by bodies & vice versa.Leibniz fought against Cartesian dualism in his Monadology & tried to surpass it thru a metaphysical system considered at the same time monist (since only the unextended is substantial) & pluralist (as substances are disseminated in the world in infinite number). For that reason the monad is an irreducible force, which makes it possible for the bodies to have the characteristics of inertia & impenetrability, & which contains in itself the source of all its actions. Monads are the 1st elements of every composed thing.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Essays",
    "18th Century",
    "Metaphysics"
  ],
  "author": "Gottfried Wilhelm von Leibniz",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/567882.Monadology_and_Other_Philosophical_Essays"
}