{
  "title": "Pretty Poison",
  "description": "Redemption seeker. Chameleon. Damaged heart.By day, Rocky Jacobs is a private investigator. By night, he produces Sinister in Savannah, a true-crime podcast, with his two best friends. Rocky’s life revolves around three principles: possessing skill is better than having luck, a man’s reputation is everything, and there’s no sacrifice too great for those you love.Is Tess Hamilton pretty poison or just unlucky in love?That’s the question the trio of trouble will try to uncover. This investigation strikes a little too close to home for one of them. Tess, a woman accused of killing her three husbands, has been tried and convicted in the media, something Rocky knows all too well. When their investigation turns up nothing but dead ends, Rocky will keep digging. Is it because he believes in her innocence? Or does Rocky hope to find redemption for himself by achieving it for Tess?A stagnant case turns out to be the least of his problems.What happens in Vegas never truly stays stay there. For fifteen months, Rocky has been running from a tragedy that shattered his life and countless others. The most painful casualty was the destruction of his marriage to Asher Dunleavy. When the sexy federal marshal turns up in Savannah, Rocky is reminded of his greatest love and deepest regret. Every minute spent in Asher’s presence makes him yearn for the life they lost. Will Rocky drown in the sorrows of what might’ve been or fight for what could be?Sinister in Savannah series is a fictional podcast exploring the city’s most nefarious crimes with Southern-fried snark. The books explore friendship, love, loss, and the irrepressible human spirit. Pretty Poison is book three of three. While each novel is written about a different couple, the series should be read in order due to continuing storylines. Sinister in Savannah is an LGBT romantic suspense series with mature language and sexual content intended for adults eighteen and older.Trigger warning: the main character struggles with PTSD resulting from an investigation involving a murder-suicide. While the content is not overly graphic, it could still cause emotional harm to some readers. One of Rocky’s side effects is anxiety, which may trigger similar reactions in those battling the disorder. As with the murder-suicide scene, I avoided being too graphic with his attacks.",
  "genres": [
    "M M Romance",
    "Romance",
    "Mystery",
    "Contemporary",
    "Crime",
    "Second Chance",
    "Audiobook"
  ],
  "author": "Aimee Nicole Walker",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/56795402-pretty-poison"
}