{
  "title": "The Necromancer's Dance",
  "description": "alternate cover edition of ASIN B01C8VW8GCThe bestselling international hit begins with The Necromancer's Dance...In a world where magic is real and evil walks amongst humanity, a young sorcerer is beset upon by enemies, both old and new.Angelus Salvatore is the only necromancer in all of Boston, and his name is whispered warily by the undead and fellow sorcerers alike. He and his brother Isaac are the lone survivors of an attack by an army of the undead, in which Angel used a spell so powerful it forever marked his place in history. Now, years later, Angel struggles to balance his career as a teacher of the higher magical arts, his role as big brother, and a tenuous relationship with an Elder vampire from the local clan. When his brother's boyfriend is used as a pawn in a mysterious plot to draw Angel out, Angel is once again drawn back into the old hostilities that fueled the Blood Wars and led to his family's death.Leaning on others for help is something Angel cannot do, and while he searches for clues into who may be targeting him and his brother, Angel finds his heart steadily growing occupied with Simeon, Elder and vampire. Dealing with death magic and vampires on a daily basis may leave Angel jaded when it comes to life and staying that way, but the more time he spends fending off the ancient vampire's attention and affections, the more he realizes he wants to give in.Can Angel find out who wants him dead, and keep his heart safe in the process? How can he fall for a vampire, when his whole family was torn apart by an army of the undead?Death stalks the streets of Boston's historic Beacon Hill....and there is no one more suited to battle against death than a necromancer.This is the first book in The Beacon Hill Sorcerer series. This series is best enjoyed in order. Content Advisories are on the Copyright page and can be seen by using the Look Inside feature or by downloading a sample of this book.",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Fantasy",
    "Vampires",
    "Romance",
    "Magic",
    "Urban Fantasy"
  ],
  "author": "S.J. Himes",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/56804771-the-necromancer-s-dance"
}