{
  "title": "The Battle of Midway",
  "description": "There are few moments in military history in which the course of events tipped so suddenly and so dramatically as at the Battle of Midway. At dawn of June 4, 1942, a rampaging Japanese navy ruled the Pacific. By sunset, their vaunted carrier force (the Kido Butai) had been sunk by American planes. Though the Second World War had three more years to run, the Imperial Japanese Navy would never again initiate a strategic offensive.In this spellbinding account of a key turning point, one of America’s leading naval historians, Craig L. Symonds, paints a portrait of ingenuity, courage, sacrifice, and chance. Symonds begins with the arrival of Admiral Chester A. Nimitz at Pearl Harbor after the devastating Japanese attack, and describes the events leading to the climactic battle, including both Coral Sea—the first in history involving opposing carrier forces—and Jimmy Doolittle’s daring raid of Tokyo. He focuses throughout on the people involved, offering telling portraits of Admirals Nimitz, King, Halsey, and Spruance as well as the leading Japanese figures, including the poker-enthusiast Admiral Yamamoto Isoroku and Admiral Nagumo Chuichi. Indeed, Symonds illuminates the aspects of Japanese culture—such as their single-minded devotion to combat, which led to poorly armored planes and inadequate fire-safety measures on their ships—that contributed to their defeat.Symonds’ account of the battle itself is deft and exhaustive, weaving together the many disparate threads of attack—attacks that failed in the early going—that ultimately created a five-minute window in which three of the four Japanese carriers were mortally wounded, changing the course of the Pacific war in an eye-blink.The American victory at Midway was both less incredible and miraculous than it has sometimes been portrayed. It was, instead, the result of a web of contingencies and decisions than can be traced back to their origins and reconnected. As Symonds’ book brilliantly demonstrates, doing so detracts nothing from the battle’s significance and drama, nor loosens its enduring hold on our imaginations.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military History",
    "War",
    "Military Fiction",
    "Naval History"
  ],
  "author": "Craig L. Symonds",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/56796342-the-battle-of-midway"
}