{
  "title": "Little Pieces of Me",
  "description": "Following her acclaimed debut novel, You and Me and Us, Alison Hammer offers a deeply moving story of family and identity. When a DNA test reveals a long-buried secret, a woman must look to the past to understand her mother and herself.  When Paige Meyer gets an email from a DNA testing website announcing that her father is a man she never met, she is convinced there must be a mistake. But as she digs deeper into her mother’s past and her own feelings of being the odd child out growing up, Paige begins to question everything she thought she knew. Could this be why Paige never felt like she fit in her family, and why her mother always seemed to keep her at an arm’s length? And what does it mean for Paige’s memories of her father, a man she idolized and whose death she is still grieving? Back in 1975, Betsy Kaplan, Paige’s mom, is a straightlaced sophomore at the University of Kansas. When her sweet but boring boyfriend disappoints her, Betsy decides she wants more out of life, and is tired of playing it safe. Enter Andy Abrams, the golden boy on campus with a potentially devastating secret. After their night together has unexpected consequences, Betsy is determined to bury the truth and rebuild a stable life for her unborn child, whatever the cost.When Paige can’t get answers from her mother, she goes looking for the only other person who was there that night. The more she learns about what happened, the more she sees her unflappable, distant mother as a real person faced with an impossible choice. But will it be enough to mend their broken relationship?Told in dual timelines, Little Pieces of Me examines identity and how the way we define ourselves changes (or not) through our life experiences.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Chick Lit",
    "Mystery",
    "Family",
    "Womens Fiction",
    "Adult Fiction"
  ],
  "author": "Alison Hammer",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/56827248-little-pieces-of-me"
}