{
  "title": "The Goat Sleeps in the Kitchen: The True Story of an Amazing Woman; Maria Insalaco Reina",
  "description": "A historical novel based on a true story about an amazing early twentieth-century woman. She stood out in a crowd of friends and relatives from Casteltermini, a small town in central Sicily. Her story sheds light on a little-known segment of a twentieth-century diaspora, a mass-exodus from Europe by some \"huddled masses yearning to be free.\" This oppressed group fled the dire poverty of Sicily and southern Italy to endure a subsistence lifestyle bestowed by the owners of the coal mining industry and early American factories. She was surrounded by a clan of families. They were determined to achieve a better lifestyle through sheer hard work, struggling to overcome hardships and failures on the journey to success. They came with barely the clothes on their back. Eager for work, they spoke no English and were willing to do what the average, better-educated American refused to do. This amazing woman, Maria, was married to a lackluster, strong-tempered, tough, fearless, uneducated man who never worked a steady job his entire life. She endured a series of traumas---miscarriages and still births, each time berated by her husband for not delivering a healthy child. Starting at age twelve and until she died, her immediate family was her life. Maria passed her work ethic, her entrepreneurial skills, and her determination to get ahead to her children. Her legacy lives on in the succeeding generation of the clan who were better educated and became doctors, dentists, pharmacists, accountants, attorneys, and professors. Some became entrepreneurs like Maria, owning small and large businesses. There was one common they inherited the hard work ethic and generosity from their parents. The story begins in 1915.",
  "genres": [],
  "author": "Joe Reina",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/56818226-the-goat-sleeps-in-the-kitchen"
}