{
  "title": "The Honeys",
  "description": "\"Pure horror gold.\" - Booklist STARRED review\"Tantalizing and memorable.\" - Publisher's Weekly STARRED review\"A sparkling and powerful exploration of grief, gender roles, and escaping the strong grip of expectations, this is a must-purchase for all libraries serving teens. \" - School Library Journal STARRED review\"As rich and complex as dark amber honey.\" - KirkusFrom Ryan La Sala, the wildly popular author of Reverie, comes a twisted and tantalizing horror novel set amidst the bucolic splendor of a secluded summer retreat.Mars has always been the lesser twin, the shadow to his sister Caroline's radiance. But when Caroline dies under horrific circumstances, Mars is propelled to learn all he can about his once-inseparable sister who'd grown tragically distant.Mars's genderfluidity means he's often excluded from the traditions -- and expectations -- of his politically connected family. This includes attendance at the prestigious Aspen Conservancy Summer Academy where his sister poured so much of her time. But with his grief still fresh, he insists on attending in her place.What Mars finds is a bucolic fairytale not meant for him. Folksy charm and sun-drenched festivities camouflage old-fashioned gender roles and a toxic preparatory rigor. Mars seeks out his sister's old friends: a group of girls dubbed the Honeys, named for the beehives they maintain behind their cabin. They are beautiful and terrifying -- and Mars is certain they're connected to Caroline's death.But the longer he stays at Aspen, the more the sweet mountain breezes give way to hints of decay. Mars’s memories begin to falter, bleached beneath the relentless summer sun. Something is hunting him in broad daylight, toying with his mind. If Mars can't find it soon, it will eat him alive.",
  "genres": [
    "Horror",
    "Young Adult",
    "LGBT",
    "Mystery",
    "Queer",
    "Audiobook",
    "Thriller"
  ],
  "author": "Ryan La Sala",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/56817848-the-honeys"
}