{
  "title": "You Are Your Best Thing: Vulnerability, Shame Resilience, and the Black Experience",
  "description": "Tarana Burke and Dr. Brené Brown bring together a dynamic group of Black writers, organisers, artists, academics and cultural figures to discuss the topics the two have dedicated their lives to understanding and teaching: vulnerability and shame resilience.Contributions by Kiese Laymon, Imani Perry, Laverne Cox, Jason Reynolds, Austin Channing Brown, and more.It started as a text between two friends.Tarana Burke, founder of the 'me too.' Movement, texted researcher and writer Brené Brown to see if she was free to jump on a call. Brené assumed that Tarana wanted to talk about wallpaper. They had been trading home decorating inspiration boards in their last text conversation so Brené started scrolling to find her latest Pinterest pictures when the phone rang.But it was immediately clear to Brené that the conversation wasn't going to be about wallpaper. Tarana's hello was serious and she hesitated for a bit before saying, \"Brené, you know your work affected me so deeply, but as a Black woman, I've sometimes had to feel like I have to contort myself to fit into some of your words. The core of it rings so true for me, but the application has been harder.\"Brené replied, \"I'm so glad we're talking about this. It makes sense to me. Especially in terms of vulnerability. How do you take the armour off in a country where you're not physically or emotionally safe?\"Long pause.\"That's why I'm calling,\" said Tarana. \"What do you think about working together on a book about the Black experience with vulnerability and shame resilience?\"There was no hesitation.Burke and Brown are the perfect pair to usher in this stark, potent collection of essays on Black shame and healing. Along with the anthology contributors, they create a space to recognise and process the trauma of white supremacy, a space to be vulnerable and affirm the fullness of Black love and Black life.",
  "genres": [
    "Nonfiction",
    "Race",
    "Essays",
    "Audiobook",
    "Psychology",
    "Social Justice",
    "Memoir"
  ],
  "author": "Tarana Burke",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/56808517-you-are-your-best-thing"
}