{
  "title": "Colorization: One Hundred Years of Black Films in a White World",
  "description": "A NEW YORK TIMES CRITICS' TOP BOOK OF THE YEAR • BOOKLISTS' EDITOR'S CHOICE • ONE OF NPR'S BEST BOOK OF THE YEAR“At once a film book, a history book, and a civil rights book.… Without a doubt, not only the very best film book [but] also one of the best books of the year in any genre. An absolutely essential read.” — ShondalandThis unprecedented history of Black cinema examines 100 years of Black movies—from Gone with the Wind to Blaxploitation films to Black Panther —using the struggles and triumphs of the artists, and the films themselves, as a prism to explore Black culture, civil rights, and racism in America. From the acclaimed author of The Butler and Showdown .Beginning in 1915 with D. W. Griffith's The Birth of a Nation— which glorified the Ku Klux Klan and became Hollywood's first blockbuster—Wil Haygood gives us an incisive, fascinating, little-known history, spanning more than a century, of Black artists in the film business, on-screen and behind the scenes. He makes clear the effects of changing social realities and events on the business of making movies and on what was represented on the from Jim Crow and segregation to white flight and interracial relationships, from the assassination of Malcolm X, to the O. J. Simpson trial, to the Black Lives Matter movement. He considers the films themselves—including Imitation of Life, Gone with the Wind, Porgy and Bess, the Blaxploitation films of the seventies, Do The Right Thing, 12 Years a Slave, and Black Panther . And he brings to new light the careers and significance of a wide range of historic and contemporary Hattie McDaniel, Sidney Poitier, Berry Gordy, Alex Haley, Spike Lee, Billy Dee Willliams, Richard Pryor, Halle Berry, Ava DuVernay, and Jordan Peele, among many others. An important, timely book, Colorization gives us both an unprecedented history of Black cinema and a groundbreaking perspective on racism in modern America.",
  "genres": [
    "Nonfiction",
    "History",
    "Film",
    "Media Tie In",
    "Race",
    "Art",
    "Cultural"
  ],
  "author": "Wil Haygood",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/56845581-colorization"
}