{
  "title": "The Fox Wife",
  "description": "Some people think foxes are similar to ghosts because we go around collecting qi, but nothing could be further than the truth. We are living creatures, just like you, only usually better looking . . .Manchuria, 1908.In the last years of the dying Qing Empire, a courtesan is found frozen in a doorway. Her death is clouded by rumors of foxes, which are believed to lure people by transforming themselves into beautiful women and handsome men. Bao, a detective with an uncanny ability to sniff out the truth, is hired to uncover the dead woman’s identity. Since childhood, Bao has been intrigued by the fox gods, yet they’ve remained tantalizingly out of reach—until, perhaps, now.Meanwhile, a family who owns a famous Chinese medicine shop can cure ailments but can’t escape the curse that afflicts them—their eldest sons die before their twenty-fourth birthdays. When a disruptively winsome servant named Snow enters their household, the family’s luck seems to change—or does it?Snow is a creature of many secrets, but most of all she’s a mother seeking vengeance for her lost child. Hunting a murderer, she will follow the trail from northern China to Japan, while Bao follows doggedly behind. Navigating the myths and misconceptions of fox spirits, both Snow and Bao will encounter old friends and new foes, even as more deaths occur.New York Times bestselling author Yangsze Choo brilliantly explores a world of mortals and spirits, humans and beasts, and their dazzling intersection. Epic in scope and full of singular, unforgettable characters, The Fox Wife is a stunning novel about old loves and second chances, the depths of maternal love, and ancient folktales that may very well be true.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Mythology",
    "Historical",
    "Magical Realism"
  ],
  "author": "Yangsze Choo",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/127278666-the-fox-wife"
}