{
  "title": "My Favorite Band: The Complete Series Boxed Set",
  "description": "A collection of six full-length, standalone, #1 bestselling rock star romances plus bonus material. Meet My Favorite Band and join the steamy ride as six rock stars navigate fame and love in over 2,000 pages of laughter, angst, and emotions.Included in this collection:BOOK 1: TAKE MY HEART (a rock star rom com)The last thing lead singer Dax Hunter wants when his manager signs him up for a celebrity reality dating show is to find love. It looks like he's about to find it anyway...but with who?BOOK 2: THE BENEFITS OF BAD DECISIONS (a forbidden rock star romance)Drummer Brody Jensen falls for back-up dancer Zoey, but mistakes from the past come back to haunt them. Can they overcome it?BOOK 3: WAKING UP MARRIED (a rock star rom com)Lead guitarist Adam Wilson finds himself married the morning after a pretty crazy night in Vegas...to his little sister's best friend. And now his manager wants them to stay married for publicity. It'll only last six months, though...right?BOOK 4: DRIVING ME CRAZY (a rock star rom com)Keyboardist Will \"Rascal\" Rascowicz finds himself falling for his best friend's little sister until they get into a massive fight and break up. But now they're obligated to take a road trip together...and they have to pretend to be in love. Can they pull it off for the cameras capturing their every move?BOOK 5: IT'S ONLY TEMPORARY (a rock star love triangle)Bassist Kane Keller finds himself in the middle of a love triangle. Does he stay with the woman who has been by his side through his entire rise to fame, or does he take a risk on the songstress who can't stop flirting with him?BOOK 6: THE REPLACEMENT WAR (a rock star rom com)When Gage and Lexi meet at the hotel bar, fireworks explode. They spend a hot weekend together, and then they part ways...only to meet up again a few hours later in the biggest competition of their lives. Who will win the open spot in one of the biggest bands in the world?Plus bonus material including a brand-new epilogue!",
  "genres": [],
  "author": "Lisa Suzanne",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/56863043-my-favorite-band"
}