{
  "title": "Receiving Love: Transform Your Relationship by Letting Yourself Be Loved",
  "description": "This groundbreaking book from the best-selling authors of Getting the Love You Want and coauthors of Giving the Love that Heals is the first to address the biggest unexplored issue facing couples today: Most of us are better at giving love than accepting it. We don't realize all the ways that our resistance to appreciation, praise, compliments, and accepting help from others hurts us and cripples our relationships.  Many partners learn how to give love, but many more undermine their relationships by for-getting something that is equally important -- learning to receive it. According to the authors, the root of the problem is the self-rejection that began in childhood, when our parents and caretakers unintentionally failed to nurture or directly rejected traits, characteristics, or im-pulses when we were children. We end up rejecting in ourselves whatever our caretakers ignored or rejected in the course of our childhoods. When we become adults, this makes it impossible to let in the love we want and need, even when our partners offer it. As a result, we dismiss compliments, minimize gestures of affection, and create obstacles to true intimacy.  In this book, Harville Hendrix and Helen LaKelly Hunt, co-creators of Imago Relation-ship Therapy, offer a definitive guide to breaking the shackles of self-rejection and embracing the love our partners offer. Receiving Love is a very personal book for Drs. Hendrix and Hunt, and much of their own journey is the inspiration for it.  Drawing on their renowned expertise, the wide clinical experience of hundreds of Imago therapists, and their own personal experience, the authors are able to offer detailed guidance on how to conquer the problems that come from self-rejection and embrace the gifts that are abundant in every person's life, if only we knew how to accept them. With its groundbreaking theory, challenging processes, and inspiring examples, this book holds the key to loving relationships that last.",
  "genres": [
    "Relationships",
    "Self Help",
    "Psychology",
    "Nonfiction",
    "Love",
    "Marriage",
    "Personal Development"
  ],
  "author": "Harville Hendrix",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/568437.Receiving_Love"
}