{
  "title": "The Money Book for the Young, Fabulous & Broke",
  "description": "The Money Book for the Young, Fabulous & Broke is financial expert Suze Orman's answer to a generation's cry for help. They're called \"Generation Debt\" and \"Generation Broke\" by the media -- people in their twenties and thirties who graduate college with a mountain of student loan debt and are stuck with one of the weakest job markets in recent history. The goals of their parents' generation -- buy a house, support a family, send kids to college, retire in style -- seem absurdly, depressingly out of reach. They live off their credit cards, may or may not have health insurance, and come up so far short at the end of the month that the idea of saving money is a joke. This generation has it tough, without a doubt, but they're also painfully aware of the urgent need to take matters into their own hands.The Money Book was written to address the specific financial reality that faces young people today and offers a set of real, not impossible, solutions to the problems at hand and the problems ahead. Concisely, pragmatically, and without a whiff of condescension, Suze Orman tells her young, fabulous & broke readers precisely what actions to take and why. Throughout these pages, there are icons that direct readers to a special YF&B domain on Suze's website that offers more specialized information, forms, and interactive tools that further customize the information in the book. Her advice at times bucks conventional wisdom (did she just say use your credit card?) and may even seem counterintuitive (pay into a retirement fund even though your credit card debt is killing you?), but it's her honesty, understanding, and uncanny ability to anticipate the needs of her readers that has made her the most trusted financial expert of her day.Over the course of ten chapters that can be consulted methodically, step-by-step, or on a strictly need-to-know basis, Suze takes the reader past broke to a secure place where they'll never have to worry about revisiting broke again. And she begins the journey with a bit of overwhelmingly good news (yes, there really is good news): Young people have the greatest asset of all on their side -- time.",
  "genres": [
    "Nonfiction",
    "Finance",
    "Personal Finance",
    "Money",
    "Self Help",
    "Business",
    "Personal Development"
  ],
  "author": "Suze Orman",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/127277.The_Money_Book_for_the_Young_Fabulous_Broke"
}