{
  "title": "Dan Brown 4-Book Boxset: Digital Fortress / Angel & Demons / Deception Point / The da Vinci Code",
  "description": "More about Robert Langdon﻿ Professor Robert Langdon, the brainchild of bestselling author Dan Brown, serves as the main fictional character in the Robert Langdon book series. Langdon is a Harvard University professor of history of art and \"symbology\", a fictional field related to the study of historic symbols, although it’s not essentially related to the actual discipline of semiotics. According to author Dan Brown, Robert Langdon is the fictional alter ego he wishes he could have been. Born on June 22, 1964 in Exeter, New Hampshire, the same date and place that Brown was born, the fictional character attended Phillips Exeter Academy, same school as Brown, and Princeton University on course to becoming an accomplished scholar. According to Brown, Langdon actually looks like Harrison Ford; often wearing a turtleneck, Harris Tweed jacket, khakis, and collegiate cordovan loafers. He drives an automatic Saab 900S, and still wears a Mickey Mouse watch which he received as a gift from his parents on his ninth birthday. When he was seven years old, Langdon fell into a well and got trapped there overnight; something that gave rise to his claustrophobia which he suffers from. Peter Solomon, the Secretary of the Smithsonian Institution, is his mentor and father figure. His father however died when Langdon was twelve. An incredibly gifted problem solver with a photographic memory, the symbologist is summoned to help assist with investigations regarding the death of CERN's most renowned physicist in Angels & Demons, before being summoned to decipher another bizarre symbol in The Da Vinci Code. Robert is thrown into another riddle when his dearest friend and father figure Peter Solomon, is kidnapped in The Lost Symbol. He then goes toe to toe with a man determined to end the world in the Inferno, before embarking on a mission to locate cryptic password that will unlock the secret by one of his former students in Origin.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Dan    Brown",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/56838.Dan_Brown_4_Book_Boxset"
}