{
  "title": "They Called Him Marvin",
  "description": "I sit here with tears in my eyes, trying to compose myself enough to write a coherent review. I've read more books on WWII than I can count - historical fiction, fictionalized accounts, textbooks, you name it - but not one has moved me as much as this one. DonnaThey were just kids, barely not teenagers, madly in love and wanting to be a family, but WW2 and a B29 got in their way. Three hundred ten days before Pearl Harbor, buck private Dean Sherman innocently went to church with a new friend in Salt Lake City. From that moment, the unsuspecting soldier travelled a remarkable, heroic path, falling in love, earning his wings to become a B29 pilot, conceiving a son and entering WW2 in the China, Burma and India Theater.He chronicled his story with letters home to his bride Connie that he met on that fateful Sunday, blind to the fact that fifteen hundred seventy-five days after their meeting, a Japanese swordsman would end his life. His crew, four officers, a Tech Sargent and a gaggle of Corporals that dubbed themselves the Corporalies, adventured their way across the globe. Flying the Hump through the Himalayas, the “Aluminum Trail“ as it was called because of the many planes that crashed trying to fly the route. Then landing in China to refuel and then on to places like Manchuria, Rangoon or even the most southern parts of Japan to drop 500 pounders. Each mission had its challenges, minus fifty-degree weather in Mukden, or Japanese fighters firing away at them, a close encounter of the wrong kind, nearly missing a collision with another B29 while flying in clouds, seeing friends downed and lost because of “mechanicals,” the constant threat of running out of fuel and their greatest fear, engine fire. Transferred to the Mariana Islands, he and his crew were shot down over Nagoya, Japan as part of Mission 174, captured and declared war criminals. Connie’s letters reveal life for a brand-new mother whose husband is declared MIA. The agony for both of them; he in a Japanese prison, declared a war criminal, and she just not knowing why his letters stopped coming.… this is one I am sure I will read several times. I have already started reading it for the second time. This was definitely one of the most memorable books that I have read in the last few years! Bee Lindy",
  "genres": [
    "Historical",
    "Nonfiction",
    "History",
    "World War II"
  ],
  "author": "Roger Stark",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/56853641-they-called-him-marvin"
}