{
  "title": "Not Today: The 9 Habits of Extreme Productivity",
  "description": "When their five-year-old son fought for his life, business leaders Erica and Mike Schultz learned a new way to live, work, and succeed—discovering how to achieve extreme productivity with heart and purpose.Ari Schultz was an extraordinary baby, beginning life in a pitched battle against heart disease. The same year, his parents launched their business, and they had to keep it going strong, even while living full-time at the hospital for months on end. For the next five years, Erica and Mike Schultz learned how to balance the demands of their jobs, commuting to the hospital, and spending time with their growing family—along the way, noting the tricks and techniques that allowed them to get work done, even while living in the cardiac ICU and later through heartbreaking loss.After reflection and recovery, Mike and Erica codified their method of coping and working, and set out to study the work habits of extremely productive people. They discovered what extremely productive people do differently than everyone else, and went on to create The Productivity Code—a new approach to productivity that has helped tens of thousands of people manage their time for greatest effectiveness, fulfillment, and happiness. Now, Erica and Mike reveal the 9 Habits of Extreme Productivity along with easy-to-apply techniques, including:• How to stay focused—and positive—even in difficult times• Clearly defining your motivations through written goals and four-three-four planning• Helpful hacks to stop procrastinating• How to disrupt unproductive thought cycles and break bad habits for good• Changing your mindset to prioritize time doing things you love• Setting boundaries and saying no to tasks that don’t serve you• Tricks to become impossible to distract• Working in powerful planned “sprints” to get in the zone• Finding ways to refuel your mental and physical energy• Resetting and correcting when you’ve gone off courseInterweaving their son’s poignant story with effective productivity and happiness strategies, Not Today shows how anyone can better manage their time—while living a more energetic and meaningful life.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Productivity",
    "Audiobook"
  ],
  "author": "Erica  Schultz",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/56850206-not-today"
}