{
  "title": "People Are Sheep: When was the last time you thought with your own head?",
  "description": "When was the last time you thought with your own head?What do you really want in life? Freedom, food, happiness, health, time for people? If you answered the above question with yes, then you are only few steps away from such a life. Unfortunately, most people do not fully understand how easy everything can be. It’s always necessary to start with people who you can help enable this path – and that’s youEveryone in the world could have absolutely everything, if we thought having “only” food, drink, love and freedom was enoughNever forget, always remember:If we never switched on the television, our brains would remain switched on at all times.Most people don’t ever follow their own way, but follow the stories written by the leaders.Feeding hungry people isn’t the problem, the problem is satisfying those who already have enough and always want more.In life, it's not essential that you belong to someone, but that others don’t own you.What this book will give you?It will 100% sure help you to understand pure truth about the system in which we all live.It will push you to the point where you will be amazed how simple everything works, and how psychology of masses is being used to eliminate smart individuals and present them as dumb ones and like some kind of threat to the society.If you can resolve the human mind, there are no coincidences.If you can convince people that they are in danger they will do anything and everything to get back on the safe side again.We should never be afraid to stand out from the crowd; we should always be afraid that no one will notice and understand our good intentions.The only freedom that exists is one that always offers a choice; without choice, there is no freedom.We are born smart – then we learn all our life and in the end, we die stupid.The fact is that you can always defeat the leaders – you just need to play a game other than the one they expect from you.Every day we don’t resist the system we lose a little bit of freedom.If there is a game and nobody wants to play it, it will always only remain a game without players. A game without a player doesn’t exist.As long we are against each other, the leaders will always take advantage of the situation and they will be against all of us, because they will deliberately divide us and will always have the advantage over us and do with us whatever they wish, whenever they want, however they want.The day will come when we send the leaders but a single, clear message:THE GAME IS OVER",
  "genres": [
    "Psychology"
  ],
  "author": "Tomaž  Caserman",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/56847319-people-are-sheep"
}