{
  "title": "Santa Cruise",
  "description": "Fans of Debbie Macomber and Danielle Steel won’t want to miss this enchanting, humorous, and heartwarming novel that takes you on a singles cruise with four lifelong friends who might just find the gift of love this Christmas…\n At Ridgewood High, Amy, Frankie, Rachael, and Nina formed a deep bond. Now, fifteen years after leaving school behind, they’re back for a reunion, laughing, reminiscing, and chatting how much has changed—and how much hasn’t. Nina, once the star of every school play, moved to Hollywood and landed a recurring role on a sitcom. Amy, fondly known as “the brains of the operation,” is now a Silicon Valley bioengineer. Outgoing and compassionate, Frankie works for a New York publishing house. Rachael, always the most boy-crazy of the crew, married—mostly to please her parents—but is now divorced. All four are strong, successful, and somehow, still looking for the right partner. But Frankie has an idea to help solve that: a singles cruise for the holidays. In late December, Amy, Rachael, Frankie, and Nina gather in Miami, ready to board their state-of-the-art cruise ship. The entertainment options are endless, the food is to die for, and the passenger list includes hundreds of eligible men. The highlight of the week will be a magnificent New Year’s Eve celebration with multiple theme parties, dancing, and fireworks. The ladies are happy to give Cupid a helping hand here and there—hanging mistletoe in elevators and cheering each other on through speed-dating events and shore excursions. Holidays—like the path of love itself—don’t always go exactly as planned, but over the course of one festive, unforgettable week, all four will set sail on surprising new adventures.",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Fiction",
    "Chick Lit",
    "Audiobook",
    "Adult"
  ],
  "author": "Fern Michaels",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/56881191-santa-cruise"
}