{
  "title": "The Objects of Attraction: The Complete 6-Book Collection",
  "description": "The internationally bestselling series with over 10,000 five-star ratings on Goodreads is back. This collection introduces two brand new bonus scenes and a new novella featuring fan-favorite \"Grammy\" and the story of her first love.This 6-book collection includes:Book 1: His Banana (Top 10 Amazon Bestseller) - My new boss likes rules, but there's one nobody dares to break...No touching his banana.Seriously. The guy is like a potassium addict.Of course, I touched it.If you want to get technical, I actually put it in my mouth.I chewed it up, too... I even swallowed.I know. Bad, bad, girl.Then I saw him, and believe it or not, choking on a guy's banana does not make the best first impression.*His Banana now includes a never-before-published bonus scene to conclude the book.Book 2: Her Cherry (Top 10 Amazon Bestseller) - How’d I meet her?Well, a gentleman never brags.Thankfully, I’m no gentleman.First, I paid for her cherry (pie, but that’s not the point),Next, I deflowered her.After that? I left my business card and walked out like I owned the place.Yeah, you could say we hit it off.*Her Cherry now includes a never-before-published bonus scene to conclude the book.Book 3: His Treat (top 10 Amazon Bestseller) - Having a hot boss isn’t complicated or confusing at all,Said no one ever…But all I have to do is resist for a few months.Come January, I’m flying to Paris to chase my dream of being an artist,Too bad I can’t have my treat and eat it, too.Book 4: His Package (top 10 Amazon Bestseller) - His package ended up inside my box.Calm down, perv. My mailbox.As soon as I saw what was inside,I knew two things:It belonged to my hot neighbor, and he had a dirty secret.Book 5: Her Secret (top 40 Amazon Bestseller) - I’ll admit it. I messed up.Mistake #1: Asking Peter Barnidge for a job.Mistake #2: Accepting his offer instead of throwing it in his face like I planned.Mistake #3: In the interest of stopping before #99, I’ll pretend the only other mistake was withholding one, tiny little nugget of truth during my interview.Book 6: Her Bush (top 40 Amazon Bestseller) - Everything went wrong when I trimmed his bush.And no, it’s not what you’re thinking. I’m a professional.The client hired me to trim a bush in his garden for a party.I accidentally turned it into something that rhymes with “a big rock and walls”.Imagine my surprise when the art world decides it’s a masterpiece.Book 7: Grammy's Story (brand new novella only available in this bundle) - She's kept quiet about the story of her first love for years. But when the opportunity to recount every hilarious, graphic detail of their love to William, Hailey, Bruce, and Natasha comes up, she can't resist. Grammy's story is a quick but sweet and funny story about how she met her first love when she was eighteen and had just moved to Manhattan.If you love hilariously heartfelt stories with just the right amount of swoon and a little dose of ridiculous for good measure, then clear your calendar. Once you dive in, it's going to be days before you come up for air from this bundle. Scroll up and one-click now!",
  "genres": [],
  "author": "Penelope Bloom",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/56887307-the-objects-of-attraction"
}