{
  "title": "Kiss the Devil",
  "description": "Bleeding Souls, Saved by Love A Sleeping Beauty retelling Vito Vitale had only the withered remnants of a soul long since torn open and defiled. What little remained was charred black and empty. He lived in a dark world of his own design where cruelty, murder and violence were variations of the same theme—a dystopian melody repeated like a fugal subject and all of it conducted by the maestro, himself. Scorpionic energy combined with the dispassionate inclinations of a sociopath, everything was transactional. People were used as commodities to achieve an end result. He had no time for weaklings— inconsequential elements disposed of like trash. All that mattered was what benefited him. He’d gotten what he’d been after his entire life and as the Capo di Tutti Capi nel Mondo of the Costa Nostra he had it all … and feared no one. Except loneliness. Now, due to a twist of fate, his life was about to take a new direction. Marriage had never been an option but to keep the drug cartel in check, it was the best solution to invest—by marrying the drug lord’s daughter. Finding her asleep in his office sealed her fate. She unleashed a hunger to kiss those pouty lips, awakening her from slumber and claiming her as his wife. She shouldn’t have fallen asleep on his sofa. Consequences be damned. It was time to wake her with a kiss.Editor’s Vito Vitale had succeeded his half-brother, Damiano, to become the top apex predator of the Occhipinti family, the most feared of the five Mafia families. Ruthless and savage, everything was transactional, even his marriage to Amber Perez, the stunning, hellion daughter of a Mexican narco kingpin. Was the match-up just another arranged pact? Who really holds the keys to the kingdom is this powerful dynamic? Linzi Bassett slays us again with her dominant characters in this ferocious prequel. Hold fast.",
  "genres": [],
  "author": "Linzi Basset",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/56880662-kiss-the-devil"
}