{
  "title": "The Secrets in Shadow and Blood",
  "description": "In the shadows, vision can turn blurry. Truths can become lies. Enemies can become lovers. When Violet inexplicably wakes thousands of years after a nuclear holocaust, she finds the world very different. Fae exist now. They’re vicious, animalistic monsters who pervert magic and can morph into any shape—including vampires. They hoard the bounty of the new world, and keep humans banished to the wasteland. At least, that’s what the humans of today have told her. Determined to make up for an unforgivable mistake in her past, she becomes a covert assassin and seeks revenge for her human brethren. And she’s good at it. But when the thing she hunts saves her life, injuring himself in the process… her crystal clarity suddenly becomes blurry. Vampires are meant to be monsters, not protectors… not charismatic, annoyingly handsome and loyal and… everything.Indigo is a Fae Guardian, and a ruthless vampire protector of Elphyne. The Order has tasked him with finding a human with deadly secrets before the unhinged Unseelie Queen, or the fanatical human leader, can exploit her. They chose him for one reason, and one reason only – the taste of human blood does things to him. Addictive, dark, insatiable things. And when he catches Violet’s scent, they know he’ll do everything in his power to covet her and keep her safe. But Indigo hides his own shameful secret in the shadows of his heart, and if it ever comes to light, Violet will never trust him. She’ll kill him.The Secrets in Shadow and Blood is the next installment in the Fae Guardians series, and the first in the Season of the Vampire Trilogy. Each book features a separate couple with a satisfying HEA, but to enjoy the full benefits of the over arching plot, start the Fae Guardian journey with book one of Fae Guardians: Season of the Wolf. All Fae Guardian books include steamy romance, a splash of time travel, monster hunting, a band of brothers, fated mates, growly fae protectors, and their strong willed women from our time. If you love your books full of page turning action, romantic tension, and world building you can get lost in, then this series is for you. Warning: Trusting these seductive fae will lead to sleepless nights. But it will be worth it.",
  "genres": [
    "Fantasy",
    "Vampires",
    "Romance",
    "Fae",
    "Paranormal",
    "Fantasy Romance",
    "Paranormal Romance"
  ],
  "author": "Lana Pecherczyk",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/56872103-the-secrets-in-shadow-and-blood"
}