{
  "title": "True Story: What Reality TV Says About Us",
  "description": "Named a Best Nonfiction Book of 2022 by EsquireA sociological study of reality TV that explores its rise as a culture-dominating medium--and what the genre reveals about our attitudes toward race, gender, class, and sexualityWhat do we see when we watch reality television?In True Story: What Reality TV Says About Us, the sociologist and TV-lover Danielle J. Lindemann takes a long, hard look in the \"funhouse mirror\" of this genre. From the first episodes of The Real World to countless rose ceremonies to the White House, reality TV has not just remade our entertainment and cultural landscape (which it undeniably has). Reality TV, Lindemann argues, uniquely reflects our everyday experiences and social topography back to us. Applying scholarly research--including studies of inequality, culture, and deviance--to specific shows, Lindemann layers sharp insights with social theory, humor, pop cultural references, and anecdotes from her own life to show us who we really are.By taking reality TV seriously, True Story argues, we can better understand key institutions (like families, schools, and prisons) and broad social constructs (such as gender, race, class, and sexuality). From The Bachelor to Real Housewives to COPS and more (so much more!), reality programming unveils the major circuits of power that organize our lives--and the extent to which our own realities are, in fact, socially constructed.Whether we're watching conniving Survivor contestants or three-year-old beauty queens, these \"guilty pleasures\" underscore how conservative our society remains, and how steadfastly we cling to our notions about who or what counts as legitimate or \"real.\" At once an entertaining chronicle of reality TV obsession and a pioneering work of sociology, True Story holds up a mirror to our society: the reflection may not always be pretty--but we can't look away.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Pop Culture",
    "Audiobook",
    "Psychology",
    "History",
    "Cultural"
  ],
  "author": "Danielle J. Lindemann",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/56878833-true-story"
}