{
  "title": "Watergate: A New History",
  "description": "From Garrett​ Graff, comes the first definitive narrative history of Watergate, exploring the full scope of the scandal through the politicians, investigators, journalists, and informants who made it the most influential political event of the modern era.In the early hours of June 17, 1972, a security guard named Frank Wills enters six words into the log book of the Watergate office complex that will change the course of history: 1:47 AM Found tape on doors; call police. The subsequent arrests of five men seeking to bug and burgle the Democratic National Committee offices—three of them Cuban exiles, two of them former intelligence operatives—quickly unravels a web of scandal that ultimately ends a presidency and forever alters views of moral authority and leadership. Watergate, as the event is called, becomes a shorthand for corruption, deceit, and unanswered questions. Now, award-winning journalist and bestselling author Garrett M. Graff explores the full scope of this unprecedented moment from start to finish, in the first comprehensive, single-volume account in decades. The story begins in 1971, with the publication of thousands of military and government documents known as the Pentagon Papers, which reveal dishonesty about the decades-long American presence in Vietnam and spark public outrage. Furious that the leak might expose his administration’s own duplicity during a crucial reelection season, President Richard M. Nixon gathers his closest advisors and gives them implicit instructions: Win by any means necessary. Within a few months, an unsteady line of political dominoes are positioned, from the creation of a series of covert operations code-named GEMSTONE to campaign-trail dirty tricks, possible hostage situations, and questionable fundraising efforts—much of it caught on the White House’s own taping system. One by one they fall, until the thwarted June burglary attracts the attention of intrepid journalists, congressional investigators, and embattled intelligence officers, one of whom will spend decades concealing his identity behind the alias “Deep Throat.” As each faction slowly begins to uncover the truth, a conspiracy deeper and more corrupt than anyone thought possible emerges, and the nation is thrown into a state of crisis as its government—and its leader—unravels. Using newly public documents, transcripts, and revelations, Graff recounts every twist with remarkable detail and page-turning drama, bringing readers into the backrooms of Washington, chaotic daily newsrooms, crowded Senate hearings, and even the Oval Office itself during one of the darkest chapters in American history. Grippingly told and meticulously researched, Watergate is the defining account of the moment that has haunted our nation’s past—and still holds the power to shape its present and future.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Crime",
    "True Crime",
    "Audiobook"
  ],
  "author": "Garrett M. Graff",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/56898146-watergate"
}