{
  "title": "Work Smart Now: How to Jump Start Productivity, Empower Employees, and Achieve More",
  "description": "From one of the top HR specialists in the world comes this much-needed guide to help people maximize productivity and increase revenue. Whether it’s in corporate America or in our own living rooms, people are wasting time. From the minute we wake up and check our Facebook page or emails—before we even crawl out of bed—to late at night when we stay up longer than we should, watching our favorite show. There’s a precise moment that falls between working enough hours to be productive and working too many hours, yielding a diminishing marginal return. The difference between the person able to master this and most Americans that fail miserably at it is quality of life! If one continues to work past this moment, a negative return will ensue, and that negative return produces guilt. It lowers the amount of time for recreational activities and spending time with family. We’ve siloed productivity to our work life, however; the impact on our personal life is often loss. An alarming 39% of workers in high-tech companies believe they are depressed, as reported by PC Magazine in December 2018. 72% of people who have daily stress and anxiety say it interferes with their lives—anxiety and stress alone have reduced productivity by 56%. More than 80% of people have experienced some form of anxiety, stress, or depression in the workplace. People are spending more time at work than at home or with their loved ones; or, if they are at home, they are working. They are always “on.” As a result of this disparity, people are not fully living their lives. And the “work-life balance” marketed by some HR consulting firms and employers simply does not work. It’s all work and no life! Studies have also proven that when people are unhappy in their personal lives or careers, their productivity goes down and everything and everyone around them suffers. This causes a domino effect, which trickles into every area of their lives. Previous generations used to say, “Work harder,” but we’ve now learned we must “work smarter.” Polak has practiced and tested his methods in hundreds of opportunities and has been paid millions by the largest corporations in the world to share these tools. He feels that every individual and business should have these tools, and will share them with us here.",
  "genres": [
    "Productivity",
    "Nonfiction",
    "Drama",
    "Business",
    "Contemporary",
    "Book Club",
    "Leadership"
  ],
  "author": "Richard  Polak",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/56893522-work-smart-now"
}