{
  "title": "The Art of Bob Mackie",
  "description": "The first-ever, comprehensive and authorized showcase of legendary fashion designer Bob Mackie’s fabulous life and work, featuring hundreds of photos and dozens of never-before-seen sketches from his personal collection.Cher, Carol Burnett, Bette Midler, P!nk, Tina Turner, Elton John, Liza Minnelli, Angela Lansbury, Diana Ross, Beyoncé, RuPaul, and Madonna...what do they all have in common? All have been dressed by Bob Mackie.For nearly six decades, the iconic and incomparable Bob Mackie has been designing stunning, unforgettable clothing. His unique, glamorous—sometimes hilarious—creations have appeared on Broadway stages, TV screens, runways, and red carpets worldwide. For his pioneering genius and continual reinvention, he is a Tony Award and nine-time Emmy Award winner, a three-time Oscar nominee, and recipient of the Geoffrey Beene Lifetime Achievement Award from the Council of Fashion Designers of America. For the first time, he has granted full access to his archives and personal memories to the authors of this lavish celebration of his achievements.The Art of Bob Mackie is the first-ever comprehensive and fully authorized book showcasing Mackie’s work, from his early days as a sketch artist for the legendary Edith Head at Paramount to his current, cutting-edge costumes for pop stars and line of accessible, wearable clothing for QVC. In addition to hundreds of glorious photos and dozens of dishy recollections from Mackie and his many muses, this gorgeous volume features never-before-seen sketches from throughout his prolific career, from Marilyn Monroe’s iconic “Happy Birthday, Mr. President” gown to Carol Burnett’s “Went with the Wind” curtain-rod dress, to Cher’s show-stopping 1986 Oscar look. As other designers have burst onto the scene and faded out of fashion, Mackie has soared from success to success, always remaining relevant because he has always been spectacularly fashion-forward.With a foreword by Carol Burnett and an afterword by Cher, The Art of Bob Mackie is a stunning must-have for lovers of sequins, beads, and feathers; Broadway shows and classic television; pop music and pop culture; and fashion with incomparable flair.",
  "genres": [
    "Fashion",
    "Nonfiction",
    "Art"
  ],
  "author": "Frank Vlastnik",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/56898182-the-art-of-bob-mackie"
}