{
  "title": "Between the Lines: Stories from the Underground",
  "description": "From the acclaimed creator of Subway Book Review , Between the Lines gloriously takes to the underground and showcases in over 170 interviews what moves us forward—a thrilling ride as unexpected as New York City itself.“ Subway Book Review has changed how we look at books.” — Forbes“[Beutter Cohen’s] rosy view of the subway is a refreshing contrast.” — The Cut, New York magazine“ Subway Book Review is one of the few purely good things on the internet.” —EsquireFor the better part of a decade, Uli Beutter Cohen rode the subway through New York City’s underground to observe society through the lens of our most creative the readers of books. Between the Lines is a timely collection of beloved and never-before-published stories that reflect who we are and where we are going. In over 170 interviews, Uli shares nuanced insights into our collective psyche and gives us an invaluable document of our challenges and our potential. Complete with original photography, and countless intriguing book recommendations, Between the Lines is an enthusiastic celebration of the ways stories invite us into each other’s lives, and a call to action for imagining a bold, empathetic future together.Meet Yahdon, who reads Dapper Made in Harlem and talks about the power of symbols in fashion. Diana shares how Orlando shaped her journey as a trans woman. Saima reads They Say, I Say and speaks about the power of her hijab. Notable New Yorkers open up about their lives and reading habits, including photographer Jamel Shabazz, filmmaker Katja Blichfeld, painter Devon Rodriguez, comedian Aparna Nancherla, fashion editor Lynn Yaeger, playwright Jeremy O. Harris, fashion designer and TV personality Leah McSweeney, designer Waris Ahluwalia, artist Debbie Millman, activist Amani al-Khatahtbeh, and esteemed authors such as Jia Tolentino, Roxane Gay, Ashley C. Ford, Eileen Myles, Min Jin Lee, and many more.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Essays",
    "New York",
    "Anthologies",
    "Memoir"
  ],
  "author": "Uli Beutter Cohen",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/56898161-between-the-lines"
}