{
  "title": "Spells Like Teen Spirit",
  "description": "The final installement in the hilarious, action-packed Babysitters Coven series that Refinery29 calls candy for 90's girls and Gen Z'ers alike, featuring a coven of witchy babysitters sworn to protect the innocent and defend the world from an onslaught of evil--all before bedtime.Ever since Esme met Cassandra Heaven and discovered the truth about their shared legacy--that they're Sitters, supernaturally-gifted teens tasked with protecting the innocent from evil--her life has been moving at 90 mph. During the day, she chases wild toddlers, and at night, she employs a different skill set for a different kind of demon. Like, literal ones. And sometimes, it's almost fun. Her spells are getting better, her telekinesis is on point, and now that Esme's dad and her best friend Janis know the truth, she's no longer lying to the people she loves. She's also learned that there's a way to undo her mother's curse, and with the Synod out of the picture, she might even have a chance to do it.If she could just figure out how. But she can't, and even with her mom living at home again, Esme can't shake the feeling that she's failing. Throw in the fact that Pig is still gone, Esme's crush is also MIA, and that it's cold, slushy February, and she's in bummer city.Esme needs a serious pick-me-up, and Janis has a plan: a Galentine's stay-cation, with the Sitter friends Esme and Cassandra made at the Summit for a serious girls weekend. Except, things are getting weird in Spring River again. Esme and Cassandra just discovered a new band, and not in a good way: these guys reek of Red Magic, and their music sucks too. Trouble is brewing, and if Esme's not careful, this show might be her last--and no one likes a one-hit wonder.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Witches",
    "Paranormal",
    "Audiobook",
    "Supernatural",
    "Fiction"
  ],
  "author": "Kate    Williams",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/56905030-spells-like-teen-spirit"
}