{
  "title": "You Can’t Be Serious",
  "description": "In this refreshingly candid memoir, Kal Penn recounts why he rejected the advice of his aunties and guidance counselors and, instead of becoming a doctor or “something practical,” embarked on a surprising journey that has included acting, writing, working as a farmhand, teaching Ivy League University courses, and smoking fake weed with a fake President of the United States, before serving the country and advising a real one.You Can’t Be Serious is a series of funny, consequential, awkward, and ridiculous stories from Kal’s idiosyncratic life. It’s about being the grandson of Gandhian freedom fighters, and the son of immigrant parents: people who came to this country with very little and went very far—and whose vision of the American dream probably never included their son sliding off an oiled-up naked woman in a raunchy Ryan Reynolds movie…or getting a phone call from Air Force One as Kal flew with the country’s first Black president.With intelligence, humor, and charm on every page, Kal reflects on the most exasperating and rewarding moments from his journey so far. He pulls back the curtain on the nuances of opportunity and racism in the entertainment industry and recounts how he built allies, found encouragement, and dealt with early reminders that he might never fit in. And of course, he reveals how, after a decade and a half of fighting for and enjoying successes in Hollywood, he made the terrifying but rewarding decision to take a sabbatical from a fulfilling acting career for an opportunity to serve his country as a White House aide.Above all, You Can’t Be Serious shows that everyone can have more than one life story. Kal demonstrates by example that no matter who you are and where you come from, you have many more choices than those presented to you. It’s a story about struggle, triumph, and learning how to keep your head up. And okay, yes, it’s also about how he accidentally (and very stupidly) accepted an invitation to take the entire White House Office of Public Engagement to a strip club—because, let’s be honest, that’s the kind of stuff you really want to hear about.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Humor",
    "Biography",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Kal Penn",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/56898257-you-can-t-be-serious"
}