{
  "title": "Black Ghost of Empire: The Long Death of Slavery and the Failure of Emancipation",
  "description": "A revelatory historical indictment of the long afterlife of slavery in the Atlantic world To fully understand why the shadow of slavery haunts us today, we must confront the flawed way that it ended. We celebrate abolition - in Haiti after the revolution, in the British Empire in 1833, in the United States during the Civil War. Yet in Black Ghost of Empire, acclaimed historian Kris Manjapra argues that during each of these supposed emancipations, Black people were dispossessed by the moves that were meant to free them. Emancipation, in other words, simply codified the existing racial caste system - rather than obliterating it.  Ranging across the Americas, Europe and Africa, Manjapra unearths disturbing truths about the Age of Emancipations, 1780-1880. In Britain, reparations were given to wealthy slaveowners, not the enslaved, a vast debt that was only paid off in 2015, and the crucial role of Black abolitionists and rebellions in bringing an end to slavery has been overlooked. In Jamaica, Black people were liberated only to enter into an apprenticeship period harsher than slavery itself. In the American South, the formerly enslaved were 'freed' into a system of white supremacy and racial terror. Across Africa, emancipation served as an alibi for colonization. None of these emancipations involved atonement by the enslavers and their governments for wrongs committed, or reparative justice for the formerly enslaved-an omission that grassroots Black organizers and activists are rightly seeking to address today. Black Ghost of Empire will rewire readers' understanding of the world in which we live. Paradigm-shifting, lucid and courageous, this book shines a light into the enigma of slavery's supposed death, and its afterlives.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "American History",
    "Historical",
    "Social Justice"
  ],
  "author": "Kris Manjapra",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/56898105-black-ghost-of-empire"
}