{
  "title": "Girl in Ice",
  "description": "From the author of The River at Night and Into the Jungle comes a harrowing new thriller set in the unforgiving landscape of the Arctic Circle, as a brilliant linguist struggling to understand the apparent suicide of her twin brother ventures hundreds of miles north to try to communicate with a young girl who has thawed from the ice alive.Valerie “Val” Chesterfield is a linguist trained in the most esoteric of disciplines: dead Nordic languages. Despite her successful career, she leads a sheltered life and languishes in the shadow of her twin brother Andy, an accomplished climate scientist stationed on a remote island off Greenland’s barren coast. But Andy is gone: a victim of suicide, having willfully ventured unprotected into 50 degree below zero weather. Val is inconsolable—and disbelieving. She suspects foul play. When Wyatt, Andy’s fellow researcher in the Arctic, discovers a scientific impossibility­—a young girl frozen in the ice who thaws out alive, speaking a language no one understands—Val is his first call. Will she travel to the frozen North and meet this girl, try to comprehend what she is so passionately trying to communicate? Under the auspices of helping Wyatt interpret the girl’s speech, Val musters every ounce of her courage and journeys to the Artic to solve the mystery of her brother’s death. The moment she steps off the plane, her fear threatens to overwhelm her. The landscape is fierce, and Wyatt, brilliant but difficult, is an enigma. But the girl is special, and Val’s connection with her is profound. Only something is terribly wrong; the child is sick, maybe dying, and the key to saving her lies in discovering the truth about Wyatt’s research. Can his data be trusted? And does it have anything to do with how and why Val’s brother died? With time running out, Val embarks on an incredible frozen odyssey—led by the unlikeliest of guides—to rescue the new family she has found in the most unexpected of places.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Science Fiction",
    "Audiobook"
  ],
  "author": "Erica Ferencik",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/56898156-girl-in-ice"
}