{
  "title": "Christmas in Peachtree Bluff",
  "description": "The newest installment of the New York Times bestselling Peachtree Bluff series follows three generations of Murphy women as they come together to face a hurricane that threatens their hometown—and the holiday season—in this “book equivalent of a warm and fuzzy pair of socks” ( E! Online ).When the Murphy women are in trouble, they always know they can turn to their mother, Ansley. So when eldest daughter Caroline and her husband announce they are divorcing—and fifteen-year-old daughter Vivi acts out in response—Caroline, at her wits end, can’t think of anything to do besides leave her with Ansley in Peachtree Bluff for the holidays. After all, how much trouble can one teenager get into on a tiny island?Quite a lot, as it turns out.As the “storm of the century” heads toward Peachtree Bluff, Ansley and her husband, Jack, with Vivi in tow, are grateful they’re planning to leave for the trip of a lifetime. But Vivi’s recklessness forces the trio to shelter in place during the worst hurricane Peachtree has ever seen. With no power, no provisions, and the water rising, the circumstances become dire very quickly…and the Murphy sisters soon realize it’s up to them to conduct a rescue mission. With the bridges closed and no way to access Peachtree Bluff by land or air, they set sail on Caroline’s boat, The Starlite Sisters , determined to rebuild their beloved town—and their family.In “pitch perfect tones” ( Publishers Weekly ) and written with her signature Southern charm, New York Times bestselling author Kristy Woodson Harvey explores the magic of Christmas, the power of forgiveness, and the importance of family in a tale that reminds us that, no matter the circumstances, home is always where we belong—especially during the holidays.",
  "genres": [
    "Christmas",
    "Holiday",
    "Fiction",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Chick Lit"
  ],
  "author": "Kristy Woodson Harvey",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/56898314-christmas-in-peachtree-bluff"
}