{
  "title": "The Genius of Israel: The Surprising Resilience of a Divided Nation in a Turbulent World",
  "description": "How has a small nation of 9 million people, forced to fight for its existence and security since its founding and riven by ethnic, religious, and economic divides, proven resistant to so many of the societal ills plaguing other wealthy democracies?Why do Israelis have among the world’s highest life expectancies and lowest rates of “deaths of despair” from suicide and substance abuse? Why is Israel’s population young and growing while all other wealthy democracies are aging and shrinking? How can it be that Israel, according to a United Nations ranking, is the fourth happiest nation in the world? Why do Israelis tend to look to the future with hope, optimism, and purpose while the rest of the West struggles with an epidemic of loneliness, teen depression, and social decline?Dan Senor and Saul Singer, the writers behind the international bestseller Start-Up Nation, have long been students of the global innovation race. But as they spent time with Israel’s entrepreneurs and political leaders, soldiers and students, scientists and activists, ultra-Orthodox Jews, Tel Aviv techies, and Israeli Arabs, they realized that they had missed what really sets Israel apart.Moving from military commanders integrating at-risk youth and people who are neurodiverse into national service, to high performing companies making space for working parents, from dreamers and innovators launching a duct-taped spacecraft to the moon, to bringing better health solutions to people around the world, The Genius of Israel tells the story of a diverse people and society built around the values of service, solidarity, and belonging.Widely admired for having the world’s highest density of high-tech start-ups, Israel’s greatest innovation may not be a technology at all, but Israeli society itself. Understanding how a country facing so many challenges can be among the happiest provides surprising insights into how we can confront the crisis of community, human connectedness, and purpose in modern life.Bold, timely, and insightful, Senor and Singer’s latest work shines an important light on the impressive innovative distinctions of Israeli society—and what other communities and countries can learn.",
  "genres": [
    "Israel",
    "Nonfiction",
    "History",
    "Jewish",
    "Politics",
    "Audiobook",
    "Judaism"
  ],
  "author": "Dan Senor",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/56898098-the-genius-of-israel"
}