{
  "title": "Smile: The Story of a Face",
  "description": "A People Best Book of the Year. Time and The Washington Post's Most Anticipated List. Longlisted for the Andrew Carnegie Medal for Excellence. From the MacArthur genius, two-time Pulitzer Prize finalist, and playwright, this \"captivating, insightful memoir\" (Kirkus Reviews, starred review) is \"a beautiful meditation on identity and how we see ourselves\" (Real Simple). With a play opening on Broadway, and every reason to smile, Sarah Ruhl has just survived a high-risk pregnancy when she discovers the left side of her face is completely paralyzed. She is assured that 90 percent of Bell's palsy patients experience a full recovery—like Ruhl's own mother. But Sarah is in the unlucky ten percent. And for a woman, wife, mother, and artist working in theater, the paralysis and the disconnect between the interior and exterior brings significant and specific challenges. So Ruhl begins an intense decade-long search for a cure while simultaneously grappling with the reality of her new face—one that, while recognizably her own—is incapable of accurately communicating feelings or intentions. In a series of piercing, profound, and lucid meditations, Ruhl chronicles her journey as a patient, wife, mother, and artist. She explores the struggle of a body yearning to match its inner landscape, the pain of postpartum depression, the story of a marriage, being a playwright and working mom to three small children, and the desire for a resilient spiritual life in the face of illness. An intimate and \"stunning\" (Publishers Weekly, starred review) examination of loss and reconciliation, \"Ruhl reminds us that a smile is not just a smile but a vital form of communication, of bonding, of what makes us human\" (The Washington Post). Brimming with insight, humility, and levity, Smile is a triumph by one of America's leading playwrights.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Medical",
    "Health"
  ],
  "author": "Sarah Ruhl",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/56898178-smile"
}