{
  "title": "The Dictionary of Obscure Sorrows",
  "description": "NEW YORK TIMES\n BESTSELLER “It’s undeniably thrilling to find words for our strangest feelings…Koenig casts light into lonely corners of human experience…An enchanting book. “ —The Washington Post A truly original book in every sense of the word, The Dictionary of Obscure Sorrows poetically defines emotions that we all feel but don’t have the words to express—until now. Have you ever wondered about the lives of each person you pass on the street, realizing that everyone is the main character in their own story, each living a life as vivid and complex as your own? That feeling has a name: “sonder.” Or maybe you’ve watched a thunderstorm roll in and felt a primal hunger for disaster, hoping it would shake up your life. That’s called “lachesism.” Or you were looking through old photos and felt a pang of nostalgia for a time you’ve never actually experienced. That’s “anemoia.” If you’ve never heard of these terms before, that’s because they didn’t exist until John Koenig set out to fill the gaps in our language of emotion. The Dictionary of Obscure Sorrows “creates beautiful new words that we need but do not yet have,” says John Green, bestselling author of The Fault in Our Stars. By turns poignant, relatable, and mind-bending, the definitions include whimsical etymologies drawn from languages around the world, interspersed with otherworldly collages and lyrical essays that explore forgotten corners of the human condition—from “astrophe,” the longing to explore beyond the planet Earth, to “zenosyne,” the sense that time keeps getting faster.  The Dictionary of Obscure Sorrows is for anyone who enjoys a shift in perspective, pondering the ineffable feelings that make up our lives. With a gorgeous package and beautiful illustrations throughout, this is the perfect gift for creatives, word nerds, and human beings everywhere.",
  "genres": [
    "Nonfiction",
    "Poetry",
    "Language",
    "Reference",
    "Philosophy",
    "Linguistics",
    "Psychology"
  ],
  "author": "John Koenig",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/56897474-the-dictionary-of-obscure-sorrows"
}