{
  "title": "All of the Marvels: A Journey to the Ends of the Biggest Story Ever Told",
  "description": "The first-ever full reckoning with Marvel Comics' interconnected, half-million-page story, a revelatory guide to the \"epic of epics\"--and to the past sixty years of American culture--from a beloved authority on the subject who read all 27,000+ Marvel superhero comics and lived to tell the tale The superhero comic books that Marvel Comics has published since 1961 are, as Douglas Wolk notes, the longest continuous, self-contained work of fiction ever created: over half a million pages to date, and still growing. The Marvel story is a gigantic mountain smack in the middle of contemporary culture. Thousands of writers and artists have contributed to it. Everyone recognizes its protagonists: Spider-Man, the Avengers, the X-Men. Eighteen of the hundred highest-grossing movies of all time are based on parts of it. Yet not even the people telling the story have read the whole thing--nobody's supposed to. So, of course, that's what Wolk did: he read all 27,000+ comics that make up the Marvel Universe thus far, from Alpha Flight to Omega the Unknown.And then he made sense of it--seeing into the ever-expanding story, in its parts and as a whole, and seeing through it, as a prism through which to view the landscape of American culture. In Wolk's hands, the mammoth Marvel narrative becomes a fun-house-mirror history of the past sixty years, from the atomic night terrors of the Cold War to the technocracy and political division of the present day--a boisterous, tragicomic, magnificently filigreed epic about power and ethics, set in a world transformed by wonders.As a work of cultural exegesis, this is sneakily significant, even a landmark; it's also ludicrously fun. Wolk sees fascinating patterns--the rise and fall of particular cultural aspirations, and of the storytelling modes that conveyed them. He observes the Marvel story's progressive visions and its painful stereotypes, its patches of woeful hackwork and stretches of luminous creativity, and the way it all feeds into a potent cosmology that echoes our deepest hopes and fears. This is a huge treat for Marvel fans, but it's also a revelation for readers who don't know Doctor Strange from Doctor Doom. Here, truly, are all of the marvels.",
  "genres": [
    "Nonfiction",
    "Comics",
    "History",
    "Marvel",
    "Superheroes",
    "Pop Culture",
    "Audiobook"
  ],
  "author": "Douglas Wolk",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/56913465-all-of-the-marvels"
}