{
  "title": "The World Cannot Give",
  "description": "How far would you go after finding something–or someone–worthy of devotion?...    Don't miss the novel Vogue calls \"The Secret History meets The Price of Salt\", following an impressionable new student at an elite boarding school who falls in with the devoted members of a cultish choir group on campus, impassioned by their hunger for transcendence and, especially, the charismatic girl who rules over them… When shy, sensitive Laura Stearns arrives at St. Dunstan’s Academy in Maine, she dreams that life there will echo her favorite novel, All Before Them, the sole surviving piece of writing by Byronic “prep school prophet” (and St. Dunstan’s alum) Sebastian Webster, who died at nineteen, fighting in the Spanish Civil War. She soon finds the intensity she is looking for among the insular, Webster-worshipping members of the school’s chapel choir, which is presided over by the charismatic, neurotic, overachiever Virginia Strauss. Virginia is as fanatical about her newfound Christian faith as she is about the miles she runs every morning before dawn. She expects nothing short of perfection from herself—and from the members of the choir. Virginia inducts the besotted Laura into a world of transcendent music and arcane ritual, illicit cliff-diving and midnight crypt visits: a world that, like Webster’s novels, finally seems to Laura to be full of meaning. But when a new school chaplain challenges Virginia’s hold on the “family” she has created, and Virginia’s efforts to wield her power become increasingly dangerous, Laura must decide how far she will let her devotion to Virginia go. The World Cannot Give is a shocking meditation on the power, and danger, of wanting more from the world.",
  "genres": [
    "Dark Academia",
    "Fiction",
    "Lesbian",
    "LGBT",
    "Contemporary",
    "Queer",
    "Thriller"
  ],
  "author": "Tara Isabella Burton",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/56917550-the-world-cannot-give"
}