{
  "title": "Journey to the West: A Long March from Eastern Dream to Western Reality",
  "description": "Biao Wang's memoir 'JOURNEY TO THE WEST' is a fascinating account of the passage of a poor boy from a small, impoverished rural Chinese village to a brilliant, international commercial career and will read as a truly inspiring example of what can be achieved from the least promising background through determination and imagination. A potted history of modern China leads seamlessly into the story of a young man who, with a combination of remarkable foresight, dedication and courage, has built several successful businesses and established himself at a remarkably young age as a leader in international commercial co-operation. Here is somebody who has grasped life eagerly, and what his buoyant tale demonstrates is the importance of seeing opportunity and unhesitatingly pursuing it; the story bursts with energy and practical wisdom without any sense of self-importance, whilst taking us stage by stage through Biao's interesting life. From his relatively carefree, if impoverished, childhood in a small village, he takes us, unhurriedly through his education and early struggles, to his great leap forward when he bravely sets out for the unknown world of England, determined to immerse himself in its culture rather than retreating into the comfortable familiarity of his compatriots, seizing opportunities as they arise, always aware of his place in the wider scheme of things. The narrative offers an intriguing picture of life in contemporary China, and on the way explains much about the Chinese character and attitudes. His insights into what makes for success are almost incidental as we follow his journey from grinding poverty to commercial achievement. Those from similar backgrounds in any part of the world can take courage from this eloquent account of the power of determination; readers anywhere can share in his infectious enthusiasm for life and all the opportunities it offers. “JOURNEY TO THE WEST” is also a timely reminder, at a time when the emerging power of China is seen as a threat to the West, that we are all one species, with the same needs and desires, as through his storytelling Biao Wang gives China and the Chinese a human face. “JOURNEY TO THE WEST” is a cultural bridge as well as a thoroughly enjoyable and absorbing read. As Biao Wang most eloquently says “having travelled the world and witnessed many inequalities and the problems such different starting blocks can bring, if I’ve learned anything, it is that success is always possible, whatever your situation and however your life begins.” So, fasten your seat belts and take note as you travel from one extraordinary chapter to another – it should be an inspiration to us all. The Confucius Institute in London and LSE invited Biao to do a book launch of his book as part of their Chinese New Year celebration in March 2021. Here is the link to the talk about his",
  "genres": [
    "Nonfiction",
    "Memoir",
    "China",
    "History"
  ],
  "author": "Biao  Wang",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/56921501-journey-to-the-west"
}