{
  "title": "100 Things We've Lost to the Internet",
  "description": "The acclaimed editor of The New York Times Book Review takes readers on a nostalgic tour of the pre-Internet age, offering powerful insights into both the profound and the seemingly trivial things we've lost.NAMED ONE OF THE TEN BEST BOOKS OF THE YEAR BY CHICAGO TRIBUNE AND THE DALLAS MORNING NEWS • “A deft blend of nostalgia, humor and devastating insights.”— PeopleRemember all those ingrained habits, cherished ideas, beloved objects, and stubborn preferences from the pre-Internet age? They’re gone.To some of those things we can say good riddance. But many we miss terribly. Whatever our emotional response to this departed realm, we are faced with the fact that nearly every aspect of modern life now takes place in filtered, isolated corners of cyberspace—a space that has slowly subsumed our physical habitats, replacing or transforming the office, our local library, a favorite bar, the movie theater, and the coffee shop where people met one another’s gaze from across the room. Even as we’ve gained the ability to gather without leaving our house, many of the fundamentally human experiences that have sustained us have disappeared.In one hundred glimpses of that pre-Internet world, Pamela Paul, editor of The New York Times Book Review, presents a captivating record, enlivened with illustrations, of the world before cyberspace—from voicemails to blind dates to punctuation to civility. There are the small postcards, the blessings of an adolescence largely spared of documentation, the Rolodex, and the genuine surprises at high school reunions. But there are larger repercussions, weaker memories, the inability to entertain oneself, and the utter demolition of privacy.100 Things We’ve Lost to the Internet is at once an evocative swan song for a disappearing era and, perhaps, a guide to reclaiming just a little bit more of the world IRL.",
  "genres": [
    "Nonfiction",
    "History",
    "Essays",
    "Audiobook",
    "Self Help",
    "Technology",
    "Humor"
  ],
  "author": "Pamela Paul",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/56913168-100-things-we-ve-lost-to-the-internet"
}