{
  "title": "Hypnosis Is for Hacks",
  "description": "The latest novel in Tamara Berry’s charmingly quirky series weaves a hint of magic and romance into a smartly written, witty, and unpredictable cozy mystery, as an American faux-medium with latent supernatural gifts starts over in a quaint English village—and finds a new career, new love, and lots of intrigue.Eleanor Wilde has traded a career as a sham medium for a (relatively) respectable life in a small English town, providing the locals with herbal remedies and elixirs. But on a trip to the seaside town of Brighton, her past comes calling—and so does a killer...Though Eleanor is delighted that her brother, Liam, is visiting her in England, she must reluctantly agree that her quiet village lacks something when it comes to sightseeing— sights. True, there’s nearby Castle Hartford, belonging to the family of Ellie’s boyfriend, Nicholas. But even Nicholas’s mother is eager to ditch sleepy, sweltering Sussex for a vacation in Brighton, taking Ellie and a relieved Liam with her. Yet hopes of a breezy seaside holiday quickly turn stormy, in every sense...The ominous change in weather is accompanied by the reappearance of Ellie’s former partner-in-crime, Armand Lamont. Back when Ellie earned a living as a phony medium, Armand’s hypnosis skills helped the pair persuade many gullible marks to hand over their savings. Ellie assumes that Armand has resurfaced with blackmail in mind, but before she can figure out his angle, she and Liam witness a man being pushed from a boat by two shadowy figures who then vanish into midair.Phantoms? Demons? Though Ellie doesn’t believe in either, the recovered body is real enough, as is a string of thefts plaguing their luxury hotel. Ellie has a theory, and it requires inviting Nicholas to join them under a fake identity. Their evolving relationship is as complex as this case, and Ellie’s authentic supernatural abilities too are developing in surprising ways. But as for whether the outcome will be good or bad, not even her witchy powers can say...",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Paranormal",
    "Romance",
    "Fiction",
    "Cozy",
    "Contemporary"
  ],
  "author": "Tamara Berry",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/56916889-hypnosis-is-for-hacks"
}