{
  "title": "They Called Us \"Lucky\": The Life and Afterlife of the Iraq War's Hardest Hit Unit",
  "description": "From the Arizona Congressman, a \"powerful\" and \"searing\" (PW) chronicle of the eternal bonds forged between the Marines of Lima Company, the hardest-hit unit of the Iraq WarAt first, they were “Lucky Lima.” Infantryman Ruben Gallego and his brothers in Lima Company—3rd Battalion, 25th Marines, young men drawn from blue-collar towns, immigrant households, Navajo reservations—returned unscathed on patrol after patrol through the increasingly violent al Anbar region of Iraq, looking for weapons caches and insurgents trying to destabilize the nascent Iraqi government. After two months in Iraq, Lima didn't have a casualty, not a single Purple Heart, no injury worse than a blister. Lucky Lima.Then, in May 2005, Lima’s fortunes flipped. Unknown to Ruben and his fellow grunts, al Anbar had recently become a haven for al Qaeda in Mesopotamia. The bin Laden-sponsored group had recruited radicals from all over the world for jihad against the Americans. On one fateful day, they were lured into a death house; the ambush cost the lives of two men, including a platoon sergeant. Two days later, Ruben’s best friend, Jonathon Grant, died in an IED attack, along with several others. Events worsened from there. A disastrous operation in Haditha in August claimed the lives of thirteen Marines when an IED destroyed their amphibious vehicle. It was the worst single-day loss for the Marines since the 1983 Beirut bombings. By the time 3/25 went home in November, it had lost more men than any other single unit in the war. Forty-six Marines and two Navy Corpsmen serving with the battalion in Iraq were killed in action during their roughly nine-month activation.They Called Us “Lucky” details Ruben Gallego’s journey and includes harrowing accounts of some of the war’s most costly battles. It details the struggles and the successes of Ruben—now a member of Congress—and the rest of Lima Company following Iraq, examining the complicated matter of PTSD. And it serves as a tribute to Ruben’s fallen comrades, who made the ultimate sacrifice for their country.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "War",
    "Memoir",
    "Biography Memoir",
    "Politics"
  ],
  "author": "Ruben Gallego",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/56922664-they-called-us-lucky"
}