{
  "title": "How It Feels to Be Free: Black Women Entertainers and the Civil Rights Movement",
  "description": "Winner of the Benjamin L. Hooks National Book AwardWinnter of the Michael Nelson Prize of the International Association for Media and History In 1964, Nina Simone sat at a piano in New York's Carnegie Hall to play what she called a \"show tune.\" Then she began to sing: \"Alabama's got me so upset/Tennessee made me lose my rest/And everybody knows about Mississippi Goddam!\" Simone, and her song, became icons of the civil rights movement. But her confrontational style was not the only path taken by black women entertainers. br>In How It Feels to Be Free, Ruth Feldstein examines celebrated black women performers, illuminating the risks they took, their roles at home and abroad, and the ways that they raised the issue of gender amid their demands for black liberation. Feldstein focuses on six women who made names for themselves in the music, film, and television industries: Simone, Lena Horne, Miriam Makeba, Abbey Lincoln, Diahann Carroll, and Cicely Tyson. These women did not simply mirror black activism; their performances helped constitute the era's political history. Makeba connected America's struggle for civil rights to the fight against apartheid in South Africa, while Simone sparked high-profile controversy with her incendiary lyrics. Yet Feldstein finds nuance in their careers. In 1968, Hollywood cast the outspoken Lincoln as a maid to a white family in For Love of Ivy, adding a layer of complication to the film. That same year, Diahann Carroll took on the starring role in the television series Julia. Was Julia a landmark for casting a black woman or for treating her race as unimportant? The answer is not clear-cut. Yet audiences gave broader meaning to what sometimes seemed to be apolitical performances. How It Feels to Be Free demonstrates that entertainment was not always just entertainment and that \"We Shall Overcome\" was not the only soundtrack to the civil rights movement. By putting black women performances at center stage, Feldstein sheds light on the meanings of black womanhood in a revolutionary time.",
  "genres": [
    "History",
    "Music",
    "Feminism",
    "Nonfiction",
    "American History",
    "Biography",
    "African American"
  ],
  "author": "Ruth Feldstein",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/5692148-how-it-feels-to-be-free"
}