{
  "title": "Maiden Voyages: Women and the Golden Age of Transatlantic Travel",
  "description": "Migrants and millionairesses, refugees and aristocrats all looking for a way to improve their lives. After WW1 a world of opportunity was opening up for women ... Before convenient air travel, transatlantic travel was the province of the great ocean liners and never more so than in the glory days of the interwar years. It was an extraordinary undertaking made by many women. Some travelled for leisure, some for work; others to find a new life, marriage, to reinvent themselves or find new opportunities. Their stories have remained largely untold - until now.Maiden Voyages is a fascinating portrait of these women, and their lives on board magnificent ocean liners as they sailed between the old and the new worlds. The ocean liner was a microcosm of contemporary society, divided by class: from the luxury of the upper deck, playground for the rich and famous, to the cramped conditions of steerage or third class travel. These iconic liners were filled with women of all ages, classes and backgrounds: celebrities and refugees, migrants and millionairesses, aristocrats and crew members.Full of incredible gossip, stories and intrigue, Maiden Voyages has a diverse cast of inspiring women - from A-listers like Josephine Baker, a dancer from St Louis who found fame in Paris, Marlene Dietrich and Wallis Simpson, Violet 'the unsinkable' Jessop, a crew member who survived the sinking of the Titanic, and entrepreneur Sibyl Colefax, a pioneering interior designer.Whichever direction they were travelling, whatever hopes they entertained, they were all under the spell of life at sea, a spell which would only break when they went ashore. Maiden Voyages is a compelling and highly entertaining account of life on board: part dream factory, part place of work, independence and escape - always moving.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel",
    "Feminism",
    "Historical",
    "War",
    "Womens"
  ],
  "author": "Siân Evans",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/56912432-maiden-voyages"
}