{
  "title": "Major Labels: A History of Popular Music in Seven Genres",
  "description": "An epic achievement and a huge delight, the entire history of popular music over the past fifty years refracted through the big genres that have defined and dominated it: rock, R&B, country, punk, hip-hop, dance music, and popKelefa Sanneh, one of the essential voices of our time on music and culture, has made a deep study of how popular music unites and divides us, charting the way genres become communities. In Major Labels, Sanneh distills a career's worth of knowledge about music and musicians into a brilliant and omnivorous reckoning with popular music--as an art form (actually, a bunch of art forms), as a cultural and economic force, and as a tool that we use to build our identities. He explains the history of slow jams, the genius of Shania Twain, and why rappers are always getting in trouble.Sanneh shows how these genres have been defined by the tension between mainstream and outsider, between authenticity and phoniness, between good and bad, right and wrong. Throughout, race is a powerful touchstone: just as there have always been Black audiences and white audiences, with more or less overlap depending on the moment, there has been Black music and white music, constantly mixing and separating. Sanneh debunks cherished myths, reappraises beloved heroes, and upends familiar ideas of musical greatness, arguing that sometimes, the best popular music isn't transcendent. Songs express our grudges as well as our hopes, and they are motivated by greed as well as idealism; music is a powerful tool for human connection, but also for human antagonism. This is a book about the music everyone loves, the music everyone hates, and the decades-long argument over which is which. The opposite of a modest proposal, Major Labels pays in full.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Audiobook",
    "Pop Culture",
    "Art",
    "Cultural"
  ],
  "author": "Kelefa Sanneh",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/56912932-major-labels"
}