{
  "title": "An Ember in the Dark",
  "description": "The war cut him in two. Only she can stitch his torn soul, if he’ll let her in...Born to a family of poor tailors, Lucia Perona has two talents: sewing and looking nearly identical to Princess Bianca of Silen. When a dark-elf warband begins to tear the kingdom apart, the princess and several highborn ladies are to be sent to a monastery for their safety. But to protect the princess, Lucia is sent in her stead. If only the dark-elf warlord leading the enemy didn’t see the value of trading hostages for territory… and cared to respect the holiness of a monastery.Dakkar grew up the son of a queen, raised to honor strength, the ways of the Deep and Darkness, and the power of his royal mother. A human once stole his immortal life, yet the queendoms form a peace with an entire kingdom of selfish and untrustworthy humans, transgressions seemingly forgiven. Appalled, Dakkar leaves everything he knows to avenge victims like him and lead a warband of like-minded dark-elves to reclaim their dignity. After a few successful raids on human territories, he learns of a way to acquire more, bloodlessly: acquiring valuable hostages to ransom. If only the most valuable of these hostages wasn’t so troublesome. If only she didn’t disprove his assumptions about humans at every turn...As the humans and the queendoms negotiate for the women’s freedom, Lucia continually chafes against her bonds and attempts to free herself and her friends, so much so that Dakkar shackles her to him. Forced to endure his presence, she seeks to demonstrate her people’s strength at every opportunity--and find a way to end her captor. Only… when the time comes, she thwarts an attempt on his life. Hated by her fellow captives and looked upon with suspicion by Dakkar, she becomes responsible for their continued imprisonment...and devising a way to end it, without the aid she spurned.The might of the allied queendoms and a human king threaten to rip the warband--as well as Dakkar and Lucia--apart, and if Lucia can’t repair the damage she caused, she’ll lose everything she never knew she wanted, and he’ll lose the half of his soul he never knew he needed. Can Lucia help a warlord see hope in the darkness, or will they lose each other… and the people they’ve hopelessly trapped along with them?If you like the fantasy and romance of Elizabeth Vaughan’s Warprize and a marriage of The Prince & the Pauper and Beauty & the Beast, AN EMBER IN THE DARK will grab you and not let go.Preorder An Ember in the Dark today to journey into a medieval world of magic and Immortals, princesses and paupers, blood and passion, and enemies who could become lovers…",
  "genres": [],
  "author": "Miranda Honfleur",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/56913270-an-ember-in-the-dark"
}