{
  "title": "Fake Invisible Catastrophes and Threats of Doom",
  "description": "Here is Dr. Patrick Moore's description of his unique thesis as presented in Fake Invisible Catastrophes and Threats of Doom.\"It dawned on me one day that most of the scare stories in the media today are based on things that are invisible, like CO2 and radiation, or very remote, like polar bears and coral reefs. Thus, the average person cannot observe and verify the truth of these claims for themselves. They must rely on activists, the media, politicians, and scientists - all of whom have a huge financial and/or political interest in the subject - to tell them the truth. This is my effort, after 50 years as a scientist and environmental activist, to expose the misinformation and outright lies used to scare us and our children about the future of the Earth. Direct observation is the very basis of science. Without verified observation it is not possible to know the truth. That is the sharp focus of this book.\"The book contains 98 color photographs, illustrations, and charts. A key target audience is parents who do not approve of the \"progressive\" school curriculum and its alarmism about the future of civilization and the natural world. Dr. Moore hopes these parents will read his book and pass it on to their high-school and older children to give them an alternative to the bleak future predicted by the merchants of doom. Many other audiences will also find the book informative and convincing. In 11 chapters the reader is clearly shown that citizens are being misinformed by so many environmental doomsday prophesies, ones they cannot verify for themselves. We are told that nuclear energy is very dangerous when the numbers prove it is one of the safest technologies. We are told polar bears will go extinct soon when their population has been growing steadily for nearly 50 years. We are told that there is something harmful in genetically modified food crops when it is invisible, has no name and no chemical formula. We are told severe forest fires are caused by climate change when they are actually caused by poor management of fuel load (dead wood) in the forest. We are told that all the coral reefs will die by 2100 when in fact the most diverse coral reefs are found in the warmest oceans in the world. And of course, we are told that invisible CO2 from using fossil fuels, accounting for more than 80 percent of our energy supply, will make the Earth too hot for life. All of these scare stories, and many more, are simply not true. And this book will convince you, your family, and your colleagues of that. There is no substitute for the truth. Dr. Patrick Moore was one of the co-founders of Greenpeace and sailed on the first Greenpeace campaign against US H-bomb tests in Alaska. Upon receiving his PhD in ecology, he spent 15 years in the top committee of Greenpeace and led many of its environmental campaigns. Greenpeace began as a group of volunteers with noble intentions. Over the years it became very successful with campaigns to save the whales, stop the mass slaughter of baby seals, prevent toxic dumping into the air, water and earth, and many more. Greenpeace found itself in the early 1980s with more than $100 million coming in annually and close to 1,000 people on the payroll. It had become a business and fundraising moved to the top of the priority list. New campaigns were more about using sensationalism, misinformation and fear to attract donations. Dr. Moore said good-bye in 1986 as Greenpeace was turning into a racket peddling junk science. Since then he has strived to be a sensible environmentalist, basing his beliefs on sound science and logical thinking. This book is the culmination of 50 years of learning during Dr. Moore's multi-faceted quest for the truth about environmental issues (an historical account of Dr. Moore's 15 years with Greenpeace and his analysis of environmental subjects are in his previous book, \"Confessions of a Greenpeace Dropout - The Making of a Sensible Environmentalist, also on Amazon).",
  "genres": [
    "Nonfiction",
    "Science",
    "Politics",
    "Environment",
    "Climate Change",
    "Biology",
    "History"
  ],
  "author": "Patrick             Moore",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/56918041-fake-invisible-catastrophes-and-threats-of-doom"
}