{
  "title": "Dearest Josephine",
  "description": "Love arrives at the most unexpected time . . . 1821: Elias Roch has ghastly luck with women. He met Josephine De Clare once and penned dozens of letters hoping to find her again.2021: Josie De Clare has questionable taste in boyfriends. The last one nearly ruined her friendship with her best friend.Now, in the wake of her father's death, Josie finds Elias's letters. Suddenly she's falling in love with a guy who lived two hundred years ago. And star-crossed doesn't even begin to cover it . . .  “Dearest Josephine is the type of story that becomes your own. The characters’ heartaches worked their way into my own chest until I hurt with them, hoped with them, and dared to dream with them. This book is teeming with swoon-worthy prose, adorable humor, and an expert delivery of  ‘Will they end up together?’ I guarantee you’ll be burning the midnight candle to a stub to get answers. Step aside Pride and Prejudice, there’s a new romance on the English moors.” —Nadine Brandes, author of Romanov“Caroline George infuses an epistolary love story with a romance and charm that crosses centuries. Touching and inventive, it bursts with wit, warmth, and a blending of classic and contemporary that goes together like scones and clotted cream. Dearest Josephine is a delight.” —Emily Bain Murphy, author of The Disappearances “Dearest Josephine is more than an immersive read. It is a book lover’s dream experience.  Josie’s residence in a gothic English manor and her deeply romantic connection to Elias, who lived years in the past, is as chillingly atmospheric as Rochester calling across the moors. This story is George’s treatise on the power of books and character to creep across centuries, to pull us close and invite us to live in a fantasy where we find love—literally—in the kinship of ink and binding. But it also acknowledges the dangers of letting ourselves fall too deeply when sometimes an equally powerful connection is waiting next door. This love letter to books, and the readers who exist in and for them, is a wondrously singular escape.” —Rachel McMillan, author of The London Restoration and The Mozart Code Romantic and evocative read in both contemporary and historical time periodsStand-alone novelBook 86,000 wordsIncludes discussion questions for book clubs",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Young Adult",
    "Contemporary",
    "Historical",
    "Fiction",
    "Time Travel"
  ],
  "author": "Caroline   George",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/56918453-dearest-josephine"
}