{
  "title": "#SayHerName: Black Women's Stories of State Violence and Public Silence",
  "description": "Since the movement's founding in 2014, #SayHerName has gained international attention and has served as both a rallying cry and organizing principle in the aftermath of police killings of Black women, including, most recently, the police killing of Breonna Taylor.Black women, girls, and femmes as young as seven and as old as ninety-three have been killed by the police, though we rarely hear their names or learn their stories. Breonna Taylor, Alberta Spruill, Rekia Boyd, Shantel Davis, Shelly Frey, Kayla Moore, Kyam Livingston, Miriam Carey, Michelle Cusseaux, and Tanisha Anderson are among the many lives that should have been. The #SayHerName campaign lifts up the stories of these women and girls in order to build a gender-inclusive framework for understanding, discussing, and combating police violence.Without this knowledge, we cannot have a full understanding of the wide-ranging circumstances that make Black bodies disproportionately subject to police violence, and we cannot understand the ways in which racialized policing and gendered violence intersect and produce lethal consequences. #SayHerName provides an analytical framework for understanding Black women's susceptibility to police brutality and state-sanctioned violence, and it explains how-through black feminist storytelling and ritual-we can effectively mobilize various communities and empower them to advocate for racial justice.Including Black women in police violence and gender violence discourses sends the powerful message that, in fact, all Black lives matter and that the police cannot kill without consequence. This is a powerful story of Black feminist practice, community-building, enablement, and Black feminist reckoning.\"Kimberle Crenshaw is a national treasure.\"—Kerry Washington",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Social Justice",
    "Politics",
    "Race",
    "History",
    "Anti Racist"
  ],
  "author": "Kimberlé Crenshaw",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/56939508-sayhername"
}