{
  "title": "New Inspiration for the Lonely Rockstar",
  "description": "Wally Chastain is wildly talented an his fans idolize him and the music his band makes. He’s happy when he’s writing but performing is the rush that keeps him alive.Shiloh Whitefeather is a free spirit who gets as much as she can out of life every day. Optimism and being a light for others is part of who she is in spite of the difficulties she’s facing.An unusual electricity vibrates between her and the rockstar gorgeous man she meets by chance at her second job. He looks familiar, but she can’t place him. They swap numbers and she doesn’t recognize his name. She wouldn’t since it’s fake.Unexpectedly, she hears from him. She’d been sure she’d never hear from him again which was mainly the reason she’d given him her number.While being the lifeline he needs from doubt and loneliness, she’s opening up to him more than she has to anyone else. Money’s still tight for her, but at least her mother’s treatment is going well. She’s so thankful for that and also the understanding from Wally who is becoming her best friend.But he isn’t the person she thinks he is.When the secret of his true identity comes out everything falls apart. He’s lost his inspiration and she’s lost her voice of reason.Can she forgive his lies even when she finds out why he kept the truth from her? Can she really be in love with someone she thinks she doesn’t know?Everything's bigger in Texas. Even redemption.~-~-~-~-~-~Read a sweet cowboy romance series - Billionaire Ranchers - by April Murdock:1. Impressing Her Billionaire Cowboy Boss2. Keeping Her Billionaire Cowboy CEO3. Saving Her Billionaire Cowboy Hero4. Loving Her Billionaire Cowboy Partner5. Arguing With Her Billionaire Cowboy6. Teaching Her Billionaire Cowboy RookieThe Brothers of Thatcher Ranch by April Murdock:1. The Cowboy's One and Only2. The Cowboy's City Girl3. The Cowboy's Troublemaker4. The Cowboy's Second ChanceAnd you can also read all the books in the Wealth and Kinship billionaires series:1. The Billionaire's Heart2. The Billionaire's Hope3. The Billionaire's Generosity",
  "genres": [],
  "author": "April Murdock",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/56937377-new-inspiration-for-the-lonely-rockstar"
}