{
  "title": "The Belle and the Beard",
  "description": "Jasper-Anne Cleary’s guide to salvaging your life when you find yourself publicly humiliated, out of work, and unemployable at 35—not to mention newly single:1. Run away. Seriously, there’s no shame in disappearing. Go to that rustic old cottage your aunt left you. Look out for the colony of bats and the leaky roof. Oh, and the barrel-chested neighbor with shoulders like the broad side of a barn. Definitely look out for him.2. Stop wallowing and stay busy. It doesn’t matter whether you know how to bake or fix things around the house. Do it anyway. Dust off your southern hospitality and feed that burly, bearded neighbor some pecan pie.3. Meet new people. Chat up the grumpy man-bear, pretend to be his girlfriend when his mother puts you two on the spot, agree to go as his date to a big family party. Don’t worry—it’s only temporary.4. Cry it out. Screwing up your life entitles you to wine, broody-moody music, and uninterrupted sobbing. 5. Get over it all by getting under someone. Count on your fake boyfriend to deliver some very real action between the sheets. 6. Move on. The disappearing act, the cottage, the faux beau—none of it can last forever. Linden Santillian’s guide to surviving the invasion when a hell-in-heels campaign strategist moves in next door:1. Do not engage. There is no good reason you should chop her wood, haul her boxes, or pick her apples.2. Do not accept gifts, especially not the homemade ones. Disconnect the doorbell, toss your phone over a bridge, hide in the basement if you must, but do not eat her pie. 3. Do not introduce her to your friends and family. They’ll favor her over you and never let you forget it.4. Do not intervene when she’s crying on the back porch. Ignore every desire to fix the entire world for her. By no means should you take her into your arms and memorize her peach-sweet curves. 5. Do not take her to bed, even if it’s just to get her out of your system.6. Do not, under any circumstances, fall in love with her.Warning: This hot, modern take on Beauty and the Beast includes a meet-burglary, an immortal cat, a biohazard of a banana bread, a meddling mother, fancy toast, and a temporary fling that starts feeling a little too permanent.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Audiobook",
    "Forced Proximity",
    "Adult"
  ],
  "author": "Kate Canterbary",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/56938365-the-belle-and-the-beard"
}