{
  "title": "Rudolf Steiner: An Introduction to His Life and Work",
  "description": "The first truly popular biography of the influential twentieth-century mystic and educator who-while widely known for founding the Waldorf schools and other educational and humanitarian movements-remains a mystery to many who benefit from his ideas.People everywhere have heard of Waldorf schools, Biodynamic farming, Camphill Villages, and other innovations of the Austrian philosopher Rudolf Steiner (1861-1925). Indeed, Steiner—as an architect, artist, teacher, and agriculturalist—ranks among the most creative and prolific figures of the early twentieth century, pioneering work in alternative education, holistic health, and environmental research.While his accomplishments are felt all over the world, few people understand this unusual figure. Steiner's own writings and lectures fill several bookcases, intimidating those who would like to know more. Works on Steiner are often dense and \"insider\" in tone, further deterring the curious. No popular biography, written by a sympathetic but critical outsider, has been available.Gary Lachman's Rudolf Steiner provides this missing introduction. Along with telling Steiner's story and placing Steiner in his historical context, Lachman's book presents Steiner's key ideas in a readable, accessible manner. In particular, Lachman considers the spread of Steiner's most popular projects, which include Waldorf schools-one of the leading forms of alternative education-and Biodynamic farming-a popular precursor to organic farming. He also traces Steiner's beginnings as a young intellectual in the ferment of fin de siécle culture, to his rise as a thought leader within the influential occult movement of Theosophy, to the founding of his own metaphysical teaching called Anthroposophy.Finally, the book illustrates how Steiner's methods are put into practice today, and relates Steiner's insights into cosmology to the work of current thinkers.Rudolf Steiner is a full-bodied portrait of one of the most original philosophical and spiritual luminaries of the last two centuries, and gives those interested in the history of ideas the opportunity to discover one of the most underappreciated figures of the twentieth century.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Philosophy",
    "Religion",
    "History",
    "Occult",
    "Psychology"
  ],
  "author": "Gary Lachman",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/569376.Rudolf_Steiner"
}