{
  "title": "Where the Briars Sleep",
  "description": "In this early nineteenth-century gothic ghost story, Rose Shedd discovers something is stalking her, something unseen and filled with rage, something that demands recompense, and Rose’s life, the life of her sister, and the remnants of her family depend on memories she has forced herself to forget.She couldn’t imagine being alone in the dark, the wardrobe looming over her, its door creaking, hangers rattling. Anything could sneak up on you in the dark when you closed your eyes. Anything. Arriving back at her home estate, the first thing Rose does is visit her stepsister Sarah’s grave, taking her younger sister, Maggie, along. After a forced retreat at the cousins', Rose looks forward to some normalcy and a return to routine. Not to mention the unexpected upcoming ball hosted by their elusive neighbors to introduce their son Henry, who has been away. Perhaps this mysterious Henry may become interested in Rose. Or most likely he would become her younger sister's fourth suitor and Rose would endure more “old maid” banter. With the oppressive heat and unpredictable weather, Rose and Maggie are caught in a sudden severe thunderstorm. Maggie makes it back before the sky unleashes its fury, but Rose is caught behind. She really doesn’t mind, however, because she loves the rain and the wind and the gardens and could stay outside their stuffy mansion forever. Away from the wardrobe. In the midst of the storm, Rose is cut by a briar and becomes caught in the mud. She sees a woman on their front porch. Maggie? “Help me, Maggie!” But the woman is gone. From then on, nothing and no one are as they seem in this twisted gothic Victorian ghost story. A tale of three sisters, family secrets of the darkest nature, and how our decisions have ripple effects, with themes of nature, romance, family, faith, forgiveness, consequences, and a creepy wardrobe with a door that never quite shuts that will have you sleeping with the lights on.",
  "genres": [
    "Horror",
    "Gothic"
  ],
  "author": "Emma  Beaven",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/56943804-where-the-briars-sleep"
}