{
  "title": "Tiny Victory Gardens: Growing Food Without a Yard",
  "description": "Climate activist and farmer Acadia Tucker fell in love with container gardening after glimpsing its potential to produce food—lots of food. By applying select growing practices, and managing for square inches rather than square feet, she has come up with instructions for growing a small-scale farm in your patio, on your stoop, or in your dining room. If all you want is a garden just big enough to line a windowsill, she’s got you covered there, too. Her goal is to make it easier for anyone with access to a patch of sun to grow and harvest food—year round, if you’d like. No backyard required. Tiny Victory Gardens includes step-by-step guidance on finding the right containers (there are wrong ones), prepping your soil, growing plants indoors and outdoors, and raising crops all year long. It profiles 21 crops that are easy to grow in containers, including tomatoes, lemon trees, and avocados, and includes recipes for cultivating mini farms in pots, with names like Tiny Herb Garden, Griller’s Choice, and Beans, Bees, and Butterflies. As she has in all her gardening books, Acadia describes how to maximize the environmental impact of growing food. She offers tips on attracting pollinators, and how to build microbe-rich living soil. She shares hacks that help you cut back on watering, and how to ditch harmful pesticides and fertilizers. She also makes a case for why it’s practical to develop food gardening skills in a climate-whipped world.Part of the inspiration for this book is the victory garden movement that was so popular during World Wars I and II, when US citizens turned out in force to do their patriotic duty and grow food for their country. It’s time for another victory garden movement, writes Acadia. If more of us commit to growing our own food, and do it in a way that’s good for the planet, we can buffer some of the effects of climate change, and promote food resilience, for ourselves and for our neighborhoods.Acadia Tucker has published Growing Perennial Foods and Growing Good Food, which describe how to grow food in your backyard in a way that’s good for the planet. Tiny Victory Gardens is another addition to the Stone Pier Press citizen gardening series, which also includes Lawns Into Meadows",
  "genres": [
    "Gardening",
    "Nonfiction",
    "Food",
    "Sustainability",
    "Health",
    "Environment"
  ],
  "author": "Acadia Tucker",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/56931631-tiny-victory-gardens"
}