{
  "title": "Donk and the Stubborn Donkeys",
  "description": "#1 Bestseller Juvenile Fiction > Animals > Farm Animals Donk the donkey lives on Donkey Farm with his family. He may be the youngest of all his brothers and sisters, but boy, he is definitely the most curious of them all! Because his older siblings chase him away when he tries to play with them, Donk spends a lot of time alone. Being the deep thinker that he is, this little donkey questions everything and fills his days trying to work out why certain things are the way they are. One day, Donk decides to try and find out the answer to a particular question that’s been on his mind for a while. He cannot understand why the farmer is always shouting at him and the other donkeys on Donkey Farm, and why the farmer asks them why they are all so stubborn. Donk approaches everyone in his family, one by one, asking them to help him with his burning question. But his search is all in vain and poor Donk ends up none the wiser. Everybody seems too busy to explain properly and they all give him exactly the same answer. Apparently, that’s “just the way it is”. Feeling frustrated and dissatisfied with everybody’s identical (and quite frankly, very unhelpful!) answers, Donk takes a walk by himself by the stream. He is deep in thought when suddenly, he gets the surprise of his life! Jack the purple fairy donkey, the very same one whom his mother has told him about, the wisest donkey in the whole land, is standing right there in front of him! What will happen next? Will Jack be able to help Donk? Could he be the one to finally give him the answer to the question that nobody else can help him with? This charming story explains to children in a relatable way how negative labels are sometimes attached to those who don’t deserve them. Children are encouraged to question what they hear and to make their own decisions, rather than just blindly following the crowd and adopting certain beliefs because “that’s what everybody says”, or “that’s just the way it is”. The value of this story lies in the important lessons it teaches young children – to keep an open mind and to keep searching for answers to their questions. It validates their need to be listened to and encourages them to speak up about things that are bothering them. It also encourages children not to give up when adults seem too preoccupied to help them, but to keep trying until they find someone who is willing to listen to them and to help them out with their problems. This story holds great appeal for children all over the world because Donk is a relatable character who, like them, has many questions that he urgently needs answers to! This delightful donkey experiences the same feelings of confusion, loneliness and frustration that we do all at times, but the happy ending at the end of the story serves as a beacon of hope for any child who has ever wondered, “But why?”",
  "genres": [],
  "author": "K.A.  Mulenga",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/56948782-donk-and-the-stubborn-donkeys"
}