{
  "title": "This Day Changes Everything",
  "description": "Dash & Lily meets Ferris Bueller's Day Off in Edward Underhill's new whirlwind rom-com about two queer teens who spend one life-changing day together in New York City.Abby Akerman believes in the Universe. After all, her Midwest high school marching band is about to perform in the Macy’s Thanksgiving Day Parade in New York City—if that’s not proof that magical things can happen, what is? New York also happens to be the setting of her favorite romance novel, making it the perfect place for Abby to finally tell her best friend Kat that she’s in love with her (and, um, gay). She’s carefully annotated a copy of the book as a gift for Kat, and she’s counting on the Universe to provide an Epic Scene worthy of her own rom-com.Leo Brewer, on the other hand, just wants to get through this trip without falling apart. He doesn’t believe the Universe is magical at all, mostly because he’s about to be outed to his very Southern extended family on national TV as the trans boy he really is. He’s not excited for the parade, and he’s even less excited for an entire day of sightseeing with his band.But the Universe has other ideas. When fate throws Abby and Leo together on the wrong subway train, they soon find themselves lost in the middle of Manhattan. Even worse, Leo accidentally causes Abby to lose her Epic Gift for Kat. So to salvage the day, they come up with a new mission: find a souvenir from every location mentioned in the book for Abby to give Kat instead. But as Leo and Abby traverse the city, from the streets of Chinatown to the halls of Grand Central Station and the top of the Empire State Building, their initial expectations for the trip—and of each other—begin to shift. Maybe, if they let it, this could be the day that changes everything, for both of them.",
  "genres": [
    "Romance",
    "Young Adult",
    "LGBT",
    "Queer",
    "Contemporary",
    "Transgender",
    "Fiction"
  ],
  "author": "Edward  Underhill",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/127284041-this-day-changes-everything"
}