{
  "title": "Unprotected: A Memoir",
  "description": "From Billy Porter, the incomparable Emmy, Grammy, and Tony Award winner, Unprotected is a powerful and revealing autobiography about race, sexuality, art, and healing.“Bold, hilarious, honest, and singular. . . . Unprotected is a record of survival, commitment to authenticity, and healing; a road map out of hell.” —Leslie Odom Jr.It’s easy to be yourself when who and what you are is in vogue. But growing up Black and gay in America has never been easy. Before Billy Porter was slaying red carpets and giving an iconic Emmy-winning performance in the celebrated TV show Pose ; before he was the groundbreaking Tony and Grammy award-winning star of Broadway’s Kinky Boots ; and before he was an acclaimed recording artist, actor, playwright, director, and all-around legend, Porter was a young boy in Pittsburgh who was seen as different, who didn’t fit in. At five years old, Porter was sent to therapy to “fix” his effeminacy. He was endlessly bullied at school, sexually abused by his stepfather, and criticized at his church. Porter came of age in a world where simply being himself was a constant struggle.Billy Porter’s Unprotected is the life story of a singular artist and survivor in his own words. It is the story of a boy whose talent and courage opened doors for him, but only a crack. It is the story of a teenager discovering himself, learning his voice and his craft amid deep trauma. And it is the story of a young man whose unbreakable determination led him through countless hard times to where he is now; a proud icon who refuses to back down or hide. Porter is a multitalented, multifaceted treasure at the top of his game, and Unprotected is a resonant, inspirational story of trauma and healing, shot through with his singular voice.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "LGBT",
    "Biography",
    "Biography Memoir",
    "Queer"
  ],
  "author": "Billy Porter",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/56969425-unprotected"
}