{
  "title": "Flung Out of Space: Inspired by the Indecent Adventures of Patricia Highsmith",
  "description": "A fictional and complex portrait of bestselling author Patricia Highsmith caught up in the longing that would inspire her queer classic, \nThe Price of Salt \nFlung Out of Space is both a love letter to the essential lesbian novel, The Price of Salt, and an examination of its notorious author, Patricia Highsmith. Veteran comics creators Grace Ellis and Hannah Templer have teamed up to tell this story through Highsmith’s eyes—reimagining the events that inspired her to write the story that would become a foundational piece of queer literature.Flung Out of Space opens with Pat begrudgingly writing low-brow comics. A drinker, a smoker, and a hater of life, Pat knows she can do better. Her brain churns with images of the great novel she could and should be writing—what will eventually be Strangers on a Train— which would later be adapted into a classic film by Alfred Hitchcock in 1951.   At the same time, Pat, a lesbian consumed with self-loathing, is in and out of conversion therapy, leaving a trail of sexual conquests and broken hearts in her wake. However, one of those very affairs and a chance encounter in a department store give Pat the idea for her soon-to-be beloved tale of homosexual love that was the first of its kind—it gave the lesbian protagonists a happy ending.   This is not just the story behind a classic queer book, but of a queer artist who was deeply flawed. It’s a comic about what it was like to write comics in the 1950s, but also about what it means to be a writer at any time in history, struggling to find your voice.      Author Grace Ellis contextualizes Patricia Highsmith as both an unintentional queer icon and a figure whose problematic views and noted anti-Semitism have cemented her controversial legacy. Highsmith’s life imitated her art with results as devastating as the plot twists that brought her fame and fortune.",
  "genres": [
    "Graphic Novels",
    "LGBT",
    "Comics",
    "Queer",
    "Biography",
    "Nonfiction",
    "Historical"
  ],
  "author": "Grace Ellis",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/56969413-flung-out-of-space"
}