{
  "title": "The Hidden Kingdom",
  "description": "The perilous and provocative world of Kingdom of the White Sea, by USA Today bestselling fantasy author Sarah M. Cradit, comes to a startling conclusion in The Hidden Kingdom.A kingless crown will fall. A crownless kingdom will rise.It all began with a desperate demand from a broken crown. Four brides. Four Reaches. Unquestionable and absolute fealty from the mothers and fathers who were given no choice but to comply. A startling sequence of events followed, with stunning repercussions that reached across the entire realm.Now, the king is dead. The would-be brides have forged their own destinies—some for the better, others for worse. Not all who started this dance will finish it. Those left will wear the lingering scars with a mix of pride and remorse.From his stolen throne, Oldwin rules with a hand that grows shakier by the hour, as his once unparalleled magic dwindles. His grasp on power is reliant upon his truths remaining hidden by the shadows, just beyond the reach of the fraught kingdom.But Oldwin is not the only powerful sorcerer in the kingdom. There are others who would see the terrible circle of their traitorous past come to a decisive end. Their moonlight maneuvering saved the life of Dain Rhiagain, and from his line the last sprig of hope remains: a chance to save the kingdom... to save all the worlds.Dain’s three children, each raised in obliviousness, must now prepare to confront the staggering truth of why they were born, and what they must now do, if the kingdom is to survive the final days ahead.But theirs is not the only sacrifice required. The dying words of an old man will stir one man and his Reach toward a new destiny, one that will decide the fate of all the worlds...",
  "genres": [
    "Fantasy",
    "Mystery",
    "Young Adult Fantasy",
    "Audiobook",
    "Fiction",
    "Young Adult",
    "High Fantasy"
  ],
  "author": "Sarah M. Cradit",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/56967160-the-hidden-kingdom"
}