{
  "title": "Secrets of a Celtic Mystic: Sacred Earth Prophecy",
  "description": "Catriona MacGregor's Secrets of A Celtic Mystic awakens our hearts, minds, and senses to the deep memories of our species, to the poetry of bird song, and to the detailed wonder of planet Earth and its biosphere. Here, the reader will find life-affirming orientations to gently support involvement in the re-enchantment and re-generation of the world. This book is permeated by the wisdom of a nature mystic, the prophecy of a high priestess - and the penetrating insights of a 21st-century scientist. It is a rare and beautiful repository of authentic soulfulness. Richard Henry Whitehurst - Educator, psychotherapist, Earth poet, author, international speaker, and founder/director of The Overview Institute of Australia, and - planetaryhuman.com﻿﻿The human race faces unprecedented challenges with global warming looming large,and a worldwide pandemic taking millions of lives.​How did we get here, and what lays ahead for our species and all life on Earth?Secrets of a Celtic Mystic not only reveals the underlying societal and economic trendsthat brought us here but also shows the stunning intelligence of the natural world.An intelligence that can guide humanity and the Earth back to health and harmony.Award-winning author Catriona MacGregor Invites readers on an extraordinary journey into the heart of nature to experience the power and mystery of the Wilds. You will come away with a profound understanding of the sacredness of trees and animals and be astonished by new scientific findings that reveal the invisible forces that enliven all things. This book is a stunning evocation of the natural world and opens our eyes to the subtle societal trends that are leading to the disappearance of species and the world we have known. Weaving together science, spirituality, indigenous knowledge, and remarkable true stories, the reader is brought to a deeper understanding of the Earth and the potential each of us has to live a meaningful life in harmony with nature.",
  "genres": [],
  "author": "Catriona  MacGregor",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/56987975-secrets-of-a-celtic-mystic"
}