{
  "title": "Fear of the Abyss: Healing the Wounds of Shame & Perfectionism",
  "description": "Most self-help or personal growth books help people “cope” better with one specific problem that troubles them. While everyone needs coping skills, they are temporary aids that do not increase one’s self-awareness and understanding, as they do not address the root cause of the problem. In focusing on a specific problem or trait, they also fail to recognize that this trait is part of a wider constellation of interlocking issues. Self-help books of a more spiritual bent emphasize “awareness,” but do not show people how to get beyond their defenses to become truly self-aware. Still other books focus on a diagnostic label, such as Panic Disorder or Depression, but do not consider the type of person with these labels and their cause. Fear of the Abyss offers healing for a wounded core by providing specific guidance to those with the core issues of perfectionism and shame, regardless of which issues or diagnoses are on the surface, helping them to let go of that which is defensive or inauthentic. People like these fear facing emotional wounds, and develop their traits to defend against them. The title derives from what they fear on the deepest level—being like a dreaded other, often an abusive parent, or being the way a parent made them feel as a young child. Their fears have intense, varied associations, affecting their everyday lives and relationships. By following the path to their wounded core, readers will develop greater self-awareness, which is the cure for the broader spectrum of issues.  Fear of the Abyss takes complex ideas and makes them accessible to the layperson. It includes exercises designed to gradually and gently guide the reader into more depth and insight, as the readiness develops. It contains clinical vignettes to illustrate each chapter’s main points and to share with readers the healing process of others.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Mental Health",
    "Personal Development"
  ],
  "author": "Aleta Edwards",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/12728463-fear-of-the-abyss"
}