{
  "title": "Travelers Along the Way: A Robin Hood Remix",
  "description": "In the Remixed Classics series, authors from marginalized backgrounds reinterpret classic works through their own cultural lens to subvert the overwhelming cishet, white, and male canon. This thrilling female-led Robin Hood remix reframes the legend’s tales of the Third Crusade from a Muslim perspective, rewriting its origin’s male and overwhelmingly white Euro-centric narrative.Jerusalem, 1192. The Third Crusade rages on. Rahma al-Hud loyally followed her elder sister Zeena into the war over the Holy Land, but now that the Faranji invaders have gotten reinforcements from Richard the Lionheart, all she wants to do is get herself and her sister home alive.But Zeena, a soldier of honor at heart, refuses to give up the fight while Jerusalem remains in danger of falling back into the hands of the false Queen Isabella. And so, Rahma has no choice but to take on one final mission with her sister.On their journey to Jerusalem, Rahma and Zeena come across a motley collection of fellow travelers—including a kind-hearted Mongolian warrior, an eccentric Andalusian scientist, a frustratingly handsome spy with a connection to Rahma's childhood, and an unfortunate English chaplain abandoned behind enemy lines. The teens all find solace, purpose and camaraderie—as well as a healthy bit of mischief—in each other's company.But their travels soon bring them into the orbit of Queen Isabella herself, whose plans to re-seize power in Jerusalem would only guarantee further war and strife in the Holy Land for years to come. And so it falls to the merry band of misfits to use every scrap of cunning and wit (and not a small amount of thievery) to foil the usurper queen and perhaps finally restore peace to the land.Praise for Travelers Along the Way:\"Travelers Along the Way is the Robin Hood retelling I did not know I wanted. Deeply researched and masterfully written, here is a story that’s not only thrilling, but also delightfully clever!\" —Tanaz Bhathena, author of A Girl Like That and Hunted by the Sky\"If you love heists, found family, and stealing from the rich and giving to the poor, then put Aminah Mae Safi's heartfelt and humorous take on Robin Hood at the very top of your TBR.\" —Jodi Meadows, New York Times bestselling co-author of My Lady Jane",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Retellings",
    "Fantasy",
    "Historical",
    "Fiction",
    "Queer"
  ],
  "author": "Aminah Mae Safi",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/56978097-travelers-along-the-way"
}