{
  "title": "Waggs",
  "description": "Aiden Wagner is shattered when his identical twin his blown to pieces in front of his eyes and he can’t do anything to help except hold him as he takes his last breath. In his guilt and grief, he turned to the one person he’d loved from afar, and the one person he never should have touched—his brothers’ fiancée. Their wild night together left him full of shame and bitterness, so he ran to the other side of the world and signed on with Eidolon, a Black Ops team who works for the Crown.Willow knew she was a walking cliché—she’d fallen in love with two men who were so different and yet so alike it was impossible to choose, but in the end, she had. She’d chosen Aaron, and she’d loved him more than anything, except perhaps his twin brother. She’d kept her distance from Aiden, stayed loyal to her fiancé and never acted on her feelings until the night they’d buried Aaron. Then she made the biggest mistake of her life and turned to Aiden for comfort. Leading to a secret she would carry to the grave to protect.Willow’s life is once again thrown into turmoil when she uncovers accounting errors at the haulage company where she works. People are dying around her and soon she and her loved ones become targets. Willow knows Aiden is the only one who can help her and protect the son she’d gladly die for. Going to him is a risk to her heart, but it’s one she’s willing to take to keep her son alive.Even though Waggs has built a new life for himself, Willow is never far from his mind, especially as every year on the anniversary of his brother’s death he seems determined to repeat the mistakes of the past. Now Willow is in trouble and she’s reached out to him for help. A killer is stalking her, and Waggs must put his feelings aside to save the woman he loves more every day before she’s murdered, and he’s left with nothing once again.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Maddie Wade",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/56995708-waggs"
}