{
  "title": "The Man Who Hated Ned O'Leary",
  "description": "“Because you love me no matter how much you hate me.”\nSeven years ago, Cole Flores was betrayed by the man he loved, and his very soul was left charred. He vowed that day that he would find Ned O’Leary and kill him, even if it was the last thing he did.But Ned disappeared, and life went on.Despite the flame of hate burning deep inside him, Cole’s hope to find Ned had dimmed. At least it left behind a lesson to never trust, never love, and never attach himself anywhere. That was the only way for a wanted man to stay off the noose in a world filled with liars and cheats.Just when Cole stops looking for Ned though, he finds the deceptive bastard, and life turns on its head again. Their reunion goes nothing as planned, and unanswered questions rise to the surface, poisoning Cole’s mind with lust and longing that have never gone away.Ned O’Leary is a traitor.Ned O’Leary is a scumbag.Ned O’Leary is everything Cole Flores craves.Torn between love and revenge, lust and sanity, Cole has to find out if the bruised and battered heart of an outlaw can ever trust again, or if he’s bound to fulfill his promise and be Ned O’Leary’s doom.*\nDark, dangerous, yet desperately romantic, \n“The Man Who Hated Ned O’Leary” is a gritty western M/M romance novel and book 2 in the “Dig Two Graves” duology. Prepare for violence, emotional turmoil, and scorching hot, explicit scenes, as well as a Happy Ever After earned with blood, sweat, and tears.POSSIBLE SPOILERS:Themes: Enemies-to-lovers, second chances, revenge, outlaws and cowboys, crime, secrets, loyalty, betrayal, Old West, survival, angst, survivor’s guilt, snowed inLength: ~125,000 words (Book 2 in a duology)WARNING: This story contains scenes of violence, offensive language and morally ambiguous characters as well as sensitive topics of child abuse and suicide",
  "genres": [
    "Historical",
    "M M Romance",
    "Enemies To Lovers",
    "Second Chance",
    "Romance",
    "Westerns",
    "LGBT"
  ],
  "author": "K.A. Merikan",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/56995440-the-man-who-hated-ned-o-leary"
}