{
  "title": "Mad Trapper of Rat River: A True Story Of Canada's Biggest Manhunt",
  "description": "\"The Arctic trails do indeed have their secret tales, and one of the best is that of The Mad Trapper of Rat River , equal to the legends of Bonnie and Clyde or John Dillinger. Now author Dick North (of course) may have solved the mystery of the Mad Trapper's true identity, thereby enhancing the saga.\"--Thomas McIntyre, author of Seasons & A Hunting Life\"A courageous and unrelenting posse on the trail of a furious and desperate wilderness outlaw . . . Lean and bloody, meticulously researched, The Mad Trapper of Rat River is a dark and haunting story of human endurance, adventure, and will that speeds along like the best fiction.\"--Bob Butz, author of Beast of Never, Cat of GodThey called it \"The Arctic Circle War.\" It was a forty-eight-day manhunt across the harshest terrain in the world, the likes of which we will never see again. The quarry, Albert Johnson, was a loner working a string of traps in the far reaches of Canada's Northwest Territories, where winter temperatures average forty degrees below zero.The chase began when two Mounties came to ask Johnson about allegations that he had interfered with a neighbor's trap. No questions were asked. Johnson discharged the first shot through a hole in the wall of his log cabin. When the Mounties returned with reinforcements, Johnson was gone, and The Arctic Circle War had begun.On Johnson's heels were a corps of Mounties and an irregular posse on dogsled. Johnson, on snowshoes, seemed superhuman in his ability to evade capture. The chase stretched for hundreds of miles and, during a blizzard, crossed the Richardson Mountains, the northernmost extension of the Rockies. It culminated in the historic shootout at Eagle River.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Canada",
    "Audiobook",
    "Historical",
    "Adventure"
  ],
  "author": "Dick North",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/569995.Mad_Trapper_of_Rat_River"
}