{
  "title": "Capote's Women: A True Story of Love, Betrayal, and a Swan Song for an Era",
  "description": "New York Times bestselling author Laurence Leamer reveals the complex web of relationships and scandalous true stories behind Truman Capote's never-published final novel, Answered Prayers--the dark secrets, tragic glamour, and Capote's ultimate betrayal of the group of female friends he called his swans.\nThere are certain women, Truman Capote wrote, who, though perhaps not born rich, are born to be rich. Barbara Babe Paley, Gloria Guinness, Marella Agnelli, Slim Hayward, Pamela Churchill, C. Z. Guest, Lee Radziwill (Jackie Kennedy's sister)--they were the toast of midcentury New York, each beautiful and distinguished in her own way. These women captivated and enchanted Capote--and at times, they infuriated him as well. He befriended them, received their deepest confidences, and ingratiated himself into their lives. Then, in one fell swoop, he betrayed them in the most surprising and shocking way possible.Bestselling biographer Laurence Leamer delves into the years following the acclaimed publication of Breakfast at Tiffany's in 1958 and In Cold Blood in 1966, when Capote struggled with a crippling case of writer's block. While enjoying all the fruits of his success--including cultivating close friendships with the richest and most admired women of the era--he was struck with an idea for what he was sure would be his most celebrated novel...one based on the remarkable, racy lives of his very, very rich friends.For years, Capote attempted to write what he believed would have been his magnum opus, Answered Prayers. But when he eventually published a few chapters in Esquire, the thinly fictionalized lives (and scandals) of his closest female confidantes were laid bare for all to see. The blowback incinerated his relationships and banished Capote from their high-society world forever...a world that was already crumbling, though none of them realized it yet. Laurence Leamer recreates in detail the lives of these fascinating swans, their friendships with Capote and one another, and the doomed quest to write what could have been one of the greatest novels of the twentieth century.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Audiobook",
    "Biography Memoir",
    "Historical",
    "New York"
  ],
  "author": "Laurence Leamer",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/57005206-capote-s-women"
}