{
  "title": "Set the Night on Fire",
  "description": "In his tell-all, legendary Doors guitarist, Robby Krieger, one of Rolling Stone 's \"100 Greatest Guitarists of All Time,\" opens up about his band's meteoric career, his own darkest moments, and the most famous black eye in rock 'n' roll.Few bands are as shrouded in the murky haze of rock mythology as The Doors, and parsing fact from fiction has been a virtually impossible task. But now, after fifty years, The Doors' notoriously quiet guitarist is finally breaking his silence to set the record straight. Through a series of vignettes, Robby Krieger takes readers back to where it all the pawn shop where he bought his first guitar; the jail cell he was tossed into after a teenage drug bust; his parents' living room where his first songwriting sessions with Jim Morrison took place; the empty bars and backyard parties where The Doors played their first awkward gigs; the studios where their iconic songs were recorded; and the many concert venues that erupted into historic riots. Set the Night on Fire is packed with never-before-told stories from The Doors' most vital years, and offers a fresh perspective on the most infamous moments of the band's career. Krieger also goes into heartbreaking detail about his life's most difficult struggles, ranging from drug addiction to cancer, but he balances out the sorrow with humorous anecdotes about run-ins with unstable fans, famous musicians, and one really angry monk.  Set the Night on Fire is at once an insightful time capsule of the '60s counterculture, a moving reflection on what it means to find oneself as a musician, and a touching tale of a life lived non-traditionally. It's not only a must-read for Doors fans, but an essential volume of American pop culture history.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "History",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Robby Krieger",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/57007682-set-the-night-on-fire"
}