{
  "title": "Rescuing Annie",
  "description": "She’s smart. She’s tough. She’s strong. She still needs someone to have her back.Nearly all her life, Annie Fletcher has had one goal: becoming a Special Forces soldier. Like her Delta Force father. Like her honorary uncles. She’s had all the support in the world, from family, friends…and from the boy who’s owned her heart since the tender age of seven. With Frankie’s love and encouragement, she’s now an elite Green Beret soldier, captain of her own unit, the culmination of a lifelong dream.So why is it suddenly not enough?Serving her country is everything, but mission after mission, Annie puts her life on the line. Her most recent narrow escape from death puts into sharp focus everything she has to lose—a lifetime with the man she loves. Becoming a wife. A mother. Staying in one place, instead of dragging Frankie from post to post, forcing him to take a backseat while she ascends the ranks. Suddenly, Annie has a life-changing decision to make. Can she disappoint her loved ones by walking away from the only career she’s ever wanted?Annie’s hoping her upcoming cruise with Frankie will give her the space and perspective she needs to decide. But when a thrilling vacation adventure goes wrong, her fiancé proves yet again why they make the perfect team…and why love is always the only choice.(You’ve all been asking for Annie’s story forever…and here it is! Some have suggested this story should be called Rescuing Frankie…but no matter how accomplished we are, no matter how smart or tough or strong…we all need someone to have our backs, to rescue us when we need it most. Annie is no different. Enjoy!)**Rescuing Annie is a full length book in the Delta Force Heroes Series. Each book is a stand-alone, with no cliffhanger endings.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Romantic Suspense",
    "Suspense",
    "Military Romance",
    "Contemporary",
    "Family"
  ],
  "author": "Susan Stoker",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/57008952-rescuing-annie"
}