{
  "title": "Say Their Names: How Black Lives Came to Matter in America",
  "description": "This definitive guide to America's present-day racial reckoning examines the forces that pushed our unjust system to its breaking point after the death of George Floyd. For many, the story of the weeks of protests in the summer of 2020 began with the horrific nine minutes and twenty-nine seconds when Police Officer Derek Chauvin killed George Floyd on camera, and it ended with the sweeping federal, state, and intrapersonal changes that followed. It is a simple story, wherein white America finally witnessed enough brutality to move their collective consciousness. The only problem is that it isn't true. George Floyd was not the first Black man to be killed by police—he wasn’t even the first to inspire nation-wide protests—yet his death came at a time when America was already at a tipping point. In Say Their Names , five seasoned journalists probe this critical shift. With a piercing examination of how inequality has been propagated throughout history, from Black imprisonment and the Convict Leasing program to long-standing predatory medical practices to over-policing, the authors highlight the disparities that have long characterized the dangers of being Black in America. They examine the many moderate attempts to counteract these inequalities, from the modern Civil Rights movement to Ferguson, and how the killings of George Floyd, Breonna Taylor and others pushed compliance with an unjust system to its breaking point. Finally, they outline the momentous changes that have resulted from this movement, while at the same time proposing necessary next steps to move forward. With a combination of penetrating, focused journalism and affecting personal insight, the authors bring together their collective years of reporting, creating a cohesive and comprehensive understanding of racial inequality in America.",
  "genres": [
    "Nonfiction",
    "Race",
    "History",
    "Politics",
    "Social Justice",
    "American History"
  ],
  "author": "Curtis Bunn",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/57007964-say-their-names"
}