{
  "title": "Tales of the Enchanted Wildwood: Tales 1-6",
  "description": "This collector's edition includes six stand-alone adult fairy tales blending fantasy action-adventure with steamy fantasy romance.Tales of the Enchanted Forest is a collection of six fantasy romance short stories. The series is inspired by fairy tales with a hint of Celtic Mythology and a nod to the TV show, Once. However, you won’t find your traditional damsels in distress. The women you’ll meet in these tales take the future into their own hands, regardless of the challenges. They also have magic. Some of it beautiful, like the magic of the healer, but others have dark magic which torments them as they seek a release.Throughout the pages you’ll enjoy hints of the magical wildwood, seasonal festivals and sexy men, some dark, evil knights, and some just seeking to bring justice to the world. These stories can be read in a couple of hours and each one features a different, interracial couple. While the tales can be read in any order, you’ll find threads of an underlying story as you read on.In Queen of the Wildwood, Yula, a mage with dark magic, loses her temper and makes a fatal mistake. Guided by a handsome knight, she travels into the wildwood to seek help from the evil queen.Curse of the Healer is a Christmas-themed story about a healer who lost her magic. When she’s captured by dark creatures of the forest, she’s forced to discover the source of her curse. Lord of the Castle is a dark Beauty and the Beast retelling with familiar whispers of the story and a beastly twist. When a shield maiden is sent to protect an exiled lord, she discovers his sinister secret and must choose between life or death. InHeart of the Raven, Sasha (a noble woman on the run from an arranged marriage) is determined to discover the secrets to her magic. But when she’s attacked on the road, she escapes into the enchanted wildwood where she must enlist the help of a dark knight if she wishes to survive.In Secrets of the Lore Keepers, Rae is allured by an elven prince, only to discover the creatures of the wildwood are coming to attack her land and raise the buried goddess. Rae must use her wits and magic to save her land and the prince.In Bride of the King, Nesrin is tried of being abused by her step-mother. Using forbidden magic, she casts three wishes. But just when Nesrin is enjoying her new life, the consequences of using forbidden magic catch up with her.Enjoy your adventures in the enchanted wildwood, and beware, lest your heart is stolen.What others are saying about Tales of the Enchanted Wildwood★★★★★ “A very short read that both disturbs and leaves you wanting to know more about this world. It is a character driven story in a richly imagined world.” - Amazon Review★★★★★ “I was riveted to the story and found it dark, yet enchanting and would dearly love to read further into the story of Yula and Aelbrin, my only complaint being that this was such a short story as I did not want it to end.” - Amazon Review★★★★★ “Ford has packed an incredible amount of world-building into 60-odd pages without compromising that fairy tale pace. I definitely want to read more of this world!” - Amazon Review★★★★★ “It had fantasy, magic and just the right amount of steaminess.",
  "genres": [
    "Anthologies"
  ],
  "author": "Angela J. Ford",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/56997074-tales-of-the-enchanted-wildwood"
}