{
  "title": "Chicago Blaze Books 1-2: Anton / Luca",
  "description": "Because the only thing better than one hot hockey romance is two, the first two books in the Chicago Blaze hockey romance series , Anton and Luca, are bundled together in this collection.\nBook 1 - Anton\nHe’s known as Father Anton to his teammates—the brooding, sexy captain of the NHL’s Chicago Blaze has a reputation for…not having a reputation. Just like his diet and sleep routines, celibacy is part of Anton Petrov’s on-ice mojo. Or so they say. Anton stays mum on the subject. If the world thinks he chooses to abstain from sex, so be it. Better that than the truth getting out: there is a woman he burns for, but he can never have her. She’s his teammate’s wife, after all.Mia Marceau is finally on her own. Now that she and her husband are living apart, she’s finding the peace she was desperate for. She spends her days in classes and late nights bartending, making her own way in the world at last. After what she’s been through, as long as her husband leaves her alone, she doesn’t plan to rock the boat. He still has the power to hurt those dearest to her, and she can’t demand a divorce with such a high cost.A chance encounter with Mia has Anton hoping for a shot he never thought he’d get. And while she’s drawn to the intense, serious hockey center, Mia’s leery about playing with fire. That’s all Anton has ever known for Mia, though—a living, burning desire that won’t be denied—no matter the cost.\nBook 2 - Luca\nAbbyI only have one love now—the home furnishings business I’m building into an empire. Maybe money and success can’t love me back, but they keep what’s left of my heart safe. One-night stands are my way of scratching the occasional itch I get for something more. And no one’s better for that than a sexy as sin hockey player I’ll never see again after one very hot night together.LucaI used to love two things: hockey and women. But now my nieces and nephew are my top priority, because I’m raising them after tragedy stole their parents. Somehow I balance single parenthood and my career as a forward for the Chicago Blaze. There’s no time for women, until I get knocked on my ass by Abby Daniels. She’s everything I’ve ever wanted, but her devastating past may end us before we even get started.Read the entire Chicago Blaze series:ANTONLUCAVICTORKNOXALEXEIEASYJONAHKITOLIVIER",
  "genres": [],
  "author": "Brenda Rothert",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/57010331-chicago-blaze-books-1-2"
}