{
  "title": "Racial Innocence: Performing American Childhood from Slavery to Civil Rights",
  "description": "Beginning in the mid-19th century in America, childhood became synonymous with innocence—a reversal of the previously-dominant Calvinist belief that children were depraved, sinful creatures. As the idea of childhood innocence took hold, it became racialized: popular culture constructed white children as innocent and vulnerable while excluding black youth from these qualities. Actors, writers, and visual artists then began pairing white children with African American adults and children, thus transferring the quality of innocence to a variety of racial-political projects—a dynamic that Robin Bernstein calls “racial innocence.” This phenomenon informed racial formation from the mid-19th century through the early 20th century.Racial Innocence takes up a rich archive including books, toys, theatrical props, and domestic knickknacks which Bernstein analyzes as “scriptive things” that invite or prompt historically located practices while allowing for resistance and social improvisation. Integrating performance studies with literary and visual analysis, Bernstein offers singular readings of theatrical productions, from blackface minstrelsy to Uncle Tom’s Cabin to The Wonderful Wizard of Oz; literary works by Joel Chandler Harris, Harriet Wilson, and Frances Hodgson Burnett; material culture including Topsy pincushions, Uncle Tom and Little Eva handkerchiefs, and Raggedy Ann dolls; and visual texts ranging from fine portraiture to advertisements for lard substitute. Throughout, Bernstein shows how “innocence” gradually became the exclusive province of white children—until the Civil Rights Movement succeeded not only in legally desegregating public spaces, but in culturally desegregating the concept of childhood itself.Writing in Children’s Literature, Philip Nel notes that Racial Innocence is “one of those rare books that shifts the paradigm—a book that, in years to come, will be recognized as a landmark in children’s literature and childhood studies.” In the journal Cultural Studies, reviewer Aaron C. Thomas says that Bernstein’s “theory of the scriptive thing asks us to see children as active participants in culture, and, in fact, as expert agents of the culture of childhood into which they have been interpellated. In this way, Bernstein is able not only to describe the effects of 19th-century radicalization on 21st century US culture, but also to illuminate the radicalized residues of our own childhoods in our everyday adult lives.” Racial Innocence was awarded the 2012 Outstanding Book Award from the Association for Theatre in Higher Education, and the award committee noted that the book “is a historiographic tour de force that traces a genealogy of the invention of the innocent (white) child and its racialized roots in 19th and 20th century U.S. popular culture.”",
  "genres": [
    "Race",
    "History",
    "Nonfiction",
    "Cultural Studies",
    "American History",
    "Academic",
    "19th Century"
  ],
  "author": "Robin Bernstein",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/12730563-racial-innocence"
}