{
  "title": "The Angel of the Revolution: A Tale of the Coming Terror",
  "description": "* Illustrated(This title belongs to the STEAMPUNK ADVENTURES series. The STEAMPUNK ADVENTURES comprise an illustrated selection of classic Victorian speculative fiction, with each title being chosen for its quality, modern appeal and resonance with the steampunk movement of retro-futurism.)THE GREATEST AIRSHIP warfare novel of all time ushers in the STEAMPUNK ADVENTURES series ... George Chetwynd Griffith’s THE ANGEL OF THE REVOLUTION, A TALE OF THE COMING TERROR. Written in the prophetic technological vein of Jules Verne and H.G. Wells, Griffith’s epic masterpiece tells the story of a Great War which never was. Airship squadrons and steam fleets clash over the world’s great kingdoms, leaving panic and devastation in their wake. Griffith’s tale is romantic, compelling, evocative and surprisingly graphic in its depictions of human valor, brought under siege by the soul-crushing horrors of war. What is the secret of the mysterious dark “Angel,” Natasha? Can anyone stop the tyrannical ethernauts who pilot the stately war machines? Will the British Empire crumble and fall prey to the anarchists of the air?Enriching and supplementing Wonderland Imprints’ well-received series of classic Illustrated Master Editions, the STEAMPUNK ADVENTURES series is devoted to reviving the very finest forgotten rarities which were originally published during the golden age of technology. The series explores the origins of retro-futurist elements, such as airships, mechanical men, goggled gentlemen of war, sophisticated adventuresses, gadgetry and weaponry, and global cataclysm. These are the tales of the Age of Steam, the lore of the ornate technology which reigned in a golden future that never was. Above all, this series is focused on telling great Victorian stories you’ve probably never heard of!Episode 1, THE ANGEL OF THE REVOLUTION, is an epic novel. This edition features all of the classic illustrations, an active table of contents, 49 chapters, 144,000 words and 370 pages of swashbuckling aerial adventure. Come aboard, and sail the crimson skies of war!",
  "genres": [
    "Science Fiction",
    "Steampunk",
    "Fiction",
    "Fantasy",
    "Victorian",
    "Adventure",
    "Classics"
  ],
  "author": "George Chetwynd Griffith",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/12730523-the-angel-of-the-revolution"
}