{
  "title": "The Other Significant Others: Reimagining Life with Friendship at the Center",
  "description": "Why do we place romantic partnership on a pedestal? What do we lose when we expect one person to meet all our needs? And what can we learn about commitment, love, and family from people who put deep friendship at the center of their lives?In The Other Significant Others, NPR's Rhaina Cohen invites us into the lives of people who have defied convention by choosing a friend as a life partner. Their riveting stories unsettle widespread assumptions about relationships, including the idea that sex is a defining feature of partnership and that people who raise kids together should be in a romantic relationship. Platonic partners from different walks of life—spanning age and religion, gender and sexuality and more—reveal the freedom and challenges of embracing a relationship model that society doesn't recognize. And they show that orienting your world around friends isn't just the stuff of daydreams and episodes of The Golden Girls, but possible in real life.Based on years of original reporting and drawing on striking social science research, Cohen argues that we make romantic relationships more fragile by expecting too much of them, while we undermine friendships by expecting too little of them. She traces how, throughout history, our society hasn’t always fixated on marriage as the greatest source of meaning, or even love. At a time when many Americans are spending large stretches of their lives single, widowed or divorced, or feeling the effects of the \"loneliness epidemic,\" Cohen makes the case that one model of a flourishing adulthood—lifelong romantic partnership—isn't enough. A rousing and incisive book, The Other Significant Others challenges us to ask what we want from our relationships—not just what we’re supposed to want—and transforms how we define a fulfilling life.",
  "genres": [
    "Nonfiction",
    "Relationships",
    "Friendship",
    "Self Help",
    "Audiobook",
    "Psychology",
    "Sociology"
  ],
  "author": "Rhaina Cohen",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/127305688-the-other-significant-others"
}