{
  "title": "First Strike",
  "description": "Nuclear war may kill millions.Nuclear Winter will kill billions.International bestselling author, Bobby Akart, one of America's favorite storytellers, delivers up-all-night thrillers to readers in 245 countries and territories worldwide.Every war begins with a first shot. The shot heard 'round the world at Lexington and Concord in 1775 birthed a nation. Less than a century later, cannons firing on Fort Sumter, South Carolina thrust that same nation into a civil war. The assassination of an obscure archduke sparked a chain of events leading to World War I. The dastardly bombing of Pearl Harbor led America into the Second World War.Akart's new novel, Nuclear Winter First Strike, depicts a world on the edge of nuclear Armageddon. Will history repeat itself as warring nations take their battles to the highest level of destruction? Can America avoid being drawn into these conflicts beyond her borders?Nuclear Armageddon hangs over us like a mighty sword and ordinary Americans will be caught in the crosshairs.This is more than the story of nuclear conflict. It's about the devastating effects wrought by Nuclear Winter. Our possible future is seen through the eyes of the Albright family whose roots stretch back to the early settlement of the Florida Keys.Hank Albright, a widower and proprietor of the Driftwood Key Inn, is the epitome of the laid-back islander inhabiting the Keys. His brother, Mike, is a homicide detective for the Monroe County Sheriff's department. Along with his wife Jessica, a paramedic and member of the Sheriff's department water emergency team, they become involved in the investigation of a sadistic serial killer.Hank's son, Peter Albright, is a Washington, DC reporter covering the State Department. He's unknowingly thrust into the middle of the conflict in the Middle East. Upon his return home, he begins to unravel a conspiracy leading to an unexpected dynamic between the President, the Secretary of State, and North Korea.As the drumbeats of war beat louder, Hank's oldest child, Lacey McDowell, begins to sense the warning signs. Along with her husband, Owen, and teenage son, Tucker, she begins to prepare for a hasty exit from their San Francisco Bay Area home.Will America become embroiled in the nuclear conflict? Will the President cross the Rubicon, that point of no return after which lives and cities may be destroyed? For the Albrights, like their fellow Americans, their lives are about to change forever.It was not our fight, but it became our problem.",
  "genres": [
    "Fiction",
    "Thriller",
    "Audiobook",
    "Post Apocalyptic",
    "Survival"
  ],
  "author": "Bobby Akart",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/57020618-first-strike"
}