{
  "title": "Accidentally Divine",
  "description": "Heaven ain’t missin’ this angel…At a fateful New Year’s Eve party, Georgina Maverick, a little bit drunk, a lot mired in guilt from her tortured past, trips and falls off a rooftop, tumbling ten stories to her almost death.Little does George know, her friend and co-worker, Dexter Bridger, the man she discovers also happens to be her guardian angel, is on the case. He saves her from landing toe up in the mortuary, but he opens an entire can of worms when he nicks her shoulder and turns George into an angel, too.With the help of the OOPS ladies and some divine intervention from Dex, George is learning how to be a guardian angel in the hope she can earn her permanent wings. But it ain’t easy when your newbie wings are strap-on (you read that right), and your angelic glow nearly fries the eyeballs right out of the head of your new cranky, vampire friend.But worse? All the secrets that haunt both George and Dex are coming home to roost.For instance, how did Dex become a guardian angel anyway, and why doesn’t he have his permanent wings after all this time? And for the love of all that’s good looking, why is he so stupid cute? How can a girl focus on getting it together with that kind of distraction?Yet for George, the questions cut far deeper. Why is it so hard to overcome her brutal past and find the thing she’s always wanted—peace of mind and acceptance? And how the heck is she supposed to be someone’s guardian angel and guide them to emotional safety when her own life is such a wreck?Worst of all? Who’s been lurking in the shadows trying to steal George’s wings? Because if someone gets their hands on her wings, guess what?She loses her soul.Forever…",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Audiobook",
    "Paranormal Romance",
    "Romance",
    "Mystery",
    "Cozy Mystery"
  ],
  "author": "Dakota Cassidy",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/57025954-accidentally-divine"
}