{
  "title": "Can the Monster Speak? A Report to an Academy of Psychoanalysts",
  "description": "In November 2019, Paul B. Preciado was invited to speak in front of 3,500 psychoanalysts at the École de la Cause Freudienne’s annual conference in Paris. Standing up in front of the profession for whom he is a ‘mentally ill person’ suffering from ‘gender dysphoria’, Preciado draws inspiration in his lecture from Kafka’s ‘Report to an Academy’, in which a monkey tells an assembly of scientists that human subjectivity is a cage comparable to one made of metal bars.Speaking from his own ‘mutant’ cage, Preciado does not so much criticize the homophobia and transphobia of the founding fathers of psychoanalysis as demonstrate the discipline’s complicity with the ideology of sexual differencedating back to the colonial era, an ideology which is today rendered obsolete by technological advances allowing us to alter our bodies and procreate differently. Further, Preciado calls for a radical transformation of psychological andpsychoanalytic discourse and practices, arguing for a new epistemology capable of allowing for a multiplicity of living bodies without reducing the body to its sole heterosexual reproductive capability, and without legitimizing heteropatriarchal and colonial violence.Causing a veritable outcry among the assembly, Preciado was heckled and booed and unable to finish. The lecture, filmed on smartphones, ended up published online, where fragments were transcribed, translated and published with noregard for exactitude. Eighteen months on, Can the Monster Speak? Report to an Academy of Psychoanalysts is published in a definitive translation for the first time.",
  "genres": [
    "Nonfiction",
    "Queer",
    "LGBT",
    "Philosophy",
    "Psychology",
    "Psychoanalysis",
    "Essays"
  ],
  "author": "Paul B. Preciado",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/57030264-can-the-monster-speak-a-report-to-an-academy-of-psychoanalysts"
}