{
  "title": "The River People",
  "description": "River-Song's father, Chief Sits-and-Thinks, is growing old and sick, but he trusts in her to lead their people as they face changes. Her best friend has become her rival as they compete to marry the big chief's son. But as River-Song proves herself to him, she begins to see he isn't the man she thought. Then she must use her gift of words when a wandering band of braves seek a new home with them. They speak her mother's language so she can understand them. River-Song feels pulled to their leader but confused about her place in the tribe. Can this young girl hold her tribe together as the new braves join them, and again when hostile warriors attack their valley? Come visit the River People in the Pacific Northwest before fur traders or missionaries arrived. River-Song lives in a valley of meandering streams that give them salmon and trout to eat. Oak trees abound in the valley, and a forest of cedar and fir surround them, making a canopy and giving them planks for their long houses, canoes, and totem poles. Visit the author's new website at www.writerkristenjames.com. Interact at www.facebook.com/TheRiverPeople. An excerpt from this novel placed in the 78th Annual Writer's Digest Writing Competition, as a short story titled \"Salmon and Summer A Way of Life.\" The Klamath Falls Herald and News says, \"A nicely told tale that discusses American Indians from a different perspective. It combines history with romance, with a hint of early women's liberation, and a larger dose of Indian culture.\" Recommended by teachers, this classical story makes for great historical reading for fourth graders and up. Douglas County News said, “The characters are well developed; the reader cares about them and what’s going to happen next. River-Song is a complex person, as all 15 year olds are. However, in her culture, she is no longer considered a child and one day will become the leader of her village. During this critical summer, she leaves the last trace of childhood firmly behind and gains a maturity that stands her in good stead as she faces many challenges, both within herself and from the outside. What direction should she lead her people? How will she meet the threat to her happiness and to her people as a whole? The answers are cleverly woven into a good read.” Bonus In The Land of Huckleberries and Wokas. Young Snow Bird is taken from her people in a raid and forced to leave her marshes and people behind. A young brave in the raiding party offers help but he cannot help all of the women in children. She must decide if she can leave them and search for help. The stories weren’t just stores, after all. Snow Bird had listened all through her childhood to scary tales of braves raiding camps and taking slaves, but she had never truly feared such a thing happening. When others told her these stories, her father patted her head and smiled, reassuring her that the elders used stories to keep the children close to camp. Yet now she sat with her hands bound in front of her while her captors drank from the river. They had rushed into camp and attacked those around the dinner fire. With knives tied to their wrists and clubs to swing, they had hit and stunned the adults in a confusing blink of the eye.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Kristen James",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/5702875-the-river-people"
}