{
  "title": "Frantastic Stories - Short Stories in English and Spanish",
  "description": "Frantastic Stories is a collection of short stories about travel and life, written by Robin Who. Wander and wonder through the lives of two characters: the adventure-loving Jane and the freedom-seeker Henrietta. This bilingual book, in English and Spanish, has been created for passionate explorers and intrepid curious minds; those who want to discover and see what this great planet has to offer us. Frantastic Stories is the perfect way to immerse yourself into another world and unwind - where fiction meets reality.***From the author:\"I hope the stories we share make you smile. Inspire you. Make you feel empowered. Make you want to wander. Make you wonder about life, the good and the bad. Make you go on a journey -whatever and wherever that is. A journey of change or growth. A journey to explore the beautiful places hidden around our planet; the beautiful people that can overtake the shadow created by those that make us \"lose faith in humanity\".Life is about the journeys we take It is about the mindset we want to have and create to go through our journeys. It is about learning and listening. It is about deciding to speak up when the fire builds within us. There is so much in this one life we have, that we can discover and pursuit. Any journey is important.Why in English and Spanish? I find languages bring new worlds to our journeys. They are more than just words. Languages are culture, history, values, and...relationships. Languages help you grow because you learn how to connect with others on a different level. A book that can be read by different nationalities is how I wanted my first book to be. Hopefully, it can help to learn or create a first step towards learning one of these languages and the beauty of it. I am thrilled to share Frantastic Stories with you because I hope each one of them brings you a step further in YOUR journey.\"Yours,Robin Who",
  "genres": [],
  "author": "Robin Who",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/57031763-frantastic-stories---short-stories-in-english-and-spanish"
}