{
  "title": "Stolen by the Wolves",
  "description": "Once the wolves of Dublin take control, who knows what they plan to do with us?They are savages. And we are at their mercy.It is the year 870. Hordes of Vikings sweep through the green lands of Northumbria and Ireland, raiding and pillaging. Soon, no kingdom will be safe from their bloodlust.Tamsin has always been safe behind the walls of her sanctuary. Safe enough to yearn for a glimpse of the world beyond. But with the Viking threat looming, even her secretive kingdom must open its gates to invite allies.And she gets far more than a glimpse.The three lords of Dublin are on the hunt for women of her kind. Thrain Mordsson, youngest of the three and bent on a personal vendetta, doesn’t take much stock in the ancient prophecies. He marches into battle for the glory rather than the spoils.Until he finds himself standing right in front of a fiery-haired princess. And the touch of her hand wakes an ancient magic in them both, one that neither could’ve anticipated.The wolves plan to besiege her sanctuary and steal her fabled kinswomen for themselves. But the legends state that to harm these women would anger the gods. And now that Thrain has earned Tamsin’s trust, now that he has tasted her in the darkness of her godhouse, his loyalties begin to splinter.All he knows is that he must protect her from the coming storm at any cost.This is the first tome of Thrain & Tamsin’s story. In this new omegaverse series, kingdoms break apart and ancient magic is rediscovered. If you like your romance with a plotty medieval backdrop like Kushiel’s Dart or Game of Thrones, you’ll love this series. STOLEN BY THE WOLVES is a fantasy non-shifter omegaverse romance that is based loosely on real historical events. It is the first of a 6-book series, slow-burn with eventual Reverse Harem romance. This novel contains some non-consensual situations, though they are not between the hero & heroine. The Viking Alphas revere their Omegas, and while they live in a cruel and unforgiving world, they do their utmost to keep their Omegas from harm.",
  "genres": [
    "Omegaverse",
    "Fantasy",
    "Romance",
    "Reverse Harem",
    "Historical",
    "Fantasy Romance",
    "Historical Romance"
  ],
  "author": "Lyx Robinson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/57046173-stolen-by-the-wolves"
}